{
  "video_id": "-2WMNWZ5V-U",
  "url": "https://www.youtube.com/watch?v=-2WMNWZ5V-U",
  "title": "6/24/2025 Democratic Press Conference on Reproductive Healthcare",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 10,
  "summary": "Here is a summary of the Georgia 6/24/2025 Democratic Press Conference on Reproductive Healthcare session:\n\n**Overview**\nThe session featured powerful testimony from Georgia women on the impacts of the state's restrictive abortion laws, particularly HB 481. However, the notable absence of the state Attorney General, who was invited but declined to attend, left many questions unanswered about the interpretation and implementation of these laws.\n\n**Key Actions**\n- **HB 481**: Georgia's \"heartbeat bill\" that bans most abortions after 6 weeks of pregnancy\n\n**Bills Introduced (First Reading)**\nNone mentioned\n\n**Notable Moments**\n- Testimony from Georgia women describing how the abortion restrictions have negatively impacted their lives and health\n- Criticism of the Attorney General for declining to attend and address questions about the laws\n- Calls for the state to prioritize the needs of women and families over politics\n\n**Votes**\nNone detected\n\n**Attendance**\nNo quorum notes provided\n\n**Adjournment**\nThe session ended without a specific next meeting date mentioned.",
  "transcript": "We want to thank everybody for coming out today, especially the person who actually came\nand spoke to the Urban Affairs Committee, want to thank our Urban Affairs Chair who did\na remarkable job of putting this together.\nThank everybody, as I said, who actually came out and spoke, very powerful testimony.\nI think that's the key, very, very powerful testimony.\nOne of the things I mentioned just a few minutes ago and I repeated here because I think\nit's worth repeating.\nAnd that is that hopefully the people of Georgia was able to see what real legislation is.\nAs I said, no one was rushed, no one was told they only have one minute or two minutes\nor hurry up, we're on a time schedule.\nAnd that happens because you don't care about what happens to Georgia's.\nBut when you do care about what happens to Georgia's, you find out what it took place\ntoday.\nToday was the model, how we actually should be governing.\nAnd that is when you care about Georgia's, when you care about families and you care\nabout women, you actually sit and listen and you ask good questions and you try to drill\ndown and find out what actually is going on and how legislation will impact people's\nlives.\nBecause that's what we do.\nWe impact people's lives.\nAnd HB481 has impacted the lives of the women of this state, has impacted the lives\nof families of this state.\nAs one of our speaker said, women in Georgia live in an air of criminality because of HB\n41 and that is beyond unfortunate.\nIt is a travesty that women in our state\nwould live in an air criminality\nwhen we talk about their reproductive choices.\nAnd so with that backdrop,\nyou would think that our attorney general\nwould want to be here today and say,\nno, it's not an air criminality\nbecause this is what the law really sets.\nAnd this is how we're going to interpret this particular law.\nBut he wasn't here, chose not to show up.\nWhich is typical, as I said before,\nfor people who do not care about what Georgians actually think.\nAnd this bill, this law, not only has impact on reproductive choices,\nbut also has impact on other women's health issues.\nWe also learned today that maternal health rates in Georgia are terrible,\nespecially for African-American women,\nwhere they actually many times lead the nation or come close to leading the nation\nin death as far as being maternal health.\nThose things are not acceptable.\nWe cannot continue to do business as usual.\nAnd that's what this hearing was about today.\nIt was a fact-finding mission on some level,\nbut it also was a mission to let the people of Georgia know\nthat we care and we hear what you have to say.\nAnd the person who actually put this together\nand insisted that we do this,\nand she didn't have to insist hard\nbecause we're always there for the people of Georgia,\nbut that's our cheer, Don Zella James,\nand I have her come up and speak.\nThank you.\nI'm in slow motion, not on purpose, so one sec.\nThank you very much for coming today, and I'm here to discuss the testimony we've just\nhurt upstairs during our urban affairs hearing. We heard about all the ways that this cruel\nsix-week abortion ban has hurt Georgia women and how too many families have watched loved\nones die for no good reason, all because of this vague and cruel abortion band.\nI just mentioned that many people came and gave their testimonies.\nMany people watched us on Zoom and they have put comments that I will read later and share\nwith all of you.\nThe absence of the number one person who could have truly answered a lot of our questions\nand gave clarity to this was invited and that's our Attorney General Chris Carr.\nHe was invited and he declined and then we asked for someone to come and speak on his\nbehalf and he declined that as well.\nSo I asked the Attorney General to just join us for this conversation following the lead\nof my colleague, Senator Nabila Islam Part, who has been fighting this issue for more\nthan a year.\nI wanted our AG to answer questions of women across Georgia and what they're asking because\nwe have one opinion from the person that authored this bill.\nThen the governor says something else, and then the AG says something else.\nSo I wanted him to come and just clarify for us what this does.\nAnd also we invited women who have been adversely affected by this law, this ban, to come.\nAnd they shared with us, I'm still in tears listening to them this morning.\nSo what are our rights?\nWhat health care may we receive?\nNobody has answered this.\nThey didn't even answer Senator Partt,\nwhen they just refused to answer us, I guess,\nbecause we had no answer.\nI don't know where the Attorney General is today,\nbut I know that he's listening to this testimony.\nHe's not hearing about the havoc this abortion man causes.\nHe's not listening to the stories of women\nwho have had to suffer under this law.\nHe's not hearing the stories of mothers who lost daughters\nunnecessarily because of this law.\nOh my, some things are important to others.\nimportant to others, that's more important than life itself.\nI imagine being one of these women, your baby is at risk unlikely to live.\nAnd now you must wish your own life too.\nDoctors won't treat you because they are afraid that they might go to jail.\nThey don't understand exactly what is going on.\nAnd you can't afford to travel to another state,\nor another place to get the care you need.\nAll you can do is pray that God shows you mercy\nand spares your life.\nThat's what this law does.\nIt causes women to die unnecessarily, unnecessary deaths.\nFrom treatable causes, wanting to bring a new life\ninto the world should be the greatest thing that happens.\nAnd it should not mean you may die because\nRepublican politicians decided it must be so.\nPregnancy should not mean that you cannot access\nthe medical care that you need to save your life.\nSo Attorney General Carr isn't here\nto explain to us, but I am here.\nAnd I am a woman who, at one time in my life, lost the child.\nOh my, I stayed in the hospital three days.\nThey can't even get any care now.\nThis is unacceptable.\nSo thank you for coming today.\nIf you have any questions, me and our leader,\nour minority leader will answer them at this time.\nAgain, thank you.\nAny questions?\nAny questions?\nWith that, we want to thank you for coming.\nMadam, are you any of the last words?\nI just want to thank all of the women\nwho were brave enough to come today\nand give us their testimonies.\nAnd the experts who came and talked to us,\nthe people in DC who were on the Zoom line with us\nwho also shared the national organization of women\nwho shared the other experts as well.\nAnd House Pember Parks and others.\nThank you all so to our committee, yes, go ahead.\nIf it's not changed, it'll be more of the same.\nWe hope that we can come together\nand really serve the people's needs\nand not the politics.\nSo we hope that somehow we can change this.\nBut if we don't, I see no changes.\nIt might even get a whole lot worse,\nand that's what we're trying to stop today.\nI would concur with that and say that,\nobviously, women are now living in an air criminality\nor fear, imagine the fear that have now,\nknowing that this was put together.\nKnowing we asked our attorney general to come here today\nactually answer these particular questions. Not in a combative way. This is a\nfact-finding day quite frankly, but now that they know that, he did not think\nenough to come in and actually come and tell us about this particular law, I\nwould think that that fear is only going to increase quite frankly.\nThank you so much for coming. Thank you.\n",
  "updated_at": "2026-02-12T18:48:16.415365+00:00"
}