{
  "video_id": "-cd0wEW308w",
  "url": "https://youtu.be/-cd0wEW308w?t=1207",
  "title": "Georgia House - Day 23 (2026-03-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 23,
  "video_date": "2026-03-03",
  "duration_minutes": 176,
  "summary": "Here is a summary of the key points from the Georgia House session transcript on 2026-03-03:\n\n**Overview**\nThis session focused on several bills related to traffic offenses, including increased penalties for fleeing or eluding law enforcement. There was some debate around whether these harsher penalties would be an effective deterrent.\n\n**Key Actions**\n- **HB 1216**: Amends the Georgia code to increase penalties for fleeing or attempting to elude law enforcement officers, including making certain related offenses (causing damage to another vehicle, driving on a sidewalk, etc.) felonies.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Representative McDonald presented HB 1216, arguing it would reinforce the state's commitment to public safety.\n- Representative Tyler Paul Smith and Representative Mayner asked questions challenging whether the increased penalties were appropriate.\n- Representative McLaren expressed concerns that the bill could increase fear of police and provide more incentive to flee.\n\n**Votes**\nThe House voted unanimously to adopt the committee substitute for HB 1216 and agree to the committee's favorable report on the bill.\n\n**Attendance**\nNo explicit notes on quorum.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session would be.",
  "transcript": "Notice here, I have an apetite plate for a salad for a Walmart sandwich for me in Newtown and New York how they serve here\"; the same referred to extra grocerybearers, toys for management people, workers' towels and vanishes which you can buy from Jennifer Laszela most often you buy in Newtown in Newtown for fried rolls shops and a shows Thank you. I have a question. I have a question. I have a question. I have a question. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Clark, I'll read the caption to a group of privileged resolutions. Congratulations and commending, Yelanda Lettich, for receiving the 2022 Yellow Rose Nikki-T Randall Servant and Leader Award. Recognizing Dr. Kim McNair for 30 years of dedication and education, and power women to make decisions for themselves and take control of their lives. Congratulations and commending, Keisha Jones, for receiving the 2022 Yellow Rose Nikki-T Randall Servant and Leader Award. Recognizing commending, Nora Jean Martin commending and congratulating Linda Parker, recognizing commending, Judge Mary Jo Buxen on her outstanding public service, recognizing commending. Joseph, citizen Joe Sawyer on his outstanding public service, organizing and commending, Philip Ventameglia, the Technology Association of Georgia 2022 Public Tech Leader of the Year. And congratulating commending, Allison J. Schumake Reynolds for receiving the 2022 Yellow Rose Nikki-T Randall Servant Leader Award. And for other purposes, that completes the reading with privileged resolutions. Is there any objection to adopting the privileged resolutions? Chair, here's none in the resolutions are adopted. All right, we're going back to the rules calendar. Back to the rules calendar. We had a couple of measures left on the first debate calendar today. Clerk will read the caption to House Bill 1216. House Bill 1216, members of the McDonald to be entitled to amend Article 15, type 6, the Title 40, the fiscal to Georgia, Antietta, related serious traffic offenses. Those are provided for enhanced penalties for a lot of violations of fleeing or attempting to allude to police officers. It's Bill Evans for the Committee on Public Safety and Homeland Security. That committee recommends the disbilled do pass by committee substitute. Chair recognizes Representative McDonald to present the bill. Oh, sorry, thank you. Mr. Speaker, ladies and gentlemen, the House, I hope everybody had a great lunch and it's kind of nodding off and taking a little nap right now. But today I bring you to the Department of Public Safety, supported legislation, House Bill 1216, LC393269S. This bill increases the punishment for offenders who decide to flee in a vehicle from law enforcement officers. This bill will reinforce how seriously the state of Georgia takes the reckless, dangerous and deadly behavior. As a listen to Governor Kemp yesterday in Liberty Plaza, he and the First Lady will continue their commitment to all of our citizens to make sure that we live in a safe Georgia. This bill makes Governor Kemp's commitment even stronger. Again, Code Section 40-6395 is only relevant to a crime using a vehicle. Under current Georgia law, fleeing and alluding law enforcement officers is an aggravated misdemeanor unless the offender commits certain other offenses while fleeing and alluding, in which case it's a felony. House Bill 1216 increases the penalties for the first, second and third offense of fleeing and alluding and makes a fourth or subsequent offense a felony. Current law provides that if an offender commits certain other offenses while they're fleeing and alluding, they are guilty of a felony. HB 1216 adds the following to that list of offenses, causing the acts of another vehicle, driving on a sidewalk, overtaking a stop-school bus while it signals out, lane drags, reckless driving and reckless stunt driving. Under current Georgia law, the Code Section being discussed here only allows for a DUI where an offender was under the influence of an alcohol with a BAC of 0.08 or greater to be elevated to a felony if the offender was fleeing and alluding while under that influence. House Bill 1216 now will include all forms of DUI which includes any use of drugs or alcohol as a felony offense when fleeing and alluding. HB 1216 makes a small change include the use of blue lights as an action which can constitute the unlawful impersonation of law enforcement officers. You have several questions, do you? Yes sir. Chair recognizes Representative Tyler Paul Smith to your right for a question. What is the gentleman yield for a question? Unfortunately yes sir. Is it not true that this encompasses four offenses that taken by themselves are misdemeanors? One more time sir. What is the five statute cited here aren't those all misdemeanor offenses? The first three that the five that are the new ones? Yes they are unless you're alluding police officer. Now they will be immediate felony. Well the gentleman further yield for one more question. Yes sir. Is it not true that you have done much better at presenting this bill than you did play in poll last night? Yes sir I did. Do you further yield? Yes sir. Chair recognizes Representative Mayner to your right for a question. Thank you Mr. Speaker. I just have a question on lines 21. You mentioned earlier that this was going to be a harsher bill but it says before it was any person violating the provisions now it says convicted. The way I'm reading this is seems like this is easier for people versus harder for people. What it does in that area is if you look at lines 25 through about 47 you'll see the increase in fines of not only the fine but the time that they will have to serve in jail.\n\nAre you? You want to ask a question again? Okay. Recognize representative Maynard for a question. Do you further yield? Yes, ma'am. And so just to clarify before with this bill, you did not have to be convicted, but now you do have to be convicted. Yes, you'll have to have the conviction to elevate, that will elevate these fines. Yes, ma'am. Thank you. Mr. Speaker, there are no other questions. I'm going to yield the well request the body is favourable. Consideration on House Bill 1260. Gentlemen, is yielded the well? Chair recognizes representative McLaren to speak to the bill. Thanks, Mr. Speaker, your friendly neighbourhood, J. Mack. I'm going to keep this super brief. Don't know of any data that says that eluding or S is getting worse. Don't know of any data that says that these increased penalties will deter people from doing it. You know, I just came from a lunch downstairs in which recent immigrants to this state to this country cited fear of police is one of their top concerns. It sounds to me like you're giving people more reasons to be afraid of police, not less. It sounds to me like this bill is going to give people an increased incentive to flee. And even if it doesn't, it's just more penalties, not much discussion of data, and it's the routine grind of just piling on in a criminal legal system that we're not sure works. That's all I have to say, thank you, Mr. Speaker, I yield the well. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. For what purpose does Chairman Hitchens rise? Parliamentary inquiry. Is it not true that the crime suppression unit here that's been in place since the first of may of last year has been involved in 459 high-speed pursuits in the Atlanta metro area in eight months? If the gentleman so states, I know that he knows all of that data. What purpose does Representative Hutchinson rise? Parliamentary inquiry. State your inquiry. Is it not true that the United States has the highest prisoner rate on the planet? I do not know. What purpose does Representative Jasmine Clark rise? Parliamentary inquiry. State your inquiry. Is it not true that we recently passed a bill that would remove the top lights from the Georgia State Patrol cars and that I am concerned that motorists who are concerned about who might be pulling them over or might not be fleeing but instead slowing down and going to a well lit area and that might be construed as fleeing according to our laws. If the lady says she's concerned about that, I'm sure she is. We're going to do one more here. What purpose does Representative Sains rise? Is it not true that the best way to address? What are you rising for? Parliamentary inquiry. Is it not true that the best way to address the concern of who's pulling the over is to not violate Georgia code and in the first place? Where is that? Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1216. The eyes are 95. The nays are 62. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1150. House Bill 1150, Vibhira, Senator Dickie, the 140th, and others being titled an act to amend Code Section 4117. The official to Georgia antenna relating the treatment of agricultural facilities and operations at forest lands as nuicences. This bill having the committee on agriculture and consumer affairs, that committee recommends a disbilled due pass by committee substitute. Chair recognizes Chairman Dickie to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, today I'm privileged to bring you HB 1150, the Freedom to Farm Act. This is a short and simple but straightforward and potent bill which brings some clarity to the existing laws where there's significant ambiguity. I want to go on record to this bill. The studies bill is not about big farming, but about being able to keep our small family farm, rural farms and even urban farms operating without having to be able to work. This is about keeping neighbors out of lawsuits. Let me repeat that. This is about keeping neighbors out of lawsuits. Some of you have heard some or received some information on this bill that I believe is totally incorrect from some environmental law groups. This bill should be titled Save Our Family Farms, or really maybe the Good Neighbor Bill. I'm a Good Neighbor who has family farming. I work for living tirelessly to preserve our lands so that my son and granddaughter can continue to work on our farm for the next generation. Over 98% of farms in Georgia or family farms, they cannot weather multiple lawsuits, nuisance lawsuits by developers and neighbors that won't then go away. You know, always in my bio, I'll talk about I'm a fourth generation peach grower, which I am, but actually I'm an eighth generation farming Crawford County. That I currently grow timber and peaches on land from the 1700s that my family invested in. We farm in three counties. I have lots of neighbors. Back when we started growing peaches, all of our neighbors were in the farming business. All of them were employed and lived there, but now that's not the case. Many of my neighbors, most of my neighbors have moved there in the last few years, split up previous farms and built new houses. And they're not familiar with all of our farming practices at times. So we're addressing this in this bill from Amigur in the law. Georgia has two situations in the nuisance law. One, a farm starts operating before the complaining neighbors arrive. And the second, a new farm starts operating after the complaining neighbors arrive. In this situation, regular nuisance laws apply and the neighbors have four years to file their nuisance complaints. We have not changed any dates or years in this bill. And this is where the Amigurity is. Under current law, that can be cases where a farm could be operating prior to a neighbor moving in, and yet the farm would not have the right to farm protection. And it this way is highly unlikely that any urban ag farm would ever have protection under the current law. So I don't tell you a little bit what this bill does and what it does not. This bill supports legislative intent to conserve, protect and encourage the development and improvement of ag and our forest lands in Georgia. It removes the concept of change conditions. That's where in other states, the Amigurity and decision by some judges have been. This is a thing. And then there's some things that this bill does not do. The timeframe for freedom of farm protection to be granted has not changed. I said that a minute ago, the time has not changed in this bill. Protection will be granted after a year of operation and then neighbors have four additional years to file a nuisance claim. However, in response to some concerns that many of you have had, it's fundamentally clear in this bill that if a farm converts to an operation called a CAFO, a confined animal feeding operation, that time clock resets so it cannot be grandfathered in. And the definition of a CAFO is defined by the EPA and requires additional permeating. This bill does not allow for protection to be granted if a farm is operating illegally, improperly or negligency. There is no additional protection for CAFOs. This bill does not change a single environmental standard, law, rule or regulation. If I'm not following the law on my farm, then this legislation does not apply to me. And my note neighbor is totally under the law to file a suit against me. This bill does not allow newly arriving farm operations, no matter the size, the credit nuisance without consequences. All local zoning control is maintained as well. This is not blanket immunity. Land or neighbor can still bring a suit. Farms which are not operating illegally have no protection under this bill. You know, when the present law was passed many years ago, as I said in my case, farmers didn't have many neighbors that did not farm. But urgent urban encroachment is happening all around Georgia farms. And it will continue and get worse. People who normally have not lived around a farm or agriculture operation, are now living right next door. This bill is needed to provide reasonable nuisance protection for farms, so existing and future farms, both urban and rural, can survive. This legislation speaks in favor of ensuring our family, agriculture operations, whether it's food for our tables, clothes on our backs, plants and crops which produce oxygen, support wildlife, and coves environment, or timber being used for housing and buildings. I want to keep our farmers in our tractors and not in our courtroom. So I'd like your favourable consideration for this bill today. It's very much needed by Mr. Speaker. And I think some other people would like to speak to this bill. You have a question if you care to yield. I'll yield to recognize this Chairman Smith to your right for a question. Thank you. I believe it's me directly in front of you, Representative Dickey. Chairman Dickey. Okay. See you. We're leaving the house. Thank you. Thank you, Chairman Smith. I just want, is it not true I want to take this moment to commend you and your committee for all the talentless work you have put into this issue for the better, for the good of the community and for the state of Georgia. Thank you. Thank you very much. I have worked with many, many groups on this bill for many years. As you know, my predecessor that was in your office seat passed this very similar bill a couple of years ago. And just I've gotten great support and encouragement from many, many groups in this state on this bill. Do you further yield? I do. Chair recognizes Chairman Ballinger to your right for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Thank you, Mr. Chairman. Who wouldn't this protect family farms like my family's, where my family has operated our family farm established well over a century ago, now surrounded by not by farms as it once was, but by subdivisions and commercial properties. Wouldn't it protect that family farm? It absolutely would. If it's been there prior to those, it's your case, it absolutely would. Thank you, sir. I appreciate the bill. Thank you. I'll yield the well, Mr. Speaker. The gentleman has yielded the well. We have other members that wish to be heard on the bill. Chair recognizes or Chairman Perkel to speak to the bill. Thank you, Mr. Speaker. I came because I have heard and I'm sure you have too. This bill is for industrial farms. I got to tell you, I'm a small farmer. My 75-year-old dad right now is trying to put a petal on rig to put in the manor side out so we can plant butter beans next week. It is a small farmer. It's just me and him. I would never, not ever, support legislation that would hurt a family farm. I'm a co-sponsor of this bill. I'm here to speak. I'm here instead of on the farm to speak for my farmers, for my dad, up here. I'm here to be their voice. The current law, as it presently stands, contains ambiguous and vague language that requires litigation in order to determine when protection is done. I'm going to tell you, I love my lawyer friends, but I can't call one on the phone to say hello without getting a bill. I love you with all my heart. Thank you for what you do. But it requires litigation just to find out when protection occurs. The current law doesn't grant protection unless there is a change condition outside of the farm. I could do every single thing right. I could dot on my eyes. I could cross on my teeth. And I could still get sued for a new suit. Because the current law, there is a change condition which is outside of anything that I have control of on my farm. So let me tell you what this bill does quickly. I am not covered currently under the right to farm if I violate environmental laws. If I violate any egg laws nor am I protected under this great bill, under the Freedom Before Act, it merely clarifies or takes away the ambiguity of when this clock starts. If we want to ensure safe food supply, Georgia, grown food supply, to be able to have our kids be able to move back to the farm, back to rural Georgia, and begin farming on the wrong, we need a passage bill M50. Under current law also, I don't farm in town. We've heard several bills that deal with urban farming. And I don't farm in Atlanta. I don't farm in Gwinnick County or the cab county. But under our current law, urban act operations would never likely ever get protections under the current law. Because they operate in places that are already developed. This is how small farms. I ask for you to vote. Thank you Mr. Speaker. Chair recognizes representative Al Williams to speak to the bill. Thank you Mr. Speaker. I want to approach HB 1150 that I'm supporting from a little different perspective. And it's very hard for some folk to understand this perspective. And sometimes folk vote against the bill simply because of some of the connotations. I'm a rural legislator. And in my caucus, I think there are only four of us that exclusively represent rural districts. But here's what the connotation is. Doing the great migration in many years thereafter. The only thing a farm man would share cropping tough times and gross discrimination. So I put a very bad taste in the mouth of many of you who live in urban Georgia. But when I look at a piece of legislation, like this, the very first thing I think about as a rural legislator, first and foremost what would Linmo James do? Who made a very good living in own thousands of acres. And we sometimes forget that there are several very successful African American farmers in Georgia. I also happen to consider myself an environmentalist. So I certainly want to know what will it do to the environment. I went and talked to Chairman Dickie because I had a couple of concerns about this bill. And one was the environmental effect because I wanted to make sure that it would not allow super hog farms like you find in North Carolina to come to Georgia. Now, unless you've ever lived within 10 miles of a hog farm, you can't appreciate what I'm saying. If you hadn't been any closer to a hog farm, then the pork produce at Kroger, then you don't even know what I'm talking about. There is no way in the world I would want to see streams and rivers polluted as I am a coastal county and it's pristine. And I want to keep it like that. But I know farmers all over South Georgia that this is important to. One of the most difficult things facing African American farmers is how to keep farms in the family. There was a time, Liberty County, Liberty History here, a few days after Black History, but Liberty County had a strong agra population. Doing this time up until the early 60s, the greatest percentage of land owners in any county in Georgia was Liberty County Georgia African Americans, the greatest percentage of African American land owners. So, I know a little bit about land. This bill has some provisions in it that will prevent the encroachment that some of us have concerns about. Now, I know the difference in a mega hog farm is, and then I understand it's a nuisance. But often thinking of Joe Vomana, we hate the smell but love the produce. You all go get that when you get home this evening. This bill will not hurt the environment. There are protections in there. Now, very honestly, as an environmentalist, just about everything we do with some point, we can kind of make it hurt the environment. But this bill will provide farmers and the neighbors' recourse to object to new farm operations. That's the protection I'm going to hear about. Because if you've never seen a mega hog farm in North Carolina, then you can't get the gravity of what I'm talking about. I'm supporting 1150 because it's good for all farmers. And as I've told some of my friends on the other side of the question, and I'll probably bring this up a couple of more times today, I'll forget that there are rural Democrats and rural African Americans that do have a stake in agriculture bills. And as I told some friends of mine a little while ago, when you're preparing a bill, you always remember like an old man told me years ago, son? One feeding. Don't make no baby fat. So always think about the fact is one day you might need it. Oh, we don't need it on this bill. This is a good bill. It's a good bill. Let's look beyond what we call a farm in the reality of farming now. Now, I said, it's me speaking. I got to sit down. I'm just like free to this morning. I don't mean nothing. But let me finish this. One thing is for sure. Linmo James told me how difficult it was to farm. And he came out of Tuskegee, went to Detroit, Michigan and worked for Ford, then came home to farm. Black farmers couldn't borrow any money from the areas, the farms, banks that lend farmers money couldn't borrow it, not enough to make it, just enough to get in trouble. And guess what happened to him? One of the most notorious people in the South. He went to visit Curtis Hackerson, took him to visit Herman Townmage when he sat at a moan. And Herman Townmage asked, Linmo, Paul understands this kind of language. What can I do for you? And he told him, he said, how much do you need? He said, I've been going and going and getting told no every time. He said, going back down there Monday. And he got enough money to do what he needed to do and capitalize his operation. There are some good stories in farming. Everyone's in a while. I'll be glad to share them with some of you that have only seen a fine raccoon in the zoo. Talk to me about it. Thank you. Speaking with that, I yield the well. The element is yielded the well. We have other members that wish to be heard, chair recognizes, representative Stacy Evans to speak to the bill. Thank you, Mr. Speaker. Ladies and gentlemen, usually pretty old school. I like my paper, but I wasn't as organized this morning as I wanted to be. So I got my technology here with me. I rise to speak against House Bill 1150 and the luck of coming after my friend, Al Williams is just terrible. It's so very rare that we're on different sides of a bill, but we are today. But I don't think that we're both on the side of farmers. We're both on the side of fairness in our laws, but we just disagree about what this bill does. I think it's going to be very clear about that. The current law is very clear. If the agricultural operation is there first and has operated for at least a year, it's protected protected from nuisance lawsuits forever. Even if the local zoning laws, rules and regulations change after that first year, we're actually striking that language from the law. We're striking it in lines 29 through 31. That language says, if you've been there for a year, even if the zoning, all that changes, you're good. Even if the area around the agricultural operation changes, you're good. You're protected from nuisance. Even if your facility gets bigger than it was when you started, you're good. You're protected from nuisance lawsuits. We are striking all of that line 67 through 79. We're getting rid of that very specific language in the law that says, if you're there first and you're there for at least a year, you are protected forever. Let me be clear, we are taking that out. We're not clarifying it, we are taking it out. I've read this bill at least 10 times. I'm trying to find the problem with the current law, and I just don't see it. I looked for case law that potentially found fault with the statute that said it was unclear that led to these terrible results against farmers. I didn't find it. Not one speaker that came up here to tell you that we needed to pass this bill told you about any lawsuit that had hurt any farmer that they know. No one gave you a number of these floods of lawsuits that are coming into our court houses. The law that we have has been on the book since 1989. If it was a problem, we would know. The only case I've heard from folks that gives them any concern is a federal case not in this state based on a law that's not this one. We write better laws. It's more clear here. It is today. It won't be if we pass this law because I just told you all those things were striking out. Now, it isn't just the reading of the law that tells me that the law we have today is good. It's also experienced. Some of us in here we've known each other for a long time, but there's a lot of stuff we don't know about each other. I know how to spend and kill a chicken for dinner. I don't do it much anymore. But I know. So as part of the work that my stuff father had, we got to live in a little house in front of the chicken farm. It smelled. There was noise. There was dust. And if we didn't have the protection that we had at the time, which yes, if you were wondering, yes, I was in high school after the law that we have on the books was passed. The protection was there. That farm didn't get sued. My stepfather's job was secure. We were able to continue to eat the chickens. This bill creates confusion in so many ways, but most notably to me by what it removes as I've as I told you, we're removing the language that affirmatively says that local zoning laws rules and regulations can change. But if the operation was there first and they were there for a year, it doesn't matter. They're protective from nuisance lawsuits. Now, we are presumed to do what we do for a reason. We are presumed to mean what we say in laws. It is presumed that if we take language out of a statute that we meant to. So if a good lawyer goes into see a judge and compares the laws it is now to what it might be at the end of the session. If we passed this law, they would say, look, judge, they took this out. If the laws change, they're not protected anymore. They wouldn't have taken it out. If that was not true, we are presumed to have done it for a reason. Why do we want to add that uncertainty to our farmers? We're taking out language of what a change condition is that if the area changes becomes more residential, the nuisance protection of the operation does not change. That's what the law says today, but we're taking that out. Again, a good lawyer goes into the judge and says, let's just let your men to change this. They took it out. What would we tell them?\n\nWhy would we do that? Now a lot of lawyers in here, I know ask questions of those that are proponents of this bill and we didn't get answers. And you say what do you do about lawyers? You don't like us until you need us, right? But we really are here to help. If you want the law to be more clear and do what you actually want it to do, you should talk to us. Now a lot of folks will recognize this quote from Shakespeare. Came up here to talk about killing chickens and Shakespeare in the same speech. That's got to mean something neat. The first thing we do, let's kill all the lawyers. Henry the Sixth. And we all laugh. Well, I had a good law professor at the University of Georgia. A lot of y'all in here had him too. Professor Perry Centel. He's a legend. He passed away. We honored him. On my first day of torts, he said, don't you ever let that statement go by again with a laugh? Because what they were doing in that Shakespearean play was planning a coup. They were going to overthrow the king, overthrow law and order, and they knew they couldn't do it unless they got rid of the lawyers. Because guess what you need lawyers for? To understand the law, to interpret and enforce it. We're not looking to sue farmers. And it isn't happening again. I looked. No one up here said there were all these lawsuits. Nobody up here came and told you about all these judgments that are putting people out of business. And I work on the plaintiff's side of things most of the time I've done my fair share of defense work. When I'm on the plaintiff's side, I don't usually get paid unless my client gets paid. So I'm not looking to file a case I'm going to lose. I'm not looking to have a ton of cases that are going to drive me to court and spend my time and spend my money. And I don't get paid. I've also got to think about the venue and what the jury's going to think. And let me tell you, the optics of suing a farmer, not something I want. So this idea that the lawsuits or the problem is just not real. But I do fear that if we pass this bill, we are going to create litigation because we're creating uncertainty. We're going to have to test this new language. We've shortened the time period. Now we've said you've got a year from year already there. Some new business moves in. Maybe they're not causing me much of a problem right now, but you've only got a year. You don't really have a lot of time to wait and see. You don't have a lot of time to work it out. So I fear a rush to the courthouse from this legislation. We're adding uncertainty. And in addition to adding uncertainty, we're infringing on private property rights. This is no longer about who was there first, which is what has been forever, which I think incidentally is unconstitutional. It's going to lead to a lawsuit about that. So I'm on the side of farmers. And that's why I urge you to vote no on this legislation. I don't think this bill says what it means or wants to mean what it says. Please join me in voting no. Thank you, Mr. Speaker. I yield the will. Chair recognizes representative Davis to speak to the bill. Thank you, Speaker. Hello, colleagues. I'm coming here to speak to you today. And I'm going to tell you now, no, I didn't do no important speech. I didn't prepare. But sometimes you know, God have put it on you to come and speak the truth. And what truth am I talking about? Before I came here, I used to go to the commission meeting and I would give community alerts. See, as a community activist, community missionary, I would be at the grassroots out in the community. And I get to see things that other people don't get to see. But in this situation, also, I was trained in the ROTC where as a veteran and as an officer, they teach you not to just look at the trees. You need to learn to look at the forest. So right now, I'm not going to do a community alert. What I'm going to do is what is called a capital alert. And with the political environment that is here today, we are so against each other as Democrat and Republican. And there's so much money raining. Oh, that infrastructure money is getting ready to come down. And we, oh, Lord, money is coming. So really, there is a party up here. And that party is green. I'm not talking about environmental. No, I'm talking green. So I want you to think outside of your boxes that have us all pitted against each other and think about this. See, I live in a community, urban community, in which right now a gentleman has moved into a residential neighborhood. And he has set up a farm. Now, he not only set up a farm, he is right now doing a slaughterhouse. Now, how many of you would like to own a home in a residential neighborhood where surrounding other houses? Somebody's doing manufacturing, a slaughterhouse. And then they turn around. He turns around and he said, well, I have a state license. Well, I can operate this slaughterhouse. As long as I don't sell the meat. But then the people say, you know what? He's selling the meat on Facebook. So even though we go and we document all this, that man is still operating in an urban environment. Now, I'm saying that to you because I'm saying, it may be perfect legislation that you are doing for the farmers. I am not against that. But sometimes there is a back door consequence to your legislation. And that back door right now is that the slaughterhouse that is in my district becomes legal to do. Now, you're saying, oh, we're looking to re-champ and add nuisance. Let me wake you up to something. I want to talk to the taxpayers and voters. Because see, a lot of the people in here already know how they're going to vote. Know this. So I need to do a warning to you. Those of you who are homeowners. See, right now, this is one legislation among others that when you look at them as individual trees, they are a tree. But when you look at the forests, the forest is saying that they are getting ready to destroy the American dream of home ownership and Georgia. Now, let me explain to you how they do that. Now, when I'm going to destroy your ability to own a home, I'm not going to come at you directly. Because then you will be sent to fight. What I would do is I chip at your rights as homeowners chip by chip. That first chip starts with the nuisance law. Now, they said, this is a nuisance I didn't rule Georgia. But see, you don't understand. When you talk about a party house, the noise is a nuisance. When you talk about illegal boarding houses and all that with all these people powering one house, that overcrowded house with uncamped yard and all that, that is a nuisance. So when I chip away at the nuisance law, I have already exposed and damaged your rights as a private property owner under home ownership. Now, nobody is going to really come at you and tell you right out, this is what's happening. Because everybody's looking in their own individual box. They are looking at rural versus urban. But I'm looking at the American dream of home ownership being destroyed in the state of Georgia. Now, they're going to start off with this nuisance. But they won't tell you the number of bills, pre-emption bills that have already been passed and that they're working on now that's going to lock the hands of your local government. Yes, I'm talking about the city council and the county commission. And some of you have all these community groups where you do all your planning. Oh, y'all can go on to get rid of that. As well as your planning commission, you don't need to do that. Because like I said, it's raining money. And it's a lot easier to buy a few people up here at the state. Then I had to try and buy the people on the local level. Now, I'm not saying anything about, listen to me. I'm not saying anything about politicians. If you are a public servant, you wouldn't be mourning. Because I have to speak the truth. Now, speaking the truth as an elected official, it's not something that is common up here. Right? See, some words that people say it makes people mad. There is a lot of people up here who speak the truth all the time. There's a lot of people up here who want to do what is the best interests of the public. But we all are always battling each other in our boxes. What I'm standing up here telling you to just think for one moment. It's not easy getting up here and speaking the truth. The people who are going to benefit this on the urban areas are going to go into those neighborhoods. Most of the houses right now, over 50% are being bought up by investors. Your work in Georgia's can't even find houses. I want you all to understand. Your bill may be perfect for the urban farmers. But right now, that's law the house becomes legal. When you do away with the nuisance law, your party houses, your other items, where people were, it was just on the news yesterday. These neighborhoods are not going to be able to stop it. We cannot afford to endanger the American dream of home ownership in the state of Georgia. I ask that you look at this legislation from an urban point of view and make those changes. Don't endanger the American dream of home ownership. We don't have to fight each other. We don't have to throw insults at each other. But this is some very dangerous legislation to kick off. I ask that you don't look at the individual trees. Look at the forest and help us work together to protect home ownership and the American dream in the state of Georgia. You had a question. Did you want to you? Thought you might want to expand on your presentation. Okay. Ladies, you yielded the well. Chair recognizes, I thought you wanted to be agriculture, Commissioner. This ought to be interesting then. It is. There's cameras back there recording everything we say. Chair recognizes representative Dukes to speak to the bill. Thank you, Mr. Speaker, for giving me an opportunity to come to the well. But I want to thank you even more for that observation. You know when you've been around you for a while, you have an opportunity to see a lot of things take place. You see, I was here for the outdoor advertisers and the environmentalist fight. And it was a tough one. But as time progressed and we worked on it, we came up with something that everybody felt good about. And now you know the outdoor advertisers are not environmentalists. But I can't say that about a single farmer in Georgia because we all have a certain affinity and love for the lane. You see, we probably enjoy coming up here to the ASValk jungle that was made by me. But we live in God's country. Plays created by God and we love it. I introduced legislation this morning to establish a study committee for the expansion of national competitiveness for Georgia agriculture. And that certainly includes the beef industry, cows, pigs, chickens, goats, sheep. We haven't domesticated those yet. But for the right price we will. So I truly understand that we need to expand the capacity to produce those products. Not only do I understand it, but everybody in America understands it. We need to establish a full supply chain so that we can create facilities that create good jobs for Georgia. Particularly in our part of the state, whether we have suffered so, so dearly. But it has to be in conjunction with your neighbor. You see, everybody has property rights. I'm going to tell you a story. My father and his brother used to kind of farm about 5-10 of the acres. And we lived on in that area. And our neighbor had 14 acres. And when we moved there, they were not planning hard. They were not growing the hogs. But shortly after we got there, they went into the hog business. And I'm going to tell you, the stench was something else. It was so much so until my father went to his house and told him, listen, you're going to have to do some of those hogs. And my mother had been talking to his wife. And they kind of got together on that too. So when he went, he told the guy we're going to have to do something. And he said, don't worry, Mr. Duke, my wife already told me, I got to get rid of him. You see, under this bill, if you would look at lines 106 through 1-106, it says that no agriculture facility shall be of becoming nuisance. If that facility is operated, operation has been an operation for one year. So what that says is this, or at least that's my understanding. If I'm there and I'm playing Butterbeans, and that's my operation for a year. At the end of the year, I can go in now and I can have 15 hogs. And they can put them next to my house. And they can create a stench that causes my mother to want to leave my daddy. Because she's not staying there. That's my only concern with the bill. I think that we can and we will be smart enough to be able to come up with something that is going to protect all Georgians, to have something that everybody's property rights are being protected. Now, when people come in from someplace else and put those places next to yours and they're living somewhere else, if that man and his wife live someplace else, we probably would have had to move. But because they were our neighbors and our friends and they understood what we were going through with because they were going through the same thing. We were able to resolve that issue. It was a year. And I can remember, I was maybe 13 or 14. And my neighbor called me over to help him to put his hogs on the truck so he could take them to our market. But before we put them on the truck, what he did was he had an opportunity to harvest mountain oysters. And I was 13. And I'm going to tell you, make my flash crawl. But he did have an opportunity to take them to the market and he shared the oysters with us. I'm going to ask that this bill go back to committee. And let's see if we can work with something that makes it palatable for all Georgians. Mr. Speaker, if there's no question, the commissioner will yield the will. I thought you said you were yielding for questions. This is me to press here, okay? Got some questions. I wouldn't miss a speaker. But for the presence of essence of time, I think I'm going to just leave. Well, I got all day. Never let it be shared that I curtailed the page in this house, okay? Well, thank you for your tolerance, Mr. Speaker, but I am yielding the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report. And we have a request for the chairman's time. All right. This is a serious issue now. So let's give attention to the members in the well. 20 minutes each for the minority report in the chair's time. Chair recognizes for the minority report representative butler. Thank you, Mr. Speaker. Well, we've heard a lot of interesting things. Have we not? And I know that you don't want me to talk 20 minutes, but I do feel that I need to make some comments about this bill. And what I say today is not meant to impune anyone that's worked on this bill. It's not meant to impune any of the sponsors or the advocates for the bill. But there are some serious, serious concerns that I have about this bill. And some of you know that I'm a part of the Columbus delegation and I'm proud of that, but you may not know that literally in my front yard is the oldest business in the county that I live in and it has a grist smell. And we still actively grind, meal, flour, and grips. Many of you probably don't know that I have had the pleasure. I say that in Tung and Cheat. Of picking cotton, peas, beans, okra, which I just really don't like because it is. Blueberries. I've pulled and shocked corn. I've cut it off the cob and put it in the freezer every year that I've been married. I have helped grind sugar cane, cooked it into syrup, and I have participated in hog killings. I have planted pine trees by hand with a dibble and on a tree planner. And for 35 plus years, I've been a member of the Farm Bureau. I say that so that you know I am serious about this and that this is important to me and it is personal to me. I also was one of the founding members of the rural caucus in 2008. And the reason that we founded the rural caucus is that we knew the metro area was growing in population and we were concerned about encroachment into rural areas and what it would mean to our way of life, to our ability to grow farm products and get them to market and have people in Georgia use and buy Georgia grown products. I'm proud of the rural caucus and the work that it's done in the way we stood together where we, whether we were Democrats or Republicans, whether we were senators or whether we were House members. And I continue to be proud of them. But I just want you to know my concern about rural Georgia and small family farms did not start with this bill when it was a different number a few years ago. It's been there a long time and it's not going away regardless of what happens with this bill today. I've been told that the purpose of this bill is to prevent nuisance lawsuits. So for me, the obvious question was how many nuisance lawsuits have occurred in Georgia? I asked not one, not two, not three, but about five people. Do you know what the answer was that I received? Nothing. I said were there hundreds? No answer. Were there thousands? No answer. Nobody knows and nobody said how many nuisance lawsuits have been filed against Georgia farmers. And the truth of the matter is I can't find a record of a standalone nuisance lawsuit against a farmer in Georgia anywhere. I'll tell you about Gordon County in just a minute. So I asked what are the actual farmers in Georgia that have been sued for nuisance and would they come to Georgia, come to the Capitol and tell us their story. And I was told by one of our representatives that Gordon County was just constantly in battles. They were constantly being sued for nuisance and that they had the settlement side of court. So I checked on that. It is true there have been some lawsuits but they are not nuisance lawsuits. They are because of negligence and they are not against a single family farm. They are against an investor ownership corporation. So it is different. What a nuisance. I'm not a lawyer but I figured out there's a difference between negligence and nuisance. And this law is about nuisance. So then I said, well what are nuocences? What's the difference? It can be for dust when you plow. It can be for flies from the chicken houses. It can be from running a tractor at night because that's when you put fungicides out so that you can have the best application. It can be at harvest time. It's somebody's mad because you're running the tractor half the night to get your crop in before the weather changes. But when I checked on the number of nuisance lawsuits, I could not find any. I've heard a lot about nuisance lawsuits. I've heard a lot about settlement side of court but I have not found any actual farmer who has ever been sued for a nuisance through the nuisance lawsuit. I checked on the North Carolina lawsuit. That's the one that was talked a lot about the rural council. I checked about what happened and what that law was like. And what I found is that the North Carolina law was nowhere near as strong as our law in Georgia. And it's not very similar in a lot of ways. The lawsuit involved a huge commercial foreign investor owned hog operation that had many problems that were not nuocences. They were serious legal, environmental wrongs. They had lagoons that had oozed into the property of the farmers that lived around there. And the farmers that lived around there had lived there for years and years and years. And to say that that was a nuisance, frivolous lawsuit is really a detriment\n\nto those family farmers who had their property ruined. That's when I learned that we have never had a Georgia case to overturn the right for anyone to farm. I've looked, I've tried to find it. I wanted everybody that I've been talking to that are friends of mine to be right. I wanted to make sure that this was the best law. So then I look to see about our law. Is it truly a good law? We are the envy of other states in the southeast because our nuisance law is written so well. The Georgia law is stronger than other states. It is clear. It is concise. It is well defined. It is for both agriculture and it included forestry. The reason it has worked so well for decades is because of how it was written. Legal action that is taken to limit negligent operators. It is not nuisance. Although nuisance can be caused by negligence, it is negligence. Do you want to know the background of where our law came from? You'll find this interesting, I think. The law that we are operating under that is a nuisance lawsuit was written in 1989. It was written by a very well-known former legislator or he was a legislator then, but he is a legislator that was known by a lot of us by the name of Denmark Grover. He wrote this law as General Counsel for the Farm Bureau to protect family farms. Let me say that again because I want to make sure you understand. He had a vested interest in writing a good law. He was General Counsel for the Farm Bureau when he wrote this law to protect family farms and it has worked very nicely for decades. So who are we trying to help with this bill? Because I don't understand it. I've tried. I wish if you haven't looked at the bill, I wish you would. I brought mine up here so I could just hold it up. The very thing that we are famous for is what we're striking. If you look at lines 67 to 79, they're gone. It's a definition. You look at lines 109, 108 to 109, they're gone. You look at lines 90 to 100, they're gone. Those are definitions about protections to people that have existing farms or it is a definition about urban sprawl and how it can or cannot affect family farms. We're taking it out. They're gone and there's nothing added to take its place. Read the bill. It's there. I don't have anything else to say except for the where are the lawsuits? I can't find them. Where are the new census? Where are the farmers that have been harmed? Whose property rights are we taking care of if we do away with this law? And if we have a good law that other people have commented on in a very positive way with good definitions, why are we changing it? I'll tell you one more story about me. We have a chicken house. We have pigeons. We have chickens and we have peacocks. And they live together in this chicken house most of the time very, very happily. But every now and then you hear a bunch of cackling down in the house. And it's usually a sign, and I wish representative Williams was here because it usually is a sign that there is a possum nearby or a raccoon. And it gets them upset and they go to cackling because they fear danger. There's been a lot of cackling about this bill. And if you liken this house to a chicken house, there may be some danger in us making the changes we're proposing to make. And for those reasons, I'm voting no. And I'm willing to work on future opportunities to do anything I can to make farming in Georgia the very best and safest it can be. But what we're doing to this bill makes me incredibly nervous and afraid. And I hope that we will vote no and go back and try to do a better job. Thank you, Mr. Speaker. I yield the well. Do you yield for questions? Chair recognizes Chairman Jasper's to your right for a question. Mr. Dindelay, the yield. I will. So my, my question is that the family farmer from Gordon County in Sugar Valley who testified in the Senate Ag Committee last year was mistaken about being sued and asked to settle for a $50,000 in a nuisance lawsuit. Is that true? I am saying that nuisance and negligence can go together, but there was not a lot of evidence that I get. It was not listed in the law books or in the court proceedings as a separate standalone nuisance lawsuit. But just like this bill deals with it doesn't deal with the negligence. I think that the madam made need to look in Gordon County that it wasn't nuisance lawsuit. There's been a number of them in that county. Why? Okay. I'm just asking questions. Do you further yield? One more. Chair recognizes Chairman Carpenter to your right for a question. Does it? Does it? General Lady yield? I will yield. Is it not true that my brother is actually one of the people that brought that nuisance lawsuit in Gordon County? And is it not further true that I told my brother if I have, if I needed chicken to fry, he better leave that farmer alone. Thank you. Mr. Speaker, I will yield well. Lady is yielded the well. All right. We have the chairman's time now and the 20 minutes. Chair recognizes Chairman Dickie for the chairman's time. Thank you, Mr. Speaker. Myself not being on the attorney. I'm going to share my time with the representative to come speak to some of these legal issues, but I can assure you on your desk is letters from over 10 organizations, farm organizations, Chamber of Commerce, Green Industry, many, many other that represent large corporations, big business, as well as small farms in this county. And this bill has been very, very well vetted by some big time lawyers in this state. And this and the language we have been, we are presented here is is a language that I think will give us the best protection for our farmers and our agribusiness in this state. Representative Lebrick, could you come and I'll have for you. Okay. You yield the well. I'll yield the well of the representative. Chair recognizes representative Lebrick for a portion of the chairmits time. Thank you, Mr. Speaker. I will be brief. There is a one year time period in the statute, but it does not change the statute limitations. You still have a four year statute of limitations to follow your lawsuit if you feel like your neighbor in their ag operation is creating a nuisance. The law doesn't change that. The law does not apply at all if the nuisance results from negligent improper or illegal operation. This law does not immunize anybody from following apical regulations, rules and other laws governing operation of farm. And I think most of the farmers in this room will tell you there are plenty of those out there. They are all for a lot of them. They have to do with every day. And this doesn't excuse them from complying with those. It does not permit any violation of any local law or local land use regulation. The lady from the 87th was talking about that. That sounds like more of a local land use issue for me. I don't know how anybody can legally operate a slaughterhouse in a residential district if it's been zoned that way. Secondly, it exc- or where am I now? Third, I'm a lawyer. I don't count well, but it excludes KFOs. There's a sleuths concentrated animal feeding operations. That had been a concern. I think a lot of people have expressed early on in this process. And I would like to mention the chairman had about two or three hearings on this bill. So this was not rushed through it. It was considered and he changed it several times in response to concerns that had been expressed. In their legitimate concerns, I understand the concerns, but he excluded. And the bill now excludes any KFO from its effect or operation. If you go to a KFO, first of all, the year period resets. Secondly, if you're not operating the KFO in accordance with law regulations and so forth, the law doesn't apply at all. So the nuisance, it's all on for nuisance lawsuits in that case. And finally, as to the changes that have been made this year, I would agree with the late in the 57th. I think our language was better than North Carolina's, but I don't know if it's different enough to address the concern that that case raises. So that I think is why that language was removed. And based on the structure of the statute, it is no longer needed. I would rather go ahead and try to protect our farmers now before the lawsuits hit than wait for the lawsuits to come flowing in and then try to address the situation, because you can't do anything about it at that point. So I would encourage all the members of this body to consider favorable voting for this legislation. I believe it's much needed and it's needed by our agricultural industry. And we all like to eat. We all like to wear clothes, at least I think most of us do. And that's where they're coming from. They're not coming from a grocery store or department store. That's toward the end of that supply chain. So I would encourage you to consider that and vote in favor of this legislation, the speaker I'll yield the will. Do you yield for any questions? I do. Chair recognizes representative Kirby. Do you're left for a question? Thank you, Mr. Speaker, with the gentleman yield. I yield. Yes, sir. We've heard that this is changes in kittens, some confusing wording and things. As I read on starting on 106 line 106 and what the changes to be made it will now read in our law, if passed and signed by the governor. No agriculture facility, agriculture operation or any agriculture operation at an agriculture facility, agriculture support facility or any operation in the agriculture support facility. Shall be or shall become a nuisance, either public or private. If the facility or operation has been in operation for one year or more. Is there some secret lawyer word in there that I don't understand it makes that confusing because that seems pretty simple to me. I would concur. Do you further yield? No, I'm a speaker. I'll yield the will. I'm allowed was late. Chair recognizes Chairman Dickie for the balance of the chairman's time. Thank you, Mr. Speaker. I'll be brief. 32 years ago, the mayor was a fixture in this capital. He was General Counsel of Farm Bureau. But that's 32 or three years ago. I've got cards in my hand from Farm Bureau presidents, presidents to represent their members in 158 counties in this state. These are the cards sent to me asking for this legislation. Ladies and gentlemen, nobody in this building loves agriculture more than I do. My livelihood depends on it. My future depends on it. I'd never do anything to jeopardize farmers in this state. I wanted to thrive and I want to work alongside my neighbors. I want all judges to work along each other with agriculture and urban friends. This bill is an attempt to let both farmers and neighbors to continue to be neighbors and let Georgia, agriculture and people in this state depend on it to thrive. I ask you to vote green on this bill. We have a great green industry in this state and I hope you'll recognize that by the green boat on the board. Thank you very much. Gentlemen, is yielded the well? Is there any objection to adopting the committee substitute? Mr. Clark, why don't we ring the bill? I've got a lot of empty seats. Is there any objection to adopting the committee substitute? The chair here is known. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee? The report of the committee, which was favorable to the passage of the bill. The chair here is known. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. What purpose is representative Kirby rise? He waves. What purpose is representative or chairman Houston rise? I was vote green. Chairman Dick you may need to show you that button. What purpose does representative Bentley rise? The state you're inquiry. Is it not true Mr. Speaker that I represent the district that was formerly held by a state representative Linmore James who was a well known farmer down in rural Georgia and I am voting yes for House bill 1150. Is that not true? I know that to be true. What purpose does representative Mayner rise? Parliamentary inquiry. Is it not true that the Maynors and the James family have been farmers in Dooley County since the 1800s? If the lady so states I am sure that is the truth. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House bill 1150. The eyes are 102. The nays are 62. This bill having received the requisite constitutional majority is therefore passed. What purpose does chairman Watson rise? Make a motion Mr. Speaker. State your motion. I move to send HB 997 back to the ways the Maynors committee. Clerk will read the caption. House bill 997 by reps and Watson 170 second another to be titled an act to amend part one of Article 2 of Chapter 5 of Title 48 fiscal to Georgia and Santa really in the property tax exemptions. The gentleman's motion that House bill 997 which was on the first debate calendar today be recommitted to the ways and means committee is their objection. Is their objection the chair here is none and it is so ordered. All right we have a little short. House bill 960 by reps and a lever to 33rd. No this to be titled an act to amend chapter 12 of Title 45 the fiscal to Georgia and Santa really in the governor. So establish the office of the inspector general this bill ever for the committee on judiciary that committee recommends that this bill do pass by committee substitute. Chair recognizes representative lever it to present the bill. Thank you Mr. Speaker as you'll be bear would say it seems like they should move all over again. Ladies and gentlemen the House I ask your favorable consideration the House bill 960 this will create by and statute the office of inspector general that currently exists by executive order in the governor's office. It's been thoroughly vetted through the judiciary committee. We've tried to consider all concerns that were raised and we've made adjustments to reflect that the main purpose for taking what currently exists by executive order. And putting an statute is it gives the office more permanence it further defines the scope of the inspector general's investigatory authority. It allows him and the main thing is after he can issue subpoenas and warrants and have post certified officers which he currently cannot do by virtue of just existing by executive order. So this has been requested by the governor's office. I believe it is we've made the adjustments that are needed to address the concerns and I believe it will also help ensure that we have a sufficient watchdog within the executive branch because his job is to investigate waste wrong corruption. So I would ask your favorable consideration and you for questions. Do you yield for questions I do yes you speak. Chair recognizes chairman Parsons. Do you're left for a question. Thanks figures. German yield. I yield. Yes. I even hesitate to ask the question. I realize it has been thoroughly vetted. But I do recall from some testimony or presentations and in in the appropriations committee from the department or from the agency that's now in the governor's office about this. And isn't it true. I would just like to know why do they need post certified law enforcement individuals in that in that agency or in the new agency that will be created. Well the reason that has been told to me by the inspector general is that they that the investigators are not always investigating nice reputable people. They are sometimes in situations where the ability to carry a firearm would be much desired by by them and by us. And so it allows them to have a more professional and properly equipped investigative force. Thank you. Do you further yield. I'll yield for another question. Chair recognizes chairman Collins. Do you're right for a question. Does the gentleman yield. Yes, sir. Who does the inspector currently use as a as a two for law enforcement. He has his own investigators on staff. Okay, but if he needs to be further yield for another question. Yes, sir. Yes, please go. Then if that's the case. Why are we adding those officers the ability to be able to be uniformed sworn officers. Because it increases their security and their ability to function as investigators. You have another question. Yes, sir. Let's keep going. If he if he needs currently if he needs another form of safety. Who does he utilize in the process? They call the GBI. They call local law enforcement to my knowledge. He does not have one and he wants to have some contained within his office. He cannot do that by executive order. As you probably know, the post certified that has to be done must that you. Thank you. Thank you. Thank you. No further questions. Thank you, Mr. Speaker. Ladies and gentlemen, I ask your favorable consideration of House Bill 960. I yield the well. Is there any objection to the previous question being ordered the chair. Here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 960. The eyes are 163. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. All purposes represent the scope of the rise. The bill may be read for the first time in time to the committee. Let's take those motions up at the end of the rules calendar. I'll recognize you again if you'll hit your button. Clerk will read the caption to House Bill 1175. The bill 1175. There was an apurcle of 155th and others to be entitled to amend chapter 2, a total 26th. The official go to Georgia annotated related standards, labeling and adulteration of food. So it's authorizing regulate the production handling, transportation and sale of raw milk and raw milk products for human consumption. This bill never inferred the committee on agriculture and consumer affairs. That committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Perkel to present the bill. Thank you Mr. Speaker. I'm up for another Ag Bill. This is the raw milk bill. I had a reporter a couple weeks ago. He called me and asked he said, what is the deal with this 1175 bill? I said it allows for the sale of raw milk for human consumption. He said it's already legal. He said I saw six ads for raw milk sales this weekend. He's partially right. In many farmers markets all across this great state, today, you can buy raw milk. Let me say that one more time. I don't know today. You can buy raw milk. But it's labeled as pit milk. I use the air quotes. It's pit milk. All this required is a small fee. That's an animal feed license. The animal is never checked. The milk is never tested. There is no minimum safety requirements. There's no bacteria counts. There's no somatic sale counts. There is nothing in the purchase of raw milk right now for pets that we have any idea of what's in it. If it's been water has been added. If the cow might have had my status the night before and got a shot of Ellie 200 and antibiotic. We do not want antibiotics in our food supply. So it's kind of important. This bill legalizes the sale of raw milk for human consumption. It provides for standards and testing procedures by the Ag Department. It includes labeling on the package that says this is a raw milk product that is not pasteurized. This bill is also measured. It is a small step. Very small step. We just cracked the door open. It limits the sale of raw milk direct to consumer. So it's not going into retail markets direct to consumer and it limits the sale to just raw milk and not raw milk products. Georgia Milk Productions Association is behind this legislation. Georgia Farm Bureau is in favor of this legislation. I ask that you vote yes on this bill to provide these standards for the sale of raw milk in the state of Georgia. I'm going to yield the will and others wish to speak on this bill. It's a late hour when I stood up people. Let me take one question. I see some people say, oh, so let me take one question. If that would be okay, Mr. Speaker, if there is one. You yielded for one question. Yes, sir. I will. Well, let's see here. How about chair recognizes the chairman of the ethics committee chairman Nix for a question. This gentleman, yeah, absolutely from a friend. Would this make it easier for me to get some real buttermilk that's got real butter in it? Yes, sir. It absolutely would. I'm a yes. Yes, sir. I'm going to get there's others want to speak on this, Mr. Speaker. And I have a chance to answer any other questions at all later time. Thank you. Gentlemen, as yielded the well, there are others that wish to be heard chair recognizes representative Jasmine Clark to speak to the bill. Thank you, Mr. Speaker. Today I rise in opposition to HB 1175. But before I talk about why I'm against this bill, I do want to say that I am a I am in agreement with what the bill is trying to do. And I think with work, I could support this bill. However, this bill does not go far enough to actually protect consumers of raw milk. So many of you know that I am a professor in microbiology. So bacteria is my jam. And when we're talking about unpasteurized or raw milk, what we are talking about is milk that has not been treated in order to reduce the amount of bacteria that is in that milk. That is very harmful to some in our communities, some in our districts. For example, people who may have cancer, people who are transplant transplants, younger children with a younger immune system. People like that, they are very vulnerable to some of the bacteria that you might find in raw milk. For example, salmonella. And most of you when you think of salmonella, you think of raw chicken. It's the same bacteria. So drinking this raw milk could be the equivalent of biting into a piece of raw chicken.\n\nI'm just being honest. Other things include things like pathogenic E. coli. And another one, which I'm not sure if many of you know about, is Listeria monocytogenes. This is a bacteria that affects pregnant women more than anyone else. Our immune systems are actually pretty good at blocking bacteria that are in our bodies from crossing into where a fetus might be, where the fetus is located, crossing the placenta. Well, Listeria is one of those bacteria that can cross. And when it does, it kills the fetus. So a Listeria outbreak or Listeria being in milk is very dangerous to pregnant women, which is why most of the time when a person finds out that they are pregnant and they go and they have their prenatal appointment, they are told not to consume unpasteurized foods. So this is serious. I know people are thinking to something to joke about or something to laugh about, but we're actually talking about lives here. And so again, I am not against the consumption of raw milk. If a person wants to take on that risk, then by all means, take on that risk. But my concern is in this bill, we don't go far enough to let people know that actual risk. And so I'm asking for a no vote today, and I hope that if this bill does pass, when it goes to the Senate, we can make sure that the labeling on these products is such that we are able to protect the people who might decide to consume this milk. So that they at least know the harm and the danger and the risk of consuming this type of milk if they so choose. So with that, Mr. Speaker, I will yield the well. All right, we have a minority report. Is there any objection to the previous question being ordered? The chair here's none, the previous question is ordered. Chair recognizes for the minority report Representative Mitchell. Thank you, Mr. Speaker. It seems to be Democrats telling their backstory and agriculture day. So I'm glad to be up here to join you for the raw milk. I did literally cringe when you suggested L.A.200 before selling milk. So just so everyone's aware, there is a 96 hour withhold on that. But I am actually standing here because I have worked on a dairy farm. I have a production animal medicine degree, which in New York where I got it means dairy. I studied it in milk quality lab and had the opportunity to teach milk quality courses. So I come here from a different position of expertise than anyone else in this building. And I know enough about milk to know that this is a complex space. And then when we make a bill, we need to understand the complexity of that space. But we can start with common expectations. We all want all of us viable small farms and safe milk. Every single one of us. So what solution can we find that are the best applications of those two values here in Georgia? And why am I saying no to this bill right now instead of yes? I think we could all agree. If we're drinking pasteurized milk, we're going to the grocery store. We all want it to be gray day. And we all want the assumed protections that we have there to be present. We want regulations and monitoring. We have a federal pasteurized milk ordinance that makes sure all the milk we get from the grocery store that's pasteurized is safe. It would not be a question that if a farm decided they were going to sell pasteurized milk, but not follow the PMO, not follow the monitoring, not follow the withholds, we would shut that farm down. We would say that milk is not safe. We have a way to make it safe. We are going to only allow one milk stream and it's going to be safe. I mean, in Georgia, we have regulations even on things like home baked goods. Milk isn't a different space. And as a product that's consumed raw rather than cooked, our consumers have no additional steps they can take to reduce their risk. You can choose how well done your hamburger meat is. You can choose whether you're cooking your tuna raw. You can have your egg runny. But the only way you can make unpasteurized milk safer is to follow the refrigeration protocol. And that's all you have. We had a great discussion on this bill. So thanks to Cheradiki and Representative Perkall, we had a lot of back and forth. There are at least 10 drafts of this somewhere. So it's not that we haven't had this discussion. It was that we had fundamental places where we disagreed. We had so many people coming to the Ag Committee that we had a two hour meeting. And I don't know if anyone attends Ag Committee meetings, but they're not two hours. And most of them came to speak specifically to the risks of drinking unpasteurized milk. We got two letters from the CDC. That is not common. DPH came, Department of Ag came. The National Milk Producers Federation not only sent a letter, but also put out a national memo. So never have you seen so much firepower come to the Ag Committee with the same ask. We want this safer and we want to protect the derries who are going to do it. So three derriamans actually did come to speak to us at the two hour meeting about their own farms and their dialogue during and after the meeting was actually very valuable in figuring out what our common space was. All three acknowledge that unpasteurized milk is a high risk product. Two of the three stated that they could not see it being a significant economic benefit to their own derri. And every single person acknowledged that what they wanted was twofold. They want a level playing field. They want to know if they are selling a product that they have produced under a grade A standard that they are not competing against someone who does not have the same requirements and can make the same product cheaper. And they also want to know that there's a safer product going out to consumers. Farmers really care that they are making safe quality goods. And they feel that what we are currently doing is not guaranteeing that safety. So in that space we had common values among all the speakers that range from the CDC to the individuals who want to sell raw milk. If we're going to see unpasteurized milk coming into the human food stream in Georgia, we want it to be safer. The vast majority of folks do not want consumers to be able to go to the grocery store and unintentionally pick up a gallon of unpasteurized milk to bring home. The farmers didn't want that either. It's not in this bill. But I do want to touch base on the significance of risk of this product. It is really easy to say, we eat raw fish. Why don't we eat unpasteurized milk? Did you eat raw chicken? Everyone can recognize that. There is a big difference between these two products in your head, right? Raw chicken and raw fish. Do you actually know the statistics on bacterial illnesses from raw fish or raw chicken? Or do you just make an assumption that one is much safer than the other? So since most foodborne illnesses unreported, we can use estimates of total burden to understand the relative impact. What do we get sick from most? If we look at those estimates, it becomes obvious why you're OK with fish sushi and not OK with chicken sushi. We do not actually have many bacterial disease outbreaks attributed to fish, relative to poultry products in the US. And in a 2013 study at the CDC estimated attribution of bacterial foodborne pathogen outbreaks in fish was less than 1% whereas in poultry, it was approximately 18%. Dairy was also 18%. The paper noted that unpasteurized dairy products were disproportionately represented in the risks. But we don't drink raw unpasteurized milk, because in some ways it is more like a fresh raw chicken breast than a piece of fatty tuna. Yeah, that image won't leave my head either. And I'm super glad that now all of you have it as well. So if we're going to sell unpasteurized milk, we want people to know that risk difference. Right now, unpasteurized milk sold on an animal feed label. So if you're getting it ostensibly for your dog, must have the warning with particular characteristics. Raw milk distributed as pet food or as specialty pet food, shall bear the following statement in letters equal to those largest found in the container. Not for human consumption, which would be removed. But this product has not been pasteurized and may contain harmful bacteria. Their carbon is not in the bill before you, but it should be. It has a disclosure that milk is unpasteurized, but it doesn't explain what that means. Until 15 minutes ago, you had no way to gauge the risk of that product. You needed to have that reminder. And every consumer in Georgia also needs to have that reminder. Did you know that we pasteurized most juice products in the United States? Since 1998, most juices are pasteurized. If you want to buy a raw juice product, it has to have a warning label that has both a description and an explanation on it. So this product is raw, and this is why it is a risk. It is a requirement. Same is true for food sold undercooked. So animal food such as beef, eggs, fish, lamb, milk, pork, poultry, and shellfish. She'll have both a reminder and a disclosure on it. But we don't have that for this particular product right now. We need to make an amendment in the Senate when this moves to the Senate. If we need to label sushi a much safer product for consumers who know very well it's uncooked, we should label unpasteurized milk appropriately. It's going to protect both our producers as well as our consumers. Both deserve that protection. But there's actually a second issue here. And I had said I would vote yes on this bill. If two conditions were fulfilled, the first one being no sales and grocery stores, and the second one being that we are actually eliminating the other milk stream. So the milk stream that right now is labeled as pet food is not removed in this bill. What we have done instead of decreasing risk by replacing an unsafe product with one with slightly more containment, we have now allowed the first product continue and introduced a second product, which is also inherently risky. So the question of why we would have two streams of unpasteurized milk going to Georgia consumers is one that's open. Why would we keep a much less regulated unsafe one and introduce one that's marginally safer and requires theories to have much more measures in place to protect consumers? Would you want a more and less safe beef stream? This one was expected at the slaughterhouse. This one was not. How would you know which one you had? The whole objective of this bill was normally to make consumers safer and protect the market share by eliminating this milk stream. We have not yet done that. Farmer selling under the license supply for this bill right now would have to follow higher standards than simply getting an ammo feed license and selling in the same locations. If we want to protect the dairy that are trying to do better, then we need to do exactly that. If you're selling milk for humans to drink, it needs to be under this license. And the solution is easy. We can eliminate the unpasteurized milk animal feed license with a fade-up period, so that farms that do move from one to the other and there's a picture up here you can see. This is the sum of the milk that is being sold. I actually went online and looked up. You can look up every single animal feed license online and you can click on it. See where the dairy is and then go find what they are selling online. I went to about 30 of them. This is not animal feed. This is the label that's on it. This is how you see it being marketed. You can find almost every single dairy in Georgia that's selling for animal feed. So we can do this better. This is a human food product. So the concern that was brought up in committee for not addressing that was that some of this might be going to say a vehicle calf market. It's not. You can actually go look up the licenses and see for yourselves. By eliminating this milk stream, we will not be decreasing farms' ability to provide milk for other farms. Moving away from these animal feed licenses would simply reduce risk in a very high risk space. This is going to protect our farmers. So if you step back and ask, should we be selling unpasteurized milk to consumers from a public health or a farmer's protecting? With the latest to spend, the noise level in here is getting unacceptable. And I'll give the member your respect and courtesy of keeping it down and listening to our presentation may continue. Thank you. So if we step back and ask, should we be selling unpasteurized milk to consumers? Both from a public health and a farmer's risk perspective, the answer is likely no. Even the farmers agree that this will increase their own liability. But if we're going to do it, we need to do it well. We need to level the playing field so that a person is not punished by making it more expensive to make a better quality product. And we need consumers to be warned about the real risk of the product they're receiving. I talked to a lot of people about this bill and said in the end, I needed two things to happen to vote yes. One was no large-scale retail sales. We did that. Two is eliminate the ability to continue to sell raw milk to humans under an animal feed license. That is still a no. I think this bill is going to pass. I think the intent of this bill is good. I think a lot of work has gone into it. I encourage you to join me in voting no as a single signal that you to value fairness to our dairymen and dairy women who are trying to do better and investing actual money into reducing the risk of this product. We can do better for them. We can do better for Georgians. And I hope we see these amendments on the Senate side. As it stands, I will vote no. Thank you very much, and I yield the well. I'm going to use the chairman's time. Before you get in the oil, the lady from the 57th, my dear friend, mentioned ringing the chickens neck earlier. For those of us who had a milk cow growing up, you're going to have to really comfort me, or I'm not going to sleep tonight, okay? So you've got 20 minutes to do that. Make me feel good. I milk that cow a lot of times and then drink it after it was cool. Chair recognizes Chairman Dickie. Thank you, Mr. Chairman. I hear you very loud and clear there. We'll give you a quick history. This debate on raw milk or pastorized milk been going on a long time. And I'm a real proud of our committee. Last, in the last session, we looked at this and I pointed Chairman Perkel, the head up a state of committee of our committee. Really the whole committee, I think, included pretty much and they had a couple of meetings. And I really appreciate Representative Mitchell's expertise weighed in and took a lot of things in consideration. But the fact that I'm out of the reason we did the state of the committee, because the sale of raw milk has been going on in this state and it's been unregulated. It's been labeled as pet milk. And I just cannot, as Chairman of Ag Committee continued to just look the other way and not move this state forward with a safer product. And that's what this process has been about. My committee's worked hard on it. Chairman Perkel's worked hard, tried to find a milk ground. I know we're not all in total agreement, but we are all are in agreement that we want to move this process forward. So I would urge you to pass this bill. Chairman Perkel can reflect it and get it over to the Senate. It's a good move for Georgia, milk producers who want to get this niche market and for consumers that want this raw milk. Other states are complying very, very well with this. And it's very successful in other states with no issues or very few issues. And so I'm going to Mr. Speaker, I'm going to turn the rest of my time over to Chairman Perkel. Chair recognizes Chairman Perkel for the balance of the time. Thank you, Mr. Speaker. I'm going to do something that is not often done up here. Well, besides that, I'm not as good as Representative Dexter Sharper. I really do want to thank Representative Mitchell. Chances are, I don't know this for a fact, but we might vote differently on this bill. But I will tell you that she was valuable to me. Every time I made a change, every single time, I brought it to her. It's still not where she wants it. So she might, I don't know whether she'll vote yes or no, she told everybody else she's going to vote no, but I'm holding out no. But I brought it, I brought it and she was invaluable. She was, she was a great resource. And we spent a lot of time talking about this issue because I couldn't, I don't know if you recognize, but she's very passionate about it. And she wanted a better process. And I incorporated many, many, many changes into this bill but cause she felt like and she convinced me that those were changes to me to be made. So perhaps it's not where she wants it. But I just want to, I want to thank you. And honestly, it's not a, you know, honestly, thank you. You've done a great job and helped me tremendously. I was not going to talk about the risk profile, but we all have it. I went out dinner the other night and I tie you in restaurant. Not like what we have at the house, but it's one of these places and the host ordered this thing, this dish is called beef carpacio. I don't know if you know what that is, but it's beef loin that has not been cooked before. It's raw. And I'm pretty sure that that's not the risk profile for everyone. But we decide those things. This bill, let me promise you, it does not require anyone to purchase or consume raw milk. It does not require you. In fact, I added measures to it so that you can only get it if you want it. You can't go to the grocery store and get it. You're not going to go to publics. You're not going to piglet wiggly. You're not going to go there and buy raw milk. You've actually got to go to the farm. It is direct to consumer. We will not force you. Now, Chairman Nick's might want to have some raw milk, but I will not force him to do that. Testimony just a bit ago was that raw milk is not good for pregnant women and the doctor might say that you shouldn't. But there's many other things that the doctor is going to say that pregnant women should not drink alcohol. Absolutely, should not drink alcohol. And I agree. And pregnant women should not drink raw milk. But it is their decision. All this bill does is provide a safety profile that we don't have now to know what's in it, to have a measure of regulation so that we know how quick it is cooled down, the temperature wise. We know what bacteria is in there. We know the semetic cell count. We know these things and I will not require you to drink it. If you want it, you've got to go find it. And with that, Mr. Speaker, I yield the well. Gentlemen has yielded the well. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The Chair here is none. Have all members voted? I'm sorry. What purpose does representative MacLeod rise? Parliamentary inquiry? Lature inquiry. This bill presents the whole new set of regulation for the Department of Agriculture. Is there a cost associated and is the agriculture or department in favor of this bill? I'm going to, you want to do a parliamentary inquiry, Mr. Chairman, to answer that? Chair recognizes what purpose does Chairman Perkow rise? Parliament inquiry. State your inquiry. Is it not true that the Department of Agriculture was consulted all along this? I cannot speak for them as to their support, but some of the many measures they requested. I added to this as to, there will probably any type of testing is going to be a cost, but we already do this on our milk facilities now. I'll do one more parliamentary inquiry. What purpose does Chairman Dickey rise? Parliamentary inquiry. Is it not true that the Department of Agriculture now inspects and regulates all fluid milk in the state of Georgia? And this would be part of their responsibility that they would continue doing that. Whether or pasteurize. If the gentleman so states, have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1175, the eyes are 100. The nays are 62. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Resolution 594. House resolution 594 by residents. Smith, the 70th and others proposing an amendment to the Constitution of the State of Georgia to assist to provide that county and municipal governing authorities shall be authorized grant temporary tax relief to property severely damaged or destroyed as a result of a disaster. This bill I refer to the committee on ways and means that committee recommends that this bill do pass that this resolution be adopted by committee substitute. Chair recognizes the chair of the Natural Resources and Environment Committee, Chairman Lynn Smith to present the bill or resolution. Thank you, Ms. Speaker and members of the House. I want to take a brief moment with you and try and do a flashback with you back to March of last year. March of 25th at almost midnight we got noticed that there was this storm tornado coming our way, a bad one. We normally don't experience something like that. But thank heavens to all the alerts, the sirens, when the midnight tornado hit March of 26th, it wrecked habit and destroyed so many homes in my community in my neighboring counties and actually in the northwest part of our state. When we stood before you the following week to tell you what happened, you stood with me. You stood with this part of Georgia. This bill and the intention of this bill will not help my community, but it will help the people you represent all over the state of Georgia. None of us chooses a natural disaster. And when that disaster hits, it doesn't have a checklist of are we older young? Do we live in the city or the county? Are we Republican or Democrat? It hits unconditionally parts of our state. So I asked that you stay with me as I explained this bill to you. To try and describe it a little bit, I put very quickly on your desk an article about what I was trying to do. So it looks like this if you don't see it out of all your papers. Again, no one is prepared for a natural disaster and no one thinks it's going to hit them. When it does, you hope your body, your representatives, your friends stand with you. My community will not benefit from this bill. We want those of you who have a future problem to have this option. This bill is optional. House bill 594 will allow temporary property tax relief for disaster damage properties, which are located within a nationally declared disaster area. The description of it, taking the language from the actual bill, six to amend speaker. House bill 594, six to amend the Georgia Constitution by authorizing the Governor and authority of each county, Minister of Bally and Consolidated Government and the Board of Education of each independent and county school system in the state to grant temporary tax relief to properties that are severely damaged or destroyed as a result of a natural disaster. If such property is located within a nationally declared disaster area, it is permissive. Our local governments are very supportive of this. They wish this has been on the books already. To describe it to you a little bit further, this bill, again, is a result of input from my community. We suffered greatly in our continuing to suffer. You heard Reverend Lemons earlier in the session to describe that to you. It destroyed everything in its path. But, and this is the rub. This was a natural disaster. We had no ability in our legal language in our Constitution, in our rules, regs, code sections that would help a local government deal with such damages this. It was not enough that we had this storm. We had no legal ability to give temporary tax relief to property owners in that area. This bill will do that. It is very simple. You can read line 16, 17, turn the page over, read it on down to line 22. Then on line 27 through 32, it describes what the Constitutional Amendment will be. I hope that we as a body can come together as a body to support this effort. Again, my community does not benefit from it. But somebody you represent somewhere in this state will be very grateful to you that we join together as a body to pass this resolution.\n\nMr. Speaker. Do you yield for questions? No, Mr. Speaker, I don't. I think it's self-explanatory. I hope that I have reached the hearts and minds of the people in this chamber. We usually stand together when we see a need in common. Thank you, Mr. Speaker. You know, the well. Lady has yielded the well. I've got other members that wish to be heard. Chair recognizes. Representative Al Williams to speak to the resolution. Thank you, Mr. Speaker. Sometimes bills get caught up in things that have nothing to do with the bill. Nothing whatsoever. The politics gets in the way. And it becomes a vehicle. It's unfortunate for this bill that chairman Smith has brought. Now, the safe thing would have been for me staying my seat and having nothing to say about this, would have never been a goal on to get a long guy. People of 16, 18, elected me because I've never been a goal long to get along. I don't want to start now. I believe in negotiations. Think things should be worked out. It's unfortunate this bill. As a rule, legislator, we're always doing hurricane season threatened by a hurricane. We've been blessed in Liberty County in Savannah that usually we send it north to our neighbors in Charleston. So we've kind of missed a few, Mr. Majority Leader. And that's good. But who knows when? My house sits at about 39 to 50 feet above sea level. The good surge and in trouble. And I remember the last time we had the remnants of a hurricane. People are still complaining about how they had to swallow so much of the laws and they're not seeing any difference when that tax bill came in. That's tough. To be taxed on the value of a house last year when you can't live in it this year. It doesn't even make sense for us to have to do this. So almost a no-brainer. But every once in a while, we reach something that really needs correcting. We all stood with Chairman Smith. And I was proud to stand with her and her people, her county, that needs them. And this is not the time to get off that train. This is not the time. I still stand with and that's why I'm supporting this bill. Because I think that it could have well been Liberty County, could have been Chatham, could have been Beab, could have been Muscogee. And less don't let politics move a good bill. This is a constitutional amendment. It's tough. I stand with my party. I've been a Democrat all my life. You'll probably die in about 40 years of Democrat. I'll be here. I'm going to stand. But every once in a while, a bill rises above partisan politics. And the lives and livelihoods of folk here now, potentially, should be above where we are politically. Because there's a couple of things that really pet peeps of mine. One of them is, I'm not going to stand with you today. And not stand with you and your hour of need on the next day, regardless of the political peril. Another thing is, I hate folk that cry when the flag goes by. And then do one patriotic things. You either wish the flag or your ginset. You either wish your friends or your ginsem. And if the bill is good, then it's got to be better than what the debate is. Pick another one. I wish the another one had them and picked their few bills. I don't love the picked one. But not this one. Too much at stake. One thing I'll file. Most of us in here live pretty good lives. We don't understand what the difference in a few hundred dollars on a tax bill means to you, the father, and weak. We don't understand what it means to not be able to get a ride to the doctor's office. We don't understand it. We don't understand what it means to two or three hundred dollars to keep a child from continuing into a new year at a college because they can't afford the fees. We don't understand it because it hasn't visited us. And I submit that you don't really understand what the people of Chairman Smith's community went through because you were blessed enough not to live it because had you lived it, we wouldn't be standing here fighting for the life of this bill. I urge you to support this bill, rise above for a minute. Let's find another whipping boy. Not this one. Not this one. Did you want to yield for a question? I've very seldom do but I will. I'm loving it right now. Chair recognizes representative Bentley for a question. She leaves. So there went your question. Boy, what a non-responsive group you are. I yield the way I'm, Mr. Speaker. Chair recognizes Chairman Ron Stevens to speak to the resolution. Ladies and gentlemen, I will take long with my conversation with the Chairman of Natural Resources when she came to us and said, well, Joel, here's our problem. How do we fix it? We didn't realize that there was no ability for your taxing authorities to give or leave, even on a temporary basis. So we, and thank you to the Chairman of the Ways and Means, thank you to the subcommittee Chairman when they put their heads together to try to come up with a bill that made some sense. And this is a really big deal. Imagine if you will, waking up as she did and folks in her community or like the gentleman from Turner County over here, whenever he woke up one day and we ask him, what does it feel like? What is your community saying to you? And he stopped for a minute and looked, he said, well, the best way I can describe it is like a bomb went off. And six months later, people are still walking around looking like they're in total shock. For the lady from Bambridge, the very same scenario, ladies and gentlemen, today you've got the opportunity, there's not a single lobbyist out there that's pushing for this bill. But you've got an opportunity for your neighbors because it might happen to you. A yield of will. Gentlemen has yielded the will. This is a constitutional amendment requires 120 votes. Is there any objection to the previous question being ordered? The chair here is not the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's not. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here's not the report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose is Chairman Darling Taylor rise? Parliamentary inquiry. Stay tuned, Quarry. Is it not true that if this bill had been in effect a couple of years ago when we had Hurricane Michael, many of the residents of my area would not have had to pay taxes that did not exist anymore on homes that were gone. Thank you. I believe the lady to be correct. What purpose does the speaker pro-tamerize? Oh, she waves. What purpose does representative Duke arise? Parliamentary inquiry. Stay tuned, Quarry. Is it not true that when Hurricane Michael desecrated Southwest Georgia, destroying peak countries, pine trees, and ripped away our way of life, our homes, that if we had had this legislation, we would have had an opportunity to provide some relief for the people of Southwest Georgia. I believe that to be true representative, have all members voted. Have all members voted? All members voted. If so, the clerk will lock the machine on the adoption of the resolution. The eyes are 112. The nays are 30. This bill has failed to receive the requisite constitutional majority. What purpose does Chairman Lynn Smith rise? Mr. Speaker, I move to serve notice of my intent to move a reconsideration of House Resolution 594. The lady has that right, and I think we will vote on that tomorrow. Okay. House bill 1194 will be postponed until the next legislative day. What purpose does Chairman Hitchens rise? Make a motion. State your motion. I move that House bill 439 be moved from public safety and Homeland Security to judiciary non-civil. Chairman Hitchens has moved that House bill 439 be moved from the public safety and Homeland Security Committee to judiciary non-civil. The clerk will read the caption. House bill 439 will be titled and act to amend Title 40 and Article 7 of Chapter 8 of Title 42. The Fishgill of Georgia annotated relating the motor vehicles, traffic and ignition interlock devices respectively. So it's required the installation of ignition interlock devices in motor vehicles. On the gentleman's motion that House bill 439 be transferred from committee to committee, is there objection? Is there objection that Chair here is none? And the motion to transfer from public safety and Homeland Security to judiciary non-civil is so ordered. What purpose does Representative Scofield rise? Can you turn the mic on? I'm told if you go back to the middle one. Representative, you need to go to your assigned seat and that mic should be owned. I think we got it now. I move that the rules be temporarily suspended so that a bill may be read for the first time in a signed committee. Representative Scofield has moved that the rules of the House be temporarily suspended to allow a bill to be read for the first time in a signed committee. The clerk will read the caption. Unnumbered House bill by Representative Scofield, the 60th to be Tidal Nack to amend Title 34 of the Fishgill of Georgia. And send a relating to labor and industrial relations. On the ladies' motion that the rules of the House be temporarily suspended to allow a bill to be read for the first time in a signed committee, is there objection? The chair here is known and it is so ordered and that's assigned to industry and labor. What purpose does Representative Scofield rise? I make a motion, Mr. Speaker. State your motion. I move that the rules be temporarily suspended so that the bill a bill may be read for the first time in a signed committee. Would that be a resolution instead of a bill? A resolution, thank you. The clerk will read the caption. Unnumbered House resolution by Representative Scofield, the 60th proposing an amendment to the Constitution. So it's to create the family and medical leave insurance fund. Chairman Scofield has moved that the rules of the House be temporarily suspended to allow a resolution to be read for the first time in a signed committee. Is there objection? Is there objection? Is there objection? There is an objection. Does the lady move? Lady moves. Lady moves. All those in favor of the ladies' motion will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machine on the ladies' motion to suspend the rules. The eyes are 57, the knees are 72. It required a two-thirds vote and the motion has failed. What purpose does Chairman Hawkins rise? Make a motion. State your motion. Move the suspended rules so the bill may be read for the first time. Chair, you sure you want to? It's a very important bill. If it wasn't, I would not do this. I promise. I'm sure it is. Chairman Hawkins has moved that the rules of this house be temporarily suspended to allow a bill to be read for the first time in a signed committee. The clerk will read the caption. Unnumbered House bill by Representative Hawkins, the 27th and others. Be a title and act to amend Title 31 of the official bill to George Antietta relating to health. It's the way to create the Georgia Council on addressing health care workforce challenges. On the gentleman's motion that the rules of this house be temporarily suspended to allow a bill to be read for the first time in a signed committee, is there objection? There is objection. Does the gentleman move? Yes. The gentleman moves. All those in favor of the gentleman's motion to suspend the rules temporarily to allow a bill to be read for the first time in a signed committee will vote aye. Those opposed to the gentleman's motion will vote no and the clerk will unlock the machines. What purpose does Representative Stacy Evans rise? Mr. Speaker, isn't it true that a couple weeks ago I was pulling out the drawer of my desk and there was some paper stuck in the back. I was like, what is my drawer wrong close? It was some old letterhead that belonged to Representative Sharon Beasley Tee. And is it a true Mr. Speaker that I'm tired? As the lady says she wants to go home. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the motion. The eyes are 93. The nasor 43. This motion having failed to receive a 2-thirds vote is therefore lost. All right. We have a motion. We have some bills that have come back from the Senate that will all be assigned to the legislative and congressional reapportionment. Chair is asking for unanimous consent that those bills be read for the first time in a sign to committee. I'm sorry, the intergovernmental coordination. All intergovernmental coordination. My bad. Is there any objection to the motion? Chair here is none and it is so ordered. Clerk will read the caption to a group of privileged resolutions. Congratulations, commending, Pat Poular for receiving the 2022 Yellow Rose Nikki T. Randall Service Leader Award. Recognizing commending, Dr. Marshall David Almond. Congratulations, commending, Doris Arena Howard for receiving the 2022 Yellow Rose Nikki T. Randall Service Leader Award. Recognizing commending, Black voters matter. Recognizing June 27th, 2022 is Georgia Post-Traumatic Stress Injury Awareness Day. And June 2022 is Georgia Post-Traumatic Stress Injury Awareness Month. Recognizing and commending University System of Georgia Outstanding Scholars on Academic Recognition Day for 2022 and for other purposes. That completes the reading of the privileged resolutions. Is there any objection to the adoption of the privileged resolutions? Chair here is none and the resolutions are adopted. We're going on now to announcements. Going on to announcements. Once if you have signed up for an announcement, come down to the front of the chamber. Chair recognizes Chairman Newton for an announcement. Thank you, Mr. Speaker. The members of the Committee on Access to Quality Healthcare will meet in five minutes right up in room 403 here in the Capitol, 403 in the Capitol. Access to Quality Healthcare. Thank you. Chair recognizes Chairman Newton for an announcement. Chairman Newton, going once, going to us, Chair recognizes Chairman Newton for an announcement. Thank you, Mr. Chairman. The Chief of Justice Committee meeting that was scheduled for today has been canceled. We're trying to reschedule for next Tuesday. Thank you so much. Chair recognizes Chairman Jasper's for an announcement. Thank you, Mr. Speaker. Transportation, we are going to meet today, 506LOB in about 10 or 15 minutes. We have some visitors from out of town that want to testify, so we need to give them respect and be in listen. And we also have one bill that needs out. Thank you, Speaker. Chair recognizes Representative Barr for an announcement. Good afternoon, y'all. The Resource Management Subcommittee meeting that we're going to have in the morning has been moved to Monday at two o'clock in CLOB 406. Resource Management Monday at two o'clock. Thank you. Chair recognizes Representative Gullet for an announcement. Thank you, Mr. Speaker. The EV Charging Subcommittee of EUT will meet tomorrow morning at eight o'clock and 406 CLOB. Thank you. Chair recognizes Chairman Petry for an announcement. Thank you, Mr. Speaker. The meeting of human relations and aging for today has been canceled. It will be rescheduled for Tuesday at some time to be announced tomorrow. Chair recognizes Chairman Lumsden for an announcement. The Insurance Committee meeting schedule for this afternoon has been canceled. We will reschedule for next Wednesday morning. Thank you. We have had a phone. Listen up. You might want to check to see if you have your cell phone with you before you leave. We've had one turned in up here to podium. If it's yours, come claim it before I start reading all the content on it. Oh, no, I want to read the content on that one. That completes the announcements. Chair recognizes the majority leader for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House. Stand adjourned until 9.30, 9.30 a.m. Friday, March 4, 2022. The majority leader has moved that this House be adjourned until Friday at 9.30 a.m. All in favor of the motion will vote green. Those opposed, no just teasing. All those in favor of the motion will say aye. Those opposed, no. The I seem to have it. The House will be adjourned until Friday, March 4, at 9.30 a.m.",
  "updated_at": "2026-02-13T03:29:28.442331+00:00"
}