{
  "video_id": "-EaDY4VrnI4",
  "url": "https://youtu.be/-EaDY4VrnI4",
  "title": "Georgia House - Day 8 (2026-11-12)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": "2026-11-12",
  "duration_minutes": 26,
  "summary": "Here is a structured markdown summary of the Georgia House session from 2026-11-12:\n\n### Overview\nThe session focused on procedural matters, including roll call, COVID-19 protocols, and confirming the previous legislative day's journal. No substantive legislation was introduced or acted upon.\n\n### Key Actions\nNone detected.\n\n### Bills Introduced (First Reading)\nNone detected.\n\n### Notable Moments\n- Opening prayer and pledge of allegiance led by Pastor Eddie Allen.\n- Representative Jay Collins introduced the chaplain and shared personal remarks about their long-standing friendship.\n- Representative Wes Cantrell, Secretary of the Committee on Information and Audits, reported the previous legislative day's journal was found to be correct.\n- The order of business for the day was established by unanimous consent.\n\n### Votes\nNo recorded votes.\n\n### Attendance\nA quorum was present, with members voting to signify their presence.\n\n### Adjournment\nThe transcript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "They are convening having arrived. All members will please report to the floor of the house\nand take your seats. All members will report and take your seats. Mr. Clark, you want to ring\nthe bell.\nWe're about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines. Well, hello Friday. I almost dispensed with the roll call this morning, but then\nI thought, now I'm going to reward those that are here. Let's let y'all vote.\nThe chair wants to give a reminder before we convene this special session, we sent out\na advisory on the COVID-19 protocols for the special session. Those of you that are reaching\nfor your mask, that's what I was going to talk about. Mask on the floor in the chamber\nare mandated and in committees, not in your office. You don't need one. And if you're out\nof microphone in here, you do not need one. So thank you for your cooperation on that.\nWe will begin this beautiful day with Scripture reading in prayer by the chaplain after which\nto we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced\nby the gentleman from the 68th House District,\nthe chairman of the Public Safety and Homeland Security\nCommittee, Chairman Jay Collins.\nChairman Collins.\nThank you, Mr. Speaker.\nIt's a joy to be able to present the chaplain\nof the day today.\nPastra Eddie Allen comes to us from my hometown,\nVilla Ricca, Georgia, where he has been the pastor of the first Pentecostal Church there\nin Villa Ricca for the past 30 years.\nHe has two children, a lovely wife, Miss Penny, and he's been a vital part of our community\nfor a long time.\nHis family's been ingrained in our community for decades.\nThose of you who know me might have heard me talk about my dad.\nHe was the youngest of 17 kids, and his dad passed away when he was a young man or actually\njust a few years old. Brother Eddie's father had a store there in my town and my\ndad went to work there as a as a young teen and his dad really mentored my dad\nand showed him a lot of things about life and their family was just very good to\nmy family early on and Eddie and my dad grew up around and around together and\nI called my dad to say that Eddie was going to be the chaplain of the day\nday to day and my dad said you know son he said I've got a lot of friends he said but\nnone that I would trust anymore than my good friend Eddie Allen so today ladies and gentlemen\nI welcome pastor of the day pastor Eddie Allen.\nGood morning ladies and gentlemen it is an honor and privilege to stand before such a distinguished\naudience.\nJay, the representative of Jay Collins, thank you for the invitation.\nTo begin with this morning, I want to read an excerpt from the Apostle Paul's writings\nto the Church at Philippi.\nHe was encouraging unity, and I think the message still stands clear today in the world that\nyou and I are living in.\nHe begins with grace to you and peace from God our Father and the Lord Jesus Christ.\nI thank my God upon every remembrance of you, being confident of this very thing that\nhe who has begun a good work in you will complete it until the day of Jesus Christ.\nTherefore, if there is any consolation in Christ, if any comfort of love, if any fellowship\nof the Spirit. If any affection and mercy fulfill my joy by being like-minded, having the\nsame love, being of one accord of one mind, let nothing be done through selfish ambition\nor conceit, but in lowliness of mind let each esteem others better than themselves. Let\nBut each of you look not only for his own interests, but also for the interests of others.\nAnd then he says, let this mind be in you, which was in Christ Jesus.\nCan we bow our heads in prayer this morning?\nDear Heavenly Father, you are our God and eternal King.\nYou have created all things, and you are the source of every blessing.\nWe ask for your guidance and yield to your direction.\nWe pray that we would humble ourselves before you today, and that you would lead us in\nthe way that we should go.\nFather enlighten us that we may know your will.\nWe desire your glory and blessing in all that we do.\nWe thank you for each and every one who is in this room.\nWe ask that you would work mildly in us today.\nYour word says that all things work together for the good of those who love you.\nFather, we love you.\nWe place our hearts and our minds in your hands so that you may direct us.\nWe ask these blessings in Jesus' name, amen.\nNow we will pledge the legions to the flag.\nthe flag of the United States of America and to the Republic for which it stands, one\nnation under God, indivisible with liberty and justice for all.\nThank you.\nSometimes you can say a lot.\nBriefing.\nAnd my man is a preacher of friends.\nQuality's better than water.\nCan you say anything about that?\nI've been told this one.\nYes, sir.\nThank you so very much.\nChair recognizes the Secretary of the Committee on Information and Audits Representative\nWes Cantrell.\nMr. Speaker, it's the honor of my lifetime to pitch him today for the incomparable and\nunreplaceable Chairman Don Hogan, and to let you know that your Committee on Information\nand Audits has read the 171-page journal of the previous legislative day and found it\nto be correct.\nAnd furthermore, Mr. Speaker, in the words of the great philosopher, Yogi Berra, always\ngo to other people's funerals, otherwise they won't come to yours.\nChairman Hogan would have been proud.\nSecretary Cantrell, the chair of the Committee on Information and Audits, reports that the\nThe journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal that chair here's none?\nAnd the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMs. Burns, honor 59th, Ms. Follomey establishes the order of business during the first part\nof the period unanimous consensus, introduction of bills and resolutions, second reading of\nbills and resolutions.\nReports of standing committees warning orders\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nThe chair here's none in the resolution is adopted second reading of bills and resolutions the clerk will read\nHouse built in ex by represent Wilson of the 80th Oliver of the 82nd Evans of the 83rd to build to amend an act to authorize the governing authority of the city of Brookhaven to\n11XI's tax, Senate Bill 1EX by Senator Kennedy of the 18th,\nCouncillor of the 46th, Duggan of the 30th Gooch of the 51st,\nbark of the 11th and others that Bill to provide for the composition and number of state senatorial districts.\nSenate Resolution 5EX by Senator Dickson of the 45th, Goodman of the 8th,\nHatchet of the 50th, Anderson of the 24th, Strickland of the 17th,\na resolution ratifying Governor Brian Peak-Hemp's executive orders, three second readers.\nReports of standing committees, the clerk will read.\nI'm Senator Bonnie Rich, the 97 District Chairman of the Committee on Legislative and Congressional Reapportionment submitted the following report.\nThe Speaker Committee on Legislative and Congressional Reapportionment is that on the consideration of following bills of the Senate.\nIt's just struck to me to report the same back to the House following recommendation.\nSenate Bill 1EX, Dupas, respectively submitted representative Bonnie Rich, the 97 District Chairman.\nChairman that completes the reading the report to standing committees.\nAll right, we're going on now to morning orders.\nWe're going on to morning orders.\nWe have a number of morning orders today and the chair is going to ask members to\nlimit their remarks to two minutes each.\nPlease give the members and the will your attention and respect.\nChair recognizes, for a morning order,\nRepresentative Donna McLeod.\nRepresentative McLeod.\nGood morning, Mr. Speaker, good morning, colleagues.\nOn Tuesday, November 2nd, 2021, 16-year-old Timothy Barnes, Jr.,\nA.K.A. Tim Tim was murdered by a classmate\nwhile waiting for his school bus around 6.30 AM.\nTimothy was a student at Central Gwyneth High School.\nIn fact, the high school that my daughter graduated from in 2004.\nHe loved school and he loved sports.\nHe worked at the McDonald's in Grayson, Georgia.\nTimothy was the youngest of five children\nfor his mother, Latoya Nicholson,\nwho was home recovered from a car accident\nwhen she received the news that her son was gunned down.\nTimothy will be late to rest on Saturday,\nNovember the 13th, 2021 at 3 p.m.\nat the United Methodist Church on Beaver Room.\nOur deepest sympathy goes out to his mother,\nhis siblings, his family and friends.\nWe ask for a brief moment of silence for Timothy\nand the family who are now left behind to mourn his lost.\nThank you very much.\nChair recognizes representative Frazier,\nrepresentative Al Williams, Chairman Parrish,\nand representative Hugo Lee for a morning order.\nThank you, Mrs. Speaker.\nTo all my colleagues that are gathered here with us today, we are here to honor a beautiful,\nbeautiful, remarkable leader that we lost in September, Miss Deborah McGee-McClairey,\nthe CEO of the Sickle Cell Foundation\nfor the state of Georgia.\nI received a call on September the 12th,\nactually from Miss, and we call her Dell, from Dell.\nIt's a call that I will never, ever forget.\nAnd a call that I hope many of you will never receive.\nIt was a call to tell me goodbye.\nShe called to tell me, thank you for your service.\nThank you for all of you all that are gathered here\nthat have helped our constituents,\nover 7,000 that live with this dreadful disease\nevery day of their lives.\nShe fought her own battle, but she was always there\nfor every constituent here in Georgia, Fiscal South.\nShe was a woman of remarkable poor.\nShe cared for a cause that her father, physician,\nand medical colleague and friends started back in 1971\nIn 2012, Deborah McGee McClary was named the President\nand CEO of the Sickle Cell Foundation of Georgia.\nThere she led an incredible team.\nThe Sickle Cell Foundation, Board of Directors,\nstaff has here her family and her children\nthat are stretched across in four states\nare actually on live watching us now.\nFor those who knew her, for the many visits\nshe made here at the Capitol doing Sickle Cell advocacy day,\nwill forever remember Ms. McGee McCleary\nas a woman of incredible focus and resolve.\nAnd she never forgot what her real goal was\nand that was helping our constituents\nwho live with this disease.\nI just wanna say to the family,\nwe sent our sincere condolences to the family\nand to our Sickle Cell Foundation.\nBut just know, over the 30 minutes that I talked to her,\nwhich I did not know would be my last conversation,\nI told her that we would continue the fight here at the state capital to make life better\nfor all that lives with sickle cell disease.\nAt this time, I would like to have a moment of silence to honor this remarkable Georgia.\nThank you.\nThank you, Mr. Speaker.\nrecognize this chairman Cooper for a morning order.\nThank you very much. Colleagues, I know that most of us are looking forward to\nThanksgiving, but I'm asking you to go a little farther out and think about\nChristmas. Every day when we come in to the Capitol and we go out, I pass two\nboxes down there, and they are very empty. They are the toys for tots, box, for children,\nneedy children, who may get very little for Christmas. So I'm asking you to stop by\nWalgreens or some your way home or another pharmacy or a toy shop and pick up a little\ntoy and bring it back with you when you come to the capital on Monday and put it in that\nthat box. Let's fill that both of those boxes to the top. I mean, this was at Walgreens.\nIt's a cute little tea set complete with food and spoons and cups and saucers. It was\n$7 at Walgreens. But that $7 will bring a lot of joy to some child on Christmas morning.\nSo I hope you'll join with me. Let's fill those boxes up. Thank you very much and thank\nThank you, Mr. Speaker.\nChair recognizes Chairman Chokus for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues, and happy Friday.\nRarely, do we get to share things from the well that can actually save a life and\nespecially with the COVID lockdowns, there's been an increase in domestic violence and\nGovernor Kemp's initiative to combat sex trafficking has shown that we all need to help these powerless victims.\nI thought that I would\nLike to share with you the international non-verbal sign for help\nlearn it now. It was created by the Women's Funding Network of Canada and has\nalready saved lives in the UK. Here it is again, hands out, thumb in, fingers\ndown. Use it, recognize it, and act upon it. If you see it, please call 911. Thank\nThank you. Thank you, Mr. Speaker.\nChair recognizes Representative Mayna for a morning order.\nChair recognizes Representative Holley for a morning order.\nThank you, Mr. Speaker.\nI just want to say that my heart is going out and sure as many of us are here with those\nwho are working in the John Deere factories throughout our state.\nWe realize that for an American company that has provided this state with the wealth\nthat agriculture has been able to bring in.\nRealize, too, that when it comes to the workings\nand their families, it's necessary for us to remember them,\nespecially as we go into this holiday season,\nthat wages are important.\nAnd as much as we believe that for these factories,\nthey oftentimes may have robots.\nThis is, let me tell you, so oftentimes,\nwe have men and women who are working hard every single day\nto make sure that they can not only provide food\nfor their families, but that they can have a future.\nSo as we wait in the fourth week,\nwhile these labor negotiations must be had\nwith the workers, the United Auto Workers,\nand these John Deere Facilities,\nlet us remember that is why we claim to have a full love\nfor this country and our manufacturing traditions.\nWe have to make sure that we are taking care\nof our American workers.\nI'll send what you know, thank you.\nAll right, that completes morning orders.\nMr. Clark, we don't have a local calendar today.\nOkay.\nFork will read the caption to a group of privilege resolutions.\nCommending STEM Atlanta women and for other purposes that completes the reading of privilege\nresolutions.\nIs there any objection to adopting the\nprivilege resolutions that Chair\nhere's none and the resolutions are\nadopted?\nAll right, we have, we have some birth\ndays. Today, today, I'm excited about this one. The birthday of representative Billy Mitchell,\nwish you a happy birthday. On Sunday, you've got the birthday of representative Duane\nGreen Hill, Chairman Butch Parish, and Representative Sandra Scott.\nWhat purpose does Representative L Williams rise?\nParliamentary inquiry.\nI like to lodge a formal protest that we showed up today in spite of Billy Mitchell's birthday.\nWell had I known, we would take it off.\nWe could have taken off, we can take off something next week and trade for the week after.\nYes, everybody's thinking about that one.\nAll right, we have an announcement, Chair recognizes the Chairman of the House Rules Committee,\nChairman Smith for an announcement.\nThank you, Miss Speaker of the House Rules Committee, we'll meet Monday at 9 o'clock\nin room 341, Monday at 9 o'clock, thank you.\nThat completes the announcements.\nrecognizes the majority leader of the house for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this house stand adjourned until 10 AM Monday, November the 15th, 2021.\nThe majority leader has moved that this house be adjourned until Monday, November 15 at 10\na clock a.m. All those who favor the motion will say aye. Those opposed will say no. The\neyes appear to have it and this house will be adjourned until Monday morning at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T12:50:09.10678+00:00"
}