{
  "video_id": "-GnY0Z_xY7g",
  "url": "https://youtu.be/-GnY0Z_xY7g",
  "title": "Georgia House - Day 9 (2026-02-01)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-02-01",
  "duration_minutes": 55,
  "summary": "Overview: The Georgia House of Representatives session on February 1, 2026 featured a Scripture reading and prayer by Reverend Matt Peek, as well as the introduction of notable legislation and some procedural matters.\n\nKey Actions:\n**HB101**: [Description of HB101]\n**HB102**: [Description of HB102]\n\nBills Introduced (First Reading):\n- [List of any bills introduced]\n\nNotable Moments:\n- Reverend Matt Peek, introduced by Chairman Sam Watson, delivered a sermon emphasizing the importance of seeking God's guidance when faced with difficult decisions.\n- Reverend Peek shared a story about Billy Graham to illustrate this point.\n\nVotes:\n- [Details on any recorded votes, including outcomes]\n\nAttendance:\n- Quorum was present, as indicated by members signing in electronically.\n\nAdjournment:\n- The session adjourned at [time]. The next session is scheduled for [date].",
  "transcript": "They are of convening having arrived, all members will please report to their assigned seats.\nAll members will report to the House of Representatives.\nThe clerk will ring the bell.\nAll right, we're about to have the morning roll call.\nto have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber,\nand the clerk will unlock the machines.\nall members voted have all members voted have all members voted have all members\nnow voted well if you haven't then you can see the clerk\nThe door keepers will please close the doors and keep them closed.\nGood morning.\nHope everyone had a great weekend.\nWe will begin our day and week with Scripture reading and prayer by the chaplain,\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 170 second house district,\nChairman Sam Watson.\nChairman Watson.\nThank you, Mr. Speaker.\nI tell you, it's always an honor to bring our pastors\nto the Capitol, to allow them to share.\nAnd I think there's no better way to start the day\nthan this, so thank you.\nBut today, I bring my pastor, the Reverend Matt Peek.\nMatt is originally from Tomiston, Georgia.\nHe had graduated from the Grange College in 2008.\nWhile attending the Grange College,\nhe was asked to serve as the youth minister there\nat East Vernon Baptist Church in the Grange.\nAnd that is where Matt truly found his calling.\nIn 2009, first Baptist Church,\nMaltry hired Matt to serve as our youth minister.\nOf course, we quickly realized that he was gifted\nat sharing the gospel with youth and adults alike.\nBut Matt also found his bride in Maltry.\nAnd so we thought that was a win-win.\nAnd anyway, in 2014,\nGod called Matt and Leanna to tell him first about his church.\nAnd so we were disappointed to lose them,\nbut we also knew that God had a plan\nfor this young preacher.\nBut in late 2019, our senior pastor retired\nand the Lord called Matt back to motry\nand Leanna and the kids.\nAnd so we were excited to have them back.\nHe does a phenomenal job at sharing God's Word\nand ministering to the people,\nnot only in our church, but in our community as well.\nBut his wife, Leanna, him and his wife, Leanna,\nhave four beautiful children, Maddie Claire, John David,\nEllie, and Ruthie.\nAnd so I know they're probably at home watching a dad on TV.\nBut I was trying to think about how to introduce Mad\nthis morning.\nAnd so I was reminded of his sermon yesterday\nand what he preached about yesterday.\nAnd he talked about how God is good.\nGod is, regardless of the circumstances,\nGod is always good and he's always faithful.\nAnd that's what I would say about Matt.\nHe is good.\nTeaching and preaching are no doubt the duties\nthat lie nearest to him.\nAnd I hope he's going to bring something good\nand much needed to us today, the Reverend Matt Pete.\nWell, good morning.\nThank you Speaker Alston for the invitation to come and share with you today and I appreciate all of you members of the House\nWe're inviting me to come and share a word today from from God's Word. I want to thank you first of all for your service to our state\nAs Sam mentioned, I'm a lifelong resident of Georgia and I'm grateful for all that you do to keep our state running running well\nI want you to know that we pray for you specifically as a church as a church family\nWe pray for you that the Lord will give you wisdom and God you and your decisions as a matter of fact\nWe had a special time of prayer before this most recent session that the Lord would guide you and the decisions that you make\nYou know as a representative of Watson mentioned earlier like I said I was born here in the state. I was born over on the\nOn the Georgia coast I grew up in the hills and the woods of central Georgia and\nSince 2004 my family has resided down in South Georgia along with about 8 billion mats\nbut we are glad to be there and we are thankful to be serving now at our first\nBaptist of Motri. But you know as a student growing up here in Georgia I\nremember as a middle school student the only other time I had been to this\nbuilding was as a middle school student on a field trip. I remember coming here\nwith my class and unfortunately as a middle school student I was not as much\ninterested in bills as I was interested in girls so I don't remember too much\nabout that experience but I am grateful to be here this time with a better\nunderstanding of what you do and a greater appreciation of the service\nthat you provide to our great state. But you know, being from South Georgia, I'm\nnot as familiar with Atlanta, I'm not as familiar with the streets here in\ntown. So I have to rely on some good directions to get me into where I needed to\ngo. And I'm grateful for the directions that the speaker's office provided to\nme to get me here on a timely manner to get here at the right time. But it\nreminded me of a story I once heard about the great preacher Billy Graham, you\nBilly Graham, a faithful minister for many years, and as the story goes, Billy Graham once\nwent to a town to preach a crusade, and as he was there, he had the need to mail something\nat the local post office.\nBut being the first time there in town, he wasn't exactly sure where to go, so he saw\na young child playing on the street corner there on the sidewalk, and so he went up to\nthe boy and he said, son, would you mind telling me how I can get to the post office?\nSo the boy told him the directions turn here, turned there, and Billy Graham thanked him,\nand he said, hey son, he said, tonight,\nif you'll come to the football stadium,\nI will tell you how you can get to heaven.\nAnd then a little boy responded, no thanks.\nYou don't even know how to get to the post office.\nWell, I'm proud to tell you I know how to get to the post office.\nAnd I now know how to get to the Capitol\nand can find my way to this room.\nBut today I want to take just a moment\nand talk to you about finding your way\nwhen you don't know where to go\nand when you don't know what to do.\nYou know, this last year has been a very difficult year\nfor all of us who have been in leadership,\nthose of us in church leadership\nand government leadership like yourself.\nWe've been through a very difficult season.\nA lot of difficult decisions have had to be made.\nWe've been through an unprecedented time\nwith the COVID-19 pandemic.\nAnd it leads to a very important question today.\nWhat do we do when we don't know what to do?\nHave you ever had a time when you just frankly\ndidn't know what to do?\nWhether it was a decision that you were a part of\nor maybe a vote comes up on this house floor,\nhow do you vote?\nWhat should you do?\nWhat do you do when you don't know what to do?\nWell, I would encourage you today to follow the example\nof the great Billy Graham and ask for directions.\nWhen you don't know what to do, ask for directions,\nbut it's not so much asking for directions\nthat as it is knowing whom to ask for directions.\nAnd so with that in mind this morning,\nI'm gonna briefly tell you a story from scripture\nabout a man who didn't know what to do\nand how he asked for directions.\nThe man's name was Jehosephat.\nHe may have had a very weird name,\nBut Jehosephat was the king of Judah\nback in the Old Testament times.\nAnd Jehosephat was a good king.\nHe loved the Lord and he desired to do what was right\nand lead the people of Judah to follow God in his commandments.\nBut unfortunately, one day, King Jehosephat looked out\nof his window and he noticed that there were armies\nmarching against him and the people of Judah.\nThere were many soldiers from foreign lands\nwho had gathered to come and to lay siege upon Jerusalem\nand his people.\nAnd Jehosephat, frankly, didn't know what to do.\nSo what he did was when he didn't know what to do,\nHe decided to ask for some direction, and so we called out to God in prayer.\nIf you go in your Bible to 2 Chronicles chapter 20, you can read the Word for Word, the\nprayer of Jehosephat, when he didn't know what to do, is enemies pressed in around him.\nBut I would like to read for you just very briefly, one verse.\n2 Chronicles chapter 20 verse 12, Jehosephat prayed, oh our God, we are powerless against this\ngreat horde that is coming against us.\nWe do not know what to do, but our eyes are on you.\nJoseph had didn't know what to do, but he knew who did.\nAnd so he called out to the Lord in prayer\nand he asked God to provide the direction\nthat he so desperately needed.\nAnd you know, if you keep reading in second chronicles,\ndo you know what happened?\nGod heard his prayer and he responded\nand he gave Joseph that in only direction,\nbut he gave in victory.\nGod told Joseph that he didn't even have to lift the finger\nthat God would take care of his issue\nand God caused all the enemies of Judah\nto fight amongst themselves until there was not\na single one left.\nand God miraculously delivered the people of Judah that day\nas a result of the prayer of King Jehosephat.\nAnd so ladies and gentlemen of the house,\nmy prayer for you today is that you will keep your eyes\non the one who knows what to do.\nI know that there are gonna be times maybe even today\nas you meet in committees or as you even meet on this house floor\nand you are voting or making decisions.\nThere are gonna be moments where you question\nwhat you should do, question what is right,\nquestion what is the right direction that you should go?\nWhat is best for our state?\nThere are going to be moments\nwhen you do not know what to do.\nAnd in those moments, I encourage you to call out\nto the one who does.\nTo call out to the Lord for wisdom.\nHe tells us that if we call to Him,\nHe will answer us and tell us great and mighty things\nthat we do not know.\nSo whatever situation you find yourself in today\nand in the coming days, I implore you\nto call out to the Lord for directions.\nWhether you think you know what to do or not,\nfrankly, it doesn't matter what we think,\nit matters what the Lord thinks.\nAnd so I encourage you to seek Him in all the decisions.\nAnd if you do, the Lord will see you\nto where you need to go as you follow him.\nWould you stand and let's join together in prayer this morning?\nFather God, I thank you for your word.\nAnd I thank you for the opportunity today to gather\nwith these fine ladies and gentlemen\nand share in time in your word together.\nI thank you for each of them Lord.\nI thank you for what they do.\nI thank you for the dedication,\ntheir dedication father to the people of this state.\nI thank you for the sacrifices that they make God\nto come here, to make decisions and to lead our state well.\nFather, I ask that you would bless them,\nask that you would protect them,\nask God that you would give them the energy\nand the strength that they need, Father,\nto accomplish the task that is set before them.\nAnd Father, I pray that you would help them\nto be people of integrity and every decision that they make.\nAnd Father, would you guide them?\nWould you tell us in your word, the word we read today,\nLord, when we don't know what to do, you do.\nAnd so Father, may we all be a people\nwho look to you, Father, for direction and for wisdom.\nFather, our world has many ideas of what is right,\nbut Father, you set the standard\nand so God may we lean on you.\nWe love you, Father, may we look to you, Father,\nand may you lead us as we follow you.\nAnd we ask all these things in the name of your Son\nwho gives us salvation.\nWe ask this in Jesus' name, amen.\nAmen.\nWould you join me in the Pledge of Allegiance?\nI pledge allegiance to the flag\nof the United States of America.\nand through the Republic for which it stands,\none nation under God, indivisible,\nwith liberty and justice for all.\nDoorkeepers will unlock the doors.\nAll right, before we move on with our business, the chair wants to make an announcement.\nwill continue downstairs until 11 a.m. 11 a.m. you've got 30 minutes if you have not been tested.\nIf you are present today and do not get a test then you will not be admitted to the chamber\nor to the house on Tuesday or Wednesday. So please feel free if you haven't gotten your test to\ngo. Take care of that at this time. Chair recognizes Chairman Hogan, the chair of the Committee\non Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits\nhas read the journal of the previous legislative day and found it to be correct. And furthermore,\nMr. Speaker, the one who plants trees knowing that he will never sit in their shade has\nstarted to understand the meaning of life.\nChairman Hogan, the chair of the Committee on Information and Audits reports that the\njournal of the previous legislative day has been read and found to be correct. Is there\nany objection to the confirmation of the journal that Chair here is not in the journal is confirmed?\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, 159th moves the following be established as the order of business\nduring the first part of the period unanimous consent introduction of bills\nand resolutions first reading and reference of House bills and resolutions\nsecond reading of bills and resolutions morning orders.\nIs there any objection to the adoption of the resolution establishing the\norder of business for the day the chair here is not in the resolution is\nadopted. First reading of Bills and Resolutions, the clerk will read.\nHouse Bill 5 by Ripson of Scott of the 76th canon, the 58th Mitchell, the 88th\nJackson, the 64th of Bernal, the 77th, will be entitled Act of Men Chapter 27,\ntitle 50, the physical to Georgia, and intated relating the lottery for\neducation. Higher education, House Bill 7 by Ripson of Scott of the 76th\nGilear to the 160th second park on the 101st, Bentley the 139th, Nelson\nin the 125th, they'll be taught an act to men,\ntitle 20 of the physical to Georgia annotated relating\nto education higher education.\nHospital 11 by reps and of Scott of the 76 Davis,\nthe 87th Rover Show, the 48th,\nScofield, the 60th and Hutchinson, the 107th,\nthey'll be taught an act to men chapter 7\nand title 31, the physical to Georgia annotated relating\nthe regulation and construction of hospitals.\nHealth and human services.\nHospital 12 by reps and of Scott of the 76,\nGofield of the 60th Duke of the 154th,\nmentally 88th, and Hutchinson of the 107th.\nBill Bitton, an act to amend chapter 13 in title 16.\nThe official go to Georgia annotated\nrelating to controlled substances.\nJudiciary non-civil.\nThat's Bill 13, my person, of Scott of the 76th\nDuke of the 154th, Davis of the 87th.\nScofield of the 60th, Hutchinson of the 107th,\nand others, Bill Bitton, an act to amend.\nArticle two, chapter three, a title 35.\nThe official go to Georgia annotated\nleading the Georgia Crime Information Center.\nJudiciary non-civil.\nPossible 22 by Robson of Scott of the 76 Davis\nto the 87th Canada 58th, Jackson the 64th\nand Williams the 168th.\nThey'll be tauted back to amend part two.\nVarticle on chapter three, a tautal 80.\nThe fish go to Georgia annotated relating\nthe powers of housing authorities generally.\nGovernmental affairs.\nHousehold 195 by Robson of Clark on a hundred and eighth,\ndrier of the 59th, Park of the 101st,\nHutchinson, 107th Couch, the 50th and others.\nBill B. Tottenham, act to men, article six,\nthe chapter two, entitled 20.\nThe official go to Georgia, annotated,\nrelating to Quality Basic Education Act.\nEducation.\nHouse Bill 196, vice versa, green to the 151st.\nBill B. Tottenham, act to men, the act,\nreconstituting the Board of Education, Terrell County.\nIntergovernmental Coordination.\nHouse Bill 197, vice versa,\nthe Lewis Ward of the 109th, Bodie,\nthe 62nd, claim to the 100th,\nmore than 95th in park 101st.\nBill Bitton and act to men chapter one of title 34,\nthe official go to Georgia annotated relaying\nthe general provisions relative to labor\nand industrial relations.\nIndustry and labor.\nHouse bill 198, I represent a singleton in the 71st\nmeant that 133rd Williams, 168,\nbuilt in the 112th Gilligan in the 24th and others.\nBill Bitton and act to amend code section 487, 27.\nThe physical go to Georgia annotated relaying\nin a computation of taxable income.\nWays and Mains, hospital 199,\nI would say, Walensky, the 79th,\nCollins, the 68th, Rich, the 97th,\nJones, the 25th,\nRoboShow, the 48th, and others,\nbuilding title and act of men code section 40, 14, 18,\nthe official code of Georgia annotated,\nrelating enforcement of speed limit and school zones.\nMotor vehicles,\nhospital 200 by reps,\nand Apollo, the 32nd,\nBill being titled an act of men, title 40,\nthe official go to Georgia annotated relating\nto motor vehicles and traffic.\nMotor vehicles.\nHospital 201 by representative Evan is the 57th Bruce,\nthe 61st Oliver, the 82nd,\nBen of the 94th, Scott of the 76th and others.\nBill being titled an act of men, chapter 2,\nthey're titled 20, the official go to Georgia annotated\nrelating to elementary and secondary education.\nHouse Bill 202 by resident of pitches,\n161st Burns on 59th, P3, the 166 lumps into the 12th,\nand gravely the 67th,\nthere'll be a ton of active men,\nArticle 10 of chapter 21, in total 15.\nThe official go to Georgia annotated\nrelating to Georgia drivers, education, commission.\nMotor vehicles, house bill 203,\nby represent of P3, the 166 Stevens, the 164th,\nto low to the 167 St to the 180th,\nHitchens, the 161st and others,\nthere'll be a ton of active men code section 42,\n80-60 fish go to Georgia annotated relating to special license plate motor vehicle\nhospital 204 by ropes and a scot of the 76 firing on 35th men in the 94 scope field the 60th\nfor now the 77th and others will be entitled back to provide a comprehensive state civil rights law\nprotecting individuals from discrimination and housing\njudiciary house bill 205 hours and it Williams 148th lumps into the 12th hatch into the 150th\nwith Taylor, 173rd, Roads of the 120th and others,\nBill Bitton and Acto Men, Title 33\nof the Fiscal of Georgia Amountated Relaying Insurance.\nInsurance.\nHouse Bill 206 by reps and Jones of the 47th\nof the Cantrello of the 22nd,\nBill Bitton and Acto Men,\nand Acto incorporate the City of Milton\nin Fulking County, Georgia.\nIntergovernmental Coordination.\nHouse Bill 207 by reps and Corbett of the 174th,\nRidley the 6th part of the 5th,\nWatson the 170 second and Roads of the 120th.\nWilmington, act to amend title 40,\nthe official go to Georgia annotated,\nrelating to motor vehicles and traffic.\nMotor vehicles.\nHospital 208, by reps of Chocus,\nthe 138, Jasper, to the 11th,\nor one of the 28th, LaRickia,\nof the 169th and Jones to the 25th.\nWilmington, act to amend chapter four,\ntitle one of the official go to Georgia annotated,\nrelating to holidays and observances.\nState planning and community affairs.\nHospital 209.\nI'm Senator McLeod of the 105th,\nRobert Show of the 48th, Clark of the 108th,\nMcLeod of the 100th, Carter of the 92nd.\nBill B. Todd of NACTIMENT, chapter 4, title 49.\nThe official go to Georgia annotated,\nrelating to public assistance.\nHealth and human services.\nHospital 210 by Roger.\nThe Corp. of the 174th, part of the 5th,\nWatson of the 172nd, Rose of the 120th,\nand Ridley of the 6th.\nBill B. Todd of NACTIMENT, article 2, chapter 3,\nTitle 40, the physical to Georgia annotated, really,\nthe certificates of title and motor vehicle.\nMotor vehicles, house of Resolution 1 by Representative Scott\nof the 76 can in the 58th, Mitchell, the 88 Jackson,\nthe 64th in Bernal, the 77th, a resolution proposing\nand amended the Constitution so as to authorize a general\nassembly to provide for the proceeds of one or more\nlottery games.\nHigher education house, Resolution 70 by reps.\nI'm Scofield, the 60th Thomas, the 65th Davis,\nto the 87th Buckner, the 137th,\nEvans to the 83rd and others,\na resolution supporting a stake goal\nof 100% clean energy by 2050.\nNatural resources and environment.\nHouse of Resolution 71 by Representative Wilson\nto the 80th Beverly, 143rd Williams of the $168\nover the 82nd and Nullowitz of the 42nd and others,\na resolution urging the United States\nrepresentative for Georgia's 14th\nCongressional District to Resign from the 117th Congress.\nRules.\nHouse Resolution 72.\nMy residents go through the 60th Scott of the 76th Davis\nof the 87th Cloud of the 105th Hutchinson,\nthe 100th and the 7th and others.\nResolution urging the United States Congress to enact\nlegislation placing a moratorium on negative credit\nreporting during the pandemic.\nBanks in banking.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 1 by Representative Bonner of the 72nd Earhart of the 36th Jones of the 25th Williams of the 145th\nGallaud of the 19th and others are bill relating to education House Bill 156 by Representative Parsons of the 44th Martin of the 49th\nKelly of the 16th Smith of the 133rd Knicks of the 69th\nThe bill relating to military emergency management and veteran defares in state government house bill 157 by represent Irwin of the 28th and Anderson of the 10th the bill to provide a new charter for the town of Mount Aria\nHouse bill 158 by Representative Crow of the 110th Gamble of the 15th McDonald of the 26th and Williams of the hundred and 45th the bill relating to general provisions relative to registration\nOperation and sale of watercraft, hospital 159 by REMSA Parsons of the 44th.\nMartin of the 49th, Cali of the 16th, Smith of the 130th, NYX of the 69th, the bill\nrelated to military emergency management and veterans affairs.\nHospital 160 by REMSA, about you the 62nd, drier of the 59th, go filled with the 60th,\nthe bill relating to water and sewer projects and costs tax, hospital 161 by REMSA,\ntankers leave the 160th, Dickie of the 140th, Fleming of the 125th, Richard the 97th,\nHouse bill 170, the bill relating to downtown development authorities, House bill 162 by Representative Belton of 112.\nA bill to amend and act to create the Board of Elections and Registration for Morgan County.\nHouse bill 163 by Representative Cooper of the 43rd Gaines of the 117th TEMC, the 13th to the 5th, the 118th Flums of the 12th,\nthe bill relating to medical assistance.\nHouse bill 164 by Representative Douglas of the 78th.\nCooper of the 43rd, 5th, the 118th Stevens of the 164th, and Evans of the 57th, the bill relating to insurance.\nHouse Bill 165 by Reptile Bar 103rd and Hitchens of 161st Clark with 147, Mix of 178,\nClemson of the 12th and others, Ability to Orange Exhaust Systems, Mirrors when Shields\nTired Safety Belts and Energy Absorption Systems, House Bill 166 by Reptile Bar 36, Ability\nto State Bar Georgia House Bill 167 by Reptile Davis of the 87th, McLeod of the 105th,\nChicago of the 76th, Gofield of the 60th, Barnell of the 77th and others Ability to State\ngovernment. House Bill 168, by members of Petrie of the 166th,\nEvans of the 164th, Williams of the 115th, Fleming of the 121st\nClark of the 147th and others, Bill will then take confidentiality of\ninformation supplied by inmates, House Bill 169, by members of\ncooperative of the 174th, Bradley of the 6th month, and of the 17th\nPark of the 155th, Watson of the 172nd, Bill will then\nto requirements for issuance of commercial drivers license or\ninstruction permit, House Bill 170, by members of park of the\n101st, Drenner of the 85th, Mitchell of the 106th, Clark of the\n118th Friday, 118th and others will be related to imposition rate and computation of income tax.\nHouse bill 171 by round to a park of 111st monthly of 139th Feudley of 136 rubber show,\nthe 48th Friday, 118th and others will be related to income tax.\nImposition rate, computation and exemptions.\nHouse bill 172 by round to the ticket of 114th and washburn of 141st.\nBill to amend and act, incorporating the City of Culloden and the County of Monroe.\nHouse Bill 173 by Representative Benchon of the 31st War Cies of the 157th Stevens of the 164th,\ndown to the 26th, with hour of the 119th, the bill relating to eligible\narch-retirement systems authorized to invest in a certain alternative investments.\nHouse Bill 174 by rest of the week, hour of the 119th, gains with 117th,\nthe Smith of the 18th, for the 110th, for the 33rd and others, the bill relating to safe operations\nof carriers, commercial motor vehicles and drivers, safe transportation, hazardous materials\nand penalties, hospital 175, everything about you, the 60-second checks, and the 64th,\nMcLaren, the 51st, Scuffield, the 60th, Bennett, and the 94th, and others,\navailable relating to assault and battery, hospital 176, Byron,\nSempuck, nerve 137th, Oliver, the 82nd, Clark, the 100th, Naked,\nclaims with the 37th, Allen, or the 40th, and others, available relating to\ngeneral provisions, relative to solid waste management,\nhospital 177, Riberts, and Banner, or the 72nd,\nJones, or the 47th, Greenfield, or the 34th, which is the 97th,\nof the 122nd and others,\nbill relating to general provisions regarding torts,\nHouse Bill 178 by remissant bonner of the 72nd Ballinger,\nthe 23rd of Jones of the 47th gains of the 117th base,\nmore of the 63rd and others,\na bill relating to naming change, House Bill 179,\nby remissant camp of the 131st rich of the 97th bar\nof the 20th homes of the 129th,\nat the heck of the 73rd and others,\na bill relating to special license plates,\nHouse Bill 180 by remissant lemon, the 99th main,\nor the 56th Lopez of the 86th Thomas of the 65th,\nBill relating to General Provisions of State Government, House Bill 181 by Representative Limit of the 99th Park with a 101st Mayor of the 56th Thomas of the 65th, 518th Bill relating to General Provisions of Labor and Industrial Relations, House Bill 182 by Representative Limit of the 99th.\nLocke has a D-86, the main area of the 56th Thomas of the 65th, and bill relating to the Department of Economic Development.\nHouse bill 183 by reps of lemon, the 99th main area of the 56th Thomas of the 65th, bill relating to the fair business that's practices Act House bill 184 by reps of lemon in the 99th main area of the 56th Thomas of the 65th,\nrelating to unfair or deceptor practices in consumer transactions and lawful\nand examples, House Bill 185 by Representative Limit the 99th.\nThe owner of the 56th, the Bill relating to Orange Exhaust Systems and Mirrors.\nWindshields, higher safety belts and energy absorption systems.\nHouse Bill 186 by Representative Limit the 99th.\nThe owner of the 56th, the pass of the 88th.\nThomas of the 65th, the Bill relating to zoning procedures.\nHouse Bill 187 by Representative Limit the 99th, the owner of the 56th.\nThomas of the 65th, the Bill relating to general provisions applicable to counties,\nin municipal corporations and other government entities.\nHaspil 188 by remiss of the Limb of the 99th,\nMaynard 56th, win of the 89th.\nThomas of the 65th,\na bill relating to eligibility and procedures\nfor certain through notification of minority\nbusiness enterprises and appeal of denial.\nHaspil 189 by remiss of Wilson of the 80th.\nEverly of the 143rd,\nwith Dukely of the 136th,\npendent of the 94th Evans of the 57th and others,\na bill relating to general provisions\nregarding the general assembly.\nHaspil 190 by remiss of the Holcomb of the 81st,\nParis to the 142nd, Canada to the 102nd.\nMitchell to the 106.\nYou believe the 136 and others\nwill be relating to penal institutions.\nHouse Bill 191 by reference to the bend end of the 31st.\nPal of the 32nd, Smirer to the 135th green,\nthe 151st parish of the 158th and others\nwill be relating to Georgia legislative retirement system.\nHouse Bill 192 by reference to the Sains of the 180th\nper shed of the 176th, South Traction of the 104th,\nand Hitchens of the 161st,\nthe bill relating to interference\nwith electronic monitoring devices.\nHouse Bill 193, by reps and sayings of the 180th,\nper shed of the 176th,\nfrustration of the 104th and hitches of the 161st,\nthe bill relating to sexual assault protocol,\nHouse Bill 194, by reps and sayings of the 180th,\nper shed of the 176th,\nfrustration of the 104th, hitches of the 161st,\nbill relating to procedure for sentencing\nand imposition of punishment.\nHouse Resolution 52, by reps and density of the 13th,\nCampbell of the 15th, Oliver, 18th, second,\nCooper of the 43rd, pair to the 158th,\nresolution creating a joint study committee\non childhood led exposure.\nHouse Resolution 53 by Rep. Scothield to the 60th Scott of the 76th Davis of the 87th\nand the plow to the 105th Hutchinson of the 107th and others. Resolution urging Congress\nto place a moratorium on the three main credit reporting bureaus suspend credit downgrades\nand not remove other negative of impacts on personal or business credit reports during\nthe pandemic. House Resolution 54 by Rep. Scothield to the 104th Resolution honoring the life\nof Mayor Jimmy Wilbanks and dedicating a road in his memory. House Resolution 55 by Rep. Wilson\nof the 80, acutely, the 136th minute of the 94th Evans of the 57th Roberts of the 52nd\nand others. A resolution proposing amendment to the Constitution so as to provide that\nthe legislative and congressional reinforcement be done by an independent nonpartisan commission\ninstead of the general assembly. House resolution 56 by Representative Singleton of the 71st\nPowell of the 32nd Hogan of the 179th Tarvon of the 2nd. Control of the 22nd and others.\nResolution proposing amendment to the Constitution of the State of Georgia so as to clarify\nthe only citizens of the United States for a residence of this state shall have a right\nto vote in elections in this state for your second readers.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nOkay, we're going on now to morning orders, going on to morning orders.\nIf you have signed up for a morning order, Chair is going to ask that you limit your remarks\nto no more than two minutes each.\nAnd also, if you signed up for one to make you wait at the front of the chamber, Chair\nrecognizes Chairman Darlene Taylor for a morning order.\nThe House will be at order.\nChairman Taylor.\nThank you, Mr. Speaker.\nToday I come to honor one of South Georgia's favorite sons, Jackie Robinson.\nHe was born it was 102 years ago yesterday, January 31, 1919 in Cairo, Georgia, to Jerry\nand Mallie Robinson, Jackie was the youngest of five children.\nAfter his father left his family, the mother moved them to Pasadena, California.\nHe graduated from Washington, Junior High School, and went on to John Moore High School,\nwhere his athletic abilities were discovered.\nHe excelled in many, many sports.\nWhen completing his studies in high school, he attended Pasadena Junior College where he\ngraduated in 1939.\nHe enrolled at the University of California and became the university's first student\nto win a varsity letter in four sports, baseball, basketball, football, and track.\nJackie's oldest brother, Matthew, inspired him to pursue his talents and love of athletics.\nHe won a silver medal in the 200 meter dash just behind Jesse Owens at the 1936 Olympics.\nBut we remember him as one of the most inspiring and towering figures of the 20th century.\nJackie Robinson was the first African American to play Major League Baseball in the United\nStates.\nOn April 15, 1947, he broke the decades-old color line of Major Baseball.\nNot only did he set an example, but he helped a whole generation of young African American\nplayers enter Major League Baseball.\nAfter Robinson's death in 1972, his wife Rachel established the Jackie Robinson Foundation.\nIt's dedicating to honoring his life and work.\nThe foundation helps young people in need by providing scholarships and mentoring.\nIt lives on today in Cairo in our Boys and Girls Club, which is named after him.\nI leave you with one of his quotes.\nA life is not important except in the impact\nit has on other lives.\nThank you.\nI yield well.\nChair recognizes representative Bodie\nfor a morning order.\nThank you, Mr. Speaker.\nI rise this morning at the loss of my dear friend,\nMerrick Johnson, the third of making Georgia.\nA lot of you know that this session has been quite difficult\nfor me and my family.\nI have now lost two grandmothers, a best friend,\nand a great aunt in the span of a 30 days.\nI normally do not come to the well on personal issues\nbut strictly for policy.\nBut when I saw my dear leader and dear friend,\nJames Beverly speaking on behalf of my grandmothers,\nI didn't have to do it myself.\nBut my friend, Mary Johnson, suffered from MLS.\nHe was diagnosed in 2011.\nHe was confined to a wheelchair seven, eight years ago.\nBut that did not keep him from serving\nthe citizens of Macon, Georgia.\nIn a wheelchair, he was able to continue\nto serve his community.\nLast year, he ran for a special election\nto the Macon Water Authority,\nit served as a board member for an uninspired term.\nHe had to run again, this fall in November.\nHe did not prevail, but he kept serving.\nHe served the 100 black men of making in middle Georgia.\nHe served the making one of Ramas,\nalumni chapter, cap alpha side fraternity,\nand corporate for which I'm a proud member.\nHe did not stop serving.\nAnd so friends, I'm asking you in this body\nthat it really won't matter what bill that you pass HB101,\nHB102, but the service to your community,\nthe service to your constituents,\nand the service to your district and the state of Georgia\nwill be what you're remember for.\nSo when last time I talked to Jade, my friend,\nhe said, I gotta keep serving.\nSo I'm asking you all here, politics aside,\npolicy aside, people first and constituents first.\nLet's all continue to serve.\nAnd I want to remember today, for my friend\non the first day of Black History Month,\nJay, Mary Johnson, as my hero, my Black history.\nTrebleys, thank you, Mr. Speaker.\nChair recognizes Representative Glanton\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning, ladies and gentlemen of the House.\nI can't tell you what a great honor it is and it's quite humbling for me to be standing\nbefore you today on other circumstances.\nBut I am honored to be here this morning and humble.\nToday I have a black history moment.\nI was not aware that we had two others, but that's okay.\nMy black history moment this morning is about a gentleman that most of us know.\none that we see almost on a daily basis or hear about or know about. And if I began to\ntalk about all the things that this gentleman has accomplished and done, it's legendary.\nAnd we wouldn't have enough time if I took all week to tell you about the great accolades\nand things that he's received and the achievements that he's accomplished throughout his life and\nhis service to this state in this country.\nMy black history moment this morning is on the one and only Calvin Smiley.\nAs I said, I have about seven pages of things that I know the speaker ain't going to live.\nAnd I'm not going to do seven pages, but I'll give you a few more, a little bit more time.\nThank you, Mr. Speaker.\nYou'll have generous leader Beverly come on and start taking the pages away from you.\nBut I would tell you that rather than go through his professional and political careers,\nI will tell you that what's most outstanding for me is his character, his integrity, his\nservant leadership, his desire to get up each and every day and do something for someone\nelse.\nI don't have to tell you this because you see this.\nYou know this.\nYou have witnessed this.\nIn his very seldom, I've been all around the world, I've met a lot of legendary people,\nbut his very seldom that you have the opportunity to stand side by side of such a legendary\ngentleman as Cavern Smiley.\nHe has helped so many people throughout his travels, boys and girls, men and women\nthat he would never ever know, but have benefited from the things that he's done.\nJust to mention a few, the Georgia Dome, the Martin Luther King, Jr. holiday, the changing\nof the Georgia State Flag, serving and the Board of Trustees of Columbus State University,\na lot of different universities throughout this state.\n38 years with Sonovus, 47 years with the Georgia General Assembly, you don't get there\nby being selfish.\nAnd so I'd certainly thank you, Mr. Speaker, for the extra time.\nI wish I could tell you so much more about this man.\nBut if you ever get an opportunity, read up on it.\nI learned some things.\nAnd so Dean of the House, thank you for the example\nthat you have set for me.\nThank you for your honesty, your integrity, and your character.\nand thank you for your love of this chamber.\nThank you, Ms. Speaker, ladies and gentlemen,\nI yield the will.\nThe representative encouraged everyone to read up on Dean Schmory.\nbetter yet just spend some time with you. You don't know you're in a special\nplease. Chair recognizes\nrepresentative Wade thank you\nMr. Speaker and as a freshman I have\nno idea how I can follow that but\nI do appreciate the opportunity to\nbe here with all my peers. Today I just wanted to bring a little bit of good news from back\nhome and I know we've had a tough, you know, 12, 13 months in this state and in this nation,\nbut I also want to showcase that while there is trouble and trial, there's also a lot\nof excellence going on. And today I bring to you from my hometown, the story of a young\nman. His name is Palmer Hartley. He's a junior in high school and he was recognized as\nAs the state winner of the Georgia Music Educators Association, composition contest.\nThis young man wrote an entire music piece, as well as all the lyrics for a song called\nJourney to the Stars, and it was performed recently on you this weekend in our hometown\nfor the entire state.\nThis young man is a junior again, he plays trumpet in the band, and he's an aspiring film composer.\nAnd I just come to you today just to recognize that while there is trouble in our land, there's\na lot of folks that are taking that situation and spending their time, this young man started\nthis work back during the beginning stages of the pandemic.\nAnd I got to speak with this teacher and they just said, you know, music is one of those\ngreat equalizers.\nWe all love it, we all got our own vocation with it, we all have our preference.\nBut while we're down here, he said, I know you don't make music, but I sure hope that\nthat you guys, just like the person before said,\nwe'll focus on people.\nAnd let's just make sure that this is a body\nthat doesn't create dissonance.\nAnd with that, I yield the well,\nand I appreciate the time.\nThank you very much.\nChair recognizes representative Yasmin Neal\nfor a morning order.\nThank you, Mr. Speaker,\nand thank you to the House colleagues.\nOn this first day of Black History Month,\nI would like to honor Shirley Chisholm.\nLike a true trailblazer,\nshe was the first African-American woman elected\nto US Congress and the first African-American woman\nto run for President of the United States\nunder a majority party ticket.\nAlthough her campaign was unsuccessful,\nshe became a legend and a beacon of inspiration for women\nand girls of all races across the world\nfor generations to come.\nShe always remained unbought and unbossed.\nThank you, Mr. Speaker.\nI yield the will.\nThe clerk will read the caption\nto a group of privilege resolutions.\nHonoring the life and memory of Charlie Edward Matthews.\nRecognizing and commending, Adrian Meeks\nand for other purposes,\nthat completes the reading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions that Chair\nhears none and the resolutions are adopted? We do not have any birthdays today.\nIf you signed up for an announcement, make your way to the front of the chamber\nnow and be prepared. Chair has just been advised that Representative Dewey\nMcLean's wife had a pretty serious health issue this weekend and so I didn't\nknow that till now but let's hold them in prayer and in our thoughts. Chair\nrecognizes Chairman Billy Mitchell for an announcement. Thank you Mr. Speaker just\nI just want to let you know that the Minority Caucus will have a meeting via Zoom this afternoon\nat 12 noon.\nYou may go pick up your box lunch in Room 216 and be prepared for the meeting via Zoom\nat noon.\nThank you, Mr. Speaker.\nChair recognizes Chairman Mike Chokus for an announcement.\nThank you, Mr. Speaker.\nThe first meeting of the Small Business Development Committee will be tomorrow morning, Tuesday\nmorning, February 2 at 8 a.m. in 506 C.L.O.B.\nWe'll have reports from the National Federation of Independent Business and the Georgia First\nCommission.\nPlease be there.\nThank you.\nChair recognizes Chairman Jay Collins for an announcement.\nThank you, Mr. Speaker.\nremind everyone that the Public Safety and Homeland Security Committee will meet today\nat 606 CLOB at 1 o'clock per brief meeting.\nThank you.\nChair recognizes representative Doreen Carter for an announcement.\nGood morning.\nThank you, colleagues.\nHappy New Year.\nAs you know, it's February 1st.\nIt is heart month and we want to challenge you again this year with our 21-day veggie\nchallenge.\nWe're not trying to take your meat.\nWe want to encourage you to eat more vegetables.\nThen on Thursday, we're asking everyone to wear red, for go red, for women.\nThe official day is Friday, thank you.\nChair recognizes Chairman Matt Dollar for an announcement.\nThank you, Speaker, the first meeting for the Creative Arts Entertainment.\nCommittee will be today at 130 upstairs in 403.\nIt'll be an organizational meeting and we're going to be receiving an update on the status of the field ministry right now.\nThank you.\nThe chair recognizes the majority leader of the house for a motion.\nThank you, Miss Speaker.\nMiss Speaker, I moved to this house, stand adjourned until 10 a.m.\nTuesday, February the 2nd, 2021.\nOn the motion of the majority leader\nthat this has to be adjourned until 10 o'clock a.m.\non Groundhog Day, Tuesday, February the second.\nAll those in favor of the motion will say aye.\nThose opposed will say no, the ayes have it.\nThis house will be adjourned until 10 o'clock a.m.\non Tuesday, February two.\n",
  "updated_at": "2026-02-12T15:50:53.936736+00:00"
}