{
  "video_id": "-kfrLhxRf_o",
  "url": "https://youtu.be/-kfrLhxRf_o",
  "title": "Georgia House - Day 25 (2026-03-01)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": "2026-03-01",
  "duration_minutes": 88,
  "summary": "Here is a summary of the Georgia House session from 2026-03-01:\n\n**Overview**\nThis session featured a prayer and remarks from guest chaplain Pastor Stan Leicester, who delivered an inspirational message on the importance of leadership, vision, and culture. No specific legislation was discussed or voted on.\n\n**Notable Moments**\n- Pastor Leicester shared an anecdote about an Olympic marksman who missed his target due to a lapse in focus, emphasizing the need for leaders to maintain vision and culture.\n- He encouraged the representatives to stay engaged, make tough decisions, hold each other accountable, and work together to create a better future for Georgia.\n- Representative Casey Carpenter introduced Pastor Leicester and shared a personal story about his son signing a football scholarship.\n\n**Attendance**\nThe session began with a roll call to ensure a quorum was present.\n\n**Adjournment**\nThe session adjourned, with the next meeting date unspecified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nThe hour of convening, having arrived, all members of the House will please report to their seats.\nAll members of the House will please report to their assigned seats.\nThe clerk will ring the bell.\nAll members will please report to the floor of the house to their assigned seats.\nWe are about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nto Percil, Chairman Percil, would you put, okay,\nI'm trying to make sure that percentage of carpenter got voted present.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nNorkeepers will please close the doors and keep them closed.\nWell, good morning. I hope all of you had a great weekend, a beautiful weather weekend.\nReady to go to work this week. We will begin our day today with scripture reading and prayer by\nthe chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning\nwill be introduced by the gentleman from the fourth house district, Representative Casey Carpenter,\nRepresentative Carpenter. Brothers and sisters of the house it's always a pleasure to come up here\nand stand in the great pulpit of the great David Ralston. I know it's very hard of you, I know it's\nwas very hard for you to believe that in fact I even know a pastor.\nPastor Stan Leicester is not even my pastor.\nHe is simply a friend.\nSomeone that shares the love of high school sports,\nshares the love of cheering for the University of Georgia,\nand watching our kids grow up.\nI will say next year, however, leader Burns,\nhe will be cheering for the Georgia Southern Eagles\nbecause his son Evan signed a scholarship to play football there.\nPastor Leicester has a knack for bringing God's Word\nto the Revolence in the 21st century.\nI will stand in advance.\nToday we might be voting for sports camings\nof please pray for me in advance.\nAfter the pledge, we will be laying hands\non people in the corner.\nLadies and gentlemen, my friend, Pastor Stan Leicester.\nAs I left my house this morning, my wife asked me,\nhow do you feel about today?\nI said I'm not that concerned about the devotion,\nbut I'm terribly concerned about the introduction.\nThank you, Speaker Austin and Representative Carpenter,\nfor this invitation to address the house today.\nI want to thank each of you for your leadership,\nfor your willingness to serve and for your effort\nto make Georgia a better place for all of us.\nIn the 2004 Olympics held in Athens, Greece,\nMatthew Emmons was the best in the world at the three position 50 meter rifle competition.\nAs they competed, Emmons built such a lead that when he got to the last shot, he had a\nlead that was almost insurmountable.\nWhen he got to his last shot, all that Emmons had to do was hit the target.\nHe was the best in the world.\nHe didn't have to have a bullseye.\nHe just had to hit the target anywhere on the target.\nHe got to his last shot and Iman's took aim.\nHe shot a shot in Bullseye.\nWhen Iman's looked up at the scoreboard, the scoreboard read zero.\nTo his dismay, Matthew Iman's had shot the target to the left of the target intended.\nHe'd hit the right target.\nhit a bull's eye, but at the wrong target.\nIt was a defining moment for Matthew Emmons.\nThat day, instead of finishing first and winning the gold medal,\nMatthew Emmons finished in eighth place.\nEvery life has a few defining moments.\nAll of our lives have moments that define us.\nMaybe this is a defining moment for us.\nThe season we're in, what we're dealing with.\nGreat leaders leverage those defining moments\nto see great things happen and to shift culture.\nThere's a moment in Israel's history\nthat's recorded in Jeremiah 29.\nIt's a moment that speaks of the potential present\nwhen we get involved and we participate.\nIsrael's being held captive in Babylon\nand the word comes through Jeremiah\nand it says this in verse number four.\nThus says the Lord to all who are carried away\ncaptive from Jerusalem to Babylon.\nbuild houses, dwell in them, plant gardens, eat their fruit, take wives, have children,\nlet your sons and your daughters take wives and husbands and have children,\nthat they may increase and not be diminished, and seek the peace of the city where you live\nbecause as it prospers, you'll prosper. I think that one of the things that we take away is this\nthat great leadership shifts culture through involvement. For each of us, build houses, prosper,\nkeep growing. Jeremiah is saying shift culture by engaging in the world that you're placed in.\nVision's about one day. Cultures about every day. As leaders, we have the unique opportunity to\nlook forward and to look at the present at the same time. We have a vision where we eventually\nwant to be, and we establish culture where we are. Great leadership understands that vision\nis described, but culture is modeled. Jeremiah says, stay engaged, that you'll increase\nand not diminish. Vision can't be demonstrated, but eventually it becomes a reality because\nculture models it every day. Recently I had somebody speak to me and while they were sharing\nwith me, I had recently met them and in our second conversation, this gentleman looks at\nme and he says to me, you look like somebody that used to work out.\nI don't even know what that means.\nThe problem was that I had a great vision but a bad culture.\nMy culture, my everyday existence did not line up with the vision that I had for myself\nAnd ultimately, I end up looking like someone that used to work out.\nGreat leadership works together to create a better tomorrow.\nHe says, seek the peace in the city that I've sent you to,\nbecause when that city prospers, you'll prosper.\nSometimes that's making tough decisions.\nSometimes that's holding one another accountable.\nSometimes that's pressing into one another.\nSometimes that's encouraging one another in unique ways.\nRepresentative Carpenter said that my son just signed an athletic scholarship to play football\nat Georgia's Southern.\nHe also plays basketball and we're in the middle of the state basketball tournament.\nA couple of games ago we were playing and our school starts three freshmen and two seniors.\nMy son is one of the seniors.\nAnd at half time, one of the freshmen that is an exceptional player, they went to the\nlocker room, they came out, it was a guy on the other team that was just tearing us\nup.\nWe couldn't stop him, had nothing for him.\nAnd my son looked at the freshmen on our team and said, tell him what you told me coming\nout of the locker room, well he hadn't told him anything.\nAnd the freshmen looked at my son and said, what are you talking about?\nHe said, go ahead, tell him what you told me.\nAnd he said, I don't know what you're talking about.\nSo my son looks at the opposing player that is tearing us up and says he said he's going\nto kick your tail the second half.\nWell, he went out and did that.\nSometimes we have to push one another, believe in one another, help one another.\nThat's what Jeremiah is saying.\nBe the best you can be.\nwilling to take a risk, be willing to believe that culture can produce a reality, a vision\nthat we all hope to see happen. Again, I want to say to every single one of you, thank you.\nThank you for the courage to stand, to lead. I want to say thank you from my family,\nwith four children, how much I appreciate all that you do on a weekly and on a daily basis\nto help the culture be established that helps us realize the vision of a better tomorrow\nfor Georgia.\nLet's pray together.\nFather, we're so thankful for the men and the women of this house.\nThank you for the leadership, leadership, House Speaker Rauston, those who lead.\nI thank you, Lord, for the amazing gifts that are represented here.\nmen and women that understand that their decisions matter. I thank you for the wisdom in the direction.\nI thank you for the conviction that they bring to these moments. And I pray that God that wisdom\nand that conviction would be realized throughout this day and the remaining moments as they meet\ntogether. Father, we lean into you and thank you for your peace and your grace that you give us\nin these moments when we feel like God so many things are moving in different\ndirections. It's been a tough season for everybody in this room and for those\nthat we lead and we pray that God you would give us the wisdom and the\nunderstanding to know how to lead well and we know you will in Jesus name.\nI pledge allegiance to the flag of the United States of America and to the\nRepublic, for which it stands, one nation under God, indivisible, with liberty and justice for all.\nNor keepers will please unlock the doors.\nYou\nYou\nbefore I recognize Chairman Hogan could I have your attention please could I\nyour attention please. Testing will be going on until 11 a.m. gives you about\nanother 40 minutes to get downstairs if you have not been tested today. Please\ntake care of that before 11 a.m. Chair recognizes chairman Hogan the chair of\nof the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits\nhas read the journal of the previous Legislature Day\nand have found it to be correct.\nAnd I've got a math question today.\nJack is 69 and has a girlfriend, 23.\nHow much money does Jack have?\nAll I'm going to say, Chairman, is that all of those sayings that you have shared with\nus, this session will be compiled in a book and published at the end of the session, and\nI predict it will become the best seller immediately, at least I'll buy one, and I think\nRepresentative Noel Williams-Will.\nChairman Hogan, the Chair of the Committee on Information and Audits, reports that the\nJournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the Journal?\nThe Chair here is none, and the Journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns on 159th, Ms. Folloughby established in the order of business during the first part of the period of unanimous consensus introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day the chair here's none in the resolution is adopted first reading of bills and resolutions a clerk will read\nHouse Bill 653 by motion of Jasper to the 11 Stevens to the 164th green in 151st night of the 130th\nApollo 32nd building title and act to men code section 2645 the fish go to George annotated relating the definitions relative to the Georgia pharmacy practice act\nHealth and human services\nHouse Bill 654 by resident of hatching to the 150th and Jasper to the 11 of the building title and act to men code section 20 to\ntwo, 164, the Fisher go to Jordan,\nannotated related to local five mill share funds.\nAppropriations.\nHouse Bill 655 by resident Wilson,\nthe 80th Oliver, the 82nd Evans,\nand the 83rd and Holcomb in the 81st.\nBill Bitton, an act of men,\nan act to incorporate the city of Brookhaven.\nAnswer, governmental coordination.\nHouse Bill 656 by resident of Houston,\nthe 170th green, and the 150th first.\nWe'll go to the 175th.\nTankersley, the 160th and Wilson the 80th.\nwill be titled an act to amend and title 10 of the\nfiscal to Georgia and Tato related to commerce and trade.\nAgriculture and consumer affairs.\nHouse Bill 657, president of Crow of the 110th,\nweed hour of the 119th, Hitch and Zone 61,\nlumped into the 12th and gravely the 67th.\nBill be titled an act to amend,\nchapter 2 of title 47 of the fiscal to Georgia and Tato\nrelating to the employees retirement system of Georgia.\nRetirement.\nHouse Bill 658, president of Apollo 32.\nwill be titled an act to amend the act creating the Frank Hart Airport Authority.\nIntergovernmental coordination.\nHouse will 659 by resident of Roberts, the 52nd black man, the 146 rich, the 97th\ncouch, the 50th in Clark, the 108th, will be titled an act to amend chapter 2 and\ntitled 21 of the physical to Georgia and Tated relating to primaries and\nelections generally.\nSpecial committee on election integrity.\nHouse will 660 by resident of Oliver, the 82nd Carson, the 46th black man,\n146 drier, the 59th, Mithiac, the 73rd, and others,\nWilmington, Natto, Mennonak, Known as the Metropolitan\nAtlanta Rapid Transit Authority Act of 1965.\nTransportation.\nHospital 661 by Ripson of Washburn of the 141st\nDickey, the 140th, and Mathis of the 144th.\nWilmington, Natto, Mennonak,\nAttitude, Chapter 8, and Title 48.\nThe fish go to Georgia, Antietta, related to joint custody,\nand municipal sales and use tax.\nWays and means.\nHospital 662 by Ripson of Lopez,\nthe 86, that's duration of 104th, McLean of the 51st,\nand Lim of the 99,\nthere'll be title and act to amend chapter six,\ntitle 17 of the fish go to Georgia,\nAntietta, relaying bond and recaudence.\nJudiciary non-civil.\nHouse bill 663 of our resident of Beverly,\nthe 143rd, Metro of the 88th can on the 58th,\nThomas the 39th,\nbased more of the 63rd and others,\nthere'll be title and act to amend Article 1 of chapter 27,\ntitle 50 of the fish go to Georgia,\nAntietta, relaying the gentle provisions\nregarding the lottery.\nHigher education House Bill 664 of our rest of the main are the 56 mile and the 163rd\nStevens the 164th Duke's the 154th Gillio to the 162nd and others\nBill being taught on active men part one of our two chapter two\nTottillated fish go to Georgia antenna relating units designed to be a fixed\nto foundations agriculture and consumer affairs House Bill 665 of our\nmost of Beverly the 143rd eventually 88th Bruce the 61st Canon 58th Thomas\nand 39th and others.\nIt'll be Todd and act to men.\nToddle 20, the physical to George\nAntietta, relating to education.\nHigher education.\nHouse bill 66 by reps and a Beverly,\nthe 143rd, mental, the 88th Bruce,\nthe 61st, Canon, the 58th, Thomas,\nthe 39th and others.\nIt'll be Todd and act to men.\nChapter seven, and Toddle 48th,\nthe physical to George Antietta, relating to income taxes.\nWays and Main.\nHouse bill 667 by reps and a Beverly,\nthe 143rd, mental, the 88th, Bruce, the 61st.\nCannon in the 58th, Thomas the 39th and others,\nbuilding Todd and active men chapter seven\nand Todd a 40-80, the fish go to Joe Jan Tate\nrelated to income taxes.\nWays and mains.\nHospital 668 by resident of Beverly,\nthe 143rd, mentally 88th,\nproduces 61st Cannon in the 58th,\nThomas the 39th and others,\nbuilding Todd and active men, chapter seven,\nTodd a 40-80, the fish go to Joe Jan Tate\nrelated to income taxes.\nWays and mains.\nHospital 669 by resident of Beverly,\nthe 143rd, mentally 88th, Wilkerson 38th,\nCannon in the 58th, Thomas the 39th and others.\nThere'll be tunnel act to amend sub part 4A\nof Article 7 and Chapter 3 and title 20.\nThe fish go to Georgia and Santa really direct loans\nto students.\nHigher education House bill 670,\nby the represent of Beverly the 143rd,\nMitchell the 88th Bruce, the 61st Cannon in the 58th,\nThomas the 39th and others.\nThere'll be tunnel act to amend chapter 11\nand title 48 of the fish go to Georgia and Santa\nrelated to taxes on tobacco and vaping products.\nWays and Means.\nHospital 671 by the rest of the Beverly,\nthe 143rd council of the 88th Bruce,\nthe 61st canon in the 58th.\nThomas the 39th and others,\nwho'll be taught on act to amend Article 2,\nChapter 7 of Title 48.\nThe official of Georgia Antony,\nrelating to the impositionary computation of income tax.\nWays and Means.\nHospital 672 by the rest of the Beverly,\n143rd, mentally 88th Bruce,\nthe 61st Thomas the 39th.\nin the 58th and others,\nthere'll be a total act to amend Article 2, Chapter 7,\nand Title 48.\nThey fish go to Georgia,\nand Tate are related in the impositionary\ncomputation and exemptions from income taxes.\nWays and Mains.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\nNo.\n14th, four kinds from the 157th.\nSkullfield of the 60th.\nBill B. Toddl and active men.\nChapter one, a title seven.\nThe official go to Georgia,\nand Tate related to financial institutions.\nIndustry and labor.\nHouse bill 67 by resident of Gunner,\nthe eighth, Anderson to the 10th.\nScott is the 14th Smith to the 18th.\nCrow the 110th and others.\nBill B. Toddl and active men.\nTitle 20, the official go to Georgia,\nand Tate relating the education.\nPublic safety and homeland security.\nHouse bill 678 by resident.\nWilkerson in the 38th, Allen in the 40th, Scott in the 76th.\nSchofield in the 60th, and Clark in the 51st.\nBill B. Todd in the act of men arc three, chapter four,\na title 42.\nThe official go to Georgia and Tate,\nwe're letting medical services for inmates.\nPublic safety and homeland security.\nHouse bill 679, I'm upset of Cameron in the first\nand Tarvon in the second.\nBill B. Todd in the act of men chapter five,\na title 48 in the official go to Georgia and Tate,\nwe're relating to add ballorum taxation property.\nWays and Means.\nHouse Resolution 248 by President Stevens, the 164.\nResolution doesn't mean the Savannah Logistics Technology\nInnovation Corridor.\nEconomic development and tourism.\nHouse Resolution 249 by President Graveli, the 67th.\nDouglas the 78th Corridor, the 174th,\ncalled it the 19th clerk of the 147th and others\nof resolution urging the United States Congress\nto enact legislation in the state of Georgia\ncourt regarding financial services.\nRegulated industries.\nResolution 268 by resident of Neil the 74th,\nPark of the 100th, first low pass of the 86 more\nof the 95th of resolution urging the Congress,\nthe United States to abolish the practice\nof involuntary sterilization.\nPublic safety and homeland security.\nSenate bill 28 by Senator Hatchett of 50th,\nStrickland the 17th, Dixon the 45th,\nPaine in the 54th in Cousin of the 46th.\nBill B. Toddl, an act of men chapter 11, a title 15, a title 19 in the fish go to George\nAntated relating the juvenile code and domestic relations.\nJuvenile Justice Senate Bill 85 by Senator Albers, the 56th Strickland of the 17th Miller\nof the 49th, Kenny the 18th, Huff Stetler of the 52nd and others, Bill B. Toddl, an act\nof men code section 16, 5, 61, the fish go to George Antated relating the hazing.\nJudiciary non-civil Senate Bill 115 by Senator Robertson of the 29th\nAlvers, the 56 Harper, the seventh pain in the 54th.\nCowsr to the 46th.\nBill B. Toddl, an act to amend Article 1 of Chapter 5\nof Title 40.\nThe official go to Georgia, Ontario,\nrelaying general provisions regarding drivers licenses.\nMotor vehicles.\nSenate Bill 116.\nMy Senator Robertson, the 29th,\nAnderson, the 24th, and a Vittartee of the 31st,\npain in the 54th.\nThomas and the 14th and others,\nBill B. Toddl, act to amend Article 1 of Chapter 5\nTitle 49 in the physical to Georgia and Tateau relating to children and youth services health and human services\nCentipil 174 by Senator Gucci the 51st model is the 53rd walker the 20th cows are the 46th and brass the 28th\nBill be talented to amend article one of chapter six and title 17 the physical to Georgia and Tateau relating the general provisions regarding bonds\nJudiciary non-civil\nSenate Bill 198 by Senator Harper, the 7th, Alvers, the 56th.\nRoberts in the 29th, Bill B. Todd and Act to amend Chapter 2, Title 35.\nThe official go to Georgia and Tate relating the Department of Public Safety.\nPublic Safety and Homeland Security.\nSenate Bill 201 by Senator Huffstead with the 52nd, Bill B. Todd and Act to amend Article 2, Chapter 2, Title 48.\nThe official go to Georgia and Tate relating the administration and revenue and taxation.\nWays and Main Senate Bill 215 by Senator Walker the 20th.\nBerk of the 11th Butler the 55th hatch of the 50th Kennedy the 18th and\nothers.\nBill being taught an act to men article on chapter 7, title 31, the fish go to\nGeorgia and senator relating the regulation of hospitals and related\ninstitutes.\nHealth and human services.\nSenate Bill 221 by Ripson of Mulles the 53rd mill of the 49th,\nDoug and the 30th.\nGood to the 51st Kennedy the 18th and others.\nwill be titled an act of men chapter 5 and titled 21 in the physical to Georgia and\nit's ended relating ethics and government judiciary that completes first readers.\nSecond reading of bills and resolutions the clerk will read House Bill 638 by Reptile\nof Skoggins of the 14 Kelly the 16th Gamble of the 15th Bill relating to asbestos and\nSilica claims House Bill 639 by reps on scogins of the 14th, Kelly of the 16th and Gamble of the 15th to build relating to torts House Bill 640 by reps of Smith of the\n18th Pell of the 32nd Ballinger of the 23rd Taskers of the 11th Collins of the 68th and others to build relating to crimes and offenses\nHouse Bill 641 by reps of Williams of the 145th Joke is of the 138th Earhart of the 36th to build relating to leans of hospitals and nursing homes\nHouse Bill 642 by reps of Bernal of the 77th Scott of the 76th Bayesmore of the 63rd to build relating to powers of local governments as to air for\nFacilities House Bill 643 by Representative Bernal of the 77th Scott of the 76 base more of the 63rd a bill relating to text to property tax exemptions\nHouse Bill 644 by represent dryer the 59th at the end of the 89th Jackson of the 64th Scoffield the 60th\nRobert show of the 48th a bill relating to post-secondary education House Bill 646 by represent Glantz and of the 75th Jones of the 25th\nMelton of the 112th Hugh leave the 136th Couch of the 50th and others a bill relating to financing under the quality basic education act\nHouse Bill 647 by Rev. Smith of the 133rd Smith of the 70th,\nWashington of the 141st Williams of the 145th,\nDickey of the 140th, the Bill relating to general provisions\nrelative to solid waste management.\nHouse Bill 648 by Rev. Schofield of the 60th,\nBeverly of the 133rd,\nRobeshow of the 48th,\nHutchinson of the 107th Scott of the 76th,\nand others of Bill relating to handicap persons,\nHouse Bill 649 by Rev. Allen of the 40th,\nWilkinson of the 38th,\nTamino of the 58th,\nThe cloud of the 105th, a bill relating to regulation of hospitals and related institutions.\nHouse bill 650 by Representative Cameron of the 58th Limit of the 99th will claim that the 100th Scofield of the 60th Conference of the 39th and others, a bill relating to labor and industrial relations.\nHouse bill 651 by Representative Galliard of the 160 Second and Stevens of the 164th, the bill to amend and act authorizing the Board of Commissioners of Chatham County to provide transit services throughout the county.\nHouse Bill 652 by Reps and Balancer of the 23rd, a bill relating to juvenile court administration.\nHouse Bill 675 by Reps and Ken Charles of the 22nd Williams of the 168th, NYX of the 69th, Dredner of the 85th, homes of the 129th and others.\nA bill relating to salary and allowances, remembers and officers, the general assembly and general provisions regarding salaries and fees for public officers.\nHouse Bill 676 by Reps and a House of the 170th, a key of the 140th, England of the 116th, Gilear to the 162nd, Williams of the 148th, the bill relating to agriculture.\nResolution 236 by representatives of 120 second green with a hundred fifty first purple the hundred fifty fifth the hood of the hundred seventy-fifth\nGellier to the hundred and sixty second others a resolution creating a house study committee on these safe staffing and nurses in Georgia\nHouse Senate Bill 22 by Senator Jones of the\n10th of bill relating to amend an act to provide any board of commissioners for Henry County\nThat's an ability 105 by Senator Strickland of the 17th Kennedy of the 18th\nThompson of the 14th, Anderson of the 43rd,\nWatson of the first, a bill relating to procedure\nfor sentencing and imposition of punishments,\nSenate Bill 143 by Senator Tipens of the 37th,\nDoug and of the 30th, due to the 51st, Miller of the 49th\nKennedy of the 18th, the bill relating to mechanics\nand material men, Senate Bill 159 by Senator\nGuch of the 51st, Miller of the 49th Park of the 11th,\nagain of the 47th, paying of the 54th,\nthe bill relating to elementary and secondary education,\nSenate Bill 193 by Senator Mullis of the 53rd Harper,\nthe 7th part of the 15 checks and the 2nd hatchet of the 50th and others,\na bill relating to Advalor and Taxation of Properties, and it billed to 11 by\nSenator Summers of 13th bill to provide the future elections of the Office of\nJudge of Probate Court of Procrested County. She'll be nonpartisan\nelections through 2nd readers.\nYou\nWe have no reports\nreports of standing committees this morning. So we're going on now to morning\norders. We are going on to morning orders. This House will come to order. Keep in\nmind that we're at that point in the session where the total time for morning\norders is 10 minutes. Chair's not going to make any assignment of specific times.\nJust be mindful of your neighbor. Chair recognizes for a morning order.\nRepresentative Holly, Representative Crow, Chairman Mathyak, and Representative Scott.\nThank you, Mr. Speaker.\nThis morning, our Henry County delegation, particularly in McDonough area, rise to play homage\nto Mr. Bob Van Dunk.\nBob served eight years in the U.S. Marines before joining the U.S. Army, two and a half tours\nin Vietnam, and served another 20 years in the Army.\nworked as a civil servant, weapons manager, and he volunteered at Stockbridge\nVeterans Administration, outpatient clinic, where he saw the need to get\nveterans their benefits and therefore in 2011 started the veterans' support\ngroup. And so we distinct Bob for his service, he's been a long-time hunter,\nsharp shooter, and his constant fixture in McDonough, where he looked after\nof veterans concerns and the needs of the community.\nI ask you, please, let's honor him with a moment of silence.\nThank you.\nChair recognizes for a morning order, Representative Bonner.\nThank you, Mr. Speaker.\nThis morning, I rise with members of the Fayette County\ndelegation to just to praise some of our community's finest.\nLast Sunday in the early morning hours,\nCity of Fayette will police rolled up on a car accident.\nThe automobile engulfed in flames.\nOfficers Michael Perry and Maggie Murphy,\nwithout regard for their own personal safety,\nwent into the vehicle, pulled out the passengers\nthat were in flames, saved their lives,\nand just wanted to honor those folks and say thank you,\nand a special shout out to Chief Scott Gray\nfor running a great department in City of Fable.\nThank you, Mr. Bigger.\nChair, recognizes Representative Burnow\nfor a morning order.\nChair, recognizes Representative Hutchinson\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday, I'm going to extend Black History Month just for a little bit.\nI would like to introduce to you the first African-American instructor at Fort Gordon,\nand also my father-in-law, Sydney Hutchinson.\nSergeant Hutchison was stationed in 1969 for his last station after the Korean War at Fort\nGordon when he was the first African-American instructor.\nHe taught signal corps, and after he retired, he became a licensed amateur radio operator\nand was recognized as Ham Radio Operator of the Year in 2005.\nHe's a founding member of the East Augustine neighborhood watch.\nHe secured grants for the neighborhood watch, partnered with local police and businesses\nto bring that community safety and security.\nHe volunteered for 30 consecutive years\nat his church, Holy Trinity Catholic Church in Augusta,\nand was recognized in 2002\nwith the Bishop John Barry Award\nfor Outstanding Volunteerism.\nAnd in his 80s, he decided he was bored, I guess,\nso he decided to take up ballroom dancing,\nwhere he was also recognized in his 80s\nas an outstanding ballroom dancer.\nBut I think his most important and prized roles\nwere father, husband, and papa to my kids.\nI could not have asked for a better papa\nand he left us and joined his wife in September of 2019.\nSo please help me recognize my father-in-law,\nSergeant Sidney Hutchinson.\nThank you, Mr. Speaker, I yield the well.\nChair recognizes representative Becky Evans for a morning order.\nWell, Chair recognizes representative Susan Holmes for a morning order.\nThank you, Mr. Speaker, and come on in the ladies and gentlemen, I'm very proud today\nto honor peanut farmers of this state.\nThey have done so much for the economy at the State of Georgia, and we are indebted\nto this group.\nAnd today, as many of you know, peanut butter and jelly day, and they are providing fabulous\nPB&J sandwiches over in the lobby of the Floyd building.\nSo make sure you go over.\nIt's worth going out in this messy weather to get one of those great sandwiches, but we\nare indebted to the peanut farmers of this state, and I would like for you to help me\ngive them a big standing ovation now thank you thank you sir okay final call\nrepresentative Bernal representative Becky Evans okay we're now going on to\nthe rules calendar. Going on to the rules calendar, clerk will read the caption to House\nBill 244. House Bill 244 by Representative Hogan and 179th, being titled an act to amend\nCode section 338, 8.13, 8.3, the fish go to George Anatede relating to the funding of services\nor reduction of ad valorm taxes in uncorporated areas of counties and powers and duties of\ngovernment authority.\nThis bill haven't referred to the committee on governmental affairs.\nThat committee recommends that this bill do pass.\nChair recognizes Chairman Don Hogan to present the bill.\nThank you, Mr. Speaker, this is House Bill 244LC-460386.\nThis bill passed this House last session and got caught up in the Senate with the COVID.\nSo it's the same bill that allows county commissioners to use revenues from insurance premium\ntaxes on insurance premiums for flood reduction.\nIf county does not have any problems with flooding,\nthey can use it to lower, have the lower taxes.\nAnd basically that's the bill.\nAnd Representative DeLouche was the secretary of signer,\nso he's still following directions.\nI yield.\nDo you yield for questions?\nI yield, Mr. Speaker.\nChair recognizes your seatmate,\nRepresentative meeks up in the gallery to your left for a question\nThank you, mr. Speaker just as the gentleman you I do I\nRead through the bill, but I've not seen anything related to the city of St. Sommons in the bill\nCan you please explain how this may impact that effort? There's no city on St. Sommons\nYou didn't see the rules committee substitute, mr. Chairman no sir\nI did not somebody hit it from me apparently\nSomething about creating a new municipality there. I don't know what it was. Well, I don't know you might have to pay extra taxes when you come down and visit too.\nUh-oh. Uh-oh.\nYou have no further questions. Thank you, Mr. Speaker, and I yield the way on an ask for a favorable consideration.\nIs there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage?\nof the passage of the bill, the chair here's none the report of the committee, is agreed\nto.\nShall this bill now pass all those in favor of the passage of House Bill 244 will vote\naye those opposed will vote no and the clerk will unlock the machines.\nYou\nhave all members voted have all members voted if so the clerk will lock the\nmachine on the passage of house bill 244 the eyes are 158th and a's or zero this\nbill having received the requisite constitutional majority is therefore passed\nClerk will read the caption to House Bill 443.\nHouse Bill 443 by Representative Leber to the 33rd.\nWe entitled back to men chapter 12 and title 51 of the fish, but a Georgia antenna relating the damages.\nSo it's to provide for new requirements for requiring the transfer of structured settlement payment rights.\nThis bill learned for the Committee on Judiciary.\nThat committee recommends that this bill do pass.\nRepresentative Leveritt, you, last time you were in the well, you quoted Porter Wagner.\nIs that right?\nYes, sir.\nAnd then somebody last week was quoting you on Shakespeare, I can't wait for today.\nChair recognizes Representative Leveritt to present the bill.\nThank you, Mr. Speaker and Lady Jim, one of the House, I bring to you today House Bill\n443, which is the Georgia Structured Settlement Protection Act.\nIt effectively allows this body to protect the disadvantaged from being taken advantage\nof by the unscrupulous.\nIt deals with structured settlements, which are a rather obscure function in the law,\nat least for my practice, it's a settlement in which instead of taking a lump sum payment\nyou sell your claim for payments over a period of time.\nThis does not regulate that process.\nIt regulates the process in which someone could subsequently\nsell those rights.\nAnd these are usually people who have undergone some kind\nof great tragedy, oftentimes they're\nminers who have lost both parents.\nAnd the process of negotiating and determining\nthe value of that payment over time converted to a lump sum\npayment can be rather technical and involves\nrather complex financial formulas that most of us don't know.\nSo it's very easy for someone buying one of these\nto take advantage of the person who's selling it.\nSo the purpose of this law is to amend\nand update existing Georgia law\nthat already deals with this topic.\nBut it strengthens it.\nIt makes the disclosure's broader.\nThere's already a court approval process,\nbut this requires that all interested parties\nbe given notice so they can present arguments to the court.\nAnd it generally just protects the consumer.\nIn effect, this bill allows this body to cast the wicked money\nchangers out of the temple.\nIf, in this case, the temple is a state of Georgia.\nThis act is already adopted in 48 to the 50 states.\nAnd I understand that New Hampshire, the other state\nis considering it this session, and they intend to have it\npassed there.\nSo this would just update existing law, make it stronger,\nmake it more consumer protective, and bring us\nthe line with the vast majority of states who adopted this model act.\nAnd I would also note that in rules, I received a question from Representative Williams\nand he tells me that he is supporting the act.\nAnd so that reminds me of Romans 8.13 if Representative Williams be with us, who can be against\nthis?\nMr. Speaker, I'll yield the well for questions.\njust a lady of greatness awaits you. You do not appear to have any questions. Oh well\nyou do have a question. Chair recognizes the chairman of the House Ethics Committee.\nChairman Nix to your right for a question.\nIs gentleman you? I'm you. What's your translation of the Bible are you reading?\nI did say I was paraphrasing, Mr. Representative.\nOh, okay, okay.\nThank you.\nYou have another question if you care to yield.\nAh, yield?\nMay I have a little biblical debate here?\nRepresentative Williams to your left\nis recognized for a question.\nThank you, Mr. Speaker of the gentleman yield.\nAh, I would be glad to, sir.\nThat was not who I stewed, and that certainly was not my question.\nGo ahead and ask your question.\nThank you, Mr. Speaker.\nAnd all the difference to my dear friend representative nicks, I would like to say I predict\nbased on what I heard, greatness for you in the future in this house.\nWell, you're very kind, sir. Thank you so much.\nMr. Speaker, if there are no other questions.\nThere are no other questions.\nI urge you to vote in favor of this bill and to quote that great American man of letters, Charles Barkley.\nI may be wrong, but I doubt it.\nThank you. I yield the will.\nIs there any objection to the\nprevious question being ordered?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to agreeing\nto the report of the committee?\nWhich was favorable to the passage\nof the bill.\nThe chair hears none.\nThe report of the committee has agreed\nto shall this bill now pass.\nAll those in favor of the passage\nof the bill will vote aye.\nThose opposed will vote no and\nclerk will unlock the machines what purpose this representative will\nlensky rise thank you speaker of due to a rule 133 I'd like to be excused\nfrom this gentleman has that right and the journal will so reflect have all\nmembers voted, have all members voted. If so, the clerk will lock the machine. On the\nthe passage of House Bill 443.\nThe eyes are 161.\nThe nays are two.\nThis bill having received the requisite constitutional\nmajority is therefore passed.\nClerk will read the caption to House Bill 459.\nHouse Bill 459 by Representative Martin of the 49th\nto be entitled back to amend Article 5 of Chapter 36.\nAnd Title 36, the official to Joe Jan Tate\nrelating to limitation on annexation of areas for nurse services or included in comprehensive zoning plans by certain counties.\nThis bill I would refer to the committee on governmental affairs that committee recommends that this bill do pass.\nChair recognizes Chairman Martin to present the bill.\nThank you, Mr. Speaker.\nHouse Bill 459 is very limited.\nIt applies to Charlie Brown Airport.\nAnd it simply says that if any of the cities surrounding\nthat want to annex that property,\nthat they would wait and not do that\nuntil they got a resolution from the county,\nFulton County, in this case, approving that annexation.\nFulton County's done a lot of investments.\nThe airport, it serves the region well.\nAnd this is simply to keep those governments working together\nand provide that airport.\nI'm going to quote Franklin Roosevelt who said be sits there and be seated in part and\nYou'll the well if there are no questions\nLook at that I finished before\nYou have no questions.\nThe gentleman yields the well.\nChair recognizes representative, I'm sorry,\nChairman Oliver, to speak to the bill.\nThank you, Mr. Speaker.\nI support $459, but I want to bring to ladies and gentlemen\nyour attention House Bill 2324 and 66\nthat was given a very good hearing in government affairs.\nAnd it all deals with issues that you are facing in your communities where there's growth\nand competition and development authorities actions.\nMany of the issues coming before the government affairs are about annexation procedures and\nbond validations and the way in which our development authorities are or are not proceeding\nwith development.\nthe benefit and expense and it's a fair argument of your local elected officials.\nWhat is true is that all cities and counties want development.\nIt's also true that all developing entities want tax benefits.\nWe have very few rules and very few statutes concerning the notification to our local communities,\nour local school boards, our local counties\nwin a development authority as issuing bonds.\nAnd I think this is a ripe area for us to discuss\nin detail and at length.\nAnd I appreciate the opportunity\nthat the government affairs, subcommittee chairs\nand chairs have given me to bring these issues forward.\nI just want to mention that the Fulton County Industrial\ncorridor in Fulton County has been the subject of litigation\nsince it was created in the 50s.\nas an antiquated local legislation statute.\nAnd the litigation that's going on around me\nand in your counties too,\noutside the perimeter,\nis frequently about these issues of annexation,\nissuance of bonds and development authorities.\nI just wanna briefly mention, I support this bill,\nbut there's a wide array of issues\nthat I want us to further discuss in detail\nfor the purpose of transparency\nand for the purpose of your local governments\nbeing notified when these actions are coming before them.\nThank you, Mr. Speaker.\nLadies, yielded the well.\nIs there any objection to the previous question being ordered?\nThe Chair, here's none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report\nof the committee, which was favorable to the passage\nof the bill?\nThe Chair, here's none.\nThe report of the committee is agreed\nto, shall this bill now pass?\nAll those in favor of the passage of the bill\nwill vote aye.\nThose opposed will vote no, and the clerk will\nunlock the machines.\nHave all members voted?\nHave all members voted?\nSo the clerk will lock the machine on the passage\nof House Bill 459.\nThe eyes are 168, the nays are zero.\nThis bill having received the requisite constitutional\nmajority is therefore passed.\nClerk will read the caption to House Bill 392.\nHouse Bill 392, Bob Rosson.\nRidley, the six and others to be titled\nan act to amend Title III, the fiscal to Georgia,\nannotated related alcoholic beverages.\nSo to provide that licenses for retail sale packages\nof alcoholic beverages for consumption off premises,\nshall be subject to regulation as to distances from schools.\nThis bill then refer to the Committee on Regulated Industries.\nThat committee recommends that this bill do pass.\nChair recognizes representative Ridley to present the bill.\nThank you, Mr. Speaker.\nLadies and gentlemen, bring House Bill 392 to your attention for your consideration also.\nWhat this bill does, this bill is not putting alcohol culture to schools.\nWhat this bill is doing is giving the local authorities the ability, right now it's 200 yards,\nit just gives the local authorities the ability to use that yard of genuine way they want to.\nIf you remember last year we had Ron Stevens bill down in Savannah, this is basically the same bill,\nbut it's got to do with school properties.\nAnd we'll run into this situation as in rural areas where schools have 200-300 acres and\nthe schools on one corner, no convenience store or grocery store can go anywhere around\nthose that area if there's a road across there because of the 200 yard mark.\nSo this is just letting the local authorities do what they do, they issue the license already\nand it's letting them have the authority to shrink that if they need to.\nAnd that's the bill, Mr. Speaker.\nNow, I have to answer any questions if I have you.\nYou do have a question if you care to yield.\nOh, you'll chair recognizes representative Carter up in the gallery for a question.\nI think you speak of Austin.\nDoes the gentleman yield?\nI sure did.\nGo ahead.\nIn this bill, is there anything that would limit the distance\nthat a museum ask local government could put in the distance\nbetween selling of the alcohol in one\nof the additional approved locations that are listed?\nSo we can go from 200 to 10, or is there\nsomething to eliminate?\nThere's not going to be anything to limit it.\nRight now it's 200 yards, and so that\ncould go anything under that.\nAnd like I said, if you've got a spot like where there's a\nmaintenance building or a school barn where there's not\neven any kids, you still can't underlaw put a cell\nalcohol at a convenience store or a gas station or anything\nlike that across the road from it.\nSo this just give them the authority to be able to have\nthat ability to move those lines.\nThank you.\nDo you further yield?\nI'll yield for one more.\nChair recognizes representative Anola Witts to your left\nfor a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI sure did.\nSo is it, could we say about this bill\nthat this is a bill that actually affirms local control?\nIt actually does, the firm local control.\nWell, how wonderful.\nThank you.\nThank you.\nLook forward to your vote.\nMr. Speaker, I'll yield the well.\nGentlemen, as yielded the well,\nis there any objection to the previous question being ordered?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair hears none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of House Bill 392, will vote\naye.\nThose opposed will vote no, and the clerk will unlock the machine.\nMr. Speaker, pursuant to rule 133, I'd like to be excused from this vote.\nThe government has that right and the record will so reflect.\nHave all members voted?\nHave all members voted?\nSo the clerk will lock the machine on the passage of House bill 392.\nThe eyes are 126.\nThe knees are 35.\nThis bill having received the requisite constitutional majority is there for past.\nClerk will read the caption to House bill 466 House bill 466.\nof sort of Apollo 32 and others to be entitled and act to amend Chapter 5 and Title 40 and Chapter 13 and Title 43.\nThe official go to George Antietta relating to driver's licenses and driver's training schools respectively so as to reduce the number of required hours in the intervention component of DUI alcohol or drug use risk reduction programs has bill have referred to the committee on motor vehicles that committee recommends that this bill do pass by committee substitute.\nChair recognizes the chairman of the regulated industries committee chairman Powell to present the bill.\nThank you, Mr. Speaker and ladies and gentlemen. This morning I bring to you House Bill 466.\nThis deals with the Department of Driver Services, driving schools and the DUI schools.\njust does a handful of things other than just cleaning up a bunch of old and\nredundant verbiage in the law. The number one, it changes the requirements of the\nDUI schools from 20 to 16 hours. Been several questions. I was asked about that.\nThe research-based curriculum that's provided by these companies, they've been\nchanging this steadily from once upon a time it was 24, that it was 20, that it was 16 and it\ngives them down to 10 for smaller courses. These are the DUI courses that the offenders take\nand their recommendations, they have compiled these in short in the courses so they put more\ncomponents into it and from all evidence that these research based companies at the 16 hour\ncourse is actually more effective because DUI fenders, they go at currently, they'll go eight hours\non a Saturday, eight hours on a Sunday, and then they're required to come back for a four-hour\non a Monday, which a lot of them aren't doing. So this consolidates and makes us more tightly\nframe for these DUI fenders and is recommended by the research-based folks that write these\nprograms in the curriculum. Second thing it does, it allows for the driving improvement\nschools to use the Zoom platform in this day and time of the viruses. You know, nobody\nis really going into the classroom so it would allow the driving improvement schools to\nuse Zoom. It allows third-party testers to do road tests for non-students. A lot of\nWe all may remember that last year in the midst of this virus, DDS had such a terrible\ntime that they were actually giving the driver's licenses to teen drivers without them taking\na test and just come on back later on and take the test.\nAnd this would eliminate that by putting third party testers approved by DDS out there\nto test these students.\nIt allows third-party testers to be authorized by DDS after six months training.\nAnd lastly, it just requires notification of the transfer of one of these driver improvement\nschools that they have to notify the Department of Driver Services.\nMr. Speaker, that's the summation of this bill, and I would certainly appreciate the favorable\nconsideration.\nBe glad to answer any questions if there are any.\nYou do not appear to have any questions.\nThank you, Mr. Speaker and ladies and gentlemen of the House.\nIs there any objection to the previous question being ordered?\nThe chair hears none, the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair hears none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair hears none.\nThe report of the committee has agreed to\nshall this bill now pass.\nAll those in favor of the passage of the bill will vote aye.\nThose opposed to vote no, and the clerk will unlock the machines.\nWhat purpose does representative mom to hand rise?\nMr. Speaker, present to rule 1-30-3,\nand I'd like to be excused from the vote.\nGentlemen has that right and the journal will so reflect.\nAnd\nall\nmembers voted\nThank you, Mr. Speaker, pursuant to House R133X to be excused from this vote.\nGentlemen, has that right, and the journal will so reflect, have all members now voted?\nIf so, the clerk will lock the machines.\nOwn the passage of House Bill 466, the eyes are 143, the nays are 21.\nbill having received the requisite\nconstitutional majority is therefore passed.\nClerk will read the caption to House Bill\n124.\nHouse Bill 124 by Robson and Williams\nthe 145th to be entitled to amend\nChapter 18 in Title 43, the\njust go to Georgia Entity Relating to Funeral Directors and Establishments and Bombers\nand Crematories, so to provide for multiple cremation devices, this bill I've referred\nto the Committee on Regulated Industries, that committee recommends that this bill do pass.\nWilliams do you have any exhibits that you're going to show us with regard to this bill excuse me\nlooking for volunteers how about if I volunteer some to you\ntear recognizes representative Rick Williams to present the bill\nThank you, Mr. Spaker.\nLadies and gentlemen, come before you with a very simple bill.\nI know we keep hearing these simple bills.\nAnd this one actually came through in 2012.\nBut the wording said you could have a alkaline hydrolysis\ncremation device if you had a retort also.\nSo this is just saying you have one or the other.\nThis is recognized by Canada, the Cremation Association\nof North America.\nThe Georgia Federal Directors Association has testified.\nThey had no opposition to it.\nIt's a smaller carbon footprint, very ecological friendly.\nAnd it's also used at the University of Georgia\nat their Department of Veterinary Services, Mr. Speaker.\nSo woof woof, what can I say?\nYeah, this is for Georgia and I ask for your favorable consideration and I'll take any questions, Ms. Speaker.\nYou have a question.\nYes, sir.\nfrom the I can I never can remember if she's the chair of the funeral caucus or\nthe strawberry queen well she's a queen of both\nQueen of both okay chair recognizes representative Bentley to your left for a\nquestion thank you mr. Speaker that's a gentleman yield yes ma'am is it not true\nthat my father-in-law owns three funeral homes in Macon, Jeffersonville, and\nCrawford County, Roberta, and has a crematory. Yes ma'am, that is true. And it's\na not further true that I do support this legislation based on the fact that\nmy family and be a Crawford in Tweet's County do not have any opposition to\nthis legislation. And I thank you very much, Lady Nodes, of what she speaks.\nYou have some further questions you you want to take another one or two. Sure. Chair recognizes\nRepresentative Holkham to your left for a question. Thank you, Mr. Speaker. Does\ngentleman yield? Yes, sir. Is it not true that there is no retort to this retort? That\nis correct. Thank you. Thank you, sir. Chair recognizes representative Gloria Frazier\nup in the gallery for a question. Thank you, Mr. Speaker. That's gentleman Yeal. Yes, ma'am. Could\nyou please explain this bill again because I don't understand what it is. Okay, this is a method\nof cremation where your standard and the usual retort is done by heat and flame. This is a\ndifferent method that is done through alkaline hydrolysis. This is a vessel that\nactually chemicals are added and the remains are liquefied. The end result is\nthe same. It's like going whether you're going in a gasoline automobile or\nelectrical. Thank you. I got it. Thank you. Appreciate it.\nSpeaker, I don't think I need to take any more questions.\nWell you have another one if you want to take one more. I'll finish thank you. All right\nGentlemen is afraid of the retort I guess\nIs there any objection to the previous question being ordered the chair here's none the previous question is ordered\nIs there any objection to agreeing to the report of the committee which was favorable to the passage of the bill\nthe chair here's done the report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill will vote\naye those opposed to vote no and the clerk will unlock the machines what\npurpose does the majority caucus whip representative Kelly rise Parliamentary\nrequirement state you're inquiry this speaker isn't true that we've seen this\nmeasure over a number of years and then we need to pass it so we can finally be\nlaid to rest. That is one way of looking at it. What purpose does\nrepresentative Wolenski rise? Parliamentary inquiry. State\nyour inquiry. Speaker isn't not true that Beethoven got acts to be\nburied with the working compose so he could work on decomposing.\nI think that is true, actually.\nHave all members voted?\nHave all members voted?\nWhat purpose does the chairman of the House Appropriations Committee rise?\nParliamentary inquiry.\nState your inquiry.\nis it not true this could be called the smoke free cremation act of twenty twenty one\nthere is that\nokay\nhave all members now voted\nif so the clerk will lock the machine on the passage of\nhouse bill one twenty four\nThe eyes are 169, the nays or zero.\nThis bill having received the requisite constitutional majority is there for past.\nClerk will read the caption to House Bill 476.\nHouse Bill 476 by Representative Washburn of the 141st and others to be titled an act to amend.\nChapter 15, the top of 43, the fish go to Georgia annotated related professional engineers\nand land surveyors, just to provide that the Georgia professional engineers and land\nsurveyors board is an independent state agency attached to the secretary of state for administrative\npurposes only this bill ever referred to the committee on regulated industries.\nThat committee recommends this bill do pass by committee substitute.\nChair recognizes representative Washburn\nto present the bill.\nThank you, Mr. Speaker,\nladies and gentlemen, the House.\nI think I can guarantee that there won't be nearly as many\nbad jokes from the Chamber as a result of this bill.\nI rise to present House Bill 476,\nwhich very simply the purpose and intent of this\nis to allow the professional engineers and surveyors\nof Georgia to govern themselves.\nAll other southern states do it this way.\nWe are removing them from under the governance\nof the Secretary of State.\nMy long experience is a real estate practitioner\nknows firsthand how this works with the real estate industry\nbeing governed by the Georgia Real Estate Commission.\nIn summary, the professional engineers and surveyors\nwill be served well by this, but most importantly,\nthe consumers of Georgia who use their services\nwill be served well by it.\nIt's a good legislation and I would appreciate\nyour favorable consideration of this bill.\nI'll yield any questions, Mr. Speaker.\nYou do have a question.\nI will yield.\nChair recognizes Chairman Workhizer\nto your left for a question.\nThank you, Mr. Speaker, Jim and you.\nI will, Mr. Chairman.\ncan underestimate this chamber. When my son was going to engineering school, he was being\ntold the importance of engineering. So he said that doctors get a lot of accolades, but\nthey kill one people at a time and engineers kill them by the hundreds.\nan apt observation.\nThank you, Mr. Chairman.\nWhat, you yield for another question?\nI will, Mr. Speaker.\nChair recognizes Chairman Setsler to your right, he waves.\nChair recognizes Chairman Dickie to your right\nfor a question.\nThank you, Mr. Speaker, to the Chairman, you.\nI do, Mr. Chairman.\nDoes this bill have any consequences\nand solving the county line to speak between Monroe County and Bibb County.\nThat's an excellent question, Mr. Chairman, and unfortunately, I don't think it will.\nThat appears to be all the questions that you have.\nThank you, Mr. Speaker, ladies and gentlemen. I appreciate your favorable consideration of this bill.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair hears none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair hears none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage\nof House Bill 476 will vote aye.\nThose opposed will vote no and the clerk will unlock the machine.\nWhat purpose does Chairman Setslow arise?\nPoem in there, including Mr. Speaker.\nState your inquiry.\nFirst, you have to rule 133.\nI'd like to be recused from this move.\nGentlemen, has that right?\nAnd the journal will so reflect.\nHave all members voted, have all members voted,\nIf so, the clerk will lock the machines on the passage of House Bill 476.\nThe eyes are 163, the nays are two.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe'll read the caption to House Bill 539.\nHouse Bill 539 by Representative Cooper, the 43rd to be entitled back to amend Article 2,\nChapter 34 of Title 43, the official go to Georgia and tell you relating the Medical\nPractice Act and State of Georgia, so as to revise provisions relating to institutional\nlicenses. This bill I refer to the committee on Health and Human Services. That committee\nrecommends that this bill do pass. Chair recognizes the chair of the Health and Human Services\nCommittee, Chairman Cooper, to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen,\nthe House, I bring you House Bill 539. About 20 something years ago, this body soft\nthat to institute and to pass a bill for the medical board where they would have be able\nto grant something called an institutional license.\nWhen the board made the rules to that bill, they said an institution was only a hospital.\nThis happened at a time when we were in war and there were some physicians coming from\nsome war torn countries that we thought we might be able to integrate them into our medical\nsystem even though they did not have the same background as our medical\nstudents and our physicians. It's been rarely used these days because of the\nnarrow word institution and how it was defined. The board has seen fit to work\nwith us and work with me and to expand that to an institution means a\nhospital licensed by a Department of Community Health, a board approved\nmedical school, a teaching hospital in a state or a clinic in this state that\nserves predominantly Medicaid, indigent, and underserved populations.\nOver the years, this is not opening a floodgate.\nWe want really good doctors.\nBut it's giving a pathway from physicians from foreign countries that are good\ndoctors that just have a different way than different kind of medical education\nbackground, a chance to work with another physician in their specialty area for\ntwo to three years, and then the board has an chance to re-evaluate them to see if they\ndeserve and give them a free medical license that allows them to practice in our state.\nWe are turning away not dozens of really good physicians.\nI recently was at Emory.\nThere was a young hematologist.\nI always say the young doctors, oh, are you going to stay in Georgia when you finish?\nShe was doing a fellowship in hematology from the Middle East.\nI said to her, oh, are you going to stay in Georgia?\nShe said, oh, I would really like to, but I can't get a license, a fellowship of two years\nat Emory, and she can't get a license in our state.\nSo I would ask for your favorite behavioral consideration of House Bill 539 and Mr. Speaker\nif there are no questions, I'll yield the well.\nYou do not have any questions.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to shall this bill now pass all those in favor of\nThe passage of House Bill 539 will vote I.\nThose opposed to vote no, and the clerk will unlock the machines.\nHave all members voted, have all members voted, if so the clerk will lock the machine\non the passage of House Bill 539, the eyes are 162, the nays are 2. This bill\nhaving received the requisite constitutional majority is therefore passed.\nClerk will read the caption to House Bill 453.\nthree. House Bill 453, members of the McDonald of the 26th and others being\ntitled an act to amend Code Section 42, 86.1 of the fish go to Joe Janited relating\nthe special license plates, promoting or supporting certain worthy agencies,\nfunds or nonprofit corporations, this bill have them referred to the committee,\nmotor vehicles. That committee recommends that this bill do pass.\nChair recognizes representative McDonnell to present the bill.\nMr. Speaker, ladies and gentlemen of the House, I bring before you House Bill 453.\n453 is a firefighter tag bill and in this legislation was developed back in the early\nthe only change, main change in this is striking one word which could make it complex but I don't think it does.\nThat it changes the word on line 14, striking personal, making it available that firemen that have a vehicle through their LLC\nthat on their two days off that they go and do yard work or do maintenance somewhere that they're able to put a firefighter tag on that vehicle.\nthat vehicle. Right now, they can only put it on a vehicle that is owned by them, not\nan LLC. A firefighter tag is assigned to the firefighter. It's not assigned to a company.\nIt's not assigned to a vehicle. So it always stays with that firefighter. So currently, if\na fireman's in this situation, he can only put it on his wife's car, which she's now\ndriving around with the firefighter tag and not the firefighter. There's some cleanup\nlegislation that went in some words in here through Lead Council on end to the bill, but\nthe gesture of the bill is about making it where these firefighters can put it on their\nvehicle that they drive every day. So in closing, I want to remind everyone that firefighters\nsave more than homes. They save hearts, memories, and dreams. Mr. Speaker, ask for a favorable\nconsideration on this bill. I yield for any questions.\nI do not appear to have any questions.\nI yield the floor.\nIs there any objection to the previous question being ordered?\nThe chair here is none. The previous question is ordered.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill. The chair here is none.\nThe report of the committee has agreed to.\nShall this bill now pass all those in favor of the passage of the bill?\nWe'll vote aye. Those opposed will vote no and the clerk will unlock the machines.\nhave all members voted, what purpose does\nrepresentative Robert Tarris.\nShe waves, have all members voted?\nIf so, the clerk will lock the machine on the passage of House Bill 453.\nThe eyes are 164.\nthe nasor zero this bill having\nreceived the requisite\nconstitutional majority is\ntherefore passed.\nChair recognizes representative\nGullet for an announcement.\nThank you, Mr. Speaker.\nGovernment of Affairs will have a\ncommittee meeting full committee\nmeeting today at two o'clock in\nfive o'clock six CLAB.\nGovernment of Affairs full committee\nfive o'clock six CLAB.\nThank you, Mr. Speaker.\nThis house will be in recess for lunch until 12.45.\n",
  "updated_at": "2026-02-12T14:33:56.68425+00:00"
}