{
  "video_id": "-LHjoc6G1HA",
  "url": "https://www.youtube.com/watch?v=-LHjoc6G1HA",
  "title": "Senate PM Day 40 of the 2025 Legislative Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 71,
  "summary": "Here is a structured markdown summary of the Georgia Senate PM Day 40 of the 2025 Legislative Session:\n\n## Overview\nThe session included discussions on several bills, including HB 172 related to student loan forgiveness for veterinarians, HB 222 regarding bond information requirements, and amendments to other bills. There was some debate and procedural wrangling, but ultimately several bills were passed.\n\n## Key Actions\n**HB 172**: Provides for limits on student loan forgiveness program for veterinary education and other purposes.  \n**HB 222**: Amends Title 17 to revise certain bond holding requirements and require inclusion of contact information.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- There was a discussion about the need for large animal veterinarians in Georgia, with a Senator recounting a presentation he attended by an Alabama veterinarian.\n- An amendment was proposed to HB 222 to revise bond holding requirements, but a point of order was raised that it was a \"floor substitute\" and should be struck per the Senate rules.\n\n## Votes\n- HB 172 passed with a vote of 43-4.\n- The amendment to HB 222 was subject to a point of order challenging it as a \"floor substitute\".\n\n## Attendance\nA quorum was present, with one Senator excused for business outside the chamber.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified.",
  "transcript": "Senate will return to order. Senator from the 20th is on deck.\nIs the center from the six on the floor, center from six?\nwere\nAnd\nit's\na\nMr. President\nasked for unanimous consent to remove\nHB 172 from the table.\nAll right. Secretary Reed the caption.\nHouse will 172 represent the\npublic and on the 72nd and others\nwill be telling that to men,\npart 6A of Article 7,\nChapter 3, Title 20,\nthe visual Georgia annotated\nthe Vistula Georgia annotated with a two-state veterinary education. So it's\nprovided for the limits on the student loan forgiveness program for\nour related marriage to be able to look in laws and other purposes. Mr.\nPresident, that completes the letter.\nIs there objection? Hearing none. Secretary, finish the caption.\nHouse Bill 172, Representative Huddleston, and the 72nd and others,\nbetween 10 and 9 to the men. Part 6A of Article 7, Chapter 3,\nTitle 20, the Vistula Georgia annotated with a two-state veterinary education.\nSo it's provided for limits on student loan forgiveness program for other purposes.\nMr. President, the Senate command higher education recommends this bill to pass\neffect was minted Senator Burns chairman that completes the order of\nMr. President.\nWe're going to send it from six.\nThank you Mr. President. I'm bringing to you ladies and gentlemen HB one\nseventy two and right now we got a big need in this state\nfor large animal veterinarians.\nLet me tell you how I know that. I went spoke to the local\nCattleman's Association and when I got there we had a presentation on\nChildren Cover Your Years on Bull Seaman and as I'm hearing this program I noticed that the veterinarian giving the program was from Auburn, Alabama.\nAuburn, Alabama. We couldn't get some eye from Georgia. You know why we couldn't get some\neye from Georgia? Because there ain't none. So, this bill just simply enhances the veterinarian\nLarge animal, lone repayment program.\nFor that, I will yield for questions.\nYou do have one question, Senator.\nWe're going to send it from the 53rd.\nThank you, Mr. President.\nWell, Senator Yield.\nOh, Yield for the good.\nAre you a cattleman?\nI am not a cattleman.\nAre you a member of the Cattleman's Association\nand you're not a cattleman?\nI didn't say I was a member, sir.\nI said I went to speak at it,\nand then listen to a program on Bullseven.\nI just make sure you weren't all hatin' no cattle.\nNo, I don't claim to be a cattleman,\nbut I can't tell you some good qualities\nwhen you go looking for a bull.\nCause I paid attention.\nCause they put me front row and I couldn't get up and leave.\nAll right, let's see, yeah, one more question.\nI'll recognize the Ag Chair.\nOoh, is it Senator Yew?\nOh, Yew, for the man who knows more about cattle than I do.\nSenator, as you close this out,\nyou know what my favorite line you use is,\nwho is this bill for?\nSir, this bill isn't just for farmers.\nIt's not just for veterinarians.\nThis bill's for America.\nAll right, does any of the senator which speak for against measure?\nChair here's done is the previous is there objections to the previous question be in order chair\nHere's none the previous question is ordered is there objection to agreeing to the port of committee\nWhich is favor to the past of the bill chair here's done for the committee is agreed to\nIs there objections to the main question be in order chair here's done the main question is ordered all\nThe question on the past of the bills all those in favor of okay all opposed nay secretary and lot of machine\nYou\nYou\nYou\nYou\nAll in the past of the bill, the A's are 43 and the A's are 4.\nThis bill, hammer, see directs at constitutional majority, is there 4 pass?\nRecognize the senator from the 20th.\nThank you, Mr. President.\nI ask for unanimous consent to remove House Bill 222 from the table.\nSecretary, read the caption.\nhospital C22 where I was in a black one of the one forty six and others the\nbuilding title 9 to a men or the three chapters six and title 17 of the\nfish gutters antiway to bonds and recognizes and criminal proceedings\nthrough as to require the inclusion of certain contact information on such\nbonds and recognizes to repeal and looking lots and rather purposes most\npresent I can place the order\nHere's their objection, that objection is Secretary finish the caption.\nHouse Bill C22, where I was in a black monitor, 146 in others, Bill's been 10 and act to amend.\nI'm Article 3, Chapter 6, Title 17 of the Eiffincialty of Georgia, Anitator, O2,\nMonson, Reckonmath, Answers, and further purposes.\nMr. President, the Senate Committee on Judiciary recommends that this bill do pass.\nWe respectfully submit it.\nSenator Strickland, Chairman.\nMr. President.\nSenator Jones of the 10th and others offered the following amendment number one to amend House Bill 222 by placing lines one and two with to amend Title 17 of the\nEfficiency of Georgia annotated to a criminal procedure, just to revise certain bond holding requirements to require the inclusion by inserting between line six and seven Title 17 of the Efficiency of Georgia\nand for other purposes, Mr. President, I can please see your order.\nBreak it down to the center for the 20th.\nCenter for the 42nd, what purpose do you rise?\nAs unanimous consent to excuse the center for the 19th, for business outside the chamber.\nWithout objection, sir, for the 19th, is it excused?\nMr. President and colleagues, most of the legislation that I bring to you is\nit comes from concerns or concerns,\nMost of the legislation that I bring to you is comes from concerns or ideas from my constituents\ntrying to solve problems they've run into or good ideas they have and that's what House Bill 222 is.\nRepresentative Blackman and I had a court clerk suggest to us that when she's dealing with bonds\nthat they needed additional contact information for the principal and the\nsurety of it just make their life easier and be better for all the parties\ninvolved so all this bill does is adds to currently they are required to\nprovide a mailing address of the principal and surety this would make\nadditional information be provided the full name of the principal and surety\nemail address and a phone number. That's all the bill does. It's good common\nsense legislation and I ask for your favorable vote. Thank you very much. I yield\nthe well. Seniors yielded.\nI would like to introduce our\ncouncil.\nAnd as his microphone to my\nThank you, Mr. President.\nFirst of all, I want to thank the senator from the 20th for bringing this piece of legislation forward.\nIt is very important that we get as much information from the surety and the individual being bonded out so that we can ensure that they make it to all their court hearings and other things.\nWell, all the amendment does is a couple of years ago we did a piece of legislation that\nallowed bail funds to be a part of Title 17 in Georgia.\nWhat this does is lower the cap a little bit to give more opportunities for not only the\nbail funds to get into it, but for anybody else because our ultimate goal is that our\njail is only housed the most violent individuals in Georgia and I think this is a step in the\nright direction.\nThank you, Mr. President.\nAll right, I'm really I really\nfeel the way.\nThank you, Mr. President, I would do a point of order a motion to strike the amendment\nwhichever is most appropriate pursuant to rule 7.6 of the Senate rules that this amendment\nis in the nature of a floor substitute because the amendment is more than one half the length\nby words of the document which it amends, Mr. President.\nSo, what is, give me your official motion, then, Senator.\nThe motion is to strike the amendment under Rule 7-1.6\nbecause it's in the nature of a floor sub-2,\nthe specific reason is not lines, but there are more than half,\nwhether the number of words in the amendment is more than half the number\nof words in the underlying legislation, Mr. President.\nAll right, let me pull, let me pull, let's pull that code station, Sandra, hold on.\nplease come by.\nStand by, center.\nI'll ask for unanimous consent to withdraw the amendment.\nThere's a question with draw the amendment objection out of Jackson.\nThe amendment is withdrawn.\nYou see that you see that bipartisan working together right there.\nI'll tell you what I mean love is in the air.\nTell you what, thankful for the senator from the 14.\nAll right, did any other senator wish to speak for against the measure?\nChair here is none, previous question is ordered.\nIs there objection to agreeing to report a committee which is favourable to the passes\nof the bill?\nChair here is none, and the report of the committee is agreed to.\nIs there objection to the main question being ordered?\nChair here is none, the main question is ordered.\nThe question is on the passes of the bill.\nAll those in favour of the bill, vote gay, opposed nay, secretary, one lot of the machine.\nYou\nYou\nI want to pass to the bill. The yays are 52 and the nays are zero. This bill\nhim received requisite constitution. Majority is there. We'll pass.\nSenator from the 41st. What purpose you rise? I ask for unanimous consent to excuse\nthe senator from the 22nd. From the 22nd? Yes, sir. Without objection.\nSenator from the 22nd is the excuse. Secretary Reed House bill or excuse me.\nand I recognize Senator from the third,\nhome house bill 235.\nMr. President, I ask unanimous consent to take HB 235\noff the table.\nSecretary Reed, the caption.\nHouse bill 235, represent of Townsend,\nthe 177, 179th, and others,\nbetween town and act to amend.\nArticle 1 of chapter 1 to title 20,\nthe official good of George Anteville,\nto General Provisions, wealth of his education,\nso as to require employers,\na school employee to provide leaves of absence\nfor the donation of bone marrow and organs,\nfor standards and conditions for granting such leads and absence and for other purposes.\nMr. President, I can please see you order.\nIs there objection?\nThat objection.\nSecretary, finish the caption.\nHouse Bill 235, where I was in the town of the 179th and I found out there's built between\n10 and 9 to men, Article 1 of Chapter 1 of Title 20, the OCGA, the led to John Provezhens,\nwell, it's education, so it's the required employers of school employees to write leads\nto absence for the donation to bone marrow and organs, driver standards and conditions\nfor granting such leads to abstinence,\nright for penalty for not compliance,\nright for definitions, right for short tiles,\nright for related matters and tribulations.\nWe're people looking lots and for other purposes.\nMr. President, thank you for that education youth.\nI'd recommend that this bill do pass.\nMr. President, please submit it to\nour Hickman Chairman, Mr. President,\nand I complete the order.\nSenator from the third.\nThank you, Mr. President.\nColleagues, I bring you HB-235.\nThis is a bill about living organization.\nOrganization is a selfless and honorable and heroic act.\nI can tell you that we have at least one member in this body\nwho has donated a kidney to a family member.\nAnd I know that we have at least one member in the house\nwho is friend of mine who has done the same thing.\nThis is called the Georgia Supporting Living Donor Educators Act,\nHB-235 seeks to clean up an oversight in the law\nby aligning public school and post-secondary employee benefits.\nWhat's offered to state employees is basically it's a clean up bill.\n235 would provide leave allowances to public school\nand post-secondary employees.\npost-secondary employees would be any person employed,\nnot less than half time in the university system,\nexcluding emergency or attempts.\nAnd it would provide leave allowances\nto those folks who donate organs and bone marrow.\nIt would provide 30 days leave for organ donation\nand seven days for donating bone marrow.\nState employees already have this,\nlet these leave allowances. This leave would not be deducted from annual or sick leave, and\ncount service for calculating retirement benefits. Employees must furnish an official statement from\ntheir doctor to take advantage of this leave benefit. It must do so within seven days before taking\nleave. Each employee class, teachers, public school employees, postsecondary employees are defined\nin the bill but generally as I said include just full-time employees that take state benefits\nand the bill benefit could not be waived by school districts in part of a strategic waver\ncontract and the reason for this bill what brought this bill up is there was a teacher in Georgia\nwho had to donate a kidney to her daughter after a medical emergency educator the educator attempted\nto take advantage of the 30-day leave, given the state employees, thinking it would apply\nto her and was shocked when her school district claimed that it did not. Even though she tried\nto align the surgery in her recovery with the holidays, she was ultimately forced to,\nshe was ultimately forced to take up all of her accumulated sick days and it ended up\ncost in our five thousand dollars and we understand that the district was just\ndoing just following the law but here we make the law and we can correct this. I\nasked for favorable consideration of this and would be glad to answer any\nquestions. You have no questions, Senator. Thank you, Mr. President. Greg\ngoing to send it from the 56.\nSenators a couple of years ago, you were kind enough to vote for the giving the gift of\nlife act. The giving the gift of life act that we passed will ultimately save many, many\nlives in the state of Georgia. What we learned during that time is there was a 62-to-1 return\non investment. Not only were we able to save lives, we saved the significant amount of\ntax dollars. This will do the exact same thing for those working on our school system.\nSo there's not too often a time that we can work on a bill together, that we can say\nit will save lives, it will do the right thing, and save money all in the same breaths.\nSo thank you to the center for the third and for Representative Townsend who brought\nthis forward who is a former educator and an organ donor as I am. Thank you. I yield\nwell. Right, the center's yielded. Would you like to go to the well?\nInter inquiry. Station inquiry. Is it not true that under the leadership of a former chairman\nof the Health Committee on the House side, we once had as a part of the encouragement\nfor organ donation we would give a $5 deduction on a driver's license if you\nsigned to be an organ donor. Isn't it true that that might be yet another\nincentive that we could place to increase organ donation on our state you\nknow. Going forward that that sounds like something to be good to take up\nall season. Thank you. Is the other senator wish to speak for against the\nmeasure? Chair here's none. Is there objection to the previous question being\nordered? Chair here's none. Previous question is ordered. Is there objection to\nagreeing to the board committee which is favourable to the past of the bill?\nChair here's none. The board committee is agreed to. Is there objection to making\na question being ordered? Chair here's none. The main question is ordered.\nQuestions on the past of the bill. All those in favour of the bill. But yeah,\nWho knows?\nIt's all under the machine.\nYou\n.\n.\n.\n.\n.\nSenator from the 45th on the past of the bill, the A's are 54 and the A's are zero.\nThis bill has received requisite constitutional majority is there for pass.\nNow, Senator from the 45th.\nThank you, Mr. President.\nI ask for unanimous consent for HB360 to be elevated from the table.\nSecretary, read the caption.\nHouse Bill 360, Robert's Interestation,\nand we'll have earned fourth in others.\nThe Bill's Maintain on Active Men,\nArticle 2, Chapter 7, Title 4A.\nThe official go to George Ante,\nloyalty to the income tax imposition,\nrate computation exemptions, and credit.\nSo, it's the rise in tax rate\nfor the rehabilitation of historic structures.\nThe authorize the credit to be claiming\nthe taxable year of the year.\nThe certificate of occupancy is obtained\nfor certain pre-approved rehabilitation.\nIt's right for lay matters for people\nlooking at laws and other purposes.\nMr. President, that completes the order.\nIs there objection?\nHearing none, Secretary, finish the cap.\nHouse Bill 360 by the representative of the administration, 104th and others,\nBill Tuminton and act to a manner equal to Chapter 7 Title 4A,\nthe OCGA, led to income tax, imposition rate,\ncomputation, exemptions, and credits.\nThat's the revised tech fair for the rehabilitation of historic structures to authorize\ncredits to be claimed in the text of the year, the year certificate of occupancies obtained\nfor certain pre-approved rehabilitation of rather purposes.\nMr. President, the Senate Committee on Economic Development and Tourism recommends\nthat this bill do pass, so that it will be submitted, Senator Beech, Chairman.\nMr. President, Senator Dulles, on the 27th and others offered the following amendment.\nNumber one to amend House Bill 360,\nbear replacing on line three,\nthe credit with a reduced credit\nby deleting inserting one on line 13\nby replacing inserting 2027, 2028 or 2029 on lines 15 and 16\nwith inserting 2027 or 2028 by placing lines 19 through 24\nwith the following honor before July 1st, 2026 provided.\nHowever, that any taxpayer that claims tax credits\npursuant to the sub-second and tax your 2026\nshould only be allowed to claim such credits\nin an amount and for other purposes.\nMr. President, that completes the go-order.\nWe're going to ask Senator from the 45th.\nThank you, Mr. President.\nColleagues, I bring HB360 before you today.\nThis bill we have debated at great length.\nI think everybody in the chamber understands what the bill does has to do with our historical\ntax credits and the senator from the 27th has a friendly amendment that I think will help\nand ease some of the concerns within the chamber.\nWith that, Mr. President, I yield well.\nSenator from 27th, would you like to speak to your amendment?\nThank you, Mr. President, colleagues.\nI want to highlight for you what we've changed on this bill.\nI will inflow it full disclosure to tell you I voted against this bill the first time it\ncame to the floor.\nI had a number of concerns and I'm going to start with each one of my concerns and tell\nyou how we address them in the amendment.\nFirst of all, I was concerned that this was a credit that was just done for one project\nor one area and that is I understand it was done not because the author wanted to\nhave done that way because DOR had advised them in that direction but we've had a conversation\nwith DOR and then we've also talked to the bill sponsor and we are replacing lines 19\n24 in the file in the bill and what that does is it removes the requirement that this\nbe within a 10 mile radius of cabbage town. So the statewide piece of this is now in place.\nI was concerned with pulling three years of credits forward so we are changing it so\nthat you can only pull forward years 2027 in 2028. I was also concerned that the state\nwould be pulling money forward in a disadvantage to a revenue shortfall in the budget without\nany sort of financial benefit to the state.\nSo what we're doing is we're saying that if you pull\nforward 20, 27 tax credits, you do so at $0.90 on the dollar.\nIf you pull forward 20, 28 tax credits,\nyou do so at $0.85 on the dollar.\nAs you all know, for the money that we hold in the reserves,\nwe do overnight swaps, a number of other things,\nand we're earning four and a half to five and a half percent.\nWe have a fixed amount of money on these credits.\nthese credits will be paid out.\nSo if we don't pass this bill,\nthey'll be paid out in 27,\nand they'll be paid out in 2028,\nand they'll be paid out at full value, at dollar for dollar.\nThis allows us for the 27s to earn 10% out of our money,\nand it allows us for the 28s to earn 15% both of which would\nbe higher than if we just kind of had the money\nin the reserve fund and did not use them.\nSo with that, Mr. President, I hope that that clears up\nwhat the amendment does,\nI was really happy to answer any questions.\nYou do have one question, Senator.\nWe're going to have a second from 38.\nThank you, Mr. President.\nMr. Chairman, do you?\nI do.\nI'm sorry.\nI just missed your explanation for line three\nof the amendment where we're replacing the three years\nwith the two.\nCan you just explain that one more time?\nSo I was trying to get you to the bill, but I wasn't able to.\nSo the original version of the bill\nwas going to allow an entity to pull forward 27 or 29 tax\ncredits.\nThis makes it so they can only pull forward any credits they have for 20s 27 in 2028.\nI'm glad you're answering your question because I forgot about one other change.\nThe CEO now needs to be completed by July 1st of 2026.\nSo in the original version of the bill, you know, we talked a lot about the World Cup or the sponsor talked about the World Cup.\nAnd we actually are changing the CEO completion date for the project.\nWe're moving that up from December 31st to July 31st\nso that it is indeed done by the World Cup.\nI think the other mechanically what happens with that\nis since these projects take a while to develop\nit's gonna make a lot less projects available\nboth by the 2029 change\nthan also moving the completion date up by six months.\nThank you, I think those are important changes.\nThank you.\nThank you.\nRight now it's the Senator from the 55th.\nwith the gentleman here I will thank you sir exactly who benefits from the\nchanges that you have proposed and who benefited prior to these changes can you\ntell this honorable body who benefits for those changes so two main reasons why\nI made these changes in working with the House sponsor and the Senate\nsponsor one was to the state benefits the taxpayers of the state of Georgia if we\nwait until 27 or 2028 for these credits to be claimed, they will cost us a hundred\ncents on the dollar. We are going to earn money by allowing them to move them\nforward, either ten cents or fifteen cents to pay on the year that they move\nforward. Secondly, by changing this from being tied to a geographic region\nwithin ten miles of cabbage town, we make this statewide. Any other historic\ntax credit benefactors who may want to forego the ten or fifteen cents on the\ndollar to get them moved forward, they will be eligible as well. Part of the\nargument senator if you remember is that people were concerned with this\nproject being able to jump to the front of the line and this makes it so that\nevery person in the state who's been pre-approved for credits is on equal footing.\nThank you, Mr. President.\nWith the sender yield.\nYes, sir.\nSo your amendment makes this statewide and not just within the 10 mile radius.\nIs that correct?\nCorrect.\nOkay, so 2026 is the triggering mechanism. What if a person just\nDidn't take advantage of the 2026. Would they still just fall in line with their normal\n27 28 and 29 tax credits? Yes\nSo should they either not be complete or that you may have\nDevelopers who will say we don't want to pay 10% to be able to pull forward a year because we can go borrow against this money at 5% and arbitrage that\nThey will still be able to collect that's my point we these tax credits get maxed out\nAnd so we will pay these credits out in 27 or 28 if we pay them out in 26\nWe'll do so to reduce to rate which is why my interest in this amendment is why I believe this improves the bill\nDo you think people will take advantage of that Senator? I certainly believe we know some projects that will\nWhether there will be projects outside of the original 10-mile radius or not. I genuinely do not know. Okay. Thank you\nThank you, Mr. President, I yield the well.\nWe recognize the senator from 36,\nthe bill.\nMr. President, colleagues, regarding House Bill 360 there's probably a small demographic\nof people that really follow these historic renovation tax credits and this bill has\nkind of put it before all of us.\nI want to point out that historic renovation tax credits are a good thing.\nAnd we did a study on several years back led by the Finance Committee Vice Chair.\nIt was proven that the state makes money.\nThe state comes out on top by having a tax credit for historic preservation and renovation.\nAnd it was actually almost, for every $1 state expenditure, the state recognized\nclose to $4 coming in from all of the activity of the preservation and these commercial historic\ntax credits.\nWe also have residential historic tax credits now.\nWhat has happened is that this has incented, this tax credit is not unimportant.\nimportant. And in sense gives the incentive to launch and complete historic restoration\nand renovation that could otherwise not possibly not happen. The problem is, and I'm voting\nfor this bill today, the problem that I think we need to tackle going forward is we need\nto look at the level of historic and preservation tax credits.\nIt's capped at 30 million per year.\nAnd there was a bill that came out of ways and means to raise the cap from 30 million to\n50 million that did not ever get over here to this side.\nI would have liked to have seen that in this bill.\nBut I say to you, we need to understand that tax credit, understand its value, and see\nthat statewide there are pressing needs for investment in historic preservation.\nDo you know, it's my information I've been told that Florida, South Carolina, Alabama,\nMississippi, and Texas all have much higher levels of investment in historic preservation\nand renovation, and we have needs all over the state.\nI know the senator from the 46 spoke up about needs in his,\nthe city of Athens, the home of the university\nfor these tax credits to be available.\nSo right now, the big news is we don't have enough,\nwe're not investing enough in these tax credits,\nwhich one, bring back properties, preserve properties,\npreserve the treasures that we have all across our state of historic buildings and I know\nthat the representative Penny Hausten from Nashville in the house. This was something\nthat she dedicated herself to for her small town to have Main Street renovation of historic\nold buildings so it's applicable and a plus in tiny little communities and in great\nbig cities like Atlanta where they're these properties that are crying out for preservation\nand investment and so I say to you as I cast my vote for this bill which has been altered\nsomewhat by the amendment that the senators presented the well prior to my coming to\nthe well. This is not unimportant and I am supporting this bill and urging many, many more\nof us to heed the call that we need to catch up with the other states on what we invest\nin historic preservation. If we don't, it crumbles, it's gone, and it never comes back.\nAnd we have a state that's just full of historic structures that we need to be\ntreasuring and renovating and we can do that.\nAnd I did the author of the bill from the house who's worked very hard on this bill and\nworked with all of the stakeholders on it.\nAnd has told me that he is happy to roll up his sleeves and work with us going forward\nto see that we have historic tax credits that are a plus.\nNot reducing it, not reducing what's there, expanding it, and meeting the needs that we\nhave all across our state.\nAnd I know there are people all across this room that can bring their testimony about\nwhat happened with a great restoration or renovation that was done in their district\nwith the benefit of these tax credits.\nI have made my point, I hope my point has been heard.\nWe have a lot to try to understand, get our arms around on this historic preservation\ntax credits.\nBut they play an important role and they generate revenue for the state, good people.\nThey generate revenue for the state and not a dime of state money goes out until the\nwork is done, until money's been expended and then this tax credit is provided after\ngoing through a lot of hoops to get to that point.\nSo if there are no questions, I'll yield the well.\nHappy to yield to questions.\nBut that is my perspective on supporting House Bill 360.\nSenator, you have no questions.\nThank you.\nI yield the well.\nWe have a late arriving amendment here.\nSecretary, read the amendment.\nMr. President, Senator Chiller, the 19th,\nover the following amendment number two to Men House Bill 360\nwhere we're placing online three,\nthe credit with reduced credits by inserting after 2026\non the line 19, the following provided however,\nthat any taxpayer that claims tax credits pursuant\nto the subsection in tax year 2026\nshall only be allowed to claim such credits\nin an amount A not to exceed 90% in the amount\notherwise allowed pursuant to code section.\nIf such credit was pre-approved in tax year 2027,\nB not to exceed 80% in the amount otherwise allowed pursuant\nto this code section, if such credit\nor was pre-approved for Texture 208 or and for other purposes.\nMr. President, I request you order.\nWe're going to the center from the 19th to speak to the amendment.\nThank you, Mr. President.\nMembers of the Senate, all my amendment does is in keeping\nwith what the senator from the, I believe the 27th was doing.\nInstead of taking just 10% the first year down,\n5% the second year down, it takes 10% down\non that tax credit the first year,\n20% down on the second year.\nI think that's more in line\nwith what you're seeing interest rates doing currently.\nIt's not a 5% interest rate world anymore.\nIt's more of a 7% interest rate,\nand this is kind of in the middle.\nThe argument can clearly be made\nwhile it's 10% the first year,\n5% the second year,\nso it averages out to be seven, fair argument.\nBut again, you are getting tax credits on a project\nthat we think's already probably being built to begin with.\nSo I would ask for you to consider,\nif we're going to grant this for something\nwe believe's already happening,\nwe should walk it down 10% in the first year.\nIf you're gonna pull it forward two years, 20%,\nif you're pulling it forward for two years.\nThat's it.\nIf there's any questions, happy to answer them.\nAnd everyone votes your conscience.\nYou have no question, Senator.\nI recognize the senator from the 21st, speak to the bill.\nThank you, Mr. President.\nSenators, I rise to support House Bill 360, and I put this jacket back on because this\nbill is about dollars.\nabout economic development. It's about money. And, you know, we talk a lot about the World Cup,\nand I want to thank the Senate from the 27th by moving that date so this historic area that they're\ntalking about, and I know it's statewide now, will be done in a much faster time. But we have to\nlook at this as a 30-year play. Let me tell you what, we have something called the World Congress\ncenter that's a thriving convention business.\nIt's 1.8 million square feet of convention space.\nAnd that's a very competitive business.\nWe compete with Nashville, New Orleans, Orlando, and Las Vegas.\nAnd we don't really have a lot of nightlife here in Atlanta.\nYou go to moans or chops, and after 9 o'clock,\nthere's not a lot of places to go.\nWe need music.\nWe need nighttime activity.\nThese folks are going to develop that area.\nIt's going to be a destination place along with\nCentennial Yards.\nWe're going to revitalize that area,\nand it's going to be about dollars.\nSo anyway, please vote for this,\nand let's do some economic development in these buildings.\nLet me tell you another story.\nMy wife and I, we opened a restaurant\nabout 20 years ago down in downtown Alphoretta,\nand the building was built in about 1915, 1920.\nAnd when you go and do electrical work,\nyou think it's going to cost you about $5,000,\ncost 15 every time you open up a different door there's another skeleton that pops out\nbecause these buildings are not up to code and you've got to you got to put money into\nthat so we need to help these folks renovate these buildings like the senator from the\n36th set or they're just going to crumble away and we got to save our history and do economic\ndevelopment mr. President if there are no questions I'll yield the well you do have one\nquestion yes recognize senator from the 47th yes sir thank you mr. President\nWould the senator yield yes as my friend from the 26 says\nWhat is it all about the money? It's all about the money just like the senator from the 26 says and we got to we got to make sure\nWe keep Georgia the number one place to do business and especially with our historic building so please vote. Yes, I yield the wellness\nTreasure has spoken\nI think Mr. President I'm going to be brief but I do want to speak to the two amendments\nthat we got on this bill and I want to I'm going to commend the senator and the 27th\nfor his work with the parties, with the stakeholders, with the leadership over in the house to\nto come up with the terms that are in amendment number one,\nI support the terms of amendment number one.\nNot only is it good for the bigger picture,\nI think it's also good for the relations,\nbut also the mathematics work out so that what's reflected\nhere is one where although this is better for the state\nto do this than the bills originally drafted, it's fair.\nI think amendment number two is one\nthat quite frankly is a bit punitive,\nand I think one thing we need to understand\nis that these credits have already been granted.\nThey're coming in the future.\nThey've been granted to the applicant\nwho is now the anticipated recipient.\nSo they're going to get the money.\nTheir receipt of these tax credits in the future years\nis not going to impact others\nbecause of the way they're staged.\nAnd so I think and appreciate Senator from the 27th.\nAnd I appreciate Senator from the 45th\nfor bringing this bill.\nBut in particular, this carefully crafted compromise\nthat we've got with amendment number one is fair\nto everybody, it's fair for the state.\nAnd I think it continues to send a good message\nthat the money man who was up here before me\ntries to tell us about, which is that Georgia\nis a great place for economic development.\nAnd I think my senator friend from the 26,\nI don't know if he agrees with this or not,\nbut maybe he does, he does, okay, I understand.\nBut with that, I urge your support for a minimum number one,\nlet's pass 360, while this deals with an Atlanta project,\nand I know those of us that live outside Atlanta,\nsometimes envy all the economic development in Atlanta,\nbut the truth is, as our capital city Atlanta goes,\nso goes the economic temperature and conditions\nfor the rest of us around the state.\nSo we're all in this together.\nLet's vote for amendment number one\nand pass Senate Bill, excuse me,\npass House Bill 360, I would yield the well.\nSenator from the 13th, are you for this thing or against it?\nHuh?\nYou're for it?\nWell, you know, there is this thing called overselling something.\nAll right.\nHe can talk something to death, and also, and he gets no votes.\nSenator Dickson, would you like to close?\nI'm still in front of the 45th.\nHe'd like to close debate.\nSenator Ways.\nAll right.\nSo, we've got, we've got Senator from the 27th or you want to be recognized?\nParliamentary inquiry.\nStatue inquiry.\nWhat happens if both amendments pass, given that they have, is it,\nif amendment two passes and then amendment one passes, given they have\ncontradictory subject matters at whichever one passes last?\nIt is of the chair's opinion that if Amendment 1 does pass it, then it will basically\nWe've got amendment two.\nThank you.\nOn the adoption of amendment one,\nis there objection to amendment one?\nThat objection, amendment one is adopted.\nYou\nSo I think this makes your, um, makes your amendment null and void here, all right.\nIs there objection to agreed to the Board of Committee, which is favorable to the past of the bill?\nChair here is none, and the Board of Committee is agreed to.\nIs there objection to the main question being ordered?\nChair here is none, and the main question is ordered.\nQuestions on the passage of the bill as amended.\nAll those in favor of the bill vote, yay, all opposed, nay.\nSecretary, I'm not in the machine.\nSenator from the 32nd, Senator from the 32nd, Senator.\nI'm a you'll be your own deck I'm a puts I'm just move the move the calendar around a little bit so you'll be right after this next person, okay?\nRecognize the center from the 35th.\nAll the pass of the bill the a's are 49 and the nays are six. This bill having to see the record constitution majority is there for pass as amended.\nMr. President, I ask for unanimous consent to remove HB 422 from the table.\nSecretary, read the caption.\nHouse bill 422, where I was in a McComb, the 30th, and others built between Title IX to\namend chapter 18 and Title 45, where the OCEA will allow two employees' insurance and\nbenefits plans as to provide the state employee's health insurance plan to include high deductible\nhealth plans to provide for later matters for people who are looking for laws and for\nother purposes, Mr. President, I complete to the order.\nIs there objection?\nHearing none, Secretary, finish the caption.\nHouse Bill 422, Barbara, Senate McCollum of the 30th\nand others in between town and act to amend,\nchapter 18, it's out of 45,\nbut those to GA will allow to employs health insurance\nand benefits plans, those are by the same employees' health\ninsurance plans include high deductible health plans, draw up, provide for later matters\nfor people with conflicting laws and further purposes.\nAnd Mr. President, thank you for your time.\nAnd I'm sure it's a labor recommends that this bill do pass by a sub-series\nthat could submit it's in a walker chairman.\nMr. President, thank you for your time.\nAnd I'm sure it's a labor officer following sub-series that has bill 422.\nBill, tell me tell them not to amend chapter 18 and type of 45 with those GAO to help\nemployees insurance and men of his plans.\nSo it's required that the same employees health insurance plan include high deductible\nhealth plans and further purposes.\nMr. President, I complete the order.\nThank you, Mr. President, colleagues, I have a simple bill here.\nWhat it does is it requires the state to provide its employees with at least two high deductible\nhealth plans.\nWhat it also does is it requires a state to provide its employees at pre-tax, pre-tax\ndeduction for health savings accounts. And if that sounds familiar, we passed a very\nsimilar bill two years ago and it passed unanimously from this chamber. So this is a similar\nto a bill that has already been adopted by this body. And with that, Mr. President, I'll\nyield for any questions.\nThank you so much, I'll yield the\nwell.\nSo from the 31st, you have a.\nMr. President, you name it's\nconsent to excuse the centers from\nthe 8th and 30th for business inside\nthe couple from the 8th and 6th.\nThe 8th and 30th in the 6th.\nYes, sir.\nI would not objection the 8th and\n30th in the 6th are excused.\nDoes any of the senator would speak for against a measure?\nChair, here's none. Is there objection to the previous question being ordered?\nChair, here's none. Previous question is ordered. Question on the adoption of the committee. Substitute is there objection to the adoption of the committee?\nSubstitute hearing none. The committee's substitute is adopted. Is there objection to agreeing to the board of the committee, which is favorable to the passes of the bill?\nChair, here's none. For the committee is agreed to. Is there objection to the main question?\nYeah, I'm to the the question. The main question is on the passes of the bill by first substitute all those are favorite vote. Yeah, I'll pose nay secretary on the machine.\nYou\nAll in the past of the bill, the A's are 52 and the A's are 1 and this bill having to\nsee directs and constitutional majority is therefore passed by substitute.\nWe're going to send it from the 30 second.\nMr. President, I ask for unanimous consent to remove House Bill 352 from the table.\nSecretary, read the caption.\nHouse Bill 352, by President Sebal, 34th and others, the bill has been toned\non act to amend Code Section 49 and 4-S-159.4.\nThe event should go to Georgia annotated with two coverage for continued school ghost monitors.\nThe revised coverage criteria include Medicaid recipients with gestational diabetes.\nThe right for related matters to provide for short titles for people who are looking\nout some other purposes. Mr. President, I complete the order.\nRecognize is there objection? I'm sorry, is there objection that\nhere in Secretary of Finisher Caption? Has both three of the two by\npercent of C. Bob 34th and others are built between 10 and 9 to\nmen. Code section 49-4-159.4. The official code of George\nAnte will do coverage for a continuous glucose monitors and\nother purposes. Mr. President of the St. Commander in Health and\nHuman Services recommends that this bill do pass by committee\nsub-suited center Watson Chairman. Miss Preston and the Senate can be\non a health and human services office following sub-suited to ask about\n352 a bill to entitle an act to a menco selection 49-4-159.4 those\nC.G.A. would like to cover for a continuous glucose monitor so it\nprovides coverage criteria to include medicated recipients and for other\npurposes. Miss Preston that completes the order.\nRecognize the senator from 30 second. If I could get everybody's attention real\nquick. Skin a little loud. Skin a little loud. So if everybody could just\ntake it down to a whisper and give the senator in the well a little bit of\nattention. Thank you, Mr. President. Haswell 352 is about just\nstation diabetes and what it does is revise Medicaid coverage for continuous\nglucose monitors to include just station diabetes. This helps to prevent\npregnant women from going into the hospital and delivering preterm and it\nthat should help us with our fight against maternal mortality.\nBe happy to answer any questions.\nThank you.\nDoes any other senator would speak for against a measure?\nChair, here's the...\nChair, would you like to speak in a while?\nGreg and I have a senator from seven.\nThank you, Mr. President.\nI just wanted to say I rise in support\nof this important piece of legislation.\nI had gestational diabetes with my first child\nand having glucose monitoring was incredibly crucial.\nAnd I'm glad that we'll be able to expand that service\nto more women.\nAnd I ended up delivering my child preterm,\nbut it will not only help women,\nbut also our infant mortality rates as well.\nAnd so, I'm sure everyone's going to vote yes.\nPlease vote yes on this important piece of legislation.\nThank you.\nDoes any of the Senator would speak for against the measure?\nIs there objection, previous question being in order?\nChair, here's nine, previous question is ordered.\nQuestion is on the adoption of the committee.\nSubstitute is there objection to the adoption\nof the committee?\nSubstitute.\nHearing none, the committee's substitute is adopted.\nIs there objection to green to the reporting committee,\nwhich is favorable to the passes of the bill?\nChair here is none,\nthe board of the committee has agreed to.\nQuestion is on the passes of the bill,\nby substitute all those in favor vote,\nyay, I'll pose nay, secretary, and lock the machine.\n.\n.\n.\n.\nAll on the on the passes of the bill the a's are 51 and a's are one this bill haven't received\nrecords that constitute from majority therefore passed by substitute recognize the sender from\nthe 29.\nSenator, you got to make a motion.\n238, Senator.\nMr. President asked for unanimous consent to lift House Bill 238 off the table.\nSecretary, read the caption.\nHouse Bill 238, Barbara.\nof lums in the 12th and others built between town and act to a men chapter 8 to 10 to 35\nthose CGA going to employment and training of police officers that require the Georgia\npolice officers in training council to create and maintain an at risk adult training\nof course focusing on officer response individuals with Alzheimer's disease are to mention\nit to arrive for requirements for a such course for a collaborative course development\nof the division of aging services for a layman minister building laws and for other purposes\nis Mr. President, I complete the order.\nIs there objection?\nHearing none, Secretary, finish the cab.\nHouse Bill 230, members on the 11th and 12th,\nand others will be in town in Latin America.\nAnd chapter 8 of time, 35 of those in GA,\nwill be to employment training of police officers.\nThat's required of the Georgia police officer.\nAnd it's the training council to create and maintain\na risk in front of the purposes.\nMr. President, the Senate Committee on Public Safety\nrecommends that this bill do pass.\nRespectfully submitted, Senator Albert,\nchairman of Mr. President, I complete the order.\nrecognize the center for the 29th.\nThank you, Mr. President.\nColleagues, it's very simple.\nI think we all understand the issues we're having\nwith Alzheimer's here in Georgia and throughout the country.\nAll this does is just require that GIP stick\ncreate training for law enforcement,\npersonnel, medical personnel, and behavioral health,\nco-responders, regarding police response for at-risk adults, those who suffer from Alzheimer's.\nThere's no additional funding needed.\nThey were dipstick was contacted during this process by the House Carrier, Chairman\nLumsford, and had no issues with it.\nThe bill passed out of the House and is now ours to consider.\nI would greatly appreciate your positive vote\non this legislation, HB-238.\nAnd with that, Mr. Chair, Mr. President,\nI yield the well.\nSeniors yielded.\nZia, Senator, which speak for against the measure?\nChair, here's none.\nIs there objection to the previous question being ordered?\nChair, here's none.\nThe previous question is ordered.\nIs there objection to agreeing to the Board of Committee,\nwhich is favor to the passes of the bill?\nChair, here's none.\nThe Board of Committee is agreed to.\nIs there objection to the main question being ordered?\nChair here is none of the questions ordered.\nAll questions is on the past of the bill.\nAll those in favor vote.\nYay, all opposed nay.\nSecretary, I'm not the machine.\nYou\nAll in the past of the bill, the A's are 52, the A's are 0.\nThis bill hemmed to see the requisite constitutional majority is there for pass.\nWe're going to send it from the 23rd for a motion.\nMr. President, I request that House Bill 399 be removed from the table.\nSecretary, read the caption.\nHouse Bill 399, representative Oliver, 84th and others, the bill between 10 and active men are Article 1 of Chapter 7, Title 44.\nThe official go to Georgia, annotated with two landlords in tenants in general,\nso as to require certain residential landlords, have in-state staff to manage tenant communications related to such properties,\nto provide for later matters to be able to move the laws and for other purposes.\nMr. President, I can please the order.\nIs there objection hearing none sinners finish I mean secretary finish the caption House will 399 represent all over the 84th another\nIt's built between town and active men are the one the chopper 7 type of 44 those CGA relates to landlords and tenants in general\nSo it's a requirement residential landlords that have instate staff and other purposes most present thank him and economic development of tourism\nRecommends to this bill to pass by subsequently spend it center beach chairman\nMr\nPresident thank him and economic development of tourism also long subsidy to have well 399 a built between town and active men article two\nChapter not 74 title 36 of OCGA related to local enforcement boards created honor after January 1st, 2023\nSo it's required that certain information regarding the property managers\nCertain properties is provided upon request of the code of enforcement officers and men\nArticle 1 chapter 7 and further purposes Mr. President center burns the 23rd offered following amendment number one to amend\nThe substitute to house bill 399 by inserting after the second owner online 47 as the family member of an owner as that\nThe term is defined in rules promulgated by the commission, Mr. President, that completes the order.\nI get on the same for the 23rd.\nThank you, Mr. President, colleagues, I bring you House Bill 399.\nThis addresses problems with the management of residential single-family homes and duplexes\nwhich are owned by institutional investors.\nThis has become quite a challenging environment.\nI'd like to acknowledge that there are a high percentage\nof homes in the metropolitan Atlanta area\nthat are investor-owned in the Incident District 10.\nThere are 4,901 homes owned by investor group.\nThat's 49.9, 49.2% of all single-family homes\navailable in Senate District 10. In Senate District 43, it's 39. In Senate District 30, it's 28.\nIn Senate District 45, it's 31. In Senate District 28, it's 26. So, in many of our districts,\nmore than 25% of single-family residential rental property is owned by institutional investors.\nThis bill just requires that that investor group have a broker that is a\nresident of Georgia or if they're not a resident of Georgia, that broker is not\na resident of Georgia, then they employ a property manager who resides in\nGeorgia to make sure that they can deal with tenant communications, tenant\ncoordination, repairs, maintenance, and those types of challenges. The amendment is a\nfriendly amendment. It adds in section 2 online 47. It adds the ability for an owner's\nfamily member. So as the family member of the owner also satisfied the exception. You'll\nNotice that section two deals with exceptions to the requirement to have in-state property management or property brokerage,\nbut this would just allow this family to continue to own and operate their property.\nI'm happy to accept any questions, or I'm happy to yield the well.\nYou have no questions, sir.\nThank you.\nI yield the well.\nDoes any other senator wish to speak forward against the measure?\nChair, here's none.\nIs there objection to the previous question being ordered?\nChair, here is none of the previous question is ordered.\nQuestions on the adoption of amendment one?\nIs there objection to adoption of amendment one?\nObjections in amendment one and is adopted?\nQuestions on the adoption of the Committee's substitute\nas amended, is there objection on the option\nof the Committee's substitute as amended?\nHearing none, the Committee's substitute\nas amended is adopted?\nIs there objection to agreeing to the Committee\nwhich is favorable to the passed out of the bill?\nChair, here's nine for the community that's agreed to.\nIs there objections?\nThe main question being ordered.\nChair, here's nine, main question is ordered.\nQuestions on the passes of the bill.\nAnd by substitute, all those in favor vote yay,\nall opposed, nay, secretary, and locked machine.\nThank you, Mr. President, I ask for unanimous consent to excuse the senator from the 35th.\nThat objection center from thirty-fifth is a skews.\nSenator from the twenty-first, your own deck.\nWe'll take a minute break.\nOwned the pass to the bill.\nThe A's are 41.\nThe A's are 9.\nThis bill have received the requisite constitution.\nMajority is there for a pass.\nBounce up to you.\nWe're going to take about a five or ten minute break,\nsecretary needs to get caught up on the special actions\nthat we're going to have coming up here.\nSo just stay in the ease for about ten minutes.\n",
  "updated_at": "2026-02-12T17:06:09.700301+00:00"
}