{
  "video_id": "-Mo8uEhzaeU",
  "url": "https://www.youtube.com/watch?v=-Mo8uEhzaeU",
  "title": "8/9/2023 - Joint Study Committee on Dual Enrollment and Highly Skilled Talent",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 99,
  "summary": "Here is a structured markdown summary of the Georgia 8/9/2023 - Joint Study Committee on Dual Enrollment and Highly Skilled Talent session:\n\n**Overview**\nThe session focused on the healthcare workforce and dual enrollment programs, with legislators highlighting the success of the College and Career Academy partnership with Phoebe in Albany, Georgia. The committee aims to find ways to expand dual enrollment and develop more highly skilled talent at younger ages across the state.\n\n**Key Actions**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- Senator Frady Powell-Sans welcomed the committee and attendees to Albany, Georgia.\n- Representative Matt Dubnik, chair of the House Appropriations Subcommittee on Education, discussed the importance of developing Georgia's workforce and challenged the committee to find ways to improve dual enrollment programs.\n- The committee plans to hold a future meeting in Newnan, Georgia to focus on dual enrollment and manufacturing.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was met, with legislative leaders from across Georgia in attendance.\n\n**Adjournment**\nThe session adjourned, with the next meeting scheduled for a future date.",
  "transcript": "you you on I want to welcome everyone to Albany, Georgia, Albini if you're from here. I would like to first recognize the state senator for this area. My good friend Senator Frady Powell-Sans. Senator Powell-Sans, would you like to grab this mic? Kind of welcome everybody. Let's start us off with a prayer. Good morning everybody and welcome welcome welcome to Albany, Georgia. If you have not been here before, we are certainly excited to be able to host you. Now Senator Brass knows that I'm not a name dropper, but I'm dropping names this morning, okay? Senator Brass is one of my dear friends in the Senate and has been for a very long time, so I'm excited to have him here. I asked him early on as well as the lieutenant governor if they would come to Southwest Georgia to take a look at us and see what's going on. And they said yes, so more to come. Also, and I want to do that, I'm just going to name drop him because he is my friend. But Southwest Georgia is immensely honored to have legislative leaders from across this great state of Georgia gather for the express benefit of our children. Good morning Elena, how are you? This gathering represents the epitome of educational experts seeking economic solutions for the future of Georgia and our children. And you'll hear me say children a lot of times, okay? Ladies and gentlemen, what you will hear and see today will intensely promote educational career pathways for students. And when this committee has completed its work, it will have strengthened Georgia's work for us for every sector of our economy. Just remember that. Now, would you please bow your heads. Let nothing move you always give yourselves fully to the work of the Lord because you know that your labor in the Lord is not in vain. First Corinthians 15th chapter 58 verse. And now, thank you so much. And now, I would like to just mention a few things about our fearless leader. And I want to name drop, sent out to Elena parent. She is my leader in the house. I mean, in the Senate, I'm sorry, I was a house member at one time. Oh, no. So good morning Elena and welcome to all of any. Thank you so much for coming. Senator brass represents district 28. I hope this is the right information since I hope it's been updated. His committee memberships and I'm going to tell you that he is chairman of rules. And those of us that don't know what rules is, that committee chairmanship, it is probably the most important position you can have in the capital. He determines what bills are going to get heard out of the Senate or let out of the committee. And if you, okay, so much for that. But anyway, this is a very coveted chairmanship. It is at the top of everything. He's a part of regulated industries and utilities. Children and families, he's the secretary, education and youth, ex officio, health and human services, a member of that committee, natural resources and the environment, ex officio, administrative affairs. He's also a member and he was born into Georgia Senate January the 9th, 2017. You have to understand that there are 56 of us only in the Senate. So we end up with a lot of committees and we serve extremely well. And I'm just going to pat my self on the back and all these other senators that are here because it can be very grueling sometimes. But we do a great job. So those are the things that I wanted to say again welcome to Albany, Georgia. Please, if there's anything that we can do for you other than fixing a ticket, we can't do that. That's called illegal. Please let us know and welcome again. Thank you so much. Thank you, Senator. All right. So this is a joint study committee. So this is House and Senate and I've got my good friend here representing Matt Doudnick from Gamesville. And we're going to, he's got a little bit of history with education. He chaired the education committee for two sessions and now chairs the appropriations on education for the House. So very important role, very passionate about what he does, very passionate about kids. And we all, you know, we're all very passionate about workforce and making sure that our talent is staying here in Georgia. And so, you know, the whole point of this study committee and this is my challenge to each of y'all. And, you know, we're going to challenge this committee to look at state policy that allows more dual enrollment programs to workforce development systems so that we are developing more highly skilled talent at younger ages. We've been getting it right for a long time and we're about to make it better. So today's specific meeting, we're going to focus on the needs of the health care workforce. And we wanted to come down here to Albany to really highlight what they're doing here at the College and Career Academy, the partnership with Phoebe. And it's just, they are getting it right. You know, I just left Phoebe tournet and you look at the things they're doing around workforce and training the kids and I say kids. I mean, there's y'all our kids. But just training the talent and it's very, very impressive. And, you know, we, it's a challenge to each of us as legislators. You know, we talk about rural Georgia and what are what are the needs and one of the number one needs that always comes up year in and year out is workforce. You know, how do we attract talent to come to rural parts of the state and right around Albany, you see, you see how you do it. And we're going to highlight that today. Before we get into that, we're going to introduce our committee members and I'm going to kick it here to represent them. And then we'll just kind of, I guess, pass it down and let everybody introduce yourselves, where you're from, who you represent. And then we'll get, get, get kicking. So appreciate all y'all being here. And this is, we're going to unofficially call us the Matt and Matt Roadshow. So starting here, the next meeting will be in Noonan, where, where I feel like our college and career academy, we are getting it right as well. And it's more of a focus around manufacturing. And so we're going to see how dual enrollment is used in different industries and how we get it right. And again, challenging this committee to figure out how are we going to do it better. And so with that, again, thank y'all. And just honored to serve alongside my good friend here, Matt. We'll see if we can find anybody else to join the Matt Caucus before we leave. But again, as Senator Brass said, my name is Matt Dubnik. I'm from Gainesville. I'm in my seventh year in the house. And my joke was with Speaker Ralston when he called a few years ago and said, I'm going to ask you a question. I need you to say yes. Could you tell me the question first? He said, no. And there was this long awkward pause. And I said, okay, I'll say yes. And he said, I need you to chair the Education Committee. And I said, well, my only experience with K-12 education is that I survived at one time. And he said, well, you're going to learn a lot, just hold on. And man, what the last three years have taught me and shown me in the passion for education that I didn't know that I had. But there's 1.8 million students and 11 million Georgians who were counting on us. And that's the collective us in this room to get it right. And I think Senator Brass said it best. Someone asked me yesterday, I'll say I had to be here for the study committee. And they said, do you enrollment? I thought that was a very successful program. What are y'all trying to mess up? So no, it's quite the opposite. And Senator Brass said it best. We're simply trying to take a good program and make it even better. And I hope that you will all take his challenge very seriously and keep that in mind that we're not trying to fix something that's broken. We're just trying to put more oil in the machine. So I'll pass this down. Two people I'd like to recognize, Representative Stacy Evans, who will join us in future meetings, couldn't be here today. From Atlanta, but as Representative Baller-Nower, just talking about she is a wealth of knowledge. And if you haven't had the chance to talk to her about education, I hope you will. And then to my good friend from Sylvester, Representative Yeard, thank you so much for being here and gracing us with your presence. And I got to work hand in hand with him and I'll give him this shout out and I'll pass the microphone over. That last year or two years ago, time all runs together when this man came to me very passionately with some legislation around some educational topics, financial literacy. And we talked about things like civics and civics engagement. And he was so patient to understand the process, but he just kept saying. And I'm doing this because the youth need to understand what it is that we can help to do to prepare them to walk across this planet and in their life journey. So thank you for that passion and being true to that and for helping me learn a lot about that process as well. So again, we'll pass the microphone down if you don't mind telling us who you are, where you're from. And Senator Brass said who you're here on behalf of. Bethany Ballard and I represent House District 147, which is Warner Robbins and centerville. I am a freshman legislator. I survived my very first session and I am on the education committees and the defensive veterans affairs committee and special rules. And I am here so that we can make sure that all of our students, whether they're, you know, whatever they're going to do in life, they are successful and that Georgia remains successful. Good morning. I'm Jill Oldham and I am the governor's appointee. I am currently living in Rockdale County. I'm a 32 and a half year retired educator. I was on the upbringing up committee for the Rockdale career academy and that's where I finished my journey. I've been working with dual enrollment since 1994 in all facets. So I actually look forward to this. I love putting out new opportunities for kids. Good morning. Out recessive vice chancellor for academic innovation for the university system, border regions. My priority in my unit is talent demand, talent development. We have the Georgia FinTech Academy, the Georgia Film Academy, health care prep. Data science collaborative, all our priorities among others within our unit and very happy to be here and support this work. Good morning. My name is Tiffany Taylor and deputy superintendent of policy, flexibility and external affairs with the Georgia Department of Education. I'm here this morning on behalf of State School Superintendent Richard Woods. As you know, it is the first couple of weeks of school and so he is traveling at a variety of different schools throughout the state. So he apologizes that he could not be here on today. However, on behalf of superintendent Woods, I keep priority of his for the department and our mission is to prepare students for life. And he is constantly reiterating impressions of that means that whatever path that students are determined or decide that they wish to take upon graduation that they have the ability and are prepared to do so. And so we see this as also a critical component of supporting that mission of vision. Good morning, Joshua Stevens, Georgia Department of Economic Development. It's born and raised in Gainesville, Georgia, live in Peachtree corners and serving on behalf of Commissioner Wilson from the Department of Economic Development. Thank you. Good morning. Scott Steiner. I get to lead the great healthcare organization here in Southwest Georgia, Phoebe Putney Health System. I've been a Senate appointment and just appreciate the opportunity to be here. You know, if you'd asked me five years ago, you're going to be a whole lot more involved in the education of your workforce. And I probably wouldn't believe you. But it's a different day. It's a different chapter and we're all, every business is involved in it. And we're excited that we've got so many great partners here in Southwest Georgia and looking forward to the discussion. Thank you. Good morning. I'm Derek DeBrowick, Assistant Commissioner of Student Affairs and Secondary Initiatives at the Technical College System of Georgia here on behalf of Commissioner Dozier. So we work with all of our dual enrollment and college and career academies. Just looking forward to how we can better support dual enrollment growth and what this new vision and version may look like going forward. I'm Rick Townsend. I'm from the coast, Brunswick, St. Simon's area. Educational over 30 years. Retired to superintendent and my claim to fame down there. I ran the Go-Norf College and Career Academy. It's a great career academy as well. So I understand it. Chris and his team, they do an amazing job. Mark up in noon. First thing I did, first time I traveled when I got to the Go-Niles was a go-see mark. I said, Go-Norf, he's the man, he understands it. And that's what it takes. You have to build relationships. You have to work with the business community. I just thank for the business community showed up today and really engaged. That's what it takes. Whether you're new in Brunswick, Albany, it doesn't matter. But the business community is key part of the sole process. So I'm thankful for being here. Thankful me on the committee and looking forward to such outstanding representatives and senators. Thank you. Good morning. I'm Senator Alena Parent from Decap County. And I'm in my fifth term in the state senate. I do serve on the Education Youth Committee and I'm very passionate about education and the role it shapes in determining the future of our state from a quality of life and economic perspective. I think George has done amazing things in the dual enrollment space as our chairman was saying. And I think there's actually a whole lot of opportunity that I'm hoping that this committee will help unfold for the future. And I'm very pleased to be a part of it. And minority leader, but I should be here any minute. Thank you. Thank you, Senator. I'll add to Representative Townsend and Senator Parent actually did a lot of work in helping on past not only just this, the resolution needed to form this committee, but also to pass Senate Bill 86. This, this study committee kind of goes in conjunction with Senate Bill 86. Senate Bill 86, just a quick highlight of what that does is, what does it do? I forgot. Senate Bill 86, it allows the kids in high school to start tapping into the CTAE funding before their 30 hours of this required. It allows them to tap into that quicker. So the idea is to get them certified faster, get them in the workforce faster. And again, this study committee is going to make sure that that program is sustainable. And then we're going to figure out what we can do to make it even better. So we just have the minority leader, Gloria Butler, show up. Ms. Butler, would you like to introduce yourself a test for your friend? Morning, everyone. Sorry I'm late. I was popped on the other side. Senator Butler from the cab and Gwinnett County is represent Senate minority leader, Democrat minority leader. I live in Stone Mountain. That's exactly 200 miles from here. But it's a pleasure to be here. Look forward to learning more about this issue and finding out what it's all about after being in the legislature for 25 years. This is the new one for me. So thank you, Mr. President. I want to say that. Don't put that on me. All right. And not with us today. Senator Rip Williams and Y'all please keep him and your prayers him and his walked on. She just had a she just had a major operation. And so he couldn't be with us. I think that was two days ago. So she's in recovery and he's obviously spending time with her helping her on the road to recovery and then Lynn Lynn Riley, our commissioner of finance or finance commission. She is student. I'm sorry. Georgia student finance commissioner. Lynn Riley. She couldn't be with us today either. But she is on the on the committee will be joining us as we have her other meetings. And so and then you had. And then the speakers appointee is trace shepherd from Howard Shepherd and Sandersville and he will also be with us in future meetings. But he was the appointee from the speaker's office. All right. Now we'll get into the meat of the program here. But before we do. When we get done, we're going to have about 20 to 25 minutes for public comment. And for those of you. If you wanted to speak and didn't know, we actually have a sign up sheet right back here with Mercedes. If you can just come out and sign that will make sure and get you get you called out for some public comment should you choose. You don't have to don't feel pressure. Okay. Well with that, I want you kick us off. Give us our panel. Well, I see six names and I see five chairs. So I guess this little duck gut goose and we'll use the podium there. And so Chris Irene, Pam Scott, Tracy and Angie. If you will come join us. I'm assuming I see there. There's a clicker there on the right hand. You found it. So we'll turn it over and again for each of you, if you will, when it comes your time to have a microphone. If you don't mind just introducing yourselves. And same thing. Where are you from? Who you represent? What's your here on behalf of and we'll turn the show over to you. Thank you, Chairman and thank you committee for being here. Welcome to Albany and welcome to the 4C Academy. We are thrilled to have you all down here. And even though 200 mile drive or glad you're here, I know it's a long time to be in the car, but we're thrilled to have everybody. My name is Chris Hatcher. I'm the CEO of the 4C Academy and I'm also the chair of the Georgia College and Career Academy and network. So I'm here really with both of those hats on to talk a little bit about dual enrollment. First, what I thought of do before we introduce our panel. Just tell you a little bit about the 4C Academy and some of our partnerships here. So we're a Georgia College and Career Academy, which means we're in partnership with the Darty County School System, the business community Albany Technical College and Albany State University. So those make up our partners. We are just thrilled to have such a great partnership and honor to and fortunate to the Darty County School System is our fiduciary. So this building belongs to them, our staff works for them. And again, we couldn't have a better partner there. I report to a board of directors that our charter says that must be majority business community and nine out of our 11 board members come from the business community. So we are a business driven college and career academy. And so that's a little bit about it. And our mission, somebody on here shared it. We're all about preparing students for whatever's next. Some may go directly from high school into the workforce. Some may go into Albany Technical College or Albany State University or go away for college. But eventually they're going to be in the workforce. And so our mission is to prepare all of those kids for a successful and long career in the workforce. What I thought to do is just introduce a few of our partners here that are in the audience today. And I'd like to start with Superintendent Kenneth Dyer. Many of you may know Mr. Dyer, he serves on a variety and a variety of capacities at the state level. But what an innovative leader that we have down here in Albany. And a lot of it's an awesome charge to have to lead a public school system. And he just does a great job. And we're thrilled to have him. Dr. Emmett Griswald, he is the president of Albany Technical College. And although he's been there in this capacity for a relatively short period of time. He's been with Albany Tech for some time and has been a partner of foresee academy from our start. So both of those gentlemen are my friends and partners. And we're just thrilled to have them as part of our team. Dr. Griswald has Lisa Herrell, who's vice president of academic affairs. Lisa with him and Lisa Stevens, who is the dean of nursing. She's here as well. And then we have Sarah Brinson, Dr. Brinson with Albany State University. She's with their dark and college of nursing there. And happy to have you here. Our 4C team, we've got Miss Clark, Ranger and Nurse Clark. And then we've got some of the students that we're talking about today. In the back of y'all, raise your hand. These are our CNA students. They are, yeah, good man. They are all seniors. They all have their CNA certification. We'll talk more about that in a minute. And they're all working for Mr. Steiner and Miss Suver at Phoebe Putney right now is a paid intern. We also have members from our business community, Barbara Verhohams. She is the CEO of the Albany Area Chamber of Commerce and is also a regent for the state of George. So Barbara, welcome. And the business community is a strong partner of ours. And then Laura Russ is with her. And many of you have heard of the entrepreneurship program called FLEX. She helps with our relationship with them. So those are some of our, did I miss anybody out there as part of our partners, Jenna Dyke was on from the EDC is a strong partner too, but she, I think, had another something that came up. So we appreciate this opportunity again to be here and talk about this important topic. And so what I'd like to do now is just turn it over and have our panel. And what I'll do is just lead a panel discussion to tell the story of sort of how we got to Senate Bill 86 and found some barriers that we bumped into that ultimately led to this with your blessing to allow for this. So we'll just start with introductions Irene, why don't you tell us who you are and who you with. Great. Thank you so much. I'm Irene mine. I know so many of you through my time when I was in the Lieutenant Governor's Office for 12 years and worked with all of our college and career academies. So today I've continued that work where I served to on the board of the Georgia key and network, our college and career academy network and assist with really policy development and all of that. So that's my role here today. Thank you. Good morning. I'm Pam Clayton with the Georgia Healthcare Association. It's great to be with you all today. Great to see these students here with us. I was actually a nursing assistant on date myself because I was a nursing assistant pre-Obra. So that's when you didn't even have to have an official certification. And I went to the local nursing center and got ready and prepared to work for the day. I turned 16. So I was I joined the workforce then. So that's been quite a quite a bit of time ago. Georgia Healthcare Association has a wide presence across the state. We'll talk about that more in just a bit of work with Seth Coker Chris Downing of some of you all are familiar with him. Those guys do great work. And again, just appreciate the opportunity to be here. Good morning. My name is Angie Gardner. I'm the principal here at the force academy and I have the honor of serving these lovely students. So thank you. Scott Stainer here. Hello. Dr. Tracy Super and vice president of education for the health system. I am a registered nurse and I two Pam work to the nursing assistant. So been there, done that. And I know a lot of these guys. And so it's just a pleasure to be here today and share a little bit about what we're doing and quite from it. All right. Well, thank you. We've got a great panel for you today to talk about dual enrollment for highly skilled talent at younger ages. So that's the topic here. And I thought we'd start ironing with you just telling us a little bit. You've been around for a little while. And why don't you tell us a little bit about just to help us set the stage of brief history. Let's start with that of college and career academies. Oh, well, thank you so much. Okay. So thank you. Really college and career academies got started in 2007. Thanks to the influence of the Georgia General Assembly. You guys have always been putting money in the budget to incentivize communities to develop a college and career academy. The original college and career academy was the Central Educational Center in Caledia County. He's already been introduced but Mark Whitlock here today is the CEO of that. And I look forward to going to Caledia County on August the 22nd for Yalta C, the programs that they're doing there. But the network got started. And today we have 54 academies across our\n\nIt's wonderful to be able to look at Senator Seelm's Albany, Rick, you have Golden Oils, Decatur Career Academy, CEC, Hall County Career Academy, Housing Career Academy, and then Rockdale Career Academy. You guys represent these best practice programs that are in statute defined. And then it's really what Christchurch said. It is secondary partnered with post-secondary in the business community all coming together to form a workforce pipeline for the region's needs. And that is in statute, that definition is in statute, and I want to make sure you heard from our friends with the Board of Regents. Every one while we are very much tied to the technical college system of Georgia and the influence of that, but there's not a single college and career academy that does not have a university system of Georgia partner that's with them in deciding dual enrollment programming. The other thing that's in statute is the certification process. So every one of our college and career academies are required by law to be certified to ensure that they are best practices. And then that certification by the technical college board then goes to the Department of Education in their state board. So as all these school systems ask for flexibility and want to get that flexibility through their contract, whether it's a charter system contract or a strategic waiver contract, they have to, and they're going to say they're doing that with their college and career academy or one of their innovative practices, they have to be certified. So that is really kind of a best practice or making sure that there's fidelity to the model. So you guys did that. Again, there's 54 academies. You guys funded one more community that's in a grant process right now. So hopefully by December, the technical college will award 55 academies. And I think it's important too that you know that three of those 54 are regional academies. So it's an academy serving more than one school system. We have Griffin region. They have three districts that feed into that academy. We have Sekka in the Vidalia area with the southeastern technical college. And then Southern Pines has three school districts funneling into that school district. So it really is meant to be a regional model to serve the regional workforce needs. The other thing I want to talk about is really our college and career academy network tries to implement programming. And then when we run into Stumwin blocks, the network comes to you to say, let's rethink about how we're doing our programming and access to funding or policy or whatever that is so that we can better serve the workforce needs. That is exactly what happened as it relates to dual enrollment. So let me give you a little bit of a foundation around dual enrollment. You guys passed House Bill 444 in 2020. If you remember prior to that, it was kind of the wild wild west as it relates to dual enrollment. Any student could choose starting in ninth grade. Let's take whatever class dual enrollment wise and it was just way too much. And what you did on House Bill 444 was strategically and critically important and good job for doing that. And honestly, that policy change made a whole lot of sense because in 2020, your dual enrollment funding was $105 million. In 2024, your budget that you just passed was $76 million. So what you did with House Bill 444 is put in a 30-hour cap on dual enrollment. So in you also said to students that if you're going to do academic dual enrollment, it has to be core academic and it has to be in 11th and 12th grade. Very smart, right thing to do. The other thing you said was if you're going to do technical dual enrollment, it is fine for you to start that in 10th grade. And then Georgia State of Finance, because of the programs like what you're going to see in Caledia County, as well as the accelerated career program and I'm going to describe that in just a minute so you understand that. But because of those very heavy technical courses that went way beyond 30 hours, Georgia Student Finance said, after you reach a 30-hour cap, you can then begin accessing Hope Grant dollars. Chairman Brass, you just articulated that about technical instruction after that. Well, that was the right thing to do. It was really smart. So the positive things about that was again, we put parameters around the amount of money that you're investing for dual enrollment. The opportunity that you gave us is why you're here today. And we have found where that choice, where you're really honestly putting kids on this decision making and you'll see this and you'll see the decision making as you look at this healthcare pathway. These are choosing between academic instruction or technical instruction. And we know both of those are equally important. Nothing is better than the other. They're both equally important. And so we will, you're going to learn today one more foundational thing that you need to understand is the two ways a student can graduate from high school. If you look at the slide and go, I am majorly confused about this during the club because people literally do not understand this. But we are working really, really hard to make sure more and more school systems are embracing both of these paths. So today there are two ways to get your high school diploma. One is called the traditional path and that's the one at the top. That is probably the high school diploma that all of us got. Very all academic, four years of math, four years of science, English, social studies. And then all of the other courses are electives. So your CTAE courses are all electives within the context of that. And then the other path, this was passed in 2015, y'all passed Senate Bill 2. And that was where you get your basic academic courses, ninth and tenth grade level academics. And then you turn and fully focus on your post-secondary success. It's lots of times what we're not describes it as you have to finish college to get your high school diploma. And that's exactly what it is. And also in your folder, if you guys will look at this document, this in your folder, this is the technical college system of Georgia document. There's available to you. And you know these are all of the different paths that a student can graduate from high school with their college coursework. So it's very heavy technical in the two TCCs. And the important thing about the two TCCs listed on this document, they're all part of the hope career grant list. So they're all hard to mend, high skill, high wage jobs as it relates to these two TCCs. A student can also get a diploma from the technical college in any technical college program or they can get an associate degree rather in high school. And that can be an academic associate degree or an associate degree from the technical college. And again, over the next two weeks, or the two meetings, you really are going to see exactly the type of programming we're developing. Today, you're going to hear about a health care focus. And that path for these students is under the traditional high school path. August the 22nd in the manufacturing, those students are graduating with the accelerated career path. So in dual enrollment, in this document, how dual enrollment is funded within both of these is what we're going to talk to you about today. And I think that's enough. That's great. Yeah, thank you, Irene. A lot of information there. And so, again, what we're talking about today with these students is really this traditional diploma. These students ultimately want to go to college to further their education. So that's why they've chosen that. Some, you know, will learn more about the other pathway next time. Now what we'll do is just kind of back up a little bit and set the stage from a workforce demand standpoint. And we're going to ask Pam to just share a little bit about your industry and some of the challenges that you have in terms of workforce standpoint. Certainly. Thank you very much. So again, with the Georgia Health Care Association, and we represent post-acute and long-term care. And, you know, really my overarching message today is we want to be a great partner. There's a tremendous need, but there's also great opportunity. And so great opportunity for these students that are here today. We have a tremendous presence across the state of Georgia. Very much so in rural areas. We represent about 350 skilled nursing care centers, assisted living providers. We have associate members, vendors and auxiliary services labs, et cetera. And also we support the home and community-based service model. So when you think about the workplace setting and opportunities in career pathways, I mean, we're touching a lot of areas. And there's a significant economic impact there within our space as well. So what do we know? And I'm probably going to share what you all clearly know already is we have a numbers problem. We have in Georgia, we have an aging population, but we also in our space have an aging workforce. And the pipeline simply is not adequate. And that matters because quality of care and quality outcomes matter. And so anytime anyone seeking care for themselves or their loved ones, they won't competent caring folks there to provide that service. And we really have a numbers problem. And so we certainly were impacted by the pandemic. And we are deeply concerned about our ability to recover from that, but I'll say, and I know we don't like to use the overuse the term crisis, but we had a problem pre-pandemic and with workforce, relative to workforce and numbers. And that's certainly intensified. But kind of a message that I want to ensure that I underscore is the ratio of caregiver to consumer is declining at an alarming rate. And so I think that should have the attention of everyone. So when we think about opportunity and what do we need to do, we also need to be thinking about the impact side that really from a health care standpoint touches everyone. So this is just a number, maybe a little bit difficult to see, but this is for the state of Georgia and against specific to our space. But we lost about 6,000 jobs, 6,000 employees during the pandemic. And we simply have not recovered at the same rate that other settings across the continuum have. We're working hard every day. Those like maybe there's a little bit of light there, but there's a definite need. And so we have opportunity for those clinical rotations, internships, and employment. So I think it is important to not just focus on the problem. And I'm grateful that we're here today to talk about solutions and strategies in terms of how do we confront that? As you all know, workforce is a national conversation. It's particularly important and forefront for us right now and the providers that we serve because number one, we haven't recovered to pre-pandemic levels, not even remotely, but also we're confronted with the potential for mandated staffing minimums through the president's executive agenda. And we look for that to drop any minute. So you can imagine how that we're trying to think through. I'm trying to staff today at current expectations and to think about a mandate coming along to standing minute is difficult to contemplate. But we're excited about opportunity that House Bill 487 offered related to certification for those individuals that as determined by the Department of Community Health might allow them to take the certification exam and start that pathway maybe to from being a certified nursing assistant to a certified medication aid. And then maybe ultimately LPN to RN. I think there's just really a lot of opportunity to think about how can we make that as easy and as barrier free as possible and as seamless as possible so that those students have opportunity to determine what's their passion and what pathway do they want to be on. But they can also, while they're continuing to navigate their education and attain that, they'll have opportunity for employment. And it's going to be meeting a tremendous need across the state of Georgia. So we're grateful to be able to be here and probably just a few miles down the road. There are multiple skilled nursing facilities talking about how are we going to staff today. We've got all those positions filled. And so it's important that we're at the table and really working through this together. So thank you. Thank you, Pam. I appreciate that. Sounds like Step 1 is job security for you all from Pam's perspective. Scott, why don't we, next, you want to, that's a great sort of statewide picture. Why don't you paint a local picture and first tell us a little bit about Phoebe Putney in case folks aren't familiar and then we'll kind of go into sort of your workforce challenges. Thanks, Chris. Yeah, the slide shows you the region that we have the privilege to serve really here in the quarter of the state and the Southwest quarter. We do have Phoebe's got four hospital campuses. We've got urgent care centers, primary care centers, physician specialty physicians, a home health agency, a hospice. So we're a full service health care system here in Southwest Georgia. We see our mission in a variety of different ways, but one of them is to create access in our communities, especially access in rural Georgia. And in order to do that, you have to have the people, right? There's no ATMs, there's no health care ATMs that you can, you can set up. Certainly, telemedicine has been a new entry, but we saw a great use of telemedicine in during COVID, the early stages of COVID and it has almost gone back to pre-COVID levels. You know, the consumers, especially maybe consumers that are 30 something plus aren't ready for that yet and the younger folks are. But, and so that hasn't been an answer to all the needs from a health care access standpoint, but that's been our focus is serving this quarter of the state. You know, most health care organizations, I think whether they're hospital system or long-term care, if you add it up, we're usually outside of large metropolitan areas. The largest employer or one of the top employers. Phoebe is, we're the largest employer here in Southwest Georgia. The big economic impact over almost $2 billion when you look at that, you know, a payroll, we provide charity care about $63 million in true charity care each year and a good bit of community benefit. The crisis, right, these are just headlines. It's been around, Payam talked about it, I've been in health care for 30 years, we have always had a staffing issue. Certainly, this is where we're at today, it's never been the needs, never been as great as where it is today. And health care, no matter if it's in a hospital, a physician's office, an urgent care center, a long-term care skilled nursing, it is still people taking care of people. I know there's robots in health care, they're usually in the OR, but it's really not a robot folks just to debunk that. Human beings have to operate that piece of equipment. And so we're still human beings taking care of human beings. And Payam said that the crisis, we are so short today and we're all going to need that care, right? And it could be today, it could be next week, it could be in 20 years, but we're going to need it. Here's the shortages across the country. These numbers change. I've seen nursing shortages in the United States more than $2 million. This is just one source, said it's about 1.1 million nurses short today. And more nurses are retiring every year than are coming into the practice. And that's just nurses, we talk about radiology, texts, and lab texts. And I mean, it's just across the board. Georgia, the recent study has said will be 80,000 nurses short by 2030 if we don't turn that around. Phoebe has about 200 open nursing positions, a little bit more than that, and about 600 overall positions in our region we could use today. So we think about in Southwest Georgia, maybe that's not a big number for Atlanta or some of our more metropolitan areas, but 600 new jobs in Southwest Georgia is a big deal. Big deal for our communities, those are 600 people that need a church that are going to shop at a grocery store, are going to sell their kids to school. That can have a huge impact in this part of the world. Just to maybe drive at home a little bit more, 50% of all nurses in the United States are over 50. And nursing is my mom was a nurse, she was a nice young nurse for 25 years undoubtedly why I found my way to healthcare was her influence. And but it's a demanding job, it's physically, it's mentally, it's emotionally, they're exhausting. And from that physical standpoint, they're on their feet, nurses are on their feet all day, eight hour shifts or 12 hour shifts. And so you say, well, they still have 15 years to work approximately. Many of them don't make it to 65. And so as an industry we've had to think about how can we extend their careers without the physical demands of that of the job. And Georgia is consistently losing 3.7% of its workforce every year, not being replaced by new graduates. And the chart on the right shows this is a recent study from the US Nurse Journal comes out of the US Bureau of Labor Statistics. If you look at nurses per 1,000 population, Georgia has 7.31. We are 49th in the United States and nurses per 1,000. And if you said, if we wanted to get to Florida's average, we need 15,000 more nurses. If we want to get to number 1, South Dakota, can you imagine South Dakota's number 1? But even if you said Massachusetts, right, we need 56,000 more nurses just to get to that average. The US average, we need 20. So it shows you really how short we are in the work we need to do in our state. And I know we can do it. The governor's been very supportive, the legislature's been very supportive. And sometimes people say, we got to pay him more. And this comes again from the US Bureau of Labor Statistics. Recently, Georgia has the highest pay rate partners in the country when you adjusted cost of living adjustment. The highest rate. So I'm certainly aware of the employer. It's not to say that our nurses don't deserve more and more. Everyone does. But it shows that we're being as aggressive as we possibly can be in compensation to gain this workforce. The last slide is, and I mentioned this to Senator Brass this morning, Phoebe, we pride ourselves on not being complainers. Anybody can just say, hey, this is a problem. Somebody, Governor or there's Senate or the House or someone else can fix this. What we've said is we're going to be part of this solution. And whether it's putting our people into it, like Tracy is where we're going to put our dollars into it, we are going to be part of the solution. All of our partners, we have many partners here. And so yes, we need to be in the education business. We need to be in the inspiration business. And that's something that we're working on. As well, this right here, Dr. Griswald, this is a, we have relationships and Tracy will talk a little bit about some of our other partners. But this one right here is an investment by Phoebe, we're making a $43 million investment in a living and learning community, what you're seeing there is a rendering. This is underway that it'll be done in about 11 months. And it, all many tech will be moving their health sciences courses, school over to this facility, about 50,000 square feet of teaching space, state of the art teaching space. And on the second and third floor, it'll be 80 apartments for the students. The thought was we really needed to make sure we're casting that net far. And we wanted to get kids, young students into an environment where they can live together, they can learn together, they can be inspired together. And so that's what you're seeing there today. I don't know if it's been done. We didn't sort of scour it, just felt like in the conversations with Dr. Parker and Dr. Griswald, we needed to do something. And this was what we, we came out of the shoot with and we were going to put our money where our mouth was and try to bring, this isn't going to solve the problem for the state. But if every health system in the state said we're going to produce more nurses, I hope they all stay at Phoebe. I know that they won't, but that's okay. We're here to help our region. We're here to help the state and we're excited to do this. Thanks God. And that just certainly puts a microscope on the challenges here. And with, I also sort of on the Economic Development Commission here in Albany, if you were to say, hey, there's a new company coming to town, 200 jobs because I've got a 200 nursing shortage. At an average pay of $70, $75,000 salary, we'd say wow. And so it is very important for us as a community to pay attention to those opportunities for our local economy, let alone for our students. So thank you, Scott. Tracy, let's turn to you and talk a little bit about partnerships. You have been busy over the last several years chasing this and just talk a little bit about some of your post-secondary partners and partnerships in general. Yeah, so thank you. Scott kind of set it up. As Pam mentioned, we were having this problem before COVID. And so a team of us got together in 2019. Scott led that group and I kind of got tasked with taking ownership of that a little bit. I was in the community with the USG, I recognized one of my colleagues over there. I was there for 12 years and did that USG career as assistant dean over the nursing program there. And so I kind of had those relationships with many of our academic partners, kind of new of the challenges that the schools were up against. And so each one of these partners that are listed on here, I could go through the list and talk about how every relationship has been different. But the goal really was to get more students into the programs. We need all of those students to get in so that they can get out and into the workforce. And so every one of these, you know, I could just kind of run down the list. I mean, some of these programs and schools in order to get more nursing students in the pipeline, they needed more faculty. So we provided funding for faculty. I'm going to need clinical rotations. We provided funding for part-time clinical rotations. Some told us, which we've heard, I've heard quite a lot, is that math and science is a problem. And the nursing students really struggle with that when they get into the program if they get into the program because of the pre-intrances test to get into nursing. And so we funded biology instructors. You know, with some of these programs, they had not like Georgia Southwest, for example, they didn't have an associate degree program. They had gotten rid of it many, many years ago. They now have started an associate degree program back. Fort Valley State University, it was a brand new program. And we invested and launched in that program. Going through Lee County, that was the work-based learning program. As I look on here, I probably should add Department of Education, dot, rals here. But, you know, they've been a partner of ours, you know, come into the table to really look at what we could do in K through 12 to try to help these pathways into these programs. And Albany State, you know, Summer STEM Academy, we just finished our third year and that program had 60 kids out to the STEM Center this past summer. And about 60% of those kids that went through that program said that they had decided, they had decided to go into health care because of their experience. That is tremendous. These are night through 12th graders that, you know, not given an opportunity, you may not know what they, you know, what they don't know. So, you know, it's important to get in front of these young people earlier and expose them to opportunities early on. I could keep going down the list, but wonderful partnerships with each one of them. And that leads me to, of course, see this wonderful space and this wonderful team here. So, before COVID, this is before COVID, you know, we were starting to see some, some trouble with some of our workforce in terms of the professionalism issues or lack there of those essential skills. You know, we say soft skills, but really, they're essential. You've got to have it in the workforce. I also work with inpatient nurse educators, I am a nurse, I'm close to what, you know, what we're seeing in our workforce, what the challenges are. And, you know, some of the things that we were seeing were tartiness. People just not showing up. You know, not being able to maintain eye contact, just a general, sometimes there are appearance, you know, these things. And so, we began to have conversations. That's when I first met Chris and we came out here and we sat down. Another real big one was lack of empathy, compassion. You know, if you don't have empathy and compassion, you don't need to be in health care. I mean, you know, people are coming to the hospital, the majority of time, not because they choose to. And so, we have to instill those skills very early on and set that foundation and expose them to that. And so, also some things, maybe other skills that we might need in the workforce, you know, really sharing that with Chris and with Melissa, you know, telling these teachers and all that we're working with these kids early on, you know, what it was that we needed in the workforce. And they listened. And we began to come out here to the College and Career College here and do classes. And we would do things like communication. We bring out organizational development team out here, do workshops on communication, on professionalism, the patient experience. You know, when I went to the nursing school, nobody really talked me about patient experience, well, hospital or judge by it. I mean, we need to be exposing these kids early on to what truly is that patient experience like. And so, we would come out and talk to them about that. Diversity, inclusion, equity is huge. It's one of the pillars of our health system. And, you know, we didn't need to start having conversations early on about that. And so, we were able to come out and do that pretty much anything. And then, I know we're going to talk more about the queer pathway, but that was definitely a joint partnership and what we wanted to see and being able to get these high school students and an internship opportunity and what are the challenges. And there were challenges that came up. You know, one of the things we had our health system was wouldn't hire less than 18. I know you probably heard that across the state. Well, we were like, well, why? Why don't we change that? And guess what we did. And so, now we're able to bring these younger people in early on. And so, really having those conversations. This is most recently our newest agreement, which has finished our third year agreement with 4C and within.\n\ninto a new partnership in that sister story for another day but it involves medical assistance but we also are going to be funding a half of a position for a full-time faculty person and it will go along more that advanced career option that y'all will talk about later that used to be option B but we didn't want any anybody left behind if those students didn't want to go into nursing school maybe they want to do something else in the healthcare profession so how do we hang on to them as well and say this other position that we're going to have fun to baby will will kind of culture that that group of students as well say yes thank you Tracy an incredible partner that we have in FABY putty and and again we have this discussion Angie and I and Melissa and our team roll up our sleeves and we started trying to figure out how to put this together and that's what I'll share with you now so all students this is our 2021 plan after meeting with Tracy of how we would come together the colors represent the school year so what we've done with our pathway here and the students start with us in the ninth grade and we focus a year long on professional and soft skills so they rotate with instructors during that period they're with an English instructor for a fourth of the year learning about email and verbal and written communications they're with a professional skills coach for a fourth of the year where they're learning about work ethic and showing up on time cell phones and dress we even have a handshake competition that takes place during this it changed our culture handshake competition totally changed our culture here we're a fourth of the time there with a person a math instructor they're doing the Dave Ramsey personal finance course and then the the second or the last four twenty five percent of the year they are doing you science which you may be familiar with so they go through the you science survey tool that looks at their aptitudes and their interest the teacher helps them figure out they don't just get the data and have to go read it the teacher takes them through that process helps them pick the pathway that's best suited for them and then we also do pathway exploration during that ninth grade year and we have guest speakers and a variety of different things so that's what we do in the ninth grade they also take some core high school academics while they're here in the tenth grade year doctor wall they do the cta pathway so in these students have to go work so uh... y'all go clock in uh... work hard that's right thank y'all for being here so in the tenth grade they do their complete cta pathway we have them here for half a day so both blocks while they're here they're going through their cta pathway nurse carc and our other team are are teaching them and they are focusing heavily on empathy in those professional it's almost like a weed out year for them to make sure that health care is right for them you know i had a parent talked to me the other day that said that she was at her wits in with our instructor the parent and the the the child and now they're on christmas card list with nurse carc because that literally they can't think her enough it is set her child on a different path different your checker and guess what mom learned something as well so we do our cta pathway in the tenth grade in the eleventh grade that's when these students get that certified nursing assistant okay so with all of our instructors are duly credentialed with Albany technical college so they're here in this building they're getting their cna during that tenth grade year including their rotations at feeb putty for clinical rotation so that that's taking place in that tenth or eleventh grade year excuse me eleventh grade year we want them to be able to before they leave their junior year to sit for that exam that cna exam so we don't want to wait over the summer and all that and a hundred percent pathway uh pass rate with our students in this past year's class which is an exceptional pass rate that we're very that's all for you nose plug um so again Albany tech the the cnn pathway is nine hours it takes all of any technical colleges on accelerated programs so they can get that cna in nine hours uh into eleventh and twelfth grade year they're doing their dual enrollment could these students that are back here they want to go into college their goal is rn bsn maybe even beyond so that's very important for them so they do their dual enrollment in the eleventh and twelfth grade they can do it either at Albany state university or Albany tech we have about half at each so we've got a lot of flexibility here our academic instructors are duly credentialed at both places and then that frees up that twelfth grade year for these students to rather than come to school in the morning they're clocking in at seven a.m to eleven a.m. in the morning working alongside other cna working alongside other nurses doctors real world that's where the education is really happening i talked some of these kids jane you had a code right while you're there like first couple weeks that you were there you had to figure out how to react to that and they they really get pulled in this internship to me is essential this is where they're really getting that experience and they're able to to to become workforce ready and so this is the plan that we laid out and and then i'm going to miss gardeners got the what we did here is she then translated this into a schedule that parents and counselors could understand so a little bit of an eye sharp but you have it in your in your packet so Andy so as we begin to look at the importance of course for students is that miss gardener we don't want to do double work we want to get the greatest gain for the greatest benefit because we do want to have a life outside of school so we mapped out the things that were necessary and the most important thing is that we in order for you to get to work you first have to complete your high school diploma so let's look at the things that are required for you by your high school and let's plug those in but let's also look at how dual enrollment can help impact that where you can do things on the dual enrollment side that will also give you the satisfaction on your high school side and so in ninth and tenth grade of course they're doing their pathways and they're doing their their academics but as we got to the eleventh grade we realized we wanted the students to complete the CNA certification so we had to start there and if we started there they would continue to take some of their core which was important to them and their parents because parents that was a challenge to us they said well if you start taking your CNA courses what does that leave you with the 30 hours and the core academics that you need and so we begin to plug them in to make sure that they would get the benefit of you know the best benefit that they could gain yeah and so this just to make sure people in the back we've got up here on the left that's the path if you go to Albany Technical College route and we also have one for Albany State University as well so then I'll set this up engine then you and I'll talk through it so pre again pre-Senate Bill 86 the Hope Career Grant as Irene mentioned is available for students for approved technical courses once the student reaches their 30 hour cap okay so what were our options with that in mind and remember my arrow chart if we want to achieve that goal what are our options for achieving that goal so we'll start with with option one and this is used dual enrollment for technical courses okay so option one was for dual enrollment students to the technical courses to take the 21 hours of the academics and then they still have the nine hours left for the CNA courses okay so barriers with option one the impact the negative impact of that was that they would lose nine hours of academic course work that could also satisfy high school courses and the college courses the academic college course and just you I remember hearing your conversations with parents that are saying hey I want my child to maximize their dual enrollment with that academic core yes and it was it was it came to the decision of if my student was going to be in the program or not and so I wish to Mr. Hadja I was like I'm trying to explain the importance of what the value that they're going to get of going through the health care program but the parents are saying to me I understand but I would like to begin to get the gain from the academic side so that was one of the greatest barriers and then the other barrier was I look at Tracy I mean her goal is to get these students into that ASN that to that RN as quickly as possible so the other barriers you can take nine hours of academic core away to do the CNA then now they're at 21 hours for towards their their you know ASN rather than 30 so that's a long semester post high school that they have to take to get that ASN so those were the two barriers with option one so now we'll move on to option two which was to use the Hope Career Grant for Technical Courses so if you chose the technical side you could use the career grant in order to access those hours however if you do that you still lose you it goes it takes away from the students being able to complete the clinical rotation because we started in the eleventh grade and so we brand we we stumbled upon another barrier that stopped our students from being able to make this option available that's right so if you think about this I can't start my CNA until I finish my 30 hours which oh by the way it's halfway through my senior year which means I've got the whole spring of my senior year I'm doing my CNA classes I haven't taken the exam I haven't done my clinical rotations I haven't had a year's worth of internship so we've got two options neither one of them allow us to meet Scott and Tracy's goal so now we shift to last legislative session and really before that what we determined I came to my network Mark and Irene and others and said hey we've got a little bit of a challenge here we determined that using the Hope Career Grant for approved technical courses would yield the best options if we could somehow get there but that would require some policy changes so what did we do we started Irene won't you tell us a little bit about how we got started through gear first let me make sure y'all know you did a great job I passed in Senate Bill 86 but you put a three year sunset on that because everyone was very concerned about opening up hope and it's and again that's why you're here for us to make sure you clearly understand why this access to the funding matters in decision making so Senate Bill 86 is awesome it's making a difference you're going to see that but it has a three year sunset so and the other thing is we've been at this for going on three years as soon as House Bill 44 passed and we knew that we had these stumbling blocks coming thank goodness our support from Governor Kim in this conversation has been very very good and very supportive last year he gave gear money that's the governor's emergency education relief funding in order for out of COVID dollars and that paid for post-secondary side of this equation without changing doing Roman a year ago that they didn't feel comfortable about introducing doing Roman legislation because it was a recent House Bill 44 but they also recognized we need funding to pay for these courses so that gear funding and the other wonderful thing about the gear funding and Derek is here can tell you about the technical college getting that but we are in we've been incentivizing at least 12 to 18 other communities doing this exact same type of program and all of that led to Senate Bill 86 so the beauty of this gear funds all of these students that were back here to this morning they did not have to make that decision on whether or not to use their their dual enrollment for core or technical the gear funds allowed the they just pay a ton of knowledge for the technical classes so that took that problem off the table for a year and that has been tremendously successful we've got how many different communities for online watcher you're going to need to speak on the microphone I think it's all there we go so yes we've served almost 30 high school and college and career academy communities throughout the state Joseph Beckles from my team here has really helped spearhead that from the technical college side but we had about 1300 students almost 1400 now that have taken advantage of this program with almost 8,000 credit hours that they've been able to use over nine technical college partners and we've spent about 95% of the grants I have a sheet that actually hand around we're waiting on our final fall numbers come through but we expect to expend all the funds by the time fall semester concludes so we've got a year's worth of data that to go along with the three year sort of look in the Senate Bill 86 to the gear funds which is great and we appreciate the governor for allowing that to happen so option two that we shared using hope career grant for approved technical courses that's what we passed with Senate Bill 86 and I want to just crystallize that so you heard you saw our two barriers Senate Bill 86 removed those barriers okay so it allowed basically allow students again you can see my little diagram here it was you you had to wait till dual enrollment was over to start accessing those career courses what Senate Bill 86 says hey you can access those simultaneous okay and 30 hours of dual enrollment for academic core hope grant for the technical courses and and so what that has allowed us to do and then again full circle has allowed us to get qualified students into the workforce sooner we've got our professional soft skills development we've got our high school so these are what these students will graduate with professional soft skills training CTA pathway completion dot roll CNA certification we've just added this medical assisting coursework that they'll that they'll have as part of their curriculum 30 hours of dual enrollment that counts towards their associate's degree their ASN one year of an internship as a CNA working in a major employer alongside all sorts of different health care providers their high school diploma obviously they only have 30 to 32 hours remaining for their associates degree to get their RN and have the opportunity to be an RN by the age of 19 again if you think about Scott's example he's 200 or he's he's got a paycheck ready for 200 people that have an RN at an average of about $70,000 a year just wait and so and that Pam same with you so and let me just share real quick all results so pre Senate bill 86 we had a health care program we were doing folks going through our CTA pathway we did not have the CNA opportunity gear funds we had 17 that join there for this next cohort we've got 36 and then our current 10th graders we have 71 students that are in that pipeline and that's primarily because of the work you all have done but also the fact that we've got an incredibly strong partner in Phoebe putty that's not only willing to put their time and effort over here and to give all these kids experience but also willing to help the school system fund yet another nursing position instructor position to solve this problem so a lot of information we've got a great panel here mr chairman any questions that anybody might have for us yeah let's let's do some questions for the panelists and I'll kick us off going back to that slide you don't have to go back to slide but we're Georgia ranked 49th and and was it nurses per per 1000 in any any all of you are qualified to answer this so any of you can have it what what do you contribute that to I mean there's usually and there's as we all know in government there's there's not always a rail is it one thing so what are maybe the top three things that you contribute that number being so low yeah well I'll give you one and let the other members yeah the I had the privilege of serving on the governor's health care workforce task force last summer and summer fall one of the things that we're looking at the the numbers the data was showed that 56% of all nurses that graduate from the university system and that was just how the data was pulled but from the university system state in the state compared to North Carolina in Texas were 74% state and so I don't have an answer for you that was sort of our post work was to go to the university system and say we need to figure that out why why why are 40 44% of nurses who graduate from a university nursing program leave our state you know is it just that we take more students in from other states and they're going home is there something driving out you know we looked at the wages could it be that we don't have that answer but that's a substantial part of of the miss in the state when you think of other states and why they're successful yeah now I remember the statistic well from the health care workforce commission and it was you know you really would think Georgia has some us to offer and why would we have such a trition and so I think that needs to be looked at even more deeply as with all things that we look at and you all are challenged with looking at these things are dynamic multi-factorial there's a lot of contributing factors and and I share with providers often that we need to be looking at solutions such as this but we also have to look inwardly and internally at turnover what what is impacting turnover but still foundationally we have to ensure that we are sharing the message creating the seamless pathways removing barriers so that we can bring as many expand that pool to the degree that we can there's there's a lot of things that are impacting you know what happens whether they stay or they go once they enter into health care and that profession and that needs to continue to be looked at and studied because we did have a problem with retention and and I want to own that but I think that you know that's worked it has to go alongside this effort but at the end of the day I think we know that truly what we've got to do is expand the pool and we have to make sure that folks are aware of opportunities I mean we do have a public relations challenge embedded in this whole piece of ensuring that folks understand what's available to them and then attracting them let me just add I think this program demonstrates solutions whereas the goal is to keep these students right here in Albany it is not for them to go off to another college it is and it is right here a very seamless path into the workforce not into post-secondary into the job because there was a health care partner with them that helped them along the way and you're going to see that not only here because they interned with them they were offered and supported with mentors their decision making was helped they they had the job knew what their job was at the end there was no need to leave Albany this is the greatest place in the world to be don't leave and you're going to see that employer involvement and the importance of work-based learning and internship as students make that path you're going to see that in this program and you're going to see that in the manufacturing programs in Cali DeCounty and one other thing that I think is critically important is that our post-secondary partners work in cooperation together providing that unbelievably seamless design pathway of high school to post-secondary technical credentials or associate degree or a four-year degree and there's no question about where I go that path is critically designed for students so I'll be the one to ask the loaded question from if we take time and money out of your ability to answer here what is one thing that we as legislators can do not not just here locally of course but I'm kind of going back to your statistics across the state what can we do with taking time and money out of that consideration is is there anything that you would offer to us to consider I'll get started and then you know Senate Bill 86 is a fantastic start and to me it's smart because this you know students are already able to access that hope career grant so you haven't added anything markedly to your the expense side of this program we've just sort of reoriented a little bit we adjusted we removed a barrier and and you're listening and participating and going through this process is step one so I commend you all on that I think this is a fantastic small adjustment cost-effective smart adjustment that you've made that's going to have already is having in type of that's my fault yeah you know no no one solution right it's going to be programs like this they're going to add up but if I remember we were sitting in Atlanta advocating for more resources for technical colleges in the university system you're not a fine hospital's many times say would you please give more money to somebody else and not us but in this case I think it's going to our schools and saying what they need to be more they need to be able to bring more faculty on in a competitive way it's hard when the faculty who are nurses themselves can go travel and make you know one and a half or two times the amount of money and nobody blamed them it's hard to get them back and hard to get them in a faculty position so how do we go to the deans and the college presidents and say how can you be more competitive in your faculty because we can have all the the interests in the world if we don't have teachers to teach them right they the program shrink and then our our statistics go down so how do you know how do we you know I always thought this is I still say it I've said this to Chancellor Purdue so he does know I said you know how does the university system double the number of nursing slots that they have today right I mean there's a lot of nurses that get turned away because or students because there's not a slot and and so you know is there a way to incentivize our colleges and our technical colleges and universities to take on more more nursing no more healthcare positions and I would just add you know being willing to think about things differently we recognize that as you know time goes along how we operate today is not how we operate at 30 years ago or maybe when the nurse a training program state requirements and rules were written so when we come and say there's just an inherent barrier built into the way that things are now being willing to say you know let's get that out of the way let's figure out a way to you know now we're working with the University of Georgia on a remote skills evaluation process so the nurse aid students have to go through a written certification exam to get their state certification but they also have to go through a skills evaluation process and they had to in some cases over the course of the pandemic they were traveling four and five hours to get that done and that's just really not realistic for where they are in life and resource etc and so we're piloting a program with the University of Georgia where that skills evaluation is conducted and proctored virtually and had a great launch recently and so it's that sort of thing that we've got to be willing to entertain and think about and do differently because the healthcare system as a whole and the way we deliver service looks different now let me add to your question but make sure you challenge local communities on how they're using the investments that you're already making and that is you heard through this program your faculty is certified by the technical college as well as Albany State so the funding that you sent down for a CTAE Albany Albany Dirty County Schools to pay for that additional funding so that's make sure that those funds are coming together in the most efficient and effective way possible that's a critical there's not enough money to keep everybody in silos but when a community is incentivized to do what they're doing here in partnership that's when you get the biggest bang for the bug that you're investing thank you any committee members. Thank you Mr. Chairman thank you so much for these informative presentations one of the things that really strikes me and that I really like about the work that's been done here is how coordinated and integrated it is with major employer with employee need workforce shortage working with the school system the university system technical system and of course you guys hear it the college and career academy and so as we sort of move through the study committee process I'm wondering how many of our other college and career academies at the current time have such a sort of integrated and coordinated pipeline with one or more large employers right in that region where the path is is very clear and can flow without sort of any major impediments. A lot of them do yes a lot of I mean we thanks to the gear funding and the technical college leadership those communities that that got kick started we went around and Phoebe has done a great job of convincing all other health systems that there's go go find kids at the high school level and a lot of school a lot of businesses are opening up the doors to 16 and 17 year olds we've been talking about increasing work by slanting forever and how important that is and this is just that that idea on steroids so there's so many pieces of this puzzle that are in place that you guys are already funding but the issues like this is kind of a no-brainer but the thing about Senate Bill 86 when you decide to make that permanent which honestly is our ask we hope that you do it is to ensure that you are incentivizing this as opposed to going back where students are just picking issues and whatever doing enrollment programs they won't that's not what we're trying to create we are trying to create these types of programs that are high how to man high skill high wage programs that lead people directly into a job in their region and senator i'll just add you know this structure is conducive for the college and career academy structure is conducive for the problem that you just I mean my job is to partner with our whether it's Phoebe Putney or Procter and Gamble or Marine Corps logistics base or whoever all of them have got challenges so I'm able to go out and figure out what those challenges come back to a seasoned educator because I'm not and sit down and have a conversation about hey this is what they need\n\nyou know, and have a school system that's willing to sort of roll up their sleeves and not they say, no, that's the way we can't do it. It takes all of that working together in a school system that says, you know, we're going to fund 50 percent of the hospital's willing to put in 50 percent for instructor while wouldn't we? You know, that's too, you know. It takes leadership with the business community, with the school system, and we're blasted down here that we've got that. And so I'm hopeful that others in other communities, I know in Newden, I know at Golden Oils, they have the same local input. Any other committee members, any questions? Yeah. Thank you. If I could add one more question and you could be brief. The internship, I think, that's one of the most important things you do. Can you just kind of comment about how that affects the kids positively? And because from what I understand, they're not going to go through the same rules, regulations as your full-time staff. Yes, so I mean, it took adjustments in our workforce. You know, when we were first set in it up, we had, we were very particular about the units and the floors that we started the interns in. We really wanted to make sure it was a positive environment. We didn't, we kind of wanted to, you know, put our arms around them a little bit and make sure they were having to get experience, right? So that was one of the things. You know, one of the things that some might say was a challenge, but when we first started, we had a death of a patient and one of the interns had that experience and it was very disturbing and upsetting and they ended up deciding not going to health care. I don't see that as a bad thing. Not everybody needs to be in health care and that is something that you're going to have to experience. I see that as that student was able to make choices earlier on that maybe this isn't the career that I want to go into. So, but overall, it's been positive. We've had some great, you know, our patients love having them, our staff love having them. I really wish we would have asked one of them about that because I think they could share more probably than me. Thank you. Yeah, and I'll just say this, Rick. So whenever Tracy laid all that out and said, this is what our needs are and we talked about an internship, I said, look, this needs to be a paid internship. I said, we've got students. We need the value exchange is important because they could go work somewhere else to make money and miss out on the chance. And so just to further crystallize our partnership with Phoebe Putney, we have an MOU with them $75,000 a year goes into this program and about 75% of that is the internship program. So that's the key. So they're getting experience, they're making money and they're learning to put all of those skills into play. That's great. Thank you. You can tell where all the politicians are sitting and where our citizen appoints you to sit because everyone's grabbing the microphone. All right. So do you all have any questions? Scott, do you have a question for yourself? Well, y'all give our panelists a big round of applause, please. Thank you, Chris, for leading that discussion. That was very informative. So at this time, we'll go into the public comments and we're running a little behind, so just try to keep them a little bit brief. So first off, we've got Emmett Grillswald with Albany Tech. Yeah, actually, why don't we just come right up to the podium. We got a microphone right there for you. Well, I signed in because I thought it was a sign, and she didn't know it. I was speaking, but I'll go here since she called me. But I just want to re-enerate what Scott said about the legislation could do for us if you had a question. And it is funding for faculty. The two key variables over any type of school or college is the student and the faculty. So if you don't have those, then you don't have a school or college. So again, funding for faculty for those positions is extremely important, since you'll, because again, we can add slots and add more nursing slots for students, but we've got to have the faculty in order to meet those ratios for student, student and faculty ratio. So again, I just add that point. Thank you very much. Joseph Eccles from TCSG. You just, you just follow his lead, right? I like that. Sarah Branson from ASC. So I can just kind of add to what Dr. Griswell said earlier, because we are a small rural community, and there are a lot of communities in Georgia that the same, we end up competing for the same faculty, competing for the same nursing workforce, as you can tell, Tracy Super, Dr. Super is wonderful. She left Albany State to go work for Phoebe. And we go back and forth in that direction, and a lot of our faculty members decide to go back into the healthcare workforce because the pay is better. So they are competing for their family needs in the workforce as well. And so just finding a more competitive salary for our nursing faculty, for those of you who do not know, our Georgia Board of Nursing has a faculty to student ratio in our classrooms. So we have to meet that ratio. Albany State turned away over 60 students this semester because we do not have enough faculty in our ASC program. Thank you. Thank you for bringing that point home and putting it in a real-world numbers perspective. Lisa Stevens? She was behind me today. If anybody come in, not behind Dr. Perez, all there would like to speak. Well, all right, so great testimony, great panels. Thank you all again for doing that. And Chris and Angie, we appreciate y'all hosting us here at 4C. It's a beautiful facility. We're actually going to do a tour. We've got a little bit out of order on the agenda. We're going to adjourn first and then whoever would like to do the tour will do that. And so we figured we'd better do that out of order because if we leave here, we may not be able to get him right back for an adjournment. So we'll do that for our panel or I'm sorry for our committee members. There is a little lunch for you. If you need to go, that's fine. Grab it and go. And again, thank y'all for being here. And just proud to see the work y'all are doing. And one of the two words I think that you see here and then really you see throughout the state and our college and career academies and that word is partnership. You know, when the public sector and the public sector come together to find solutions, it truly works. And we figured out. And so this is just a great example of that and look forward to seeing the continued success and whatever we can do as policymakers to whether we're removing red blocks like we did in SB 86. These are the things we need to know. We need to see and we got to see that today. So again, thank y'all. Coach Irman, Dominic. So I hope that you're all on the email list and you're getting updates on our meetings. And so we've got three more as we said, we'll be in less than two weeks, we'll be in Cal Edie County. So if anybody's not getting those emails, come see us, we'll take care of that. Unless there's anything else for the good of the order. Good. For the clubs, we have much for our panel and staff and they'll be able to bring it back in their payable time. So we come back to the tour, we'll be here for you. And if they're lost, you can take all those. You have to 200 plus miles. We've got 250 miles. We appreciate the box lunch. If nothing else, we'll stand adjourned. You",
  "updated_at": "2026-02-13T18:13:20.877582+00:00"
}