{
  "video_id": "-RD2DJ0GGnw",
  "url": "https://youtu.be/-RD2DJ0GGnw",
  "title": "Georgia House - Day 27 (2026-03-05)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 27,
  "video_date": "2026-03-05",
  "duration_minutes": 169,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n# Georgia House - Day 27 (2026-03-05)\n\n## Overview\nThis session focused on the passage of several notable bills, including legislation related to elder care, while also recognizing various individuals for their public service and contributions.\n\n## Key Actions\n**HB 929**: Relating to the caring and protection of indigent elderly patients, to provide for authorized electronic monitoring in long-term care facilities.\n**HB 369**, **HB 450**, **HB 60**, **SB 215**: Bills introduced and referred to committees.\n\n## Bills Introduced (First Reading)\n- HB 369\n- HB 450 \n- HB 60\n- SB 215\n\n## Notable Moments\n- Recognitions and commendations for public servants, including Bruce Whitener, William and Billy Fleming, Georgia Supreme Court Justice Harold Melton, and Charles Stevens.\n- Honoring Latin leaders during Black History Month and Georgia's career technical and agriculture extension program.\n- Debate and discussion around HB 929, a bill to allow electronic monitoring in long-term care facilities, led by Representative Cooper.\n\n## Votes\n- HB 929 passed with unanimous support.\n\n## Attendance\nThe session maintained a quorum.\n\n## Adjournment\nThe House adjourned and the next session is scheduled for a future date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you Bruce Whitener for his many years of service, recognizing and congratulating William, William and Billy Fleming upon the grand occasion of his retirement, recognizing commending Georgia Supreme Court Justice Harold Melton for his 30 years in state government. We're gonna recognize and commending Charles Stevens, recognizing commending honoring Latin leaders during Black History Month, honoring Georgia's nationally recognized career technical and agriculture extension program and the educators' experience prepares hundreds of thousands of Georgia students for college and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here's none and the resolutions are adopted. All right, we're going on now back to the rules calendar. The clerk will read the caption to House Bill 605. House Bill 605, I'm resident of Cooper, the 43rd, to be a title of an act to amend chapter 8 and title 31 of the physical to Georgia. And Tate, relating the caring protection of indigent elderly patients, so as to provide for authorized electronic monitoring in long-term care facilities. This will let them further the committee on human relations and aging. That committee recommends that this bill do pass by committee substitute. Chair recognizes the chair of the Health and Human Service Committee, Chairman Cooper, to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring to you House Bill 605. For those of you who have been here, you know that over the last six or seven years, almost every one of those years I've been back with the bill to try to come back elder abuse. It has become a passion with me. And I can tell you that there is one place that no one should be abused and that is in their own home. And when our elders go to nursing homes or assisted living facilities, those facilities become their home. So it's imperative that we make sure that they are protected. And I want to thank Representative Demetri Stugles because over the last four years, he has started the conversation about cameras and the rooms of people in our nursing homes. Now this bill is different, but it gets us to the same solution. And I appreciate his work because both of us believe that sunshine is the best disinfectant. And when you put a camera in a room so that you can watch what is happening to your elderly loved one, you are shining sunshine into that room. And I think it's become so important as people have and family members have been kept away from their loved ones, not to be mean, but to try to protect them from the deadly COVID. And we have seen the anxiety that family members have felt. So what 605 does, it makes it abundantly clear that families can put a camera in patient's rooms. This is out and open and that they're nursing home from these facilities must allow them to do so. Now there is a form, they fill out a simple form, they let the home know what they're doing. They do have some responsibilities and the bill, you know, makes these clear that if you're going to put a camera in the room, that the family or the person is responsible for the cost and the installation, but they must be allowed to put the camera there. But so often in nursing homes, there are two people in every room. And a camera doesn't just capture what's happening to one person, it happens, it captures what's happening to the roommate. So this bill outlines the fact that the roommate has to give permission, how they go about getting that, but it also does not allow the roommate who says, no, I don't want this or so forth, to totally keep a person from putting a camera in the room. The home or wherever they're living has to offer to move the person who wants the camera to another room when it's available, or to a private room, but the person would have to pay for it. And if that while they're waiting to make that arrangements or that move, they can still have a camera if it's directed only at them, and without audio until they can be put in a different situation where they can have both. It also, there's a form that fills out so that the patient or the resident still has the right to say if they have good mental ability to make decisions for themselves, they can on the form with the home, and they would be incorporated into their care plan, the ability to make decisions for themselves. I want the camera on and I want it on 24 hours a day. So they check a box or they say, I don't want the camera on when I'm being bathed, I want it turned off. Or if they still have a spouse or a friend as I got a great lap in committee with using a very old saying, if they want a little whoopie, that they can have the camera turned off at that time. So it allows people to make decisions for themselves and does not take that away for opening it. Come on, guys. It goes on in nursing homes and assisted living facilities. So somebody doesn't want to hear it. This is a carefully worked out compromise. Now I'm not sure the nursing home people would say that it's careful. They would probably say like somebody did on another bill when we worked on that bill last year and was asked how they got on board with me. They said, well, I had two choices. I could get on board with or I could get run over by train. I am a patient advocate. And in all the discussions with the nursing home industry and the assisted living facility, my thing was I'm not trying to help you. I am a patient advocate. I am protecting the rights of the patient. And when the trial lawyers came and discussed things with us, I said, I'm a patient advocate. I'm not trying to let you set it up to be and do frivolous lawsuits on the nursing homes. But you are there. We need to get this right and protect patient rights. So this has been a, you know, really carefully, a compromise and worked out compromise bill. Mr. Speaker, I will yield with that and ask for your favoral consideration. And we'll answer a few questions if we do have some. Do you yield for a question? Yes, sir. Chair recognizes Chairman Houston to your ride for a question. Thank you so much for bringing this bill. And I know so many people in this chamber of hearts go out to our friend, Patty Bentley. And I just want to say, thank you from Patty and all the people in those circumstances for bringing this. And it will be such a help to her. And as the shame we didn't think about it early, it could have been named the Darryl Bentley bill. Thank you. That would have been a good name for you. I mean, you know, the nursing homes become these, you know, the residents home or the, and, you know, it needs to be one where, like I say, the sun shines in. And by having the cameras in the rooms, you know, it helps both the home and the patient. We know what's happening. But at the same time, it allows the facility to also, you know, if they think they have an employee, it helps in another way because if they think they have an employee that might not be doing their very best, they have a recording and can ask to see it from the people that put the camera in the room to check up on their employees to check on one kind of care is been giving in the home. So it works two ways. It's an advantage for patients and their families. It's a advantage for the people that are supervising them. You know, what I said before was, if I can watch or could have watched my corgi who passed away this summer, when she went to daycare on my phone all day long, I could have checked on my corgi. We should certainly be able to do that with our loved ones. I'll take another question, Mr. Speaker. Sorry. Chair recognizes representative Stacy Evans up in the gallery to your left for a question. Thank you, Mr. Speaker. Does the lady yield? I will yield. Thank you. Online 993. It talks about how a resident can't have access to the facility's Wi-Fi unless the facility consents. And I was wondering what is the rationale because I assume that if a patient uses their phone or computer, they don't have to have extra permission. So I was just wondering why we have this in the bill. Well, you're asking the person who understands that so incompletely, but what I was told is, and what I would hope that this bill would lead to being having cameras in almost every room, if not every room of these facilities. And if you had a lot of people using and going onto their Wi-Fi, that that would take up their broadband and the power. And so that is the reason why. Well, the lady further yield. Yes. Let's say you have the residents asking for permission and bandwidth is an issue. And they say yes. They say yes to the next person, yes to the next person. And then they decide that by number four, our system can't handle it. How is that going to be dealt with? Fairness. Why would think that that would be something that the individual facility would have to, I mean, they would have to go back. They do have to honor the fact that they had let those four people use it. And then say because of the use that we're having, we have to stop that. And we're going to have to, you have to get your own or we have to charge for it. But that would be up to the facility. Thank you. You're welcome. I'll yield for one more question, Mr. Speaker. Chair recognizes representative Shannon to your right in the gallery for a question. Thank you, Mr. Chair. If you could talk a little more about lines 89 through 91 that talks about the situation of if there's a dispute between roommates, where one roommate wants to be recorded, the other does not. It looks like the way that this bill is written, they can go ahead, the facility can go ahead and start recording even while the person who doesn't want to be recorded. It's still in the room. I guess my question is, what would be the incentive for the nursing home or for the facility to hurry up and move the other person who doesn't want to be recorded? If the other person, if the other person who requested the recording is already getting, is already able to get the cameras rolling. Like what would be their incentive to resolve it? That's a good question. Thank you, Representative. I think the incentive would be if it's a patient asking for it, they're continuing to push to be allowed because we said that if that's the case, they would only be able to record the visual without audio to it. And so either the person would push for it to be solved or the patient's family. If they were the ones that were asking for the video to be in place and to be able to record both visual and audio recording. Mr. Speaker, there's no other questions. I'll yield the well and ask for everyone's favorable vote on House Bill 605. I don't do this often, Madam Chair, but I want to thank you for your good and hard work on this important issue. Lady is yielded the will. We have a couple of members that wish to be heard. The Chair recognizes Representative Mary Francis Williams to speak to the bill. Thank you, Mr. Speaker. There is no one in this House that I respect more than Chairman Sharon Cooper. She is indeed a huge patient advocate. She's introduced and passed many, many bills that benefit Georgians on all kinds of topics that mean a lot to me and to people in my district. So it is with reluctance that I rise in opposition to House Bill 605. This bill is not quite the compromise that it could have been. It is actually an attempt to undo the Supreme Court opinion in December of 22, which rule that vulnerable residents in nursing homes can use hidden cameras to protect themselves and their positions. And what this bill does is it makes it impossible to use a hidden camera. In committee advocates tried to make changes to the bill but were unsuccessful. The groups that have contacted me about the bill include the Georgia Council on Aging, the Alzheimer's Association and AARP. And they all had serious concerns. They feel like for these cameras to be truly helpful. They need to be hidden. And there's a couple of other issues with them. The paperwork is pretty complicated. It's in the bill. It's in the back. It's pretty complicated. And they, the patient would have to check to make sure the camera is turned back on every time it was turned off. And if the camera is turned off or taken out of the room, there is no recourse to make the staff turn it back on. Nursing home residents would lose under this bill. They would lose the right to place the hidden camera in their living space to document theft or abusive behavior. There's one example that speaks to this issue. Begging for help for over 30 minutes James Demptsy, a World War II veteran and resident of a nursing home died on February 27, 2014. Video footage shows that staff members responded to Mr. Demptsy's room and told him to stop pressing the call button. They left him there to die. When his family was notified that he had passed away, they were told that he died in his sleep. Thanks to a recent Supreme Court decision in Georgia, the video of Mr. Demptsy's final moments can be used in the criminal trial against his so-cared, so-called caregivers. At a time when so many of our elders in Georgia are in nursing homes, as we have mentioned, without the ability of their family members to check on them daily, a bill like this is more important than ever. And so my issue is I ask you, please not to pass a bill which takes away the right of families to put a hidden camera in the room of their loved ones. And again, I very much respect Chairman Cooper and her efforts to work on this issue. And with that, I yield. Do you yield for a question? Yes, sir. Thank you. Lady, the head of the question is withdrawn. You have no other questions. Thank you, Mr. Speaker. Chair recognizes representative McLaura to speak to the bill. Thank you, Mr. Speaker. This past year, I lost my step-grandmother to COVID. She was living in a long-term care facility in Kentucky when the virus spread. And we've heard these stories. In the final years of my grandfather's life who was her husband, he's a World War II that he lived in a long-term care facility. And I remember eating lunch with him and talking to the very nice staff that took good care of him. And, you know, his address was called Friendly Way. That was actually his address. Was a number and then the name Friendly Way was where he sent a mail. So I share that just to say, representative Williams and I are speaking from the exact same place as the sponsor. When it comes to our heart for the issues and what it is that we seek to do as a body to address bad actors, the worst of the worst scenarios. There's a reason that the advocates have opposed this legislation in its current form. I practice law. In law, you have consequences when rules are broken or else those rules don't matter very much. If you don't have an enforcement mechanism, if you don't have a penalty, and I know that that's something that you've heard me speak to the other side of, but I acknowledge you have to have a penalty in order for rules to be enforced of some kind. This bill has a prohibition against turning a camera off, but it does not have an enforcement mechanism if somebody violates that rule. We're not talking about Friendly Way in this bill. We're not talking about the ordinary case where you have a staff person who's very concerned with the health and well-being of your loved one. We're talking about a case where there's bad actors. We're talking about a case where there is a possibility that somebody will intentionally tamper with a camera because they understand that their conduct will be recorded. And if that happens, they will violate the bill.\n\nbut there is no consequence for that person. Currently because of a Georgia Supreme Court case, families across Georgia have the right to put a hidden camera in these rooms. Now that the idea of a hidden camera seems kind of subversive or sneakier, maybe seems like we don't want to build public policy around the availability of a secret option. I think we both agree with that in the long run. But what it means, an aging advocates breathe the sigh of relief in December when this Supreme Court ruling happened, because what it means is that families, for at least some period of time, have a right to protect their own loved one with their own private means, and whatever evidence they collect on that video recording will be admissible in either a criminal proceeding to hold folks accountable or a civil proceeding to sue for damages. That right currently exists. This bill says if you put any camera in a resident's room, it's in violation of this bill that you don't get those same rights. It doesn't go into the criminal proceeding. It doesn't go into a civil proceeding. That protection is taken away. Because I'll ask you, if you have a camera in your resident's room, and it records all the bad stuff that happens, but you can't use that evidence for anything that well good is it to have the camera. So yes, this bill is an attempt. It's a leap. It's trying to say, well, let's move it above board. Let's put the camera in a public place. Let's make sure the facility clears it. Let's go through all this rigour roll. It's a lot of some bandwidth. Let's do all that. But at the end of the day, if somebody can tamper with the camera and there's nothing that stops them from doing it, it is not a real protection. And if it is, it's certainly not as real of a protection as exists now, based on the Supreme Court ruling from December. I too think Madam Chair for her hard work on this. As we all know in this building, you can work really hard on something and still not get it to a place where it's the public policy that we want to settle on with due respect to Madam Chair and to the speaker. That is the message I'm trying to send. Some things you can fix in the Senate, we're just not sure that this is it. We would have to give the aging advocates really a redo on thinking how this scheme is going to be set up. I don't want to gaslight anybody. I don't want to create risks that aren't real, but we are rolling the dice. You are rolling the dice with resident safety if you vote yes to this bill. I will be voting no with great respect for the sponsor and the people that the sponsor worked with. But I ask that you join us in voting no to this legislation as it's crafted today. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is now in the previous question is ordered. All right, we're going now to the chair's time. Chair recognizes the chair of the Human Relations and Aging Committee Chairman Petri. Thank you, Mr. Speaker, and I yield my time to the bill sponsor. Thank you. And thank you to the last two speakers. The court did rule on one case, and that case that a hidden camera was a missable. That was Mr. Dempsey. But Mr. Dempsey is dead. Hidden cameras go after and are useful after the damage is done to an elderly person. That's why they show. They show that they've been abused or they set there and laughed at Mr. Dempsey while he was dying. What a difference it would have been if with a notice outside that door that there was a camera in that room. And that there was a camera high up on the wall, which is permissible under this bill. I tend to believe, and I think I'm right, that Mr. Dempsey would have gotten care and had the big possibility of being alive. I believe that cameras out in the open because it is human nature. That if you are knowing you are being watched, that you're less likely to take shortcuts and do abusive things that might hurt a patient. That when you lift them up in the bed, that you do it a little more gently, because there's a camera that you know that's in the room. That's that room that's rolling. Now you're right. Anybody can do anything and turn a camera off, but they can also find the hidden ones and instruct their views. The bill does include it. I tried to find the actually what part of the law is they would fall under and rules would be made by the department. They're already because the department, as I talked with them, also said that they had the regulation and tampering with a camera would be considered going against the care of the patient. And they would have regulatory coverage of it and there would be fines that go along with it. Now the one thing is in talking with the trial lawyers, they did want that specifically spelled out in the bill, not just where it references the part of the law that's covered by that. And I agree and said if it makes you feel better and great, I'll be able to put that in there. So it is in there already. And the department said they did have the ability to find if people were cutting the camera off, you know, and it would be. If they cut the camera off and if it was cut off frequently, the lawyers, the trial lawyers tell me that that when if there was a problem of something happening to a person that right then and there that would be a missing court and would certainly indicate that something that shouldn't have been happening was going on by the fact and the frequency of the camera being covered up or turned off. So in those two issues, the courts rule on individual cases, we make the policy decisions down here. And this is a policy decision and I have great respect for the advocates. I have worked with them. I was on I texted Kathy Floyd last night. I have really searched long and hard about what is best for the patients that live or the clients that live in these facilities. We talk about transparency all the time and we talk about sunshine laws down here. And this is one time that I think the advocates are just scared to change. And I don't think that they understand that this will make a really difference. It's not because they're bad. They do great work and I have great respect for them. But I believe that when cameras hopefully are allowed in the rooms and out in the open that they will become the routine process, not that there will be one camera in the facility, but almost every room if not every room. We'll have a camera and the people that work in these facilities, most of them are kind caring people who work for very little money and do a really, really hard job. Because if you're working with Alzheimer's patients and they're lashing out with you, it's hard to remember that it's their illness and not the fact that they've tried to slap you down. Because that's what happened. And most of the people are in these facilities and working these facilities, they care about these patients. There's always going to be bad apples. We can't prevent everything. But I believe that open cameras watching what happens will significantly reduce the problems we have with abuse in these homes. And I would respectfully ask for your positive vote on House Bill 605. Thank you. Any questions? No, sir. Lady has yielded the well. Is there any objection to adopting the Committee Substitute? The Chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Chairman Petrie rise? State your inquiry. Mr. Speaker, is it not true that historically the biggest concern for this issue was the issue of privacy? And indeed, is it not true that the greatest concern for privacy violations are with hidden cameras? Well, I just think it's better to prevent a problem than catch one. Have all members voted? Have all what purpose does representative LeHood rise? Parliamentary inquiry. Mr. Speaker, is it not true that I had the opportunity to work with Chairman Cooper on a major senior care reform bill last year? I know that to be true. And is it further not true that I know her to be a fierce advocate for senior adults? And that I believe she struck a great balance with this bill. There's none more fierce. I'll admit that respectfully, too. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 605. The eyes are 95. The nays are 69. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 647. House Bill 647, my representative Smith, 133, and others to be entitled back to amend Part 1 of Article 2, Chapter 8, and Title 12, with the official go to Georgia annotated relating to general provisions relative to solid waste management, so as to provide for post closure, ground water monitoring that closed cold combustion residual impound. This bill ever referred to the committee on natural resources and environment. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Vance Smith to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House. Today I bring to you the substitute House Bill 647. We went through a subcommittee, a full committee, thanks to the subcommittee chair, a rep's into bar, and thanks to Madam Chair, Ms. Smith. We had a good discussion. We had a lot of people online and some good discussion from them also. This bill is actually a monitoring bill, and it has to do with what they call CCR, the cold combustion residue that comes from electric utility facilities, and it's the residue that comes from them, and we know it as ash, and it's then pow much where this ash is located. You can look through the first several pages of the bill. It gives you definitions as most bills do, and the cold ash residue, excuse me, that's line 30, and if you read down to 35, it gives two good definitions right there. The main portion of the bill, if you go to page 11, it has a number there that this thing, these will be monitored for 50 years. We passed a bill in here last year, House Bill 929, and it's the identical bill to this bill except that number was 30 years. We raised that to 50, we discussed it in both full and sub-in full committee, and so we've moved that out to a longer period of time. Also, if you remember from last year, there's a reporting mechanism that takes place, and that report that's done, the executive summary, it talks about the facility itself, the empowerment, and it talks about the ground water monitoring that takes place, and it talks about the report having the samples that come in from these monitoring wells, and it talks about the main part is on page 12. It puts this report in what I call layman's terms, but you can read the language on 282 and 283. This report has to be written in a manner that can be reasonably understood by somebody that's not in the environmental community and does not have that technical expertise, so as I say it puts it in layman's terms. The last thing I'd like to mention to you is, while a facility on empowerment is being closed that the EPD can come in at least one time during the year as it's being closed, and after that every five years, at least every five years, so it gives them the flexibility in this monitoring system. I will say the EPD has done a youngman's job over the years. There's a lot of activity going on right now with these impoundments and how they're closed, a lot of activity with a monitoring part of that, and I just commend the EPD for all the information that comes in and the calls they have to make, and I really appreciate that for the citizens of the state of Georgia. There was a great article that in the Nunean paper back on February the 20th, and this is in the Nunean Times, Harold. If you ever get a chance to pull that up, I appreciate you taking a look at that. The reporter, Ms. Campbell, wrote a pretty good article about impoundments and closures and monitoring, so it's very good. But I do thank everyone for all their testimony, and Mr. Speaker, I'll be happy to yield the wealth of any questions. You do have some questions if you care to yield. Yes, sir, I'll take a few. Chair recognizes Chairman Oliver to your left for a question. Does it gentlemen, you? Yes, ma'am. The hearing testimony was very helpful to the very positive, but I'm confused. Mr. Chairman, if you can, please explain to me the use of trade secret definition that Georgia Power is using. Is it only about competitive bid and money? Or is it also include trade secrets of the engineering tasks that they're doing to clean a collage bond? Well, you know, we had somebody from Georgia Power, they were on along with several other people. I wish we could ask that question direct to Georgia Power. I feel a little inept at trying to answer that and give you the wrong answer, but I'll be happy to get with you and get with Georgia Power to try to answer that. Yes, ma'am. Yes, sir. Mr. Speaker. Do you further yield? Yes, sir. I'll yield one additional. I'll recognize this representative, Kasia, do you're left up in the gallery? Thank you, Mr. Speaker. That's a gentleman yield. Yes, ma'am. Thank you. And we, I agree we had a very productive discussion about this bill, but I wonder what I'm going to bring up. There was some discussion about whether we should store coal ash in line ponds of its landfills or not. And you agree that even with a lot of long time of monitoring, we still impede the risk of groundwater contamination that we would address after the fact when something happens. Well, I appreciate the ladies' question. Yes, we do have a lot of conversation and that was some of the questions that was mentioned. This bill strictly deals with the monitoring part, but if I spoke to the liners and I mentioned something that day in the subcommittee, and I may have mentioned it in full committee too, that it should be in the earth moving business. And I don't know, my dad and I probably over the years built some 300 ponds, all different sizes from cattle, ordering holes to the larger ponds, even, you might even call them lakes. And I guess I was fortunate. I worked in that part of Georgia and West Georgia, and we have what we're known around the world as having the best Georgia red clay. I built a lot of these and you dig a core, which is known by soil conservation as a cutoff trench. And you take that good Georgia red clay and you pack it in and you bring it on up to ground level, and then you bring it on up into the dam. Some of those cores or cutoff trenches have been 14, 18, 20 feet deep, some 14 feet wide. And we were very fortunate here and now over the years with our small company of building these lakes and ponds. I don't remember, but one time when we had somebody call us and say, how, I think my lakes going down, we went and checked it out and sure enough, that lake went down because of the water pressure went under the dam. And we packed 18 inches of clay in the bottom of that lake, and I rolled it with a sheet foot roller. And that guy's never had another problem with his pond. So I think dealing with earth, I didn't know all the answers to dealing with Mother Nature, and I don't think anybody does. And there are a lot of people that's more than I am as far as the geology and the makeup of the earth that the Lord's given us. You know, liners, yeah, that sounds good. EPD right now has the ability and their rules and regs allow them to make that call. They can put some of the impoundments in liners and some of them not. I guess always think about a liner though, is it guaranteed if you line a three to four to five acre facility impoundment. And if somehow by accident, there's a crimp in the material or somehow a hole is punched in it, you know, and you just always stand that chance of something happen. And you get that one little hole in a five acre liner. That whole liner is no good anymore. And so, but then again, EPD makes that call. Put them in a liner. Don't put them in a liner. So I'll lean to their expertise, but I do appreciate the question. I'll go for one more, Ms. Pligger. Chair recognizes Chairman Timothy Barr to your left for a question. Does General Maniel? Yes, sir. Is it not true that we are absolutely concerned with the property owners around these and that we defer to the expertise and engineering of EPD and in this bill in no way restrict them if they so desire to put line landfills? Absolutely. Absolutely. They make that call. I've talked to some of those property owners. I've had them call me up even last year when you're introduced HB 929 and talk to some of them and have talked to the river, river keeper in that area. But yes, they make that call. They have that expertise that I don't even claim to have, but I appreciate what they do. Mr. Pligger, I know there's probably other speakers on this. So if at the time I, if you don't mind, I'll yield the well and listen to some other folks. Don't mind at all. Gentlemen is yielded the well. We do have other members who wish to be heard on the measure and the chair recognizes representative butler to speak to the bill. Thank you, Mr. Speaker. I want to begin saying this clearly as I know how to say that this is a yes vote bill. Just make that clear. I'm not here to talk against the bill in the sense that it is a bill we need to support. But is there more as a state that we could do? And I think that too would deserve a yes vote. Several years ago, I received a constituent call and he asked me a rather simple question. Why are the landfill disposal requirements for household garbage more restrictive than the requirements for coal ash? Needless to say, he had my attention. He told me that coal ash is a residue that comes that has toxic chemicals that such as arsenic lead mercury, chromium, and it's a product of the burning of coal in our power plants. And due to the coal, due to the closing of many of the coal burning power plants, it's now in abundance in our state. An estimated 92 million tons of coal ash are being stored throughout our state in online ponds. With no liner, these toxic substances can seep into the groundwater or flow into the rivers and streams and cause disastrous water contamination issues. Coal ash chemicals have been found to cause brain damage in children and increased cancer and heart disease and stroke. And these same poisons have been found in wells near ash ponds all over the country and in Georgia. As my constituent pointed out, household garbage must be disposed of in a lined landfill. And he asked me this question, why is there more regulation for the disposal of a banana peel than coal ash? Why is toxic coal ash allowed to sit in online ponds uncovered, seeping into the ground and risk of flooding and spilling into streams, rivers, wetlands, and farmland? There have been numerous bills about coal ash that have been presented over the last few years. And Chair Lady Smith has done a great job of having Georgia power and EPD keep us updated on this issue. Many of the members of the committee have traveled to see coal ash ponds at Plant Shira at Plant McDonough at Conson. And the thing that's significant about those coal ash storage facilities at those places is that they are situated near the Chauhutchi River over fractured bedrock and above aquifers. Coal ash chemicals have been detected by some of the monitoring test wells found in groundwater, next door to ponds on private property and in nearby rivers and streams. And that means that there's a problem that those ponds are not containing those chemicals. I just want us to work on the front end of the problem. What can we do to keep them out of the water? The bill deserves a yes vote. It takes rules that can easily be changed and put them in law. It upgrades it from 30 to 50 years of well monitoring. But what concerns me is how do we keep them from seeping into the ponds? What could we or should we do better? Other southeastern states have instituted very strict disposal laws in guidelines and rules and regs. In closing, why am I so interested in this? Because when we finish today and I go home as a rural Georgian, I'm going to be drinking well water. I live downstream between the Chauhutchi and the Flint and I value my neighbor's lives. I grieve for the people that are scared and hurting in Juliet. I am appalled at the amount of money that the Monroe County commissioners are having to pay to get clean, safe water for the citizens to drink. And I am concerned about the questionable well water test results in Cobb County. Some of you will tell you we don't need a liner or we need a clay one and not another one. I'm not going to get into that but I still can't answer my neighbor's question. Why do we have to have a liner for a banana and we don't for coal ash? So in Georgia, most of the groundwater is tested by landfills and commercial entities who are trying to prevent pollution are trying to catch it before it leaves their premises. There is very little independent mapping or governmental testing of our groundwater and we need to do something about that. During this session, several of our colleagues have been featured on TikTok and I seriously doubt I've said anything that will peak their interest. But there is a clock ticking and it's a clock that's ticking on whether or not some contaminants are going to get into our groundwater in a way that we will have to deal with that will be very serious, very costly. And if we started today might have been preventable. Please vote yes for this bill. I admire the work the chair lady and my friend, representatives and colleague and delegation member has done on this. I am not against the bill. I just wanted to use this as an opportunity to say this does not fix it. This is the beginning step and we have much more work to do to protect our groundwater that is so precious to keep it pure clean and healthy. Mr. Speaker, I yield the well. Chair recognizes representative Drenner to speak to the bill. Thank you, Mr. Speaker. You know, I rise today to provide some perspective to House Bill 647. I'm a Georgian by choice and a West Virginia by birth. My daddy for clarification purposes would emphasize West by God for Virginia. For those of you that are not familiar with the region is cold country, especially where I'm from, Southern West Virginia. My people were and are minors. And Mr. Speaker, they're all tired from fighting the war on coal. I remember as a child visiting my grandmother's house and from her front porch, I could look up and watch the conveyors transport the coal from the top of the mountain to the stockpiles below. For loading and transportation to generation facilities across the country. There's nothing have heavenly about the mining process is dirty. Of course, mining coal is different from generating electricity. Especially, I've worked all across the country and in various capacities regarding environmental health and safety.\n\nincluding a utility company. In fact, I oversaw the environmental health and safety programs for Southern companies' diverse literature assets. And it is from that perspective that I'm making my comments about this bill today. As the author of the bill stated, this bill mirrors a measure that passed last year but stalled in the Senate. The proposal requires monitoring and inspections of the closed in place coal ash ponds for 50 years, up from last year's proposed 30 years. Lengthening this monitoring time acknowledges that there is a problem with capping in place storage versus removal or excavation of the waste material. You can argue whether this is a hazardous or non-hazardous waste. You can argue about the effectiveness of liners or this is a federal requirement or that you don't believe in climate change. Or you can argue that these cleanup costs are already allocated by the PSC is just a part of doing business. These are all proximate causes to the core problem represented by this bill. The real problem underlying this bill results from market failure and the creation of monopolies. Utilities are monopolies. Now don't misinterpret me. This is not a good or a bad thing. I appreciate flipping the switch or turning on my faucets and having our lights come on on our water running. But it is our job to balance the power of a monopoly with the needs of a citizen, with the needs of our citizens. We control monopolies. They are not supposed to control us. In this instance, we have failed to address the most pressing, economic and environmental issue that faces our state and its citizens by not requiring the excavation and disposal in dry line facilities, which is the safest way to dispose of coal ash. It does not matter how long you monitor a site. Because you can expect, leachate migration of bio-accumulative toxins from these sites into our rivers, lakes and wells. The whole point of requiring coal ash ponds to be closed is to prevent them from leaking pollutants into rivers, lakes and wells. Let me close with this. Based on the time value of money, a dollar is worth more today than it is in the future. Let me set it out again. Based on the time value of money, a dollar is worth more today than it is in the future. What that means is that it's cheaper to remove these waste now that it is to continue to kick this can down the road. After all, we all will pay more to clean up these waste in the future. I like representing a buckner, wanting to support the bill. But you know what? This does not resolve the issue. For those of you that come back, this will still be an issue. Our utilities will still go to the PSE. They will still ask for more money for clean up costs. Ultimately, we bear the burden of those costs if we do not act to resolve this issue. Thank you, Mr. Speaker, I yield the well. All right. That completes those who wish to speak. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We're going on down to the chair's time. The chair recognizes the chairman of the natural resources and environment committee, Chairman Lynn Smith. Thank you, Mr. Speaker. Members of the House, I yield the first portion of my time to Chairman Bant Smith and to Chairman Timbar. I'll do the conclusion. Thank you. Thank you, Madam Chairman. You know, I grew up on a well too. I live on the Chattahoochi. I've got my wife and I have seven grandchildren sons, and they're there a lot on the weekends during the summer. So I'm very interested in what's happening to our water in our state. And I believe that we've got it in good hands. I believe we've got EPD taking care of this issue. We're here to work with them and we're here to work with the citizens. So I appreciate everybody's comments, but I would certainly appreciate your support on this bill and let's let's increase this monitoring system for any electric company compound and let's make sure everything is going smoothly. So thank you for your time, Mr. Speaker. Now you'll do my colleague. Chair recognizes for a portion of the chair's time, Chairman Timbant Smith, we are. Thank you, Mr. Speaker. Colleagues, I believe water is absolutely critical to all of our lives, right? We don't have an argument about that. What we're talking about today is facts, perhaps versus emotions. Emotionally, I have four kids and we get out in the wild almost every weekend, every opportunity we can. And I want to leave an excellent environment to my children. I want to finish my life in an excellent environment with no shadow of a doubt in my mind that my time here wasn't spent protecting that environment as absolutely paramount. This is my favorite committee. Of course, behind health and human services. But I look at the facts, right? The facts are that the highest authority in the land, the experts in this, the EPA, has deemed coal ash as a non-toxic waste, right? As we look at our policy, we have to look at the facts. So we look at that as one of our facts. It is not a toxic waste according to the EPA. Then we again go to the next level of our experts, and this is our state experts in the EPD, right? This bill strengthens and puts into law what the experts, the expert engineers in this field have told us is what is best, what is the best path. And we not only put monitoring from last year, we increase that for caution, right? We can't, we don't as a deliberative body spend, this would be billions of dollars, and money is not the issue. If they told us that was what we needed to do, we would do it. But emotionally, we don't do what we feel like is right. We look at the science and we look at and look to the experts in this field. And I would submit to you that the EPA and the EPD are experts in this field, and we want to follow what they've told us to do. And that's what we've done in this bill, and we've strengthened this bill. And I was proud to work on this bill with my colleagues. So I will leave you with that. Let's look to the experts. And this is the expert advice that we've been given. If they tell us that we need to line these, that absolutely we will. Thank you. I yield the rest of my time to chair, ladies and chair recognizes for the remainder of the chair's time, chairman Lynn Smith. Thank you, Mr. Speaker, members of the House. Well, this is a debate we're having on the House floor. We all agree that we need and we have a stewardship to our land. So there's no doubt about that, where the doubt comes in is in fact different opinions and concern by members. But I think every member in this room would look to their neighbor and say, I care about the environment. I'm passionate about it. We all are. So our debate here is how do we go about ensuring the safety of the citizens of Georgia, which is a paramount concern for us? I will tell you this for the past several years, when this became an issue for us because our co-powered plants were facing the shutdown almost immediately. It was like a tidal wave coming at the United States. Well, measures were taken at that point in time to start dealing with this problem. And I feel like our federal government and our state government has done an excellent job. Let me read just a couple of items here. This is an article from the Newton Times Herald. And they watched our presentation when we had the reports from both EPD and Georgia Power. And this article summarizes some really good information for you. It's out in the hallways for all of our chambers here. But I will read you this as Representative Smith and Chairman Barber saying, we know this. We know the US EPA has determined that both closure by removal and closure in place can be equally protective of human health and the environment. EPA believes one option is not necessarily better than the other. And then let's look at what our states are doing around the United States. There are two states that wanted to go further than what the EPA said. Oklahoma and Georgia. Let me say that again. Two states that have taken additional steps for the safety of our citizens. Oklahoma and Georgia. Federal coal ash regulations only apply to certain ash ponds. Georgia rules apply to all ash ponds. The federal system does require permits. Let me repeat that. The federal system does not require permits. So hello to the balance of the states in the United States. I hope you heard that. And only law and the only enforcement for these states other than the two I mentioned is by law suit. Georgia has stepped up to the plate and we are on top of this issue. Every year as long as I'm chair of this committee, you will hear Georgia power and you will hear EPD stand before us and be accountable. Now, when we stop and absorb all of that, we are arguing not about this bill. We all agree this is a good bill. We are arguing about what do we do when there is a problem. Well, the EPD has the power now to go and address that problem. And let me point something out to you in conclusion because we have a policy academy for the Natural Resources and Environment Committee. We go and we study with the experts that University of Georgia puts together for us. But this is something that we need to stop and think about. This is just one problem that we will be facing year after year. We will stay on top of it as long as I'm able. And I hope there will be a legacy of all of us doing that. This subject matter is so complex that you need to hear this as well. When we look at pollution, we have two areas of pollution that we look at. One is called point source pollution. So it means essentially you can point and see it to what's going on with the coal ash ponds. There is another type of pollution. It's called non-point source pollution. So why everybody is pointing fingers, I want you to turn that finger around and point to yourself. Because if you live in a house and have a roof, if you live in an apartment and have a driveway, if you drive a car, electric or not, we are all contributors to these issues that we will continue to deal with. So let's assume this responsibility together. Let's commit together for years to come. We will be on top of this and all other issues to protect the citizens of Georgia. Thank you, Mr. Speaker. You're the wow. All right, before we continue the vote, as all of you know, Monday will be crossover day, which means that Tuesday we will start visiting over in the Senate. So I've asked the chairman of the Senate Rules Committee to come by today, and he and I have had a good visit and he's promised that he will be, he has a usual kind and hospitable self on times that members visit. So please give our annual ovation to the chairman of the Senate Rules Committee, Chairman Mullis. Is there no objection to adopting the committee substitute? The chair has known the committee substitute has adopted. Is there any objection to her agreeing to the report of the committee, which was found at the hold of the passage of the bill? The chair has known her to comment, all is agreed to. Shall this bill not pass all those involved on the passage of the bill, will not allow those opposed to vote now on the clerk will unlock the machine. our have a if so the clerk will lock the machines on the passage of House Bill 647 the eyes were under the sixty one and these are two this bill having received the requisite constitutional majority is not for past. For could read the caption to House Bill 645 House Bill 645 I'm ripsing of gravity the sixty seven the others to be titled an act to amend article nine of chapter twelve title sixteen and if it's good to judge annotated really access to medical cannabis so stop date and revise provisions this bill that refer to the committee on regulated industries that committee recommends this bill do pass. Chair recognizes representative gravity to present the bill. Thank you Mr. Speaker members of the House today I bring to you a simple measure simply updating a commission and an industry that two years ago we sit here in this chamber and passed with a yes vote a bill that will allow access to medical cannabis oil in this state and create a commission that would choose six cultivators to produce to grow and produce this oil over two years have passed since I stood in the well and presented that bill. Hopefully in three months we will we will know who those cultivators will be and they will have twelve months from that period to produce oil so that over fifteen thousand patients in this state will be able to purchase a lab tested safe oil for their condition. This bill simply does this. We added after working with the Attorney General's Office we added and products to thirteen pages of the bill that's literally the only ad that further defines how this low TAC oil will be delivered to the patient. We simply added credit unions on page twelve line two and ninety eight. Section five we gave new strength and a stronger retail designation dispensing line to the commission. Section six strengthens the retail designation dispensing line to the commission. The bill is a critical cannabis commission oversight committee. And one of the things that I am most proud of and I'm very excited about happened just before we came into session this year I had received an invitation to do a campus tour of Clark Atlanta University just down the road. Now if you'll realize in the University of Georgia and Fort Valley State University that is not changed they still have that right if they so choose to grow medical cannabis after partnering with a cultivator. However I think we failed to realize that there were reputable institutions great universities and strong colleges across this state that wanted to participate. They don't want to grow it on their own. They are not asking for a license. They simply said, let us provide research and development. Let us study these diseases and how this substance interacts with these diseases to provide better medical research to provide better data to these companies that can even be reviewed by our medical association of Georgia. Friends I will tell you something Clark Atlanta University is the premier university I believe in I believe in the southeast when it comes to studying and researching prostate cancer. And let me tell you this, if you catch prostate cancer early on, it is 100% curable. They're just about to finish up the new renovations on their prostate cancer building at Clark Atlanta, and I would love to have them do some research on this product. Miss Speaker, that's what the bill does. It is simply a cleanup bill. We're not adding any diagnosis. We are not adding any new forms of delivery. We are simply cleaning up at the request of the commission and the attorney general's office, some of the things that needed to be addressed on the previous House Bill 324. You do not appear to have any questions. Thank you, Miss Speaker. I yield the will, ask for favorable consideration. Is there any objection to the previous question being ordered? The chairperson of the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Voting aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machine on the passage of House Bill 645. The eyes are 161. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Chair Clerk will read the caption to House Bill 620. House Bill 620, by the way, is the number of the 33rd to be entitled to amend. Title 29, chapter 4, Title 51, and Article 6, chapter 6, and Title 53, with the official go to Georgia annotated, related to Guardian and Ward, wrongful death, and bond. This bill haven't referred to the committee of judiciary. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Levere to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House I'm pleased to present you for your approval today. House Bill 620, but before I begin discussing the merits of this bill, kind of picking up where Chairman Cooper left in her comments about cameras, the folks in 341 were wondering if we could cut the cameras off in there. I'm assuming that's a decision that's probably out of order, Mr. Chairman, so I'll defer ruling on it later. But ladies and gentlemen, I'll put it to a vote. All right, at the appropriate time, perhaps we can have a motion. Bill 620 is different from cameras. It has to do with minor settlements. And is any lawyer to you? There's no such thing as a really minor settlement. They're all important. But this has to do with settlements of the claims of minors. It's a collaboration from the Judicial Council, the State Court judges, probate judges, and also the fiduciary law section of the State Bar of Georgia. Primarily, its main purpose is to increase the threshold amount under which approval of a probate court or any court or appointment of a conservator is required. And the purpose of that is to bring more into common monetary issues, the amount at which you don't have to go through all those expenses and all that time and delay. The bill also tries to clarify that for a higher settlement, when court approval must be obtained, what court must approve the settlement and when a conservator is required. And finally, it addresses the issue of bonds. It does not remove the bonding requirement, but it does provide that if the only asset of the minor is the claim that's being settled, the bond does not have to be provided until the claim is settled in the amount of the claim is determined because obviously you can't get it just a general bond, you have to get a bond in a specific amount. And so that's basically the gist of the bill. Mr. Speaker, I'll yield for any questions. You do not have any questions. I'm sorry you do have a question. You're yield. I yield, yes sir. I recognize his representative, Walensky, over in 341. Thank you, Speaker. Representative, I just want to ask a personal injury, Rolfo Death Attorney. I just wanted to thank you for bringing this important bill. And I want to let you know, Representative Gunter nervously turned around and asked how many bills you filed and wanted to make sure he beats the record first. I believe Representative Gunner has nothing to be afraid of. He's besting me by several at this point. I'll pair the questions. Well, Mr. Speaker, if that's the case, since this is a bill dealing with children, I would like to leave the house with the thoughts of a great child advocate, Yogi Berra, who said, I'm not going to buy my kids an encyclopedia. Let them walk to school like I did. Thank you. Thank you. Are you in the well? Is there any objection to the previous question be ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 620. The eyes are 164. The nasor zero this bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 606. House Bill 606, by the represent of the next of the 69th and others to be tunneled act to amend Code Section 23519, the fiscal to Georgia annotated relating to definitions regarding hope scholarships and grants. So as to add the Georgia Independent School Association to the list of accrediting agencies, this bill ever referred to the Committee on Education that Committee recommends that this bill do pass. Chair recognizes Chairman Nick's to present the bill. Thank you, Mr. Speaker. We need a quick bill and hopefully this will be it. This is that simple, easy bill that we all talk about but nobody has. All this bill does is add the Georgia Independent School Association to the list of accrediting agencies. This gives them official recognition so that the students of those schools could be eligible for the hope, scholarship, the special needs scholarship and other programs that require such accreditation. Just one bit of quick history on how this came about. Last July, the Georgia Independent School Association began offering full accreditation services for their independent schools in Georgia through a partnership with a group called Cognia, which is the global accreditation leader and corporate successor to SACS and Advanced Ed. They joined with their Southeastern sister states, Florida, South Carolina, Mississippi, and Alabama in this partnership. And I did a little research because I was not familiar with Cognia but Cognia is generally considered the gold standard for regional accreditation internationally and a very high quality partner. So I would appreciate your favorable consideration for this bill, House Bill 606. Mr. Speaker, if there are no questions, I'll yield the well. There are no questions. Thank you. I'll appreciate your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair here is none. The report of the committee has agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted?\n\nhave all members voted. If so, the clerk will lock the machines on the passage of House Bill 606. The eyes are 161. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 451. House Bill 451, our representative, Lomston of the 12th and others to be entitled to an act to amend part one of Article 2 of Chapter 5 of the Title 48, the fiscal to Georgia annotated relating the property tax exemptions, so it's to provide for the optional determination by a taxpayer of the fair market value applicable to inventory. Let's bill them further the committee on ways and means that committee recommends that this bill do pass. Chair recognizes Chairman Lomston to present the bill. Speaker members of the House, I bring to you House Bill 451. This bill comes as a request from the Georgia Association of Manufacturers. It provides an optional way to determine the applicable fair market value on inventory for which a Level 1 freeport tax exemption is sought. This only applies to eligible finished goods inventory for the year 2021 and it bases the valuation on the lesser fair market value of applicable inventory as of January the 1st 2020 or January the 1st of 2021. This is a fairness measure brought about because of COVID in January and February of last year, customers placed orders with manufacturers, manufacturers produced the ordered goods, customers then cancelled or delayed the orders with when COVID hit and manufacturers now have finished goods in their inventory, which would not otherwise be there were it not for COVID after 12 months. They are subject to add the lorum taxation. This measure simply provides a one time solution to this COVID created problem. Mr. Speaker, that is a bill. I'll be glad to answer any questions if there are none. You'll be well. You have no questions. You'll be well. Thank you. Is there any objection to the previous question being ordered the chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here is none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. What purpose does representative carpenter rise. Pallermentary inquiry is it not true this this bill would help support all Georgia manufacturers that have funded the hospitality industry through this tough tough time. I believe that to be true. Have all members now voted. Have all members voted. If so the clerk will lock the machines on the passage of House bill 451 the eyes are 159 the nasa zero this bill having received the requisite constitutional majority is therefore passed. Clerk agreed to caption the House bill 601 House bill 601 by resident Stevens the 164th being taught at an act to amend. Title 16 to the fish go to Georgia annotated relating to crimes and offenses so as to provide that low T. H. C. oil marijuana does not include certain federally approved products this bill then refer to the committee on judiciary non civil that committee recommends that this bill do pass. Chair recognizes chairman Stevens to present the bill. Thank you miss speaker lays Jim of the House House bill 601 is a very simple bill probably shortest when you're going to hear today we finally have an FDA product approved for these low T. H. C. oils and it's a epidylex this only makes it very clear that it will not be considered a class one narcotic. And of course then make it have no medical uses so I would hope that you would support this for these five conditions that we've already approved and ask for your favorable consideration. You have no questions. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. Have all members voted. Have all members voted. If so the clerk will lock the machine on the passage of House bill 601 the eyes are 161 the nasors zero this bill having received the requisite constitutional majority is therefore passed House bill 328 was on the rules calendar for Wednesday it was postponed to the next legislative day and it is called at this time clerk will read the caption to House bill 328. House bill 328 by every senator mahan of the 17th and others being titled an act to amend article on chapter five of total 46. The fiscal to Georgia annotated relating telephone service general provisions so is established a one time right of way permit fee and reduce annual right of way use fees. This bill have refer to the committee on energy utilities and telecommunications that committee recommends that this bill do pass by rules committee substitute chair recognizes representative mom to hand to present the bill. Thank you miss speaker members of the House today I rise to present to you House bill 328 House bill 328 seeks to reduce the fees that back home providers pay to maintain the right of ways when they cross through municipalities. A back home provider is a utility company that provides services to telecommunications companies MC's but not to a retail end user. The current base fee that these providers pay is over 20 times average rate that other providers pay so let's be clear over 20 times the average. The hampler wire the right way this base fee that these providers are paying is slowly broadband expansion relapse it makes broadband services more expensive and the reality is is that these fees are simply passed along to our consumers and our constituents. These fees are so great just that in many locations the fees that the providers pay is actually more than the actual revenue received by the company that's right the fees that the companies pay or many times more than the actual revenue. So this bill just takes you that radius fees and it brings them from this outrageous number back in line with average. And so this bill while reducing fees and bringing these numbers back is reality does something else and that is it brings broadband to our constituents. So what does that mean? When I first ran two years ago I'd go door to door and I live in a pretty real district and I remember knocking on the door of a man who signed was at school and he told me I will pick up my sign and rep sent and if you win down there and you go to the state house. So would you help me with something? I said sure I'll help you with something. He said, he said, sir, every day I pick up my sign and we go down to the Chevron and that's what we cut down in an ordnacle of the words and it's a Chevron and a McDonald's and every day that's where he does his home one. And so folks, we have got to do something now. It's not the time to take outrageous fees on broadband when we have constituents who don't have access. We've got to do something about it and this is a measure that takes a step in the right direction. Thank you, Mr. Speaker. Thank you, member for your consideration. Mr. Speaker, I give you a question. If there are any. You do you have a question if you care to heal. How do you? Chair recognizes representative Moore up in the gallery a little to your left. Thank you, Chairman. Does the gentleman yield? I do. Thank you. Isn't it true that this is actually quite a complex bill that gave rise to very spirited discussion in the EUT committee and that although I did sponsor a minority report on this bill that subsequent to the submission of the government. I would agree with the submission of a rule substitute. I withdrew that minority report because the substitute addressed one of the biggest issues that we raised in committee regarding this bill. That is true. Thank you. Does the gentleman further yield? I do. Isn't it also true that despite the very welcomed improvements to this bill that I will still be voting no because the chairman in his infinite wisdom created a special subcommittee on right of way governance. On which I proudly serve that I believe is going to be a more appropriate vehicle to review right of way fees. If the lady so says. Thank you. You have another question or two if you care to you. I do. Chair recognizes chairman Houston to your right for a question. Chairman, isn't it true that it is very important especially in this crisis we end with covert for rural Georgia to get broadband as fast as we can. Well, that is shadow of it out from my constate. Isn't it true that even though some cities have been real real fair about it. There are others who've jacked the price up to $5,000 a mile. Well, that it down. And thank you so much for bringing this bill. Thank you. Mr. Speaker with that idea of the well. Gentlemen is yielded the well. What purpose does the minority caucus will rise? Thank you, Mr. Speaker. I like to make a motion with my report. I like to. I like to make a motion with rather minor report. Minority caucus will represent a Wilkerson has asked permission to withdraw the minority report is their objection. Is there objection chair here is not and it's withdrawn. Is there any objection to the previous question being ordered the chair here is none the previous question is ordered. The next objection to withdrawing the committee substitute the chair here is none the committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules. The chair here is none the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. the chair here is none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines. I'm sorry what purpose does representative Holland rise? Mr. Speaker pursuant to rule 133 I ask to be excused from this vote. The committee has that right and the journal will so reflect. Have all members now voted what purpose does representative Holly rise? Probably inquiry. State your inquiry. Actually no I'm sorry sir pursuant to rule 133 I ask to be excused from this vote. Gentlemen has that right and the record will so reflect. Have all members now voted if so the clerk will lock the machine on the passage of House Bill 328 the eyes are 119 the nays are 40 this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 333 House Bill 333 by represent a demonstration of 104th and others to be titled an act to amend chapter 5.0 title 21 of the fiscal to George and intended related ethics and government so as to revise the powers and duties of the Georgia government transparency and campaign finance commission this bill have referred to the committee on judiciary that committee recommends that this bill do pass by committee substitute. Chair recognizes the chairman of the House Judiciary Committee chairman F. Strachan to present the bill. Thank you Mr. Speaker ladies and gentlemen of the House I bring to you today House Bill 333 which is the ethics and government act. This legislation was brought originally to me at the request of the Georgia government transparency and campaign finance commission covering several different areas of our campaign finance act and what all maybe do is go through some of the highlights happy to answer any questions that anyone has about any the specifics but the bill covers several really important things first of all it improves transparency within our campaign finance law it specifies how long candidates must maintain records and so that would be for an office that holds a term of two years you must maintain records for three years from the date of say receipt of a campaign contribution or for an expenditure for an office of four years you must keep the records for a five year period and for an office of six years which is some of our statewide judges that would be for a period of seven years so it's clearly spelled out because there's ambiguity in the current law and uncertainty as to that it also increases or indexes any increases in the contribution limit so right now due to lack of clarity in the law actually different candidates running for the same office could potentially have a different contribution limit because they aren't indexed on a certain frequency for when those limits would be increased the bill improves oversight of the commission with passage of this legislation a staff attorney for the commission would actually be able to bring a complaint as opposed to requiring a non-staff member to bring complaint who may know less about the case and the investigation additionally it provides a specific period within which complaints may be brought again there's some confusion under existing laws to what lawyers might think of this as a statute of limitations would be for bringing a complaint and what it would be is for an office of two years it'd be within three years of the act or omission for an office with a four year term it would be within a five year period it also provides greater clarity and cleanup where needed in the code so an example of that is currently judges or members of the judicial can council automatically by virtue of their and there was a question as to whether a judge must file an affidavit as a member of that state council when the judge is already filing a similar affidavit with a supreme court and as part of his or her responsibilities already in the job so that makes clear that's not required soil and water conservation supervisors who generally do not have an elected position in some circuits they do as I understand it but they don't campaign in the traditional sense they are not to be included in these campaign finance rules and and I haven't seen any opposition to that just provides clarity and finally makes clear when a candidate may begin spending for the next cycle so if contributions are received for example for an upcoming possible runoff and then it's and then the runoff appears to be necessary the bill specifies when you can begin spending those funds that were received for the actual next cycle and so I would characterize this as very common sense legislation clear that we needed in the code just frankly due to some confusion as to how the current statute reads the commission asked for this clarity be happy to to answer any questions but I will say ensuring that there's transparency and oversight and our campaign finance law is a very important thing it helps to ensure public trust in our form of government and ensure that candidates either an incumbent or a challenger held the same standards to provide disclosures so that members of the public so that members of the media can fully evaluate candidates for public office thank you mr. Speaker I'd be happy to answer any questions do you yield for questions yes sir chair recognizes the minority caucus we up representative Wilkerson to your left for a question thank you mr. Speaker does the gentleman yield yes sir and I know we talked about some of my questions a little bit earlier but I have a question on lines 150 through one I guess 63 so we're replacing candidate or campaign committee with a person and I'm just trying to recall can a candidate if you're running for office either run as an individual or start a campaign committee and does this replace does this apply to both what section are you section eight lines 150 so we go from saying kept by the candidate or campaign committee so when we first run for office we can either establish a separate campaign committee get a chair of worsen etc or we can just run as a candidate ourselves and not set up a separate committee but then on starting the lines 155 we start talking about a person campaigning does that mean that this applies to both the person campaigning or if I create a separate committee is that the intent no it's not the intent what well the intent would be they would apply the same so if there is a committee that's been established by the candidate that that committee would have the responsibility for filing along the lines of what you're describing and I do also know later in section eight there's clarity as to referendum ballot initiatives things like that and makes it specifically clear what the reporting requirement is for those types of initiatives does the gentleman further you'll yes sir yeah I do see where you clarify the constitutional amendments but I'm still kind of confused because it talks about a person campaigning it says of the accounts for a person campaigning so I would take that not to mean the campaign committee itself but I may just need to look at that a little closer what and and forgive me I think I misunderstood your question I believe that the commission required some clarity as to that as the responsibility of the individual who is to be maintaining these records and reports and forgive me if maybe I'm not following your question but you know possibly if there's time for us to meet and for us to meet with a commission we can answer any questions you might have do you further yield yes sir chair recognizes representative jasmine tarc to your left in the gallery for a question thank you mr speaker does the gentleman yield yes ma'am can you please explain section 11 a little bit more when it comes to runoff elections there's you want to make sure that the funds or contributions from a runoff election can be used after that runoff yes that's a great question so what the law specific what this bill would specify is that campaign contributions which are which are collected within the limits first of all there's no change that you may collect prior to an advanced cycle but just that that money cannot be spent until you reach that advanced cycle and what section 11 provides is when do you reach that point and what it makes clear due to a great deal of analysis and debate that we actually had in committee about that is in your example of a runoff if it appears that you have that you are in a runoff that you've received greater than 50 percent I'm sorry that you have received the requisite number of votes to be in the runoff but there was less than 50 percent so the runoff is required you could immediately begin spending those you could be put those funds to use immediately and there's no issue as to the collection of those funds in advance and there's no issue or question if this passes as to the appropriateness to go ahead and spend those funds once you reach that cycle the point is though you have to get to that advanced cycle in order to begin spending those funds does it mean for the yield yes ma'am so just to clarify if I were to win the runoff election the remaining funds that I collected during that part of the election cycle I can can can hold on to those I don't have to return the law remains unchanged as long as there was such a runoff thank you no further questions I yield the flakes moving ahead please come to the order. I'll just Rocky leave you with the which was favorable to the passage of the bill. The chair here's none the report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye, those opposed to vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 333. The eyes are set 164, the nays or zero. This bill, having received the requisite constitutional majority, is therefore passed. The clerk will read the caption to House Bill 591. House Bill 591 by represent. Hogan 179th and others to be entitled to act to amend title 37th, fiscal to Georgia, annotated relating to mental health. So it's to authorize marriage and family therapists to perform certain acts, which physicians, psychologists and others are authorized to perform. This bill I refer to the committee on Health and Human Services that committee recommends that this bill do pass. Chair recognizes Chairman Hogan from the City of St. Simon's to present the bill. I don't know where I can present the bill now after that. Thank you, Mr. Speaker, members of the House. This bill, House Bill 591, authorizes a license, marriage and family therapist to sign 10, 13s and 2013s. January 21st, report from the Georgia Behavioral Health Reform and Innovation Commission recommended this step, as a way to increase access to scarce behavioral health professionals for people in crisis, especially in the rural areas. The Department of Behavioral Health and Developmental Disabilities, a DBHDD, the Georgia Psychiatric Physicians Association and the National Alliance for Mental Health of Georgia and NAMI, all support this legislation. House Bill 591 was thoroughly vetted in the House Health and Human Services Committee and passed out of committee unanimously. House Bill 591 adds license, marriage and family therapist to the behavioral health providers who now exercise this authority, psychiatrist, psychologist, clinical, social workers, licensed professional counselors, and clinical nurse specialists in psychiatric mental health. The requirements for marriage and family therapist are equal to those of licensed professional counselors and clinical social workers, all whom are licensed by the same board of professional counselors, social workers and marriage and family therapist. It requires a master's degree and the concerns of some married men in here, if they're in marriage counseling, they were wondering if their wives could have them committed to a psychiatric facility and the answer is no. I yield for questions. That's the bill. Gentlemen, yields for questions. Let's see. Let's go to the majority caucus who are representative Kelly to your right for a question. You might not be welcome back to St. Simon's. Forstead for me, I got people that outrank you down there that invite me. With the gentleman yield, I will yield. Isn't it true that a 10-13 is when someone has a mental condition? There is a danger to themselves or others and need to have an evaluation done by mental health professional. They are evaluated by a counselor before they get a 13-13. And will you yield for one more question? One more. And isn't true, 10-13 is also an important number because it was a year of your birth. Don't look at me. What do you want me to do? Well, I get you back on the golf course. I'll win more money off of you now. Do you further yield? I'll yield for one more. Chair recognizes representative Kirby up in the gallery for a question. To your right. Thank you, Mr. Speaker, with the gentleman yield. I yield. I heard the clerk reading the caption that this is going to allow these people to perform certain acts. None of these acts are the whoopi on camera that chair Lady Cooper had advocated for. Are they? They don't do that in marriage and family counseling. They're usually not in having whoopi for some time. Mr. Speaker, I yield a well. I think that's a good move. Is there any objection to the previous question being ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair hears none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no in the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 591. The eyes are 157. Given the nasa 3, this bill having received the requisite constitutional majority is there.\n\nfour pass clerk agreed the caption to House Bill 554 House Bill 554 by the governor of the eighth and others to be entitled next to men article nine and chapter 14 and top of 44 the fish go to George annotated relating to Liz pendants. So it's revised when an action may operate as a Liz pendants. Mr. Bill and refer to the committee on judiciary that committee recommends that this bill do pass. Once again the chair recognizes representative Gunter to present the bill. Thank you Mr. Speaker. Ladies and gentlemen in each of the 159 counties of this state there is a clerk of the spirit court and in that clerk's office is what we call a Liz pendants document or docket. That is a docket that the clerk keeps that when a lawsuit is filed that involves the interest of a property or the title to property it puts notice to the world that there is that lawsuit. That lawsuit acts pretty much like a lean against the property and most if there is such a thing on the property and you have a sale set up it usually brings that sale to an end. This process can be abused and this bill is to take care of that. In this bill the first part of it is that it exempts any lawsuits involving Title 19 which is our domestic relations so divorce cases would still be handled the same way as to a Liz pendants notice. But what happens is if you file a claim against property outside of Title 19 then your asking what this does is it sets up the court to oversee that process. So when you file your claim you don't necessarily have to make your motion at that time but at some point in the litigation when you make a motion for a Liz pendants the court will hear it whereas under current law you just file your Liz pendants. Once the hearing takes place the judge will decide whether the Liz pendants is valid or not and if so he puts it on if not he declines it. If he does put it on and later it becomes clear that it's not appropriate on the court's own motion or on the motion of another party they can take that off. So basically this is just to structure the Liz pendants document so that it's not abused and I'll take any questions at this time. You have a question if you're here to yield. Chair recognizes Chairman Dubenick to your left for a question. Thank you Mr. Speaker. Mr. Gentlemen you'll I yield. Representative is is it not true that by profession you may have been a lawyer in the past that's true yes I won't hold that against you is it not further true that there was a distinguished member of this body named Tom McCall who served for nearly three decades that's true isn't it true that the best line he ever used was to ask you to further explain the bill in a non-law your version okay can you give this body a two Senate's explanation of what you're doing here maybe there is no maybe button on our on our desk I would remind the representative of that is there a limit as to how long the Senate's can be oh Lord go ahead if you file a frivolous notice the court can take it off that's basically it thank you all right those 20 questions that you had went away thank you I yield the well is there any objection to the previous question being ordered the Chair hears and on the previous question is ordered is there any objection to adopting the committee substitute the chair hears now in the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favourable the passage of the bill the chair hears and the report of the committee has agreed to shall this bill now pass all those in favour of the passage of the Bill Vodai, those opposed to Vodno and the clerk will unlock the machines. What purpose does the representative Moore rise? Speaker, I'd like to excuse myself pursuing to rule 133. Lady has that right and the journal will so reflect. Have all members now voted? Have all members voted? So the clerk will lock the machine on the passage of House Bill 554. The eyes are 159. The nasors zero this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 577. House Bill 577 by Representative Carpenter IV being titled an act to amend title 32 and code section 46181 of the fiscal and Georgia annotated relating highways, bridges and ferries and maximum speed limits respectively. So it's to provide for a proposal guarantee for bids upon certain projects. This bill will have been referred to the committee on transportation that committee recommends that this bill do pass. Chair recognizes Representative Carpenter to present the bill. Thank you so much, Madame Speaker. I guess at this point or protein, I guess is how I address you. The triple bill, this is a G dot bill 577. It does basically three things. It clarifies when advertising, G dot only has to list a guarantee if there is in fact the bid requires a guarantee to it addresses the how the G dot addresses public airports that are not following the rules. And then three says that if there is not a speed limit sign in an urban area that is in fact 30 miles an hour, urban residential area, this is the standard practice and simply just clears up some language in the code. The gentleman has no questions. You'll the will. And the gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is none the report of the committee has agreed to. How this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so the clerk will lock the machine on the passage of the bill. The yeas were 160. The nays were zero and the bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 450. House Bill 450 by the rep. Newt, 123rd and others to be entitled to amend code section 31 to a 18. The fish go to Georgia annotator relating to the low THC oil patient registry. So it's authorized the Department of Public Health to release the IFD identified data to government entities and other entities for research and other purposes. This bill I refer to the committee on health and human services. That committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Newton to present the bill. Thank you Madam Proton. Department of Public Health has done some tremendous work this past year. They've been incredibly busy. The DPH is also the State Department where the PDMP, the control substance registry is maintained. And that program was established, included was a careful allowance for limited, de-identified data release for researchers. That for example would help into research in reducing opioid addiction or opioid misuse. Well, similar to that database also maintained that DPH is Georgia's medical cannabis registry. That's what's addressed in this bill. HB450 will match in this registry the language of the existing PDMP research related data release. Same de-identified, privacy protected language. There are many devastating illnesses and conditions are approved for medical cannabis use in Georgia. This bill will help researchers who are working to improve the lives of those Georgians have access to the information and data that can make a scientific difference. I'd appreciate your support. There are no questions. The gentleman has yielded the well. Is there an objection to the previous question being ordered? The Chair, here's none. The previous question is ordered. Is there an objection to adopting the Committee's substitute? Chair, here's none. The Committee's substitute is adopted. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair, here's none. The report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The a's were 153 and a's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 92. House Bill 92 by the way, I'm going to be able to move 15th and others to be entitled and act to amend code section 3110, 25th, the fiscal to Georgia and state of relaying the disclosure of information contained in bottle records and transfer of records to state archives. This bill emphere the Committee on Government Affairs. That committee recommends that this bill do pass. The Chair recognizes representative gambled to present the bill. Thank you Madam Speaker. Members of the House, I rise today in ask for your favourable consideration of House Bill 92, which basically will transfer the bottle records to the state archives for birth certificates. It will change the specified year to 100 years and 75 years for death certificates. This was something that changed last year in a code cleanup bill and we heard from our constituents that are very involved in genealogy. Those that are involved with repatriation when soldiers remains come back and they are trying to find the next of kin. And so if we support this bill today, we will give our constituents the better access to these bottle records that they seek for the various research that they do. This is that Madam Speaker, that's the bill and I would be happy to entertain any questions if there are any. There are no questions. Thank you. I yield the well and ask for your favourable consideration. The gentleman has yielded the well. There's any objection to the previous question being ordered. The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favourable to the passage of the bill? The Chair here is none. The report of the Committee has agreed to show this bill now pass. All in favour of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If all members vote, if so, the clerk will lock the machine. On the passage of the bill, the A's are 156. The A's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 316. House Bill 316 by the Reps. I'm Stephen's 164th to be entitled back to a men code section 264-82. The official code of Georgia annotated relating to duties requiring professional judgment and responsibility of a licensed pharmacist, so to increase the pharmacist to pharmacy technician ratio for providing direct supervision at any time. This bill then refer to the Committee on Health and Human Services. That committee recommends that this bill do pass. The Chair recognizes Chairman Stevens to present the bill. Thank you, Madam Speaker. I'll present to you today House Bill 316 in an effort to get us out before 5 o'clock. This short little bill does nothing more than increase the pharmacist ratio from 3 to now 4. One of them is certified. It will go to 2 certified. I know there's no questions because we all want to leave, so I'll yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is now in the previous question is ordered. Is there any objection to agreeing to the report of the Committee which was favorable to the passage of the bill? The Chair here is now in the report of the Committee. Has agreed to shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. All members voted. Have all members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas were 159. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 369. House Bill 369 will represent the policy of 30 seconds and others to be entitled back to a men's chapter 34, title 43, the official go to Georgia annotated related to positions, assistance, and others. So it's required that job descriptions entered into between positions and position, assistance are not required to be submitted or approved. While the Georgia Composite Medical Board, this bill will have referred to the Committee on regulated industries. The Committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Powell to present the bill. Thank you, Madam Chairmen and ladies and gentlemen, the House of Rangdee of the day. House Bill 369. Last year we made some advances in some of our health care delivery systems when we dealt with APRNs and PAs working under the protocol of docs. This year we're bringing to you another little issue that's putting us in line with most of the other states in the country, and especially those in the southern states that surround us by allowing APRNs and PAs that work under the protocol of the doctor to allow them to subscribe scheduled two drugs up to a five day supply. We have the consideration that they work under that protocol and that they immediately report or as soon as possible later than 72 hours to that doctor what they have prescribed and who and is kept in the charts. Very tightly drawn and it puts these skilled PAs and APRNs in line to that. So this would allow them to do these simple handicap placards ladies and gentlemen highly endorsed and I'd be remiss if I didn't thank Dr. Newton and Dr. Jasper's for their assistance because they actually they actually were the ones that helped while I was in broad and some other things to work out the final details. So that being said to be glad to answer questions that would commend this to your favorable consideration. Gentlemen does have questions. Yes ma'am. The chair recognizes representative Reeves for a question. No doubt. Thank you Madam Speaker does gentleman yield certainly well. Chair Rapal isn't it true that my wife is a physician assistant and that she's the legislative director for the PAs Association of Georgia. And I understand probably the highest breadwinner in the family. I'm gonna get to that in a second but um is it a true Chair Rapal that she has worked for five years on this issue. If the gentleman says she has and he should know because it's an awful good proposition. If finally there's been a lot of talk of a whoopie in here today. Is it not true that I need this to pass. You do know who you're asking Madam. I don't know if I need to answer. Chair recognizes representative Clark at the 108th in the gallery. Thank you Madam Speaker does the gentleman yield. Yes ma'am. So in this bill the physician has the ability to write the nurses agreement. The agreement between the physician and the nurses of the APRNs. That is still so I guess what I'm trying to say is the physician still has the authority. Yeah my apologies. The physician has the authority to make an agreement with the nurses when it comes to the scheduling of or prescribing schedule to drugs. He can or that physician can or can't whatever you think he can. If he has enough confidence in that PA or that APRN then he can issue that protocol agreement to that respective professional. Thank you very much. I apologize my life in the level. There's a lot of things in life to apologize for. I'm mad but that ain't one of them. The chair recognizes Chairman Martin to your left for a question. Yes ma'am. Chairman Powell the friendly question. Isn't it true that this something you've worked on for a number of years and this will allow Georgians access to quality care from these dedicated professionals as you just stated with the agreement of the position under which they would work. Isn't that true? Gentlemen says he knows from where he speaks and in that true they should drive down the cost health care in the state of Georgia. Well let's hope it will or at least ways it will provide a little bit broader health care for folks or in time of an emergency need. Chair recognizes Representative Wilkerson for a question. Thank you Madam Speaker. Can you address the concerns that we've heard regarding this increase of expropriating opioids and what that might do by expanding who can give out these medicines? Well I can't address that. I know this is pretty narrowly drafted that that PA and that APRN works under that protocol and the doctor sets a protocol and it also says that that APRN or PA will report any prescriptions about to the five day prescription as soon as possible but no later than 72 hours. If they don't want to take the opioids you need to call Michael Grabley and he'll probably get them something natural. There are no more questions. Madam Chair I would certainly appreciate the support of the members of this legislature for our for our absolutely skilled nurses and APRNs and the PA's that work under this protocol and to work with their member doctors as they work as a team to help the people of Georgia. I agree. Chair recognizes Chairman Nex to speak to the bill. Thank you Madam Speaker. I'll be real brief. I just want to thank Chairman Powell for continuing the champion the cause of these medical professionals. I think the one statement out of the AARP recommendation for this bill kind of says it all says in Georgia APRNs that's our practice our nurse practitioners and PA's are often the backbone of the health care system and rule and medically underserved communities. So we need to be giving these people the opportunity to practice at the at the height of their qualifications. They're critically important members of our health care team and as we continue to we need to continue to expand their ability to practice even with this I will say Georgia is still significantly behind other states and what we allow these folks to do. So HB369 is another important step in moving these people towards being able to practice that their full capacity and it's good for Georgia in so many different ways and I certainly hope you will support this bill. It's a great bill 369 thank you. Generalman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is none the report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so the clerk will lock the machine on the passage of the bill the yeas were 143 the nays were 12 the bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 364. House Bill 364 by motion of columns the 68th and others to be entitled next to men code section 43 387 the fish go to Georgia annotated relating a licensing of armed employees of private detective and private security businesses qualifications continuing the education fingerprints license card and suspension this bill have referred the committee on regulated industries that committee recommends this bill do pass like committee substitute. The chair recognizes the chair of the public safety and homeland security committee chairman collins to present the bill. Thank you mr. Speaker I bring before you today House Bill 364 it's a very simple bill what it does is exempt post certified officers from having to provide fingerprints to the secretary of state's office to become security guards currently right now if you're a post certified individual you are vetted by post counsel and you already have fingerprints it also what it does is it allows those officers who want to work or post certified individuals who want to work for a security company they can go ahead and go to work for that security company and then have 60 days up to 60 days to apply for their license to the secretary of state's office to be a private security guard that's basically all the bill does mr. Speaker I'll be glad to yield be glad to take any questions or I'll yield the well if there are no questions. You have no questions be glad to yield the well thank you. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agree to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machine on the passage of house bill 364 the eyes are 147 the nays are six this bill having received the requisite constitutional majority is therefore passed the clerk will read the caption to house bill 302 House bill 302 by Representative Mountahan of the 17th and others to be entitled back to amend article 1 of chapter 13 of top 48 the official go to George antenna relating the general provisions regarding specific business and occupation taxes so as to require that the proceeds of a local government regulatory fees be used to pay for regulatory activity this bill have referred to the committee on ways and means that committee recommends that this bill do pass by committee substitute chair recognizes representative mom to hand to present the bill make your miss speaker members and of a house day I rise to present to you house bill 302 I'll be brief by our slate half bill three of two does only three veins it provides that one regulatory fees can only be used for the regulatory activity like an inspection but the fees cannot be used to raise revenue for the general fund number two local jurisdictions cannot base a regulatory fee on the cost of a construction job it must be based on what it actually costs to do the job and it clears up a conflict in state now about how businesses and certain industries are charged a regulatory fee I want to emphasize that this does not eliminate those fees they are merely charged in another for the code section so mr. speaker that concludes my presentation and I stand for any questions you have no questions thank you ask for your favor consideration and I give the way up is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of house bill 302 will vote aye those opposed will vote no and the clerk will unlock the machines what purpose does the representative carpenter rise parliamentary inquiry is it not true\n\nthis bill would allow building permits to be reasonable so we would promote affordable housing throughout the state of Georgia. I know the gentleman knows where office speaks. Have all members voted? Have all members voted if so the clerk will lock the machines. Hold the passage of House Bill 302. The eyes are 91. The nays are 65. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 44. That was carried over from a previous legislative day. House Bill 44 by Representative Cantrell of the 22nd and others to be entitled to amend Chapter 1 and Title 50, the fiscal to Georgia annotated, relating to general provisions relative to state government. So to provide that this state shows their daylight savings time year round. This bill I refer to the Committee on State Properties and Community Affairs. That committee recommends that this bill do pass. House will be at order. House will come to order. It is about time to recognize Representative Cantrell on House Bill 44. Thank you Mr. Speaker. It is about time for House Bill 44 colleagues. Next weekend almost all Americans will experience something that is almost universally despised. That is time change. We came up with a very nice word for it or description of it for next weekend. It will be springing forward to make it sound a lot nicer than it is. When I got elected seven years ago this is one of the things that people talked to me about all the time. Basically I ignored them for four or five years. But then last year I began to really research this topic. I kind of viewed it as just a minor annoyance or an inconvenience that we had to go through a couple of times a year. But as I began to research this topic I found out that there were some really serious health and safety reasons for eliminating time change. The vast majority of people hate time change. I have done a lot of polling of this and every time you poll time change it is about 90% of people want to see us get rid of it. There are several good reasons why we should do this. Time change disrupts the natural order of things. Our bodies are designed to adjust slowly to the changing amount of daylight as the earth rotates. This is God's design. We have introduced a man-made sudden change that has a lot of impact that I hadn't thought about before. Let me just a few of them for you. University of Colorado researchers found a 6% increase in fatal accidents the week after spring forward. Contrast that with the University of Michigan that revealed a spike in pedestrians being hit by cars the week after fall back because the week before drivers were accustomed to driving home in the daylight and suddenly they were driving home in the dark. Red patterns are disrupted. The switching back and forth wrecks havoc on our sleep patterns. Educators complain to me all the time about their students taking up to two weeks to recover every time the time changes in either directions. Heart attacks go up 24% the week after spring forward. Medical errors spike after spring forward. Falling back brings an increase in depression. Where place injuries go up and workplace productivity goes down. And by the way the worst day to go to court is the Monday after spring forward. Research shows that judges hand out the harshest penalties, the harshest sentences on the Monday after spring forward. The evidence is clear. We need to get rid of time change. When you ask people which would you prefer permanent standard time or permanent daylight savings time and consistently the response is that 70% of people prefer permanent daylight saving time over permanent standard time. This is my preference as well. Here's a few reasons for that. More sunlight in the evening. This is good for our health. People prefer to exercise and recreate in the daylight. People show that people burn more calories during permanent daylight saving time. It's good for the economy. People prefer to shop in the daylight. Fewer car accidents. Did you know that most car accidents occur between 6 and 9 pm. One more hour of daylight would mitigate this. Less crime. A lot of juvenile offenders prefer to commit their crimes right after sunset. Energy savings. This was the original purpose of daylight saving time and energy savings are small but 3 to 4% and that was the original purpose. Also colleagues, we're already in daylight saving time almost 8 months out of the year. So it would be an easier adjustment to go to 12 months of daylight saving time than it would be 12 months of standard time. Daylight savings times aids in the fight against childhood obesity. It lessens pollution when the evening commute is in daylight. But the number one reason why you should prefer daylight savings time is because the Senate has passed a bill to take us to permanent standard time. Now we know that they are the dark side and this is just further evidence that they prefer the dark and we prefer the light. Can I get a witness? Some of you have gotten emails in recent days and you're confusing it with my bill because people are mad about the Senate bill. They don't want to go to permanent standard time. They want to go to permanent daylight saving time. So be sure you understood those emails correctly. There's a lot of confusion about this issue. Let me clear that up for you real quickly and I will yield the well. There is one big objection to daylight saving time permanently that I hear all the time. That is concern for children standing at the bus stop in the dark. You heard this? Now there's a bus stop right in front of my house and the elementary kids are picked up at 6.55 a.m. We are currently in standard time. But guess what? It's dark at 6.55 already. I've done some research. There's been a lot of research done into this topic and there's no evidence that children health or safety is compromised in any way by being dark early in the morning. The other thing is that if it is, if it were so dangerous, the schools could adjust accordingly and put their bell schedule a little bit later if that's a genuine concern. Now a lot of people ask, well what if we do this? Is this going to make us different from all the states around us? What you got to understand is that Florida, South Carolina, Tennessee, Arkansas and Louisiana have already passed similar legislation so that if and when this happens, basically entire southeast will move to it in lockstep together. The two odd states out right now will be Alabama and Mississippi and there's nothing new about that. So to be clear, we can only move today like saving time permanently with congressional approval. I would commend it to you. If we pass this bill and it's signed by the governor, I will vigorously pursue congressional authorization. I've already reached out to Senator Warnox office about this. I talked to Senator Congressman Bishop about this to try to get to Georgia, Congress people to introduce legislation to give the states the right to choose day light saving time permanently if they so choose. So with that, Mr. Speaker, I ask for your favorable consideration and I'll be happy to yield for any questions. You yield for questions? Yes, sir. Chair recognizes Chairman Dollar to your left for a wave. Chair recognizes Chairman Barr to your left for a question. Mr. Chairman, Neil. Yes, sir. Is it true that I do not rise to make light of this bill? Is it further true that I have received over 40 organic emails from mostly moms in my district who are very excited about this bill and only one opposed? If the gentleman says so. Thank you, sir. I appreciate this bill. With that, Mr. Speaker, I'll yield the way. I had a question. Oh, sure. Well, in that case, I won't. Do you mind? Absolutely. I'll answer your question, Mr. Speaker. Thank you. Is it not true that one of the greatest chairs in this body in this century was former Chair Tom McCall? That is absolutely correct. And is it not true that he now is the president of the Georgia Farm Bureau? That's correct. And is it not true that when the Senate took their action, yes, Wednesday, that he was most upset on behalf of Georgia Farm Bureau? That's correct, sir. Just making sure I got all that right. Chairman McCall was one of the biggest advocates of this bill last session. He was one of the co-signers. And he said he didn't care if it stayed light till midnight. He would be in the field. That's correct. With that, Mr. Speaker, I'll yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative McLaren rise? Parliamentary inquiry. Thank you, inquiry. Mr. Speaker, speaking of the dark side, is it not true that I've got on Darth Vader's socks today? Well, if you want me to be honest, I did not look at your socks when you were up here. Well, Mr. Speaker, one last parliamentary inquiry. Is it not true that the reason many of us are going to vote with, unfortunately, the Senate on this issue is because circadian rhythm scientists have indicated that getting light in the morning is important and that that can help overall with health and that Russia, not maybe not the best example, but the United States also have tried permanent DST before and it has led to such an unpopularity and backlash that they switched back to standard time. If the gentleman so states, I'm sure he believes that to be true. But I like to listen to authorities like Tom McCall. What purpose does representative Holly rise? Father, many of you inquiry. State your inquiry. Sir, is it not true that if this bill were around back in 1985, Marty McFly wouldn't have to take us to the lower room back in time to change the clock tower? If the gentleman so states, what purpose does representative Thomas rise, brand Thomas? Parliamentary inquiry. State your inquiry. Is it not true that I'm in the process of trying to get my son off training wheels right now? If you say, if the gentleman so states, I know that one more inquiry. Please. Would this not give me an extra hour in the evenings to be able to help my son get office training wheels? Or to do anything else that you wanted to do in the daylight. One final parliamentary inquiry. Chair recognizes Chairman Martin for a parliamentary inquiry. Yes, our parliamentary inquiry. Mr. Speaker, isn't it true if this passes and the Congress approves it and we go to permanent daylight savings time, we'd be sprung forward permanently and it'd be an hour later and we'd be gone for the day. Well, I'm about to take care of that. Yes. Okay, if all members voted, if so, the clerk will lock the machine on the passage of House Bill 44. The eyes are 112. The nays are 48. This bill haven't received the requisite constitutional majority is therefore passed. What purpose representative can trail rise? To make a motion. State your motion. I'd like to move that HB60 be recommitted to the Rules Committee. The clerk will read the caption. HB60 by reps in a can trail of the 22nd of the Italian Act to amend Title 20 to go to George Anand, it's a relating education system, it's just a provide for the establishment of educational scholarship accounts. On the gentleman's motion, that House Bill 60 be recommitted to the Rules Committee, is there objection? Is there objection that chair here is none and it is so ordered? What purpose does representative Anderson rise? To make a motion. State your motion. Mr. Speaker, I'd like to make a motion that House Bill 435 be recommitted to the Rules Committee. Clerk will read the caption. House Bill 435 by reps in a Anderson of the 10th to be entitled to amend Article 2 of Chapter 91 and Title 36 of the fiscal to George Anand, it's a relating to contracting and bidding requirements for public works. On the gentleman's motion, that House Bill 435 be recommitted to the Rules Committee, is there objection? Is there objection that chair here is none and it is so ordered? What purpose does chairman Petrie rise? Commotion. State your motion. I move that we move SB215 from the Health and Human Services Committee to the Human Relations and Aging Committee. Both chairs agree. Both chairs are supportive, Mr. Speaker. Clerk will read the caption. Senate Bill 215 by Senator Walker, the 20th, Burke of the 11th and others to be entitled to amend Article 1 of Chapter 7 of Title 31. You fiscal to George Anand, it's a relating to regulation of hospitals and related institutions. On the gentleman's motion, that Senate Bill 215 be transferred from the Health and Human Services Committee to the Human Relations and Aging Committee, is there objection? Is there objection? Chair here is none and it is so ordered. What purpose does chairman Stephen's rise? To make a motion. State your motion. I'd like to move House Bill 469 back to the Rules Committee. Clerk will read the caption. House Bill 469 by Senator Stephen's 164th and others to be entitled to amend Article 2 Chapter 7 of Title 48. If it's possible to George Anand, it's related to the imposition rate and computation and exemptions from state income taxes. On the gentleman's motion, that House Bill 469 be recommitted to the Rules Committee, is there objection? Is there objection? Chair here is none and it is so ordered. We do not have any announcements. If you have one, you might wish to check in with a messenger like a half a second ago. I do have a couple of birthdays to ask you to join me in celebrating on Sunday. It will be the birthday of the Distinguished Chair of the Mar-Toc Committee, Chairman Mary Margaret Oliver. On Sunday it will be the birthday of Representative David Jenkins. Chair recognizes. Chair recognizes the Chairman of the House Appropriations Committee for a motion. Mr. Speaker, I move that this House stand adjourned until 10 a.m. Monday, March 8, 2021. The gentleman has moved that this House be adjourned until Monday, March 8 at 10 a.m. The Chair wants to wish everyone a happy weekend, relax and enjoy the weather and we'll start back Monday. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House is adjourned until Monday, March 8 at 10 a.m. The House is adjourned until Monday, March 8 at 10 a.m.",
  "updated_at": "2026-02-13T10:58:00.057146+00:00"
}