{
  "video_id": "-rYWki7Yws4",
  "url": "https://youtu.be/-rYWki7Yws4",
  "title": "Georgia House - Day 21 (2026-02-23)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 21,
  "video_date": "2026-02-23",
  "duration_minutes": 104,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 21 (2026-02-23) session:\n\n## Overview\nThis session featured a prayer and remarks by Rabbi Peter S. Berg, focusing on the importance of dialogue, unity, and addressing divisiveness in society. No substantive legislation was discussed.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Zoolmolo Pez introduced Rabbi Peter S. Berg, highlighting his background and commitment to community leadership on issues of social justice and civil rights.\n- Rabbi Berg delivered a prayer and remarks emphasizing the need for mutual respect, dialogue, and working together across religious and political divides to address the challenges facing the state and nation.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe session began with a roll call, with all members present and voting to signify their attendance.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "you you you joining the of my Radio We are about to have the morning roll called. We are about to have the morning roll called. All right, we're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. I need someone to vote present for representative Lopez. I have all members voted. All members vote. All right, you can come down here and check with the clerk's office. The clerk will lock the machines. The doorkeepers will please close the doors and keep them closed. Good morning. Beautiful day out there today. And we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 86th House District Representative Zoolmolo Pez. Representative Lopez. Thank you, Mr. Speaker. Dear colleagues, my name is Zoolmolo Pez and I am the newly elected representative for House District 86 in the Cap County. If you hear a very thick southern accent, that is because I'm originally from Puerto Rico. The idea that those who do not sound like us or look like us are here to take things from us or here to hurt us cannot be more sovereign today, the one-year anniversary of the murder of Amad Arbery. We are wearing this ribbon in remembrance of that senseless murder. Although I was not raised Jewish, my husband is Jewish and we have been members of the temple since 2009. The temple is at Lantas oldest and most diverse synagogue. Some of you may know that it was bombed in 1958 in an act of anti-Semitism or that our former rabbi rabbi was child, Marshwe Doctor Martin Luther King. Our current rabbi here today is rabbi Peter S. Berg. Rabbi Berg has been our senior rabbi since 2008 and you can read his impressive resume and accolades online. But I want to highlight the fact that rabbi Berg serves in numerous communal and advisory boards, was inducted into the College of Preachers at Morehouse College in 2009 and most recently was named one of the top 50 rabbi's in the United States. But what I'm most proud is rabbi Berg's unwavering commitment to serve as both a spiritual and community leader on issues regarding the environment, social justice and civil rights. Please help me welcome my rabbi, rabbi Peter S. Berg. Good morning. Speaker Austin, distinguished members of this house, representatives Oma Lopez for your warm and generous invitation to be here today in your gracious introduction. We are blessed by your leadership in this house. I'm pleased to be here today as the rabbi of the temple, Georgia's largest and Atlanta's oldest synagogue. This has been a most challenging year. Any of us can remember. With the wind of anti-Semitism blowing through our society at an all time high. With the raging fire of the worst global pandemic we have seen in our lifetime. And the earthquake of unresolved racial issues shaking all around us. We are divided and fractured as a state and as a nation. Now more than ever we need to stand together with each other in order to stop division and the spread of hatred in our world. All forms of xenophobia and hatred. And after all brothers and sisters we may have different religions and political ideologies. But we share similar hopes for our state which call for justice and compassion and peace. This world is a diverse place and the lessons of both religion and politics must be articulated in a way that are acceptable to a diverse population. Because it is possible, it is very possible that God could speak Arabic on Fridays, Hebrew on Saturdays and Latin on Sundays. And I'd like to suggest that we see the differences among people as nothing short of a miracle of creation. The only way to truly respect and love one another is to recognize the uniqueness of each and every human being. The world is a better place because of our differences. Positive energy comes from the members of our community who sometimes disagree yet still love and still respect each other. And because we are privileged to live in this American democracy and the extraordinary state of Georgia which is dependent upon strong communities of faith and a representative government, we must learn how to speak to each other. All world religions pray for peace. All government entities strive for justice. Yet we know that fervor produces the worst in zealotry and in violence. How could we channel the passion and persistence that religious faith and government can summon? How can we utilize the ability of religion and government to contextualize the big issues in the most universal of terms? This is the great task that faces us this year to engage in dialogue without unleashing intolerance and self-righteousness. The challenge of American democracy is to fashion a way that incompatible faith and political assertions can actually still speak to each other and still learn from each other. We don't have to ignore our differences to live together. And when we speak to our neighbors of other faiths and other political ideologies, what is needed most is not authority but reasoning. A dialogue that focuses not on quotations but on common ground. Founded on a deeply religious principle, our country, our state is an experiment in progress. And the hypothesis that we test is that a diverse population can come together in a shared passion for liberty and a celebration of our differences to accomplish great things. But religion and government, they can both continue to play an essential role. And it's the logical grounding for our democracy that we can learn to speak to each other in ways that we can hear in words that allow for learning and growth and even disagreement. This task in no small part is the last and the greatest hope in our humanity. Seated together as our ancestors did before us, we know that we face an uncertain future. We are unsure of what challenge lies over the next hill and the next mountain. But I would like to think that like them, we don't face that steep climb into despair, resigned to a terrible fate, nor with blind certainty. Rather, we are here because we face that mountain over which lies the work that we do together with hope renewed, resolved to draw upon our faith in God and humanity to create a Georgia that is filled with peace, and joy, and wisdom. Friends, let us stand together now in prayer. Eternal God, you anobal our lives by empowering us to do your work here on earth in creating a world of justice and peace for all. May your name be invoked only to inspire and to unify our state, but never to divide it. We ask your blessings upon the leaders of our nation and these leaders of the state of Georgia. May our honorable elected representatives lead wisely and with civility working together for our common good. Guide them that they may ever be champions of justice. These things we ask in your name, O God, until the radiance of peace and righteousness for all of God's children shines to the ends of the earth. And along the way, if we are weary, give us strength. If we are discouraged, give us hope. If we have forgotten how to make a difference, remind us. If we have been careless of time, forgive us. And if our hearts have been chilled by indifference, warm them. May we together be inspired not only by the acts of the women and men who have preceded us, but by the God of the universe who wants us to live in peace. Amen. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Doorkeepers will unlock the doors. The chair recognizes, the chair recognizes chairman Hogan, the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and founded to be correct. A mistake that makes you humble is much better than an achievement that makes you arrogant. This is from Representative John Corbyt. I didn't realize he was a philosopher. Is there any objection to the confirmation of the journal that chair hears none and the journal is confirmed? The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on the 59th, moves the following we establish the order of business, starting the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading of passage, Joe, a bunk contested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day, the chair hears none and the resolution is adopted, first reading of bills and resolutions, the clerk will read. Agri Culture and Consumer Affairs Special Committee on Access to the Civil Justice System The Intergovernmental Coordination Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor Industry and Labor\n\nThe 85th Oliver, the 82nd Buckner, the 137th Bill relating to professions and businesses, House Bill 570. By rep's and kneel, the 74th Jackson of the 128th Lopez of the 86th Lime of the 99th. A bill relating to the Georgia Public Safety Training Center, House Bill 571, by rep's and kneel of the 74th. Jackson of the 128th Lopez of the 86th Lime of the 99th Bill relating to employment training and peace officers. House Bill 572, by rep's and McClaurne of the 51st, Dunter of the 8th Oliver, the 82nd Boat, the 62nd Wollinsky of the 79th, another bill relating to conduct of proceedings and criminal trials. House Bill 573, by rep's and single ten of the 71st Collins of the 68th, howell of the 32nd, Jasper of the 11th Lop of the 122nd, another bill relating to county boards of tax assessors. House Resolution 182, by rep's and Gailier of the 160th seconds, Stevens of the 164th Williams of the 168th, Petrie of the 166th Resolution, encouraging the state of Georgia to establish a Georgia, Gulley, Gigi, Heritage, Society, Resolution 183, by rep's and Knight of the 130th Registration of the 120th, 100th, 175th, Dunnerhood, the 30th Corb of the 174th Resolution, urging the United States Congress to pass the Recovering America's Wildlife Act. House Resolution 184, by rep's and Stevens of the 164th Resolution, proposing amendment to the Constitution, so as to authorize the General Assembly to provide that law for a paring mutual abetting on horse racing, House Resolution 185, by rep's and Ross of the 7th, Watson of the 170th seconds, Jackson of the 11th England of the 116th, Dickey of the 140th, another resolution reauthorizing the House of Rural Development, Council of House Resolution 186, by rep's and about 137th Frazier of the 126th, Wilson of the 80th, Null of the 42nd, Oliver of the 82nd, others, Resolution creating the Joint Medicaid Sustainability Study Committee, House Resolution 187, by rep's and Beverly of the 143rd Bill, just under the 38th, Mitchell of the 88th, Robbash of the 48th, Bayes of the 163rd, another resolution urging the expansion of Medicaid, House Resolution 188, by rep's and Scottfield of the 68th, Beverly of the 143rd, Mitchell of the 88th, Hutchinson of the 107th Spire of the 135th, Resolution supporting the creation of a state work group to increase chronic disease information and screenings and communities of color, House Resolution 201, by rep's and heel of the 74th, though, as of the 86th, Jackson, the 128th, limit of the 99th Resolution, promoting and encouraging local law enforcement agencies to incorporate mental health operatives into their agencies, Senate Bill 46 by Senator Mark of the 11th Watson of the 1st patch of the 50th Miller of the 49th Kirkpatrick of the 32nd and others, a bill relating to health. 30th Second Readers. Reports of Standing Committees, the clerk will read. Representative Stevens of the 164th District Chairman of the Committee on Economic Development, Tourism submitted the following report. The Speaker Committee on Economic Development, Tourism, is on the consideration following Bill of the House and is instructed to report the same backthouse, following recommendations, House Bill 8060 passed by committee substitute, respectfully submitted, Representative Stevens of the 164th District, Chairman. Representative Jan Tankersley, the 160th District Chairman of the Committee on Intergovernmental Coordination Local, submitted the following report, may speak to your committee on Intergovernmental Coordination Local, is that on the consideration following Bill of the House? Is instructed to meet your report the same backthouse, following recommendations, House Bill 223, New Pass, House Bill 396, New Pass, House Bill 456, New Pass, House Bill 490, New Pass, respectfully submitted, Representative Tankersley, the 160th District Chairman. Representative J. Collins, the 68th District Chairman of the Committee on Public Safety and Homeland Security, submitted the following report, may speak to your committee on Public Safety and Homeland Security, is that on the consideration following Bill of the House? Is instructed to meet your report the same backthouse, following recommendations, House Bill 347, New Pass, House Bill 275, New Pass by committee substitute, respectfully submitted, Representative J. Collins, the 68th District Chairman. That completes the reading of the report's standing committees. We are going on now to the local calendar, third reading and passage of uncontested local bills. Before we go on to the local calendar, I have an announcement to make. Listen up. If you have lost a phone in the ladies' restroom, it is up here at the podium. I did not find it, but Betsy has the phone if you've lost one in there. I don't think so. Good try. All right, third reading and passage of uncontested local bills. If there is no objection, we will vote in the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. The clerk will read the local calendar. House Bill 223 by resident of Benton, the 31st Jackson County. House Bill 396 by resident of Green, the 151st South Georgia Regional Information Technology Authority. House Bill 456 by resident of Smith of the 18th Carroll County. House Bill 490 by resident of Hill, the 3rd, Coutusa County. Is there any objection to the previous question being ordered on the local calendar? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair hears none. The report of the committee has agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the local calendar. The eyes are 134. The nays are 10. These bills having received the requisite constitutional majority are therefore passed. All right, we're going on to morning orders now. We are going on to morning orders. If you have signed up for a morning order, be prepared to be recognized by the chair. Chair recognizes for a morning order, Chairman Hawkins, Chairman Barr, Chairman Dubnik, and Representative Dunahue. One minute each of morning orders today, gentlemen and mapror seat. Thank you, Mr. Speaker. Last night, the state of Georgia lost a giant, as big Jim Walters went to be with his Lord and Savior. Big Jim had a big heart and gave to many. His name graces many buildings, such as the YMCA, the near technical college, northeast Georgia, just to name a few. Jim was a pioneer in the Georgia Industrial Loan Association. While owning many businesses throughout the country, he always took time to lend an ear and give advice to young and old. He served under many governors and even a couple of presidents. I will always remember his words only in America what a great country this is. Chair recognizes Chairman Belton for a morning order. Thank you, Mr. Speaker. I rise today to remember Abraham Lincoln, the great emancipator. Everybody knows the first line that Gettysburg addressed four scores and seven years ago, but few can recall the next and most important sentence. Now we are engaged in a great civil war, testing whether this nation or any nation so conceived and so dedicated can long endure. This wasn't the rhetorical question from a confident leader. He was a heart-wrenching query from an embattled president and an emissioned doubt from a beleaguered man who sent 600,000 men to their deaths. Did Lincoln know his sacrifice would create the most powerful, most prosperous, most just nation on the planet? Of course not. America in 1863 was a weak backwater nation. But he knew that a new nation, conceived in liberty, dedicated to the proposition that all men created equal was worth the cost, so that government of the people, by the people, for the people should not perish from the earth. Prior to 1776, every government on the planet was designed to protect the power and the wealth of a monarch. These United States, the first place on earth, where government was made to ensure the freedom of the people from the government. Lincoln called the Bible when he gave freedom to all men. He quoted Jesus when he said that a house divided cannot stand. He quoted his scripture when he asked us not to judge one another. Instead he said, with malice towards none, with charity for all, with firmness in our belief in God, let us finish the work we are in to bind the nation's wounds, to care for him who bore the battle, to achieve and cherish, adjust in everlasting peace among ourselves and all nations. Chair recognizes for a morning order representative Al Williams and representative Gloria Frazier and Chairman Don Hogan. Thank you, Mr. Speaker. At the start of World War II after Pearl Habba, President Roosevelt said something that this country will never forget. He said today is the day that will live in infamy. There are 23rd, 2020 is the day that will live in infamy in Georgia. On that day, Abbaud Abbaud was viciously murdered on the street in Green County. But a lot of good things happened in spite of. And this family and his mother, this wonder Cooper who is listening, somebody that this state is still with you. This family, but most of all those of us up here, we want to make sure that there be some heroes that are not forgotten who has made things happen in this state. Thanks, Speaker Rauston, who spoke eloquently about Abbaud Abbaud Abbaud Abbaud at the beginning of this session. We thank Governor Kim. We are strong words at the signing of House Bill 479. Thank you, Sheriff Neil Jump, Sheriff Don and Glenn County, who went out of his way to make sure that folks were safe and things were orderly. And the two big Reynolds from the GBI who made sure there was a thorough and quick investigation. Dean Smire, Representative Gloria Frazier, Representative Don Hogan. Now looked up that day and Representative Hogan was standing there because he knew Glenn County needed justice. So we pause today in memory of Abbaud Abbaud Abbaud because he had to die, unfortunately, for us to take an inward look and see what needed to be done in Georgia. And Georgia is starting to rise to the occasion. Let me say this. If you're virtually at sense, all things work together for good. For those who love the Lord and live according to His purpose. We're seeing good come out of tragedy. May we all remember January 23 and strive to do better in this journey called life. Thank you, Miss Speaker. Thank you. Chair recognizes for a morning order. Chairman Corbett, Chairman Ron Stevens, and Representative Ridley. Thank you, Mr. Speaker. House Resolution 105 recognizes February 23, 2021 as dyslexia day at the Capitol. If it were not for COVID, there would be 200 kids here going around trying to bring awareness to this disease. And it is treatable when called early. I was first made aware of this with a constituent of mine about four years ago. Her son was told he's a boy. He just learns slower. He's okay. But anyway, she had him tested and turned out he had dyslexia. They got him the proper treatment, the different way of teaching these kids. Anyway, now he is excelling in school. His name is Gabe Hewling and we'll give a shout out to Gabe and keep up the good work. Chair recognizes Representative Sandra Scott for a morning order. Thank you, Mr. Speaker. A victorious woman, a phenomenal woman. A woman that give freely to the sick, elderly, and children. A woman who is committed to helping and serving people in Georgia and around the world. A woman that would drive across Georgia, talking to people about issues and stopping in every little town to a boutique. A woman that can call crack a barrel in the middle of Georgia and they will have a pound of that old-fashioned bacon waiting for her when she gets there. She believed in the women of this house during all the national organizations like Nobel Women, the National Foundation of Women Legislators, WEEK, NBCSL, and others. She loved helping and doing for people. We could count on her every Sunday die to say, Mr. Speaker, I am ready to go home. My moment in Black History is former representative Sharon Beasley-Teague. Thank you, Mr. Speaker, and I yield a good. Chair recognizes Representative Hutchinson for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Today I bring to you 11-year-old Michaela. I chose Michaela today because she wants to be a future social worker. She also wants to be a foster parent and or a hairstylist. Michaela is a loving child who is easy to get along with, is great with friends, and she looks forward to helping others when she grows up. 11-year-old Michaela is one of the many children who are available for adoption today in the state of Georgia. Thank you, Mr. Speaker. I yield the well. We are now going home to the rules calendar. Starting on to the rules calendar. There were certain measures that were carried forward. From yesterday's rules calendar, we're going to begin with those. Clerk will read the caption to House Bill 245. House Bill 245, our representative, will hood of the 175th and others to be entitled to amend chapter 35 of Title 43, the fiscal to Georgia. Antietta relating the podiatry practice shows the amendment of provision relating the fingerprint and criminal background checks. Ms. Bill Iverick, for the committee on Health and Human Services, that committee recommends that this bill do pass. Chair recognizes representative Lohood to present the bill. Thank you, Mr. Speaker, and members of the House. House Bill 245 is necessary because last year a bill passed that allowed podiatrists to organize jointly with MDs and DOs, and that law is in practice now. And so inadvertently in the bill last year, the word renewal was used instead of reinstatement. So what happens without my bill today, starting this summer in July, podiatrists will have to get fingerprinted to renew their license. Podiatrists who were currently licensed have already had background checks done, and to keep in line with other healthcare professions similar to theirs, they should not have to get another background check done. Actually if they lose their license and needed to be reinstated, should they need to get their background checked again. So if there's any questions, Mr. Speaker, I'll be glad to answer one or two. You do not appear to have any questions. I ask for your favourable consideration. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of House Bill 245, will vote aye, those opposed to vote no, and the clerk will unlock the machines. Have all members voted. If so, the clerk will lock the machines. On the passage of House Bill 245, the eyes are 155. The nays are zero this bill. Having received the requisite constitutional majority is therefore passed. What purpose does representative gains rise to make a motion? State your motion. I like to move that we postpone House Bill 286 to the next legislative day. Clerk will read the caption. House Bill 286, my members, have gains in the 117th and others to be entitled to amend chapter 8 of Title 36, the fiscal to Georgia and the senator relating to county police. So, it's a strict the ability of a county governing authority to reduce funding for county police departments. On the gentleman's motion, the House Bill 286 be postponed until the next legislative day is their objection. Chair, here's none. It is so ordered. Clerk will read the caption to House Bill 210. House Bill 210, my members, and the court of the 174th and others to be entitled to amend Article 2, chapter 3 and Title 40, the fiscal to Georgia and the senator relating to certificates to titled motor vehicles. So, it's exempt certain vehicles from the recording of Odomina readings upon certificate of title. This bill then refer to the committee on motor vehicles. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Corbett to present the bill. Thank you, Mr. Speaker. Members of the House, I bring before you House Bill 210, LC 392844S. House Bill 210 is the Department of Revenue Bill. What this does is it brings Georgia and compliance with a federal requirement that when the owner of a motor vehicle sales are transfers that motor vehicle, the Odomina reading has to be entered on the certificate of title for 20 years for a vehicle that is manufactured after 2011. And that's all this bill does, Mr. Speaker. I'll yield for questions if they are any. Looks like you do have a question to you. I yield. Chair recognizes Leader Beverly to your left for a question. Does General Gill? To my friend. So this bill just brings in the compliance what we're doing in the state with the federal state of the report. That is correct. Very good. Thank you very much. And if there's no further question to speak or I would ask everyone to ask the other questions. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those are.\n\nclose the vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 210, the eyes of 163, the three, the nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 342. House Bill 342, by the way, I'm going to have a whispering in the 141st and others to be titled an act to amend chapter 14 and title 43, the fiscal Georgia antenna relating electrical contractors, plumbers, condition air contractors, low-vogue contractors and utility contractors. Social prohibits certain advertisements relating to plumbing, Ms. Bill, I'm referring to the committee on agriculture and consumer affairs. That committee recommends that this bill do pass. Chair recognizes representative Washburn to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House, I come today to present House Bill 342. This is a simple bill. It simply prohibits anyone who does not hold a master plumbers or a journeyman plumbers license from advertising that they do hold such a license. So it's a very simple bill and I would appreciate your consideration of it. I would yield any question, Mr. Speaker. You do not have any questions. Thank you. I'd appreciate your favor or consideration of this bill. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 342 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 342. The eyes are 167. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 354. House Bill 354, by the way, is the $145 to be entitled to amend. Title 43, the fiscal of Georgia and Tate related professions and businesses. So as required, the state board of senators and the state board of funeral services reports a suspected, unlawful activity in the sheriff's office in the attorney general. This bill then referred to the committee on regulated industries that committee recommends a disbilled do pass by committee substitute. Chair recognizes representative Rick Williams to present the bill. Thank you, the speaker. Ladies and gentlemen, this is a consumer protection bill. This bill is brought to stop fraud, forgery, and other illegal crimes that are damaging people and families when they have prepaid for funeral or cemetery spaces and the money has not been appropriately put in trust like it's supposed to. This is a reaction to one of the state boards allowing a cemetery to operate 15 years without a license. And during that period of time, there was probably a half a million dollars worth of damage done to families. And that cemetery owner is now in a state prison from breaking the law. And it was done with the sheriff's department and our local district attorney. So this is just a consumer protection bill and I'll stand for any questions, Mr. Speaker. It appears that you do have a question to you. Yes, sir. Chair recognizes representative Bentley to your left for a question. Yes, ma'am. Thank you, Mr. Speaker. That's a gentleman. Y'all. Yes, ma'am. I do. Isn't that true that my husband is a fourth generation funeral director in middle Georgia? Yes, ma'am. And is it not further true that although this bad action happened in middle Georgia, we as funeral professionals encourage everyone in this body, in this house, in this Georgia General Assembly, to please consider pre-planning because that is really the best way to prepare for the time when the lower calls us home. That is correct. Thank you for your work on this. And I believe you're a signer to this bill. You're the queen of the funeral caucus and we appreciate your support. You didn't say to strawberry. Yes, ma'am. Thank you. And I appreciate your work on this bill. Thank you, Mr. Speaker. Thank you. No further questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. No. Anyу move. have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 354, the eyes are 167, the nasors zero. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 367. House Bill 367, by the way, is a parish of the 158th and others. We title an act to amend chapter 13 and title 16. They've just got to Georgia, Antietta, relating to control substances. Those who change certain provisions are relating to schedules 1, 2, 3, 4, and 5 controlled substances. This bill that I've referred to the committee on Judiciary, that committee, Judiciary Non-Civil, that committee recommends that this bill do pass. Chair recognizes Chairman Parish to present the bill. Thank you, Miss Speaker. Ladies and gentlemen of the House, those of you that are new, this bill comes to us from the Drugs and Narcotics Agency each year. It's their annual drug update. And those of you that have been here for a while, you'll know that every year we do this. And it simply allows our Georgia statute to sync with the Feds, and which allows our law enforcement agencies to be more effective in efficiency in doing their jobs. Miss Speaker, if any questions, I'll take them. If not, I would ask for your favorable consideration on House Bill 367. We do not have any questions. Thank you. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. As opposed to vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? Yes, so the clerk will lock the machines on the passage of House Bill 367. The eyes are 164. The nasors zero. The nasors bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption. House Bill 149. The bill has been ordered. House Bill 149, the Williamson of the 115th and others to be entitled to amend Chapter 7 of the title of the 48th. The official go to Georgia and Tate of Relaying the Income Taxes. So it will allow for certain elections to be made by sub-chapter S corporations and partnerships. This bill will have an refer to the committee on ways and means that the committee recommends that this bill do pass by committee substitute. They are recognized as representative Williamson to present the bill. Thank you, Mr. Chairman. Mr. Speaker and members of the House are bringing for your consideration day. House Bill 149 by committee substitute, LC431908S. This bill simply allows the business entities in Georgia which will organize this pass-through companies and which are the majority of the business entities in Georgia. We will talk about S corporations and LLCs. And again, most of the businesses, small businesses in particular, or organized as LLCs. This bill takes advantage of a recent IRS ruling that was published back in November that the Department of Treasury and Internal Assembly, Remini Service, intend to issue proposed regulations to allow these business entities to pay their state and local tax, sorry, their state tax is at the entity level. This bill, we worked hard with the Department of Revenue and make sure we had it right. It is zero revenue impact to the state of Georgia. It comes without objection. Furthermore, the endorsement of the CPA community, the business communities that are involved and Georgia Chamber of Commerce and others. Most of our CPAs in the room, and I know we have several, had a chance to talk to them about it. It will be happy to answer any questions. But the net net is, if you pay your state taxes at the entity level, it will thereby lower your federal tax liability on your personal returns. It will be happy to answer any questions. You have a question or two if you care to yield? Yes, I'll be happy to. Chair recognizes Representative Wilkerson to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that eight states have already passed this legislation? Yes, that is correct. They believe 14 more are looking at it as well. Yes, sir. Both Democratic and Republican states. This is great. Everybody loves to save money on taxes. And it has no impact on the state of Georgia revenue. Is that correct? That is correct. Thank you for bringing this bill. Thank you for the question. Mr. Speaker, I'd be happy to answer any other questions, but hearing none, I'd yield the well to the right. You have one, but it's up to you. I'll answer one more, Mr. Speaker. Chair recognizes Chairman Carson to your right for a question. Mr. Chairman, you'll be happy to answer another CPA's question. Very good. Is it not true that you and I both found IRS notice 2020-75, which clearly lays out that the Department of Treasury and the IRS are going to allow this treatment thus the state taxes being paid from the partnership entity? Is not not true. You found it, I didn't. Thank you for sharing that information with me. Mr. Speaker, I'll ask it. Thank you. I'll yield the well and ask for the body's favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 149, the I's are 167, the nasor zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 374. House Bill 374, the resident gains 117, be taught on act to amend chapter 8 of Title 4080, the fiscal to George Antietta relating sales and use taxes to exempt from taxation, local authorities providing public water or sewer service. This bill eminence for the Committee on Ways and Means. That committee recommends that this bill do pass. Chair recognizes representative gains to present the bill. Thank you, Mr. Speaker. House Bill 374 is identical language to a bill that this House passed unanimously last year. And what it does is it lines up any multi-county water and sewer authority with any single county water and sewer authority by any purchases that they make would be exempt from local and state sales tax. Happy to answer any questions. You do not have any questions. Thank you, Mr. Speaker. I yield to you. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machines on the passage of House Bill 374. The eyes are 164, the nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 161. House Bill 161 by Representative Tancersley, the 180th to be titled back to amend chapter 42 title 36, the official to George annotated relating to downtown development authorities. So as a removal provision, providing perpetual existence to such authorities, this bill then refer to the Committee on Governmental Affairs. That committee recommends that this bill do pass. Chair recognizes Chairman Tancersley to present the bill. Thank you, Mr. Speaker. Please stand before you today to present House Bill 161. This is a Department of Community Affairs bill and it's relevant only to downtown development authorities. This bill did pass out of the house last session, but my funeral homes, funeral home friends, will understand when I say it was laid to rest in the Senate when COVID came along and sent us all home. So while downtown development authorities can go inactive, they cannot be dissolved. These DDAs are the only authorities in our code section that require perpetual existence. And even though they are inactive, they're still required to generate a financial report every year. So this bill would simply allow municipal governments to legally dissolve these DDAs that are no longer active, they can hold no assets, and they have no outstanding debt or any other obligations. So this legislation is necessary to remove six little words that are underlined on your copy of the bill and that is each authority shall have perpetual existence. By striking this Senate, this bill allows these dormant and active authorities to be legally dissolved. GMA supports this bill and with that Mr. Speaker, I would you for any questions? You do not have any questions. Thank you. I would ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of House Bill 161 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 161, the eyes are 165. The nays or zero. This bill having received the requisite constitutional majority is therefore passed. We will read the caption to House Bill 68. House Bill 68, the clerk of the 147th being titled an act to amend Code Section 43, 1415. The official code of Georgia and tentative relating the certain military certifications that in title of persons to obtain certain professional licenses this bill had referred to the committee on regulated industries. The committee recommends a disbile due pass. Chair recognizes Chairman Heath Clark to present the bill. Thank you, Mr. Speaker. Colleagues, House Bill 68 simply extends the time that a service member can use some of the certifications and training that they got while in the military towards a professional license from 180 days to two years. And it's specifically for electrical contractor plumber HVAC, low voltage contractor or utility contractors and those licensing boards can also extend it beyond two years if there's some extenuating circumstances. That's the bill and I'll stand for any questions. You have a question if you care to yield. I will yield. Chair recognizes Chairman Setslor to your right for a question. Mr. Jim and you for you I will. Yes, sir. So this affects the amount of time they can credit. This doesn't change any provisions about testing for certification. This is just time served is extended from the time serve credit extends from 180 days to years. So from the time of their discharge it moves it from 180 days from their discharge to two years that they can apply the training that they received towards a professional license. I see. So they they wouldn't time out and lose the ability to get licensed. Correct. Okay. Thank you. Thank you. If there are no further questions. No further questions. I will yield and ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 68, the eyes of 163, the nasors 0. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 119. House Bill 119 by representative Matthew Act with 73rd and others to be entitled an act to amend Code Section 1474, the physical to Georgia and Tate relaying the professional services in which a professional corporation may engage. This bill I refer to the committee on regulated industries. That committee recommends that this bill do pass. They are recognized as Chairman Hawkins to present the bill. Thank you, Mr. Speaker. House Bill 119 addresses allowing car practice, practicing within their scope to join in a business relationship and ownership with physicians. Similar to what we see with optometrist and ophthalmologist, both associations have agreed upon this. And so without further questions, I ask for your consideration or approval. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Now this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. The members voted. Have all members voted. If so, the clerk will lock the machines on the passage of House Bill 119. The eyes are 163. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 241. House Bill 241 by Representative Gamble, the 15th and others to be entitled to amend Code Section 337, 6th of the official bill of Georgia, and tentative relating to property insurance, contract requirements, rules and regulations and exemptions. This bill I refer to the committee on insurance. That committee recommends that this bill do pass by committee substitute. Chair recognizes Representative Gamble to present the bill. Thank you, Mr. Speaker. Members, I rise today to present House Bill 241 to you, which deals with service contracts, sometimes called extended warranties. These are optional products that are not mandated by law like homeowners insurance or automobile insurance. Through this legislation, if we pass it, it would allow Georgia to join 48 other states that have already done this. If a consumer cancelled one of these contracts early, it allows for the deduction of claims paid from a refund amount. This protects the consumer by clearly defining the process of what happens when they cancel the contract while also preventing fraud, where someone could technically purchase one of these contracts, file a claim and then immediately cancel it, leaving the company holding the bag. It also adds key fobs in as part of what is allowable under these service contracts. With that, Mr. Speaker, I'd be happy to yield for questions. You have a question if you care to yield. I do. Chair recognizes Representative Hutchinson up in the gallery. Through your right. She waves. You have no further questions. Thank you, Mr. Speaker. Ask me your favourable consideration. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Yes, so the clerk will.\n\nlock the machines on the passage of House Bill 241. The eyes are 166. The nasors zero this bill having received the requisite constitutional majority is therefore passed. What purpose is representative Bodhi rise? He believes. Clerk will read the caption to House Bill 305. House Bill 305 I represent Hawkins the 27th Bill B. Todd Lackteman chapter 24A. A total 43 the fish go to George annotated really in the practice of massage therapy. So, to revise a deposition this bill and for the committee unregulated industries that committee recommends that this bill do pass. It recognizes chairman Hawkins to present the bill. Thank you, Mr. Speaker. This bill speaks to a follow-up on the bill that we passed about two years ago from massage therapy. It came to the attention of the attorney that helps them through the attorney general's office that it was not completely described within their board rules about who would be doing the testing. So, they are using a national association who they use now and who they've used in the past. The difference is the name is not included. So, in the future they can actually change or make additions. The second addition to this is online 31 and it speaks to certifying the instructor of the course. So, this is more of a cleanup bill. Does not change hours. Does not change any of the requirements but it's just more of a complete definition. If there are no questions, Mr. Speaker, I will yield the well. You do not appear to have any questions. Is there any objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is not. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 305, the eyes are 161. The nasor 2. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to a group of privileged resolutions. Honoring the life of memory of Wayne Lowe, honoring the life and memory of Ernest W. Wood, honoring the life and memory of Mark Anthony Suttles, honoring the life and memory of Eugene Edwards. Recognizing February 26, 2021, the city Tucker-Counselman Bill Rosenfeld day. Recognizing and commending the Georgia Forestry Commission for 100 years of service to the state of Georgia. Recognizing commending the House of the African Methodist Episcopal Church on occasion of its 150th second anniversary and for other purposes that completes the reading of the privileged resolutions. Is there any objection to the adoption of the privileged resolutions? The chair here's none and the resolutions are adopted. What purpose does Chairman Cooper rise? Thank you, Mr. Speaker. I rise to make a motion. State your motion. I would like that the rules would be temporarily suspended so that a bill can be read and assigned to a committee. Clerk will read the caption. Unnumbered House Bill by Representative Cooper, the 43rd of being titled an act to amend chapter 8 of Title 31 of the physical and Georgia and attend a related care and protection of indigent and elderly patients. On the ladies' motion that the rules of this House be temporarily suspended so that a bill may be read for the first time in a signed committee. Is there objection? Is there objection? Hearing none, it is so ordered. Human relations and aging. What purpose does Representative Wynn rise? All right, we'll move on. All right, we're about to go on to announcements. About to go on to announcements. So if you have signed up for an announcement, be prepared and be at the front of the chamber. All right, we're going on now to announcements. Chair recognizes Representative Becky Evans for an announcement. Chair recognizes representative Annullah Woods and Representative Alexander for an announcement. Thank you, Mr. Speaker. I just wanted to let everyone know that the women's legislative caucus will meet today after this session adjourns. We are going to be in a new room this week that is the legislative office building room 514. That's room 514 and the legislative office building for the women's legislative caucus. Thank you. We have a good agenda today. Chair recognizes Chairman Parsons for an announcement. Thank you, Speaker. Reminder that there will be a energy utilities and telecommunications meeting at 3 o'clock p.m. and room 403 of the capital upstairs here. We have one bill. It should not take too long, but your attendance is definitely a, your attendance, you need to be there. Your attendance will be appreciated. Thank you, Speaker. Chair recognizes Chairman Corbett for an announcement. Thank you, Mr. Speaker. The environmental quality subcommittee of natural resources will be meet this afternoon at 2 p.m. and 515 CLOB. Thank you. Chair recognizes Chairman Setsler for an announcement. The Setsler Subcommittee of Judiciary Nine Seville will meet at 1 o'clock in room 415 L.O.B. Setsler Subcommittee. Chair recognizes Representative Larickia for an announcement. Thank you, Mr. Speaker. Tomorrow morning 7 a.m. the prayer fellowship in room 403 capital. If you can't make it, pray about it, take that up with God between now and then. Appreciate you. Chair recognizes Vice Chairman Graveli for an announcement. Thank you, Mr. Speaker. I have a resolution here in my hands. I'd like to invite everyone to come sign it. It is recognizing and commending the Atlanta Black Chamber of Commerce. I will have it down front of the chamber if you'd like to sign it. Thank you. Chair recognizes Representative Reeves for an announcement. Thank you, Mr. Speaker. The Reeves subcommittee of Judiciary Nine Seville will meet at 4 o'clock today in room 132 of the Capitol and we will promptly adjourn at 5 o'clock so I can pick up my 5-year-old. Thank you. You better. Chair recognizes Chairman Heath Clark for an announcement. 8 o'clock in the morning the House Defense and Veterans Affairs will have a meeting in C.L.O.B. 506 8 o'clock in the morning tomorrow morning. Chair recognizes Chairman Carson for an announcement. Thank you, Mr. Speaker. Folks, House Retirement Committee will meet in 4 o'clock in the House. Chair recognizes Chairman Darling Taylor for an announcement. Thank you, Mr. Speaker. The Insurance Life and Health subcommittee will meet today at 1 and 4 o'clock in the morning tomorrow morning. Chair recognizes Chairman Cooper for an announcement. Thank you, Mr. Speaker. The House Health and Human Services Committee will meet today at 2. We have a full schedule so if you'll try to be on time, 2 o'clock and 606, the C.L.O.B. Thank you. Chair recognizes Chairman Dickie for an announcement. Thank you, Mr. Speaker. 8 o'clock in the morning our Culture and Consumer Affairs Committee will meet 4 o'clock in the morning. Chair recognizes Representative Becky Evans for an announcement. Thank you, Mr. Speaker. I'd like to invite the ladies at the House to the Georgia Wond 3rd annual legislative T and suites reception today at 3.30 and you should have all received an invitation in your offices and if not you can text me and I can text you the link to join in. It'll be via Zoom. Thank you so much. Chair recognizes Representative Carpenter for an announcement. Thank you, Speaker. There is food in the any room if anybody's hungry. What purpose does the majority caucus whip rise? State your motion. So 114 be recommitted to the Ways and Means Committee. The majority caucus whip has moved that House Bill 114 be recommitted to the Ways and Means Committee. Clerk will read the caption. House Bill 114, Representative Reeves, 34th and others being titled an act to amend Article 2, Chapter 7, Title 48 of the fiscal to Georgia annotated relating the imposition rate computation and exemptions from state income taxes. On the gentleman's motion that House Bill 114 be recommitted to the Ways and Means Committee, is there objection? Is there objection hearing none? It is so ordered. The chair recognizes the majority leader of the House for a motion. Thank you, Miss Speaker. Miss Speaker, I moved to this House stand adjourned until 10 AM, Wednesday, February the 24th, 2021. The majority leader has moved that this House stand adjourned until Wednesday, February 24th, at 10 o'clock AM, all those in favor of the motion will say aye. Those opposed will say no. The eyes have it in this House will be adjourned until Wednesday at 10 AM. The House will say no. The House stand adjourned until Wednesday at 10 AM. The House stand adjourned until Wednesday at 10 AM.",
  "updated_at": "2026-02-13T09:55:42.574513+00:00"
}