{
  "video_id": "04BnbKDpCxk",
  "url": "https://www.youtube.com/watch?v=04BnbKDpCxk",
  "title": "8/28/23 Senate Study Committee on Certificate of Need Reform",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 182,
  "summary": "Overview: The Georgia Senate Study Committee on Certificate of Need (CON) Reform held a session on August 28, 2023. The session featured remarks from key legislators highlighting the importance of addressing healthcare accessibility issues in the state, particularly in underserved areas.\n\nKey Actions: No specific bills were mentioned as being passed or referred.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- The session opened with a prayer led by Senator Robertson.\n- Remarks were provided by Senate Rules Committee Chairman Richard Smith and Representative Carolyn Hugley, who discussed the healthcare challenges facing Georgia and the need to address CON reform.\n- The committee heard from Mark Baker about the facility hosting the meeting and its history in supporting medical education.\n\nVotes: No recorded votes were mentioned.\n\nAttendance: No specific quorum notes were provided.\n\nAdjournment: The transcript does not indicate when the session was adjourned or the date of the next scheduled meeting.",
  "transcript": "you Hay I I saw some donuts here. We're going to start this morning, like we started all of our committee meetings and our time together in the chamber with the word of prayer. And I'd like to call forward my sweet mate. He got elected the same year I did since then, growing in the best beard in the Senate. And he's spent enough time in the gym that he's the most feared man in the Senate due to his stature and his physique. And he rovers the senator from what's your district number center? 29. Why don't you come forward to the microphone? He opens up a little bit for her to. If everyone will bow their head with me, please, dear Heavenly Father, we humbly approach you this morning, Lord God, knowing that we are your servant God and knowing that you are in control. We ask today, Lord God, that you open our hearts and our minds as we traverse through these complicated times that build with the lives of the families and the women and children of New Year's Georgia. And use the wisdom that we need, Lord God, and make the right decisions. And Lord God, as always, we ask for these blessings in the name of your Son and our Savior, our Lord Jesus Christ. Amen. Thank you, Senator. Senator, Senator, that seat of you don't mind. I'm going to call forward as well. In the political world, the ultimate air traffic controlling gatekeeper for what happens on the floor of each chamber is the rules committee. And that makes in each chamber the rules chairman very, very influential, powerful, and instantly funnier, more handsome, and they stand on the tower as well. The Richard Smith and the women, Chairman Smith's district as well. So Senator and Chairman Smith, go ahead and just chair a few words. That's about your district if you would. Some of us have traveled from afar as familiar as others, and we'd love to know where we are this morning. Well, I'm starting because the rules chair asked me to, not because I think that I'm anywhere near as important as he is. But I want to welcome everybody to my district, District 29, which is the Northern portion of the Skogie County, all of Harris, all of Maryweather, and all of True counties. I think we probably have one of the more unique and diverse districts because of the military and the rest of us. We have here because of the fact that we're so close to that country known as Alabama. And we are a combination of rural and environment. And because of that, we get a bit of everything that a lot of our southern brothers and sisters have, and our northern brothers have that very important. I'm proud to know that one day, it was a pleasure to talk about agriculture and country harvesting. And the next day, I'm somewhere in the district, touring a hospital or a clinic, and trying to determine what the health care needs are there. And I want to welcome everybody here. If anybody gets in trouble, why don't they hear the deep amount of cell phone numbers, 9-1-1? I'm just calling it a astramarine, and they'll get you in touch with me. So thank you all for holding this meeting here. And I do want to, for the portion of the privilege, I want to thank the chair of this committee, study committee, for the hard work I know he's done on this. As he said before, he and I walked in the door the same day and immediately became friends and have gotten nothing but closer since then. And this is something that is near and dear to his heart. And I appreciate the effort and the professionalism that he's invested into this study committee. Thank you for bringing that to the office. Also, I'd like to welcome everyone to the House District 139. You pretty much, and it's a center of it. We've been very fortunate here and that we've been blessed with organizations like Houston. Those of you all don't know it. It's one of them I would be here today because they've done both of these, both my back and both room things. And one time I was walking in and I said, Hey, Dr. Doors and Doctors were walking in at the hospital. This is a wonderful organization. And it breaks a lot, a lot of things that Georgia needs to take a look at. And that's health care. If you go south of us here, there are several counties that don't have hospitals, don't have doctors, don't have pharmacies, don't have a party, anything. And I remember one time I was doing a program down there at the social economic profile. And one of the things we did, we looked at where a county used to be, where a county is today, and something don't change, where it's probably going to be. And I ask them, why do you think crime is so low here? No answer. I say, well, there's nothing here to steal. And that's what some of our rules south Georgia counties are facing. And it also relates to health care. We've got to take that 900 pound gorilla out of the room and address the needs that are impacting this state. We've got parts of Columbus that are underserved as far as the primary care. You've got people in this state who are driving 30 and 40 and 50 miles just to get a prescription field. Now that's unacceptable. Now I've been on this CON train since 2005. I was second signer on the bill to do away with CON in 2005. So I've testified, I've done a lot of things that it relates to CON. And it's something that is very important to me personally, and it's much more important to the people in this state that we address this health care issue. Now CON is one part of it, but it's a big part. There's a lot of other issues because we have primary care physicians retire. I've already had to go through two, one of my third primary care physicians now because the other two retire. So there's a lot of issues in health care that we have to address. I'm glad you're here. Don't call me on 9-1-1 because I won't answer. To get a speeding ticket, call him. But it's a pleasure to be here. And I think one of the issues that the people of Georgia need to understand. There's a lot of very important issues being discussed. The session got over, and when sessions go start on the second Monday and January. Thank you. Thank you, Mr. Chairman. We have a rules chairman in the Senate as well. He always likes his own entrance. The ladies and gentlemen, Chairman Matt Brass has decided before this morning. If you were in the Senate, he'd make you rise when he walks in the room, but we're out of sections that were all now. Remains seated. But thank you, Chairman Smith and Senator Robertson, for giving us a little bit of a high level of view where we sit today with that in mind as well. We'd also like to have Mark Baker. Tell us about the facility that's been so gracious to host this morning and what kind of work you guys do here as well. Yeah, sure. So good morning, glad to have everyone here. It's a great day for us, but it's also just from the subject matter at hand. It's a great day for you guys to come in and actually get the witness for foundation. This building was built in the mid-80s. It is a 501C3. It's a separate entity governed by a separate board. We're very proud of it. Within the facility, what you can see, what you're witnessing now, is an area where we do a lot of conferencing, of course, in education. For over 12 years, we had the International Orthopedic Society. For total joint was actually trained here. We trained over 3,100 orthopedic surgeons during that time in the field of total joint replacement. On top of that, across the way, when you go out of these doors as a full medical library, a lot of people don't realize, you know, of course, you now have Google, you don't need a book, and everything is online. One of the requests out of Houston to have when we were renovating this was, do you mind just keep it our vintage books? If you go in, it looks like wasted space. There's a nice little balcony. But if you go up, that's all about Houston's original books. And that hallway that goes, why did they build that? It went to his office. So a lot of history along with a nice museum area upstairs. We have a full cadaver in medical surgical training lab. For the ones that do not know, we have a full orthopedic residency at our hospital. So we have a lot of residents that come through, but we also train surgeons all over the country here. One of the latest and probably most exciting things that we're doing. And we have Brent Ponce in the back to introduce us to Kyle Cheakas. Kyle Cheakas is an MDPhD. He was recruited all over the country. We, as Georgians, are very excited to have him in this state. We're building out a full translational research lab downstairs for the ones that are unsure of what that is. We're bypassing animal studies. And we're using true human tissue. If you want to feel lower on the IQ score, just sit with Kyle for a little while. And he'll humble you. Some great things. We're great to have you guys here. And we have a lot of exciting things going on. Thank you. Thank you so much. And thank you for hosting us this morning. For the members of the committee, those in the room, that's kind of what a reminder of where we're at in our arc in this study committee. This is meeting two or four. We had our first meeting just a couple of months ago at the Capitol. At the beginning of summer. We are now closing out our summer here. We will be in Dr. Watson's town. I'm not sure if we're in your district or not. We'll be in his town in Savannah in October. And then we'll finish up our work before the end of the year. And when we get back into session. I think it would be helpful for those streaming online and those in the audience to understand who it is that sits up here at this table. So I would love each member to take 15 seconds, introduce yourself. Tell us where you're from. And as you see, we have less microphones here this morning than we do at the Capitol. We have more microphones around. And similarly, you do not need to wait for me to turn your mic on. So as you want to speak throughout the course of this meeting, just go ahead and get a microphone close to you. And as it becomes available for us to call on you, you'll be recognized. You'll be live. So let's start with the esteemed Dean of the Senate, Chairman Harborson. Thank you very much, Mr. Chairman. I am honored to be here today. I'm here at Harborson for the 15th Senatorial District. I have seven counties, make it million, tell it to all of it, slide. And parts of Chattanooga County at Fort Moore. I have been wrestling with this issue ever since I've been in the Georgia legislature. It is a critical frame that we look at it in the vein. We're looking at it now. And I'm just honored to be part of the process. Hopefully we can give it a powerful and very careful consideration as it relates to how we apply laws that apply to our medical professionals. Thank you. I think everybody already met me at my dialogue. So CEO of the Houston Clinic. Good morning. I'm the state senator Freddie Powell Sims, District 12 Southwest Georgia. And also born not too many miles from here in Talbot County. So this is home to me and for me, love Columbus. It's a friendly town. So thank you so very much for having us. We hope that we can all will have a successful ending when we're done with the CEO and meetings. We want to make sure that all Georgians rule urban otherwise. We'll have adequate, not just adequate, but quality medical care. And that's what we're looking for. So thank you so very much for having us. And we'll move on. Thank you. I'm Steve Rothheim. I'm an orthopedic surgeon with resurgence orthopedics. I have been dealing with a CON issue for multiple aspects for 20 years. I've been in a hospital board that had CON issues. I run a medical practice dealing with CON issues. And even in the short time of this committee learned a lot about the issue. Thank you. I'm Kay Karpatrick. I represent Synodistric 32, which includes Cobb and Cherokee counties. In my previous life, I'm still an orthopedic surgeon. I did hand surgery for about 30 years before I shifted gears. And also was co-president of resurgence with Dr. Rothheim here. So I know a lot about this issue. And I'm very much looking forward to not only hearing all the testimony that we have to hear, but also coming to our conclusion that makes sense for Georgia. Thank you. And thank you, Houston Clinic, for hosting us. Rather impressive facility that you have. I'm a state senator Ben Watson. I represent about half of Chatham County, all of Liberty County, which is Hansville, and a few other communities in Bryan County, which is Richmond Hill and Ellible, where the Hyundai Meta Plant is. So this is the area of the state, growing area of the state, about four hours and 23 minutes from here. So I don't get to be in this part of the country as much as I would like. Beautiful, beautiful area, beautiful downtown. I really appreciate being here. I am Chair of HHS and have appropriations in the Senate also. This issue has been important for the state of Georgia for years, decades actually. And I look forward to hearing what people have to say. I look forward to hosting us along with the state senator Garrett Mauro and Savannah. Thank you, Chair Watson. My name is Greg Dolas. All I serve, District 27, which represents the Bronca for Scythe County, which is just north of Atlanta. And I work in technology, do not work in healthcare. However, I have four children, eleven and under with my wife. And that means that she or I are in a hospital medical facility or providing primary care in the home front. And really a weekly basis, it seems like. I don't want to thank smart. I'm Matt Braff. I'm from New York, Georgia, and represent District 28, which is all of Cal Edie County, all of her county. I was seven part of Portland County and the western half of Douglas County. And it is great to come back to the Houston Clinic. I've actually had two shoulder surgeries here. So Dr. McCluskey and Greg down here did a good job. Great job. But yeah, so with my district, I was really thrown into the middle of this DON battle from day one in the legislature. And been in the middle of it ever since. And I have seen some benefits from it and have seen some negatives from it. And I think we've got to find some balance out there that really goes to start of our citizens better. Because I think we can do better in this state and we will do better. And we've got to figure that out. So look forward to this committee. Thank you, Mr. Chairman. Good morning. My name is Jesse Wevington. I'm the president of the CEO of the Georgia Association of Health Plans, which is a trick group for the commercial health and health industry in the state. Originally from up the road, Highway 27, up in Carrollton. I was so glad to be in Columbus. My mother was actually born here at Fort Moore. So excited to be here. I have a long issue with this issue. We've written commission in 2005, a couple of special and study committees. So excited to continue to work. Hello, my name is Matt Hasbrook. I'm the CEO at Memorial Health Meadows Hospital and by Bayley, Georgia. Very honored to be part of this committee. And I really hope to provide not only the unique perspectives that we've been learning. I've been in health care now for 18 years in various capacities. I've worked in four different states. Two of them, which are CON states. Two of them, which are not CON states. I've had leadership capacity in five different hospitals across those four different states. Prior to being at Meadows, I was the chief operating officer at Memorial Health University Medical Center in Savannah. I was part of the management walk-through district. And then prior to that, I was the COO at Fairview Park in Dublin. So have a unique understanding of both the rural hospital operations as well as urban. And I'm looking forward to being a part of this and working through the process. Thank you. Hi, good morning. I'm Christine McHughan. I am corporate counsel with Peabont Health Care. So we have two hospitals in the district. And 15 others across the state as well as a 2700 physician network. I'm with corporate counsel and have oversight of the COO program and Peabont. So I have day to day understanding of what hospital physicians and others are going through. It's important. Fantastic. Thank you all. There are a few other key people that I want to point out this morning to help either make this morning possible. Or they're just been supportive of the effort in general. Jocelyn Hill, we had her testify last time. So now she's gotten as far away as possible from a microphone. But she's over there in the corner. Thank you for the work that you've done. She works with our Senate Research Department as a phenomenal job keeping us equipped with information around the district of need issue. If you've had to figure out anything as relates to these meetings, you've talked to Kylin Gallagher in our office. And she let us know last week she will only be in our office for a few more weeks. She's done a phenomenal job helping make me make the transition into the leadership suite where she's working myself in the Senator Larry Walker this year. In the back streaming this live, our Alexi and Keenan with Senate Press. And they, I don't know when y'all got here, but they got here early enough to make sure all this stuff worked and make sure that everybody can communicate. Enes Owens is right in front of them with Lieutenant Governor's office. Has been really my touch point with the Lieutenant Governor's office on just to keep the issue with the bill that I had this past year. As well as a few other things that Betsy is our lawyer. So she keeps us out of trouble. But she's with Legislative Council who helps us figure out how to write bills and draft them and make them sound like only a lawyer can understand them. So thank you so much for helping us navigate this committed process as well. I think I mentioned everybody that I wrote down. What are my members of the committee and those here in the audience? We're not here to just be, to pontificate on things. We're also not here just to have somebody present a PowerPoint to us. I want to encourage members of the committee to participate as you have questions. Guy with microphone asks those questions, but like this morning to be as much as the dialogue is possible. We legitimately can learn things that we don't know. All of us walk in this room and into this process with preconceived notions as to what we think about the regulatory mechanism that is certificate of need. I reckon promise you there are things that you don't know or different viewpoints that you may not share that are legitimate as well. So we will have a number of people present to us this morning and then we'll have a time for open comment from anybody here that wishes to speak. If you'd like to sign up to speak, Guy has a sign up sheet that she could get to you. We're going to conclude our time with open Q&A. Or I should say open commentary from anybody that wishes to speak with the opportunity for members from the committee to ask you any questions that they may have. So with that and without further ado, we'd like to call Mark Baker forward. And probably going to be easiest. Mark, do you actually just step forward here to the. So that we can see you. We can call an article if you'd rather not, but. The figure will start out of the good strong. You've got about 10 minutes. Well, my call first. It's got to be 10. Perfectly fine. All right. I want to apologize first for having a standing mic. That was my request because I do not like sitting and talking. So once I get once I get worked up, it's hard to keep me still. So I appreciate number one. The committee having me. I appreciate the fact that we're here to talk about a very, very important important subject. At the beginning, you asked to explain who the kind of give a. Talk of who the Houston clinic is and what we do. I didn't want to give this bill there. I'll hold it for now. So the Houston clinic say position on group. We've been in existence. 2024 for 75 years. So found in 1949. We are in four states. Just like what is mentioned earlier. We're actually in three CON states and one non CON state. The evolution of health care has been very, very interesting. Been at this since 2002. We as a clinic have been through a tremendous amount of challenges. A lot of excitement and growth as well. With that understanding of who we are and where we are. Our main campus is here in Columbus, Georgia. But we have campuses from. It's far north of just north of Nashville, Tennessee. To Melbourne, Florida. Over to Valdalia. And that area as well as all throughout Alabama. We just entered into Birmingham market. And with that, we see quite a bit and face a lot of different challenges. But with what we're what we're doing today. I want to micro down to this state of Georgia. And what is interesting. I was getting those really thinking and you talk about an audible. I'll call audible is quite a bit. And one thing that is very, very, I mean, laser focus that hits me. Is that we're in a situation when I've told the physicians, people love to say physicians aren't good businessmen. That's a catch for each of you here a lot. But I will tell you if you give up a physician, 99% of the right information, they're going to make the right decision based on the information that has been given to them. And I think there's a lot of similarities with you guys today, especially in the legislature. You've got a lot of people telling you everything that they want to hear what they want. And you have to make decisions based on that information. So hopefully today we can give you information that is real and factual. And leave a lot of opinion out. And I'll try to take you through that journey and talk to you about what it means to actually have gone through. A tremendous by legwork with CON. So in 2002, I came on board with the Houston Clinic. The physicians had a drive in a vision to not discontinue even at a time to wear from a finance perspective. The clinic was not doing so well. But the group of physicians got together and knew there was a mission larger than themselves. And they stuck together. And I'm very fortunate to have just been a small part of that. In that, in about 2003 or 2004, everybody mentioned they have their attorney. Actually, Victor's here to save me for myself. And so Victor does a lot for us. But Victor was along the ride for that as well when we applied for our CON. And what we asked for at the time, we were building out a six-room surgery center or attempting to on our campus. And we were very quickly notified of, of course, what we had to do about CON. And understanding what CON does, right? So anybody can Google what CON and what it is meant to be, is looking to measure what the need is. Is there a true need for what you're asking? Does this actually, can we from a CON board look at this need and do we need to control the cost? So that's two things. Control cost, measure need. The third thing is to guarantee access. So they look at how to guarantee access through the CON process. I find all of that interesting because I think in our situation, we can walk through the years and talk about exactly what occurred and what happened. We applied in 2005. And I'll fast forward since only 10 minutes. But we were denied in 2008. We went through the first CON committee hearing with DCH. From there, we appealed a course ticket to Superior Court, where we won, to be later appealed by a company out of Nashville, Tennessee, Symbion, which was a large ASC operator at the time. We were told that they have later sold. But we were opposed by a company in Tennessee. Of course, the others joined on that opposition. And we were told basically there was no need because there was already access. There are way too many operating rooms in Muscogee County for us to have access. And with that time, what was interesting is we were also looking at how to expand our services and we did not want to take no foreign answer. There was a hospital being built in Phoenix City, Alabama, which is seven minutes from my door, my office door. And we were watching that hospital. And as we were looking at the hospital, we could see there was going to be an opportunity.\n\nAnd that opportunity when we were denied in the state of Georgia, we looked west and we bought a hospital and we now own 100% of acute care hospital in the state of Alabama and we took 600 on average cases of the month out of the state of Georgia to Alabama. The seal went declared that there was no need in Georgia. I would like to say there's nothing wrong for for profit a lot of people like to hide from that when they're in these type of hearings. Honestly I don't need a seal went committee to measure to see if we need to spend on him or not. I do not. If we make a bad decision as a group that's on us and everyone even though we were moving into the state of Alabama we were fault viciously from the state of Georgia. Wait a minute I thought at first you guys didn't want us and they're wanting to need so when we moved to go to Alabama we were fault again at a federal level which we later won as well. So we haven't looked back but what was interesting from that point when we applied for the seal when we applied for six rooms at that point they said well you'll probably get it passed if you move it to four rooms. Richard Smith was with us during that whole battle. During that battle we moved to four rooms it's still didn't matter. We knew we were going to we had heard that we were going to be overturned at the Appellate Court so therefore hence why we moved to Alabama. What I'll find interesting is we tried for four rooms well guess what we got we got six rooms and a procedure room and then six years later guess what happened. We fell into another surgery center and purchased a seal in and opened up two more rooms in Muscogee County so now I have a net eight. I have four cities now I have a net eight within the county. What is interesting if you look back you look back through the years of 2005 to now there's been a net gain of twenty-oars in our service area. Net gain I find that interesting right and we still have an access issue. Luckily we have a great partnership with Piedmont has worked out well we have just now purchased forty-nine percent of a shared surgery center and we still have access issues and even the CEO of Sky Hill he would say the same thing. Access is something that is very interesting to me as you begin to look at the need for the patients we serve. There are 159 counties in the state of Georgia you're second to the state of Texas I think they have 254 counties. In this area we have served all hundred and fifty nine counties in the state of Georgia. I keep hearing about rural we understand rural we're all throughout the state of Georgia. So I looked at some of your most impoverished counties that I love people to quote that we look at as a company and I'll just throw out a few. I throw out Teo Fair County. I'll bring up Lanier County and I'll bring up Stewart County. What is amazing when you look at these three counties the most impoverished in an eighteen month time frame on average we have treated over fourteen percent of their entire population. So we can't say that we the way that we move and the argument of CON is to control the cherry picking. That is a dead animal. It's a dead animal. Also did the proliferation of O-Rs hurt the viability of health care in the state of Georgia with in Muscogee County. Let's talk about that. What occurred in the same time frame? 2005 to now on average both hospitals increased their net patient service revenue over a hundred percent. I wanted to quote just their patient visits to the wild. The question to me oh well the patient visits went up so therefore you know there's a lot of indigent care that they probably had to serve because you move the paying patients out. Well that that fact does it ring true at all because their net service patient revenue went up tremendously. What that shows you is if a hospital has the right leadership and the right vision they will succeed. This isn't a physician hospital argument guys. This is a viability argument for our entire state. So when you're looking at this and hopefully as you're pulling the onion back on CON we can demonstrate just through what we did here in Muscogee County that it fell flat on its face for all three arenas very easily and take the same thing as we're talking about the proliferation of health care in some of your rural counties. I think in Atlanta Center's Thames brought up I am only not only but she is very concerned about who she represents and we talked about family practice positions. That is the need all throughout the state there's some very smart people trying to figure that out. Retention we have the same thing with our residency that we have now when they're trained in larger cities they tend to go to larger cities when they get out. CLN has no impact. Other than if I'm in a rural area and we want to grow you have got to have the business model and the ability to grow and not be stifled by a CLN mandate that doesn't allow the private sector and toward these positions and or hospitals to grow to meet the need. So with that I'll end with a couple of things that are also fact. We are very fortunate to be a large enough company to be self-funded and what I mean is through our benefits plan. But what is interesting we get to see a lot of the cost across the state. We are seeing a win state. I thought seeing a win control cost. I find that interesting. Same surgery done in a local town in South Georgia, ACL. That cost to do this surgery and how do we know that we paid for. $64,000. That's happening right now in the state of Georgia. If we were to brought it to our ASC 5500 what's wrong with that. Let's go to another steel in state Tennessee. Violet will tell me replacement. $100,000. Done in our hospital 34,000. Those are real facts. I will anyone to try to refute what I'm talking about. They are facts. If for us to be able to sit back and not make a difference in our state that said joke earlier, what was it? Looking west by the Alabama. Not too funny to me I enjoy it. It has given us the ability to stay nimble and grow as a company otherwise we would have been stifled. So with that I'll pause and committee I appreciate your time. Thank you very much for pointing out this frequency and the cost between ASCs and hospitals. My question is about your legal fees during the process of trying to get your CON between 2005 and 2008. It's when you said you were denied. Do you have any kind of idea how much that cost? I don't have an idea. No exactly. There's 1.1 million. 1.1 million for legal fees. And that included everything or well. Thank you. Thank you Mr. Baker for your presentation. My question is we are here to make changes, adjustments or just throw the whole thing out with the best thing I'll need. What would be your first move? What would Gigi to make this a better? A regulation for the state of Georgia. What would you do or not? I think the first thing we're doing right now, Senator, seems. I think the thing that we're doing right now is we're sitting down. We're actually having a discussion revolving around the CON and we're going around the state. So a committee was formed which I take that very seriously. So the first thing is to look and to bring up the issues that were within CON which we've done. Personally, do not believe in the CON process. I do not. I believe that health care should be at the hands of the ones that are delivering it. I believe that it should be a decision made from the providers and or the institutions that are delivering said care. I will let some of the hospitals speak for themselves but I have had some very good discussions with hospitals. It would be insightful to grow a certain market within a certain specialty that they cannot get permission or get a CON based on that specialty right now. So if I was to do anything sitting here today, it would be a full reform of CON. No, the only piece that I would say that needs still some guidance and or oversight from a CON perspective because a lot of the times people use oversight as there's no oversight for quality in it. Look everyone with or without CON still has the oversight of joint commission CMS, AAAAAC, everybody still has to go through all the quality measures. If you were receiving a tremendous amount of funding, you're asking the state to end up purchasing or receiving funds from the state to build and or grow a certain market. I can understand a committee within CON looking at that project. But from a from a standpoint of a a private company, I don't believe there should be any CON regarding their expansions. Well, if you want to sit with me for about another two days, you can come to my office and we can walk through that and I would love to. But I would love to. I would love to. So, cost and volume really does not matter at the end of the day. Cost is when you're looking at cost, you can take one procedure or you do that as multiply at times your volume. So, you've got to look at each case and each situation separately, which is what we do even when we're negotiating a pair of contracts. We do not look at the overall in totality. We look at each different and separate procedure if it is within our hospital or within our ASC. So, from a cost perspective, when you're looking at cost, you've got to look at everything it takes to go into the cost of that procedure, which we do. We're very analytical in our in our company. We know exactly what the cost of each physician is per minute within our overall. We know what the cost is, what they use from any type of their vendor of choice to the implants that they use to what it takes to run the hospital or the ASC. So, you not only have the cost of that physician, you have the cost of the actual facility itself and you have to take all those in consideration to build your cost. That's a very simplistic answer, but more than glad to spend more time with you. Thank you Mark. One of the things that I dealt with is, when you talk about me and the state of Plenty Board, you decide something that I mean. Healthcare changes so quickly. Could you maybe talk a little bit? If you decide to build a surgery center with four rooms now, it's two to three year process, three times the decide you get it done. Talk about the difference between what has happened over the last three years for outpatient procedure. How many more outpatient rooms you need? The joint replacement to damage outpatient's fine. Quick shift. How did that use effect? Yes, so I'm sure you're speaking to the outpatient only list that was given by Medicare. So, for us, being nimble is very important and the COM process doesn't allow you to be nimble, of course. And we like to pride ourselves in being nimble. We're lucky to be, I guess, spread across a footprint. But the COM process totally stifles your ability to be nimble and be reactive to the market. Because then what you have to do is go through and I can only speak to what we went through, is three years of fighting a battle to soon lose altogether. So even if you recognize a market, and you see that we're going to outpatient only list, and I will tell you, we do with a lot of hospitals that are struggling with that right now. They're sitting with, okay, what do I do once these procedures are moved out of our facility and it goes to outpatient? How do we back feel? I'm all over the southeast. We have that discussion quite a bit with different hospitals. And if you're not moving it at direction, you're going to be left behind from a cost perspective. Because as you're being analyzed by the pairs which you are every day, and as your cost does not change with the change in times of moving to outpatient, you'll be penalized. And so to keep up with the times, you must be able to be nimble. And I find it interesting, if you don't mind, can I elaborate? So I find that interesting because that's a very good point. And it leads me back, I'm a heaven-day javu to a talk I gave to the Muscogee County Medical Society back in 03 or 04. I was looking for a flandery because he was president at the time. And what was interesting, in HBR Harvard's business review, they had this cartoon, and it was very interesting, and the cartoon was a hospital administrator and a doctor. And they were boasting at a table. And the doctor was negotiating what he thought was his, and the hospital administrator was negotiating what he thought was his. And a hospital administrator looked at him and said, look, I'm going to give you a piece of my pie as long as you recognize it's mine. So that is the inherent issue we're trying to call what is ours. You know, the hospital is going to say it's mine, the doctor is going to say it's his, it's the communities that we serve. That's who it is. And we just have to be fortunate enough to be chosen to provide the care for that community. Just as they said that we would, you know, we were all about money and we weren't about quality. I find that interesting. Because for 12 years in a row, we've won every award that you win at our hospital to include the top 5% of orthopedic care in the entire nation. We take that very seriously. And the same as our quality and safety measures through our AAAHC of our ASCs. Just one follow up quickly. So you're talking about quality and it's always in my understanding that quality really impacts cost because of less complications downstream and that type of thing. Could you come along now? Just for record, we did not talk before that question. And I find that that is a very good point. A lot of the times people will use quality and hide behind that and say it's about cost. But the time is right now where people are getting smarter to where they can actually measure what they're doing from a quality perspective. And quality does have some indications that you can control cost. I'll give a great example of that. Just recently, we did a retrospective study on close to 3,000 spinal fusions of hours. In this study, what we ended up finding and for the providers in the room, if I quote this wrong, I think I'm right. So the infection rate that I think HSS or one of the leaders within the country actually published was around a little less than a 4% infection rate, which was good. But we finished hours. Our infection rate was 0.7 and our cost was 2.3 the cost. So I can say with that, with 3,000, the power of that end is very strong. And it's now that study has now been accepted and it's about to be published. So you can actually use that and we can take that one step further if you would like in later later date. That that is getting very one-sees. Trudging the position three times a year. Amazingly, not a big surprise, but producers, the cost of CMS has been one of the programs that has reduced cost by billions of dollars. By denying access and increasing weight times and the C-LIN process, does it seem to be conducive to driving quality recalls from that perspective? I don't mean that that may be more common in a question. No, and I think you know the same thing and I'm thinking strictly from a surgeon and provider standpoint, but the same thing occurred with us with the fact when we were looking at bundle payment strategies. We absolutely the quality went up because everyone started paying attention to the post 90 days of that episode. And with that, the quality went up because you're watching the read missions went down, but absolutely during that time we began looking at that a lot closely where we didn't have the read missions. But that infection rate leads to higher readmission. Does that sound good? I think that's true. I like it. We heard... I've got a few questions. So, on this data with the cost of service, is that public record? Where can we go and look at these things? I mean, you said you know... We can provide that. We can de-identify that information and provide that. And then we started touching a little bit on cost. We've got a serious delta there. If quality is especially good, the driver may drive a cost. But yet you said a hundred thousand dollars short of the verses, a thirty-four thousand dollars short of the read. But yet, there are every four percent infection rate, no one's one seven. So, clearly, the problem is not driving the cost. What is driving the cost? What is that delta? Well, the delta is that we're still doing procedures that are outpatient only in a hospital setting. That'd be the first thing. The second piece, just the most painful out of that, those procedures were done by our physicians in those facilities. And that is the painful part because they even knew of what that was. But that's where they are doing the surgery and they had no other choice. Soon to change in the Tennessee location, we are building out a joint ASC, actually with HCA. So, we are looking at changing that cost structure. But the other we're still working on. But there is no, you can't correlate cost and quality with those two. All right, I'm going to ask you a question. I guess the really not a question. So, see what we can get as a way, competitors won't come down and build next door. How do you use us? Well, I don't, you know, I will come anybody. Someone asked us who our competitors were. And I find that, that's a hard, hard question to answer when we start trying to identify who our competitors were. And when we start trying to identify who our competitor is. 159 counties in the state of Georgia, we service all 159 counties. There are 67 counties in the state of Alabama, we service 66 of them. So, from that perspective, who I thought and who I look at as our competitor was in this area, I would say Alabama sports medicine, Jimmy Andrews and his group. But from that perspective, there was a, there was a, all these being built across the street of our clinic and a small auto park store. We said both of those probably won't make it and Jimmy will be across the street. Right. So, the thing that we do is we lock in to try to compete and do it better. If someone comes in and they open across the street or a hospital decides that they want to move on in an independent direction, it is what it is and you compete to bring your patients in and do them at the best your ability. You don't try to stay for and spend millions of dollars trying to stop them. No, you can't, the pricing, you can't go into a race to the bottom strategy. That's any business. You want to look at what you want to do from a race to the bottom. You can look at what happened in the mid 90s when everybody was trying to get for the, going for the new payment structure, and they lowered it in like physical therapy, I was a physical therapist at the time. Everybody dropped their rates because they thought they were going to get more from your PPO plans when they were all first coming out. They said for us to be in business we got to drop our rates. Well, what ended up happening? They dropped their rates to the point to where, guess what happened then? You can't find a physical therapist because they ended up terminate them. Luckily, I held my job in my career, but over time they ended up realizing you can't go to a race to the bottom to where it's going to have a negative impact on your organization. I don't think any business would do that. I thought it was a good question. Hey Mark. Thank you. Appreciate your testimony. Appreciate your comments. Yeah, we've worked together in a couple of different areas now. One of the ideal areas that I'm going to be working on is the one that I'm going to be working on. I'm going to be working on the other areas that I'm going to be working on. Thanks Mark. We've worked together in a couple of different areas now. One of the ideal, currently, and certainly in Dublin. I know our two organizations have worked together in many other areas and many of the counties he discussed. I mentioned, I appreciate your comment about being an imbal. We've talked about before, particularly in Bidali and Tum's County. We've gone through a reform and a transformation at our facility to ensure that we're viable for the future. As you know, and many others know, we have a specialty hospital right down the street from us. And at the end of the day, what we're trying to do for our community is provide a well-rounded list of services. Some that provide margin, some that don't, which we'll call loss leader type programs, the statics, ER, medicine, et cetera. So, we've had to be nimble and be creative to find a way to ensure that we're continuing to provide high quality, high access services across the board, not just orthopedics, but in some of those other areas as well to our community. That's our mission and that's our responsibility and obligation. Because I go around the state and speak with our peers and facilities big and small and talk to community members. The question for the worry that I continue to get from them is how do we continue to keep our doors open?\n\noffer these lost leader type services when the potential of the services that will then pay for them are leaking out and so my question to you is if you are amongst your peers in this room of hospitals right across the state how would you advise them what would be your response yeah that's these are kind of discussions I actually like having something glad you you you couched it that way because it's real you know if you look in the state of Georgia and you look at the number of hospitals that have closed I think there's 30 something counties that are listed in the state of Georgia that are rural and I think you've had just in the last few years like Twale but some of the rural hospitals closed you know when you look at that and you talk about use the term loss leader you know even in our industry and undo a comparable in our industry a loss leader is covering Friday night it's gonna be small covering Friday night football games why is that a loss leader you make no money zero and what I found interesting it fits to what our mission is so they're we cover over 42 high schools and about seven colleges our Medicaid no paid is more it's a little above 4% I know what treating the loss leaders are because we do it every day our MRI we do 7% so I totally totally understand and to the loss leader and when you're in a community of a hospital you you have to look at how you provide that because you're a full service and you have to provide it and as a challenge but at the same time I would say to a hospital leader and I'm not gonna hide behind the fact that I'm a CEO of a hospital as well I get it I have a full-lead the understand is the need to find and embrace areas with the physicians of the ones that have a choice and how do you collaborate to bring them in I will say Pete Mont just use an example Pete Mont's done a great job with that in this area they've done a great job with that throughout the making areas well and we're we're looking at different ways to be nimble and collaborative it doesn't mean we always agree I mean there are times we're sitting in a bordering we don't agree one bit and but what I find interesting is we're able to walk out unified and we'll come back and we'll figure it out we're not scared to compete against each other it is a very healthy relationship so with that if I'm a hospital administrator in a smaller town which I will tell you a lot of the times I wish I was because I see opportunity that sometimes they do not because it's forced to the trees right but the the number one thing I would say is to embrace to provide or to make them want to be in that facility is is where I would where I would start but I don't understand all the leaders we do quite a bit of it thank you yep deaths you know, I don't, as a policymaker, I think the largest concern that you would have is the unknown and what that means to your legacy as a policymaker and making that decision, right? So you're looking at what the unknown, am I making the right decision to move forward? So as I was, if I was once in there looking at that, I would look back at the last 30 years of what CON has done within the state. And where it has been in the last 10 years and what is it's done for our rural health care, I can't measure or see anything to where it's been favorable for our rural health care. No, no problem. No, no, not at all. Yeah. Well, I'm going to give you an example of what I've seen. So I'll give you an example of Russell County Community Hospital in Russell County. Russell County Community Hospital was about to become the fifth, I think fourth of fifth hospital that is closed in Russell County, right? So when we went in, what we ended up finding out is they had zero eyes on the ball of what the cost was to provide care within that facility. So when we started looking at it, the fact that the old cliche of blocking and tackling is true. Everyone loves to say health care is complex. It is so complex. Last time I checked, we got some smart people in this room and health care is complex, but so is any other business. And it really comes down at the end of the day of revenue, minus expenses, you either can make a profit or not. And then you've got to look at what you have within a community to provide that health care. Do you have enough within a catchment area to where you can provide care? So from a COM perspective, my comment just to be clear was that the three pillars that COM was based on has not prevented the closing of hospital. I didn't say it was because of COM. So do you think that that complex complexity of health care, because it can be, depending on who's who's talking about it? I'm not a provider. I'm not in health care. So there's a lot to learn about it. Okay. So do you think that that complexity is created sometimes just to confuse the individuals that need health care or that are involved or even the providers? No, I'm not going to sit here and try to suggest that people are being misleading. That's not where I'm going. What I'm suggesting to you is that every conversation that I've had and even once I've seen in front of this committee over the past 20 years have used that comment, but the issue at the end of the day, it really comes down to the blocking and tackling within a facility going back to what we spoke about from being nimble in a community to be able to recognize the need and the cost associated. Thank you. Yep. All right. Thank you committee for your questions. Thank you very much for your testimony. Next, our list is Dr. Shane. I think it's Dara over probably going to put her in a picture that we apologize if we did. I consult the Dr. Watson and we're going to let you blame him. Let you blame him. It's wrong. Did we get it right? What's that? The last question of your last name? Yeah, Dara. Well done. The floor is yours. Yeah. Yeah. I'm Dara to a lot of people. One of my medical school professors called me Dara on the first day and kept calling me Dara. I'm pretty sure that he knew how to say it, but he just didn't want to. And he could say it, whatever he wanted to say. Thank you for being here. Thank you for letting me speak to you. Welcome to Columbus. My hometown, I was born here, grew up here, went to undergrad, went to high school here, undergrad here, went to medical college of Georgia and Augusta from medical school from there, went to Emory and did my internship in residency. And then from there went to UNC Chapel Hill for General Cardiology and interventional cardiology fellowships. I'm here today to ask you to adopt a recommendation in your report that the CON law be amended to allow the specialty of cardiology to do pretty much with all the other specialties are already doing. And that is to operate a single specialty surgery center under an exemption to the CON law. And I think we can understand that CON law impacts every or nearly every level of health care services in Georgia. And in my opinion, interferes with the ability of providers to decide when and where to provide health care services and patients pull access to those services. If you decide to repeal CON law or significantly reduce the scope, reduce the scope, I'd support that. But my issue along with those of many other cardiologists in this state just would be resolved by modification of the law. The CON law, my understanding has been in effect in Georgia for over 40 years and has not changed in a meaningful way that recognizes the evolution that is cardiology today. The Georgia law now requires that every procedure done from a cardiac standpoint be done in a hospital. And when cardiology was in its infancy, that made sense when we were just getting started with these procedures. But these procedures have evolved dramatically. And the law has not. It's likely that, and again, I certainly cannot speak to how it was formed or the decisions around that. But my guess is that the CON law mandated that these procedures be done in the hospital because of the time the law was formed. That's where they were done. And it just became cemented. But now, the procedure has changed. And at the very least, I believe that the law should as well. So I'm going to share my perspective as a cardiologist. And I think it reflects the views of a lot of my colleagues throughout the state. And I want to explain a little bit about the procedures and what we do. And then I want to cover three issues that are cost availability and opportunity. So some of you, I'm sure know what a cardiac cat is and some of you may not. And that's a procedure that I do. I'm an interventional cardiologist. And I put a small flexible tube either through the arm or through the leg. And I go up to the heart. And once I'm there, I can then make a diagnosis. I can figure out what's going on. Once I haven't understand what's going on, I can administer medications. I can deliver tools. I can do work within the heart to address a myriad of issues. And that might be a clogged artery for a patient who's having a heart attack or is having unstable angina. It might be to address a heart rhythm issue. It might be for heart failure. There are some specialists who deal with congenital heart defects that people are born with. There are a lot of things that we can do. And these procedures are very different now than when we started. Percutaneous cornea intervention or PCI. That was first done in 77. That was in first grade. And a lot has changed since then. And that procedure, again, is used to unclog cornea arteries if you're having a heart attack, if you're having unstable angina. And now, PCI, thankfully, has replaced open heart surgery for a lot of patients who there was a time when that was the only option. If you had one blockage, you got open heart surgery. Now, you only need open heart surgery if there are many blockages that we can't fix with stents. And that's a great change. And we've had other techniques and devices that have improved outcomes, short recovery times, getting patients home quicker. In the infancy of PCI or when these procedures started, it was a brave new world. And at that point, there was a lot of concern about complications and there were complications and they were significant. And so when we first started, and this was long before my time, if we were going to do a PCI, you had a heart surgeon standing beside you. He wasn't doing the procedure, but he is available. You had a full OR staff scrubbed and ready to go because if the interventional cardiologist has a complication, then you stop, you wish the patient away at the operating room, you open the chest, and you fix the problem. And that's how it was done. It evolved time passed. And we found that, well, we've got a lot of surgeons that are just standing around when they'd rather be operating. And so the rules changed. And eventually, the decision was made. You know what? I'm going to let the surgeon just go sit in his office, and we're not going to have the whole OR staff just sitting around doing nothing. But we'll keep an OR available. And that was the rule. When I first started doing PCI, when I came to Columbus in 2004, that was the rule. Whenever we did PCI, there had to be a heart surgery operating room and a surgeon that was available, some way somehow. And then I remember when we went off that standard, such that PCI could only be done in a hospital with heart surgery. But you didn't have to have a heart surgeon that was necessarily available. So if you've got three ORs and three heart surgeons, they might all be busy. In a case, it's going to take four hours, and I just go do my engine plastic. And if I'm unlucky enough to start an engine plastic and have a complication, and all the ORs are busy, well, then I just have to deal with it. But the techniques, the equipment, the medications, had evolved such that that was acceptable. And we've done quite well with that. And so we've evolved even further. One day we realized, gosh, we almost never sent patients to the operating room. And so in 2011, the American College of Cardiology Foundation, the American Heart Association, set up a task force for the guidelines of PCI and updated the recommendations to consider letting us do PCI in hospitals with no heart surgery. And that was a huge leap. And I want you to understand, because it has a lot, it ties in with doing PCI in an ASC. So back in 2011, they said, hey, let's look at doing interventions in a hospital where there is no heart surgery. And so they did a study. And the study showed that it was safe. And then we started doing it all across the country in Georgia. We started doing angiplacies at a hospital with no heart surgery. If you had a complication, you had to pack that patient up, and then put them in an ambulance and then send them to a hospital with heart surgery. Why do you do that? Because it's safe. Because those complications almost never happened. And that's what we did. And so in 2014, we had been doing that for a few years, and we came back and looked at the data. You know, we all thought it was safe, but the same task force revisited the issue and said, well, how are we doing? And what we found was, is that the mortality was no different in those hospitals who did not have on site, as we call it, surgery. So we didn't need that anymore. And that's a long way, a winded way of me saying, it's safe to do these procedures in an ASC. Because we're already doing it outpatient. We're already doing it in facilities that don't have surgical backup. So why is it unreasonable to do it in an ASC as opposed to a hospital where there's no heart surgery? Either way, if there is this unlikely but really serious complication, we're going to have to send them to a hospital that has a heart surgery. Oh, and by the way, this has been done in many other states, where there is no CON loss for years. And it has been done safely in those states for years. If you just go south and Florida, there are cardiology ASCs sprinkled throughout the state, and they're doing this procedure safely, and they've been doing it for some time. So moving on, let's talk about the elephant that's already been mentioned in the room, and that's cost. And, oh, yeah, you're back up there. And he mentioned it. I'm a small five-man group, but we're a private practice. We are not big enough to be self-funded. We have to go by insurance, like everybody else, but it's killing us. And the irony of me as a healthcare provider sitting before you and complaining about the cost of healthcare is not lost, but it's a fact, because I'm also a small businessman, and you have got to be, I know you're hearing that from your other constituents. We've got to do something about this. Our cost have gone up 20% in the past two years, just for what we pay. And that's not just with addition, of more employees. That's just the cost of what we're paying for healthcare. And that's got to change. Because the hammer, you know, my fear is just a healthcare provider. If we don't do something about, the hammer is going to come down, and that's going to, I don't know what that's going to look like. I don't want to find out. And we need some creative solutions, and we need to find those now. But the fact is, heart-catheterizations are much less expensive when they're done in an ASC. That is just the fact. Based on some research, CMS decided to pay for PCI procedures starting in 2019. In 2020, they basically covered them all. It started with a few procedures, and then they gradually expanded that to more and more and more procedures. And my understanding is that Medicare is paid for PCI procedures in ASCs in 28 states. And I think Georgia should be one of them. I don't think there is a really good reason why we're not one of them. CMS calculates payment for outpatient credit procedures of interest differently. And this is over my head for ASCs and hospitals. How they do things I don't know. But I know that it is much less expensive. And that translates easily, and we all know, into cost savings for Medicare, into cost savings for seniors that are on Medicare. But also on plans like mine that base they're allowed amounts on Medicare fee schedules. CMS estimated that moving only 5% a small number of corny interventions nationwide from a hospital outpatient setting to AACs would reduce Medicare payments by 20 million cut copays by senior citizens out of pocket by 5 million. That's based on 2020 data. There are other ways we can save money, and I'll address that. But let's talk about availability. And when I say availability, I mean to patients in Georgia. If we agree, and I think we should agree that AACs will lower costs, then that in of itself makes the procedure more available. And this has happened to me several times. I see a patient in the office. We decide and share decision-making that they need to have a cath and probably a PCI we schedule the case. Patient finds out whether out of pocket costs is and doesn't happen. And then I see him back in the office, they're still struggling, what's wrong, and they say, I can't afford to do it. Or worse yet, we see him in the hospital because they really were struggling, and they never happened because they couldn't afford it. Happens all the time. And this is probably a patient that has insurance, but they just have a large copay, like I did. And so that is a huge barrier to access. And if we improve costs, we're going to improve access. I've heard the argument that if we, against AACs, that if we allow cats to be done AACs and let the genie out of the bottle, that we're going to start seeing AACs and cath labs on every corner. And that's going to be a bad thing. It's just going to be wild proliferation. It's going to wreck health care. A counter argument that I would respectfully make is there are a lot of corners in Middell and South Georgia that have nothing. There's nothing on the corner. And these patients don't have access. They have to drive a long way. And I can tell you, for some procedures, for some cardiac procedures that we don't have in Columbus, there are some patients that will not go to Atlanta. They absolutely, they just will not do it. They either cannot do it. They don't have the means, or they just won't. And sometimes these are life-saving procedures. And I've had discussions with patients about a condition, aortic stenosis. If it's severe, you've got a 50% to your mortality, I know statistics. But that means in two years, half the people in this condition are going to be dead. And I tell that to a patient, they understand it, and they say, I'm not going to go to Atlanta. And so, what about the people in South and Middell, Georgia, that don't want to drive to Columbus to see me, to get a PCI? What about them? Building an ASC, building a cath lab is expensive. I think it's a lot less expensive than building a hospital. And I really believe that Georgia physicians, Georgia cardiologists understand their market. They understand their patients. And I think they can be strategic about what corner to put a cath lab on. And I think that is going to be an important way that we can expand access and make that available. And I think that's the direction that we need to move in. Finally, I would say having cath labs exclusively in hospitals restrict access. And I think this fact was absolutely laid bare during the pandemic. Here in Columbus, it was a catastrophe as it was worldwide. Our cath labs were essentially shut down, except for emerging cases. So all of the elective cases, for weeks at a time, we would just have to cancel. And for good reason, because we had to redeploy resources, staff to other places for sicker patients. And that was the right thing to do. And I was part of those decisions. We had to do it. But a byproduct of that is that you had this huge list of patients who were supposed to get heart cats that never got heart cats that couldn't get heart cats. And even when we started pranking back up and doing things, we were trying to work down this number. Some of these patients who were on the list to get a cat that didn't get a cat ended up having heart attacks. And some of those, and I knew them, some of them died. And so that is not a criticism of the hospital. I was, I mean, again, I was part of that decision. And I think they need the flexibility, the hospitals due to deploy staff. And are we likely to have a pandemic again? Hope not. But I don't think we can absolutely predict what kind of challenges we're going to face in the future. And I think when a hospital has to respond to public health emergency, we need to have access to outpatient care so that the surgeons don't become to help emergency themselves. I would respectfully submit that CON student the way of access to care during the pandemic. And I would respectfully submit that it still does stand in the way of health care. Again, we can't foresee every obstacle. We never will. But I believe that having more access to care at different venues will make our health care systems more resilient. And I don't, I just, I don't want to lose another patient or have to decide duck duck goose trying to figure out who do I need to move to the front of the line because things are so restricted. That was an agonizing time. And again, we all did the best we could during that. Last topic, opportunity. And this is one that's near and due to my heart. And that is shortage of physicians in Georgia, and specifically a shortage of cardiologists. It's terrible. And for our group, that is the number one challenge that we see is trying to get cardiologists, quality cardiologists to come to Columbus. And it's my home. It's a great place to live. But there's not a cardiology fellowship program here. And so I don't have the advantage that Mark does. I mean, he can go and look at the cream of the crop and the ones that he likes. He can just pick and choose. And say, hey, why don't you join the 18? I don't have that luxury. I've got to go and try and recruit people from Cleveland, from Emory, from big centers, sometimes that are very, very, very far away from Columbus. And I can remember when I was leaving Chapel Hill when I was talking to my friends, where you go? We'd all talk about where we were going, where we were finishing. I would say, I'm going to Columbus. And they'd say, Columbus, Ohio. I said, no, Columbus, Georgia. And then same conversation. You mean Columbia, South Carolina? I mean, I did this many times. I said, no, there is a place. It's called Columbus, Georgia. That's where I'm from. And that's where I'm going. And I say that it was kind of funny at the time. It's not so funny now because I'm kind of stuck in that same conversation when I'm trying to convince a high caliber cardiologist who's finishing up in Ann Arbor, Michigan to come to Columbus, Georgia, or convince a spouse to come. That's the bigger part of it. Now, when people get here, they love it. And they want to be here and they want to stay. But getting them on the hook is hard. And when the only opportunity that I have is to say, well, we're just going to come, we're going to go to the hospitals. And we do this all the time. I'm going to go to Florida. I'm going to join a group. They have an ASC. They can do their own, they're in charge of their own destiny. You in charge of yours. What's going on in Georgia? Oh, no, man, we're really progress to state. We're growing. We got a lot of stuff going on. Not in health care. You don't have much going on there. That's what I get told. And let me be honest and frank is, is, you know, if you eliminate CON today, if we could, would that, would that solve that problem? Absolutely. It would not. But it would be an important tool. And we need it. We need, we need to strengthen physicians. I'll give you another statistic. And this is cardiology. 70% of cardiologists nationwide are now employed. And I call myself unemployed. And what I mean by that is they work for the hospital. And, you know, the minority of us are independent.\n\nAnd I don't want to act like that's an evil thing. The employed physicians are not indentured servants. I'm not saying they are, and I'm grateful, and we're all grateful, that the hospitals have stepped in to hire and employed physicians, because there are some physicians who want to be employed, but there are a lot of them who don't. And there are a lot of them who want to be in charge of their own destiny, but they just don't have the opportunities. And that's something we need to change. We need to attract stronger physicians that have an entrepreneurial spirit, and we can do that if we have ASEs. We can put them in more in charge of healthcare. That's going to make Georgia Columbus our community's attractive. That's going to help us solve the problem. We need to do that. We need to make some changes. What else have we got here? Dr. Lincoln, you've got a few questions up here. Sure. Joe Ross. Thank you, Dr. Bay. In your opening comment, you mentioned you're in favor of single specialty exemption. And I can see in a populated area like Columbus, or inside a 285, or these metropolitan type areas where that could be a benefit. But when we talk about access in rural Georgia, I mean, are we going to see single specialties locating to rural Georgia? And I guess I'm kind of leaning into this question, is would it make more sense to have multi-specialty in these rural counties where you could maybe do cardiology? You've got the, you don't have enough population to support five days of cardiology down there, but you might have the opportunity for one day down there, go see patients, and one day do some surgeries down there. But if you spread that out over, say, three or four or five specialties, then maybe we could attract at least some partial business down there, if that makes any sense. Just wanted to get your thoughts on that. And maybe getting a little over my head, and from a, when you say multi-specialties, what do you mean by that? Instead of going and opening a single specialty clinic in O'Fair, of cardiology, and running that five days a week, it may not make, and I may be using the wrong terminology, I'm not a doctor. Self-appointed doctor, but, yeah. If you did cardiology on Monday, or Thursday on Tuesday, guide everyone Wednesday, now you've got, you know, maybe your doctors or your specialists travel around to, you know, instead of having one central location in rural Georgia, they've got maybe smaller ones throughout the state, and they're traveling to each one on different days. I'm just trying to think of, I mean, the access piece is to me, the biggest issue. Agreed. Well, besides cost, but I won't get in that. But for this question, my concern is access. My concern is the lack thereof. Once you get outside of metropolitan areas in this state, how do we fix that? So let me just make sure I understand the question before I answer. You're asking me how I respond if we amended, change CON in such a way, such that it was, that you no longer needed CON for a multi-specialty ASC, such that an ASC exists, where I could come and do a cath on a Monday. One of Mark's orthopedic surgeons could come and do surgery on a Tuesday. OBGYN comes on a Wednesday. Gastroenterologist comes on Thursday. E&T comes on a Friday. 100%. I would support that. Yeah, yeah, absolutely. And I think, yeah. Good for you for being so creative. But yeah, I would support that. There's a small business owner. Would you be able to, you know, thrive in a system like that? I mean, would you look outside of Columbus to go to a county maybe four or five counties over that doesn't have access? Would you as a small business owner in a ASC owner? Would you look, would you consider doing that? Absolutely. That would absolutely be in our wheelhouse. We are, we are nimble as our middle name. We have to be. Yeah. Thank you for the question. Comment in a couple questions. Yes, ma'am. I'm here recently for another meeting. And I hope you're taking your potential recruits to that rooftop bar that overlooks the river downtown. Well, we have indeed. It's amazing how much overlap there is with everything that we do in the legislature. So I'm on another committee about recruiting medical personnel to rural areas that is going to be for the first time next week. So I think it's really going to be an interesting conversation. And I just wanted to tell my colleagues, Senator Brass, that we used to have a multi-specialty CON. We don't have it anymore that went away. I don't know how many years ago, probably 25 years ago or something like that. But we had one surgery center that did have multi-specialty CON. So that's something to take another look at. And I guess my question is on the outpatient PCI's, I've been fortunate enough not to have one yet. Congratulations. But would you be entertaining 23-hour like outpatient stays or be pure outpatient in your dreams? In general, we would be entertaining the lower risk procedures with the ones that would go that day. And I think that's an important point that I should have mentioned in my comments because, I won't belabor this, but I think an important criticism that is that, well, gosh, if we pull all these out, that's going to really negatively impact the hospitals. All the procedures are going to go away. They're going to go to the ASCs. None are going to go to the hospitals. And I would say that is false. And here's the reason why. Because I was on call this weekend. And I was doing cats all weekend at the hospital. Because patients that have heart attacks are going to go to hospitals every time. We're not going to do heart attacks in an ASC. Complex procedures are going to go to the hospital. And incidentally, the more complex procedures are reimbursed at much higher levels. And so that is going to preserve the revenue in my mind for the hospitals. And the other thing I'll just speak to that, I don't want to diverge too far, is that if we can really do this, if we can really bring in a lot more physicians, if we can make that change, there is a lot of need out there. We can generate a lot of cases. And I really believe all the boats can rise. Thank you for your question. Thank you, Mr. Chairman. I did a couple of questions. One is, I think you alluded to recruitment and opportunity and that kind of thing. How is quality, cardiologist recruitment affected in a negative way because of CON? Is that an understanding I got from, can you allude to that and expand on it a bit? Absolutely. I'm not a problem here again. Yes, thank you. It absolutely does. We lose recruits in our strategy is to, we like to recruit cardiologists right out of training. I like to get fellows from quality programs that have really good skills, really good attitudes. And I mean, there is a shortage of cardiologists in these people can go wherever they want to go. And look, this is not just medicine, it's business. If you want a quality person, it doesn't matter what you're doing, if you're selling cars, you've got to have a quality opportunity for that person. For a young, very talented cardiologist coming out of training, a big part of quality opportunity is being able to go to a cath lab that they own, that they have a stake in, that they have direct control over. That's something that's very important to them. And we lose quality applicants to states where that opportunity exists and it doesn't hear. Given the closings of the rural hospitals we have experienced right now, all of us have that now. Tristan, my district, I think the center, from the 12th as well, the closing of those hospitals. Do you think there's a real role and a great opportunity for surgery centers, small operations to locate on those areas as opposed to, or maybe be a compliment to telemedicine or something like that? Would that be an answer to the closing of those hospitals looking at it in a financial way? Senator, I think that's absolutely a direction that we can go. And I think that is a great way for us to get a foothold in those areas. And let me tell you how that would work. And again, we, in Columbus, I get referrals from outlying areas. And so we identify places where we tend to get a lot of referrals. And the first thing we might try and do is set up a satellite clinic. And if we could establish a cardiologist in that area to go one or two days a week and mark, then that for years. Then eventually what we would do is say, you know what? We get a lot of patients from this area and this area and this area. And we can start doing catheterizations in that way. It cuts 60 minute drive to a 10 or 15 minute drive. And then we do that for a while and then maybe it builds. Maybe then that becomes a foothold and then we can start doing other things. And maybe that area starts, we start doing hardcasts. Maybe then we can start doing other things. Maybe we can start doing some vascular procedures. And maybe that is the way you build and build and build and then maybe you're talking about later. Maybe one day you can do a small hospital. And finally, Dr. Daron, by way of full disclosure, Dr. Daron is my personal cardiologist and a long time relationship. Well, in fact, my wife was this teacher in the fourth grade. So I'm not picking on her. I'm worth it. Planned five. And then the extension elementary fourth grade. Go, Jargers. You and A student. Finally, how does CLVN apply in that context? How does that work with the surgery centers? Would that still be applicable? Or would that just grow away in your mind? I don't understand the question. So, if the surgery centers would to replace the hospitals and the rural areas and operate, how do you see them operating with the ability to make sure that you know you got patient protection. You have the adjacency to other hospitals of the surgery centers. How would that operate be constructed in your mind? Are you saying if we put a surgery center in a community where there is not anything now? And that would be protected in your mind if that would be the only one in that area. That is that ideal. Would that be much more serious, as it is like to see the zoom in, things like that. You see that as being, that would be allowed to be the only one would it be open competition? Let the free market prevail. Well, I would be in favor of letting the free market prevail. I just do not think that there are going to be a lot of surgery centers going up in places like Cassita. I think what will happen again, because it takes a lot of resources to go build an ASC. And if somebody like my group is doing it, we have to be very careful how we deploy those funds. So, what we are going to do is we are going to identify that there is a need and then go there. And I think if we are in that place or someone else is in that place, in doing it well, I do not think that there is going to be a real need or an opportunity for someone else to come in and throw in another surgery center right next to that one. I mean, if a lot of people start moving to Cassita, whatever reason in that place just explodes, which we would love to happen, well then yeah, there might be more need and there is a need for more healthcare. There is a need for a lot of other services. But I do not feel like from my perspective that we need to have that protection where if I plan a flag on an ASC in a place that no one else can come there, I think if I am meeting the need, if I have got quality, then no one else is really going to want to come there. And if I am looking at an area and someone else is already there and they are doing it well, I may not want to go into that market because there isn't any. And I am answering your question. Thank you, don't do. Yes, Mr. Chairman. Thank you, Mark. Senator Sim. Thank you. And thank you for your presentation. My greatest fear is, and it kind of plays out every year in the legislature, that we have different groups, organizations, providers, what have you, that will come and say this is good for rural Georgia. And I want to be very, very candid. I want to talk about that. And sometimes the legislation is written to accommodate rural Georgia. But most times it doesn't play out that way. We really get the short end of the stick. So when you are talking about CON and I really want all of us to think about this, when we are pulling this policy together, the legislation, think about it before you say it. Don't say that this is good for rural Georgia when you know that it's not, you're not going to show up. And I hate it, but I'm being very candid. But in this business a long time, I've seen a lot of different instances where we've been made promises and they just didn't materialize at all. The rule Georgia is complicated. Just someone said that medicine, medical care is complex and it is. But you are also business people and you're going to look at your bottom line. We want you to also look at the individuals that need the service, but who's given away free service? Nobody. And we don't expect you to. So as we move forward with our conversations around the CON, we want to hear the truth. We want to hear how are you going to write legislation that will positively impact rural Georgia. We know that there's no magic wand here, but we really want to hear the truth about it and how you guys can help. So that's pretty much my, it's not a question for you, but just a comment. Just like you said, would you, are you going to go to Cassida and put up an ASC there or any of the other folks in the room or no? That's not likely to happen. But don't forget about that part of Georgia. How can we be innovative and creative in bringing quality health care to the rural parts of the state? That was just a comment. Yes, ma'am. Ma'am. Respawn. We're a little short on time before I want to try to get us up by lunch. So we'll move to Martin and I'll let you close your comments. Okay, we'll go in. I just shame first of all, I appreciate your testimony. I want to clarify a couple of points. I think that we were hitting around. I want to make sure we're hearing it correctly. Our one is under the multi-specialty CON. There was comment that there, what is your opinion of multi-specialty CON? Are you suggesting that multi-specialty needs to be protected by CON or not? I guess what I'm saying is I would welcome the opportunity to be able to go with you and have a surgery center where I can do a cast where you can replace a hymn where someone can go in and remove a polyp. Or someone else can go in and do a GYN surgery where someone else can go in and do an E&T surgery. That's what needs to happen. That's what needs to be able to happen. I'm sorry, I may not understand the nuts and bolts around how that happens, but that is what should happen. I heard you. I just wanted to make sure everyone was clean. Thank you. And I tried to disclose that the terminology I'm not the most familiar with, but that is the vision that I would. Suggest is the best. The second piece is the rule of Georgia and analyzing. I want to make sure I understood that correctly as well. As you were looking at a market and you noticed that there's an opening in a market, you're talking about that you would start out with a few providers, test the market, if you will. And then see if there's actually the need to expand those services. Is that what I'm hearing? Correct. Correct. Okay. The reason up for me, we do kind of the same thing with that, I just wanted to make sure I understood that correctly as well. Thank you. Thank you very much. Thank you very much. And first off, go heels. All right. Appreciate your testimony. The progress in the field of cardiology over the years is just extraordinary. As you know, I remember just over maybe a decade ago starting up doing trans-york valve replacements and novel these days, you can do it. And it's a, it's a same day procedure. So it's quite fascinating. I wanted to, a couple of comments I wanted to address from both yourself as well as Senator Simps. First and foremost, Meadows, which is based in Videalia, is a STEMI center. We have 15,000 people between Videalia and Lions. And we are the only STEMI center within 45 to 50 minutes and any given correction. Because of that, we save lives. As we talk about in stroke care, time is brain and STEMI care, time is muscle. And so we're very grateful to have the expertise in our community. A lot of folks are size don't have that. I think what we have is not only good for the health and the outcomes of people in our community. But it's good for the feasibility of healthcare in our community. It allows us to pay for some of the services that we are obligated to provide. And we're financially, by the difficult to provide, as I learned earlier. Dr., or to Senator Simps comment, we do provide free healthcare. 11% of the encounters we provide at Meadows are self-pay or indigent care. 25% of the patients that walk through our ER, 1 in 4, don't have a means to pay. We provide them services. On top of that, we pay almost $45 million in urgent care. And to Mark's point earlier, we are a public for-profit organization. So we pay $3 million in taxes as well. So I say all that because cardiology services for many facilities, hospitals, allow us to provide other services, ER services, medicine services, obstetric services. And so not a question for you, but I think as a committee, we need to understand that we are one away from none in some of these communities. And to do, especially type care. And removing cardiology of statics, building the blade, God of some of these communities creates vast deserts. And when we talk about time, as muscle, time, as brain, minutes matter. I just want us to really consider, you know, is this good? And I'm indecisive on this. But how do we ensure that if we're looking at opportunities to remove these from the hospital, how do we counter and ensure that those hospitals are able to continue the financially sustained? Thank you, Matt. I just wanted to build on that as well. And I guess I had just a couple of kind of clarifying questions and maybe getting a little bit more into the nuts and bolts, because I said I'm the one who's sort of overseas these. And I know I'm responsible for I think we fill out, I think it's eight to nine PCI programs every year where we are trying to keep those within our hospitals. And for the ASCs, would it be, would you be open to diagnostic cardiac, or do you want both diagnostic and PCI? Both, diagnostic and PCI, because you don't want to, I don't want to have a patient on the table and say, oh, there's a 99% stenosis in your right coronary artery. So I'm going to take you off the table and then we're going to schedule you to go back and have it done another day, another week, while that can be done theoretically, nobody wants to do that. And so we would want both. You would want both. They're a put again diagnostic, correct. And I think probably just another, and this may be a little bit for the committee to consider as well, is that with the PCI, I think it's a 200 cases threshold for the hospitals. Would you see that same threshold, the could you sort of make out without having the emergent? Would you be able to sort of make that work within ASC as well? I think that we could. And I think the thing, I think we would also have to really kind of consider, is I think he said you wouldn't do the emergent cases, right? No, we're not, yeah, we're not going to have hot ambulances pulling up at the ASC in the middle of the night. And so with I think some of our smaller hospitals reaching not 200 threshold can be taught. And so if you pull out some of those and we then lose the ability to keep that hospital, which within you would then lose the ability to bring in emergent cases. So that could really be an impact to a community that we could probably really want to still consider. And I would say, oh, it absolutely does. And I think, I think as you do this, I think you're just going to have to look at that number. Because quite honestly, the number, and you know, it depends on how you look at it. The number of PCI procedures on from some respects are going down. And that is just because the medicines are working. You know, people are here in the message. They're smoking a little bit less. Now, there's some other problems that we're wrestling with. And this is something that we struggle with on the level of credentialing providers, meaning that there is a certain number of procedures you need to be, you should have done every year, every two years to be deemed competent. Well, there are some good clinicians now that sometimes struggle to make those numbers just because they're just fewer of them. Well, that's great for patients. I mean, it would be wonderful if there was no one ever needed another cat in a PCI. That would be wonderful. That's not reality. But I think there are a lot of reasons why those numbers might go down. And so I think that would need to be addressed. And I think when we do this, we need to say, hey, you know, that 200 number probably should go away, because I don't know that that's, I think you're going to bump into that, even if we don't do this. I think you're going to bump into that number. But I think I feel like we could make it, but that risk is there. Thank you so much for your testimony today. Thank you members of the committee as well for your continued robust questions. Commissioner Billy Mathis, you are up next. Thank you. Absolutely. I really like you to try and stick to the 10 minutes because you can see the questions are robust. I'm only telling you that because you're a politician. So I know I'm putting a microphone in front of you. You could be dangerous here. But thank you for testifying today the floor is yours. Thank you for having me. My name is Billy Mathis. I'm the chairman of the Lee County Commission. You pulled out microphone. You got a lot of people watching online right now. Thank you. Chairman Lee County Board of Commissioners, I'm serving my fifth term. So I've probably been there much longer than some people would like. I was invited here to tell our story of trying to build a community hospital with the certificate of need laws as they are now. We're a small county population wise. We're approximately 35,000. We're a large county geographically. We're a very fast growing county. We're fortunate in Lee County to have good folks, to have a lot of money, which most people in South Georgia don't have as far as counties are concerned. So we took it upon ourselves to try to build a small acute care hospital. A little bit of history. We have one hospital in our service area in the county next.\n\nThere is one hospital for, I believe, 39 years there was two hospitals in that county. And the one hospital is there currently, bought the second hospital. So we only have one hospital. Many people leave our area to search for healthcare. But before I get to the story, Senator Brass asked a question about multi-purpose surgery centers. Now I want to be very specific how I answer that question from the standpoint of what we were doing. We were going to build a small acute care hospital. 60 beds with four operating rooms. So it would have served the need of what Senator Brass asked, but it would also have been a real acute care hospital. It would have also served indigent patients, which the law requires us to do or would have required us to do if we would have built that hospital. So not only would it have served the purpose that Senator Brass asked about, we would have also served indigent patients in that hospital. But the reason I was asked to come is to tell a real-life story of what it's like to try to build a hospital in the state of Georgia with the certificate of need laws as they stand now. When we started our quest to build a hospital, we knew that it was going to be an uphill battle. I think there have only been two certificate of needs granted to build a hospital in Georgia in the last recent number of years, and we were one off them. The certificate of need laws to take you through what we went through for the first couple of years after you are granted a certificate of need, you fight litigation. The code in Georgia encourages litigation, basically. So you get your certificate of need, and then all sorts of folks, Sue, you could put it very plainly. We had objections filed by three different organizations almost immediately after our certificate of need was granted. The Georgia Alliance of Community Hospitals, Dardi County, the county next door to us, and Chris Regional Hospital, which is a hospital some 35 miles away from us, all filed objections. These are all the objections that were filed against us almost immediately. So for the first two or three years after your granted a certificate of need to build a hospital in Georgia, you basically are tied up in litigation. We fought these things for years. We spent a lot of money, and we won all of those battles. But to win those battles, you spend millions of dollars, and you waste a great deal of time. The first two or three years in our quest to build a hospital, it was all litigation. After the litigation was over, COVID hit. So for the next two years, no one was building anything in the state of Georgia. First three years of litigation, second two years after the litigation, COVID, and then after that, we had turmoil in the bond market for a few months. And this is the short history of what we tried to do. And in Georgia, under the law, the state of Georgia can pull your certificate of need really at any time, just because a bureaucrat in Atlanta decides that's what should be done. We were very, very close to building our hospital. We had done all of the work necessary to build a hospital. The plans, the bond work. I don't know the exact figure, but somewhere between six to eight million dollars spent to get to where we were. And at the very end, we asked for a six-month extension because of the bond market turmoil. At that time, many of you probably will remember there was an inverted yield curve in the bond market, and the bond market was just crazy for a little while. So our bond council said, ask the state for a few months to let the bond market settle down. And so we did that. We asked for an extension. And the Department of Community Health issued an opinion that said that the reason for our request for an extension was not something that was beyond our control. Now, I don't know about you all, but if I had any control over the bond market, I probably wouldn't be sitting here right now. But that's the short story of what we did as a county in building a hospital. Now, a little bit about our situation, where a small county, as I said, population-wise, we have a Houston clinic in Lee County, which is very nice for our folks. Many people in our community travel elsewhere to get quality health care. We don't quite know the percentage, but we think maybe somewhere as high as 40% of folks leave the community to search for quality health care. There is no choice there. There's one hospital. My wife had her hips down here, and that's a matter of choice. Senator Sims asked about the folks that can't go other places. And I think that's a very valid point, because I think one thing that the certificate of need laws do in Georgia is they really, really hit those folks probably harder than anybody, because those of us who can go elsewhere to search for quality health care and rural Georgia do that. Those with insurance, those with the means to do that. But many folks cannot do that. So they don't have a choice in health care. The certificate of need laws in Georgia do a very good job of what they're intended to do. The certificate of need laws in Georgia are intended to stifle competition. I mean, I'm just going to put it as cleanly as I can. They do a very good job of that. If it takes five or six years to build a hospital and $6, $10 million in just expenses to get to the point where you're going to come out of the ground with a building, there's something wrong there. That's a real life story. That's what we went through. There's a basic economic principle. If you study economics, in economics 101, they teach you that monopolies breed inefficiency. That's a very basic economic principle. We can talk all day long about how complicated health care is, but it's no different really than any other business when it comes to economics. If you have one hospital, they're not going to be as good as if you had two hospitals. People ask me throughout this saga, what's it going to do to the one hospital if you guys open that hospital? Well, what people forget is that we had two hospitals in that community for almost 40 years, and they operated side by side. I personally think having two made both of those better, but we don't have that any longer. I'm here just to speak to you about what we went through, tell a real life story of three years of constant litigation, followed by two years of COVID, followed by the disappointment of the state pulling our certificate of need right at the finish line. I mean, this is what's called a Pindex A of a bond document. We were about to issue bonds in the case to build an acute care hospital in South Georgia that would have served everyone, and that's something that a lot of people don't like to talk about. We were not going to just serve those with insurance. We were going to serve those with no income at all, also. This is the very last thing you do before you issue bonds to build the building. This is 98 percent complete. We're ready to issue the bonds when the state pulled our certificate of need, and another interesting tidbit at the end of that story, the state when you go through this process, and you ask for an extension, and extensions are not something out of the ordinary with the certificate of need process I learned. There's a some precedent with emery that asked for, I don't know how many, it was 15 or 20 extensions to get their project done because you got folks nipping at your heels, suing you for everything you're doing, so it takes you a good while to get to the point where you need to be. We were at the point of issuing the bonds to build this building, and the bond lawyers said, well, you know, the state only gave you a six month extension, and we have to be completely honest with the bond buyers. When we put this out to the bond buyers, we have to say that you only have a six month extension to build this building, but it's going to take you 18 months to build the building, so maybe nobody will buy the bonds because there's no guarantee that the Department of Community Health won't pull your certificate of need after you've started construction of the building. We speak to the folks at the Department of Community Health, and we explain our situation to them, and we say we only have a six month extension, but realistically it's going to take us 18 months to build this building, and we have to be honest with the buyers of these bonds. And the response was, well, that's just the way we do business. If you need six more months, come back to us later, and we'll consider giving you another six month extension, and we try to explain, well, that's going to do us absolutely no good, because we have to be honest with these folks that are going to buy the bonds and tell them that we only have six months. And if you're a savvy investor, you're going to read through this thing, and you're going to see that we only have six months to build a building that's going to take 18 months. And the response was the same over and over and over again. Just come back to us. That's the way we do business, and we'll talk about giving you another six month extension. Well, truth be known, we did go back to them when there's problems in the bond market, and we didn't get an extension. So we go through basically five years of work, and the last six months of work was literally the conference calls on a daily basis, a daily basis, with folks from Lee County to New York City and everywhere in between, trying to get the thing done so that we could meet the deadline that we had to meet for the certificate of need law. And it's interesting that the state pulled our certificate of need before that time was up. But in a nutshell, that's a real life story of how hard it is to build a hospital in the state of Georgia. It started out, this project started out as a brainchild of our development authority, and it started out as a for-profit hospital with a group of investors. That group of investors realized pretty quickly that the certificate of need law in Georgia is almost an insurmountable goal to reach in building a new hospital. From a business person's standpoint, do you want to spend six, eight, ten, twelve million dollars to basically just get to the starting line? I mean, that's the question that they had to answer. So that was a no-go for those guys. So then the county said, well, you know, we're pretty fortunate. We have no debt. We have tens of millions of dollars in the bank. Let's do one more thing that will help our citizens. So we took over the project. And we fought the good fight. And like I said, we got almost to the finish line. I mean, we were so close to the finish line, we could see it. And we got the notice from the Department of Community Health that we're just not going to let you complete the project. That's just wrong. I mean, it's absolutely wrong. And I've listened to all the testimony about how do you make health care grow throughout the rural areas of Georgia. This is the perfect example of a county trying to do that. We were going to have better access to health care in a rural area for everyone in the community. And I say that again because I want to emphasize that all the negativity that comes from the other side and that we were barraged with was, what are you going to do about the indigents? Well, we said from the very beginning, we're going to take care of the indigent patients at our hospital. And not only did we say it, but your laws required us to do that. The state of Georgia, the laws in the Georgia code would require us to also provide services to the indigent. So that's something that I could go on for days, but I'll just, you know, I'm going to help you out with that. First question is if the doctor was and then Dr. Brass. Yeah. So the timeline, we just, I mean, looked it up here, Senator Kirkpatrick, I mean, it was written about in the paper of March 21st or something like this. When you were denied, is that, is that, uh, March 17th, same patricity. You weren't so lucky, were you? So interestingly, I mean, the state should be encouraging rural hospitals development. You would think. You would think, you know, just just the opposite of that in reality. Senator Watson. I, I'm disappointed. I'd be honest with you. I just, while March 17th, I guess into the session, I missed it. And, you know, it was cheer, HHS and appropriations from that standpoint. You can't fab on DCH doing that. I, you know, I apologize. That's, that's, to me, that's just terrible. Is, is the story over? Uh, well, the story is not over. We want to continue to try to build the hospital. Now that's really a two-part answer, though. You were encouraged when Senate Bill 99 passed, and I've been involved in politics, local politics, at least long enough to know that it's never over until it's over. And I've had politicians on the state level tell me before the easiest thing sometime, and I'll just be, from, I'm going to be frank today, okay? The easiest thing sometimes for a politician to do is nothing, okay? And what I mean by that is in the state legislature and the house, they did nothing. And so it didn't pass. You know, you take a contribution from an association that's there to protect one party to not change the laws. All of that politician has to do is nothing. And the law doesn't change. So to answer your question specifically, we're going to continue to try to build a hospital. It will be very difficult if the certificate need laws don't change because here's what we'll have to do. We have to start over. We have to file again to get another certificate of need. And what do we do? We start this all over again. We start the litigation all over again. Can you appeal to the decision? You could have appealed it, but you appeal it to the same people that made the decision. So it doesn't do you any good. But we could start over and go through all of this again. We would have to go through all of this again. Or if the legislature were to pass something like Senate Bill 99, then we could build a hospital. The $8 million that was spent on litigation expenses could have gone towards building that hospital. I appreciate that. I'll let somebody else in here. I just see you, Davis Chema, every senator who sits here before you. I was the sponsor of Senate Bill 99 and each one of my colleagues who are in favor of it. We appreciate it. We did run into a brick wall in the hospital. We'll see what happens next session. I was going to give him a color. We'll wake up call. I think we're going to give you a quick background. We call Dr. Brass, Dr. Brass, just to see no. Because he was the one that passed the, I'm not going to call it the weed bill out loud of that. I just did the medical marijuana oil, the medicinal oil bill, and became a medical expert in his own eyes in the midst of that. So I'm going to turn the, I'm going to turn the microphone over to Dr. Brass. Well, the full story is while passing that bill, I also had a full CON repeal bill that same year, which did not pass, but we did give some significant reforms out of it. So the full picture is why they call me Dr. Brass. But I do not call myself Dr. Brass for the record, although maybe I should. But anyway. So I want to get, you know, access is a big deal to me. Very big deal in cost. I mean, that's, you know, two of the main purposes of CON. And, you know, I think through nine years in politics, I haven't seen where that's been for, I haven't seen where CON has held cost or access. And so, but to me, I mean, access is not defined. And so I want to kind of hone in, like, you know, what brought Lee County to warning a hospital. And I think I know the answer to this, but I'm going to let you answer. You know, why hospital? I mean, is that, is that access or, you know, are there other ways we can provide medical access, medical care without an actual hospital? You know, and I look at, I always look at through my rural lands, I've got heard County, which is 13,000 population. So, you know, just a little over a third of population lead County. They don't have a doctor. They don't have a nurse in entire County. However, right next door in Carroll County, we've got Tanner, right next door in Caledia County, we've got Peemont, and then right next door in True County, we've got Wellstar, and then some Emory Doctors. So, so I feel like they have access. I don't necessarily have it in that County, but they have access. And so what I'm trying, I guess what I'm trying to get to, what number one, you as a local small town, small county, rural Georgia, politician, number one, letting consider access. And I'll stop there and let you, let you kind of touch on that. We wanted access to choice. And let me say this, we were never anti the hospital this day. Okay, we wanted, we wanted from the beginning for there to be two good hospitals. So we have no choice where we are. People like I said earlier, folks like myself go other places for healthcare. My wife came here for healthcare. But what we do there is only the people that have the means can do that. You leave everyone else with no choice. So I think all of these arguments that have been made, you know, have a rebuttal, and that's maybe one of the biggest rebuttals is you not only give everyone in the pool a choice, you give that group that we were talking about that is stuck there, a choice. The indigents, the folks that can't go somewhere else, then they would have a choice. So we would provide exactly what you mentioned earlier in your questions to the previous witness. We weren't going to be just a multi surgery center. We were going to be that and a small acute care hospital with an emergency room that did provide services to the indigen. So if the State Department of Community Health had not pulled our certificate in need, we would be building another hospital today in South Georgia, which is more care for the people in South Georgia and a choice. Thank you, Mr. Madhavis. The hospital and Columbia County that was awarded CON, their county government went in and stomped up part of the money for the project so it was a big public hospital. Is that what you were attempting to do as well? Is that what the bond issue is? Is it sold up? Are you going for a CLN or a lot of the money you've owed? Now we originally started as a for-profit hospital with a group of investors and we were going to put up 20% of the money. At the end of the project, the county was going to put up 100% of the money. So we were truly going to build a community hospital and pay for it 100%. The county was going to be 100% all-in. So were you doing that to pursue the exemption from certificate of deed for the county and also was a disability? Initially, you have to do that as a sole community provider. You have to put up a certain percentage of the money so that was the thought initially just to get the hospital in the county. But when we switched gears and the county was all in, it didn't really matter anymore because we were well above that percentage. We're at 100%. Thank you. What a mess to math. Are you Sandra? I have one, two, three points that I would like to make or questions to ask. Were you granted a CLN? Yes. All right. Which is almost unheard of. That's correct. So DCH granted you a certificate of need. How many extensions have you had? We had four extensions, Senator. And if I can answer that question with a little bit of detail, the first two or three years that you're involved after you're granted the certificate of need, you're tied up in litigation. So you don't have a choice. Not necessarily, but you were. No, no. If you look at, I beg to disrespectfully, the Green County hospital was almost exactly the same situation as our situation as far as litigation is concerned. They were tied up for years in litigation. Just as we were, the only difference in the Green County hospital and the Lee County Medical Center was that they didn't have two years of COVID after they completed the litigation. Just as we got through the litigation, it's when COVID hit. So we had three years of, two or three years of litigation followed by two years of COVID. If I'm convinced that if we hadn't had those two years of COVID, we would be opening hospital. So it's almost exactly the same situation as the Green County. Exactly. But you were granted a CON. That's correct. You were given an opportunity to build in spite of COVID because building never stopped. With all due respect again, Senator, nobody was built in much of anything during the time of COVID. We all know that everybody was just trying to keep their heads above water during that time. That's the baby. I don't think I know there was no hospital built during that time in the state of Georgia. Not necessarily hospitals, but just building. There wasn't much of anything else built during those two years. Also, it was also concerns about the investors that you had. There were problems or issues or concerns and concerns about the individuals, the population, the taxpayers of Lee County. The taxpayers in Lee County were, you know, I don't know the number. I can just tell you that every time I go to the grocery store, I'm stopped by three or four people that won't know when we're going to get that hospital. So back to your first point, originally it was a group of private investors as I stated earlier. At the end of this project, it was Lee County. So there was no question about who we were. I mean, we were there to build a hospital. The county. The explanation that you gave initially you said something about the timeframe. And having to work with the investors or something along. No, no, that was at the very end. There were still going to be investors, but those would be individuals who were buying the bonds. Anytime you do a project like this, the county or the development authority would issue bonds to build a hospital. So we were going to issue, I think, $135 million worth of bonds. There was no question about who it had bought those. We had folks waiting to buy the bonds. We had one, one reed that wanted to buy all of the bonds. Yes, sir, but there were some, some concerns about the integrity of some of the investors. No, no. Now, what you're talking about, Senator, is initially some of the folks that were involved in the initial idea of building the hospital, the private hospital, which is not what the project turned out to be. The project evolved into just the county building a nonprofit community hospital. Yes, sir. Also, the issue with the two hospitals that are in my district that are no longer there. Tom Mara was one of those hospitals that was on the brink of closure anyway and went to Phoebe. I don't know if I would agree with that, but I will point out one thing. Let me finish. Or I'll keep order. Yeah, I will point out one thing because I thought this might come up. But as you know, the hospital in your district, the only one that remains was sued by the Federal Trade Commission for anti, for practices that would be anti-competitive. And in the settlement agreement, I thought it was interesting. On page three of the FTC decision in order, both the hospital in your county and the Dardi County Hospital Authority stipulated that the effect of Phoebe's acquisition of Palmyra may be to substantially lessen competition within the relevant service and geographic markets alleged. So both the hospital and the hospital authority and the Federal Trade Commission agreed that it was anti-competitive. Phoebe did not close Palmyra. No, they bought it. They bought it and they paid above market trust. Dr. David was here, Shane. And he said, CON is antiquated. We understand that. We want to make it better. We want to improve upon it.\n\nGet rid of it or whatever. But we want to make certain that whatever we do, it is something that the rural population in this state will benefit from, that it's going to be a positive change for them. I don't think finger pointing is going to get us anywhere. What I do feel will help us is what we're doing now, looking at the changes that can be made to make this process better. It's been around for a very long time. Some states choose not to use it anymore and some do. And that's why we are in this committee. I think you're the only individual that brought in a box of whatever. We don't know what you have there. But it's not to say that that hospital did the wrong thing. You were given a CON. DCH gave you that opportunity, which is almost unheard of. So I think that's a huge plus for your project. Is that a question center? Do you want me to answer that? I agree. I agree that finger pointing is not something that we should do. And let me say this, from the never been anti-fidi, which is the hospital this there. We have always said, and we will continue to say, that we want there to be two good hospitals in that community. The finger pointing has never come from us. The finger pointing has come from the other side and the people that sued us and the people that sued us. These are pleadings that were filed with the Department of Community Health, objecting to our hospital. Thank you, Mr. Mathis. And can I say one more thing, Senator? You say what could we do to make the certificate need laws better? And I think Senate Bill 99 would be a very good start. And the reason I say that is it would allow communities in the state of Georgia like us to build community hospitals. And then the legislature could see what the effect of that is after we build a few community hospitals. If we and other communities like us are allowed to build community hospitals without having to go through this, there will be some community hospitals. Bill, we're granted a certificate of need. Nobody took that away from the county. They did, in fact, take it away, Senator. On any other questions in the committee? On March 17th of 2023. Chair, I'm asking that this thank you for being here. I think maybe to highlight one, and this is the point of agreement between you and Senator Sims. You talked about Senator Bill 99, which Senator Sims did vote for, like I mentioned, I'll never remember on this committee. So I think that there's agreement there. And with that, I'm going to move on to the Q&A public testimony portion of this morning. Thank you again for your testimony. Thank you very much. We have three people signed up to speak. For each of you three, I would like to ask you to keep your comments to five minutes. I will give you a little bit of indicator if you're going significantly over that five minutes, and then we'll have brief Q&A from the committee. And if we all work collectively in this, then we'll be out here by 12 o'clock and able to grab some lunch. So, are you Dr. Stubbs? Fantastic. Thank you for being with us this morning. And four of yours. Joe Doseau, my Senator Freddie Powell Sims, fellow colleagues, Dr. Watson. My name is Joe Stubbs. I'm a board certified internal medicine specialist, former president of American College of Physicians, which is the largest specialty organization in the country, numbering 161,000, and former president of the National Medical Honor Society, Alpha Omega Alpha Omega Alpha. Since 1982, I've been in private practice of internal medicine for 41 years with Albany Internal Medicine. Now, as an internist, I started out with a scattering of 40-year-olds, 50-year-olds, and 65-year-olds, and now after 41 years, I'm now at default the geriatrician with everybody. It's a good day when I see five people under the age of 90. I'm here today to strongly support the repeal of Georgia's COM law. I speak from both a familiarity, familiarity, with national health policy regarding COM, and more importantly, from a local and personal perspective. My experience with the negative impact of COM largely centers on its use by Phoebe Putney Hospital, our regional hospital in southwest Georgia, and its health system and their use of COM. There is no question in my mind that their use of COM has negatively impacted access to care. The quality of patient care and health care costs in southwest Georgia. In my opinion, ironically, Phoebe could actually be better with the repeal of COM. When I arrived in Albany to start practicing medicine with Albany Internal Medicine, we were a two-hospital town that has been alluded to with both Phoebe and HCA-owned hospital Palmyra Park, which had been started in 1971. To listen to administrators and board members of Phoebe, you would have thought that Palmyra posed an existential threat and was going to run this beloved community hospital right into the ground, taking all the paying patients and leaving Phoebe with just the poor, uninsured patients that would lead to its financial collapse. But to the contrary, however, the competition of Palmyra spurred Phoebe to have an unprecedented growth in providing more services such as cardiac catheterizations, cardiac bypass surgery, state-of-the-art radiation therapy, state-of-the-art oncology services. And with this growth in services, Phoebe saw unprecedented financial growth. Palmyra attempted to add services as well, and while they remained financially stable, they were stymied at every turn by Phoebe through the CON law. HCA's Palmyra attempts to add OB, Pediatrics, and cardiac catheterizations were all blocked using the CON process. A process that at times appeared to have a lot of smoke and mirrors involved. Phoebe's use of CON was not the intended purpose of CON, which was to utilize expensive and limited medical resources more efficiently. And thereby, keep medical costs down. Their use was just the opposite. To maintain a monopoly of must-have services, so health plans needing to offer those essential services would also be required to use Phoebe exclusively for all services. And it is my opinion that this is the primary usage of CON across the state as a lever for large regional hospitals and health systems to suppress competition and negotiate with payers higher prices. Again, just the opposite of the intended purpose. And further, those higher costs just spiral down to the consumer. Health insurance companies take the increased prices and pass it right on down to the private businesses and individual citizens in terms of higher premiums, which my group has certainly had to deal with. The constraints of growth resulting from Phoebe's use of CON made Palmyra a prime target for a buyout, which is what Phoebe did in 2010. We now have a total monopoly of hospital services and many outpatient services. And the community has suffered an immediate and palpable loss of quality and access to care. The result was 16 to 24 hour waits in an emergency room. Mammogram and CT scan reports not being sent back to ordering physicians, missing discharge summaries, failure to communicate with primary care physicians about their patients, admissions and discharges, six months delays in various specialties like psychiatry and neurology. The dissatisfaction with Phoebe in our community has grown and is pervasive. It seems everyone has a story of the mishaps at Phoebe. One patient of mine recently was scheduled for the forecolonoscopy and had to go through that all too familiar stressful prep. Only to arrive at the hospital for the procedure and be told that they had been canceling all elected procedures without patient notification due to lack of staffing. I had to literally beg another patient of mine who my felt was on the verge of a heart attack to go to the hospital because he was so fearful of the quality of care that he would receive. Today practices such as minor involved with value-based contracts, which the government and commercial health insurance companies with government and commercial health insurance companies where we seek to provide high quality care at lower costs and do so at financial risk if we fail. This is a concept I think some of the bears on other rural areas of the country and hospitals who are looking at having to compete with ASCs that providing high quality care can be done successfully and if you do it at risk, you can make money. You can achieve sharing of the savings. We have in Privia which is an organization we're working with. There's a hospital down in Florida that recognizes this that shared savings working towards reducing costs can actually be better for patient care and be successful for the hospital. Private practice specialists with Dr. Oman ambulatory surgical centers, excuse me, offer us a great opportunity to provide high quality care, great patient satisfaction and a fraction of the cost. However, the personal costs of going through the CON process with health systems fighting you all the way and the limitations imposed by CON on the utilization of ambulatory centers have markedly diminished the availability and usability of such entities. I firmly believe that whether we open up opportunities for competition or keep CON intact, hospitals and health systems will survive and thrive. But the quality of care, the cost of care and patient satisfaction of care will be served most through competition and repeal of CON. Thank you. Thank you Dr. Stovs. Any questions from your committee? Seeing none, thank you again for your testimony. Dr. Looks like a core to me. Is that accurate? I'll pass you through the committee. I'm Dr. Kriss Korr. I'm a specialist in general surgery in Albany, Georgia. And I was chief of staff at that hospital that was closed in Albany at the time it was closed and acquired by the hospital. It just hit a nerve with me when I heard the remark that was made. That's why I did. I apologize to you since it seems. I'm an Albany, Georgia native. I was born at Phoebe Petty Hospital. And with the University of Georgia, the Medical College of Georgia did my training five years of general surgery at the Medical College of Georgia and went back home in 1982 to establish a solo practice in general surgery when prime interest rates were 21%. I borrowed $80,000 and hung my shingle. And then a couple years later I joined my old medical school roommate, Dr. Kriss Smith from Tifton and Dr. Gray Rawls. And Dr. Rawls had greater than 30 years of experience in general surgery and he taught us a lot about the medicine and about the business of medicine. He taught us that patients were patients, not customers. He taught us that patients didn't choose to have appendicitis or be t-bone to the car accident or have colon cancer. And he always taught us don't ever let the dollar get too far ahead of the diagnosis. Those have been two premises that I've carried with me through my medical practice. As I said, I've been in practice now for, counted up, 41 years. Dr. Smith and I had a dream for our community, and for South West Georgia, and for rural Georgia of establishing an ambulatory surgery center. Because we saw that 800 pound gorilla setting his own prices and treating, we were in the trenches with our patients. We saw patients filing for bankruptcy because they were being harassed by the only gorilla in town. We built our first surgery center with assistance from Phoebe Putney Hospital. We let them be the clerk of the works. We didn't know anything about building a building, and so they offered to do that. We didn't realize that all the time they were doing that, they were making plans in the legislature to block us from ever being able to open it. We were told we were not single specialists, that only single specialists could have surgery centers. And I remember I told you I'm a specialist in general surgery. We were multi-specialists, essentially multi-practic general practitioners. Over the next several years, as you'll note on my timeline that I submitted, you welcome the copies of that. In 1999 Albany's surgery sued the Department of Community Health. That's my group. In one meeting with one of the attorneys for the Department of Community Health, I told him I did five years, especially training in general surgery. I took oral and written boards to be a general surgeon, and I said I'm recognized by the American Board of Medical Specialties. He looked at me and said with his lip kind of turned to the side, he said, we're the state of Georgia. I don't care who recognizes you. We don't have to recognize you if we don't want to. Well the bill went before the legislature to declare general surgery as a single specialty, so we could play the game. The hospital lobby on crossover date from the house. It was a house bill going to the Senate. This was in 2008. They passed around 2006. They passed around a rumor. They said, if you let general surgeons have amatory surgery centers, they'll be all of the state doing abortions everywhere. So they call me an abortions. Well, general surgery didn't do abortions. Anyway, there's a kind of college history or whatever, but we wouldn't do them anyway. And that was the rumor that they did to get the legislature put up a stop sign, and it took until 2008 for us to get a bill passed as I gave you the timeline there. Well finally in 2015, we built our own surgery center. The only one South Atlanta and all the way to the coast, the cost before us outweigh was $6 million to build a two operating room surgery center. We did this to offer more affordable and easier access to patients in Southwest Georgia. Once we started our patient center, I reviewed some EOBs or explanation of benefits from some family members that came in whose spouse had the same procedure done at our hospital. And I noticed that their cost had come down from what I was told it was before. So we lowered the healthcare cost at our local hospital for them to compete with us. It was good. It's good for patients the cost of medicine. It lowers the cost of medicine. We don't want to put our hospital out of business. That's not what's never our intent. We want them to do well. We want a level playing field to benefit our patients to give them some choice. In this insurance market today, with such high deductibles, when patients have $10,000 deductibles are higher and they have to have a herni repairs and outpatient, they can come to us for a lower cost alternative. We have two beds. The hospital in my area has 20 beds. They have a myriad of services, and trauma care, et cetera. We don't do trauma care in our surgery center, obviously. And we offer only general surgery outpatient cases such as vein surgery, colonoscopy, is upper gion and dosage, all bladder surgery, herni repairs, and breast pops, the breast surgery. If we predict the patient is too acutely ill or if there's any risk, we think they might need to be hospitalized. We take them to the hospital to do it. We don't do it. And we keep our privileges in the hospital and we want that hospital there, but it would be unfair to the patient, not only from a medical standpoint, but from a cost standpoint, for us to operate on them in the ambulatory surgery center, and then carve them over to the hospital to take care of them post-op. Do we skin the cream off the crop? Well, we have to do engine care as well. We take Medicare. We take Medicaid. We actually, as I said before, during COVID, we opened up our surgery center. I went to the CEO at our surgery center because they were having manpower problems with, they would take people out of the OR to staff awards. Remember Albany was the epicenter of COVID. You remember that. We were having 70 to 75 ER emissions of COVID a day for a while. And so they were having to shut down the ORs. Well, we opened up our surgery center and said, if you want your general service to come over because people were putting off colonoscis, or having problems that could have led to colon cancer, et cetera, et cetera. And we wanted it to be available for the public to be able to use it and for the other surgeons to come over. The hospital rejected it, but it really was not a true rejection like they didn't want us. They just felt like it wasn't going to last that long, and they didn't need to do it. North Carolina, as you know, just, they just opened up their LNRs to allow their surgery centers to have multispecialties. Great idea. That's exactly what I want to see if we don't do anything else, but reform CON is to allow our ambulatory surgery centers to be multispecialties, because I have specialists in my community who don't have access to ambulatory surgery centers, and they could use our surgery center. I think that's a great idea. Plus it's a great idea because I'm in the Southwest Georgia. If you've looked at your map lately, we are the retail hub for Southwest Georgia. I want to have all of those counties around me who don't have access to care, but we could probably, it's a possibility, but you've got to remember I just said it took $6 million to build it, but there's a cost involved to do it. We in the state of Georgia, as you know, have very strict CON laws, and as you've heard all this testimony this morning, we are very much interested in providing multispecialty care to our patients. I've been educating patients on what CON is. Most people don't know what CON is. They have no idea when you say, I'm going to submit the top to 17 on CON. When they initially find out about it, on something that was initially designed to rein in health care cost and find out how it's financially burdened them, most patients say, well, no wonder health care costs so much. Then I give them the auto analogy. We have a four-day learned town. He sells so many cars per 10,000 people, and the Chevy dealer wants to come to town. Well, I think we've got it covered. We don't need you. So he doesn't get a business license, and then the four-day look can do what he wants to do. And then you get back to the monopoly issue. Veil Colorado and Albany, Georgia, and Wall Street Journal article several years ago were the two highest health care centers in the United States. What do you need, Georgia? What effect does that have on my local business, not just me, but in recruiting? I can actually tell you, if you want me to give you the names later, I will. But there are two industries in our community who left, and one of the reasons they left was because how high the health care cost was in Albany. My town certainly needs new business, and when we have industry come to our community, they obviously look at the health care cost. We want to provide accessible, lower health care cost in a safe environment. We're joint commission accredited, our service center is, joint commission. We want to serve our rural areas and other, the track patients to our area. If a patient comes to me, and they're very ill because I've got a surgery center, but I take them to the hospital, that's a win-win for the hospital and for me and for the patient. And all of which I can say to you is we would like to invite each of you to come down to Albany and see our surgery center. As I told you, it's the only surgery center south of Atlanta all the way to the coast. It's not one in Macon, it's not one in Savannah, four general surgery. There are other specialties. I would like to leave you with one comment, and that is the fact that we need to reform, and we will accept any reform. As you see what I went through, I started this process in 1990. Okay, here's something about, you've been in health care for 15 years. I've been trying to get something done to the CON for 23 years just to be able to expand my practice and serve my patients. I would write one little comment if I will, so a little off of this will be your conclusion. This is my conclusion comment in the rural areas that we talk about where hospitals have closed and like the Blakelies of Southwest Georgia, what not. Nobody would go there today and build a hospital, not with medical care delivery the way it is today. Nobody would go there and build a new hospital. These are older hospitals that are closing and they will build under different standards. And it would be difficult to build an ASC there, but I think if you got the right investors to do it and you showed it, it would just be... It's a possibility of multispecialty ASC would be an alternative for those people. Thank you very much. Any questions from the committee? Senator Simms, give me one question and we'll move on to the next speaker. Thank you. Thank you, Mr. Chairman. It's unfortunate that these gentlemen have decided to beat up on Phoebe today. I am most disappointed in your presentations. I am one of your patients. Dr. Smith was my doctor. He's deceased now, but I have used the surgical center. So it's a great place to go. You do have your surgical center and all of your conversation sounds as if you were not allowed to do it. Just as Mr. Mathis said, we can't build a hospital. He received the seal in permit. And it's kind of disappointing that you're piling things on an institution that takes care of over 30 different counties daily and gives back about $55 million in charity care annually. So that's a little disappointing to me. For all of your beds, fields when Phoebe came to purchase, or did you have two floors that you weren't using at your hospital? You told me you were at Palmyra. I was the chief of staff at Palmyra. I was the mayor. So you would have known whether or not, but we won't answer that. But that was something that was told to me. I would like to answer your first question. It wasn't a question. It was a statement. DCH is the determining factor, not Phoebe, not Palmyra, not any of the hospitals. They are the determining factor as to whether or not a hospital or a surgical center or anything else that takes place dealing with medical care or medical systems will be done. So can we kind of stick to that and not say that the hospital that I represent is the reason for you not doing this or the reason for that not happening because that's not necessarily true. Well, I don't want to sound like our presidential candidate, Dr. Ramaswamy, but I will tell you that the big money has spoken with Phoebe Putney. Phoebe Putney is a great hospital. I told you I was born there. It's my home. Okay? It's where I read my first breath of air at that hospital. I love Phoebe Putney Hospital. I have been disappointed with it over the years. It's been pirated and I've been disappointed with their business practices. And the reason that there was even a Lee County hospital discussed is because people were so upset with Phoebe Putney and the way Phoebe Putney had treated the other hospital. That's all I can tell you. Now I'm not pointing a finger. I'm just calling facts as they stand. These are facts. And if you go and you cross section and ask people in my community, they will tell you this. They use the CON law in a very manipulative way. And that's what you got to remember. So in that case, I wish CON didn't exist because they couldn't have done it if they hadn't used the CON law. And with that, I'm going to thank you for your testimony. That's the perfect conclusion, I thank you for your thesis. So thank you for being here this morning. Thank you. I do need any of you later. Thank you so much. And last but certainly not least, Dr. Sam's step forward in the podium's years. I'm going to give you a mark at five minutes to see you know you're there. Thank you. I appreciate your time and attention. I am here to speak for repeal the CON law. I'm Jim Sam's. I started my practice in internal medicine in 1982 in Fayetteville, Georgia. I have practiced in single-specialty groups and multi-specialty groups. I have practiced in private practice and in hospital employment models. I have served as a senior physician executive in a hospital system. I take greatest pride in being CEO of a statewide physician group in Georgia, comprised of private practice physicians who all believe that the doctor patient relationship should be at the center of the delivery system. It is from that position that I moved from a very local my optic kind of view of health care and its dynamics and certificate of need to a broader statewide perspective and viewpoint. We've heard from my physician colleagues from Albany, Georgia. Their story in Lee County, this is not unique to a specific geography. The problems we run into is CON or statewide. If CON was ever meant to control cost, it has failed miserably. If CON was made to limit and restrict competition, it has been a roaring success. It is granted hospitals what in essence are monopoly powers. We've seen these monopoly powers used. We've seen hospitals move from hospitals to hospital systems. We have seen many of these hospital systems morph into what are de facto cartels, institutions and businesses that can manipulate and control price, access and choice. The CON law has also propped up the status quo, strengthened the status quo. Our current delivery system is fragile and brittle. It is not adaptive. We watched what happened during the COVID pandemic. We watched as our hospitals approached near collapse. CON law have also stifled innovation. There's no single magic bullet that's going to see us evolve a delivery system in Georgia that answers all of our needs. But there are some things that need to happen. Physicians need to be part of the solution. You're not going to achieve the reforms and the changes necessary without the physicians. Physicians in Georgia have a choice. We can be hospital centric or we can be patient centric. We're not allowed to be both in current state.\n\nprivate practice positions are uniquely positioned to be not only patient-centric but community-centric yet we are not allowed to come together in meaningful relevant ways to be an effective competitor in the marketplace because a lot of the restrictions that the CON laws place on us. We asked to be part of the solution we asked to be let on the playing field. If we are going to achieve the goals of the triple aim, better care, better outcomes at a lower total medical cost which I think we're all here and we are committed to. If we're going to have a delivery system in this state that's equitable, just and sustainable, it will be with more competition. My parents began practice in Fayetteville George in 1951 and for many years were the only physicians in town. They started paving the roads, progress and prosperity started creeping into 114 out of 159 counties. That's what the tag said at the time and physicians actually started coming to the community. I asked my father, I said, is this bad for us? Is this bad for the practice? And he answered and he said competition has always done two things. It has made me have to be a better doctor and it has made me busier. Again, I ask for repeal of CON. Thank you. Thank you, Dr. Sands. Any questions from the committee? Thank you for your presentation and I just comment to somebody that has to do that every now and then. Very impressive you did that without a single note. So well done. Thank you members of the committee for making the truck here. Dr. Watson, you may get the award being the furthest traveler. Thank you for prioritizing this work. Thank you to everyone that is here. As I said earlier, our next step will be to go to Savannah to hear from people further west in the state of Georgia before we convene our work at the Capitol before the end of the year. Thank you again to the representative from this area and Senator Robertson, Chair and Smith and for those of you that came, for the members of the committee and staff, Bill Dudley and Mark have provided lunch across the hall in the library and we'll see that all of you soon. Thank you so much for adjourned.",
  "updated_at": "2026-02-14T01:10:21.504298+00:00"
}