{
  "video_id": "0hAqZpUYsHg",
  "url": "https://www.youtube.com/watch?v=0hAqZpUYsHg",
  "title": "Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "Here is a structured markdown summary of the Georgia legislative session based on the transcript provided:\n\n# Georgia Property Tax Relief, State Education Improvements and Affordable Healthcare | Lawmakers 2026 Session\n\n## Overview\nThe transcript highlights the key priorities for the Georgia legislature in the 2026 session, including property tax relief, education improvements focused on childhood literacy, and efforts to address the rising costs of healthcare and health insurance.\n\n## Key Actions\nNo specific bills were mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo bills were mentioned as being introduced.\n\n## Notable Moments\n- The House Majority Leader and House Minority Whip discussed the legislative priorities of their respective caucuses.\n- There was a focus on property tax relief, with the Republican caucus proposing the elimination of the homestead property tax statewide.\n- Education was a major priority, with a focus on improving childhood literacy and addressing issues like student loan debt.\n- The Democratic caucus pushed for Medicaid expansion, while the Republican caucus emphasized affordability and accessibility in healthcare, including efforts to grow the healthcare workforce.\n\n## Votes\nNo specific votes were mentioned in the transcript.\n\n## Attendance\nNo quorum notes were provided.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "On this day three of the session, we continue to learn what to expect during the legislative session.\nTwo of the lawmakers who will help lead what happens join us.\nHouse Majority Leader, Republican Representative Chuck\nAbstration of Mulberry, he was first elected to the House of Representatives in 2013.\nAnd House Minority Whip, Democratic Representative Sam Park of Lawrenceville,\nhis first election to the House was in 2016. Welcome to lawmakers to both of you.\nThank you so much.\nWe're going to talk about priorities.\nSo leader registration for a couple of years now, the speaker has talked about giving\nGeorgia residents a break when it comes to property taxes.\nIt tells us if this is the year, that's going to happen.\nWell, thanks for having me, Donna.\nAffordability is the big issue this year, and our speaker has outlined the elimination of\nthe homestead property tax state wide, and that legislation is to be introduced.\nlegislative session, Georgians are paying so much in property taxes, property values continue\nto climb.\nAnd so for their homes where they live, the elimination of that property tax would be\na huge savings.\nOkay.\nWe'll get more and a affordability in a moment.\nSo talk about that when it comes to taxes with the Democrats.\nWe're certainly interested in looking forward to seeing what the Republican caucus will\nbe proposing when it comes to property taxes.\nI think leader of stration mentioned a key aspect that I think there needs to be more\nfocus, which is these increased valuations, these increased property values in which the\nunderlying cause is the lack of housing supply.\nOver the past seven to eight years, we've seen the median average price of a home go from\nabout $200,000 and more than $450,000.\nSo I think while looking at property tax reform is important, we also have to do what we\ncan't expand the supply of affordable housing.\nLet's move on to education, always bigs at the capital every year during the legislative\nsession.\nWhat are you talking about with the Republican caucus?\nSo childhood literacy is a major issue for this legislative session.\nSpeaker John Burns outlined in his speech this morning that a top priority of the state\nhouse is literacy, particularly looking at the third grade reading level.\nWhen only one third of kids statewide are reading proficiently at grade level, that's\nThat's a major concern, particularly with the spending and focus that we've had in education.\nIn the classroom literacy coaches who can assist teachers in following a curriculum, which\nis proven to be effective for those kids, is so critical for the long-term development\nof the child, for ultimately issues like workforce development and career readiness.\nYeah, so that's a big thing with the Republican caucus, with the Democratic caucus.\nWith respect to education, the Democratic caucus, we really look at it from a spectrum from\ncradle to career.\nCertainly, there will be bipartisan support to ensure that we're investing more in literacy.\nBut with respect to K through 12 education, I think there's some disagreement between\nthe two parties.\nOf course, over the past few years, we've had a big debate over vouchers, in which just\nlast year, we sent $140 million toward private schools and vouchers that really undermine\nespecially rural school districts\nand their ability to teach kids.\nThe last piece I'd mention on education is student loan debt.\nYou know, Georgia now ranks third\nwith the highest average student loan debt in the country.\nAnd of course, Senator Nann Orrick did an excellent job\nover the off session in doing a study committee\non needs-based aid for higher education,\nand which hopefully we'll be able to move\nsomething on that issue as well.\nAnd she'll be on the show later.\nSo any more, anything more on education you wanna mention?\nI think education is the top priority right now.\nI think that the ability for every child in Georgia\nhave to world class education\nand for us to meet those standards for reading\nare issues that I expect will really advance this session.\nOkay, let's get into health care.\nLet's talk about the fact that Democrats have\nfor a while now pushed for Medicaid expansion.\nDo you expect to do that again?\nWe will be introducing additional legislation,\nincluding obtaining a fiscal note\nto understand the true impact in cost, a full Medicaid expansion, but of course, this\nis not a pilot.\nThere's more than 40 states that have expanded Medicaid.\nIt has lowered the cost of private health insurance premiums because we're expanding\nthe pool, lowering the risk.\nAnd of course, right now, healthcare prices are skyrocketing in large part because of\nthe federal government and the Republican majority, in which we're seeing healthcare\nare premiums for those increasing by $1,000, $2,000.\nAlready about 190,000 Georgians with ACA plans\nhave fallen off.\nAnd so it's a very, very concerning situation.\nEspecially when we're looking at tax cuts\nthat provide an average benefit of approximately $250\nto $300, that's fantastic.\nBut if your health care prices are going up by $1,000, $2,000,\nthe affordability crisis continues.\nSo you'll expect some legislation in that area.\nWhat about with health care with your caucus?\nWell, a lot of issues have been raised, a lot to unpack.\nI'll just say this, the affordability issues\nis a major focus, accessibility and affordability\nand health care, particularly rural health care access\ncontinues to be a major priority of the Georgia House.\nAnd there are many measures\nwhich we've worked to advance in that area.\nI know that as we're discussing the cost\nthat Georgians are facing in these expensive times,\ncertainly in response to the skyrocketing inflation caused by policies out of Washington,\nD.C. over the past few years, we're now in a position where we can, I think, actually\naddress that with tax relief, with insurance premium cost relief, with the study committee\nthat we've had this year legislation coming, and with reducing costs for first time home\nbuyers to be able to afford that first home, build long-term wealth through home ownership.\nI know the speaker also talked about trying to increase the workforce in the health sector,\nyou know.\nAbsolutely.\nSo there have been new educational programs open across the state over the past few\nyears, training for health care workers so that we can meet the demand.\nCertainly, as we have a population that requires additional health care workers.\nOkay.\nWhat else would you have on your plate?\nI would say, you know, with respect to the health care\nworkforce piece again, certainly support the speakers\nfocused on expanding the workforce.\nThere have been multiple studies that say that full\nMedicaid expansion would create 30,000 additional\nhealth care jobs in the state of Georgia.\nSo I think the best way, if that is a speaker's priority,\nis to, you know, work in a bipartisan manner\nto expand Medicaid for Georgia.\nI just have to address that.\nRight now, we're seeing policy out of Washington, DC,\ntalking about not funding commitments\nthat were made previously to states\nthat did expand Medicaid.\nGeorgia is in a terrific position financially right now\nbecause of the strong fiscal leadership\nof Governor Brian Kemp and the Republicans\nin the General Assembly.\nWe don't have a huge hole in our budget\nthat other states are facing.\nWe actually have reserves that make this state\nbetter prepared for any financial uncertainty\nwhich may happen in the future.\nDid you want to add to that?\nAbsolutely.\nI think we have a historic surplus right now\nin which we're simply sitting on it\nrather than investing in people.\nYou know, I appreciate the governor's interest\nin building out a highway to billion dollars\nin which I think the ground would not be broken until 2030.\nHow fantastic would it be if we invested 1.8 billion dollars\nin the health of Georgia's today?\nI'm expanding access to health care,\nI'm expanding access to childcare.\nI think there's a lot the state of Georgia can do,\nbut unfortunately under the current leadership\nwe haven't done that yet.\nOkay, let's talk about any other priorities\nthat we haven't talked about that you're looking at.\nSo tax reduction is a major focus.\nOver the past few years, the General Assembly\nhas reduced the income tax by two tenths\nof a percent each year, $800 million savings for Georgians.\nAnd there's a proposal to do that again this year,\nactually bring the income tax rate below 5%.\nThat's in addition to the property tax relief\nand a real focus on reducing insurance premiums.\nThat's healthcare insurance premiums, auto,\nmobile, homeowners insurance.\nWe've actually seen three carriers\nsince the passage of legislation last year\nto reduce rates and additional carriers\nare coming into the state.\nUltimately, more competition is going to drive down costs\nwhich will help all Georgians.\nOkay, anything else do you want to add?\nData centers, I think, is something\nthat we should certainly closely examine.\nYou know, the cost of data centers,\nyou know, I think we're providing up to $470 million\nand tax credits every single year in which 70% of data centers\ncome in Georgia would still remain.\nOK.\nUnfortunately, we're going to have to make that the final word.\nBut I thank you so much, both of you, for being here.\nAnd we're certainly going to keep up with everything.\n",
  "updated_at": "2026-02-12T01:27:15.589917+00:00"
}