{
  "video_id": "0KkB44SGS1g",
  "url": "https://youtu.be/0KkB44SGS1g?t=2311",
  "title": "Georgia House - Day 34 (2026-03-23)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 34,
  "video_date": "2026-03-23",
  "duration_minutes": 126,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 34 (2026-03-23) session:\n\n## Overview\nThe session featured a notable invocation and remarks from Dr. Jonathan Smith, the director of the Wesley Foundation at Georgia Southern University. Smith encouraged the representatives to remain steadfast in their work to build a better future for Georgia.\n\n## Key Actions\nNone mentioned.\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Opening invocation and remarks by Dr. Jonathan Smith, emphasizing the important and challenging nature of the representatives' work.\n\n## Votes\nNone mentioned.\n\n## Attendance\nA quorum was present.\n\n## Adjournment\nThe session adjourned. The next session date was not specified.",
  "transcript": "\n\nyou you you you you you you you you you you you you you you you you you you you you you 11 4 Objection that in a feeling well today. We're going to begin our day with scripture reading in prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 176 House District, Chairman James Bershitt, Chairman Bershitt. Thank you, Mr. Speaker and colleagues. Thank you for allowing me to come before you this morning. It's not often that I get the opportunity to introduce a friend of mine from high school. Dr. Jonathan Smith played football with me in high school and then went to Georgia Southern with me. He lives in Staceboro now so I did have to do a little poaching of some of my colleagues pastors to get him here today, but I appreciate that opportunity. Dr. Smith serves as the director of the Wesley Foundation at Georgia Southern University and the pastor at Pittman Park University United Methodist Church in Staceboro, Georgia. Throughout his time at the Wesley Foundation, Dr. Smith has helped create spaces for students to grow in life and in faith and successfully plant a Wesley Foundation on the Armstrong campus of the Georgia Southern University. Dr. Smith serves as a leadership consultant and a coach with the United Methodist Commission on Higher Education and Campus Ministries where he works to equip campus ministers across the United States with skills that help them reach the next generation with the gospel. Dr. Smith is a graduate of Georgia Southern University, Go Eagles. He completed his Masters of Divinity at the Canler School of Theology and Emery at the Emery University and is doctorate at the Columbia Theological Seminary. Dr. Smith and his wife Stephanie both serve as ordained elders in South Georgia in the South Georgia annual conference of the United Methodist Church. They have two daughters, Addison, who wants me to tell you she's 13 but she doesn't turn 13 until next week, who's here with us today. And Lily Grace, who is nine without further ado, Dr. Jonathan Smith. Mr. Speaker, thank you for having me this morning. Ladies and gentlemen of the Georgia House of Representatives, it's my honor and privilege to be among you this morning. Representative Barchett, thank you for the invitation to be here. Representative Tankersley, Burns and Parrish, thank you for representing the people of Bullock County here at the Capitol. Your leadership is not only well known but it's greatly appreciated. It's been my privilege the last seven years to serve as the director of the Wesley Foundation at Georgia Southern University and during that time, I've journeyed with students through what I believe to be the most formative years of their lives. 18 to 24-year-olds though they are adults in the eyes of the law are just beginning to discern who and what they are going to be. They're emerging adults, a phrase coined by psychologist Jeffrey Arnett. These students, these emerging adults, they're in the process of becoming, in the process of making decisions that set the course for the next 40, 50, 60 years of their lives. In my work, we talk about our students discovering three things throughout their time at college and at Georgia Southern that can be four, five, six years. We hope that they leave our ministry and leave our campus for that matter knowing who their master is, who it is or what it is that they will submit their lives to. Second, we hope they will learn what their mission is or what they will give their lives for. And third, who their people will be, who they're going to journey with throughout the rest of their lives. These students are literally becoming who they're going to be in this season of life called college. And while that notion can be exhilarating, it's also often terrifying. Let's be honest, the stakes are really high during that season of life. If you get any one of those questions wrong, who's my master? What's my mission and who are my people? Your life will be on the rocks in short order. That season of life is exhilarating and terrifying. Believe me, week after week, I counsel and disciple students who bounce between those two different places. I imagine that your work here is much to the same. You are engaged in the process of becoming. The process of building something and not just bills and legislations but a state of people, a rule of law to guide and direct the citizens of Georgia. Quite literally, you are making decisions that set the course of our lives together for the next 40, 50 or 60 years. What you do here in this great assembly affects the lives of people beyond those doors for good or for ill. There is great potential in the work that you are doing both for our benefit and to our detriment. And that notion is again exhilarating or terrifying. It can excite you where it can paralyze you. It can cause you to open your hearts to new possibilities or make you hard in your heart and close your mind. It can move you to action or it can stop you dead in your tracks. Your work is a high calling. And while there are many armchair politicians, there are very few who are willing to sacrifice their time, their energy, their resources and perhaps even their reputation to build a better future for the people of Georgia. And that is your calling. You are here to build a stronger, more vibrant, more competitive state for us all. And I believe in you. We the people of Georgia, we believe in you. Otherwise you wouldn't be here. We are trusting that you will represent us well and guide us in to God's good future for us. And that sort of leadership is not easy. It takes courage. It takes heart. It's far easier to build a platform to stand on a pedestal or to build a following than it is to put your hand to the plow and lead effectively. It's far easier to give a speech than it is to make a difference. It's far easier to politic than it is to govern. So my charge to you this morning is simple and it's found in Galatians chapter 6 verses 9 and 10. Their Paul writing to that church in Galatia says, let us not become weary in doing good. It's day 34 I believe. Let us not grow weary in doing good. For at the proper time we will reap a harvest if we do not give up. Therefore as we have opportunity, let us do good to all people, especially those who are members of the family of God. Do not grow weary in doing good for us all. You friends have the opportunity to make a difference for all of us today. I believe that the answers to our state's challenges are in this room and the leaders for our states present and future are in this room. Don't give up, don't stop, don't quit, keep working to help us become the state that we are created to be. Let us now go to God in prayer. Almighty God, we thank you for this day. For the opportunities it holds for us and for this state. I thank you for the leaders in this great room and the ways that you are using them to draw us forward into your good future for us. May their actions and decisions today bring honor and glory to you. May their work embody both love of God and love of neighbor. This we pray in the name of God, our creator, redeemer and friend. Amen. I pledge allegiance to the flag of the United States of America and to the Republic over which it stands one nation under God, individual, liberty and justice are all. Thank you sir. Doorkeepers will unlock the doors. Members may greet the chaplain in the south any room. The chair recognizes chairman Hogan, the chair of the committee on information and audits. Thank you Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. And furthermore Mr. Speaker, drive careful on this road called life because people will switch lanes on you without a signal. Amen to that. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on the 59th, it's following me establishes the order of business to the first part of the period unanimous concepts, instruction of bills and resolutions, first reading and reference of bills, house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. The clerk will read the resolution establishing the 180th and the quarter of the 174th, bill of the entitlement and act to amend and act to create the candidate county public. The answer to governmental coordination. The answer to the 1588, Congressman Thomas, the 21st, bill of the entitlement and act to amend and act creating a new charter for the city of Hollis Springs. The answer to the governmental coordination. The answer to the 1589, Congressman Thomas, the 21st, bill of the entitlement and act to amend and act creating a new charter for the city of Hollis Springs. The answer to governmental coordination. The 1590, Congressman Sainz, the 180th and quarter of the 174th, bill of the entitlement and act to repeal and act creating the county space board of the government. The answer to the governmental coordination. The answer to the 164th, hatched 150th and night of the 130th, bill of the entitlement and act to amend and code section 16143, the fish go to Georgia and anteater relating definitions relating the racke tier influence. Judiciary non-civil. House bill 1592 by the row, senate to load to 167, bill of the entitlement and act to create the long county building and public facilities. The answer to governmental coordination. The answer to the governmental coordination. The answer to the governmental coordination. The answer to the 199th. Bill until be done and act to amend and act provide a new charter for the city of jackson. H içinde Ch Merry<|sl|> and formal coordination. The answer over mental coordination. The answer to Dave Dalco, the 132st secretary of accordingly.院 vcceto, honored. The answer to the governmental coordination. The answer to the governmental renovation. Chподs Official 김 21. ceux of 102th hurricane. The answer to the governmental coordination. the police first readers. Second reading of bills and resolutions, a clerk will read. House Bill 1580 by reps of Canada, the 102nd, Crow, the 110th, Park of the 101st, Lumson of the 12th, more of the 95th. A bill relating to office of public safety support. House Bill 1585 by reps of Cantrell, the 22nd, Ballinger of the 23rd, Bird of the 20th, Carson of the 46th, Thomas of the 21st, a bill to amend and act to create the state court of Cherokee County. House Bill 1586 by reps of Camp of the 111st, a bill to provide a home study exemption from Ups and County at the Lorm taxes. House Resolution 1047 by reps and jaspers of the 11th, the resolution honoring the life of Mr. NC, Low Jr., and dedicating a bridge and his memory. House Resolution 1048 by reps of an air heart of the 36th Jones of the 47th, Dubbwick of the 29th, 9th of the 130th, Irwin of the 28th and others, Resolution creating the House Study Committee on Education and Accreditation. Through Second Readers. Reports of Standing Committees, the clerk or read. Representative Robert Dickey, the 140th district chairman of committee and agriculture consumer affairs submitted the following report. The speaker committee on agriculture consumer affairs had a consideration. Following Bill of the Senate has instructed me to report same back to the House, the following recommendation, Senate bill 486 due pass, respectfully submitted reps of Robert Dickey, the 140th district chairman. Representative Williams, the 148th district chairman of committee on banks and banking submitted the following report. To speak to your committee on banks and banking is sending consideration. Following Bill of the Senate, instruct the media report, same back to the House, the following recommendation, Senate bill 478 due pass, respectfully submitted reps of Williamson, the 48th district chairman. Representative Donald Parsons, the 40th district chairman of committee and energy utilities and telecommunications submitted the following report. To speak to your committee on energy utilities and telecommunications, is that a consideration, the following bill of the Senate is instruct the media report, same back to the House, the following recommendation, Senate bill 529 due pass, by substitute, respectfully submitted reps of Dom Parsons, the 44th district chairman. Representative Petrie, the 166th district chairman of committee on human relations and aging submitted the following report. To speak to your committee on human relations and aging, is that a consideration following Bill of the Senate has instructed me to report, same back to the House, the following recommendation, Senate bill 610 due pass, by committee, substitute, respectfully submitted reps of Petrie, the 166th district chairman. Representative Jan Tancke, the 160th district chairman of committee, integral of coordination local submit of the following report. To speak to your committee on integral of coordination local submit, has had under consideration, following Bill of the House, instruct the media report, the same back to the House, the following recommendations, House Bill 1062 due pass, House Bill 1138 due pass, House Bill 1196 due pass, House Bill 1323 due pass, House Bill 1325 due pass, House Bill 1326 due pass, House Bill 1327 due pass, House Bill 1328 due pass, House Bill 13인가, 38 due pass, University of Aires, House Bill 1399 due pass, House Bill 1417, due pass. new pass, hospital 1493, new pass, hospital 1497, new pass, hospital 1507, new pass, hospital 1551, new pass, respectfully submitted, Representative Jan Tinkersley, 160th District Chairman. Representative Absturations, the 104th District Chairman, Committee on Judiciary, submitted the following report on the squeaky committee on Judiciary, Senator Consideration following bill, the Senate instructs a meeting report, sent back to the House of the following recommendation. Senate Bill 363, Duke Pass, respectfully submitted, Representative Abstration, the 104th District Chairman. Representative James Perchett, the 176th District Chairman, Committee on Judiciary, non-civil submitted the following report on the squeaky committee on Judiciary, non-civil. Senator Consideration following bill, the Senate instructs a meeting report, sent back to the House of the following recommendation, Senate Bill 461, Duke Pass, Senate Bill 565, Duke Pass, by Committee substitute, respectfully submitted, Representative James Perchett, the 176th District Chairman. Representative Carson, the 46th District Chairman, Committee on Retirement, submitted the following report. Mr. Speaker, your committee on Retirement had an consideration to following bill, the Senate instructs a meeting report, sent back to the House of the following recommendation, Senate Bill 84, Duke Pass, and the 281, Duke Pass, respectfully submitted, Representative Carson, the 46th District Chairman. Representative Belton, the 112th District Chairman, Committee on Special Rules submitted the following report. The squeaky committee on Special Rules has been on consideration to following bills and resolutions to the House, instruct a meeting report, the same back to the House of the following recommendations, House of Resolution 667, Duke Pass, House of Resolution 625, Duke Pass, House Bill 1035, Duke Pass, respectfully submitted, Representative Belton, the 112th District Chairman. Representative Jantanker sitting on the 60th District chairman to the Committee on Renewable Koordination Locals submitted the following report, anddepth with your committee on a GMK OSL Section. local settlement consideration following bills of the House and the Senate will start to report the same back as filing recommendations. House Bill 1574, do pass, House Bill 1575, do pass, House Bill 1577, do pass, House Bill 1579, do pass, House Bill 1581, do pass, House Bill 1582, do pass, House Bill 1583, do\n\nnew pass was quickly submitted. It was in Jantankersey 160th District. Charlie. That completes the reading of the report to Standing Committees. You Okay, we're going on now to the local calendar. We're going on to the local calendar. There are 16 bills on the local calendar, which relate to homestead exemption, and those will require a recorded two-thirds roll call vote for passage. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered. The clerk will read the local calendar. Household 1062, Representative Camp, 131st Ups and County Household 1138, Representative Nilo 74, City of Marra Household 1196 by Rosewood. The state of Marra Household 119 by Rosewood. The holiday of 111st City of Locust Grove. Household 1417 by Rosewood. I voted the 62nd City of College Park. Household 1492 by Rosewood. I've Jones the 47th City of Milton. Household 1493 by Rosewood. I've Jones the 47th City of Milton. Household 1507 by Rosewood. I'm up to 1117 Paul Dink County. Household 1551 by Rosewood. I've camped on 131st. I'm up to 1117. I'm up to 1117. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee has agreed to. Shall these bills now pass? All those in favor of the passage of the bills? On the local calendar will vote aye. Those opposed to vote no. And the clerk will unlock the machines. What purpose does the majority leader rise? State your inquiry. Mr. Speaker, isn't it true that each of these measures that were on this local calendar have been asked for by the local authorities and they have been supported by the local delegation for each of these areas? Then they have the full support I may add again of the local delegations in this body for these measures. Is that not true, Mr. Speaker? Yes, that is generally true. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the local calendar. The eyes are 125 and the knees are 38. These bills having received the requisite constitutional majority are therefore passed what purpose does chairman tankerously rise? Mr. Speaker, I rise to make motion. State your motion. I move that we immediately transmit the local calendar to the Senate. Chairman tankerously has moved that the local calendar just passed by this house be immediately transmitted to the state Senate. Is there objection? Chair, here is none. And it is so ordered. All right, so while we are on local calendars, we will go ahead and do the supplemental. There is no objection. We will vote on the supplemental local calendar as a whole with a recorded vote. I would point out that one bill on the local calendar is an agreed disagree. Having received the requisite number of signatures required the house delegation wishes to agree to the Senate substitute. If there is no objection, we will vote on the local calendar as a whole with a recorded vote hearing none. It is so ordered that the clerk will read the local calendar. House Bill 1446 by Robson. Wilson, the 80th City of Brookhaven, House Bill 1460. The state of Brookhaven has been bent to the 31st town of Pendegrax, House Bill 1489. By substitute by Robson, it has been bombed out of the 17th Pauling County House Bill 1535 by Robson. Taylor, the 173rd, the Grady County, House Bill 1436 by Robson. Green and 150, the Lower Chattano, Hootsie Regional Transportation Authority, House Bill 1537 by Robson. Seaball, the 34th Cobb County, House Bill 1538 by Robson. All of which in the 42nd City of Smyrna, House Bill 1539 by Robson. The perpetrator of the 176th City Waycross, House Bill 1540 by substitute by Robson of Allen in the 40th Cobb County. House Bill 1541 by substitute by Robson of Allen in the 40th Cobb County, House Bill 1552 by Robson of Jackson of the 64th Union County. House Bill 1557 by Robson and gravely the 67th Pauling County, House Bill 1558 by Robson of Smyrna and 130th Columbus, Muscogee County. House Bill 1561 by Robson. Eventually the 139th Macon County, House Bill 1562 by Robson of Ralston of the 7th Gilmer County, House Bill 1564 by Robson. Approved of the 149th Wheeler County, House Bill 1565 by Robson of Mallow, the 163rd City of Savannah. House Bill 1566 by Robson of Houston, the 170th Barrier County, House Bill 1567 by Robson of Cameron of the 1st Day County, House Bill 1568 by Robson of Williams and the 115th Walton County, House Bill 1572 by substitute by Robson of Jocus, the 138th Sumter County, House Bill 1573 by Robson of Year to the 150th Second Worth County, House Bill 1574 by Robson of Taylor, the 173rd City of Cairo, House Bill 1575 by Robson of Crow, the 110th Buts, Halo County, House fill 1577 by Robson of Davis and the 87th Gab County, House Bill 1579 by Robson of Buckner of the 137th City of Woodland, House bill 1581 by Robson of Ridley the 6th City of Warnell, House Bill 1582 by Robson of Babylon of the 17th City of Dallas, House Bill 1583 by Robson of the 17th City of Dallas, House Bill 1584 by Robson of in the 17th City of Dallas, Senate Bill 1650 by Senator Malens of counting theells of Transportation. I'm not entirely Senate Bill 616, my Senator Mulls, the 53rd Shadooga County Senate Bill 64 by Senator Anatovart, the 31st City of Cedar Town, House Bill 771 by Senator Substitute, but Representative Thomas, the 39th City of Allstale. Is there any objection to the previous question being ordered on the local calendar? The chair here is none, the previous question is ordered, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills. The chair here is none, the report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar, the supplemental local calendar will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Member vote aye. Member kigee? Member kigee? Member kigee? Member kiges? Member kigee? Member kiz kolh diode? Member kigee? Member k不对? Sully before? Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the supplemental local calendar. The eyes are 152. The knees are 12. These bills having received the requisite constitutional majority are therefore passed what purpose does Chairman tankerously rise? Mr. Speaker, I rise to make motion. State your motion. I move that we immediately transmit the local calendar to the Senate. Chairman tankerously has moved that the local calendar, a supplemental local calendar, just passed by this house, be immediately transmitted to the state Senate. Is there objection? Chair here is none and it is so ordered. All right, we have a reconsideration from yesterday. On Tuesday, March 22, the house passed Senate Bill 331. The lady from the 58th district served notice of a motion to reconsider the action of the house in giving Senate Bill 331 the requisite majority. Now is the time for the lady to pursue the motion if she so desires. She so desires. On the lady's motion that the house reconsider its action in giving Senate Bill 331 a requisite constitutional majority, all those in favor of reconsideration will vote aye. Those opposed to reconsideration will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the lady's motion, those in voting in favor of reconsideration were 67. Those voting in opposition were 95 and the motion has failed. We are now going on to morning orders. One minute each for morning orders and the messenger is going to strictly enforce that. We've gotten a little bit lax with it. They recognize this chairman nicks for a morning order. Thank you, Mr. Speaker. Members of the House, I've got some good news for you this morning, but I also have some bad news for you. The good news is this, on crossover day, the Senate voted down their gambling legislation. The bad news is the sponsor says we've got a vehicle for them to ride that thing through the house on. I have put an article on your desk entitled America's gambling addiction is metastasizing. And I hope you'll take a look at that as I tell you before, gambling is not dead until the big guy behind me hits that big old hammer and says, sunny day. So I expect that monster to come back most any day now. Probably could come today because they like to come after dark and stormy night. Couple of things I'd get you to look at on page four. Transactions once considered the purview of the mafia have now been mainstreamed. Credit lines with 23%. Gambling relies on addiction for its business model to function. Gambling ruins lives by way of soul crushing debt. Don't let the Senate let us, don't let this house resurrect a bad idea that died in the Senate. Thank you, Mr. Speaker. Chair recognizes Chairman Jasper's for a morning order. Thank you, Mr. Speaker. Members, you might listen up real quick. Every time we do road namings throughout the year, I'm asked, Chairman Jasper's, how do I pay for this ad? Who do I get to pay for this sign? Do I take it out of my campaign funds or do I get somebody else to pay for it? Did a little research? You can use your expense reimbursement account. You follow their rules. You can use it for your ads and for the sign. So just make sure you follow their rules. That would be very successful. Also Mr. Speaker, in the any room, Mama Geraldine's famous age cheese straws. They're available all over the state of Georgia. This is a Georgia grown, Pickens County grown from the beginning to right now. They do a great job. Very tasty. I hope you enjoy them. And Mr. Speaker, thank you. I recognize his representative Hucley for a morning order. Thank you, Mr. Speaker and ladies and gentlemen of the House. I need to have everybody's attention for one second. On tomorrow, we are starting the celebration of the Dean of this House for his farewell. You're all invited to his farewell reception tomorrow from 5 to 7 at the College with Ball Hall of Fame. We are looking for you. Let us know that you're coming. Thank you, Mr. Speaker. I yield a well. Chair recognizes representative Wolenski for a morning order. Thank you, Speaker. I got an exciting announcement. We are launching the Georgia Israel Legislative Caucus tomorrow morning at 10 a.m. There will be a big press conference. There will be members from the Middle East and Gulf states in that area representing the Abraham Accords will be there. International folks will have great speakers. It's a huge event. The purpose of this caucus, much like the Georgia, Japan caucus, is to show the mutually beneficial relationship between Georgia and Israel. Local, military, agriculture, export, imports, and Georgia and Israel, such a good relationship that we're going to show everybody how important it is. I hope all y'all will join the caucus. Thank you all so much. Chair recognizes representative Edna Jackson for a morning order. Thank you, Mr. Chairman. To my fellow representative, it is an honor to tell you about Mamie George Williams. You have information on your desk. He was born in Savannah. I educated at Beach High School at Atlanta University. It became very active. In 1920, she was a member. She was very much involved in politics. This is unusual woman. She is African American. But if you look at the picture that's on your desk, it is very difficult to tell. Miss Williams, politics involved being a part of the party of the year at that time, which was the party of Lincoln. She earned all kind of recognition and became the first African American a woman to the national convention and a member of the Republican committee. She also organized over 200 women here in the state of Georgia, a trailblazer. For you, I said I see the light as red. But if you will just read and join us in recognizing Miss Williams. They recognize this representative scothel for a morning order. I saw a shade from Tickness Park. I think you missed the speaker and colleagues. Today is Lupus Advocacy Day at the Capitol. Lupus is an autoimmune disease that impacts over 90,000 Georgians. They are our families, live in our districts, attend our churches with us, and serve in this body. Thank you to the Georgia chapter of the Lupus Foundation of America, Lupus Advocates, Lupus Warriors across Georgia and the caregivers. For they are amazing work. For many, we know that Lupus sucks. We are making strides in our research, advocacy, and awareness. Thank you continually, thank you for all of the work they do in being Lupus champions. Thank you for wearing your cape. We are truly Lupus superheroes. Thank you. I yield the well. I have. Chair recognizes representative Angela Moore for a morning order. Just a reminder, everyone, that today is agricultural hero day. We are celebrating Kendall Ray Johnson, the youngest farmer here in Georgia. She is six years old. She's downstairs vetting every media here in the state of Georgia and New York in California. So she's really getting a good taste of what Georgia hero is all about. And we ask you to help support her down at the South Portico after session. Thank you. Chair recognizes representative Jasmine Clark for a morning order. Thank you, Mr. Speaker. This morning I rise to congratulate the Trichon Middle School Tiger Bots, the school's robotic team that will travel to Houston, Texas next month and compete in the 2022 first which stands for for inspiration and recognition of science and technology, robotics world championships. Only one hundred and eight teams out of twenty four thousand teams and fifty different countries are competing in this competition. So we are immensely proud of our Tiger Bots for their outstanding work and this amazing opportunity. Thank you, Mr. Speaker. Members of the House will come to order and take your seats. We have a couple of other special orders. Chair recognizes for a special order representative Dwayne Heels representative field. I promise that I'm not going to be too long. I got my scroll out here so well I got it is here. No, I'm just kidding. I wasn't going to say anything but I feel I need to. People I want to thank. My wife. It's a tougher and what I thought it'd be. She's probably better known around here than I am. I walked down the hall and somebody will say now who are you? My name is Dwayne Heel. Oh, your wand is husband, aren't you? So that's how they know me. I tell her every day that I love her more today. Then I did yesterday and I mean that our children, our daughters down Laura, our sons Wade, Joey and her youngest Brandon. I promised my brother and mom that I'd mention he's a name too. Wayne Palakwin. From Augustus, Georgia. Also my niece called me and said, you better tell them who makes you look good. She's the one that cuts my hair. Judy, Julie McCurdy from Ringo, Georgia. My friends Tom Weldon. Y'all remember Tom. Tom and Senator Mullis is the reason along with another gentleman. There's a reason I'm here. My church family, my admin, Delane Roberts, all the doorkeepers who made it pleasant. Michael Ralston, who my admire for his leadership, his patience with all of us. The first question I asked myself when I got here was Lord, what in the world am I doing here? Yeah. I don't believe things happen, just happen. So when I get to heaven I'll ask why me Lord, why is it that I get to serve was such a distinguished ladies and gentlemen. I love you. The Bible teaches me to love one another as we love ourselves. If we do that we'll be in great company. When I first got here I didn't have nothing but a badge. My name tag, I didn't have my badge. So somebody said you got to get a badge. I said well where did I go to get that? I didn't know. So you got to go to the speakers office. I said okay. Excuse me, where's the speakers office on third floor? I said okay so I come up to the third floor and I start my trip around. So let's see some guys that I had met and I waved at them second time around. I said yeah I'll do it okay. I didn't want to tell them I was lost so the third time I come around. I said well one more trip and I've got my workout in for the day. So then I come around one more time and there was a young man standing there and I'm headed in that direction and I said do you know where the speaker office is? He said yes sir he turned around and said there it is. So I done passed that thing four times. But it's been a good experience. I wouldn't take nothing for it. I've met such distinguished people as you ladies and gentlemen. I wish the dean the best on his new role. We're going to be honored to have you there. The speaker I thank him and Sheree have become part of our family. And I want to leave you with this. The day is long. My time is short. I bid you all farewell and Mr. Speaker I yield well.\n\nSo Well, we have another one of these here, but we're going to go ahead while people are greeting Representative Heill and do the rules calendar and then I'm going to ask you though at the end of the rules calendar to please stay in your seats. Clerk will read the caption to Senate Bill 341. Senate Bill 341, my Senator Kropatric, the 32nd Watson, the first Burke of the 11th and others being titled back to amend Article 2, Chapter 46, in Title 33, the Fish Go to Georgia and in Tederley, the prior authorizations of healthcare services so sort of guidelines for the prior authorization of prescribed medication for chronic conditions requiring ongoing medication therapy. This bill I've referred to the Committee on Health and Human Services. The Committee recommends that this bill do pass. Chair recognizes Chairman Newton to present the bill. Thank you, Mr. Speaker. Thank you, colleagues. I appreciated the support shown by the capes by heroes working against a chronic medical illness called Lupus. It's one that I've dealt with in the challenges and patients in the emergency department. Together, I bring you Senate Bill 341 today. That does give us an opportunity in a small but effective way of changing the lives of Georgians who do have chronic medical conditions. Senate Bill 341 addresses us a simple area but a crucial area for people that have a chronic medication need for a chronic condition. And that's the effort of going through what's called a prior authorization. Usually you can get two or three months of a medicine at once. What can typically happen is if you need a special medicine for your condition, your chronic condition, you have to go through what's called prior authorization. The patient and the doctor have to work together on that. Senate Bill 341 simply maintains that if you go through prior authorization once in a year, that's good for 12 months or until the end of your contract with your insurance company. You don't have to do it every three months. It's a small but effective step to assure that patients can get the medications they need. And they can get them with the minimal amount of disruption in their lives. They already have the disruption of a chronic medical condition. This just helps them do it with the least amount of interference and for the doctor and the patient to work together in a positive way. I hope you'll support Senate Bill 341. Mr. Speaker, I'll yield for any questions if there are. You have a couple of questions if you care to yield. I'm glad to. Yes sir. I yield. Chair recognizes representative Kouscher to your left for a question. Thank you. That's a gentleman yield. I did. Thank you for bringing this bill just a very quick question. We discuss a lot about mental health these days and in my mind, mental health disease can be regarded as a chronic disease. Would this bill cover prescriptions that are mental health related and substance abuse disorder is ordered related? The lady brings up an excellent point. This covers all medications for chronic medical conditions that are expected to last over 12 months. And as we've been going over so much in mental illness can be so much better treated if people will get on their medications and stay on them, avoiding emergency departments, hospitalization, commitments, and you're absolutely right. It will cover those as well. Thank you. Do you further yield? Yes sir. Chair recognizes representative Kinert to your left for a question. Yes, this is gentleman yield. Yes sir. What is the current timeline for most approvals? Most of the time it's a 90 day for medication so it will require the patient and the physician office to reapply each time. This just will streamline it to where you can get it once a year and it actually does cover dosage changes during that year as well as long as it's the same medication. Thank you. Thank you. With that, Mr. Speaker, I'll yield the well and appreciate your support. Is there any objection to the previous question being ordered? The chair here is none of the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none of the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye of those opposed to vote no and the clerk will unlock the machines? Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 341, the eyes are 161, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 493. Senate Bill 493, by Senator Mulles, 53 and Gucci, 51, to be in title 9 to amend part 7 on Article 5 of Chapter 3, Title 44, the physical and Georgia Entity Relating and Missalignis provisions regarding time share projects and programs, so it's authorized non-judicial foreclosure of time share estates. This bill then refer to the committee on judiciary that committee recommends this bill do pass. Chair recognizes Chairman Gunter to present the bill. Thank you, Mr. Speaker. Senate Bill 493 is exactly the same bill as House Bill 1088 that we passed out of here. What this does is it changes a time share and it only applies to time shares. Changes a foreclosure on time shares from judicial to non-judicial. Makes it more efficient for them to do that. I'll take any questions. Do you yield for questions? I do. You don't, I thought you had one, but you don't. So you have no questions. All right. Thank you. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Kouscher rise? Parliamentary inquiry. State your inquiry. Isn't it true that it's quiet? It's waste of resources. A time if the Senate keeps copying what we already accomplished? They have a tendency to do that. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of Senate Bill 493. The eyes are 159. The nays are two. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 469. Senate Bill 469, Senator Harper, the 7th. You know the 47th, that report of the 44th Jackson, the 41st and others will be entitled to an act of men article on chapter 7, the title 52. The Fish Go To George and Nintendo are relating the general provisions of registration, operation and sales of watercraft. So it's to require certain watercraft to have day and night visual distress signals on board when I'm coastal waters from Georgia. This bill I'm referring to the committee on game fishing parks that committee recommends this bill do pass. Chair recognizes the distinguished chairman of the game fishing parks committee, chairman Rhodes, to present the bill. Thank you, Mr. Speaker. You need to tell my bride that Senate bill. She didn't believe me. That's right. That's right. That'solutely. Senate Bill 469, this is the department bill and all this simply does is it updates our Georgia code to our federal code on our boat lighting, our boat lighting in our life vest. If we don't do this, we can stand to lose over $800,000 of federal funds. So I would appreciate your favor consideration. You're the well, Mr. Speaker. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed to vote no in the clerk will unlock the machines. What purpose is representative Kenner, derives parliamentary inquiry? State your inquiry. Isn't it true, Mr. Speaker, that my Senate law, this clerk is a officer in the United States, Cusgarden has just been assigned to a napless to teach at the Naval Academy. If the gentleman so states proud of his service. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of Senate Bill 469, the eyes are 164. The nasors zero, this bill having received the requisite constitutional majority. Is therefore passed clerk will read the caption to Senate Bill 358. Senate Bill 338 by Senator Patrick of the 32nd top, some of the 14th Harvest and the 15th and others. We tell them that to amend Code Section 3555, the Fish Go to Georgia, and it's headed relating the Georgia Public Safety Training Center available for use. By certain personnel, fees, enrollment, authorization for expended drew funds and powers and duties this bill having further committee on public safety and Homeland Security that committee recommends this bill do pass. Chair recognizes Chairman Belton to present the bill. Thank you Mr. Speaker, I'm honored to bring SB 358. This recommendation came from Trish Ross, Colonel Trish Ross. I used to work for her down at the Robin's Air Force base. She then led the formation of the Vector Center. If you have a Veterans Affairs question, the Vector Center Water Robbins, they can answer that question for you. Great job. She did such a good job. Now the Commissioner and the entire Veterans Affairs for the entire state. What this bill does is something we do already for police, cheese, wardens, emergency, medical personnel is allow veterans to transition to becoming law enforcement and paying the expenses to do that. It's going to affect about 10 to 15 people a year. Probably they cost about $3,600 and that's the bill. I'll ask them for questions. You do have a question, do you? Yes, I do. Chair recognizes Representative Lorricia, do you write for a question? Thank you Mr. Speaker, gentlemen, you too, my friend. Just wanted to say to the gentleman that we appreciate all your hard work for these veterans over the years. I think I speak for all of us when we appreciate that and just want to let you know that publicly. I want to say I appreciate the speaker for it was his vision that started this and we've passed, we'll pass this one, be 60 different bills, 60 or the last couple of years to help our veterans. Thank you, I'll yield the well. You are the running back though. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? No. If so, the clerk will lock the machine on the passage of Senate Bill 358. The eyes are 163. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. We agreed the caption to Senate Bill 395. Senate Bill 395, Senator Hatch, the 50th, the Bitalan Act to amend Code Section 1562, the Fish Go To Georgia Antietta, really. The number of judges and the Spiricords so it's required for a third judge and the Spiricord of the Mountain Judicial Circuit. This bill ever referred to the committee on Judiciary. That committee recommends this bill do pass. Chair recognizes Chairman Gunter to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House Senate Bill 395, as you just heard, adds a third judge to the Mountain Judicial Circuit. This is determined by a workload assessment done by the Judicial Council in AOC. The Mountain Judicial Circuit has ranked up there for the last few years. They're now sitting in the third position. This will add one judge to the circuit and I'll take any questions that you might have. Okay, we have too many judges. Can we? It grows every year. Yeah, you have no questions. Thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 395. The eyes are 162. The nasor zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 396. Senate Bill 396, Senator Goodman, the 8 Jones, the 22nd walk of the 20th and others being titled back to men chapter 17 and titled two of the official code of Georgia and Tate relating the Georgia State Nutrition Assistance Program. So it's the rename such program to the Georgia grown farm to food bank program. This bill have referred to the committee on agriculture consumer affairs. That committee recommends a dispel do pass. Chair recognizes representative meeks to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I have the opportunity to bring to you today Senate Bill 396, Georgia grown farm to food bank program bill that came over from the Senate. Farmers across our state day in and day out work very diligently to provide the most affordable, safest, most abundant food supply in the world. We work as they do is the active half of duty and it's also true that time and nature also provides opportunities and limitations to aspects that are critical in agriculture. The farm to food bank program is a program that was in current code. We have now funded the program at 800,000 updates to code to allow Georgia growers to sell to food banks across our state, therefore providing fresh fruit and vegetables that are grown in Georgia to food banks to then provide to those that are less fortunate. Food banks across Georgia reported they received 14 million pounds of produce each year, but turn away four to five million pounds of produce because there is a lack of funding. No funds have been appropriated to this to this program since its inception of 1998. So we're in the budget putting in 800,000 and then updating the current code to allow for the Department of Agriculture to establish the program. Without Mr. Speaker, I'll be happy to take a question if there is any. If not, I will yield the will. You do have some questions. Okay, Mr. Speaker. Chair recognizes Chairman Watson. Do you arrive for a question? Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. Is it not true that this bill would be the perfect example of altruism? That is certainly true. You know what you speak. Good deal. Thank you. Thank you, Mr. Speaker. I'll yield the will and ask for your favorable considerations. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Bennett rise? Parliamentary inquiry. Is it not true that this bill would do a lot to help resolve food? Inequities and Georgia. Food deserts. I should think it would. Thank you, Mr. Speaker. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of Senate Bill 396. The eyes are 161. The nays are zero. The bill having received the requisite constitutional majority is therefore passed. Members of the House will continue to be seated and be in order. We have another special order. Chair recognizes Chairman Dave Belton for a special order. Mr. Speaker of this very rare honor. Here the mighty engines roar. See the silver wing on high. She's away in western bound far above the sky. She'll fly. The rain doesn't fall and the sun's always shines. I'll be flying over this dome at about two minutes time. For I to slip the surly bonds of earth and dance this guy is on laughter, silver wings, sunward I've climbed. Enjoy the tumbling murr, the sun split clouds and done a hundred things. Weeled and soared and swung high in the sunlit silence chasing the laughing wind through footless halls of air up, up, up, the delirious burning blue top in the towering heights where lark nor eagle ever flew. The high untressed past sanctity of space, the silent lifting mind I've trod and put out my trembling hand and touch the face of God. Thank you. All right. All right. We the clerk has a trayful of local bills up here submitted by members of both parties. We have gotten along pretty well with a little procedure we've had. So the chair would ask for unanimous consent that the rules of the house be temporarily suspended to allow those bills to be raised. The bill is to be read and assigned to read for the first time in a signed a committee. They will each be assigned to intergovernmental coordination. Is there any objection chair here's none and it is so ordered they all go to intergovernmental coordination. What purpose does chairman Dubnik rise to make a motion state your motion. Mr. Speaker I moved that Senate bill 316 be moved from the House Education Committee to the House Judiciary non civil committee both chairman or in agreement. Chairman Dubnik is moved that how Senate bill 316 be transferred from the Education Committee to the Judiciary non civil committee the clerk will read the caption. Senate bill 316 to be titled an act to amend article 7, Chapter 5, Title 16, the fiscal to George Antiter really stalking so to provide that a person 18 years or older who commits the offense of stalking gets the minor shall be guiltly of high and aggravated misdemean. On the gentleman's motion that Senate bill 316 be transferred from education to Judiciary non civil is their objection is their objection the chair here's none and it is so ordered what purpose does chairman of stration rise make a motion state your motion. Speaker I moved that House bill 1578 be transferred from the Judiciary Committee to the intergovernmental coordination committee both chairman or in agreement. Chairman of stration has moved that House bill 1578 be transferred from the Judiciary Committee to the intergovernmental coordination committee the clerk will read the caption. House bill 1578 to be entitled act to provide for the designation the chief judge of the multi judicial circuit. On the gentleman's motion that House bill 1578 be transferred from the Judiciary Committee to the intergovernmental coordination committee is there any objection the chair here's none and it is so ordered. Clerk will read the caption to a group of privileged resolutions. Clerk will read. Honoring the life of many a memory of penny Morgan. Honoring the life of memory of Bruce Burge. Commending travel unity in recognizing March 22nd through 25th 2022 is the first regional event in the southeast. Commending AIDS, land and recognizing the foundation's 40th anniversary. Recognizing commending, Robert and Bob E. James for over 50 years with Carver State Bank as president CEO and celebrating the 95th anniversary of Carver State Bank. Commending Georgia Alignment and recognizing April 11th, 2022 is Georgia Alignment Appreciation Day to stay capital. Commending, Kalea Nelson. Commending the House in terms for the 2022 regular session of the Georgia Assembly of Georgia. Commending the House session assistance for the 2022 regular session. Recognizing the Association of Georgia General Aviation Airports in an industry association for general aviation airports in the state of Georgia and its corporate officers. Recognizing commending Samantha Sennady Kimberly Ward. Commending the Nation of Israel for its core, don't mutual benefit relationship with the United States and with the state of Georgia. Recognizing April 4th, 2022 is celebration of organized labor day in Georgia Day. Recognizing commending Jerome Stevens. Commending the Georgia Chapter, Lupus Foundation of America. And recognizing March 23rd, 2022 is Lupus Advocacy Day at the State Capital. Commending the Norris Price 2022 Georgia Superintendent of the Year. Commending and congratulating Mary Frances Blaylock. Recognizing and commending Tom Haffing on his outstanding public services CEO of the Sandy Springs perimeter chamber. And honoring the life and memory of Betty Blondow. And for other purposes that completes the reading of the privilege resolutions. Any objection to adopting the privilege resolutions that Chair here is none? And the resolutions are adopted. We're about to go on to announcements. If you have signed up for an announcement, make your way to the end.\n\nto the front of the chamber. Chair recognizes Chairman Gerald Green for an announcement. Thank you, Mr. Speaker. The State Propagate Committee will meet today at 1 p.m., 1 p.m. in room 506. Thank you, Mr. Speaker. Chair recognizes Chairman Warkhizer for an announcement. Thank you, Mr. Speaker. The Interest in Labor House Committee will meet today in CLOB 506 at 3 o'clock. Thank you. Chair recognizes Chairman Watson for an announcement. Thank you, Mr. Speaker. Rua Caucus will meet upon adjournment 201 and Department of Agriculture. We've got the University of Georgia College of Agriculture meeting today. Thank you. Chair recognizes Chairman Demnick for an announcement. Thank you, Mr. Speaker. The House Education Committee will meet at 1 p.m. in room 341. Thank you. Chair recognizes Chairman Knight for an announcement. Thank you, Mr. Speaker. Just want to go ahead and get you all to look at the calendar for next Wednesday, the 30th, sometime in the afternoon, the sportsman's caucus as we usually do in the house in the center. We're going to have an event, a sporting event, we're about to hopefully get the details out, but I want to go ahead and get you to mark your calendar on the 30th from 5 to 8. We'll get details out shortly and have our annual sporting shooting event. Thank you. Chair recognizes Chairman Mitchell for an announcement. Thank you, Mr. Speaker. Despite the notices that you may have received, there will be no Democratic Caucus meeting tomorrow. We will meet via Zoom on Friday at 8 a.m. expect the updated notice. Thank you, Mr. Speaker. Chair recognizes Representative Gullet for an announcement. Thank you, full committee of governmental affairs will meet today at 2 o'clock, room 406 in the CLOB. Thank you. Chair recognizes Representative Cannon for an announcement. Thank you, Mr. Speaker. Good morning, members. Today, well star is sponsoring the first annual provider appreciation date. There are three resolutions that have been done for three nurse midwives and OBGYNs. You're all invited to cap 125 today. Thank you. Chair recognizes Representative Becky Evans for an announcement. The decad delegation will meet virtually and lunch at noon or upon a journey and lunch pickup is in 404 CLOB. Chair recognizes Representative Wolenski for an announcement. Thank you, Speaker. Tomorrow morning 10 a.m., I announced it. I forgot to say where. Georgia, Ijzeriel legislative caucus meeting 10 a.m. at the South Stairs press conference. Hope you all will be there to show support. Thank you. As you know, tomorrow we are having a committee work day and I know everybody is going to be here working. We'll check and make sure that you are. But it's also a special day. It's the birthday of Representative Brian Prince. Happy birthday. Congratulations. Congratulations. Congratulations. Congratulations. Congratulations. Congratulations. Congratulations. Congratulations. Chair recognizes the majority leader of the House for a motion. Thank you, Miss Speaker. Mr. Speaker, in concurrence with our House calendar, that includes our German date, and we have a move that this House standard turned until 10 a.m. Friday, marched the 25th at 2022. So now let me get to see if I understand this. It is a Friday. Correct. That is correct, Miss Speaker. But the German resolution has been out since what late January. Pretty close, Miss Speaker. I think that's correct. Everybody has known of the Fridays that we would be here at least that far in advance. Absolutely. And tomorrow is a committee work day as well. Yes, sir. Thank you, Mr. Leader. The majority leader has moved that this House standard turned until Friday morning, March 25th at 10 a.m. All those in favor of the motion will say, those opposed will give a resounding no. The I seem to have it. This House will be adjourned until Friday, March 25th at 10 a.m. Thank you.",
  "updated_at": "2026-02-13T22:05:59.811738+00:00"
}