{
  "video_id": "0pFCuZYx_Ak",
  "url": "https://youtu.be/0pFCuZYx_Ak",
  "title": "Georgia House - Day 39 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-03-29",
  "duration_minutes": 32,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThe session focused on the adoption of several privileged resolutions honoring community members, as well as the consideration of Senate Bill 42 which deals with school discipline reporting and homeschool student participation in extracurricular activities.\n\n**Key Actions**\n- **Senate Bill 42**: This bill would require schools to publicly report student discipline data and allow homeschool students to participate in public school extracurricular activities under certain conditions.\n\n**Bills Introduced (First Reading)**\nNone detected\n\n**Notable Moments**\n- Speeches and discussion around Senate Bill 42, including comments from Chairman Carson explaining the bill's provisions.\n- Recognitions and privilege resolutions honoring various community members and award recipients.\n\n**Votes**\nNo recorded votes detected in the transcript.\n\n**Attendance**\nNo specific quorum notes provided.\n\n**Adjournment**\nThe transcript does not include the time of adjournment or mention of the next scheduled session.",
  "transcript": "House will come back to order. House will come back to order. Clerk will ring the bell.\nYou\nYou\nClark will read the caption to a group of privileged resolutions honoring a life and\nmemory of Gary Kitchen, honoring the life and memory of Ralph Anthony Graves, a senior,\ncommending the Psyomego mega chapter of Alpha Kappa Alpha Sorority.\nAnd for other purposes, I can please the reading that privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nHere's none, and they are adopted.\nYou\nPark will read the caption to another group of privileged resolutions.\nRecognizing commending, Julie Smith, the 2021 heart of the Community Award recipient,\nrecognizing and commending Emily Jorke, the 2021 Heart of the Community Award recipient,\nrecognizing and commending Monica Shepherd, the 2021 Heart of the Community Award recipient,\nrecognizing commanding Dr. Matthews McLean,\nthe 2021 Heart of the Community Award recipient.\nRecognizing commanding Allen Shropshire,\nthe 2021 Heart of the Community Award recipient.\nHonoring the Life and Memory of Nell Holland Reagan,\nthe 2021 Heart of the Community Award recipient\nand for other purposes that completes the reading\nof the privilege resolution.\nIs there any objection to adopt or not?\nIs there any objection to adopting the privilege resolutions?\nThe chair here's none and the resolutions are adopted.\nChair recognizes the Houseways and Means Chairman, Chairman Blackman.\nspeaker move we appoint a committee of conference on Senate Bill 6.\nChairman Blackman in moves at the House insists on its position in\ndisagreeing to the Senate substitute to Senate Bill 6 and that a committee of\nconference be appointed clerk will read the caption. Senate Bill 6 by Senator\nAlverson 56 and others to be entitled back to a men article 3 chapter 5 of\nTitle 28, if you go to Georgia annotated, relating notes, fiscal bills generally\nsays to provide for independent economic analysis.\nIs there any of the gentlemen has moved that this house insists on its position on Senate\nBill 6 and that the Committee of Conference be appointed?\nIs there objection?\nThe chair here is none of this house has insisted.\nThe chair appoints as a committee of conference.\nRepresentative Blackman from the 146 Representative Williamson of the 115th and Representative\nBurns of the 159th District.\nThe clerk will read the caption to Senate Bill 42.\nSenate Bill 42 by Senator Mulles, the 53rd.\nGute to the 51st Harvest and the 15th,\nand others to be titled an act to amend.\nCode section 20, 14, 33,\nthe official go to Georgia, Antietta, relating indicators of quality of learning and individual\nschools and school systems, comparison to state standards, grading schools and schools\nsystems. This bill ever referred to the Committee on Education, that committee recommends\nthat this bill do pass by committee substitute.\nChair recognizes Chairman Carson to present the bill.\nMr. Speaker, folks, I present to you House Smith Senate bill 42.\nThis is coming to us from the Senate in regard to behavior reporting and transparency.\nWhat this is doing is creating transparency for school discipline reports posted on to be that these discipline reports be posted on a school's website.\nAlso that they'd be available in printed copy to community members at no cost.\nBut in addition, these reports, discipline reports will also be reported to the Governor's\nOffice of Student Achievement and the Department of Education.\nIt doesn't change the standards, doesn't change the scoring, it just requires more transparency\non behavior and conduct reporting.\nThis portion of the bill in particular is supported by educators first, GSA, PAGE, DOE, and others.\nAnd the other part of the bill, I know a lot of people care passionately about this.\nThis is what is called the Dexter Mosley Act.\nI tried to get Chairman Jasper's to call this the T-boat Bill and he's too much of a Georgia\nfan to call it that, but essentially what this does is this is an issue we've been talking\nabout in this capital for many years and we're moving forward to allow home studies students\nto participate in grade 6 through 12 extracurricular activities. On certain\nconditions, number one, they must take one qualifying course in their home\npublic school. That could be online, it could be dual enrollment, it could be face\nto face. That student must register for the course at least 30 days before the\nfirst day of school. They must participate in the public school for which they\nare zone, so they can't live in one zone and participate in scholastic\nsports or what-have-you or extracurricular activities in another school district.\nThey must meet all the normal requirements on participation, age, academics, behavior,\nconduct, zoning and so forth. And by the way, physical examinations and vaccinations,\nall of that's handled are enforced by Georgia High School Sports Association,\nwho is in favor of the bill anyways. And in addition, if any student withdraws\nfrom the public school, that student is\nineligible to participate in sports\nfor a 12-month period.\nAnd the reason we're doing this is because\nif someone is a public school student,\nfor example, not a homeschool student,\nand they withdraw, they can't just\nautomatically go back under this program\nand play in sports and so forth.\nThey have to sit out for 12 months.\nI just want to thank Chairman Rick Jaspers\nfor his work on this.\nAfter years of work with the GHSA,\nthe homeschool community.\nI know many of us have seen the two homeschool ladies and others that we've heard from in our constituents and\nIt's it's a great step forward and mr. Speaker if there's no questions, I will yield the well\nYou have some questions if you care to yield I'll take a couple questions, sir\nRecognizes Chairman Martin to your left for a question\nChairman Carson, you owe a full question?\nYes, sir, go ahead.\nThis is a friendly question, I believe.\nI do want to inquire a little more deeply\nin the issue of a student athlete\nwithdrawing from a public school to be in a homeschool\nand being prohibited from playing.\nIt is not true that the Georgia High School Association\nhas transfer rules, and my concern would be\nif something happened that we can't look into the future\ntoday in this capital that caused a student athlete to need to go to homeschool.\nAs long as they were still in the school district from whence they withdrew, would they still\nhave to sit at 12 months?\nAs long as they're meeting the requirements under this to still enroll in one class,\nas my understanding is that they would be able to qualify.\nSo if you deal with one more question, so I can look at it more deeply here, but it\nis not specifically causing them to miss a year simply because they moved from public\nschool into a homeschool, only under other circumstances whereby they would otherwise\nnot be eligible.\nThat is my understanding.\nThank you.\nI'll take one more question, Mr. Speaker.\nrecognizes representative Wilson in the gallery to your right.\nWill the gentleman yield?\nYes, thank you.\nIs it not true that Dexter Mosley was well known in House District Gatie and was a champion\nin our community?\nThat's absolutely correct and to my friend's point, Dexter Mosley, God rest his soul.\nHis wife is out here in the hallway advocating for this, fighting for this, fighting for\nher children. He unfortunately passed away several years ago, and this is just a great\ntime to honor him and to give all homes to do, homeschool, study, students, and\nopportunity in Georgia. Thank you for that question. And his wife has been here\nevery day this session. And not just, yes, sir, not just here, but not just here\nfor two hours, more like sometimes 10, 12 hours at a time. So she is very\npassionate about this but all over Georgia we have people that are passionate about this\nyes sir.\nIt's a well drafted bill and I appreciate you bringing it.\nThank you very much.\nMr. Speaker, I'm sure there's a number of other legislative business we can get to and\nat this time I'd just like to yield the will.\nIs there any objection to the previous question being ordered?\nChair here's an un, the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none of the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill?\nThe chair here is none of the report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill?\nWill vote aye, those opposed to vote no?\nAnd the clerk will unlock the machines.\nI have all members voted, I have all members voted, I have all members voted, I have\nof so the clerk will lock the machines on the passage of Senate Bill 42.\nThe eyes are 149.\nThe nays are 13.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe're going to read the caption to Senate Bill 215.\nSenate Bill 215 by Senator Walker, the 20th, the 11th, and others to be entitled to\nan act to amend Article 1 of Chapter 7 in Title 31.\nThe official go to Georgia annotated\nrelating regulations of hospitals\nand related institutions,\nso as to authorize certified medication aids\nto administer certain medications\nthis bill ever referred to the community\non Health and Human Services.\nThat committee recommends this bill do pass\nby committee substitute.\nChair recognizes representative LaHood\nto present the bill.\nThank you, Mr. Speaker, and members.\nThe Committee's substitute to Senate Bill 215 is a workforce bill for the long-term\ncare providers.\nAnd so it does two things.\nFirst, it allows certified medication aids to be employed by skilled nursing homes.\nAnd second, it allows or requires the Department of Community Health to authorize certified\nnursing aid, employer-based training, and other type settings such as assisted living, personal\ncare homes, private home care providers, and other long-term care types.\nIt's a great bill.\nIt'll do a lot to help the strain on the workforce in this industry and the department has been\npart of this conversation and all the other stakeholders so I appreciate your\nfavorable consideration and Mr. Speaker I'll take questions if there are any\nif not I'll yield the well looks like you do have one question do you yield yes\nI'll yield chair recognizes representative Jasmine Clark in the gallery to\nyour left for a question thank you Mrs. Speaker does Jeremy yield yes I do could\nWould you just please clarify what LC number you're reading from?\nYep, LC-33-8807S.\nRight, thank you.\nMr. Speaker, I'll give you some other questions.\nThank you.\nIs there any objection to the previous question being ordered?\nThe chair here is none the previous question is ordered.\nAn amendment has been offered.\nThere is an amendment.\nis the Settler Amendment AM-3319-7-0.\nWhat purpose does Chairman Settler rise?\nI'm a speaker like to make a motion\nto withdraw the amendment.\nGentlemen has moved for unanimous consent\nto withdraw the amendment.\nIs there any objection to withdraw of the amendment?\nChair, here's none.\nThe amendment is withdrawn.\nIs there any objection to adopting the amendment offered by the committee on rules?\nThe chair here is none.\nThe amendment is adopted.\nIs there any objection to adopting the committee substitute as amended?\nThe chair here is none.\nThe committee substitute as amended is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nchair here's none the report of the committee is agreed to shall this bill\nnow pass all those in favor of the passage of the bill will vote aye those\nopposed will vote no and the clerk will unlock the machines\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of Senate Bill 215.\nThe eyes are 154.\nThe nays are nine.\nThis bill having received the requisite constitutional majority is therefore passed.\nClerk will read the caption.\nthe Senate bill 107.\nSenate bill 107 by Senator Strickland,\nthe 17th Carpatrick, the 32nd,\ndue to the 30th and others,\nbe taught on an act to amend Article 12 of the chapter three.\nOf Title 20, the official go to Georgia and Teddy,\nrelating to post-secondary education grants\nfor foster children and adopted children.\nThis bill I refer to the committee on higher education.\nThat committee recommends that this bill do pass\nby committee substitute.\nChair recognizes representative Reeves to present the bill.\nThank you, Mr. Speaker.\nSenate Bill 107 is another great example of the synergy that's going on in this capital\nof what the House, the Senate and the Governor's Office have all been doing, working together\nto try to create a better environment for foster children here in Georgia.\nAnd what Senate Bill 107 does is that certain qualified foster children will be eligible\nto have their tuition and fees waived if they attend a technical college of Georgia.\nThis is a great policy as we try to help the students that have had some of the most\ndifficult roads imaginable that they have educational opportunities and to develop skill\nsets and have meaningful careers.\nThe bill also incorporates a bill that was previously filed by a representative, Sandra\nScott, that would allow any person that qualifies as a homeless student under certain\nqualifications would be able to receive in-state tuition as opposed to out-of-state tuition.\nAnd the bill also is going, it has an amendment that the Speaker-Predtem Jones is going\nto speak about that relates to waiving GED fees for foster kids as well.\nMr. Speaker, I will be happy to yield for questions.\nYou have no questions.\nGreat.\nAre we yield the well?\nI'm sorry you do have a question.\nOkay, I yield.\nDo you yield?\nChair recognizes representative Scott in the gallery for a question.\nYeah, that's the gentleman you I do. I\nWould just like to say thank you to\nRepresentative Chuck Martin for his hard work in\nDillan to see and getting house bill seven\nIncorporated into this bill because he had worked very hard to make sure that the homeless and false\nCare students bill for the opportunity and I was just like the personally said thank you\nRepresentative mine. Thank you, Representative Scott, and I'm sorry, I'll yield one more.\nChair recognizes representative Cannon to your left for a question.\nThank you, do you? I do.\nI just wanted to ask since we do have a member of this body who came out of the foster care system,\nhave you discussed this bill with that legislator?\nbecause I certainly have and she has expressed her interests and desire and gratefulness for this important piece of legislation.\nObviously, this is a sit-it bill. I know that I have discussed with Representative Thomas some of the stuff that we've been doing.\nI'm not sure if I've discussed this bill directly with her, but I certainly appreciate her input and support for foster care issues in Georgia.\nMr. Speaker, I will yield the well.\nGentlemen is yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here's none.\nThe previous question is ordered.\nWe have an amendment.\nThe amendment is brought by the Speaker Pro Tem of the House.\nIt is the Jones Amendment AM 490026.\nChair recognizes the Speaker ProTIM to speak to her amendment.\nWell, thank you, Mr. Speaker.\nThis just adds a provision on page seven that the students who meet the qualifications\nfor tuition waiver would also be eligible to have all of their tuition and fees and the\ntest cost to obtain a GED at the technical college system of Georgia. I've\nspoken with them and the cost will be relatively minimal but for many\nstudents that are older or that age out many of them do not obtain a high\nschool degree so getting a GED may be their first step on the wrong of moving up\nand being able to take advantage of the other areas\nthat are contained in this good bill.\nAnd I would appreciate your favorable consideration\nwith that Mr. Speaker, I'll yield the well.\nClerk will read the Jones amendment.\nJones of the 47th offers the following amendment, A.M. 49, 0, 0, 26. This amendment has been printed\nand is on the tables behind the chamber.\nIs there any objection to adopting the Jones amendment? Is there objection? Chair, here's\nthat is not and the amendment is adopted.\nIs there any objection to adopting the amendment\noffered by the committee on the rules?\nThe chair here's none.\nThe amendment is adopted, is there any objection\nto adopting the committee substitute as amended?\nThe chair here's none, the committee substitute\nas amended is adopted, is there any objection\nto agreeing to the report of the committee,\nwhich was favorable to the passage of the bill,\nChair, here's none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill\nwill vote aye.\nThose opposed will vote no, and the clerk will unlock\nthe machine.\nI have all members voted, have all members voted, if so, the clerk will lock the machine\nOn the passage of Senate Bill 107, the eyes are 166.\nThe nays are zero.\nThis bill having received the requisite constitutional majority\nis therefore passed.\nEarlier today, this house failed to give Senate Bill 260.\nThe requisite constitutional majority, the House, reconsidered its action.\nIt is on the general calendar and it is called at this time.\nThe clerk will read the caption to Senate Bill 260.\nSenate Bill 260 by Senator Harper,\nthe seventh of being titled an act to amend code section\n2, 12, 80, the fiscal to Georgia,\nannotated related to promulgation and adoption\nof rules and regulations and sharing of information.\nSo it's to exclude certain soil amendments from regulation.\nChair recognizes a representative,\nDickie, do you wish to come to the boil\nor from your desk, I recognize you.\nMr. Baker, my motion.\nExcellent.\nYes, it's your motion.\nChair recognizes Chairman Dickey\nto explain the bill.\nThank you, minister Speaker.\nWe're going to try this one more time.\nI appreciate your reconsideration of this bill.\nIt's a good bill that's been a lot of work put in it\nby our committee and by other members of this house.\nAnd we'll really take care of some work of process\nto take care of some issues that's been in the past.\nAnd these solar members are not some things\nthat have been brought up to attention in past years.\nAnd this bill really gets the Department of Ag\nand engaged in EPD and others to monitor what is being put down,\nto monitor the amount that's put down\nwith these sole nutrient tests.\nAnd I think this bill really sets the right balance\nto take care of these much-needed solar amendments\nfrom a critical industry of hours\nto be able to be disposed of\nand put on as fertilizer\nand those type of things on some ground.\nAnd so without saying too much more,\nI think the bill just really finishes up\nsome process that we started last year\nand we'll finish up with this bill.\nAnd I think it's very reasonable attempt to do that.\nAnd so I'd ask for your vote for this bill 260.\nThank you very much.\nI'll yield a well, Mr. Speaker.\nGentlemen, as yielded the well,\nis there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill.\nThe chair here is none.\nThe report of the committee has agreed to.\nShall this bill now pass all those in favor\nof the passage of the bill?\nWill vote aye, those opposed to vote no,\nand the clerk will unlock the machine.\nWhat purpose does representative Mary Frances Williams rise?\nis it not true that this bill still contains language that would not allow communities to\nhave setbacks of more than 100 feet.\nAnd is it not true that the distance of 100 feet\nis comparable, is the same as going from our well,\nthe lectern at the well, to halfway into the hall.\nThat's the distance of 100 feet.\nI think everyone's had plenty of time\nto read the bill and be familiar with its content.\nWhat purpose does representative Maynard rise pursuant to code one three three.\nI'd like to be excused from this bill, please.\nLady has that right and the journal will so reflect.\nAll right, as all members voted, have all members voted, if so, the clerk will lock the\nmachine on the passage of Senate Bill 260.\nThe eyes are 92, the nays are 69.\nThis bill having received the requisite constitutional majority is therefore passed.\nOkay, we're going to be at ease for about five minutes so that you can go out to the back\nof the chamber, the back of the gallery and the back of 341 and pick up the latest supplemental\nrules calendar and the bills.\n",
  "updated_at": "2026-02-12T13:17:35.803537+00:00"
}