{
  "video_id": "0pXNSaNtYmg",
  "url": "https://www.youtube.com/watch?v=0pXNSaNtYmg",
  "title": "Sen. Jackson Press Conference on ICE | 01/13/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 26,
  "summary": "Overview\n- This press conference featured Georgia state senators condemning the actions of the Trump administration and federal immigration enforcement agencies like ICE. They announced new legislation to protect immigrant communities and limit the use of the National Guard without state permission.\n\nKey Actions\n- **SB 390**: Prohibit the armed state forces (National Guard) from being deployed in Georgia without the permission of the state's elected leaders.\n- **SB 391**: Prevent immigration enforcement without a judicial warrant in sensitive locations like schools, hospitals, places of worship, and domestic violence shelters.\n\nBills Introduced (First Reading)\n- SB 390: Prohibit National Guard deployment without state permission\n- SB 391: Restrict immigration enforcement in sensitive locations\n\nNotable Moments\n- Moment of silence to honor lives lost due to ICE actions\n- Speeches by Senators Ramon and Jones condemning the Trump administration's treatment of immigrant communities\n\nVotes\n- No recorded votes, these were bill introductions.\n\nAttendance\n- The press conference featured several Georgia state senators speaking in support of the immigrant community and the proposed legislation.\n\nAdjournment\n- No specific adjournment time noted, this was a press conference rather than a legislative session.",
  "transcript": "good afternoon everyone good afternoon and thank you all so much for joining us\ntoday we stand here united today and every day in our universal call to speak\nout against injustices raining down on our neighbors in our state and\nthroughout the country as we gather here today I want to pause to thank all of\nthe advocates who have been doing the work of protecting and helping our immigrant and\nrefugee communities for years and years, not just this week, but for decades of work\nthat our advocates have provided to make sure that people who move to this great state\nare able to have an opportunity for a great stable life.\nI want to invite us before we begin with our speeches formally to take a moment of silence.\nWe will pause in silence to honor the lives of those who have been lost at the hands of\nICE.\nWe will pause in silence to honor those who are being detained and we will pause in silence\nto honor the families and the loved ones who grieve their friends and families absence.\nSo please join me in a moment of silence.\nI'm in. It's now my great privilege and honor to introduce to you, Georgia's first Muslim\nlawmaker. Senator Shake Ramon is an incredible friend, has been a great ally and voice with\nme and the work that I do and I'm honored to be able to stand by him and beside him\nI see represents his community and so many others.\nSo with that, I turn it over to Senator Ramon.\nThank you, appreciate it.\nGood afternoon.\nThank you to my fellow senators,\nthe Georgians standing behind us today\nand to all of you for being here.\nI'm a state Senator Sheikh Ramon\nAnd it's my honor to represent part of Gunaat County,\none of the most diverse counties in Georgia\nand home to a significant immigrant population.\nAs you may have guessed, I was not born in this country,\nI still remember vividly when I first\nmigrated to the United States during the Iran-Hoster's\ncrisis in the 80s.\nAnd we call, rag head, and to go back home.\nBut luckily for him, I'm still here\nand be proud to be your state senator.\nYes.\nWoo!\nWoo!\nTo my fellow immigrants, I understand\nwhile hostility and privileges against us still exist,\nI want to offer you hope.\nAnd after more than four decades in this country,\nI have witnessed the progress we have made.\nAnd I know that progress will continue,\nas long as we continue to stand up for one another.\nOver the last several months,\nDonald Trump has unleashed fertile agents on families\nand communities across our country.\nHis action have inflamed tensions,\nrepeated Americans against American and grossly overstepped his authority.\nHe has fertilized national guard members, pulling them away from their families and their\njobs to police other Americans without the state's permissions.\nWe have seen masked armed federal agents reap women out of their cars, throw them into\nunmarked vehicles and wicks them away in broad daylight.\nWe have seen agents unloaded weapons at lawful protesters.\nWe have seen them beat, detain, deport, and even kill Americans.\nAnd why?\nDonald Trump claims he's simply enforcing immigration laws\nand removing violent criminals.\nBut the reality on the ground tells a very different story.\nHardworking immigrants trying to build a life in this country\nhave been theorized at their jobs, their schools,\nand their places of worship.\nAmericans and lawful parliament residents\nhave been caught in the crossfire simply\nfor believing that what they are witnessing is wrong.\nAnd it is wrong.\nDonald Trump has normalized the harassment of everyday people\nand entire communities simply for being a little too brown\nor for having a little different accent.\nToday, Democrats are introducing legislation\nto protect the rights of Georgian.\nThis legislation will prevent national guard units\nfrom being deployed to Georgia\nwithout the express permission of George's governor.\nProhibit, fertile immigration, enforcement,\nwithout a warrant on his school grounds,\nin places of worship and in hospitals,\nwhat Donald Trump has done to American communities\nover the last year is sickening.\nNo one should be subjected to the brazen, violent act\nWe have witnessed in recent months unleashing law enforcement officers and brave Americans service members like secret police is simply an un-American\nwith that. With that I want to thank my colleagues for standing united in defense of our immigrant\ncommunity is now my honor to introduce to our leader Jones I'm sorry I didn't see you\nI'm sorry, I was looking for you.\nThank you, appreciate it, thank you very much.\nThank you, and good afternoon.\nGood afternoon.\nEveryone's presence here today is what it looks like\nwhen people come together to fight for democracy,\nto fight for the ideals of this nation.\nAmerica has struggled modally to live up to its principles\nand ideals, but over the last 50 plus years,\nwe have been pushing to achieve those ideals.\nAnd although there have been roadblocks and sometimes speed bumps\non the way to progress, it always appeared\nthat the march to achieving the ideals of this country\nwould continue.\nBut what we are facing today is not a speed bump against progress.\nWhat we are facing today is an attempt to put up a permanent wall\nthrough progress.\nIt is an attempt to place a veil of tyranny upon all of us.\nAnd to accomplish this, the Trump regime\nhas decided to use the brave women and women\nof the guard, of the National Guard.\nThe guard is here to help.\nThe guard is always here when we have natural disasters\nor global pandemics.\nThe guard is made up of selfish individuals\nwho have believed their families to do what, to help us.\nBut the current administration has decided\nto call these brave men and women not for good,\nbut for political witch hunts.\nWe cannot allow what has occurred across the nation\nto happen here.\nOur guard deserves better.\nOur communities deserve better.\nThat is why today we are filing,\nas by a self-being the principal sponsor, SB390,\nto prohibit the armed state forces\nto come into Georgia without permission\nof his elected leaders.\nThe guard should not be abused by a president\nwho wants tyranny and to snatch people off the streets.\nand make no mistake, other states have also done this,\nwhether it was Kansas, South Carolina,\nor even Washington State have enacted these particular laws.\nWe cannot continue to allow the President\nto abuse the patriotism of our troops.\nAs this regime is sought to build a wall against progress,\nthe progress of achieving America's values in our deals,\nwe must build a wall against him.\nAnd the legislation presented here today\nis a step towards protecting all of Georgia citizens\nand making sure that we continue to pursue\nAmerica's ideals and goals.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nGood afternoon.\nGood afternoon.\nGood afternoon.\nI am State Senator Nebula Parks.\nToday I am introducing Senate Bill 391.\nand I want to talk plainly about what this bill does\nand why it matters to Georgia families.\nThis legislation sets a clear and reasonable standard.\nImmigration enforcement should not occur\nin certain sensitive places like our schools,\nour hospitals, places of worship, libraries,\nand family violence shelters,\nwithout a judicial warrant.\nIt simply requires lawful process\nin places where safety and stability matter most.\nOur schools must be safe places for children, full stop.\nKids should be focused on learning, not fear.\nAnd parents should not be able to drop\ntheir children off at school knowing\nit is a place of stability and not disruption.\nAnd no one should get dragged out of their home\nor workplace without a judicial warrant.\nThat's basic constitutional due process.\nIn Georgia, we believe in freedom,\nand we believe government power should come with limits\nin accountability.\nBut this is also about affordability.\nWhen ICE rates destabilize whole communities,\npeople stop showing up at work.\nSmall businesses lose staff overnight.\nConstruction slows, healthcare and service industry\nstruggle to stay staffed.\nThat disruption ripples outward.\nInsurance costs go up across the board.\nPrices go up.\nHousing becomes harder to build and harder to afford.\nAnd once again, working families are left paying more.\nIf we're serious about lowering our premiums\nand making Georgia more affordable,\nwe need stability, lawful process,\nand a stable workforce, not chaos\nthat drives up costs for everyone.\nJudicial warrants protect rights,\nthey protect our children,\nand protect Georgia's economy, period.\nThank you.\nGood afternoon. My name is Josh McLaren. I serve in the State Senate for North\nFulton County. I'm really grateful to the Minority Whip, Senator Kim Jackson for\nher leadership on this issue and making sure that the State of Georgia knows\nDemocrats are standing up to this rogue administration. I want to thank the\ncommunity members who are here today. If you want to see real constraints on this\nrogue administration and this out of control ice, give us a shout real quick. Last year\nTrump passed a budget that put tens of billions of dollars into ice recruitment and detention\nfacility construction. As a side note, that's why 4 million people lose in their health\ncare, so we can pay for this dramatic expansion of ICE making it one of the biggest, if\nthat the biggest federal law enforcement agency with a budget bigger than the FBI, bigger\nthan the federal prison system. And they are rushing to deport as many people as possible,\nso much so that they offer tens of thousands in signing bonuses to people who are unqualified,\ntrained, and in some cases probably couldn't get a job as a police officer, am I right?\nSo these people have become rogue agents and thugs, these ICE officials who think that\nthey can act with utter lawlessness and face no consequences.\nWe have seen ICE detain, arrest, U.S. citizens without charge.\nWe have seen ICE raid an apartment building in Chicago at night and zip tie children.\nWe have seen ICE physically assault people who are just protesting or lawfully observing\nand we just saw in Minneapolis ICE murder Renee Good.\nWe've all seen the video.\nObviously, the officer did what he was not trained to do, which is step in front of the\ncar, escalate when there was no need to escalate to a woman who said, I'm not mad at you.\nAnd then to killer and broad daylight and let her die.\nSo it's physical assault, it's false imprisonment, it's murder.\nY'all probably agree with me, those are violations of the United States Constitution.\nAnd there's two things I want to do with the bill I'm introducing, that's SB397, which\ncreates a civil cause of action against federal officials who violate constitutional rights.\nNow that's lawyer speak for accountability and deterrence.\nAnd Isover reaches, they need to face real accountability in courts of law.\nBut accountability is not necessarily justice, because Renee Good will not get justice.\nAnd there's no way to give her justice.\nReal justice making sure this never happens in the first place.\nSo it may be no surprise to you that police officers, both local and state, A, have better\ntraining, but B, they check themselves before they act because they know that if they\nviolate constitutional rights, they may face personal liability for their overreach.\nICE does not currently face that threat in Georgia, which means they know that if they act\nunchecked, nothing will happen to them.\nA personal lawsuit against ICE agents under Georgia law is essential to deterring ICE agents\nfrom ever committing these crimes in the first place.\nSo I'm immensely proud to stand with my caucus, with the house representatives who are\nhere, thank you, in saying with one voice in Georgia, repeat after me, no ice, no ice,\nno murders, no murders.\nMy name is Josh McLaren.\nThank you again.\nI am so grateful to be able to stand here.\nI am the state senator, Kim Jackson, representing the great people of DeCab County, hundreds\nand hundreds of immigrants and refugees who have found their home in my backyard, our\nbackyards, friends and family, it's my great honor to stand and be a voice with them.\nI'm here to introduce to you all my bill SB 389, the final in our package of fight back\non ice bills.\nLet me tell you just a quick story because I'm a preacher.\nYesterday, an gentleman called me, he's an older man, he didn't tell me exactly how old\nhe was but his voice cracked just enough for me to know that he had some years under him.\nHe said, Senator, this is the first time I've ever called Congress.\nWe'll accept that.\nSenator, it's the first time in my life that I've ever called Congress, but I'm calling\nbecause it's scary out there.\nI'm calling because it's bad.\nI thought the things would be better for my grandchildren, but it is scary out there.\nSenator, I'm calling because even with the clan, even though they were masked, at least\nit was on their own dime.\nThere are men out there wearing masks\nwho are doing so on our dime.\nOur tax dollars are paying for them to wear masks\nand to go out into our communities,\nsnatch people away and take them to places\nwhere we know not of.\nSenator, I'm calling for the first time\nbecause I'm scared.\nI'm scared that this world will not be better\nfor my grandchildren than it was for me.\nSo friends, that's why we're here.\nWe are here to call for no more mask for ice.\nIt's time to unmask ice.\nYeah.\nYeah.\nYou've heard it from my colleagues already.\nWe have men who are unidentifiable.\nRoaming our streets, snatching up people, and taking them,\nand then they are able to commit crimes and hide\nbecause we don't even know their identity.\nSo my bill will call for ICE agents to take off their mask,\nto show their face.\nWe have men who show up in tactical equipment,\nbut nothing that identifies them as federal agents.\nI don't know if they are a part of a vigilante group that's\njust to deputize themselves to go and steal my friend,\nor if they're an agent of ICE.\nSo my bill demands that they put on a badge\nthat they have something on them that tells us undeniably\nthat they are a federal agent.\nMy friends, it's time to unmask ice.\nYay!\nYay!\nI am introducing this bill for my constituents,\nfor the brown and black folks who are now walking around\ncarrying papers to guarantee that then when they are stopped,\nthey can say that they are actually a citizen.\nI am carrying this bill for my neighbors,\nfor my friends, for my constituents who are afraid\nto leave their homes and have other people dropping\noff their kids at school because they don't know\nif they can get home.\nI'm dropping this bill today for the congregation\nand Tucker, where a man went to worship on a Sunday\nlike he had time and time again, only to have himself\ncalled out of church and taken away\nin front of his own children.\nI'm dropping this bill today for all of the children\nwho now grieve because their parents\nhave either been deported or somewhere\nin a detention center that they don't even know where it is\nor they've simply disappeared because they're afraid\nthat the ice might find them.\nToday we are calling for my ice to be unmasked\nto end the terror, to end the fear.\nI believe that we can create a state where every person who lives here can walk around\nwithout fear of a vigilante telling them away without knowing who they are.\nI believe that we can create a state where we can see our law enforcement officers like\nwe can today and know who they are and know whether or not we can trust them or find\nthem if something goes wrong.\nSo I am proud, my friends, to introduce SB 389,\na bill that calls on us to unmask ice,\nand to make sure that they wear a badge\nso that we know if they are who they say they are.\nWith that, my friends, thank you.\nWith that, my friends, I welcome questions from our press.\nSo the question is, some people have said that the mask are necessary because of doxing,\nthat it protects the agents.\nLet me be clear, there are elected officials standing here today who have been doxed.\nThere are elected officials standing right here in front of you who have been swatted.\nofficials who know what it is to have people because they can see our face come after us and you know\nwhat we've done about that? We've passed legislation to protect us. We've passed legislation to protect\nall law enforcement agents from being docks. We've taken care of them, we have protected them,\nand now we are asking for them to do the same and to protect our citizens by showing their face.\nWe've been here.\nIf our brothers in the gray hats can stand up and show their face, then soak in ice.\nIf we can stand out here as elected officials who introduce laws that ultimately end up\nand some people are getting locked up and others getting free, then they can show their\nface too.\nWe have already passed the legislation to protect them.\nThis is not necessary, it is cowardice.\nIt is cowardice, and it's time to unmask mice.\nYeah.\nYeah.\nYeah.\nAre there other questions?\nSorry.\nJeff.\nMr. Liddell.\nWell, the way the bill actually at work is it has to be with his permission.\nSo obviously, if it has permission, this bill here is actually more geared towards\ntowards actually bringing people within the state.\nSo you actually had a couple of states who had done it\nboth ways, whether bringing it out of state,\nNational Guard people, and then the state,\nor actually preventing their governor\nfrom sending people outside of the state,\nunless they have his permission.\nThe key thing is always permission\nof your elected official.\nSo the key thing, no matter which,\nhow you look at it is, the type of bill\nthat you're talking about is,\nthe president himself could not just send\nNational Guard troops without the permission of the governor.\nIn this particular situation,\nif you had the permission of the governor,\nit still would fit.\nSo we actually would hope, whether we're talking about\nbringing in or actually going out, that the governor of\nthis state would say, you know what?\nI'm not going to be part of this tyranny that's actually\ntaking place.\nThat is the key thing that you would hope, whether it's\nbringing someone in or actually sitting in our guard\ntroops out.\nI would not be part of the tyranny that's actually\nbeing trying to be taken place by this administration.\nWhat's the governor's name?\nIt's basically the governor would be the voice of that.\nThe governor would be the voice of that, correct?\nUnfortunately, the question is, is this complaint about all law enforcement or just federal\nimmigration enforcement?\nWe are keeping our focus squarely on federal immigration enforcement.\nWe're grateful for the law enforcement in Georgia\nthat abides by much higher standards of conduct\nthan ICE has proved itself to be.\nAnd let's be clear about why this is happening.\nThe Trump administration has adopted this\nSilicon Valley move fast and break things mentality.\nAnd the way that they fund at ICE,\nthe way they've built up the organization,\nis not deliberate, it is not in any,\nwith any compassion towards the citizenry\nor professional standards of conduct.\nAnd so I think culture creates these outcomes.\nWhen you see that ICE is not being held accountable\nfrom the top levels of government,\nthey're trying to build it up to basically be\nthis brute force that terrorizes citizens.\nYou know, we say a lot around here,\nthat's the point.\nThis is not just an accident,\nthis is the design of this administration's policy\non immigration is to terrorize communities.\nI'm trying to get that.\nWoo!\nWoo!\nAnd I would also second that,\nbut also go a little bit further,\nalso go, the focus, of course, is on ice,\nBut at the same time, the larger focus really is about\nactually keeping our rights within the nation.\nThat's the larger focus.\nThe larger focus is actually allowing this president\nto use armed forces to allow this president\nto use the weight of the federal government\nto actually repress citizens of this country.\nThat is really the larger focus.\nThe direct focus, of course, is on ICE,\nis on federal law enforcement,\nas Assemblyman Lorna stated.\nBut our larger focus is the fact that we are actually\nfacing a true crisis as far as freedom\nof is concern in this nation.\nCan you let us understand how you envision\nthese bills path to the governor's desk?\nI can't imagine you're expecting\nwhat a little combined.\nYeah, the question is, what is the path\nto the governor's desk for this slate of bills?\nTo be clear, on its surface, in terms of policy,\nmy colleagues on the other side of the aisle\nshould agree with us.\nIt's good policy for us to say that you can't bring\nbring in a national guard without the governor's sign off.\nIn fact, they have a Republican governor.\nThey ought to trust him.\nIt's good policy.\nIt's good policy to say that for our public safety,\nyou should unmask ice.\nIt's good policy to say that certain places\nare protected, that sanctuaries exist,\nthat places where children are being dropped in\nall should be protected.\nThat's good policy.\nThe problem is the path to the governor's desk\nis not about policy, it's about politics.\nAnd my colleagues on the other side of the aisle\nare beholden to a man in the White House\nwho does not care about good policy\nand does not care about people.\nSo we understand that the road to the governor's desk\nis quite limited, that path is narrow.\nBut we also stand here in hope that common sense\nand good policy might persuade a few of our colleagues\non the other side of the aisle to stand up\nand to resist and to be a part of good policy making\non behalf of the good people of Georgia.\nWith that, friends, I thank you so much.\nThank you for coming.\nThank you so much.\nThank you.\n",
  "updated_at": "2026-02-12T01:39:20.216084+00:00"
}