{
  "video_id": "0RtSpYaIRGc",
  "url": "https://www.youtube.com/watch?v=0RtSpYaIRGc",
  "title": "Senate Day 31 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 31,
  "video_date": null,
  "duration_minutes": 155,
  "summary": "Overview:\nThe Georgia Senate session on Day 31 of the 2025 Session focused on introducing various bills and resolutions, as well as receiving committee reports on numerous pieces of legislation.\n\nKey Actions:\n**HB 167**: Unclear from the transcript\n**HB 647**: Unclear from the transcript\n\nBills Introduced (First Reading):\n- SB 330: Bill to borrow the home setting state logo government\n- SB 3301: Bill to borrow the home setting state logo government\n- SB 3302: Bill to amend an act regarding state logo government\n- SR 378: Resolution recognizing Mr. Judge Transformation\n- SR 381: Resolution regarding human services\n- SR 386: Resolution creating the Senate Safe\n- SR 388: Resolution congratulating, commending, and extending\n- SR 39D: Resolution recognizing and commending\n\nNotable Moments:\n- Introduction of legislative pages from across Georgia\n- Confirmation of the journal\n\nVotes:\nNo specific votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not mention quorum or attendance.\n\nAdjournment:\nThe transcript does not mention when the session adjourned or the date of the next session.",
  "transcript": "Good morning everyone. Looks like it's just us in the pages today. You already so the the Senate will come to order. I know. Bring it out of the Senate from the six. Mr. President, which one you want? We got the center from the six and the former senator from the six. I know it's and it's good to see the former senator there from the six. Our politics are very similar. I was going to introduce her when everybody got here. Our sense of humor is definitely very similar. But it is an adventure even more similar. The senator from the six has gone down tremendously since she left. But for the first time in my life the height actually went up. Not by my age, but Mr. President all joking aside. We have a great list of pages today. From Tucker, Georgia, we have Henry Beatty the fifth. From Savannah, we have Bryson Carswell. From Stockbridge, we have our Denise Samson's grandson Keaton Hall. From Roswell, Owen Jorgensen. From coming, Suhas Caviti. From Tifton, Samuel Kirk. From Marietta, Lanele. From Sharpsburg, Morgan Morris. From Lawrenceville, Mohamed Musa. From Dunwoody, Ayush Narayan. From Pindergrass, we have Eden Pethel. From Savannah, Melvin Singleton. From Atlanta, we have Alexandria Tateler. From Savannah, Donald Thomas. And Orlano Trotter. From Ellenwood, Gabrielle White. And from coming, we have Vihon Yara Paredi. Y'all give these pages a big round of applause. We appreciate you being here today to help serve the great people of this state. Mr. President, while the senator from the 19th puts his towel on over there, I was able to read the journal and found that it was correct. Thank you, Senator. Is there objections in the spacing of the reading of the journal? Chair here is none. Are you going to journal the spints with? Is there objections to the confirmation of the journal? Chair here is none. And the journal is confirmed. All senators who have bills and resolutions to introduce, please bring them secretary Zask at this time. Mr. Secretary. Senate Bill 330 by Senator Estadis and 35th. And others, Bill Twin Town and I to borrow the home setting. State logo government. Senate Bill 3301 by Senator Dixon, 45th. And others, Bill Twin Town and I to... State logo government. Senate Bill 3302 by Senator Jones, 10th and others, Bill Twin Town and I to amend and act. State logo government. Senate Resolution 378 by Senator Beach, 21st. And others, resolution, and recognizing Mr. Judge. Transformation. Senate Resolution 381 by Senator Estadis, 35th and others. Chair here is the human services. Senate Resolution 386 by Senator Moore, 50th and others, resolution, creating the Senate safe. Senate Resolution 388 by Senator Islam, part to the 7th. And the resolution, congratulating, commending, de-end. Rules. Senate Resolution 39D by Senator James, 28th. Resolution recognizing commending. De-end. De-end. Mr. President, I can please the order. Secretary, report, sustaining committees. Mr. President, Senate command, agriculture and consumer affairs. Does it have any consideration in following legislation? I've instructed me to work the same back to the Senate with the following recommendation. House Bill 3301, 2 pass, House Bill 398, 2 pass, House Bill 495, 2 pass, or 5th, 2 minutes, and a good minute of the 8th district chairman. Mr. President, Senate command and making and financial institutions. House regulations, Constitution, Senate under consideration of following legislation. Aged instructingly toward the same back to Senate with the following recommendation. House Bill 2402 pass, House Bill 241, 2 pass, House Bill 377, 2 pass. So, I have to submit it that our summer is the 13th district chairman. Mr. President, Senate command and children and families. Agaher,precise, Senate under consideration, following legislation. Aged instructingly toward the same back to the Senate with the following recommendation. House Bill 175, 2 pass, House Bill 181, 2 pass, by sub-suit. Resolution under curb, Patrick, the 32nd district chairman. Mr. President, Senate, and economic development tourism has had under consideration following the legislation as a struck me toward the same back to the Senate with the following recommendation. Senate Resolution 323, 2 pass House bill 74, 2 pass House bill 360, 2 pass House bill 159, 2 pass House bill 475, 2 pass, 2 suspended Senate, be to the 21st district chairman. Mr. President, Senate, and the education youth has had under consideration following the legislation as a strike me toward the same back to the Senate with the following recommendation, 6178, 415 확ism scheduled, 1 05, 2 pass House bill 235, 2 pass, 2 steps measures must be submitted, Senator Hickman the 4th district chairman. Mr. President, Senate, and ethics has had under consideration following the legislation as a struck me toward the same back to the Senate with the following recommendation, as well before 14 due passed, as well before 206 due pass разрaked interfaces to our same ex-acent with the final recommendation. House Bill 111, due pass, House Bill 112, due pass, House Bill 165, due pass, House Bill 266, due pass by substitute, House Bill 511, due pass, House Bill 586, due pass by substitute, we're subject to the submitter, Senator Huss, that will be the 52nd District Chairman. Mr. President, the Senate Command and Health and Human Services has had under consideration the following legislation that's directly to report the same back to the Senate with the final recommendation. House Bill 329, due pass, House Bill 506, due pass, House Bill 584, due pass by committee, House Bill 645, due pass, so it's minutes and a waltz on the first district chairman. Mr. President, the Senate Committee on Higher Education has had under consideration the following legislation has directly to report the same back to the Senate with the final recommendation. House Bill 38, due pass, House Bill 172, due pass, there's practically some minutes and a burn to the 23rd District Chairman. Mr. President, the Senate Command and Insurance and Labor has had under consideration the following legislation has directly to report the same back to the Senate with the final recommendation. House Bill 182, due pass by substitute, House Bill 410, due pass, so it will be minutes and a walker of the 20th District Chairman. Mr. President, the Senate Command and Judiciary has had under consideration the following legislation. It's directly to report the same back to the Senate with the final recommendation. House Bill 86, due pass, House Bill 161, due pass, so it's due, House Bill 272, due pass, House Bill 392, due pass, House Bill 43, due pass, so it will be minutes and a strict and the 42nd District Chairman. Mr. President, the Senate Committee on Public Safety has had under consideration the following legislation. The Senate has instructed the State of the State to report the same back to the Senate with the final recommendation. House Bill 283, due pass, House Bill 424, due pass, House Bill 549, due pass, so it will be minutes and an hours of 56 District Chairman. Mr. President, the Senate Command and Labor will be introducing the utilities that had under consideration the following legislation has directly to report the same back to the Senate with the final recommendation, House Bill 34, due pass, House Bill 551, due pass, House Bill 219, due pass, House Bill 416, due pass, so it will be minutes and a count of the 46 District Chairman. Mr. President, the Senate Committee on Retirement has had under consideration the following legislation. I instructing each part of the same back to the Senate with the final recommendation, House Bill 782, passed, was actually submitted, Senate will enter into the 25th District Chairman. Mr. President, the Senate Committee on the State and Local Governmental Operations General has had under consideration the following legislation, has instructed me to work the same back to the Senate with the final recommendation, House Bill 137, due pass, House Bill 155, due pass, House Bill 614, due pass, so it will be submitted, Senate are dicks, and the 45th District Chairman. Mr. President, the Senate Committee on the State and Local Governmental Operations has had under consideration the following legislation, has instructed me to report the same back to the Senate with the final recommendation, House Bill 534, due pass, House Bill 536, due pass, House Bill 594, due pass, House Bill 596, due pass, House Bill 603, due pass, House Bill 30, due pass, House Bill 595, due pass, so it will be minutes and a count of the 46 District Chairman. That completes the order, Mr. President. Senate from 53rd, what purpose do you rise? Thank you, Mr. President. I ask for unanimous consent. The Senate rules 3.12 and 4.21. Thank you, Mr. President. I ask for unanimous consent. The Senate rules 3.12 and 4.21. Thank you, Mr. President. I ask for unanimous consent. The Senate rules 3.12 and 4.21. A, be suspended to allow for first reading and assignment of four local bills. Secretary, is there a objection? Secretary, read the caption. Senate Bill 333, by Senator Morla, 53rd, a bill between titled next, a product of homestead exemption from City of Shikamanga, independent school district, out of the law of Texas, for educational purposes, and an amount equal to the amount by which... The State and Local Government. Senate Bill 334, by Senator Morla, 53rd, a bill between titled next, a product of homestead exemption from City of Shikamanga, the State and Local Government. Secretary, would you like to welcome Mr. President, please be ordered. Secretary, we'll rebuild and resolution for the second time. House Bill 55, by Representative Ford of the 170th and others, Ola Paja, Judicial Circus, Superior Court, provide an additional judge. House Bill 89, by Representative Cooper, the 45th, and others. Public Health Department of Require, Healthcare Providers, Fetilities, and Pharmacies, to provide them, Maternal Mortality Review Committee, with Psychiatric or other clinical records. House Bill 90, by Representative F. Strachan, 104th and others. Revenue taxation increased the maximum acreage, qualified for assessment and taxation as a bona fide conservation use property. House Bill 141, by Representative Montaghan, other 17th and others. Revenue taxation allow businesses and practitioners to provide affidavits of certified public accounts and lieu of tax returns. House Bill 176, by Representative Smith, the date of the 18th and others. Appeal on error judgments deemed directly appealable charge to provision. House Bill 180, by Representative Smith, the 18th and others. Probe courts, modifiers, and requirements for probate judges. House Bill 199, by Representative Kelly, the 16th and others. Court's protection of personally identifiable information of judges. And their spouses, modified provisions. House Bill 223, by Representative Perchette, 176, and others. Revenue taxation, exclude from the calculation of taxable net income, certain disaster relief, or assistance grant program payments for agricultural losses suffered due to Hurricane Helene. House Bill 290, by Representative Carson, the 46th and others. Revenue taxation, internal revenue code, and internal revenue code of 1986 revised terms and incorporate certain provisions of federal law into Georgia law. House Bill 296, by Representative Gaines, the 120th and others. Motor vehicles, presentation of a driver's license, and certain electronic format provisions. House Bill 352, by Representative Seavall, 34th and others. Georgia Gestational Diabetes Management Act, and Act South Pole 406, by Representative Levere, the 123rd. I built judicial retirement system, increased retirement age and spear court judges first taking office on our after July 1, 2026. House Bill 423, by Representative Wade, the 9th and others. Emergency telephone number 911 system, next generation 911 systems, and services provide House Bill 473, by Representative Seavans, the 164th and others. Controlled substances, schedule one, provide certain provisions. House Resolution 32, by Representative Estration, the 104th and others. General Assembly increase, maximum acreage to qualify for assessment and taxation as a bona fide conservation use property. House Resolution 42, by Representative Gamble, 15th and others. General Assembly, motor fuel and diesel fuel taxes, ratified governor, Brian P. Kim's executive orders. Mr. President, that can please de-order. I see we have a couple of our former colleagues here with us today. As a senator, we referenced her earlier today, but we have Senator former Senator Jen Jordan here today. It's Jen's good to see you. We miss you, Senator. You're looking good. Hope everything's going well for you. I know it is. And I see the honorable Judge Jesse Stone, the former senator right here. Good. Am I all seat me? Good to see you, Senator. You look younger since you left this chamber. Good to see you, Judge. Is now time for the more than roll call. Are there any emotions to excuse? Are we going to send her from the 33rd? Thank you, Mr. President. Good morning, y'all. I ask for unanimous consent to excuse the senators from the 12th and 39th for business inside the Capitol. Without objection, Senator from the 12th and 39th are excused. Recognize Senator from the 21st. I ask for unanimous consent to excuse the senator from the 27th for business inside the Capitol. Without objection, Senator from the 27th is excused. Recognize Senator from the 50th. Thank you, Mr. President. I ask for unanimous consent to excuse the senator from the 42nd for business outside the Capitol. Without objection, Senator from the 42nd is excused. Are we going to send her from the 49th? Thank you, Mr. President. I ask unanimous consent to excuse the senator from the 48th for business outside the Capitol. Without objection, Senator from the 48th is excused. Any other motions to excuse? Secretary will call the roll senators. Signify your presence by voting the A-switch. Secretary will unlock the machine. Secretary will unlock the machine. Secretary will unlock the machine. Secretary will unlock the machine. It is now time for the morning devotion. All senators, please take your seats and see all conversation. I would ask the doorkeeper to secure the chambers at this time. I now recognize the senator from the 28th to lead us in our pledge and introduce our chaplain of the day. Senator. Good morning. Please let us salute the flag of the United States. Our pledge allegiance to the flag of the United States of America and to the Republic for which the flag of the United States stands one nation under God, indivisible with liberty and justice for all. And now the Georgia flag, please. Thank you. It's written in Isaiah 40 and 31 that, but they, that, way to ponder the Lord, shall renew their strength. They shall mount up with wings as eagles. They shall run and not be weary and they shall walk and not be faint. Amen. This morning we have a great man of God and I can say that he's always been like that because he's my cousin. It is Reverend Darrell L. Winston. He's a native of Atlanta, Georgia. He's a graduate of the prestigious North Side High School. He matriculated at Bishop College in Dallas, Texas and received a bachelor in social welfare. His stellar career includes six years in the military as the chaplain assistant and later as chaplain in the National Guard. He started his ministry, excuse me, in Europe and was often called upon to minister to military personnel and their families. He fitted himself well as a marketing executive and a US sprint and Frito Lane. He accepted his call to ministry in 1986 and was ordained in 1991 at the historic Union Temple Baptist Church in Washington, D.C. Reverend Darrell W. Winston has distinguished himself as a pastor, community activist, deputy coroner, youth advocate and the list goes on. He is a much sought after spiritual advisor, counselor and strategist for several leaders spanning business, politics, government, education and entertainment for the past 30 years. He's also known for his unique empowerment approach offering progressive strategies in the faith community as well as in the marketplace. His visionary leadership has resulted in numerous national and local initiatives aimed at empowering and educating the masses of people that have been marginalized spiritually, socially, economically and politically. In 1995, he organized the Greater Works Ministry initially as an outreach ministry to youth and has since parlayed it to one of the most innovative churches in the nation. I am so honored and privileged to introduce to some who he has such a long career and so many accolades, but just to mention three or four, he's written op-ed pieces for numerous publications such as the Land of Journal Constitution and many national publications as well. He's a leading figure in the community and he has made appearances on many networks, ABC, NBC, CBS, Fox News and again the list goes on. Without further ado, Reverend Darrell W. Winston, please come and bless us here in this chamber and the State of Georgia. Thank you. Please come. Okay. Good morning. Thank you, Senator Dunzella-Jang. Thank you. As I say here, I said, who me? And I thank you for this great privilege to share, to Lieutenant Governor. Thank you to all our distinguished leaders who are exemplarier in your deportment. Thank you for this privilege to stand. I stand before you today amid the clamoring chaos and deafening cry for compassion as the masses in this country contend with over againstness. At a time when many are asking the question, how long a type of cold-heartedness and callousness has been touted as virtue, a type of cool indifference to the plight of the suffering masses being applauded. But because all of us have a spark of the divine in us, imagio day, more than ever before, wherever we serve, wherever we are called, our concerns should be one of a divine concern so that we can salute divinity in humanity. There are so many who are reeling and rocking, mourning so many parents in this state due to gun violence of seeing the blood of their children run down streets like water from the string while many of us watch. There must be a recovery of compassion. Dr. Martin Luther King, Georgia, Native son, said, there comes a time when one must take a position that is neither safe nor political nor popular. But we must take it because conscious tells him it is right. May we be gripped by the luminous and the power that is in all of us, it's the sound of the genuine that tells us that is right. There must be a recovery of compassion less. We are destroyed by malignant malady of mean spiritness. May this legislative session heat the cry for compassion and be blanketed by the Isaka motif. Chronicles 12 chapter, 32nd verse says, the tribe of Isaka, discern the times and knew what Israel should do. May we discern the times. May we become, as Dr. King said, not mere the momitors, reflect in the temperature, but may we become thermostats, setting the atmosphere. And may that atmosphere be one of compassion. Let us pray. Eternal God, our great source creator, we come before you today. We know that you are God and you are good and you're mercy endure forever. Therefore we come calling upon you to give wisdom, guide us, direct us, lead us. We thank you for those who come and given of themselves unstintingly to serve in this present age. Many of them are having to serve even as they contend with personal issues and family matters. I ask for your grace for your grace is amazing. I ask that you strengthen perfect and settled. We call for the exceeding greatness of your power, but we know that you're able to cause us to see here and to desiring the times. We ask now that your power manifests your purpose manifests and your plans for this state for the people around this state. Be implemented and we thank you and we say, Amen, Amen, Amen. I'm so happy to have my wife, her co-pasta, Joaquina Winston, sharing also. She is a retired educator and an entertainment manager. And so I'm so happy to have her with me today. Thank you. You You You You\n\nyou you you you you you you you you you you you you you you so so so so so so so if the yes behind and they're going for three feet this year. As their coach who told me he was retiring last year, but they tell me he's gonna stay around a little bit longer. And they are good friends from Harlem High School are currently 15 and 0 right now. Going for a three-peat here. So Secretary, read the caption. Senate Resolution 75, Mr. Anderson, the 24th and others resolution, congratulating the Harlem High School Bulldog Space Ultimate Team for the 2024 GHS-A Class III A State Baseball Championship and for other purposes. Whereas this is a part of team completed as triumphancies in a baseball competition by posting an outstanding record of 38 wins and only one loss. Whereas the team brought special recognition to school in to Columbia County by winning the 2024 GHS-A Class III A State Baseball Championship. Whereas the championship victory marks the seventh state championship under the guidance of head coach Jimmy Lewis who now has more than 900 career wins. Now therefore be it resolved by the Senate. The members of this party congratulate the Harlem High School Bulldog Space Ultimate for winning the 2024 GHS-A Class III A State Baseball Championship and extend best wishes for continued success. Mr. President, that completes the order. He is the objection to the adoption of the resolution. Chair here's none and the resolution is adopted. I recognize Senator from the 24th to speak to the resolution. Thank you, Mr. President. It gives me great honor to introduce to you a legend a gentleman that was born in at Harlem, Georgia went to Harlem High School and he is coached and he is the current baseball coach at Harlem High School for 49 years. This man has touched a lot of young men's lives and they have been very productive in baseball. He playing the sport. He has his baseball team here today and they in the gallery and I like for them to stand. I'll stand up. Thank you. Thank you. Thank you. Thank you. Thank you. These young men have won back-to-back state championships and now they're going for the third state title. But this coach behind me, his name is Jimmy Lewis, Valentine's Day this year. He won his 900th win and today it gives me great honor to introduce you to a man that next week we're going to name the baseball field after him, the Jimmy Lewis baseball field. Harlem, Georgia. Jimmy Lewis. Appreciate it, Senator Anderson. Appreciate y'all having us here in the baseball team. Let me go right ahead and say that we won 900 games. I didn't. We won 900. My players, my coaches, my fans, and they let me be part of it. But we appreciate it. We got the team here. You know, we're here because they won it last year. We were 38 and won and we won a state championship over the last three years. We were 88 and 2. And the kids work hard. They play hard. They ask their good students and they behave. And they play hard and they win. And that's makes coaching a really easy job for me. I've been there all my life. I enjoy it. One of these days, like I always say, when I grow up, I'm going to retire. But right now, I don't feel like growing up. And I've got a desire and the Lord's giving me the help to stay there. So we'll see how it goes. But we appreciate y'all and appreciate you having us here. And real quick, like for I say anything else, I want to introduce one of my coaches, Coach Rusty James, and let him just say a word or two in the Rusty. You can't say much. Just a word or two. Come on up. I'll make this brief. Last year was my last year coaching baseball. I was lucky enough to get to an opportunity in an assistant principal's job at Evans High School. And you really don't realize what you have until it's gone. And this last year has been an amazing experience for me, being able to meet new people and impact young people in the way that I want to. But when you leave a program like Harlem High School, you realize how special it was. And the atmosphere of family, the importance of the other coaches and how they become brothers. And the impact the ball players had on you as a man. So as a man. So I just want to say thank you. And Coach Lewis is going to try to divert some of the credit here. But this program is what it is because of Jimmy Lewis. So he deserves the credit and the recognition he's getting now. Thank you. I want to challenge each senator. When you give a resolution, do it the right way. Son of the from the eighth. Son of the from the eighth. Do it the right way. I'm going to introduce two captains we have with us from last year's team. This is this year's team, but a lot of them couldn't make it today. They graduated. But first of all, we got Amerson Guy right here. If you recognize the last name, I know he's tired of hearing this. Well, his grandfather was Ray Guy, the punter for the Oakland Raiders and trade gennings. Right here was another captain. They did a great job. They won a state championship last year, 38 and one. Like I said, they need a big round of applause. Thank you. Thank you. Thank you. Let's go. Let's go. Jeremy, cheers request Eric's team. All right. They're doing well. Sorry. Okay. Next. Thank you. Thank you. You, Mr. Wilson, and StBeer. I'm sorry. First. Yes. You're welcome. Thank you. Same. Okay. Two, three. Mon first. Thank you. All right. We have some more suited athletes that are champion stars. student athletes that are champions on the on the court here. Secretary Reed the caption. Senate resolution 263 by center again in the 47th and others resolution graduating with Jefferson High School volleyball team for winning the 2024 GHSA 3A volleyball state championship and for other purposes. Where's the team claim victory at the 2024 GHSA 3A volleyball state championship for the first time in school history and where's the phenomenal performance of the team is a clear indication of the outstanding ability to dedication hard work and unity of purpose and spirit of each member as well as the out the stoop direction of coaches Brittany Lawrence and Drew Lawrence. And whereas this as this amazing team is earned a well deserved reputation for excellence by performing with heart and courage over months of training and competition. It is a bundling proper to call them champions and therefore be resolved by the Senate that the members of this body congratulate the Jefferson High School volleyball team for winning the 2024 GHSA championship and extend best wishes for continued success. Mr. President I can please the order. Is there objections to adoption of resolution chair here is none and the resolution is adopted. Recognize the senator from the 47th it speaks to the resolution. Thank you, Mr. President. You know we start looking at some of our great athletes around the state and I know the senator from the 24th he may have the best best photo resolution to do but the senator on the 24th if I could get your attention. The senator from the 24th I just want to make sure you understand. It's not the resolution actually that makes the presentation. It's the good looks of the presenters and what I've got here today is the Jefferson High School tape champion AAA team and I want to recognize parents and the rest of the team up here. If you all rise the I'm going to call on Miss Caitlin Johnson to address the resolution. She's actually the senior and God knows where she's going to college because it's somewhere up in Tennessee and why she's picking out of the Georgia to go but Caitlin come up and address us. I just want to thank everyone for letting us come here and celebrate this. I think I can speak for all of us when this is like a really huge deal. As a senior this was all I ever wanted and to achieve it with this great team and to be surrounded by a great coaching staff and a great community. It's just an honor and a blessing so thank you all. Thank you Caitlin. One other trivia they tell lies down on the second floor about how much gold is on the roof. It's a soccer ball full of volleyball full of gold to the in actuality. It doesn't weigh 1200 pounds. Secretary read the caption. Sent resolution 368 by Senator Kennedy of the 18th and others resolution recognizing commending minister Darah Kathery for his outstanding public service and for other purposes. Where I was appointed on January 23rd 2025 he currently serves as the Irish minister for social protection and minister for role in community development and the GALT Act and where it's prior to his current roles he served as minister for state and trade promotion digital and company regulation in the Department of Enterprise Trade and Employment and in 2020 held the positions of minister of agriculture and government chief whip and where it's from 2018 to 2020 he served as deputy leader of the NFL and is also served as spokesperson on justice jobs and the president of innovation public expenditure and reform and social protection. Now therefore be resolved by the Senate as members of this party recognize command minister Darah Kathery for his efficient effective and unselfish dedicated public service and extend the most sincere best wishes for continued health and happiness. Mr. President I can place the order. Is there objections to the adoption of resolution chair here's nine and the resolution is adopted. Recognize the protege on the speech of the resolution senator. All right. Thank you Mr. President. Good morning colleagues. It's always special when we get to invite special guests and we've got some real special folks here this morning. You know St. Patrick's Day is right around the corner and our friends from Ireland come to Georgia just in time for us to celebrate together. It's with deep appreciation that I rise to recognize and commend the exemplary leader minister Darah Kathery for his outstanding dedication to public service and his unwavering commitment to the people of Ireland. Want to tell you just a little bit about his experience before but I'm not going to read all of it because he is so well healed and so experienced we'd be here all morning. The minister clear his career has been defined by his leadership integrity and passion for improving the lives of Irish citizens. Since his appointment as the Irish minister of social protection and the minister for rule and community development in January of this year he has worked tirelessly to advance the policies that strengthen communities foster economic opportunities and ensure the well-being of the most vulnerable and society. Mr. Cleary's tenure and public service extends much further than just his recent appointment having served in various positions including the minister of state at the Department of Enterprise, Trade and Employment with a responsibility for labor affairs as well as the Department of Finance for public service transformation from 2009 to 2011. His commitment to service is not merely a role but it is a calling with him. His leadership and vision have earned him the respect and admiration of his colleagues, constituents and various citizens alike. His contributions to governance and tireless efforts in shaping stronger, more prosperous Ireland that make him truly deserving of this recognition. I anticipate he's going to tell you some news about some additional efforts he is making to build more connectivity between Ireland and Georgia in particular for additional business opportunities and I look forward to hearing more details of that. It truly is a pleasure to have him here. I want to welcome him and his distinguished members and I'm going to ask him to introduce when he comes. So let's give a great warm welcome for our friend, from Ireland. Thank you. Thank you. You're talking to Governor President Brod Time, senator, ladies and gentlemen, thank you for your very warm welcome and your giving us the opportunity to be with you here today I'm delighted to be joined by Team Arden, representatives Frank Groom, our council here in Atlanta, Nicole Chies, our Deputy Council, Amy McCormick and Craig Dwyer, from my own department, back in Dublin. And we are absolutely delighted to be with you as we begin the celebrations of our National Feast Day, same-partific state. We are very lucky as a country that our National Feast Day is shared and is celebrated internationally. With over 70 million people across the world who claim Irish heritage, including 1 million Georgians, so we're delighted to be here for their National Day 2. Our connections with Atlanta, with Georgia, and with the South are deep, and they aren't historic. I want to make a moment to thank everybody who built those connections, those who have passed for generations after generations. And we are renewing and refreshing those connections all of the time. As a new Irish government that took office on the 23rd of January, we want to refresh them by investing further in our presence across the Southern States. And we have a commitment in our program for government to do that. We have college football in common, along with many historical and industrial lengths. I was delighted to be here in Atlanta in 2023, when we launched the 2024 college football game with Georgia Tech and Florida Station Dublin in September. I know many of you made the trip. It's part of a parliamentary delegation. And you have the win in Dublin for the second time. So Dublin is lucky country for this. I know Georgia's particularly proud of your title as the number one state in which to do business. And Ireland is one of the best countries in the world in which to do business too. So we share that ambition together. Over 10,000 Georgians are employed by Irish owned companies. And we want to grow that figure. And tomorrow we will be opening here in Atlanta an office for Enterprise Ireland, our state support agency for enterprises allowing Irish enterprises to continue to grow here in Georgia, to grow their presence, to grow their employment, and to deepen our economic links between your great state and my great country. Last year we marked 100 years of formal diplomatic relations between Ireland and the United States of America. We all know that the connections go far deeper and go back far longer than that. But we will renew the formal connections and build on them culturally, economically, socially, all with our shared ambition, our shared pride at the heart of it. I'm also Minister of the Irish Namage, the Gwelga, which is our main national homage. We have a phrase in Gwelga which says, Nínyárt, La Cáire, La Cáire. The results strength without unity. With a shared commitment to building unity, we will build a combined strength. Thank you for your welcome today. Thank you for your commitments and happy St. Patrick's Day. Gérmena Magna. Good job. Thank you. Good job. Thank you. Are there any unanimous concerns? Does any Senator wish to rise on a point of personal privilege? Recognize, as soon as from the 8th. Well, thank you, Mr. President. It is, I have the honor of being able to represent Valdosta State and have a resolution here honoring them. And their football team, they went all the way to the National Championship this year. And also, we want to mention during the hurricane, they had some adversity. We all had some adversity, didn't we, Mr. President? Our esteemed President of this body, he actually sponsored the football team to go to the Falcons game. So I want to thank you for that, Mr. President. That was a tough time. And we were grateful for it. I want to read this resolution real quick. Congratulations to the Valdosta State University football team for winning the 2024 Gulf South Conference Championship, the Super Region 2 title and reaching the NCAA Division 2 National Championship game and for other purposes. Where has Valdosta State is University. Valdosta State University is nationally known for its tradition of athletic and academic excellence, having won nine national championships. And 57 Gulf South Conference titles and multiple sports, as well as having numerous athletes.\n\nWe're an academic old conference and academic hall American titles and whereas the 2024, about us to state football team won the program the 11th Gulf South Conference Championship. Marking the most of any school in the Gulf South Conference history, whereas the Blazers reached the national championship game for the 7th time in program history and 3rd time since 2018, while the 7 appearances in the title game are second. Hold on one second, Senator. Hold on. Everybody please give the Senator a distinction. Thank you, Mr. President. While the 7 appearances in the title game are second, most all time in NCAA Division II history, and whereas the Valais de St. University football team has established and maintained a proud tradition of excellence with equal emphasis on character and academics, and whereas this outstanding team has completed another championship season football competition by posting an outstanding record of 13 wins and only one loss marking the fifth time in program history of winning 13 games or more. Whereas this season also marks the team's 20th appearance in NCAA postseason, the 34 postseason victories are the fourth most of all time in Division II. Whereas the football team has now had five different blazer head coaches reach the NCAA title game, marking the most number of coaches reaching the championship at one school in Division II history. Whereas the phenomenal performance of the 2024 season saw the team go undefeated and lead play for the 6th time in program history, finished the season with five all America selections and recognized quarterback Sammy Edwards has a finalist for the prestigious Harlan Hill Award for the second straight year. Whereas the blazer football team now stands at 346 victories with 138 defeats and four ties and 42 plays seasons of football. With the 2024 team posting the fifth season of double digit victories in program history, whereas this magnificent team earned its well deserved reputation for excellence by performing with courage and precision over months of training and competition, it is abundantly proper to call them champions. Now therefore be it resolved by the Senate that the members of this body congratulate the Bautista State University football team for winning the 2024 Gulf South Conference Championship, the Super Region II title and qualifying for the NCAA Division II National Championship game and extend our best wishes for continued success. My friends, Dr. Carl Rahal, my Steven Tyler, y'all stand up, my friends from Bautista State, y'all stand up and be recognized. We're proud of you. All right, all right. Applause. Thank you, Mr. President, I yield the will. Go blazers, good job, guys. Thank you, Senator. We appreciate y'all being here today too. Recognize Senator from the 36th, we're appointing personal privilege. Thank you, Mr. President. Good morning, colleagues. March is Women's jeans-called Challenge Lakh spree. Is there a gender COVID-19 law that Jenn Sagan, the colored student, dichot my typeGot hometown? You are pulling along with now. Do you like men's clothes? Sith waist belt? Thank you, Mr. President, good morning, colleagues. March is… history month all across the land. And we've also concluded a very successful yellow rose event today recognizing women from across the state who were awarded the yellow rose award from the women's caucus. But I'm here on women's history month to honor and recognize a Georgian, Dr. Bernice Johnson Reagan. She's not only a trailblazer in music but also an activist and a scholar and her work has shaped the fabric of our history and culture. Dr. Reagan was born in 1942 in Albany, Georgia. She grew up in the segregated south where she found both her voice and her purpose in the fight for justice. As a young college student at Albany State, she became deeply involved in the civil rights movement joining the Student Nonviolent Coordinating Committee and using music as a tool for resistance and unity. Dr. Reagan was a founding member of the Freedom Singers. The SNCC Freedom Singers, a group that traveled across the country, singing songs of protest and hope, bringing people together in the struggle for equal rights and raising money for civil rights work in the deep south. Dr. Reagan's work did not stop with the movement of the 1960s. She went on as a Spellman graduate to become a leading historian and scholar of African-American culture, dedicating her career to preserving and celebrating Black musical traditions. She founded in 1973, Sweet Honey in the Rock, an all-female African-American acapella group that blends gospel spiritual blues and folk music with powerful messages of justice, resilience, and empowerment. For over five decades, this group, Sweet Honey in the Rock, has been a voice for change, inspiring audiences around the world. Dr. Reagan's impact extends beyond music. She's a scholar, educator, and curator, a professor, and working with the Smithsonian Institute to document and preserve the legacy in Black musical traditions. Dr. Reagan's work reminds us music is not just art, it's history, it's resistance, and it's a force for progress. During National Women's Month, we celebrate women like Dr. Reagan, whose contributions have transformed not just one movement, but generations of movements for justice, equality, and cultural preservation. Her voice, both in song and in scholarship, has been a guiding light, and her legacy will continue to inspire us for years to come, although she passed away in 2024. So I offer you these remarks and honor the name and work in lifetime legacy of Dr. Bernice Johnson Reagan and Albany Navy. Thank you. you uh Reagan has 서� from the fiftiest! Thank you, Mr. President. Colleagues, if you'll look on your desk, you've got some coffee from living room roasters. Today is Steven's County Day at the Capitol, and living room roasters is owned by Alan and Haley Brewer. They're both graduates from Tacoma Falls College, and they started this business in their living room. Now they have a brick and mortar location in downtown historic district in Tacoma. Steven's County is home to Tacoma Falls, which most of you know is on the cover of the Georgia Travel Guide magazine this year. In the gallery today, we have with us a big group from Tacoma if they would rise. We've got commissioners from the county, we've got commissioners from the city, our sheriff, Rusty Fulbright, Tacoma Police Chief, Bruce Carlyle, Maritari Carter, our school superintendent, our development authority, Chamber of Commerce, and a number of community leaders. I don't know if there's anybody left in Steven's County today. We've got such a great group, but with y'all would please join me in welcoming them to the Chamber and celebrating Steven's County today. Without Mr. President, I'll yield the wealth. Thank you Senator. Very nice to have the leadership from Steven's County here today. Thank you Senator for recognizing them. I recognize Senator from the 17th. Thank you. Mr. President, colleagues, I am truly delighted to recognize one of the servant leaders of our community. As we celebrate the nicotine round the servant leadership awards and it goes to Miss Pamela Collins of Senate District 17 who lives in Clayton County actually in Jonesboro. Miss Collins is a graduate of Spellman College and she has been in the health field industry for the past 30 years. She was the founding president of the National Council of Negro Women, the Clayton County section. She's a member of Clayton County Black Women's Speak and she is a volunteer for the Martin Luther King and Commutical Service and Proud Breakfast. So I am delighted and honored to recognize her today. She's in the gallery Miss Pamela Collins, a servant leadership award and an honor of Senate District 17. Would you please stand. Give her a round of applause. Thank you so much, Mr. President. I yield the will. All right. Thank you Senator. Very nice to have you guests here today. Recognize Senator from the 6th. Thank you Mr. President. Colleagues I want to give a warm welcome to the Newton Youth Council. They are doing great things. They're growing leaders back home in the great city of homes and they are with us in the gallery. If you want to see the next year, I will stand to be recognized. We appreciate you all being here. And I will see y'all shortly. Thank you. All right. Thank you Senator. Always good to have folks from Newton, Georgia and the city of Alabama. Recognize the center from the 41st. Thank you Mr. President. I rise today to honor the great women of Sigma Gamma Road Sorority Incorporated, who are here today for Sigma Gamma Road Day. I happen to be a proud member of Sigma Gamma Road. The women of Sigma Gamma Road are committed to service and the scholarship and to sisterhood. Since we're founded in 1922, we've been dedicated to uplifting communities through education, civic engagement, and social action. Today, we gather for SG Road Day, and we gather to affirm and reaffirm our commitment to advocacy, and showing that the voices of our members and the communities that we serve are heard. Together, we continue to push for positive change, champion initiatives that empower and uplift all. I'm so glad to introduce and welcome the ladies of Sigma Gamma Roe and Quarty and the sorority incorporated. Thank you, Mr. President. Senator from 15th, I'm into recognizing last time. What purpose do you rise? Thank you, Mr. President. I ask unanimous consent to excuse the senator from the town. Without objection, Senator from the 10th, it's excused. We're going to have Senator from the 38th. Thank you, Mr. President. Colleagues, I rise today. I drew a lucky straw because I get to stand here on behalf of the senator from the 28th and recognize someone that is really special to me, a dear friend of mine, former state representative, Alicia Thomas Cersei, who is here with us in the gallery today. Yep, yep, yep, you can go ahead. Yeah. So as we all know, we see all of our ladies walking around looking lovely and black and gold with the yellow roses on, and they're recognizing women that have done amazing work in our community. And so Alicia Thomas Cersei has been a very close friend of mine, so I'm really privileged to recognize her. I also want to point out that her husband, my fraternity brother Carlos Cersei, is here. He is a former state trooper, and also used to keep us safe here at the Capitol, so many folks will recognize him from being here down at the Capitol as well. So Alicia Thomas Cersei is the first African-American and woman elected to the Georgia House of Representatives from Cobb County in 2003. She has an unwavering commitment to education policy and reform, serving as the sponsor of the state's intra-district transfer law, and co-sponsor in both the state's Constitutional Amendment that established the state charter schools commission and the state's teacher evaluation law. Alicia Thomas Cersei is also dedicated to ensuring every child has access to a high quality education regardless of zip code, and the career as a policymaker, superintendent, and nonprofit leader, devoting her efforts to improving educational outcome outcomes for students across Georgia. Currently, Alicia Thomas Cersei is the president of the Southern Region for Education Reform now, and Democrats for Education Reform. She continues to shape education policy, advocate for equitable outcomes for students, and support teachers through initiatives and leadership. She is also an entrepreneur, and many folks may recognize her as a regular contributor on Fox 5 at Lanna's Georgia Gang. She is also a proud member of Alpha Kappa Alpha Sorority and has done amazing work with so many folks around this state and across the country, and I will say this senator would not be standing here today, had it not been for her unwavering support as we have worked so closely together in the education space. So I just want to congratulate you, former state representative Cersei, and thank you for all that you continue to do for students across Georgia and across the country. And Mr. President, I yield the will. Thank you, senator. Appreciate that. We're going to sit in front of the 14th. Thank you, Mr. President. I am the senator from the 14th, and this is Trump Morning News. Trump Morning News, your number one leader and Trump News Entertainment, keeping you apprised of the health of your democracy, unfortunately recently. In Trump Morning News, we have experienced budget cuts due to an overall lack of funding for independent journalism. So after our brief hiatus, we have decided to send our show to podcast forum in the form of talk-related issues. We have a lot of talk radio. Welcome, everybody. There's a lot going on with Trump Morning News. It's been two weeks. You can pack a lot in two weeks. Let's talk about polling numbers. 56% of voters disapprove of President Trump's handling of the economy. That's the lowest it's ever been, folks. The approval rating. It is a lower approval rating than at any point during his first term. What would you think is going on the rest of the world? Everybody who's opposing Trump has increased polling numbers. President Trump is doing his best in Canada to make Canadian Liberals great again ever since Trudeau resigned at the beginning of this year. The vote share for Canadian Liberals, something like 25% conservators maybe in the 40s. Those numbers have now gone to the middle by 10%. So Canadian Liberals vote share 10% higher than it was. Just a few short weeks ago, conservative vote share dropping. The conservative politicians up there doing their best to post Canada first. Folks are getting blown up in the comments. Christine Om went up there and called it the 51st state. A very offensive thing to say to our closest ally to the North. We did have a great trading relationship with. But hey, bear or trade war is on, folks. Look what's happening across the world. We've got 25% on steel and 50% coming back at us from Europe on spirits. Well, what did President Trump threaten this morning? An increase to 200% of glad President knows that 200 is greater than 50. But as you can see, trade wars can escalate completely out of control. And so that's where we are folks. It's crazy. Meanwhile, what's President Trump doing for the economy on the home front? An extended ad for Tesla cars. Am I right? Did you see him on the White House lawn with the Tesla cars arranged? White House council didn't clear that, folks. He gets into the car. What do you say about the model that he saw in front of him? Everything's computer. Everything's computer about the Tesla. Anyway, let's move on to some serious stuff. I know there's a lot of serious stuff on your mind. For example, in Georgia, we had a contract, a $12 million contract for Mana, a nonprofit that serves malnourished kids worldwide. That $12 million has been officially canceled. I know you're waiting with baited breath when we said it was under attack. When USAID funding was originally paused, well, that is officially gone. And there's some other serious stuff, folks. I hate to say it. Elon Musk, this morning, reach-weated acclaim that Stalin and Hitler did not kill M.E. Did not kill millions of people. And instead, their public sector workers did. I repeat, today, Musk retweeted acclaim that Stalin and Hitler did not kill millions of people, and that their public sector workers did. Effectively denying responsibility for Hitler for the Holocaust, and blaming bureaucrats instead. Folks, that's really bad. That's really, really bad. By the way, Musk is still running. Doge still trying to dismantle the federal government. But everything is super normal in Washington, D.C., super normal here in Atlanta, Georgia. As always, thanks for tuning in to Trump warning news. We know you all can't do anything about it because your state legislators and certainly Republicans couldn't have done anything last 20 years to stop this. Mr. President, I happily yield the well. All right, Senator. Senator, I was afraid that you'd gotten shouneness. I'm glad to have you and glad to see you back here. So thank you, Senator. Rick, recognize Senator from the second. Thank you, Mr. President. I'd like to thank the mayor for the opportunity to acknowledge Savannah State University as the 2025 SIAC champs defeating Tuskegee University. I see the senator from the 26th was here. I don't know where he is, but we're proud of that. And also, we have Savannah High School who won their first state title in 27 years winning the boys class a Division 2 state championship defeating Macintosh County Academy Buccaneers. Sorry for the senator from the third, but we're extremely proud of the winningness that we've had going on in Chatham County with Savannah State University winning the SIAC 2025 championship and Savannah State High School winning their first state championship in 27 years. So congratulations to Savannah State University and to Savannah State High School boys basketball team. And with that, Mr. President, I yield the well. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. We're going to ask Senator from the seventh. Thank you, Mr. President. Colleagues, you have a letter on your desk. I hope you will read it. Today, I rise to sound the alarm. We are facing a serious crisis. And the people of this state deserve to know the facts. A bombshell report out of Florida has exposed what many of us have long suspected. The insurance company has been bringing the system in its favor while squeezing every last dollar out of homeowners. And while they cry poor to regulators, while they say lawsuits are killing them, while they claim they need to raise rates, and while they tell us they're on the brink of collapse, behind closed doors, they're breaking in billions. They are not struggling. They are not drowning. They are caching out, lining the pockets of investors while leaving homeowners to fend for themselves. And I'm here to tell you, Georgia is next. We already know that our state follows the same playbook. Georgia insurance companies are structured just like Florida's. We have the same network of parent companies and affiliate firms moving money around to make losses look bigger than they really are. And we will soon have the same skyrocketing rates, the same denials of coverage, the same owners desperate for relief. If they duped lawmakers in Florida and got away with it, why would they do it here? Especially when they know no one is looking. The insurance company is pushing Senate Bill 68, which would take the rights of Georgians and give more power to them. We must not take Georgians' rights before we investigate the insurance industry. I recently wrote a letter to Commissioner John King demanding an investigation into Georgia's insurance industry. I asked him to do his job to dig into the financial relationships between insurers and their affiliates to find out if these companies are misleading the public just like they did in Florida. But guess what? He responded and he thinks everything is fine and he will not do an investigation. But let's be clear, Georgia families cannot afford for our insurance market to collapse the way Florida's did. We have already seen a 55% increase in home insurance rates since 2019. We have already seen South Georgia families waiting months, even years for interim payouts after hurricanes. If we let these companies continue to unchecked, if we sit back while they siphon money out of this state, then Georgia families will be the ones who pay the price. Extreme weather events are going to happen more and more frequently. There is now a billion dollar disaster on average every 12 days across the United States. The burden of these disasters must not fall squarely on homeowners alone. Florida homeowners are losing their homes right now because they simply can't afford insurance anymore. They are getting priced out of their own lives and if we don't act, the same face awaits the people of Georgia. Now let me ask my colleagues in this chamber, what are we waiting for? Are we waiting until insurance rates double? Until they triple? Are we waiting until people are forced out of their homes? Until neighborhoods are gutted? Until the ones who can afford to live in the state are the ones profiting off of it? I refuse to stand by and watch that happen. I refuse to let working families be crushed under the weight of corporate greed. I refuse to let lawmakers in this building sell out our own constituents while insurance companies run away with record profits. We have a choice right now. We can stand with the people of Georgia or we can stand with the insurance companies that are robbing them blind. And we can demand accountability or we can look the other way while the next crisis unfolds before our eyes. I, for one, will not look the other way and commission a king. I expect an investigation into my colleagues in this chamber. So should you because the people of Georgia deserve the truth and they deserve a government that fights for them. Thank you and I yield the well. We're going to send it from the 55th. This thing with colleagues is here to simply commend the contributions of members of faith and clergy community. community. This recognizes today Thursday, March 13th as the 25th annual faith and clergy appreciation day of the Capitol. I am so honored to do this because as the first year in the Senate and I look back in all those years ago as I served in the House as the people of faith, Georgia is most fortunate to have a very diverse community of religious faith representing represented in local communities throughout this great state. Spiritual leaders obey these various faiths provide tremendous comfort, hope, support and Georgia, the individuals, the families they proceed through life, helping them to find God's direction for the road ahead and through their teachings the clergy having inspired spiritual understanding and peace to persons from all walks of life and it is found in the first book of Thessalonians Paul instructed the people to know them that labor among them and over you in the Lord to esteem them very highly in love for their work state. Such wise words have application in all faiths as it is incumbent upon all of us to acknowledge the great deeds and sacrifices of our ministers people of faith to express our deepest appreciation and service and I will ask that you would just commend these persons thank you past the ROM and a number of other persons thank all of you colleagues for recognizing this day and you are invited to join us those that\n\nFriend of gallery, thank you and we will be in 216 for a faith panel and lunch. Room 216, thank you. You're the will. Thank you, Senator. All right, last one, recognize the Senator for the 28th. Thank you very much, Mr. President and I'm Senator James and you remember that it was this body that helped us create a city called South Fulton. And it took years, but we finally passed it. So a lot of people think this is just the city's day, South Fulton day at the Capitol, but it's the whole county. And it's by our Chamber of Commerce and the President of our Chamber of Commerce is here. South Fulton Chamber of Commerce, President is Diane Matthews, wave Diane. She said, and President, and she's the President and CEO of the South Fulton County Chamber of Commerce. That's Heyville East Point College Park, New York City, Fairburn, Palmetto, the city of South Fulton, some of Southwest Atlanta and Chattahoo, she heals. Also, we have Dietra Brown and she is an organizer of the Queens. It's about six of them that are here and they're from South Fulton. And where is Queen? She's with us today and she's from the school in my district, Langston Hughes, and that is Alicia Fields. And I hope that she becomes the, she's running for the Queen of Atlanta very soon. Also, we have some of our city council persons from the city of South Fulton, J.C., Sebastian, where are you? And Kamalitha Gums, we have our, we have Kathy Hood. She's the vice president of marketing for the city of South Fulton's Chamber of Commerce. Kelsey Rook is from Georgia Power and she's on the board of the Chamber of Commerce. And we have former Mayor Bill, at West Bill, raise your hand. Yeah, everybody's hearing from us, you know, many years ago, each challenged me for this 30 years. And I just won by the hell, my chenna chenna. So we have to become good friends and then he ran for the Fulton County Commissioner of District 7. And you were there about 10 years, right? 14 years. See, we, I'm telling my age too, okay. But then he was our first mayor of the city of South Fulton. And that's when we, you got our, our budgets balanced and so many other great things and we should be there. Thank you. Thank you, everyone, for listening to me about the South Fulton County Day at the Capitol. And please, if you would like, we have lunch around 12 o'clock down in room 125. So please join us for a meal. Thank you. Are you out of the way? And yeah, oh, we have many of our South Fulton Chamber members born up in the gallery. So let's give them a warm. Stenna, welcome, everyone. Thank you very much. Are you out of will? Oh, Jesus, let me see. So the, as you know, my Holy Father for disheartened what I feel lovely.san I wish rise on a point of personal privilege. You have a consent calendar of privilege resolutions that's in center which remove resolution from the consent calendar. Here's the objections to adoption of resolution on the consent calendar. Chair here is none. Resolution of only consent to calendar is adopted. Resolution of only consent to calendar is adopted. Resolution of only consent to calendar is adopted. Resolution of only consent to calendar is adopted. Resolution of only consent to calendar is adopted. Thank you, Mr. President. I ask for unanimous consent that House Bill 647 be withdrawn from the Committee on State and Local Government and be committed to the Committee on State and Local Government in general. Secretary Reed the caption. House Bill 647 by Representative Donna Tucci, the one who are in fifth, and others, the bill is being titled tonight to amend and act to incorporate the City of Mulberry, Proof every 13th to 2024, so as to change the corporate city who limits the city to rise for later matters to reveal convilking laws and further purposes that can be seen on Mr. President. Thank you. Thank you. Senator's move is there Jackson, Senator from the 41st, the Jackson, Senator from the 45th, would you like to speak to your motion? You waived, Senator from the 41st, I'd like to speak to it. No, you waived. The both waived, Senator has moved that HB 647 be recommitted to state and local government operations general bill. Those in favor of the Senator's motion will vote yeh, those opposed nay, Secretary and Lightning Machine. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. On the motion, the yeas are 34. The yeas are 18, and this motion has prevailed. Thank you. Thank you. You have a local consent calendar before you. Mr. Secretary, have there been any objections? Mr. President, objections have been filed. Here's an objection to agreeing to the party committee on state and local government affairs, which is favorable to the passes of the bill. On the local consent calendar, chair here's an unimportant committee as agreed to. Questions on the passes of the bill on the local consent calendar. All those in favor of vote yeh, all opposed nay, Secretary and Lightning Machine. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Mr. President, I'd like to ask that the rules be suspended and be able to introduce two local bills to be read and assigned to the committee. Just wait a second. So, will your motion be in order, Senator? Thank you. On the passage of the bill, the yeas are 48, the nays are zero, and the bill is on the local consent calendar. Having received the requisite constitutional majority is therefore passed. Senator, Senator from the 26. Senator from the 26. You motion, name it. Mr. President, I ask that the rules be suspended in order for two local bills to be introduced and read for the first time in the assigned to the committee. Senator, that would, if we could have the captions, the captions to the bills so they can be read. Thank you. Thank you. Thank you. Thank you. Thank you. Senator, the senator has moved to the, that we suspend our rules here to local bills. Is there objection? Is there objection? All right. Senator, the senator from the 26 has moved that we suspend the rules so that we can have a first reading and the bills that he is introducing that the senator from the 26 is introducing can be assigned to the appropriate committee. We have objection. All those in favor of the senator from the 26th motion will vote yey. I'll oppose nay. Secretary, I'll lock the machine. You must have 38 votes to suspend the rules. Senator, the senator from the 26th motion will vote yey. the problem in our inquiry. The state's requiring. Mr. President, the center's been served for 50 years. Can we get in two local bills? Senator, that's what the vote is all about. Two local bills, y'all. That's what the vote is. 50 years, thank you, Mr. President. That's what the vote is all about, Senator. On the motion, the yeas are, yeas are 23 in the nays are 28. And this motion needed 38 votes to prevail and it has failed. We're gonna send from the second. Mr. President, I move for reconsideration of the Senate's action. Is there objection? There's objection. All those in favor of the motion vote, yeas, all opposed, nay. Senator from the 26, swap up your eyes. Mr. President, isn't this a local bill? Sir, I'm saying. I say in this local bill. It would seem so, it would seem so, Senator. Under the local delegation rules, you have to have a majority of two signatures on the bill in order for it to get through the committee. So, we're not all so true that what I'm doing is getting the red and a sign to committee. I still have to get another senator to sign it in order for it to be local legislation and go through the committee process. That is very true, Senator. Thank you very much, sir. The senator from the second move that the previous motion be reconsidered, all those in favor of his motion will vote, yeas, all opposed, nay, secretary, and a lot of the machine. Senator from the ninth, what purpose do you ask? Probably, I agree. State's requiring. Isn't it true that the city of Mulberry has gone around local process several times? So, now it is an issue that Luke is sitting, I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry. I'm sorry to sit out. I'm sorry to sit out. I'm sorry to sit out. Thanks. Luke, is not serious? I'm sorry to sit out. Luke, is not serious. э I'm sorry to sit out. It is content from the 26 is asking for the same thing. Please. Senators passengera means max and all up in high walks. All up in high walks. Senators passengera means max and all up in high walks. That is Timothy and Zus' perspective. Senator, but it's always voted on by the body. All in the motion for reconsideration, the A's are 19, and the A's are 32, and the motion reconsideration has failed. Moving on to the rules calendar. Secretary Reed, House Bill 81. House Bill 81, by Representative Ballard of the 147th and others, the Bill's waiting 10 and 9 to amend chapter 6 of Title 20. The Bishop of Georgia and his here will be to education compacts. So as entrance to the Interstate Compact for School of Psychologists, to provide for a short title, to provide for definitions, to provide for provisions of the compact and right for the latest, to repeal the complicating laws and for other purposes. Mr. President, this is on the coming on education and youth. I recognize this bill, due pastor, Stolgrews Minutes, and our Hickman Chairman, that completes the order, Mr. President. I recognize Senator from Harry, Georgia. Thank you, Mr. President. So I bring to you today House Bill 81, which is an initiative developed by the Council of the State of America, and I'm going to tell you this. I'm just going to ask you to give a brief overview of the bill. Thank you, Mr. President. So I bring to you today House Bill 81, which is an initiative developed by the Council of the State of America, and the National Association of School Psychologists, the Professional Standards Commission, and the Georgia Association of School Psychologists, are supportive, as well as the Georgia Chamber of Commerce. You'll see a letter of support from them on your desk. What this bill does is enters Georgia into an Interstate Compact of School Psychologists, when it's said that the bill is a large number of schools that are going to be in Georgia into an Interstate Compact of School Psychologists. When seven or more states approve this measure, we will have an Interstate Compact, which would reduce barriers to certification for School Psychologists from the member states coming into Georgia. It ensures only qualified professionals are authorized to provide services and aligns with our Senate priorities of the members. So, I think the Senate will hold on once again. Can we have everybody's attention in the Chamber, please? If you've got to have a conversation, take it outside, please. We've been a little loud all day long, so please show the Senate their little respect and give them the attention they need. Senator, sorry about that. Thank you, Mr. President. I'll need that little respect. R-E-S-B-E-C-T. Like Rodney Dangerfield, I'm here. I get no respect. So, where was I? So, House Bill 81 aligns with the Senate priorities of promoting literacy and school safety. It will take seven states to form the Compact. By being one of the early states to get in, we will have the ability to influence the sort of enabling language of the Compact. Currently, the states in the Compact are West Virginia and Colorado, but they're similar bills or identical bills in the legislatures of Oregon, Nevada, North Dakota, Kansas, Alabama, Florida, Maryland, Vermont, Nebraska, and New Jersey. We are an indescribable school psychologist. There's a shortage, like we see in a lot of our workforce areas, and this bill will help with our workforce shortage in that area. So, I ask for your favor consideration. I'm happy to answer any questions. If there aren't none, I will yield the well. You do have one question, Senator. We're going to have Senator from the 53rd. Is the Senator yielding? Yes, sir. Do you have respect for psychologists in places like Oregon or Colorado? Well, I do know that we are having mental health issues and problems throughout our society, and I think school psychologists are a good frontline to help young people deal. School psychologists deal with various issues and will help them get on the right track. Senator from the 33rd, do you have a question? Thank you. Mr. President, will the Senator yield? Yes, sir. I'm going to vote for this bill, but I was wondering, will the senators have access to these psychologists when we need help? Well, maybe we can get one as the daughter of the day, occasionally, that would be helpful. Thank you, Mr. President, I yield the well. Thank you, Senator. Does any other Senator wish to speak for against a measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here, none. is an нельзя mundia. is an author. 對啊. Is there any objection to the Board Committee, which is favorable to the passage to the bill? Chair, here, nineemberals. It is individuals. Is there dochria of Knott and in conscience. Who has another known Anniston Hill Center? you i 48 the nays are two this bill haven't received ricks to constitute the majority is therefore passed You're Rick Flair last week you Roddy danger field this week. You got the respect you were asking for senator Secretary read House bill 167 House will 167 my representative hanging the 156 and others the bill to me turn an act to amend our coluna chopper three of titles 27 of the official to Georgia annotated will you hunting access to authorized fluorescent pink hunting advertisements to provide for later matters to be able public in laws and for other purposes Mr The Senate Committee on Natural Resources in the environment recommends this bill do pass respectfully submitted senator Anderson Chairman that completes the order miss resident You\n\nyou you you a President. It's going to be interesting. Thank you, Mr. President. Good morning, colleagues. This is kind of a light-hearted bill. Should be anyway, but I imagine you guys are going to have some fun with it. Today, I bring you HB 167. And I ask you guys to gentlemen and ladies to support this bill. I know 21-year-old at my house is going to be, she would greatly appreciate your support. What this bill does, it brings fluorescent pink to the outdoors, to the grayed outdoors. No longer will you be required to wear only a fluorescent orange vest, but fluorescent pink, 500 square inches of fluorescent pink will be sufficient. HB 167 does not limit the use of fluorescent pink to females. Gentlemen like my friend, the country lawyer from the 42nd who is very comfortable in pink and his manhood, he'll be able to wear that to the grayed outdoors as well. Mr. President, I'm ready to take questions. Yeah, you got some, Senator. I'll tell you what, this is your second bill this year. I mean, I'm starting to question this Senator from Hall County here. Senator from the 42nd. Thank you, Mr. President. This Senator Yield. Let me just thank you first all for putting these pictures on our desk today. If you have any ink left of your pen, I'd love to get your signature for you, if you will. So as a nor George a farmer, have you already had your custom made pink vest made or have you ordered it? I hadn't ordered it yet. I'm hoping to be able to order it as soon as we leave the chamber. That'd be great. And so I was reading earlier this morning in a local publication. There was a quote from a fashion expert. I'm going to read this to you. It said, I think you get taken a little bit more seriously if you're not trying to be really, really flashy. But if you're trying to look somewhat dignified, especially as a freshman and as a fuller leader, are you a fashion expert freshman floor leader? I have a philosophy on clothes. Do you further you? Yes, sir. So given your expertise as an or George a farmer and as a fashion expert, so if I'm going to go and hunt bears, hogs and deer, would I look more dignified if I were an orange vest or a pink vest? That's what this bill does, Senator. It's up to you. It's more visually appealing to the wear of the clothes, just whatever you want. Thank you. Bring it on Senator from the 51st. Thank you, Mr. President. Will the Senator yield? Yes, sir. If you don't mind, would you pull the microphone up closer so the people back home can hear you? I'm curious about the color pink. Why did you pick pink out of all the colors on the color wheel? Well, there's two other states across the country who have chosen pink and what it's done, it's actually increased hunting license sales in those states. So maybe some other colors may be added later. How many can you tell me how many shades of paint there are in the color spectrum? I do not know. Senator, can you tell me what the letters PMS mean to you? I can. Okay. Premissile syndrome. No, sir. PMS is called Pentone Matching System. It is a color wheel that you use to match colors for printing material. So Senator, I'm not sure where your mind is this morning, but it's clearly not on your bill today. Thank you. Recognize the Senator from the 50th. Thank you, Mr. President. Does the Senator yield? Yes, sir. I want to help you out a little bit. Are you aware that there's 240 different shades of pink? I know I am. And is there a specific shade in this bill that we're going to recognize as the official pink of Georgia Hunters? It's fluorescent pink. That's what we've addressed. I've got several calls from my district about pink. Is pink and pink? Is that the same color and would that be recognized? Senator, I live about two miles from your district. And the higher we get an elevation there, the longer the draw on the color. So red is red and pink is pink. And white is white. That's right. Thank you. Mr. President. Senator, I think you were a recent scholar of Sir Thomas Carlyle, why don't you? The readings of Sir Thomas Carlyle. The president knows of what he speaks. I think that book was called Sartor Resartis, which stood for, what was it again? Taylor Retailer. Taylor Retailer. And they had a name for a gentleman who lived to dress. Do you remember what that name was? Dandy. That is correct. I'm glad you were mad at me, Senator. All right. You may yield, Senator. I yield the well. I'd ask for your favorable consideration. All right. The senator from Hall County, he keeps impressed in here, guys. I'm telling you. Any other senator wish to speak? Yes. Oh, I'm sorry, Senator. Senator from the 44th. Thank you, Mr. President and colleagues. I'm glad you were mad at me. I'm glad you were mad at me. I'm glad you were mad at me. I'm glad you were mad at me. Hunting is a tradition deeply embedded in our culture, providing recreation, sustenance and conservation benefits. However, one of the most critical aspects of hunting is safety. And today, I am so glad that we have this bill in the floor sponsored by the representative and the senator, the best dressed freshman here in the building, center from the 49th. Often overlooked, yet vital component. Fluorescent, pink, hunting, outer garments. While many hunters traditionally opt for camouflage or fluorescent orange, recent changes, such as we are considering today, have are going to authorize the use of fluorescent pink as an equally effective option for maintaining safety in the field. So first and foremost, let's discuss safety. The hunting community must prioritize safety above all else. And visibility plays a crucial role in preventing accidents. Traditional camouflage, while effective for concealing hunters from game, also makes them difficult to see by other hunters. This, colleagues, is where fluorescent pink garments can make a significant difference. In House Bill 167, hunters pursuing deer, bear, and even feral hogs during firearm season must wear at least 500 square inches of daylight fluorescent orange or fluorescent pink material above the waistline, including optional head coverings. This requirement is essential because studies show that wearing bright, highly visible colors dramatically reduces the risk of hunting accidents. The introduction today of fluorescent pink gives hunters an additional option while maintaining the same level of safety as the long-standing use of fluorescent orange. fluorescent pink is an excellent choice because it's for many reasons. One is that it contrasts well against the natural backgrounds, making it easier for fellow hunters to spot what another in dense woods, open fields, and other varied terrains. Accidental shootings are an unfortunate reality in hunting at times, but by adhering to the visibility requirements, like those outlined in our existing code and in House Bill 167, we can significantly reduce these incidents and ensure safer hunting experiences for all. Beyond the laws that we are passing, fluorescent pink offers superior visibility in diverse hunting environments, whether you're navigating thick forests, traversing open plains, or hunting in snowy conditions. The high contrast nature of fluorescent pink ensures hunters remain clearly visible to one another. In wooded areas where shadows and varying light conditions obscure movement, fluorescent pink stands out, cutting through the visual clutter. Similarly, in snow covered regions, we don't have that many, but this is a good edification, good facts for y'all to be aware of. The high contrast nature of fluorescent pink ensures hunters, even in snowy conditions, remain clearly visible to one another. In wooded areas where shadows and varying light conditions cause problems, this is where fluorescent pink really makes a difference. The goal is to remain highly visible even at a distance, to be seen by fellow hunters, while still remaining effective in the field, and fluorescent pink meets those criteria offering this dual benefit. Colleagues, the benefits of fluorescent pink hunting gear extend beyond just safety. They also have a psychological impact on the wearer. Wearing a highly visible color increases confidence in the field by reducing anxiety about being mistaken for gain. This allows hunters to focus more on their experience and enjoyment and less on the potential safety risks. Moreover, the normalization of fluorescent pink is a hunting color, fostered a sense of community, and shared responsibility. Hunters who choose to wear pink can be seen as advocates for safety, setting an example for others, and reinforcing the importance of high visibility hunting apparel. Another critical aspect of this legislation, an adopting fluorescent pink, is the opportunity to break outdated stereotypes within the hunting community. Historically, hunting gear has been dominated by darker, more muted colors, typically associated with traditional gender roles. But by embracing fluorescent pink, we challenge these notions and promote inclusivity in the sport. The introduction of pink hunting gear encourages a broader audience to participate, making hunting more accessible, and appealing to a new generation of hunters. Colleagues, whether you are a seasoned outdoorsman, a woman looking to take up hunting, or a young person curious about the sport. Fluorescent pink serves as a welcoming, universally recognized symbol of safety and responsibility in the field. In conclusion, fluorescent pink hunting outer garments are not just a bold fashion statement. They are a vital tool for enhancing safety, improving visibility, and fostering a more inclusive hunting culture. I exhort a yes vote on House Bill 167. In passing this, we and our state of Georgia will take a significant step forward in allowing hunters the choice between fluorescent orange and orange. Both of which ensure a safer hunting environment for all. In fact, I urge all of you to consider incorporating fluorescent pink into your hunting wardrobe, advocate for its use among your fellow hunters as I will with mine. Educate newcomers about the importance of high visibility apparel and help make our hunting traditions safer and more inclusive for future generations. Together, we can create a culture of responsibility, visibility, and safety in the great outdoors. I thank the representative, and I thank the senator from the 49th for bringing forth this critical piece of legislation as a freshman this took courage. This took courage. And today, he is wearing a pink shirt. Oh, and the representative is with him. Thank you, representative, Hagen, for your work. I can say it. Colleagues, it's wonderful to see us conduct this important business in the Senate chamber. Thank you for considering this legislation. Let us all go forward arms linked to create a safer and more inclusive hunting community. With that, I am happy, Mr. President, to take questions, or I will yield the well if there are none. Senator, I'm impressed. I never knew you're so passionate. I'm happy to present it. It is a women's history month. And today is the legislative women's caucus yellow road ceremony. So I was feeling a little bit fiery about this inclusion of pink, but I am happy to answer questions. You do have a few. All right, then. Delightful. I mean, it's very important. I'm glad to see that. I recognize the senator from the 41st. Thank you, Mr. President. Senator, do you yield? I certainly do. Do my seat me. Senator, I have a yield for a series of questions. Thank you. My first question is, in light of the fact that it is yellow rose day, would you be interested in an amendment that would include fluorescent yellow to this list of choices for folks? That is a great idea. Florescent yellow is actually known when you think about it as our safety color for like safety patrols, orange is one, yellow is one. There were a number of students here this week and their safety patrol apparatus was fluorescent orange and I couldn't help but note how I catching it was and I agree with you that that would create the similar visibility that the representative and the senator are going for in terms of hunting safety. And, D for the year. Yes, ma'am. So while we're talking about choices for hunters, I'm curious in your opinion, would you agree that it would be important to make sure that women have choices when it comes to their reproductive rights? I do agree with that. And you know, again, it is women's history month. I am so glad to see this body moving forward, not just on safety, but in the recognition that there are many women who are hunters. Right. And, and you know, we need to make progress on some of these other issues that also matter to women, senator. Thank you for your questions. All right. Senator from the 14th. Thank you, Mr. President. It's a Senator Yeild. Certainly appreciate your passionate presentation. But are you aware that you said the word inclusion a lot during your speech? I did because really that's what this bill is about. Senator. Are you aware that word has been banned? No, that's, that's well, right. I forgot about that. How to my apologies. Senator, do you receive any federal funding in your personal or professional capacity? I mean, I don't think so, but let me check my wallet. Senator, are you aware that if anyone finds out that you said inclusion from the well today several times, you may lose all of that federal funding? What I am glad about, Senator, I'm worried about that, but I am glad I'm a citizen and not a green hard card holder because we are worried. I'm not worried about my free speech right now. Yes, I might be able to be attacked on my wallet, but I still can stand here in this well and I am, I am honored and privileged to be a senator and be able to speak on behalf of my constituents. And I do think that that's what our citizens should be able to do under the first amendment to the United States Constitution. Thank you, Senator. I'll be honest, I missed that last answer because I started worrying getting my own head because I have also said the word inclusion today. So we might both be in trouble. Thank you, Senator. I recognize Senator from the 19th. I'm very glad to see him from the 50th. Thank you, Mr. President. Does Senator yield absolutely? Isn't it true that because of your staunch advocacy for this bill and your inspiring speech that the two senators from Macon have come together and that if one senator will make his motion again, there will not be an objection. So you yield the well right now. That would be my fondest fondest wish. Thank you, Senator. All right, I'm sorry for all the rest of you that have questions and want to weigh in on the debate, but I will yield the well. All right, good job, Senator. Senator, may I ask any late arriving amendment? Secretary, read the amendment. Mr. President, Senator Mel, the second offer to allowing amendment number one to amend House Bill 167 by amending line 25 to add lime green after fluorescent pink. Mr. President, that completes the order. Senator from the second. Would you like to speak to your amendment? Thank you, Mr. President. Today, this morning, I rise with amendment number one to include lime green inside of this wonderful piece of legislation considering that Monday will be St. Patrick's Day. You can see green shamrocks. You can see a sea of green and green is overwhelming, especially lime green. And being a boy scout for over 25 years, I have spent a lot of time in the woods, Mr. President. I do believe that you can see fluorescent pink. You can see hunter orange and you can also see lime green. And that lime green is important, especially with Monday being St. Patrick's Day and consider Mr. President. I'm also 5% Irish. I think it's only fitting that I include that. And so for my colleagues, I've seen to Mr. President, I understand that I actually am Irish. You can look at my last name and understand that I'm also multi ratio. And so my father is 100% Irish and my great grandfather, emigrated from Ireland. And so don't let the complexion of one skin deter you from understanding someone's actually Irish with an Irish last name, Mr. President, because I don't think it gets more Irish than Malo, M-A-L-L-O-W. And if a quick Google search couldn't prove that it was Irish, I would just encourage my colleagues to get some good data so that they could Google and figure that out and find out maybe some ancestry.com, whatever they would do. But I think lime green, Mr. President, is an excellent color to be included in this legislation. And so Mr. President, I would just ask for my colleagues favorable consideration that we include lime green in this wonderful piece of legislation, especially in honor of St. Patrick's Day being owned Monday, Mr. President. And with that, I see there may be another amendment arriving. So I will go ahead and yield the well. All right. The man's from Savannah has yielded the well. With any other Senator, which speak for against measure. I'm begging on the senator from the 29th. Mr. President, I want to tell our freshman senator, I really appreciate him bringing this bill forward. And for those of you who may not be aware, this bill came from a young lady in Gwinnack County who enjoyed hunting. She felt that she was so involved in it that she wanted to have an impact in it. So she helped create this piece of legislation. She reached out to another lady that she admired that she appreciated to help create this. And that's what Representative Hagin did over in the house. So I know once Senator Thompson left our late great friend, I started inheriting the role as being the grumpy estate senator. And while never comfortable with it to start with, I did come to embrace it. And so I would like to point out that today, I truly hope the people that tune in and watch us do their business or the stand in the halls and watch us do their business are not as embarrassed of the show as I am. And while the freshman senator knew the hazing and all that, that's part of the tradition. I love every bit of that. But this is about gun safety. This is about a young lady who wanted to be a part of the political process. And this is about a young lady who looked up to another lady who served in the House of Representatives for the state of Georgia. And this is important to that young lady. And if it makes sense to us, unless stopped with the silly amendments, let's stop with the silly comments and give that young lady who loves to hunt her opportunity to see legislation work in a positive way so that she can have stuff to brag about about something that she's done and hopefully make her a stronger woman. And with that, Mr. President, I'll yield for any questions. You have one question. Senator from 37. Thank you, Mr. President. This is Jim and you. No, I'm for the record. I am wearing a lime green tie today. I had no idea that the debate would divert in this direction. But in all seriousness, I asked the author of the bill about fluorescent yellow fluorescent lime green. And it's true that if scientifically the ability to decipher yellows and lime greens in a wooded hunting setting does not provide the kind of safety that the pinks and the oranges do. Isn't that true? Those other colors tend to draw the attention of the hunter and tend to lead to more accidents because a lot of hunters are more reactionary, especially new hunters when they go out in their reactionary to certain colors. And they would be more quick to train their weapon in that direction and fire without obtaining the target in a proper way. It's been determined that the colors you're talking about the current orange, the paint that we're discussing here today and a few other colors tend to bring more caution to the shooter. From a scientific standpoint. So Jim and for the year. I'll yield for one more question. So what I'm hearing today we've had some for volume some discussion here, but the serious vote is to vote down the amendment. Lighthearted though it be and maintain fluorescent pink and fluorescent orange is a standard for hunter safes. That correct. I agree with the senator from the 37th. Thank you, Mr. President. I yield the well. All right. Senator from the 14th. Thank you, Mr. President. I also rise in support of legislation. I want to commend Representative Hagen for bringing in a great bill. I want to commend the young lady who worked on the bill. It's an excellent piece of legislation that improves gun safety. We were overwhelmingly supported. But if somebody else's role is to grump the situation, my role subsequently will be to ungrump it slightly. My only question for you all is when are we allowed to have fun versus when are we not? I got to commend the senator from the 44th on switching it up a little bit. Sometimes she gets accused of not switching it up. She switched it up that time. And we had a little bit of fun. But if that's enough to trigger a level of sensitivity about the work that we're doing in this chamber to be accused of being silly to be accused of not taking it seriously, then I would direct your attention back to the global state of affairs. We are living through times when comedy and entertainment are the only way that people are getting their news. People have been saying for years that the daily show, that John Stewart, the folks who do comedy commentating, is some of the only ways that they can even stomach listening to the news. So undoubtedly, if a headline gets written or attention gets grabbed because something goes in a slightly wearer direction, that's not just expected. That's in some cases necessary to engage the public on matters of public concern. Now if you don't like that, there's a little segment I do once every other few days that is meant to be a little bit of satire about the state of the majority in DC and how it uses exactly the technique we're talking about. Comedy, a little bit of satire, a little bit of frivolity, in order to capture not only the public's attention, but command its deep support. The loyalty that the president enjoys is because he is an entertainer and has been since he was featured on NBC and Democrats are behind because we don't have yet the tools to match his entertainment value. If we can find a way as Democrats to be entertaining and not be a-holes, I actually apologize for the pro-tem, I told him I wouldn't do that. If we can find a way not to be abrasive, but to be as entertaining as a president, we might be on something. So what I won't allow is for this debate to end on the grumpy somber note that this is all serious business, that this is just about good policy making, because if that were true, I would not be an office. You wouldn't even know me, because I got Trump deranged in 2016. I was diagnosed by a primary care physician with Trump deranged with syndrome.\n\nAnd that's the only reason I ran for office. So if y'all don't like silliness, if y'all don't like entertainment, if y'all just wanna do serious business all the time, then call your people and tell them to cut it out. Thanks, Mr. President. All right. Senator from 31st. President, I move, call to question to end this mockery to female outdoorsman. Call the question. From the second, you know, the public nature inquiry. Thank you, Mr. President. Due to a drafting era on amendment number one, withdraw amendment number one. Is there objection? Without objection, Senator Morn is withdrawn. Senator, there's nobody else lined up to speak. So I think Mr. President, I'll withdraw my motion. Let's go vote for Carly. Get this over with. Okay. Any other Senate would speak for against measure? Is there objection to the previous question being ordered? No objection, previous question is ordered. Is there objection to agreeing to report committee which is favor to the passes of the bill? Chair here is nine, four committees agreed to. Is there objection to the main question being ordered? Chair here is none of the main questions ordered. Questions on the passes of the bill? All those in favor of vote? Yay, all opposed nay. Secretary and law to the machine.會部分 the request. All of the passes of the bill, the yas at 50 and the nays at 0 and senator from 49 won't have another bill for the rest of session so. All right, so Senator from 26. Yeah, motion. Thank you, Mr. President. Mr. President, let me apologize for any discussion on the previous motion that I made. But today is not day three. Am I correct? You are correct, Senator. Mr. President, I ask unanimous consent that Senator Rue's three-dash 1.2 and four-dash 2.1A be suspended to allow for two local bills to be read and assigned. Secretary, read the caption. I'm sorry, I jumped ahead. Is there objection to the senator's motion? That objection, Secretary, read the caption. Senate Bill 337, by Senator Lucas of the 26, the Bill's main panel act to amend and act known as the Make and Water Authority Act to prove March 23rd, 1992, as amended particularly by Act to prove April 10th, 2024, and in Act to prove February 17th, 2022. So I have to change the description of the electoral districts to write for staggered terms of new members, to write for elections, to write for chairperson, to write for salaries of the elected members and chairperson authority, to write for the continuation of the members, to write for a number of monthly meetings, to write for the government. Senate Bill 338, please. Senate Bill 338, please. Mr. President, that completes the order. Senator from the 8th. Thank you, Mr. President. I ask for unanimous consent to excuse the senator from the 11th for business inside the Capitol. I'm Jason from the 11th is excused. All right, senator from the 21st, majority leader. Thank you, Mr. President. I move that the Senate's standard adjourn pursuant to Senate Resolution 6 until 10am on Tuesday, March 18th.",
  "updated_at": "2026-02-13T14:44:15.69903+00:00"
}