{
  "video_id": "0T0nvQxjMOM",
  "url": "https://www.youtube.com/watch?v=0T0nvQxjMOM",
  "title": "12/4/23 Joint Study Committee on Service Delivery Strategy",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 64,
  "summary": "Overview:\nThis session of the Georgia Joint Study Committee on Service Delivery Strategy focused on finalizing recommendations for the committee's report. The discussion centered around reaching consensus on the draft recommendations, with input from the Association County Commissioners of Georgia (ACCG) and the Georgia Municipal Association (GMA).\n\nKey Actions:\nNo bills were passed or referred during this session.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The committee discussed the need to wrap up the recommendations and provide a final report to the Lieutenant Governor and Speaker by the December 31st deadline. \n- There was discussion around reaching consensus on the six draft recommendations, with the suggestion to have ACCG and GMA provide their official positions on each recommendation.\n- Commissioner Dockery and Mayor Ward summarized their written recommendations to the committee.\n\nVotes:\nNo recorded votes took place.\n\nAttendance:\nA quorum was present, though the transcript did not provide specifics on attendance.\n\nAdjournment:\nThe session was expected to wrap up within an hour. The committee planned to reconvene with ACCG and GMA to finalize the recommendations before the December 31st deadline.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n4th and should be final committee meeting on service delivery strategy and Chair\nagain and I have been communicating a lot with with some of you and the two associations\nACCG and GMA and hope we can have some good discussion today and make great strides towards\nwrapping this up. So I want to thank those committee members who have chimed in with recommendations\nor responses to the draft recommendations. It's very helpful to keep the conversation\ngoing. Before we go any further, I would like to ask someone to open up in prayer and\nChairman Prince is going to do that for us.\nLet us pray, eternal God, our Father, we thank you for this day. We thank you for another\nopportunity to come together and do the business of this great state of George. Father, we\nask that everything we do here be pleasing unto you. God has strengthened us. Give us your\nwisdom guidance by most of all thank you for your son in Jesus name. Amen. Thank\nyou, Chairman Prince. All right so we will call them in the order. You've all\nseen the draft recommendations which we'll get in front of me and Mayor Ward\nhas sent us all his responses to those, his recommendations and Commissioner Chris\nDockery has done the same as early as this recent as this morning so what I\nlike to do is just hear from the committee members your thoughts on these\nrecommendations and then I've had some conversations offline with with\nchairman again and we both talk with ACCG and GMA and what we'd really like to\nsee here because I've been in the legislature since 2018 and this this issue\npredates that by a few years. Yeah but the way I understand it this issue has\nbeen, you know, there's been talks to resolve some of these differences, the dispute resolutions\nfor at least 15 years. And here we are still talking about it and we've had this study\ncommittee that GMA and HCCG and others have asked for and we're still not quite there\nwith a joint agreement or a list of recommendations that both parties are agreeing to be the solution\nto this dispute resolution.\nSo what I'd like to do is just talk through these comments and then ask the two associations\nto get together in short order and get back with chairman again and on, you know, those\npoints you can agree on. And I hope there's only just a small, small number that you\nsay you can't agree on. But we need something that we can go into legislation, into session\nwith or else this is going to continue. And then we'll look back 15 years from now and\nand we might still be having the same conversation.\nSo, Chairman Prince.\nThank you, Mr. Chairman.\nAnd again, I'm looking at the recommendations\nand I think there's spot on.\nHowever, come I know ACG and GMA\nhave policy meetings or something else going on\naround the same time.\nWill they have time?\nBecause I think, well, I guess the maximum question,\ndon't we have to have a report or something\nback to the Lieutenant Governor and the Speaker here.\nWe do.\nThe initial deadline was December 1st, which is passed.\nAnd we asked for an extension.\nAnd they gave us an extension to December 31st.\nSo thank you for clarifying that.\nSo we do have to December 31st.\nHowever, we don't want to wait till the laminate hour\nof this extension.\nAnd I'll ask Chairman again to weigh in, too.\nBut I think we have holidays coming up.\ntoday is what the, today the fourth, that's right,\nSanazon is way.\nAnd so, first of all, this meeting today,\nwe've agreed needs to wrap up within an hour,\nand then we'd like the two associations to come back to us\nwith your approved recommendations in plenty of time\nfor us to get together on a report before the end of the year.\nSo, I'd say before Christmas, do we\nwant to set a hard date to meet with them. Yes. We got a question from Chairman Burns.\nThank you, Mr. Chairman. As we look at these recommendations there, I guess six. Is that\nright? Is there consensus on any of the six? Is there consensus that we could say we\nWe can settle those and leave the two or three that might still need more consideration.\nI'd love to get to closure on something.\nI would like to hear the answer to that from the parties, if there's consensus to both.\nIf I may, a misdemeanor, I'd like to suggest that ACCG and GMA address all of the six recommendations\nand just say, we're good with this.\nWe like to consider this further.\nThat's what I want to, what's I'd like to hear.\nI don't see a great deal of contentious debate\nabout statewide mapping standards for SDS agreements.\nThey may be, but I would say I don't anticipate that.\nSo thank you, Chairman Burns.\nwhat I'd like to do is hear from here from the two parties.\nBut also I'd like Commissioner Dockery and Mayor Ward\nto be able to summarize their recommendations\nfor us while we're all here together.\nSo it looks like Commissioner Dockery\nmight be ready to do that now.\nMr. Chairman, I would just suggest that we\nas the committee since that's our charge\nto come up with this report that we go through it and come up with what we think is right.\nAnd then if there are outstanding issues that we as a committee can't iron out, then\nwe give ACCG and GMA time to look at those issues or help us to address those issues\nus to what a compromise could be and then of course I can't speak for GMA but ACCG we\nwill want to go back and vet that through our policy council and we could do that we\ncould do that via Zoom in short order so I don't think that's an issue but I would suggest\nthat we as the committee go through each one of these bullet points and discuss them\nas a committee and then if there are outstanding issues maybe ACCG and GMA here with us today\nthey can help us get through those.\nJust a recommendation.\nYes, I'm in favor of doing just that.\nBut I'm not in favor of finalizing the report\nwithout ACCG and GMA saying, we agree with this,\nor we don't agree with it officially.\nThat's what I want.\nI want some finality to the report from each association.\nSo would you like to go first and explain your,\nsummarize your recommendations that you sent out to us?\nI'd be glad to.\nDo we just want to go over the first bullet point\nwhich is statewide mapping?\nI can tell my position.\nAnd then if anybody on the board\nor on the committee wants to give theirs\nand just do them one at a time.\nYeah, that works for me.\nWhat's your say, Mr. Chairman?\nOkay, so the statewide mapping,\nI do think that that's good.\nIt adds a lot of standardization.\nAnd in my comments, one of the biggest concerns I had is forcing communities to identify\n100% of their areas as for a service delivery.\nIn other words, there may be some areas that are not designated and they, you know, a community\nmay desire to leave that undesignated, not knowing what the future development may be.\nif you designated a certain way and then the development comes in and it's completely\ndifferent from what you anticipated, then whoever's designated to provide that service\nand might not be able to.\nSo I'm not sure that there's a benefit to making sure 100% of the land areas would be designated\nby doing so.\nI think what you're doing is your forcing communities to do a pencil drill where we say we'll\njust do this and you do that without any thought behind it and then when it comes down to it,\nit might not be the right answer and it could be very contentious in doing so.\nOne thing that has to be considered is the ability of certain communities to do the GIS mapping.\nSo that might be a fallback to regional commissions to help with those things because I'm not\nnot so sure that every municipality and every county in the state of Georgia has that\nsame capability for GIS mapping.\nAnd then we talked about the DCA rulemaking authority and I think that's a bullet point\non down but I think it's applicable here because this is a very specific issue that I think\nthat that rulemaking authority could be a big benefit\nbecause this technology changes,\nmaybe the requirements for those maps would change as well.\nSo that's, I don't think that's something\nthat has to come back to a legislative body to update.\nSo that would be in my mind a good place for DCA\nto have that rulemaking authority to change\nwhat that requirement would be.\nAnd it would be equal across the board for all communities.\nSo those were my big comments on the statewide mapping\nstandards, Mr. Chairman.\nAll right.\nSo just for my clarification, the rulemaking authority\nto DCH, I believe that's what some believe is given too much\nof the legislature's role away to not DCH, excuse me.\nD.C.A. is that in my right on that?\nMr. Chairman, if I may, I think if you just give a blank check so to speak to D.C.A.,\nyou're putting them in a very uncomfortable position because I think that is the job\nof the legislatures.\nBut if it's something as simple as what's required as far as mapping, a very specific\nrulemaking function then I think that that would be acceptable. It certainly would\nin my eyes because it allows them to adjust maybe as technology changes. But to\ncome up with rulemaking authority as far as how you're going to have dispute\nresolution, I don't I don't think that DC that they're going to do I'm sure\nwhat you tell them to do but I don't think that that puts them in a very\na comfortable position to pick winners and losers or to come up with a process that favors\none government entity over another. So the rulemaking just as a blank check, I'm opposed\nto, but if it's a specific issue that can be defined, I think there's a place for it.\nall right thank you and that's your position on bullet point the first bullet\npoint Mayor Ward we'd like to speak to that one all right what number are you 13\nall right go ahead so I think the low-hanging fruit on this is the statewide\nmapping when I think policy you know a lot a lot of the role we play on the\nmayor level is to set policy as opposed to set procedure if you will so the\nThe why and the how is what we, you know, the why and the what is a lot of what we answer the how we try to maybe leave that up to our staff a little more. So that's more the long, long lines of what I was thinking in this.\nBut if we just look at Chairman Dockery's report and kind of eliminate mine for a minute or his, his input.\nI don't believe that under the first bullet point, his subheading number one. I don't think that the GMA position will differ greatly.\nThere could be territories that are left unestablished, if you will, because then it wouldn't necessarily be a, well, you have to take it from me later if it's unestablished for now.\nIt could be unestablished on an ongoing portion.\nAnd I think in support of that, if you were to look at the proposed recommendation on my report on page one, that's why we kind of indicated there including data and parcel jurisdiction level.\nSo then we really lay this thing out and we know what the data and parcel jurisdiction levels are.\nWith regard to the DCA rulemaking authority, I don't know that we drilled down that close.\nWe did recognize that the Georgia Geospatial Information Office has on its board members of GMA and members of ACCG.\nAnd more so leaned in the direction of saying, hey, these are mapping services that both of these entities have a part in.\nand let that mapping service play more of a role.\nSo to keep my comments brief and to help us get through this,\nI think that's about where I wanted to start.\nOkay, thanks. Chair again.\nAnd I think they're both hitting on the same thing for me.\nWhen I talk about, and I'm on DCA's rulemaking,\nyou know, this is what you've got to have in your maps.\nThis is what you've got to do.\nAnd I think that DCA can work with us as local governments\nto make sure that, you know, across the state, there is uniformity in those maps, I think\nthose rules can come from DCA. I don't think that's something that we need to legislate\nin. But I do think that when I look at, and truly the first attempt in Georgia that\nI know anything about on service delivery was the maps that were created for the Electric\nTerritory Service Act of 1973, where you identified all areas of the state for who's going\nto serve with what area. There are a few places in that map that show that there are some\nundetermined areas of the state, but very few. And so for me, when I think about most\ncounties, yeah, there'd be, there'd be some counties I think about the Oki-Fonoki swamp\nor something like that that, hey, it might not be one of those places we'd put in the map\nas far as who's going to serve as delivery in there. But very, very few. I think it'd be\nthe exception of the rule. And I'd like to see that, you know, and when the maps are\ndone as much as possible would be there. I think it would, because then you're either on\nthis team or that team as far as who's going to serve it. And then I think, and I give\nmy local officials a lot of credit that they can work amongst themselves to, okay, it's\nours now. Either you're going to serve it or tell me that you can't. If you can't serve\nit then the other service providers would come in and serve it. But I think it's by having\nit known when you when you agree to a service delivery map that it is in A or B or C or\nD or any of the providers that may be in that community by it being an assigned at least\none of them if they can't provide it then somebody else can step up to the plate and make\nthat recommendation, and for me, I think that's a prime example of where we'd use DCA's\nrulemaking ability to, hey, here's what your map's going to be like, here's the format,\nand here's what you got to do.\nThank you, Chairman Gan.\nAny more discussion on the first bullet on the maps?\nThat one seems pretty agreeable.\nAll right.\nAll right, second bullet point.\nMayor Ward, you want to go first on that one\nand explain your recommendation.\nThank you, agreed on it.\nI appreciate you giving me the easiest one on the board.\nYes, I think the consolidated governments\ncan make their own rules and get along with themselves\nmuch easier than cities and counties\nthat are not consolidated.\nAll right, and Commissioner, Dr. Lee.\nMr. Chairman, I don't have any comments on that one either.\nThat's kind of a no brainer.\nYeah, and I don't mean to skip over anybody else\nif you've got anything to weigh in.\nSo that one seems pretty simple as well.\nAll right, how about the third bullet point\nwho wants to start?\nAnybody have any comments on reconsidering the issue\nof veto power?\nI think that's the not so easy one.\nI had a lengthy response on that one\nif you'd prefer I started.\nIf you want to summarize your thoughts, go ahead.\nI think in conjunction with the staff,\nwe tried really hard to modify this window where it was a,\nhopefully a simple recommendation that could be adopted,\nthat was broad enough it could be adopted.\nWith regard to the veto power,\nwe feel like primarily the thing to look at\nis that the consideration of a holdout city\nwas addressed in the current legislation.\nAnd I think I've cited the statute there.\nI don't want to try and recite those off the top of my head.\nBut we definitely can understand the discrepancy\nthat a small city trying to take captive everyone else\ncould be an issue, but there is already a statute\nthat says if it's a small city,\nwell they are still able to hold out,\nthey're not forced to provide the service,\nbut that doesn't cause penalties against the county\nor the other cities that bought it.\nWe see a lot of wise decision making\nand how that's already drafted\nand don't see the reason to alter that.\nWith regard to, you know, coming to an agreement,\nAnd we also see some wisdom in the required signatories as they're currently drafted.\nIt's literally, if you look at the statute, I mean, it's just a chart of 1, 2, 3, 4.\nThese folks can rattle that off the top of their head.\nI'm not that eloquent.\nBut we don't see a lot of reason to alter that format either with regard to establishing\na new veto power versus what's the current signature perspective.\nI think that's a good high level for where we are at the moment.\nSo if I'm right, you would prefer just to remove that recommendation from the list.\nThat's right.\nYeah, that's right.\nWe just think that the current plan with regard to preserving any chance of the county\ngetting harmed by a small city being a holdout has already been dealt with.\nAnd we think the current plan of required signatures under this four level process, we think\nthat's appropriate.\nWe don't see a reason to try and modify those.\nOkay.\nAll right.\nAnybody want to respond with thoughts?\nDo you have thoughts on this one, Commissioner?\nDockery?\nYeah, Mr. Chairman, if I may.\nMary, you said there was a process in place\nby which a smaller city could not hold\nall the other parties hostage.\nCan somebody smarter than me explain what that process would be?\nDoes it go based on population?\nHow does that county see?\nLarry, I don't know if you want to address it, but for me, a good example would be I'll\npick on Franklin County where I was county manager.\nThe county seat was one of the smaller cities, population wise, in the city as far as the\ncounty, and if you don't have that signature from the county seat, you basically can hold\nThe agreement is my understanding.\nI think that's right, Mr. Chairman.\nLarry Ramsey with ACCG.\nSo the existing law that Mayor Ward is talking about lists\nwhat local governments have to sign off\nfor a service delivery strategy to be submitted to DCA.\nThat's the county, the city that serves as the county seat.\nMr. Chairman, again, was saying any other city\nthat has at least 9,000 population,\nthan at least half of the cities\nthat are within between 500 people and 9,000 people.\nSo, in effect, what that means,\nif you have a city that's less than 500 people,\nthey don't get a vote, they can't hold it up.\nAnd then some number, if you have multiple cities\nbetween 500 and 9,000, only half of them have to sign off.\nSo there could be some that or don't have a vote\nthat could hold it up in that category,\nbut of course that will vary county by county,\ndepending on what the city makeup is.\nAll right, Mayor Ward, on page two of five in the report, I put together the last sentence\nof the second to last paragraph, OCGA 367027B1, when I went, what I did, and when I got\nyou all's report, as I reread the entire act, just to try and make sure I was fresh on\nwhat we were thinking and where it could apply. And that's where this one already does\nas mitigated against sanctions against the county\nand any other municipality located in such county\nand the circumstances of a hold up by a city\nof less than 500 people.\nWe felt like that's a good, good statute there.\nMr. Chairman, if I may,\nwhen this was brought up in Brazlton,\nI can't remember who brought this issue up,\nbut I was thinking that it might have been\nsomebody representing a municipality\nthat brought this up, I don't have strong feelings\none way or another because I think it could affect\nmunicipalities equally as counties.\nAnd if it's something that is not that important\nor beneficial to include, then I'm okay with it.\nTaking it out.\nSo, the idea is, on the table to remove it, is this, what does the committee think about,\nyou know, part of the purpose here is to put some processes in place that encourage\ndispute resolution.\nIs taking this out, going to soften that, or is it going to be another barrier to come\ninto a resolution to encourage these disagreements to linger?\nWith respect to the GMA side of this, I feel like what we're also looking to incorporate\nis going to be maybe more effective and more appropriate.\nI do think the encouragement towards sanctions and the encouragement towards better procedures\nfor sanctions, so maybe we don't make a decision on this third bullet point at the moment,\nWe wait to see how we discuss the others and feel of those would be the right process when we come back\nYeah, I do do believe that the fifth bullet point about the sanctions may\nIt's gonna gravitate this. That's right. Yes, sir\nAll right\nSo we'll move on to the fourth bullet point which states further consideration\nUse of arbitration versus mediation in the case of disputes and whether both or neither should be binding\nAny comments there?\nI think Chair Dockerick should lead on this.\nI tried to lean into his comments more so in mind to make sure we felt that way.\nAll right.\nChairman Docker.\nSo, I think it all goes back to home rule.\nYou know, I was involved in lost negotiations and baseball arbitration and we all know\nwhat the court ruled as it related to the baseball arbitration. I'm not sure that you can\nhave binding mediation. I'm not sure what that looks like. I think mediation should be\nencouraged as a first step. And then I think arbitration is a good method of resolution\nas long as both parties agree to go into arbitration. So, you know, if you just establish the\nrecommended process I think that's what should be done. I'm not so sure that\nthe binding should be included. You know again I think it all goes back to\nhome rule and I can't remember who said it in Brousalton but you know your\nlocal officials are elected to do these things and when you take a decision\nout of the hands of the local officials and you put it into some special panel that's\nmade up of people outside your community. I'm not so sure that that's what our constituents\nare expecting us to do. So I'm not in favor of that panel or any binding arbitration.\nI think arbitration should be encouraged, mediation, and then arbitration, but I'm not\nin favor of any binding arbitration by an independent third party that's appointed\nby somebody other than the people that should be held accountable in those communities.\nGo ahead.\nIf I may, Chair, I think we actually have some common ground here as a person who deals\nwith, there's a bunch of words here, let's get the word solid correctly if we will, alternative\ndispute resolution or ADR kind of begins on the spectrum of mediation and then it goes\nup to arbitration and then it would go to binding arbitration. That's kind of the three\nlayer spectrum, if you will, of alternative dispute resolution. I think the current\nstatute incorporates mediation as a mandatory role and I think the consequence of that mediation\nhas not been harsh enough if we're going to get into the consequences discussion.\nAnd is that where you believe the next bullet point would address?\nWell, I think this in this article, this number four bullet point is going to lend itself.\nWhat I personally see is that we can use this role of what Chairman Docker just said\nwas, hey, not binding arbitration, but arbitration.\nI think that's a common ground we could look at.\nthat's a ratcheting up of consequences to just help further that beginning\nillustration and hopefully not to go too long. Mediation, yeah, I have failed\nmediations, right? I sit down with my clients. They're not going to come to a\nresolution. They're not going to settle the case for less than what they want.\nSo the whole process is a failure. It's all under a confidentiality perspective\nand you walk away. An arbitration is where a neutral third party is going to\nactually issue a decision, and that decision could be made public. And that's where maybe\nit's not binding on the parties, but we think that could be another layer of accountability\nand consequence if we want to look at arbitration versus just the mediation angle that's currently\nin the statute. Does that make sense to you and how I see that as a consequence?\nI think so, yep.\nSo that's where the two roles of this that we feel like on the GMA side that I believe\nwe've talked about, I'm not looking at my colleagues enough to get nodding heads, I should probably\ndo that. There's a lot of heads over there, I'm not sure if they're all looking down or\nlooking at me. They're looking at each other.\nYeah, like, put this guy up there, right? But I think if we were to look at arbitration\nto make a recommendation to increase the ADR option from mediation to arbitration, and\nAnd then to also consider this closed record discussion that was mutually, I think, offered\nby the ACCG and GMA panel, and that I feel very strongly about to say that it does expedite\nresolution.\nWhen you close down the number of arguments, just think of it as a criminal prosecution,\nright?\nThis is the one that's the easiest way to understand.\nIf you're accused of a crime, the prosecution's got to tell you everything that they're going\nto charge you with, and all the evidence they have, and you know what that does?\nThat gets 99% of cases settled that people take a plea agreement.\nBecause everybody understands what's going to be on the table and what's going to be\ndealt with in front of the judge and what the arguments are going to be.\nAnd then they coppably deal or they go and fight it, right?\nBut you see the percentages from my colleagues that are in the prosecution side.\nSo I really feel like the close record component, I would again encourage that and encourage\nit along the arbitration level may be more so than the mediation level.\nAll right. So, you know, I know you're, you know,\nmore aligned with with GMA and\nChairman Dockery, more aligned with ACCG,\nalthough not necessarily speaking officially for either one, and that's why\nI'd love, you know,\nat the proper time for both associations to let us know what they\nWhat they're what their official position is on this and\nCommissioner, do you have anything to add to Mayor Ward's comments?\nI think I think like Mayor Ward said there's some some common ground there and if you go to the next bullet point five\nYou know if there's consequences for not reaching an agreement that goes right in line. I'm just not so sure that\nbinding\nis the last and final step.\nSo, I mean, if you have a mediation and arbitration,\nI do like the idea of disclosing your arguments,\nyour closed record as you call it,\ndisclosing everything that you're going to present,\nso that you don't have new things popping up\nthat I've been through that, that's ugly.\nIt kind of galvanizes both sides when you do that.\nSo, I would be in agreement with that,\nit's just the whole binding part.\nI don't think I can support.\nAll right.\nWell, let's talk about that fifth bullet point.\nThe clear definitions for sanctions\nwith counsel to review the current legal viability\nof withholding loss slash loss funds from non-compliance\nwith SDS renewal.\nNew a previous version of this maybe\nwent as far to talk about a time frame, maybe six months,\nup to six month, the bayents.\nBut after that, the consequences sink in.\nI'd like to hear some comments on this one.\nBecause I think this is where we're actually\ngetting into forcing the parties to make a decision.\nAnd to come to some agreement.\nI mean, this is when citizens will\nstart to feel it and notice it.\nYeah, and that let's let Chairman Dockery speak first.\nYou always want me to go first.\nI agree, but I think it needs to be a timeline.\nAnd I think that that vice needs to tighten.\nYou're not going to drop a hammer to start with.\nSo those sanctions, if you will, would be graduated.\nSo, you know, as you go through your mediation,\nyour arbitration, the results of the arbitration may public.\nAnd then you start losing some of your funding\nor your status, your ability for funding.\nBut then I think if that is a graduate\nand know what that actually looks like,\nit's probably gonna take somebody smarter than me.\nBut there has to be consequences.\nAt the end of the day, there has to be consequences.\nThese things that go on for seven years\nor crazy.\nSo I think if there's consequences\nand it's very well laid out up front,\nthen I think that gets the parties to the table.\nWhen you start having more to lose than you have to gain,\nI think if I can steal some of my lawyer talk\nand you go back and talk about Bacaria,\nthe punishment has to outweigh the benefits of the crime.\nIs that right, Mr. Mayor?\nSo when you go back and look at that,\nI think that the punishment or the consequences have to outweigh what you're gaining by holding\nout.\nThat's the only way it's going to work.\nBut it needs to be graduated from my thoughts.\nYou got to agree with that here, I think.\nThe way ours has drafted, if you were to look at the statute, 367025.1, D2, this is discussed\non page 5 of 5 of my report.\nBut again, D2 is where the statute currently allows the court to hold that, those sanctions\nand abayants, and the way that I redrafted the proposed recommendation on page two with\nregard to this is just to say that further consideration on imposing sanctions at staggered\nlevels and intervals, which I think Chairman Docry is talking about a spectrum of how to\ndo that.\nYou know, the illustration I give in my discussion on this is kind of start with removing radar permits and then as it ratchets up.\nAnd I would be extremely naive and inappropriate to say what those levels should be and what those penalty should be at what level.\nBut I do think that's where your thought of saying, hey, ACCCGMA, we really want a firm list on this.\nI think we're all in agreement as a committee that they would want to do that and to further\ncomment outside on a previous meeting that if you say arbitration is going to take six\nmonths to do, will it maybe allow them to be held in a balance if you're participating\nin arbitration for those, but after that arbitration, the material, the consequence kicks\nI personally like that one, I think that that's the one that's going to get things moving.\nAll right, so I think what we want to do is hear from GMA and ACCG on more specifics\non the graduated sanctions.\nAll right, the last bullet, granting rulemaking authority to DCA.\nI think the mayor is there now.\nSir, we didn't have any strong comments about the recommendation.\nI think it's a simple statement.\nI would like to keep this at the lowest level for everybody's opinion as much as we can.\nAnd I'm fantastic, and I'm already at the end of the course.\nBoth the seats and the seats go ahead, I think.\nSo that's it.\nThat's Chair McIntyre.\nSo we have a given that.\nGiving it a blind check.\nI can feel a little.\nPlease come right here.\nThank you.\nChair McIntyre, again.\nThank you.\nOne of the things, and you know, it's come up,\nand this happens in our legislative process.\nWe have a lot of different boards and associations in the state.\nand DCA being one of those. If they're looking at a rule-making and rule-changing situation,\nthen part of that, they have to notify the legislature and the correct committee in the legislature\nthat that rule change is subject to take place. That gives the legislature an ability to\nput that, if the appropriate committee objects to that, they can pull it back.\nit back. So there's one of the things that there is a check and balance on that. We give\nthem rulemaking authority, there's still a string attached that we can reel them back\nin if it gets too far off note. And I think that's important to know what we do with\nour different boards and authorities across the state.\nSo not to put anybody on the spot too much, but the GCN in the room is that something\nthat you feel like, you know, some limited rule-making authority is something that would work for you.\nAll right. So we've gone through the six bullets and it looks like some are pretty easy to agree on\nand others are going to need a little bit more, I think, meeting of the minds between the stakeholders.\nChairman, again, and I feel like December 15th is a reasonable time to, you know, allow\nthe parties to meet and get back with us on, you know, just tell us out of these recommendations\nwhich ones can you agree on and which ones do you not agree on? What's your position\non each of these? And if you want to get a little more specific in some of them, I'm okay\nwith that too.\nMr. Chairman, can I make one last comment on number six and I'm just going to read my bullet\npoint to verbatim because I think the Department of Community Affairs does a great job for\nlocal governments, both municipalities and counties in the state of Georgia.\nBut I'll just read that bullet point.\nI think that sums it up says DCA should be a neutral state agency that's not subject to\nspecial interest or political pressure from either side without specifying the rule-making\nauthority, it will put this agency in a very precarious position of potentially being\ninfluenced by special interest organizations.\nThis holds true in selecting panels by DCA as well.\nSo even just those panels that DCA selects, you know, I think it would be very naive\nto think that there wasn't some political posturing as to who's going to serve on those\npanels.\nSo, I think that, again, that needs to be very limited and with that.\nAll right. Mayor Ward.\nIn the directive you're giving by the December 15th deadline,\nis that directive to say that the two agencies need to agree on the terminology that you all propose,\nor if they take the model you propose and agree on their own terminology to\ncome back to you, is there flexibility for them to do that?\nYeah, I don't think we want to limit any more ideas from coming to the table.\nI do believe we want to use these six bullet points as somewhat of a framework\nfor the discussion.\nBut if the ideas that are discussed expand beyond this, I'm okay with that.\nI think Chairman again is, we think we've narrowed it down pretty well in these six bullet\npoints, but again, if you need to massage those or expand some, I think that's good if\nit brings solutions.\nBut the main thing is, and I realize, you know, this is going to get debated heavily during\nlegislative process. I just think it's helpful to have, especially since these two associations\nasked for this study committee, I just think it's appropriate that they, you know, honor\nthat. All of our time that we've spent, you know, a lot of us hundreds of miles coming\nto these meetings and a lot of time. And so I just think it's the thing to do, to get\nthem to to state their position on these and hopefully they can come to agreement on\nalmost. So the committee feel comfortable with that and also don't want to diminish\nthe voice of the committee members. You know the recommendations that have been brought to us\nand the expertise is invaluable, and has got us to where we are now, and I just think\nthis is that last step that we need for the...\nWhat you're asking for in our role is your want to consolidate into trial order before...\nYou're want to consolidate and pre-trial order before we go into the session, right?\nI think that's a very fair request.\nYou know, I don't know the legal term, but it sounds good.\nRight.\nRight.\nAnd so, if there's no other discussion from the committee, and seriously, I appreciate\nyou know, everybody's time and consideration.\nI think we've narrowed things down pretty well.\nAnd if ACCG and GMA could help us finish this, I think everybody will be grateful for that.\nAnd going into session, we'll have some good solutions to work off of.\nOtherwise, I think this just game and ship just continues indefinitely.\nSo alright, well if there's no other discussion, preach everybody coming today and we'll\nbe adjourned.\nAlright, thank you.\n",
  "updated_at": "2026-02-12T01:45:09.943223+00:00"
}