{
  "video_id": "1UjmmAbD5mo",
  "url": "https://youtu.be/1UjmmAbD5mo?t=187",
  "title": "Georgia House - Day 12 (2026-02-05)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 12,
  "video_date": "2026-02-05",
  "duration_minutes": 79,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n**Overview**:\nThe session included a morning prayer by Pastor Chris Gaffey, who spoke about the faith and leadership of George Washington. No substantive legislation was discussed.\n\n**Bills Introduced (First Reading)**:\nNone detected\n\n**Notable Moments**:\n- Pastor Chris Gaffey was introduced by Rep. Gerald Green and gave a speech about George Washington's faith and leadership.\n- Rep. Prince told Gaffey to ignore the time limits on his remarks.\n\n**Votes**:\nNo recorded votes\n\n**Attendance**:\nThe Speaker called all members to the floor for the morning roll call.\n\n**Adjournment**:\nThe transcript does not indicate when the session was adjourned or the date of the next session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nGood morning, all members will please come to the floor, all members please come to the floor and take your seats please.\nMr. Clerk, will you ring the bell?\nAll members, please come to the floor.\nThe hour for convening having arrived, all members, will please come to the floor and take their seats.\nMorning.\nWe're going to have the morning roll call, all members present will please vote\ngrain to signify their presence in the chamber and Mr. Clerk will you unlock the machines.\nAll members voted, have all members voted, if so, Mr. Clerk, will you lock the machines?\nDoer keepers, will you please close the doors and keep them closed?\nDoer keepers, will you please close the doors?\nThank you, Chairman Warkhizer.\nWe'll up your pay for the day since you were keeper and representative.\nAs is our custom, we will begin our day with Scripture reading and prayer by our Chaplain,\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning is brought to us by the Dean of this House, the German from\nthe 154th House District, German Gerald Green, German Green.\nThank you, Miss Speaker, for this opportunity to introduce the pastor from Southwest Georgia.\nAnd thank you, Mr. Speaker, for your leadership in the school's safety initiative, fire students,\nour schools and the state of Georgia.\nMy constituents appreciate that.\nColleagues, it is my pleasure to introduce Pastor Chris Gaffey.\nHe's not my every Sunday pastor, but he is praying for me and he is praying for you as we\ndo the business of the state and before I tell you about Chris I would like to\nintroduce his lovely wife Kelly if you'll stand a dear friend of mine Dr. Garrett\nBennett and his lovely wife Diana I'm covered in two ways today the pastor here\nand Dr. Garrett and so if any of you are feeling sick, let us know.\nThis individual that is about to come and speak to you, I first learned about at a retired\nteacher's meeting.\nHe was speaking before I was and he spoke and I thought that's the man I want the Georgia\nGeneral Assembly to hear. And so we find that he was gracious enough to say, yeah, I'll\ncome. And this individual has three children, Isaiah, Zaria, and appropriate enough Georgia.\nHe's well educated. He has had some masters of divinity from theological seminary. He\nHe works, he's worked in Missouri for 15 years as a pastor there, but now he is the senior\npastor at the First Baptist Church in Blakely, Georgia.\nAnd I found that he is doing the Lord's work throughout not only our area, but throughout\nthe world.\nI learned very quickly that he is a board member of other most international, which provides\nK through 12 education for 1600 students for free in India.\nHe's really working to make sure that the Gospel is spread.\nHe is the author of winding road of problems and currently working on another book, The People of Paul.\nLadies and gentlemen, please welcome my good friend, my new pastor, Chris Gaffey.\nChris Gaffey.\nWell thank you Mr. Speaker, Representative Green, it is a privilege to address this honorable\nbody.\nI was going to tell a joke, but I have learned, however, that since being invited on this privilege\nthat there are a lot of rules.\nI was told that I had to be here on time, which I failed to dress properly, which I hope\nI succeeded in, and that I was not allowed to make any comments about politics.\nAnd no more was I allowed to make any jokes.\nThat was my brides' rules, and then came the speakers' rules.\nThe speakers office informed me that I had to keep my remarks to approximately five minutes\nthat asking a Baptist preacher to do that is about like asking Auburn football to beat\nthe mighty Georgia Bulldogs.\nIt is not going to happen anytime soon\nand the best we can do is hope to run out the clock.\nRight before I came up,\nRepresentative Prince came up and told me\nto ignore those rules and take as long as I wanted.\nI knew there had to be one righteous politician in Georgia.\nI'll do my best to abide by those rules however\nAnd so let me get to the task at hand\ninto the 250 years of our nation's history.\nThere have been a number of similar moments.\nMoments that were so important that they required\nconsequential leaders.\nLeaders of unparalleled character, skill, and ability,\nand as a nation, I think we would all agree\nfrom every political strive that we have been blessed\nover these many years.\nThe list of leaders is long, but perhaps the most\ninfluential and important is a man whose birthday we celebrate this month, the very first president\nof the United States, Mr. George Washington. He was born on February 22, 1732 in the colony\nof Virginia, and so that means that this nation was always his home. At age 22, he literally\nstarted a world war as he was the commander of the Virginia forces in the French and Indian\nWar. At the birth of the American Revolution in 1775, you know that he was tasked with\nthe responsibility of leading a Ragtag Army of Rebellion against the most powerful nation\nin the world. Name Commander-in-Chief of the Continental Army, his task was impossible.\nHe had to take untrained, albeit passionate men into battle, without the proper ammunition,\nsupplies, or even the proper clothing. He marched them against the British Army, suffering\nboth victories and defeats, and when Troop Morale reached its lowest moments, he was\nsingularly responsible for doing whatever was necessary to maintain the fight.\nWhen independence was finally won, he would be given an even greater challenge.\nHe was given the responsibility of bringing politicians together in harmony.\nHe was named the President of the Constitutional Convention, and when it was time for a new\nnation to elect its first President, Washington was named the man for the job.\nIn retrospect, we can barely fathom how daunting a task it must have been for him.\nHe not only had to govern without much direction, but he was also setting precedent for our\nfuture leaders and presidents about how this new nation would be governed and led.\nIn the history of Americans, he stands with great distinction.\nHe was a leader of men, he was the general of an army, he was the president of a new nation,\nand he was the leader of a new and freer and more prosperous world.\nAnd we imagine him, we think of a larger than life figure.\nIn fact, he was a man who was unafraid of anything, willing to take on any challenge,\na warrior, a hero.\nIn my life, he was the Chuck Norris of our politicians.\nAs much as we know about his service to this nation, we also know that he was a man of\ngreat faith.\nHe was raised to Anglican.\nWashington became something of a Christian wanderer in the years to come.\nIn his lifetime, he would join a host of churches and denominations, including the Presbyterians,\nthe Quakers, the Roman Catholic, the Congregationalists, even the Baptist for a season, and eventually\nthe Dutch reformed churches.\nSomewhere along the way, in Mr. Washington's life, the Gospel of Jesus Christ penetrated\nhis heart.\nI want you to listen briefly to a short prayer that he wrote at the end of his life.\nHe said, oh eternal and everlasting God, I presume to present myself this morning before\nthat divine majesty, besieging thee to accept of my humble and hearty thanks, that it\nhath pleased thy great goodness to keep and preserve me the night past.\nFrom all the dangers poor mortals are subject to, and has given me sweet and pleasant sleep,\nwhereby I find my body refreshed and comforted, for performing the duties of this day, in\nwhich I would besiege thee to defend me from all the perils of body and soul.\nThis my faith and the sweet promises of the gospel, give me repentance from dead works, pardon\nmy wanderings, direct my thoughts unto thyself, the God of my salvation.\nTeach me how to live in thy fear, to labor in thy service, and ever to run in the ways\nof thy commandments, make me always watchful over my heart, that neither the tears of conscience\nthe loathing of holy duties, the love of sin, nor an unwillingness to depart this life,\nThey cast me into a spiritual slumber, but daily framed me more and more into the likeness\nof thy son Jesus Christ, that living in thy fear and dying in thy favor, I may in the\nappointed time attain the resurrection of the just unto eternal life.\nAnd then he concluded, bless my family, my friends, and my kindred.\nIn that prayer, General Washington, we find not a warrior, not a general, and not a hero.\nIn that prayer, instead we find a simple and humble man who loved his God, sought God's\nfavor, and prayed for his nation, his family, and his friends.\nIn Micah 6 and verse 6, the prophet of old asked a question, he asked, what should I bring\nbefore the Lord when I come to bow before God on high?\nI think that is an important question.\nIt's a question that I believe all of mankind must answer in their life.\nWhat is it that God requires of me?\ndoes God want? Should I gain the great privilege of entering the presence of the\nan Almighty God whose person, nature and majesty, shutter the very foundations of\nthe world itself? What would this divine demand of me? Luckily God answered\nthrough the prophet. He writes in verse 8, mankind, he has told each of you what\nis good and what it is that the Lord requires of you to act justly to love\nfaithfulness and to walk humbly with your God. What would God ask of this\ndeliberative body on February the 5th, 2025? He would ask of you what he\nask of all men and women that you love and seek faithfulness in Jesus Christ,\nthat you act justly and that you walk with humility before a holy God. That is my\nprayer for you this morning. Would you stand and bow your heads and join me in\nprayer. Good and sovereign God, maker of heaven and earth, father of our Lord Jesus Christ,\nwe come before you in this appointed hour to seek your help. By your grace, you have\nsustained us through life and adversity, you have seen it appropriate to place us in these\nhollowed halls and to legislate in this great state. Our decisions and our attitudes\naffect our homes, our families, our friends, and many that we do not know.\nSuch a task is great and terrifying, and we are wholly unable to be faithful without\nyour good guidance.\nAnd so therefore in this hour we come humbly before you and seek your good assistance.\nWe ask for your spirit to give us insight, your word to instruct our wisdom, and your\nprecepts to be our guiding star.\nus into a better future, a greater faith, and a more glorious hope. Protect our nation,\nour families, and our friends, these things we ask in the name of our Blessed Savior, Jesus\nChrist, amen. Would you remain standing and join me in the pledge of allegiance?\nI pledge allegiance to the flag of the United States of America and to the Republic for\nfor which it stands, one nation under God, indivisible, with liberty and justice for all.\nThank you very much.\nAppreciate it, brother.\nThe doorkeepers, you may unlock the doors, members.\nYou can join Brother Chris in the south any room to thank him for his message today.\nAnd take a photo if you like with him.\nBrother Chris, thank you for the message.\nHey, great history lesson as well too.\nThanks for that on our first president, George Washington.\nWhat a wonderful man.\nThank you.\nThe\nThe doctor of the day is from representative Debra Silcox's district, Dr. John Gleason.\nIf anyone has any medical needs, he'll be down in the nurses station.\nThe chair recognizes Chairman Hilton.\nPlease take your conversations to the back of the chamber or to the anning room.\nThe chairman of information and audits will now give the report of the committee.\nThank you, Madam Speaker.\nYour committee on information and audits has read the journal the previous day and found it to be correct.\nChairman Hilton, the chair of committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nThe chair here is none the reading of the journals dispensed with is there any objection to the confirmation of the journal the chair here is none and the journal is confirmed\nThe clerk will read the resolution establishing the order the business of the day\nRepresentative association 104th loose follow-by establishes the ordered business during the first part of the period unanimous consensus\nIntroduction of bills and resolutions first reading and reference of house bills and resolutions\nsecond reading of bills and resolutions, reports of standing committees,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of the business for the day?\nThe chair here is now in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHospital 226 by resident.\nMathis, the 133rd of building title and act to amend and act to provide a new charter for the city of Cochrane.\nIntergovernmental Coordination House Bill 227 by reps of Dickey the hundred and thirty four threes and ninety nine prints the hundred and thirty second\nHagen 156 throats of the hundred and twenty-fourth\nBill B. Todd on act to men various provisions the official code of Georgia annotated. So it was renamed low T. H. C. oil\nHealth\nHouse Bill 228 by reps and a horneter of the third Ridley the six cannon to the hundred and seventy second Ridley the twenty second\nCox, the 28th and others,\nBill B. Toddled, act to amend chapter two,\na total 26 of the physical to Georgia annotated,\nrelating to standards,\nlabor, and adulteration of food.\nAgriculture House Bill 229,\nby resident of Neil of the 79th,\nDoug was the 78th,\nApollo 33rd,\nTarvern of the 2nd,\nSkoggins, the 14th and others,\nBill B. Toddled,\nact to amend Code Section 4883,\nthe physical to Georgia annotated,\nrelating to exemptions from sales and use taxes.\nWays and means House Bill 230,\nby reps of Neil the 79th Wasper in the 144th.\nSee all the 34th and Williams the 148th will be\ntaught an act of men chapter seven and\ntitle 40 80 the fish go to Georgia annotated\nrelating income taxes ways in means hospital 231 by\nresident of Neil the 79th hour of the 50th\ncannon and the 58th will be taught an act of\nmen chapter 24 title 33 the fish go to\nGeorgia and it's ended relating the insurance\ngenerally insurance hospital 232 by\nof silk cocks of the 53rd Hawkins, the 27th\npile of the 33rd.\nBill B. Todd, an act to amend chapter 24A,\na total 43 of the Fist Dakota, Georgia,\nannotated related massage therapy practice.\nRegulated industries.\nHouse Bill 233, Barbara,\nso thousands of the 179 to Lodge on 67\nstains to the 180th,\nfor cheddar the 176.\nHagen to the 156 and others.\nBill B. Todd, an act to amend hour three,\nchapter three, a total 50 of the Fist Dakota,\nGeorgia, annotated relating to other states,\nsymbols. Special roles. House Bill 234 by reps of tiles in the\n179th. The hood of the 175th. Jocos on 51st. Crow with 118th. Hagen\nand the 156 and others. They'll be titled act to amend chapter 7\nto title 4080. The fish put George annotated relating to\nincome taxes. Ways and means. House Bill 235 by reps of\ntiles in the 179th. Follow 33rd Jones the 25th Newton on 27th.\nHefner the 130th and others. They'll be titled act to amend\nan article on the chapter one entitled 20 of the official go to Georgia\nannotated relating to general provisions relative to education.\nEducation House will 236 by ribs of Skoggins of the 14th and Gamble 15th\nbuilt to be entitled the NAC to abolish the office of elected county\nsurveyor.\nIntergovernmental coordination House will 237 by ribs of carpenter of the\nfourth Kelly the 16th Bell of the 75th Smith of the 18th fry the 120\nSecond, Bill B. Todd on act to amend chapter four,\ntitle 24 of the fiscal to George annotated relating the relevant evidence and\nits limits.\nJudiciary non-seval.\nHouse Bill 238 by reps and elapsed into the 12th Crow, the 118th Hedgians,\n1161th, concerted the 8th and McDonald, the 3rd of the 26th.\nBill B. Todd on act to amend chapter 8 of title 35 of the fiscal to George\nannotated relating the employment and training of police officers.\nPublic safety.\nHouse will 239 by Ripson of Corbett of the 174 C ball of the 34th Crow of the\n118th Huddleston the 72nd MacDonald of the 3rd of the 26th the bill being\ntied up back to a mental 40 the Fisher go to Georgia annotated relating the\nmotor vehicles and traffic motor be hit across House will 240 by Ripson of\nWilliams on and 48th Ridley the 6th Rose on and 24th Douglas is 78th Hilton\nthe 48th and others bill be tied on an act of N Part 2 of Article 15 to\nChapter 1 and Title 10 and Article 13, Chapter 1 and Title 7 of the Efficient Court of Georgia, annotated relating to the Fair Business Practices Act.\nThanks and banking.\nHouse Bill 241 by reps and it rose to 124th Williams, 1148, Douglas 78, Chastain, and the 7th Barrett of the 24th and others.\nBill B. Title 9 to amend Chapter 1 and Title 13 in the Efficient Court of Georgia, annotated relating the general provisions regarding contracts.\nBanks and banking House will 242 bar rows of silk ox and 53rd Smith of the 183s and 9.9\nCampbell the 171st panace of the 51st building title and act to amend code section 1611 34.2\nThe fish go to Jordan and Tated relating to disorderly or disruptive count\nJudiciary non-sevel House will 243 bar rows of Mitchell the 88th Oliver the 84th more of the 91st Kendrick\nto the 95th, welcome to the 101st and others.\nBill B. Todd, an act to amend part four of our six,\nchapter three, a total 12 of the physical to Georgia annotated\nrelating the Stone Mountain Memorial Association.\nGovernor Mellon pairs.\nHouse bill 244 by ropes of can in the hundred and seventy second,\nyear to the hundred and fifty second.\nGreen in the hundred and fifty four, Jackson, the hundred and twenty-eighth\nand Hagan in the hundred and fifty-sixth.\nBill B. Todd, an act to amend code section 36, 81, seven of the physical\nGeorgia Annotated Relaying the Audit of Financial Affairs and Transactions.\nGovernor Mellon-Faires.\nHouse Bill 245, Arboros and O'Lalley A to the 59th, Smith to the 18th, plays the 67th,\nHoward to the 129th, Green to the 154th and others.\nHe'll be titled an act to amend Article 6 of Chapter 2 of Title 20 of the Official Code\nof Georgia Annotated Relaying the Quality Basic Education Act.\nEducation.\nHouse Bill 246, by reference to the gains to the 120th, Crow to the 118th, Green to the\n154th, Irwin and the 32nd Mathis, the 133rd and others will be taught on\nan act of men code section 15, 16, 1 in chapter 8, it's out of 35, the\nfish quota Georgia annotated relating the qualifications requirement for\nsheriffs. Public safety. House Bill 247 by Roves and Apollo 33,\nCrow with 118 chastras of the 11th, Ridley the 6th, Corbin of the\n174th and others will be taught on act of men article 4, chapter 5, a\nTitle 40, the fish go to Georgia\nannotated relating the restoration of licenses.\nMotor vehicles, household 248,\nour residents of Jasper City 11,\nKelly, the 16th pile of the 33rd\nWilliams on 48th of camp of the 135th.\nThere'll be title and active in Chapter 7,\nTitle 40 80, the fish go to Georgia\nannotated relating income taxes.\nWays it means hospital 249,\nour residents of Dickey, the 134th,\nAnderson to the 10th.\nHuddleston, the 72nd turn of the 85th\nCampbell, 171st.\nBill B. Todd, an act of men article in chapter three,\ntitle 46 of the Fiskota,\nGeorge Antietta, Relay and the Generation\nand Distribution of Electricity.\nNatural resources.\nHospital 250, by the reps of Taylor,\naround on 73rd.\nJocos, 151st Jones, the 25th Williams,\non 48th.\nMartin of 49th.\nBill B. Todd, an act of men's.\nToddles, 33 and 34 of the Fiskota,\nGeorgia and Tate were leading the insurance and labor and industrial relations small business development\nHouse bill 251\nByrebs and a McDonald third of the 26th hatched to the hundred and fifty fifth probably thirty third\nChocas 150 first and Gunner the eighth and others\nBill B. Todd will act to amend chapter 26 and title 43 the fish go to Georgia and Tate relating to nurses\nRegulated industries house will 252 by reps and Smith the 70th and bottom to 73rd\nwill be taught a lack to provide a homestead exception from city and noon and\nadded to alarm taxes. Intergovernmental coordination. House will 253 by\nreps on the park. The 100th gains the 120th Jones the 25th Evans the 57th\nKelly the 16th and others will be taught an act to amend chapter 11 and\ntitle 15 in Article 1 of chapter 9 and title 19 of the official code of\nGeorgia annotated really in the juvenile code and general provisions\nrelative to child custody.\nDid you just share it, Juvenile?\nHouse will 254 by Roads and a buckner of the 137th green\nand 154th, Hagen on 156 camp of the 135th,\nDempsey the 13th.\nHe'll be taught an act of men chapter three,\nhe taught a 50, the fish go to Georgia,\nannotated relating to state flag.\nState properties?\nHouse will 255 by Roads and a McLean to the 109th,\nPrince the 130th second.\nAlexander the 66 Taylor the 92nd Jackson the 128th\nhe'll be taught on act to amend code section 42\n86 of the official go to Georgia annotated\nrelaying the special license plates.\nMotor vehicles hospital 256 by reps and a weed hour\na hundred twenty first goal of the 19th\nadministration 104th clipped into the 131st\nhatchet of the 150 fifth and others\nwill be taught an act to amend chapter five\nof the top of 49 of the fish go to Georgia\nannotated relating the programs and protection\nto children.\nDid you just share a juvenile?\nHouse Bill 257 by Rebson.\nWilliamson of the 112th black one of the 146.\nKelly of the 16th Prince of the 32nd.\nHilton of the 48th and others.\nThey'll be taught on an actual men article,\n2A, chapter 2, a total 40 of the Fiskota,\nGeorgia, annotated relating to registration\nand licensing of fleet vehicles.\nMotor V. Hickles.\nHouse Bill 258 by Rebson.\nA buckner of the 137th.\nHolcomb of the 101st.\nYou believe the 141st, Mitchell the 88th,\nof the 94th and others, Bill B. Todd and Active Men, Chapter 4, Title 49 in the district\nof Georgia and Antietta, relating to public assistance.\nPublic and community health.\nHouse Bill 259, vice versa, Sharper, the 177th Apollo, the 33rd, Lumpson, the 12th,\nMitchell, the 88th, Incinth, the 150th and others.\nBill B. Todd and Active Men, Title 1 in the district of Georgia and Antietta, relating\nto General Provisions.\nSpecial rules.\nHousehold 260 by Robson of Rees, the 99th Blackburn, the 146 camp, the 135th out of 2G, the\n105th Silcox, the 53rd, and others, Bill Bitton, an act to a men part one of our 225,\na top 40, 80 in Fisherwood and Georgia, and it's ended relating to property tax exemptions.\nWays of means.\nHousehold 261 by Robson of Fry, the 122nd Campbell, the 35th Draper, the 90th Sanchez, the 42nd\nRoman of the 97th and others,\nBill B. Todd on active men chapter two,\ntitle 40, the Fisher quoted Georgia annotated,\nrelating the registry and licensing of motor vehicles.\nMotor vehicle, hospital 262 by resident,\nRoastine in the 169th,\nbirthed shadow of 176 and 171st,\ncorporate of the 174th,\nwe'll go to the 175th,\nBill B. Todd on active men,\nchapter two, title 31 of the fish,\ngo to Georgia annotated,\nrelating to the Department of Community Health.\nRole development.\nHouseball 263 by reps that have been in the 94th buckner of 137\nbetween in the 61st, hugely the 141st can in the 58th and others.\nThey'll be taught an act of men are the 7th chapter four title 49\nof the fish Dakota Georgia annotated related medical assistance general.\nPublic and community health.\nHouseball 264 by reps that have riddle the 2nd, riddle the 6th,\ncorner, the third Powell of the 30th, the third Tarvern of the second and\nothers, there'll be Todd on active men chapter 7 and Todd of 48, the fish go to\nGeorgia and attitted relating to income taxes.\nWays it means House will 265 by revs and saints of the 180th Cooper the\n45th Steven son of 64th and Townsend 179th, there'll be Todd on active men\nchapter 23 and Todd will to the fish go to Georgia and attitted the Georgia\nthe Hemp Farming Act.\nAgriculture.\nHouse Bill 266 by revenue.\nSaints of the 180th Bonner of the 73rd.\nClark of the 100th Gaines of the 120th.\nPetri of the 166th.\nWill it be Todd Electo?\nMen are due chapter seven.\nTodd of 48th.\nBishop of Georgia and it's ended\nrelating the imposition rate\ncompetition, exemptions and credits\nfor state income tax.\nWays and means.\nHouse Bill 267 by reps in a bottle of the 73rd.\nJones to the 47th.\nway to the 9th.\nAirheart of the 36th on the 2G, the 105th and others.\nBill B. Toddl and active men, various titles of the fish go to Georgia and it is the\npractice separate restrooms.\nEducation.\nHouse for 268 by ropes and a person earned the 119th, the frustration of 104th gains, the\n120th, burns 150th side, 159th, Irwin of the 32nd and others of Bill B. Toddl and active\nmen, chapter 2, total 20 of the fish go to Georgia and it's a really elementary and\nsecondary education.\nEducation House will 269 by reps of thousands of 179th made the act of the 82nd Stevens on the 64th year to the\n150 second camera to the first and others\nThere'll be Todd on active man chapter one of tidal 20 of the fish go to Georgia annotated relaying the early care and learning\nEducation House will 270 by reps and a reason 99th lever to the 123rd camp alone 35th silk ox of the 53rd Jenkins and 136 and others\nwill be taught on an act to men are seven chapter 10 of Title IX and the\nfish are going to draw to annotated relating to continuances to disherring\nHouse resolution 145 by reps of Irwin of the 32nd\nDuke Nick of the 29th jokers on 51st way to the 9th part of the 5th and\nothers resolution urging the Department of Education Department of Public\nHealth at the Collaborate education that completes first readers\nSecond reading a bills and resolutions to clerk will read House bill 217 by\nrepresentative Hong of the 103rd Martin of the 49th are one of the 32nd\nweight of the ninth and valid of the 147th the bill relating to the dual\nachievement program House bill 218 by representative Dempsey of the 13th\nHawkins of the 27th Cooper the 45th runner of the 85th Taylor the 173rd\nbill relating to vaccinations for influenza and hemococcal disease for a\ncertain discharge patients House bill 219 by represent Stevens of the 164th\nDavis of the 87th Clarke of the 100th, the bill relating to professions and businesses.\nHouse Bill 220 by Representative Montana, the 17th Carpenter of the 4th, Gunter of the 8th and\nNew of the 40th, the bill relating to kinds of insurance, limits of risk and re-insurance.\nHouse Bill 221 by Representative Canada of the 58th, Drener of the 85th, the Park of the\n107th Clarke of the 108th Barnes of the 86th, the bill relating to education.\nHouse Bill 222 by Representative Blackburn of the 146th, Williams of the 148th, Ballard of the\n147th, Jones of the hundred and forty-third illustration of the hundred and forty-fourth\nthat bill relating to bonds and reconnaissance in criminal proceedings.\nHouse Bill 223 by reps and presented the hundred and seventy-sixth illustration of the hundred\nand forty-fourth, McDonald's of the twenty-sixth, Hong of the one hundred and thirty-third\nGamble of the fifteenth and others that bill relating to revenue and taxation.\nHouse Bill 224 by reps and in bond of the seventy-third Blackburn of the one hundred and forty-six\nHitchens of the hundred and sixty-first Smith of the one hundred and thirty-eighths Sains\nof the hundred and eighty-th and others that bill relating to general provisions relative\nto highways, bridges, and ferries.\nHouse bill 225 by reps and washroom\nof the 144th Stevens of the 164th.\nLums of the 12th, year to the 150th second,\nMcLean of the 109th and others,\na bill relating to speed detection devices.\nHouse Resolution 128 by reps and dem see the 13th\npart of the fifth, Lums of the 12th.\nResolution comments saying,\nMr. Joseph Samuel Watkins.\nHouse Resolution 129 by reps and dem see the 13th,\npart of the fifth, Lums of the 12th.\nResolution comments saying, Mr. Darrell Lee Clark.\nHouse Resolution 130 by reps required for the 89th resolution, compensating Mr.\nCedric Moore, House Resolution 131 by reps in the park of the 107th Jackson of the 128th\nGriffin of the 149th Park of the 108th, Herring of the 145th and others.\nThe resolution expressing support for the creation of a national infrastructure bank.\nHouse Resolution 132 by reps in the 10 of the 17th corner of the third, really the 6th\nCameron of the 1st, and Chastain of the 7th Resolution creating the joint Georgia,\nNorth Carolina, and Georgia Tennessee boundary line commission.\nSenate Bill 16 by Senator Brass of the 6th, the bill relating to miscellaneous offenses concerning public officers and employees.\nSenate Resolution 7 by Senator Dullesall of the 27th, a resolution dedicating certain portions of the state highway system, through second readers.\nReports of standing committees to clerk will read.\nRepresentative hatchet of the 150th district chairman and committee on appropriations submitted\nthe following report was speaking to your committee on appropriations, as\nadded in our its consideration the following bill of the House, and it's\njust talked to me to report the same back to the House of the following\nrecommendation, House Bill 67, do pass by committee substitute, respectfully\nsubmitted, represented in patch into the 155th district, chairman.\nRepresentative Beth Camp, on the 135th district, chairman on committee on\nintergovernment coordination, local submitted the following report, Mr.\nSpeaker you committee on intergovernment coordination locals out on earth consideration the following bills in the house\nJust struck the media report same back to the house the following recommendations\nHouse will five do pass house will six do pass by substitute house will 13 do pass house will 32 do pass house will 33 do pass\nHouse will 39 do pass house will 160 do pass\nHouse will 174 do pass house will to 28 do pass house will 29 do pass house will 103 do pass\nrespectively submitted grumps and a Beth Campbell on 35th district chairman that completes the\nreading of the report to stand in committees.\nThird reading and passage of uncontested local bills, three bills on the local calendar\nThey're related to homestead exemption and require a recorded two-thirds roll call vote\nfor passage.\nThird reading and passage of uncontested local bills, if there's no objection, we will\nvote on the local calendar as a whole with the recorded vote.\nHearing none at us so ordered, the clerk will read the local calendar.\nHouse Bill, five by represent of Joe Campbell, 171st Decatur County, House Bill 6 by substitute\nby groups of Joe Campbell, 171st Mitchell County, House Bill 13 by groups of John\nCorbord of the 174th, Eccles County, House Bill 32 by Representative Charles Cannon of the\n172nd Cook County, House Bill 33 by Representative Cannon of the 172nd, Cook County, House Bill 39 by\nRepresentative Anderson of the 10th, Habersham County, House Bill 160 by Representative Smith\nof the 18th, Carroll County, House Bill 174 by Representative Ballard of the 147th City of\nthe centerville House will 28 by Rep. Kannon, the 170 second Colquit County, House will 29 by Rep. Kannon, the 170 second Colquit County, House will 103 by Rep. Smith of the 138th, Troop County.\nThe chair asks the clerk to ring the bell to alert members that we need a two-thirds vote on the local calendar because of three bills that are homestead exemptions.\nwith the clerk will ring.\nIs there an objection to the previous question being ordered on the local calendar?\nThe chair here is not in the previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bills. The chair here is now in the report of the committee has agreed to,\nshall these bills now pass. All those in favor of the passage of the bills on the local calendar,\nincluding homestead exemptions, will vote yes. All those opposed will vote no, and the clerk will\nunlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nOn the passage of the bills, the a's were 160, the a's were one.\nThe bills having received the requisite constitutional majority are therefore passed.\nWe're moving on to morning orders, the chair is being somewhat lenient because we have more than 15 requests for morning orders.\nWe'll limit it that if you'll limit your remarks to one minute we will still exceed the limit so one minute or less\nThe chair please come to the front if you have a morning order so that I can see you and call on you\nThe chair recognizes Representative Santos for a morning order.\nThank you, esteemed Madman Speaker of the House, members of the General Assembly and all\nof Georgia.\nToday, me and my colleague stand with the survivors of domestic violence.\nWe will be giving a resolution to the Henry County District Attorney's Victims Services\nUnit.\nHaven House and the Henry County Office of the Solicitor General, Victim Unit.\nIf you are here, please stand.\nThe Henry, whereas the Henry County District Attorney's Victim Services Unit is dedicated\nto providing a compassionate and comprehensive support to victims of felony crime, whereas\nThe Henry County Office of the Solicitor General is responsible for prosecuting Mr.\nMiner-Crimes on behalf of the State of Georgia and the citizens of Henry County.\nWhereas, the Haven House provides a shelter to survivors.\nThank you all for being here today.\nWe appreciate your contributions to the State of Georgia and we thank you for everything\nthat you have done, and we'll continue to do.\nThank you.\nMr. Speaker, Madam Speaker, I yield the well.\nChair recognizes representative Campbell\nfor a morning order.\nThank you, Madam Speaker.\nWe have a group of students from Southwest Georgia up here today, and from all over Southwest\nGeorgia, so they made a long trip to get up here, we appreciate them coming.\nThey represent a group called FCCLA, which is family, career, and community leaders of America.\nAnd would y'all please stand?\nThey're in the...\nIf y'all were, give them a good welcome.\nThank y'all for making the trip.\nPlease take your conversations to the aneroom.\nWe have a number of people being recognized today\nfrom different members' districts.\nThe chair recognizes Representative Lumpton\nfor a morning order.\nThank you, Madam Chair.\nThe district I served, district 83,\nhas a healthy portion of Beaufort Highway running through it.\nAnd there are many different wonderfully\nculturally enriching programs that exist along that highway,\nbut I want a single one out in particular today.\nIn April of 2021, Miss Wana Alzaga\nfounded the Buford Highway Orchestra program\nwith only 10 students.\nMiss Alzaga is a violinist and a teacher\nwhose career has taken her from Miami to Gwinnett County.\nShe has served as conductor of the Metropolitan Youth Symphony\nOrchestra and the Gwinnett County Festival Orchestra\namong many other programs.\nShe has now brought her prodigious talents\nto the students of Buford Highway and the orchestra program\nthat she founded now serves 55 young musicians\nfrom 19 different to Cap County schools.\nThis orchestra program gives these wonderful young musicians\na wonderful place to learn.\nIt's an after-school and weekend enrichment program\nthat fosters parents involvement\nand that fosters community-wide engagements.\nThis orchestra program operates under the auspices\nof We Love Buford Highway,\nand Miss Lilly Pabien, who is their executive director,\nis also here to support Ms. Wana as we honor her today.\nSo if Ms. Wana, Alzaga, and can stand and Lily Pabien,\nthank you for your work.\nThank you for what you do.\nNow to speak right yield the well.\nChair recognizes Chairman Hawkins from Morning Order.\nThank you, Madam Speaker.\nToday, I would like to recognize the Center for Rule Health Day here at the Capitol.\nI'm not sure if they made it in the door, but I don't think I see any of them up there.\nWe've got a full house upstairs, but you know, Rule Health has been one of our targets\nfor many, many years.\nThis group is comprised of CGOs and leaders of the rural hospitals and some of the largest\nemployees in those communities providing an economic stability.\nIf you are here, would you please stand being recognized?\nOh, good.\nYou got it.\nGreat.\nThank you, Madam Chairman.\nrecognizes representative Glaze from Morning Order.\nThank you, Band of Speaker.\nToday we stand and rise to commend Creekside High School career and technical student\norganization that is with us today visiting this great capital.\nThis organization continues to grow in their endeavors for career, technical and agricultural\neducation programs.\nThey continue to design and have instructional objectives to move forward in the marketplace\nin careers with technology, communication, and they are being equipped to be the next\nsuccessful generation in Georgia.\nexcited high please stand thank you man of speaker I yield the well chair\nrecognizes representative Owl and Newton from morning order\nThank you Madam Pro Tem, I just want to you'll notice today a lot of white coats out\nthere.\nThese are over 250 physicians and physicians in training from across Georgia that are\nvisiting today.\nI was with 75 of those students from multiple campuses in various stages of medical school\nlast night.\nThey did ask me to tell you thank you for the work you're doing where we've expanded\nmedical training in Georgia. We've got the preceptors to get them on the on the\nground training and just wanted to say thank you to all y'all for making a\nwonderful place. Medical Association of Georgia, we got some members up in the\ngallery. We welcome you and thank you for being here.\nThank you, Madam Steve. Chair recognizes representatives Gamble,\nper shot in Osteen for a morning order.\nThank you, Madam Speaker.\nYou've already heard a couple of CTSOs recognized\nfrom individual schools, but the reason they're here today\nis because it's National Career and Technical Education Month\nand today is CTSO Day at the Capitol,\nCareer and Technical Student Organization\nand that comprises Georgia CTI, Georgia Deka,\nGeorgia Engage, Georgia FBLA, Georgia FCCLA, Georgia FFA, First Robotics, Georgia\nHOSM, Georgia Skills USA, and Georgia TSA. And so if y'all are in the gallery and\nyou're in a CTSO or you're a CTAE teacher, would you please stand so that we\ncan recognize you at this time and then also know that we have our school\ncounselors here at National School Counseling Week and what our school\ncounselors stand and be recognized at this time as well thank you for all you\ndo.\nChair recognizes Representative Martin from Morning Order.\nMadam Chair, members of the House, I'm going to rise today and recognize some very important\nfolks from North Folk and Greater North Folk and County.\nI don't know if they're over here or in the Senate, but if you're here with the Greater\nNorth Floating Chamber of Commerce and Executive Director Callie Boatwrights, stay in.\nOtherwise, just welcome to the House and welcome to the Capitol and thank you for all\nyou do.\nJoin me in welcoming the Greater North Floating Chamber of Commerce.\nA yield.\nChair recognizes representative Mathis from Morning Order.\nThank you Madam Speaker. I'd like to piggyback on floor leader camels, CTSO announcement, and I'd like for our group from\nBlakely County. If y'all stand up over here in my hometown of Cocker, and I'd like to thank you if y'all give them a big hand.\nThank you so much. Glad you're here.\nChair recognizes Representative Rice for a morning order.\nThank you Speaker Pro Tem Jones.\nToday I want to recognize on CTSO Day.\nWe have a couple of teachers.\nWe have Mr. Robertson.\nI'm sorry, Ms. Robinson,\nwhoever sees our nursing program at Jordan Vocational High School.\nand we have Mr. Anderson, retired military, who is doing the cyber security program.\nAnd if you'll stand to be recognized from Muscogee County.\nThank you, I yield the well.\nChair recognizes Representative Park Cannon and others for a morning order.\nThank you, madam speaker, gracias, madam speaker, gracias to LCF and Galeo for\nto organize a Dia Latino in el Capitolio.\nTenemos dos miembros de la Junta Directiva,\nOmar Y Pedro, si están aquí,\nif you can stand up.\nWe are here to celebrate the Latino culture.\nWe want to talk about the work ethic of Latinos.\nWe know that our state is connected\nto the work of Latinos, and we are strengthened\nby the work that you do.\nQueremos decir gracias a todo.\nThank you, Madam Speaker.\nChair recognizes leader Hugh Glee from Morning Order.\nThank you, Madam Speaker.\nWe have some students from Jordan High School, Hardaway High School, Kendrick High School.\nThey're all here with HOSSA, LPLA, Deca Skills, USA.\nAnd their teachers are Terry Anderson, Alexis Jamison,\nCamilla Robinson, Angela Layton, Lynn Robinson,\nJocory Daniel, Mr. Freddett Blackwyn,\nand Priscilla Mudge.\nSo all of you guys from the great city of Columbus.\nThank you for coming.\nAnd thank you teachers for the work\nthat you're doing without fine students.\nThank you.\nThank you, Madam Speaker, it is a great honor for me to recognize the senior class\non the Webster County High School.\nThey are accompanied by Superintendent Dr. Dorothy Ingram, Kathy Scott, who is a history\nteacher and James McCullough assistant principal. Hey guys, stand up so we can recognize.\nThank you Madam Speaker. We have a few more morning orders recognizing people of importance\nback home. If you'll give the speaker your attention, the chair recognizes Representative\nMatthew Ack from Morning Order.\nGood morning, Madam Speaker, and thank you.\nToday I would like to welcome our certified midwives.\nToday is their day here at the Capitol.\nI don't know if they made it into the gallery.\nYes, they are.\nThank you, ladies.\nThank you for being here.\nAnd I appreciate all you do in Midwifery.\nThank you.\nChair recognizes Representative Todd Jones from Morning Order.\nThank you, Madam Speaker.\nToday I rise to recognize National Girl and Women's Day in Sports.\nI want to absolutely recognize those who came before us who made sure that all of our\ngirls and all of the women and all of our females had an opportunity to participate in sports\nknowing that it drives greater accountability, greater discipline, and basically giving\nthem a greater opportunity in life to be able to make it to where they want to get may\nit be in the job world.\nAnd we want to make sure that we keep the sanctity of women's sports because as my daughter has\nshown us, as a two-time, seven-a high school state champ, she never makes it to that state\nchampionship if she had to compete against anyone other than someone born a female.\nAnd we know that that's important because we want to give that opportunity to females\nand give just like my daughter the opportunity to get a Division I scholarship.\nThank you very much, Madam Speaker.\nChair recognizes representatives Donna Tucci and Martinez from Morning Order\nand Leader of Stration recognizing people back home.\nThank you, Madam Speaker, members.\nToday we welcome Hebron Christian football team as well as their coaches.\nThe Hebron Christian Academy football team electrified the fans by defeating a two-time\ndefending champion, Prince Avenue, with a stunning score of 56 to 28.\nWith a victory they claimed and they played in the iconic Mercedes-Benz stadium.\nThey're here today with their coaches along with head coach guests.\nIf you all would just wave, stand and wave so that we can recognize you.\nStand up please. Thank you so much for being here. Congratulations.\nAnother recognition of constituents back home by Chairman Blackman,\nBallard, Williams, and Jones.\nThank you Madam Speaker. Well, if anybody else there you are. All right,\nAll right, thank you, Madam Speaker.\nFellow members, please join us in welcoming Miss Shelton's\nAP government class to the people's house.\nIf you're here, would you all please stand and let us welcome\nyou there you are.\nThank you, Madam Speaker.\nLast but not least, we have Representative Chastain recognizing constituents from back\nhome.\nThank you, Madam Speaker.\nGood morning, everyone.\nI want to recognize our team from the Blue Ridge Medical Center that's here with us today\nThey're doing a great job up in North Georgia, representing our\nTri-County Area Blurridge Medical.\nWe have our CEO, Gary Proquette, our CNO, Evelyn Hammond, our C-O-O,\nMelissa Eaton, and Mr. Ed Henry, who's with the\nsenior leadership with the holding company, and also don't\nhold it against him, he's a former representative from the\ngreat state of Alabama, so good to have y'all with us.\nJust thank you.\nWelcome.\nThe clerk will read the caption to a group of privileged resolutions, honoring the life\nfrom memory of John A. Z. Threadcraft, honoring the life\nof memory of Richard Aloroon Rokhan-Ducola King Rohan,\nhonoring the life of Antonio Cornelius Baker,\ncommending the Professional Association\nof Georgia Educators on his 50th anniversary,\nrecognizing February 10th, 2025,\nas Georgia Hearing Day at the State Capitol,\ncommending and congratulating the retired master sergeant,\nLouis C. Graziano,\nrecognizing the Macon Violence Prevention Program\nfor its impactful efforts in reducing violent crime,\nrecognizing February 5th, 2025,\nas the Latino Day at the State Capitol,\ncongratulating the Grayson High School football team\nfor winning the 2024 State Football Championship,\nrecognizing and commending, Alisa Anderson,\nrecognizing and commending the Urban League\nof Greater Atlanta Young Professionals\nand the Urban League of the River Valley Young Professionals,\nrecognizing and commending the Reverend Cory J. Neal\non the occasion of his 17th pastoral anniversary,\nand recognizing and commending the NAACP National Office,\nand for other purposes.\nThat completes the reading of the privilege resolutions.\nIs there any objection to adopting the privileged resolutions?\nThe chair here is none of the resolutions are adopted.\nMoving on to afternoon orders.\nIf you have signed up for an afternoon order,\nplease come to the front so the chair can recognize you.\nChair recognizes representative new for an afternoon order.\nAnd friends, thank you Madam Speaker and members, good morning.\nWe have some special guests here in the house today.\nToday is Stand with Survivors Day at the Capitol.\nWe have Shepherd's Rest Ministries from Paulton County\nin the house.\nLarry Emory Manley, Candice Buckner, Doug Shaw, Dave Roberts,\nalong with their fearless leader, Dr. Katherine Melton.\nIf you're in the gallery, please stand.\nI think they might have gone to the Senate side.\nShepherd's Rest Ministries is a crisis center dedicated to addressing family violence.\nSince it opened in 1997, this safe and private facility has meant the basic needs of\nresidents offering food, clothing, personal care items, and other emergency assistance for\nthe families.\nThey have provided shelter for over 5,000 women and children in our community.\nPlease join me in expressing our gratitude for their unwavering service to Georgia and\nwelcome them to the people's house.\nThank you.\nThank you Madam Speaker, I'm honored today to give the black history moment and today's\nBlack History Moment was spotlight Charles W.\nChappelle, an architect, engineer, and a native of our great state.\nCharles W. Chappelle was born in Inton in 1872\nto African Methodist Episcopal Reverend George W.\nChappelle and Anna Johnson Chappelle.\nHe attended Knox Institute, a private elementary and secondary school\nin Athens and Mars Brown College right here in Atlanta.\nwhere he trained as an electrical engineer and architect.\nIn 1897, Chapelle moved to Pittsburgh\nto work for US Steel as an electrician.\nBy 1910, he had moved to Brooklyn\nand worked as an architect.\nIn January 1911, Chapelle was the only African-American\nto participate in the first industrial aeroplane show\nin New York.\nThe week-long event highlighted innovation in aeronautics\nand full-size aircraft for an audience of more than 15,000 people.\nLess than a decade after the Wright Brothers\nhad shown that powered, sustained, and controlled airplane\nflight was possible, Shapel debuted\nan aircraft of his very own design.\nThe plane which took Shapel a year to bill\nwas supposed to be able to travel long distances safely.\nShapel's aircraft was awarded for its design and capable\nbuildings and with the spade displayed at the United States aeronautical reserve, headquarters\nin Manhattan. Following his success at the air show, Chappelle helped to establish the first\nblack-owned airplane company, serving as the company's vice president for a time. And\nafterward in 1913, Chappelle set up the African-American Union Company, a profitable Ghana-based company\nHe's specializing in the global export of African resources such as Mahogany and Coco.\nChappelle headed the company until his closure in 1930 and he died in 1941.\nThis has been your Black History moment.\nThank you Madam Speaker.\nPlease stand for recognition.\nMembers will please stand.\nrecognizes Representative Bonner for an afternoon order.\nThank you, Madam Speaker.\nI rise today, joined by the Fable of Delegation to pay tribute to two of our mayors of my\nhometown Fable that recently passed.\nMayor Ken Steele, on the left, passed away in December.\nHe was Vietnam veteran, Navy pilot, flew for Delta, served as our mayor from 2000 to 2011.\nHe and I attended New Hope Baptist Church together. He leaves behind a wife and three children.\nAnd then on the right is Greg Clifton, who just passed in January, who served one term as our mayor.\nAnd I spent time with Greg in a men's Bible study for the last seven years.\nBoth of these men did great things for our state and did great things for our community\nback home in Fayetteville and I appreciate you paying honor to them today. Thank you, Madam Speaker.\nChair recognizes Representative Carter for an afternoon order.\nGood morning and thank you, Madam Speaker.\nWell, we're here tomorrow, Thursday, February 6th.\nWe're asking everyone to wear red.\nIt is our go red day at the Georgia State Capitol.\nWhen you arrive, you will have your red pins on your desk.\nAnd on Friday, we're inviting everyone to join us for lunch for the National Go Red Day here at the Capitol from 12 to 2.\nBut I want to leave you with something.\nAs we've talked often, women can reduce their risk of cardiovascular disease by making lifestyle changes.\ngetting regular check-ups and being aware of the symptoms of a heart attack.\nWe're just a few of the lifestyle changes we all could participate in.\nExercise 30 minutes a day and we have a gym on the sixth floor in CLOB.\nY'all made out of no that. Eat healthy.\nSo eat more fruits and vegetables and a little less protein and cut out those carbs.\nmaintain or help the way Lord knows I need to if you smoke quit\nmanage your stress so we may need to add some meditation in our morning\norders when it gets closer to the end of the session which I'll think and get\nsleep guys we need to make sure that we get enough sleep so make sure you do\nyour annual checkups if you haven't gone in the last six to twelve months\nplease get that done check your blood pressure regularly regularly you can\ngo downstairs, your cholesterol, and one of the most recent studies have shown that not\njust our cholesterol, but we need to be monitoring our LDL. That is one of the numbers that I know\nin the last few years that the physicians have been looking at. There's some new medication\nthat can help manage that, but it is an indicator that you are a pre-exposed and potentially\ncardiovascular disease that we haven't really looked at over the last few years. So thank you\nto bar where red okay I will yield the well. Chair recognizes Chairman Hatchett for an afternoon order.\nThank you Madam Speaker. Colleagues on your desk,\nAXP67. The amended FY25 budget. I'm around for any questions all day. Budget subcommittee\nchairman around the budget office will be glad to answer any questions you have. Thank you.\nThat concludes our afternoon orders. We'll conclude with announcements. If you have an announcement,\nplease come to the front and be ready.\nThe chair recognizes Chairman Corbett\nfor an announcement.\nYeah, whoever you want.\nThank you, Madam Chair.\nThe rule caucus will be meeting at 12 o'clock\nover in the Ag building.\nLow-country barbecue is providing the meal today barbecue and all on the side so y'all come join us. Thank you\nChair recognizes\nChairman LaHood and representative Sharper and\nLeigh and and Whipbershot for an afternoon\nannouncement. Thank you Madam Chair for letting us take a minute to welcome\nthe Georgia Senior Living Association today and\nStay with me, Corbett, and they've got box launches for you in room 230 not to compete with rural caucus launch, but\nPlease see them while you're here in room 230 right upon a German and also Lounge County\nThe Lounge County bird supper tonight\nCorbett and I as a\nSheldon or sore from shooting quail this weekend so y'all can eat good tonight\nFried quail over here at the depot. Please join us five o'clock South Georgia's coming to Atlanta, and it will be a good time. Thank y'all\nChair recognizes Chairman Skoggins for announcement.\nThank you Madam Chair.\nSpecial rules will meet at 1 o'clock at 4.15.\nThank you very much.\nChairman Workhizer for an announcement.\nThank you Madam Chair.\nThe House Industry and Labor will meet this afternoon at 3 o'clock.\nIt's CLLB 506.\nThank you.\nChair recognizes Representative Cahan for an announcement.\nThank you, Madame Speaker.\nOn your desks, you have an invitation from me to attend Harps Crossing Baptist Church\nin Fayetteville.\nThat's going to be on February the 15th from 10 to 3.\nI like to tell people for my faith, I sit at the feet of Jesus, and for my constitutional\ntraining, I sit at the feet of our founders and constitutional expert and educator Chris\nSan Hall, so you will be greatly benefit from her presentation.\nYou just have to RSVP so I can make sure you have enough,\nwe have enough lunches.\nThank you, Madam Speaker.\nChair recognizes Chairman Matthewock for an announcement.\nThank you again, Madam Speaker.\nState planning and community affairs will meet today\nat three o'clock for 15 CLOB.\nThanks.\nChair recognizes Chairman Lumsden for an announcement.\nThere will be a meeting of the Full House Insurance Committee\nin the morning, 8 a.m., CLEO B406.\nFull House Insurance Committee meeting,\nCLEO B406 at 8 a.m., we have a few bills to deal with.\nThank you.\nChair recognizes Chairman Green for an announcement.\nThank you, Madam Chairmen.\nState properties will meet in the morning at 8 a.m.\nin the capital room 403.\nAnd this will, we will adopt our rules\nand at the same time take up the easements\nand compensation resolutions.\nThank you.\nChair recognizes Chairman Noel Williams\nfor an announcement.\nThank you, Madam Speaker.\nToday at 1 o'clock and 406 CLOB\nwe'll have the Banks and Banking Committee meeting.\none o'clock, 406, CLOB.\nThank you.\nChair recognizes Chairman Anderson for an announcement.\nThank you Madam Speaker.\nGovernor Little Fares, committee will meet at 3 p.m. today\nin CLOB 606.\nThank you.\nChair recognizes Chairman Petri for an announcement.\nThank you Madam Speaker.\nToday at 2 o'clock and 415 CLOB,\nthe Human Relations and Aging Committee will be meeting.\nThank you.\nChair recognizes Chairman Crowe for an announcement.\nThank you, Madam Speaker.\nThe Public Safety and Homeland Security Committee\nwill meet today at 1 o'clock and 506 CLOB,\n1 o'clock, 506 CLOB, Public Safety and Homeland Security Committee.\nThank you.\nChair recognizes Chairman Ballinger in announcement.\nThank you.\nJudy, Chair, juvenile committee will be meeting today\nat one o'clock.\nWe have a couple of exciting presentations\nand we need to also present the committee rules.\nThank you very much.\nOn that concludes our business.\nIf you have a page, please locate your page\nand meet them at the, up at the dius for a picture.\nThe chair recognizes the majority leader for a motion.\nThank you Madam Speaker.\nI move that this house stand adjourned until 9.30 AM on Thursday, February 6th, 2025.\nOn the motion of the majority leader, this house stands adjourned until 9.30 AM.\nOn Thursday, February 6th, 2025, all those in favor will say aye.\nAll those opposed will say no.\nand the eyes clearly have it and this house is adjourned.\n",
  "updated_at": "2026-02-12T17:33:20.488749+00:00"
}