{
  "video_id": "1XGJdWdJDkc",
  "url": "https://www.youtube.com/watch?v=1XGJdWdJDkc",
  "title": "Senate Committee on Health and Human Services | 03/04/2024",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 37,
  "summary": "Here is a summary of the Georgia Senate Committee on Health and Human Services session from March 4, 2024:\n\n**Overview**\nThe committee discussed House Bill 1078, which would enable the Georgia Department of Community Health to develop and implement a PACE (Program of All-Inclusive Care for the Elderly) program in the state. The PACE program aims to allow elderly and disabled individuals to remain in their communities rather than needing institutional care.\n\n**Key Actions**\n- **HB 1078**: Enabling legislation for the Department of Community Health to establish a PACE program in Georgia, starting with three initial sites in Fulton, Bibb, and Chatham counties.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The committee discussed the advantages of the PACE model compared to current Medicaid waiver programs, including the ability for providers to replace home care agencies that are not meeting the needs of enrollees.\n- There was discussion about the legal duties and oversight of PACE providers to ensure continuity of care, in contrast with current gaps that can occur in some home-based services.\n\n**Votes**\nNone recorded.\n\n**Attendance**\nNo explicit quorum notes.\n\n**Adjournment**\nThe transcript does not include information about when the session adjourned or the date of the next scheduled meeting.",
  "transcript": "You\nThank you for allowing us all to be here today. God I pray that you give us clear minds\nso that we can think through and make the best decisions for the people of Georgia.\nname a pray amen. Thank you. We have two bills today. House Bill 1078. Chairman\nof Petrie is here and House Bill 1083. Leader Bruce Williamson is not here and\nI'm gonna be doing that one so I'm gonna give you a little heads up. I'm giving you\nno heads up until just now so apologize about that. If I'm sure you can handle it.\nSo Representative Petrie you can be here or there. You want to sit down. That's\nThat's great.\nWitness number two and we do have on 1078 we got one, two, three people that have signed\nup so tell us a little bit about your bill and the floor is yours.\nThank you Chairman and my understanding is my senator is going to be carrying this bill.\nSo I think you got this one also.\nHappy to do it.\nAll right so Mr. Chairman House Bill 1078 this is a Department of Community Health Bill.\nI think most of you may be aware last year the department began studying the idea of\ndoing a pace program in Georgia and what this bill is is the enabling legislation for\nthe Department of Community Health to develop and implement a pace program. Paces in acronym\nwhich is program of all inclusive care for the elderly and Mr. Chairman you and I have\nhad some experience with the source program and in our careers at home, a\nwavered service that long ago was really almost patterned after pace, although\nit was a waver and it was not a capitated program like pace. This is a true\npace program. The goal, give people opportunity to stay out of institutions,\nkeep them in the community longer. When we do that, we save money for taxpayers\nby keeping people on a less institutional setting and we give people a better\nquality of life. So what this program does is basically the provider would provide all\nof the kind of all-inclusive care for these individuals that are going to be age-blind\nand disabled, duly eligible, Medicaid and Medicare. And so they're providing the preventative\ncare, the primary care, the acute care, and the long-term care. All of that is provided\nby these individuals. It's a voluntary program. They choose this as an alternative institutional\nplacement and I said earlier it's a\ncapitated program that's what makes it\ndifferent from our waivers that serve\nas population today. It's currently in\n32 states. I do want to emphasize that\ninitially there'll be three sites\nFulton County and these were sites that\nwere studied by the department had the\npopulation that could benefit from the\nservices Fulton County, Bibb County and\nChatham County. I think that's pretty much explains it. Mr. Chairman, glad to answer any questions.\nWe have any questions from the committee. If not, we have two people. I'm sorry, three people that\nwanted to test five. All right. There you go. My friend from Chatham, great to have you here.\nSo to understand, and again, I'm not, I'm not by any means an expert in this, and I just appreciate\nyour expertise. So if somebody's goes into an institutional setting now, obviously the\ninstitution that takes them in has full responsibility for their well-being. If they're at a home\nsetting, they get services, but there's no strict duty to provide those services. That\nif someone doesn't show up, it's kind of, I mean, I've had constituents that have called\nme that they're getting home care. And if the person doesn't show up to change their\ndiaper and bring food to them. It's like, oh, sorry, we missed it today. We'll come back tomorrow,\nmaybe. There's not this duty. Does this create the same duty that you have if you're an institution\nsetting that you provide care? Yeah, so let me first of all say, so we don't know where there's\nin that analogy you just use. Is that private sector services? Is it services through a Medicaid\nwaiver? It could be from, is it home health through Medicare? So it could be from a multitude of\nof angles, but to answer your question, you're looking for, is somebody going to oversight\nall of this to see that those services are provided yes, and that would be the pace\nprovider?\nAnd so yes, it will better ensure that those kind of gaps don't happen.\nThat's correct.\nAnd I know we don't like to talk about lawsuits and stuff.\nI'm just talking about real legal duties, and they have a legal duty to provide the care.\nIt's not a sort of a secondary service then, it's that okay.\nand all include that they accept so the provider that chooses to be a\npace provider and there are three now that are interested in working with the\ndepartment they're taking on that burden to provide all of the care needed for\nthat individual. So the family member of the the person getting care saw that\nthey they they were missed you know two or three days in a row we're getting\ncritical things you'd have the basis of a suit you can actually you can\nforce them to do that you have it you have to because today you don't have an\naction to do that?\nWell, I think what, so what would happen, so if, so in the world we live in today, I\nwant to make sure I'm speaking clearly of this.\nSo we can't ensure that always an employee is going to show up on time or something of\nthat nature.\nWhat I'm saying is that provider, their duty is to make sure that if somebody's not there,\nthey get somebody else there, which by the way is already the duty of home care under\nlicensure.\nSo, but I can't tell you that there's not failures because there are failures as we all know\nin hospitals every day, in skilled nurse facilities every day, and yes, in community-based services\nevery day. But the folks that are, whose duty it is to see that that individual is being served\nand served well, it will be the provider, the pace provider of these individuals that voluntary\nchoose this, voluntary choose this service as an alternative to skilled nursing home placement.\nI love this Bill Mr. Chairman, I just had to ask that question if I should go out there, I did.\nGood question.\nI won't belabor the point I had a constituent who is wheelchair bound, can't get out of\nthe wheelchair and bathe himself, would have sat in his own business for 60 straight days.\nNo one came and checked on him for 60 days, only friends did that for him.\nBecause when you get home care now as a disabled person it's not, I don't know the right term\nI mean, there's not the obligation that you have\nwhen you're in an institutional setting.\nAnd if this closes that gap, that would be a huge use.\nSo was this in a skill nursing facility,\nor this was at home?\nNo, they were at home.\nThey were at home, I got you.\nAnd they choose to be there.\nThey could have been in a skill nursing office.\nNo, but part of the qualification, just education\nfor the committee and folks listening,\nis that they had to be eligible for a skill nursing facility.\nIE nursing.\nThey're going to meet a level of care.\nTo be eligible for this program.\nYes, sir.\nAnd he was offered to be home and he sounded like it.\nBut when he offered to be home, that was the fatal mix, once he opted to be home, he didn't\nhave the guarantee.\nAll right.\nSo I'll say one last thing, Mr. Chairman, if I may, to the very good question, Senator Sessler.\nSo here's where I think this would be advantageous.\nUnlike some of the other programs, like through Medicaid waivers, maybe, and where you might\nhave limited choices.\nSo here's what'll happen with a program like this, the provider, if they discover that\nThe individual being served says, I don't like ABC.\nI don't like this agency.\nThey can replace them and put somebody else in there.\nAnd they have free reign to do that.\nAnd so I think that, you know, again,\nas you get feedback from the individual serve,\nyour goal is make sure they get served\nand also make sure they're satisfied.\nBecause again, they're choosing the services\nand alternative to skilled.\nRemember, so just to be clear,\neverybody is entitled to skilled nursing home placement.\nIt is an entitlement.\nHome and community-based services are not entitlements.\nAnd so people choose this, and yes, somebody's failing,\nreplace them, and I think this makes it easier\nfor a program, the pace provider, to say,\nyou're failing us, you're out,\nwe've put in somebody new in.\nSo I think it helps resolve that problem.\nAppreciate it.\nWe have Deborah Stokes and then Tom Bauer\nand then Kathleen Benton, I'll be less.\nWhich everyone you wanna do?\nNow's good, all right, I'm sorry, I skipped.\nVice Chair. Yeah, I really like this idea, Mr. Chair, but I had two questions for you. One is,\ncan someone go from a sniff to pace? In other words, once they're in a skilled nursing, if it seems\nappropriate, that they could be provided service at home, can it go that direction? Unless someone\nhere with the department tells me otherwise, my answer is absolutely. Okay. And then the second\nthing is you said several times it's voluntary. What's the outreach going to look like? How are\npeople going to know that they have this option? That might be better coming from the department,\nbut that's a great question, Senator, and I think the department might better answer that.\nAnd we have let's do three people to testify and then we'll talk about questions and go from\nthere. Mistokes. Thank you, Mr. Chairman and committee. This, my name is Deborah Stokes. I'm\nExecutive Director of the Georgia Council on Aging\nand its Coalition of Advocates for Georgia's Elderly.\nWe are very much in favor of this legislation\nas it will help the growing aging population\nbe able to stay home longer.\nAnd we know that that is the goal,\nthat is the best place for our seniors to be\nis at home with all of the services that they need.\nSo we are very much in favor of this bill.\nThank you.\nThank you, Mr. Chairman and members of the Committee.\nI'm Tom Bauer with Leading H. Georgia.\nWe serve at least 125,000 seniors in our various facilities and adult day centers.\nWe cover the gamut from Lopscale Retirement to subsidized housing.\nStokes was very eloquent exactly on why we're supporting this bill.\nWe would like to see as many options as possible for seniors to get the services they need,\naccess the services without being in skilled nursing.\nIn particular, we have many subsidized homes and hug facilities and things like that.\nAnd these are folks who are living independently and they're going to get to a point where\nthey can't live alone.\nAnd this would be another tool in the toolbox to use the phrase that everybody uses around\nhere.\nmight support the bill. Thank you. Thank you, Mr. Bower. And Kathleen Benton, if you just identify\nyourself, I'd be much appreciated. I'm Kathleen Benton and I'm the CEO of Hospice Savannah and we're\nout of Chatham County. I'm an interested provider in pace and I've actually been studying pace\nacross the country for the last two years to see the benefits it could have in our own state.\nAt all of our neighboring states actually have pace as well and it's actually very\ninstrumental. We serve about 4,000 patients and caregivers. So we've seen the\ndeficits just as you've talked about in what we can't do in health care and\npace is an excellent disruptor to all of that. Very briefly I felt that it's\nhelpful for you to meet a fictional patient named Mary. Mary is a patient that\nBut we see every day an 85-year-old with congestive heart failure, Alzheimer's that is advancing\nimpulmonary disease.\nHer son and daughter work every single day to get her to the neurologist, the cardiologist,\nthe primary care.\nShe's dealing with what she's talking about as far as home caregivers who don't show\nup.\nThe family is exhausting themselves, supplementing these home caregivers.\nAnd Mary doesn't want to go to the nursing home, though she is eligible.\nThe family is exhausting themselves.\nHealthcare resources are being exhausted.\nMary's gone in the hospital seven times in a year.\nShe's gone to the emergency room with falls three times in the last year.\nSo how could the trajectory be different for Mary's family with pace?\nEnter pace and you have immediate transportation.\nSo the first step is to take this off the family.\nThe home caregivers go into the home and get Mary ready every day.\nIn answer to your question, if they don't show up, the entire team knows about it because\nyou also have interdisciplinary review of the providers and you have the transportation\ngroup that will be out there to pick up Mary for one of her appointments that are scheduled\nto see neurology or cardiology.\nWhen Mary will be taken to the pace clinic, pace is a structured building that is built\naround the needs of patients.\nIf Mary needs fluids that day to make sure that she's not left dehydrated, if Mary needs\nphysical therapy to make sure that she doesn't fall when she gets home, all of that occurs\nduring the day.\nSo Mary is well taken care of and reviewed by this pace program.\nnight Mary goes home sometimes the family helps to get her to bed if they're\nnot there because they're out of town or because they just can't do it with\nall they're doing working themselves then the pace will also show up to the\nhome and make sure that Mary gets a nice meal and goes to bed. If Mary needs her\nhair fixed the next day or needs the dentist the pace covers that. If Mary has a\nto fall in the home in the middle of the night\nand needs to call 911.\nThe pace meets her at the emergency room.\nMake sure she doesn't stay at the hospital too long\nthat a subsequent surgery goes well\nand even rehabilitation in the nursing home is followed.\nYou utilize all of the services that are in healthcare\nbut you bind them all together with the pace.\nAnd that's really the benefit\nof having this program in our state.\nI'm also open to take any questions\nbut I'll say I'm so grateful to Senator Watson,\nI'm so grateful to Representative Petri\nand to the Department of Community Health\nfor supporting this innovative program.\nPut simply, it will help keep people in their homes\nwith round the clock care and really help families do this.\nAny questions?\nSenator Sassler, hold on, let me get your mic.\nOkay, just very simply again,\nI'm excited to appreciate your being in this\nand I appreciate your very clear presentation.\nthat's what I was looking for.\nSo to be clear, the pace provider is fully accountable\nfor their outcome.\nFully accountable and fully accountable to the bottom line.\nIf they don't do a good job, they're going to pay more\nbecause Mary or any other patient is not gonna do as well\nin the healthcare continuum.\nThank you.\nI got you.\nI see.\nEverybody see that particular point she made.\nEight.\nSenator Hodges.\nI would imagine there's a substantial difference in costs.\nCan you speak to that a little bit?\nAbsolutely.\nIn compared to nursing home patients, it's about a 12% cost reduction with pace.\nAnd most of that is because the care is no longer disjointed and the capitated network\nis motivated to make sure that there's no redundancies.\nSo for example, if the patient's going to a neurologist and a nephrologist, all of that\nis married together in the interdisciplinary team.\nMedication management is very thorough and there's less hospitalizations and less number\nof days in the hospital during the hospitalizations, which allows the resource reduction.\nIn other words, it is since your assessor said, if someone doesn't show up and they get\na bed soar is going to cost them a lot more money and their capital their\ncapitated fee will certainly not cover their call spainy means so they're\nmo they're motivated on multiple different levels exactly so and it's it's\ngenerally cheaper to provide care and in someone's home than it is in a\nskilled nursing facility exactly the other questions miss Benton we sure\nappreciate you coming that was very insightful appreciate your example\nthere. Thank you. Thank you. You know, I apologize. Okay. All right. You're on number 10.\nNo 11. Okay. By the way, just the internet apparently is down. Yeah. And but we're being taped\nand it will be available later if anybody is dying to listen to us again.\nAnd Mr. Hood, for the Department of Community Health, thank you Senator Chairman Huffsteadler\nhas a question.\nSo we had looked at a model a year or so ago where on our subsidized housing we had people\nthat we were trying to mingle on the same floor and the rules wouldn't let us do it.\nI don't know if you're familiar with that or not.\nWe're trying to get a pilot done on it.\nYes, sir.\nI think I'm familiar with what you're referencing.\nSo, and we never really got to where my question is,\ndoes this help in that?\nI think it does because those individual members\nas was referenced earlier in subsidized housing,\nthey would be in a, individually,\nif they meet the sniff level of care,\nthey would be able to enroll when still saying\nthat subsidized housing,\nand then they would have all the benefits\nthat pace would offer,\nand it doesn't have the restrictions\nthat have a licensure that you're referencing.\nSo they're not mutually exclusive?\nRight.\nGood.\nOkay.\nSenator Chairman, Hustetler, number five.\nStill, I shouldn't have that memorized, shouldn't I?\nYeah.\nOkay.\nMake it quick.\nThe geography we talked about, Fulton, Bib, Chatham, what's the prospects of this being\na statewide thing and what's going to be required to do that?\nYes, sir.\nSo what we've done is, last year, the legislature directed us to do an assessment.\nWe reached out to the national pace organization and they have a formula which goes through\nan algorithm and demonstrates where pace would be most successful and where there's sufficient\nnumbers of eligible members to make it successful from an investment standpoint and operational\nstandpoint. And in doing so, we asked for those specific locations because we had interested\nparties that already had facilities there to go to a pace organization. You basically\nhave to have a 10,000 square foot building that would meet the services that were referenced\nearlier in testimony and then you can serve a population of zip codes that surround that\nwithin a certain mile radius. With their algorithm, they demonstrated that those three\nhad that. Largely, we think that other population centers are going to be eligible. We didn't\nspecifically look at those because we didn't have the same interests that have been demonstrated.\nBut certainly, Fulton and DeCabs showed the greatest number of populations you might expect,\nalso expect Cobb, Gwyneth, Columbus, Augusta, so forth, you know, we qualify.\nBut if we act on this and the CEO who spoke to us who's doing this in\nChatham, decide, you know what, I'm going to open up a Cracker Jack facility\nin Gwyneth County, they can start providing the service as long as the\ncapabilities there or do we need to appropriate dollars, do we need to act\nagain, let's slettively or where does that stand? Sure, let me explain it a\nlittle bit further. So what has to happen, what this is authorizing the\nThe department to do is to go to CMS and submit a spa to add this to our state plan to\nauthorize PACE services as a Medicaid covered service.\nPACE is a Medicare program, it's in a number of states, but all the rules and regulations\nare set by Medicare, which is why this legislation is really so, so small, because we're going\nto rely upon everything that Medicare has as an impolining entity.\nAnd they're just to add to that, they're also a subsidy to this program.\nThey pay a substantial amount for those who are dual-eligible, and this is largely focused\nat a Medicare population.\nIf we did not have PACE, which we don't have today, all the other things that we offer\nthat are on Medicaid are 100% state-match.\nSo this has this subsidy from Medicare as well.\nSo with that, that's how we will implement.\nin doing so to identify locations, what we have to do is to make sure that there's a readiness\ncomponent of that. The way that we initially intend to do that is to hire a contractor\nto go out and do what is known as a request for qualified vendors. They'll set out all\nthe things that would be necessary, largely that building and staffing and all the things\nto demonstrate that a facility is going to be ready within a certain time frame. And\nThat's really why we focused on these three\nbecause we knew we had to identify providers\nwho likely would be able to meet that.\nIf we see additional interest,\nwe would come back the next year\nand then we would do that again\nand allow for those additional providers,\nwhich is what we expect to do.\nI will say...\nBut if we don't require less of that...\nNo, sir.\nI do expect that it might acquire additional preparations.\nWe've only got a small number of this year.\nIf we have to do additional administrative tasks\nand actuarial services and all that at a larger scale.\nWe do anticipate that we would bring that forward as needed.\nThank you, Mr. Hood.\nChairman Walker.\nI'm on board.\nI'm on board.\nEven though I'm not even on the internet,\nbut like the concept, certainly,\nI wondered if meals are part of it.\nAnd my other question is, well, I have two questions\nI believe that it's contemplated anything, any service component that they would need\nthat they would have met.\nI mean, it's a total managed care model.\nSo if there's that need, then I suspect that they will find a means to do that, whether\nthrough its other service programs to provide meals or meals on wheels or whatever the case\nmay be, it's going to vary probably depending upon that person's circumstance.\nI expect the facility, which really acts in addition to the health care component, really\nas a senior services center, that they have activities and meals and all the things that\nare associated with that, but I think it's going to vary to be honest, Senator.\nThank you.\nYou have the follow-up question.\nYes, sir.\nYou mentioned it's like a capitated fee, and so there's an incentive from the provider,\nthe pace provider to use these wraparound services and try to keep them out of the hospital\nand that kind of thing.\nBut it also seems, it says, transportation is included.\nI mean, what if they are real profit-oriented and are like,\nno, we're not going to take you to get your haircut or,\nyou know, you already did that.\nWe're only going to do that six times a year or, I mean,\nwho's overlooking all this and making sure that the making\nmoney that can get in the way of taking care of the patient or the patient.\nSo a pace program is going to be very equivalent to a license program, even though we're not\nseeking license, we're going to follow all of the certification through the Medicare\nguidance.\nSo they would be able to complain to the department, it would meet that similar complaint.\nAnd then just as a reminder, this is a total voluntary program, if they're truly dissatisfied\nand can't reach resolution, they can disemroll and go back to regular Medicaid services\nwhether that be HCBS or you know they could go to a nursing home.\nI will say that if they don't, if they digress and they end up in a nursing home though\nin the PACE program, PACE is responsible for that nursing home care so there's truly\nincentive to try and keep them not only out of the hospital but out of the nursing home.\nMake sense.\nGot you.\nJust add one thing to that.\nSo this is all value-based care is what it sounds like and the incentives are for\nfor the quality to drive the cost, right?\nSo the outcome should be, there's motivation\nfor the outcomes to be better,\nbut to then cost less money.\nI mean, that's how very nice programs work.\nThat's right.\nI mean, how often does it say in this committee\nthat the quality drives price?\nNumber two, three.\nThat's right, three.\nThank you, Mr. Chair.\nThank you for being with us.\nAnd I apologize that the chairman had presented his bill pretty much almost completed when I got here.\nSo if I'm being repetitive, I apologize.\nBut we've had a community-based services for eons.\nAnd it's been characterized as being underfunded.\nYou know, we're always pushing for more funding\nof community-based services.\nHow does that reality sync up with this proposal?\nYes, ma'am.\nSenator, I'll answer that.\nAnd then Joe needs to, he can as well.\nSo to me, they live together.\nSo you're right, for many years now,\nwe've been trying to continue to increase funding\nfor home and community-based services,\nlargely through Medicaid waivers,\nto keep people in the community longer,\nwho do have a skilled nursing home level of care.\nand we're doing that.\nWe continue to do that.\nThis will give us just another route,\nanother choice, if you will,\nfor individuals who have Medicare and Medicaid\nto do it a different way.\nSo it's not through a Medicaid waiver,\nbut it's through this pace model,\nand which is a capis,\nso it's different entirely from a fee-for-service provider\nthrough home community-based services\nbecause it's a capitated program.\nThey're all fee-for-service at this time.\nAnd so this will be different,\nbut it just gives another choice for that same population.\nSame population, different option.\nSo it's just another way of serving people\nwho, as we all know, are the people really Medicare\nhas all the way back to the 60s been most targeted to.\nAge blind is able to frail elderly.\nAnd so it kind of captures that group\nwith another opportunity.\nIt's the way I would describe it\nand Joe may have a better answer.\nMr. Hood, anything to add or?\nYes, just one other thing and that is,\nremember this is a capitated rate\nand as the chairman referenced,\nthe community-based services are on a waiver\nand those rates are Medicaid rates\nwhich are really to raise those rates\nor would be an ass to the legislature to do.\nI mean, I've been very kind this past year.\nWe've raised rates for the first time\nfor many of those waiver programs in a long time.\nThe difference here is a capitated rate,\nBut much like the CMOs, it gets done by an actuary every year.\nAnd these are largely driven by Medicare rates because this is a Medicare program.\nSo not really set by Medicaid.\nSo you've got an actuarial rate, which is going to be revisited every year and updated.\nAnd then you've also got the Medicare participation, which is driving that, which ensures that\nyou're going to get a competitive rate and that it's going to remain so as you go forward.\nIt sounds like why is it taking us so long so okay any other questions from the committee\nThank you, mr. Hood chief operating officer of DCH and\nSo\nIs that anticipated that this approach will have a cost savings that that the\nthe home community-based care does not have.\nIt's a cheaper, less costly way to deliver with the hope of better services, I mean, is\nthat?\nSenator, like I would describe it.\nMr. Hood may have to answer that.\nThey both offer savings, traumatic cost savings over skilled nursing, institutional placement,\nso the degree to which one may be cheaper than the other, it may be that Mr. Hood should\nWell, Medicare is subsidizing this program, so I mean, I would say that's a large part\nof why we expect savings.\nI don't know, there's certainly not going to be savings per se immediately because what\nyou're doing is you're going from a standard of care where there is no management, largely\nmost of these members are in fee for service today and they are managing their own care.\nAnd then what would traditionally happen is they would reach a point where they have to\ngo to the nursing home, their family or themselves, and then they go. If they elected pace, then\nthat option would divert them from a nursing home. You're going to see savings because\nof that managed care over time and the diversion from the nursing home. But from a financial\nstandpoint, this next year, I don't expect to see savings. We did a review of that and\nwhat we expect is that it's budget neutral in the first years. But it's really difficult\nto pin that down because you're trying to estimate who is indeed going to go to a nursing\nhome versus not and we did our best attempt with that with the actuaries and determined\nthat we believe we budget neutral and the long term of course we would have savings because\nwe would not be sending people to a nursing home and keeping now the hospital and just\nthe managed care component part.\nBut yet this bill exempts pace from meeting the requirements of a managed care organization,\nright?\nright, because we are using the Medicare standards and all the Medicare certifications and that's\nwhat we want to use to manage the program because of that substance in their participation.\nThat's the reason for that.\nWhereas if you had a CMO, that is not the case.\nThat is purely Medicaid or if you had an HMO like Kaiser, that's a private entity.\nThat's generally what's expected for in the statute and what it would regulate and this\nis separate and important because of the Medicare component.\nRight. And I think the state did an important difference is that there's there's a\nmanagement of the overall needs of the client as opposed to relying on the\nclient's own personal support system to manage all that. Absolutely. Absolutely.\nPiece of the puzzle as we like to say here. Alrighty. I'm not sure there's a wrap\nup that's needed on this one. So, uh, the, uh, consideration.\nI got Senator Chairman Sessler says, move, do pass. We'll have a seconded. We'll do, uh,\nuh, Chairman Walker and, uh, any further discussion can't imagine there would be. So we are, all\nthose in favor say aye. All those opposed like sign passes unanimously. Thank you, Chairman\nand I'll be happy to carry that bill.\nThank you, Chairman.\nI'll get it to you.\nAll right, as I said earlier, we're\ngoing to swap out here because Leader Williamson is not here.\nI'm going to carry the bill for him.\nSo I'm going to turn it over to my vice chair.\nOkay, our next bill is House Bill 1083, and that's representative Williamson's bill.\nAnd they else say that I have is 540348S, which is a committee sub.\nIs that what you have, Senator Watson?\nThat is it.\nOkay, floor yours.\nThank you, Chair Lady.\nThis has basically a date change.\nWe're relating to adult residential mental health programs.\nWe passed this legislation a couple years ago\nand the rules took longer than we anticipated.\nlonger than we anticipated, but the rules have been done.\nThey just didn't get done until the end of last year.\nSo folks who have been in this adult residential mental health program have had provisional\nlicenses and this just basically extends the license from, as you'll see, from those\ndates on lines 30 from December to June, so about a year and a half.\nthe same for line 33 and then again about a year and a half on line 38 and that's it.\nI have one question for you, Mr. Chair. So is it correct that the rules have been\npromulgated but they just haven't had the public comment period and all of that\nor they have not been promulgated? Yeah I'd love that. Mr. Food can save me\nSo the rules have, we had draft rules and we had public comment and we have not reached\nresolution on all the public comment that was there and some of those comments were\nfrom the primary provider who had the provisional license.\nSo we need additional time to get to a place where we feel comfortable to come back to the\nboard and adopt final rules to try and work through those commentary.\nWe certainly don't want to displace the provisional license that is in place so the legislation\nis to extend that while we continue to work through that process.\nOkay, questions from the committee?\nWe have one person signed up to speak.\nStan Jones?\nJoe Hood has reported what I would have said.\nStan Jones, the represent scholar trail,\nwhich is the provider that has been a partial care on the floor,\nand we added a residential subacute program\nOkay. Any questions? Okay. Okay. Okay. We have a motion due pass by substitute. Right? Yeah. I'll see 540-348S and need a second. Okay.\nsenator Butler and any further discussion? Okay, all in favor say aye. Opposed?\nSame sign. Okay, the bill passes by substitute. Thank you.\nSo, just a heads up on Wednesday, we'll be meeting, we have three or four bills that are already teed up, and we'll continue to March three, we have really counting this when we have four meetings, maybe five meetings to get all the bills done, and that's not just for HHS, that's for everybody.\nSo, just FYI, I really appreciate that meeting adjourned.\nYou\n",
  "updated_at": "2026-02-12T19:18:48.008553+00:00"
}