{
  "video_id": "1Y-Ekx0jKlc",
  "url": "https://www.youtube.com/watch?v=1Y-Ekx0jKlc",
  "title": "Senator Hickman | Disability and Employment Press Conference | 1/29/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 27,
  "summary": "Here is a structured markdown summary of the Georgia Senator Hickman | Disability and Employment Press Conference | 1/29/2025 session:\n\n**Overview:**\nThe session focused on the Dignity and Pay Act, a bill introduced by Senator Billy Hickman to end the use of sub-minimum wages for workers with disabilities in Georgia by 2027. The session featured speeches by advocates highlighting the unfair practice of paying some Georgians with disabilities less than minimum wage.\n\n**Key Actions:**\n**HB 1125**: The Dignity and Pay Act, introduced by Senator Hickman, aims to phase out the use of sub-minimum wages for workers with disabilities in Georgia by 2027.\n\n**Bills Introduced (First Reading):** \nNone detected.\n\n**Notable Moments:**\n- Executive Director of the Georgia Council on Developmental Disabilities, Darcy Robb, spoke about the current law that allows some disability service providers to pay workers with disabilities less than minimum wage, with documented cases of wages as low as $0.22/hour.\n- Advocates, including the sister of a worker with a disability, shared personal stories about the impacts of sub-minimum wages and the capabilities of workers with disabilities when given the opportunity.\n- Senator Hickman introduced the Dignity and Pay Act, explaining that the current law sends the wrong message about the value of contributions from people with disabilities, and that fair wages are possible as evidenced by Georgia's \"Georgia as a Model Employer\" law.\n\n**Votes:** \nNone detected.\n\n**Attendance:**\nQuorum present, with over 200 advocates in attendance.\n\n**Adjournment:**\nThe session adjourned. No information on the next session date.",
  "transcript": "All right. Good afternoon, everyone. Welcome. We are going to go ahead and get started.\nThank you all so much for coming out today. I'm Darcy Robb. I am the Executive Director of the\nGeorgia Council on Developmental Disabilities. We are here, myself and this staresful of advocates\nbecause right now, today, it is legal to pay some hard-working Georgians less than minimum wage.\nThat is legal in our state as of today. Now, I want to point out, there are no private companies\nin Georgia. No private companies are doing this. No. We have eight disability service providers\nthat have a special certificate from the federal government known as 14C.\n14C allows those providers to employ Georgians with disabilities, but they're paid less than\nminimum wage. Now that is made possible by an antiquated federal law known from the federal\nFair Labor Standards Act. Not every state does this. Right now 13 other states have stopped\nallowing sub minimum wages to be paid. Georgia is going to be the next one. But\nright now we still have 14 C. And so that means right now about 250\nGeorgians with disabilities are being paid below minimum wage. There is no\nlow limit. There's no there's no floor unless y'all. There's no bottom on what\nyou can pay someone. And so there are documented cases of people being paid as\nlow is $0.22 an hour. You heard that right. $0.22 an hour. So on one hand, you have that.\nOn the other hand, you have other Georgians with disabilities all over the state who are\nbuilding careers and pursuing education. And many of those are the folks standing right\nbehind me. Yes, please give them a round of applause. We have advocates across\nGeorgia. You're going to hear from the sister of one of them later today who\nwere being paid sub minimum wage because someone had told them you can't do\nany better. That is a lie. That is a lie. The young man that you're going to\nhere about today has been working in a competitively paid job for some time now.\nAnd there are people all across Georgia doing the same.\nWe know it is possible for everybody to be in the right job with the right support.\nYou have people like our inclusive post-secondary education students, many of whom are here today.\nThey attend college along with their peers.\nThey have internships.\nThey participate in social life.\nAnd when they complete their education, these young people will go on to build careers at\nfair wages as they should, because we are living in a world in a state where we know that\neducation and careers are possible for all people.\nAnd to help make that promise a reality for all Georgians, I'd like to introduce Senator\nBilly Hickman to speak about his legislation.\nThank you, and good afternoon, everyone, and thank you for being here.\nWhat a great crowd.\nI'm proud to stand here with over 200, I think it's more than 200, advocates to introduce\na bill called the Dignity and Pay Act, which will help ensure that every work in Georgia\nearns a fair wage for the work they do.\nRight now, a law called Section 14C,\nwhich I was not aware of until we got involved with this.\n14C, as the Fair Labor Standards Act,\nallows community rehab providers to pay workers\nwith disabilities less than minimum wage rates.\nSometimes it's little is just a few cents an hour.\nThis law is outdated and unfair.\nIt seems a wrong message about what people with disabilities can achieve and the value\nof their contribution to our economy and our communities.\nLast year, along with a lot of people, I worked very hard to pass the Georgia as a model\nemployer act, coming in front of the game bill, which made our state a leader in hiring\npeople with disabilities for state jobs.\nlegislature show what people, what's possible,\nwhat we invest in talent, break down barriers,\nand focus on competitive jobs for people with disabilities.\nIn fact, in the Senate, we have a lady named Martha\nthat started last week for last, who works in our refreshments.\nThat's a part of this game bill.\nThe game bill, what we said was we could not expect people in Georgia\nindependent business in Georgia,\nhire people with disabilities\nif the state of Georgia was not willing to hire people.\nAnd that's what the game bill is.\nNow it's time to take the next step.\nThey make sure no work in Georgia\nregardless of disability is paid less than they deserve.\nThe dignity and pay act\nwere in the use of sub-minimal wages\nby community rehab programs in Georgia by 2027.\nWe know this can work. Only eight of the hundreds of community rehab programs in Georgia still\npay less than minimum wage. And all traditional business here in Georgia, the higher people\nwith disabilities, pay them fair wages. It's not right. These companies prove every day\nthat inclusion is not just the right thing to do. It's good for business also. Our bill\nis about fairness. It's clean and it's simple. It's about giving everyone the chance to\nearn a living wage and showing that we value the work and contributions of every Georgian.\nI'm very grateful to the advocates, to the families, and many organizations who push\nfor this change for years. Your voices have made this possible. Your determination has made\npossible. Together we're keeping Georgia the best place to work, live, and do\nbusinesses for all people. Thank you and I look forward to working with my\ncolleagues in the Senate in the House to pass the Dignity and Pay Act this\nsession. Thank you.\nGood afternoon.\nI'm going to try to get through this without crying, but it's probably not going to happen.\nThis is my brother, Trey, St. Pierre.\nHe's 36 years old, and I'm his sister, Crystal, St. Pierre Stackpole, here on behalf of him.\nhe couldn't be here today. Why you might ask? Because he's at work.\nThis is a picture of him at Zach's piece in our local area in Ringel, Georgia. He's\nbeen there for five years. He works as a team member about eight hours a week, getting\ncan pay competitive pay rate just like his other employees.\nWhen trade first graduated Lafette High School in 2011, the only option that we were given\nis for him to attend a supported workshop, where he worked on sifting through garbage,\npulling out recycling, and a warehouse that was not heated or cooled.\nMy brother's pay rate, we did not know at the time because my mother and I didn't understand\nwhat that meant, was that his pay would be based on how fast he could sit through the\ngarbage and pick out certain pieces of recycling.\nSometimes his pay rate would be as high as maybe $1.5 an hour and it was even as low as\ntwo cents per hour and could change twice a year based on that time test.\nTray was not given the opportunity to know\nwhen that time test was.\nHis supervisors would just observe him, collect the data,\nand then alter his pay without informing him.\nAfter my brother was working at this sheltered workshop,\nit had been about three or four weeks.\nMy mother and I had realized that he hadn't brought\na paycheck home for a while.\nAnd then when we talked to his job coach\nat the sheltered workshop,\nThey said he threw it in the trash.\nAnd he threw it in the trash because for two weeks pay,\nhe brought home two pennies.\nAfter sitting down with my brother\nand understanding what happened,\nhe told me he wanted to quit\nand that he wanted to get a job like Sissy had.\nSo he sat down at the kitchen table\nand we made a list of five different places he wanted to work.\nOne of those places was a minor league baseball team\ncalled the Chattanooga Lookouts\nbecause we live in Northwest Georgia.\nFunny enough that job fair was the weekend\nprior to the time that we sat down to make that list.\nAnd so we went to the job interview\nand they hired him on the spot.\nNo need for support, no need for coaches.\nThey were just happy to have trade there.\nHe worked there for five seasons\nand then after five seasons, COVID hit.\nSo then trade came to me and said,\nI wanna job, I can have year around\nbecause as we know, baseball is seasonal.\nSo we utilize vocational rehab\nwhere he got a job at Zach Spees\nand he's been there for five years\nworking competitive, right.\nTrey feels like he's a part of his community.\nHe calls his Zach Spees co-workers,\nhis Zach Spees family,\nand he looks forward to going to work every day.\nIt is his favorite day of the week\nwhen he gets to go on Wednesdays and Fridays.\nGetting that paycheck for two cents,\nreally hit tray, even though he wasn't able to verbalize to me what it was, but I could\ntell that it reflected his value.\nAnd he knew that he was worth more than two cents per hour, and now he comes home with\nonly working the eight hours a week, but he comes home with $180 every two weeks.\nAs my brother was here, he would introduce himself to you, just like he does his co-workers\nand the customers that come into Zaxby's, and he'd tell them, hi, my name is Trey.\nI have Down syndrome.\nDon't limit me.\nOh, yeah, oh, yeah.\nHey, my name is Quinn Jackson. I live in Tilton, Georgia.\nI believe every citizen in Georgia has the right to work at a job.\nThey want to be paid a living wage that mean people should be valued for the work they do and should be paid at least minimum wage and\nCertainly not self minimum wage. I have a job that pays be 15 hours 15 dollars an hour and fiscal hours\nBecause they could trick the value of me my skills. It doesn't make any sense to me\nThat when people put their time into working employers think it's okay to pay\nthem less than minimum wage. I believe that it is dispatched from\nincredibly to me because other jobs like McDonald's, Burger King,\nSouth Wave, Wendy's, ZXPs, and other restaurants are making $12\na hour or more. What's best for self-elkies and other people like us\nis to insult minimum wage. It's time for us people with disabilities\nhave equal access, representation, and opportunities.\nWe can do better just like people who fought for our worker rights\nIn the 1800s, worker protested for higher wage,\nsafer working conditions, and reduced hours.\nThen again, a 40-hour shift on weekends was virtually\nunheard of in the US until people stood up for worker rights.\nNow in Georgia, in Florida, could teach paid workers\nwith disability, a sub-minimal wage,\nat less than 22 cents per hour,\nmost than less than the current federal rate, minimum wage,\n$7.25.\nAs nearly, 2023, 80% of disabled Americans over the age of 16\nwere unemployed and partly due to the pay of difference.\nOn behalf of all self-evils and representatives\nof the United for Change, ladies and gentlemen,\nI'm asking for you to listen to your heart and soul\nin both years on HB 1125.\nAnd let's get rid of self-minimum wage.\nThank you.\nthat we can't do this.\nWell good afternoon, yeah let's try that again let's see if y'all can\nand respond back, good afternoon.\nGood afternoon.\nYeah, so listen, I'm looking at all of you,\nI know who have poured so much of yourself into this work\nand to helping people with disabilities,\nwhether it is to help them get an education,\nor to be employed, or just to take the next step.\nAnd I wanna say thank you.\nYour work matters, your voice is matter here\nat our state capital, but who I really wanna talk to,\nAre these people right up here?\nI'm gonna see if I can move this a little bit\nwhere I can see y'all.\nSo let me ask you something.\nRaise your hand if you're in college.\nCome on now, come on now.\nHow incredible Georgia leads the way right now in that.\nAn inclusive post-secondary education.\nMany of you who are parents may have never thought\nthat was a possibility.\nIt's a reality.\nAnd these young people up here,\nthey are knocking the top off of every roof\nin every school they go to.\nLet's give them a hand.\nWoo!\nWoo!\nFor those of you who are in the program,\nand those of you who are peers and supports,\nand who help others be in the program,\nit is so important.\nThat education is one of the pathways\nto Senator Hickman's bill as well.\nIt all works together.\nSo to each of you, I want to encourage you.\nI want to tell you how special you are behind me\nbecause you've taken hard steps to get to this day,\nbut your independence, your perseverance matter so very much.\nSo thank you for coming to make others aware of what you're doing and how much more we can help you continue to do it and even bigger and greater ways.\nPersevere.\nI don't necessarily want to hold it.\nThat'll work.\nGood afternoon.\nLet's do that again.\nI feel so powerful.\nGood afternoon.\nThank you all for being here.\nMy name is Wendy Dean and I'm honored to speak about\nWhy Georgia is uniquely positioned to phase out Section 14C of the Fair Labor Standards Act.\nThis provision allows the payment, as we've already heard, of sub-minimal wages to people with disabilities.\nFirst, let's acknowledge the incredible infrastructure Georgia already has.\nOur state has a strong developmental disabilities network.\nOur D.D. Network, which is made up of Georgia Advocacy Office, the Georgia Council for Developmental Disabilities,\nthe Center for Leadership and Disabilities at Georgia State University and the Institute on Human Development\nand Disabilities at the University of Georgia are impeccable.\nThese entities work collaboratively to promote the inclusion, independence, and rights of people with disabilities.\nThis network fully supports the transition from sub-minimum wage practices toward competitive\nintegrated employment for all Georgians.\nToday there are still 714 C certificate holders in Georgia paying approximately 250 people\nwith disabilities at wages far below the federal minimum. Let's be clear, sub-minimum wages\nare a relic of the past. They perpetuate low expectations and reinforce segregation,\nleaving workers undervalued, excluded, and without real opportunities for advancement.\nIt's time for this to change.\nThank you. Our state's history reminds us why this issue is so urgent.\nGeorgia has, Georgia was the birthplace\nof the landmark Supreme Court case,\nhomestead versus LC,\nwhich affirmed the right of people with disabilities\nto live and work in the most integrated setting,\nappropriate to their needs.\nContinuing to allow sub-minimum wages under Section 14C\nundermines this principle,\nkeeping people with disabilities in segregated,\nsheltered workshops instead of empowering them\nto pursue competitive integrated employment.\nFederal policy has already begun shifting in the right direction.\nThe Workforce Investment and Opportunity Act\nestablishes competitive integrated employment\nas the gold standard for people with disabilities.\nAs the Department of Labor's recent notice\na proposed rule making highlights,\nThe employment landscape has improved dramatically since 1989 when these regulations were last\nupdated.\nToday, the unemployment rate for people with disabilities is at a historic low and the\nnumber of workers under 14 C certificates has plummeted.\nFrom over 420,000 in 2001 to fewer than 45,000 in 2024, this shows us that we really don't\nneed sub minimum wage and that people can work being paid fair wages.\nAs the state, Georgia is already for this transition, the tools and expertise already exist\nto support employers and individuals in moving to a model of competitive integrated employment.\nMany states, it was mentioned earlier, 13, in fact, have enacted legislation to phase\nout 14C, demonstrating that not only is it possible, but it's successful. These states\nhave shown that with the right support in place, individuals with disabilities can thrive\nin meaningful, well-paid employment. Finally, I want to emphasize that the U.S. Department\nof Labor's proposed three-year phase out period is more than sufficient. The conversation\naround ending 14C has been ongoing for years and many employers have already begun adapting\nto this inevitable change. With the support of Georgia's DD network and the resources\navailable through state and national incentives, we can ensure a smooth and successful transition.\nIn closing, I urge all of us to embrace this opportunity to create a more equitable workforce.\nA phasing out sub minimum wages, Georgia can honor its commitment to inclusion, independence,\nand equal opportunity for people with disabilities.\nTogether, we can ensure that every Georgian has the chance to work, contribute, and earn\nfair wages.\nThank you.\nAll right. That comes to the end of our featured speakers. Thank you all so much. We want to open it up now and see if there are any questions.\nOkay, well that's a great question, what would be our message to other lawmakers about\ncoming to the table and supporting this legislation? Senator Hickman, do you want me to take\na stab at that or do you want to take that one?\nSo her question was what would be the message to other lawmakers about why they need to come\nthe table and support the legislation.\nI really don't think, be honest with you, I don't think we're going to have an issue.\nYou know, the second signer on this bill with me was Senator Drew Eccles.\nAnd Senator Eccles has got an autistic son, so I think that when people, when we learn\nmore and more, and I really don't foresee it as an issue.\nI'm really excited about it, we're going to push it hard, and I really don't see it\nissue. Yeah. I don't. I don't. You never know what's going to pop up, but I don't. Thank\nyou for the question. Any others? We must have made ourselves crystal clear. Everyone\nunderstands about the importance of getting rid of sub-minimum wage. Okay. All right.\nOkay. I'm sorry. Can you repeat it one more time?\nSo the question was how do we make sure that these types of pay disparities don't happen\nin the future?\nI think the legislation is really the cornerstone of that because right now, you know, minimum\nwage has been the law in this country for a long time.\nThis is a law from the 1930s, a federal law that carved out specific groups of people.\nSo once it's illegal here in Georgia, like it is in 13 other states, that last little\nhandful of providers who are currently paying people below minimum wage, they're going\nto stop doing it because it's going to be against the law.\nNow I think what people go to after that is, and we have this happening already, y'all,\nWe know now how to support people in competitive integrated employment.\nThere is a gentleman, and I have permission to share his story by the name of Chad Roberts\nup in North Georgia.\nSignificant impact of multiple disabilities doesn't speak very much in words.\nEverybody in this young man's life thought he would go to a sheltered workshop or an\nadult daycare for the rest of his life.\nHis mother did not.\nHe has worked ever since he's gotten out of high school.\nAnd it turns out that when you are meticulous and you like to work with your hands, that\nis a very big advantage when it comes to working in an organic greenhouse.\nHe also works for multiple law firms shredding their documents.\nWe know you just have to be creative.\nWe know that you can design a career for everyone.\nThere is entrepreneurship.\nThe biggest business incubator for people with disabilities in the country is located\nright here in Georgia.\nIt's called Synergy's Works.\nWe have all these options.\nThere are no more excuses for people not to all be able to build individual careers.\nThat was a long answer.\nI had a lot of thoughts.\nThat's a good question.\nHow do we ensure people have access to all these services and supports?\nWe keep advocating and we keep trying to inform people of what's available.\nWe make sure that people know their rights when it comes to asking for what support they\nneed in schools, IEPs, 504s.\nWe make sure people know about inclusive post-secondary education.\nWe encourage people to go to Georgia's technical schools, universities, internships.\nWe make sure people know to connect with the Georgia Vocational Rehabilitation Agency\nand advocate for their needs, for their jobs, to connect with DBHDD, and to get waivers\nor to get family supports.\nI think it's just educate, advocate, advocate.\nAll right, y'all, unless any other speakers would like to wrap us up with some inspiration,\nI think we will close that on today.\nI hope you all see what's possible,\nand please keep talking to your elected officials.\nLet them know what the community needs.\nThank you.\nThank you very much.\n",
  "updated_at": "2026-02-12T19:07:51.238823+00:00"
}