{
  "video_id": "1yVap7Mt9BY",
  "url": "https://youtu.be/1yVap7Mt9BY?t=1061",
  "title": "Georgia House - Day 37 (2026-03-21)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 37,
  "video_date": "2026-03-21",
  "duration_minutes": 134,
  "summary": "Here is a summary of the Georgia House session from 2026-03-21:\n\n**Overview**:\nThe session included a scripture reading and prayer by Reverend Reginald Williams, who was recognized for the 100th anniversary of his church, Little Zion Baptist Church. The representatives discussed several bills and engaged in some procedural matters.\n\n**Key Actions**:\n- **SB 1**: Passed\n- **SB 110**: Passed\n- **SB 131**: Passed\n- **SB 135**: Passed\n- **SB 155**: Passed\n- **SB 20**: Passed\n- **SB 64**: Passed\n- **SB218**: Passed\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Reverend Williams gave an inspirational speech emphasizing the importance of love and service to the community.\n- The representatives recognized the 100th anniversary of Little Zion Baptist Church.\n\n**Votes**:\nAll bills mentioned were passed with either unanimous or majority support.\n\n**Attendance**:\nA quorum was present, as all members voted to signify their presence in the chamber.\n\n**Adjournment**:\nThe session adjourned, with the next session date not specified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you We will come into the chamber and take your seats. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine. The doorkeepers will be pleased to close the doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 52nd House District of the chamber. Thank you, Mr. Speaker. Colleagues, it is my honor and pleasure to introduce to you, Reverend Reginald Williams. He has been preaching since 1992, was ordained in 1994. He is an alumnus of Bryant Theological Seminary in May 2017. He received a Bachelor of Arts degree in pastoral theology from Carver College and a certificate of theology from the Baptist International Bible Institute. He is also currently working on his masters. While Reverend Williams understands that academia doesn't make a preacher, he does believe it provides him tools that help him in his service to his congregation. In October 2002, Reverend Williams became the 13th pastor at Little Zion Baptist Church, which is located in Brookhaven's Linwood Park neighborhood, considered to be the oldest historically black neighborhood in DeCab County. He has been a strong leader for more than 20 years. Reverend Williams has established numerous new programs for its members, as well as establishing outreach programs in the communities such as ministering to seniors and prisoners. He has revitalized the youth program and is also added to deacon ministry. He is beloved by his congregation, and we are also celebrating a very important anniversary with them this year. Little Zion Baptist Church is 100 years old. We have some members of the congregation up in the gallery. We have his wife Cynthia, his daughter Jessica, and retired general Richard Dix, as well as other special guests. Could you all please stand so we can recognize you and celebrate your anniversary with you? Welcome to the People's House. In recognition of this milestone, it seemed only fitting to invite Reverend Williams to be our pastor of the day. And with that, Reverend Williams. To the speaker of the house, John Burns, Representative Shay Roberts, and all to make up this great Georgia House representatives is indeed an honor and a privilege to stand before you. I bring you greetings from the little Zion missionary Baptist Church in Brookhaven, Georgia. I am humbled and grateful for this opportunity. And then again, aren't we all humbled and grateful for the great opportunity we collectively possess at this present time? We have the blessed opportunity to serve and make great impact in this great state of Georgia and the greatest country in the world. We have a chance to change history to make history. The question naturally forms then in our mind. How do we make the best of this opportunity we have been entrusted with? At first glance, one would look for a high moral ethical view. One would say the principle of the Golden Rule. The Golden Rule has been posted in countless establishments for many centuries, even dating back to ancient times. In 1913, it was posted at the Atme Sucker Rod Factory in Toledo, Ohio, where there was a sign posted at the employee interest that says, therefore, what's every you would do that men should do to unto you? Do you even so one to them? The principle is treat others as one wants to be treated. This concept can be found in nearly all facets of life in almost every ethical tradition. In ancient Egypt, it is stated, now this is the command due to the doer to make him do. In ancient India, one writer wrote, one should never do something to others that would regard as an injury to one's own self. Ancient Greece writer put it this way. What you do not want to happen to you do not do it to your self either. The Golden Rule stands elevated in the highest point of moral ethics. However, it centers on loving others based on the individual's perception of love. Today, I asked the question, I want you to consider, there is a better way. We need something higher than moral ethics and personal values for the great opportunity we have been entrusted with today. For we, those who we serve, who we represent and labor deserve better. But what can be better than the Golden Rule? Recently in my ethics class of love, my professor asked us to define love. Now I'll spare you the mundane details and the statements that was given by many of my peers. But one thing was certain, love trumps on. Love looks beyond faults and supplies the need. True love provides what's needed, even if it is not light. Any of us remember parents providing penicillin to us, although it was not light, or providing vegetables to help us develop good healthy bodies, although the taste was undesired. It was all done for the good and in love. Well to further my case, Jesus shared on the subject of love. He declared in Mark 12, 30 and 31, that shall love the Lord thy God with all thy heart and with all thy soul, with all thy mind and with all thy strength. This is the first commandment, after which he shared the Golden Rule. And the second is like this, namely this, thou shall love thy neighbor as thy self. There is none other commandments greater than these. The first commandment centers and gives purpose and it should not be divorced from the second. Let us strive to love God with our whole being. And doing so, we will ensure that we will serve, we will serve in love and that love will be blind from our own prejudices. It will be motivated by pure love and boldness to stand no matter the challenge. I'm excited full of zeal and vigor because we have been chosen. Each of us have been chosen to serve this present time. We have been opportunity to leave our marker in history. Others have come and performed to the best of their ability. Now it's our time. It's our opportunity to do great things. Georgia House representatives, let's band together and march our state, our country forward, into a brighter future. I suggest we leave in an irrefutable mark and we can do this by the principal thing. Love. Let us pray. In short, our God our Father, Creator of all things, we are grateful for your love and for your faithfulness. Today is a new day. You have blessed us with a myriad of opportunities to have great impact today. For this I say thank you. Thank you for keeping all of us. Thank you for your many graces, for all of your goodness and your kindness, for choosing us to assemble here today. And we thank you for this great body. We pray, Lord God, that you will bless them. Most of you are a dain to stand and represent this country, this state. We pray, Lord God, for wisdom. We pray, Lord God, for understanding. We pray most importantly for compassion. Lord God, I pray that this great house would do things pleasing in your sight, that we may represent you and that this country will continue to be a beacon of light all around the world. Lord of all, so that any of our sins, we are God that we may have a right relationship with you. It is in Jesus' name I pray. Amen. We now have the pleasure of allegiance. I pledge allegiance to the flag of the reminded states of America and to the republic for which it stands. One nation.\n\nThank you. Thank you. Thank you. The door keepers will unlock the doors. Pastor Williams, thank you for that message and congratulations to you and your congregations on your first hundred years. Congratulations. Thank you. Thank you. Thank you. Members, we can have your attention. Chairman Tarvan is recognized that chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Mr. Speaker, your Committee on Information and Audits has read the journal of Previous Legends, and found it to be correct. And just a little something for us to think about. The expert in anything was once a beginner. Well, Chairman Tarvan, that's a lot to think about right there. And I'm just telling you, spot on as usual. Thank you, Chairman Tarvan. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there an objection to dispense with the reading of the journal? The chair here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? The chair here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, registration of the 104th Moose Follomew establishes the order of business during the first part of the period unanimous consent. Introduction of bills and resolutions for this reading and reference of House bills and resolutions. Second reading of bills and resolutions before it's a standing committees. Third reading and passage of uncontested local bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill 793 by reps and a part of the fifth hatch into the 150th Hutchinson and 106th. Cooper the 45th and Dempsey the 13th. Bill Bitton and act to amend article on chapter 10A of Title 43, the fish go to George Anatetti relating the licensing provisions regarding professional counselors. Regulated industry. House bill 794 by reps and a mention of the 88th Oliver the 82nd trend of the 85th and the 100th of the 95th Crawford of the 84th and others. Bill Bitton and act to amend chapter 3, a title 12 of the fish go to George Anatetti relating the parks, historic areas, memorials and recreation. Governmental affairs. House bill 795 by reps and a day was the 87th scope field of 63rd Scott of the 76th. Kendrick of the 95th Roberts of the 52nd of bill Bitton and act to amend code section 1612, 140 of the fish go to George Anatetti relating the criminal abortion. Public and community health. House bill 796 by reps and a day was the 87th Scott of the 76th. House bill 797 by reps and a trend of the 80th. Bill Bitton and act to amend chapter 2A at Title 31 of the fish go to George Anatetti relating the department of public health. You're regulated industry. House bill 798 by reps and a carper to the fourth. Bill Bitton and act to amend chapter 1 and a title 10 of the fish go to George Anatetti relating the selling and other trade practices. Regulated industry. House bill 799 by reps and a reason 99th Gunner of the 8th. Saints of the 180th. Silk Cox of the 53rd. Kelly of the 16th and others. Bill Bitton and act to amend code section 472321 of the fish go to George Anatetti relating authority. The board for the Georgia Judicial Retirement System. Retirement. House bill 801 by reps and a Wilkes and a 38th Smith of the 41st. Bill Bitton and act to amend and act incorporating the city of Mabelton. Andra governmental coordination. House bill 803 by reps go field of 63rd. Scott of the 76th Davis the 87th. Bill Bitton and act to amend chapter 15 to title 25. You fish go to George Anatetti relating the other safety inspections and regulations. Natural resources and environment. House bill 804 by reps. Seabull of 34th. Crow of the 118th. Corporate of the 174th. McDonald the 26th gains the 120th. Bill Bitton and act to amend article 7 of chapter 2. A title 40. Fish go to George Anatetti relating the motor vehicle license fees and glasses. Motor vehicles. House bill 805 by reps and a math is the 149th. Bill Bitton and act to amend and act to provide a $15,000 homestead exemption from certain ad ballorum taxes. Andra governmental coordination. House bill 806 by reps and a math is the 49th. Bill Bitton and act to amend and act restating and re-reacting a certain homestead exemption from ad ballorum taxes. Andra governmental coordination. House resolution 545 by reps. Weigh to the 9th jazz. The 11th Hawkins the 27th. Resolution honoring the life and memory of Mrs. Hopele Gibson Crawford Barron and dedicating an intersection in her marriage. Transportation. The clerk suspend just for a minute. I'm sure the Senate can hear every word you'll say and y'all talking so loud. So let's take it down just a little bit. Give the clerk your attention. Some members want to know where their bills are going. So let's give the clerk your attention. Continuous to clerk. House resolution 546 by reps. Math is the 149th Gunner the 8th Smith of the 18th. Laptop out of the 17th. Lumbing to the 125th and others. Resolution supporting the work of law enforcement agencies and state of Georgia. Public safety and homeland security. House resolution 547 by reps. Andra matiac. The 74th Gunner the 8th hatched to the 150th. Resolution creating the House study committee on rural medical personnel recruitment. Special rules. Resolution 563 by reps. Andra's the 10th. The power of the 33rd. Resolution creating House study committee on licensing of the tree care hidden. Regulated industries. Resolution 564 by reps. Dubnic of the 29 Jones the 47th or one of the 32nd. Jones the 25th. Jasper's the 11th and others. Resolution proposing a member to the Constitution says to provide for the election. Members of the State Board of Education. Education. House resolution 565 by reps. A corporate of the 174th. Newly the 64th. Ridley the 6th. Resolution creating House study committee on motor vehicle dealer license plates and temporary operating permits. Motor vehicles. House resolution 566 by reps. Andra's the 48th. Cooper the 45th. Stevens the 164th. Sebald the 34th. Hatchet of the 150th. Resolution creating House study committee on Georgia's COVID-19 response. And future pandemic preparedness. Public and community health. House resolution 567 by reps. Andra's the 21st Jones the 25th. Or one of the 32nd workhives of the 157th. Martin the 49th and others. Resolution creating the House study committee on workforce innovation and development. Special rules. That completes first readers. Second reading of bills and resolutions. The clerk will read House bill 743 by reps. The bill to amend and act to reconstitute the Board of Education of Hart County. Health bill 744 by reps. The bill to amend and act to create the Board of Commissioners of Hart County. House bill 745 by reps. Cali the 16th. Hatchet of the 150th. Perk of the 169th. Collin of the 30th. The bill relating to regulation and construction of hospitals and other health care facilities. House bill 746 by reps. Carson of the 46. A bill relating to the employees. Retirement system of Georgia. House bill 747 by reps. And the claim of the 109th. Based more of the 69th. Douglas of the 78th. Wilkinson of the 38th. A bill relating to special license plates promoting or supporting certain where the agencies funds are nonprofit corporations. House bill 748. By represent Reeves of the 99th. Abstration of the 104th. Clark of the 108th. The claim of the 109th. The total of the 105th and others. A bill to provide an additional home state exemption from Quenette County School District at Blurham taxes. House bill 749 by reps. Smith of the 18th. The bill to authorize the assessment and collection of a technology fee by the Magistrate Court of Herylson County. House bill 750 by reps. A week hour of the 121st. A bill to create the City of Watkinsville Public Facilities Authority. House bill 751 by represent Carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to provide a new home state exemption for City of Cajada. House bill 747. A bill to amend and act to provide a new home state exemption from Maconnie County. House bill 753 by reps of Carpenter. The 4th. Terminal of the 2nd. Ridley of the 6th. A bill to amend and act to providing a home state exemption from Whitfield County School District at Blurham taxes. House bill 754 by reps. A carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to provide a home state exemption from Whitfield County at Blurham taxes. House bill 755 by reps. A carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to provide a new home state exemption from City of Tunnel Hill at Blurham taxes. House bill 756 by represent Carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to amend and act to provide a home state exemption from City of Dalton at Blurham taxes. House bill 757 by represent. The load to the 167th. The bill to amend and act to create a new charter for the City of Ludwitchie. House bill 758 by reps of Carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to amend and act to provide a new home state exemption from City of Dalton at Blurham taxes. House bill 759 by reps. The 7th. The bill to amend and act to provide a new city charter for Peach Tree City. House bill 760 by reps of Bonner of the 7th. The bill to amend and act to appeal in a place. The charter of the town of Tyrone. House bill 761 by represent. Carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to provide a new home state exemption from City of Tunnel Hill at Blurham taxes. House bill 762 by represent. Carpenter of the 4th. Terminal of the 2nd. Ridley of the 6th. A bill to amend and act to provide a home state exemption from City of Dalton at Blurham tax. House bill 763 by reps. We now have 120 first gains with 120. At the bill to provide a home state exemption from Maconey County at Blurham taxes. House bill 764 by represent. at the Belts to provide a home set exemption from Maconi County Edelwarz taxes house bill 765 on this adjuster with all of the 121st and Gains of but and tell them in an act similarly to insects fashion from a county out of Lauren types have seven 66 minutes we so we're gonna open He's included this except the expansion from a county County he's published vehicles infections house bill so but set up a lot of filed are 120 for the ones with a perfect The second, the fourth, the second, the second, the sixth, the bill to provide a new home state exemption from the city of Cajada, Adeloran, Texas, House Bill 772 by the Meeks of 178. A bill to authorize the assessment and collection of a technology fee by the State Court of Bacon County, House Bill 773 by the rest of the margin of the fifth. The fifth, the sixth, the sixth, the sixth, the 11th, the bill to provide a new charter for the town of Ranger in the County of Gordon, House Bill 774 by the rest of the park, the park, the 169th, a bill to amend and act to create a board of commissions of Irwin County, House Bill 775 by the rest of the Williamston of the 112th, Fleming of the 114th. A bill to amend and act to continue the charter of the Academy of Social Circle and create a school district of Social Circle. House Bill 776 by the rest of the 24th, the town of the 26th, cocks of the 28th, Jones of the 25th, Jasper's the 11th and others, a bill to amend and act to create a four-size-county board of registrations and elections. House Bill 777 by the rest of the claim of the 109th Reaves of the 99th, Clark of the 108th, Miggle of the 105th, the benefit of the 94th and others, a bill to amend and act to create a board of commissioners of Gwyneth County, House Bill 778 by the rest of the town to the 179th Sains of the 180th, the leisure of the 167th, a bill to amend and act to create a state court of Glyn County. House Bill 779 by the rest of the Montaillan of the 17th, Gullet of the 19th, Kelly of the 16th, Smith of the 18th, the bill to amend and act to provide the election in members of the Pauling County Board of Education, House Bill 780 by the rest of the hood of the 175th, Bill to create the Brooks County Public Facilities Authority, House Bill 781 by reps of Holly of the 116th, Pro of the 118th, Douglas of the 178th, Matthew of the 74th, Louis Ward of the 115th and others, a bill to create and establish the Henry County Building and Facilities Authority. House Bill 782 by reps of Anderson of the 10th, the bill to amend and act to re-incorporate the city of Diller in the County of Raven, House Bill 783 by reps of Jenkins of the 136th, a bill to create a new charter for the town of Moryland, House Bill 784 by reps of Holly of the 116th, Pro of the 118th, Douglas of the 78th, Matthew of the 74th, Louis Ward of the 115th and others, a bill to create the Henry County Airport Authority, House Bill 785 by reps of the 124th, a bill to provide for creation of one or more community improvement districts in Green County, House Bill 786 by reps of Carpenter of the 4th, Carpenter of the 2nd, Ridley of the 6th, a bill to amend and act to provide a home side exemption from the city of Dalton, Adelor, on taxes, House Bill 787 by reps of Carpenter of the 4th, Carpenter of the 2nd, Ridley of the 6th, a bill to amend and act to provide a home side exemption from Whitfield County School District, Adelor, on taxes, House Bill 788 by reps of the weeks of the 178th, a bill to amend and act to provide a new charter for the city of Blackshare. House Bill 789 by reps of Carpenter of the 4th, Carpenter of the 2nd, Ridley of the 6th, a bill to provide a home side exemption from Whitfield County Adelor, on taxes, House Bill 790 by reps of the 99th, Carpenter of the 101st, Clark of the 100th, along with the 103rd, Muggle of the 100th, and 5th, a bill to amend and act to create a new charter for the city of Swany, House Bill 791 by reps of the now of the 121st, gains of the 120th, a bill to amend and act to provide a new home side exemption from Aconi County School District, Adelor, on taxes, House Bill 792 by reps of the 58th, Holland of the 54th, Bruce of the 61st, Gofield of the 63rd, Jones of the 60th, and others, a bill to amend and act to continue the existence of the Atlanta Independent School System, House Bill 800 by reps of the Maynard of the 56th, Olaulia of the 59th, Thomas of the 65th, Evans of the 57th, Jones of the 60th, and others, a bill to amend and act to create a full-ton technology and energy enhancement authority, House Bill 802 by reps of the Chastain of the 7th, a bill to provide a new charter for the town of Morganson. House Resolution 521 by reps of the 10th, Metro of the 88th, Glaze of the 67th Miller of the 62nd, Cummings of the 39th and others, Resolution of the 1st, President Joe Biden, House Resolution 522 by reps of the 120th, we now have the 121st, Friday of the 120th, Second Roads of the 124th, Hilltops of the 53rd and others, Resolution honoring Mr. Vincent Ches of Julie, Dedicating an Intersection in his memory, House Resolution 523 by reps of the 100th, 24th, Canon of the 172nd, Resolution honoring the life of PFC John W. Adams, Dedicating a Road in his memory, House Resolution 524 by reps of the 58th, Lane of the 109th, Scofield of the 63rd, and Scott of the 76th, Resolution honoring the life of Mrs. Jemita Orange, and Dedicating an Intersection in her memory, House Resolution 525 by reps of Canon of the 58th, and all of it to the 42nd, Clark of the 108th, Resolution honoring Mr. Marshall Ramford, and Dedicating an Intersection in his memory. Senate Bill 289 by Senator Jones of the 10th, Strickland of the 17th, Williams of the 25th, a bill to provide a home study exemption from City of Hampton, Admiral Arm, Texas, Senate Bill 290 by Senator Jones of the 10th, Strickland of the 17th, Williams of the 25th, a bill to provide a home study exemption from City of Hampton, Admiral Arm, Texas, and it bill 297 by Senator Hodges of the 3rd, a bill to authorize the McIntosh County to exercise all redevelopment of the powers under the redevelopment powers law. Senate Bill 298 by Senator Anderson of the 43rd, a bill to amend and act creating the Board of Commissioners of Rockdale County, Senate Bill 299 by Senator Mallow of the 2nd, a bill to authorize the governing authority of the City of Port Wimp, where to, WNX-sized tax, Senate Bill 301 by Senator Walker of the 3rd of the 20th, a bill to amend and act providing election of members of the Board of Education of Dodge County, Senate Bill 302 by Senator Sims of the 12th, a bill to amend and act providing a home study exemption from early county school district, Edelorn, Texas, 3rd 2nd Raiders. Reports of Standing Committees, the clerk will read. Senator Robert Tickley, the 145th District Chairman of Committee on Agriculture and Consumer Affairs submitted the following report. We're speaking to your committee on agriculture and consumer affairs. Senator, it's consideration following bill of the Senate. It's a structure meeting report, same back to the House, the following recommendation, Senate Bill 177, do pass by committee substitute, respectfully submitted, Representative Robert Tickley, the 145th District Chairman. Representative Beth Camp, the 135th District Chairman on Committee on Intergovernmental Coordination Local submitted the following report. We're speaking to your committee on Intergovernmental Coordination Local's added under its consideration following bills of the House. Instructed to me to report the same back to the House the following recommendations, House will 716, do pass, House will 722, do pass, House will 727, do pass, House will 731, do pass, House will 732, do pass, House will 733, do pass, House will 735, do pass, House will 739, do pass, House will 740, do pass, House will 742, do pass, respectfully submitted, Representative Beth Camp, on the 135th District Chairman. That completes the reading of the report's standing committees. The third reading and passage of Uncontested Local Bills, if there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none and is so ordered, the clerk will read the local calendar. House will 716, by resident of Lumpson, to the 12th City of Cave Spring, House will 722, by resident of Campbell, the 35th City of Vackworth, House will 727 by resident of Deloche, the 167th City of Darian, House will 731 by resident of Drenner, the 85th to Cab County, House will 732 by resident of Green, the 154th, equipment county, House will 733 by resident of Gladney, the 130th Richmond County, House will 735 by resident of Gunner, the 8th City, High Wassie, House will 739 by resident of Seaball, the 34th Cab County, House will 740 by resident of Williams, the 168th City of Hinesville, House will 742 by resident of Green, the 154th, Clay County. Thank you, Mr. Clerk. I'm sure you members have read the local calendar, because you couldn't hear it. House will come to order, members take your seats, we're getting ready to vote. Is there any objection to the previous question being ordered on the local calendar? The chair here's none of the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here's none, the report of the committee is agreed to. Shall these bills now pass, all those in favor of the passage of the bills on the local calendar will vote yes, all those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bills on the local calendar, the yeas are 164, the nays are zero. These bills haven't received the requisite constitutional majority, or therefore passed. We have about 20 requests for morning orders, and I'm going to give you 10 minutes. Now, there are members here who have folks who've traveled a long way to be in this gallery, so I'm going to start at the top. If you want to be respectful to your neighbor, it has a good day to start. So I'm not going to hold you to one minute. If the first one wants to take 10 minutes, we're done. The rest of you can speak to that member. I think they call that personal responsibility and caring about your neighbor. Morning orders, Ripsley-Dehilton is recognized for a morning order. Representative Cooper, your own deck. Thank you, Mr. Speaker. I got a great 10-minute speech plan here. Ready, let's settle in. 30 seconds, I'm here today to recognize it. It is World Down Syndrome Day today. We are recognized World Down Syndrome Day. Yes, we have parents, advocates, moms, folks with Down Syndrome. You'd stand up so we can recognize you. Great J and Georgia. Thank you for everything you do. Thank you and God bless. Have a great day. Thank you for being here. World Down Syndrome Day. What a great day. Thank you all. We appreciate you all. Representative Cooper, let's see your whole one's. Let's see. We have Representative Williamson, Flaming and Bartina's own deck. Representative Cooper, Characlete Cooper. Thank you, Mr. Speaker. With members of the here for the Georgia Health Policy Center at the Andrew Young School of Policy, stand up. Please let us recognize you. Anybody that's not here yet? This is an organization that has been founded by the Woodruff Center for several years now that set a course for us to learn to look at issues not from the bill we are passing, but a more global view. And they have done a great job. And many of us have attended those classes and gotten a certificate. And I want to thank them and appreciate all they've done for us. Thank you, Mr. Speaker. Great day. Chairman Williamson. Representative Flaming and Bartina, as we're you're recognized for a morning order. Representative Banditia Thomas is on deck. Thank you, Mr. Speaker. Representative Williamson and Bartina is an hour happy today to have with us in the gallery. And we're going to have George Walton Academy Lady Bulldogs from Monroe, Georgia coming off their big win for the GIA. Stand up state championship that they won in the basketball. Let's give them all a round of applause. With them we have head coach Lori Hines, athletic director Mark Whitley and head of school Gary Hobbs. Thank you all for being here. Congratulations. We're proud of y'all. And importantly, they have won graduating center. A senior this year. They're going to be back next year for another state championship. Thank you, ladies. Congratulations. Chair Lady Hauston and... Let's see, Representative Ken on your own deck. Representative Banditia Thomas is recognized for a morning order. And friends. Thank you, Mr. Speaker. Greetings colleagues. Today is Environmental Justice Day at the Capitol. And I have my colleagues here with me who have spoke. This theme was World Water Day. So because it's World Water Day, you have something from UGA, Dr. Shy on your desk. We're doing free water kits and free water testing. All you have to do is put your water in the bottle and send it back in the self-postage envelope. And I just want to quickly recognize everyone who participated. All of the legislators, of course, the Director of Georgia Conservation, Georgia One. The Fulton County Commission of Environment, Black Voter Matters, and MTO. Thank you so much. Representative Hulgood \"...事來了...... ....Repiritis and repairs of your business pay..... Rep uczелю\n\nIt's chair Lady Houston and Representative Chaz Cannon recognized for a morning order. Thank you, Mr. Speaker. On October the 10th, 2022, a huge crowd gathered at the cooking lady, Geo just for a second. The member in the well deserves your attention, so we're going to have it, or we'll finish sometimes about five or six o'clock. On October the 10th, 2022, a huge crowd gathered at the Cook County Stadium to honor the passing of Terry Arnold and to celebrate his line. He was a friend to all a great Georgian and a great American, and he will be remembered for making so many people's lives better. And Representative Chaz Cannon is going to read part of it, resolution. Thank you. Resolution honoring the life and memory of Terry, Major Terry Arnold, whereas the state of Georgia recently lost one of its finest citizens, the most dedicated law enforcement officers, with the untimely passing of Major Terry Arnold. Whereas Major Terry Arnold served with the Cook County Sheriff's Office for 28 years, and previously served with both the Remington Police Department for two years in the A.D.L. Police Department for five years. Whereas Major Terry Arnold would be most known for positively affecting the lives of hundreds of children in Cook County over the course of his law enforcement career. Whereas Major Terry Arnold was highly regarded by the citizens of his community and state and by local government officials as a person of unquestioned integrity and dedication to the sound principles of law enforcement. And now therefore be it resolved by the House of Representatives that the members of this body join in honoring the life and memory of Major Terry Arnold and express their most sincere condolences that is passing. Thank you. Thank you members of Fine Man. Representative Reese and Representative Mathis. Thank you Mr. Speaker. Mr. Speaker today we have a huge blue storm here in the state capital from Wilkerson County Georgia where you have some of the most the best rolling heels in middle Georgia and the best hunting and fishing in the state of Georgia. With Wilkerson County State Championship class A boys please stand up and be recognized today and all the family and friends that are with us. Mr. Speaker this is their 11th state championship since 1999. Don't tell me that the state of Georgia students are the best and the brightest in this nation because they are. And Mr. Speaker want to take a person of privilege to recognize my mom that's in the gallery today. Miss process. Hello Miss process. Thank you Mr. Speaker. I know she's proud of you. Representative Auda Yena is recognized for a morning order. Thank you Mr. Speaker. Good morning colleagues. First of all I want to stand and start off by saying we have special guests in the House. And the one special guest in the House for 20 years has been by my side is the most beautiful woman. I also like to recognize a dear friend of mine Dr. Florence Fassan. I have a resolution for the work she has done. Dr. Florence Fassan is the founder of the Miss elegance Georgia pageant. An initiative to empower and inspire teen girls designed to promote boys integrity character community involvement and creative accomplishment. She has done this for the last seven years and she's here accompanied by one of her recipients, one of the winners 2017 Miss elegance Georgia winner Olasunbo Ubrishala. Please stand and let's give them a big round of applause. Thank you Mr. Speaker. Good job, Representative. You can go home tonight. No doubt. Representative Mogul and Hong are recognized for a morning order. And the Gwyneth. Thank you Mr. Speaker. Colleagues, please allow me to introduce an honor. Hebron Church Academy goes basketball team. They won the Class III A State Basketball Championship with an undefeated record. Thank you coach John Osargo Lions. Please stand and be recognized. Congratulations. Thanks for being with us. Representative Scopefield is recognized. Mr. Speaker, actually we have a few more from Gwyneth County. You have more friends in the gallery. We do. We do. One is to recognize our friend. My friend, our friend from Gwyneth County, Cole Porter. Stand up please. We have a resolution honoring him and his contribution to Gwyneth County. He is the president of Porter's seal. He also is very involved with the Chamber of Commerce and is the president of my rotary club, Rotary Club of Duluth. So thank you Cole Porter. Gwyneth County appreciates you. If Gwyneth County delegation will stay put, Representative Cairnard is recognized. Yes, one of the greater assets in Gwyneth County is our very own Georgia Gwyneth College. We've always been blessed with strong presidents, visionary leaders. Today we are honoring the third president of Georgia Gwyneth College. Dr. Jan Joseph, would you stand? No. And she is taking our college to higher heights. Thank you for all that you are doing for our community. Thank you. Thank you for being here, Dr. Joseph. We appreciate what you are doing. Doing great work. Representative Roberts has recognized for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. This morning we want to welcome the Georgia Youth Justice College. We have a coalition who is in the capital today. I think we have a few of their members up there. And they are here to talk with us about how we can move towards a future where young Georgians have the freedom to learn and the freedom to be themselves. It's a grassroots collective of students who are working to build power for young Georgians from the classroom to the capital. Through training and education, they help their peers to develop the knowledge and skills to reckon with our past and ultimately shape a better future here. They understand what keeps us safe, living in communities where people of every color and background have great schools and accessible healthcare, where we address problems with proven solutions like mental health counseling and safe storage for firearms. Today I hope you will join me in finding time to hear what Georgia's youth have to say and work together toward solutions for our state. Thank you. She said there are only like three of them. Representative Scofffield recognized for him more than order. Thank you, Mr. Speaker and colleagues. This weekend is the Georgia single parent fourth annual Legacy Billers Awards recognition program. This initiative was started by former state rep Valencia Stovall. Join me today as they're in the gallery welcoming Valencia Stovall honoring the single parents, ladies, and recognizing all single parents here today as a proud parent of Kyla Erika Griffin. I'm here to tell you single parents rock. Thank you, Mr. Speaker. Thank you, Representative. Representative Rees is recognized for a morning order. Thank you, Mr. Speaker. Georgia House members to your left is spectrum autism support. They are celebrating 25 years of helping people with autism in Gwinnett County. Senator Deez is Senator Bill Cowsert's sister. They are doing great and we recognize you and wish you 25 more years. Welcome. Spectrum. Rep. Chairman Chokas is recognized for a morning order. Thank you, Mr. Speaker. It is my pleasure to recognize President Dr. Neil Weaver, President of Georgia Southwestern State University. Please stand. Steven Snyder, the Foundation Director, should be over here and we've got five bright students from Georgia Southwestern State University. We just wanted to recognize them. All these folks here and we got an alumni right here. So, go canes. Go canes. Thank you, sir. Thank you, Chairman and welcome, Georgia Southwestern. Mayor Lady Houston is recognized for a morning order. Thank you, Mr. Speaker. I'd like to recognize the group from Barion County, the Barion County Chamber ambassadors. They're here to visit the Capitol today. We all please stand. And thank you for coming to the Capitol. Welcome, Barion County. Representative Joe Campbell is recognized for a morning order. Good morning. I have with me a family that's from Christ County, Rex Wilson and his family. Rex and I worked together about 35 years. He taught me the peanut business. He taught me about peanut seed. He made a career out of it. Rex, we thank you all for coming to visit with us. Thank you all for coming. See you. ** Applause** Representative Marion and Representative Martinez. If you've joined me with your guest. Clerk will read the caps into a resolution. House resolution 192 by Representative. We're in the 96th at Station 104th Beverly, 143rd Lally 8, 559th, Martinez the 111th, and others. A resolution recognizing and commanding the Latin American Association. Representative Martinez is recognized. Thank you, Mr. Speaker. I just want to congratulate my good friends Santiago Marquez since 1972 Latin American Association. So I just want to congratulate him. Pedro Mading, take over, my friend. Thank you, Mr. Speaker, and good afternoon. One of those days is still morning. So we honor today the Latin American Association, the oldest and the largest Latino serving nonprofit in the state of Georgia. So again, it is an honor that I bring to you the CEO Santiago Marquez of the LAA. And in fact, the tidbit was that me and Santiago in 1999, he was with consumer credit counseling I was with a housing nonprofit. We did the first time, the first Spanish, first time home buyer workshop in the state of Georgia. Now you have them in all languages, but the first one in Spanish was in 1999 and me and my friend Santiago, we did that with a group of folks here. So again, Santiago. Thank you, Mr. Speaker. And thank you to the Hispanic caucus. I stand before you as a Cuban immigrant, naturalized American citizen at the age of eight. And I stand before you representing 43,000 Latinos that we serve that are coming to this country for a bite of that apple, the American dream. And so on behalf of them, thank you for all you do for making Georgia the best state to live in. All the Latinos that are here are proud to be Georgians and proud to be Americans. And thank you for your work. Very good to have you. Just take a photo of it. We do appreciate what you're doing in the Latin American Association, what you're doing in that association, but most importantly, what you're doing for Georgia and your fellow man. Thank you all. Appreciate your work, your service, and thanks for being with us today. Our doctor today is busy, but we're going to have Representative Rhonda Taylor introduces to our doctor of the day, Representative Taylor. You miss the speaker? Today, we have with us Dr. Walsh O'Sullivan, who is an emergency and emergency medical services physician at Emory University. She completed her undergraduate degree at Emory and worked as an EMT in Atlanta and Decap counties. She received her master's degree in physiology and biophysics at Georgetown and attended medical school at the University of Central Florida. She completed her emergency medicine residency at Grady Memorial Hospital. Dr. Wash O'Sullivan lives in Kanye's Georgia, yay, with her husband and they, Jim, and they own a very small horse farm. Let us welcome our doctor of the day, Dr. Walsh O'Sullivan. Thank you, Mr. Speaker. Is that a small horse farm or a small horse farm? Just checking. See, I'm glad y'all are listening. I'll call that right off and so did, excuse me, Reptidy Williams and Sharon Parsons. Okay, we're moving on to the rules, calendar, calendar. So we'll ask you to give your attention to the member in the well. Mr. Clerk, would you read the caption to Senate Bill 148? 148? Senate Bill 148 to be a title of the, by Senator Kennedy of the 18th and others to be a title of an act to amend chapter 3, a title of 14th. Senator Kennedy, the fiscal to Georgia, and TATA relating nonprofit corporations. So it's a comprehensively revised, simplified, modernized chapter and it's revised for the construction of said chapter this bill. I refer to the committee on judiciary. That committee recommends that this bill do pass. Set time, need to give your attention to the member in the well. Representative Leopard has recognized to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House, I'm presenting to you today Senate Bill 148. This is a comprehensive revision, rewrite, update, correction of the Georgia nonprofit corporation code. This always reminds me of one of the times I was traveling in Dillard and I saw one of those cedar shingles behind the cash register said this is a nonprofit business. We didn't intend it, it just turned out that way. I'm also talking with Chairman Dickey about one of his competitors who lamented that it was costing him 95 cents a pound of growth peaches and he's only selling them for 90 cents a pound. He said he's going to make it up on volume. That's not exactly what we're dealing with here today, but it's sort of like that. This is the, there are two kinds of corporations you can form in Georgia, business corporation, which is generally conducted for profit and a nonprofit corporation, which is generally conducted with an idea of not making money and distributing it to shareholders, perhaps making money but applying it to some other kind of charitable or social purpose. For example, the term nonprofit that we use here is not talking about nonprofit in the sense of taxation. It's talking about nonprofit in the sense of the internal structure of the corporation. Generally, if you're forming a foundation or if you, a lot of churches use this form, hospitals do clubs for like golf or hunting or track clubs and that sort of thing, use this kind of internal organization which does not generally, does not have shareholders. It may, may have members that have to have them, but it may. So it's a different kind of internal governance of the corporation that's more suited to the nonprofit context. It's a total separate chapter in the Georgia Corporation Code. There's a code for business corporations and a code for nonprofit corporations. We've amended the one for business corporations numerous times. We haven't really touched the nonprofit code for many, many years. So several years ago, the nonprofit law section of the state bar, the legislative committee undertook a project to review the code and basically rewrite the whole thing but with the sense of updating it, making corrections, clarifying provisions, addressing court decisions that had been issued interpreting the code and trying to conform the code to those provisions and just making grammatical changes and then updating the code with respect to changes and technology over the last 30 years. Ways of communicating, notice, so we tried to update the code with respect to that. So it's 193 beautiful pages and it basically does those things I have said. There are a few substantive changes most of which will, you know, you need to take your heart medication before I talk about them. There are things like changing core requirements, prohibiting a president from also being the secretary, who's using the secretary as to attest the signature of the president, making executive directors. A lot of nonprofits have an executive director. They're actually making that an officer so that it's subject to the duties and conflict of interest rules of officers and applying the duties of care to them. And I think I did mention quorum in the minimum number of directors. So very technical changes but ones that are very essential to allow these entities to function properly and hopefully not have to talk to their lawyer so much and spend money on legal fees but apply the funds they have to the purpose for which they exist. So that's the bill basically I'd be glad to stand if you have any questions. Gentlemen, you have several questions. Gentlemen, you yield? Yes. Gentlemen, night to your right is recognized for a question. To my friend and will. Would you yield for a couple of questions? I yield. And first of all to my friend, I'm sorry it's obviously a long bill and trying to read everything that comes through. I apologize for the lateness of the question. But I have a general question and in regards to rewriting this part of the code for charitable organizations. Isn't it true that we found that a lot of charitable organizations are set up and then they're leasing to or leasing from private entities or corporations that surround it with a profit motive and that's what I'm seeing and I'm asking the gentleman, is this identified in here or does this legislation or measure address any of that? I'm not aware that it addresses leases or contracts entered into between nonprofit and profit corporations. Thank you, sir. Gentlemen, you yield further? Yes. Representative Jasmine Clark is recognized for a question to your left. Thank you, Mr. Speaker. Does it, gentlemen, you? I yield, yes, ma'am. So you briefly, this is a pretty long bill and so you went through it very, very fast. You mentioned something about executive directors now being considered officers. So a lot of nonprofits, their executive directors are often a paid position whereas sometimes their board of directors is not a paid position. Does anything in this bill, is anything in this bill going to require a lot of these nonprofit organizations to completely restructure their organization now that the executive directors are on the same tier, I guess, as their board? I guess that's going to depend on the particular circumstances for each nonprofit but I'm not aware that it's going to require any changes to their overall structure. It simply makes it clear that the executive director has certain duties to the board and to the corporation just like any other officer would because they're basically fulfilling the duties of an officer. That's a gentleman for the year. Yes, ma'am. I'm asking is a lot of places in their bylaws, the board is unpaid but their executive director is not considered a part of the board. So if that is their structure, I'm guessing I'm asking for the nonprofits that might be watching us today. If that is their current structure, will they need to redo their bylaws to now change it to where certain board members can be paid so that they can pay their executive director? I would say, and I don't do a great deal of working this year, I do some, I serve on a nonprofit board and I do represent some. I don't believe anything in the bill would require them to change compensation or the general structure of the corporation if they have an unpaid board or unpaid director. Thank you. Thank you for the question. Mr. President, I can't or it is recognized to your left for a question. Thank you, Mr. Speaker. Do you yield? Yes. How would this bill affect churches or religious entities that are also 501c3s? Well, if there are 501c3 corporation then it would affect them in the sense that it does impose these new rules I've discussed. However, most of the provisions about Quorum and those sorts of things can be changed by specific bylaw provisions or amendments to their articles of incorporation. So to the extent there's anything in here that they would not like, there are sort of escape hatches if you would for them to affirmatively provide a different rule for their operation. Okay. Thank you. Thank you. Gentlemen, has no further questions. Thank you, Mr. Speaker. Ladies and gentlemen, I would appreciate your favorable support of Senate Bill 148. Thank you very much. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 163. The nays 4, the bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 218? Senate Bill 218 by Senator Redd. The 33rd, another is to be titled an act to amend Article 5 of Chapter 5 of Title 40. The official go to Georgia annotated relating identification cards for persons without driver's license. So it's to provide for the issue and so by identification cards to persons completing a term of incarceration. Mr. Bill, I'm referring to the committee on public safety and homeland security. That committee recommends the disbilled do pass by committee substitute. Chairman Warkheiser is recognized to present the bill. Thank you, Speaker Burns. This is a bill we can all get behind. This is a collaborative effort between the Department of Corrections, the Department of Pardoning Paroles and the Department of Driver Services. When our state inmates have fulfilled their obligation to the state and leave the prison system, we should do everything we can to help them gain employment. And other services in one way we can do this is to provide them a comprehensive packet of all the courses they've completed. Like if they've completed a welding course or any educational where they've gotten a GED. And then also to give them a state issued ID card. And that's what the bill does. Stand for any questions if there are any. You have a question representative Higley to your left has a question representative Higley. Thank you, Mr. Speaker. Does the gentleman yield? Absolutely. I appreciate the bill. I do have a question though. Did you all discuss other things that you might be given to persons who have completed their time? Are we still at $25 an abust ticket home? What else do they receive as they are leaving and are reintegrating back into society? That's a great question. It was not discussed in this bill. Basically this was paperwork related to their leaving and not the other services. Now did Phil to mention that this was Senator Doc Redt's bill over in the Senate. He worked on this but we did not discuss the other issues. That was a great question. Gentlemen, you have another question? Yes, sir. Representative Roman is up the center aisle. I recognize for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. For the ID card, is this just the typical ID card that some people can also use to travel and everything else? Or is it different? That's a great question because we did not want to give this stigma or identification that this was a previous inmate. So the card is the same card as that you and I would get from the Department of Driver Services. If we wanted a card that did not want the privileges of driving. So it's just the same as everybody else. Great question. The gentleman has no further questions. I get asked for your favorable consideration on Senate bill. You do have one more. 218. Absolutely. It's a gentleman, Jill. I'm sorry. Yes. I'm going to give you. There's any Lisa Campbell has a question. Thank you, Mr. Speaker. Do you yield the will? Yes, ma'am. I just have a question about line 51. It says educational.\n\nSo, the grant will not apply to inmates who have attained 50 years of age. Just curious about that as an age cut off. I'm going to have to play the ignorance on that. I don't know. You have no further questions. I'd ask for your federal consideration on Senate Bill 218. General Zittlenow's standing job presenting the bill. We appreciate that. We appreciate the bill. We have a speaker in favor. Representative Kennedy has recognized the speaking favor of the bill. Thank you, Mr. Speaker. I just could just about fall on the floor and cry. This is such a great bill and such a great solution. In the program of which I'm the director, we work with homelessness and we get a lot of folks who are re-entering from our state prisons and county jails. And this is a significant problem. Someone who's being released. We have no ID. So we're spending months collecting their birth certificate, their social. And you usually take months before we get to the place of a state ID. And I've been asking for this for a year. So I appreciate this effort. It always made sense to me that they could leave incarceration with a state ID. There was some pushback saying, well, we didn't know if this is really that person. And I would always quit back. Well, we knew it was that person enough to convict them. But anyway, I'm just so glad that we came to this place today. It's a great bill. Please vote in support of SB218. Gentlemen, as you ordered the well, is there an objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there an objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 171, the nays 0. The bill having received a requisite constitutional majority is there. The bill has received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate Bill 4747? Senate Bill 47, my senator, half-stuttle of the 52nd and others to be entitled to amend chapter 12 of the title 16 of the fiscal to Georgia and it's headed relating offenses against public health and morals. So, as we provide that vaping in restricted areas is a misdemeanor possible by a fine. This bill I'm referring to the committee on public health that committee recommends that this bill do pass. Chair, related coupers recognize to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I bring you Senate Bill 47. And what this bill does, it puts vaping on the same status as smoking cigarettes. It does not expand anything. It just says, if you can't smoke in an area, you can't vape in an area. And that is what the bill does. And Mr. Speaker, if there are no questions, I'll yield the well. You have no questions. The lady has yielded the well. Is there any objection to the previous question being ordered that Chair Hissnund, the previous question is ordered, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair Hissnund, the report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no and the clerk. We'll unlock the machine. 131. Okay. Have all members voted. Have all members voted. If so, the clerk will unlock the machine. All in the passage of the bill, the yeas are 152, the nays 14. The bill, having received the requisite Constitutional majority, is therefore passed. Mr. Clerk, will you read a caption to Senate Bill 131. 131. Senate Bill 131 by Senator Tillery, the 19th and others, to be entitled and act to amend part 13 of Article 3 of Chapter 11, in Title 15. The fiscal to Georgia, anti-derollating, permanent guardianship, still is required for service by publication. Ms. Bill, I refer to the committee on juvenile justice. That committee recommends that this bill do pass by committee substitute. Chair Lady, Ballinger has recognized to present the bill. Thank you, Mr. Speaker. Today I come before you to present SB 131. SB 131 has to do with permanent guardianships and service of process onto different parties to the permanent guardianship. Section 1 requires a guardianship petition hearing to be conducted in accordance with OCGA 29218. Section 2 adds requirements to the process of serving individuals related to the child who was not adjudicated as a dependent child. There are any other parties who appear to the court as proper or necessary to the proceeding. Section 3 and Section 4 are really to us as House members of the pertinent parts. That was a little added decoration that we put on over here in the House to address a very serious issue. Many of y'all know the issue to which I'm referring a young lady that was subjected to just horrific circumstances. It included her surviving parent who had actually murdered the other parent and all her other siblings. That the remaining parent that had murdered all of her family actually tried to get her sent back to Mexico to live with the murderers family. In this case it was the mother. So to that end we want to make sure that that doesn't happen again. So we added Section 3 which makes a conviction of a parent for murder or voluntary manslaughter of the other parent. A mandatory basis. It's a shall. The judge shall sever all parental ties between that parent and the child. For removing the child from a parent who was convicted Section 4 allows the court to exercise its discretion when determining the custody of a child. And if one parent has been indicted for the offense of murder or voluntary manslaughter of the other parent. So in other words they can hold it. It's completely within the judge's discretion that they can hold off on the permanent making that a permanent situation or they can kind of hold it in a bayance waiting until the parent is convicted whatever the judge would like to do in that instance. So that's the bill and I'll be happy to answer any questions. You have no questions. Thank you Mr. Speaker. I urge everybody's favorable consideration to SB 131. The lady has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And the clerk will unlock the machine. Have all members voted if so the clerk will lock the machine on the passage of the bill. The passage of the bill, the yays were 165. The days five. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk will you read a caption to Senate bill 213? Senate bill 213 by Senator Burns. The 23rd know there's to be a title of an act to amend chapter 66, a title 36. The official go to Georgia and Tate related zoning procedures so to prohibit local governments from preventing the continuance of a lawful, nonconforming use of property when a pre-existing manufactured home or mobile home is replaced with another such home. This bill I refer to the committee on governmental affairs that committee recommends that this bill do pass. Senator Washington has recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House I rise to present Senate bill 213, the sponsor of Senator Max Burns. This is a simple bill. It should be non-controversial. It allows existing owners of manufactured housing, manufactured home to replace that home with a new home, a new home that is manufactured housing. The three conditions that should be understood. First of all, the replacement home must be a new home and it must only be used as a single family residence. The owner has a year from the removal of the previous structure to replace it with the new structure. That is the bill and Mr. Speaker, I will yield any questions. You have a question. You yield for a question? Yes, sir. Representative Roberts, right out to your left in front of you is recognized for a question. Thank you, Mr. Speaker. Will the gentleman yield? Yes, ma'am. Isn't it true that this bill is going to be a way to maintain affordable housing. Often jurisdictions will rezone an area with the express purpose of kind of driving certain uses out. And these are folks that have lived in their homes and should be able to replace their homes and it's a way that we maintain a surplus of, or at least some affordable housing. Yes, ma'am. Thank you for that question. It is a great solution to our continuing challenge for affordable housing and thank you for that question. Gentlemen, yield? Yes, sir. I will for one more. Representative Wilkerson, and to your left in the back is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. And I apologize when I asked him this earlier, but if there are code improvements or safety improvements that happen over time, like I know if you replace a water heater or whatever, you have to update to the new code. Does this impact any requirements that are required of new homes, but not old ones? No, sir, not to my knowledge. It just does specify that it has to be a new home, which certainly should meet all the requirements I would assume. Mr. Speaker and members of the House are your favorable consideration of this bill. Mr. Speaker, I yield a well. Gentlemen, will you take one question from Chairman Martin? I'm sorry to pop up about the time you said that if you will reconsider your own. Certainly, I will take a question from Chairman. Come on, yield. Yes, sir. Isn't it true that your bill states or that the Senator's bill states new mobile home? That is true. That is true. It isn't true that it wouldn't be legal for someone to manufacture those homes if they weren't up to current safety standards. Yes, sir. I believe that is true. I believe that would address the gentleman's previous question. I think so. Thank you, Mr. Chairman. No further questions? Thank you, Mr. Speaker. I yield a well. Thank you for your flexibility. Is there an objection to the previous question being ordered? The Chair here has done the previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair has done the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. All members voted. If so, the clerk will unlock the machine. On the passage of the bill, all the yeas were 169, the nays 2. The bill, having receded requisite, constitutional majority is therefore passed. Members, we're going to call a bill that we postponed from yesterday. We're going to call SB 135. It was on the calendar yesterday and was postponed until today. Mr. Clerk, will you read a caption to Senate Bill 135 135? Senate Bill 135, Senator Karpatrick, in the 30 second, annulles to be titled an act to amend our 3H after 7, the title 19 of the fiscal to Georgia annotated a relating to determination of paternity. So it's the line evidentiary medical and genetic testing with the uniform parentage act of 2017. This bill ever referred to the Committee on Juvenile Justice. The Committee recommends this bill do pass. Chair Lady, Chair Lady Ballinger is recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I come before you to present Senate Bill 135. Senate Bill 135 clarifies the genetic testing. When genetic testing is required by court order, the testing must be of a type reasonably relied upon by the experts in the field and conducted by laboratory accredited by either the AA BB, formerly known as the American Association of Blood Banks or in accrediting body designated by the US Department of Health and Human Services. Results of genetic testing, including statistical likelihood of the alleged parent's parentage, are admitted into evidence without foundational testimony or other proof of accuracy unless a party of Jackson writing, at least 30 days prior to a hearing at which the results may be introduced as evidence. The bill makes results of required genetic testing self-authenticating and admissible in any civil action as long as documentation from the laboratory contains the following chain of custody information, the name and photograph of each individual who was tested, the name of the individual who collected the test result, the place and date each result was collected, the name of the person who received the result in the laboratory and the date the result was received. So, it's hopeful that by making these DNA tests during the course of a legitimation, sometimes that scientific proof of paternity is needed to move forward with legitimation. So, hopefully this will ameliorate that situation and make it move much faster for those children can get into permanent situations a lot quicker without holding up the process waiting on a genetic test. I'll be happy to stand for any questions. Lady, you have a question? Yes, sir. Representative Jasmine Clark to your left has a question. Thank you, Mr. Cedar. Speaker, does the general let you yield? I do. So, can you clarify on lines 48 and 49? You said that these genetic tests, so I'm going to say paternity tests, can be admitted without the need for proof of authenticity unless someone objects. So, it doesn't need to have proof of authenticity unless there's an objection to it. The results of the genetic testing can be admitted into court if it contains lines 60 through 64. If it has all of those procedures included, it's much like a medical narrative can be included and not have the actual doctor there to testify. So, sometimes having an actual geneticist who may be out of state come and testify to authenticate that kind of snags at the system. So, this just allows it to be self-authenticating unless the other party objects. Thank you. I'll be happy to yield to any more questions. No further questions. Okay. Thank you, Mr. Speaker. I encourage everybody to vote favorably for Senate Bill 135. Thank you very much. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no and the clerk will unlock the machine. Thank you. Have all members voted if so the clerk will lock the machine on the passage of the bill. The yeas were 171, the nay zero. The bill having receded requisite constitutional majority is therefore passed. We're going to move on to afternoon orders in the morning. Representative Kenner, you're recognized for an afternoon order. Thank you, Mr. Speaker. I wanted to underscore a couple of things I said yesterday in the well to be more clear because they are powerful. We know that if a kid is reading on level by third grade, we've all but removed them from the possibility of corrections. We also know that studies show that four-year-olds going through our state pre-K are largely hitting that third grade proficiency marker. We know that four-year degree holders are virtually nonexistent in our prison population. It's clear our best public safety policy would be better education policy and it's much cheaper. It costs $5,400 to put a four-year-old through a pre-K. The average tuition costs for a four-year degree in Georgia is $20,000. Jucks to pose that to the cost to incarcerate an individual which is $27,000 per year and the average time served is five years. That's $135,000 to incarcerate. We know that we are sitting on $1.9 billion of lottery reserves, $1.1 billion in which we have access to now. We could deploy a fraction of that and put every Georgia four-year-old through pre-K and open up hope scholarships to thousands of thousands more for a four-year degree. This is good public safety policy. Doubling down on tough on crime measures doesn't work and it's really expensive. Right now we have more jails and prisons than we have colleges and universities in the state. When we fail to properly educate, we incarcerate. Victor Hugo said he who opens a school door closes a prison. Thank you, Mr. Speaker. Representative Hutchinson is recognized for an afternoon order. Thank you, Mr. Speaker. Colleagues, today I want to introduce you to a sibling group. We have Timerie, who is 11, Tamaya, who is 10, Raman, who is 8, and Josiah, who is 7. This is a sibling group who are affectionate, love school, love to ride the bus to school, and are friendly. They love to watch TV, they get along with each other, and they like to cuddle with stuffed animals and blankets. This sibling group is very difficult to place. It's a sibling group of four and they are African-American children who are the most difficult to place. I don't think many people know that there is adoption assistance for families who decide to adopt a sibling group like this, or a special needs child or a sibling group. I hope when we consider children for adoption that we think about what supports our state gives, such as Medicaid and financial assistance, when you are taking on such a huge responsibility. Let's talk to our constituents to get these babies adopted. Thank you, Mr. Speaker. I yield the well. Representative Buckner is recognized for an afternoon order. Thank you, Mr. Speaker. Ladies and gentlemen, in the House, I really had planned to do this yesterday and kind of got bumped, but I just wanted to thank everyone for your well wishes, thoughts, and prayers when I was out last week, sick, and as a retired public health educator, I feel like it's important to say I had nothing contagious so you don't have to worry. I also think that as a retired health educator, these next few days of stress, I would encourage us all to get as much stress relief that we can by arresting and drinking plenty of water. Hopefully we'll get through to the end of Sinai Dow without any more illnesses, but thank you. You are truly a wonderful family and taking care of one of its own when I wouldn't feel so great. Thank you. Thank you. Thank you. Chairman, we'd our is recognized for an afternoon order. Good afternoon, colleagues. I rise today to let you know that tomorrow we get to celebrate another national championship for the University of Georgia football team. Hey, me. Trophy will be on display in the rotunda from 9 a.m. to noon tomorrow. Please come on down to, that's right, to show fees hopefully tomorrow. But just want you obviously give our just a great respect and a great season and go dogs. I heard that. Representative Carter. There she is. Representative Doreen Carter. Has it important? I'm ported up after an order here. Listen up. Thank you, Mr. Speaker. Good morning, everyone. So usually I get up the day before we break before my birthday to tell you guys it's my birthday. So I didn't do it this year. But today is my youngest son's 22nd birthday. So I just want you all to join me in wishing Joshua, Isaiah, Micah Carter, a fabulous birthday. He's been here 22 years. Thank you, Mr. Speaker. Representative Sharper is recognized for an afternoon order. Okay, thank you, Speaker. Thank you for the opportunity. Thank you for the opportunity. Thank you all very much. Chairman Cooper came earlier to talk about the Georgia Health Policy Center. So if you're a graduate of that program you're going to take photos at the South steps. Immediately after session. But if you all don't mind if you all can stand real quick, the Georgia Health Policy. That completes our afternoon orders. We'll move on to announcements. Before we have a motion and I'll get a fine. For what purpose is Chairman Lumsden rise? To make a motion. Stage a motion. Mr. Speaker, I move that Senate Bill 110 be moved from insurance and be reassigned to motor vehicles, both chairman and agreement. Clerk, we'll read the caption. Senate Bill 110 by rep. Senator Walker, the 20th and others to be entitled back to amend chapter 1333, the fiscal to Georgia and it's under laying the general provisions for insurance. So it's to be established the back the blue fund that distributes voluntary contributions. On the general's motion that SB 110 be withdrawn from the insurance committee and recommitted to the motor vehicle. Vehicles committee is objection here and none it is so ordered.\n\nfor what purposes chairman chocus rise to make a motion. State your motion. To move that we temporarily suspend the rules so that a bill can be read in a signed committee for the first time. Does the clerk have your bill? Yes, sir. The clerk will you read the caption. On number house bill, my rubsan of chocus, the 150 first to be titled tonight to create the Terrell County Land Bank authority. On the gentleman's motion that the rules of the house be temporarily suspended so a bill can be read for the first time in a signed to committee is their objection intergovernmental coordination. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Cedric Juan Martin. Recognizing commending, Dorothy Norwood, gradually heard county lady brave softball team celebrating the 40th anniversary of the match day court system. Gradually in commending the 2023 Georgia parent legal builders award finalists. Congratulating and commending the 2023 Georgia single parent legacy builders award finalists. Recognizing March 26, 2023 is the Georgia Cup Day in celebrating the Georgia Cup's 26th anniversary commending and congratulating Philadelphia College of Osteopathic Medicine South Georgia. Congratulating the heard county middle schools boys basketball team for winning the West Georgia middle school double-aid championship. Congratulations and commending Morgan oil company. Congratulations Carol high school debate team for winning the 2023 GFC a state debate championship. Congratulating commending time Murray on winning the 2023 state wrestling championship, recognizing commending Gabe swan on winning the 2023 state wrestling championship. Commending the central high school wrestling team for winning the 2023 state wrestling championship. Recognizing commending Jacob levy on winning the 2023 state wrestling championship. Commending Shaquita Foster South Atlanta High School's 2023 teacher of the year. March 22, 2023 is black men and boys day at the state capital. Commending congratulate Pierce Samuel Graber. Recognizing and honoring the victims of communism. Celebrating the inauguration of the Atlanta branch of the American Cree United Society on March 26, 2023. Recognizing commending Takasha M. Swan and the veteran anthem. Recognizing March 20, 2023 is trans day at the state capital. Recognizing March 23, 2023 is go vote Georgia day at state capital. Celebrating commending alpha capa alpha sorority and corporate capa omega chapter from 100 years of service to all mankind. Congratulating Grayson Nud, Georgia's 2023 distinguished young woman. Recognizing May 4, 2023 is the Judicial Council of Administrative Office of the Courts 50th anniversary day. Recognizing commending Sammy Baker. And congratulating the Pete Montacadabee's girl basketball team. And honoring the life and memory of Terry Harth. And for other purposes that completes the reading of the privilege resolutions. Those there any objection to adopting the privileged resolutions that chairs known in the resolutions are adopted. We will be moving on to announcements. But first let me inform you that we have four bills that were on our calendar today that will be postponed until the next legislative day. SB 1 SB 20 SB 155 and SB 64 postponed to the next legislative day. Representative Alexandra is recognized for announcement. Listen up. Thank you, Mr. Speaker. Thank you women for wearing your rose and honor of the General Lady will suspend just for a minute. Thank you, Mr. Speaker. And thank you women. No, no, no, just for a minute. They can't hear you. These announcements will affect your life this afternoon and the next couple of days. So I thank you need to pay attention. Lady will continue. Thank you, Mr. Speaker. Thank you women for wearing your rose today and honor of Representative Tish McGeece. So we will have our last and very final lunch for the women caucus today. It is room 216. So I hope I see you guys there. Thank you. Chairman Irwin has recognized for announcement. Thank you, Mr. Speaker. Education full committee after lunch today, 1 o'clock, our suspended meeting will meet in 341 here at the Capitol, 1 o'clock. Thank you. Chairman Dickie has recognized for announcement. Thank you, Mr. Speaker. Tomorrow from 4 o'clock in the blue room, UGA, College of Agriculture and Environmental Sciences will have a reception with the Dean and the Vice Recalc all. I hope everyone can go to that reception tomorrow 4 o'clock. Thank you, Mr. Chairman. Representative Angela Moore is recognized for announcement. Hello house members. Attention, especially if you all are playing. This is a reminder that tonight is our Houseverse Senate kickball team and I am your official cheerleader. I will be out on the field with my pom-poms cheering you on against the Senate. Everyone who is going to be there who is involved needs to be at the stadium right down the street by 5 p.m. today, the game starts at 5.30 parking in the victory lot for us and I will be screaming these words all afternoon. You are a hilerit with me. So let's be there. I got to pump myself up for that. I got to put my t-shirt on and pom-poms. So let's get out there and kick some Senate butt y'all. I can't add to that. Perfect. No competition from the Senate. Chairman Williamson, you are recognized for announcement. Thank you, Mr. Speaker. I was sitting there praying to God you wouldn't call me to the whale right after that ugly, ugly, ugly. But I just want to remind all the members of the Republican caucus that we do have lunch, beginning to pun a German in room 403 upstairs. Your attendance is heavily encouraged. Please be at the caucus lunch upstairs in room 403 of the German. Thank you, Mr. Speaker. That certainly wasn't directed to you, Mr. Chairman. You can't speak to another member and the member more knows that. So she wasn't addressing. She was addressing across the hall on the other side of the building. Chairman Parsons has recognized for announcement. Thank you. Speaker, I just wanted to announce that energy utilities and telecommunications will not be meeting today. It's a normally scheduled time on Tuesdays at three. We probably had our last meeting for this session. There is no meeting today. Thank you. Chairman Blackman, recognize for announcement. Thank you, Mr. Speaker. The Ways and Means Committee will not meet today. We will not meet. Thank you. Chairman Bonner has recognized for announcement. Thank you, Mr. Speaker. Defense and veteran affairs. Today at 2 p.m. and 515 CLOB. Thank you. Chair Lady Ballinger has recognized for announcement. Thank you, Mr. Speaker. Your juvenile justice committee will not meet today. So the meeting this afternoon at 3 is canceled. Thank you very much. Are there any other announcements? No other announcements. Okay, members. We're ready to wrap up here. Give me your attention. I want to remind you of something. As you've heard, we have a full slate of committee meetings this afternoon. We are obliged to be here at work today and tomorrow and Thursday. So we will be having committee meetings tomorrow. So you need to pay attention to your schedule. Make sure you are attending the meetings that you are on the committees that you've been assigned to and on subjects that you are interested in. I want to hear Thursday. I didn't know anything about this or Monday. Never heard of this before. We all have an obligation to be informed. So you can take care of that obligation by attending these committee meetings and make sure you are informed and you are representing your constituents. Nothing said, right? We are good to go. Thank you all for your attention today. We don't have any birthdays. We are going to kick the Senate's butt as we usually do this afternoon, additionally at the kick-ball game. I'm coaching so if you want to get in, you best come see me and let me know if you are still level. Oh, there we go. You trying to get in there, Chairman Cooper? Are you trying to get on the field this afternoon? Oh, Chair Lady Cooper has an announcement. Hello, everybody. The Public Health Committee will meet at 1-15 and 606-LAB. Public Health will meet 1-15 and LAB-606. Shouldn't take us too long. We got a couple of things. Thank you. We have pages who have done a great job today and they are up here to have a photo with their member. So I encourage if you have a page to join us up front, if I can have your attention just for a moment, if you will all stand with me, Chairman Hatchett just informed me that the of our budget office, Christine Murdoch is headed over to Alabama. Her dad is in serious physical, serious condition. And so if you would, join me in a moment of silence and prayer for Christine and that entire family if you will join me. Hey, man. Thank you. Majority Leader of this House is recognized for a motion. Thank you, Mr. Speaker. I move that this House stand adjourned until 4 p.m. today. I'm sorry, standing recess until 4 p.m. today and then be adjourned until Thursday, March 23rd, 2023 at 10 a.m. All those in favor of the Majority Leader's motion will say aye. All those opposed will say no. The I's only one to count. We are in recess.",
  "updated_at": "2026-02-13T05:47:23.979652+00:00"
}