{
  "video_id": "1ZkJ2xIo4Uo",
  "url": "https://www.youtube.com/watch?v=1ZkJ2xIo4Uo",
  "title": "Sen Jackson Press Conference on Gun Violence | 01/20/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 12,
  "summary": "Here is a structured markdown summary of the key points from the Georgia Sen. Jackson press conference on gun violence:\n\n## Overview\nSenator Jackson introduced new legislation, SB 413, which would allow victims of gun violence to break their leases without penalty in order to move to a safer location. This builds on her previous work passing SB 75, which allowed victims of stalking to break leases. The press conference featured testimony from a trauma surgeon, Dr. Amber Hannah, and a gun safety advocate, Heather Hallett, emphasizing the need for this legislation.\n\n## Key Actions\n**SB 413**: Allows victims of gun violence to break their leases without penalty in order to move to a safer location.\n\n## Bills Introduced (First Reading)\n- SB 413\n\n## Notable Moments\n- Dr. Amber Hannah, a trauma surgeon, discussed the importance of providing support beyond just medical care for victims of gun violence to help them recover and reintegrate safely into the community.\n- Heather Hallett, the director of Georgia Majority for Gun Safety, spoke in support of SB 413 despite it not being the \"foundational gun safety laws\" her organization typically advocates for. She emphasized the need to address the ripple effects of gun violence on individuals, families, and communities.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nNo quorum notes detected.\n\n## Adjournment\nNo adjournment details provided.",
  "transcript": "Good morning, everyone.\nGood morning, and thank you for joining me\nas I introduce my newest piece of legislation, SB 413.\nA few years ago, I began this journey\nby passing SB 75, which was a crucial piece of legislation\nthat allowed victims of stalking to be able to move without\npenalty from their leases.\nThis is an overlooked population of people who\nneeded to be protected. And so this bill SB413 builds on this work in the same way that\nvictims of domestic violence and stalking need to be able to move quickly to safety.\nSo it is true for those who are victims of gun violence. And so today I am excited\nand honored to be able to carry this piece of legislation that will allow all victims\nof gun violence to be able to get out of their leases without penalty so they can move to\na place of safety.\nToday I have with me really the brain child of this movement, someone who works in this\ntype of field and who brought this issue to me and so it's really my great honor to\nintroduce both two incredible warriors but first we'll begin with Dr. Amber Hannah.\nShe is a surgical resident who works at a great hospital nearby and she's here in her personal\ncapacity to advocate for vulnerable patients and knows firsthand just how life-saving SB\n14 can be.\nAnd so again, it's my great honor to introduce her to you all and she speaks about the importance\nof this bill.\nDr. Hannah.\nThank you so much.\nThank you, Senator Jackson, one for listening to us and two for inviting me today.\nGood morning all.\nI am so excited to speak on behalf of myself and trauma providers here in Georgia who support\ndoing this necessary work.\nI would first like to tell you why even surgery for me and specifically why trauma.\nIt was a decision that I made based on the impact that I saw that patients in their most\nvulnerable state in our vulnerable moment. We serve as a bridge between someone\nto most worst moments and possibly their greatest testimony. My passion for\ntrauma stems less so from just the operating room but more so inspired by the\npassion that attending mentors like Dr. Smith have outside of the OR and really\nin these communities. People underscore what it takes to really do surgery. It's\nIt's not just what happens within the operation, but the prep before and really the recovery\nafter.\nSpecifically for trauma, a lot of the hospital stay is preparation for life outside of\nthe hospital and helping patients adjust to their new normal.\nThis is especially true for victims of firearm injury where the injury itself isn't the\nonly theme causing a wound.\nIt is also the mental, societal, and emotional wounds that inevitably follow.\nAnd our support after that initial injury is paramount.\nYou know, in this past six months, I have been able to dedicate my time to practically\nintimate, implement what the intersection of advocacy and surgery looks like.\nAnd during this time, I was able to host Senator Jackson and other Senate Democrats at our\nhospital and show them the normal flow of what an interpatient might look like in our hospital.\nThat experience sparked a discussion about the work that our community violence specialists\nare doing and our trauma providers are doing that we can help move the needle forward.\nSenator Jackson agrees with us that gun violence is an issue that must be addressed, but\nin addition to the violence itself, we must also focus on emerging survivors back in society\nsafely and with the proper support.\nThere are currently a lot of specialists as well as providers that give services like\nfree medical aid, but housing does continue to be a problem.\nAnd Senate Bill 413 would potentially remove difficulties\nin providing these services specifically with housing.\nThere are innumerable situations where patients are re-traumatized\ndue to their living situations, and there is a very real risk\nof re-injury due to the proximity of prior violence.\nFor survivors to properly rehabilitate themselves\nafter firearm injury, it does not just stop at medical care.\nIt requires the emotional, financial, and relational support,\nand giving people peace of mind in knowing\nthat they can leave a space that wants to traumatize them\nis a step forward in survivor's journey of recovery.\nThis gives survivors a sense of agency\nand a locus of control, and that's an invaluable gift\nthat we can give them.\nProviders like myself do extremely important work here\nin Georgia and in Atlanta,\nbut we can't do this work alone.\nIt takes public leaders like Senator Jackson\nand her team to translate this work into legislation\nso that we can continue to heal patients\noutside of them hospital and release them\ninto conditions that allow them to thrive\nand not just survive.\nResilience needs action and that action\ncan come from this bill, the Senate Bill 413.\nI'm excited about this legislation\nand the potential impact here in Atlanta and Georgia abroad.\nAnd I am proud to work with Senator Jackson\nand other mentors that I am passionately working with,\nand I hope that other providers will come along\nand support us in this bill to ease the burden\nof firearm violence here in Atlanta\nand in the Georgia community.\nThank you to Senator Jackson for collaborating\nwith us for a better tomorrow.\nThank you.\nThank you.\nThank you, Senator.\nThank you so much, Shadda Hanna.\nAnd I do want to just take a moment to say that\nfor so many people when it comes to talking about guns\nand this building, it's often a non-starter.\nPassing good gun legislation is really difficult\nand these particular circumstances,\nbut the reason why I brought this bill forward\nis because I believe this is a place\nwhere my colleagues on both sides of the aisle can agree.\nWe can agree that fundamentally when bad things happen,\npeople should be able to move to a place quickly\nto interrupt cycles of violence\nand to make sure that they can live safely.\nAnd so that's why I'm bringing this bill\nand this climate because I do understand this to be\nsomething that bipartisan participation can get involved\nso that we can get it across.\nWith that, I want to introduce our next speaker\nwho comes to us as a long standing gun advocate.\nThis is not necessarily the legislation that they'd hope for,\nbut this legislation that they agree is important\nand I'm so grateful to have Heather stand with us\nand represent the majority of Georgians for gun safety\nas she talks about the importance of SB413.\nThanks Heather.\nThank you so much to Senator Jackson\nfor sponsoring this legislation.\nAnd for Dr. Hannah for coming down\nand speaking about her life saving work.\nI am Heather Hallett.\nI'm the director of Georgia Majority for Gun Safety.\nAnd we have spent a lot of time.\nWe come up here every day and advocate for the foundational gun safety laws that we\nknow can reduce the rates of gun violence.\nAnd I just want to take a moment to underscore the reasons why we do this and urge our legislators\nand the public to not look away from the impacts of gun violence.\nThe toll that it takes on not just individuals, not just victims, but their families and\ncommunities.\nIt is unbelievable when you spend time with victims and hear about the ripple effects\non their lives, whether that be emotional, economic, or simply the fear of walking outside,\nwhich SB413 addresses and we thank you so much\nfor sponsoring this urgent legislation.\nWe do this because we know that the foundational laws\nthat we fight for, universal background checks,\nsecure storage laws, red flag laws,\nand funding for violence prevention initiatives\nand education, we know that these laws work\nAnd that if we can reduce the rates of gun violence in Georgia,\nthen there are fewer people who need the protections\nthat SB413 provides.\nSo if we can do that work and even save one victim\nfrom all of the ripple effects that happen\nbecause of a gunshot wound, we know that we are doing good.\nAnd the thing is, is that we also know\nthat the majority of Georgians agree\non these foundational gun safety laws.\nWe can make progress, but until then,\nwe need bills like SB413 to protect the victims\nfrom further harm.\nSo I urge your support for 413,\nand I again, thanks Senator Jackson for her advocacy\nand for writing this legislation,\nand for all the heroes who are here\nfighting on behalf of gun violence victims\nin the state of Georgia.\nThank you so much.\nThank you so much.\nThank you so much.\nBefore I take questions, I do want to take a moment\nto thank the advocates who are here today\nin support of this legislation.\nAnd I want to name Grady Hospital for being the place\nwhere every gunshot victim in the metro area\ngoes to be attended to.\nThere are people standing behind me who care for those folks,\nnot just on the surgical bed,\nbut also beside them as they begin the transition\nfrom being a victim to being a survivor.\nAnd so I want to thank them for their hard work\nand thank the good people of Grady Hospital\nfor really investing in victim care and services\nand also being violence interrupters and communities.\nI also want to thank so many others who have stood\nin the course across the test of time\nto really fight for good gun legislation in the state.\nIt has been a long journey,\nand it will continue to be a difficult and hard road\nfor us politically to do what's best for Georgians,\nbut I'm grateful for each and every advocate standing\nbehind me who's done that work.\nSo with that, if there are any questions\nfrom the press, I'm happy to receive them now.\nYes.\nYeah, thank you. So the question is why specifically on gun violence or fire on violence and not all violence in this bill.\nSo for one thing, this is really just a course of a path that I've been on. It started with domestic violence even before I was an elected official.\nIt expanded to stalking. And now we're at gun violence. And part of that is about just how the legislative process works.\nand what's feasible.\nAt the end of the day, what I love it for any victim of violence to be able to get out of their lease, yeah, sure.\nBut we've got to take this one step at time.\nIt's what's palatable, what my colleagues can do.\nAnd ultimately, we're trying to do the things that save lives most quickly.\nAnd so we know that gunshot victims are particularly susceptible\nto having repeat experience of gun violence in their homes or around them.\nSo we want to get them moved as quickly as possible.\nBut thank you for that question.\nAre there other questions?\nWith that, this concludes our press conference.\nI'm so grateful and do urge your support on SB413.\nThank you.\nThank you very much.\n",
  "updated_at": "2026-02-12T01:36:59.98288+00:00"
}