{
  "video_id": "2-B7SXDDluo",
  "url": "https://www.youtube.com/watch?v=2-B7SXDDluo",
  "title": "03/04/2024 Senate Committee on Finance",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 44,
  "summary": "Here is a structured markdown summary of the Georgia 03/04/2024 Senate Committee on Finance session:\n\n## Overview\nThe session focused on a presentation by the Georgia Public Policy Foundation on tax policy and modeling of different tax scenarios. There was limited substantive legislative action, with the committee unanimously passing a bill related to T-SPLOST funding requirements.\n\n## Key Actions\n**HR 946**: Bill to modify T-SPLOST funding requirements, passed unanimously.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Opening prayer and invocation led by Senator Eccles.\n- Presentation by Kyle Wingfield of the Georgia Public Policy Foundation on tax policy and economic modeling.\n\n## Votes\n- HR 946 passed unanimously.\n\n## Attendance\nA quorum was present.\n\n## Adjournment\nThe session adjourned, with no information provided on the next scheduled meeting.",
  "transcript": "So we will get started, we do have a quorum and Senator Eccles, would you do the invocation\nfor us to your number 12, is that it?\nLet us pray.\nDear Heavenly Father, thank you for today, Lord.\nThank you for allowing us to be here to do the work of the people of Georgia.\nI pray that you'll give us clear minds as we make decisions and let us do what is best\nfor Georgia, your name, I pray, amen.\nAmen.\nWe're gonna have a presentation.\nI may let Senator Hawkins go ahead here.\nThe presentation is gonna be first,\nbut I'm thinking you might be quick\njust because we voted on this pretty much before.\nSo if you wanna come on up to the mic.\nAll right, how you today, Mr. Chair,\neither one you want, we'll turn it down.\nThank you, Mr. Chairman.\nAnd let me start first and say we heard\nfrom Senator Eccles, a similar bill.\nI think yours has one change to it.\nYes.\nIt passed down, I think there may be a couple of no votes.\nSo it may not be an animal's vote,\nbut probably be similar lines again.\nSo tell us maybe the difference\nbetween what she had and what you think that she had the .75 still in there yeah and\nthe .75 was taken out by advisement at ACCG and that .75 you're referring to for the\ncommittee members is that if the county goes it alone without the city's exactly right\nthat's exactly right because house bill 946 is a house bill we're talking about LC number\n500730S. Right now, T-splots is the only splot that requires a 100% dissipation. So we have had\ncounties in this state lose their T-splots because one city or one municipality decided\nnot to sign the IGA. We had to the last time that we tried doing a T-splot. One was\nTrest Haven of 45 people, the other one is Buford,\nit comes into part of Hall County.\nAnd so the 7.5 that Senator Eccles,\nI was referring to, was what you would,\nwhat the T spots would be based on,\nif it was not a unanimous vote.\nHall County decided not to do that\nbecause of all the computations\nin all the other situations that would arise with that.\nThis bill cleans that up.\nSo as long as you have over 50% of the municipality\npopulation, municipalities in favor of the teach blocks,\nthen the teach blocks will be put on a referendum\nfor the people to vote for.\nAnd I said, this bill has been agreed to by GMA,\nACCG and the Chamber of Commerce.\nEverybody's kind of thumbs up on this bill.\nOkay, any questions of the sponsor of the bill?\nWe've got a couple of people signed up to speak, including I think maybe the administrator\nof Hall County, but I don't know if that's necessary, really, it's up to the committee.\nEveryone okay to go ahead and vote with any further testimony.\nWe've seen this same bill with one change taking out the option of the county's going\nit alone. Okay, is that Senator Taylor? Thank you, Mr. Chairman. I think it's\nimportant to point out Chairman Hawkins that if there is not unanimity,\ndoesn't this bill drop it down? It's not a 10-year referendum or a 10-year\ntax, it's a six-year tax. Correct. Thank you for saying that. Yes. Yeah, we've\nheard from counties around the state that it's an extra year allows them a\na little more time to get things up and going.\nSo yes, thank you, that's a good point.\nNo other questions is the committee.\nI mean, our motion now, if we feel like we're ready,\nwe've got a motion from Senator Eccles,\ntheir second from Senator Avatarte,\nany other discussion?\nAll those in favor of the motion, raise your hand.\nOkay, and all opposed.\nSenator Ork, did you vote either way or?\nOkay. So your bill passes and who's your sponsor over here?\nSenator Eccles.\nGood choice.\nI think so. Sort of cute too, isn't she?\nYeah. All right.\nWe've got Kyle Wingfield here\nwith a presentation for the committee if you want to come up.\nThere was a lot of work done over the off session.\nWe haven't know.\nOkay, so the floor's yours, I'll tell the committee.\nPart of this was Rhea Headerman who's been working a lot of states.\nwith us some over the off session our committees that some of the people here\nwere part of the the tax credit study committees and I think I've got it right\nyou're gonna start on page 14 and go through all the derivatives there in\nthe presentation and break down for everybody that didn't have calculus\nthree how those formulas work but I think we'll just do an after-class\nto her in session on that and y'all can tell me how those things work, but yes no thank you\nMr. Chairman and members of this committee I'm sorry somebody said I didn't\nintroduce you properly Kyle Wingfield get introduced up and I'm address for the\nrecord if you would yes Kyle Wingfield on the present CEO of the Georgia Public\nPolicy Foundation and Georgia Policy Impact and we as you know are a think tank\nAnd based here in Atlanta, we work on state public policy issues and as the Chairman alluded,\nwe participated in the tax credit study committee this summer and brought down our rather\nhad via Zoom, our colleague from Ohio Ray Hederman from the Buckeye Institute, our sister\nthink tank and Ohio, which has a center that does economic modeling.\nAnd so after the discussion that Ray had with the study committee, we took some things\nthat we'd heard that were of interest to people and commissioned this modeling study that\nBuck I put together for us in which we published a couple of weeks ago.\nSo I'll go through that in a moment, but I wanted to start with just kind of some kind\nopening thoughts in terms of how we approached this and how we approach tax policy generally.\nAs many of you know, Georgia is a low tax state. You can see that by virtually every metric\nthat is out there. However, we compete in a very highly competitive region when it comes\nto taxes. So we're sandwiched between two zero income tax states in Tennessee and Florida.\nto our Northeast, we have North Carolina, which 10 years ago\nhad a higher income tax rate than Georgia does,\nand through some steady reductions of that rate,\nit has now come to have a lower rate than we do.\nAnd that's both on the personal side and the corporate side.\nSo, and then we compete with states like Texas, of course,\nwhich are not neighbors of ours,\nbut, you know, and we compete nationally, obviously,\nfor workers, for talent, for companies, for investment,\nthat sort of thing.\nSo it's important to note that just because we're doing well\nfrom a tax rate standpoint,\ndoesn't mean we've done all the work that there is to do,\nbecause no state is sitting idly by.\nAnd that's particularly true over the last few years\nas states have seen lots of revenue come in,\nand they're trying to figure out, okay, how do we adjust?\nAnd we've seen lots of states adjust by cutting those rates.\nNow, how the state raises this revenue is also matters, just the fact that where a low\ntax state is not the only important fact, there's good bit of agreement among economists\nthat different taxes have different effects on the economy.\nSome of them are more harmful to the economy than others, so income taxes versus sales\ntaxes, for instance.\nSo it's important to look at the structure of the code in addition to how much money it\nraises.\nAnd then the final point that we come to the table with is that, generally speaking,\nthe private sector spends money more productively than the public sector.\nNow that doesn't mean that the public sector doesn't do important things, if that were\nthe case, you know, Chairman Tillery could come in and put zeros in the budget and\ny'all could go home after a couple of days.\nObviously, the state funds some very important functions and must continue to do so.\nBut when it comes down to a decision of do we do a little bit more here, do we do a\nlittle bit more there from an economic standpoint, from growing the economy, you know, you\nwant to err on the side of giving that dollar back to the private sector rather than\nfinding another way to spend it here in the public sector.\nSo with all that said, those are the, that's kind of the outline here.\nAnd we had the four scenarios modeled.\nI believe you have these in front of you.\nIf you turn to page six scenario one\nwas accelerating the tax cuts\nthat this body passed in 2022, House Bill 1437,\nand extending them.\nSo if you look at this table number one,\nthe top part of each of these tables\nrepresents the baseline.\nThat's tax according to current statute\nin terms of the rate.\nThese are projections of state GDP,\nthe number of jobs in the state, tax revenues,\nconsumption, and investment.\nAnd then the bottom part of each table\nrepresents what would happen according to the models\nif changes were implemented.\nSo in the bottom part of this table, one on page six,\nyou can see that the tax rate goes down about twice as fast\nat this under this scenario and ends up\ngoing a percentage point farther,\nso going overall about twice as far as current law holds.\nAnd what you see there is that you get a big boost\nin state GDP, you see about by the end of this,\nyou would see about 16,000 more jobs,\nmore investment, more consumption,\nand ending at a tax rate of 3.99.\nThe second scenario was we asked, it's employment, it's about 42 column, so the 25, 79, 11, 14, 16 is what?\nThat would be, so when you got to, on the first line, 2024, if you were at a 5.19 percent tax rate,\nyou would expect to have 2,000 more jobs\nthan the baseline number in the top part of the table.\nThose are the sales.\nThe 2,000, yes.\nYes, these are all in thousands.\nOK, thank you.\nWell, those numbers are in thousands.\nSome of the others are larger.\nPage six.\nPage five describes the scenario and page six has the table.\nLooks like. Looks like this. So we're on five on our sheet. Oh, I say, okay, okay, that's\nit's number six on mine. Yes, yes. Scenario one, table one. Then Scenario two, table two,\nit, instead of lowering the personal income tax, it actually looks at eliminating the\ncorporate income tax over a period of five years.\nAnd so you can see the same baseline top of the table, and this is table two, and then\nthe projections from the model on the bottom of the table.\nWhat I draw your attention to here is if you look at the last number in both table one\nand table two, and they're next to each other on mine, it looks like they may be on\nopposite pieces of paper for y'all, so it's a little bit harder to do.\nWhen you get to the end here, you've cut twice as much tax revenue on the personal side,\nbut the growth to GDP is actually greater on the corporate side, and that's because of\nthe much higher level of investment that you get.\nSo what I would tell you that kind of take away from that is when you're looking at the\nmost bang for your buck when cutting taxes you're going to get a larger economic response\nfrom cutting on the corporate side than on the personal side.\nAnd in fact there's a couple of lines here where you can see where they line up exactly\non the tax revenue side.\nTable three and I'm trying to go through this quickly because I know you'll have questions.\nLet's go back to table one there.\nI think people may still be confused on this a little bit from I'm sensing that in the\nroom I guess.\nBut there let's let's go on our page five there.\nThe tax revenue is at $33 million now you're saying it $20 30 if the tax rate was $4.99\npercent would be bringing in $38.8 billion that's right.\nYou would have growth that would be increasing taxes you'd be cutting the tax rate would\nbe decreasing taxes. And then the chart at the bottom is, I guess, going down from\n$5.19 to $3.99. How much tax revenue is lost from the price line by doing that?\nYes. So when you get to the bottom of that table at $3.99, the tax revenue shows\na minus $4.9 billion. So that's how much you would subtract from that $38.8. And that's\ntell you what you would have at that point.\nAnd one of the things I guess the calculations try to figure out, I try to put it in\nnon-calculus terms or something, if you were at a zero percent tax rate, you would bring\nin the zero dollars.\nIf you were at a hundred percent tax rate, you might also bring in zero dollars because\nwho's going to work if the government takes a hundred percent of it?\nAnd so in between, it's a little bit fluid and you try to drive economic activity versus\ntaxes where you're going to be at and I think that's obviously we can't get\nit to the calculations the economists use back on page 14 and on but that's\nsort of where we're at on that so your tax revenue in 2030 where you're going\ndown you're 3.99% and the tax revenue you've lost what are the assumptions in\nthat, that you haven't made any changes in your budget or?\nSo this is just looking at the revenue sign, that's right.\nSo it's not trying to project versus spending or anything like that.\nIt's just telling you how much revenue would be projected to come in.\nI will point out, these are inflation-adjusted numbers, so these are all, so you would see\nthese numbers plus some measure of inflation.\nkept constant to try to make comparisons.\nThat's a good point that inflation has been taken out of these numbers.\nThe way that, just if I could very simply explain how the model works, you're familiar\nwith a lot of economic models where they use a multiplier to try to say, well, if you\nincrease this spending, then that's going to go, then someone's going to spend that\ndollar and so on, and so it really matters what multiplier you use.\nThis model doesn't do that.\nWhat this model does is it tries to take the empirical data based on when similar changes\nhave been made in the past.\nWhat was the response?\nIn other words, when a state cut taxes by this amount, how many jobs were created above\nwhat was expected.\nSo, it's not trying to calculate how many times money is going to move through the economy.\nIt's trying to say, okay, based on what we've seen in the past, this is what we would\nexpect to happen if this, if this were done.\nThat's the way this particular model works.\nAll right, Roger.\nYour armors.\nThank you, Mr. Chairman.\nKyle, great to see you.\nAppreciate all the great work you've written forward to us.\nSo in looking at your chart, you know,\ngoing down to the 3.99% tax rate.\nSo it's an offset of a co-op for round numbers,\n$5 billion, a budget impact.\nAs other states have done this, obviously,\nthey've had to find either some type of offsetty\nthat they're growing fast enough.\nThey could absorb those.\nor they added taxes in other areas,\nsuch as market facilitator, things that nature\nto make sure we're even with main street.\nHas anybody been doing what we're doing\nis looking at those tax credits\nthat some are not providing return on investment\nand could easily fill some of this gap in?\nI believe there are some states that are looking at that.\nI couldn't give you a state by state breakdown,\nbut I'd be happy to do kind of a roundup\nand get that back to you later.\nOne thing that we've seen the state of Iowa,\nattempt to do is set aside some money in what they call a taxpayer relief fund and the\nidea would be you're going to have to match your budget you're spending to your revenues\nbut while times are good and you've brought in more revenues you could set some of that\naside and then if revenues come in short of what you've projected you've got some money\nto pull out of reserve and dedicate toward that and make the budget whole to kind of smooth\nthe transition as you're doing that.\nSo that would be outside of a traditional rainy day fund then.\nYes.\nOkay.\nAnd then I know you've helped us and looked at some of the measurements that we've done\nover the last few years especially and certainly some have come back positive but a great\nmany have come back with an upside down ROI and could be a great way to help all Georgians.\nVery well could be.\nYes.\nWell North Carolina is an example.\nYou mentioned them that have gone down to 3.99 or trying to get it lower.\nThey quit matching the federal R&D tax credit as an example.\nOur film tax credit that I think is at $1.4 billion, that would be what, $1,400 million.\nThey made a cap of don't even follow the floor out there, $31 million was their cap up\nin North Carolina on that tax credit because their theory was, if we reduce everybody's\ntaxes, we actually get more growth than picking the winters and leaves our center.\nOr Rocky, we're next.\nOn your introductory remarks in the second paragraph, it includes a sentence that says Georgia\nlooks unlikely to continue to attract or retain relocating workers without more competitive\ntax reforms.\nHow do you support that given our meteoric growth in job creation and attracting incredibly\nimportant of manufacturing and particularly in the EV space and in the battery space.\nI mean, how do you support that sentence that you assert there that we look unlikely to\ncontinue to attract or retain relocating workers?\nWell, the differentiation there between what we're talking about, you're talking about\njob creation, which is the company creating jobs.\nWhat this is talking about is the workers to fill those jobs.\nAnd I know that that's been a very important topic during this session.\nWe all recognize that we are growing jobs at a rate that's faster than we're growing\nworkers who are prepared to fill those jobs.\nWe've got to bring people in to fill those.\nAnd if you're someone who is thinking about moving to another state, one of the big factors\nyou're going to take into account is what is the return of my own work?\nis that at what rate will I be taxed\nif I go to Georgia versus another state?\nAnd so that would be the thinking behind that sentence\nis that we're not talking about the employers,\nwe're talking about the employees to fill those jobs,\nbecause as you say, the state has had a very great record\nin recent years in particular in attracting companies,\nbut we need people to fill the jobs that they're creating\nand the people to fill the jobs\nof what this is talking.\nAnd you think people stay away from here\nbecause our tax rate is too high?\nI don't know that there is that the underlying assumption.\nI think the assumption would be they're not moving here\nin the numbers, they could be moving\nif we made it more attractive to them on this front.\nNow obviously people have lots of different factors\nthat they can do account, but this is a big one.\nI just think that's hard to support.\nYeah.\nThank you, sir.\nI'm still having trouble with the chart.\nI should have in trouble, and I'm not being too thickheaded only, but I'm still having\nunder trouble with not enough zeros on the numbers or what the titles mean with you.\nAnd I know we've got time as an issue here too, and we probably need to study and then\ncome back.\nBut just on the personal income tax, I mean, kind of walk down and tell what I know what\ngross domestic product means and employment means and tax revenue.\nI don't know what consumption means, I don't know what investment means, and then come\non down through the holes.\nSo consumption is, so you've got the tax rate, you've got the tax rate, and then the\nyear that it supplied to, just got it left to right.\nYou've got the state GDP in the next columns.\nThat's how large the state's economy is.\nThen you've got employment, how many people are employed, that's in thousands.\nThese other numbers are generally in millions.\nThen you've got tax revenue, how much is coming in.\nAnd then you've got consumption, consumer spending,\nhow much are consumers in the economy spending,\nand then investment.\nHow much is being invested, whether it's\ninto a new business or into expanding a business,\nor that sort of thing?\nSo how many zeros have to go in those numbers?\nThat's what I'm.\nAnd so if you look at the tax revenue number,\nyou're going to add six zeros there.\nSix zeros?\nYes. Okay. That's probably why I'm struggling with it.\nOkay. On three zeroes on the employment census of thousands. Thank you.\nI appreciate it. It wouldn't have fit on the page if we included all the zeroes, unfortunately.\nYeah. Well, it looks like we did something anyway. Okay.\nOkay. And we're going to get shortened on for the same year.\nI'll send her. I'll just go ahead. I'll read it.\nMr. Wingfield, thank you for bringing this. The proper way to evaluate\nthe four scenarios to try to chart a path forward the best path forward how do you do that?\nI mean you I mean can you just look at each one and take\nYou got an increase you got you got a fall-off in tax revenues, but you've got an increase in GDP\nIncreasing consumption increase in investment would you add those and those three and compare against the tax revenue\nHow do you wisely go about looking at these four scenarios and say, we need to do one or two or three or four, we need to do a mix or I mean I read your conclusion it basically said keep the tax rate under four percent.\nSo I think the way that I would answer that\nis to say it really depends on what the priorities\nof the General Assembly are.\nAre you trying to grow the state's economy as fast as you can?\nAre you trying to attract workers, you know,\nto the earlier conversation we were having?\nYou're growing jobs, but are you attracting people\nto fill those jobs?\nI think you have to decide what your policy priority,\nwhat your goal priority is, and then these scenarios help\ntell you, OK, if that's your priority,\nthen you want to look at something along these lines.\nAnd the scenarios really are meant to look rather different\nso that you can have a diverse menu of options here.\nIt's not so much to say you should cut this tax rate\nby this amount in this year, so much as directionally,\nif you go in this direction, you're\ngoing to boost the economy the most.\nYou're going to get the most bang for your buck that way.\nand so on through the other priorities that you can set.\nAll right.\nSenator Estabelle.\nYes.\nThank you so much.\nThank you.\nNo.\nReally quick.\nDo these calculations, particularly on the consumption and investment side, take into\naccount, similar to what Vistralvers was talking about, you make up the money somewhere.\nSo whether it's fees, whether it's increase in sales tax, whether it's increase in property\ntaxes, take into account the fact that consumption may be impact.\nby what's happening in other areas?\nNo, this simply looks at the results\nof making this policy change.\nIf you made other policy changes to accommodate that,\nthen there would be other effects from that, right?\nWe didn't model, for instance,\nlike trying to do a overall revenue neutral\nwhile cutting the income tax by this amount.\nYou would have the effects of, well,\nthe government's going to spend less\nor we're going to raise sales to whatever,\nAs you mentioned, there's a lot of different options.\nYou could have at that point.\nThis simply looks at this particular policy change,\nand then you would have to look at, okay,\nif we wanted to achieve this goal,\nthen we would either need to reduce spending\nby that amount or we'd need to offset\nsomewhere else, that kind of thing.\nI would point out, since we've had some talk\nabout tax credits, table four in scenario four,\nwe asked them to look at what if you cut tax expenditures\nacross the board by 500 million, and that would be tax deductions, exemptions, credits.\nThat's what we mean when we say tax expenditures.\nAnd then lowered personal income taxes by the same 500 million.\nWhat would be the effect?\nAnd you'll see a lot of zeros here.\nAnd so what that tells us is the model says, one, it can't quite go finely enough to any\nparticular change, and this doesn't really specify which credits we're talking about\nanyway. But the most important takeaway from that is what matters from an economic standpoint\nis how much is coming out of the economy to be spent by the government rather than staying\nin the economy to be spent by private actors. So that's really the main takeaway from\nthat table four and that sort of highlights it that a revenue neutral change doesn't necessarily\nto give you the economic growth, where you get the growth\nis by keeping more money in the hands\nof your private sector rather than spending it\nas a state government.\nAll right, and I think Senator Tilbury had a question.\nHe's been waiting for a speech.\nRight, enough.\nThank you, Mr. Chairman, but is this on my life?\nI'm going to use this one.\nI don't really have a question as much as I have a comment,\nand I want to tell you, I want to cut income tax\nas much as I can.\nand or much that we can.\nThat being said, I will tell you,\nmy son lived in Tennessee for three years.\nHe said it was very expensive to live there.\nHe's moved back to Georgia\nand he's so happy to be back in Georgia\nand he is paying income tax,\nbut he's saving a lot more money.\nSo I think you, you know,\nwe got to look at the whole picture.\nSo I just want to caution everybody\nthat, you know, some of these states\nthat don't have income tax,\nthey get you in other ways\nand he noticed it.\nAnd now he notices it.\nNow he bought a house series back.\nHe's married, and he loves being here,\nand he's saving a lot more money, living in Georgia.\nYeah, and I think Georgia has,\nyou've got obviously the Kansas model,\nwhere they cut and hope the revenue would come.\nYou've got North Carolina that's been a measure approach\nover the last 10 years,\nand we've been even much more cautious than them, I think.\nAnd we certainly don't wanna go out there and do anything\nbeyond that.\nIs that Senator Red that's got a question?\nWe're gonna go ahead.\nThank you, Mr. Chairman.\nThank you, Kyle.\nYou know my position on income tax.\nI think Georgia's still 47, 48, 49 in per capita spending.\nMy question is on all these models,\ndid any of them show a reduction in income tax\nthat did not result in an employment growth?\nSo I think if you're running,\nI mean, even when they run the trackers for the hurricanes,\nyou know, there's always this wild one that never comes here and goes to\nVermuda. Is there was there any that didn't show job growth or consumption\ngrowth or investment growth at some point? These are the only four we ran. So we\ndidn't run 20 and pick forward to show you. We designed four and said, let's see\nwhat they say. So you probably you might create one that that would come up\nwith something like that.\nI guess, tagging on that, do you know my measurement?\nDo you, other states that have tried this,\nhave they seen, have you seen a state\nor no of a state that you can give us a point two\nthat they made one of these changes\nand did not see either the increase in state GDP, jobs\nor consumption?\nThe chairman mentioned Kansas,\nand I think that's kind of the cautionary tale\nthat where the idea was we're going to cut taxes\nand we're not going to do anything else to match that\nand we're gonna count on growth to make up the difference.\nAnd that has proven not to work.\nSo you're going to have to offset the changes\neither by making cuts to the budget\nthat you're willing to live with\nor by raising revenues elsewhere\nthat you're willing to live with.\nSo I guess the disastrous scenario would be\nWe're just going to make this one change,\nand we're not going to account for it anywhere else.\nAnd growth makes up for a portion of the revenue loss,\nbut only a portion.\nIt's not going to make up the entirety of it,\nor even the majority of it, in the short term.\nAnd that might have big gut, too.\nSenator Rhett, I was just going to say\nthat we need to make sure we move with caution,\nbecause I remember when I took economics one on one,\nThey would always emphasize that this is a model or vacuum.\nIn the real world, anything can happen like a tsunami or a pandemic, military mobilization.\nI know you want to get to a certain rate, but I just wanted to state that we should exercise,\ncaution us to how fast we move.\nAnd I think we have been cautious and we also have real-world examples of other states\nthat we can model after and say, they did this.\ndon't do that. The state's got a $68 billion deficit, whatever they did, don't do that.\nThe state cut their taxes below us. Maybe we want to look at what they did. So yeah, we've\ngot to be conscious and we've got to do it the right way. I saw there was a lot on over here\nthat went off. Go ahead. This is a comment maybe to even somewhat, not trying to, but\ncontradict what Senator Rest said. The House sent us a bill a couple of years ago to immediately\ngo to 4.99% and had we done that, we would have had the revenue. And we would have had\nthe revenue last year, we would have had the revenue this year. I don't, I guess my\nquestion for you is how do you juxtapose that with Kansas, right? So we, the Senate put\nthe throttle on there to phase it in over eight years or whatever we've done. At least\nin the years we've had so far we know that has not been necessary. So do you have to overlay\nthat with migration patterns because obviously the growth of the state here is very different\nfrom Kansas and would that not give a different result because how we go on to even four\nand a half percent when the House sent us the bill that went to 4.9 and we would have had\nthe revenue and still had a surplus.\nCertainly, the economic conditions were entirely different when Kansas made its change versus\nthe last couple of years that we've seen here in Georgia.\nSo you do have to take account of those things.\nI think what I would describe to kind of get it at the two comments here, I think what\nI would just, the way I would describe these scenarios is more aggressive than current\npolicy, but not recklessly so, you know.\nSo going faster, because we've seen revenue continue to remain strong, even as it's been\nslowing down, it's not really falling off a cliff at this point.\nWe're not reverting back to the preinflationary numbers from a revenue standpoint.\nSo this really is, we've talked about an accelerator for the tax cuts that were passed two years\nago.\nThis is a faster accelerator, you might say, than that.\nBut without going, jumping directly to 399 or something like that in one fell swoop.\nFollow up to that.\nSince we did not go to the 499, we were put in a position of refunds as opposed to a lower\nrate.\nSo you all looked at, or even not, I know you haven't here, but at a macro level, the\nvalue of these kind of responding to surplus with refunds versus a lower rate across the\nboard.\nDoes that, would that impact these employment numbers at all due to predictability?\nWe didn't model that, but I would say generally, I think it's fair to say that it is better\nfrom an economic standpoint to set rates and lower rates and give businesses and employees\nsomething to expect coming down the road rather than to hand them back some of their\nmoney in a rebate. It should, it's going to drive investment which is going to help smooth\nsome of the inflation that you might see from some of that rather than just giving people,\nif you think about a rebate is giving people back more money for what they already did,\nlowering rates in the future is incentivizing them to do more, to work more, to save more,\nto invest more, and that's what grows the economy.\nSo we, I think generally speaking, it's safe to say that it's preferable to provide\ntax relief through rate cuts rather than a rebate.\nAnd I guess I would add to that, we're not talking about cutting services.\nI always like pouring on our teachers and the state of Georgia have the highest average\nby anywhere in the South and Texas, Virginia.\nThat's another argument we're saying.\nWhat will be the right that will get us growth\nin the state and create jobs.\nServices aren't really a part of this discussion.\nHow much longer have you got on your presentation?\nThere might be another question or two.\nI think I've made most of the points I wanted to make.\nSo I know that the committee has a lot of work to do today.\nI'm happy to stick around until after the hearing though\nand speak with anyone who wants to be able to speak.\nSenator, one more question here.\nThank you, Mr. Chair.\nEarlier in your remarks, I believe you said something\nto the effect that this approach, this analysis,\ndid not include the multiplier effects of money spent\nby government in the economy.\nAnd I'm not sure why you would leave that out.\nThat's number one.\nAnd then number two, what do we make of the fact\nthat during the pandemic, when the federal government\nmade major infusions of money to the states and into the economy.\nAnd we flourished in that setting with this infusion of federal investment, and we pulled\nback from a real negative projection that we had expected as a result of going into this\npandemic.\nAnd in fact, we flourished our economy flourished and grew and helped contribute to this big surplus\nthat we have.\nSo how do you account for one, why would you not look at the multiplier effect?\nThat's the basic part of the picture.\nAnd two, we had the real-life demonstration of the infusion of public funds into the economy\nand solve significant, healthy growth.\nSo to answer your first question, the reason,\nas I understand it, that our colleagues at the book\nI institute don't use the multiplier approach,\nis because you've got to pick what number you use\nas the multiplier.\nAnd the one thing that I think you can be certain of\nis whatever number you pick is not going to be the right number.\nYou might be close to the right number.\nYou might be far from the right number,\nbut you're just sort of picking a number and saying,\nWell, we think this is what it's going to be.\nWhat they've done instead is look at the record,\nthe historical record, and say, all right, when states\nhave changed their tax policy, what happened?\nAnd they've pulled all that into the model.\nSo in a way, it is acknowledging that money is going to move\nand that there's going to be growth.\nBut instead of picking a number and trying to base everything\non that, it's taking the totality of the changes\nthat have been seen across a lot of different changes.\nSo empirical data, rather than a forecast, I guess,\nis the way that I would try to describe it\nas the difference in approach.\nBut you're not doing a multiplier on anything\nor the private money.\nIf I understand all those Greek letters and formulas\nat the back correctly, that's right.\nThat's right, okay.\nAnd then for the second thing,\nthe sheer volume of money that was put into the economy\nwas bound to have an effect.\nWhat we're arguing here is that the greater effect\nand the more efficient way to grow the economy\nis to reward people for working,\nsaving and investing more,\nrather than handing them more money regardless.\nSo I got the check, the pandemic relief check.\nI didn't work anymore to do that.\nI didn't produce anymore.\nI tried to go ahead and spend it to get into the economy\nbecause I understood that was the effect\nor the intended use of that money.\nBut it didn't change my behavior in the sense of what\nthe fundamentals of the economy need to grow,\nwhich are work savings and investing.\nSo that would be the distinction we would draw.\nYou can put more money into the economy,\nand something's going to happen.\nBut we believe the more efficient and effective use\nof that money is to give people an incentive\nto do the things that you would like them to do,\nthe things that are the building blocks of the economy.\nAnd the money was put into the economy\nby the federal government in a very bipartisan manner.\nNo doubt.\nAnd it did cause growth no doubt.\nThe downside of that is because of the deficits,\nwe were spending about $300 billion on interest.\nNow our interest rates have climbed over $1 billion\non a $4 trillion budget.\nSo if we, as a state, were saying,\nover 25% of our budget is going to go to interest,\nwe'd be in big trouble around here.\nAnd that continuing interest, which look has been a climb,\nThat's the problem with that.\nYeah, if we max out our credit cards in a year,\nwe can have a really good year,\nand then we've got to pay them off the next year,\nwe're in trouble.\nThe federal government kind of did that,\nand they probably needed to do some of it\nto keep the economy going.\nBut there was a big downside as well,\nfor what they did.\nSenator Audius, I guess you can have a last word here.\nThank you.\nKyle, wouldn't you say that you really did use a multiplier\nrather than project in one, you used what actually happened\nwhen states took these actions.\nSo money did move around, and there was a multiplier,\nand this is actually the actual effect\nof what happened as opposed to picking one out of the air\nand putting it in.\nYou can think about it similarly.\nI'm trying to avoid the word multiplier,\nbecause I think there's kind of a technical use of that\nterm, and that's not what was done.\nBut yes, it's acknowledging that when you incentivize people\nto work more, they're going to work more,\nand that's going to put more money into the economy.\nWhen you incentivize them to save more and invest more,\nthey're going to do those things,\nand that's going to build the economy.\nSo you can think about it that way.\nI'm just trying to keep my technical jargon\nas clean as I can.\nAll right, we certainly appreciate your presentation.\nObviously, I had a lot of interest in the committee,\nand if you'll get offline and get\nthrough the derivatives starting on page 14 with everybody,\nafterwards make sure everybody's good on all of it.\nhere at 10 o'clock tonight and we'll we'll go through all that. So thank you for your time\ntoday. All right is Representative Perkel here did he make it in? I know he was tied up in another\ncommittee. I tried to fill a buster to get him here but I don't think I did so I guess we'll\ncatch that on the Wednesday meeting and we'll be adjourned. It's it's right now it's four o'clock\nunless I get an earlier meeting.\nCan you get me an earlier meeting?\nSay, well, all the subcommittee meetings and corporations\nwho are committee members keep in my public opinion.\nThey try to cancel me because\nsome guys really need the meeting.\nYeah, I mean.\nSo.\nI'm interested in getting more information.\nHere's, uh.\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T19:25:02.377002+00:00"
}