{
  "video_id": "2ei6gDd0UUE",
  "url": "https://youtu.be/2ei6gDd0UUE?t=1004",
  "title": "Georgia House - Day 6 (2026-12-06)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-12-06",
  "duration_minutes": 116,
  "summary": "# Georgia House - Day 6 (2026-12-06)\n\n## Overview\nThis Georgia House session included the introduction of several new bills, the passage of a resolution, and a focus on unity and cooperation among members.\n\n## Key Actions\n**SR 6**: Honoring the life and memory of former Georgia State Representative Thomas O. Davis\n**SR 60**: Commending the Georgia Department of Veterans Service\n\n## Bills Introduced (First Reading)\n- No notable bills were introduced during this session.\n\n## Notable Moments\n- The session began with a Scripture reading and prayer by Pastor George Dillard, who shared a personal story emphasizing the importance of friendship and unity among the representatives.\n- The Speaker recognized Nurse Julie Mack, who has provided medical assistance to members during the legislative session, and encouraged representatives to thank her for her service.\n\n## Votes\n- **SR 6** and **SR 60** were both passed unanimously.\n\n## Attendance\nThe session had good attendance, with all members present and voting.\n\n## Adjournment\nThe session was adjourned. The next House session is scheduled for 2026-12-07.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you good morning members good morning members good morning members please take your seats everyone will come in from the any room we will get this show started ok good good morning good morning good morning good morning good morning All members will please take their seats. Mr. Clerk, ring that bell, please. Thank you, Mr. Clerk. Thank you, members. We're going to have the morning roll call. Morning roll call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? All members voted. Have all members voted? Now, most important member just voted. Yes, sir. All members voted. If so, the clerk will lock the machines. Good attendance. Doorkeepers, will you please close the doors and keep them closed? We can, doorkeeper, we can unlock that door just for a second. As is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 73rd House District, Chairman Josh Bonner. Chairman Bonner. Thank you, Mr. Speaker. Good morning, colleagues. It's my honor to introduce the chaplain of the day. Pastor George Dillard is the pastor of Peachtree City Christian Church. He's been there since 1993. Along with his wife Renee, they pastor an incredible church. He's the father of three children and the grandfather of seven children, the most recent of which was born at 3.45 this morning. So we are so grateful for Reverend Dillard to be here today and to bring us the word. I'm sure he's going to do some bragging on that granddaughter. Thanks so much. Good morning. Good morning. Before I was in Peachtree City, my first pastor was in Effingham County in Rankin, Georgia. I was in the home of our speaker and a number of other fine members of the house here. And 1985 was my first year and I soon became friends with a young man by the name of Billy Jackson and Billy and I hunted together and we fished together and been probably about three years into our friendship. On August day, he knocked on the door of my home and said, George, I need you to help me apply a fee of flea dip to my dogs. Now he had about $40,000. He said, get your pair of clothes that you don't care nothing about. Bring an extra pair with you. We went out there and he held the dogs because he didn't want me to get bitten but I applied the flea dip. Now I don't know how much you know about Southeast Georgia in August. Find kennels but you can't keep the fleas away without applying this flea dip and I know I finally found out why he asked me to bring two sets of clothes because there were fleas crawling in my ears, in my mouth, in my nose. My arms looked like they were just black and color and when we got done with all these dogs, we stripped down our clothes to our underwear. We bathed in flea dip, dog shampoo twice and then we burned the clothes that we had used. As we were standing there watching the clothes burn, Billy said something to me that I will never forget and he has reminded people through the years. He said, George, I have a number of friends but I've only got one that will apply flea dip to my dogs in August. And we have remained friends ever since. Did fight this morning. He was one of the first people that I texted that my granddaughter had arrived safely into this world. Now you may say, well what does that have to do with anything? Well I've always believed that there are two things that matter in this life and really only two things. When you come to the end of your journey, I don't care who you are, I don't care where you've been educated, where you grew up, your station in life, your wealth, your education, none of those things really matter. What matters is who you loved and who loved you. That's it. You know what Jesus said, a house divided against itself cannot stand. The only way that a house can avoid being divided is unity. The only way to have unity is through friendship. The only way to have friendship is through love. You know, we need to think about what divides us in this life. Usually it's pride and illusion of power and a unrealistic sense of importance. But what brings us together is humility, a willingness to forgive, an acceptance of the fact that none of us are perfect and most of all being there in the toughest and most difficult situations. Never forget these words, George, I have a lot of friends but I've only got one that are dip dogs with me in August and I encourage you to look around this chamber and be the kind of friends that hang in there in the difficult times. None of us gets it right all the time but we can do this. This is what the Apostle Paul says, make sure that nobody pays back wrong for wrong but always strive to do what is good for each other and for everyone else. And I encourage you to remember that you are here because the people of Georgia have confidence in your ability to lead and to do what is best for all Georgians. I thank you for your service and I would ask you to stand with me for a word of prayer. Almighty God, maker of heaven and earth, you are the God of Abraham, Isaac and Jacob, our help and ages passed and our hope and days to come. And so Father, we pray that you would bless the members of this house with wisdom, clarity, discernment and a heart of service, Father, that you would bless them with unity and peace. And Father, thank you for all the things that we have in this life. Thank you for our families, our friends and most of all your grace and mercy. And we thank you for all of these things in the name of your Son, Jesus. Amen. Would you join me in the pledge to the flag? I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Members, what they forgot to tell you about that newest grandchild, she needs to be properly introduced as Madeline Kate. Qualo, Madeline Kate Qualo, born at 3.45, were you there? Well, that's your seventh, so we'll give you a pass on that. So George, we appreciate you being here. You've been a friend for a long time and good luck to mom and baby. Doorkeepers, you can unlock the doors. Members, you may greet George in the south any room and thank him for his service to us today. Thank you.\n\nI want to bring your attention to someone who has served this house over the years. If I have your attention briefly for just a minute, just for a moment. We do not have a doctor of the day today, but we have Nurse Julie Mack, who's downstairs. She's been with us this entire session. And Nurse Mack is always here for us doing session. We appreciate her service to us and to this general assembly. And certainly I encourage you all, if you have a moment to go by, to aid stations and give your special regards and your thanks to Nurse Mack and tell her how much we appreciate her being here for us. With that, hope you will. Chair recognizes Chairman Tarvan, the chair of the Committee on Information and Audits. Chairman Tarvan. Mr. Speaker, your Committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. Thank you, Chairman Tarvan. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and been found to be correct. Is there any objection to dispense with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative Shreishan of the 104th Moose Vol. He establishes the order of business in the first part of the period unanimous concerns. Second reading of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none and the resolution is adopted. We have no first readers. So Mr. Clerk, second reading of bills and resolutions. The clerk will read. House Bill 5EX by Representative Beverly B143rd, a bill to provide for the composition and number of state house districts. House Bill 6EX by Representative Beverly B143rd, a bill to provide for the composition and number of congressional districts. Senate Bill 3EX by Senator Eccles of the 49th Kennedy of the 18th Goods, or the 51st Robertson of the 29th brass of the 28th and others, a bill to provide for the compensation and number of congressional districts. Senate Bill 5EX by Senator Summers of the 13th, a bill to amend the act, creating the state court of Turner County through second readers. We have no report sustaining committees. We have no morning orders. We're ready to move on to the rules, calendar. Mr. Clerk, will you read the caption to Senate Resolution 6EX? Senate Resolution 6EX by Senator Hodges, the 3rd Burns, the 23rd Williams, the 25th Hatch, and the 50th Kennedy of the 18th and others. Expressing support for the Atlanta Public Safety Training Center and condemning acts of violence and domestic terrorism. This resolution has been assigned to the Committee on Rules, so that committee recommends this resolution be adopted. Members, if you will give your attention to the gentleman about to enter the will, Chair recognizes Governor's floor leader, Representative Will Wade, to present the bill. Representative Wade. Thank you, Speaker. Good morning, colleagues, ladies and gentlemen, and the gallery. First, I want to just share with you. I hope you all have a Merry Christmas and are thankful and never forget about the opportunity we have to be in this building, especially this time of year. It's an honor for all of us. And as my late father would say, son, don't ever take yourself too seriously. You're not that big a deal, but there's times and lives in which you're called to do something very important. And I think today we're all in that position. I come before you today to present a resolution in support of the Atlanta Public Safety Training Center. The resolution also condemns the acts of violence and domestic terrorism that have transpired while the center has been under construction. Since before construction, even again at the site, we have witnessed an alarming number of attacks on law enforcement and private property in our capital city. In other parts of Georgia and beyond. We've also seen a polling acts of intimidation against families and hardworking men and women who are just like you and me and our families from all of our homes. At the same time, there are leaders in this state who wish to remain on the sidelines with their heads down, ignoring all these atrocities. But I come here today to say that this body cannot and should not remain silent. It's very simple. You either support public safety officers and law enforcement and law in order or you don't. Voting yes says you do. Voting nay says you don't. That's an easy choice to make for me. With that, Mr. Speaker, I yield for questions. Gentlemen, has no questions. Thank you, Speaker. I yield the well. Gentlemen, yield to the well. In the wisdom of our rules committee, we have limited debate on SR6EX to one hour. That will be 30 minutes for those opposed to the proposition in 30 minutes for those in favor. And I'll remind members that we will give you a heads up if you run close when you start running down on your timeframe because because of technical difficulties, the lights may not be working. They're not working. So we'll give you a heads up if you get close to your time as time expires on 30 minutes for those opposed or in favor. So with those instructions, I will recognize. Representing Vermont is recognized to speak to the resolution. Give your attention to the lady in the well. Good morning, colleagues. Thank you, Mr. Speaker. And thank you all for this opportunity to address you on this resolution. You're probably wondering why I'm up here, but I probably again. I don't know. I couldn't let a session go by without talking about unintended consequences. But I want to be clear that I'm standing in opposition to this resolution today for a couple of reasons. One as I previously expressed earlier this week, I do not appreciate my positions being made for me. I think it's very important that with situations like this, we bring nuance to the table because these are very important things that we need to be talking about. But additionally, this resolution did not come from our body and it did not come from senators who represent the area either. So I figured why not engage as well. In my opposition to the Atlanta Public Safety Training Center, dubbed as Cops City is multiple fold. The first, the original location was not designated for this project. It was promised to the community as a place, as a safe place, and a clean place for the community to enjoy both the environment that is there, the public area that is there, and unfortunately that promise was not kept. So I figured I'll read a bit of an excerpt of my original statement on this issue. I had originally heard about this back in December, and the reason that I had attended this was that I began to see an alarming pattern of governmental overreach. As we have seen, there were multiple pieces of legislation that were being pursued that would have preempted local rule. To me, this is no different. We also saw legislation that was reinstating things like mandatory minimums and curtailing our constitutional rights to organize. And some of those bills passed. Some of them have now been found unconstitutional or would not held up. The thing is, this had translated into real world consequences in many ways. And as we have seen over the past few months, we have seen a dangerous conflation between those who have been peacefully assembling around this issue and peacefully organizing around this issue and peacefully engaging their elected members around this issue with those who have chosen violence or in this case destructive tactics. And that to me is dangerous, right? Because we want people to engage us in this process. We don't want them causing property destruction. I want to be clear, I am here because I believe in this process, right? I am in this body because I firmly believe that our bodies can do really, really good work for the people that sent us here. That's why I did the hard work of getting elected. That's why I show up every day even when I'm not feeling great. And I work really hard to fix the bills that we are trying to pass and make them the best that they can be. And that's what happened with this specific project was completely antithetical to that. And again, I want to be like a thousand percent clear. I am here because I don't believe in destroying property to get what I want. I don't think that's effective. And I don't think that's how this should be done. But what I want you to know is that I did get a chance to meet with some of the people who are pursuing this referendum process. And I watched how they set up their referendum process. They had an affidavit. They had to get specific information from residents to ensure that they qualified to submit that referendum. And if you're wondering what that has to do with this specific resolution, it's that those people were not only ignored, I want to be clear here. It's not just that they were ignored. It's that they actively engaged in this process the way they were asked. Every hurdle they were given, they met it. They were told time after time, if you just do this thing, then we'll listen to you. If you just do this, if you show up to city council meetings, we'll listen to you. And so they did. They spoke for 18 hours straight on two separate occasions. Can you imagine the kind of engagement that is when people show up for 18 hours to talk about something? I mean, that is so exciting to me personally, somebody who actually cares about civic engagement and wants people involved on this kind of stuff. To me, that's an indication that people care about something. But then they got ignored, right? People didn't listen to them. And those same people, by the way, then turned around and set up this referendum process. So I want to be clear. It's not that they didn't do what they were supposed to do. It's not like they didn't engage the way they were supposed to engage. They were told how to engage and they did it. They followed the rules. And so they were ignored. They did the referendum process. And I personally cannot in good faith, for example, say and loop them in to the same group of people who we are now talking about here because there is no distinction being made in this resolution, by the way. No where in this resolution, as an example, does it distinguish that there are those who oppose this project through the civic process? There's actually, I checked a few times, nowhere. Unfortunately. And to me, that's sad. Why would we do that to our constituents? Why would we do that to the people who trusted us to come here and on a resolution of all things? And so I hope as we continue to engage on these issues, as we talk about local matters, we look at the details of them so that we don't inadvertently, as an example, and fringe on people's constitutionally protected rights of free speech and peaceful demonstration. And so with that, I hope that I have made my position clear that my opposition here has nothing to do with public safety, right? As we know, and I've worked professionally on management issues in order to retain employees, it's not just building them fancy facilities, you got to pay them better, you got to take care of them, you got to make sure their equipment is upgraded, you got to make sure that the cars they send, for example, have working air conditioning. That stuff you can do with $90 million, that isn't a fancy facility. So as I vote no today, I hope some of my colleagues will join me because I firmly believe that we are now also looking at a freedom of speech issue as well. Thank you, I yield the vote. Thank you, Representative. Representative, as you are to the well, Representative Park Cannon, the Secretary of the Minority Caucus to recognize the speak to the resolution, Representative Cannon. So today I rise on Muscogee land. This capital is built on Muscogee land. And it happens to be the same land of the measure we're debating. That's Muscogee land too. Now when we're here, we get to decide what happens to this land. And I'm wondering why we're deciding what's happening on that land. Obviously after much consideration of possible retaliation, I decided to come into point now a few issues that I see with this measure. And I really thank you for listening to me. First of all, this is not what we're here to do. The executive order said draw five black districts, make better statewide maps for Georgia's growing populations. And there is a small bullet point about local matters that allowed for local legislation. If local delegations have anything to consider or anything to tend to, they can carry measures by their local delegations. Because we respect home rule here. But on this measure affecting the city of Atlanta delegation, the Fulton County delegation and the DeCab County delegation, none, not one, none of the chairs, none of the members have been consulted on this measure. In fact, the city of Atlanta has been quoted in saying, we did not know nor request this resolution. And we think it is really to put a target on the local delegations. My second concern here is that 116,000 people signed a petition that's called Let the People Decide. 116,000 is more voters than have turned out for any elected official in the city of Atlanta ever. If we believe in a representative democracy, this shows us what it could look like. My third issue is there are legal cases right now with people from outside of the state who are being conflated with lawful residents' cases inside of the state. I find it very inappropriate for us to make legal conclusions on active criminal cases. That's what some of these lines in here do. So what are some of these cases? One of them is an $11 donation to a bail fund. That's being called up on a RICO charge. That's being conflated to be domestic terrorism. This overreach is really upsetting. It's really chilling. It needs to stop. I'll finish by just talking about my constituents. I'm so proud to serve. Y'all make me take hard stances, but I'm proud to do it. One canvasser talked to me about me being a supporter of the current mayor and living in Grant Park. He was eager to sign the petition. He said he just felt the city was really getting it wrong on this particular issue. He wanted to be able to vote on the matter. Senator volunteer told an older voter who was unapologetic about her support of law enforcement. But nonetheless, she thought she should sign the referendum because she felt the city constituents should be able to vote on the matter. She felt the process that the city was undergoing was undemocratic. And she wanted to clear that up. She wanted to vote affirmatively for this use of Ms. Gogi land. Another one of my constituents on Edgewood spoke about an encounter that she had with a 78-year-old man. As she talked to him, the man's hand was shaking. So she asked him was he okay? Was he nervous? He said no. And that he was worried that his signature was going to be disqualified because he had recently had a stroke. And that his signature looks different than it did on his original voter registration over 30 years ago. Using an exact match strategy which has been used before at the state level simply would never match. But it was him. What could he do? I'll just close by saying as someone who's face backlash, retaliation, threats of harm, and the fact that he's a man. I see you all. I see my colleagues who today feel like if they vote no or walk on the vote today that they're going to face that same retaliation. I ask you to fear not. I remind you this is our duty. We owe it to our constituents to stand for their right to expression. And to make hard decisions on local issues that affect them. Thank you for listening today. You'll do well. Ladies, you'll do the well. Represent you, Draper. You recognize the speak to the resolution. Good morning colleagues. Now we were called to this special session for a vital yet narrow purpose to comply with the judges order to remedy the unlawful maps that this party passed along partisan lines in 2021. Today is the second day this week that we are voting on issues not only outside the scope of the governor's proclamation convening our special session, but outside the scope of our authority and influence as state legislators. Georgia House Democrats showed up in good faith to do the business of the people and pass lawful maps. And unfortunately, what we have arrived to instead is to maps that fall short of complying with the district court's order. And a resolution, the primary purpose of which is political gamesmanship. Simply put, this resolution was brought forward to force Democrats into making a binary choice on matters where these choices fail to capture the reality or nuance of the situation. Right? If Democrats vote yes on this, we give no wait to the legitimate concerns about the center and about our right to protest. But if we vote no on this, you'll say we're against public safety. You've probably got the attack ads drafted up and ready to print for 2024. So win-win for you to lose, lose for us. This resolution is a game of Democrat Gacha. And I think that is so sad because what it means is we are spending our valuable time doing this instead of spending our time doing work that could actually improve Georgia's lives. I want to be very, very clear about something. I condemn violent protests. I support training our police. And if the public safety training center goes to a vote and the people vote in support of the training center, I will support the training center. But based on the resolution as it's written in front of me, I cannot in good conscious vote yes. I see this resolution and this vote for what it is. A thinly veiled attempt to sow Democratic division and frame us for something we are not. And I will not fall for that. I will not seed the issue of public safety to the majority party. Democrats are the party of public safety. We know that Georgia wants safety and security and we have real policy solutions to get us there as opposed to performative resolutions. Police training is an important aspect of public safety but it is just one aspect of public safety. For Georgia's to truly be safe, we have to take action to address the housing crisis. We have got to make investments in mental health services. We need access to good education, good jobs, good childcare. We have got to have clean air and water. We have got to reform the criminal justice system with its over reliance on mass incarceration. We need to provide sufficient reentry support to people who have served their time. And we have got to stop talking about why there are so many guns on our streets which not only put our police in jeopardy but put our children in jeopardy. It is the height of irony that you want to put Democrats on record on public safety by voting on this resolution. Yet you are unwilling to put yourselves on record by allowing a single common gun safety bill to vote. All right. There's one more point I want to make. This resolution refers to out-of-state groups who have engaged in violence and property damage as part of their campaign against the training center. I join you in condemning those actions and I want those folks out of Georgia. However, I also want to make clear that there are many people here in Georgia, in my district, including myself who have real and legitimate concerns about the construction of the facility and the process behind it. Do not dismiss those concerns by conflating us with extremist violent protesters. Do not dismiss those concerns by suggesting that we can't hold those concerns in one hand and believe in public safety in the other. It is not lost on me that not a single person who sponsored this resolution represents the city of Atlanta or DeCab County. Athens, Gainesville, Millageville, Macon, Brunswick, yes, but not Atlanta. Look, I think that's a really important point, not just as a jab against members who claim local control is important until it doesn't favor them, but because it is easier to oversimplify issues when you are not familiar with those issues. As a member of the minority party, I may not be able to stop performative resolutions from being written and forced upon us, but I can use this opportunity to give a voice to my constituents who have concerns and explain to you why the issues concerning the center are not simple and not straightforward the way they are presented in this resolution. So I'm going to share just a few criticisms raised about the training center. One, there's environmental concerns, specifically around the impact of the construction to the South River and the South River Forest. Two, there's criticisms about the location of the facility near a residential, predominantly black neighborhood, and questions about whether the city made a good faith effort to find a more suitable location. Three, some residents are upset that the city of Atlanta broke a promise to build a large green space in the land where the center is now located. Four, some residents who live by the facility worry that their home value...\n\nWe'll go down and that the noise and that there will be noise coming out of the center, including the sound of gunshots. Five, others criticize that the city has misrepresented the cost of the project to taxpayers by tens of millions of dollars. Six, Attorney General Carr has aggressively, and with great fanfare, politicized the arrests of opponents of the training center, who brought overly broad domestic terrorism charges against a large swath of people, and doing so has had a chilling effect on our constitutional right to protest and assemble. That should concern everyone in this building. And finally, and again, this is not an exhaustive list, but opponents of the center has spent thousands of hours engaging in a citizen-led petition process. They wanted to put this issue on the ballot, and yet that issue has not those petitions have not been processed. Now, I would be remiss if I did not also say there are many people in my district who support the center. That is also true. But I hope that what I have shown you today is there are real concerns, real issues, valid criticisms. And even though it doesn't fit the narrative that you want to tell about Democrats, I can tell you the majority of folks with those concerns also want a well-trained police force. And we all want to be safe. So please, be honest with yourselves, if this facility was in your district, and these were the issues that your neighbors were grappling with, would you be forcing this vote on a reductive and oversimplified resolution on this body? If your answer to that is no, please vote no. I think the lady has concluded her remarks, and she has yielded the well. That's all the speakers we have opposed to SR6EX. Now we will move into those in favor. We have allocated 30 minutes for those in favor to speak to the bill, and I will let you all make that determination on your own. So we will first recognize Chair Lady Deborah Silcox to speak to the bill. Speak to the resolution. I am sorry, SR6EX. Representative Silcox. Thank you, Mr. Speaker. And thank you, ladies and gentlemen, for your attention this morning. I rise to urge your support for Senate Resolution EX brought to us by Senator Mike Hodges in support of the Atlanta Public Safety Training Center. Moreover, this morning I want to commend Mayor Andre Dickens as well as the Atlanta Police Department, and of recent the Atlanta Journal Constitution for their endorsement and support of the Atlanta Public Safety Training Center. The training center will include an emergency vehicle's operation center to train firefighters and police officers safe driving techniques, a lab to develop technological innovations in public safety, a training fire station, and even a mock street escape to simulate crisis situations faced by first responders, as well as leadership institute where police officers and firefighters can learn the latest advancements and improvements in law enforcement management. Finally, the Atlanta Public Safety Training Center will allow for better collaboration of the training of all first responders with partner agencies in all of the Atlanta metropolitan area. We need our capital city to be safe. We need the people of the city of Atlanta and the metropolitan area to be safe. And I personally want all of my police officers and firefighters to have the latest technology and the best equipment to deal with all different situations that they may face. According to the Atlanta Police Department website, year to date in 2023 alone, there have been approximately 4,000 crimes against society. There have been 23,500 crimes against property, and there have been 6,500 crimes against persons in the city of Atlanta. These statistics speak for themselves. The needs for the Atlanta Public Safety Training Center are great. I urge you to vote yes on Senate Resolution 6EX. And I will yield for questions, Mr. Speaker. The lady has a question to your left representative Oliver to your extreme left way back here has a question representative Oliver. Does the lady you guess I do? Have you ever been to the South River Forest? I have. Have you been on a tour of the South River? I have not been a tour on the South River. You are aware that there were 5 to 8 years of planning processes in relation to improving, saving that green space for Decap County and Atlanta citizens. Are you aware of that? Do you believe that it is insulting to those citizens who spent 5 to 8 years of volunteer time trying to protect that green space to put this facility in the middle of it without any notice? I appreciate very much their concerns, and I am delighted that the majority of this space isn't going to be free green space preserved for all the citizens of the metropolitan area to enjoy. But I do believe that the overriding concerns of public safety are greater. Final question, ma'am, please. Of course. Are you aware that the South River is one of the dirtiest rivers in the United States of America and is a major contributor to our major water force of ultimately. I do not know that. Thank you. Thank you. Are there any further questions? No further questions. If so, then I will yield the well. I want to speak her. Thank you. The lady issued it well. Chairman Collins, the chairman of public safety and Homeland Security is recognized to speak to the bill. Chairman Collins. Thank you, Mr. Speaker. I just want to come to the way I don't come here often because I just don't feel like I can say anything that's going to change anyone's mind. But I will say this. I drive in from West Georgia every morning. I come over that hill at six flags and I see our state's capital city Atlanta. It's shining bright most mornings, especially this morning. We have an opportunity here to do something to change public safety in this state. We have an opportunity for our capital city to have the premier training facility in the nation to go along with the premier airport in the nation. The busiest airport in the world is Hartfield Jackson International Airport. The number one goal, the number one priority for government is to protect persons and property. That's all we're wanting to see here, ladies and gentlemen, is our capital city to be the best it can be. You know, the way that training is done in most jurisdictions in Atlanta is not unlike those. It's kind of a hodgepodge. You have a few training areas over here. You have a few training areas over there. And it's been piecemeal. I want to apologize to the firefighters because this project has been called cop city. This is this is as much to help fire and EMS is it is anyone else. But yet it's been hijacked that narrative has been hijacked because over the last several years it's been. I guess what I could say political to defund the police. Mayor Dickens came through those two doors right there when he was elected mayor because he was invited by our late speaker David Roxton, very reasonable man, very deliberate, very forth thought in the way that he conducted the business of this house. He invited Mayor Dickens to come in. Mayor Dickens wants to change some things in Atlanta. Hey, I think he's doing a great job getting behind this project is very important because not only is it going to provide a new place where public safety can train. But we have seen all across this state all across this country. A pivot toward community policing. And to do that you have to have the best resources possible. You have to have a facility where you can simulate training real world training. You know there's that cliche you get what you pay for and it's easy to throw around a 90 million dollar figure and why are they spending 90 million dollars on that. Tell me something in life that that's not true that cliche is not true you get what you pay for. I can't think of anything. And to invest money in a facility where we're going to be training the best public safety has to offer it's going to help with recruitment recruitment retention. And just raise the bar for our state. You know I'm not going to say if you vote for this this if you vote against this resolution you're voting against public safety you got to go back home to your constituents and justify if you vote against this not not me or the Republican party. But I want to mention a couple of things to you I'd be remiss. And to to to my my colleagues point about the river and pollution. You know what's my understanding that this project is going to preserve 300 acres 300 acres in that area that I've read that in a couple different places I could be wrong. Central Park in New York is only 843 acres ladies and gentlemen. What what a huge benefit that's going to be to preserve that many acres in that area. And again I want to say that the best way that we can preserve the right to peacefully protest in this country in this state is to support law enforcement. I will defend anyone's right to peacefully protest. You know when there's been a lot of a lot of hyperbole about about the violent of the state. I'm protested gone on the criminal activity and you know those people need to be charged and they have been charged. They will have their day in court they can justify their actions. But if we completely abandon public safety and walk away from supporting public safety this state and this country will be in the heck of a shape. A couple other points I'd like to make Mr. Speaker before I close. There's been some comments about the way that this process has been carried out. This resolution doesn't wait into that. But we elect local officials mayor council members to make decisions. We elect state representatives to make decisions for our district and senators. And you got to trust that process. I certainly trust that process. If this public safety training facility is built and I certainly hope that it will be. That will be a time when those constituents in that area if they didn't want this they can vote out those elected officials whether that happens or not. That's not up to me. But this in no way is trying to circumvent local control. We're just saying that we support public safety and we feel like having the best facility for our first responders and our capital city is important to us. And we're not going to listen to that false narrative that's been beaten by a small fragment of people on the on the other side of the issue. And Mr. Speaker that that's all that is and I just want to appeal to you today. Support public safety. We hold public safety accountable. And I want to add that again here in this chamber. You know we have the highest revocation rate of any state in the nation. We do a really good job of policing the police and revoking the post certification to those officers who are found guilty of of abusing their power and not living up to their. Oath as a peace officer. So with that Mr. Speaker I'd yield the well and ask your favor will consideration for this this resolution. Gentlemen has yielded the well. Thank you Mr. Chairman. We have a couple more speakers. Thank you members for giving your attention to those in the well. Representative Daniel is recognized and I think she's going to bring a friend with her. Baby Zane is going to accompany her to the well. Representative representative Lauren Daniel is recognized speak to the resolution. Thank you Mr. Speaker. Hopefully he will remain sleeping and quiet. Today I rise to urge my colleagues to vote for this resolution supporting the Atlanta Public Safety Training Facility. This resolution will signal our full support for our first responders mayor Andre Dickens and the Atlanta City Council. This facility will help with the training of not only our police officers but also our fire EMS and other emergency responders. I urge all members of the chamber to reject the opposition and threats being heard from environmental terrorist on this issue. Those arrested during the stock cop city movement have held from states like Maine, Michigan, Nevada, Tennessee and Washington. The actions of these individuals do not help protect our communities in Atlanta or around the state. Last session I spoke about a similar issue during the debate of House Bill 505. When I lamented that out of state terrorists were erasing the voices of the community who was trying to be heard. Yet here again we find ourselves in the same situation. Let the record show that anyone who stands with these individuals is condoning insurrection against government institutions and the attempted killing of a Georgia state patrol officer. The actions of these radical ideolog show that they seek to rule by fear and terror. They have docks to home addresses of the mayor, members of the Atlanta City Council, the City Clerk, members of APD and maybe most disturbingly the judge overseeing their prosecution. They have physically threatened and used racial slurs against and sent death threats to council members Michael Julian Bond and Andre Abune. They destroyed millions of dollars worth of private business construction equipment and in May two members of the protest were arrested in Barto County on suspicion of stalking and felony intimidation of a police officer as an act of revenge. Let me read some of their own words to you today. If you build it we will burn it. If the police and all states of the police state make them tremble. If those are not threats I don't know what are. This issue is not a far away cause but rather something that will impact every one of our districts in the coming years. This facility is to train police and fire and EMS workers for throughout the state. If you feel that your district you represent would want you to vote no then vote no. Just earlier this week we saw almost a third of this body leave their constituents without representation by walking out of this chamber and truthfully our constituents deserve better. To my colleagues I hope you have enough courage today to do your job and vote Mr. Speaker. I yet well. The lady has yielded the well we have at least one more. One more speaker representative or coyer is recognized to speak to the bill. Representative or coyer. Thank you Mr. Speaker. Colleagues may take on this bill may be slightly different because it hit home to me. I represent the 102nd district Lawrenceville specifically and a concrete company in my district had 15 of their concrete trucks set on fire by protesters because of this training facility. There for some reason believed that this company was a plain concrete that was being used to build this facility. And each of those trucks and I know because as an engineer civil engineer and environmental engineer I work with concrete sometimes. Each of those trucks cost $300,000 and 15 of them were destroyed. I think that was wrong. It is important that we know what we ask for. If we ask for a well trained police force then we need to make sure that we are not going to be able to do it. That we have a well trained police force. I think it was wrong to attack that business because 75 people were rendered unemployed till date they have not recovered yet. And that is not right. For me why I say that my take might be a little different is that I worked during the resolution for Israel because I didn't believe we should be on the agenda. I also don't believe this should be on the agenda therefore I want to work but I wanted to make sure that you get information of what happened especially in my district. Thank you Mrs. Speaker. The gentleman is you to the well. That concludes all this speaking in favor we are going to take up the chairman's time in just a second but I want to ask members of this house to honor a former member of this house. This is an attendance with us. Melvin Jefferson. Melvin everson good to have you Melvin. We are good to see you. That is welcome Melvin. He served with distinction here in Melvin is always good to see you my friend. Former representative everson. We will now hear from the chairman of the committee. This bill was assigned to chairman Richard Smith, chairman of the rules committee. Chairman Smith. You have as long as you want. I want to take long. There has been a lot of comment over the last week and a couple of comments this morning as it relates to resolutions that we have brought forward this session. I would encourage all to read the Georgia Constitution. Article 5 section 2 paragraph 7 where it says the government has been in the state of the state of the state. The governor may convene the general assembly in special session by proclamation. No laws. Remember the term laws shall be enacted in any such special session except those that relate to the purposes of the stated proclamation. I saw no place in there where it said you could not do a resolution. It says the provision is explicit as to laws and there is no prohibition of resolutions. Now, getting to the one we are talking about today Senate resolution 6EX. I wrote down some things and I probably am not going to say them. But I would like to tell Jay Collins, representative Collins, I really appreciate his remarks because he made the same thing I was going to say. If you look at this resolution, it is pretty straightforward and that it says express support for the public safety training center and condemn acts of violence and domestic terrorism. That is basically what it says. I know there is a lot of other stuff that has been read into this. I have heard the word retaliation or democratic gotcha and all this kind of stuff. All this thing does is express support of this facility and condemn acts of violence and domestic terrorism. And you have to understand, I come up from a different perspective than some of y'all. I have a young man that married my granddaughter who is the father of my great who is a police officer. I have a young man who married my daughter who is a farmer. And yet these individuals are being condemned because we want to have our moment in court so to speak. So we get up here and we say all kinds of things and try to cloud the issue. But when we start talking about defunding the police or we start talking about doing things that is not going to assist them and doing their job, we are not going to be able to do it exactly what we are telling them their problem is. In order to be a well trained anything, you have got to have professional training. It is that simple. You do not just automatically become a police officer and you do not just automatically become a farmer. The young man who was a farmer also was an EMS before he became a battalion chief in the fire department. But unless you provide the proper training, then you are going to have more problems. And I understand that this facility will be available for other parts of the state. But I will tell you, we probably need a whole lot more of these facilities around the state. When you have got the crime issue that we have got, when you have got the murder rate that we have in a lot of places, the better trained police force and not only do police officers get shot at EMS folks get shot at too, because a lot of time there are first survivors at a domestic situation and the last place you want to go is in a domestic situation. A lot of times there are the first ones arriving. So if you want a highly trained police force, you want a highly trained firefighter, you want a highly trained EMS, you have got to have these kind of facilities. Inveriably, when something like this is proposed, most of you all have heard of this term, NIMBA, not in my backyard. Now if this facility was being built and Clayton County, if it was being built and making, there wouldn't have been this conversation that we have been listening to. But you know, there is a crime issue in this state. There is a crime issue here in Atlanta. There is a crime issue in Columbus, Georgia where I am from and represent. And the only way this thing is going to ever, ever be solved as much as it can, is if we have the most highly trained police fire and EMS units that we can have. It's just that simple. You cannot do this without a highly trained staff. I'm not going to say this other stuff. I speak would probably call me down. But I'm just very much in favor of this facility. I think the intent is exactly what this state needs. And like I said, we probably need more. I'm going to relinquish the rest of my time to represent the way. Thank you, Chairman Smith, for your remarks. We know you have a unique opportunity to understand the issues that with your position as rules, chair, and as your position as a father and a grandfather and a great grandfather. Thank you for your remarks. For the remain of the chair's time, we will recognize representative Will Wade to speak to SR6EX. Thank you, Chairman. I hope all this body, and I'm not saying this because he's our rules, Chairman. I'm saying this because I think what he just presented to you, hopefully we'll switch some boats because it's very wise and personal. While we've been here this last week or in a half or so, there's a big world out there and there's a lot of negative things happening. We've got regions in our world that are powder keg. Yesterday, the FBI director testified that he's never seen, and the agency has never seen, every area of their concern at the highest terror threats. I was a senior at the University of North Georgia on September 10th of 2001. September 11th shaped my generation. I had friends who were set to graduate with me in December that decided to go ahead and pre-imp their graduation and continue on and to serve as officers of the United States Army. Terrorism is real. I want you to think about what this actually is telling our community, our state. This is an opportunity for unity that the pastor of the day talked about. The Atlanta Public Safety Training Center will be a new state of the art facility that's going to provide the space needed and technology for law enforcement, firefighters, and other first responders to be trained and prepared to handle real world scenarios. Scenarios that are changed even in 2023 as they were in 2021. This is not just going to protect us. This is going to help protect the lives of those that are there running too danger on our behest. This in no way diminishes or minimizes every one of our ability to protest peacefully. I believe every one of us here serves because we appreciate those that want to advocate for their ideas. But we do not want to support those that would throw Molotov cocktails and shoot our men and women in blue. I plead with you. I acknowledge this state is I believe the greatest state in the nation. We are a tourist destination. You already heard the discussion about Atlanta, Hartzville, Jackson Airport.\n\nThose that want to come here, we have major league sports teams. We're going to be hosting things like the College Basketball Championship, the World Cup, and we're even getting the Major League Baseball 2.0, I guess they figured out it was time to come back. But they're coming to this city because the net positive is great. We have to invest in our first responders, our police, our fire. They deserve it. I hope that you will listen to your heart and know what's in the best interest of the majority of the people you serve because this will not just benefit the city of Atlanta. It will benefit every single person that lives in this state and every person that travels to our amazing state of Georgia. With that, I ask for your favor, consideration to Senate resolution SR6EX. Thank you Governor Kim for leading on this issue and I yield my time. Thank you. The gentleman has yielded his time back to the chair and as yielded the well, that concludes the chairman's time. Any further comments Mr. Chairman, you do have some time left. So with that, that completes our debate on the bill. First clerk, if you'll ring the bell, let folks know we're getting ready to vote. SR6EX. All members were ready to vote. I will remind the members of the rules of this House. House rule 133 states if you're on the floor that you're required to cast your vote. With that, is there any objection to the previous question being ordered? Chair has none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? Chair, here's none. The report, the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes, that's green. All those opposed will vote no. That's red. The clerk, Mr. Clerk, will you please unlock the machines? For what purpose does chair lady camp rise? Parliamentary inquiry. Stature inquiry. Isn't it true that I was a communications officer and dispatcher and also attended firefighter training and the education I received at the Georgia Public Safety Training Center was imperative for public safety and for me to do my job. And as the state of Georgia grows in population and the density of Atlanta increases, we have to have more training centers throughout our state. So dispatchers, communications officers, EMTs, firefighters and police can be appropriately trained so the public and the officers themselves may remain safe. Sounds like the lady experienced that training. So thank you for your service to this house and to the people and thank you for your service to the entire arena that you just outlined. Thank you. For what purpose does floorly to Mac Donald rise? Parliamentary inquiry. Mr. Stature inquiry. Isn't it true that attorney general is doing his job of prosecuting this domestic terrorist that sent private equipment on fire that representative of Korea who is not here right now. But in any doing his job prosecuting these individuals, is that not true? I'm sure the gentleman thoroughly believes of what he speaks. Further parliamentary inquiry, Mr. Speaker? One more. Isn't it true that as a young 21 year old male living in commerce, Georgia that would go back in the 80s to our Georgia Public Safety Training Center, which is one of the premier training centers in the nation, was an investment by our state, would have saved me a lot of time from having to drive those two and a half hours down to precise Georgia. And I could have driven to Atlanta as a 21 year old to get this premier training at this new center. Isn't that not true? That's very true. You're not 21 again. That's a good thing about that. Thank goodness. Let's see. Let's hear for what purpose is the lady from the coast representative and Alan Westbrook rise? Parliamentary inquiry, Mr. Speaker. State January. Mr. Speaker, isn't it true that many of us in this body represent districts that are far, far from the affected area that is the subject matter of this resolution? Isn't it further true that it is really not appropriate for us as a body? Many of us who are not concerned with this to be weighing in on this matter of local concern? I'm sure the lady believes of what she speaks. You know, public safety is a concern for all of us no matter where you live. Let's hear from the minority leader for what purpose is representing Beverly Rise. Parliamentary inquiry. State inquiry, Mr. Leader. Isn't that true that not one democratic member in this house is ever called for the defunding of the police, never have, never will, and into the future, never, ever, ever will we ever ask for anyone to defund the police? Is that not true, Mr. Speaker? Mr. Leader, I know, I'm sure you know the history of each and every member of the democratic caucus and the members of this house. So I know the gentleman knows of what he speaks. What purpose has been up there for a moment? Does Representative Gamble, one of the Governor's floor leaders, Rise? Parliamentary inquiry. State your inquiry, sir. Is it not true that the company that was referenced earlier had 13 mixers blown up and those mixers represent drivers who are now currently unable to work and a company that was self-insured that has no one showing up to bring them an insurance claim check for those mixers here at the end of the year? I hope you're wrong, but I'm sure the gentleman knows of what he speaks. Let's see, we will have a couple more of some folks who don't get a chance to speak very often. One that I respect for what purpose does Representative Vance rise? Parliamentary inquiry. State your inquiry, sir. Mr. Speaker, is it not true that I've been a law man for just shy of 50 years? And that I was the head of the Peace Officer Standards and Training Council for 13 years and furthermore, is it not true that the Atlanta Public Safety Training Center would not only benefit 21st century training, criminal justice technology and professionalism for the Atlanta Police Department, fire any MS personnel, but would also genuinely benefit the region, the state, and the southeast and citizens of the world that visit our capital city daily? Is that not true? Representative Vance, I don't know of anyone in this room, any more qualified to comment on this and training than yours, sir. Thank you and I'm sure you know of what you speak. Take a couple more and then we're going to close this down. We have it heard from Representative Holly today, so what purpose is Representative Holly rise? Thank you, Mr. Speaker. Mr. Speaker, probably meant to be angry. State Gen. Mr. Speaker, is it not true that as a former criminal warrant officer of the largest county courthouse, only two blocks away from here, written tens and thousands of criminal arrests warns, and also true of being, I'm probably one of the few people here who's actually led a class of first-rate officers at the Atlanta Police Training Academy. Mr. Speaker, isn't it also true that the American Civil Liberties Union stated that, quote, Georgia officials have repeatedly chosen to escalate charges beyond any legitimate need? I'm sure the gentleman agrees with some folks he speaks about. Thank you for your question. You see, someone who's interested in part of this discussion has been in a way of life is Chairman Sains, what purpose do you rise? Parliamentary inquiry, Mr. Speaker. State your inquiry, Mr. Chairman. Isn't not true that I'm an unproud member of my truck got broken into during session caucus along with about 15 other members of this body so that it feels this, the public safety needs of this region feel pretty local to me. I'm sure the gentleman knows what he speaks. I don't know how many windows he lost, but we'll see who has the most windows damage, and we'll let them be the chair of that caucus, I guess would be the way to do that. For what purpose does Representative Thomas rise? Parliamentary inquiry, Mr. Speaker. State your inquisitor. Isn't true that for our neighborhoods to succeed, they need to have a safe environment to live in, and they need to have access to quality education. Gentlemen, what do you speak? Is there a legal report? Yes, let's hear it. Further, isn't that true that this resolution supports our dedication to safe communities across our state, regardless if it's in Atlanta or Savannah or Cherokee County or wherever else? I'm sure that gentleman believes in the points he made. Thank you, Mr. Speaker. We're going to take two more. We've had a good robust discussion here, very passionate, very fact-filled. So we're going to take one from Representative Bernal. Representative Bernal, what purpose do you rise? Parliamentary inquiry. State your inquiry. Is it not true, Mr. Speaker, that I am the daughter of a Detroit police officer who was a Marine and he's buried in Arlington, Cemetery? Is that not true? I'm sure the lady would only speak the truth about it, such a subject as that. Thank you for your father's service. We'll take this last and we've heard from this lady, but I want to hear from her again for what purpose does Representative Daniel rise? Parliamentary inquiry, Mr. Speaker. State your inquiry, please. Is it not true that we take an oath in this chamber? I'm looking at it now and it says that we hereby solemnly swear to affirm that we will support the Constitution of the state and of the United States and on all questions and measures which may come before me. I will conduct myself as well and my judgment be most conducive to the interest and prosperity of the state. Would it be fair to say today by walking out of this chamber and not voting on a measure that has come before us is the dereliction of our oath we take? Thank you to the lady for your point. We've made that point for House rules and I'm sure each and every member will vote their conscience and their district. Have all members voted, all members voted, if so, Mr. Clerk, will you lock the machine? On the adoption of the resolution, the yeas are 144, the nays 5, the resolution SR60X, we can receive the requisite constitutional majority is therefore passed. That concludes our rules calendar for today. We'll move on to afternoon orders in the morning, my favorite time. We will recognize Representative Bernal, Representative Bernal, you'll come up for your afternoon order. Give the member in the way or your attention please. Representative Cannon will be joined representing Bernal and some other friends. Good morning. Hold one sec, let's get your friends up there with you to always strengthen your presentation when friends are involved. Come on, Representative Davis. Are you going to represent Roed? We know, no, he's not going. All right, here's the pass or buy. Thank you, Mr. Speaker. I rise today to congratulate two of our representatives, Representative Deborah Bayesmore and Shelley Hutchinson, who will graduate from the Council State Government, Henry Toe Fellowship Program, and tomorrow in Raleigh, North Carolina. The Toe Fellowship is named for the Council of State Government, Founder, Henry Toe. Is one of the nation's premier leadership development programs for state government officials. Would Representative Bayesmore and Hutchinson please stand so we can congratulate you? Let's give them a big hand. Thank you, Representative Hesmore, your dedication. Thank you, Mr. Speaker, I yield the well. Thank you, Representative Bernal for making sure we're aware of that. Representative Scofield, oh, this is a good one. You're recognized for it. Yes, you are. Yes, I am. Representative Scofield, you have to let your attention. She's got something special to tell us about. Yes, get it afternoon. Thank you, Mr. Speaker, and get afternoon colleagues. Listen, this is the first time because we're never in session in December, so I am honored. At this time, about 33 years ago, I was giving birth to the pride and joy of my life, Kyler. And she's watching today, but not only is she a great person, she represents this state really well. So I want it to, on behalf of my family, myself, know that everything I do, I'm a great legislator, I'm a great public servant. I am a great daughter, cousin, friend of a colleague, but the best thing that I love the most is being the mother of Kyler, my daughter Kyler. So happy birthday Kyler, and also my mother's birthday will be celebrated Friday and she will be 85 years old. So happy birthday, mom, as well. Thank you, Mr. Speaker. I thank you. The word here is great. Great. So congratulations and happy birthday to you, to Kyler, Kyler and your mother. Chairman Meetz. Yeah, you're still here. All right, you need to pay attention to this when we have a description of what you've received or about to receive. You received it already. Pretty sweet stuff. Let's hear it. Chairman Meetz is recognized. Well, thank you, Mr. Speaker. Ladies and gentlemen on your desk, you'll find a bottle of Robert's Honey Bee Honey from District 178 in Wayne County. Wildflower is the actual flavor of it. I've already had a couple of folks come up today and say, hey, there's some of the best honey I've had. Now, a couple of facts about honey bees that you may or may not know. I know the speaker is very aware of some of these facts. Of the 20,000 species of honey or bees only four actually make honey. Georgia is one of the top three states for producing honey bees and the queen bee. Bee would travel over 55,000 miles to make one pound of honey at a whopping 15 miles an hour and must visit two million flowers in order to make that one pound of honey. We depend on these pollinators to pollinate many of the fruits and vegetables and other agriculture products that we grow in our state. And Mr. Speaker, as I'm sure that you were aware, only honey bees work at night. Thank you, Mr. Speaker. Hope that you enjoy the honey and Merry Christmas. Honey bees working, dying. Is that what you said? When did they sleep? Never sleep. Kind of like a member of the house always working. Very little rest. Thanks for the honey. Represent his steths and this year's, she has an afternoon or the lady's right. Thank you, Mr. Speaker and ladies and gentlemen of the house. Do you know what today is? Today is a very special day here in the state of Georgia. Why? Because it is the birthday of Miss Lula Mae Riley, 94 years young from Butler, Georgia. My mother passed away in 2015 and Miss Lula Mae became like a second mother to me and Miss Lula Mae Riley gave birth to 16 children. Yes. She's the first black woman to run for city council in the city of Butler and she is a member of the Biddle Land Baptist Church in Butler, Georgia where Reverend Alvin turned the serving as her pastor and she's a part of the senior choir and she's known for singing several of her favorite songs around Taylor County and one being Don't Let The Delver Ride. And so we just want to ask if you would stand with me and just recognize Miss Lula Mae Riley, her children are back home watching here in Atlanta area and we just want to let Miss Lula Mae Riley know that the Georgia House of Representatives salute her on her birthday. And if I knew how to sing, I would sing a little happy birthday to you. But I don't know how to sing, but happy birthday. Thank you, Mr. Speaker. You got to work on that singing a little bit. I can tell you that. Happy birthday, Miss Lula Mae. You did a good job raising this young woman. So unusually we have a gentleman who wants to make a sweet comment. Unusual coming from you, Representative Donald, who would go ahead. Is it true I'm a beekeeper? Is it trying now? Is it not true I'm a beekeeper? And the Agriculture Department and Farm Bureau gave us a bee tie about three years ago. Four years ago I had the privilege of passing the tag called the bee tag. We have raised $190,000 to go into education for our school systems, for our prison systems. And I just wanted to make that comment and Chairman Meeks again, thank you for the honey. We gave honey out throughout the state from all of your suppliers that year too. So again, thank you very much. Thank you for that information, Representative Donald. That's some special that we know the good work this house has done over the years. So thanks for that and appreciate the honey. That concludes our afternoon orders. Mr. Clerk, will you read the caption to a group of privileged resolutions? Organizing, commending, Marcy Flue Allen on her outstanding public service and for other purposes that completes the reading the privilege resolution. Is there any objection to adopting the privileged resolutions? Chair, here's none of the resolutions are adopted. We'll move on to announcements. Let's see, 24 hours later, I think Chairman Workhouse was probably ready to go. Chairman Workhouse, Mr. Speaker, today your house industry and labor will be meeting at 2 o'clock in room 406, one level down from our normal room, 2 o'clock 406, thank you. Chairman Hatchett, recognize for, I'm announcement. Thank you, Mr. Speaker. Colleagues, the House Appropriations Committee will begin joint hearings now at 1.30 with our Senate colleagues, and room 341 at 1.30 will be hearing from all of the constitutional officers and their requests for amended 24 budget and FY25 budget. So we're trying to get a little bit ahead of the game. Hope to see you there if you're a member of appropriations or if you're not a member of appropriations. You don't have anything else to do this afternoon, come join us. Mr. Chairman, where are you going, where are we meet? 341, 341. 341, and what time? 1.30. You don't want me to know? I guess, thanks a lot. Chairman Collins is recognized for an announcement. Thank you, Mr. Speaker. The House Public Safety and Homeland Security Committee will be meeting at 1 o'clock in 406 CLOB. We're going to hear from some folks from the Department of Public Safety and GBI. So if you'd like to come here by what they're doing for us and some of the good things that they've been doing, since we adjourned, please come 406 CLOB at 1 o'clock. Thank you. Thank you, Mr. Chairman. Chairman, Chairman, Pro Tem of this House, Representative Jones has an announcement. Thank you, Mr. Chairman. I just want to remind everyone, reapportionment will be meeting at 1 o'clock in 506. 1 o'clock at 506. Reapportionment 1 o'clock, 506. Representative Martin has an announcement. You're recognized. Thank you, Mr. Speaker. The House High-Ed committee will meet 10 minutes after we adjourn or we leave the floor in 606 CLOB. Thank you, Mr. Chairman. Chairman Williamson. Recognize for an announcement. Thank you, Mr. Chairman and Mr. Speaker. There will be a majority caucus breakfast available at 7.45 a.m. in the morning and room 403. The majority caucus breakfast tomorrow morning at 7.45. 7.45. Let's see the dean of the Chatham County delegation of gentlemen and he's pretty well dressed. Gentlemen from the coast, Chairman Stevens. Thank you, Mr. Speaker. The joint committee of the Senate House Economic Development Tourism Committee will meet at 4.15 in the CLOB at 1 o'clock. I'm ported committee. What time was that, Mr. Chairman? 1 o'clock. Chairman Sains, recognize for an announcement. Afternoon, Mr. Speaker. The subcommittee on economic development and tourism will be meeting at 1 o'clock in 406. That concludes our announcements. Majority to this House has recognized for a motion. Thank you, Mr. Speaker. I move that this House stand in recess until 6 o'clock p.m. then stand adjourned until 9 a.m. on Thursday, December 6th. Okay, on the motion of Majority Leader of this House, Majority Leader of this House, his motion is that this House will stand in recess until 6 p.m. today and then be adjourned. And we will come back in a session at 9 a.m. on Thursday, December 7th, 2023. All those in favor of the Majority Leader's motion will say aye. Opposed, no. Oh, that's clear. The eyes have it. We'll stand in recess. Thank you.",
  "updated_at": "2026-02-13T22:09:00.343651+00:00"
}