{
  "video_id": "2zzbMGg4U0E",
  "url": "https://www.youtube.com/watch?v=2zzbMGg4U0E",
  "title": "Georgia's Youngest Lawmaker; HOA Reform and Homestead Taxes | Lawmakers 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a summary of the key points from the Georgia legislature floor session transcript:\n\n**Overview**:\nThe session featured discussions with two freshman state representatives - Akbar Ali, the youngest member of the legislature at 21 years old, and Bill Finchure, who has a background in law enforcement and the legal system. They discussed their legislative priorities and plans for the current session.\n\n**Key Actions**:\nNo specific bills were mentioned as being passed or referred.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Rep. Ali discussed his efforts to increase language access services for non-English speaking constituents, including bringing translators with him to meet with local businesses.\n- Rep. Ali plans to introduce a bill to protect teachers' lunch periods as planning time.\n- Rep. Finchure discussed plans for insurance premium reform, including tying tort reform to lower rates.\n- Rep. Ali expressed interest in reforming homeowners associations (HOAs) to address overreach and lack of oversight.\n\n**Votes**:\nNo recorded votes were mentioned.\n\n**Attendance**:\nNo specific quorum notes were provided.\n\n**Adjournment**:\nThe session adjourned, with the next session date not specified.",
  "transcript": "From the Gwynet County area is\nDemocratic Representative Akbar Ali. His\nHouse committee assignments are creative\narts and entertainment, economic\ndevelopment and tourism and urban\naffairs. And from Canton is\nRepresentative Republican Representative\nBill Finchure. His committees are\nJudiciary Juvenile, Judiciary Non-Ivil,\nand Transportation. Welcome to lawmakers\nto both of you. I'm going to start with\nyou because you're the youngest member\nof the legislature this year at 20 years\n21 years old now, but later this week\nyou will be having a birthday, huh?\n>> That is true.\n>> Tell us about that. How's it feel to\ncome in young and and what's that like?\n>> Well, firstly, thank you for so much for\nhaving me here. Uh people have been very\nwarm, very welcoming. Uh I'm very\ngrateful to have a lot of uh existing\nmentors within the legislature that have\nuh extended that welcome, provide a lot\nof guidance. Uh but as one of the\narticles on me said before, uh this\nisn't my first rodeo. Uh I used to work\nin the Senate once upon a time and um\njust done a lot of work within the\ncommunity as of late and even\nbeforehand.\n>> You worked in the Senate at doing what?\n>> So I worked under now minority whip Kim\nJackson's office. Yeah. Back when she\nwas state senator. So, it kind of feels\nlike coming back a little bit\n>> almost.\n>> Not daunting to you at all, huh?\n>> Well, you flatter me. Thank you.\n>> I love that. Anything else you want to\ntell us about yourself?\n>> Well, I I wear many hats. I'm a small\nbusiness owner, KSU graduate. Uh, but\nfirst and foremost, I am a brother. I'm\na son, and I'm your neighbor.\n>> Yeah.\n>> Yeah.\n>> And a graphic designer, too.\n>> That's right.\n>> I've seen I've seen your websites. Looks\ngood. Thank you.\n>> All right. Representative Finchure,\nlet's tell tell people a little bit\nabout you. you've been in law and in law\nenforcement, so you've got the legal\nbackground and so tell us a little bit\nmore about yourself.\n>> Well, I started out as a probation\nparole officer when I came out of\ncollege at Mercer University and then I\nwent to law school at night. When I\ngraduated from law school, I went\ndirectly into the FBI. I was stationed\nin Chicago, Illinois. I worked there\nuntil my father passed away and I came\nback home and worked as an assistant\ndistrict attorney. I started off in\nAtlanta with Lewis R. Sllayton and I\nworked for Paul Howard if you can\nremember those people.\n>> Absolutely.\n>> And then I moved up to the Appalachian\nCircuit and I finished my career there\n23 years on top of 10 years and uh then\nI retired for a little while and then I\nwas called back into service and here I\nam.\n>> That's uh why did you want to come and\nwhy did you want to serve? Well, part of\nit is my respect for Mandy Ballinger who\npassed away and that's the reason I was\nable to fulfill this.\n>> And you're in her slot. Yeah,\n>> that's correct.\n>> Her husband and I talked a little bit\nabout this and he thought I might be a\ngood candidate for this. I began to talk\nto people in my community and they\nagreed. So, here we are.\n>> Oh, we're glad you're here. We'll get to\nyou a little bit more. I want to talk\nwith you, Representative Ali. one of\nyour staffers speaks Spanish to help\nserve your constituents. I guess that's\na big deal for you. You also want to\nincrease access to language services for\nnon-English speech speakers.\n>> Talk about that a little bit.\n>> Of course. So, it goes back to the first\nday of my campaign and even before then\nwhere I visit every single uh minority\nowned business and small business within\nmy district. A lot of them are ethnic. A\nlot of them don't speak English as their\nfirst language. And so every time I\nvisit, which is routinely every month, I\nbring with me two translators. Yeah. One\nin Spanish and one in Korean uh to go to\nevery single uh business to both have a\ntwo-way conversation here as to what\nservices can I provide them and what do\nthey want in return?\n>> Yeah. What else would you like to see\naccomplished this during this session?\n>> So, a lot of talk about uh public\nschools and maintaining the amazing\npublic schools that we have in Gwynet\nCounty. people move to Gwynette for our\npublic schools and I want to keep it\nthat way. I want to keep our gold\nstandard that we have by updating our\nQBE formula, uh, paying teachers what\nthey're worth, but also having minimum\nprotected planning time for those\nteachers, which will eventually be my\nfirst bill coming up later this week.\n>> Ah, can you tell us more about that?\n>> Absolutely. So, uh, one of the previous\nsessions, uh, planning time for teachers\nbecame a protected measure, meaning that\nit can't be turned into a meeting time\nby administration or various other\nthings. However, their lunch periods\naren't protected. Often times, those\nlunch periods become a working period, a\nworking lunch, which I don't think\nshould be the case when we already have\nso much on their plate. And furthermore,\nit helps instruction time, especially\nwith special education teachers.\n>> Okay. Well, we'll hear we'll you'll come\nback and tell us about that. Take that\none in. Representative Fincher, um\nyou're also interested in things dealing\nwith insurance premiums and all all the\ndifferent insurance premiums, medical,\ncar, home. You'd like to see some reform\nthere. Talk about it.\n>> Well, you know, we we passed a tort\nreform bill and that is designed to\nlimit uh the huge\nverdicts that you get to these millions\nand millions and millions of dollars.\nBut that should be tied in directly to\ninsurance rates. If you can limit what's\ngoing to the exposure of the insurance\ncompanies, then the insurance companies\nshould avoid the citizens with lower\ninsurance rates.\n>> Okay. So, you're going to have something\ncoming out with that.\n>> I think we're going to have uh an entire\npackage. Um the House of Representatives\ntomorrow afternoon\nupon adjournment you're going to hear a\nuh Speaker John Burns is going to roll\nout plans to address property tax burden\nfaced by Jordans Georgians. We look\nforward to I look forward to advocating\nfor my constituents and all Georgians as\nwe fight to keep more of their\nhard-earned dollars in people's pockets.\n>> Okay. So we'll we'll keep up with that\ncertainly if Speaker Burns is going to\ntalk about it tomorrow, too. Uh let's\ntalk uh Representative Ali um about\nhomeowners associations. I know that's\nan area that you care about. First of\nall, why the interest and what do you\nhope to accomplish there?\n>> So, we've seen many instances, not just\nin Georgia, but also just throughout\nthis nation of overreach by homeowners\nassociations. However, one instance that\nI would like to highlight is last year\num a former representative covered this\nwhere uh a a constituent of his nearly\ntook her own life because the amount of\ndebt that she incurred due to HOA fines.\nI think that that is one extreme case.\nbut going door todo in my district,\ngoing door to door in other people's\nareas as well. It's a repeated need that\nwe hear that overreach is rampant, that\nthere's not enough guard rails here.\nThat's why uh I'm working with several\nof my colleagues who've been fighting\nthis fight for a while now um on the\nSenate and the House side to put in some\nlimited some uh guardrails here to put\nin some uh common sense regulations here\nsuch as getting them to register with\nthe Secretary of State's office just as\na business would or having an\nindependent oversight committee. Uh\nthat's a bipartisan bill in the Senate\nright now.\n>> Yeah. So there this has been talk for a\nwhile. Absolutely. You feel pretty\nconfident that now that you're here,\nwe'll get some of that accomplished.\n>> Well, you flatter me with that, but a\nlot of the credit goes to uh the giants\nthat I stand on the shoulders of.\n>> Yeah, that means a lot to you. Talk\nabout that. Your the the people who kind\nof help prepare you to get come to this\nto feel confident at 21 years old to\ncome into the Georgia legislature.\n>> Oh, sure. Um, it is widely known that uh\nmy predecessor, Representative Shelley\nHutchinson, chose to endorse me in this\nrace and I have worked with her for a a\nwide amount of time, but even before\nthis, a lot of the connections that I\nmade was by serving as uh my local party\nvice chair and even before that within\nthe Young Dems. uh a lot of this it's\nall relationship building and we need uh\nI I see a lot of intergenerational\nconflict going on right now but I think\nwe need to remember that you need to\nbuild up the younger generation with the\nwisdom of the older one it's a symbiotic\nrelationship that's what I try and\nembody here\n>> yeah I think you'll do very well here\n>> oh thank you so much\n>> with that kind of an attitude about it\nyou mentioned property you we talked\nabout property taxes a little bit\nanything more you want to add with that\nor anything else you'd like to get into\nthis session.\n>> It's just what what has been happening\nwith property and it's something the\nsenator said before. Uh when you buy\nproperty at $250 or $275,000 and then it\nturns around and it's an appraised now\nfor 600,000, you're basically having to\npay or rent your house from the from\nyour county by paying taxes. And our\ngoal is to either put a cap or\ncompletely eliminate home homestead\ntaxes on homestead on the personal\nhomestead. We want the you'll hear from\nSpeaker Burns tomorrow how he intends to\ndo that.\n>> Okay. How's it been going so far for\nyou?\n>> And you know in terms of learning\neverything, keeping up with things. One\nof the lawmakers earlier said 19 hours a\nday. Is it does it feel like a lot?\nWell, I I choose to come in at 6:30 in\nthe morning and I choose to leave at\n6:30 p.m. Okay.\n>> Um and so it is completely because um\nI'm here to work for the people that\nchose for me to be here on their behalf.\n>> And furthermore, I mean, we hit the\nground running. We are already have uh\nthree resolutions that we're working on.\nWe already have three bills that are\nbeing drafted. One of which we're\nactively working on as I mentioned with\nthe protected planning time.\n>> Okay.\n>> Yeah. And so\n>> we'll keep up with that. You feel the\nsame way. You feel like you've been\nyou're getting used to everything. Yeah.\n>> Enjoying it, but it's a lot to take it\nup at one time. You have a lot to lot to\nlearn.\n>> Yeah. Are you putting in the long days,\nthat kind of thing?\n>> We we we're there. We leave are there at\n7 in the morning and we try to stay as\nlate as we can.\n>> I think people don't realize how much\nyou guys have to work during the\nsession. What What is the most difficult\npart for you? The most difficult part\nchallenging\n>> most challenging thing for me is is to\nlearn all the names of all those people\nin our in the House of Representatives.\nWe've got a crowd of folk there.\n>> Yeah. Yeah. What about you?\n>> Challenge.\n>> It would be it would just be uh for more\nof the same.\n>> Again, with the Senate, maybe it's a\nlittle bit easier because there's 56.\nWith us, it's a whole three classrooms\nworth of 180 people.\n>> You didn't have a class at KSU quite\nthat big, did you?\n>> I don't believe so. No. So, it there's a\nlot to it. So, but you're you seem to\nboth be enjoying it and uh we're happy\nyou're here. Anything else you want to\nadd?\n>> Uh just that another thing that's on our\nplate is going to is literacy.\n>> Yeah.\n>> Um we're going to be one in three\nchildren in Georgia do not have\nproficiency by the third grade.\nAnd we're going to put a literacy coach\nin every single elementary school in\nGeorgia.\n>> Okay.\n>> Well, we're going to talk about that.\nBut I know that's something the speaker\nwants to do.",
  "updated_at": "2026-02-14T14:42:55.80705+00:00"
}