{
  "video_id": "32y8MtCKIgI",
  "url": "https://www.youtube.com/watch?v=32y8MtCKIgI",
  "title": "1/22/2024 Senate Committee on Judiciary",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 135,
  "summary": "Overview:\nThe Georgia Senate Committee on Judiciary held a hearing on January 22, 2024 to consider House Bill 30, which codifies a definition of anti-Semitism based on the International Holocaust Remembrance Alliance (IHRA) definition. The session featured extensive debate and public testimony on the merits of the bill.\n\nKey Actions:\n**HB 30**: Bill to codify the IHRA definition of anti-Semitism in Georgia law.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The committee chairman, Senator Strickland, set clear ground rules for public testimony, emphasizing respect and preventing intimidation.\n- Senator Kennedy presented the bill, highlighting the need for a clear definition to address the rise in anti-Semitic incidents in Georgia.\n- Senator Kennedy noted that the bill has the support of 90-95% of Jewish groups, while some opposing groups are considered anti-Semitic hate groups.\n- Extensive public testimony was heard both in favor and against the bill.\n\nVotes:\nNo recorded votes were taken.\n\nAttendance:\nThe committee maintained a quorum throughout the session.\n\nAdjournment:\nThe committee hearing adjourned. No next session date was provided.",
  "transcript": "you Good afternoon. Welcome to the Senate just sharing committee. We're starting off with a slow, easy committee hearing for our first one of the 24 session. Thank you so much for joining us. I'm going to ask Senator Watson since you kept me in a intense health committee today. Before we had this district committee, I asked you to start off with the word of prayer. What's your mic number? 13. Let's go to prayer. Dear Lord, thank you for letting us come together and have a true and honest discussion. I continue to look over us and our travels and bless us as we have discernment and follow your judgment. And please bless us just in general and Christ name my name. Amen. Thank you for that. Since it is our first hearing of a new year, I'll take a second introduce our staff. And if we could please quiet down the talking in the room. I'll give that speech a second. Let's start by introducing our staff. They did a lot of work and we started off with hearing that as of lunch, they had 4000 emails today about this hearing plus a little bit of written material. And a lot of interest what we're doing is their first one managing committee hearing for us. But Hannah Holcomb, the minister of assistant that manages our office, Justin Lancaster, where it's Justin. He is our legal aid this session at two well at Georgia State Law. Christian Dent, Christian stand up and in turn for us this year from the great county of Henry. I'm joined us this session from the office of policy and legislative analysis or analyst this year's Patrick Love on the end. And last but not least, he always likes to weigh in every single bill Michael Walker, legislative council with us. And I think that Ben Huntington is also going to be helping out this year as well. So that's our team. I won't have our committee members all introduce themselves like the first day of school. But we all work together to make sure that we make this process as smooth as we can make it. Now getting to that point, we have a lot of people here today. A lot of people lined up to speak for and against the bills and the agenda. We have an overflow room as well. And so I asked that as far as ground rules that we have, it's very, very simple. If you'll be respectful of everybody else in the room that's going to speak and it's sitting next to you. If you have a sign, if you have a phone, whatever you have, use common sense. Obviously you can have that. You can record if you want to record something. You can take pictures. You want to take pictures. You can have a sign if you want to have a sign. But do not do that to intimidate somebody else in the room where you'll be asked to leave. Do not do any of that to intimidate any other representatives or senators in this committee you'll be asked to leave. This is all about respect for each other. We have a very open process. That's what makes us different from other places in the world. And so we want to hear from you. We want to hear your thoughts on things. And a lot of folks have already weighed in with the thousands of emails. They're written testimony as well. We want to hear from you. But we will not do that if you're not going to respect other people who also want to speak. And so those are our very simple ground rules that we have today. I'm going to start by having, obviously I guess we'll start with your bill with House Bill 30. But before I do that, just to know how this will work, we have sign up sheets. I have one in front of me here. We did four in against each of these bills. And what we're going to do is we're going to have time blocks versus me limiting how long you will talk. We'll do 30 minutes for the bill for public testimony, 30 minutes against the bill for public testimony. And what I will do is we will have a clock that will run and we'll start it every time someone's up here speaking. We'll stop it when you're done speaking. I'll also try to call upon the next two people that will be speaking after the person up here, mainly because some people are in the overflow room or outside somewhere. I'll ask you to walk over and get in line if you're in the other room to be let in by the doorkeepers. So we can keep things flowing. If you're not good with those ground rules, please let me know now. Otherwise, that's what we're going to go with today. All right, we'll start with House Bill 30. This is at least a second. I can't remember if we had two hearings last year or not. Second hearing on this, the bill we consider last year in committee. We come back this year with the substitute. And so there are some changes to last year's bill. But because it's been a year, I will still ask you to represent Carson. If you want to present the bill that we have in front of us. And then I'll turn it over once you're done. Also, we haven't let you answer questions as well. Turn it over to Senator Kennedy, who's going to be presenting the substitute today as well. So with that, the floor is yours. Thank you, Chairman Strickland. And I just want to say thank you to all the senators on this committee and the Senate as a whole. I know that we've been talking about this issue a lot. And this is the third year that this has been brought before this general assembly. And so this is an important issue. It may not affect you personally, but it affects Georgia. And we've seen a number of things in the news locally. Nationally, internationally. And I just, regardless of how you vote, I just want to say thank you for spending time on this. It's a very important issue in our current events. House Bill 30, what this does is codifies a definition of anti-Semitism and supporting examples per the Holocaust Remembrance Alliance definition. All this bill does is ensure that when analyzing the intent behind illegal discriminatory actions that target Jewish people, whether or not, whether it involves a hate crime or other illegal discriminatory actions, such as hiring and firing and lending decisions and housing. And there is an allegation that the action was motivated by anti-Jewish sentiment. Then the relevant authorities consider this definition the world's most accepted definition of anti-Semitism. That's all it does. It provides a definition. You will see in the, I believe we're going to get to a language of the sub. And that sub that has been worked on, I would say extensively, is a good word there. You'll see that this does not impact free speech whatsoever. You can see that in lines 29 through 34 of the sub. Why is this bill necessary? Anti-Semitic incidents in Georgia have increased dramatically. Jewish identity itself is, I would say, complex, multifaceted. It's not like other races or identities where you can look at a color, someone's skin, or where they're from, or what have you. If you're Jewish, it incorporates aspects of religion, race, culture, national origin, and ethnicity. So there's so many different things that are multifaceted within the Jewish community who have come to know, as you can imagine, the past few years. And without a standard definition, it's easy for anti-Semites to hide behind this ambiguity, even when their anti-Semitic acts are subject to Georgia law. I want to point out a few other items, Mr. Chairman, I don't want to go exhaustively, because we have talked about this issue. There is a letter of support that looks like this. It should be Senator's in your packet. This is, HB30 is support in the IRA definition is supported by 90, 95% of the Jewish groups that are out there in our state and in our country. I'll also point out to you that there are a number of people that speak against this. One of those groups, the founder and executive director, said that October 7th made him happy. Another group that you might hear from today is actually listed as an anti-Semitic hate group per the anti-defamation league. I want to implore upon you that those groups that say they speak for the Jewish faith that are against this don't represent the Jewish faith anymore than Westboro Baptist Church represents you and I, if you and I are Christian or evangelical. This is widely, widely supported by our friends in the Jewish community, and I will not stop fighting for them. As with that, I know there's going to be a lot of testimony, Mr. Chairman. So in the interest of time, I'm happy to answer a question or your pleasure, committee. Any questions for the author of the bill? All right, this time, Mr. Pro Tem, I'll call upon you if you want to present the substitute that we have. You might 12. 11. Thank you, Mr. Chairman, for giving this bill and the substitute a chance to be heard today. I want to thank Representative Carson, thank you for the work that you have done and Representative Panich, the support that you've given this bill, that really brings us to the point of where we are here today. This bill received a hearing last year, but it was late in the session and because of some concerns that were raised, I wanted to make sure that it was given due consideration because of the very reasons that were identified of just how significant and how important this bill is. So what this committee has the opportunity to do today is to recommend passage of a meaningful and effective bill that provides a guide for the government as to what anti-Semitism looks like. And let me repeat that, meaningful and effective. When I say this bill is meaningful, I mean that it is meaningful to the Jewish community in this state, which has been subjected to ever increasing anti-Semitic harassment. And when I say this bill is effective, I mean that it is effective at requiring consideration of anti-Semitism when an agency of this state is carrying out its anti-discrimination duties. This bill does not, does not, up in laws that already prohibit discrimination, nor does it treat anti-Semitic forms of discrimination differently. What it does do, however, is send a message to bad actors that when they commit an already illegal act that discriminates against Jews in Georgia, we as a state provide law enforcement agencies with a resource that they can rely on to discern a type of discrimination that comes to the law. And that is a discrimination that comes in so many different forms. Now, as an attorney and as a legislator who has the privilege of serving on this committee, I understand defining amorphous concepts such as hate and discrimination can be an incredibly difficult task. Not only have legislators struggled with this, but even legendary jurists have thrown their hands up in frustration when trying to define what they see in front of them but can't easily describe it in legal ease. To borrow a phrase from Justice Potter Stewart, quote, I know it when I see it, close quote. The same goes for describing anti-Semitism. And I hope that each member of this committee knows anti-Semitism when they see it. I can tell you that Rabbi Behar from Macon who is with us today, who is the Rabbi at Temple Beth Israel, knows it, and unfortunately she has seen it. Her congregation at our local synagogue in Macon was subjected to an effigy being hung by a noose this past summer. She has been personally terrorized and members of her congregation have told me they are afraid to attend religious services. That fears the antithesis of what our state and our country is all about. To a credit, it's a credit to my community and communities across Georgia who came together to show strength in the face of such reckless and inexplicable hate as we saw this past summer. But you may say to yourself, this bill doesn't stop those terrible acts. Well, you're right. It doesn't. It doesn't stop people who come here holding such vile thoughts and designs like hanging, hanging, and effigy of a Jew outside of a synagogue. But it might, it just might deter their behavior and the conduct that could end up harming or harassing someone simply because they are Jewish. But just as this substitute bill does not change what is in someone's heart, it does not interfere, criminalize, or in any way make someone liable for their speech. It does not compel an automatic finding of discrimination when a set of facts meets the definition of anti-Semitism. It does not automatically penalize someone for criticizing Israel nor does it attempt to override our first amendment protections. Remember, every bill that this legislature passes is subject to the limits contained within the Bill of Rights. It is the whole purpose of the Bill of Rights and the amendments to our Constitution to limit the state's police power. So the IHRA definition, which Representative Carson alluded to, that is present in the House Bill as passed, is maintained in the substitute that I'm offering today. This committee had a lot of discussion last year about that definition. And personally, I have grown more comfortable and exceedingly comfortable with the interim, during the interim, with this definition and how it fits into our state law. There are 33 states that use this definition in some fashion, either codifying it for purposes of education or for the purpose of local functions, or as we are attempting to use it here today. As a guide to enforcing anti-discrimination laws that we already have on the books. The IHRA definition is an attempt at illustrating and defining anti-Semitism. The United States was represented through the State Department on the panel that actually developed the very definition that we're talking about and that which is contained in this legislation or proposed bill. And we should be confident that it is well vetted and not meant to undermine our U.S. Constitution. Now, if we can agree that the definition of anti-Semitism is in the bill that illustrates and defines anti-Semitism, the question that becomes, what do we do with that definition? Answering that question is at the heart of this proposed substitute. And it is a question that I have worked on with Representative Carson and Representative Panich and their team. I appreciate the good faith collaboration that our offices have enjoyed throughout this process over the last many months. And the engagement with the stakeholders that myself and my staff in the Pro Tems office have had the opportunity and the community leaders in interested parties across the state. If you recall, in the version that we reviewed last year, there was an ambiguity in the application of the bill. Thankfully, this committee shined a light on that interpretation of the operative language contained in that version which led to a lot of discussion and a clear intent to provide clarity. And that's what we're trying to do with this, is provide that clarity. This committee is mindful that anything that touches on Georgia's hate crime statute should be closely scrutinized given the past judicial rulings on vagueness. With that in mind, this substitute clearly sets out the government's duties and subparagraphs B and C seen it lines 23 through 28. Under paragraph B, any government agency that is already charged with enforcing some kind of anti-discrimination law is required to consider the IHRA Delta. The IHRA definition of anti-semitism. The practical effect of this is that an agency can rely on this IHRA definition to discern where the discrimination in the form of anti-semitism is present in the facts of the complaint about conduct. Secondly, you'll see in subparagraph C. It requires the state to consider the IHRA definition in determining whether a sentencing enhancement might be authorized. As you'll see it lines 27 of the substitute. There's a specific citation to the hate crime statute under our criminal procedure code which is Title 17. This is not an attempt to change the procedure for the hate crime statute nor does it result in a change to that procedure. It also doesn't compel a trial of fact which is either a judge or a jury to automatically find a defendant guilty. This substitute respects the judiciary's role in developing our laws and it respects the jury process. I want to thank several folks that have worked in my office, in particular James Banner, General Counsel from my office, who has seated behind me, who has done a lot of work over the past several months when it was decided collectively with many people from the Senate including the Lieutenant Governor's office. This was of such import that our office should carry this and work on this and it has been my honor to do that. There are numerous materials and letters and file materials in your file in support of this effort. What I provided for you is the substance differences in the substitute. Mr. Chairman, I'd be happy to take any questions or I'm happy to pass the mic back to Representative Carson and Panich if you'd like. Thank you. All right. Any questions for Senator Kennedy about the substitute and just so we're clear we're working off of LC 491587S. Is that what you have, Senator Kennedy? Yes, Mr. Chairman. Mr. Chairman, please. Mr. Chairman? I just want to say, again, thank you to the Pro-Temps in his team. I assure the the guests that are in this room, I assure you the Senator Kennedy and his team of gun have gone above and beyond on this and I want to thank you. Chairman Carson, do you support the substitute that's been presented? I think it's very favorable. I think this is not just something that a lot of time has gone into but it would be a very good. From the house side on our chamber, I can only speak for myself. I know I can speak for Esther. That's kind of a yes. She's waiting to see you're going to say next. If this is the version that is passed with no amendments, that's my question. I think my chamber will be very, very supportive. Okay. All right. Well, this time we will move to the public comment section of the committee. I do say I can't speak for house leadership and there are a number of us that have seen this and collaborated with the Pro Tem. Go check yourself on the amount of guy text. I wouldn't have said that. But from my standpoint and Esther, it would be we would thank the Senate and we would we would look very favorably on this version. All right. Thank you. All right. With public comment, I'm going to start with the against because it's the sheet in front of me. What I'm going to do is I'm going to name three names at a time. And I'm going to ask you if you are in this room, if you will stand in the on deck circle, if you're the second person or the third person. And if you're not in this room, if you'll come to the door, then a doorkeeper will let you in and let you get in the on deck circle. We're going to start a clock once the first person starts to testify. And if you want to slide to the side somewhere, just to give some space. And we will run the clock for 30 minutes against and we'll 30 minutes for. If you want to wave your time, give to somebody else, then just indicate that when I call your name. And I'll call the next person on the list. So we're going to start with Sarah Hunt Blackwell, Megan Gordon and Elise Cohen, are those three individuals in this room? All right. Are you Miss Blackwell? All right. What about Miss Megan Gordon? Is Megan Gordon in the room? All right. And what about is Elise Cohen? I think that's the name. Okay, you're here as well. I'll throw you all. And when you come up, the first two people who there are with, nobody else did. So if you will please, when you come up, have a seat and give us your name and tell us if you're with a particular organization, speaking on behalf of them, or if you're here on your own behalf. So we'll start with Miss Sarah Hunt Blackwell. Come on up here and have a seat. Good afternoon. Good afternoon. Excuse me. All right. The floor is yours. All right. Thank you. Good afternoon, Chairman and members of the committee. My name is Sarah Hunt Blackwell. I'm the first amendment policy advocate with the ACLU of Georgia. The ACLU of Georgia protects the civil rights and civil liberties of all Georgians. Excuse me. There is nothing more anti-democratic than silencing speech that's critical of government. And that's truly the crux of what this bill does. Before going any further, I'll first take time to acknowledge and appreciate this body's efforts to protect Jewish communities against targeted hate, especially as acts of anti-Semitism increase within the state and throughout the country. While the intention is laudable, sacrificing our first amendment rights is rarely ever an effective solution for issues of racism, including anti-Semitism. HP 30 essentially duplicates existing anti-discrimination and hate crime law in Georgia with the added effect of punishing people for the content of their speech. As unsettling as it may be, hate speech is protected under the first amendment. So codifying the IRA definition will not keep people from drawing swastikas or making disgusting statements about Jews. And voting against the IRA definition will not be a permission slip that allows offenders to skirt legal consequences. What codifying the IRA definition will do is chill protected speech and restrict political discourse. What we're talking about here is someone expressing their political position one day, then later having that expression increased civil penalties or the length of incarceration for later offenses. Our first amendment protections simply do not support this. Threatening to enhance legal punishment because someone criticizes a government is a textbook example of chilling speech. The government may not silence speech, it doesn't agree with, no matter how despicable that speech might be. The government may not over criminalize political expression no matter how polarizing a position might be. The first amendment guarantees our right to have our own beliefs and express them freely without fear that they will later be used to justify punitive punishment. But for no other reason than the first amendment of our Constitution, please vote no on HB 30. Thank you. Thank you. From here on, if any committee member has a question for a witness, please just push your button. Otherwise, I'll move on to the next witness. All right. Thank you. Thank you. Hot black wool. Megan Gordon. Good afternoon. Please forgive me. My printer decided it doesn't like me, you know, add an emergency. Thank you for your time. I'll try to be brief for the sake of everyone behind me. My name is Megan Gordon. I'm the policy manager at the Georgia chapter of the Council on American Islamic Relations. We at care Georgia don't have any inherent objection to the idea of codifying a definition of anti-Semitism, but we do have serious concerns with the codification of the IRA definition. Especially its examples because as written, the spill is so broad that as Sarah described, it impedes protected free speech. I understand that the spill is a two-part equation. You have discriminatory action plus speech equals legal trouble under HB 30. But there are some instances that the law creates that would lead to lawsuits based largely on speech. Larger in the areas where we're talking about civil non-schermination laws, one good example of this is housing discrimination. So let me just like dive into a hypothetical to illustrate one way this could easily play out housing. Let's say that I'm a small landlord and a Jewish person applies for one of my openings. The Metro Atlanta housing market for those of you lucky enough to not live in it is bonkers. So I have dozens of applicants. I don't pick this person. They don't know why, but they do see my Facebook posts where I am constantly calling Israel a racist state and saying all other terrible things about the state of Israel, which leads them to believe that I'm anti-Semitic, and that's the reason that I rejected their application to live in the home that I own. So they sue me for housing discrimination. Now maybe I'm able to go to court and win because I can demonstrate that I chose the person with the highest income. But maybe I chose someone for a less tangible issue. They reminded me of my dad. We got along great. Or maybe this one Jewish applicant I didn't like they shook me as litigious and it made me nervous. My best case scenario is I'm spending time, money, lots of stress, defending myself in court and have the reputational harm of being accused of anti-Semitic because of conduct that, like nothing really, if I'm merely based on my protected free speech. The best case scenario is I win, but I'm dragged into court based on my protected free speech. Criticizing a foreign government. We could see similar situations play out in employment discrimination claims as well because there are businesses that are critical of Israel too. I know that's less common than Israel, but it does still happen and businesses have free speech rights too. In conclusion, I want to share one final concern with this bill which is that it will have a chilling effect on free speech and I think that's going to be the largest impact. Because we can sit here in this room and discuss the legal structures and nuances of it all. But that's not how the average Georgian engages with law. Right? Y'all are mostly all, you're all really smart people and you're mostly lawyers. But for most Georgians, they're going to hear that their friends, brother-in-law's cousin sister got sued because of something they said criticizing the state of Israel and they're going to get sued and think that's illegal now. Is that the most accurate understanding? Maybe not. But that's how Georgians are going to perceive this law and because of that they're going to censor themselves and it's going to chill politically protected free speech about a foreign government. So in conclusion, I would say protecting people from anti-Semitism is a goal worthy of pursuing and I'm really glad that this bill is doing that. This legislation is simply not the way to accomplish it and so I ask y'all to vote no on HB30. Thank you. All right. Thank you, Ms. Gordon. While Ms. Cohen's coming up next is going to be after her Marissa Pyle, Sig, Giardana, and Yara, Mana, Sra. If those other three will please stay in the room or come to the door, you will be next and we have 23 minutes and 31 seconds door many. No pressure. No pressure, Ms. Cohen. Good afternoon. My name is Dr. Lee.\n\nI'm a Sephardic Jew from Atlanta, an anthropologist, Jewish and Middle East studies, educator, scholar, activist, and writer. I've seen some of you before. There is no need for a bill in Georgia law to define anti-Semitism, especially because there is no consensus by Jewish people in organizations to do so. And the controversial Ira definition cannot highlight that more. HB30 is not about addressing anti-Semitism, but weaponizing it. As Kenneth Stern lead drafter of the definition said to chill free speech specifically around criticism of Israel protecting Israel from accountability. The push to codify this non-legally binding working definition is one long list of ways that some in our Jewish community organizations have tried to stifle free speech related to Israel for decades. The extent some will go to silence conversation and critical speech on Israel is included in these personal examples. Boycotting and pressuring borders bookstore for hosting a Palestinian history professors lecture and exhibit on the Nakba, the Palestinian catastrophe and his family's history, calling it anti-Semitic. Pressuring educational institutions to cancel programs with Israeli and Palestinian and American activists and a rabbi, speaking about Palestinian home demolitions, land confiscation, Israeli settler violence, claiming they are anti-Semitic. Being dragged out of a synagogue and a headlock by security in front of my Jewish community here, recognizing me as an activist critical of Israeli policies. Pressure on the university where I was teaching not to renew my contract, though I was the only Jewish studies professor, calling me anti-Semitic and anti-Israel. These attempts to chill free speech and the acceptable violence is a direct result of some Jewish organizations wanting to shut down critical speech of Israel. We must talk about the 60 plus discriminatory laws that primarily affect the rights of Palestinian citizens as well as Israeli racist practices and policies that target Middle Eastern and African-Israeli Jews and non-Jewish asylum seekers. We must talk about Israeli leaders calling for full Palestinian expulsion, the destruction of Gaza, the case of genocide brought to the international court of justice against Israel, Israeli settler and state violence against Palestinians, massive Israeli protests against the Israeli government's dismantling of the judiciary. These are all facts and they have contexts. These things should ring in a alarm bell by which to rethink codifying a definition that uses examples that would limit or chill free speech about Israel or any other country. Each iteration and redefinition of anti-Semitism amps up the crackdown on free speech specifically when critical of Israel. What sticks with me here is in our capital. Representative Carson's words on the House floor, a sponsor of HB30, he got up on the floor and said, quote, there's a loud group of quote unquote Jews that are opposing this because they support Palestine. They do not support Israel and the Jewish people. Unquote. Why is the sponsor of the bill? Who says he supports a bill against anti-Semitism? Telling a primarily Christian legislature that we are not Jews questioning, that we do not care about the Jewish people, which is untrue, or questioning our Jewish identities or delegitimizing our lived experiences Jewish people. To then suggest that we do not care about our Jewish people is untrue, hurtful, and dangerous to us as Jewish people. He showed it his own words, the intent of the bill. The Georgia legislature should be deciding, the Georgia legislature should be deciding which Jewish should not be deciding which Jewish voices matter or which can be silenced. Not only is there no consensus on this controversial definition of anti-Semitism, but it exceptionalizes Jews and Israel as we heard earlier. There is an active network of Jews and civil rights organizations pointing out the concrete harms done by referencing and using the IRA definition. Sadly, some in favor of this bill, Christian and Jewish, are using the definition precisely to cause a chilling effect and to deter those who are critical of Israel, a fundamental right of free speech in our state and country. I urge you to vote no again on HB30 in all its forms. Thank you for your consideration. Thank you, Dr. Cohen. All right, next up, Marissa Pyle. Good afternoon. Good afternoon. My name is Marissa Pyle. I'm here in my personal and individual capacity as a Jewish Georgian, and I ask you not to pass HB30. This bill will not keep us safe. I am telling you as a Jewish person that HB30 does nothing to protect me. What it does do is weaponize attacks and hatred against my own community and to silence Palestinian and Muslim Georgians, making threats against me somehow more important than threats against my own neighbors and implying that my safety can only come at their expense. Making other people less safe does not help me. HB30 would have done nothing to prevent the bomb threat that my synagogue received when I was in high school when we had a Holocaust survivor speak, and it would have done nothing to prevent my family from being stalked by a violent neo-Nazi for three years. However, what it does do is tell me a Jewish person that I am somehow being hateful against myself when I and Jews like me speak out about a foreign government, the Israeli government. It gives me fewer rights to criticize a foreign government in my own under the guise of my own protection. It also legitimizes the barrage of genuinely anti-Semitic vitriol, vitriol that I and many other Jews have faced for being outspoken. One of the lead sponsors of this bill has compared me and others to Nazi collaborators for my opposition of this bill and said that I am myself a fake Jew. I have been called some of the worst things that a Jewish person can call a fellow Jewish person, words that I was raised to believe are morally reprehensible. I have been compared to workers at death camps and said that I am worse. How much clearer can we be that this is not for me or my community's safety? These are things that I would never dream of saying against a fellow Jewish person no matter our disagreements because they are things that genuinely put us in danger. They have spurred death threats against me and this bill ironically has already made me less safe. In closing, I want to state loudly that my safety as a Jewish Georgian comes when my neighbors are also safe. It comes when my Palestinian friends feel empowered to use their rights as equally as I use my own. It comes when Jews and Muslims are equally protected from white supremacists who target both of our communities. It does not and can never come from HB 30. Please vote against this bill. All right, thank you, Miss Powell. Next we have Sig Giordano. Good afternoon. Good afternoon. I'm speaking as a Jewish Georgia voter. I am named after my great-grandfather Sigmund who died in the Sushin House in concentration camp in 1942. My grandparents were the only surviving members of their families. They met the next year in Trasian's. A concentration camp in what was Nazi occupied Czechoslovakia. It should go without saying that understanding and fighting anti-Semitism is close to my heart. Without a doubt, anti-Semitism was the logic that allowed the Nazi Holocaust of Jewish people in Europe to happen. Even without formal legislation like we are discussing today, this is the reason that the claim of anti-Semitism has so much power. In the years after the end of World War II, public opinion changed and worldwide people agreed that what my family and millions of others suffered was unacceptable and could never happen again. So when someone calls someone or some act anti-Semitic, they are drawing on the horror of that time. What this means for me is that when someone claims something is anti-Semitic or calls someone an anti-Semite, they are using the literal murder and discrimination that my family experienced to shame someone else. Now, if this was about to happen again to Jewish people, if we were on the verge of another Holocaust against Jewish people, then it would be quite appropriate to sound the alarms. But this is not our reality. This is not the way it is being used. This bill is essentially putting into law a definition that has been interpreted by the very body that created it through their examples as mostly having to do with people who criticize Israel. Quite frankly, the misuse of anti-Semitism to shield a country from criticism and accountability is insulting and offensive to my family and to me. I and many of my family members are Jewish people who are anti-Sionists. Israel is not our homeland, and the Zionist project for us is illegitimate. We believe we have the right to speak out and share this point of view. There are millions who agree with us, Jewish and non-Jewish people alike. Our voices deserve to be heard. Anti-Sionism is not anti-Semitism. In fact, I believe that that more it's not a Shionist, Stein Schneider, who was the first person to ever define and use the term anti-Semitism in 1860 would agree strongly because he himself was anti-Sionist. There have always been anti-Sionist Jews. I ask you today to not allow those with the political goal to defend the country of Israel, to be little and abuse the memory of my ancestors who died from rampant anti-Semitism. Please vote no on HB30. All right, thank you. Yara Manastra, I may be saying your name wrong. Are you in the room? It's M-A-N-A-S-R-A-H. If they come to the door, I'll call upon them next. So the next three we have with 14 minutes left, Julia Falcon, Luma Yunik, in a SIM Javad, or is J-A-V-E-D, I apologize, I'm saying your name's incorrectly. So start with Julia, is it Falcon? Okay, come on up. Good afternoon. Good afternoon. The floor is yours. Thank you. Hi, my name is Julia Falcon, and I am a Jewish citizen of the state. I'm a voter, and I am here to speak out against the passing of HB30. By failing to distinguish between anti-Semitism and criticism of Israel, the Irish definition of anti-Semitism conflates Judaism with a pro-Israel ideology. Pro-Israel and Zionist ideology does not represent me, and not just a product of the current times. This definition did not represent the American council for Judaism, an organization founded by rabbis in the 1940s that loudly opposed Zionism, nor the rabbis that penned the anti-Sionist Pittsburgh platform in 1885. As long as Zionism has existed, there have been Jews in the United States that have vigorously opposed it, and it is for these reasons that I urge the committee to reject their ira definition of anti-Semitism. A core tenet of Judaism is to speak out against injustice, and so I choose to do so when I witness, for example, the decimation of universities and hospitals and the preventable murder of 10,000 children at the hands of the Israeli government. This does not make me a self-hating Jew, this makes me a human being, and this is not a choice, it is my duty to speak out. If raising my voice against atrocities is deemed anti-Jewish by law, then the state of Georgia is recognizing a version of Judaism that is unrecognizable and unconscionable to me, and where I am supposed to witness war crimes and do nothing less to my words be used against me in the future. This bill will not curtail anti-Semitism, in fact, it will actively harm the Jewish community in Georgia, and I urge you all to reject this bill. Thank you. All right, thank you. Next, Luma Unic. Good afternoon. Good afternoon. My name is Luma Unic, and I'm a senior at Georgia Tech. As an Anaki refugee coming from Saddam Hussein's repressive regime, I have always valued the freedoms inherent to the American ethos. I appreciate the right to free speech in a way that not many others can because I have lived in a world without it. It is with this context that I express my deep concern regarding House Bill 30. I have exercised my right to free speech as enshrined by the Bill of Rights to express my dissent towards the policies of the Israeli government and the US support thereof. It is crucial to clarify that my stance against the Israeli government is strictly political, and in no way reflects my any sentiments towards the Jewish community, many of whom I am privileged to be sharing the stage with today. As a family who has tenons, the notion that a decision to possibly decline a Jewish applicant for reasons outside of their ethnic or religious background could be construed as discriminatory, and that my vocal political stances could be leveraged against us in a legal context is profoundly distressing. The prospect that the very words I speak today might be turned into a tool for litigation against myself or my family members is antithetical to the values of free speech and justice. This scenario presents a disregard for my constitutionally protected rights, but also inaccurately conflates my criticism of Israel with anti-Semitism. Such a misrepresentation is not only false, but also harmful as it undermines the fundamental distinction between political discourse and ethnic and religious discrimination, one that poses a significant threat to the principles of not only free speech, but fair debate, essential to a democratic society. Honorable committee members, I implore you to reflect on the inconsistencies of this bill introduces, it is essential to recognize that the Israeli government does not embody the views of every Jewish individual in America as evidenced by those gathered here today. The question then arises, why should a political stance be granted precedence over the constitutional rights of American citizen? The notion of penalizing criticism of a foreign state while allowing unrestricted critique of our own government is contradictory, unprecedented, and alarming. I urge the committee to reconsider the implications of this bill on our democracy. Thank you. All right, thank you. Next we have Asim Javed, and then on deck, we'll have the next three with, let's write it 10 minutes remaining, Nadia Bay Zade, Kareem Ross-Handler, and Jill Winner. Next three. All right, good afternoon. Good afternoon. Good afternoon. Good afternoon, esteem members of the committee. My name is Asim Javed, and I'm a senior community organizer with George and Muslim voter project. A nonprofit org dedicated to empowering American Muslims in exercising their civic rights. Today I stand before you to express our opposition and deep concern with HP 30. We firmly believe that while addressing anti-semitism as crucial, this legislation raises concerns including the infringement of the first amendment rights of many, including the more than 70,000 plus registered Muslim voters in the state, and more than 170,000 Muslim community members here in Georgia. HP 30 uses the ira definition of anti-semitism and its examples with the aim of providing an understanding of anti-semitism to be used to indicate discriminatory intent. We assert that this definition has currently adopted. Stifles our first amendment rights by censoring any criticisms of Israel and any attempt to advocate for Palestinian liberation and self-determination. Furthermore, ira equates Jewishness and Judaism with Zionism and the state of Israel. Comparison, which is fundamentally untrue. This is indicated by the examples listed in the definition, a majority of which address criticisms of Israel and Zionism rather than discussing discriminatory attacks on Jewish people and on Judaism. As a result, HP 30 fails to adequately address the root causes of anti-semitism and will not offer the sufficient protection to the Jewish communities who are at the heart of this issue. If passed, will HP 30 set a precedent for similar bills to be introduced to safeguard other protected classes against discrimination? Both across the country and here in Georgia, we have seen unprecedented rise in Islamophobic rhetoric and attacks directly against Muslim community members. From teachers threatening to attack Muslim students, to establish community members and business leaders being threatened with doxing for expressing their beliefs, this is a widespread issue. When can we anticipate the legislator moving forward on a bill that addresses Islamophobia? If they are so concerned with protecting our communities against discrimination. In conclusion, JMP strongly opposes HP 30 and we urge George Alarmakers to consider our aforementioned concerns and ensure that any legislation upholds our fundamental right to free speech. Thank you so much for your consideration. All right, thank you. We're still eight minutes and 15 seconds left. Nadia Beizadeh, can tell us how to say it correctly. I'm Nadia Bezadeh, I'm an associate. You were fine. An associate professor of literacy education in Atlanta and a union member with United Campus Workers. I'm speaking on behalf of many university faculty across Georgia as well as K-12 educators. We are greatly concerned about how HP 30 seeks to adopt the IRA definition of anti-semitism and how this definition will negatively impact academic freedom and free speech from elementary schools to universities. A major problem is the vagueness and contradictions within the language by IRA. After providing the definition, the IRA website then offers a preface to the examples of anti-semitism that starts with this statement and I quote, manifestations might include the targeting of the state of Israel conceived as a Jewish collectivity. End quote. The next sentence reads, quote, however, criticism of Israel similar to that level against any other country cannot be regarded as anti-semitic. End quote. So there's a contradiction here. If one targets the state of Israel in some way, it is anti-semitic. But criticism is OK, but similar to critiques leveled against other countries, how will this be determined? Regardless of intent, the impact of adopting the IRA definition will be to inhibit free speech and undermine the accurate conveyance of information. When teaching the Georgia Standards of Excellence for Social Studies, which for example in the seventh grade includes the geography of the Middle East, including Israel and the West Bank, teachers may choose to skip the standard because of this legislation. Instead of providing the next generation the opportunity to think critically and deeply with the support of caring knowledgeable teachers about the historic and current tensions between Israel and Palestine, students will have their education undermined by this legislation. The reason teachers might not teach the standards is understandable considering their desire to keep their jobs. It's because this vague definition will make them fear being accused of anti-semitism, even if they are accurately representing history and current events in the region. This is absolutely unacceptable. Students in Georgia have the right to a robust education that prepares them to be civic leaders in this country and that prepares them to communicate to their legislators, their stance on appropriate foreign policy. From an educational standpoint, passing this bill will negatively affect the education of students across the state and the working conditions of teachers and teacher educators. I urge you to not pass HB30, thank you. All right, thank you. Next we have Karim Ross-Hendler. Good afternoon. Good afternoon, Chairman Strickland. And members of the Senate Judiciary. My name is Karim Ross-Hendler and I'm speaking here today as a history teacher and I'm unaffiliated. As many have stated, the eye-reworking definition of anti-semitism albeit quite vague is not particularly problematic. However, many of its 11 examples of expressions of anti-semitism are very problematic. One of the more bizarre examples is number 10, quotes drawing comparisons of contemporary Israeli policy to that of the Nazis. You might ask, what on earth do Israeli policies have to do with everyday life in the state of Georgia? Israel is a foreign entity and we are concerned with protecting our local communities. But more generally, you can see how badly this will bowed for free speech and first amendment rights. Leaving aside history class, which are filled with historical comparisons, let's take a brief look at congressional statements. In April of last year, Texas representative Michael McCall said quote, then we had Hitler and today we have Putin and Chairman Xi. In October of last year, California representative Kevin McCarthy said quote, a lot of actions that Putin takes are very similar to Hitler. In 2007, California representative Dana Rohrabacher likened Myanmar's ruling military junta to quote Nazi criminals. We can see that these congressmen comparing foreign states policies to those of the Nazis, tasteful or not, nothing about their comparison suggests they harbored any hate for the Chinese, Russian, or Burmese communities in the United States. So on what basis could we consider a person anti-Semitic for drawing this comparison to any country, including Israel? If this Ira definition were to be past year today, it would not only limit the way we can talk about Israel, but also open the door for every community to work this example into its own definition of racism. This shields foreign governments from criticism, but does nothing to protect any of our communities in the US. This is not only our opinion, but also that of Kenneth Stern, the chief drafter of this Ira definition in 2004, in very powerful terms, he said. Jared Kushner, the president's son-in-law and special advisor, wrote in the New York Times that the Ira definition, quote, makes clear that anti-Zionism is anti-Semitism, unquote. Stern continues, I'm a Zionist, but on a college campus where the purpose is to explore ideas, anti-Zionist have a right to free expression. I suspect that if Kushner or I had been born into a Palestinian family displaced in 1948, we might have a different view of Zionism, and that need not be because we vilify Jews or think they can aspire to harm humanity. Further, there's a debate inside the Jewish community, whether being Jewish requires one to be a Zionist. I don't know if this question can be resolved, but it should frighten all Jews that the government is essentially defining the answer for us. End quote. Again, these are the words of the man who drafted the Ira definition that's on the table today. As a teacher, I always ask my students to make sure their evidence matches their argument and that they remain true to their message. Many of the examples provided by the Ira definition, like the one I read, bear no relation to anti-Semitism. Instead, they provide political cover for a foreign entity and have a chilling effect on free speech. I urge you not to adopt House Bill 30 and instead combat anti-Semitism and other forms of racism through bills that truly reflect Georgia's needs. Thank you very much. All right, thank you. And last we have Jill winner. There's over a minute left, but I'll let you close this out and we're going to move on to those that are for the bill. Good afternoon. Hi there. I'm Dr. Jill Weiner. I come to you today as a physician, a trauma specialist, a Jewish Georgian, and I'm asking you to vote against HP 30. I grew up in Atlanta. I went to synagogue in Jewish summer camp in Georgia. I attended Westminster, where I studied both the old and the New Testament. I was a religion major in college. And I spent a summer in Israel when I was 17. I oppose HP 30 because legislating an anti-Semitism bill that is vague, controversial, and static doesn't make Jewish people safe. Thousands of years of oppression and resilience of the Jewish people cannot be reduced to a law passed in the state of Georgia by people who are predominantly not Jewish, a bill that associates several of its examples of purported anti-Semitism about the state of Israel that has only existed for 75 years. As a trauma specialist, it's important to put the creation of this bill as well as the actions of the state of Israel into context. Every marginalized group has trauma responses to being marginalized. Trauma rewires our threat detection system, changing what makes us feel safe and unsafe. Our trauma response is Jews is not an intrinsic part of the Jewish religion itself, and it doesn't define what it means to be Jewish. Part of a trauma response is not only fear, but also becoming the oppressor, like the phrase hurt people, hurt people. This bill is part of a fear and trauma response to being marginalized, and while it's theoretically designed to protect Jewish people, it's not actually protecting anybody. It's actually causing harm because it's forcing all Jewish people to line up and have the same opinion, especially about Israel, and it's chilling our free speech as Jews. The IHRA definition and bills like HB30 cause silencing and fear, turning Jewish people as a whole, and the threat of anti-Semitism into an oppressor. Legislating what Jewish people and non-Jews can or cannot say about the state of Israel, like not being able to call Israel racist. Not only does this infringe on our first amendment rights as Georgians and Americans, it could lead more people to believe anti-Semitic tropes and stereotypes around power and control. There are multiple truths. I am proudly Jewish and identify strongly with our various forms of Jewish religious expression, our first amendment right is citizens. I am also opposed to anti-Semitism, and I have also experienced it personally. And I ask you to oppose HB30 as I will continue to strongly disagree and criticize Israel's actions. However, I choose to do that as my right is a citizen, and I should not have to feel fear in doing so. Thank you for consideration. Thank you. And thank you everybody for the respect you've shown as we've heard from the people against the bill will now move to people that are for the bill. There was a few names I did not get to call upon that were against the bill, and the same thing I'm sure will happen for the for the bill. If you want to be on the record for the committee, you can still submit testimony to us to our office. We'll put you in the record. Otherwise, I do encourage you to continue to reach out to representatives and senators as this bill moves forward, assuming it moves past this committee tonight, but obviously we're limited in what we can do in these hearing rooms. So now starting the four same rules, I'm gonna call three names at a time. Same thing if you're in the other room, if you'll please work your way over and come get in the on-deck circle. The first three names are Mark Goldfeller, Eric Robbins, and Sally Levine. And one second, we get another clock started. All right, good afternoon. Good afternoon, Mr. Chairman and members of the committee. It's good to see you again. I just want to start by clearing up a few things we just heard. First, Ira does not conflate Zionism and Judaism. It recognizes that Jews, even Jews who don't like Israel, are often attacked because of a real rate perceived connection to the state of Israel. The speaker from the ACLU is simply wrong on how the First Amendment works. The United States Supreme Court and Wisconsin versus Mitchell unanimously ruled that, and I quote, the First Amendment does not prohibit. They have a dentiary use of speech to prove motive or intent. That is how anti-discrimination laws work. If, for example, a person used the N word and then attacked a black person a day later, of course, you would look at their previous use of speech to determine intent, the Supreme Court also said does not consider that to be the chilling of speech. They said, quote, we find no merit in this contention. The care person is wrong and are hypothetical for two reasons. First of all, criticizing Israel is not anti-Semitism. That is actually in the definition. It's important to read it. Number two, could a crazy person misunderstand this law and bring a frivolous lawsuit? Yes, and the Ira definition will be an excellent defense for that person to get that lawsuit thrown out. I want to comment on representative Carson's comments on the floor last year, because they got a lot of attention. At the end of the session last year, a group called Jewish Voices for Peace sent an email listing dozens of organizations that they claimed were Jewish organizations that were against this bill. We looked into it and over 90% of the organizations were not Jewish in any way manner, shape, or form. It was a lie. And so representative Carson's comment was the so-called Jewish organizations that were against that bill. That was what he was referring to. Why is Holocaust inversion particularly painful for the Jewish community? There are 6 million reasons and a million of them were children. We don't have time to get into it now. But if, again, you can call a Jewish person an Nazi. You just can't then attack them for it. The speakers seem to have missed the fact that you have to commit unlawful conduct. Look, we could talk about all the statistics that we want to about the rising rates of anti-Semitism, but you know that already. We could explain what the bill does, but Senator Kennedy did that already. I want to tell you something you might not know. This is our third year doing this. And unfortunately, none of our hypotheticals are theoretical anymore. You've probably heard about the harassment of Jewish students, but you probably don't know about the trespassing, the vandalism, and the destruction of property that Jewish students are experiencing at unprecedented rates. You might not know that at UGA, a group attacked a Jewish student through him to the ground, threatened to kill him and his family and other Israelis. The kid is not Israeli. He's just Jewish. And when it came time to charge him, the authorities told us that no, it's just a simple misdemeanor. It's not anti-Semitism, they said. It's just politics because Israel. In practice, what that means is he was back on campus with his victims just a couple of...\n\ndays later, feeling mighty empowered to do whatever he wanted to do. And that's why you haven't heard these things. It's because Jewish students are now afraid to report them. Look, in theory, Jews should be easily covered by existing anti-discrimination laws, but in practice, they are not. This has never been about Jewish exceptionalism. It has always been about equality. And this has nothing to do with any other community. Anyone can say whatever they want, however abhorrent about Jews or the Jewish state. This is about protecting our community. Look, this is not about politics. Okay, we just don't want our children to get hurt. Thank you for your consideration. Thank you. Next we have Eric Robbins. Good afternoon. Good afternoon to you. And thank you, America Robbins. I'm the president and CEO of the Jewish Federation of Greater Atlanta. Jewish Federation of Greater Atlanta is the largest Jewish organization in the state. We represent mostly the probably 150,000 plus Jews in Atlanta. While no organization can speak for the Jewish community of Atlanta, holy, I think we speak for probably the majority of the community. And one thing I will say is that I think Representative Carson said 95%. I will tell you probably closer to 99.9% of this community supports the passing of this bill. It needs the passing of this bill. I appreciate those that spoke against it, especially those of the Jewish faith. And I respect them for their commitment to the faith. But they represent a very small group. Most of them were probably in this room. This is an important bill to pass. The Jewish Federation is responsible for fundraising for our community. It's responsible for planning not just for the current community, but for the future of our Jewish community. We have been in existence for over 100 years. We also oversee security of this community. And it sickened me how much money we now have to spend for security in this community, in the amount of time and energy. And I don't know how often you've driven around Atlanta, but you'll recognize our institutions because they now have gates. They have police officers. They have security. And the threats are real. And it's very unfortunate. And whatever we need to protect ourselves when anti-Semitism is actually happening, I was born and raised in Pittsburgh about a mile from the Tree of Life synagogue. I've spent most of my career here in Atlanta. But anti-Semitism is real. And whatever we need to do or pass so that we can stop it and persecute those who perpetrate it is absolutely important. I stand here for you today. Looking for the Jewish Federation of Greater Atlanta, speaking for what I believe to probably be the absolute majority of this Jewish community to say that we are in favor of this bill as it currently stands. And as you know, this bill has been put in place in over a thousand other situations. So this is the gold standard against anti-Semitism and we're in complete support of it. Thank you for your time. All right. Thank you. And as Sally Levin comes up, the next three will be Pastor George Morrison, Darius Jones, and Chain. And I cannot read the last name with the Jewish Student Union as maybe N-E-I-D-I-T-C-H. Okay. Next three. All right. Okay. Good afternoon. Good afternoon. Hi. Good afternoon. Thank you for giving me this opportunity to speak. I'm Sally Levin. I'm the Executive Director of the Georgia Commission on the Holocaust. And I'm also a teacher fellow for the United States Holocaust Memorial Museum. I do a lot of teacher training and I have been in the classroom for over 20 years before I've ended up in this position. Number of things I want to share with you today, I think that the Holocaust has a lot of lessons for us to look at as we evaluate HB30 and why it's important. I hope that we're going to adopt HB30 from the International Holocaust Remembrance Alliance. That's what IHRA stands for. Anti-Semitism cannot be allowed to thrive when it grows unchallenged. In Nazi Germany, the government implemented anti-Semitic laws and used propaganda incrementally. Everything they did was legal. It was part of the legal system of Nazi Germany. These laws reflected the anti-Semitic ideology of the government. Experiencing little opposition by ordinary Germans, the Nazi government was emboldened to increase their propaganda and their restrictions and laws against their Jewish population. Ultimately, as we all know, this ended in violence and mass murder. Laws reflect who we are. They reflect our beliefs and our values. In opposing and identifying anti-Semitism, we emphatically state here in Georgia who we are in the face of the rising anti-Semitism we're experiencing today. In our democratic society, we must not stay silent. We must not tolerate hate, racism, and anti-Semitism. Making Jews collectively responsible for the actions of an individual or a government or group is anti-Semitism. Contrary to humanizing comments about all Jews invoking stereotypes and conspiracy theories, that's anti-Semitism. Attacking all Jews for Israel's policies is anti-Semitism. Holding the state of Israel to a different standard than we hold other countries, that's anti-Semitism. But also denying the Holocaust or distorting Holocaust history, that's anti-Semitism, too. To stand against anti-Semitism, we must agree on what it is. Ambassador Deborah Lipstat, who is our special envoy to monitor and combat anti-Semitism from Emory University. She supports the IHRA definition of anti-Semitism. And she has explained that it is a message that we take anti-Semitism seriously. She wrote that action starts with understanding. HB30 helps us to provide that understanding and that framework. I hope you will support HB30. Thank you. All right, thank you. Next, Pastor George Morrison. Good afternoon. My name is Pastor George Morrison. I live in Villa Rica and serve on the Executive Board of Christians United for Israel. A 10 million-member organization with 460,000 members right here in Georgia. I've been a pastor for over four decades. And prior to that, I served the United States Marine Corps and I was deployed to Vietnam in 1969. Supporting Israel and the Jewish people has been a lifelong passion of mine. As you know, since a month's brutal, October 7th massacre, anti-Semitism has reached fever pitch across the United States. According to the ADL, anti-Semitic incidents have increased more than 300 percent in the wake of the terrorist attack and ensuing war. Here in Georgia, we have seen grotesque incidences of anti-Semitism well before the conflict. And in the wake of October 7th, our friends in the Jewish community have been on the receiving end of bomb threats, anti-Semitic protests and bullying on college campuses. I was proud to stand on the National Mall during the recent March for Israel and I am proud to be here before you today. Israel is not alone. And the Jewish people of Georgia are not alone in this fight. This is why I'm asking you to take a stand against anti-Semitism by ensuring that HB30 is passed into law. To be clear, we cannot defeat that which we are unwilling to define. Forty countries have adopted this definition as have 33 states across the nation and the federal government. The definition enjoys widespread bipartisan support as evidence by its use in successive U.S. administrations. It is passed time for Georgia to acknowledge the importance of IHRA definition as a tool for combating anti-Semitism. Thank you for your time. All right. Thank you. Next, we have Darius Jones. Good evening. Good afternoon, esteemed members of the Georgia General Assembly. My name is Darius Jones. I'm the founder and president of the National Black Empowerment Council, a national network of black leaders from many fields and industries who work together to uplift African Americans in the area of education, economic empowerment, community development. Alongside that primary mission, NBC has made the creation of a resurgent and black Jewish relationship a priority. As cooperation between our two people was a key component in the success of the civil rights movement. To fight against racism and anti-Semitism may manifest differently, but at their core, they threatened the very principles upon which our nation was founded. Liberty, justice, and the pursuit of happiness. That said, I am here today to offer my full support of HB30 in its current form. The IRA definition provides a comprehensive framework for identifying and addressing anti-Semitism, offering clarity in a world often clouded by ambiguity. By embracing this definition, we signal strongly that our commitment to honoring and upholding the dignity of all Americans is unwavering. The passage of HB30 will make an enduring commitment to such values, not just in words, but in legislative action, affirming Georgia's stance against discrimination in all of the city's forms. In closing, I urge each member of the General Assembly to consider the profound impact adopting the IRA definition will have on our collective journey towards justice. Let us stand united against anti-Semitism, racism, and all forms of discrimination, creating a legacy of inclusivity and compassion for generations to come. Thank you for your time, your consideration, and your support of HB30. All right, thank you. It's Shane and I'll let you pronounce your last name when you come up. The next three will be Julie Katz, Rabbi Elizabeth Bayer, and Mac Parnell. Good afternoon. Good afternoon. We have 17 minutes left. My name is Rabbi Hayam Naitich. I'm the Executive Director of the Jewish Student Union. I've worked with Jewish students in Atlanta for 30 years. And in the past, I'd say 30 years, I've never met a Jewish teen who has not experienced anti-Semitism in their life. Since October 7th, I've not met a Jewish teen who has not experienced anti-Semitism. This is thousands, thousands of Jewish students who have not experienced anti-Semitism in the form of anti-Zionism. There's teens on the day of rage who are afraid to go to school. They've been harassed. They've been bullied. And there's fear. Schools have been afraid to announce Jewish programming. Why? I thought anti-Semitism is an anti-Semitism. Why are they afraid to announce these things? And I just want to ask you to please pass HB30. Schools have asked for the ability to go ahead and go after students who are committing these acts. They want to be able to go ahead and stop and provide a safe environment for students, but they need these laws in place to be able to go ahead and protect students. And I ask you to please make sure that every single child in Georgia feels safe to go to school. Thank you. All right. Thank you. Next, we have Julie Katz. Good evening. Good evening. My name is Julie Katz, and I'm the Associate Director of American Jewish Committees at Lanta Office. We are the Global Advocacy Organization for the Jewish People, and our area of expertise is anti-Semitism. Senator Kennedy, when he was explaining the amendments to the bill, touched on the fact that law enforcement needs this as a tool. In 2022, a gunman walked into a synagogue in Coliville, Texas, and held four Jews hostage. The reason for doing so is because there was a terrorist in a prison a few miles away, and he thought that he could utilize the situation to use Jewish control and power to get this terrorist released. When the FBI released their first statement about what was happening, they said that this gunman was not motivated by anti-Semitic intent. The tropes of Jewish control and power are some of the oldest anti-Semitic tropes in the book. So if the FBI, one of the most important law enforcement agencies in our country, was unable to identify anti-Semitism in this scenario, it speaks volumes to why this is needed, and why Ira specifically. Ira was compiled by experts who had spent their entire professional lives studying and combating anti-Semitism. And the Ira definition, along with the accompanying examples, helped to provide context for all of the different ways that anti-Semitism can manifest, because anti-Semitism is oftentimes not simple. Anti-Semitism is complex and it's coded and it's based on conspiracy theories. And that's why it's so important to have not only a definition, but this definition, the gold standard. In a time period where anyone's opinion can be regarded as fact, I urge you to consider the experts and to trust the experts on this critical issue for our community. Please support HB30. Thank you. All right, next we have Rabbi Elizabeth Beyer. Good evening. Good evening. Ladies and gentlemen of the Senate Judiciary Committee. As a Rabbi and making, I stand before you not just as a religious leader, but a fellow citizen. In the South, we take our pride and our shared Judeo-Christian values that underpin the very fabric of our society. These values rooted in family, faith, and the American dream are the bedrock of our communities. However, my journey as a Rabbi has not been without its challenges. I, like many others, have experienced the sting of anti-Semitism. Outside of my congregation, this very summer on June 23, a Jew was hung in effigy, as my congregation was arriving for shop of services. Those same protesters walked around stepping on an Israeli flag and chanting Nazi slogans at me while I looked out from my congregational windows at them. Later that day, I received lured and inappropriate pictures sent to my cell phone. Flyers were left around the neighborhood of my congregation and around Warner Robbins to the south of me. The very next day on June 24, there was a physical confrontation between protesters who were there for a peaceful protest of healing and those same Nazis who had been at my congregation the previous evening. What happened that day did not end that day. In fact, flyers were sent around the Beals Hill neighborhood on August 29th. And again, on October 24th. On September 19th, I received to my professional email account, not the general congregational email account, an email which read, do not trust Jews, question them everywhere in city council meetings in front of their synagogues, in front of their children, in front of their homes. It is time for all of us to push back against the Jewish supremacy and confront them once and for all. We must put an end to their lies, diversionary tactics, and hate. And then on December 18th, my congregation received a bomb threat. We were part of over 400 Jewish facilities that received a bomb threat that weekend. Was part of a larger swatting event. We the people of Georgia stand united against bigotry and discrimination. Our diverse tapestry is woven with threads of resilience, understanding, and mutual respect. As we address antisemitism, let us fortify the bonds that make us strong, the bonds of family, the bonds of community, and the unwavering belief in a brighter future for all Georgians and all Americans. Together, we can reaffirm our commitment to a nation where the lamp of liberty shines brightly, dispelling the shadows of prejudice in the spirit of Southern hospitality. Let us foster a climate of understanding, embracing our differences with standing firm against the darkness of hate. Together, we can build the Georgia and America that exemplifies the values we hold dear and become a beacon of hope for future generations. In the very first president who wrote his letter to the Jewish community in Rhode Island, George Washington said, quote, for happily the government of the United States gives to bigotry no sanction, to persecution, no assistance requires only that they who live under its protection should demean themselves as good citizens. In giving it on all occasions their effectual support, this country is a manifestation therefore of a vision that the prophet Isaiah wrote, for my house will be called a house of prayer for all peoples. Thank you and I encourage you to please vote yes on HB30. Thank you for your consideration. All right. Thank you. Next we have MacParnell. And then on deck with nine minutes, nine and a half minutes left, Bethel Aaron Gone and David Lubin and Rob Bylery, Sir Knott Switch. All right. Good afternoon. Members of the committee, thank you so much for your time and dedication to this issue and the thorough vetting of this bill that we have seen. We appreciate the time and the attention. My name is MacParnell and the executive director of the Georgia Faith and Freedom Coalition. I come before you as a Christian today but wholeheartedly in support of House Bill by the way, I want to thank you again for your diligent work on it. It's an honor to be here but it's also heartbreaking that we have to be. The Jewish people have faced persecution for millennia and recent history has been no different from the pogroms to the Holocaust and to the horrific attacks on October 7th. The Jewish people have faced unthinkable atrocities and here at home anti-Semitism is on the rise. You've heard the numbers, you've heard the statistics but it's real. Georgia has the opportunity and responsibility to send a simple message, not in our state. In November in the aftermath of October 7th I had the opportunity, the solemn opportunity to lead a delegation of elected officials to Israel. We visited Kabut's Qafaraza which is about a mile from the Gaza border and we saw the worst of humanity, unthinkable tragedy. But let me be clear, October 7th was an attack in Israel but it was an attack on the Jewish people. I was coming up the elevator to this committee and a nice lady saw my pen, an American flag, a pen with the star of David and the Israeli flag on it and she made the comment, oh you're wearing yours so let me get mine out. And to the Jewish people in the audience you should not have to hide your identity. This is a state that should be free of hate. I want to thank you so much for your attention and offer our full support. You'll see a letter from our founder and chairman Dr. Ralph Reed and many other state and national evangelical leaders and we have humbly asked for your support in House Bill 30. Thank you so much. Thank you. Next we have Bethel Aaron Gahn. Okay. Oh it looked like Bethel Beth Slash Aaron. I guess. Yes. Well, you have seven out of minutes left. Okay, we'll be fast. Okay. Good afternoon Mr. Chairman, members of the committee. My name is Beth Gahn and my two sons were harassed for 18 months for being Jewish while in Fulton County when they were in middle school. Jessica Swastika was drawn on the bathroom walls as well as kill the Jews and gas the Jews on the bathroom walls. The school's response was they did not know what the anti-semitism was. That is until the government stepped in and threatened to get involved. I told you this story last year and after I did I was spit at the next day for telling it. I am still here again and as we speak there's another federal complaint being filed with the same schools in Fulton County continuing anti-semitic harassment which is still going on today. Jewish parents have complained multiple times and kids like my kids are afraid to go to school. That's why we need this bill. Okay. Good afternoon Honourable Members of this committee. My name is Aaron and I want to tell you about my own experiences regarding anti-semitism. I would also like to inform you that for the purposes of this story I am on the autistic spectrum. For 18 months my brother and I were terrorized in our school. I kept finding Swastika's scribbled in the bathroom some as big as five feet wide. Along with other graffiti that specifically stated to kill the Jews and gas the Jews, these writings later transitioned into physical acts such as having money thrown at me being yelled hail hitler in class and also being screamed jume down. Furthermore I was told by teachers, staff, social workers and administration that the Swastika's I was finding even the five foot tall one was not a Nazi Swastika but a piece symbol. And that the other graffiti I was finding was not anti-Semitic in nature even though it explicitly stated equipped kill the Jews. And because I felt like my efforts were falling on deaf ears I began contemplating suicide at only 13. Had there been a definition of anti-Semitism in Georgia law there would have been no question as to whether or not the graffiti and the Swastika's I was finding were anti-Semitic in nature. A definition would not have allowed any in action. I testify before you all again today because as painful and traumatic as it is to relive this experience I do not want another person to go through this ever. So please vote in favor of HB 30 to ensure that. Thank you. Thank you. Next we have David Lubin. We have four and a half minutes left. My name is David Lubin. My daughter was Rose Lubin who was murdered by an anti-Semitic terrorist in Jerusalem on November 6th. On December 5th the Georgia Senate passed a resolution honoring Rose as a hero and I thank all of y'all for that. Rose grew up in Toko Hills and the Dunwoody community. There may have been the occasional slur yelled at us as we walked to synagogue or the random Swastika spray painted on the sidewalk every now and then. I am shocked to say that I had to say we were fortunate because in the past two years anti-Semitism and the impact it has on my family has exploded. Rose was murdered and a younger sister to attend to Cap County School was confronted in May of 2023 by another student who was making Nazi remarks and making high Hitler salutes. She reported this to the school and the school began to began the investigation. Even though she was the victim she began to feel like she was the one who did something wrong by telling on the anti-Semitic child. In October of 2023 my daughter was called a kike by another student at the same school. When she has it's hintly reported this to the counselors she had to explain that a kike was a derogatory word. And the past two years my neighborhood in Dunwoody has been blanketed with anti-Semitic fires to directly target the Jewish community. A large percentage of Jewish Georgians are living in fear. All you must do is visit our places of worship, schools, community centers to see that we have modified them to resemble fortresses. They sit behind gates with security checkpoints, ballards and have armed guards. We've just added more security to combat this problem. At this point we can no longer sit idly by and expect security to protect us. We need laws in place to deter the threat and convict those who commit these actions of hatred. My daughter Rose is an example of someone who stood up for this and today this committee can do the same. She was a hero as is everyone who takes a stand against hatred is. Please hope yes to HB 30. All right thank you and with two minutes left we will close out with you. And again apologize for those we couldn't get to once again state if you want to have your testimony and the record for the committee please submit that to my office and we will get that in. Mr. Chair with your permission I would invite two students who were supposed to speak today and we're running out of time. Our student from Emory and a student from Georgia Tech, Sophie and Talia to sit with me during my remarks. And they will certainly submit their testimony as well. That's fine. Thank you. Chair thank you for the opportunity and senator thank you for listening. My name is Rabbi Larry, sir of it's on the CEO of Philos of Georgia. We support thousands of Jewish students across the state in creating vibrant Jewish life on campus. Over to this role I have served as a Rabbi in congregations for the past 20 years and most recently in Marietta. I've always affirmed the right to free speech. It's the hallmark of our democracy. However when people attack Jewish students both verbally and physically and hide behind the lack of a definition of what constitutes Jew hatred is simply unacceptable. Antisemitism is not new on college campuses but since October 7th Jewish students have been attacked both verbally and yes physically here in the state of Georgia. Jewish students are justifiably afraid because of this and today the Senate Judiciary Committee has an opportunity to protect these students and in turn positively affect the climate on our college campuses. You've all heard and seen the protests rallies chalking the chance the walkouts in no way, in no way has any voice been silenced. As you've heard the comments today no way they've been silenced but in fact the opposite has happened and as a result Jewish students feel unsafe and threatened. I'm not going to repeat President George Washington's reassurance to Jews in Newport but I will quote Emory Professor and now special envoy to monitor and combat Antisemitism for the United States government former professor Deborah Lipstead who said President Washington's meaning and message were quite specific. In the United States of America the bigotry of Antisemitism must have no place, no quarter or no haven, no home. Without a definition of Antis-\n\nEmitism attacks on Jews, specifically Jewish students, will only get worse. By adopting HP 30, Jewish students would be protected from verbal and physical attacks. Just after October 7th, a freshman Jewish student at the University of Georgia was verbally and physically assaulted. He's a sailant and other student who threatened to kill him and his family, referred to him as a stupid Israeli F. The student was charged by the Athens Police Department, not the UGA Police Department, with three misdemeanors and was released that night on bail as it was not considered a hate crime. He by the way, is a Jewish student from the Metro, Atlanta area and not in Israeli. The use of the word Israeli instead of Jew was integral in this decision. HP 30 would have protected him and so many others. And HP 30 includes this example of anti-semitism holding Jews collectively responsible for actions of the state of Israel. The Jewish community, the majority of the Jewish community as our CEO Eric Robbins said 99% of the Jewish community supports the passing of this bill. And on behalf of thousands of Jewish students across the state of Georgia who feel fear walking on their campuses, we urge you to pass this bill without any amendments to its language. The time, friends, for moral clarity is now. Thank you. All right, thank you. All right, that concludes the public testimony portion of the hearing. Chairman Carson, if you'll step back up, representative, if you want to come up as well. At this point, I'll open up the committee for any action the committee wants to take. What's the pleasure of the committee? Leader Gooch. A appropriate time. I'd like to make a motion. Now is the appropriate time. Motion due passed by substitute to House Bill HB 30. LC number 491587S. We have a motion due passed by Leader Gooch. Do we have a second? Second by Senator Jones. Senator Rhett, sorry. Any discussion? Senator Rhett. I just wanted to recognize Sam Owlins, former Attorney General, and chairman of the Cobb County Commissioners here. I'll probably miss some judges. I'm supposed to always recognize judges and everything. Who are doing that tonight, but thank you. Any further discussion from the committee? All right, a motion due passed by committee substitute to House Bill HB 30. Please raise your hand. It is unanimous. All right. All right, if we can. All right, if everyone could please come to order. All right, if everybody could please come to order. If you have a please come to order. If you don't come to order, you'll be asked to leave. We'll be taken out as some already have been. So please come to order. We've done such a good job of keeping order during this process, and it will continue. Who's going to carry this bill in the Senate? Senator Kennedy? Pro-10 Kennedy, yes, sir. All right. With that, this concludes the hearing on House Bill 30. We have one more bill. So thank you, Senator. Thank you very much. You won this. Oh, one second. Please continue to be in order. We have more business. I'm going to recognize Senator Kennedy. You're my 10-11. That's okay. Please remain in order as you leave. All right. Please. All right. We have another bill to consider if you are leaving, which appears to be most people. Please be respectful as you leave. All right. All right. We're going to keep moving. Please exit the room if you have to talk outside. Thank you. If you're going to keep talking, please walk out. Chairman Albers, I thought they're here for you. They were. I told them they were dismissed. Well, I'm sure your bill is very important. And the people of Georgia don't appear to think so. Thereby's walking out. So I'll take a. We have a couple still here. I'll take a do pass. I'm ocean right now. Let's do this. Let's give 30 seconds because it's good jobs. I'm doing keeping the room quiet. I'll let's let people continue to walk out. Can you feel please exit? If you're not staying for the next bill. Hopefully my committee will stick with me. I'm going to have a. For five minutes. Good. We don't always come. This is how we always do things. It just. I can be brief, Mr. Chairman. Yeah. Well, you just bring the bill on in here. All right. We got the. Okay. You have somebody off from it. I hadn't gotten that far. I guess we really got it. All right. Let's come to order. Next bill in the agenda is Senate bill 359. We're working off LC 491584. I'm not saying anything. I'm just saying that we have chairman Albers. Yes, Mr. Chairman. All right. The floor is yours. Again, if you're exiting please take your conversations outside so we can continue our hearing. Thank you, Mr. Chairman. Excited to present Senate bill 359 to you because I believe that all the groups that just spoke will benefit from this If you have to have a conversation, please go outside. All right, you can move forward. Thank you. The purpose of this legislation is to amend Georgia's hate crime statute to include additional misdemeanors that could be prosecuted as hate crimes. It also amends the definition of the pattern of racketeering activity under the Georgia Reco Act. The bill also adds victims actual or perceived political affiliations and beliefs to the list of protected characteristics under the hate crime statute. The list of new offenses that are being added to the list of hate crimes are all based on a series of events that have happened here in the Metro Atlanta area and across our state and sadly across the nation and world. In the last couple of years, where Jewish persons, homes, businesses, synagogues were specifically targeted. This includes a high profile series of events at which threatening flyers were dropped in the yards of Jewish families, which is littering. Bomb threats called into Jewish hospitals and synagogues and hobbods. These are terrorist threats. The other offenses being added are a basic crimes of intimidation that are often committed in an attempt to intimidate or threaten a specific population. And why did the expressive nature of many of these offenses added to the hate crime statutes under this bill? The legislation also includes savings provisions related to the constitutional rights of the first amendment of the Georgia Constitution and the U.S. Constitution to engage in protected speech and activities relating to U.S. foreign and domestic international affairs. The bill also clarifies that nothing and the hate crime statutes alters the evidentiary requirements of a conviction, noting that a jury must determine beyond a reasonable doubt that the defendant intentionally selected the victim, group of victims, or property based on some protected characteristic of the victim or group. This addresses a real issue and goes after the people who are committing these heinous acts. I'll take you section by section through the bill. I do have in front of you a printed out amendment and I want to thank the prosecuting turnings council for finding a couple of scripteners errors before we brought it to your committee. First, this bill is named a projecting Georgia's act under section one. Section two amends Georgia's Rico Statue to provide that, quote, committing, attempting to commit or soliciting, coercing or intimidating another person to commit, one or more acts covered by the hate crime statue can constitute a pattern of racketeering activity under the Rico Statue. We will amend that to two and you'll find that online 30 of the bill. In section three amends, the definition of designated misdemeanor to include the following misdemeanor offenses that could be prosecuted as hate crimes. Litering, unlawful placement of posters, signs, and advertisement, disorderly or disruptive contact conduct at a funeral or memorial service or at the normal functions of facility where a funeral or memorial service is taking place, loitering or prowling misdemeanor terrorist threats, disorderly conduct, harassing communications. It also adds a victim's actual or perceived political affiliation or beliefs to the list of protected characteristics under the hate crime statue that we passed probably out of this Senate just a couple of years ago. It changes the fine for such charges to not less than $5,000. And again, it clearly states that nothing in this bill should infringe upon First Amendment rights, rights to engage in legally protected conduct or expressive activity. It states again that a jury must still determine beyond the reasonable doubt that the defendant intentionally selected a victim or a group of victims based on protected characteristics of the victim or group. And last, section four, sections two and three of this bill will come effective on July 1st of this year if it passes through. And then other sections will become effective upon the approval of the governor, or if he does not sign it when the bill became such applicable law. Under, lines 31 and 32, the one of their scriveners error that are there that I will ask for a amendment on will simply remove the words chargeable by indictment. That is the last two words on line 32 and the first one, sorry, the last two on line 31 and the first one on line 32. That is the bill. It is actually fairly simple in its desire to make sure that people are committing these heinous acts are held accountable to their crimes because here in Georgia, we do not tolerate people who will cause harm, physical, mental or otherwise. And with that, Mr. Chairman, I do have any questions. Senator Hodges, you have a, who else? Somebody pushed a button up. You have a question, Michael? Okay. Go ahead. What, what, Michael, are you, Mike, too? Go ahead. If it is the appropriate time, Mr. Chairman, there is another legislative council error that I would like to point out. Yeah, good point that out for us. And it would be right in the next line, line 33 refers to subparagraphs B1A or B1B. No should read B2A or B2B. All right. There is no B1A or B1B. All right. Thank you. Now, questions from the committee. Senator Sapsler. Thank you, Mr. Chairman of the author and my friend and fellow Northwest Atlanta resident. Just want to dive into this. There is a lot of detail here. Wanted to, as you sort of fuse these two things together, you know, I certainly think there is much, in vitious, ugliness and unwarranted hate that spewed around political affiliation these days. It is certainly not impressive in international history. It has been ugly before, but we are in an ugly time right now. What I am trying to understand though is when I weave together, you know, we are adding in placement of signs, posters, advertisements and violations of code session 1678, which is the littering statute. Well, littering 16743, line 45, 46 places from the poster signs and advertisements. That is a designated misdemeanor the way this bill is crafted. So, multiple examples of designated misdemeanor coming at a person and coming at a person because of their political affiliation or beliefs. As I weave together what this is doing, and at this, we are just early in committee, we are just working through this. How does that work? How does a circumstance where we are stating littering or placements of signs, posters and violations of law going after a person and then creating a political affiliation or belief as an expansive, protected class. It seems like those together have an unintended consequence and that is just want to understand how your intention is with that. Senator, I think actually that is the exact intended consequence based on what you said, right? So, if we are specifically targeting these individuals and you are doing that by committing any one of the misdemeanors, whether it happens to be the improper placement of poster signs and advertisements, etc., there might be putting something up that a Jewish family as an example says, you know, go, you know, saying something that is so atrocious that they feel that they are being threatened by that very action and look, some of the materials, as you know, we have seen in schools in Cobb County, in Fulton County, by putting up everything from Nazi swastikas to other hateful things that I am not going to say in this microphone right now. I think when you combine all those things together, that is the purpose of creating this connection. I get that. I don't understand how these code sections that are limited just to anti-Semitic intent. I mean, it seems like this is a broader issue than that. And again, if Senator Kouser is attacked by somebody who decidedly wants to see his political demise, they are exuberant, where they are spreading around them, they break laws with signs, they are littering and doing these kinds of things, and they are expressly going after Bill Kouser because they disagree with political stances and they want to see him go away politically, and they are targeting him in that way. I just want to make sure we have this tight, we have thought through the implications of adding in littering, placements of posters and signs, political affiliation, as we go through the process, I just raise that as a concern. I appreciate your concern, and I, like many of you, have personally been on that example, you just stated. However, we are updating the hate crimes that you in general. This is for all things, not just one. So this is a consistent addition to the way the hate crimes bill is today. So I don't think necessarily we are targeting for just one, we are doing this for all. Thank you. You know, there are questions from the committee for the author of the bill. All right, thank you, Chair Minabors. We have a big group, even though there are a lot of people left in the room, there are still a lot of people who are not to speak on this bill. And we did a foreign against sheet, though it looks like some at least one person that wanted to speak a post on up on the four side, and maybe at least one person that wanted to speak for it, set up on the against side. So I will not be doing this. We have maybe to get through everyone in 30 minutes, and we will start a clock, and I will try to get through you all if you can be respectful everybody's time, giving how late it is. I just got to look for a majority leader. I want to keep a core on. So we are going to start the clock, and I am going to call upon Ben Lyd. If you will come on up, you are going to go first. Good evening, now, Chairman and members of the Senate Judiciary Committee. For those who haven't had the pleasure of meeting, my name is Ben Lyd and I am policy counsel with the ACL of Georgia. Join all of you today to voice the ACL of Georgia's strong opposition to SB 359. Broadly speaking, SB 359 immense two statutes, both of which have their constitutional suspicions to allow 20 years of prison exposure for acts of constitutionally protected speech or acts of civil disobedience. There is simply no justification for criminalizing protest, particularly when a bill subjects protesters to a 20 year prison sentence. If any of you have support for this bill, I am sure you have specific activities, many of which Mr. Chairman elucated that may be driving that support for the bill. But what I want everyone to think of, if that's where you are, is please consider the fact that unless you are conceding this bill to fail on equal protection or prosecutorial evidences and grounds, the bill must apply to any conduct for which probable cause exists. This is especially true, given this body's belief that prosecutors should review every case where probable cause exists for potential prosecution. Because this bill was only introduced this morning, we have not had the opportunity to fully explore the types of constitutionally protected conduct that would be unconstitutional under the bill. But from the onset, two things fly off the page, many of which were identified by Senator Setsler, and that's canvassers and leafletters. It is difficult for me to imagine, especially with the introduction of political affiliation and beliefs as a protected class, that individuals can leaflet politically or canvass politically and not be subject to arrest and re-coprossecution under this bill. It is important to remember that the United States Supreme Court has made abundantly clear that just because speech is offensive or unwelcome to the recipient, it is still constitutionally protected. Similarly, when this bill expresses, expressly violates the First Amendment, we believe that the bill, which we believe the bill does by targeting canvassers and leafletters, these savings clauses will not save the bill. I've included in my materials, which I believe were in your folder, a citation to an 11 circuit case, which says that expressly. That's alone should require this bill to be pulled down for further work. With regards to civil disobedience, one thing that we should all agree on is that there are criminal penalties for civil disobedience. These sanctions should be proportional to the conduct and applied equally to all conduct and not just speech that is disfavored by the state. We at the ACLU of Georgia are especially concerned with the inclusion of political beliefs and affiliations protected classes. Being confronted by those who oppose your political beliefs or affiliation may be among the least welcome and most offensive speech one can be confronted with. We also say that the most off-limit topics in polite society are religion and politics. However, religion is generally considered a mutable trait and constitutionally protected, while when politics are changeable and constitutionally fair game. This provision goes directly against the great way to the First Amendment jurisprudence and absolutely should be rejected. When the ACLU of Georgia first came in opposition to the hate crime statute in 2022, this was exactly the kind of chilling speech that we were concerned that this bill would metastasize into. While the rego statute goes much farther than the rego statute, it was expressed in the legislative intent of the Georgia rego statute that we would not be prosecuting single acts of misdemeanor conduct or acts of civil disobedience using that statute. While I know there's an amendment to change that first provision, the bill as it is on your desk today violates both of those legislative intents that are codified in Georgia state law. I can definitely understand that there are forms of protest that this committee can disapprove of and there's plenty of speech in the modern discourse that I personally find utterly reprehensible as well, but that is never a justification for chilling one speech and SB 359 therefore should be rejected. I'll stand for any questions. All right, thank you Ben. You have any questions? Okay, thank you very much, committee. Next we have James Woodall. Here's your hallways. All right, he waves. Next we have Lisa is it Maggie. Good evening. Good evening. My name is Lisa McGee. I'm a resident of Grant Park in Atlanta and I'm speaking on behalf of myself. Today, Georgia shows its fascist hand again. You say it does not infringe on the First Amendment, but under that amendment, we are given the right to dissent. This should include dissenting against anyone's political beliefs. We peacefully protest through marches, chanting, pickets, referendums, and petitioning, sit-ins, fliering, and rallies. Whether or not you agree about what the protest is for or what the fliers is, what political bias you think is the motivating factor. These actions should not be lumped into racketeering and conspiracy charges. This bill seems to be directed specifically at people in my organizing community. You cannot vote this into law. I'm sorry if the views and values of those who wrote this bill have felt targeted by actions lately, but perhaps if you put more effort into better education for all, better living conditions for all, better access to healthy food for all, and less effort on militarization, we wouldn't have to protest so much. I would also like to note that there are many more people in my community that would be here against this bill that could not be here today. This is not a bill the community wants. Thank you. All right. Thank you. Next, we have Gabriel Sanchez. You want to wave? Okay. All right. Next, we have Nate. Is it Cough? No, they stepped out. Okay. No, they will be back. Okay, we'll move on. It comes back before we're done. Then just let me know. Anna Hall. Sorry, I was the other way. Okay, she stepped out as well. John, is it Eves? He stepped out. He stepped out. I'm going to keep going. Gabriel, her Shaharn. It's H-I-R-S-C-H-H-O-R. And I wonder if some people thought they were speaking on the other bill. Okay, let me explain this. I'll keep going through the list. Kathleen Hamill. And Abid Salim. Ariel Friedman. We just have one more. And Shamin Barday. This B-H-A-R-D-E. Is there anybody that did not stop this bill that wants to speak? That's what you suggest. Sorry, come on up. That's a little quicker. Well, I didn't think there's many people in the room, but I had a... We'll even stop the clock unless you talk for 30 minutes. I'm just going to run up the clock here. Hello, everyone. My name is John Harris. I'm a member of Democratic Socialists of America here in Atlanta. And I would like to address that I am strongly opposed to this legislation. I've been organizing with the Stopcop City movement here in Atlanta in various capacities. And I am strongly concerned about this bill being applied to my organizing comrades, to other people in the movement, and to movements more broadly. I know that it is being posed as being directed toward particular people and particular protected groups, but I can already acknowledge the misapplication of this sort of language. In particular, one of the founding documents to my particular political ideology, my personal political ideology, was the book, Color of Law, which outlined in excruciating detail the ways that de Jure segregation was carried out in this country. And that is a conspiracy to target a protected group well beyond the advent of the civil rights law, specifically going into 2008 with the mortgage crisis where there is concrete evidence that showed that bad actors in the lending market targeted black communities. And I'm sure that we saw it here in Atlanta with the sort of upside down housing administration that we have here. And I would like to just point out that if we are looking at that, we'd have to look through all of the ways that the conspiracies to attack particular groups would have to go into effect. And I don't think that that is the intention of this bill. I think that it is very clear that this is meant to have a chilling effect on protest, that it's meant to have a chilling effect on the types of actions that are biomines politically sanctioned by the First Amendment to say that littering with a questionable political ideology could somehow be taken as a hate crime part of a criminal conspiracy is frankly ludicrous. But that is what this bill would be posing upon us. And so I would like to very clearly state my opposition to this bill. And I hope that you guys take that into consideration. Thank you very much. Thank you, Mr. Hayers. All right, come on up. I'll let you close this out. I wasn't planning on, but now that I'm here, it's I wish I had more time to speak to you all more often. So thank you. As you know, and I would love to speak to each of you, because I am obviously not happy about the decision in the previous bill. But I did want to say, as you know, a little bit about my story already and my family from my previous testimony as the survivor of Holocaust victims. I actually take that very seriously. And I so much so that I wanted to share with you a tattoo I have. And this tattoo is, it says, divaisa Rosa on it and it's a Rose. And the meaning of that is the white Rose in English. And it was an anti Nazi group that literally was beheaded for fly herring against the Nazis. So I'll just leave it there. All right. Thank you. Senator Alberson, come back up. That concludes the public comment section. Thank you. Part of the committee. You're going to close the silence. If you would mind very briefly, I know you're trying to concentrate. Yes sir. I appreciate everybody who talked, but I think if you read the actual bill, I think you're missing the most important language. I hate crime only happens if you've already committed another crime. There's nothing to do at chilling free speech. There's nothing to do at protest. It's combining a crime that already exists with the other things that I hate crime denotes harassing and intimidating all the other things that are there. So I appreciate everybody's comments, but please understand that's actually not what's in the bill. This is very clear. I want to thank the Lieutenant Governor and Brad Vaughn as Chief Legal Counsel, who has worked on this for many, many months together in order to come up with something we believe will actually address the issues that are happening right now to go after the bad actors. And with that, I'd ask for your favor. We'll consider it. Now you've got all kind of questions, Senator Parent. Thank you, Mr. Chairman. Thank you so much, Senator Albers. So some of the impetus for this is the hateful anti-Semitic flyering. And did you look into Florida's statute that was trying to deal with this? I know it went a different direction.\n\nthat I think personally I might be able to be more comfortable with versus the the RICO and kind of protest direction. Can you tell me why you decided not to take it that way? We actually began these discussions back in the summer. Actually we get asked for advice from Chairman Strickland obviously the Pro Temps office did an amazing job on HB30 but we work with Brad von here behind me in the Lieutenant Governor's office and asked for a lot of help from legislative counsel and water parties and we thought that this uniquely fit into Georgia law but I think it actually does a lot of the things the Florida law does say because we did use that as an example and inciting different things that we were looking at. Thank you I can talk to you about this offline I'm just at the current time concerned about the Botswai State decision that where political bias in the 20 years ago version of the hate crime law that was passed by the General Assembly then was struck down for vagueness so we can talk about a more offline now. Thank you. Senator Satsler? Yes, to the author I just was doing some I'd ask the clarifying question earlier to my friend you know it's been said that we campaign in verse and we govern in prose you know we talk about ideas and understand I agree with you the the the the inspiration of trying to address this issue of virulent and asymptism and racial hate I'm just as we seek to govern in prose here and looking at this I mean is it your intention that two more acts of these designated misdemeanors can represent a Rico prosecution. I'm gonna ask Brad to come up and join me here our official counsel for the Lieutenant Governor's Office to make sure I don't say anything out of turn as the chairman always reminds me I'm still a night school lawyer want to be. And I may just thank you all very much I'm Brad von from Lieutenant Governor Jones's office it's a pleasure to see you all sitting on this side of the table for the first time I used to sit on the other side. Welcome to the committee. Yes sir thank you for having me and to Senator your specific question about that the specific impetus for including Rico as a sort of if you want to call it a fallback for this is particularly geared toward any evidence that this was sort of an organized effort. There's a lot of evidence of various hate groups targeting Jewish communities we suspect that when that happens there is substantial types of resources types of organization that go into those efforts and a Rico offenses a prime way to address any type of an organized effort against any particular community lecture. So that's that's why that was included. And I get the inspiration you've got some creeps throughout there doing the doing the bad actions and then maybe organized by a larger organization you're trying to an essence get to this larger anti-semitic organization that may may have some uninform creeps out there doing the doing the dirty work for my I get that I think that's a I'm not convinced that's a bad intent but I'm just just saying the intention is that two or more actions commit soliciting you know asking someone to do it coercing them or in this case committing two or more because I think what once the amendment would come it would be two or more actions felony or designated misdemeanor and our list of designated misdemeanors are and we add in littering in place from the poster signs advertisements 16 5 I'm sorry 16 7 58 you know as part of what our challenges of committee is to do is understand the intent try to help accomplish the intent but also kind of explore what I call the boundary conditions to make sure that the there aren't some parts of the fact pattern that are pretty small and pretty minimal that maybe not be your intention but the effect of the way the bill's structure would have that effect would I read and I don't think I'm wrong please tell me if I am is that two or more again placement of signs posters that's leveraged against somebody for a political affiliation of beliefs so you know the it is perhaps not true in every community but from time to time in Cobb County people in a political campaign or whether it's a grassroots effort to oppose a tax referendum whether it's an actual campaign activity to support me oppose me others you know the placement of signs on public property I mean this 16 7 58 subsection a paragraph one public property without without you know it permission and then subsection C says each poster center advertisement placement of violation this code section shall constitute a separate offense so the placement of signs technically the placement of two signs stuck on public right always in some effort under the way it's structured now is a rico offense and I know that it seems like an absurdity to talk about it but that is exactly how I see the structure that's one of the sure we're we're managing those border conditions because again if someone's opposing something politically for their beliefs or their their their political stance two or more signs this this posturing statute that's that that's invoked in this I just want to make sure we can craft this in a way that we're not creating literally a rico prosecution against people who are out posturing or putting placards on on you know telephone polls that's and I mean so my concerns that's what it does is that your attention no sir let me in Mr. Chairman if you don't mind the response so two things about sort of the discussion that we're having here the idea here is to go after things that are already themselves crimes and I can emphasize that point enough based on the other testimony that we've heard about this and frankly the broader testimony around HP 30 earlier in the day nothing that was added to this bill on the list of designated misdemeanors is something that is not already itself a crime great I think we all can agree on that at least I hope that we can all agree on that so that's a key point to emphasize about this the second piece that I think is most important on this is really getting back to the heart of what a hate crime is and that's why our office in conjunction with Senator Alvers the other co-sponsors of the bill thought this was a particularly important vehicle for addressing any cynicism in our communities around the state a hate crime is fundamentally targeted at intimidation it's not necessarily that the individual crime that occurred is itself terribly terribly bad putting a poster up threatening it's not necessarily bad it's intent though is to have a broader effect not just on the specific victim of that crime but on a broader community and that I think is the really important piece of all of this is that if you're doing the things that you just described the things that constitute a crime already under Georgia law and the offenses that we've added here to make it a hate crime it has to be something that is targeted at threatening or intimidating and identifiable group of people based on the characteristics that are set for than the hate crimes law so to your point specifically if that is these two signs are placed and there is evidence that can be shown that can tie those things into a broader effort to identify the threaten to course some group of people then yes or those are hate crimes that would be punishable under this if it's a pattern of racketeering activity then yes or it would be punishable under the RICO Act I say that unequivocally for people's political affiliation or beliefs for people's political affiliation belief national origin race religion any of the other identifiable characteristics that are put forward in the bill because because one can certainly understand you know the civil rights act of 1964 the four corporate protected classes that starts to make more sense you're putting signs and placards because of someone's race national origin you know so and so get out that those those kinds of things when you talk about political orientation or affiliation or beliefs I just you know if the placarding political beliefs and RICO the the the coming together of those three creates something that is not incremental but to me as a fundamental difference and I don't think it's what you want but we're just sure that one thing that's pointed out to me to give credit or credits do you when you're saying one or more acts it's actually about being part of an enterprise it could be it could be one act if you're part of a bigger enterprise not so much the two leaflets for example as you gave here when you look at RICO it's really about showing that you actually have the pattern of racketeering activity itself with with you with others the other thing I want to point out it's been mentioned a little but I remember we worked on the hate crime law we saw different versions of how that law is going to work and what we have in Georgia Craig from wrong you still have to be convicted of a crime as we've seen here even if the crime is littering on line 45 you got to be convicted beyond reasonable doubt of that crime you have a right to a jury trial with that offense for all these offenses so a jury has to find a guilty there and then there'd be another trial and I believe it's the same jury if I'm correct on process gets a nods kind of competitive damages some of the civil case that jury then goes and hears the question of whether or not that defendant intentionally selected that victim or group of victims and committed the offense against them because of their actual perceived race color religion national origin sex sexual orientation gender political affiliations our beliefs which we added mental disability physical disability and so what you're saying here is you we're not creating a new offenses but a jury would be able to consider after someone's been convicted of one of these crimes already a crime whether they did this to intimidate certain people based on who they are or what they believe is that is that a clear way of putting what you laws do exactly how is it going to say it if you gave me another yeah yeah not a nurse came through and not saying it exactly that way no that's the key and I think that's an important thing to re-emphasize about this nothing in the bill changes or creates any offense nor does it change the elements of any of those underlying crimes so I mean that's really the purpose of some of the language that you'll see kind of on the back half of the bill it's not changing anything about a standard of proof not changing any of the elements of the underlying crime a prosecution is still going to have to proceed through to develop the case with whatever elements there are those already exist in Georgia law for each of those offenses yes mr chairman all right you have more senator that's your life is still I was just going to clarify you know the idea it requires a group in an enterprise you know my very quick my son walked up on what would in 2018 have been a criminal enterprise he was working at Chick-fil-A he was cleaning tables fill refilling drinks they can help you can get this meanwhile as he was refilling drinks there was a there was a desktop about eight people and they were sitting around having to discussion how much money are we going after raised this year to defeat representative sets from the general election was the Calc any Democrats meeting at the Chick-fil-A my son was working at as he was filling refilling their drinks and serving them they were they were plotting my political demise clearly in order they were spending money and lots of sons and placards were put around my district to defeat me no I don't think that's a rico enterprise even though they're not my friends politically their constituents perhaps and I just share that it's it's it's it provides levity sure but we do need to be mindful these words do have meaning and it's you know that's we should not have a group of middle-aged you know party activists trying to organize a campaign and splatter sons around Cobb County get caught up in this and I think it's important looking at 74 through 79 you're right we've started the law anyway the United States Constitution the First Amendment freedom of speech freedom obviously to go and work in a campaign or against particular candidates and I'm glad that we're adding that in here to state again that jury would have to look at that and hopefully in that case I think hopefully it would never go to trial where judge will dismiss it if someone is truly excise in her First Amendment rights not just trying to terminate someone putting a hundred sons in a right of way to defeat me in a campaign should not be a rico prosecution agree even though they're not looking after me I agree all right anything further from the committee all right what's the pleasure of the committee leader Gooch and glad you can today nobody else wants to talk I just love this committee you got to go back I'd like to make another motion motion to do pass in it bill 359 LC number 491584 with the amendments that were pre so we will let's see if we can second your amendment pass we have a second second by Senator County now we do have some amendments that were brought up I'm going to start with the ones that came from Ledge Council and see if someone wants to offer this first one which would be to amend lines 31 and 32 by striking chargeable buying indictment with someone like to offer that amendment so moved by Senator Gooch is there a second second by Senator Kennedy all those in favor please raise your hand the amendment is unanimous the Senator Hodges they with us now the next one I have is let's see line 33 replacing b1a or b1b with b2a or b2b I think I could say it it's late we have motion from Senator Gooch a second by Senator Kennedy all those in favor raise your hand it appears being an animus again I don't have the notes for the other amendments are we have a line 30 change one to two we have a second have a second by Senator Hatchett all those in favor raise your hand it is unanimous with their others thank you for sharing any other amendments from the committee are we have motion do pass Senate bill 359 LC 491584 now as amended all those in favor of the motion please raise your hand we have five four all those against we have three against the motion carries thank you miss chairman I appreciate it thank you with that we are adjourned",
  "updated_at": "2026-02-13T16:07:03.270342+00:00"
}