{
  "video_id": "3A5sKzNIlls",
  "url": "https://youtu.be/3A5sKzNIlls",
  "title": "Georgia House - Day 25 (2026-03-01)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": "2026-03-01",
  "duration_minutes": 183,
  "summary": "Overview: The Georgia House session on 2026-03-01 focused on the contentious House Bill 531, which proposed various changes to the state's election laws, including restrictions on private funding for elections and changes to absentee voting procedures.\n\nKey Actions:\n**HB 531**: Proposed revisions to Georgia's election laws, including changes to absentee voting, in-person voting, and the roles of election officials.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- The House Speaker cautioned that the debate on HB 531 should be conducted in a \"civil and respectful fashion\" and that the chamber is a \"legislative body, not a political rally.\"\n- The Chairman of the Special Committee on Election Integrity presented HB 531, stating it was designed to \"begin to bring back the confidence of our voters back into our election system.\"\n- Extensive debate occurred on the bill, with the Speaker warning that he would be \"fairly strict on parliamentary inquiries\" to prevent the debate from being extended.\n\nVotes:\nNo recorded votes were taken on HB 531 during this session.\n\nAttendance:\nThe House was in session and a quorum was present.\n\nAdjournment:\nThe session was adjourned. The next session date was not specified.",
  "transcript": "you you you you you you you you you you you you you this house will come back to order the house will come back to order you you you you you you you you you you you the house will come back to order all members will report to their assigned seats the court will read a the capture for a group of showed a group of showed a group of women ,aduring the lives and e ng After a topping p of Charles Alexander, honoring the life of memory of Bishop Dr. LD Skinner Senior. Recognizing commanding Stephanie Cho, recognizing commanding Alicia Yahoo, recognizing and commanding the contributions of the Asian Americans advancing justice in Atlanta and Georgia on its 10th annual Asian American advocacy day and for other purposes that completes the reading of the Privilege Resolution. Is there objection to the adoption of the Privilege Resolutions? The chair here is none and the resolutions are adopted. The clerk will read the caption. We're back on the rules calendar. Going back to the rules calendar, the clerk will read the caption to House Bill 531. House Bill 531, I'm repositing him. Flaming him 121st, and others being titled, NACTO MEND, Chapter 2, a total 21 of the Fisher go to Georgia, annotated, relating elections in primary, generally, so it's to provide that no election, superintendents or boards or registrars shall accept private funding. This bill ever been referred to the Special Committee on Election Integrity. That committee recommends that this bill do pass by committee substitute. The chair is aware that a lot of people have strong feelings about this measure. And I fully expect, in the tradition of this House, we will have spirited debate. We have extended the time for debate so that we can hear from as many people who want to address the issue as possible. But I also want to caution people on both sides of the issue that I fully expect that the rules of the House will be complied with in all respects during this debate and during the consideration of this measure. This chamber is not a political rally, but one side or the other. It is a legislative body, and will conduct itself in that fashion. And in a lot of the fact that we have extended and lengthened the debate period, then I will be fairly strict on parliamentary inquiries at the end, the rules of the House, for example, prevent parliamentary inquiries from extending the debate. So I don't expect to extend the debate to a lot of parliamentary inquiries today, but we will go through this in a civil and respectful fashion. Chair recognizes the Committee, special committee, on election integrity, chair, chairman Fleming, to present the bill. Thank you, Ms. Speaker. Ladies and gentlemen of the House. Ms. Speaker, House Bill 531 is designed to begin to bring back the confidence of our voters back into our election system. A main component of that effort is by enacting several revisions which will make the administration of elections easier by our local election officials. The bill addresses several different areas of elections, absentee voting, improvements to in-person voting. It addresses the testing of voting equipment and prepares for better auditing of election results. It improves aspects of the timing of our election process, and it addresses the roles of and the actions of election officials. Regarding absentee voting, the bill replaces the controversial signature matching with drivers licenses and other types of identification for absentee voting. The bill makes clear what is and what is not an official absentee ballot application, including disclaimers of this is not a ballot for our voters who received, as you know, multiple absentee ballots during the last series of elections. Many legislator and citizen has come to me and said, you know, somebody I know received seven absentee ballots. Well, you and I both have learned that the chances are that that is not what happened, but they did receive probably seven absentee ballot applications. So one of the common sense measures in the bill is to make sure that number one, whenever an absentee ballot is sent out, it is the official and correct form, not prefilled out, which caused a lot of problems with improper information coming back to our board of elections, but also that it clearly disclaims that it is not a ballot, but an absentee application. Regarding absentee voting, we also set the start and end dates for absentee ballot applications. We had testimony from election directors in our committee that under Georgia's current law of being able to apply for an absentee ballot the Friday before the Tuesday election, I think she held up this number right here and said you had about that much chance on it getting out to you and getting back in time so your vote could count. So we move that one more Friday back in order to make sure that our law reflects the fact if you want to apply for an absentee ballot, you have a reasonable deadline in which to do it so you can get your ballot back in time. The bill also addresses the idea of early scanning of absentee ballots, not tabulating, not counting, but processing them and scanning them. We all saw the pictures of in the wee hours of the morning ballots being counted and that does not contribute to confidence on anybody's part. Your mother told you when you were a teenager that pretty much nothing good happens after midnight and our goal in this bill is to make sure that Georgia's election results get back quickly and accurately. In the area of improvements to in-person voting, we allow poll workers in this bill for the first time to be from a joining counties. The COVID pandemic taught us a lot of things about elections, many of which changes are reflected in this bill, but at times it was very difficult for persons to find enough persons to man the polls. Particularly in highly populated areas, you may live in one county, you may work in another. So what this bill says is that if you live in a joining county, you can also be a poll worker there. The best example is someone who lives in one county and goes to church in another. This bill makes that possible. The bill also requires election directors to give reports on wait times and changing plans for precincts if the wait times are more than an hour during general elections. This can be accomplished by splitting a precinct or bringing in more poll workers or bringing in more voting equipment. This bill also ensures the location of voting precincts are set prior to the election, not here or there or moving around somewhere else. The bill sets more uniform voting times for advanced voting across the strict state and attempts to bring more uniformity to our state and less confusion. Two people work together. One of them says I'm voting tomorrow and the other one says no you're not. Voting isn't until Monday. Well they have a discussion and at least to confusion. More uniform voting times across the state makes sense for less confusion. This bill also prohibits the moving of advanced voting locations within 14 days of the election. We already have deadlines inside our elections code that prevent the moving of day of precincts. But for the first time we adopt a guideline when you will no longer be able to move in advance voting precinct. We saw that happen in one of our counties in Georgia and it also caused confusion so much that the someone had to be posted at this place that had been used for advanced voting for the longest time and actually tell people it was no longer in use. The bill protects the sanctity of the voting area by prohibiting offering anything of value within the traditional 150 feet of the polling place. What you do outside that 150 feet can be campaigning or any other kind of interaction that is proper. But we have always had rules and once you get inside 150 feet of the polling place that's where you back away and you allow the voters to do their business. The bill also encourages in precinct voting. There is a rising problem in our state. If you look at the 2016 election the numbers were only in 100 or so of people who voted out of precinct. If you look at our last election those numbers are in the thousands in rising. Why is that not good? Because if you do not vote in your precinct you will be disenfranchised from voting for many down ballot races. We should encourage voters to vote in their precinct so all their votes and all the races will be counted. Now addressing the testing of our voting equipment and preparation for better oversight and auditing of elections in the future. This bill is probably the beginning of several measures that we will consider over the next few years to try to improve our voting system. Ever since I've been down here in the legislature and every other year there's a voting bill trying to make adjustments and make it better for Georgian's to vote. One of the things that we are doing in this bill is requiring clear public notice for testing of the voting machines prior to elections. And it also requires that the public be allowed to see that happening. This also in the measure before you we return to the timeline for certification of votes by the Monday following the Tuesday election. Now why is that important? One thing that we have learned in this past election that the audit process that we began two years ago in House Bill 316 was very important in this election process and will be very important moving forward. And we have learned that we need to have that certification date at the same time it was for many years the Monday after the Tuesday election so to allow for time for the proper auditing of the ballots. This bill also requires for a new security paper upon which official ballots will be printed. This security paper is somewhat of a new thing whereby the scanners will tell if this is a proper ballot when it goes through. It if not the election worker will be notified. It makes sure and give confidence to our voters that only proper ballots are being used in our elections. For the first time this bill begins to require training for our poll workers in Georgia. Why is that important? Because poll workers workers like any other profession or any other job they need to have some background and experience. We have several who have been doing it for a long time but there are several new poll workers and watchers being brought into the process and good training is a good step in that direction. This bill also creates a bipartisan ballot duplication panel process for any ballots that need to be duplicated. One of the problems with provisional ballots is that they cannot be scanned through the system. They actually have to be transferred from the provisional ballot to another ballot. As many of you probably saw that was a picture that caused a lot of questions of why is that being done. Well we have now provided in this bill that panel much like the adjudication panels that have to decide if a torn ballot can be scanned or how it needs to be reproduced. We now have a bipartisan panel to deal with that process. Regarding the improvements in the timing of our election process, this bill shortens runoffs back to a four week period in Georgia voting by using a partial ranked choice voting system for overseas voters which is used by several of our other southern states that have runoffs. As you are aware, nine weeks runoffs seem to go on for quite some time. We used to accomplish them quite well in Georgia when we used four weeks and this bill brings us back to that. One person in the committee referred this section of the bill as should be named give us our Christmas back. How many of us enjoyed over Christmas seeing election ad after election ad after election ad? That scenario would be avoided by going back to a four week period. This bill also begins to eliminate what has been referred to as jungle primaries in Georgia. Unfortunately when you have 20 people on a ballot like we saw this November, I have heard accounts of people's ballots having to be not counted for that race because they voted for two or three people. We all knew that we had two US senators we could vote for, right? Well, so you could vote for two out of the 20, right? You see how the confusion can begin. So for the first time we began to limit those jungle primaries, so-called jungle primaries in this bill. The bill also addresses the roles and the actions of election officials. It allows for the first time the general assembly of this state to elect the chairman of the state elections board. As you know, like many bodies, the state election board has some rulemaking authority. It is a quasi legislative body. This bill separates that legislative function from the officer who will be required to carry out the executive function of making sure that those laws and those rules are followed. The bill also requires significant and appropriate and timely notice of the legislature of any emergency rules that are adopted by the state elections board prior to an election before they are enacted. And it also says that they have to strictly follow the Georgia code. The bill further provides for that public elections should be funded by public dollars. The bill also ensures the availability for sufficient early voting locations for providing for the first time the ability of superintendents of boards of elections to use government buildings. When reasonable for early voting, that is already the law for day of voting precincts, but as early voting becomes a larger part of our elections, this will assist in that area. The speaker that is a overview of House Bill 531, a bill designed to address and help with the ease of administration of our elections by our election officials and to begin an effort to restore confidence in our election system by the voters of the state of Georgia. I expect several more speakers will follow me to discuss different aspects of the bill, but I will pause at this time and would be happy to try to answer any questions any of the members of the House may have. Do you yield for questions? Yes, Mr. Speaker. Chair recognizes representative Hugley to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Absolutely. Mr. Fleming, my election isn't true that my election supervisor is quite concerned about the fact that we are no longer allowing grants to help them with their election efforts because it was so valuable to them in this past election. So what shall I tell her? They can still get grants. Would you further yield? Certainly. She also is concerned in the truth about the outer precinct ballots, particularly for those people who are not close to their precinct but need to vote in its 6.45 in the evening. And she says that it's important for them to be able to accommodate that vote of what shall I tell her on that. You can talk to her about the fact that I suspect she is also concerned the fact that out of precinct voting disenfranchises Georgia voters on down ballot races. If you're not voting in your precinct, your vote very likely does not count for county commissioner or possibly state representative. So that is the intent of that process is to get people back to their precincts where they should vote so that their votes will count up and down the ballot. And she will be aware of that. So one final thing. So are you saying that it's still in this provision that if they're out of precinct, those votes will not count on any level. Is that true? You can demand a provisional ballot anytime you want in Georgia and vote. But you need to be voting in your precinct for your votes to count. What we have seen is that maybe in 2016 where you had a couple of hundred people voting out of precinct for some reason that is now rising into the thousands. And there are now tens of thousands of races and votes that are not being counted because of that. This bill assures that those Georgia voters votes will count if they vote in the right precinct. Would you further you for one last question? Yes ma'am. To her final concern, isn't it true that election directors are concerned about flexibility in setting the voting times because they know better what works for their communities? And this bill does allow for flexibility in setting the voting times. So I think she would be the police of that. Chair recognizes representative Stacy Evans up in the gallery to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, Councillor, I do. Thank you. I heard you say that part of the reason for this is that we can start restoring confidence in our voting system. And I think everybody in this room would have that as a goal. Because you explained to me why in 2018 when a lot of voters on the left side of the aisle expressed concern about confidence, we came here and did nothing. This year we came here and did something. Can you tell me why the difference? Well, I think we did do something after the 18 election we passed a voting bill to try to improve voting in Georgia and I think you voted in that vote. Does the gentleman further yield? Of course. I wish I had been with you here in 2018 but I was not so I did not vote on that. But my question, my further question is where does it end? One side loses. We don't have confidence. The other side loses. We don't have confidence. This ball goes back and forth all day. Do we not do better, my friend, my fellow Councillor, to talk about the facts and use that as the way that we restore confidence in our voting system? First of all, I apologize. I thought that you were here for that 18 vote. You may have already stepped down to run the program. You just saw me so much on TV. That's probably what it was. And you look good, by the way. Thank you. The way we begin to restore confidence in our voting system is by passing this bill. As I have outlined, there are many common sense measures here to begin that process. And as I stated also previously, yes, we do probably every couple of years have some sort of voting bill in this house. Voting changes over time, the kind of equipment that we use changes. The pandemic that we have every 100 years probably also changes our elections and a lot of what you see in this bill reflects that. So the only thing I can probably guarantee you is it probably a couple of years from now. If you and I are still here, the voters allow us to. You and I again probably will be debating a voting bill because just like many parts of the code, it occasionally needs to be updated and that's what this bill does. With the gentleman yield for one final question. Yes, ma'am. Could I get a commitment from you and I certainly will give my commitment to you that when one of us are on the opposite side of an election outcome, that is, it came out the way we didn't want it. That we would work together just as hard on restoring confidence as you are when you're on the wrong side. Is the only reason I'm standing in this well. Thank you. Chair recognizes representative dukes in room 341 for a question. Thank you, Mr. Speaker. With the gentleman you. Yes, sir. Councillor, you're asking for ban lying warned. Could you explain to me what was that until? I heard the first part of the question. Could you repeat the last, sir? Yes, it's a lion war me. Yes. That we're requesting. What is exactly what is that? So we have had for the longest time in our election code that once you get within 150 feet of the precinct, there is no one allowed there except the people in line to vote. It used to be the problem was with campaigning. Now there are people following voters up to the precinct door in some instances. And all we were doing is restoring that area for voters only. So with the gentleman further yield. Yes, sir. Because the way it has been pretty much explained is that if you are in line because we had this issue in Dardi County, where that people were in line and other people brought them water. And it was deemed as if this was a violation of some law or something. Would this bill allow me to bring a resident of Dardi County who standing in line in a hundred degree heat during our primary election? Allow someone to bring a person a bottle of water. Yes, it absolutely would, but you would need to do that before you get into the 150 foot range where people aren't allowed to be unless they're there to vote. Thank you. Yes, sir. Chair recognizes representative Paris up in the gallery.\n\nYou're right for a question. Thank you, Mr. Speaker. Will the gentleman kneel? Yes, ma'am. Okay, so looking at Section 17 and the emergency provision in this bill, is it not true that the emergency provisions here are so strict that they would prevent someone who is very sick, but maybe not in the hospital yet, from accessing an absentee ballot more than a week before an election? No, ma'am. I think the purpose of that portion of the bill does have provisions for people who are in bad shape, usually in the hospital, but what it does, as it says, to Georgia voters, if you want to vote absentee, if you do not get your application in by this deadline, then your vote very likely would not be getting in time to count. As I mentioned earlier in the presentation, right now, current Georgia law says you can ask for that absentee ballot on the Friday before the Tuesday election. And as a testimony we heard in committee was, that is almost false advertising. We need to have in our law encourage people to ask for their absentee ballot in time for them to be able to vote, not encourage them to do something because the law allows it, that would actually disenfranchise them. Does it gel on for the year? Yes, ma'am. So we know that things happen beyond people's control. Unfortunately, all the time, yes. Car accidents, all kinds of things happen. All right, well, just one more thing if you will further yield. Certainly. Okay, is it not also true? Anyone who is forced to travel unexpectedly before an election will be prevented from accessing a ballot under this bill. No, ma'am, that's not true. Would you explain? They simply would not be disallowed from accessing an absentee ballot. Right now we have a deadline. It's the Friday before the Tuesday. In this bill, we will also have a deadline. It'll be two Fridays before the Tuesday. The logical reason behind that is we want to teach Georgians, encourage them, show them. Here is the proper deadline when you should choose an absentee ballot. Now, if the general lady is suggesting that things happen beyond our control, they happen all the time. It's unfortunate, but particularly in the metro area, every day I drive to the capital I hear of a car rake somewhere. Someone hopefully gets to a hospital and they're okay. There have always been and there will always be reasons why individuals are not able to vote. What we want to try to do is minimize those as much as possible. One of the reasons in current Georgia law that people are not able to vote is because we have an unrealistic deadline for requesting absentee ballots. We change that in this bill. Yes, sir. So in response to that, we should always make it as easy for citizens of Georgia to vote. I think this bill is giving us some problems with that. I disagree with the general lady, but I respect her opinion. Thank you. Thank you, Mr. Speaker. Thank you, ma'am. Chair recognizes representative Derek Jackson in the gallery. Do you're left for a question? Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir, I do. Isn't that true that we currently have many women in military uniform overseas protected and defended our democracy, but yet they are family members here at home. House bill 531 will make it impossible and or reduce and restrict their family members access to the ballot box. That only is the gentleman absolutely wrong, but his statement is somewhat misleading. This bill makes it easier to vote in Georgia and also sets reasonable deadlines to help encourage that. It also makes special provisions for overseas voters for the first time that their ballots can be getting back in a reasonable time period, particularly as it flies to runoffs. So the gentleman is completely incorrect. Does the gentleman further you? Yes, sir. Will House bill 531 make it difficult for those men and women in uniform overseas to use the absentee ballot, which I have used for over 22 years during my years of service? Representative, it would make it easier for them to use that process. Mr. Speaker, I appreciate the questions from the members of the House. I know that you have extended the debate period. There will be many more questions. I'm sure that I will return to this well and try to answer them more of them, but for that extended debate, I will now yield the well and ask for your favorable consideration when it comes time to vote. Thank you, Mr. Speaker. Gentlemen, as yielded the well, the Rules Committee has voted to set a two-hour time limit on debate to be allocated in the discretion of the chair. So I'm allocating one hour to those who oppose the bill, one hour to those who favor the bill, and then the leadership of both sides have agreed that we will not put a specific time on each speaker, but we will simply allow each side to use their time, and when we get to the end of the hour and we still have people speaking, the debate will end. So with that, the chair recognizes the dean of this House, Dean Smirie, to speak to the bill. Thank you, Mr. Speaker, and ladies and gentlemen of the House, as a member of the Special Committee on Election Integrity, appointed by the Speaker, I've had the privilege of listening to many, many people that have come from across the state. They were in person and they came virtually. While we have respectfully disagreed on the aspects and the meaning of HB531, I want to tell the chairman that I think him for his display of fairness in the committee. And as I stated to you, Mr. Chairman and to the members of the committee, on more than one occasion, I stated that voting is a precious right. Many sacrifices have been made, and many have died for the privileged vote. Rightfully so, there's a lot of debate and a lot of interest in this particular matter, because voting is precious. I remember in 1974, when I got elected, there were 80 African American legislators in America, 80. Now they're 800 in 44 states. To me, as progress speaks with volumes. But the reason we are here is because of good public policy, because of doing the right thing, because extending yourselves to others that they could get elected to office. Reps in the Williams, I know you have been involved doing the civil rights movement. I read about it, and I've congratulated you over the years about that. And there's a reason for us being where we are. So I want to say this afternoon, that there are three ways that we vote in Georgia. Early voting in person, absentee ballot by Mayo, in person voting on election day. I want to focus most of my time on early voting as presented in the Committee's substitute to House Bill 3, the House Bill 531. First of all, the Committee's substitute cuts weekend voting. Initially, the bill cut four weekend days down to one. The mandatory second Saturday of early vote. Now, the latest Committee's substitute, which we debated last week, allows one more day on the first weekend that the county must choose. In my opinion, that leads to an impossible situation for the many counties around the state of Georgia. More importantly, it takes away the ability to have uniformity in every county when an option exists. For example, if a county chooses the first Sunday, the situation will be extremely confusing for county residents with voting closed on that Saturday on the first weekend and voting closed on that Sunday on the second weekend. An avalanche of misinformation will follow regarding when voting happens on weekends. Confusion deters voting. Confusion deters voting. If the county chooses the first Saturday, then there's no Sunday voting and people will complain that the county had the option to offer one Sunday of voting and did not do so. Again, confusion deters voting, which brings about voter suppression. I truly and strongly believe that some counties will have no voting in the first weekend. Some counties will have voting on Saturday. Some will have voting on Sundays. And a lot of these circumstances, the committee, so creates more voter confusion and cuts weekend Sunday voting in Georgia. And to me, that's problematic. As I have stated publicly, this is a step in the wrong direction. I strongly believe it's time that we encourage every citizen to participate, to participate in the purist sense of citizenship. And that's voting. Lastly, the bill cuts early voting for runoffs down from three weeks to a maximum one week. This is due to the provision in the bill that forces all runoffs to be 28 days after the general. This week, oftentimes, Thanksgiving and the day after Thanksgiving, which are both state holidays, when early voting will be barred according to the committee's substitute. In closing, I have heard from many people across Georgia and across this nation. But what's more important to me than anything, I heard for the people in the 130th district, the people that sent me here to take care of their business. And they made it known to me in the known certain turn. They made it very, very infantic that House Bill 531 takes us in the wrong direction. They asked me to take a stand and I advised them that I would take a stand. And I stand today speaking on their behalf in opposition to House Bill 531. Again, I stand for democracy by voting against 531. Mr. Speaker, thank you very much and with that, I yield the will. Chair recognizes Representative Kim Alexander to speak to the bill. Thank you, Mr. Speaker. Voters suppression is a byproduct of white supremacy. The preamble of the Constitution begins with the words, we, the people. However, over the course of our nation's history, that phrase always leaves someone out. Charging the course of our nation, history, the phrase always leaves someone out. Charging posterity with perfecting the promise that was made by very flawed white men who created this American experiment. Purposely leaving out women, black people, the indigenous population and those who did not possess direct stick class, standing to possess political power. Now, Republicans in the Georgia Journal Assembly are trying to change the rules of the election here in Georgia, rules that you wrote because you were handed defeat in November the 3rd and again on January the 5th. And you know your only chance that winning future elections is to prevent eligible Georgians from casting their ballots and having their voices heard. When the counties I represent are working constantly to fight COVID-19, with increased spending on public health. It deeply concerns me that HB 531 passes down even more unfunded mandates to counties and municipalities. HB 531 will potentially add hundreds of thousands of dollars in new calls to counties all across Georgia. These unfunded mandates will cause severe financial burdens to Georgia's local governments during a pandemic that is not only impacting families, but also the working poor in every corner of our state. Let's talk about the numbers. According to a physical analysis by the Vona Rice Lab, HB 531 could cause Georgia taxpayers 52.7 million in new taxes each election cycle. Not only HB 531 levy unfunded mandates on Georgia's counties, it will also significantly hamper the ability of county boys of elections to receive grant money to cover these mandates. We know that Georgia counties relied on at least 32.9 million worth of grant money to pay poll workers ensure election security, buy equipment to ensure ballots will count it swiftly and keep polling places open. Now Georgia counties would need to ask taxpayers to cover the 32.9 million net gout and local funding created by HB 531. The 52.7 million figure includes 6.7 million in new calls to implement additional duplicative ID and personal identifying information requirements for absentee ballots. Updates to the voter registration system in order to deal with these additional duplicative ID requirements or estimated calls to Georgia taxpayers 1.3 million. This 6.7 million estimate should be considered a floor. The floor calls to counties and Georgia taxpayers to increase security for personal identifying information is yet undetermined. Without a legislative physical note, the disbody refuses to commission. Every drop box in Georgia was required to have 24 seven surveillance video that could be requested by both parties. The governor himself may use this option to cast his ballot. In addition to severely limited drop box availability, HB 531 will also force counties to secure additional security personnel to monitor each drop box. This will likely cause Georgia taxpayers over 1.1 million in unnecessary duplicative tax increases that solve no problem and only serics decreased available options to vote in Georgia. Passing on time legislation vote in legislation that Georgia Republicans themselves have called reactionary to solve a none-existing problem with ultimately income, Georgia and numerous lawsuits with the estimated price tag for Georgia taxpayers of 12 million per election cycle. With historical turnout in both the November 2020 journal election in January 2021 runoff election where there was no evidence of voter fraud confirmed by state, county and numerous federal court rulings. This is the time when my colleagues on the Republican side should be addressing issues that will allow us to spend assets to vote in not restricting it. Mr. Speaker, I yield the well and ask that you vote no on this bill. Chair recognizes representative Kausch at the speak to the bill. Thank you, Mr. Speaker. I am an immigrant. I'm a naturalized citizen. I am an American. I grew up in former West Germany. We're having the right to vote and having access to voting with never in question. Voting was never difficult, never tedious, never inaccessible. Germany's system built with American's help is based on what was learned from a history of hate, lies, alienation and suppression of parts of the population. Never again was not only a political statement but brought Germans to see voting not as only an important civic duty but as a civil right. One that every voter should be able to fulfill easily in a well-organized, convenient and efficient way. This is what I thought all elections would be like but that perception changed when I became a US citizen. Not that voting became difficult for me personally but what changed was my understanding that what I may take for granted, what may seem easy to me, may not be so for others. Long line at polling places and messy process and the realisation that when you're black or brown or poor in America, when your ancestors had to fight for slavery against slavery or Jim Crow, then voting is not something you would or could take for granted. You have to fight for it over and over again. Voting in America was and still is not done on an equal playing feed. Access to voting has been and still is being used as a political weapon. Come the election of 2020 when the challenges of a pandemic forced election officials to rethink how to provide access to the polls. Dropboxes, mobile buses, voting in giant stadiums, they went the extra mile to ensure that democracy was served and that everyone who wanted to vote could do so. And it worked because voters were able to use the choices they had to vote by mail, to vote early or to vote on election day. In effect it was so well organised, convenient and efficient that the secretary of state no brags about it and everyone of his press relievers calling it a gold standard. But it was a close election and as Republicans were disappointed in their loss, the false narrative was born and the lines between truth and fiction became more and more blurred. Months of relentless propaganda, effective and perfidious use of social media strategies fueled the rise of conspiracy series, consistently repeating lies over and over again. Until those lies were and still are perceived as truths by many. No matter how often and how many times top election officials debunked false claims of widespread voter fraud, it was too late. The narrative of a stolen election had gotten a life on its own. And as a result, this bill, House Bill 531 has nothing to do with reality. It's all about perception and that is the problem. In the tug of war between a falsely perceived lack of election integrity and the truth, the truth is losing the battle. And beyond any doubt, the proposed legislative changes would work to the advantage of those voters for whom voting is already more accessible. And this advantage shows for whom it's not, mostly Black, Brown and Pura. Voters, instead of celebrating the innovative success of the last election siding that made voting more accessible for all that got more people to the polls, Republicans want to turn the wheel backward, making access to voting more restrictive, harder and less accessible. We should be doing the opposite. If we truly believe in liberty and justice for all, as we pledge here every day to our flag, then fulfilling this promise should enable and encourage us to make voting well organized, convenient and efficient for everyone. Let's stop weaponizing the vote and vote no on House Bill 531. I yield the well. Chair recognizes representative Jasmine Clark to speak to the bill. Thank you, Mr. Speaker. Men lie, women lie, numbers don't. The numbers are clear. HB 531 is textbook voter suppression. This bill reduces, restricts and limits every single aspect of our elections, decreasing the time to apply for absentee ballots by 62% will disproportionately affect our seniors and our physically disabled voters who made up the majority of absentee voters in the last election. Restricting access to ballot drop box, 62% the number of days that it's reduced, 86% of the hours that the boxes are available, which was the preferred method of returning ballots by many voters of both parties will negatively impact those voters and hold them hostage to the less secure and less reliable USPS. Requiring drop boxes to be within advanced voting locations makes them functionally useless, limiting hours and days of early voting up to 40% will harm hundreds of thousands of voters, especially those who have to work for a living and can't be off in the middle of the day. And throwing out whole ballots because an eligible voter maybe at the wrong precinct is probably one of the most egregious provisions of them all. It literally strips voters of their right to vote in countywide, statewide and federal races for what could be something as simple as an administrative error. And make no mistake while the impressive actions of this bill will harm black and brown voters, all voters, including the ones that support your team, will be affected. As we saw in the last election, undermining absentee voting cost trump over 20,000 votes across the state. Add this to the fact that this bill is meant to placate the same crowd that believes the big lot of voter fraud and they don't trust the dominion voting machines anyway, you will find yourselves in a conundrum. This bill is cutting off your nose to spite your face. Instead of reducing, restricting and living our elections, we should be in this chamber working to make voting more accessible. A yes vote on this bill will come back to bite you. Thank you, Mr. Sibirra, you're the will. Chair recognizes the representative Shannon to speak to the bill. Thank you, Mr. Speaker. And I quote, so here you know, the process keeps going up and up and so a multitude of reasons why vote by mail in my view is not acceptable. The president said it best and this will be extremely devastating to Republicans and conservatives in Georgia. In quote, that's from the representative from Blue Ridge and his statement is exactly why House Bill 531 even exists. 43 states are considering roughly 253 bills that would raise barriers to voting. Georgia has been passing voter suppression bills year after year, but now across the country, Republicans are well coordinated and aggressively moving to pass voter suppression bills. House Bill 531 creates new felonies, severely reduces Sunday voting, which has been a cultural staple in the form of souls to the polls for the black community. This bill usurps local control and dictates the counties exactly how they must run their own elections. But worst of all, it decimates the convenience currently built into at sentee voting and early voting. Black and brown workers are vastly overrepresented in hourly jobs that do not allow for schedule flexibility. Vote by mail, weekend voting, and extended voting hours gives workers the ability to be able to work when you have to work and vote on your own when your schedule permits. That is essential in order for black and brown and low income workers to be heard in our democracy in the fullest way. Republicans know this and that's exactly why they are attacking absentee voting. It's been said that these changes are needed because confidence in our elections was damaged after the November election, but my question is damaged by who or damaged who. There were simply not all of these questions about the integrity, about voting by mail when it was mostly Republicans largely white seniors using this method. But now that black and brown voters have used vote to mail to show up in ways like they never had before, now there are questions about the integrity of vote by mail. It's pathetically obvious to anyone paying attention that when Trump lost the November election and Georgia flipped control of the U.S. Senate to Democrats shortly after, Republicans got the message that they were in a political death spiral. And now they are doing anything they can to silence the voices of black and brown voters specifically because they largely powered these wins. Republicans, we saw you elect Trump to the presidency of the United States. Then you ran him for reelection and then when he lost, you spent months trying to invalidate the votes from places where mostly black and brown voters showed up and showed out against your candidate. House Bill 531 is just another attempt to silence these voters, maintain minority rule and that's just not democracy. So in closing, we see your white supremacy, we will never get tired of fighting it and most importantly, we will defeat it. I you the well. Chair recognizes representative Roberts to speak to the bill. Thank you, Mr. Speaker. So I'm new and I don't know a lot of y'all, but I know that many of us are parents in this chamber and I'm sure we've all got certain lessons that we like to teach our kids to build their character. I've got two that I have beaten into my daughter's heads and she was little. One, tell the truth. Two, own your stuff. Take responsibility. Well, the truth is that in November in\n\nJanuary, we saw unprecedented record-banking civic engagement in Georgia during a global pandemic, no less. The truth is that the world put us under a microscope and watched as we counted, audited by hand, all 5 million votes, and then recounted again, the truth is our Republican Secretary of State, investigated hundreds of claims and repeatedly confirmed there was no evidence of widespread fraud. But despite these truths, conspiracy theories spread like wildfire, dead people voting, stuffing absentee ballot boxes, members of our own state senate swapping votes in another state, many in this chamber perpetuated and inflated this misinformation and disinformation highway. And now, instead of owning your stuff, despite any actual evidence, you want to make voting more difficult because our elections are perceived to be insecure. The truth is, and the law is, that having no real justification for these restrictions violates every Georgia citizen's right, constitutional right to vote, even your voters. And frankly, it's just plain wrong. The irony is that many provisions in this bill actually make our elections less secure. For example, driving voters to the US post office boxes. Last I checked, those aren't monitored by 24 hour video surveillance. Drop boxes were. And somehow the driver's license has become the ultimate answer to voter verification. People can illegally buy lists of driver's license numbers, but they don't know how I sign my driver's license. That is unique to me and why almost every state in this country matches signatures. The truth is, if security and transparency were the real goals of HB531, it would provide for hand-marked paper ballots, extensive post election audits, and public oversight of this process. Instead, this bill attacks every form of voting and to add insult to injury, counties, and ultimately, our taxpayers are going to bear the financial burden of this unjustified overhaul of our election procedures just like when this body passed HB316. And again, with no fiscal note, when we know just litigation alone is going to cost millions. If you vote yesterday, you all need to be ready to own your stuff. Because when Georgia again makes national news for its long lines in voter suppression, everyone's going to know the truth. You passed HB531 because you fear you can't win otherwise. I leave you with this question. We are all sitting in our seats in this chamber. Were your elections insecure? Should voters question whether you should be sitting here? Mr. Speaker, I yield the will. Chair recognizes Representative Roger Bruce to speak to the bill. Thank you, Mr. Speaker. I was searching for words that best express what I'm feeling at the moment. But I could not find any words better than the words of Dr. Martin Luther King, Jr. Our ultimate measure of a man is not where he stands in moments of comfort and convenience. But from where he stands in times of challenge and controversy. This vote, if you approve, will take Georgia back 70 to 80 years in time. Back to the time that many of us have fought for and many have died to put behind us. Your place in history will be sealed by how you vote today. Will you be remembered for suppressing the vote? Or will you be remembered for opposing legislation that deprived citizens of a fundamental right? This bill is predicated on the premise that you are correcting fraudulent voter policy and procedure. What problem are we really trying to correct? There was no evidence of fraud. But if that is your position, that it was fraudulent. Even that Republicans occupy all statewide positions except the US Senate and still maintain the majority in the House and Senate, are you telling me that you are correcting those errors and that you are passing this bill so that that never happens again? Is the speaker a you the where? Chair recognizes representative Park to speak to the bill. Thank you, Mr. Speaker. I rise to oppose House Bill 531 and urge each of you to vote no. This legislation is an attack against the foundation of American democracy, which is the right to vote by placing undue burdens on the ability of Georgians to vote by making it harder for citizens to participate in our democracy. This bill strikes at the heart of our constitution of we the people and our ability to ensure our government is of the people, by the people and for the people. Or in America emanates from the people through our vote. That is why the vote is precious. It safeguards our freedoms and rights. It provides us the freedom to govern ourselves and determine our shared future. Countless patriots have fought and died to protect, preserve and expand the right to vote of every American citizen. In honor of their service and sacrifice, we the people will continue to fight against this latest attack against our fundamental right to vote. These attacks on the people's right to vote are not new. We've seen this before. The right to vote was denied to many, but the story of this country, the story of America is one of progress, of overcoming suppression and oppression and expanding the franchise, and the freedom to vote for all who call this country home. That is what makes this country great. That is what has allowed America to serve as a model of democracy and as leader of the free world. By attacking the rights of your own citizens to vote, by limiting their access and imposing barriers that hinder their ability to participate in our democracy based on a lie that led to an insurrection. Not only do you undermine the foundation of our country, you weaken our standing and credibility to advocate for democracy and freedom around the world. In the face of unprecedented challenges and uncertainty, you see ground to the rise of authoritarianism at home and abroad. As an American, I urge you to stand and fight for our democracy and our right to vote. Do not repeat the mistakes of our past. Stand on the right side of history and vote no to House Bill 531. Thank you, Mr. Speaker. I yield the well. Chair, I recognize this representative McLeod to speak to the bill. Thank you, Mr. Speaker. Today I rise in opposition to HB531 because it was predicated on a big fat lie by the former twice impeached president who insisted that there was fraud in the 2020 election simply because he lost. What's worst is that my Republican colleagues don't have the guts to tell the cult like followers to truth that Joe Biden and Kamala Harris were fairly elected president and vice president of these United States. After three recounts, a GBI audit, countless challenge challenges, and confirmation from the Republican secular state that there was no widespread fraud which directly rejected these claims. This delusion created the hashtag, Stop the Steel in which Georgia legislators were harassed and threatened. It is also resulted in sedition and insurrection at the U.S. Capitol while I'm here to declare hashtag, Stop the Lies. In 2012, I became a citizen of this country for $680 that I paid. While reading the Constitution, these points stood out to me. The Constitution is the supreme law of this country and that no one is above the law. Second, the first three words of the Constitution, We the People underscores what makes us a republic and who is required to execute representative democracy. Number three, there are 27 amendments to the Constitution. Four amendments addresses the right to vote. The 15th Amendment gave former male slaves the right to vote. The 17th Amendment addresses the popular vote. The 19th Amendment gave women the right to vote and the 26th Amendment gave the 18-year-olds the right to vote. Suppress and the vote proves one thing that my Republican colleagues are fearful. They are afraid of change. They are afraid they lack ideas and the policies to persuade the vast majority of people that might not look like them to vote for them. The greatest failure of this bill is it shows a disregard for our shared humanity because you believe you have to take something from me in order to show you have power. That's a sure sign of weakness. Making a decision on fear and lies is not a winning combination. It gives temporary satisfaction. If the desire to hold onto power is more important than forming a more perfect union, then you will vote for this bill. I would personally one day like to live in a country where we have fulfilled the pledge of one nation under God indivisible with liberty and justice for all. Mr. Speaker, I yield the well. Chair recognizes representative Wolenski to speak to the bill. Mr. Speaker, a vote is a statement of value. A vote is a statement of existence. Dean Smirie always says when we are talking about us being lifted up that if there is a turtle on a fence post that that turtle didn't get up there by itself, that we must always remember who lifted us up. I'll add to that and say that if you walk by that same fence post and that fence post has been cut down and there is a turtle standing next to it, we know that the turtle didn't cut the fence post down himself. We must remember who is trying to cut the voices, chop down the existence of those who are in a place where their voices cannot be heard. We have seen the spread of misinformation continue to stoke fears of our election results despite clear disproving all those theories through multiple recounts. This bill is an attack on voting rights and will disproportionately impact black and brown Georgians trying to cast a ballot. One thing I want to make clear, this bill does not make voting more secure. It only makes voting more difficult. It does not make voting more secure. It only makes voting more difficult. Does removing multiple weekends of weekend voting make our elections more secure? Does shortening early voting make our elections more secure? That was early voting in runoffs. Does it validate provisional ballots make our elections more secure? The answer is no. The other thing I will touch on is voting on the weekends limited to one Saturday and one other day. It has been said that the reason for this bill is uniformity and it can be quite confusing when multiple counties side by side have different Saturday or different Sunday of voting. That is not uniformity. I will add to that that changing the weekend voting hurts small businesses in Georgia. We have business workers and owners in our state who work hard weekend and week out and taking away these weekend voting only hurts small businesses. Also if a county chooses Saturday voting, there will be two days of Saturday voting and this will be extremely painful to religious Jewish voters in Georgia. Saturday is our day of rest and most religious Jewish people cannot do many things on Saturday including voting. This would cause religious Jewish people not to have the ability to vote on weekends at all. Another thing this bill does is on election day it invalidates provisional ballots. If a voter makes a mistake of their polling place, perhaps from the year past, or if there is an on a mistake, are they not getting a precinct card? Are their polling place may have changed from the year before? Why would we throw out these eligible voter ballots? This bill does not make voting more secure, it only makes voting more difficult. A vote is a statement of value, a vote is a statement of existence and since this bill does not secure the voting process, I've been sent here by House District 79 to stand up and ask you to vote no because a yes vote is telling many in our state that they have no value and no existence. This bill will not make our elections more secure, it will not restore confidence, it will lead to confusion, it will hurt small businesses and voters in Georgia and speaker I yield the well. Chair recognizes representative Bennett to speak to the bill. Thank you so much Mr. Speaker. Sorry. To my colleagues, I stand in opposition to House Bill 531. I can't help but ask once again why this and why now. My colleagues have also eloquently spoken as to all of the reasons to oppose this bill. It deserves disadvantages and disenfranchises a great group, a number of the electorate in the state of Georgia. And so as to not repeat the reasons that have already been given, I am going to repeat a great Georgia native son. In 1968, I quote, we are going to win our freedom because both the sacred heritage of our nation and the eternal will of the almighty God I embodied in our echoing demands. So however difficult it is doing this period, however difficult it is to continue to live with the agony and the continued existence of racism however difficult it is to live amidst the constant hurt, the constant insult and the constant disrespect. I can still sing we shall overcome. We shall overcome because the arc of the moral universe is long but it bends toward justice. We shall overcome Carlisle's right no lie can live forever. We shall overcome because William Cullen Bryant is right truth. Crush to the earth shall rise again. We shall overcome because James Russell Lowell is right truth forever on the scaffold wrong forever on the throne. Yet we shall you shall reap what you sow. With this faith we will be able to hue out the mountain of despair, a stone of hope. With this faith we will be able to transform the jangling discourse of our nation into a beautiful symphony of brother and sisterhood. And with this faith we will be able to speed up the day when all God's children shall pronounce free at last, free at last, Georgia. We shall be free at last. Thank you Mr. Speaker and I do yield the well. Chair recognizes representative Dreyer to speak to the bill. Thank you. We shall rise in opposition to House Bill 531 and I'm going to get right to it. Some members of this general assembly have said that not everyone should be voting, which is the premise of this bill, HB531, because we know it's not about voter fraud, which isn't happening in Georgia and is a lie. But the same people that are okay making decisions for other people aren't going to let other people make decisions for them or about their property or about their community. We don't get to decide who is worthy to vote. Voting is for every American regardless of if they own property or not, if they graduated college or not, if they're in debt or not, if they are black or AAPI or indigenous or Latino or LGBTQ or Muslim or anything else. And Georgia voters know what is in their best interest better than we do. And that's why each Georgian should be able to represent themselves at the ballot box. I've done voter protection work for 18 years. The bill's author says that we don't want to count provisional ballots out of the precinct because that would partially disenfranchise people. But this bill chooses to fully disenfranchise those individuals. I've talked to people at 6 p.m. outside of a polling place that could not get to their right precinct in time. And at least some of their votes counted and this is going to strip that right away as well as stripping the right away of certain religious communities to vote on either Saturday or Sunday, stripping the right away from working people to vote on Saturday or Sunday, whichever is the most convenient. I heard a lot of smooth talk about this bill about it makes voting better or it makes voting more uniform or it gives people more opportunities but it doesn't. It cuts and slices and removes opportunities for Georgian voters and those opportunities worked and they might have worked a little too well. When we choose to make decisions for someone else, that has a dark history here in Georgia doesn't it? Some cro-laws were based on the same theory that I know what's better than someone else. Slave owners said that. I know what's better for these people. Land owners said that to sharecroppers. I know what's better for these people and I'm going to make decisions. And how did that go for Georgia? In generational poverty, some of the worst mortality rates in the country, some of the worst educational outcomes in the country and a lot of black children born with very little chance of opportunity in our state because of that legacy of racism. I'm going to say this real clearly in this last thing I'm going to say. Voter suppression is racist. Voter suppression is white supremacy and if that's hard for you to hear, I would like for you to please sit with it for a while because I know it's the truth. The people across the street know it's the truth and you have a choice today and history is watching. Listen to the people outside. All they're saying is no justice, no peace. And we're going to be fighting until there is justice in this state. I yield the will. Voter recognizes representative Al Williams to speak to the bill. Thank you, Speaker. First, for clarification, I was neither asked or told to speak today. I was compelled to do so because a few very brief remarks. I haven't read it or heard it. This election didn't fire me up like that because I came as a young man in 1970. I became the first African American in rural Georgia to run for the state house. And I read, we're talking about fraud. I can teach you something about fraud and South Georgia politics. You're talking about fraud. You should see you leading in the largest pre-sync in the county 10 to 1, 10 o'clock at night. And then six o'clock in the next morning you leading two to one. I know I won that election. But still paper ballots in this county wasn't my home county of liberty. It was the county of Macintosh. So I've seen fraud, seen ballot box stuff. I've seen folk call and ask how many votes do you need. And if some of you want to close a look at coastal Southeast Georgia politics, read praying for sheetrock by prolific a green. I want a national book award. It's good reading. A couple of other things that happen. Something I learned that when you play a game, there's baseball and you are behind in the seventh inning. You don't change the rules where you now got one strike. And the lines get changed. And you think about the loss of confidence in an election. And I've cried over elections for years and years. And I was playing basketball and football. If we lost by 45 points, the first thing we said was we don't want if the referee wasn't cheating. Which is automatic. To not accept the results. Now, I've been here long enough to know that what El William says today. It's not going to change a lot of votes. But I do know this. I've lived enough change to know what I see it. And I have to talk about what history says. Because of the 17 times I went to jail. 15 of them were protesting and trying to get the right to vote. I got the loves. And that's why I came up here. Because I don't want to look for a problem that does not exist and prescribe a fix that's not needed. There's one other thing for sure in this place called change. God knows I've seen it live long enough to drink out of a colored water fountain in the Liberty County Courthouse to have watched a black man swooning for President of the United States. I've lived the change. Change is going to come. We're resistant to it. But it's on the way. But with no 500 vote win in January, 90,000 votes is pretty decisive. The Ford and Trent has changed here. And great states and great communities learn to live with change. I say this as I go to my seat. And no worry about that. I'm a black Baptist. Deakin, go into my seat. Don't mean nothing. But I say this on the way. No matter what happens. I've come a long ways to having to recite the Constitution just to get the right to vote. To have to see how many bubbles are in a bar of soap to qualify. Come long enough to have seen these things change. And I've seen Ford with a small education who, when barriers were put up, they learned how to climb the barriers. So it solves to the polls loses for the Sunday before the election or whenever. If it's no longer, a lot of folk will bring souls to the polls at the Wednesday press service that will be early and souls to the polls on Saturday. What happened? Every time the rules change, hey, we'll learn to play the game. The numbers will not be here today. But I promise you as soon as this bill passes and I hope it doesn't, but as soon as it passes, we'll start to practice on how to win it that too. But now because we learn how to play the game and we played the game in November and way, no way is tired. See you at the next election. God be the glory. Thank you, Mr. Speaker. I'm leaving the way. That concludes the members who wish to speak in opposition to the bill. We'll go on now to those who wish to speak for the bill. Chair recognizes representative Rick Williams to speak to the bill. Thank you, Mr. Speaker. Appreciate that. Sorry for the little delay. For those of you that don't know, a lot of us funeral directors wore a different hat back home. No representative Collins used to be a mayor. Well, I was a chief registrar in Baldwin County for 16 years. So chief registrar sees after elections, voter registration and early voting and other duties for the registrar's office. I want to speak about section five, which is on page eight. This provides for an alternate method of certification if the probate judge is incapacitated. This happened this time. Why? Because of COVID. You know, people talk about why we're doing this. This COVID has affected a lot of things. The.\n\nI promise for the chief judge to appoint someone. We'll go on to page nine, section six. Section six allows for workers from adjoining counties to come and work in another county if they live in an adjoining county. You know, a lot of times, and it happened in Baldwin County this last election, we had a lot of elderly people who have worked the polls for many years. They were scared because of COVID, so they did not come and work the polls. We actually had a shortage of people working in the polls. It was hard to find people. Go over to page 10, section seven. In the event of the death of a candidate on the ballot in an on partisan election, what happens when somebody dies before their election? Well, because of COVID, again, we had things to happen. This election cycle, unlike anything we've ever seen. Page 12, section nine, wait times. I'd turn on the TV and I would see people lined up for a couple of blocks waiting to vote, standing in line, and this address is that. This is gonna make it easier for more people to get in to vote and not have to stand in long lines. And it gives and stands to the people who have access some parameters for the election superintendent to have a voting booth for every 250 electors. This will make it easier, quicker for people to get in, vote, and get out and move on. Page 49, section 20. Section 20 requires political parties to train their poll watchers. You know, if that was a chief registrar, we would have people come in and want to be a poll watcher. And I'd ask them, what are you gonna watch for? Well, I don't know. You don't know? No, I don't have a clue. I'm just, can you tell me what I'm supposed to be watching for? Well, let's educate the poll watchers. So this is what this is about. Let's set some parameters. Let's set something so people know what they're looking at. Page 50, section 21. This has to deal with, you cannot give anything to anyone that's voting or registering to vote. You know, this happened about 10 years ago in Baldwin County. When 2005, when the early voting started, Chick-fil-A was so excited, they came and they brought a bunch of little Chick biscuits and we had to stop them. You can't reward people for voting or even registering to vote. This is all about the voting. This has always been in there. This is a little stricter and it states the 25 feet of any voter standing in line to vote at any polling place. So a lot of these things are just being clarified. They're not new. They're just being clarified. They're being tightened up so people understand. So it's the same thing in all 159 counties. Page 50, section 21. There again, you just cannot register anyone for voting. Page 51, section 22. Have you seen anyone lose an election by one vote? I know some people have. I think a sheriff down in Wheeler County lost. He was an incumbent and he lost by one vote. There again, someone voting out of precinct, voting a provisional ballot, voting up top of the ballot. They're not able to vote in the local election, whether it be a county commissioner, whether it be a state representative, whether it be a city council person. Ladies and gentlemen, this is just a lot of common sense. A lot of these provisions have been endorsed by ECCG. They had a provisional ballots in 2016. They were just a couple of hundred. In 2018, they were 6,600. In 2020, they were 13,300 out of precinct ballots. Some county commissioners, some state representatives, probably lost their seat because someone didn't vote in their precinct. There are a lot of different ballot styles and these different ballot styles have your congressional district, your house district, your senate district. Ladies and gentlemen, read it, this common sense. I ask for your approval consideration. Thank you. Chair recognizes the speaker, Pro-Tim of the House, Speaker Pro-Tim Jones, to speak to the bill. Thank you, Mr. Speaker. As the Georgia General Assembly, our goals in regulating elections should be to assure voting is fair, accessible, understandable, convenient, and trustworthy. Georgia elections can be made even more so with the reforms contained in House Bill 531. After being in the legislature for a few years, I've learned that some things are rarely modified in the Georgia General Assembly, such as, well, I actually can't think of many activities that are not changed regularly, including elections law. I've heard today that we rarely change elections law and there must be some underlying reason why we're trying to do it other than those for good reason. But the reality is, for context, from 2003 to 2020, 18 sessions, the legislature passed elections-related legislation each of every year, approving a total of 59 bills. This would be number 60. It's time again, because of the lessons we learned, following the implementation of a new voting system, and an unprecedented pandemic that revealed extreme stresses in our election system, such as the need for greater transparency, uniformity, and confidence in the individual ballot and the processes overall. I'll briefly explain several sections as they relate to transparency, uniformity, and confidence. And I hope your constituents back home are listening because the hyperbole and mistruths in the TV ads and mail pieces that we've all been barbed with through a million dollar campaign, they need to see the light of day, and sunshine has a disinfecting quality. The first is section four and section eight. These sections would eliminate private funding directly to county election offices. This will bring greater uniformity and elections in all 159 counties. Yes, it will increase confidence in the election system by reducing the prospect of undue partisan influence and unlevel private funding for county elections activities. Election activities should be government-funded period. Section 10 eliminates mobile voting locations except for emergencies declared by the governor at specific precincts. For context, precinct locations are announced months in advance. And early voting locations are established one month before elections. Well, this makes sense because it allows the public to learn about locations and provide feedback if they're not fairly distributed. Mobile voting units impede transparency to the public or not permitted in current law and were utilized by only one county in November, my own county, Fulton County. I only learned about mobile voting units as a Fulton resident because I happened to glance at an email from my county commissioner I was on as email list. This anomaly erodes voter confidence in county elections board decision making. If more precincts are needed in Fulton County, just create more precincts and open more locations. Section 14 requires greater public notice of voting machine testing prior to elections, including newspaper advertisement and notice on the Secretary's State's website. It makes clear that members of the public must be allowed to observe the preparation and testing of voting machines. Increase transparency in the process is a good and needed thing. Section 15 revises the absentee ballot request period to address unnecessary burdens on election staff and increase voter confidence that their absentee ballot will arrive in time and actually be counted. It changes from 180 days to 78 days at the front end to request absentee ballots. This will lessen the burden on 159 county elections officials to keep up with the sparse requests received months before an election is even set in candidates are even known. It more properly places the absentee ballot period more in sync with the early voting period and decreases the number of voters that forgot they requested an absentee ballot because of the very long lead time. This section also modifies the absentee ballot request deadline at the back end from three days prior to an election to 11 days prior to the election. Let me share a couple of facts that make the case for these changes. For absentee ballot requests made prior to 10 days before the election, 90% were voted. For absentee ballot requests made fewer than 10 days before an election half were voted. Really enough said about that. Except actually let me add one more thing. In this last election in November, 500,000 absentee ballots were requested that were subsequently canceled by voters. These changes contained in this bill will reduce the number of cancel ballots which lead to longer voter lines and an increased burden on elections officials. Section 16 requires at least one drop box in every county, up to the lesser of one drop box for every 100,000 registered voters or the number of early voting precincts in a county geographically distributed. Drop boxes will be housed at registrar's offices or inside early voting locations monitored and closed when early voting is not taking place. It also requires the collection of ballots from drop boxes at the end of the day. I'd like to give a little perspective on the history of drop boxes. They came about as a result of an emergency order of the State Elections Board after numerous county elections boards express concerns for social distancing during the 2020 pandemic election period. They were concerned absentee voters would crowd elections board offices and postal offices dropping off their ballots. After the pandemic, it certainly makes sense to consider the role of drop boxes going forward. Drop boxes are the most inconvenient way to vote absentee. Were we to eliminate drop boxes, which we are not? Not a single absentee voter would be inconvenienced because every voter has a drop box called a mailbox at the end of their driveway, at the bottom of their apartment complex, or in their nursing home or assisted living facility. Regulating drop boxes, as contemplated here, gives voters lacking competence in the U.S. Postal Service and option for drop off, and it creates uniformity throughout Georgia based on population. For all the talk about drop boxes, it's important to note, in November, 38 counties did not offer a single drop box. With House Bill 531, drop boxes will expand to these 38 counties. The vast majority of counties that offered one drop box will continue to do so, and the very few that had multiple drop boxes will have them according to their population. Section 18 creates more uniformity of days and hours of early voting. Living in Fulton, I previously and wrongly assume that every Georgia voter had similar voting opportunities to me. Throughout Georgia now, a variety of early voting hours are offered with 116 counties offering fewer hours than would be required in House Bill 531. I think I'll say that one more time. A variety of early voting hours are offered with 116 counties offering fewer hours than would be required in House Bill 531. 47 counties offering early voting only on one Saturday. This legislation standardizes early voting hours from 9 to 5 with the option of up to 7 to 7. All counties will be required to offer one Saturday of early voting and a second weekend day of early voting either Saturday or Sunday. Now I want to talk a little bit about Sunday voting. This accommodates this legislation the very few counties that want to offer Sunday voting. The data shows it's the least used voting day by a long shot but they'll be able to offer it if they want to. Out of 159 counties, only 16 counties offered one or two Sunday voting days in the November election. In the January heavy turnout Senate runoff, only six counties offered Sunday voting. Of 3.9 early votes cast in November, fewer than 65,000 were cast on a Sunday. You're hearing far more incorrect campaign rhetoric about Sunday voting in TV and radio ads and through multiple mail pieces than you're receiving facts and reasonable perspective. The proportion of black and white voters that chose to cast early votes on Sunday, all 65,000 of them, was close to their population proportion. You will not hear any of this in a fair fight ad. I can assure you. Section 19 allows early processing and scanning of absentee ballots up to two weeks on election day, prior election day, and it requires election officials to scan absentee ballots but not tabulate beginning one week prior to election day. It requires elections officials to provide public notice of dates, times, and locations of absentee ballot processing to assure more transparency. Section 20 spells out that poll watchers must be allowed to fairly observe procedures in the tabulating center. Currently, and I actually, frankly, was surprised to learn this, although poll watchers are recognized in law, there is no requirement that they actually watch anything. In some cases, they have been relegated to poll non-watchers. This lack of clarity has led to friction among poll watchers and elections officials. This provision will increase confidence by the public and partisan poll watchers regardless of their party. Section 25 creates bipartisan ballot duplication panels for any situation which a ballot has to be duplicated. The format is similar to one Texas has used successfully for years. This is an important change because ballots emailed from overseas have to be duplicated, which is, frankly, a fancy word for reproduced by hand from the form. The same is true for damaged provisional ballots. Instead of one election's official completing the task, it will be performed by three persons, including one Democrat and one Republican and an election's official. Section 25 requires the duplicated ballots I just described to contain a unique number that will allow the duplicated ballot to be linked back to the original ballot for more security. As I think is plainly obvious, when you read the bill, House Bill 531 will greatly improve our elections processes for all voters. Thank you for your attention to these changes to increase transparency, uniformity, and confidence in our elections system. And with that, Mr. Speaker, I yield the well. Chair recognizes Chairman Allen Powell to speak to the bill. Well, good afternoon, ladies and gentlemen. It has been a lively afternoon. I was just talking to a colleague from the other side who I'll go. She pretty well reflected the same thing I did when I said something to her about how much I appreciated her courtesy the way she had asked the question earlier in the day. The anger is something that's just systematically in this country that's creating so much problems today. Now I'll tell you something. I'm going to talk about a couple of sections in this bill. I'm not going to try to editorialize, but I'm going to try to tell you a little bit of something. You know, this is a process. This isn't an event. We're up here on the second Monday of every January to fix laws, to change laws, to do things. They're in the best interest of this state. That's what we're up here for. And then the actions that a lot of people think that we haven't done anything or were just now doing something to repair the system. One of the days something, my system has been broke. But it was even more broke this year. Not so much because of who won or who lost, but it was broke because it blessed it's heart. The motor suppression idea went right after door. There were untold numbers of people who voted. So much that it created such a problem with the system. Because our system is flawed, ladies and gentlemen. The system is flawed because the counties run the system. 159 counties run the election system. And part of the problems with that is that in those 59 counties, yes, each and every one of those people that run them boards of elections, they have different political thoughts. They have different populations. You know, you got some counties that might have 10,000 or 20,000 or 30,000. You got some that's got, you know, 7,800,000. And the problems that I saw during the election came from standpoint that the system was absolutely unundated. It was unundated. Boards of elections couldn't keep up. So when we came down here this year, besides all the other talk about election reform, some of us looked at it, but we do need election reform. I didn't get everything I wanted in this bill quite frankly. I'd like to do away with the counties running the elections. I'd like to see a uniform state process. But I can assure you of one thing that if you don't dot the eyes and cross the T's and stop up some things, then one county is going to do what another county can't do. And is that not just another form of voter suppression? Because it takes away from. I heard my good friend, the dean of this house, he started off in one of the things he said, struck me, was a confusion, deters voting. That's what brings about suppression. Folks, if you didn't say confused in this year, I don't know what you saw. Because it was the most confusing system we've ever seen. You see some locations at reporter man. You see some that come in later. We heard everything under the shining sun to the point that there was no proof. Oh, I shouldn't say that. Because I got handed to me by some folks. But there was no proof even though they might have been. But I can tell you there's always a certain level of fraud in every election. In 1976 as a young man, I remember a fellow who ran for his first political office, age of 25. And he was beat by 12 votes running for Mayor Hartle. And he was beat by the chaplain of the hospital. And I was told after the election, because I was too dumb to understand how this process worked on absentees, was that he worked the absentees in the hospital and in the nursing homes. I taught me a good lesson. Lesson I never forgot. Ms. Wen probably won the sharper members that I know in here, made a comment during the December hic hearings that the governmental affairs had on elections that she already went back and looked into the journals. I was one of the few that voted against expanding absentee voting in 2005. I did it then and I'd like to do it now, but as I have been quoted as saying, I don't know if that genius bottom is getting back into that bottom now. Because we've gotten so many people used to it, they like convenience. I will support anybody's right to vote. That's the bedrock of the foundations of this nation. But I also think that everybody has a responsibility to do it right. To be sure that we know who's legally capable of voting and should be. To be sure there's not someone who votes multiple times. I'm going to talk about that issue in a minute when we talk about the absentee process. My good friend, Dale Williams, there's probably not a better guy that I know. I treated him here and I had been like brothers even though he wanted to invite me down to the coast because he's afraid he'd have to explain who I am to his folks. But he's absolutely right. This is a ball game folks. This whole process is like a ball game and it tears my heart out. Even worse, it's like a tealy game with people tugging from one party to the other. You know, we had a committee that was set up to look at this voting system to see what we could do. And I'll say again, I don't like everything in the bill. I think most of everything in here is constitution. Because don't think that anybody in this day and time is dumb enough to try to slip something through and pass something unconstitutional. Because everything that we do on any election goes in front of a federal court, ladies and gentlemen. And it goes in front of a federal court because of checkered histories. Nobody's trying to aggregate your rights, but there also comes other responsibilities with the right to vote. Like showing your ID to verify who you are, what your address is. I don't want any of you all voting up in heart count quite frankly. Well, maybe I do. Some of you might vote for me, but some of you may not. But that's the premise of a lot of things. We saw some things this year that were terrible. We saw boards of elections that couldn't keep up. And I want to address a couple of issues right now. Even though I do wish that in the hearings that the process had been a little bit more open as far as the minority party members stepping up and making recommendations other than continuing to read questions that they were fed. That's hurt. I believe in the process. And I believe that we can work it out. It bothers me when I see folks out here protesting and saying that with my name on the sign saying that I'm trying to suppress the vote. No, I ain't trying to suppress the vote. I want to see a system that works. Because I'm a believer, ladies and gentlemen, that no matter what we pass, that's the rules of play. I'll spoke that that'll be the rules of play and it'll come forth. But we're in a day to day that the politics continue to go the way they are. We saw fair fight folks. It's continued to throw stuff out there, but that several chunks of money supposedly stirring up the troops. Well, let's talk about the real issues. I want to talk about a couple of these issues that I've been assigned. First, I want to be the simplest one. On section 13, this requires security paper for ballots and includes features that can be used to authenticate the ballot. Surely, the gosh, I don't think anybody's got a complaint with that. That's just nothing more than common-sense security to the ballot process. Then I want to get into section 15. This shortens the wonder for the absentee ballot applications from 180 days to 78 days. And it places a deadline for receiving absentee ballot applications of 11 days prior to the election. Well, let me be sure I'm correct. There's no rhyme or reason as to why our election boards were so fouled up. People were applying for absentee six months before there was an election. One of the days, I've got folks that I've talked to people that are being investigated because of age or whatever they put in an application, they sent off a ballot. Then they made an attempt to vote on election day because they forgot they sent the ballot in so far in advance. Let's make this simple process, folks. Let's make it authentic so that people know what they're doing. As we saw it this way, how many folks got all of the mirage of absentee applications from folks they didn't even...\n\nOh, who they came from. So many that some people believe it or not, I know that nobody in here is feeble minded. But some of our voters sometimes can't keep up, that it was thrown out time and time again about that. So we're shortening that day for the application process to 78 days, something realistic. If you can't file an application to an absentee with over 11 weeks before an election, folks, some's wrong here. Then we did a little issue that came up as a separate bill. You've got to file your absentee application 11 days prior to the election. Well, let me tell you what that's about, folks. Current law today says that you can send in your application for an absentee in your Board of Elections on the Friday before the Tuesday's election. Well, that's pretty good. You said that you've made all that application in. It may or may not get there to the Board of Elections in time for the election. And if you don't get it back in your year, you thought nothing else about it, maybe or maybe you did. So we decided to back it up. We backed it up to the Friday before. And we put criteria on there that if that election, if that application comes in on Friday before the Friday before the election, 11 days prior, that would give the Board of Elections time to send out the ballot so that the first can vote it. Kind of common sense. This is just mechanical stuff, ladies and gentlemen, but it's stuff that makes this system work. This replaces the signature match for absentee voters applying for a ballot for the Georgia driver's license number or driver's license ID or state ID. And if they don't have that, then they can then on the ballot form, then they can reach out and they can put other pertinent information things that are currently known and permitted by the Federal Help America Boat Act. Other types of information, other types of ID. You know, I heard the ringing of hands about photo IDs and that kind of stuff. Well, let me tell you a little bit about where we went on this as a committee. Today we have the exact match, signature match. Well, you'll see about how far that went this year, given the number of people, the absolute record number of people. And these boards of elections, they had to do that comparison. Now, because of the actions of the Federal Judge, in a lot of cases was misrepresented, what it really did, back in March. I think that that just through cold water, bucket of cold water on a lot of boards of elections, because they kept thinking it did certain things. But what it did, it says, yeah, that exact match stayed into effect. But they had to give a certain amount of discrepancy to say an old signature. I don't know when Calvin's representative smiley. I don't know when his signature was posted in Muscogee County. I hope it's changed since then, because it may not look like the same as it did when he was a young man, especially my friend, Al Williams, or even my own. But I can tell you some things that everybody's got a right to vote. And that subjective signature match was a tough one to do. So I think in a lot of cases, whether it was used or fully utilized or not, I don't know. But I know that we thought about it, and they had been discussions about, well, you'll put up a, let's do a photo ID of the driver's license. Well, you know, that's just another barrage of paperwork. And we knew what the argument was going to be from our good Democratic friends. Well, not everybody's got a photocopied machine or anything at home. So you know, thankfully to some of the August members that had a good thinking process on the committee, they came up with the idea of that number. 97% of every citizen in the state has a driver's license. Are they having an ID? Are they having a voter ID card that didn't cost him anything? Or they can go to the DDS and they can get a card for an ID. Or that other forms ID. This is an objective way of verifying who someone is. And they put it on that application so that when that board of elections, when they're looking at that application for an absentee, they're seeing a specific name. They're seeing a date of birth. They're seeing an address of where they live. They see an address of where to send that ballot to. And they're looking at an objective number to look at. You asked again for those who ask again. I'll just tell you something. In the infinite wisdom of the federal government, the stuff they lost, the stuff they passed, a lot of stuff that they've done has created a lot of problems also. One of the problems was motor voter. When folks go and vote, it's the Department of Driver Services to register to vote. Well, they might sign a wet signature. But let me tell you what goes back to the boards of elections. It's a digitalized signature. They don't look anything like the real match. So that, ladies and gentlemen, is the reason that we have moved toward proper ID. Excuse me. This creates a standard absentee ballot application. And if it's sent by third parties, to start with, we're prohibiting. We're prohibiting anybody, a government entity, for sending an unsolicited application to anybody. It's a solicited. Thank you so much. You have to solicit that application. Now we can't do anything. Thank you. We can't do anything about those political groups or whatever group it might be that was sending out all those applications from absentee. Well, one of the things that we can do is we can require them to cut down on the confusion. And if they're sending those type of unsolicited applications, then there's a few things they need to do. They have to have a disclaimer on it that they're not a governmental entity. And that application is not a ballot. It has to be in a large enough font size for the people to see them. How many folks did y'all have to the members out here? How many people did y'all hear to say, I got six ballots in the mail? Well, you know, I'm not sure it was six ballots. More than likely it was six applications and quite frankly it's confusing to folks. But you know, this thing about we don't, there's no laws against harvests. And we're just focusing on voters. That's called the political process, ladies and gentlemen. That's what the D's and the R's and the I's and whatever part of the there is is that each one of us individually, you harvest them voters. But we draw the line and always have draw on ballot harvesting because ballot harvesting is one area out there where people who want to vote, they straight up and down vote. And for those folks who lose the process, you know, I've always thought there was nothing to me the greatest insult to me personally would be if somebody knocks on my door and they say, Mr. Powell, have you voted yet? And I said, well, maybe or maybe not. Well, we want you to vote. And we want you to vote for this candidate or that candidate. But frankly, folks, that's an insult and it should be the insult to the intelligence of every person that their vote is sacred. Their vote is sacred, ladies and gentlemen. And that's what this bill is trying to do. And I said it, well, there's a reason that we meet on the second Monday of every January. And that's to clean up things. I'll say it again, that in this bill, for those who want to keep hollering about suppression, let me tell you something, this is a politicalized issue, folks. It's about keeping people whipped up into a frenzy. That's the political game. But it's time to put this to put it to bed, folks. Let's get on with the system that works. As Brother Al, I said, well, go, Brother Al, we said it the truth. We're all going to work by the rules. We're all going to work with whatever is right in front of us. And whoever's got the best game plan, they're the ones that are going to win it to end the day. But let's put some integrity into this system. Let's reach out to the folks and say, we have a system that works. Ladies and gentlemen, I know folks are going to vote, having a vote. I mean, there's no need in me saying any different. But I think you need to take a good look at this. And at some point, we're going to all have to come together for what's in the best interest of people in the state. I certainly can't do anything in the floor of the Georgia General Assembly to have any effect on what happened in Pennsylvania or Michigan or wherever else it might be. But I can't have a say in a vote here in this body. And I would encourage the members of the minority party. This process ain't over folks. Let me tell you something. This is only the start of it. You've got all of that stuff that's coming out of the Senate. We've got other things. You'll all wind up in a conference committee. Roll up your sleeves and get busy and get with us. Because it not only benefits us, it benefits you. Because at the end of the day, you can talk about race, you can talk about gender, you can talk about everything. At the end of the day, there's only one color. And that's the color of the blood that everyone of us shares a common color. Thank you, ladies and gentlemen. Chair recognizes our Chairman Todd Jones to speak to the bill. Thank you, Mr. Speaker. Colleagues, I need one minute of your time. I think aspirationally, each one of us come to this house hoping to make Georgia better. We come to this house no matter what the topic or policy matter is, we come here to make it better. We all have our own visions. We all have our own means. We may agree on where we want to get to. We may disagree on how to get there. But ultimately, I think we can agree that we want to make the ease of voting. Absolutely, something that's efficient and effective for our constituents. At the same time, we want to make ourselves secure. We want to give confidence to the voters that we do in fact have that. You see though, but here in the state of Georgia, there's not one objective poll ranking that would tell us that we're number one in ease or we're number one in security. I've heard a lot of comments made in this chamber today. I've heard them on advertising that it's an either or. That in order to affect ease, you can't affect security. In order to affect security, you affect ease and efficiency. That's a false choice. Our goal should be, as the House of Representatives of Georgia should be to provide to our constituents both. This should be about giving them the easiest, most efficient way to vote, but at the same time knowing that it is absolutely secure. I believe 531 puts us in that direction. I believe it's the path to get us there. I hope that all of you as you consider the bill, and probably more importantly, as you consider what you want us to be when it comes to voting, I hope you consider the fact that this is not an either or, but it's an and. It can be the place to be able to achieve possibly one day 100% participation of all Georgia citizens with the ease and the security that all of them demand. Thank you very much. Chair. Mr. Speaker. Chair recognizes Chairman Shaw Blackman to speak to the bill. Thank you, Mr. Speaker. Fellow members. Officials with a political interest in making elections look air-free should not be tasked with finding the errors. Our friends on the other side of the aisle felt that way two years ago. My GOP colleagues feel that way now, and both sides are right. We need to remove as much of the politics from this system as possible. It's our job to make these laws and having a single politician able to change the system we create is negligent of us. It's shirking our responsibilities. Sections one, two, and three speak to this. Section one puts that degree of separation between the chief election enforcement officer and the rulemaking body. Section two appropriates the resources for that in Section three would require notification in the event an emergency rule is being made. So we are adding checks and balances to our system and we are bringing added transparency to the rulemaking process. Since June, we have heard from dozens of witnesses and logged hours and hours of testimony. People receiving multiple applications and even ballots, dead people receiving ballots, people receiving request forms that haven't lived in the state for years, people going to vote and being told they voted absentee and not allowed to vote. And people being told that someone would come by and pick up their ballot along with other chain of custody issues. Now we can debate the frequency but I ask you to review the video yourself and see the Georgians that we saw testify before our committee. I've spoken with a number of friends and constituents and have heard repeatedly that they understand their candidate won't always win. But they do want to know that the person with the most legally and legitimately cast votes is the winner. Despite the hard work of our local election officials, both sides have alleged at varying points sloppiness in the 2020 election cycle. I submit to you that an integrity of an election is just as important as access to an election. While we are constitutionally bound to do only one thing in this body and that's past a budget, I believe we have a moral obligation to all 10 plus million Georgians to ensure the integrity and sanctity of our elections. Thank you Mr. Speaker, fellow members, I yield the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We are now moving on to the minority report after which we will have the chairman's time. 20 minutes total for the minority report and 20 minutes total for the chair's time. The chair recognizes on the minority report representative Burnow. Thank you Mr. Speaker. Currently I serve on the special election integrity committee and I wish we had been allowed to work on HB531. The bill did not have one democratic signature. Georgia has been a leader in providing voters more options to vote than most states. So why would we undermine our own success that is exactly what this bill does? Limiting the usage of ballot drop boxes which were extremely popular during our election cycle will certainly be disappointing to many Georgians. Drop boxes are convenient. Currently they are outside the early voting locations where they are accessible and voters can use them in the last three days before an election to turn in their ballot. By using a drop box voters know they have returned their ballot on time and that their ballot will count. Drop boxes are also secure. The emergency rule that authorized drop boxes require that they be video monitor 24 hours and vote it to the ground. HB531 in the current form will prohibit counties from seeking outside funding for election administration. Why there has been no evidence of undue influence. These funds were given to the following counties which are both blue and red, big and small. Bairro, Bairon, Bibbula, Camden, Carol, Charlton, Chadam, Chattahoochi, Cherokee, Clayton Cobb, Columbia, DeCab, Dordy, Douglas, Early Flood, Forsyth, Fulton, Gwyneth, Henry, Jackson, Lanier Lee, Lincoln Lowns, Lumpkin, Madison, Muscogee, Newton, Paul Ding, Pope, Raven, Randolph, Richmond, Rockdale, Spalding, Trude, Twigs, Athens, CART, We're in Wilkerson. Every county could apply for the grant. The right would argue that these items were here because of COVID-19 and that is true. However, when faced with a challenge we evaluate and make changes. This was a positive change because it allowed our constituents more voting options and they were safe. To my colleagues, we are resilient people who ain't gonna let nobody turn us around. Thank you, Mr. Speaker. Chair recognizes Chairman Oliver to speak on the minority report. Thank you, Mr. Speaker. Since Oglethorpe came to the New World in about 1733, Georgia's history is progressed on the issues of race and region. Today is another chapter in that progression but is a step back. It does not reflect the needs of our modern society. It does not reflect the issue of technology. It does not help more voters vote. An important chapter jumping from 1733 to 1961 was the decision by the United States Supreme Court in Baker v. Carr that eliminated the county unit system and created the principle of one man, one vote. One of the aftermaths of that important decision that began 10 years of significant reform on voting rights and in French in the vites of Georgia's citizens to participate as real citizens. The election of Jimmy Carter to the state senate across the Rotendom. In 1963, he won his first election after a chaotic set of special elections called for by Baker v. Carr and he wrote a book, a book that I recommend to you strongly, turning point, where the equipment county probate judge, then the election officer for equipment county, hid the ballots, stole the ballots and then presented the ballots when the court ordered him to do so multiple times allegedly in alphabetical order. Turning point is a great book of Georgia's history and the elimination of the county unit system was essential to our progress. I missed most of the civil rights era that was directly participated in by Al Williams. My first job at a law school, although I've been in private practice now for three decades, my first job and I was so grateful that somebody gave me a job, was in rural Georgia representing low income Georgians whose rights had not been protected. There had never been legal services in rural Georgia and the state, our younger lawyer's section, began that program and I participated for a lot of my 20s. In addition to my gratitude of having a job, I was also very grateful for the lessons I learned, the lessons I learned of laws and granting rights to citizens that never reached the citizens. I was allowed to do voting rights litigation in that era and I'll give you one example of one case. In a suburban county that had changed its system of voting from single member to at large to make sure that blacks could not be elected to the county school board or the county commission, the county did not submit its voting change for pre-clearance. I sued and they stood up in federal court and said the voting rights act didn't apply to them. Now even a green lawyer who didn't have any experience was going to win that case. It was a case of race and region which brings me today to talk specifically about House Bill 531 which would disenfranchise a quarter of a million people who voted on the weekends in 2020. Our modern society of technology, our modern society of business lives, the way in which we people want to vote, tell us that 531 is a step back. Yesterday I'll meet the press February 21st, 2021. The Chuck Todd gave a lesson on race and region with maps of my county and six other counties of the Metropolitan Atlanta area explaining to the nation that race and region and diversity had allowed the election of Senators Assoff and Senator Warnaug. We are here today on a false set of premises that our voters want to be given a set of laws that restrict their rights to vote. We are told they want that based on several years of arguments by the man that President Biden refers to as the former guy. I'm here today to ask you to vote against 531 and to extend to our citizens the right to vote in the way they want to vote, in the way they choose to vote in their busy and complicated lives using the modern technologies that we have available at this time. Thank you, Mr. Speaker. Chair recognizes representative Douglas to speak to the minority report. Thank you, Mr. Speaker. My colleagues, I don't normally come down here unless I have something to say. A lot of things have been said on both sides. One thing I did say in committee is let's take time to get this thing right, put everything in one bill which they so far granted thanks to the chairperson. But we had time to work through all the issues that are in the bill and it's kind of funny that we pushed something through to obtain wherewithal to our base. I wasn't going to speak today but something got a hold to me upstairs and said that I must tell my truth. My party on my side we're big old ten. We love on everybody. But on the other side, you guys are right down the aisle, right one way and you never had to go through what the people on my side had to go through. So just take this for example, come with me on my journey. For the rest of this year, let's say we're going to discriminate against you on every issue that you have in your life. What you eat, how you get medical treatment, how you raise your kids, help and medicate, Medicare for your children. Just think one minute have you ever been discriminated against in your life? What would be today people? My religious group that we have down here, what Bible are you reading? You should, the Bible says you treat people like you want to be treated and the least of these we take care of. So you want me to come pray with you on one day and then you're going to issue a bill that's oppressed the vote of another person the next day. We got to get it right people. And it starts with your conscious. I know I can't change your vote because you've already been summons the vote one way. So guess what? There's going to be a time and a day and you can't say you hadn't heard it because I was sitting here to tell you that you're going to have to account for the wrongdoing that you have done unpleasing until his side, not my side, his side who were all under. I yield the well. Chair recognizes representative Wynn to speak to the bill. I'm an already report. Thank you, Mr. Speaker. We are legislating on lies, lies misinformation and conspiracy theories that have gone unchecked by many members of this body who stayed silent, who signed onto the Texas lawsuit or who encouraged sham hearings in our general assembly. Members of this body, aided and abetted a deliberate misinformation campaign to sow seeds of doubt among Georgia voters with absolutely no facts or evidence. This has led to threats and violence against selection workers, against the Secretary of State, the governor and members of this body, including me. And certainly, this played a hand in the insurrection that occurred on January 6th. All of us have had a chance to absolve ourselves from the concerted efforts to undermine our democracy, simply by telling the truth and relying on facts and evidence to inform our constituents about reality. Ahead of the sham Giuliani hearings, I was faced with making my own decision. I could either stay silent or I could tell the truth and take the risk that I would become a target for radical right wing conspiracy theorists.\n\nI chose to tell the truth because this is bigger than me and this is bigger than any one of us. Those of you who have chose to remain silent have betrayed your constituents and the five million Georgians who voted in the November election. And now when we are all faced with the decision to tell the truth, you are choosing to support a bill that is so egregious that it is nationally known as Jim Crow in a suit and tie. Here's the truth. I cannot find one single case a voter impersonation or the misuse of absentee ballot voting that has resulted in criminal conviction, not in this election and not in any election in the past ten years. Of the dozens of cases referred to the state election board, many of them are not actually related to voters at all. And of the handful of voters that were referred to the Attorney General, zero of them are related to voters. Misusing mobile voting are misusing secure drop boxes. Zero cases related to weekend voting. Zero cases related to the use of provisional ballots. Here's the truth. Hundreds of thousands of voters on both sides of the aisle took advantage of expanded weekend voting in 2021. We know that forcing counties to choose between Saturday and Sunday voting is targeting black voters who have used souls to the polls to cast their votes. Over 71,000 Georgians used Sunday voting and 37% of those voters were black voters. Hundreds of thousands of Georgians on both sides of the aisle exercised their right to vote safely and securely using absentee ballot voting and in the middle of a pandemic, which is still not over. Here's the truth. Ten failed lawsuits in Georgia alone. Two recounts, an audit of absentee ballots hundreds of thousands of taxpayer dollars and no evidence of voter fraud. Here's the truth. Georgia has been subjected to hundreds of years of Jim Crow and voter suppression laws. Literacy tests, counting jelly beans, poll taxes, property tests, using law enforcement to intimidate black voters, shutting down polling precincts, massive voter purges, felony disenfranchisement, voter ID laws, forcing Georgians to wait in line for up to 11 hours to cast their vote. And yes, the use of violence and threats. Here's the truth. Georgia has never wanted us to vote. Not if you are black or brown, not if you are poor, not if you did not have the privilege of being a white male landowner at the inception of this country. Here's the truth. There has been nothing presented to this body that justifies the passage of House Bill 531. And the truth is, if you vote for this bill, you aren't restoring confidence and elections. You are betraying the trust of your office and of the public. I yield the well. Chair recognizes the minority leader of the house for the final three minutes and 15 seconds of the minority report. Thank you, Mr. Speaker. I had a 10 minute speech, but I'll do it in three minutes and 15 seconds. Well, in 12, 14, 2020, my daughter texts me in the middle of the night. And she said, Dad, I got some interesting news for you. She's 23 years old living in New York City. And I was like, Oh, it's the middle of the night. You got some interesting news for me. Look at that possibly big, big eye emoji. I send back. She texts me back. I think you are James Beverly the fourth. Wounded head emoji. I text her back. Well, it turns out I'm James Beverly the fourth. For 52 years of my life, I thought I was James Beverly the third. Well, it turns out that my great, great grandfather was James Beverly. He was born in 1852 in Texas, Virginia, a free man. He went on to buy property in Maryland in Virginia, Pennsylvania because she got an ancestry.com coupon. She was able to figure out where I actually came from. And so I started to contemplate my reality. And I realized my mind took flight to 1863. My grandfather was 10 years old. And I realized that he started. He probably thought some way about being free because Lincoln had done something with something called the Emancipation Park Room Nation, but my mind didn't stop there. They went on to 1868 where the 14th of Memor gave Black folk the right to vote. But my mind didn't stop there because we know that states immediately tried to restrict access and limit anybody's ability to vote from that point forward. My mind went to 1914 where my grandfather was born. One year before the grandfather clause was severed by the Supreme Court in 1915, which gave him the ability to vote because his grandfather voted. And then I came up to 1965 with the Voting Rights Act where I find myself now contemplating the reality in this moment about voter access and restricting people's ability to vote. And Mr. Speaker, I can't go into the speech that I have prepared. So I'll just go right into the heart of the bill. In the opening salvo of this bill, line eight restricts access. Line 15 limits my ability to vote. Line 21 limits my ability to vote. Line 25 limits my ability to vote. Line 30 restricts access. And it goes on and on for 66 pages. I stand in opposition to this bill because Democrats weren't involved in any meaningful conversation before 531 was haphazardly thrown together in committee and passed. I stand in opposition to this bill because it tries to silence the voice of Georgians and Georgia businesses by attacking the amazing public private partnerships that open up access to the ballot box. I stand in opposition to this bill because local groups, churches and nonprofit business owners who see as a part of their civic duty, just a glass of water can't do their civic duty. Instead of focusing our collective power to promote a healthy Georgia united agenda which would eradicate the pandemic. Take care of Georgians who have lost their jobs through no fault of their own. Expand health care coverage for all of Georgians. Close a digital divide that our school children are experiencing. We choose to do a system check because Republicans lost a statewide election fair square. Mr. Speaker, my time is up by yield to wealth. We are now going on to the chair's time by rule that will be 20 minutes. Chair recognizes chairman Fleming for the chairman's time. Thank you, Mr. Speaker. I yield of my time what they may use initially to the speaker pro-tim and then the majority will. Gentlemen has that right. The chair recognizes speaker pro-tim Jones for a portion of the chair's time. Thank you, Mr. Speaker. I just have a few final remarks. The saying, the truth is losing the battle could not be more true with respect to a multi-million dollar radio and TV ad blitz and multiple mail pieces floating all over the state. I couldn't find a word of truth in any of them except for the occasional preposition and article. I encourage everyone in this body to set the record straight with their constituents. Numbers don't lie with respect to numbers pertaining to more uniformity and voter in person days and hours. Remember, 116 counties offered fewer voting hours than would be required by HB531 in the November election. Remember, 47 counties offered only one Saturday of early voting and would be required if this passes to offer two days of weekend voting. I'm sympathetic to our practicing Jewish and seventh day Adventist friends who do not vote on their Sabbath on Saturday. The bill accommodates them by allowing for a Sunday early voting day in the counties that choose to offer it. Remember, only 16 counties offered Sunday voting in November and only six counties in the January Senate runoff. Those who live in the majority of counties that have never offered early Sunday voting currently and will continue to have other options. Absentee, 15 weekdays of early voting and finally election day voting. I heard the parable about the turtle on the fence post. I've heard it before and frankly, I've always felt sorry for the turtle stuck on the fence post. I always hoped somebody would come along and give him assistance and let him down so he could travel on to a cool stream in the distance. I've never thought of that turtle as being lifted up, but rather as a victim. The hero is the one who cuts down the fence post and gives him freedom. HB531 takes a few wax at that fence post and impediments to fare understandable, trustworthy and accessible elections. I ask for your favorable consideration of House Bill 531 and with that Mr. Speaker, I yield the well. Chair recognizes the majority caucus whip representative Kelly for a portion of the chairman's time. Thank you, Mr. Speaker. I appreciate the opportunity to speak today, but I want to first thank you for the way you've presided over this chamber and over this process on one of the most important things we can do as a legislative body. That's protecting the right of our citizens to vote and making sure that they have a process to do so. I appreciate Mr. Speaker that you began this conversation back in June when we recognized that there were fundamental flaws in our election system. I appreciate you appointing a special committee to specifically look at this issue, to hold hours of debate and take testimony from anyone who wanted to come and testify regardless of party affiliation. Mr. Speaker, I appreciate this morning when you came to us and told us that we needed to extend the debate time so that we could have a thorough debate that's worthy of this House on an issue of utmost importance our state. The Mr. Graham Disappointed, that instead of engaging in a thorough and intellectually honest debate with that extra hour, that the minority party resorted the name calling and gross mischaracterization of the character of many members of this body. Let me just speak on reminded of the quote, never wrestle with the pig because you'll get muddy and the pig will like it. So I just want to talk a minute about what this bill does. We heard testimony and we began this process back in June and we ultimately came to a measure called the Fast Act, fair, accessible, secure and transparent elections because elections should be all four of those things. We've heard bipartisan agreement over the last two years that our election system has flawed and that we need to work together to fix that. We have put forth the measure that does all four of those things, the Fast Act. Let me just speak where I think we could also call this measure is the Georgia Voters Equality Act because that's really what it does. It makes sure that all Georgia voters should be treated equally. The same way that all Georgians should be treated equally. Someone should not have the right to vote be reduced simply because of the zip code that they live in. That's why we work diligently to make sure that voters have access to secure drop boxes. It can't be tampered with and the individual vote should be thrown out. That's why we've made sure that voters will have flexibility on the weekends to have their right to vote. Mr. Speaker, what we're all asking for is for elections to be what they should be. Uniform across our state so that all Georgia voters can be treated the same. I appreciate you for the process that you've laid out before us and again I ask for our members favorable consideration on this issue. Chair recognizes the chairman of the committee for the final 12 minutes of the chairman's time. Thank you, Mr. Speaker. Sometimes when you can't argue against the bill on the floor, you just argue against the bill out there somewhere and unfortunately that's some of what we've heard today. It's one thing to come to this well and maybe be mistaken. We all get our words mixed up a little bit and there was a lot of mixed up words today about this bill, particularly ones that weren't accurate. But in your notebook, you'll see the minority report itself. It's in writing. Somebody had time to think about this. Somebody had time to put down what they were going to put down and unfortunately seems like to me that the minority party decided a long time ago to argue against a concept that they wanted to argue against rather than the one that this body put in front of you because here's what it says in the second paragraph. They don't like the repeal of automatic voter registration. If you look in the next to the last paragraph down there, repeat it again. They don't like the repeal of automatic voter registration. Ladies and gentlemen, this is House Bill 531. It's on your desk too. You will not find that anywhere in this bill. And unfortunately, that seems to be the theme of a lot of the discussion that it's taking place today. There was a Democrat member of the House who had their name on one of the bills that was incorporated into this bill. When the word got to that member, they better take their name off. They went and did that because the word was you can't support anything they put in this bill. And that's unfortunate because there are a lot of good common sense ideas in this bill that is in front of you. Several ideas that have been promoted by members of the minority party. But you won't hear that because that's not the message. Somebody decided a long time ago it's better to use the word voter suppression over and over again because somehow that gets a big turnout. Now that may get a big turn out in elections, but it harms the state of Georgia and the people who live here. Because if you continue to say over and over again something that's not true, it does have a negative effect. We're all human beings. We all make mistakes. Now there was some things however that were said here today that were true. There is a history in this state of Jim Crow Law. There is a history in this state of voter suppression. And ladies and gentlemen, that history does not belong to the Republican Party of Georgia. It belongs to the other party in Georgia. In fact, in fact, since Republicans have been in charge of this state, something has happened to voting. Participation has soared to levels that we have never seen before. And that is why you have the bill in front of you today because as we have in the past, we have brought elections bills to the floor of this house, which increases the accessibility and the ability of people in this state to vote. And that's what House Bill 531 does in front of you today. Now in 2018, after the election, and somehow that seemed to have been forgotten against about who was complaining about election results after 2018. In fact, the person that lost the governor's office still has not conceded. What more must you say about how controversial the election in 2018 was? Now, let's fast forward to 2020. And yes, the shoe may have been on the other foot. But that doesn't change the fact that our job is to come here and look ahead and try to figure out what works best going forward. And that is what you find in House Bill 531. As has been noted already, there are numerous provisions in this bill that have been lauded by people who run elections all across the state. Your elections, you pretend that's asking us to make changes to help them run the system better. And the reason they did that is because they too want to put more confidence back into the system because we've had two close elections. And here's the only thing that I can tell you for sure is that we probably will have more close elections in this state. And that's why you have this piece of legislation in front of you today. It is designed to put confidence back into the voters with common sense ideas. Ladies and gentlemen, support House Bill 531 because it helps put that confidence back into the system. It helps the people who run our elections do a good job. And that is the goal. And that's what we're after. Mr. Speaker, I yield the well and I ask for your favorable consideration. Clerk, or ring the bell. Is there any objection to adopting the committee substitute to House Bill 531? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 531 will vote aye. Those opposed to vote no. And the clerk will unlock the machine. What purpose does representative annullo with rise? Thank you, Mr. Speaker. Parliamentary inquiry. State your inquiry. Is it not true that the state of Georgia has spent considerable sums of money to defend the legitimacy, security, veracity and honesty of Georgia's elections and the election system that the majority party supported and approved, not just for the 2020 presidential election, but several other key elections in Georgia? I'm sure that is the lady's sincere opinion. What purpose does representative Smith rise? Parliamentary inquiry. Is it not true that in sections 4 and 8 the bill forbids any county elections office from accepting grant money? And also is it not true that in 2020, more than 40 Georgia counties applied for and received private grants to help pay the cost of running elections and that every county election supervisor has to adhere to Georgia law and procedure regardless of where the funding came from. And also is it not for the true that these private grants were available for any county to apply? I'm sure the gentleman believes all that to be true and each member has had an opportunity to read the bill. What purpose does representative Wilson rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that just yesterday the former president refused to acknowledge he lost the election? And until he does, I didn't watch his speech to be honest with you. Until he does, there won't be any confidence among the members of the majority party. There was a golf tournament on I didn't watch his speech, so I can't say what he said. All right, that's one more parliamentary inquiry. What purpose is representative Scott rise? Parliamentary inquiry. Is it not true that the current draft of HB531 would eliminate up to half of the weekend early voting hours that are currently available to counties and more than 100,000 voters took advantage of these early voting days and each of the 2020 elections? I'm sure the lady believes that to be true. Is it not further true that eliminated additional weekend voter days disproportionately affect black voters who make up a large percentage of the voter population in counties that traditionally offer weekend voting? I'm sure the lady believes that to be true. All right, have all members voted? Have all members now voted? If so, the clerk will lock the machine on the passage of House Bill 531. The eyes are 97. The Nays are 72. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative Gunter rise? You need to hit your button representative. All right, I have a motion. State your motion. I move that the rules be temporary suspended so that a bill may be read for the first time in a scientific committee. Clerk will read the caption. Unnumbered House resolution by Gunter VIII and Ralston II honoring the life and memory of Ms. Sydney Grace Jones a dedicated intersection in her memory. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered transportation. What purpose does the dean of the House rise? This will speak. I move that the House rules be temporary suspended so that a bill can be read for the first time in a fair to committee. Clerk will read the caption. Unnumbered House bill by Representative Smirie the 135th being titled an act to amend part one of Article 3 of chapter 8 of top 48 physical to George annotated relating to county special purpose local option sales taxes. On the motion of the gentleman that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered ways it means. What purpose does the dean of the House rise? This will speak. I move that the rules be temporary suspended so a bill can be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House bill by Representative Hugley the 136th to be entitled an act to amend Article 1 of chapter 5 of title 26th the physical to George annotated relating the general provisions roll to drug abuse treatment and education programs. On the gentleman's motion at the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered. Helped in human services. What purpose does the dean of the House rise? Let's speak. I move that the House be temporary that the rules be temporary suspended so a bill can be read and signed committee for the first time. Clerk will read the caption. Unnumbered House bill by Representative Spirey the 135th to be titled an act to amend Article 1 of chapter 7 of title 31 and chapter 5 of title 49 at the physical to George annotated relating the regulation of hospitals and related institutions and programs. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered. Health and human services. What purpose does Chairman Newton rise? Make a motion. State your motion. I move that the rules of the House be temporarily suspended so a bill can be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House bill by Representative Newton. No. 120th to be entitled an act to amend Article 12 of chapter 7 of title 31 of the physical to George annotated relating to health care data collection. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered. Special committee on access to quality health care. What purpose does the Representative Meeks rise? To make a motion. State your motion. I move that the rules of the House be temporarily suspended so a bill might be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House bill by Representative Meeks 178th to be entitled an act to amend part one part one B of Article 13 of chapter 6 of title 40. The official go to George annotated relating the operation to farm use vehicles. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Is there objection? Chair here's none and it is so ordered agriculture and consumer affairs. House bill 86 will be postponed until the next legislative day we're going on now to announcements. Chair recognizes Chairman Tankersley for an announcement. Thank you Mr. Speaker. The Intergovernmental Coordination Committee has been cancelled for this afternoon but we've re-scheduled for tomorrow at 1 p.m. and we're in 341. Thank you. Chair recognizes Representative Gullet for an announcement. Thank you Mr. Speaker. Government of the Affairs has been cancelled for today. Thank you so much. Chair recognizes Chairman P3 for an announcement. Ladies and gentlemen of the House we will have our human relations and aging meeting right now upon adjournment room 606 taking up the two bills that we've been studying most recently. 606 immediately on adjournment. Chair recognizes Chairman Timothy Barr for an announcement. All right listen up natural resources the natural resources management subcommittee. We will be meeting tomorrow at 2 p.m. in 341 and this is followed by an email but remember members if you have anyone interested in speaking please refer to that email for the Zoom.\n\ninstructions that's David Hartman and then also depending on outcome of that subcommittee meeting the full natural resources committee will meet at four o'clock or upon a adjournment of the subcommittee whichever is later and again that is 3.41 tomorrow at two o'clock thank you chair recognizes chairman workhyes are for an announcement thank you miss picker the inner stream labor is going to meet the next three days Tuesday Wednesday and Thursday at 10 3 and 10 so just patented to your email thank you chair recognizes chairman lumsden for an announcement the house insurance committee and subcommittee schedule for this afternoon has been canceled they have been rescheduled for in the morning at nine o'clock subcommittee at nine o'clock cap 132 followed by full committee thank you chair recognizes chairman of stration for an announcement thank you miss speaker house judiciary committee will meet upon a adjournment room 132 house judiciary upon a adjournment room 132 we have two bills on the agenda thank you chair recognizes chairman collins for an announcement thank you mr. Speaker the public safety homeland security meeting today has been canceled has been rescheduled for 11 30 tomorrow in room 506 CLOB public safety tomorrow 11 30 CLOB 506 chair recognizes chairman cooper for an announcement thank you mr. Speaker house health and human services committee will not meet today we will not meet today we will meet tomorrow at our usual time at two o'clock and 606 of the L.O.B tomorrow at two o'clock at 606 of the L.O.B. thank you mr. Speaker chair recognizes chairman Parsons for an announcement thank you speaker Rossman the energy utilities and telecommunications committee will meet tomorrow at three o'clock our normal meeting time and room 403 here in the capital thank you chair recognizes chairman Stevens for an announcement thank you speaker tomorrow the economic development tourism committee will meet in 406 at 11 30 thank you that completes our announcements the chair recognizes the majority leader of the house for a motion thank you mr. Speaker the speaker I move that this house stand adjourned until 10 a.m. Wednesday March the third 2021 the majority leader has moved that this house will be adjourned until Wednesday March the third at 10 a.m. tomorrow being a committee day the motion is to adjourn until Wednesday at 10 a.m. all those in favor of the motion will say aye those opposed will say no the eyes have it this house will be adjourned until Wednesday March 3rd at 10 a.m.",
  "updated_at": "2026-02-13T10:18:27.410838+00:00"
}