{
  "video_id": "3d9T-dhAQlc",
  "url": "https://www.youtube.com/watch?v=3d9T-dhAQlc",
  "title": "Rules Meeting Day 39 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Overview:\n- The session focused on discussing several bills, including SB 102 related to cockfighting, SB 131 related to behavioral health parity, and other bills.\n- There was some debate and discussion around the details and implications of the bills.\n\nKey Actions:\n- **SB 102**: Bill to add language related to cockfighting, allowing local law enforcement to have jurisdiction over it.\n- **SB 131**: Substitute bill passed to add one member to the behavioral health and council, the insurance commissioner, and create a parity compliance review panel.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Discussion around SB 102 and concerns about impacts on those raising game fowl for purposes other than fighting.\n- Debate over whether the bill would effectively stop cockfighting or just drive it underground.\n\nVotes:\n- SB 131 substitute bill passed the committee.\n\nAttendance:\n- Quorum was present.\n\nAdjournment:\n- The meeting was adjourned. Next session date was not specified.",
  "transcript": "Good morning everyone if you if you would please come in and take your seats and\nwe'll call the meeting to order.\nRepresentative Hope him to open up with word prayer. Thank you Mr. Chairman. Let us\npray. Heavenly Father please help us to be patient, kind and understanding with\neach other in these final days of the session. As we work to make the best decisions that\nwe can to help the people that we serve. Please watch over and keep us safe as well as\nour loved ones. And please comfort those among us who are struggling and suffering and\nhold them in your hand. We ask this in your holy name. Amen.\nI mean, thank you very much.\nOkay, we'll hear from our visitors over here.\nGood morning, Senator.\nYou've been meeting 6 a.m. this morning?\nCommittee this morning, so I had to, when I woke up at 4, I just drank a lot of coffee.\nThank you, Mr. Chairman.\nMr. Chairman, committee members, I'm here to present SB 102 at some page two, second from the bottom.\nAll we've done with this bill is we've added some language dealing with cock fighting.\nAnd there's been a little misinformation going around number one, I love fried chicken.\nAnd number two, the individual would have to have intent to fight chickens,\nIn Cox in order to violate this law, currently the federal government comes into Georgia and\nenforces this law, and our local law enforcement have no jurisdiction over this, because today\nGeorgia is not illegal, and we are the only state in the United States where it is not\nillegal.\nA leads to a lot of gambling, drug trafficking and sex trafficking, and appreciate the consideration\nof the committee.\nOkay.\nDo you have a question for you, Kim and Powell?\nMy friend, I have concerns about this, but this is dog fighting and you left the language\nin on dog fighting.\nDog fighting is in there, yes or we just added the cock fighting into the dog fighting\nstatute.\nI'm afraid that's what you've done, but I've got a couple of questions in the original\nversion of your bill.\nIt basically even folks who have long since quit fighting roosters were still breeding\nthese.\nDid that have y'all taken that have you taken that language out that would be so arbitrary?\nThe folks who are raising these roosters there is there is nothing illegal about anybody raising gamecocks as long as they're not raising them with the intent to fight them.\nThe way the bill's written it does not make it illegal to raise gamecock.\nIn my district, we still my cousin still raised the game foul. He just doesn't fight him anymore. He shows them.\nSo then this how would this be interpreted folks that raise these roosters and they send them out of stake\nObviously people know when they send a\nRooster of Mexico or wherever it may be\nThat they're doing that for a purpose. So we'll just have any infringement on those people\nI would say from a law enforcement standpoint if there were something where they were sending them across state lines\nThat would be a federal violation anyway\nespecially if they were sent on to Mexico or Puerto Rico where I know\ncock fighting is a sport in those countries so I don't think that would that\nwouldn't impact as much the state jurisdiction as it would federal\njurisdiction which would already be an effect under federal law so did any of\nthe other language I think the first version we looked at folks had a lot of\nold antique gear that your grandfather's and others had it would be illegal to\nto possess those old antique emblems.\nNo, sir, it would only be illegal\nif they possessed those with the intent\nto use them to fight.\nI myself, if it were illegal to possess them,\nI would be violating the law today.\nI have a lot of my grandfather's,\nmy father's and my uncles,\nfighting apparatus from when they fought birds\nwhen I was a kid.\nThank you, sir.\nI have another question, Richard Williams.\nThank you, Mr. Chairman.\nto the author of the bill to follow up on what representative just asked, I'm one of the\nfew probably had a chance to completely to spend a week with a group in Alabama that\nraised fighting cocks, one of the biggest exports to Philippines and believed me, everybody\nknew they were for gambling and from the Philippines they went all over the far east so it's\nI've just the problem I have is it's almost like exporting a forbidden drug, even though\nyou don't get caught, it might not be specific, but when we know the reason, it's a real\nproblem to be able to export these birds.\nYes, sir.\nThat would currently be a violation of federal law and cock fighting is illegal in Alabama.\nIf it didn't stop much.\nNo, sir.\nAnybody that wants to break the law is going to take more than passing law to stop them.\nOkay.\nThank you, sir.\nI'm just here for Senate Bill 177, it's a transparency bill related to foreign funded activities.\nOkay, 177.\nDon't see any questions.\nThank you sir.\nThank you all.\nOkay.\nSenator Williams.\nGood morning, Mr. Chairman, members of the committee.\nSecond page, a little over halfway down, Senate Bill 29, this has to do with DNA sampling collection and analysis of DNA samples of someone who's arrested for committing one of the seven deadly sins at the time of booking when they are fingerprinted, they would be swabbing them for DNA sample.\nOkay.\nDon't see any questions.\nThank you, sir.\nOkay.\nAnd on the back page, I still have Senate Bill 260, which is Central State Hospital Redevelopment\nAuthority revitalizing that one.\nOkay.\nDon't see any questions.\nThank you.\nThank you very much.\nThank you.\nSenator Wolfe.\nGood morning, on page four, Senate Bill 284 would allow the securities division to require an investment advisor that defrauded Georgians to allow them to require them to return the funds to the defrauded investors.\nCurrently, the only tools they have are civil fines,\nsuspending the license issued in the CCS order.\nThat kind of thing.\nOkay.\nDon't see any questions.\nThank you.\nOkay.\nYes, sir.\nYes, sir.\nI'm Reed.\nChair and members of the committee,\nI believe Senator Sam Watson is coming for Senate Bill 59,\npertaining to municipal sovereign immunity,\nbut I'll let him request that.\nOkay.\nThank you.\nDo we have any requests from committee members?\nCarefully dimsy.\nGood morning, Mr. Chairman.\nI think on your desk you have a substitute to SB 131.\nThis is to deal with an important issue\nto the house particularly involving parity.\nIt adds one member to the behavioral coroner\nand council, the insurance commissioner,\nand a parity compliance review panel,\nwhich is so important right now for us to really make sure\nthat everyone is treated with mental health issues\nthe same way they are with their own health.\nThis passed the House 170 to two on March 3rd.\nOkay.\nDon't see any questions for you.\nJim Erwin, you had a request?\nYes, sir.\nSenate Bill 17, I believe it's before you also.\nIt was substitute of some language members.\nRemember this is the bill for the crisis alert for schools\nas well as their mapping.\nThe substitute deals with the mapping allows the school system\nif they recently have purchased these maps\nand already have them in place.\nWe realized we needed to give them some data\nto use those maps and to allow the administrator\nto approve those maps for the crisis alert.\nDon't see any questions.\nOkay, you've heard the explanation on that.\nOn Senate Bill 131, is there a motion to approve?\nPlease.\nSo I have a motion and a second to approve the substitute.\nHave a question, Chair.\nLeader, hugely.\nMr. Chairman, I wanted to offer something\nas a substitute for that bill as well.\nnot changing what the general lady has offered, but I think it will be wise for us to add the\nlanguage from representative tile or Paul Smith's bill as it related to Tana and making\nthose changes to Tana if that will be possible for consideration by the committee.\nOkay, we would need the proposed substitute and I don't have that and we don't have copies\npassed around so I'm going to prove that out of order at this moment.\nOkay, so on Senate Bill 131, is there a move to approve that?\nMove to the second, any opposition? Okay, it's been approved.\nAll right, now on Senate Bill 17, same thing you've heard the explanation of that,\nis a motion to approve that and move in second in your position. Okay, those are to approve.\nOkay, and let me mention something to you about the substitutes as well. If you have a substitute,\nwhat we need to have you to do is bring 35 copies in the original 01 and 02 of that substitute,\nto Leo in the room's office.\nReason we ask you to make those copies, our printer is on the blink up there, and we\ncan't make the print for you, so if you have a substitute, we need the original one and\ntwo plus 35 copies, and that needs to be turned into the room's office, so we'd ask you\na cooperation on that.\nOkay, now, let's set a calendar, today this will be a supplemental calendar for day 39\nunder modified structure. You've heard Senate Bill 131 by substitute, that's the\nLC-33-9827ERS. Have a move in a second. Is there any opposition? Okay, it's on.\nand then Senate Bill 17 by substitute that's LC 49 2 4 0 8 s have a move in a\nsecond is there any opposition that's on okay that sets our supplemental\ncalendar for today and I suspect we'll be seeing you later on in the day y'all\nhave a good day thank you\nYou\n",
  "updated_at": "2026-02-12T17:18:15.214776+00:00"
}