{
  "video_id": "3fEwvzbRVVM",
  "url": "https://www.youtube.com/watch?v=3fEwvzbRVVM",
  "title": "Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections session:\n\n## Overview\nThis session focused on legislation related to income taxes, property taxes, and immigration enforcement. Senate Republicans announced their priorities for the 2026 legislative session, while Senate Democrats proposed bills aimed at regulating ICE agents in Georgia.\n\n## Key Actions\n- **SB 204**: Originally a Democratic bill from 2025 that allowed certain non-violent felonies to be charged by district attorneys without the involvement of a grand jury. The bill was amended to include language from SB 163, which would allow individual gun owners to bring legal action against local governments who they feel infringed on their second amendment rights.\n- **SB 389**: Proposed by Senate Democrats, would require ICE agents to remove their masks and properly identify themselves during arrests.\n- **Proposed Bills**: Democrats also proposed bills to allow civil lawsuits against ICE and require a warrant for arrests in schools, hospitals, and churches.\n\n## Bills Introduced (First Reading)\n- SB 390: Proposed by Senate Democrats, would require legislative approval for National Guard deployment in Georgia.\n- SB 192: Not mentioned in the transcript, but likely introduced during the session.\n\n## Notable Moments\n- Senate Democrats held a press conference to announce their legislation affecting immigration enforcement, calling for ICE agents to \"unmask\" and be held accountable.\n- Republican lawmakers criticized the Democrats' proposed bills, saying they were unnecessary and that law enforcement leaders should make decisions about tactical gear, not legislators.\n\n## Votes\n- SB 204 was adopted by substitution in a 32-21 party-line vote, but failed to garner the two-thirds majority needed to be sent immediately to the Governor.\n\n## Attendance\nThe transcript does not mention any quorum or attendance issues.\n\n## Adjournment\nThe session adjourned, but the next session date is not specified.",
  "updated_at": "2026-02-12T01:24:48.145987+00:00"
}