{
  "video_id": "3fEwvzbRVVM",
  "url": "https://www.youtube.com/watch?v=3fEwvzbRVVM",
  "title": "Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers 2026 | Day 2: Income Tax Debate and ICE Protections session:\n\n## Overview\nThis session focused on legislation related to income taxes, property taxes, and immigration enforcement. Senate Republicans announced their priorities for the 2026 legislative session, while Senate Democrats proposed bills aimed at regulating ICE agents in Georgia.\n\n## Key Actions\n- **SB 204**: Originally a Democratic bill from 2025 that allowed certain non-violent felonies to be charged by district attorneys without the involvement of a grand jury. The bill was amended to include language from SB 163, which would allow individual gun owners to bring legal action against local governments who they feel infringed on their second amendment rights.\n- **SB 389**: Proposed by Senate Democrats, would require ICE agents to remove their masks and properly identify themselves during arrests.\n- **Proposed Bills**: Democrats also proposed bills to allow civil lawsuits against ICE and require a warrant for arrests in schools, hospitals, and churches.\n\n## Bills Introduced (First Reading)\n- SB 390: Proposed by Senate Democrats, would require legislative approval for National Guard deployment in Georgia.\n- SB 192: Not mentioned in the transcript, but likely introduced during the session.\n\n## Notable Moments\n- Senate Democrats held a press conference to announce their legislation affecting immigration enforcement, calling for ICE agents to \"unmask\" and be held accountable.\n- Republican lawmakers criticized the Democrats' proposed bills, saying they were unnecessary and that law enforcement leaders should make decisions about tactical gear, not legislators.\n\n## Votes\n- SB 204 was adopted by substitution in a 32-21 party-line vote, but failed to garner the two-thirds majority needed to be sent immediately to the Governor.\n\n## Attendance\nThe transcript does not mention any quorum or attendance issues.\n\n## Adjournment\nThe session adjourned, but the next session date is not specified.",
  "transcript": "Music\nRepeat after me. No ice. No ice. No murders. No murders. No murders. No murders. No murders. My name is Josh McLaren. Thank you again.\nAnd I ice protesters join a press conference by Senate Democrats to announce legislation\naimed at regulating ice in Georgia.\nGood evening.\nWelcome to lawmakers on this day two of the Georgia legislative session.\nI'm Donna Lowry in Atlanta.\nMore on ice bills introduced by Senate Democrats coming up.\nSenate Republicans also had news for the press today as they announced their 2026 caucus\npriorities.\nOn the show tonight, we'll hear from the leaders of both parties about what they discussed\nat the Capitol today.\nGeorgians, like the rest of the country, have a multifaceted relationship with AI.\nIt's new and exciting, but it can also be frightening, especially when it comes to children.\nWe're going to talk with lawmakers who will discuss both aspects of AI.\nWe'll get to all of that after a wrap-up of the day of the Capitol from our correspondent,\nSarah Callis.\nHi, Donna.\nLawmakers looked into state approaches to national immigration enforcement questions.\nOn day two, the Senate jumped to a quick start today when they passed the first bill of\nthe session.\nSB 204 was originally a Democratic bill from 2025 that allowed certain non-violent felonies\nto be charged by district attorneys without the involvement of a grand jury.\nlast year's legislative session, the House gutted that bill and inserted language from Senate\nBill 163, which would allow individual gun owners to bring legal action against local\ngovernments who they feel infringed on their second amendment rights by finding or confiscating\nguns that owners left in their unlocked vehicles.\nBut the bill didn't get back to the Senate with the changes before the session ended.\nColton Moore who authored SB 163 made his case for why the new version of the pro-gun rights bill\nshould be adopted. Right now there are 41 Georgians in Savannah who are victims of a crime\nwho are now been made criminals because some municipality like Savannah has passed gun\nlegislation that is more stringent than what this General Assembly has already passed.\nIt gives those preemptive powers to the citizenry, so any citizen can sue a place like Savannah\nfor violating their gun rights at a tune of $25,000 per occurrence.\nThat puts teeth into it and they don't have to depend on some bureaucracy like our attorney\ngeneral to take care of their rights.\nBut the Democratic Senator who represents Savannah disagreed not only with the bill, but\nwith the premise as well.\nThe city of Savannah has passed, regulates the car and not the gun.\nAnd this has reduced gun thefts of over 30% in one year in the city of Savannah alone.\nThe city overwhelmingly supports the second amendment, but they also believe that public\nsafety is at risk when guns are stolen from unlocked cars.\nThe bill was adopted by substitution, 32-21, along party lines, but failed to garner\nthe two-thirds majority needed to be sent to Governor Brian Camp immediately.\nMeanwhile, the House gabbled in and gabbled out without passing any bills on day two,\nbut they gave special recognition to the Korean American community in Georgia.\nAt an afternoon press conference, Democratic lawmakers announced legislation affecting\nimmigration enforcement.\nSenate Bill 389 would require ICE agents to remove their mask while making arrests\nin where proper identification.\nWe have men who are unidentifiable, roaming our streets,\nsnatching up people, and taking them, and then they are able to commit crimes and hide because we don't even know their identity.\nSo my bill will call for ICE agents to take off their mask, to show their face.\nWe have men who show up in tactical equipment, but nothing that identifies them as federal agents.\nI don't know if they are a part of a vigilante group that's just to deputize themselves to\ngo and steal my friend or if they're an agent of ice.\nSo my bill demands that they put on a badge, that they have something on them that tells\nus undeniably that they are a federal agent.\nMy friends, it's time to unmask ice.\nDemocrats also propose bills to allow civil lawsuits against ice and require a warrant\nfor arrests in schools, hospitals and churches.\nWhen ICE overreaches, they need to face real accountability in courts of law.\nBut accountability is not necessarily justice, because Renee Good will not get justice, and\nthere's no way to give her justice.\nReal justice making sure this never happens in the first place.\nThe legislation comes days after ICE officers in Minnesota fatally shot a woman.\nBut Republicans say the bills are unnecessary, and lawmakers reacted too quickly to the\nMinnesota shooting. As far as wearing a tactical gear, whether it be a mask, a helmet or\nanything else, that is a decision made, based, case by case, and the supervisors make\nthose determinations. Not a group of legislators sitting in an air-conditioned heated room\nin the middle of Atlanta, Georgia. That's the responsibility of law enforcement leaders\nto make that decision. The Democrats also proposed a bill requiring national guard deployment\nin Georgia to receive legislative approval.\nAlso today, Governor Brian Kemp and legislative leaders\nin the House and Senate gathered\nat the annual Faith and Freedom Coalition's\nlegislative luncheon.\nTomorrow, lawmakers will start their day early\nat Georgia Chambers Annual Ex-Nissues legislative breakfast.\nThere, they will hear from Governor Kemp\nabout his priorities for his last legislative session.\nThat's my capital report, Donna.\nThanks, Sarah.\nWe're going to get deeper insight into what to expect during this 2026 legislative session\nfrom two leaders in the Senate.\nHere in the studio is the newly elected Senate President Pro Tem, Republican Senator Larry\nWalker, the third of Perry.\nHe has served in the Senate since 2015 and is former chair of the Insurance and Labor\nCommittee.\nSo we're so glad he's here also joining us is the Senate Minority Leader, Democratic\nSenator Harold Jones, the second of Augusta.\nHe's been in the Senate since 2014,\nand his committees include Judiciary.\nWelcome to lawmakers, both of you,\nwith your NW names, the second, third.\nOkay, all righty.\nPro Tim Walker, you led the Senate caucus press conference\ntoday, and the caucus calls for a focus\nthat it says, re-ignite the American dream.\nYou broke down priorities into three areas,\nthe cost of living, quality of life, and the next generation.\nSo let's start with cost of living, which looks at taxes.\nTell us a little bit about that.\nSure, Donna.\nSo everywhere we, all the constituents we hear from,\nwhether it's Blue Ridge, down to Bainbridge,\nthey're straining under the rising cost of living.\nAnd we hear that, and we're going to focus on that.\nIt's cost of housing, cost of groceries, cost of childcare.\nAnd the American Dream, this is the 250th anniversary\nof America and Georgia.\nAnd sadly, the American Dream seems out of reach\nfor too many people.\nAnd so our focus is gonna be on affordability.\nYeah, so I know one of them has to do\nwith the state income tax rate.\nYou mentioned that.\nAnd then the stop, it says stop skyrocketing\nlocal property tax bills by capping home valuations.\nSo I've had the press have your little flyer here.\nTell us about that.\nSo under Lieutenant Governor Jones's leadership,\nwe had a study committee over the interim\nto look at our income tax situation.\nAnd we have a plan to eliminate state income tax\non the first 50,000 of earnings for a single filer\nor 100,000 for a married filer filing jointly.\nSo that will eliminate the state income tax\non two-thirds of Georgians,\nand we're very excited about that.\nWe also hear from our constituents on a regular basis\nthat they're skyrocketing property tax,\nand we've already dropped a bill to address that,\nwhich would be a floating homestead exemption\nthat would limit the increase on property tax\nto the rate of, on your home, to the rate of inflation.\nOkay, thank you.\nAny comment on any of that?\nI know you, the income tax, you've spoken out about that.\nHe's spoken out about the income tax,\nbut I think one of the things is affordability,\nof course, is the buzzword of the year.\nAnd one of the ways we're going to be attacking\nthat particular issue is through Medicaid expansion\nand also actually having tax credits\nwhen people actually bring their premiums down\nas far as their health insurance is concerned.\nBecause that is a major crisis within Georgia,\nhealth insurance.\nAnd so number one, we'd have Medicaid expansion,\nwhich you can actually help get more people insured,\nand over a million joins right now,\nwe're depending on those federal tax credits.\nSo at some states have done,\neven before what's recently happened,\nis they created their own tax credits,\nso their people could actually afford\nthose premiums or deductibles.\nAnd so what we've been proposing,\nwe actually started it last year with SB192,\nand it will continue this year\nto actually have our own tax credits\nto address that particular issue.\nSo when we talk about affordability,\nthe question really becomes,\nwhat issues are you looking at?\nAnd then secondly,\nhow do you actually make those things affordable?\nThe thing is, you're both talking affordability.\nThat's the main thing.\nI want to focus on you for a little bit,\nbecause I want to make sure we get,\nyou spoke at the press conference today\nabout ICE and Democrats present at three bills.\nYou have one that is SB 390,\nand it is to put limits on the National Guard.\nTell us about it.\nRight, what it basically says is out of a state\non National Guard cannot come in unless\nit has the permission of the governor.\nAnd so other states have actually done this too.\nSouth Carolina being one, Kansas being another Washington\nto actually pass a similar law.\nSo it's not anything particularly unusual.\nAnd so what the press conference was day about\nwas number one, we were focusing on ICE,\nI think we saw that.\nBut then secondly, it's actually a larger issue.\nAnd that issue is the fact that a lot of people\nare actually concerned and scared\nabout the overreach that this administration is doing.\nAnd quite frankly, after the last event that we had in Minnesota,\nit almost seems like death was actually\nnormalized to some extent by this president,\nthe way the callus where they kind of looked\nat what had taken place.\nAnd so people are nervous and they're scared about what's going on and we want it to address\nthose particular issues.\nOkay.\nI didn't know whether you want to comment on that or we can move on to quality of life.\nLet's talk about quality.\nGod tell us what the quality of life, what you're talking about in terms of that.\nWell we know we have to have safe communities and so we're going to continue to invest in\nsafe communities.\nWe also know that part of your quality of life is having opportunities to enjoy the\ngreat outdoors.\nGeorge is a beautiful state and we're going to look at ways to further protect lands.\nOur state is growing because we've had strong leadership and our economy is attracting\na lot of industry and a lot of manufacturing, which we're proud of, but we want to make\nsure we do protect opportunities to protect lands and let people enjoy the great\noutdoors.\nI was real proud to have carried, sponsored, and carried the George Outdoor Stewardship Act\nseveral years ago under Governor Deal, and I hope we can maybe expand that, and that's\nwhere a portion of the sales tax revenue on outdoor recreation equipment goes to a\nquire in land to protect for the public use.\nOkay.\nAnything else you wanted to mention in terms of democratic priorities in your caucus?\nAnother issue you're going to be housing, which was also mentioned, but the way you actually\napproach it is going to be key.\nSo some of those issues you can deal with from kind of like a regulatory level, such as zoning.\nBut also you want to look at the fact that private equity, Georgia is one of the worst offenders as far as private equity buying so many homes.\nHere's the problem with that. What happens is they're not buying those homes for people to live in as a home.\nThey're buying those homes that actually jack up the rent store to speak.\nAnd that becomes problematic.\nAnd so we're actually gonna have a bill to talk about trying to limit private equity buying up all these homes in Georgia\nAnd as I said in Atlanta actually is a victim of this quite frankly and other parts of Georgia are too\nSo number one, we'll look at regulatory features and then number two, we'll look at private equity to try to get people into their homes\nOkay, let's get to your next generation because part of it deals with something\nWe're gonna talk about later and that's protecting children when it comes to AI\nBut you're really focusing on things when it comes to schools and those kinds of things\nYeah, so AI certainly has a lot of benefits to it.\nWe just want to make sure they're guardrails around it so that, for example, you don't want\nAI to be imitating a child and be on social media that would damage that child.\nThere just needs to be guardrails around it.\nAnd I'm sure your next guest will know a lot more about it than I do, but it's an interesting\ntopic, but it is a little, as you said in the intro, a little scary to me in my generation\nanyway.\nYeah, so also absenteeism, you guys looked at and literacy rates, so those are two things\nyou're going to look at.\nYeah, we have a chronic absenteeism problem and we're going to address that this year.\nI will say that I do agree with the leader, minority leader on the private equity, buying\nup and driving up the cost of housing that's something I think we can work\ntogether on and I look forward to that. Yeah absolutely. So one of the things I\nwanted to ask before you go is what we're hearing is that you from both sides is\nyou guys are agreeing on a lot. Yes. Do you agree that that's true? We're\nagreeing on a lot we just have to make you see the details. That's not always\ngoing to be the key but I think one of the good things is that sending\napproach and walking myself I should have great relationships. I think that\nat what add to the possibility of getting things done.\nSo you agree that we may not see things as contentious\nas we've seen in the past?\nI hope we're going to just focus on putting Georgia's first\nand focus on kitchen table issues that really matter.\nNot get caught up in all the political grandstanding,\nthis is an election year, and all the political posturing.\nI hope we can keep the main thing, the main thing.\nOkay.\nWell, I want to thank you both for coming on the show,\nand maybe we'll have you on a little bit later.\nThank you.\nAll righty, thank you so much.\nWell, coming up, the good, the bad,\nand the unknown when it comes to technology\nand artificial intelligence.\nTwo lawmakers update us on what to expect during the session\non everything from air taxis to AI chat box and more.\nLawmakers is made possible by Georgia Farm Bureau.\nWith over 80 years of helping everyone understand\nthe importance of agriculture in our state.\nAfter all, Ag is Georgia's number one industry.\nFood and fiber production represents over 74 billion\nin output of Georgia's strong economy.\nThe Georgia Farm Bureau legislative team works\nto represent producers across Georgia at the state capital\nduring the session and year round.\nGeorgia Farm Bureau, the voice of Georgia farmers.\nPeople put their faith in PBS because they know\nthat it is constantly delivering quality.\nIt covers the whole of the United States.\nIt's a free and independent media.\nWe go where the viewers are.\nWhat are the conversations that are happening right now?\nWe feel that civil discourse is a civic responsibility.\nWhat we do is authentic reporting the people and trust.\nWe give time so you can hear voices on all sides of an issue.\nThis is the place that people turn to for stories that matter.\nAnd they know that when they walk away,\nthey will have learned something about the world around them.\nThat's why this makes PBS important for daily life and the Nanda world.\nThank you for joining us.\nCommunity, learning, working, playing, celebrating, doing life is always better together.\nAt GPB, we aim to provide you with the tools to be able to do life together well.\nOur mission to educate, inform, and entertain inspires everything from our wide range of\nprogramming to our stimulating radio conversations to our fun in-person events.\nWe've got something for everyone.\nVisit gpb.org slash community to learn more about our upcoming events.\nWelcome back to lawmakers. I'm Donna Lowry.\nTechnological innovations speed up faster than many of us can keep up.\nOur state is helping to keep things moving.\nAccording to the Georgia Department of Economic Development, Georgia is proudly\nat the forefront of digital health, cybersecurity,\nfintech, and creative technology.\nNow, that's great for Georgians in the workforce,\nbut as technology grows, there's a need to create laws\nthat protect Georgians.\nJoining me are Republican Representative Todd Jones\nof South Versailles. He chairs the House Committee\non Technology and Infrastructure Innovation\nand Democratic Senator Sally Harrell of Atlanta.\nher committees include government oversight.\nShe also co-chaired a Senate study committee\non social media, AI, and children over the past few months.\nAnd welcome to lawmakers to both of you.\nWe're glad to have you here.\nI'm going to start with you, Chairman Jones.\nGive us a general picture of the types of innovation\nthat your committee will look at technology,\nthis coming session.\nLook, Donna, for over a decade,\nwe've been the number one place to do business.\nWe're now shifting to becoming the most innovative place\nto do business in the entire country.\nWe're going to take leadership in places like mobility,\nin terms of air taxis, in terms of autonomous vehicles.\nWe're going to take those folks that have been,\nin a sense, stuck in their home because of disability,\nbecause of old age.\nAnd we're going to help them get out, vis-a-vis AV.\nWe're going to bring traffic off into the air.\nWe're going to go ahead and use a creative manufacturing.\nA lot of people call that 3D printing\nto absolutely expand everything that we can print\nor an intense manufacturer here in Georgia\nand for outside of our state.\nIn other words, we're going to take literally what AI can do,\nwhat human beings can do, robotics can do,\nand transform education, health care, transportation,\njust about everything that a Georgian touches\nis gonna be transformed in the next five to 10 years.\nAnd you'll need to put guardrails on that.\nWe are gonna have to put guardrails on it,\nbut I'll tell you this, on the innovation side,\nwe wanna make sure that this is very similar\nto the third industrial revolution,\nwe're in the fifth industrial revolution.\nWhen Carnegie and Rockefeller and Edison,\nwhen they were making those changes,\nand they were giving those great innovations\nin steam and electricity,\nThere wasn't a lot of guardrails on the innovation side.\nWe want to do the same thing.\nWe want to give our innovators a chance to innovate\nand really change the game economically,\nhealth care, and education.\nNo, I know you have done a lot with urban transportation.\nWe'll get to that in a moment.\nSenator Harrell, I want to actually start with you\nwith the committee we talked about\nand play a clip of a Decap County mother\nwho talked at one of the final ones.\nShe testified before your committee on October 10th.\nHer name is Kay Fullerton.\nShe described how her fourth grader and his friends found an AI chat box but with a hunger\ngames theme.\nAnd they started to have a conversation with it because they're kids and curious.\nAnd that quickly descended into sexualized content on the school network in fourth grade.\nAnd this wasn't blocked because of the nature of the website.\nThis is like CHAT GPT have these developer tools that allow developers to access these\nlarge language models for fractions of a penny with no oversight on where that content\ngoes after it's produced by the model.\nYeah.\nAnd Senator Harold, one of her concerns is, parents can't preview what these bots are doing.\nSo there's no way of monitoring any of that.\nSo talk a little bit about that.\nThat's right.\nThis parent came to me during session last year and told me this story.\nand I immediately tried to find a bill to amend\nbecause it was late in the session\nso that we could fix this issue.\nUnfortunately, the bill didn't pass\nand so that's when I really pushed\nto have this study committee.\nThis issue is personal for me.\nMy kids were like in middle school\nwhen everybody started getting smartphones\nand I could see that these programs on these phones\nwere fundamentally changing my children\nand I tried to sound the alarm\nand no one would hear me.\nAnd so I've waited eight, 10 years\nto be able to do something about it.\nNow we have enough millennials\nwho have had kids who were scared about the phone\nand what it can do to their children\nthat we have enough collective voices\nthat we can do something about it.\nYeah, I want to clarify something.\nThey watched at school and there are,\nthere's a way they block things.\nSure.\nBut they were able to get through.\nRight, because this is new,\nthese AI companion chatbots are new.\nAnd so the companies that help the schools monitor\nwhat kids can access, they weren't on top of it.\nAnd so this just slipped through.\nNow, Ms. Fullerton did say that the school responded\nreally, really well and took care of the problem.\nBut this technology, it changes so quickly\nthat schools can't keep up, parents can't keep up.\nSo in the end, our committee made several recommendations\nthat we are turning into legislation now.\nOkay, we're gonna talk about those in a minute.\nI wanna get back to you, going back and forth.\nYou certainly agree with all of that,\nand I've heard that there are members of your party\nwho'd certainly agree that there needs to be\nsomething happening when it comes to these chat box\nand things like that.\n100%, look, we're seeing basically data telling us\nthat upwards of 75% of 15 year-olders in our state\nconsider their AI chatbot their best friend.\nThey're best friend.\nWe have to find a way to get that socialization\nto be fundamentally different.\nWe got to put the guardrails on,\nbut frankly, we need to help of 11 million Georgians.\nBecause look, legislation can create that guardrail,\nbut we need the parents.\nWe need the grandparents, the uncles, the aunts,\nand everyone else to understand this is changing,\nand it's changing monthly.\nIt's changing daily, so all of us need to be super diligent\nin terms of what we're doing and what we're doing\nwith our children, and I know that's hard.\nI got four children, and I know how hard that is to do,\nbut between the guardrails that we can put on\nwith my colleague in the Senate,\nand what we can also do to work with 11 million\nGeorgians, I think we can make a difference.\nYeah, talk a little bit about what you're expecting\nto do with some legislation.\nRight, so what we've realized is that these big tech\ncompanies have discovered through the years\nthat the more engaged they keep the users,\nthe longer they keep them on the phone or the iPad,\nthe more money they make, selling information to advertisers.\nSo, they're making money off of our kids' attention.\nAnd they're doing that now by designing the platforms\nand the products to be addictive.\nDesigning things in where if you do something,\nthey give you something back, they give you a reward\nthat gives a little dose of dopamine\nthat makes you feel good.\nSo, the first thing we want to do is regulate the addictive design.\nWe don't want addictive products designed for our children.\nAnd the second thing we want to do is address the chatbot, the companion chatbot issue.\nThis is critical.\nThis is going to make the situation so much worse.\nChildren are using these chatbots, they're becoming friends with these chatbots, and the\nparents, they don't know yet that their children are interacting with these chatbots.\nWe had parents who told horrible stories about the chatbot actually telling the child to\nkill himself, to commit suicide.\nI listened to that, it was just terrifying.\nIt's awful.\nNo parent knows what this chatbot is going to say to their child.\nSo those parents out there, I would tell you, find out if your children are using companion\nchatbots, if they are, please teach them about the dangers.\nWe want to hold these companies accountable.\nIf a parent bought a doll and the doll said, kill yourself, that company would be liable\nbecause they had a product, just like cars.\nhave to study safety measures before they bring out a new model. We want these\ncompanies to be responsible for the products they put out in the harms that they\ncause in terms of AI chatbots. And then finally we want to give parents more\npower. So the parental controls they're very difficult to use and parents are\nfrustrated and the kids find their ways around them. So we're supporting\nsomething called the App Store Accountability Act, which when a parent buys a phone for\na child, the phone is linked to the parent's phone.\nIf a child tries to download an app, a notification is sent to the parent, and the parent can decide\nwhether to approve the app or not.\nThat's easier than parental controls.\nAnd then the very last thing we're doing, last year we passed a law banning cell phones\nin schools K through 8.\nI believe we are going to come back and add high schools.\nAnd I know that they're talking about that both in the Senate and certainly in the House.\nThat's going to happen.\nSo that's good.\nI want to get back to you about something, while we still have time, I know that when it\ncomes to the air taxis, something special is going to happen in 2026.\nAnd you've been working on this for a long time.\nFor a long time, knock wood, we're going to get special permission to be able to land\nan air taxi right in the middle of the Georgia World Congress Center at the kickoff.\nAnd I don't mean that as a pun at the kickoff of the World Cup.\nAnd this is literally the world looking at us, billions of people looking at Atlanta\nand being able to land an air taxi and simultaneously bringing up an autonomous vehicle and hopefully\nhaving the FIFA head, our governor, our speaker, and our lieutenant governor going into a 3D\nprinted mini house.\nBecause we want to show that affordable housing can be done, it can be done in our state\nand we can do it through a creative manufacturing.\nSo we're going to go ahead and put all together basically an entire portfolio of innovation\nfor the world to see that George is leading the way.\nSo they're going to start at this very report.\nVert report?\nVert report, up in the North Bolton, right?\nThe governor and all of these officials\nare going to go to the Georgia World Congress Center\nand then there's going to be this house there.\nThat is our hope.\nAnd we're hoping to get the final approvals on that.\nAnd any of you who know anyone at the FAA\nwould like to be able to get that from them.\nAnd for people who don't understand,\nThese taxis are going to go along the interstate,\nand they'll be able to go to Hart's Field\nand different things like that.\nYeah, look, imagine an idea where you're going to be able\nto go out to your rideshare app,\nand you're going to have a choice of,\ndo you want to go autonomous, do you want to go driver,\nor do you want to go in the air?\nAnd you're going to be able to go in the air\nand literally go from, say, to the northern arc\nto Fox Theater, to the northern arc into the airport.\nYou name it, you're going to now have a defined commute time\nas opposed to guessing what your commute time's\ngoing to be based on traffic.\nand autonomous.\nAnd autonomous.\nAnd autonomous.\nYeah.\nWell, okay.\nSo much to talk to you too about.\nThank you so much for coming on.\nWe'll keep up with these issues.\nThank you so much.\nThank you for also joining lawmakers today.\nTomorrow on day three of the session, House leaders\nfrom the majority of minority parties will outline\nwhat they would like to accomplish this year.\nAnd we'll also hear from members of the Senate Committee\non eliminating the state income tax.\nHave a nice evening.\nYeah.\nThank you.\n",
  "updated_at": "2026-02-12T01:24:48.145987+00:00"
}