{
  "video_id": "3lTBb_S_g8c",
  "url": "https://www.youtube.com/watch?v=3lTBb_S_g8c",
  "title": "1/23/2024 Senate Committee on Children and Families",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 13,
  "summary": "Overview:\nThis Georgia Senate Committee on Children and Families session focused on introductions and a Department-sponsored bill related to supporting foster children who run away.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Committee members introduced themselves, sharing their backgrounds and connections to children/families.\n- Senator Robertson presented a Department bill to utilize the National Center for Missing and Exploited Children to assist in recovering runaway foster children.\n\nVotes:\nNone detected.\n\nAttendance:\nA quorum was present, with all committee members introducing themselves.\n\nAdjournment:\nNo specific adjournment time was provided. The next committee meeting was not mentioned.",
  "transcript": "You\nYou\nYou\nYou\nI'm going to go ahead and get started, although we're waiting for the senator who's going to present the bill, but we'll go ahead and do a couple things first.\nI'm going to ask our Chuck Payne to open us in prayer, and that's number six.\nNumber six.\nOkay.\nLet's pray.\nHeavenly Father, we come to you today, Lord, and we just praise you for all your many blessings upon our lives.\nEach and every day is a blessing.\nEach breath of life we are given is a blessing of you.\nOr we just ask you to guide us and direct us in all things that we do, especially with the children and family of our state.\nWe thank you Lord for all the things we will all our successes ahead of time for we know with you all successful sure we come\nWho's in Jesus name we pray amen?\nWe haven't met for quite a while although it seems like yesterday because of our study committee that we had in the office\nIs on foster care and adoption and we made some\nVery robust recommendations that we'll be showing up as legislation a little bit later this session\nI thought we might take this opportunity to introduce ourselves, and I first wanted to\ngive a shout out to Commissioner Broche and her staff.\nYou guys raise your hands over there.\nThank you very much for the hard work that you've been doing on this issue.\nWe'll start down with Senator Burns.\nYou want to introduce yourself, tell people where you're from, and what mic are you?\nLucky 13.\nOkay.\nLucky 13.\nGood.\nI represent the 23rd Senate District of Georgia.\nIt is East Georgia down the Savannah River,\nbut from Augusta, Columbia County area down\nthrough my hometown of Sylvainia, big city.\nSenator Hatchett, you wanna introduce yourself?\nYes, and I'm sorry, I'm a little late.\nSenator Bo Hatchett, I'm from Habersham County.\nRepresent District 50, which is nine counties\nin Northeast Georgia, honor to be on this committee.\nI've got four little girls at home,\nso I know a lot about children and families.\nOkay.\nThank you, Senator Estevez.\nGood afternoon, everyone.\nJason Estevez, the proud state senator\nfrom Senate District 6,\nwhich is part of City of Atlanta, Fulton Cobb,\nand I also have a couple kids and a wife,\nso children and family,\nand former public schoolteachers, well,\nSo I've seen it from a couple of different angles\nand honor to be on this committee.\nThank you.\nThank you.\nHi, I'm Senator Kim Jackson.\nI'm from the cab, represent the cab and, oh,\nGwinnett counties, almost at Fulton, Wrong County.\nAnd since we last met formally as a committee,\nI became a new parent.\nMy wife and I welcomed a two-year-old into our home.\nSo congratulations.\nAnd I'd like to introduce Hannah Holcomb,\nwho is helping keep herd the cats for this committee.\nWe appreciate your work.\nAnd then we'll go over to Senator Brass.\nThank you, Madam Chair.\nMy name's Matt Brass.\nI'm from District 28, which is Calida County,\nHerd County, and currently part of Fulton,\nand part of Douglas.\nAnd we'll soon be just Carol, Herd, and Calida.\nSo, and potentially district six, but potentially not.\nAnd I have a wife and three children\nthat are 10, eight, and seven, two boys and a girl.\nAnd they're crazy.\nSenator Panty.\nHave you ever wondered if you're adding to their crazy?\nMy name's Chuck Payne.\nI've represented the 54th Senate District,\nwhich is Whitfield, Murray, Gordon Counties,\njust in Northwest Georgia.\nFor that, I was retired state juvenile probation officer\nfor 30 years, case worker for 30 years.\nI love my job because I love my kids.\nAnd so I have married, my wife Angie,\nand we have two children, my son, Chaz,\nand my daughter Heather, and my daughter Heather,\nand her husband, Daniel, have three children,\nand they are my favorite thing to do.\nThank you.\nSenator Merritt.\nGood afternoon, everyone.\nI am Senator Nikki Merritt.\nI represent the ninth district that\nis in Gwinnett County in the cities of Grayson,\nLawrenceville, and Lilburn.\nI live there with my husband, my two dogs,\nand I am a proud mom of two young adults, a boy and a girl.\nBoth one just graduated college, actually,\nand one is on his coming up on his senior year.\nSo I think I have the t-shirt on our new parents.\nI kind of know how this is done, you know,\nmy kids are doing well and I'm just very proud of them.\nSo happy to be here, we all.\nWell, good afternoon, everyone.\nI'm Senator Derek Mallow.\nI represent the second Senator District,\nwhich is out of Chatham County.\nI don't have many counties,\nbut I do represent four municipalities,\nthe city of Thunderbolt,\ncity of Savannah, city of Garden City,\nand the city of Port Wentworth.\nAnd so I'm excited to be here.\nBefore that, I serve 15 years\nwith the Boy Scouts of America's director of operations.\nand I'm currently CEO of a Community Revitalization Non-Profit,\nso purpose-built Atlanta, purpose-built Savannah.\nThank you.\nAnd before I give the mic to Senator Robertson,\nI wanna thank Senate Press, legislative council,\nall of our support staff over there\nfor helping keep everything straight.\nAnd we have one bill today, it's Senate Bill 342.\nAnd it's actually a department bill.\nand Senator Robertson is going to present it\nand he can introduce himself first.\nThank you, Madam Chair.\nI apologize for my tardiness.\nIt took a little while to get across the street\nand out of the capital, but I do appreciate your patience.\nYeah, I'm Senator Randy Robertson.\nI represent the 29th District,\ncovers a portion of Muscogee, all of Harris,\nall of Maryweather, all of Troop counties.\nMy wife and I have three children.\nWe have a daughter who is about to be 31, lives in San Diego,\na son who is about to be 28, lives in the Panhandle of Florida.\nAnd the engine of the family, Andy, who is four,\nand she lives in Katala and baby sits her mother, Teresa,\nand myself on a regular basis.\nAnd we, our family, Teresa's family,\nespecially has been involved in foster care for many, many years.\nAnd we're adoptive parents, and a lot of our friends are adoptive parents also.\nAnd it's an honor to serve on this committee with the chairman and\nthe group of men and women that are tasked with taking care of these children here in the great state of Georgia.\nThank you, Senator.\nAnd before you present your bill, I forgot to introduce myself.\nI'm Kay Clark Patrick.\nI represent Senate District 32, which is half cobb and half Cherokee County.\nAnd my husband is retired and much better at it than I am.\nAnd I'm a retired orthopedic surgeon,\nand we have two young adult children.\nAnd the only people living in our house\nother than my husband and I are our two dogs.\nSo we treat them as people, which is pretty pathetic.\nBut anyway, so Senator Robertson, would you\npresent your bill, please?\nYes, ma'am, I'm trying to get over you\ntreating your dogs like people.\nYes, ma'am.\nThis is a very, and when we hear it all the time,\nvery straightforward and simple piece of legislation,\nI wanna thank the Commissioner Broche and her staff\nfor their hard work and their help with this legislation.\nThis is a department bill, and I'm reading off LC570035.\nThat's where I am.\nThank you, ma'am.\nRecent surveys have shown that in most cases,\nthe runaway rate for foster children,\nthese are children displaced from their home,\nplaced in other homes, runs around 20%.\nSome of these runaways are just a day long thing,\nsome of them much more extended.\nThis is an extremely vulnerable population.\nAnd when they get out into the world where they think\nthey are able to survive,\nthey find out many times that they're not,\nand they find themselves being mistreated, abused,\nand trafficked by individuals in the community\nthat hope to do them harm.\nAnd so one resource that is used around the country\nto help assist recovering these children\nand getting them back to where they belong\nis the, and every one of you have heard about it,\nit's the National Center for Missing and Exploited Children.\nThis is a federally funded resource.\nThey work hand in hand with all 50 states\nand outside of the United States\nand working to get missing and exported children\nback to where they need to be.\nWell, currently, Georgia Law does not allow us\nto share certain records concerning child abuse\nor neglect with certain agencies.\nAnd one of the agencies that we're not able\nshare them with is a National Center for Missing and Exploded Children and that's somewhat\nof an anomaly for a state agency task would do and what this agency does would not be\nable to share that information.\nAnd so what this legislation would do would allow us to share those records and so they\ncould be used to help recover these children.\nWhile at the same time by doing that we become more, more compliant with federal law and\nunder Title IV E which is the fund, the federal funded money that is put into not only the\nDepartment of Family and Children's Services but also in juvenile justice and other programs\nhere within Georgia, he gets us more in compliance with Title IV so there will be much more funding\navailable to address the foster care issues here in Georgia.\nAnd it's that simple, Madam Chair and I'll be happy to answer any questions.\nThank you, Senator.\nYes, ma'am.\ncommittee? You don't appear to have any questions, nice job. I would, oh, Senator\nPayne. Okay, let's see a appropriate time. Yes, Madam Chair, I'll make a motion that we move\nmove to pass on LC 570035.\nSecond. Okay. Any discussion? Okay. With that, everyone in favor, please say aye.\nAye. Any opposed? Okay. Your bill may be slower. Thank you very much.\nThank you Madam Chair. Thank you committee members.\nAnd we will be meeting again probably next week. We'll send out the meeting notice.\nand thank you very much for being here. We're churned.\n",
  "updated_at": "2026-02-12T19:52:56.028919+00:00"
}