{
  "video_id": "3rTgSAjKuTE",
  "url": "https://www.youtube.com/watch?v=3rTgSAjKuTE",
  "title": "Legislative Day 4 | 2024 Session | 1/11/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": 4,
  "video_date": null,
  "duration_minutes": 137,
  "summary": "Here is a summary of the Georgia Legislative Day 4 | 2024 Session | 1/11/2024 session:\n\n**Overview**:\nThe session included routine procedures like the morning roll call, devotion, and introductions of guests. No substantive legislation was discussed.\n\n**Key Actions**: \nNone detected\n\n**Bills Introduced (First Reading)**:\n- **SB 344**: To amend OCGA regarding sales tax exemptions for firearms (Finance)\n- **SB 345**: To authorize assessment and collection of technology fees (State and Local Government)\n- **SB 346**: To amend OCGA relating to... (read cut off)\n- **SB 347**: To amend OCGA Code Section 1516 (read cut off)\n- **SB 348**: To amend OCGA Code Section 451624 relating to Health and Human Services\n- **SB 349**: To amend OCGA Chapter 5 of Title 48 relating to add-on-the-lamb tax (Finance) \n- **SB 358**: To amend OCGA Title 16 relating to offenses against public health and moral, to prohibit sale of consumer... (Judiciary)\n- **SB 351**: To amend OCGA Titles 20 and 39 relating to education and minors, to provide for social media platform access by minors (Education and Youth)\n\n**Notable Moments**:\n- Senators requested to be excused for business outside/inside the Capitol\n- Introduction of guests Jack and Julia Grace Benton from Savannah\n- Introduction of Pastor Kevin T. Moore as the morning devotion speaker\n\n**Votes**:\nNone detected\n\n**Attendance**:\nQuorum maintained, with several senators excused for business.\n\n**Adjournment**:\nThe session adjourned, with the next session scheduled for later that day.",
  "transcript": "Good morning, good morning. Time for convening has arrived. The Senate will come to order. At this time, it will last all in authorized personnel to exit the chamber. Chair recognizes the senator from the 28th, the good man from Calvita County. Thank you, Mr. President and good morning. I want to wish you a happy national milk day today. Good news for everyone. We've got a couple of pages, so you're not going to have to hear my reading. I want to introduce a brother and sister, Jack and Julia Grace Benton. And they come all the way from Savannah, Georgia. So, y'all give the Bentons a big hand. Jack, Julia Grace, we look forward to working with you guys today. Y'all get out there and get to work. Mr. President, the journal has been read and found to be correct. All right, thank you, senator. And thank you to those pages back there. I appreciate them being here with us. Is there objections to the censing of the reading of the journal? Chair here is none of the reading of the journal is dispensed with. Is there objections to the confirmation of the journal? Chair here is none of the journal is confirmed. All senators have bills and resolutions to introduce. Please bring them to the secretary's desk. First reading and references to Senate bills and resolutions. Secretary? Senate Bill 344 by Senator Invertarte of the 31st and others. A Bill to be entitled to amend Code Section 4883 of the OCGA, relating to exemptions from sales and use taxes to exude sales of firearms. Finance. Senate Bill 345 by Senator Walker of the 20th. A Bill to be entitled to enact to authorize the assessment and collection of technology fees. State and local government. Senate Bill 346 by Senator Invertarte of the 31st and others. A Bill to be entitled to amend Part 1 of Article 3 of Chapter 5 of Title 50 of the OCGA, relating to- Go ahead, man, that was signed. Senate Bill 347 by Senator Invertarte of the 31st. A Bill to be entitled to amend Code Section 1516. You did share. Senate Bill 348 by Senator Williams of the 25th and others. A Bill to be entitled to amend Code Section 451624 of the OCGA, Health and Human Services. Senate Bill 349 by Senator Hubstsevler of the 52nd and others. A Bill to be entitled to amend Chapter 5 of Title 48 of the OCGA, relating to add-of-the-lamb tax- Finance. Senate Bill 358 by Senator Kriprich of the 32nd and others. A Bill to be entitled to amend Title 16 of the OCGA, relating to offenses against public health and moral. So as to prohibit the sale of consumer- Judiciary. Senate Bill 351 by Senator Invertarte of the 31st and others. A Bill to be entitled to amend Title 20 and 39 of the OCGA, relating to education and minors respectively. So as to provide for social media platform access by minors and require. Education and youth. If I can please you are not Mr. President. Secretary Reed the report on Sandy Committees. Mr. President, the Senate Committee on Health and Human Services has had a good generation the following legislation and has instructed me to report the same back to the Senate with the following recommendation that House Bill 571 do pass. Respectfully submitted, Senator Watson of the First District Chairman. It is now time. I'm sorry. Yes. Mr. President, the Senate Committee on State and Local Governmental Operations has had under consideration the following legislation and has instructed me to report the same back to the Senate with the following recommendation that Senate Bill 333 do pass. Respectfully submitted, Senator again of the 47th District Chairman. That completes the order, Mr. President. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. It is now time for the morning roll call. Are there any motions to excuse, Senator from the 33rd? Senator from the 33rd. Mr. President, I ask for you now and good morning, y'all. I'd like to ask you now to excuse the senator from the 42nd and the 38th for business outside the Capitol. Without objection, Senators from the 42nd, 38th and 39th are excused. Regen out of senator from the 8th. Mr. President, I ask for unanimous consent to excuse the senator from the 11th for business outside the Capitol. Without objection, Senators from the 11th is excused. Regen out of senator from the 2nd. Thank you, Mr. President and I ask for unanimous consent to excuse the senator from the 15th for business inside the Capitol. Without objection, Senators from the 15th is excused. Are there any other motions? All right. That objection, the Secretary will call the role of senators. Please signify your presence by voting the A switch, the Secretary won the A switch, the Secretary will call the role of senators. Senator from 29th, what purpose do you rise? Mr. President, I rise to ask for unanimous consent to excuse the senator from the 50th for business inside the Capitol. It is too late. The role calls already started there, Senator. But so when it comes back, he won't be mad.\n\nIt is now time for the morning devotion. All senators, please take your seats and see so all conversation I would ask the doorkeepers secure the chamber at this time I just also want to remind everyone that we're gonna be on a tight schedule because of the state of the state and so be mindful of that and Because we'll proceed over to the house chamber right at 11 o'clock. So Those of you who want who are going to attend the state just Know that it's we we're gonna be tied on schedule so Point some personal privilege and all those kind of things just keep them to a minimum, but it's now My honor to call on the minority leader today She said in her special guests and I will call the minority leader for the pledge and Introduction of the You do the pledge with me morning. I pledge allegiance to the flag You Good morning, everyone I have the distinct pleasure of Introducing someone that came highly recommended to me He is past the Kevin T. Moore He is the pastor of St. Phillips in St. Martin St. Paul I'm sorry I always get St. Paul and St. Philip mixed up But he's in St. Martin as a matter of fact I'm a member of the AARP and that's where we have our meetings in their great big room with food and information and Fellowship friendship all of that included Pastor Moore is best known as a pastor preacher and motivational speaker So don't be surprised if you get a little carried away up here this morning To prepare himself for past story or duties Past the Moore ensured that he attained the kind of education Needed to guide him on his pastorial path A graduate of Morris bound college with a bachelor of science degree and organizational management and leadership I'll speak or also completed a three-year math of divinity a Degree program in two years at the inter Denominational theology center in Atlanta and With honors He has completed his doctoral or your program in ministry and as a part of his program of study He completed a required study tour in Brazil at the University of Mithosta and Sao Paulo He also has five units of clinical pastorial education Pastor Moore as a preacher Comes from a long line of pastors. He is a third-generation pastor who believes that the word of God has life-changing power ordained as that Interim elder in the African Methodist of Pitzkerber Church in 2011 past the Moore worked in the vineyard as a Connectional evaluation chair and Connectional worship leader for the young people's department of the A.A. Me Church and he served as an Ella Baker trainer for the children's defense fund and the black community crusade for children Working very closely with Marion Wright, Elderman Pastor Moore currently serves on the board of trustees for Turner Theological Seminary He currently serves as the senior pastor of St. Paul A.A. Me worship center. Oh, it's in Latonia Not stone mountain. I tried to claim it and And serves at the chairman and CEO of Bethel housing community development in Albany, Georgia Please welcome Pastor Kevin T. Moa Yeah First I'd like to thank Senator Gloria Butler for her unwavering commitment to our community I would also like to thank her for this amazing opportunity to serve for the first time as The chapter another day for the Georgia Senate In addition, I'd like to acknowledge Bishop Reginald Jackson the 132nd elected and consecrated Bishop of the A.A. Me Church and the members of the A.Me Church who are praying for me in this very moment I am also grateful for my cousin Steve skeleton who is here Polybordadocu and my niece Lauren Moore and to Beatrice Williams who is a long-time family friend Dear honorable members of the Georgia Senate As we gather in this esteemed chamber We find ourselves in this blessed season of epiphany A time that reminds us of Revelation of new beginnings and of the light that guides us throughout darkest hours this season Implematic of insight and discovery Beckons us to reflect on the profound virtue of unity a Principle that is more than just a call for harmony It is the bent rock upon which this great state stands In Georgia our diversity is our strength From the Blue Ridge Mountains to the cobblestone streets of Savannah From the bustling city-scape of Atlanta to the serene plains of the rural south We are a tapestry of varied threads each unique each vital Like the star of epiphany that led wise men from different lands to a common purpose Let this season inspire us to seek out our common goals To respect our differences and to work together for the welfare of every Georgian Unity does not mean uniformity It means coming together with our different views, backgrounds and beliefs And finding the collective wisdom in our diversity It's in the respectful exchange of ideas In the compassionate listening to each other's stories And in the shared commitment to the common good that our true virtue is forged As we embark on this legislative session Let us be guided by the spirit of epiphany Let us open our hearts and minds to the possibilities That unity brings And may our discussions be enlightened Our decisions be wise And our actions be for the benefit of all who call Georgia home In this season of revelation Let us commit to being beacons of hope Unity and understanding Together let us build a Georgia that shines brightly A state that stands as a testament to what can be achieved When we join hands and hearts in the pursuit of the greater good Thank you for your dedication to our state and its people May this season be productive And may it reflect the spirit of unity that embodies the best of who we are as Georgians And as I close this devotion I would like to leave you with this prayer that I learned while serving as a hospital chaplain at St. Francis hospital In Columbus, Georgia by St. Francis of a CC Let us pray Lord Make us an instrument of your peace Where there is hatred let us so love Where there is injury pardon Where there is doubt faith Where there is despair hope Where there is darkness light Where there is sadness joy Old divine master Grant that we may not so much seek to be consoled as to console To understand as to be understood as to understand To be loved as to love For it is in giving that we receive It is in pardoning that we are pardoned And it is in dying that we are born to eternal life Amen If I could have everyone's attention please This is going to be really our last line of business here Before we are going to probably stay in recess to get ready to walk over But we did not want to miss out on the opportunity to introduce and showcase the doctor we have here today Because we always appreciate our physicians who come down here and volunteer there at time And I will call on my good friend from the senator of the 14th to introduce our doctor the day Thank you mr. President It is a true honor to stand up here today and introduce Doctor who has now arrived in my district not too long ago her name is doctor Latisha Bilbrue and she has Quite an amazing story she's an orthopedic surgeon who specializes in hand and upper extremity surgery And she is the first black woman orthopedic surgeon to become a partner at resurgence orthopedics and Atlanta The doctor was born in Birmingham, England as were her parents her grandparents were farmers in Jamaica Migrated to England shortly after World War II Only one generation removed from farming in the mountains of trillani and cleaning hospital bedlands in England Dr. Bilbrue became the first physician in her family Promotivating catalyst for becoming a physician was watching the mistreatment of her grandmother and an English hospital Though her first observation had to do with racial disparities within a health care system She was determined to be the antithesis of the physicians that she had observed in 1995 She migrated to the United States with her family to begin her journey to becoming a doctor She earned her undergraduate degree in neuroscience and chemistry at the University of Miami and Miami, Florida Where I understand that she knew and was friends with The senator from the sixth And her medical degree from the Morehouse School of Medicine in Atlanta, Georgia She completed her orthopedic residency at the University of Texas Medical Branch in Galveston, Texas And completed her fellowship at U of F College of Medicine, Department of Orthopedics and Rehabilitation I'm going to go ahead and skip to this part because I know we're pressed for time Her offices are in Decatur in Snellville. I want to say this twice She is one of fewer than five practicing African-American female surgeons in the state of Georgia And I think while today we recognize that incredible accomplishment We are also mindful of what the governor said yesterday at Exanissues and what he will likely say again today in just a few minutes Which is that we face such a critical shortage of health care professionals in this state And Dr. Bill Bruce Service is admirable an example of the type of frontier that we need to move beyond Let me skip to the very end here each fallen winter She raises school supplies for the cab county school systems as well as a toy drive and conjuncts you with Marines toys for tats Her overall goal is to ensure that the next generation of minority orthopedic surgeons surpass her and continues to build and grow for generations come I did not read all her accolades But she obviously it's an honor to have her here today. Please help me welcome Dr. Bill Bruce Thank you. Thank you everyone like you said my name is Dr. Leticia Bilbrue. I'm an orthopedic surgeon Specialized in hand and upper extremity surgery that being said it has been several years since I have treated a heart attack or stroke So this is going to be a healthy day for everyone Hopefully otherwise nurse Julia is going to be doing most of the hard work We have a saying in surgery. It says to measure twice and to cut once and what that Determines is the discipline the preparedness the execution that is needed to carry out surgery So on behalf of the Medical Association of Georgia on behalf of myself on behalf of my patients in your constituents Thank you for always measuring twice and cutting wants Thank you for the preparation that you do for the discipline for your time and your efforts and ensuring that Georgia has one of the best health care systems in the United States. Thank you for having me You You Recognize the majority leader for motion Thank you, mr. President I move that the Senate stand in recess for the purpose of convening a joint session to hear an address from the governor and upon Desolution of the joint session that the Senate stand adjourned until 9 a.m. Friday, January the 12th The majority leader has moved The Secretary you have announcements The joint economic development and tourism committee will meet at 1 p.m. At the Georgia World Congress Center in Hal C in Atlanta, Georgia The regulated industries and utilities committee will meet today at 2 p.m. in room 450 The public safety committee will meet at 3 p.m. in room 450 and the rest of the committee meetings have been canceled for today That completes your to mr. President Recognize the senator from the 19th appropriations chair Thank you mr. President Members, you know after the governor's state of the state of speech you'll have the release of the governor's budget proposals Your big books where you can get a copy of the amended and FY 25 budget proposals will be available at 12 noon starting at 12 noon in the Senate budget and evaluation office across in the CLOB Once you go through the security session you turn to the right Remember only you or someone you designate can pick up that book They will have to sign out for you. We just have a limited cut number of copies. So only one for each senator So thank you mr. President see you guys afternoon Thank you mr. Chairman The majority leader has moved that the Senate stand and recess for the purpose of convening a joint session To hear an address from our governor And upon that adjourning that joint session the Senate will stand adjourn until 9 a.m. Friday 9 a.m. Friday tomorrow morning January 12th 2024 all those in favor of the motion will say aye All those opposed no Eyes clearly have it You You You You You You You You You You You\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Mr. Dockerkeeper Mr. Speaker is away to entrance to the House Chambers. Mr. Doerkeeper, please allow the Governor, his Committee of Escort, and distinguished guest access to the House Chamber.\n\nWhen you have a umbrella on your skin, wear it immediately. At least you have If you can unlock all 4 parts members of the House and Senate this joint session will come to order. I'll ask everyone to take their seats. It's great to see a full house this morning. Good to have our friends from the Senate. It's certainly good to have a full gallery this morning. So welcome everyone to the people's house. Mr. Clerk, will you read a resolution? House resolution 763 of our representative station in the 104th a resolution calling a joint session of the House of Representatives and the Senate for the purposes of hearing a message from the governor inviting the Justice of the Supreme Court and the judges the Court of Appeals to be present at joint session. Thank you Mr. Clerk. Well we want to recognize a few people this morning and let everyone show their appreciation to the folks that are here. First I'll ask you to stand when I recognize you as a group. The constitutional officers of the greatest state in the Union, the constitutional officers of Georgia would you all please stand. No you're in the gallon. Let's give them a great hand. Good looking group. Members of the Kossel Accor, will you please stand so we can give you show you our appreciation. Thank you all for being here. Now special person to the people of Georgia, especially to this house, the speaker pro-timber this house, Jan Jones. Thank you for your service. And I'll gentlemen I've known for a few years but our paths have brought us closer together and we're working well we're both pretty strong willed but it all works out so it's a real pleasure for me to introduce the President of the Senate, dear friend, Bert Jones. Another dear friend, the President of the Senate, John F. Kennedy. Welcome sir. Now special lady to me, one of the best mothers and grandmothers and just generally help keep a good eye on the state. My wife, Dale Burns. The Lieutenant Governor gave me a speech for about five minutes on this next one but I'm going to shorten it down a little bit. A great first lady of the Senate that we appreciate her being here today, Jan Jones. If you will welcome the first lady to the Senate, Jan Jones. Another first lady, let me tell you how incredibly proud I am and grateful to this lady for her work on human trafficking. We thank you, we appreciate you and we look forward to continuing to work with you. So human trafficking no longer exists in our state. The first lady of the state of Georgia, Marty Kemp. In the credible first family who's stood by their mom and dad and continued to support them every day. So we appreciate these incredible daughters. Lucy Kemp, Amy Porter Kemp and Jared Kemp. Let's welcome the Kemp ladies. Thank you for your service to Georgia. Lucy, we couldn't go on if you didn't stand up. You had to do it. Now special treat for us as well. She's been here any numbers of times and we always appreciate her the mother of the government of this state of Georgia, Miss Ann Kempish. Miss Ann, first one, thank you for being here. Thank you. Again, thank you all for being here. First family, we appreciate you and your support for our governor and for what you are doing for our state. So now comes a fun part for me to recognize a friend and a man, a governor of this state who's doing it all right. A leader that's proved, proves himself every day. He was a leader before he came here and assumed the position of governor. His skill set has improved every day because he has worked every day to ensure that the people of Georgia are better than they were the day before. And I truly believe that his accomplishments working for the hard workers, hardworking people of Georgia will go down in the history of this state. He has sustained our state through tough times and certainly through very good times as well with a rock solid, common sense approach to life and to government. He needs no introduction, obviously in our state, but I'm not sure you that his leadership, he needs no introduction in many parts in any part of this country and in many parts of the world. It's my great honor and my great pleasure to welcome my friend, the 83rd governor of the state of Georgia, Brian B. Kemp. Thank you, Mr. Speaker. Thank you all very much. Thank you all very much. Thank you, Mr. Speaker, for those kind words. I appreciate the recognition. It's honor to be here. Lieutenant Governor Jones, Speaker Burns, President Pro Tem Kennedy, Speaker Pro Tem Jones, Members of the General Assembly, Constitutional Officers, Members of the Public Service Commission, Mayor Dickens, Members of the Judiciary, Members of the Concert Corps, and my fellow Georgians. Later this year, the people of this state will once again fulfill their civic duty. They will choose to occupy these seats of service, and they will determine what course America takes in the years to come. As they have in years past, when they go to the ballot box, they'll see a stark difference between Georgia and our nation's capital. They'll see what we've achieved together at the state level to make Georgia an even greater place to live, work, and raise the family. And they'll see the hardships Washington DC has brought into every home and placed on every kitchen table across our state. Congress has become synonymous with runaway spending, bloated budgets, job-killing regulations, gridlock and partisanship, and elected representatives in both parties who are more interested in getting famous on cable news than delivering results for the American people. All the while across the nation, over 60% of households are living paycheck to paycheck. Over 8.4 million Americans are working two jobs to make ends to me. Mortgage rates remain at highs not seen in the generation. And while the rate of inflation may have fallen, high prices on everything from groceries to rent have not. In fact, it cost Americans over $11,000 more per year to maintain the same quality of life that they had just a few short years ago. For the hard work in men and women of this country, paying $11,000 more a year is not a choice between the luxuries of life. For too many people, that's the decision between putting food on the table for their family, making their car payment, buying clothes for their kids, or going further into debt. For a recent graduate, it's about whether you can afford to get your own place and pay off your student loans. For a single mom, it's the decision about taking a job, a new job, and a new career that pays better, but it doesn't offer childcare. For a family of four, can they make ends meet when also saving for their kids' college and trying to pay their mortgage? And for our seniors, are they able to stretch a fixed income to meet their basic needs? These are the people that Washington DC is left behind. Because for every challenge our nation faces, the federal response is to spend more, regulate more, tax more, and come up with another government program meant to cure every yield. Instead of empowering hard work in Americans to innovate, create, seek greater prosperity, their answer is simply more government. But the good news is here in Georgia, we have chosen a different path. Because we realize that the success of our state does not rely on the actions of government, but the prosperity of our people. Washington DC forgot a long time ago that it's not the brilliance of politicians or the good intentions of a new program that make our nation great. It is the resolve, the ingenuity, and the a character of the American people. Those were the hard work in Georgia's we heard from on the campaign trail. As a family, we heard their stories, their struggles, and their hopes for a brighter future. And as you all know, that was truly a family affair. And I want to thank Marty, Jared, Lucy, and Amy Porter for being there every step of the way. Thank you all. I also appreciate my mom who you all recognize early. My sister Julie Reef and her husband are here with us today and we just are honored by their presence. My commitment to the people of our state was very simple. I promised to put hard work in Georgia's first. Fund our priorities like education, public safety, and health care, but also keep government efficient, responsible, and accountable. The federal government may have abandoned those principles, but here in Georgia, thanks to the partnership between my administration and the General Assembly, we have delivered real results for the people of our state, a head of schedule, and under budget. Thanks to a strong economy and conservative fiscal management of state revenues, we provided nearly $5 billion of direct relief to taxpayers, in tax refunds, gas tax suspensions, home-stead tax assumptions, and more. You all were a big part of that. Despite unprecedented challenges, we have maintained a triple-A bond rating, while celebrating the creation of more than 171,000 new jobs, and roughly $74.5 billion of investment in every corner of the Pete State over the last five years. And unlike a lot of blue states, these are private-settler jobs, not growing the ranks of government, and we are not done yet. Last month, I joined Lieutenant Governor Jones, Speaker Burns, and others to announce a plan to speed up implementation of the largest state tax cut in history. With your support, I look forward to signing legislation that decreases our state income tax to 5.39 percent starting this year. This matters because it represents savings of $3 billion for Georgia tax payers over the next 10 years. Mr. Speaker, Lieutenant Governor, while President Biden hires tens of thousands of new RS agents, my vote is we just keep cutting taxes here in Georgia. The path that Georgia has taken over the last five years has led to record job growth, historic investment in communities from Bambards to Blue Ridge, $5 billion of tax relief, and enough funds saved to operate state government for months in an emergency. Not days. Georgia is succeeding because we have charted our own path, rejected the failed policies of Washington, DC, and worked together to put our citizens first. But I believe the worst thing we could do is call it today and coast through what is certain to be another contentious election year. We have accomplished so much over the last five years despite unprecedented times and challenges because we haven't gotten distracted from doing the job that we were sent here to do. Like I mentioned four years ago in my second state of the state address, we stayed true to the example of Nehemiah, committed to our great work and now we are seeing the results. It's no secret that Georgia is growing and is a top state for business for a record 10 years in a row. New jobs are headed our way almost on a daily basis. Existing businesses are looking to expand and companies from all over the world look to the Pete State to locate their next headquarters. But with growth comes the need for more trained workers to fill these good paying jobs in a rapidly changing labor environment. That's why I was proud to unveil the Georgia Match program at last year's Workforce Summit, the largest direct college admissions program in the nation. Georgia Match has already done an incredible job linking the upcoming generation with the schools that meet their needs. As of today over 10,000 students have already met their match and we'll keep working to reach every high school senior in Georgia so that they know there is a higher education path open to them right here in the Pete State no matter their circumstances. Speaking of education, my amended 2024 budget and the fiscal year 2025 budget proposals doubled down on our continued and historic support of K through 12 education with $1.4 billion in additional funds allocated to make a total of $12.8 billion. Republicans and Democrats alike have supported this record investment in our students and I want to take a moment and thank all of you for that strong bipartisan achievement. It's also important for us to remember that increased funding does not guarantee greater success. There's a small business owner for almost 40 years now. I believe like many of you that competition and the free market drives innovation. At the end of the day, they result in a better product for the consumer. When it comes to education, the same principles hold true. Over the last few years, there has been a great deal of debate around different proposals to expand options for students and families when it comes to finding the education that best fits their individual needs. Many members and both chambers have worked hard on this important issue and I want to thank and applaud them for their efforts. Some prefer the term school choice or educational freedom. Some call them vouchers. In my opinion, what each of these terms or slogans fails to mention is the child. At the end of the day, our first and foremost considerations should be the future of that student. Our job is not to decide for every family but to support them in making the best choice for their child. This week is we begin the second year of another biennial of the General Assembly. I believe that we have run out of next years. I firmly believe we can take all of the above approach to education, whether it's public, private, homeschooling, charter, or otherwise. It's time for all parties to get around the table and agree on the best path forward to provide our kids the best educational opportunities we can because that is what we were elected to do. To that end, my office and I look forward to working with the members and the leadership of both chambers to get a bill passed and signed into law this session. Finally, our students and teachers deserve to have a safe learning environment, no matter their zip code. Since I took office, I've had the opportunity to hold more than 30 round table discussions with educators and superintendents from all over this state. We heard frequently that our schools were in need of additional resources to enhance security. That's why since 2019, we have provided more than $185 million to all of our schools to help secure the safety and well-being of our students and our teachers. This year, I'm proposing we continue those efforts by making school security funding permanent. In my budget proposal, I've included a request for $104 million that will go directly to school districts for school safety enhancements. Schools will determine how to best use this money, whether for personnel like school resource officers or for physical or technology improvements that make our places of learning more secure. This investment is more significant because it will enable schools and administrators to plan accordingly knowing that this money is headed their way for this specific purpose. I hope to see strong bipartisan support for this budget item to keep our kids and our schools safe. Since being sworn in as your 83rd Governor, the top priority of my administration has been ensuring the safety and security of our communities. There is no doubt that we have made great progress from the GBI's anti-gang task force and heat unit and the Department of Public Safety's Crime Suppression Unit to the First Ladies Grace Commission and the Attorney General's Human Trafficking Prosecution Unit and the School of Security measures I just mentioned. We have not wavered in our commitment to strengthening public safety, but the state cannot do it alone. Thankfully over the last two years, we have had strong partners at the local level who have worked alongside state law enforcement to make our capital city safer. Two of these gentlemen are here with us today and I want to take a moment and thank Mayor Dickens and Chief Sherebaum for their partnership. We appreciate you all. While the mayor not come from different political parties and don't agree on everything, we do agree on the importance of reducing crime and keeping our citizens safe. By partisan majorities of both chambers, the mayor and myself all agree on the critical need for the completion of the Atlanta Public Safety Training Center. This facility... This facility will provide our law enforcement officers, firefighters and additional first responders, the critical tools and knowledge as well as the skills needed to keep themselves and our community safe. One of our brave public safety officers is here with us this morning. Exactly a year ago, this week this dedicated trooper was shot and severely wounded near the side of the future training center. He spent weeks in the hospital fighting for his life. He endured multiple surgeries and spent the better part of a year in recovery while his family stood strong beside him. Marty and I were honored to spend time with him while he was in the hospital and I was honored when he gave me one of my most prized possession, his SWAT talent's coin bearing his badge number. He had that coin on him when he was shot that horrible day and it is a constant reminder for the price paid by men and women like him all over this state who keep our children, our homes, our businesses and our streets safe. Trooper first class, Jerry Parris, would you please stand with your wife Kelly and let us thank you for your great service. Thank you to the entire Parris family for your service, your bravery and the sacrifices you've made over the past year for us. We were also joined in the gallery by some brave men who rendered life saving aid to Trooper Parris on site and who helped get him to safety. They represent some of the very finest from both the Department of Public Safety. We are so grateful for you all. I don't claim to speak for anyone else in this chamber today, but this decision is very simple for me and my family. As long as I'm your governor, there will be no gray area or political double tall. We will support our law enforcement officers, we will support our firefighters and our first responders in the Atlanta Public Safety Training Center needs to be built period.\n\nThank you. Article 1, Section 1, paragraph 2 of the Georgia Constitution States. Protection to person and property is the paramount duty of government and shall be impartial and complete To fulfill that paramount duty we must do more than show our support for law enforcement in words. We have to show it through action That is why last year thanks to the work of the General Assembly I was proud to sign a budget that included a $6,000 pay raise for state law enforcement officers That pay raise was a recognition of the contributions these raised these brave men and women make as they put their lives on the line day in and day out This year I look forward to working with each of you to once again provide another pay raise for state law enforcement With them my budget proposal or pay increases them an additional $3,000 for state patrol officers like troop repairs as well as our correctional officers and other state law enforcement agencies These investments will not only serve as a renewal renewal of our commitment to these law enforcement officers But will also support our ongoing retention and recruitment efforts I'm also urging the General Assembly to complete what we started last year and give final passage to the peace officer loan repayment program Because despite what some may say we need more police officers not fewer This year will also be continuing our efforts to combat human trafficking in our state thanks to the leadership of the greatest First Lady in the country Marty Kemp Thanks to her work and not of the Grace Commission and members of both Chambers Georgia has gone from being known as a human trafficking destination to being known as the leader and going after traffickers and supporting the victims Under the First Lady's leadership and with overwhelming support from both Chambers We have passed and signed into law eight pieces of legislation that go after those who work in this evil enterprise while also supporting the victims Our efforts have enabled the GBI's heat unit to investigate 369 cases of human trafficking since its creation and for Attorney General cars human trafficking prosecution unit to secure 32 convictions While assisting rescue of over 129 victims since it launched But we But We still have work to do And Marty and I are both looking forward to working with each of you this session to keep up that fight Five years into my administration when it comes to health care We've made enormous strides in lowering cost Expanding access and incentivizing more health care providers to give care We began this work with the passage of the patient's first act in 2019 and since then we've seen strong results In 2019 no counties in Georgia had more than two health insurance carriers Today 87% of Georgia counties have three or more carriers And thanks to Georgia access and the reinsurance program Enrollment in the private sector exchange over the past five years has grown from just under 460,000 to over 1.2 million Georgia access is also saving hard work and families more and more in their wallets And all we've reduced premiums by an average of 11% across the state That represents an average annual premium reduction of almost 929 million dollars a year In rural counties where premium prices were the least affordable when I took office Georgia access has reduced premium payments premiums by an average of 29% And while some in the media refuse to acknowledge this this significant progress We will continue to support policies that work for Georgians not political narratives Because the fact is that for individuals and family struggling to make ends meet Lower insurance costs and more choices lead to better care that they can actually afford And because And because we've made those sound policy choices and budgeted conservatively Prioritized innovation and efficiency We're now able to make other important investments in the health and well-being of hard work in Georgians That includes our efforts in mental health Two years ago as you know, I was proud to sign into law the mental health parody act A fitting capstone to the late speaker David Ralston's years of service in this chamber and one that leaves a lasting legacy One of the most visible examples of that legacy was the 988 crisis Hotline campaign conducted by the Department of Behavioral Health and Developmental Disabilities last year Thanks to Commissioner Kevin Tanner and his team More Georgians than ever before are accessing services that help them when they need to turn their lives around for better To enhance this program further my budget proposal calls for an increase of $205 million for D.B.H.D. in other entities that address mental health This new funding will enable D.B.H.D. to expand services for those struggling with mental illness It will increase the number of crisis beds throughout the state It will further crisis intervention resources in all communities and improve the quality of mental health services overall Once passed we will be spending 1.6 billion dollars on mental health more than ever before I'm proud of what these and other agencies are doing to help their fellow Georgians and Keeping us the best state to live work and raise a family As we speak all across Georgia They're men and women working hard to keep our neighborhoods safe Attract new jobs and industries to communities in need and teaching a whole generation that will hunt one day occupy these roles and much more They have remained committed and hard work in during unprecedented challenges over the last five years And I'm so proud of everything they have accomplished for our citizens It is no secret that most state government jobs pay less than private sector opportunities in the same line of work But for many of our employees do it because they feel a sense of public service and they want our state to succeed But for state government to stay efficient and stay ahead of Georgia's continued growth We must be able to attract and then retain employees who perform these vitally important jobs That is why my budget proposal for up provides a pay increase for all state employees including our teachers You This will build on the historic raises we provided for educators over recent years And will increase every state workers pay by 4 percent My proposal also rewards those who gave decades of their lives and careers to serving others by allocating $500 million to shore up our state retiree fund Ensuring our state This This is this will ensure that our state keeps its promises for our retirees and also stays on solid financial footing Instead of expanding the size and scope of government We're putting state dollars to work in targeted efficient ways to recruit Retain and thank employees and vital vital roles from corrections officers to case workers By doing so we're continuing our efforts to wisely use every penny taxpayer's send us From state agency personnel to our schools public safety and the healthcare marketplace As we look across America there's no doubt that we're at a crossroads From crushing inflation and dysfunction in Washington to the crisis that our southern border and unrest overseas These are indeed trying times But I believe we have an opportunity here in Georgia an opportunity to highlight a different path One of the brilliant principles of America's founding is the role of the states For them to be the laboratories of democracy to protect the liberties and freedoms of their citizens and to carry out the will of the people I founders didn't believe the states had always looked to the federal government for answers And by judging by current comparison. I don't think we would have much to learn In Georgia In Georgia we balance our budget and spend less than we take in We cut taxes instead of raising them We return money back to the taxpayers rather than justifying new government programs We back the blue and crack down on violent crime and gangs and put the safety of our communities ahead of partisan political agendas We celebrate the free market instead of using the heavy hand of government We work together across party lines on more issues than not And most importantly we put our people first In an election year, I don't expect all of us to agree on every issue Every district represented under this gold dome is different and sends each of you here with the unique set of issues to address Over the next 36 legislative days There will be passionate debate There will be disagreements There will be tough votes There will be long nights And maybe even some short tempers But in the middle of all of that I ask that we also remember Georgia is different for a reason That our success is not an accident But the result of a resilient people who elected their leaders to keep state government efficient responsible and accountable In Georgia, we believe the American dream will always provide our people greater prosperity than the government The state of our state is strong Growing in full of opportunity Let's use this session to keep it that way Thank you all may God bless you and may God continue to bless the great state of Georgia You You Thank you governor Kim for expected no less That was awesome. Thank you for those words with a committee of escort. Please escort the honorable Brian P camp Governor of Georgia and is to sting distinguish guest from the house chamber You You You Stayed in recess You The majority leader of this house leader Estrations recognized for a motion they can miss speaker. I move that this joint session be dissolved Is there any objection? Hearing none just don't joint session is hereby dissolved the house will stand in recess For about 10 minutes and we'll get back to our been just thank you all for being here. We're glad to have our guest in the chamber",
  "updated_at": "2026-02-13T16:20:01.235147+00:00"
}