{
  "video_id": "3VW4oFYJwW0",
  "url": "https://youtu.be/3VW4oFYJwW0",
  "title": "Georgia House - Day 24 (2026-03-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 24,
  "video_date": "2026-03-04",
  "duration_minutes": 124,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n# Georgia House - Day 24 (2026-03-04)\n\n## Overview\nThis session featured a devotion and prayer by a guest chaplain, Pastor Musgrove, who shared his personal story of overcoming struggles in his youth to find purpose and success through faith. The session did not appear to include any substantive legislative actions.\n\n## Bills Introduced (First Reading)\n- None detected\n\n## Notable Moments\n- Pastor Musgrove spoke about his troubled youth and how a teacher encouraged his gift of communication, leading him to eventually find purpose through his faith. He emphasized the importance of having a vision and plan for one's life.\n- The Speaker asked the House to keep Chairman Mandy Ballinger in their thoughts and prayers as she underwent medical tests and procedures.\n- The Speaker also noted the tragic loss of life from the recent storms in the Nashville, Tennessee area.\n\n## Votes\n- No recorded votes\n\n## Attendance\n- The Speaker ensured all members were present on the House floor for the morning roll call.\n\n## Adjournment\n- The transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "you the hour of convening having arrived all members of the house will please report to the floor of the house and take seats all members will report to the floor of the house and take seats the clerk will ring the bell all members of the house will please report to the floor and take seats all members We are going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning. Happy to see everybody here today. Before we begin, let me ask once again that we have our devotion and throughout the day that you keep Chairman Mandy Ballinger in your thoughts and prayers. She has undergone some surgery and has some tests, I think scheduled today. Nobody is a fighter like her. I also would ask you yesterday morning when we talked about the storms and the Nashville area. There were nine fatalities. Now we know there are 24 and a number of people I understand are still missing and unaccounted for just a terrible tragedy in a neighboring state. We will begin our day with Scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 174th House District, Chairman John Corbett. Thank you, Mr. Speaker. Colleagues, it's my pleasure and distinct honor to introduce our pastor today. He's got with him this morning. Cornell Jones over here. We welcome him. Thank you. Well, I've only known pastor Musgrove for a short time. I've known of him and of the important work that he does. He's been doing for years. Pastor Musgrove goes round to schools and talks with local clubs, SCLA, Christian athletes, and he does a great job with our young people. He's filled in several times for us over the last few months as we've been searching for a pastor at our church. He's on fire for the Lord and I'm really honored to have him with us today and I'm going to ask him to come and give us a message. Good morning. How's everybody doing today? Well, I want to tell you that's an honor to privilege to be here. I would like to thank Speaker Rauston and Representative Corbett for allowing me inviting me to be here today and I had no familiar faces in here. We started a program back in 2001 where we go into public schools and talk to students about vision, purpose, and destiny. Then we work with Christian clubs and do programs after hours. The program's called Future Now. We have a representative here. Where's the app from Valdaust? Where's Dexter? Representative Sharper actually worked with us in the Valdosta City Schools, three schools there, Newburn Middle School, Valdosta Middle and Valdosta High School back in 2004. We've come a long ways, baby. Amen. If my friends could see me now, what would they say? I'm telling you, I barely graduated from high school. I grew up in a little town. My parents were both my father grew up in Valdosta. My mother grew up in Valdosta. My father's from Homeerville, Georgia. I was born in Valdosta, but I was raised down in LaVogue, Florida, North Central Florida, down on the Swansea River. Just five out of six kids. There were five boys and one girl. It was a troublemaker. I was the black sheep. My daddy said if I had been the first child, he'd only had one. I don't have to tell you. So my daddy was a successful businessman, built power lines for the REAs and the local was the rule of the electricians in Georgia. EMCs, I should know that. I'm sorry. I spent a lot of times at Grady County, Mitchell County and Slash Pine, Calcutta EMC. We did work for all those places. But one of the things that I got into in high school and I just wanted to work. I just want to have a good time. Have fun. You know what I mean? So, and I got a couple of scriptures I want to read that's going to kind of lead into my story. I'm going to be quick. I'm going to leave you want more. I talk to the schools. We don't have long when you got middle school and high school kids. They don't listen real good. You have to talk fast and we have big lights and LED walls and sound systems. So I didn't have to have all that today. So you need to listen. The Bible says in Proverbs 29 and 18 where there is no vision to people perish but happy as he who keepeth the law. Y'all are law makers and y'all don't like law breakers. But happy as he who keepeth the law. And I'm telling you I found out that drugs, alcohol, premarital sex, gangs, violence, failing grades, bullying are not problems. They're symptoms of a big problem. You ain't got a plan. Everybody needs a plan. Everybody needs a vision. In fact, I heard this black preacher say this one time. He said, if you don't know where you're going, you'll take every road. And that's what my wife says about me when I don't want to use the GPS. We don't need to ask him. I know where I'm going. You know what I mean? We're just going somewhere. I found out a long time ago. A lot of people just go and they're just seeing where they're going instead of going where they're seeing and that was me. I had a ninth grade English teacher and she said her name was Shirley Albert. You know there's a few teachers out there that really do take interest in you. And she said, stone, you're a great communicator. I think I cursed her out because I was an idiot. I got voted the class clown. They didn't give one scholarship for that award. I went to Florida State University because I probably couldn't qualify to get in Georgia. That's just the truth. Anyway, my SAT score didn't even qualify me to get in Florida State. I think the counselor that read my SAT scores was dyslexic. It got the scores backwards. I'm being serious. I don't know how they got over 800. I didn't, I made like a 600 or something. Anyway, my first semester at Florida State and I tell each to the kids in the school. I made three Fs in a D. It was quarter system. Then my second quarter I made three Fs in a F as four Fs. The kids usually laugh. But I'm going to tell you something. I remembered something my high school teacher said. She said you got a gift to communicate. And I found out the education system is there to help you determine and help you develop. You can't really be anything you want to be. I probably couldn't be a representative. But that's okay. I could probably sell cars or something like that, you know, real estate, but I'm a great preacher. But we need people that can be that. We need everybody doing their part. We got guys that work sound and lights to do certain things that I can't do. But the Bible says in Proverbs 1816 that a man's gift will make room for him and bring him before great people. Folks, I'm telling you something. I couldn't get him on my own merits. The gift that God put in me has brought me here today. I wish my friends could see me now because the people I went to high school with can't believe they probably allow me to speak at the house of representative. But let me tell you something. We got invited. We, of course, I got born again. The Bible says if you confess with your mouth, Jesus is Lord and believe in your heart. God raised with the dead. You shall be saved. I did that. At the age of 20 on my apartment in Tallahassee, Florida gave my life to Jesus. But the Bible also says in John 146 that Jesus said, I am the way, the truth in the life of the man comes to the Father, but through me. Well I got to Jesus and he got me to the Father. Thank God for that. And here's what the Father said in Jeremiah 2911. And here's where we base our whole ministry on. Jeremiah 2911. For I know the plans or the thoughts that I think towards you says the Lord to give you a peace and a future and a hope and a not available but to give you a future and a hope. That's where we got the name future. Now your future is now. I tell these students what you do today is going to affect you for the rest of your life. And you need to get a plan for your life. You know Martin Luther King said that he had a dream that all people would have a dream. You know it wasn't just a black thing. It's a white thing. We all need to have a dream. And I'm going to tell you what's happened with the young people in America today. They quit dreaming. They've lost the ability to dream. They can't think outside the box. I don't know whose fault that is. I talked to administrators all the time and they tell me this. They said we don't have student problems. We got parent problems. Because if it's coming from the house, it's in the student. If it's in the student, it's coming from the house. And I know I do appreciate you guys. I appreciate you men and women at what you do for this great state of Georgia. And I want to applaud you and thank you. You're great to be here. God's got you here and do your job. And I don't want to stay here all day and take up your time because we got work today. We all do. Not Twain said this. He said, the two greatest days in a man's life, there's two great days. Obviously, the first is the day you were born. That's a great day for you. I'll be 59 on Sunday. I know I look 29. Go ahead and say it. But you know what? He said the second greatest day is the day you found out why you were born. And that's what we got instilling these young people. To find out what he's just supposed to be doing and get with it. Because one day I was in a grocery store and I ran into that teacher. I ran into Miss Albright and I was in a public. And I looked around the island and said, Miss Albright, you tried to help me but I wouldn't listen to you. I said, but now I go into public schools and I'm a communicator in public schools. And I'm going to take something. First school I was in back in 2001 was the high school I graduated from. And some of the students actually went to, we're teaching there by the, I graduated in 79. Some of them were already teaching school. And they said, we can't believe you're letting Christmas grow speaking to public schools. But I'm telling you, I'm a changed man. God changed my life. And I thank God for that. And I want to pray for you today. But I want you to just think about what I said today without a vision, my people pair stand upon your feet. Thank you. This is a prayer that you'd possibly pray for the church at Colossian. I just kind of, I pray this for my family sometimes. I pray for my children. I pray for, sometimes people that are going through things. And I just kind of put your guys name in. I didn't put it in word for word your name. But I put the Georgia House of Representatives. I'm going to pray this for you. So, agree with me as we pray. For this reason, since the day I heard, I do not cease to pray for you men and women of the Georgia House of Representatives. And I ask that you may be filled with the knowledge of God's will and all wisdom and spiritual understanding. That you may walk worthy of the Lord, fully pleasing him, being fruitful in every good work and increasing in the knowledge of God. Just in with all might, according to his glory's power, for all patience and long suffering with joy, giving thanks to the Father who's qualified you to be a partaker of the inheritance of the saints in life. He has delivered you from the power of darkness and He's transferred you into the kingdom of His dear Son, in whom you have redemption through His blood, even the forgiveness of sins in Jesus' name, amen. That was Colossians 1-9-14, in case you want to know. Let's pledge allegiance to the flag. Pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Your keepers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Mr. Speaker, the clerk of the House can verify that I have been reading this journal and he said he would do that. Thank you, Mr. Clerk. The clerk said he was not going to get involved in that. I can't believe that because he's a very honorable man. He doesn't want a subordinate perjury. Mr. Speaker, your committee on information and audit's red proceedings of the previous legislative day and found that would be correct. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been red and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on the 59th, minutes following, he establishes the order of business in the first part of the period unanimous concents, introduction of bills and resolutions first reading the reference of House bills and resolutions second reading of bills and resolutions reports of standing committees first reading a reference of Senate bills and resolutions morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none in the resolution is adopted. Next reading of bills and resolutions the clerk will read. House Bill 1089, my represent, McCall of 33rd Silk Box, the 52nd Cooper, the 43rd, England of the 116th Hawkins, the 27th and others, Bill B. Todd, and Lacto, men, various titles of the Fishercoded Georgia annotated so it was a streamline the process of litigation. Special Committee on Access to the Civil Justice System. House Bill 1091, by resident of Clark of the 98th Bill B. Todd, and Lacto, men, part two of Article 6 of Chapter 2, Title 20, the Fishercoded Georgia annotated relating to compensation and season core curriculum. House Bill 1094, by resident of Gaines, the 117th Cooper, the 43rd, Jones, the 47th, Wheat Hour, the 119th, Silk Box, the 52nd and others, Bill B. Todd, and Lacto, men, article on Chapter 20, Title 45, the Fishercoded Georgia annotated relating to general provisions regarding personnel administration. Health and human services. House Bill 1095, by resident of Erwin, the 28th Jones, the 47th, Chasper, the 11th, Perkall of the 15th, Campbell, the 15th and others, Bill B. Todd, and Lacto, men, part six of Article 6 of Chapter 2, and Title 20, the Fishercoded Georgia annotated relating to employment under the Quality Basic Education Act. Education. House Bill 1096, by resident of Smirie, the 135th Smith, the 134th Buckner, the 137th Smith On the 33rd, Eugly, the 136th, Bill B. Todd, and Lacto, men, code section 48, 8, 111, the Fishercoded Georgia annotated relating to procedure for imposition of special purpose, local option, sales taxes. Ways and means. House Bill 1097, by resident of Smirie, the 135th Buckner, the 137th Smith, the 133rd, Smith on the 34th, and Eugly, the 136th, Bill B. Todd, and Lacto, men, Chapter 5, the Title 30th, the Fishercoded Georgia annotated relating to protection of disabled and elder persons. Human Relations and Aging. House Resolution 1366, by resident of Chokness, 138th, Resolution honoring a life of Mr. Wesley Frank Weaver, and dedicating a mile of road and his memory. Transportation. House Resolution 1367, by resident of Scofield, the 60th, King Trell of the 22nd, Gordon of the 163rd, Paris, 142nd, Howard, and 124th. Resolution urging local boards of education, ensure that each of his schools has an operation of wheelchair on-site at all times. Education. Senate Bill 307, by senator Anorhuman, the 45th, Miller, the 49th, Harbour, the 16th, Gucci, the 51st, and Jones, the 25th, and others. Bill B. Todd, and Lacto, men, Chapter 5, the Title 49, the Fishercoded Georgia annotated relating programs of protection for children and youth. Health and human services. Senate Bill 312, by senator Jackson, the second Miller, the 49th, toga, and the 30th, Jones, the 10th. Bill B. Todd, and Lacto, men, Title 50, the Fishercoded Georgia annotated relating with state government. Governmental affairs. Senate Bill 346, by senator Black, the eighth, Berkeley, 11th, Anderson, the 24th, Darrell of the 40th, Paine of the 54th. Bill B. Todd, and Lacto, men, Article 2, Chapter 50, the Title 43, the Fishercoded Georgia annotated relating the state board of veterinary medicine. Agriculture and consumer affairs. Senate Bill 367, by senator Martin of the 9th, Strickland, the 17th, tillery, the 19th Kirkpatrick of the 32nd, brass of the 28th, and others. Bill B. Todd, and Lacto, men, Part 12 of Article 6 of Chapter 2, the Title 20, the Fishercoded Georgia annotated relating the effectiveness of education programs. Education. Senate Bill 394, by senator Albers, the 56th, Robertson, the 29th Harper, the 7th, brass, the 28th, and Martin of the 9th. Bill B. Todd, and Lacto, men, Article 3, Chapter 5, the Title 16, Article 1, Chapter 15, the Title 45, and Article 7, the Chapter 4, the Title 49, the Fishercoded Georgia annotated relating the kidnapping, the false imprisonment, related offense. Judiciary non-civil. Senate Bill 402, by senator Robertson, the 20th, Albers, the 56th, Miller of the 49th Hunter, and the 45th, paying to the 54th, and others. Bill B. Todd, and Lacto, men, Article 1, the Chapter 6, the Title 17, Part 3 of Article 6, of Chapter 11, the Title 15, Chapter 10 of Title 16. Judiciary non-civil. Senate Bill 438, by senator artillery, the 19th. Bill B. Todd, and Lacto, men, for non-binding advisory referendum. Court of Governmental Coordination. Senate Resolution 645, by senator Mollstone, 53rd, Watson, the 1st, Berkeley, 11th, Kropatric of the 32nd, Miller of the 49th, and others. Resolution urging the Georgia Building Authority to provide for certain space. State properties. That completes first readers. Underreading of bills and resolutions, the clerk will read. House Bill 1084, by represent Chocas, with 138th, Chaspers of the 11th, Watson of the 170th, Corp. of the 174th, and England of the 116th. Abilbo-led into commissions and other agencies. House Bill 1085, by represent Dempsey of the 13th, Martin of the 49th, Spire of the 135th, Dubbock of the 29th, Newton of the 123rd, and Bill relating to definitions regarding tuition equalization grants at private colleges and universities. House Bill 1086, by represent Setsler of the 35th, Restoration of the 104th, Smirin of the 135th, Barchett of the 176th, Bode of the 62nd, and others. Abilbo-led into stay of civil forfeiture proceedings. Daring pendency of criminal proceedings. House Bill 1087, by represent Turner of the 21st, called while the 20th, can trial the 22nd, Carson of the 46th. Abilbo-led to provide for a home state exemption from the city of Polly Springs, Edville, or in taxes. House Bill 1088, by represent Jones of the 167th, Abilbo-led to amend and act creating a new charter of the city of Ludwigi. House Bill 1090, by represent Silthawks of the 52nd, Jones of the 47th, Cooper of the 43rd, Hatchett of the 150th, Dempsey of the 13th, Abilbo-led into general provisions regarding labor and industrial relations. House Bill 1092, by represent Powell of the 32nd, Nix of the 69th, Williams of the 145th, Collins of the 68th, Abilbo-led into delegation of certain medical acts to advance practice registered nurse. House Bill 1093, by represent Meks of the 178th, McCall of the 33rd, Parkle of the 150th, Bidley of the 6th, Watson of the 172nd Abil, relating to agriculture, commodity, commissions generally. House Resolution 1350, by represent Jones of the 91st, McCall of the 33rd, Resolution urging the President of the United States and Congress to enact legislation requiring the food and drug administration to establish GMP's standard freight, relating industrial hemp products with THC content below 0.3%, including establishing a safe daily level of cannabis, consumption of consumption of consumers. Senate Bill 271, by Senator Kennedy of the 18th, Councilor of the 46th, Throne of the 23rd, Burke of the 11th, Jones of the 25th, Abilbo-led into courts. Senate Bill 301, by Senator Tillery of the 19th, Hill of the 4th, Robertston of the 29th, Wallace of the 53rd, Miller of the 49th, Abilbo-led into general provisions regarding detainers. Senate Bill 351, by Senator Watson of the 1st, Albers of the 56th, Jackson of the 2nd, Walker of the 3rd of the 20th, Miller of the 49th, and others, Abilbo-led to provide for the holding of non-binary advisory referendums. Senate Bill 373, by Senator Kennedy of the 18th, Standard of the 23rd, Jones of the 10th, Gute of the 51st, Councilor of the 46th, and others, Abilbo-led into directors and officers of nonprofit corporations, and directors and officers of electric membership corporations and foreign electric cooperatives. Senate Bill 374, by Senator Kennedy of the 18th, Miller of the 49th, Duggan of the 30th, Gute of the 51st, Walker of the 30th, and others, Abilbo-led into general and final remedies and special proceedings. Senate Bill 393, by Senator Strickland of the 17th, Hillary of the 19th, Albers of the 56th, Martin of the 9th, Perry Patrick of the 32nd, Abilbo-led into the university system in the Georgia Bureau of Investigation, Senate Bill 396, Senator Walker of the 30th, Wilkins of the 50th, Black of the 8th, Anderson of the 24th, Hill of the 4th, and others, Abilbo-led into state symbols, Senate Bill 435, by Senator Strickland of the 17th, Hillary of the 19th, Perry Patrick of the 32nd, Albers of the 56th, Karen of the 42nd, others, Abilbo-led into procedure for sentencing and imposition of punishment, and the Georgia Crime Information Center, through 2nd readers. Reports of standing committees, the Clark-Warrie. Representative Stevens, the I'm 64th District Chairman of the Committee of the Economic Development and Tourism, submitted the following report. Mr. Speaker, Committee on Economic Development and Tourism, was sent into consideration to following Bill of the House, and instructor meeting report to same back to the House of following recommendations, House Bill 244 to pass by substitute, respectfully submitted, and representative Stevens of the 164th District Chairman. Representative Lomston of the 12th District Chairman of the Committee on Insurance, submitted the following report, was speaking to committee on insurance, his head and consideration following Bill of the House, and instructor meeting report to same back to the House of following recommendations, House Bill 1050 to pass, House Bill 1070 to pass by committee substitute, respectfully submitted, representative Lomston of the 12th District Chairman. Representative Barry Fleming of the 121st District Chairman of the Committee on Judiciary, submitted the following report, was speaking to committee on Judiciary, his head and consideration following Bill of the House, his instructor meeting report to same back to the House of following recommendations, House Bill A14 to pass by committee substitute, House Bill 865 to pass by committee substitute, respectfully submitted, representative Barry Fleming of the 121st District Chairman. That completes the reading of the report to standing committees. . Okay, we're going on now to morning orders. We're going on now to morning orders. Chair will ask all members that are within the chamber to please be seated and cease conversation, take your meetings out to the any rooms or the hallways, or you can go out and stand in the rain as a final option. So we will limit morning orders today to one minute each. Chair recognizes.\n\nRepresentative Bernal for a morning order. Thank you, Mr. Speaker. For my moment in Black History, I have chosen Gwen Eiffel, who was regarded as one of the most respected reporters of all time, and someone who pushed the bar forward for women of color in journalism. She was a member of Delta Sigma Theta sorority and incorporated. In February, Trailblazing Reporter and Anchor, who died in 2016, was honored as the face of the US Postal Services, 43rd Black Heritage Forever Stamp. Gwen Eiffel was one of the most recognizable faces in TV news. The former PBS anchor started as a reporter in a predominantly white male journalism industry. Within years of her start in local news, she was covering presidential campaigns for the biggest media organizations in the country. She was a host of Washington Week and in 2013, became a part of the first all-female daily news anchor team at NewsHour. She moderated presidential and vice presidential debates. In 2004 and in 2008, notably stumping, thank you. This is my moment in Black History. Chair recognizes representative Chocas for a morning order. Thank you, Mr. Speaker. It is indeed my pleasure to recognize the leadership and the competitive teams from the FFA in Marion County. They're up there in the gallery. They're accompanied by their instructor, John Hagen, please stand up and let us applaud your successes. Thank you, Mr. Speaker. Oh, one last thing. Go Eagles. Thank you, Mr. Speaker. Chair recognizes representative Dale Washburn for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen, the House is indeed an honor for me today to recognize a very special group that's at the Capitol today. And that is the Georgia Association of Real Tours. They are here every year, but this year is very significant because it it is the 100th birthday of the Georgia Association of Real Tours. And so I am particularly honored to welcome them today because for 44 years, I have been one of them. And they are here always to advocate, of course, for their business interests, but also for private property rights, which is very important to all of us and to everyone in the state of Georgia. So please, the real source and the gallery, please stand and the ladies and gentlemen of the House, please honor them with your applause. Thank you, Mr. Speaker. Thank you, Representative Washburn. And the chair wants to make special mention of the Northeast Georgia Board of Real Tours that are here from Gilmer, Fanon, Union, and Towns counties. If y'all would stand, thank y'all for being here. Thank you. Chair recognizes Chairman Warkeyezer for a morning order. Thank you, Mr. Speaker. There's actually two groups here. This is Georgia Home School Day at the Capitol. And specifically, I've got a group that got on the bus this morning at five o'clock this morning. The Christian Home School Educators Association, most from Titan on Evans. Most of my constituents are out there paging, but thank you for coming. And a few of those are in the gallery here in the Senate. If y'all could stand and be recognized. Thank you, Mr. Speaker. Chair recognizes Representative Jasmine Clark for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. So if you live or work in Atlanta, then you've probably used your phone or cars GPS to navigate to your destination or around our God-awful traffic. Whether you use Google Maps or Ways, you can thank the brilliant mind of Dr. Gladys West, an African-American, a woman and mathematician who worked at the Naval Surface Warfare Center in Dalgrain, Virginia. Her work creating mathematical models of the shape of the earth is the basis of global positioning system or GPS. She was recently inducted into the U.S. Air Force Hall of Fame for her important contribution to society. And today, we recognize this amazing woman and STEM. Thank you, Mr. Speaker. Chair recognizes Representative McLauren for a morning order. Thank you, Mr. Speaker. Today, I rise to recognize the adoptive child of the day. Introducing Alexis, 15-year-old Alexis is initially a shy, quiet girl whose beautiful personality comes through the more you get to know her. She enjoys spending time with her friends, swimming, singing, drawing, dancing and listening to pop, rap, and contemporary gospel music. Alexis is looking for her forever home so she can continue to grow, thrive, and achieve her goals. She's one of the thousands of children in Georgia who need permanent forever homes. Thank you, Mr. Speaker. Chair recognizes Chairman Heath Clark and Chairman Shaw Blackman for a morning order. Thank you, Mr. Speaker. Colleagues, I'm here today to recognize a group of young ladies that are from Houston County with new vision MSK if you would stand and let us recognize you in the gallery if you would stand. They are here today to advocate for issues that are of interest to them and so thank you all for coming and we'll see you later. Chair recognizes representative Frazier for a morning order. Thank you, Mr. Speaker. To my colleagues in the house, what is motherhood? Motherhood is one of the most difficult jobs there is. It marks a new chapter in every woman's story. It gives you a sense of purpose and a meaning in life. You encounter love and passion for your children that you have never experienced before. Motherhood is emotional. Being a mother of two daughters, I know firsthand the combinations of wall emotions, experiences, hopes and dreams that I have for my girls. There is no definition for motherhood. Motherhood simply put is amazing. So why does Georgia have one of the highest rates of maternal and infant mortality in the nation? Women are at risk for pregnancy related mortality. The first year after delivering their baby, 65% of Georgia's pregnancy related deaths occur between six weeks to one year postpartum. Could have been preventable according to the Georgia Maternal Martiality Review Committee. Let's reduce these numbers. Let's support the extension of pregnancy Medicaid for women up to one year postpartum. Let's save the lives of our mothers so that they can experience motherhood. Thank you, Mr. Speaker. Thank you. Chair recognizes representative Stovall, Alex Zender and Glanton for a morning order. Thank you, Mr. Speaker and members. We would like to acknowledge and recognize awesome girls day here at the Capitol and Regina Sunshine Robinson on their fifth anniversary program, which is elevated 31 girls for their individual talents, gifts and abilities. They are authors, inventors, community activists, entrepreneurs, community servants, musicians, and other notable professions. Members of your please help us to welcome the awesome girls to the state Capitol when you please rise. Thank you, Mr. Speaker. Time is almost up, but the chair recognizes and I'm going to dispense with the time in a spirit of brotherhood and moving Georgia forward. Representative Al Williams for a morning order. Thank you, Mr. Speaker. I have two groups here today. The Liberty County, a Heinzville Board of Relances under LeVonia may feel and I'm not sure if they're up there in the Youth Commission from Liberty County. And of course, my Board of Relances, a second only to that Gil McCoy in North Georgia group, with number two. Thank you, Mr. Speaker. I'm going to have two. Time is up for today's morning orders and I think there was one or two we didn't get to. And if you'll see the messenger, we will give you priority tomorrow. Chair wants to recognize on the floor of the House a former member of this body, former chairman of the rules committee, former state representative Bill Embry. Chair recognizes representative Shannon to introduce the doctor of the day. Good morning. Thank you, Mr. Speaker. Dr. Jeffrey Linser attended medical school at the California College of Medicine at the University of California at Irvine, where he also completed his residency in pediatrics. Dr. Linser is an attending physician at Children's Healthcare of Atlanta and a professor of pediatrics and emergency medicine at Emory University. And we thank him for being our doctor of the day. Mr. Speaker, members of this August body, I've want to thank you very much for the service that you're providing to the people of our great state of Georgia. I know that representative government is hard and that compromises the key to success. I think it was best summed up by Edmund Burke who said, you're representative owes you not his industry only but his judgment and he betrays instead of serving you if he sacrifices to your opinion. At Children's Healthcare of Atlanta, we're very busy in the emergency centers seeing almost 200,000 children a year. Unfortunately, many of these visits are due to the lack of primary care and mental health resources. Mental health is becoming a greater issue for our children in our state and I have fortunately have had to take care of children as young as six years of age who have tried to commit suicide. The lack of resources limits the availability of placement and sometimes these children are waiting in the emergency department for days. The lack of adequate primary care resources can be traced unfortunately in part to Georgia Medicaid because over 50% of the Medicaid recipients are children but less than 20% of the Medicaid dollars go to their care. It seems at time we value our grandparents more than our children since Medicare reimbursement in many instances is higher than Georgia Medicaid. I know you all want to do what is best for our children and I hope you continue to look out for this very fragile group. Again, I want to thank you all for your service to our great state. Good morning and thank you. You can very much bring love. Thank you sir. Good combination. This house will be at order. House will come to order. We have some very distinguished Georgians that we are going to honor whenever you all are ready to honor them. Chair recognizes or I'm sorry Mr. Clark Reed Decaption to House Resolution 1032. House Resolution 1032 by resident administration in the 104th resolution commending the Decawla High School Lady Falcon soccer team for winning the 2019 6A state championship and for other purposes. Chair recognizes chairman of illustration for an invite resolution. Thank you Mr. Speaker. Ladies and gentlemen of the House. It's a great honor today to have with us the Decawla High School Lady Falcons 6A state championship soccer team. We have outstanding students and coaches with us here today including the members of the team who are in the gallery. If you would please rise and members of the House if we could please congratulate them. The team is led by coach Colleen Foy who will say just a few words for us. Good morning I'm Colleen Foy and I'm the head coach of the varsity girls soccer team from Decawla High School in Gwinnett County. This team brought the school its second ever women's state championship and it's the first one since 1954 and it's also the first state championship overall since 1993 so we're very proud to represent our school and thank you for the invitation. Clerk will read the caption to House Resolution 1272. House Resolution 1272 by Dempsey the 13th Carpenter the 4th Cooper the 43rd. Jasper the 11th Gamble the 15th and others a resolution recognizing March 4th 2020 as Georgia Hope Day at the state capitol and for other purposes. Chair recognizes Chairman Dempsey for an invite resolution. Good morning it is our honor today to recognize March the 4th today as Georgia Hope Day at our state capitol we have some wonderful guests here with us. Georgia Hope is a provider of mental health substance use and family preservation services and they have been doing it for 20 years. They have been categorized as a tier 2 plus provider of our most important core services and family preservation services providing an array of services that help clients maintain stability in a community environment. It's keeping people in their own homes and in their own schools. They embrace the three pillars of valuing community-based services committing to integrated health care and believing recovery is possible for the adults, children and adolescent lessons that they served. As we all know it has been recognized that school-based mental health programs are so very important and in 2015 they began to and today they are active in 60 across the region where they serve. Georgia Hope has transformed the lives of thousands of individuals in their families in 29 counties in north Georgia but also extending those services because when you do something well you're asked to do it more so they extend that into Savannah, Columbus and Augusta. They are helping many of the people that we represent. We're joined above by some of those who work with them. If y'all would please stand up and let us recognize you as well. The boots on the ground of Georgia Hope. Thank you so much and I'm joined up here with the speaker with Mary Wies, Tanya Smith and Nikki Raymond who will say a few words. Thank you so much representative Dempsey and to all the representatives that have supported this work in the last 20 years. We are honored that we have been able to walk the path of recovery with tens of thousands of families in the state of Georgia in the past 20 years and we are honored to continue to do that work and we look forward to the next 100 years planting those mustard seeds that will bring hope and better living for the individuals in Georgia. Thank you. Going on to the rules calendar. Going on to the rules calendar. Chair will ask that members again who are inside the chamber remain seated and cease conversation and listen to the presentations from the well. The clerk will read the caption House Bill 882. House Bill 882 by our representative Houston and the 170th and others to be entitled to amend article one of a chapter 8 to title 48. The official go to Georgia annotated relating the general provisions regarding state sales and use tax so as to eliminate the sunset period for the exemption from state and certain local sales and use taxes. This bill then refer to the committee on ways and means that committee recommends that this bill do pass. The chair recognizes chairman Penny Hausten to present the bill. Thank you Mr. Speaker. House Bill 882 permanently removes the sales and use tax from food and food ingredients to qualified health banks and it also removes the sales and use tax for donations of food and food ingredients to qualified health banks that use the food to feed the hunger, hungry and for disaster relief purposes. If I have any questions I'll be glad to answer them if not I would appreciate a yes vote so we can help make life better for so many Georgians. You have a question if you care to yield. I will yield for question. Chair recognizes representative Kenner to your left for a question. Yes. Good morning does the representative yield? Yes I will. Isn't it true that 16.2% of all Georgians struggle with food insecurity and that 23% of all children in Georgia live in a food insecure home. If you say so I'm sure that's correct. Thank you for the bill. Thank you. If I have no further questions I yield the well. No more questions. Is there any objection to the previous question being ordered? The chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote I. Those opposed to vote no in the clerk will unlock the machines. All members voted have all members voted. If so the clerk will lock the machines on the passage of House Bill 882 the eyes are 159 the nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 946. House Bill 946 by resident of 930th to be entitled to amend chapter 64 in Title 33 the fiscal to Georgia and the state of relating the regulation and licensure of pharmacy benefit managers this bill haven't inferred the committee on quality health care that committee recommends that this bill do pass by committee substitute. The chair recognizes chairman David Knight to present the bill. Thank you Mr. Speaker. You give us a second for the slide. Overhead to come down. First I want to I want to thank every member of the General Assembly. Over the years this General Assembly has been concerned about the health care issues that face Georgia constituents. Last year this House took the lead with first in the nation kind anti-steering regarding pharmacy benefit managers. And I want to thank you for what you did. Georgia leads and it will continue to lead as we address address the medical crisis that we have not only in Georgia but I think they helped shape what goes on in the nation. I also want to thank members that have worked tirelessly on the health care bills. Chairman Richards Smith, Chairman Lee Hawkins, Chairman Matt Hatchett and a whole host of others. We continue to address Georgia's needs. I don't know if the slides on. As they put a slider to on I want to let you know what's going on and we had several hearings particularly at the first of the year and I told you that there were several discussions going on around the nation but one of the most important discussions and I think we need to have is looking and addressing the corporate takeover of health care. Our health care decisions were coming down from these the largest publicly traded companies in the nation and our health care dollars are going right back up to these publicly traded companies. As you see in the slide this was from eight to the this was done in 19 but as you look and you see these companies you'll see that they are the largest the largest number six number eight 23 51 56 65 155 these are some of the largest fortune 500 companies in the nation they're publicly traded and they are controlling health care. How it's called vertical integration and there's one thing I want you to take note of is how this is happening these insurance carriers and also manage cure organizations own the insurer they own the PBM they own the specialty pharmacy and this slide doesn't show it they own the other mill order pharmacies and they even own brick and mortar pharmacies and that's the vertical integration that is happening.\n\nin the United States. So there's a natural conflict of interest that is going on with these companies. And we wonder why our costs keep going up, but if you look at the massive shareholder returns from these companies, you'll know where the money is going. Back to steering. This body, the exceptional one person in the Senate and the governor signed off on a, again, a nation first anti-steering bill. But as you see, come January 1 of 20, these big corporations, they're fighting a way to get around these. This is an example of what it looks like when these big companies say, look, you can use another pharmacy. We're just not going to pay any thing for the prescription drug. In fact, they're telling the beneficiary here, you'll pay 100% of the cost. You want to know what it looks like from cross referencing. They're actually also contracting from a cross contractual difference. And they're contracting from one to the other. CVS and Optum. Optum is anthum. You know who CVS here more it is. You won't know what it looks like in a contract. This is a state contract. They even have steering language in a state contract. PBM acknowledges and agrees that a GenioRx may steer members to any pharmacy or pharmacies of ingenioRx's choice through any means. Preferred pharmacies over non-preferred pharmacies, specialty pharmacies for specialty drug fields over retail. In GenioRx, know who they are, anthem. You want to know what it looks like to the people and our constituents that we serve? Let me tell you a story about a young lady from Southeast Georgia. She was a first-time mom. She had a new born baby and she was receiving Medicaid managed care via a merit group which is anthum. The child was born at 36 weeks gestation and spent five months in the Nick U. They were discharged but the baby was sent home with a prescription for a drug for pulmonary hypertension. When she went to her local pharmacy, this is what she ran into. The pharmacy tried to fill the prescription and that was rejected and it said you must fill this at the specialty pharmacy. And when you call that number, guess who you get? In GenioRx. So the managed care organizations were steering Georgia Medicaid patients to their own pharmacies. Guess what? The mother was given a runaround for two weeks trying to get the medicine for her child and she finally had to switch Medicaid plans. How much jeopardy was her child's health put into? I'm going to briefly go through the bill. Basically, 946 addresses these heinous practices from these p.b.m.s. Section 1. We've got current definitions are antiquated as these p.b.m.s. their practices have evolved and we need new definitions that match current day practices of these p.b.m.s. Section 2. We're giving the commissioner and making sure that he has the ability to make sure that their fines and more aggressive action is taken under the law. Right now, there is no stick, if you will, when these large companies break Georgia law. Section 3 looks to protect patients by ensuring that physicians from Georgia are utilized somewhere in the development or the management of the formularies that the p.b.m.s come up with. Section 4. Again, going back to the commissioner, taking away some antiquated language that handcuffs him from proper oversight of these companies, looking to increase his authority and his obligation in regards to the oversight of p.b.m.s. Section 5 really strikes at the core of this bill and what it does is it brings transparency to drug pricing in Georgia. And the cause of these trade secrets and the way that they come up with proprietary and confidential formulas, nobody understands what the cost of a drug is. What this bill seeks to do is it seeks to make sure that they are also reporting these drugs based on NADAC. NADAC is the national average acquisition drug acquisition cost. The Center for Medicare and Medicaid Services, our federal government does this survey and all we're doing is asking for them as they're doing these, their drugs and a Mac pricing, they're also going to report whether it's 10% a blow or above NADAC. NADAC for the first time is the most public and the most reliable benchmark for the true cost of drugs. Again, transparency and sunshine, it disinfects. Section 6 addresses a couple of things. It says that if you're going to do rebates and you're going to say you're going to give all the rebates back, we're telling you all the rebates. And also addresses spread pricing. Thanks to Chairman England and Chairman Jack Hill in the Senate. Two years ago we put language in the budget where we knew this was going on. 2018, you know how much spread pricing was? $50 million. You know what spread pricing is? It's where they're charging the plans more than what they actually pay out to the pharmacies for the cost of the drugs. $50 million in 2018. $43 million in 2019. I wonder what this general assembly in this state could do with $93 million. Is it tries to address issues, other issues of health care, education, infrastructure? We are now saying no more spread pricing. The other thing that this address is and many of you were in testimony, you know what a copay accumulator is. It's where some of our most chronically ill patients with most expensive drugs are getting help through coupons or other means. And that payment is being accepted by the PBM but guess what? They're not applying it to their copay or they're deductible. They're taking the money but they're leaving the patient in a position where they don't accept it applied against their copay or their co-insurance. So the patient is still on the hook. One of the worst practices, Chairman Cooper, thank you for bringing this up in committee is one of the worst practices that I've seen. And again, Section 7, we're looking at again improving patient protection. We're looking and we're seeing these PBMs and they're driving through the formularies, people to brand drugs that cost more when they are cheaper generics available. And they're doing this because they have a financial incentive through the rebates and other revenue that's coming back to them. And it's driving up the cost of drugs and it's preventing people from getting on those drugs because of the high cost. It's also addresses lemon dropping where these formularies will drop certain medications and forcing the patient to go find a different plan. And again, despite what this General Simley has done, the PBMs continue on the largest of skills to engage in prohibited practices including steering. You will see a first in the nation's search arch provision in here where the claims for PBMs and the insurance clients when the PBMs engage in this practice, we will not take this in Georgia anymore. It is not good healthcare policy, it is not good for the patients and it's not good for the providers. We want to take help care back in Georgia and we will. That was our mission this year. I hope that you will stand by me and your other colleagues and a lot of other people who testified that Georgia Hospital Association, we had the MS Society. We had many advocacy groups, okay? National MS Society, we had, again, hospital associations, MAG, our physicians stood up. We've had Dean Jean Summers from Mercer, I cannot think of a more elegant educator and physician who addressed this issue. Please stand up with me against these heinous, heinous practices by these large companies. Let's take help care back in Georgia and let's make sure that healthcare is between the health provider, the physician, the pharmacist, and the patient. And let's tell insurance in their PBMs they need to stay in their lanes. Mr. Speaker, I'll yield for any questions. You have a question if you care to yield. I'll yield for some, sir. Chair recognizes representative Jasmine Clark to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. First, thank you for bringing this bill. I do believe that this is an important issue that affects a lot of our constituents. I just had one question. In section two, line 128 through 130, I noticed that the filing fees and renewal fees were increased by 400% and 250% respectively. Is the purpose of this change to discourage PBMs from applying for or renewing licenses in Georgia by increasing the fee? I'll answer that question also with a reference back to a slide. I doubt that companies that are making upwards of $200 and something billion a year in revenue are discouraged from a $1000 or a $2000 fee. It's to make sure we're getting up. These haven't been changed and it's to make sure that the insurance commissioner has proper oversight and these are just getting these up to today's standards. So is the gentleman for the year? Yes. So to clarify, you're just saying that we increase the fees in order to help the commissioner do their job and it's not to discourage PBMs. Yes, I will. I'm not sure you could discourage with that much money that they're making on this. Thank you. Mr. Speaker, there are no more questions. I want to talk to you. You've got a couple of more. I want to one more, Mr. Speaker. Chair recognizes representative Mary Francis Williams to your right for a question. Yes, ma'am. Do you yield? Yes, ma'am. Is it not true that I myself have been prescribed a $3000 a month prescription that is fulfilled by a specialty pharmacy and that although that company offers assistance to help me pay for that, those that money is not, does not count towards my deductible. I believe the lady to know of which she speaks and she would be speaking of the one of the most heinous practices I've seen, which is the copayochemalator clauses that these PBMs put into the contracts. Thank you so much for bringing this legislation. It's going to help so many people. Thank you. Thank you members and I hope that you will stand up and make sure that we in Georgia take help, care back and put it where it belongs between those licensed providers, physicians, pharmacists and the patient. Thank you. Is there any objection to the previous question being ordered on House Bill 946? The chair here is none of the previous question is ordered. The chair here is none of the previous question is orders. Is there any objection to adopting the committee substitute? The chair here is none of the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none of the report of the committee. He is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 946 will vote aye, those opposed will vote no and the clerk will unlock the machine. For what purpose does Chairman Perry Shuraz? Mr. Speaker, I'd like to be excused under rule 133 of voting on this matter as much as I would like to vote for it, please. Gentlemen, has that right and the journal of the House will reflect that. Members favoring the bill are voting aye, those opposed are voting no. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 946. The eyes are 165. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 947. House Bill 947, I'm motion of 9 to the 130th and others to be entitled to amend Article 7 of Chapter 4, Title 49 in the fiscal to Georgia and Tether relating to Medicaid generally. So it requires the Department of Community Health to engage an actuary to conduct an actuary study of the fiscal impact of carving out pharmacy benefits from the state's current Medicaid care management organizations. This bill then refer to the committee on quality health care. That committee recommends that this bill do pass. Chair recognizes Chair Monknight to present the bill. Mr. Speaker, I'll be brief with this one. It is a shorter bill. Many of you have read the preamble to this bill. So I'll let you read it and see the findings of the information that we've seen and the data that we've gathered. But this bill basically does two things. It instructs DCH to go out and get an independent third party actuarial study to determine and come back and show if there's savings from a carve out of prescription drug benefits from managed Medicaid. And if that study comes back then they're instructed to proceed. If the savings are $20 million or more they're instructed to proceed. And if the savings are 10 to $20 million then we instruct them to consider it and weigh in very heavily and put more of the option back into their court. I will let you know that other states such as Kentucky which is a much smaller state than us did a carve out of prescription drug benefits from managed care. And that state saved $50 million. $50 million. I'm sorry, West Virginia. West Virginia. So that's all this bill does. It's very simple. We just want third party verifiable information so that we can know to proceed or not to proceed. And again I'll ask for your favorable consideration House Bill 947. Mr. Speaker, are there any questions? Do you yield for questions? Yes, sir. Chair recognizes representative Jasmine Clark to your left for a question. Mr. Joe, may you. Yes, I do. Can you just for me? I don't really necessarily understand the link. Can you define what carve out means for us? I don't think I'm not the only one with that question. Under Medicare there's two types. There's fee for service and there's managed care. And the state and managed care contracts with these managed organizations. Okay, such as Centine which has like peach state or anthem which has a merit group or was it peach care? Okay. We pay them on a per month per month per member per month basis and they control everything. Everything. And what I'm saying is is that as we've discovered the spread pricing, high administrative fees, high markups that you've seen on these specialty drugs, they're killing access to other pharmacies in the state, especially in rural Georgia, but I'll tell you I met one gentleman Thomas. J. Zoo has two pharmacies within 10 minutes of this capital serving some of the most needy patients in Georgia. He just closed one of his pharmacies and hanging on by thread. And what this does is seek to put this back into a fee for service position if the study actually shows savings. Does it generally refer to you? Yes, I do. I just want to make sure that I'm understanding this correctly. So we are actually, I'm just going to ask in, can you explain this to me like I'm a fifth grader? What are you saying when you say that we are carving out pharmacy benefits from the state's Medicaid care medicine? Managed care Medicaid. And this is where we go out to some of these companies that we just show you that had subsidiaries in which we just farm out the contract and they manage it from start to finish. And what we're finding is exactly what you just saw out there. And those examples. And what we're saying is there are studies that show that this is a more costly method when it comes to prescription drug benefits. And we want third party data that shows if there's a savings we want to proceed and change that. We want lower costs to the state and we want more access and more health care to the individuals that you and I care about. Thank you. Mr. Speaker. You have no further questions. Thank you. And I again appreciate your support for House Bill 947. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 947 will vote aye. Those opposed to vote no in the clerk will unlock the machines. What purpose does chairman Parrish rise? Mr. Speaker, I'd like to ask under rule 133 to be excuse from his vote please. Gentlemen has that right and the journal will so reflect. Members voting for the bill or voting aye those opposed to the bill or voting no. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 947 the eyes are 168th and aes are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 918. House Bill 918 by resident of Cooper the 43rd 9th and the 130th and others to be entitled act to amend Article 6 of Chapter 4 Title 26th. The fiscal to George annotated relating to pharmacies so as to revise various provisions relating to the practice of pharmacy. This bill I'm referring to the committee on quality health care that committee recommends this bill do pass by committee substitute. Chair recognizes chairman Cooper to present the bill. Thank you Mr. Speaker. Ladies and gentlemen of the House I bring to you the substitute to House Bill 918 is the third and for today the final bill about PBMs. This bill is sort of in two parts the first part is about the steering and last year we passed the bill the first in the nation to put a stop to this and our bill is using it being used as a model bill all over the country to try to stop the steering. But CVS which brought this to our attention last year who bought anthem began to set out letters to their people and said if you were an anthem patient you could only fill your medicines at a CVS pharmacy and you had to use their mail order if they so specified. This was especially troubling for cancer patients because there was a wait and representing night spoke of a mother that they're back to doing it again and spoke of the mother with a newborn with hypertension of the lungs. I know a lot about hypertension of the lungs my younger sister died during my first campaign of hypertension of the lungs no known cause no known cure. We are lucky now to have some medicines that at least elongate a person's life if they have this condition and to deny an infant the medication they need for two or three weeks while you wait for it to be sent mail order is criminal. So the first part of the bill goes back and makes our even stronger what we passed last year and the way they got around it is they said all right you don't have to buy your medicines from us but if you go somewhere from go somewhere else away from CVS you just have to pay the price for it and 100% of the price so that's taken care of the first part of the bill. The second part of the bill is about pharmacies in their audits and I really didn't think that I would be dealing with something like this I had to have somebody explain to me just how a pharmacy was audited and they're audited by all the different PBMs so they may be getting audited once every two months and this is not just a quick one through the through the pharmacies this is something that a pharmacy will spend hours and hours and hours hours preparing for and it can take three or four days but I have decided after learning what goes on to call it the Nick Picken audit because it's a way for PBMs it's another source that they where they are recapturing hundreds of thousands of dollars from our pharmacist around this state and it's not because there's fraud are there the pharmacists are lining their own pockets with money that shouldn't belong to them are they're ordering the wrong drugs and they're not ordering them they're getting out the wrong drugs it's because of Nick picking mistakes yesterday I learned from a practicing for some pharmacists it's just been appointed to our board of pharmacy that he just finished an audit and a doctor typed in the date and the year correctly on a prescription when that was located in the audit it that prescription was denied be not to the patient but to the pharmacist which meant the pharmacist had to pay back to the BPM the money that that prescription caused because the date was typed in not hand written they are Nick picking our pharmacist to death and they are getting back in the money in the hundreds of thousands of dollars because anytime they deny that the pharmacist did something wrong in filling a prescription the pharmacist has to pay them back and there's a big dark secret when they ask the pharmacist to pull out a prescription on it that they want to look at they know the ones where the drugs were most costly they don't put pick on one and they don't pull out one to look at where the medicine costs four dollars they asked to see the ones where the medicine was four hundred dollars and so when they deny it that's four hundred dollars in their pocket that is the essence of this bill we have to put a stop to corporations trying to run medicine they're going to put our pharmacist out of business and in other ways they're also after after our doctors so I would ask\n\nfor your fable consideration on the substitute to House Bill 918 and Mr. Speaker of there no questions I will yield the well. You have no questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of House Bill 918? Will vote aye. Those opposed to vote no and the clerk will unlock the machines. What purpose does chairman Parrish arise? Mr. Speaker, I'd like to be excused from voting on this bill and rule 133, please. Gentlemen has that right and the journal will so reflect that he is exercised that right. Those in favour of the bill are voting aye. Those opposed are voting no. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 918. The eyes are 169. The nasors zero. House Bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 897. House will be in order. House will 897. My任 was in a perchetta of the 176th and others to be in total and act to amend Code Section 12624, the fiscal to Georgia and Senator relating the notice of timber harvesting operations. So, as required, the State Forestry Commission to create a standing timber notification website. This bill had referred to the Committee on Agriculture and Consumer Affairs that committee recommends that this bill do pass. Representative, we've got a busy day here. I need to note, does this bill have anything to do with Palmetto Berries? Are you sure? You haven't put any secret words in there, have you? Okay. Chair recognizes representative Berchette to present the bill. Thank you, Mr. Speaker and esteemed colleagues for allowing me to bring to you House Bill 897. What this bill does is it creates an easy to use website for timber harvesters to notice their counties when they are harvesting within the county. Currently under our present law, timber harvesters are required to go through a notice process in each individual county and this would streamline that process for them. It does a couple other things. It also limits the bond usage. Currently, timber harvesters are required to have a bond in place for any road repair necessary due to any damage they create within the county while harvesting timber. The problem that we've seen is that if they're harvesting on say county road one, their bond may be implicated over on a road they're not even on. So we just limited the use of that bond within 500 foot ingress or egress of the harvested track. Also this piece of legislation has been a bipartisan effort between ACCG and Georgia Forestry Association. Both of them have come to the table and have agreed on the language here, which is uncommon as I'm told. I'd take any questions if anybody has any questions about the bill. You have no, well you do have a question. Do you yield? Yes, sir. Chair recognizes representative McLauren. Do you arrive for a question? Well, gentlemen, yield. How you? Representative, is it not true that even though Metro Atlanta districts don't have quite as many forests as some rural districts, Metro Atlanta legislators care about both the quality of our forests and also local control? I believe that's true. And is it not further true representative that I support this bill because it is a compromise effort in order to maintain the quality of our forests and ensure that bad actors in the forestry industry are not able to harvest timber without being able to notify their counties properly. I believe that is true. Thank you for bringing the bill. Thank you. I yield. You have no further questions. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill eight, nine, seven will vote aye. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill eight, nine, seven. The eyes are 166. The nays are two. This bill having received the requisite constitutional majority is therefore passed the clerk will read the caption to House Bill nine 69. House Bill nine 69, my motion of abstraction to the 104th be entitled to amend Article four, Chapter three, Title eight. The official go to Georgia and Tederley in the fair housing, so as to change provisions pretending on lawful practices and selling or renting dwellings. This bill I refer to the committee on judiciary that committee recommends that this bill do pass. Chair recognizes chairman of station to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I present to you HB nine 69. This is a department bill that was brought to us from the Georgia Commission on Equal Opportunity. Georgia has been out of compliance with the Georgia Fair Housing Act since 2012 and under Secretary Carson and the U.S. Department of Housing and Urban Development. The review was done of Georgia law last year and this bill is a result of that review. It would allow us to be in certification with HUD, which is by the way required by Georgia law. On the books, it's required for the administrator to be to have us in compliance, so that's all we're doing here. I'm not aware of any opposition to this bill in the hallway. I haven't heard of any opponents. It passed out of full judiciary committee unanimously and unchanged, which is a rare thing when you get a bunch of lawyers in the room. So what asks for your favorable consideration? I'll be happy to answer any questions. You have no questions. I yield the welcome. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 969 will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 969. The eyes are 168th and nasor zero. This bill having received the requisite constitutional majority is therefore passed. We'll do this. All right, House will be at order. House will come to order. All members in the chamber will please take their seats. We're about to honor and recognize a distinguished group that will bring us news and greetings of a great Georgia tradition. The clerk will read the caption to House Resolution 1345. House Resolution 1345, our representative Stevens, the 164th, Gilear, the 162nd. The written sentence on 61st and P3 of 166. A resolution recognizing commending the members of the Savannah St. Patrick's Day Parade Committee, General Chairman Lawrence E. Edgley and Grand Marshal of 2020 St. Patrick's Day Parade, Michael Rouse senior on the upcoming occasion of the 2020 St. Patrick's Day Parade in Savannah, Georgia and for other purposes. Chair recognizes Chairman Ron Stevens for an invite resolution. Thank you, Mr. Speaker. Ladies and gentlemen, House, March 17th is always a big, big day in Savannah, Georgia. We have in Savannah, we'll have the largest St. Patrick's Day Parade in the world per capita right in our own state. I want to introduce you to the Grand Marshal today, Michael Rouse, and he's going to say a few words. Would you give a grand welcome to the St. Patrick's Day Committee? Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you all so much for having us here today. It's my honor and my distinct pleasure that everyone chose me to be the Grand Marshal for the 20 parade. It's our 196th parade in Savannah, Georgia. And we're not the biggest parade in the United States, but we're absolutely the best, and the reason for that is because we put it on the best. And I certainly do appreciate everything. We'd like for you all to come down. March 17 on Tuesday. Thank you all so much. Thanks for having us. Have a good day. Thank you, sir. I'm not quite. Thank you. I'm not going to skip to the day, sir. Okay. If you had never been to St. Patrick's Day in Savannah, it's a real treat. I just secured a commitment from Chairman Stevens that next year, when we honor this group, he's going to sing Danny Boy here in the resolution. What purpose does Chairman Harrell rise to make a motion, Mr. Speaker? To state your motion. I move that Senate Bill 302 be moved from the committee on appropriations to the committee on ways and means both Chairman are wonderful, agreeable. I'm not going to say a thing about that. The Chairman of the Ways and Means Committee has moved that Senate Bill 302 be moved from the appropriations committee to the Ways and Means Committee to the clerk or read the caption. Senate Bill 302 by Senator Alberus, the 56 and others to be entitled to enact a menorcle 3, which after five of a total 28, the official go to Georgia annotated, relating to fiscal bills generally. On the gentleman's motion, the Senate Bill 302 be moved from the appropriations committee to the Ways and Means Committee, is their objection? Is their objection, the chair here is none, and it is so ordered. What purpose does Representative Ridley rise? Make a motion. State your motion. I move that rules be temporarily suspended so that the bill can be read for the first time and signed to the committee. Representative Ridley has moved that the rules of this house be temporarily suspended to allow a bill to be read for the first time and assigned to the committee. The clerk will read the caption. Unnumbered house bill by Representative Ridley, the 6 to be titled and act to amend Article 2, Chapter 2, Title 40, the fiscal to Georgia, and Senator relating to registration and licensing of motor vehicles generally. On the gentleman's motion, that the rules of this house be temporarily suspended to allow a bill to be read for the first time and assigned to the committee, is their objection? Is their objection, chair here is none, and it is so ordered. Motor vehicles. What purpose does Representative Mom to hand rise? What purpose does Representative Mom to hand rise? May Speaker I rise to make a motion. State your motion. To suspend the rules so that the bill may be read for the first time and assigned to the committee. Representative Mom to hand has moved that the rules of the house be temporarily suspended to allow a bill to be read for the first time and assigned to the committee. The clerk will read the caption. Unnumbered house bill by Representative Mom to hand of the 17th and others to be titled and act to amend Title 33, the fiscal to Georgia, and Senator relating to insurance. On the gentleman's motion, that the rules of the house be temporarily suspended to allow a bill to be read for the first time and assigned to the committee, is their objection? Is their objection, the chair here is none, and it is so ordered. Title committee on access to the civil justice system. Clerk will read the caption to a group of privileged resolution. The memorializing the formed known victims of lynching into cab county, Georgia, honoring the work of the remembrance project initiative, the NAACP, de cab branch. Congratulations, commending the Georgia Association of Realtors. Recognizing May 14, 2020 as a proxy awareness day. Congratulations and commending, Rosalog Garrett Plant for receiving the 2020 Yellow Rose, Nikki T Randall, Servant Leader of the work. On March 5, 2020, is patient-centered physicians coalition of Georgia Day to state capital, commending and congratulating Adelina Sturgios-Matics. Recognizing and commending, Chama Ibering, of North Family Service Corporation, providing various services and support, victims of domestic violence and the greater Atlanta region. Commending Mr. Keith Carter for being named the principal of the year by the Georgia Association's secondary school principals and recognizing as many years of service the Aconi County Education System, honoring the life and memory of Rick Davis. Congratulations, commending Kendall Chamberlain for receiving the 2020 Yellow Rose, Nikki T Randall, Servant Leader of the work. Congratulations, commending the Stewart Webster Journal Patriot Citizen on the 170th anniversary of its founding. Commending Commending Mayor Lamarly of Walnut Grove, Georgia on its outstanding public service. Commending and congratulating Brianna Groves. Congratulations, commending done at a DE Smith for receiving the 2020 Yellow Rose, Nikki T Randall, Servant Leader of the work. Recognizing commending the University of North Georgia in this President, Dr. Benita Jacobs. Recognizing greater Atlanta Chapter, ninth and tenth horse Calvary Association for their efforts to preserve and promote the history of Buffalo soldiers and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions that Chair Here's None and the resolutions are adopted? We have a birthday today. Please join me in wishing a happy birthday to Representative Debbie Buckner. If you have signed up for an announcement, then please make your way to the front of the chamber. We're going on now to announcements. The Chair recognizes Chairman Gerald Green for an announcement. Thank you, Mr. Speaker. The State Properties Committee will meet today at 2 p.m. in room 4.3. We have three bills to consider. So the State Properties will meet today at 2 p.m. in room 4.3. Thank you, Mr. Speaker. Chair recognizes Chairman Corbett for an announcement. Thank you, Mr. Speaker. The Environmental Quality Subcommittee of Natural Resources will meet in room 515 CLEB at 3 o'clock. And also the rule caucus will have lunch at the Department of Ag Building upon adjournment. Thank you. The Chair, I'm sure you'll want to come to order for the next announcement. The Chair recognizes Chairman Hogan for an announcement. Thank you, Mr. Speaker. The awesome committee of information and audits will meet at 1 o'clock in room 406 CLEB. Chair recognizes Chairman Beverly for an announcement. Thank you, Mr. Speaker. The Georgia House Democratic Caucus will meet tomorrow at 9 a.m. in room 403. 9 a.m. room 403. Thank you, Mr. Chair. Thank you, Mr. Speaker. Chair recognizes the Chairman of the House Rules Committee, Chairman Smith for an announcement. Okay, everyone listen up. Rules Committee will not meet tomorrow. Rules Committee will not meet tomorrow. Our next meeting will be now. She won a clock Monday. One o'clock Monday. Thank you. Chair recognizes Representative Bennett for an announcement. Thank you, Mr. Speaker. The Georgia Legislative Black Caucus will meet today at 3 p.m. in room 605. We will be receiving the Council General Farm Liberia. Thank you. Chair recognizes the Chairman of the Regulated Industries Committee, Chairman Powell for an announcement. Thank you, Mr. Speaker. With the members of Regulated Industries, could they have met immediately upon a German and LOB 606? If we have a technical change that we need to repair to a bill that came out. And also at 2 o'clock, the Regulated Industries Subcommittee on Occupational and Professional Licensing will meet in 4 o'clock. Thank you, Mr. Speaker. Members. Chair recognizes Chairman Hitchens for an announcement. The Public Safety and Homeland Security Committee will meet tomorrow morning 8 o'clock 4 o'clock Around 6 o'clock 6 o'clock Chair recognizes representative Vance Smith for an announcement. Thank you, Mr. Speaker. The full Committee of Natural Resources and Environment will meet tomorrow morning, March 5th, 8 AM, room 606 CLOB, agenda subject to change per call of the Chair. Thank you, Mr. Speaker. Chair recognizes representative Henson for an announcement. Thank you, Mr. Speaker. The de-capt delegation will meet upon adjournment today in room 415 and lunch will be provided.\n\nChair recognizes Chairman Blackman for an announcement. Thank you, Mr. Speaker. Both subcommittees of governmental affairs will meet today this afternoon in room 403 at 3 and 4 o'clock respectively. And a delayed start to tomorrow morning's meeting over in CLOB 506 at 830. Thank you. Chair recognizes the chairman of the House Appropriations Committee, Chairman England for an announcement. Thank you, Mr. Speaker. Just a reminder to everyone, tomorrow morning 8 a.m. room 341 here in the cap, we will have an appropriations committee meeting to hear four compensation resolutions. So hopefully we won't take very long. Please be there. Thank you. Chair recognizes Chairman Knight for an announcement. Thank you, Mr. Speaker. I want to make sure that the higher ed appropriations committee, you know that we are meeting at 3 o'clock, room 341. 3 o'clock, room 341. Please be there if all possible. Our attendance on that committee has been lacking. Thank you. Chair recognizes Chairman Newton for an announcement. Thank you, Mr. Speaker. The committee on access to quality health care will meet tomorrow morning at 830 and CLOB 415. So tomorrow morning, Thursday morning at 830 and room 415. Thank you. Chair recognizes Chairman Warkhizer for an announcement. Thank you, Mr. Speaker. The industry and labor committee will meet today at 3 o'clock in the CLOB at 3 o'clock. Thank you. Chair recognizes Representative Brian Prince for an announcement. Thank you, Mr. Speaker. The Transportation Subcommittee on Resolutions, RESTRO naming and bridges will meet tomorrow morning at 8 o'clock in the CLOB 415. 8 o'clock, room 415. Thank you. That completes our announcements. That completes announcements. The chair recognizes the Distinguished Majority Leader of the House for a motion. I was looking for him, Mr. Speaker. Thanks, Al. Mr. Speaker, I moved to this House stand adjourned until 10 a.m. March 5, 2020. The Majority Leader has moved at this House. Be adjourned until Thursday, March 5 at 10 o'clock a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Thursday, March 5 at 10 a.m. Did she get my phone? Okay, okay.",
  "updated_at": "2026-02-13T12:10:49.327246+00:00"
}