{
  "video_id": "4hccdhUafTs",
  "url": "https://www.youtube.com/watch?v=4hccdhUafTs",
  "title": "3/20/2024 Senate Committee on Judiciary",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 216,
  "summary": "Overview:\nThis transcript covers a Georgia Senate Committee on Judiciary session where several bills were discussed and acted upon, including HB 1247, HB 505, HB 523, HB 996, HB1105, HB231, HB301, and SB 288. The session featured discussions on a \"candor and compensation\" bill for medical errors, changes to the riot offense, and other legislation.\n\nKey Actions:\n- **HB 1247**: An extension of the \"candor and compensation\" act to allow patients and hospitals to resolve medical error issues out of court.\n- **HB 505**: Changes the riot offense from a misdemeanor to a felony, adds language on material support for terrorist groups, and provides affirmative defenses for those fleeing or using force against rioters.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- The committee had a \"tip jar\" where members would have to contribute if they prefaced their comments by saying they were not a lawyer.\n- There was some procedural discussion around ex officio committee members and their letters of appointment.\n\nVotes:\n- HB 1247 passed the committee unanimously as amended.\n- HB 505 was also passed unanimously by the committee.\n\nAttendance:\nThe transcript notes that the committee was running out of chairs and folders due to the large number of members present.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled meeting.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Members on the committee, if we have more time to have you introduce yourself and say where you're from and everything, but we don't have time. But this is the same bill we heard last year. I believe it was unanimous in committee. If you can briefly Tell us what the bill is and let's just see if we have any questions and see if we can get it moves. Chairwoman Cooper. Thank you Mr. Chairman members of the committee and thank you for allowing Mr. Snives to sit here with me since I'm not an attorney. This is like an extension of our good. Sorry go ahead. I forgot to tell you about the jar. What jar? Well we have a jar up here that while we are kind of in a hurry because it's late we will stop to knowledge the jar and Some people like to go in from our committee and say I'm not a lawyer, but Or something close to that and when they do that they had to put money in the tip jar And we set rules that based on how late it is is amount it surges Is this have you think written on the dollar? Okay, so I'd like for it to be more than one dollar We're at prom time, but we'll start with the dollar and so you're it's been putting the jar for you So you now may proceed Thank you. I wouldn't do that again because that's what only dollar he has Thank you mr. Chairman Like I say this is a sort of a way to explain it would be an extension of our goods in Merit and Act so often Accidents or problems occur in a hospital with a negative outcome and they don't rise to the attention of a of a death or a big major event But the patient is unhappy unhappy maybe and knowing what goes on Whether that it really was a mistake of the hospital or the doctor or not and it may cost them something and so this would allow for and Means of them being able to come together the hospital could offer candor and we Encourage and it's a big bold print for them to have an attorney and they would in Agree to enter into agreement where they everybody could be honest and They would have access to the hospital records and they could talk it out. They could look to see and And if they really are the hospital or the doctors at fault or they're not and then come to some kind of agreement if there need to be a way for them to Be compensated are to be made Hole again There's a time limit it. It does not go out as long as a basically a two-year time limit and it's not like the big lawsuits It's sometimes run five or six years before they are settled and the main This is for patients Because it gives them a chance and for the physician or the hospital To learn from their mistakes and to have some closure to an event It is just exactly like it was when it passed out of this committee and was ready on a vote on the floor And it just ran out of time last year before it was called up for vote Is that so and thank you madam chair The challenges going to move now have the largest committee in the entire state Senate up here We're running out of chairs and we don't know Not settler is the usual suspect For the committee members we don't have enough folders And so if you can please share with your neighbor if you don't have a folder And I and I will say this is a an agreement Between the the doctors the hospitals the insurance people and The trial lawyer and the trial lawyer well you had us until the end there had you not have you noticed that the capital the don't It's a little off and that's because when we managed to get an agreement with all those people it moved a little bit Let's see if we have any questions in the committee is it Senator parent I don't have questions Do we have any questions from the committee if not What's the pleasure the committee We we have one thing before that mr. Walker Thank you mr. Chairman. I would point out line third three thirty five we have an effective date from last year Uh, we have a what? The effective date shows 2023 All right Point of order from senator parent Thank you mr. Chairman. I see we have like four maybe senators not on this committee who are with us um That I've never seen didn't in gg. Share before I see that none of them are Democrats I'm just curious. Can you please share the ex officio letters with me. Yeah, that's They're maintained by the secretary's senate, but I did request copies and so do we have copies of that? I never have seen this before as a matter of fact just for everyone in the audience So we have the original letters. I can't give the copies back in the originals are available for inspection Yes, they all expect them to hand them back. We'll pass them down. I don't destroy them. It's the only other than I have All right What's the pleasure of the committee on this bill? Motion do pass from center settler second from senator hatchet Does someone would propose the amendment to change 23 to 24 on line 335 Submove center hatchet we have a second second for senator beard and All those in favor of the amendment. Please say aye It is unanimous pulling back the underlying bill motion do pass now as amended all those in favor. Please raise your hand If you're in favor of The motion do pass house bill 470 please raise your hand It is unanimous in this being carried by dr. Watson There's a big thunt here. Is that right? Okay. Thank you chairwoman Cooper. Thank you members of the committee Thank you letting me go start an early on so go home put mine cold a bed. That's all right And not exactly mine All right, give us just one second as we try to get organized Uh, yes All right, let's go back to the top of the agenda house bill 505 Um, it's actually Chairman chocus and I believe Chairman hatchet might also be speaking on that um, but you can stay in your seat. Come on up If we're working off a committee substitute, which is LC 5701-8s I believe we heard your bill last year, but it has changed your bill Section one is that section one is section two is that right? I don't have that LC in hand, but I do have the substitute for my part of the situation if you can please go over that force Yes, sir. Basically what this does is it changes the offense of riot from a misdemeanor to a felony and What we've done from last year the changes are that the offense of riot when he or she engages in a public disturbance involving an assemblage of 10 or more persons But tumultuous and violent conduct and results in grave danger to persons or actual damage to property or theft that exceeds $5,000 and then that triggers it to become from a misdemeanor to A felonacer and with the felony upon conviction shall be punishable by not less than one year and not more than 10 years and so forth And I'll be happy to answer any questions All right before we do that let's have Leader hatchet if you will go over the rest of the bill for some we'll take questions on all parts. What's your might number All right, yours. Excuse me So this bill Also added back the language that we passed out of this committee unanimously earlier in the session But it just didn't make it over dealing with the material or financial support of a foreign terrorist group um So we included that in there and then working with\n\nSome members on both sides of the aisle, we've added that if you are fleeing from a riot and you're in basically fear of your life and you injure person or property that you have an affirmative defense to a criminal charge against you. And then the same for you have immunity if you hit somebody and they're rioting and they're charged with the rioting they can't then sue you. So I'm happy to answer any questions. All right, from the committee there are people who want to speak on the bill, any questions for either of the authors? All right, we will go to, I would have a question, Senator Setsler. Thank you, Mr. Chairman. I'm going to just to the author, I understand what you're doing, I think and I think appreciate the $5,000 of damage is the threshold. Grave danger to persons. I think if the underlying act is a felony towards people, then this collective violence being a riot can be its separate felony. I think if we have misdemeanor acts of violence directed at people, then because there's 10 people doing it becomes a felony I think is an issue. In my thinking, I'm contemplating how we address that, to me I'm more comfortable if there's an underlying felony act of violence that's done in this context, it could be a separate felony. Correct. I'm just concerned as it's drafted, so we're not having misdemeanor acts of violence by being done by a big group gives rise to now a felony. Well, to answer your question, the offensive of riot will remain a misdemeanor with 10 or less or $5,000 or less. Right, but if the act of violence was shoving people, I mean shoving people, right, which would be a misdemeanor battery, right, shoving somebody. But if it never rose above shoving people, if you're throwing multiple cocktails that fire, that fire, you know, you're smashing people with the bottles in glass, that gets into kind of Ag assault. I just, as we act on this, I think there needs to be a felony level of violence in this action to have its own separate felony. That's just my concern Mr. Chairman, just raise that. And I'll be happy to defer to legal counsel on that. So I got Mr. All right, any other questions from the committee at this time? Senator Jones. Mr. Chair, I'm just looking at lines on page two. Lines 34 through 37. So it seems like we have actually two defendants here. And because the victim, if he's convicted, he's actually a defendant because he can't only be convicted if he's a defendant. So the victim in this line, 35 is actually a defendant. And then we have a defendant who's trying to establish an affirmative offense. And we say that the reasonable belief of the affirmative offense is established if the victim who's a defendant, please guilty or is found guilty. Doesn't that put the prosecution in the middle of this kind of, if they find one person guilty, another person gets the defense? Have you kind of wrestled with that at all? Senator Hatchett. Because that was the language I've worked with. And we've talked about this, Senator Jones. I think the issue that I have, and I understand you're concerned, but it's the, and you said it's on line 34. Is that right? Yes. I think it's just because if someone is found guilty, they, there shall be an affirmative defense. If they're not found guilty, then they're just charged. There may be an affirmative defense. I think there's that discrepancy there in the two different, the may and the shall. I think it, I mean, I just don't think prosecutors are going to misuse this. Right. I don't think it'll be a misuse. I just think it's put some in the situation to where they're both defendants. The victim, the only way the victim can be convicted is because he's a defendant, even though we're calling him or her a victim. The other person is obviously a defendant because they're trying to get an affirmative defense. And one defense attorney is saying, if I represent the quote unquote victim, who is a defendant, if he or she, please guilty, this other person now has an affirmative defense to the case. This defendant here, his attorney is saying, I want you to go get a guilty plea on this guy so I can actually get an affirmative defense. Even though it's then say, shall, it creates the affirmative defense is created by someone pleading guilty or being found guilty. But even though we're using terms like victim, they're both defendants. The victim can only be convicted if he's a defendant. They're both defendants. And just to make sure I'm happy to work on some language if we get this past and maybe do a joint floor debate or a floor amendment that we both agree on. Because I know we got a lot to get through time. All right. Let's go to the public testimony. If you want to step aside, we have people coming up to speak on it. We'll start with James Woodall with Southern Center for Human Rights. Good evening. Good evening, Mr. Chair and tonight. Good evening. Good night. Good morning. Not yet. We won't make it. James Woodall, Southern Center for Human Rights, arrives today in opposition to this legislation. One, I want to actually begin where Senator Jones left off. Our concern is that right now, and I actually believe that Representative Chocus is incorrect that this bill would eliminate the misdemeanor 161130 because on line 46 through 59, that essentially repeals the existing language. And so all we would have is a felony offense of rioting, which would involve an assemblage of 10 or more persons by, um, to multiple symbolic conduct. And so there would be no misdemeanor provision. Secondly, I would raise that punishment that this conduct that this bill to cease to address, is already defined in Georgia's code. And so I would, you know, reference, you know, for example, 16521, which Agassal 16724 criminal interference with government property, 16723 criminal damage to property and second degree. All of those are contemplated already. And so what we're doing is in my estimation, in our estimation, rather redundant. Importantly, I mean, secondly, several of these affinces are already punishable, not just as misdemeanors, but also as felonies, particularly when the affinic conduct results in bodily injury or property damage above a specified value. And so we would use that to say the kind of is being addressed here is already covered. Secondly, I would raise that the substitute language criminalizes otherwise protected activity. Excuse me, I'm actually going to go to the second part of the bill that comes out of Senate Bill 523, which we did not hear presented by the sponsor. And one, I would also add that we appreciate Senator Hatchett for the work that he's done on 523 in terms of helping the legal organizations that do provide legal representation to some of these people that are accused. But we still have issues with the existing language. Thirdly, I would raise that the bill in its totality could punish protesters for exercising their right to free speech. And so whether you're talking about anti-riot laws or you're talking about material support, again, this chill speech regardless of if there's the affirmative defense that was just discussed in length. We have grave concerns about the direction this puts us whether it's in terms of democracy in the first amendment, whether it's the redundancy of criminalizing activity that's otherwise lawful. I would raise, as a point I know this will come up again, going back to the House Bill 505 subject to that talks about the violent and tumultuous conduct under Georgia Coal all persons connected with and sharing in the common purpose of a riotist assembly, our guilty of riot. And so this bill would steal criminalized people even considering the affirmative defense. This still could chill speech and it discouraged people from actually participating in a lawful protest in organization with the fear that it could become violent tumultuous any matter. The last thing I'll say Mr. Chairman is that that or whoever that is not defined in terms of what would constitute a violent and tumultuous act. And so with that I'll pause. I'm sure there be others who raise some other issues, but this is broad. I mean it criminalizes otherwise protected activities. And what I'll also add, you know, we talked a little bit about this in when the bill was first heard 523 about the linkage between federal terrorist organizations and federal terrorist activity. What we are doing now is broadening the scope of what could be constituted under state law. All right, we're back. I think everything except you're asking to take questions should have been still live. Any questions for Mr. Woodall? You have a question from Senator Bearden, one of our newest members. Welcome to the committee. Thank you Mr. Chairman, just a quick question. Where do you define a peaceful protest on a right? What separates that just our curiosity? So in Georgia law, a right is currently defined as any two or more persons who shall commit an unlawful act of violence or any other act in a violent tumultuous manner. There are two distinctions here. One, the violent act or you commit an act that is not initially unlawful, but you commit set set act in a violent tumultuous manner. And what that has been constituted as you can literally just be using profanity and screaming at the top of your lungs. That can be constituted as a violent tumultuous act. And so what we are doing is essentially codifying the ambiguity of what to your point, what is a riot. And right now it's a misdemeanor. And as we elevate that to a felony, we are now essentially allowing for there to be prosecution of people who are simply screaming at the top of their lungs out of protest. I guess I was just trying to figure out exactly how this is chill free speech. That's a great question. Because I as an ordinary citizen in the state of Georgia want to attend a speech, I mean to attend a protest or a rally or something. And this bill were to become law. Arguably, it could be prosecuted if someone uses profanity in a loud manner. Because what we're contemplating is not just a violent act or an unlawful act rather. We're also contemplating actions that are lawful, but just done so in a violent tumultuous manner. I appreciate your comments. I think we just have a little bit different opinions. Well, it's not my opinion. That's what the Supreme Court is actually defined as a riot. So thank you. All right. No more questions from the committee. Thank you, Mr. Woodall. Thank you. Ben Lond. Good evening, Mr. Chair. I know the hours late. So I'll try to be brief. First, I want to thank both authors who've presented these bills today in the sense that both HB 505 and HB 523 are remarkably in better condition than they were when they were previously before this committee. I think the ACLU of Georgia does still have concerns. And I just want to touch on a few things. The first thing I want to go to, and this is directly to Senator Bearden's question, I again, my definition of riot is irrelevant, but the definition of the Georgia Supreme Court is relevant. So when we look at this concept of non-criminal acts, which are done in a violent tumultuous manner, we have a case to look to that's the only case I could find of that actually analyzes that language in a vacuum with those conditions. It's green versus states from the year 1900. So analyzing it gave several examples, one of which is persons conducting a shiviarari or serenade with bells, horns, tin pans, guns, etc., or guilty of a riot. And another one, several persons marched back and forth along a highway, blowing a horn, singing songs, and halluing constituted a riot. And so when we look at language, now understand that this has been modified in some ways to aid our concerns, the course of a political system, or however the words, I don't have this substitute in front of me, that still gives us concern because isn't that the point of protest is to influence our government. I wanted to raise a couple other concerns regarding the affirmative defense language. There are already on the books, justification defenses, one of persons, one, if your habitation, which is your car under Georgia state law, is threatened, there are already rules on when you can assert a justification defense. And if your life is put in liberty, where you can assert a justification defense and use lethal force is a special category of its own. Given that, again, it's not something that I personally condone, but when people do enter the roadway, that is such a ubiquitous and common form of activity, protest activity, creating this special rule gives me some pretty significant pause, that something that is so commonly employed, now that it seems like what's reasonable some, you know, enough to assert probable cause to arrest, in this case, a sort of a justification defense. I'm concerned that this would give drivers who knew about the affirmative defense a feeling that they wouldn't have as much of a concern about just driving through a crowd of people. And because, you know, what won both for the sanctity of human life, but also because of how important the right to protest is, that I have some pretty significant concerns about section one and I believe section six, which is the civil defense. And with regard to material support to terrorism, given how that kind of language has been used to go after people who are unwittingly supporting, or they are intentionally supporting organizations that they that later are defined as a terrorist organization by our government, we've seen examples of abuse of that in the past. And so automatically that's something that the ACLU has pretty grave concerns about. I also question whether or not this law is actually necessary, given that Georgia has one of the most expansive party statutes in the entire country, where if anyone intentionally embades or the commission of a crime, they're just as liable as anyone else is, and that's just having a shared intent and doing any act, which is in furtherance of that, it gives you party, which means you're just as liable as anyone else is. And so I don't actually understand why we need a material support for terrorism, but unless it's to not have the intent to actually support the terrorist at GAC, but with that that's my comments, I'll stand for any questions. Any questions from the committee. All right, thank you. Thank you very much. And last up, Maisie Langerten with Gactel, Georgia Association. Nothing else to add. It would be duplicative. Thank you, Miss Gerten. That's everyone at sound to speak on the bill. What's the pleasure of the committee? Motion to do pass by committee substitute from Senator Hatchett. Do we have a second? Second from Senator Jones. We do have an amendment that legislative council has pointed out. Were you going to offer an amendment? Somebody pushed about. Is that you, Senator Jones? Senator parent? Senator Setsler. Senator Setsler, sorry. Okay. I'm going to recognize Mr. Walker. Thank you, Mr. Chairman. If I would recommend an amendment actually on lines 22 and 23, where there's a reference or a definition for the term riot as provided for in code section 161130. Section two of the bill repeals the existing code section 161130, where there is a definition of the term riot. So by that repeal, you would actually lose a defined term. But I think that that could be cured by making a reference to rioting. So in line 22, I would recommend that it be amended so that it reads subsection A for purposes of this code section. And the term of the term riot shall have the same meeting as provided for rioting in code section 161130. As everybody understand, the proposed amendment. Does someone offer the proposed amendment? So move a Senator Hatchett and second it by Senator Setsler in discussion. All those in favor of the amendment, please raise your hand. I got to look at you, Dr. Watson. You're an amus. All right. Any other amendments from the committee, Senator Setsler. Yeah, Mr. Chairman, I just want to offer the author. I'm on board with the framework. I get the 10 people. I get the two most of the violent conduct, actual damage. I love all that. But results in grave danger. I think what we're looking for is if you have a violent results in a violent felony to persons. And then the damage to property, you have not only the violent felony that an individual have committed, but there's a riot, a mob that's perpetrating felonies that get wind of felony for all the participants. And that's a pretty stiff pop for being one of 20 or 50 or 100 people that all are going to get caught up with this felony. This one to 20 felony. If there's not a felony that's been committed against an individual anywhere, it becomes a rowdy soccer crowd. I mean, I don't want, I know it's not your intention to get rowdy soccer crowds who break a gate and some fencing and it's $10,000 to fix it. I think if there's an underlying felony, a violent felony is committed, then I think you kind of get into felony land with the group. That's, that would be my suggestion. I would like to offer this amendment on one of the author's opinions of that. I don't think that a prosecutor would would go for a riot for an unruly soccer crowd. I think they would find them. I mean, this is my opinion. I think they would use other laws to determine that because in the definition of riot, the intention is to cause, to cause a tumultuous and violent conduct. An unruly soccer crowd wouldn't, in my opinion, apply in there. And to the chair, I mean, again, we have this continuum of behaviors. You know, you, I've seen violent soccer crowds turn violent and the police are breaking out belly clubs and beating people. It could get quite, and there's a continuum here. You know, I think what I'm concerned about is that people protest, they break laws in protest. I'm not suggesting that folks shouldn't get a jail for things. You know, if you create, you block a street, you block cars, you create havoc, there's a traffic back up. Someone goes to jail for that. But what we're talking about here is who would you get a prison for? And I don't think people who block streets and protests, that they ought to get their butt cuffed and taken to jail for, send you to prison for one to 20. That's the concern. If there's not an underlying felony in it, we've wrestled with this before. If there's not a felony somewhere in this, in this crowd, how can you make a whole group of people subject to a one to 20 felony? If there's no felonies in the, in the mix of this being committed, just because they're, they're involved in non, they're involved in some kind of protest. I'm not saying the protest is okay. We, we tend to furrow our brows and get upset when someone does something that's, that's breaks the law. I agree with it. It's, it's, it's, that's why rioting is a misdemeanor now. But to do felony rioting, and if there's nothing in that, in that group, no predicate act in that group that is a, itself a felony, how can everyone be guilty of a felony? If they participate it? Right. They participate in something that was, that was not, there was no felony among the bunch. How does the whole bunch get a felony? That, that's my concern. So I, I understand what you're doing. I don't have an issue with, they're being this felony umbrella over a group of people that are doing violent things, one of which or two of which or three of which are a felony of active violence. I agree with that. But the words in the page here don't require that. The words in the page here say that you can have a misdemeanor active violence. But, because you're participating in a group of people, I might not have done anything, but because the center from the 30th, there's more than 10 people in this diast. The center on the 30th hypothetically had a misdemeanor active violence because we're, we damage 10,000, 10,000 dollars with damage to property. And there was a misdemeanor that was, that was conducted that put someone in danger, it was deemed to put someone in danger, we're all now felons. That's the concern. To me, what I, what I hear you trying to do is, if there's an underlying felony, then everybody can be subject to it. I just don't see how if there's no underlying felony for one person, 100 people can get a felony, it can be subject to a felony. I'm just, I'm trying to help you here. Oh, maybe I'm not explaining. I think the answer to it is you have the defense on a line 57 through 59 if someone that does withdraw or abandon at the time something turns into a riot. You also have the actions that would constitute a felony under this, which are lines 49 through 53. While there may not be a felony elsewhere in the code, the bill passes my read of it is, if you do these offenses with 10 or more people in a, to most just, if I can say that word right now, in violent, with violent conduct, then it would now be a felony. Right. But the, does the chair agree that there doesn't, it doesn't require a felony anywhere in this. To, to get, to trigger that section be felony. I think that is the felony. That right. I just, I can tell you the, the Senate depends on us to get this right in this room. I just don't think, you know, this has come before the legislature before. We never let something pass out as a felony riot that didn't have a felony act in it. This, this, there was a bill that the Center from the 46 brought several years ago that was, that, that, that raised this issue and the liberation process that kind of stepped, stepped this down. There were other things that were terrorist acts that were seriously dealt with, but this issue of misdemeanor violence creating a felony because it's done collectively. That's the, that's the, that's the damage is being over for 5,000. Yeah. Here's the, here's the posture and we have a motion to pass. It's been seconded. We had one amendment offered and I think, where at this, I think you're the phase of, of, of arguing on, on the bill itself, do you have any amendments that you want to offer at this time? Let me, could I ask one question to the author of the other language that's worked this? I mean, I just, well, the amendment, I'm, I'm contemplating with Sherman. I don't want to do it in an aggressive or unwelcome manner, but I'm contemplating where grave danger to persons be replaced to results in a violent felony act to persons or directed to persons. Resultant, a violent felony act to persons. Would you let our lines 49 and line 52 or just line 49? 49 and 52, Mr. Chairman. Would you leave line 51 as it is? Well, again, Mr. Chairman, I've got concerns once again to the chairs point. That's not going to solve your concerns, my point. Right. Right. Right. My concern is to the author of struct the performance of a government function. If the, if the, if the riot prohibits the trash truck from moving or the riot prohibits, you know, public access to city hall because there's, there's people trying to get into a meeting. I'm not saying that it shouldn't be against the law. It should be against the law to prohibit people from getting in city hall. But if a riot is this act, prohibit people from getting into city hall to a meeting, right now it's a misdemeanor. What this would say is if you, if you, you create a disturbance that obstructs a city council meeting, it's felony. Do we really want felony obstruction to trash trucks, you know, I mean, an ambulance, it makes it worries me that you're blocking an ambulance, but I mean, there's, is, are we in felony land because we're involved in that kind of thing? I just don't, Mr. Chairman, I want to support this effort. I just don't feel comfortable with the language. I don't know that that's the intention of the author. All right. I think at this point, where the stage of offering an amendment, we're going to vote on the bill. Is there a amendment you want to offer? Do you want to just move to vote on the bill? Would that be a friendly amendment to the author? The proposal of adding results in a violent felony act directed to, and I can't read my last, where I read it was the last, to a person. I would say this, Mr. Chairman, I would say, revolts in strike grave danger on 49, and insert results in a violent felony act on three revolts in, sorry, 52 revolts, results in a violent felony act. And then on 51, insert commits a violent felony act that. Okay. So all these, there's a violent felony act that some participant in this riots performing that leads to obstruction of government functions and so forth. That's my amendment, Mr. Chair. Do we have a second for the proposed amendment? A second from Senator Jones. Is the author or the Senate author have any feedback before we vote on the amendment? What's your mic number? 13? 13. I mean, once again, I'm good with the spirit of the amendment. I know the representative Chocus has worked hard on this. I'd probably, I probably wouldn't support the amendment at this point, but.\n\nWould still be open to try to working with the majority whip and center sets there See if we can come up some links for four. The amendment has been offered in second all I will withdraw it Mr. Chairman if there's a prospect of fixing it moving forward Okay All right, we'll draw back the airline motion to pass by me substitute as amended all those in favor please raise your hand It is Unanimous all right to be cared by Senator Hatchett after all this Center Hatchett all right. Thank you. Thank you. Thank you members of the committee all right Next building the agenda House bill 1075 represent Hilton come on up Working off the version that passed the House LC 520 443 S You can tell us what this does Floor's yours. Thank you mr. Chairman members of the entire Senate Any questions for the author yeah House House bill 1075 passed unanimously out of house Judy and and passed you nanoshoes That is a mean you thanked us so you say something else. Okay. Okay. He's telling more jokes right right. Yeah more jokes House bill 1075 applies to state agencies and allows them to accept Notural acts outside of the state of Georgia as long as they are approved within the state that they are done Just by note there's 44 different states In different ways so again, it's only applies to state agencies We did a very specific carve out you'll see online 34 to 36 to exclude Anything having to do with with real estate transactions, so you did such a good job on this are you an attorney yourself? I'm sorry mr. I don't have any money on me I don't believe that then know the tip jar we do take them any questions for the author Mr. Clayton you can only screw it up if you start talking you want to talk about it. I'd like to wave Thank you Is there what's the pleasure the committee? Motion do pass from center set sellers are second second welcome Senator Walker second from Senator Walker All those in favor of the motion, please raise your hand Where are you don't your watch these for it? All right is unanimous is senator Walker? Carrier senator sessler senator sessler all right. Thank you. Thank you. All right Next building agenda house bill 1371 I don't believe we're gonna have whip or shet here, so I am going to present this briefly Working off of LC442839 S I have not been engaged in the discussions over this issue over at least the last year But there's been effort. I think a lot of people in the room have been a part of and trying to address premises liability in our state there was The whip in the house Representing for shet carried this bill in the house There's been some changes offered since they try to go a little bit further than the house went on this trying to Figure out how to reach a balance. I think what has happened is that a tempt has fallen apart And then we probably have a bill that nobody really likes But it's probably means it probably ought to pass and it could in my opinion it can move the needle On this issue Even if it's not something everybody wants at this time what the bill does in section one you'll see It deals with Planes that are trespassers or loadering on property it says that they cannot Bring claims for premises liability if you are a trespasser or you're loadering on property It also says you cannot bring a claim if you enter property for the purpose of committing a felony or for the purpose of shoplifting There's an exception in that clause you see Lines 18 and 19 for victims of human trafficking. I think that kind of speaks for itself Lines 23 24 deal with the issue of force the for seeability and this is an attempt for Understanding with the intent of this was to codify the case law and to confirm that while high-crime areas itself can be considered as a factor for Forcibility that that in itself is not enough to establish a duty to keep the premises safe and Finally under section two this deals with the Portiamont and this confirms. I believe this is a True ship knife in the case law at this time that a jury shall consider a Portiamont and consider the amount that a Person committing a crime should have to account civilly for that offense as well There's probably I don't see a son sheet Maybe a little interest in speaking on the bill, but I will now Open it up to Let me first for do that. I guess as author sitting here any questions from for me on this bill Senator dolezal Thank you, chairman. Thank you for presenting the bill Can you clarify for me? I guess it's section a here does this This references the code section for invitees is that correct? When you say it references the code section 5131 so where these bills that I've Delt before we've tried to deal with invitees licensees and trespassers that generally deals with premises liability claim that self is monitoring how to pull the code section up which we're about to do I did pull the code section up and and it Reference is the implied invitation or induces release other others to come around the premises for any lawful purpose which I think in the colloquial language would be an invitee and so I'm curious If that's correct And I see that code section referenced multiple times in other places What if anything does this bill do relative to licensees or trespassers? So the code section that you reference is a general provision deal with the obligation of an owner to keep a property safe for invitees And so in our and I guess in a legal sense this is the premises liability generally clause And so your question was what what was the question? Well if you read down to 3.2 and then 3.3 you'll see licensees and trespassers And so I'm I'm just noticing the omission Or I should say really more so the exclusivity of this bill focusing on 5131 which is invitees I'm just trying to clarify for my understanding is this does this bill focus on invitees and is it silent on trespassers and Licenses so it is dealing with those that would have a claim for premises liability generally and What the bill does is a plan if that is injured it would have a claim for premises liability if they are a trespasser or They are basically approaching as it says here the premises without express or implied invitation Then they would not be able to bring a claim so it does exclude those claims in second it Also those that are going on to someone's property Whether they're invited or not with the purpose of committing a felony or shoplifting would also Not be able to bring a claim so how referencing 5131 how does section one there apply which is is Diometrically opposed to the definition in 5131 How does someone who is invited on a property Approach without an expressed or implied invitation that's yeah, so it's a bar it's a bar to a claim It would be a defense that could be raised by property owners as even though Let's just use a shop for example even though I'm open to the public This is someone that Trespasser came to my property to commit a felony and that was the intent or to shoplift It would actually protect the property owner our state from being sued by someone who ends up getting hurt while they're on your property By somebody else, but they came there with the intent to commit one of these crimes or they came there Not invited in any way at all If they came there not invite anyway at all that would be 5133 Which is the preceding code section we're tacking this on the end of that's kind of the hard of my question I'll let others join in maybe we can discuss that no 5133 deals with a duty that you generally owe to someone on your premises This would be additional language with this new code section that would bar certain claims For premises liability All right, so 513132 is licensey 5133 landowner possessor of land owes no duty of care to trespasser so 5133 is specific the trespasser 5133 it is not what you just said it was I'll read it to you so duty of care that so the trespassers in general Section B of that code section lawful possessor of land owes no does no duty of care to a trespasser accept or refrain from causing will for a long time injury That's correct generally with a trespasser this goes beyond that this actually goes beyond someone that's that's entering premises Without express or implied invitations a little bit broader just a trespasser I use the word trespasser, but it's about legal definition trespassers a different term than what I use this is broader anybody that came on your property without any implied or Express permission would now be barred from bringing the claim are these circumstances Okay, I'm just curious why the reference then to the first code section I mentioned and maybe I missed your answer on apologize Understanding and others can correct me because I've been involved in this for a few hours versus a year But my understanding is 5131 is generally the paragraph that that allows for premises liability cases in general And that's why you have a reference back to that But what this bill does in this part I believe is consistent with the house passed Would actually bar these claims and these circumstances here? Okay, I'd be happy to read 5131 if that would be helpful We're an owner occupier of land by expressed or implied invitation Induces or leads others to come upon the premises for any lawful purpose. He is liable End damages to such a person so that that speaks specifically to the invitation right sure next section speaks because this is all about duty of care And what duty of care does the landowner have in these third-party negligent or security? I'm sorry this third-party security case negligent security cases The second one speaks to a different duty of care that is applied to licensees and then lastly the third piece that reference speaks of the the duty of care That is owed to a trust passor so the bill that we passed out of chairman Walker's committee addressed all three of those Qualifications of person who is on a piece of land the duty of care the landowner had to them So maybe a better way of answering my question is Does this bill as you understand that speak to separate duties of care for those three different types of individuals? No, I'm understanding of the bill is just as I described it What this bill would do is protect a property owner from someone bringing a claim Against them for injuries they have on that property when they come on that property without express or implied permission When they come on your property the intent to commit a felony or to come on your property intent to shoplift with the only exception being the human trafficking exception So those parts of the bill now is there more you could do in these code sections? I'm sure but that's what this bill does this bill does provide those protections that are currently not provide about law Hello, you're my back on I believe it does everything that you just said but only for invitees and That's I think the reason why 531 sorry 5131 is repeatedly referenced in here But the other two sections I spoke to you of or absent it does reference back to 53 51 3-1 but keep in mind invitey is not someone you just say come to my property It's also a store a small business is opened and being open to the public obviously invites people to your property and That's again in the discussion was bill is there is there are things you could do in Georgia law sure But what this bill will do is protect those business owners and these types of claims Senator Kenny Thank mr. Chairman I I too have the same questions that chairman dola's all has And I read it the same way he does and I think Two very intelligent folks reading this are coming away with two different interpretations I think the only way that we can read it the way you're saying it's to be read is if you added That an owner or occupier of land shall not be alive will under code section 51-3-1 or 2 or 3 Otherwise, there's an internal inconsistency because as was pointed out if You're traveling under 51-3-1 which applies only to invite ease It makes lines 13 and 14 Nonsensical because it's you're talking about in bytees and then you've transitioned to where the plaintiff came upon the land without Express or applied invitation If they are that they are not an in bytee If the intent of this is to apply this protection to all three classes of Visitor to a land to a piece of property if that's what the intent is that you would have to include all three code sections Well again the intent is to Address the situation I provided which is you have a business owner that is open to the public Has someone come on their property with the intent to commit a felony or intent to steal from them or They're come onto their property after being expressly told not to come on their property Those individuals under current Georgia law would have the ability to sue that property owner for crimes that occur They go on your property then they get shop us someone while they are there. They're injured somehow what they trip and fall while they're there Whatever the injury is this bill would protect against those types of claims and provide those protections for our business owners Where while again is there more you could do and go into other code sections maybe But this bill we have what it would do is protect those business owners in the situations I respectfully disagree it can't and the reason it can is the very beginning is an owner or occupy the land Shall not be liable under code section 51 3 1 sure, which is only in vitis everything else follows that Right and that's invited that's up broad as parameters An invitee that goes on to property to commit a crime under this bill Again would not be able to bring a third party a claim for third party liability What about a trespasser? No a trespasser could not either but again trespassers define term But this woulding this is a little bit broader and would cover Anyone that approaches without express or implied invitation It's for the words of the bill I understand the words of the bill, but they're internally inconsistent They are when you limit this applicability only to invitee's Then the owner doesn't get the protection if a different class of person comes on the property Yeah, and if the intent is to do what you're describing then we should amend it to include Three-two and three-three so that all three of those classes of Someone coming on the property Under any of those three which is what you're describing the owner gets the protection Right now it will be argued by counsel that for the trespasser who came on and did this There is no protection for the property owner because it only applies to invitee's just disagree But that's what lawyers do I guess all right. Can I can I move on to another question since you're presenting so section two on lines 15 and 16 On that same section that your question center hatchet. Let's we'll get an intersection by section Understand what the center dulles all and center can your protein can you're saying it's 51 33 deals with trespassers and it says it deals with the will for a warrant conduct 51 that dash two Also will for wanting for licensees, but I mean, I don't think it would do anything Honestly, I think I kind of side with the chairman, but I'm okay with that in that language in there too. I'd support that Support adding 50 yeah, but I think you'd have to do it on 11 and online 20 you'd have to do 51 3 1 51 dash 3 dash 2 and 51 That's 3 dash 3 on line 11 and line 20 so that captures their concerns So 51 dash 3 dash 2 deals with licensees correct and the trespasser part you don't owe a duty to a trespasser accept right All right, we'll go back to that. Let's go back Senator candy to you're going to another section. Yeah Thank you, Mr. Chairman looking at lines 15 and 16 so if we're talking about an owner of land Should not be liable set aside what class of person comes on right or the plaintiff Came on the land Without express or implied divination so since we got the conjunctive or we can disregard one so we go back to the owner of the land shall not be liable To a plaintiff or injuries incurred by the plaintiff from third-party criminal activity Skip down to 15 where the plaintiff came upon the owner or occupiers premises or Approaches for the purpose of committing a crime punishable by more than one year in prison So my question is what is the thinking behind why we limit it to a Conduct that is an essence of felony Yeah, because what I what I understand then is so if I'm the owner of land and The plaintiff comes on to my private property as an invitee under this construction for the purpose of committing a misdemeanor Then the plaintiff can recover from the owner That's the current but if the same person came on to commit a felony they can't Either way you've got someone coming on private property for the purpose of conducting criminal activity sure That doesn't seem like a policy that's a broader that's a policy decision for us to make All I know is the current law says either way you can bring a claim What this bill does is it um Dills with felonies and deals with shoplifting And it goes back to the point of if you want to present something that's more expansive And that's something anybody can do but this bill does at least covered those offenses the felonies and shoplifting Which current law does not as far as I understand it protect against where's the shoplifting reference that is line 17 Chapter eight of title 16 okay That's shoplifting that is my understanding we'll pull it again I'll sit next to Patrick So offense sitting involved up. Yeah, I use the word again I'm using certain terms like shoplifting trespassing, but as any offenses involving theft that are included in 16 eight dash one through 16 eight dash one of six So it'd be beyond shoplifting There's a long line of offenses that are included in that What was that on are you still in that topic is it okay? Let's be honest. Yeah, I'm curious what the policy reasons are behind why we would limit the type of criminal anticipated criminal conduct By the by the criminal To give the owner Protection well the question of edg why not any criminal conduct well that's a Again, current law doesn't say that at all. I'm sure people that do these cases could give examples The question's gonna be with this bill if it goes as it is Do you want to make sure that those that are going with the intent to commit a felony and a theft crime Cannot bring these claims order we want to allow those claims to move forward as it law currently allows Senator sceptsler I'll try to answer the Center for the 18s and this is I mean to this Senator Kenny I When I read this I thought it was kind of creative the way it's it's felony or a theft which is going to commit a property crime if you were For example if someone was injured and they found out that they had misdemeanor possession of marijuana. There's pot in their car Well, you could say well they came onto the property to buy chewing gum and some Doritos and a And a mountain do Because they've got pot in their car They came to commit a crime therefore they don't have the ability to bring a case or if they were If they're found to be involved then a if it's a prostitute for example, and she's part of some You know happen to be in a convenience store and something happened to her and she's in you could argue that she's involved in an active prostitution To does that make her not able to claim to get recovery will the Act of having pot in your car which I'm not diminishing but It's not related to the perhaps the Being in the convenience store or the place of business and that by virtue of you being there with that does that Keep you from being able to get recovery. I don't know those two are linked. I think I'm the felony Keepship from being linked a theft Or something that's in furtherance of a theft keeps you from getting recovery That seems appropriate in germane, but I don't know that some other if you're Part of some other misdemeanor scheme that's going on. It's not related I think that's what's getting at much easier question. That's our read it Senator hatchet. Yeah, and I I think Obviously there's a plethora of cases that we could or hypotheticals that we could come up with and I think this language in particular is appropriate To protect and underage College girl that walks into a bar and gets raped and Athens Who is drinking underage which is a misdemeanor? I mean I've got daughters. I just I think it's dangerous To open it up to all crimes because you never you know, we're you never know I just I think this language is pretty appropriate there Senator can you have other parts you want to address? Thank you mr. Chairman looking at lines 21 So Says under this code section again limited by 51-3-1 For injuries arising from third-party criminal activity whether the premises or approaches are located in a high crime area Is that defined anywhere either An associated context or other statutes? I don't see it here My understanding is that has been flushed out with case law That's my understanding of that but it's not a And I'll be corrected from wrong is I don't believe it's defined term Under our statutory law, but I believe it has been spelled out in case law And again, this goes to foreseeability This is the idea that do you have a duty right to protect someone what is it foreseeable that The criminal activity is going to happen that we're talking about here would actually occur And I know there's been arguments in case law that I've read where someone says well as a high crime area Of course it's foreseeable and you could argue that you could paint that picture anywhere in the state if you wanted right Your definition what high crime is and what this confirms as well that can be a basis for foreseeability That's not enough in itself. You have to show more than just a high crime area to establish to get that foreseeability which goes to the duty Understood I think though That kind of reveals the the the the core question that I have about high crime area as well as the question online 30 which I'll go through in a minute but It seems to me that the nature of crime is fluid It's typically mobile It depends on who's in a particular place at a particular time Um, and I think that creates some real Challenges the fairness to property owners especially if you are Your property isn't the subject of criminal activity, but you're close to Property that would meet that definition. What do we do about those people that I can't agree in a high crime area But they've done what they can I can't agree and those those are the people that this this would help because it's saying the Factor in a high crime area in itself is not enough While that can be a factor as we know That can be a factor it takes more than that and the fact if you did take certain actions to Protect against crime than that would obviously be Part of of the claim as well part of your defense But the bigger part you're looking at here is whether I know forci ability do you get the duty? That is owed to someone Based on just there being high crime this bill confirms that's not the case Well, I don't think it's just high crime and I guess the question that comes From a policy standpoint do we want to inject that as Something for consideration um In the way that this does and I guess that that's a policy decision. We've all got to give you another clause each time Sure Well, I think without defining high crime area and the challenges that that has and like we talked about where you have a adjacent property That is not a high crime area or someone deems it is, but it's not the subject property that's they own I think it creates some real difficulties, but again Obviously the current law doesn't have that at all. I don't think you'd agree with me that The current law doesn't define and code what a high crime area is um What this will do is confirm again that someone can't just argue because there's high crime that that means It was foreseeable that that would occur Well, I think you'd agree with me. This is at least a step now if you want to go further again You have the right to file a bill and do that or file an amendment and do that But this does need a lot of that I'm not sure that it does because does a law currently address or say that a high crime area Should be deemed to be reasonably foreseeable. I don't think it does So I think this interjects that issue where it's not in the law now. I don't My understanding is in our code now it does not address the fact That the mere fact that you're in a high crime area Um can be used as a basis for foreseeability and this will do that But under the current law it's not precluded It's all in case law all right, okay Which is why we we've got to make good statutes right okay Thank you, Mr. Chairman. Did you have anything else you wanted to address not on that section that may be yet Other committee members Senator harbors welcome to the committee Question get your Michael a little closer we can hear you senator dollars all here senator dollars all brought up 51 3 dash 2 and dash um Dash three and I was reading dash two in it and and I'm trying to understand from your standpoint While we would not include all three that are there the way it is defined Um, I'm to it declares that the owner or lawful possessor owes no duty of care to a trust passer except to avoid Will for a wanting injury such Actual injuries occur when the owner allows unreasonably dangerous conditions Or can siege from them from the concealers room from the occupant it I can understand that issue, but if he was coming Why would we not use one two and three in that issue? I'm trying to understand that um Yeah, this is the All I can say is this is the a version that was um He goes shaded at great lengths by everyone involved in this um now if we want to go further it include License ease and I think the the trespassers I believe or I think we all agree it already is addressed directly in 51 3 3 I'm not sure we want to change that do you care trespassers? I think it's Seems to be pretty clear, but whether licensee should be included um, that's Question for the committee You Are questions from the committee for the current author of the bill? Senator Hodges or senator Walker who's somebody pushed about senator Walker\n\nNumber 12, thank you Chairman. I have a little bit of money and I'm not a lawyer. But... Pass this down please. I am an insurance agent. And I do know that... Got lots of money coming out of that. We're finding it skyrocketing premiums and harder and harder to place business. I'm going to give you two dollars. That's good. I'll double what the lawyer friend to my right did. So this is a very important issue to our business community, to our economy, to our citizens. These calls and insurance premiums do get passed on to the consumer. So because I'm here at almost 10 o'clock, I'm going to ask a few questions, even though I'm brand new. What about this whole 20 to 24 that Senator Kennedy was just talking about in the high crime area and the foreseeable online 24, it says, or 23 to 24 sufficient to establish a duty to keep the premises and approaches. So from criminal activity, doesn't a property owner already have a duty to do that? Yes and again, this goes to qualify that duty and to limit that duty. And what is saying is the mere fact that Larry Walker's insurance company is deemed to be in a high crime area, would not be enough to meet that duty. It would take more than just that. So it can be a consideration, but that would not be in itself or not. That's what it appears to me the intent is. Would there be any willingness to maybe just strike that whole part that interjects the high crime area that's not defined and just seems like it creates. Yeah, I mean, honestly, ambiguity and some confusion. I mean, if the property owner already has a duty to keep their premises and approaches safe from criminal activity, I don't see where it's. You would not have anything in the law and code that says that high crime area in itself is not enough, but if you strike, you would fall back to, you strike all this, you're back to where we sit today. Okay, so that's one question. And then my other question is on the portion of percentage or some percentage on line 32. Yeah. Is there any way to give more guidance to the court or the judge on how much a portion of that? That I believe is a jury question by law, not understanding some I correct me that knows better than me. Law doesn't say this at all. This is I think you could argue that you're codifying some case law when it comes to 2324 and maybe clarify some case law, but. Not understanding its current law does not mandate as this does that the person that calls the injuries be a portion part of the fall. And so it is a pretty big policy shift, but juries are responsible for what the portion is because it may vary by the case. And I think you ultimately it's just now your opinion world, my opinion would be it's that's a jury case by case, but they'd be charged when they go after hearing a case that they are they must now. Consider the. A portion of the damages that's owed the person that committed the crime. So it wouldn't be probably legal or appropriate to put at least 50% or anything like that. Probably not. Okay. Thank you. Any other questions from the committee? There are others that want to speak on it. Senator Dullesall. Thank you, Mr. Chair. One last question if you'll allow it on your your fine bill that you've worked on here. Thank you for your handwritten notes in the last hour. Thank you for indulging our questions. I do have some concerns with this high crime area piece. Obviously this has been something that's been been used evidentiary in cases. And essentially. By codifying this into law. You're saying that it may be considered we are essentially. Allowing evidence to be used to. To be used against the landowner for something that's completely outside of their control. And so. And I wonder thinking about. Perhaps a real world hypothetical example of this if we were to say that Buckhead was a high crime area. And a crime happened at the St. Regis. Which is not really known as a high crime place and who has security is the fact that Buckhead is a high crime area. Are we going to use that reality to condemn the St. Regis and potentially say that they are going to be held liable for something that happened because. A mile and a half away there's a consistent history of crimes at a gas station. So my opinion that's a great example of why you would want this language because what this says is that cannot be what you use to find for the ability. Well, it can be a factor. Obviously in current law allows it to be a factor. We will codify that current law is not a lot of current precedent allows it. And I think that part of what we're doing here. I hope is looking at some of the precedents that we have an issue with and looking at the fact that the courts have said that we need to. There is some question as to as to what the intent of the legislature is. I think that this is a piece that we need to really think about as to whether we do want this to be consistently entered as evidence in cases against landowners. That three miles down the road. You had a gas station that consistently had car jacking at it. Therefore, you need to provide these levels of security measures outside of your hotel so that there's not an assault case or that in an assault case that there is something that you get pulled in. I'll leave that out. Secondly, the question of importionment is important. I think that we know in the CVS case there was 0% fault that was placed on the person who actually committed the crime. The six flags case there was 8% fault placed by the jury on the person who actually committed the crime. 92% placed on the landowner. Well, I think we can disagree on the nuances of these things. I think that reasonable people would agree that the person that commits the crime bears the majority of the fault. The sum here, the word sum on line 32 gives me concern that we are codifying the ability for people to use 1%, 2%, 3%, 12%, to meet that standard. Then we're really removing the ability for those who already have to be set aside. I wonder if I'm not the lawyer. I refer to the lawyers here. To me, some opens the last purchase. I think I'm not a lawyer. I know $2. We've been doubling. You're at $4. Larry, I gave you five bucks a couple of weeks ago to get a haircut and you never got it. Can you guys pass that down to Larry? You have $4 if you want your bike to stay on. Send me your Venmo. I'll take care of you. Okay. Keep the five bucks and get the haircut this weekend. We'll check on you on Monday. He only has $100 bills. That's true. I wonder if we replace some with reasonable or if there's a more technical term for those people who are a lawyer. I don't owe any money for that. For those that are a lawyer. That was okay. I have just a portion of the ball. That's what it says. So the sum percent, would you agree that the sum percentage would codify into law that Jerry's can apply 1% fault to the person who shoots somebody in the head and apply 99% fault to a landowner. And we would be handing out verdicts with those percentages codified in our code. And if so, I think we would all agree with this problem. I will say again, with all due respect, there's been attempts maybe by you even to pass other versions of this. They have not been successful. Could you go further? Yes. If you don't pass this, that's zero. That's current law. The person responsible is not the jury is not obligated to do any percentage of fault. What this says is they must consider fault. They must, they must shall, in better words, shall a portion sum percentage of fault. Could it be 50%, could it be 1%. This requires them to do it. Current law does not. So could you do more? Sure. You got to pass the bill. And that's kind of where we sit here. Can we move the needle on this? Or should we just continue to do nothing because we can't agree on where the needle should be? And that's where, in my opinion, this is giving the votes in the House and Senate. This is a way to move the needle on this. And down the road, if you want to do something to try to go further and get it passed, you have a chance to do that. Is this bill, how much of this bill here is what actually passed the House? I don't believe it. I think this, we're going to pull it up. I believe this section is very close to what passed the House. Okay. Well, let me take one thing in time. The House did very little on this. They did one section, right? Yeah. They did include this part. The line's 18 through 22. No, I'm wrong. Best of that is lines. 23, 24. This part was not in the House version of all, I don't believe. Someone can correct me. Right. Yeah, this was not the House portion at all. So the House didn't even address this. Okay. So I'd hope we at least can move the needle more than the House did. Well, my concern is that in an attempt to move the needle if we make it worse, I think we would all agree that's problematic as well. I agree. The question is, some percentage of fault or... A reasonable... Again, if you want to do nothing and complicate it, that's possible. You're presenting with a binary choice, I don't think exists. What I'm saying is that we could actually make this better, send this over to the House, and they would find this to be agreeable as well. I know. I'll say it's... I know you knew the committee as others, but we take amendments. If you want to offer an amendment, then at the appropriate time, we'll have a right to offer it. Would you be open to the amendment to remove this bill and replace it with the bill that Past Chairman Walker's committee? I will be as patient as I can with amendments. Send me your memo. Are you... Somebody else pushed it about it. Senator Hodges. I've got a simple sidebar question, I guess. If I'm a property owner, say I'm a convenience store, and somebody comes in to shoplift, and somebody sees them shoplift, and they punch out the person who's solving. I, Z, owner of NL, I will. I'm going to hear a lawyer answer, you could be. Under this? Under this, you would have a defense that you wouldn't currently have, codified, or is it law? Under this, I would have a defense that I don't have now. That's right. Okay, that's the answer to my question, and I was like, otherwise you'd be relying upon case law to make your defense. You had a question before we let people who probably know more about this than me speak. That was an invitation to move on again. Senator Kennedy. I'm not just... You may not want to answer this, maybe we can come back to it, but if you could help me with this. So D1 under section 2, lines 32. A lot of 34. Okay, yeah. It lays out the standard, and then it says, comma, provided that all requirements of this code section are otherwise satisfied. I don't really know what that means in the context of this section, and maybe we'll defer on that. Yeah, I think that's generally the rules on a portionment, and what Andrew does a portion, I believe. It is, and I've read that statute, and I still don't understand what that means. I don't know if it's a qualifier that limits this or expounds on it relative to 51, 12, 33. I just don't know, and I thought if you had an opinion, you could help out. Yeah, I don't know, maybe somebody else would not sit on the bail scheme. Yeah, I don't know. Okay, thanks. All right, let's move on to our speakers. Skin edge. And skin, I can't read what you wrote. National Association Security Companies. Yes, sir. Welcome. First time this year to this year, I think, to this year. I think one of the time, Mr. Chairman, you know, with the municipal court judges. Oh, yeah, that very important bill groundbreaking. We passed that today, didn't we? Yeah, actually did. Yes, sir. Well, Mr. Chairman, members of the committee, I appreciate the opportunity to come before you and make some comments on this substitute to 1371. Senator Walker is exactly right. One of the biggest problems we are facing in this state today is the increased cost and the increased exposure, a lot of built exposure that businesses are facing because of these third-party court actions that they are having to defend and having record judgments entered against them own. It's a huge, huge problem. It's such a problem and it's gotten so out of hand and I imagine Senator Walker probably knows a little bit about this as well. It's gotten so out of hand that you're seeing insurance companies either leave the state. They're refusing to cover, provide liability coverage. Or they're saying we're only going to cover up to just a certain amount or they're raising the deductibles. All of which lead the business community, the business owners and the property owners in a very delicate situation where they have vast exposure to a verdict being rendered against them for a third-party criminal act that they did not commit. The thing about that is that right, does that sound right? So it's a huge problem. Ladies and gentlemen, the committee, I say to you tonight, and I think some of this has become hopefully apparent from some of the questions, good questions, I've been asked already, I say to you tonight, this bill does nothing to address the problem that we're having in this state. It does nothing. If anything, it moves the needle backwards, not forwards. And I can assure you, if we thought that the needle was being moved forward in a meaningful way, I wouldn't be standing up here opposing this bill, nor would the Georgia Chamber of Commerce, nor would NFIB, nor would the insurance community, nor would the entire business community. The only people I know that are supporting this bill is GTA-LA and their folks. That's it. The entire business community is against this bill. We considered language, we negotiated in good faith for hours and hours and hours at the beginning of this session, and could not come to an agreement with the other side. And we decided that we couldn't, that we would step back and try to address this problem next year. And I think that time has come. We are here tonight, three days left in the session. At 10 o'clock or so at night, trying to deal with one of the biggest problems we got, and I'm afraid if we do that this late hour, we're going to get it wrong. And I think every business person in this state will tell you, if you adopt something like this, you've gotten it wrong. Now, let me make a couple of comments, and this is just not skin edge speaking. The Supreme Court, when they ruled on those cases, those three consolidated cases, one being the CVS case, which is the most famous. The Supreme Court realized that their hands were tied by what they thought the law was, and is. But they said, they called upon the legislature to take some action, but the appropriate action. And let me quote from one of the justices, to what extent under what circumstances, proprietors, business owners should be held liable for third party criminal acts, or decisions best left to the legislature. But they are concerned, and the justice said, I am concerned about the impact these rulings have on those who reside in high crime areas, who face the harsh and mounting reality that businesses face with increased exposure liability. Because of the very area in which they have chosen to do business, we'll cease operation or raise their prices to offset the cost of additional security measures. And I wonder how these forced business decisions will impact the residents who will lose ready access to resources they need for a daily life, because they are no longer available or affordable. That's the Supreme Court speaking. Ladies and gentlemen, what they're talking about, frankly, are food deserts, pharmacy deserts that you see popping up all over this country and all over this state in certain areas, because businesses say we can't accept liability, the risk of liability. We can't take the risk there. And recently you've heard of some businesses right here close to the capital that have closed down because of this. They've shut down and people don't have access to their services or their goods, and the businesses don't have a chance to provide services and make a profit. So this is a problem that is recognized by the business community, recognized by the Supreme Court. And again, this bill doesn't address it. Let me just take a couple of examples. The first section of the first section, an owner or occupier of land, should not be liable. That language does not cover their employees, their directors, their security contractors, their other independent contractors they have working on the property. So what's going to happen? If by some chance the owner is covered here, then the law is going to turn around and they're going to sue some employee or some security company that they've hired to protect people or some other independent contractor for some reason. I would suggest to you that this is very narrow and is drawn for that reason. I agree, all due respect to the chair. I agree totally with sort of a dose all, sort of a Kennedy. When you look at line 11, it references the invitee statute. It doesn't, it does not say anything about licensees or trust passers. And if you look, if you look at that section, then you go to analyze 13 through 16. Those instances, the person is not an invitee. So this does nothing. It says you can't bring an action as an invitee when you come upon the premises without implied invitation. You're not an invitee. It's pretty slick how this is drawn. It's pretty slick. It doesn't do a thing when you really get through it. It doesn't do a thing. High crime area. Again, I think it was mentioned that this was an attempt to codify the case law. I think codifying the existing case law is the last thing you want to do. The reason where here is the case law, as recognized by the Supreme Court justices whose hands were tied, the case law, they don't like what they had to do. But they did it with their begging for the legislature to act in a reasonable manner. This bill does not do that. High crime area is not defined. Under this, under this, if the third party tort fees are committed to a third party tort, and injure someone, all of your premises used to be held liable. This is not limited to own your premises. It's not limited to that. Think about that. If it's a block down the street, are you responsible for that? I think in a six-flags case, there was a problem in the park, but the people left the park, got into a fight, and some bad things happened. Six-flags held liable, didn't even have it on their property. So that's the crazy thing that you get here. Let me just suggest, and this is like putting lipstick on a pig, and I don't want to infer by any means that if some of these amendments are adopted, then all of a sudden we're fine with the bill, and you should pass it. I don't think you should pass it, especially if this late hour, this late time in the session, on such a serious problem. But I would suggest to you on line 11, after occupying land, you include and disemployees, directors, security contractors, and independent contractors. That's number one. Number two, I would suggest that you add, after 51, you add 51, 31, you add 51, 32, and 51, 33, to make sure you've covered everything. So understand, even if you do that, the protection you're offering the property owner is so limited, so limited, you only offering them protection if somebody comes owned by, as a trust passer, or if they came on the property to commit a crime, that's it. Everything else is fair game, and you could be liable for that. So again, that doesn't solve all the problems, I think it helps the bill, but it doesn't solve all the problems. I don't think you want to codify the case law, my suggestion for the amendment on line 20, actually 21, whether the premises or approaches are located in a high crime area, instead of saying may be considered, I would say shall not be considered. Strike may, and insert shall not, by the trial or fact, to make that clear. Senator Walker, to your point on line 32, and some others who commented, a portion, some percentage, you're fault. Again, I think that opens the door, say, okay, we're going to give them 1%, 2%, 5%, whatever it is, and then stick the people who've got the big pocketbook with the, with the balance of the liability here. I would suggest the best I can come up with is a portion, a reasonable percentage of fault, a reasonable percentage of fault, on line 33. I would also suggest that you add, I would think, and I'd defer to legislative counsel on this, but under after line 24, add a C to read something to the effect, an owner, occupier of land, and its employees, directors, and security contractors, impudent contractors, shall not be liable to a plaintiff or injuries incurred. By such plaintiff, which do not occur, own the property owner's property, limited to their property. I mean, are you going to make business owners responsible for policing the entire neighborhood? How far does that go? One block, two blocks? I don't know. And here's the thing, you pass this, business owners have no more guvets they've got right now. They don't know what to do. If they hire security companies, or they go say, well, you didn't hire enough. If they're in a hot crime area, does that mean what if a high security companies, is that enough or no? Do I put in some lights? Is that enough or no? And here's the thing about the hot crime area that I want to mention too. It says you can consider that, however, the mere fact that the premises of the situate of a hot crime area is not only so sufficient to establish a duty. Well, all they got to do is say, okay, number one in a hot crime area, and then number two, they've got to find one more thing. One more thing, either the lighting wasn't good enough, or you didn't have enough guards, or you didn't patrol right or whatever. It takes that much more to find liability. They're not giving business owners anything in this bill, not one thing. Those are the amendments I would suggest to you, but I would strongly urge you to hold this bill, let this subject be studied much more in depth over the summer and fall, and we can come back next year and do something that really moves the needle in a proper way, and that is fair to all the Georgians. Ladies and gentlemen, don't allow yourself, if this bill passes, don't allow yourself to be food that you go out and tell you constituents that you did something about premises liability with this bill. They're going to tell you you didn't, and you have it. I'll tell you that. Business will know you have it. Your constituents will know you haven't addressed the problem. I think it's very telling who all is against the bill, who's for the bill, and all we're asking for is a bill that moves the needle in a proper way, bills language that we offered during the negotiations, time and time again, and this bill contains none of it. That's the bottom line. Mr. Chairman, with that I'll yield for questions. Then your group support the House bill as it passed. Mr. Chairman, we agreed just to step down, and the House bill, well there are two bills. One bill passed out of committee, then there was a rule sub. We were, we were, we were separately opposed to the bill in committee, which I testified against. What about this bill when it passed the House? The bill where it passed the House bill. The House bill? Yes, 13.7.1. Not the sub, but what actually passed the House? We just stood down. We didn't take a position on the bill. What has changed now where you're now against the bill? It's because this sub is different from the House bill. What parts of the sub that has been added that makes you now oppose the bill? Well, the, for one, the apportionment language. We had, we had apportionment language. It was offered. It was rejected. I'm not talking about language you've offered. You were for, this was not in the House bill. Here's my question. In the House, you had, you said you stood down, so I'll take that as no position on the bill. Now you're, hold on, let me ask my question. You're opposing it. Ask you what parts of the new bill. Now there's a sub. What's in this bill that makes you now oppose it? So you don't let the apportionment part. What else? Every time I've just laid out for the last 15 minutes, we don't like. But you agree with me that the parts of the bill you now don't like are in the bill that you didn't have opposites to before. We, Mr. Chairman, we would never craze about the bill that came out of the House ever. That's why we didn't support any questions. Well, have I hold on? Let me, let me, no, let me ask my question. You think I answered my questions. You say you weren't crazy about the bill, you see you didn't support it. So I'm gonna go back. Did you support the House bill? Did your group support the House bill? No. House bill. So you did not support the bill that passed the House. No. Okay. And then to go, you said you stood down, so now you were opposed to it. No, no, you asked me if we supported it. I said, no. You said you all stood down. Okay. That's fair. So the other question then is there. Mr. Chair, but can I finish just one thing I think support I think people will understand. The purpose of standing down was to allow, allow the bill to move so that it would be a bill still alive that we could continue to work on to try and prove it to a point where we could support it. We had every intention of trying to come to some place where we could support it. We never got there. Okay. Is there a version of premises liability of this that has existed over the last year that your group does support the Senate bill? What's that bill? You mean the bill's been introduced? Yes. No. Well, we know I take it back. We supported 186 Senate bill 186. There was a sub to 186. I believe I have the number. And what is the status of that bill? That bill is in rules. Okay. So the bill got it, which, which committed that bill passed? Passed out of insurance. Okay. And so that's the bill that your group does support. Yes, sir. But I will say I will say this. We were open to some changes in 186 and the sub. Again, to try to come to a reasonable, I don't want this committee to think we've been unreasonable in this process. We have tried and tried to come to a middle ground on this. And we don't see this as any kind of middle ground. Come more questions. I'll turn it over to one asked questions. You mentioned several proposed amendments, but you then said, and great if I'm wrong, if we still adopt all these amendments, would you still be against the bill? Yes, sir. This bill. Yes, sir. So if we took every amendment you just proposed, you still be against.\n\nYes sir. Okay. I don't think I don't think it's still get to the point where it does any any real good I'm trying to perfect a very imperfect bill But still in the final analysis does not Not move the needle into business. I know for your group and our pin done move it all if it may move it backwards Because you're codifying bad law you're codifying bad law. That's our strong opinion. All right Senator Goods. Thank you before I Ask the witness for question. I'd like to ask chairman a question if you don't mind sure I don't know how many more people were gonna have time to hear from tonight, but could you tell us Who you work with on this bill so we know which parties have been involved in this? I did I have not I have not had a single I don't think it makes you're correct. I don't think I've had a single meeting about this bill period Okay, this is a bill earlier. I thought you said you had Coordinated some input no there I mean, I know that leadership and both chambers have been negotiating with the parties involved And I so I'm only privy what I was told by those groups have been the go shit. So there's been no Active input in creating the draft that we see before not for me. Okay. Could I ask you a question? Just on section two under the apportionment portion on line 32. Did you recommend and add on that or What was your to change some to a reasonable person your fault? Thank you Your questions for mr. Edge senator candy. Thank you, mr. Chairman Mr. Edge I'd ask the question earlier and I wonder if you could help The language that's seen on what do you have a copy of the bill? Yeah That begins after the comma online 33 that says After it gives the text that presumably provide some protection for Landowners which I agree with you and especially as you as you have explained it I don't think it does either but it does only in the event Provided that all the requirements of this code section or otherwise satisfied and so this code section is 51-12-33 Which is the apportionment statue The what effect does that Claws after the comma have Fun what is being proposed when you read it in context with the apportionment statute in general I'm not sure I don't know either and I don't know that we can determine any value to this good or bad for me If without someone who can say when you read this together This is what this means part of the what's confusing a little bit. It's proposed as a paragraph online 30 as Perendee period one close per in And the apportionment statute has an abcd But it's a open per in small d close friend open per in one close friend I don't even know where this would be inserted in 51-12-33 and senator candy I'll build a little further on that I Been been doing this for a while practice law for 32 years and been involved here to capital for a number of years Maybe I may be there's language like this somewhere else. I don't this is not common language I don't think to put in a bill provided all requirements or otherwise satisfied. That's not something you commonly see. I'll say that Me either Any other questions for mr. Edge All right, thank you. Thank you, mr. Chairman. Thank you. One other speaker Dan Snipes Georgia trial loads association You are the last speaker so close us out Thank you, mr. Chairman Um by way of background when we try to Address some of the things that have been brought up um GTA was asked by speaker burns to sit down and engage on this issue So this is not a bill we brought because it's something that we that we felt like we wanted to address We sat down and engaged because Speaker Burns asked us to engage and then since the bill passed the house Governor's also asked us to engage so we have been engaged in this process and as mr. Edge pointed out We had had a lot of negotiations and we have not been able to reach a compromise Um, but because I gave a commitment to speak of burns that I was going to try to continue to work on this I have continued to work on it and we have continued to make proposals. We just not be able to find common ground By way of background, I think it's just very important while the legislature calls this a premises liability case premises liability is a broad area of cases where The people who have control over property can be liable to persons who are in general those properties Typically a lot of those cases come in the form of slip and falls or things that happen where somebody would the condition of the property causes an injury and that's a lot of what 51 3131 3132 and 51333 address is the duty of care this owed to various groups of people When the condition of the property causes an injury and in the last 15 years there has been a rising cases of negligent security And that is a part of premises liability that's very different than I think what existed for years So I think when everybody in this you know room that went to law school went to law school That's kind of the nature of premises liability mostly slip and falls This is something that has arisen Mostly in the last 15 years and right now it is exclusively case law and but because it's case law There's a lot of things in Georgia that we rely on case law for in fact the standard that a landowner has for slip and fall case is of Robinson B. Crowger Supreme Court case has been the law for a long time and businesses understand the law They know how to file for most of the summary judgment the very successful in those cases You know in Georgia the standard for when a product is considered defective is based on a Georgia spring court case There's a test set out a risk utility test that sets it out So there's a lot of places in our law Will we rely on case law to give us guidance In the area of negligent security the law requires two things One There has to be a foreseeable risk of harm to a guest on the property That's part one it has to be foreseeable that somebody on your property could be hurt by a third party And only when it's foreseeable Then there is a duty to protect against that to take steps to protect against that risk of harm But it's a two-part process and mr. Edge kind of conflated something there. That's not that's not right You have to have both of those, okay? And so in going through this statute and in trying to address some things The first thing this statute attempts to address is to say they're a group of persons They can't bring these cases under any circumstance That's the first thing it attempts to do if you're on the property commit a felony For whatever reason if you go in there to buy a pack of gum but you intend to rob somebody in the parking lot You can't you you can't bring a case if you go in there to If you're shot lifting and you're doing something and you get hurt by a third party criminal act you can't bring a case The reason and then it was that was the house version The senate version was expanded slightly to make sure if you're a trespass for a lord or you can't bring a claim To answer to your Kennedy's question the reason though it was kept to not all crime is Specifically the instance of if there's a young lady who's drinking under agent of bar That does not mean that because the bar has knowledge and they have to have knowledge That their customs would be of sexually assaulted and they take no steps to prevent that type of sexual knowledge when they know about it Just the mere fact she's drinking under age would not prohibit her from bringing the kind so that's the reason why that was crafted in that way um, but so there's a class of people who can't bring it and then on the foreseeability part of it Okay, right now in George Law You look at the brutality of circumstances of whether or not it's reasonably foreseeable and what this is saying is that merely being a high crime area alone Is not enough and it is a change from where the law is currently because right now you look at all factors And there could be a circumstance where if that crime was enough in the area and bad enough in the area That could be enough to create this duty of care that wouldn't exist otherwise For third party criminal acts so this says that just that alone So that does move the needle some is it as much as it could possibly be moved It's definitely not this it moves it some and then the uh the last part of this Is that it requires that a jury apportion some degree of fault to the third party and in the CVS case particularly Because of some parts of that case none was a portion, but this would address that And it would say some has to be now the difference in I you know And that's a question of fact for the jury But that's also where lawyers have an obligation to represent both sides of the case and point out In the cases though where large amounts of fault or a portion to the occupier of land It's because the occupier of land had extreme amounts of knowledge of a risk of harm to their guest And then they didn't do anything at all when they had that knowledge and they didn't take any steps to protect their guest And that's the kind of situation where juries to people that you know that vote like I do and vote for y'all and our eligible Stormonturus that's where they say in light of the facts of these cases The harm Is attributable to the party that had knowledge this was happening to their guest and chose not to do anything about it And while the while you look at the fact these things happen sometimes when you sit on the study it George are making decisions based on the evidence before Um to go to center Kennedy's question I think the comma provided that all requirements to this code section otherwise satisfied means that the defendant would still have to provide the the notice Required under the code section. They just couldn't pop up at trial and say all right You've got a portion fault to the third party criminal. They still have to provide the notice requirements Because that's that's what it is. I think that's what it's trying to clarify there And that's that's my best answer to you all that It's very important though that and to go to some of the specific things that were mentioned Online 21 where I think um Mr. Edge said it should reach out on it as opposed to me Right now you've got a circumstance so where it's totality of the circumstances and being in high crime area Long could be enough But when you're looking at a situation like this, okay? And let's talk about a situation where one business is um in a shop and center and their next door neighbors and I'm here and we share a common wall But we went from somebody and things happened in the parking lot and things happened next door to me I've got an obligation to be aware of what's happening next door to me I have to have knowledge of it But if I know that my neighbors having a crime problem and I don't do anything That's not reasonable behavior if I know that crimes occurring in the parking lot that may not be my property That's not reasonable though if my customers are using that property to access my store And when you're in you know when you're when you're in a commercial space You may just be written unit A and unit B next to you and the owner maintains controlled property But the parking lot you may pay a fee to have it cleaned But it's not your property And when you start trying to limit to do just that property in a urban area particularly You run into a lot of things where parking lots are owned by different people People businesses share common walls and their next each other And it should be a you have to consider The things that go on around you because if you don't then you're creating incentive for people not to try to know what's going on around them And that's the reason why does this go as far as things could but that part represents a fair compromise On the example of trying to include subcontractors in security companies security companies take on a duty to do something Okay, therefore they're they're they're they're assuming a duty that they do for pay And this statute protects the land on an occupied land the less or and the the person is running the business But when they hire a third party to do a job this statute should not provide a protection for somebody's hired to do a job And I mean, and I'm just not aware of where any employees have ever been sued for something like this It's the businesses that are inviting the people onto the land the employees aren't inviting anybody onto their land They're there, you know selling drinks or whatever they are Um On line 32 was that on line 32 or also Some encapsulates the same thing as reasonable is requiring a jury to put some degree of fall on the third party criminal act I respect mr. Edge immensely. I think he's done a great job for his clients for a long period of time It's done a great job forming this What this represents though is an attempt to move the needle some and it does move the needle some And it does not make it go in any way but towards the business community and it's trying to help some and it tries to help create a Standard by which lawyers who are good lawyers can then try to limit evidence and try to move the needle further You have questions senator kowzer Thank mr. Chairman Mr. Knott appreciate your efforts on this. I just want to make sure I understand On lines 13 and 15 These grand exceptions that are now being made to this bill Only apply if the plaintiff the person that's hurt that suing the business Was a trespasser or is a felon himself Or there to commit a theft crime um, but that is saying they cannot bring a cake they cannot bring a case at all Well, no kidding They're the criminal they're the problem that's hurting the innocent people here I don't I don't follow this Where the plaintiff came upon the owners are off-price premises without express or implied invitation Well businesses expressly invite or and plodly invite everybody they won't customers so you can't I don't get I mean these are such tiny exceptions. It would require Some complete trespasser at a public place that's open for public or else a felon That is now saying y'all owe me money because I got hurt committing my felony. This is absurd. Those aren't even exceptions Or are they I mean I'm I you're are talking about the plaintiff there's the hurt person Press people hid it so types of claims right now Are we seeing cases where that is that why they're the community's community's crime for help please Make these criminals that get hurt while they're committing the crime stop suing us I think that has been some allegations that some of the parties that have engaged in some of these in some of the cases Worry engaged in various types of criminal activity which this is trying to address Um, it also gets into beyond that lawyers and people who are hanging around and not there for a business purpose Okay, okay second question So what you have pointed out to us is we don't have a statute Other than these general premises liability statues. We don't have one directly Four cases where somebody gets hurt by criminal activity That's all basically common law the judicial hellhole came up with that law and we have that's why we're trying to pass a bill To rein this in some how I mean right? Don't we agree that that's the body of law was not some stature We never have one. This is law that courts created Establishing liability against businesses. I first is discreet the premise of judicial hellhole and where that comes from But beyond that there's not a statute that addresses that currently the CVSV Carmichael case Spring court decided this past summer right now is the controlling law as to Landowner occupiers land liability for harm calls by third-barry criminal acts Right court and common law and distrust to move the needle somewhat back towards the business community Is it senator harbin? Senator harbin I think one of the things that we need to realize is that if Georgia is to remain number one in business There will be a change one way or the other when I talked to major insurance companies that are looking at Georgia as a A bad place to do business. They have other states to do business if we do not take Some action to ensure them that we are making changes I think we're going to continue to see the markets dry up excess liability other things and our businesses cannot continue to do business If they can't get that and we are seeing that now with limits and what's going on I'm listening to the attorneys go back and forth on both sides and y'all need the one make the decision Well who makes the decision is my understanding is the jury that's there and they listen to the two sides come at each other and they make the decision and many times they are limited in their knowledge of the law But what I see is this is that this doesn't move the needle a whole lot And what I think is this is for us not to do something We are negligent in our duties to the business owners and to the citizens of Georgia By not doing something and realizing that if it's not done Businesses insurance businesses specifically will go somewhere else and that is a concern that I have when I see this Just some of the little bitty things that are here are not sufficient to cause companies to say I want to come to Georgia I know that Florida has had major tort reform in their areas that have Opened that door, but they got other problems in the property areas I just see this is that as I hear both sides going on right here And I and I realize that it juries ultimately make decisions am I correct on that Most of the time they're listening to both of you and they're making decisions There's just not clarity and this is not doesn't seem to be moving that needle Um really a whole lot from that standpoint I I guess to address the point you're trying to make I think when you look at like what you have in the law that has developed Since the Supreme Court case and slip and falls in Robinson v. Croger and there's a well-established body of law there and Quite frankly is pretty favorable for defendants in those cases and I think by taking the CVS case and then trying to move the needle Some it creates a circumstance where you have a Not established body of law, but we do have a much more established body of law And I think good lawyers who defend these cases are going to start having a way to I think a craft better defenses using the facts of the case But then in some of the facts where they're just a regis bad conduct where you know you have a problem And you choose not to do anything about it There's still going to be liability for landowners for third-party criminal acts as there should be Okay I'm lobbying my members to stick around after this we have more bills I'm working on that trying to keep people here. Everybody's going to leave when this is done We will be really quick with the rest of the agenda. I know this is important everybody has a right to be heard on this There are several of the measures after this. I'll keep lobbying out of please stay for like 10 more minutes when this is done Senator Dullesall Thank mr. Stifes. I appreciate you laying this out for the people in the room Who are not a lawyer? Did you pay the first tom too? I still owe Gucci. He has so much money. He's long. Yeah, he's limited. Gucci's actually limited. All right mr. Stifes I'm curious a couple different things one Do you in your mind can you conceive of a case? Where there is a third-party negligent claim due to a violent crime that is inflicted on a person where The landowner Not the person who committed the crime is 99.9 percent liable um He well, I guess I can and I'll let me try to go through if um, I'm allowing uh parties to um engage in dog fighting on my property and um their dogs and dogs are routinely getting out and attacking somebody and a child is Malled by dogs that I'm allowing the people I have Can you give me an example where the lander is not committing a crime because dog fighting is illegal I'm sure okay, so okay, that's the first one part of my head um so It's got to be a case and that's what I'm thinking. I'm thinking it loud It's got to be a case where the landowner has an extreme degree of knowledge that is incredibly egregious and it has a very high risk of harm to it and that the person is allowing it to go on So all right, I'll think the example would be that a hotel owner who is Turning a very very blind eye to sex trafficking and he knows that there's sex driving and going on in his hotel And he's not committing a crime, but he knows it's going on and then a young lady is brutally raped Because he refuses to do anything about it even though he's not going on I can see where juror get mad enough in that case that it should be 99.9 percent of the fault on the hotel owner Particularly when he's renting a room by the hour. Okay, so 0.1 percent to the rapist. Yes, the person who's in the room By himself inflicting that crime on the female and 99.9 percent to the landowner. Yeah, I'll go with that. I'll stick them out Okay Do you would you be favorable to an amendment to this bill that allows the trial court to Adjust the percentages in the in the in the instance that the jury work would to come to something that you and I could both agree was A percentage that was punitive to the landowner not reasonable. I think a judge already has the ability To do a lot of different things with verdicts post judgment I think they can find a they can enter a judgment notwithstanding the verdict They can demand a retrial or they could there's a lot of things they could do Post judgment where a trial judge already has the power to do the things you're talking about Would you be open to codifying that in this law The refl- that specifically addresses the apportionment portion of these cases I think the appropriate thing would to do would be to look at the statutes that already allow a judge to do that And see if they need to be expanded in some way. Okay Which leads me to my next question Given the fact that we're here on day 38 Given the fact that we had a bill on the floor today that where the governor has Basically said let's take a year and look at kind of the tort environment in Georgia in general And I don't know is your Organization taking a position on the governor's bill is it relates to that? We Well quite frankly in talking with the governor we appreciate the fact he's gonna look at it and we hope to have a seat at the table Okay, and I would hope that you would as well With that in mind you think that the wise thing to do would be to set this aside For the time being allow that work to continue allow y'all to have a seat at the table And revisit this after that data has come in and perhaps after there's been more time to discuss it between you and mr Edge and other inter-supporties I'm not wise enough to make that decision called speaker Burns and the lieutenant governor both asked me to engage on this So that's the reason I'm engaging and they're wiser than I am thank you The good answer he is a lawyer One thing I would like to tell the committee to address. I think the concern that center dollars on center kidney Made I think it would be appropriate to amend lines 11 lines 20 anlines 30 to say coach section 51 31 51 32 or 51 33 I think that would be appropriate. Haven't heard the questions of my let's see if we get to that point leader Gucci Yeah, and I refused to put money in this jar, so I'm not gonna say To save the law it was late anyway. Come on. Um, I just want to ask a simple question How do you think in your professional opinion is a lawyer That we have gotten where we are today in Georgia where the number one Take to do business, but obviously no one uses our legal Reve our tort systems as part of that criteria to determine Our number one status, but we are on the judicial hellhole list is number one being the worst How do you think we got to the top of that list? Can you share your your thoughts on how a state would get to that point? Well, the judicial hellhole list is is is from an organization the American tour for Association and if you're a hammer the whole world's a nail, okay? And what they're addressing is the fact that there are some very good lawyers in Georgia And there have been some cases involved some very egregious facts that have led to verdicts that are you know very large But they're verdicts driven by corporate misconduct and horrific injuries And that's one thing and then the second thing I think that the American tour form looks at is they look at you know When they have tried to the US Chamber of Commerce and other organizations have tried to push legislation that has been unsuccessful It's a way of them voicing their their just pleasure and the after judicial hellhole report It's nothing more than a propaganda piece to try to incentivize Lawmakers to pass laws that are hurting injured persons in favor of big business and that's what that is So if it's propaganda, why did they choose Georgia as number one? Listen y'all this is not part of the bill young all night I wanted to get to I wanted to look can we stick a question about the double trial? I will because it's late but versus no I wanted to also actually what environment did you have in drafting this bill and the input We sat down with Whitbridge at and Whitbridge at though came up with the structure of the bill and He's the one that came up with the bit with the bill that went to committee and the bill that went to the house and then Subsequently we have been working with the lieutenant governor's office on the bill But I did not the I did not draft the initial house versions and You know have been working with all the lieutenant governor's office on discussing this substitute language Thank you All right Questions on the bill center sets up into that up about the bill I know All right about the bill I just wanted mr. Schneider's opinion on two quick things I mean whereas on the one hand it's it's persuasive that this idea that people are You shouldn't be accountable for folks off their property. I think about things like sports events You've got a if I use an app and I'm gonna go to us to a game You know they had the app shows you parking that's around a big area Maybe a mile or two miles across that you're parking and got the $40 parking here in the $20 parking there um I mean from the standpoint of What is the what is the state of the existing law if I if I'm going to a big event that there's a draw to whether it's your concert whether it's sporting event And I'm parking on one of the outer lying parking areas and I'm coming in Um is the sports does the sports team have some liability for that? Well, I think it wouldn't I think it would deal on two different things One is if the sports team is the one designating the area to park in they would But if a private citizen or a private business has their own lot that they're doing something separate from the sports team The only person responsible that would be this the business that's operating parking that is Somewhere near the of being you but as long as it's not affiliated with the sports teams the sports team wouldn't It would be the person that is inviting people onto his property to park and then go to wherever yeah I mean, I just asked the question to me it the the the facts in the six flags case tend to kind of kind of make your ears tingle a little bit But I mean when you think about this is the is the circumstance of having liability for things happening off your campus is it happen a lot or is it pretty at rare that it happens? It is extremely rare the six-fascase It was very unique because that that incident started there and then went somewhere else But the the activity that occurs away from your property is what puts you on\n\nof a risk of harm to your guest. But the risk of harm to your guest has to be something that originates on your property or on the approaches to your property. I just ask questions, Mr. Chairman. I'm not, these aren't leading questions. I mean, because we're trying to weigh this out as members of the committee and kind of balance this. And I just, you know, you hear these cases. And we're trying to assess the significance in which if how often are folks, property owners, a son responsibility, and pay settlements for things that happen off their property. If it's a relatively narrow set of circumstances, is it pretty, is it common? Is it not, we just wanted some context for that. Extremely rare. And this is a big, this is a public safety concern. The cases arise where there's, you know, where there's public safety issues. Thanks. Any, before we do that, any other questions from the committee? All right. That's everyone's time to speak. Let's see if the committee wants to do. What's the pleasure of the committee, Senator Candy? Mr. Chairman, appreciate your patience with this bill that's got us all perplexed on an issue we dealt with for a long time. I would make a motion that we table this. We have a motion to table the bill. Is there a second? Second from Leader Gooch. All right, so this point will move to, let's just move to a vote on it. All those in favor of table in the bill, raise your hand, leave your hand up so we can count. It is seven. All those opposed, please raise your hand and leave them up. Five, six, seven. It is eight, the motion fails. Any other motions from the committee? Is that Leader Gooch? I'd make a motion, do not pass. House bill 1371, LC-442839S. Yeah, I'm gonna try to test my problem in Terry's skills, aren't you? Motion do not pass some Leader Gooch a second from Senator Candy. All those in favor of the motion do not pass, we'll raise your hand. That's sense of trend seven, all those opposed. Here's to be eight motion fails. Any other motions? The no votes on the motion do not pass. Do not pass, raise your hand again. All right, let's, yeah, so let's make sure we're all clear. Senator Gooch had a motion that was second. It would be a motion recommendation do not pass. All in favor of the motion from Leader Gooch, please raise your hand. One, two. All right, seven, so all those opposed will now vote to the motion. Eight, all right, motion fails. Do we have any other motions from the committee? Do we have a motion do pass from the committee? Motion do pass from Senator Cardin Summers. Let's see if there's a second. Is there a second? Second from Senator Jones. So this will be discussion. So Senator Bearden. Get light. Maybe it was a suggestion to amendment. Discussing as long as 11, 20 and 30, add in. Now would be the time for amendments. We have a motion do pass in seconds. We are in the place we can do amendments. What is your amendment? On line 11, let's see if we can do, who they just have to do this one line that time. On line 11, after, we're not be lobby under code section 51-3-1 insert comma 51-3-2 and 51-3-3. And 51-3-3. Would it become a war comma or comma or? Okay. You have the same thing on line 20 and line 30. Okay. So everybody understand before we ask for a second or a second to propose to amendment? Is there a second for the proposed amendment? Second from Senator Sessler. All those in favor of the proposed amendment will raise their hand. Maybe this will all be in the same page. Is unanimous? All right, the amendment is on. Any other amendments from the committee? All right, we do have Senator Sessler. Okay, this is for amendments. Is it leader Gooch? Okay. Senator's all. I've got a couple I'll try here, Mr. Chairman, if it's okay. Okay. Given what we just did, I would move that we strike lines 13 and 14. Oh, this is your mic. Second. All right, so you would be striking, I'm sorry, I was distracted, striking what lines? Like 13 and 14, which is a where the plaintiff came upon the owner occupiers premises or approaches without express or implied invitation. So would you then be renumbering the two on 15 to one? I would. I don't know from draft. We don't even need number one or there. We'll strike the two. Yeah, and you'll also strike the semi-colon from one 12th and the corresponding amendments, right, they go with that. Okay, is there a second for the proposed amendment? Second from leader Gooch. Can you say your name anymore? Any discussion? Is this discussion or other amendments? I have an additional amendment. There's other lights on for the committee, I think. That's one's leader Gooch and one is. Do you have, is it discussion on this proposed amendment or something else? Okay. So the amendment would strike lines 13 and 14. Is it discussed? Yeah, all right, Senator Setsler. I just have a question for the author of that amendment. What's the thinking behind that? What's the, I mean. Essentially, in my opinion, last 13 and 14 defined an invitee, when we just added to amend three, two, and three, three from Title 51, from Code Section 51 there that we are also including invitee, sorry, licenses and trespassers and really what were then codifying, which again, was what makes this bill frankly really goofy, is we're saying that an owner land shall not be liable to a plaintiff for, incurred, sorry, for injuries occurred by the plaintiff, arising from third party criminal activity where the plaintiff came upon the owner of occupiers, premises or approaches for the purpose of communing to crime, punishable, and then we get into where we're at. So, which I think is frankly why this whole bill is, should be set aside for the moment, because we're essentially, as Senator Couser laid out, we're creating a statute where a land owner is not liable to a plaintiff, a person suing them. I just, when the plaintiff came on the property, kind of, I just asked the question, I mean, there's some effort to balance these things, I don't know that that works to the, there's the benefit of the landowner, I think this is a circumstance where the landowner has protections and by removing 13 and 14, you're removing protections. Can you define what you think the protection is? I mean, if you have someone that's trespassing on the side, there's not express or implied invitation, any trespassing, any similar such activities, you know, you're slipping at night, you know, the place is closed, it's after hours, you're prowling around. Those circumstances, I'm not the best equipped to address those, but it just seems to be that you're eliminating an immunity that exists that would be a benefit. In owner or landowner, sorry, just called an owner, an owner shall not be liable to a plaintiff, where the plaintiff came upon the landowner's land with permission. We are now including sections two and three, which includes, sorry, it is late, which includes licensees, which are participating in, call it, approved behavior, but maybe they were not invited to do so, and I referenced my past life, where we would have buses that would meet in a parking lot, right, and to leave. So I think that you're innately defining invitee here, while we just made an amendment to include licensees. If the person that's owned the property is not an invitee, they're not going to be a customer, they were just sort of maybe in another part of the parking lot that's not really relevant to the business, or they're just, or some proximity, and they get harmed by somebody else. They weren't an invitee customer to the business, then by removing this, the immunity that the landowner would have, if I had that discussion, is removed. I mean, I think I don't know that you're, it's helpful. All right, let's, it was seconded up. What's the second? I'll withdraw if that's where the contention is. I'll move on in my next amendment. Okay, let's move on to your next one. I move that we amend line 32 by striking the word sum, and inserting in its place at least 50. I'm sorry, I'm going to strike some percentage and replace it with 50%. So they shall apportion 50%. At least 50%. Let's say that. I think that's, it was just pointed out, the plaintiff then cannot be found more than 50% at fault. That would be the implication of that, but that may be your intent, but. All right, it was seconded by Senator Calzard. The way that would read then is that, let's just make sure we get this right. For injuries, arise with a third party activity on the code section, try a fact in making a portion of damages on the code section, shall apportion at least 50% to fall to the third party that committed the criminal activity. In every case, okay. All right, there's a second for the proposed amendment from Senator Calzard. All those in favor of the amendment, please raise your hand. Seven, all those opposed. Nobody's thinking outside the box. Eight, amendment fails. Any other amendments? Senator Delos all from move on to others. No, it's okay. All right. Leader Goose, she still have amendments. Appreciate you. Someone on this side does have an amendment. Who is it? Now you knew the committee. You wave, all right. Whatever's left of the bill, where will we all go back to emotion, do pass? I'm sorry. We have. All right, let me recognize you, sir, by your mic, Mike 15. Sure. All right. Is it online 32 again, strike some to reasonable? I think it's the same thing, but does that help? So you would replace some with reasonable? Proportion. Is there a reasonable? Would it be Mr. Walker, shall proportion a reasonable? Would that be the way of putting it? Okay. Is there a second to the proposed amendment? I'll second it. Second from Senator Calzard. All those in favor of the amendment, proposed amendment, please raise your hand. Thanks. 10. Do you get 10? 11. Okay. Sorry, what about the package? Yeah, leave them high. Don't do the shaffer hand raise. Sorry, it's late, I'm gonna get honest. 11, 11, 11. 11? Yes. All opposed? 11, 12. I'm gonna count. Four. The amendment carries. I had a problem in Erichert. This is a hinge point of this bill. I don't think anyone wants unreasonable things to happen. Nobody in this panel wants unreasonable things to come out of this. What I wanna understand though is, I mean, this is an important hinge point of this entire bill. What is some, I mean, I understand some could mean a de minimis amount that's almost nothing. What instructions is the jury gonna get with some is reasonable something that's used in this context and civil proceedings. I just heard. I mean, it's the amendment carried by here. Yeah. Well, before I make a motion to reconsider, I just want the committee to understand. This is everyone hold on, hold on. You guys, listen, hold on, hold on. Okay. Hold on. I know it's late. I know, hold on, hold on. I know it's late. I know everybody's had a long day, but let's try to remember to the core. This is still serious stuff. We make jokes because we have a stressful job to do and it's our way of dealing with that sometimes, but ask members of the audience, please refrain from any outburst whatsoever. Let us try to finish doing this job and if you can't refrain, we ask that you please leave. Senator Seppel. As a member of the business community, 11 o'clock is, I'm still in my stride. This is not late. We're doing serious work. I agree. I don't know what other folks do for 11, but when you're in business, you have no boundaries on your time. That's why we care about it. No, just why you'll all stick around for the rest of these bills after this. I just, what I understand is no one here wants something unreasonable done. What I don't know is, is what is the, is, is, is, is reasonable a word in these kinds of proceedings that's a word that's going to be clear to give jury's instructions or there are better words for that? I don't have a context for this. It's an important part of the bill. I just wanted to ask, is there, is there, is there awareness on our panel of what, what we've done? So the, the proper thing to do to be offered, another amendment or you can move for reconsideration of the vote if you want to look at that again at this time. All right. Is there, is there anybody here, here that, I mean, can we speak to a witness that's spoken to this that can clarify to anybody I want to discuss that? I don't want to be, I don't, I don't mean the side of, as, of doing reasonable things, but I want to understand what we're doing. Senator Hatches. So, I think the question that I have is, is there any other place in the civil code that requires a jury to a portion, fault to a certain person? And what we just did was we changed it. Now, if a jury thinks that it's reasonable to a portion zero percent to a third party criminal and they have portion zero percent, now that's okay. But what we did is, what, what the language was before was, hey, jury, you have to, a portion fault to a third party criminal. So I know my friend was trying to work with, dole is all, I mean, I think he made it worse. I think it's better if you say you have to a portion fault to the criminal and not just a reasonable amount because I know there are instances where, especially in, negligent hiring sexual assault cases, things of that nature's where a jury may get mad at the owner and put all the percentage on the owner because they may have known some things that, and should have warned people. But I think it should have, I think it was stronger to keep it as some instead of just reasonable. I think, procedurally, the best thing for us to do if you want to change that back is to offer another amendment this time that would go a different direction and amend what we just did versus moving a reconsider and then potentially having an amendment. Is anybody want to offer an amendment to address the line to this issue? Dr. Watson, come get a microphone. Welcome to the party. You're on mic two or three, two? Mic two, I woke up over here. I'm thinking out loud as Senator Setsworth talked me how to do. I agree reasonable may be zero. Some does mean something. 50% may have been too much and I'm thinking out loud. Is there another percentage that would be reasonable to do? He said at least, but before he was at least, your number was 50%. I'm throwing out a number is 30 or 40% is that something that moves the committee? Is that, is, you're not hearing a lot of movement on that? Yeah. Okay. All right. All right. I'll chalk that up to discussion. Thank you. I'm going to offer an amendment to address the amendment we just passed. Senator Pair, you might six. Yes, since roll is just kind of thinking a lot of me, it could say a reasonable percentage comma, which shall be more than zero comma. Okay. Just an idea. Is there a second for the proposed amendment? There's no second for that. Again, thinking out loud. You want to repeat it one more time because Senator Hatchett and you're you. I think you're right, Senator Hatchett, that it runs into, you know, some people could interpret the sum as being stronger in the sense that you could not be at zero, whereas reasonable could be our good either way. So I just said, we could go back. We could keep it at a reasonable percentage comma that shall be more, some portion more than zero. So then you know that has to be more than zero or you could just go back to some. But if people really like this reasonable standard that way, thinking out loud. Are you offering that as proposed amendment or you want to see if somebody wants to? Actually, I'm kind of curious thoughts. I'm not, you know. Everybody has pushed their buttons, so let's just work our way around. Senator Cardin, that can call any Senator Cardin, Senator Summers. Mr. Chair, what's that deal about the dollar now? Anybody that speaks after 1110 has to put a dollar in the bucket about that. Here's the deal. I like to take the bar exam if you don't mind. Yeah. You're halfway there. I'd like to offer an amendment to put it back the way it was. Mr. Chairman, if that's, if that, if that be approved. And I was thinking that we have an amendment to put it back like it was with a second and put it back like it was to look like line 32 of the existing bill. I'm thinking everybody's clear on, on the proposed amendment. It's been seconded. Senator. Does the motion for reconsideration? No, it's another amendment to go back. It would save a second of the reconsideration. It would go back to what it was before. All those in favor of the discussion? If you want. Do you want discussion? Going back to the reason, on the standard, that is prevalent throughout civil practice. That is tort law. That's what the jury's determined. You are only negligent if you did not behave as a reasonable person would have under the same or similar circumstances. That is the jury charge. So in this case, the landowner, that's what they're saying. They didn't take reasonable steps. That is left to the jury to decide. It is also this 50% level is extraordinarily common when a plaintiff is suing and they are found to be 50% or more responsible. They are barred from recovering. That's called contributory negligence or comparative negligence. These are very common standards. What Senator Dole has all proposed on this is the same standard you would use if both parties were at fault in a car wreck. If the plaintiff that seeking recovery is more than 50% at fault or even 50%, they can't recover. I think this is a stretch in any way to say if the criminal wrongdoers at least 50% at fault, then you can't recover against the property owners. I don't think this is some wacky random number. It is very consistent with tort law. He furthered. If you have more amendments, turn your button off. If you want to discuss this minute, please leave your button to Senator Satsang. My question to Senator Councillor was, isn't the standard today without this being codified, isn't the standard or reasonable standard? I'm just an all-shock question. If the instructions are to a jury, establish reasonfulness, there's no duty to say some. We have reasonfulness today that got us here. Reasonfulness doesn't change anything. It just codifies what we're doing now. It's apparently not satisfactory to some. It just leaves an impression of the jury that they got to find at least some amounts. So the service, a reasonable amount, it's left to them to decide. Right, but today, even though it's not codified as such, the standard is still the jury and its discretion decides a reasonable amount of a portion of across them. You decided the percentage that doesn't have to be reasonable. That's the whole argument, the business community, to say that the criminal that kills somebody or rape somebody is only 5%. That is a primafacy, unreasonable, which is why we're a judicial hellhole. They're allowing those type of interpretations of facts, which are absurd. The general public would sit there in scratch or say, he didn't say, how could you possibly not believe the active, wrong-doer criminal is not? Right, so it's possible. Citizen Sutslar sitting on a jury would say, that seems unreasonable. I would be sort of in that kind of the early burly of the jury talking through that. My question though is, the standard today is still do the reasonable thing and it seems like reasonableness is standard we have the day. That if we do nothing or if we codify this is reasonable, there's no change. It seems that some requires they do something. Now I don't know how this plays that in practice. That's why I'm deferring some others. It seems like reasonableness is what we have the day and this is moving the needle some. It's an honest question. I don't know. I can't answer any better. All right. All right, we have the proposed amendment which is to put the bill back like it was. On line 32, it's been seconded. I think everybody understands that all those in favor of the proposed amendment will raise their hand. I hold on. I said seven. Seven. I hold your hands and leave them up. We can see them. Yeah. Seven. All those opposed. Please raise your hand. Correct. Eight. The proposed amendment fails. All right. Any other amendments? Back to the motion. I don't get up, Senator Walker. Especially for that. Go ahead. Floor is yours. Y'all gave me enough time to rethink something. So I'm not comfortable really putting in code. It's high crime area. It's not defined. And I make a motion that we amend it to strike lines 20 through 24. All right. The proposed amendment is to strike lines 2324. Is there a second? Second from Senator Dullesall. Any discussion? All those discussion from Senator Pant. It doesn't that again. We can. The protection. The modicum of protections for the businesses. Provided in the bill. I mean here, otherwise they can say, look, it was in a high crime area. You should have had. And it's. And I calculated it. And for two years, your area was higher than the state average. And so therefore you should have had. Round the clock. This that. Clegalites. And with this, then that would not be enough. Probably true. In my opinion, it's instructing the court and the jury to consider how the. Crime level of the area. And it puts. In their mind that if it is a high crime area, there's a higher burden than on the property owner. And I think all you had to do is say, you know, well, you're one of these light bulbs were out. And you're in a high crime area to that little bit of. Protection that you gain by. And I think that it may be considered, but it can't be the only. Thing, the only issue. I think is basically now instructing the court. You have to consider the crime statistics in the area. All right. More discussion. But again, guess what? I'm an insurance agent. Not. It's not even funny anymore. Senator Walker. There's not an amount of money. Well, there is. But then. The one of your upper-stretcher Mike. Senator Kennedy. Do you have a discussion? Just a question. Try to move it on quickly. Mr. Chairman, if I could ask Mr. Edge, do you have an opinion on what removing lines 20 through 24 would do to the bill? Does it improve it or not? If you want to address it, that's the part that I don't know what the high crime area. To keep in mind, the draft you see does have the additional code sections. 53, 51, 3, 2, and 3 with amendment. If you'll speak into the mic. I got thousands of people watching. They're all text me making fun of me right now. So I know they're all watching. I would support the amendment. Okay. Any further discussion on the proposed amendment? All those in favor of the amendment which was strike lines 23 through 24 will raise their hand and leave it up. 678. Eight. Is there other side opposed? The chair will vote against the amendment. The amendment will fail. Eight, eight. Any other amendments? Leader Gooch. I do not have an amendment, but I would just like to make a comment. We'll go to discussion. There are amendments for the finished with discussion. Let's do this and then we'll go. Okay. It'll be with a motion but go ahead. Okay. All right. Senator Calder. Thank you. I would propose an amendment to insert after an owner or occupier of land on line 11. Put in their agents and employees. All right. Is there a second? Second from Senator Kennedy. You discussed it again? Insert the words and they are agents and employees after an owner or occupier of land. All right. Is there a by a clear on proposed amendment? We will have.\n\nDiscussion. Discussion. Senator Sapsler. I am trying to unpack what the... I'm friendly to the concept. I want to ask the question, what does this do for if you're a security company that is an agent for an owner. You have a duty to do certain things and your duty is laser focused on preventing these things. Are you held for liability even if you demonstraly don't do your job? I don't think that's your intention. I just want to ask that. You want to respond, Mike 12, is that right? Yes, a security company would be an agent and they would then be protected by these piddly little protections that this bill gives, which are essentially non-existent. But they wouldn't be able to be sued by a criminal that gets hurt on their property, that's a trespasser or that somebody that is a fel... trying to do a felony gets hurt there. They wouldn't be able to be sued by them just like the owner wouldn't because they're acting on their behalf, helping them do their job of providing security. Any further discussion on the proposed amendment? All those in favor of their proposed amendment will raise their hand, leave it up. Seven, all opposed, like son, eight, the amendment fails. All right, now we are going to recognize Leader Gute for the last word of discussion. We've sat here for what now, three hours. This isn't going well. There's a lot of work to be done with the rest of the agenda. Plus we have committee meetings coming up in the morning at seven o'clock or seven thirty. We have a lot of bills that have to be worked between now and Thursday of next week. This issue has been discussed for years. This bill is not ready for the floor of the Senate. I would encourage this committee as a group, agree to table this bill. Let the bill go forward. That's the President Pro Tem has that will be on the floor this week. Dillham with the issue that Governor Kimp has supported. It's already passed the House. We'll have the rest of this year to collect the data. We'll get the Governor's office involved. We'll have the Commissioner's office involved. Both sides in the room will be engaged. The trial lawyers will be engaged. The business community will be engaged. We are not going to pass a bill tonight that's going to come close to satisfy. But the party, so I would move the table this bill and ask for the members that voted against table and to see the value in putting this off. And let's get on with our other business. I believe I'm waiting for a ruling. Got the motion. The table, of course, was made earlier in fail. Motion tables out of order. We have motion to pass on the table. It's been seconded. So you're not recognized for the motion. Can I make another motion? Motion to adjourn this meeting. Yes, not in order at this time. Thank you. Any further discussion? Senator Kennedy. Thank you, Mr. Chairman. To the committee, think about how long we have sat here discussing this bill. And we still can't come to a consensus of good language of what it does, who it helps, who it hurts, or how this is going to get unpacked in the setting of a jury. We don't know the origin of the bill. We've had no time to vet it. We've had no time to review it. Chairman, I'm not being critical to you, please understand. I think, in fact, it sounds to me like you've been caught by the time machine yourself. You said you just got this version shortly before the meeting. So you haven't had time to unpack it either. Some combination of interest have been working on this issue for months. I've been both Mr. Edge and my friend Dan, both agree that we're not able to reach a compromise. But we're going to jam in a decision that I'd written in my notes was at 1030, but now it's 1125. We're going to jam in 1125 PM decision after one hearing with no prior review of this document. Think about how long we've sat here discussing this, and we can't come to an understanding of let alone how to perfect it, but exactly what this does. You heard from Mr. Edge say that in essence what we have been offered to do is codified bad case law. That's really what this does. For the purpose of what? A stensibly helping business. But this doesn't do that. The business businesses don't want this. I think the one thing we can all agree on regardless of those in the audience or those that are here on this committee, the idea of any initiative for premises liability was to help business. It wasn't to make more lawsuits or make it easier to sue businesses or make it easier to recover. It was to help the business community. And our esteemed chairman who might respect and the proponents of this bill say it helps business. But businesses say it doesn't. They say no thank you. That ought to be enough to tell you how to vote. If we're here trying to help business and businesses, no thank you. That should tell you exactly how you should vote on this. Further discussion, Senator Satsler. Thank you, Mr. Chairman. I appreciate the words of the majority leader in the program. I would just say this. We are not voting this under the governor's desk today. This is played out the reason that the... I appreciate Mr. Edge's words about they didn't really like it come out of us. They voted it forward to keep it alive. You know necessity becomes a mother of indention. We're voting this into the Senate Rules Committee. I think I have the distinction in this panel of having more bills die in Senate rules than anybody in this panel. I think I can probably get a headcount for you there over the years. Because it's the Senate rules that mean it's on the governor's desk. But I do think what I heard today was this doesn't do much. But it does do something. And it keeps the conversation alive and I'm hopeful there can be some... I think the lieutenant governor and the speaker both committed to action on this. I think moving this forward gives that action an opportunity that would die today if we voted down. I'd say we vote it forward. All right. We are back to the motion and do pass. Back to me, substitute now as amended. All those in favor of the motion, please raise your hand and leave it up. Eight. All opposed. Seven. The motion carries. All right. If you can bear to stick with me, the rest of these bills will not take long. And when we ask Senator Anvatar to come on up. I know a lot of folks are leaving. Please be quiet as you leave so we can finish our work very quickly. Senator Anvatar, and I've filed two different bills. Let's do these really quick and we'll get to that. I think these will be quick. We've worked on a couple different immigration measures that were filed as Senate bills, five, 68 and five, 69, an effort to give as much notice as possible. It's filed not in time to allow the bills to cross over. We have worked together with a lot of interested parties, including people on this panel and also in this room, to try to address both these issues. First bill is House Bill 231, which is not the prosecuting attorney's counsel oversight commission. But it is what was Senate Bill 569 redrafted. What it accomplishes in Section 1, it says, when you have a situation where an individual is up for bail consideration, this is a situation where a judge is considering granting bail to individual charge with a crime, that that judge must now put certain things on the record, as it said on the last 24 and 25. Part of what they must put on the record is consideration for the accused's lawful presence or status as an illegal alien. What we're trying to accomplish is an essence, the potential flight risk of someone that is not in this country legally. This would not be a full bar, which you think there's constitutional issues, to a full bar saying you can't get bail in these situations. It's something that a judge must weigh, must consider directly, and must make findings on. Second, Section 2 attempts to address the issue of what happens when an individual is in custody of a sheriff or a jailer local authorities, and what this section tries to accomplish and hopefully does accomplish is it sets for the standardizes of process that currently we learned in researching this, is the practice in most places, but is not consistent across our state and average jurisdiction and is not in code. I'm just going to call them the sheriff, but that's the jailer or deputy as well, is required to make certain inquiries when someone is arrested as to their status in this country immigration status. And when there's a reasonable basis to believe based on what is known to that sheriff, they then must submit the federal inquiry to see if that person's subjected to a tainary request, then they must honor that tainary request if it's sent back down a whole individual for up to 48 hours so they can be taken into custody. Lastly, you'll see in the back there's ways where an individual that has been determined to possibly here illegally can prove their legal status with certain identification they can then present as well. Our goal with this bill, I think I can all let, isn't very entart, I speak, was to codify a common sense process that again a lot of people are already doing, but to put this in code, but also understand that our state police are not equipped, and don't have the capability to be immigration police. They don't have the ability to go make these decisions whether someone is here legally or not without inquiring from the federal government who's in charge of this, but we have bigger issues as to whether or not the federal government is equipped to do this job and make those determinations, but the same time we do have to respect the process in place, and this bill does not convert our local law enforcement into immigration police. Do you want anything in a rampant heart? I'm going to be brief since we're almost into, it's almost Thursday, not already Thursday. Just, first Mr. Chairman, I want to thank you for your partnership and work on this. I do want to thank Commissioner John Keane, the Georgia Sheriff's Association, members of the Latino community that you and I have spoken to over the last couple of weeks, others that are in the judicial system. So, we've kind of gone through, I think we've gone through multiple drafts to kind of get to a good balance to where we're creating a little bit added checks and balances to when somebody's arrested and going through the process, and eliminating any sort of cracks that may be in the system as it relates to undocumented or legal individuals, not from the United States, it's a kind of a process and go through the system. So, I think this strikes a good balance, a positive balance under the circumstances of a lot of the issues that we've been debating for weeks and a lot of the tragedy here in Georgia and Athens and others that have been debated across the country, but I just want to say thank you again, Mr. Chairman and all those involved for getting us to this point. All right, if people want to speak briefly on this, but before we do that, any questions for me or for Senator Anvatar to his authors? All right, we'll call up individuals to speak. Maisie Lane Gerton and Jessica Stern with Gactel. Thank you all for sticking through all of that. You all probably didn't care about that last bill, but you all stuck through it. Thank you. Much of it's an interesting thing to watch happen. This is, sorry, I am Maisie Lane Gerton, the executive director at the Georgia Association of Criminal Defense Lawyers joined by my friend and colleague, Jessica Stern, who has had a criminal defense practice for a number of years, but after spending some time in the public defender's office here in Fulton County, branched out to begin immigration law. And as you know from this legislation and some others that you've considered, there is quite an overlap in those two areas of the law. We just want to come to say we're really, we understand the import of this legislation. It's not a bill that Gactel would typically be a proponent of or bring to you, but the work that's been done as the chairman was discussing, especially around making sure constitutional protections are in place, things that would prevent equal protection claims from reinvesting. We're really appreciative of the attention that's been given. In addition, we think the language here is going to be helpful to the criminal defense bar because it does bring some continuity of process and equity across the state as everyone, because the language is broadly going to apply to anyone, for instance, petitioning for bond. And that will definitely help us in advising our clients about what to expect in those processes and like I said, equity across the board. If you have any questions for us in particular, we'd certainly stand for those, but otherwise that's all we really need to say to them. Any questions for Miss Gertn? Do you want to be heard, Miss Stern? No, thank you. Thank you all for your help in working on this language at a time as well. Thank you. Next is a bell, Oterra. Thanks for sticking with us to. Sure, no problem. Good evening. So I'm going to ask a morning. Good morning. Yes. So I'm Isabella Oterra. I am the Georgia Policy Director for the SPLC Action Fund. I just wanted to also say thank you to the chairman and to Senator Annapurta, and others who have heard our concerns. There are two other bills before your body, HB301 and HB1105, that are not crafted as carefully as this bill. This bill, this bill, HB231, is both, as Mazeeline mentioned, it will codify a process that is already happening. It is also consistent, and it is more accurate in the way that you are describing and defining some of these terms. Part of the issue with some of the other bills that are before you is that immigration-wise and incredibly technical and complicated, and some of the things that are sort of being thrusted upon law enforcement are not either their job or their jurisdiction. And as we've seen just this week with some of the federal cases that are happening around federal immigration law, we do not want to sort of wait into this problem. I would urge you all to consider this bill. It is not like Mazeeline said, SPLC cannot completely sort of endorse a bill like this, because it does have some restrictions on bail, but it is much better crafted and more thoughtfully considered than some of the other things that we've seen that are a little bit more reactionary, and will put, especially law enforcement in a situation for liability that they should not be responsible for. So I just wanted to say thank you for that, and that I'm happy to answer any questions, but I just want to be brief as well. So thank you. Thank you. Any questions from the committee? Thank you. Last up, James Woodall. You wave. All right. That's everyone it's time to speak on the bill. What's the pleasure of the committee on House Bill 231? Motion to pass by. Can you substitute from Senator Bearden? Is there a second? Oh, from Senator Hatchett. All right, let's sit there second for a second. Second, Senator Parent discussion. To the author? Sure, this bus together is kind of un-o-it's a lot, but I guess I'm the author of this one directly. Okay, line 79 shall inquire. Don't page four. The J.L.R. Deputy shall inquire. Yes. What happens if they don't? Well, there'd be an violation of Georgia law, and the law dictates that they do it. The only other thing that you could do, there would be a, I'm assuming someone currently from wrong away to sue for mandamus, I believe. But I mean, it's in what? Getting a nod from the back. That would be the remedy if someone doesn't follow the law. Because I know in the House Bill of No File, which is for reference, there's a lot of conversation around that. So I just want to make sure that some may say they won't. Right, and they'll be in violation of Georgia law at that point and subjected to civil suit to enforce the law. Senator Setsler. To Senator Beardon's question, and I do we have a clear, do we give clear standing to any citizen of a jurisdiction? If they think their law enforcement's not doing this, is it clear they can bring a mandamus action? That's standing to do so. Do they have to demonstrate? Are they going to use sovereign immunity? Are they going to say you're not harmed? How do they get to the courtroom with a mandamus action and do we not need to clarify that a citizen of jurisdiction has that? It's not a strong accountability measure, but at least it creates a duty. It creates a procedural method to make someone who's not following it. So how would we clarify that here? I would say the answer would be whatever the current law is on mandamus is what we go to by default. And so if you would want to deviate, and I'm not an expert on that, somebody else may win away. And if you want to deviate from that, you would need to spell that out in this code section. I would assume. And one thing, thanks for the text for the help. Someone's pointed out that you could also have a criminal charge for violation of oath of office as well. This is something that could also lead to a charge for violating oath of office. And obviously, if the bill does move forward, there will be a chance to discuss that further if we want to go further with any further discussion. All right, the motion due path. I got second win. Now I'm ready to roll. Motion has been second. All those in favor. The motion due passed by Kamiy. Substu. I'm going to go further. Go ahead. I'd like to call me a formal amendment. It would be as simple when I think and council may help me with it. It would be after 118. It would be, I don't know if I should say any registered voter, any person residing the jurisdiction may bring mandamus action to enforce compliance with this code section or this chapter. I'm trying to figure it out. Can they do that anyway? Is that what you're, I'm reading your lips. They can do that anyway. You want to weigh in the next for tease? Yes, they could do that anyway. The other legal remedy that you mentioned and there may be other creative legal remedies. You could run the risk of by identifying a single remedy that you'd be barring any alternatives to that single remedy, which may not be your intent. That could create a limitation that the only possible remedy would be a mandamus, which may not be successful. What duty to get this great question of council, I don't want to do something here if we don't have to. Is there an issue you don't have to demonstrate harm for mandamus? Is it true? It's been a little while since I've handled mandamus, but yeah, the cause of action is to enforce an official duty. It's an interesting question here. If you had an official who said, I am not going to follow this law as a general proposition, then you'd have a better chance of success in your mandamus. If the duty is triggered with each new person who comes into the jail, so there would be kind of a lag and being able to say, well, you missed John Doe. You didn't affect your duty against John Doe. The informant that said, hey, this is not happening, and another citizen came in and they made the claim. Is there some circumstance that, like in some summary setting, some summary judgment, hey, what evidence would you have, and they could produce evidence, so it doesn't get addressed? How does one really bring this? As with any other civil action, they would make their father petition. There would be a hearing scheduled. There might be a defense as father to mirror something to block. It would be the standard court proceeding that would take some time to evolve. All right. We have a motion to pass by coming to the table. All those in favor, please raise your hand. It is unanimous. And Senator Ambertart, say, am I right, is unanimous? He's sitting in the corner. You're back. You got to also present. I'll let you take the lead on House Bill 1247. Chair, I don't have the current copy. If you want to just bang it out, take two seconds. Well, just a speedy answer, Tom. Give me a hand. This bill deals with pardon's and peroles. I really want you to take it real fast. So basically, whatever this is, HB 1247, I think it's 1145. Basically, we are amending the statute under the partings of peroles. And I do want to thank partings and peroles for the input and guidance in terms of just giving us background on some of the history of what they've been basically dealing with and what this language does. And this, again, we've gone through many iterations of this is basically updating the statute that saying immigration status and citizenship. She'll not be the sole basis for granting an application for partings of peroles. I know that, again, I know this was really important to commission or king. He and I had a situation many years ago. I was in middle school. We had a, I had a friend of mine and then a police officer that were for him that was assassinated back in the early 1990s, the door of a police officer. And his killer is still in a Georgia prison, an undocumented immigrant that going back to and not to relive that at midnight right now. But I think our concern is that immigration status not be a sole dictator and making the decision of whether somebody is paroled. I think, you know, taking consideration all the factors, all the situations that come up with it and all of the chairman kind of go through those real quick, he can spout them off better than me. But I think it's just, you know, adding the sexual layer of protection because we do know for a fact that there are times and we've seen this, you know, documented where violent criminals and desert are being released going back to their home country or there's some that may, you know, approach, approach part of an impure rules without being kind of one of the main, I won't say kind of, you know, reasons to parole someone. Those individuals will go back to, you know, home country of origin and then find their way back here. So we think this is another way or criteria to add some added protections. And I do want to thank again, you know, members of the Latino community, the Sheriff's Association, part of the parole, other leaders around the state for helping this. This, this one has not been, it's one sentence, you know, two lines here, but this one has not been easy. I know there's been debate about this. I think it's some other committees, maybe in public safety. But I think this is a striking once again, another good balance as the part and in parole process is happening in cases or situations are being reviewed. So Mr. Chairman, I'll turn it back to you. All right, any questions for the author, great job on that, anything, any questions for the author? One person is not going to speak on the bill. May I see Lynn Gertan? Do you want to? Okay, yes, ma'am. Come on up, Rita. Yes, ma'am. I didn't see you sitting out there. Are you fine? You've been there this whole time to watch all this. I have. I have been with you all the whole time. Wow. Okay. Thanks for joining us. I'm sure, sorry, I'm a lot of lunch. So I just actually wanted to see the wording. I think it's because I think it changed the last time we spoke. Okay. I'm fine. Okay, I thought so. I'll make sure that I had to do my part. Right, yes, ma'am. Thank you for doing that. Any further discussion? What's the pleasure of the committee? Motion to pass by committee substitute. It's LC560204S. Is there a second? Second from Senator Setsler. All those in favor of the motion, please raise your hand. It is unanimous. All right, very quickly. We'll go to House Bill 881. Come on up. Representative Gallett. Senator, one more after this and these two will be really quick. Yeah, this one should be real quick. So there's two bills here, two great bills. I'm going to start with what originally was Senate Bill 554 that passed Senator Chairman Alvers' committee unanimously by partisan support. And basically what we are doing is creating. We were addressing a situation in ironically representative Gallett, my dear friend and delegation member and I do want to recognize, well, I'm not going to recognize our friend from Paul and County real quick that's been here all night. But originally it gets a couple years ago, representative Gallett tried to address this issue of a demification for firefighters and we had a situation with a Pope County sheriff's deputy who passed away with COVID applied for benefits, was denied benefits. And a lot of it revolving around the whole discussion of, you know, even though the individual's diagnosed with COVID before the pandemic or the state of emergency had come to a conclusion. And whether that was considered an in line of duty death. And so basically carefully crafting with the support of Chairman Alvers, Senator Robertson and also want to recognize Autumn Cole from DOAS basically came up with a criteria to basically allow those during that time to apply for the demification benefit. So, I think as you were diagnosed before the state of emergency ended, which was April 15 of 2022 and that applications that are received to the Department of Administrative Services would have to be filed or sent in after the bill is signed upon law. And before August 1 of 2024, tight window speaking directly to those that were impacted during this situation and timeline, which the Department, I don't, I didn't bring my cheat with my numbers, but we're only talking about a handful of cases that this impacted. This is probably one of the more meaningful pieces of legislation that, you know, I think will pass the General Assembly this year because of the human impact that's having on firefighters and law enforcement.\n\nin our community such as Sergeant Barry Henderson, who passed away a couple of years ago. And so we think this is the right thing to do. And again, you know, just the stars aligned and you know, God kind of threw it on us. We have it up on the original author's bill and proud to have Representative Goet here while he's going to be also presenting his jailer bill. So I'm going to turn it over to him to present the other part of 8-8-1 so we can wrap up. Yeah, get us there. Thank you members. Thanks for being here so late. I do want to recognize Captain Keith Thomas. So a few weeks ago, well actually early in the session he called, say we have a problem in the jails where jailers can't today arrest people inside the jail when the issues arise. I have to call deputy. Representative Ken Vance dropped HB 996 to address the same thing at the pass of his committee. I believe unanimously, but what this does is it gives a certified jailer the power to arrest within the jail or the guard lines. Also it gives the power to arrest people who come to surrender at the jail. Today when we got rid of citizens' rest, we got rid of the ability for jailers to do that. So they have to call a deputy in. Pauling County is a fairly large county in the state and we have four deputies in the jail. That doesn't mean they're all the time in the jail. Four deputies available to the jail. I can't imagine what it's like for a smaller county to call someone off the road to come arrest someone who's turned themselves in or for fight broke out of the jail to arrest those in the jail. So this addresses that. It allows a jailer to arrest within the jail, an issue that arises or someone comes to surrender themselves. I think it's just in Pauling also. Just in the last 12 months, the last 12 months we've had 30 events of things that happen in the jail where this could be addressed with the jailer. Happy to answer any questions. All right, thank you for your work on this. You do have a question from Senator Satslach. Quick, aren't there people who've not gone through post-training, who work in jails and some capacity? So they're not able to do really anything? So they post-certified jailers. Monitor. Right. Only post-certified jailers can arrest. Any other questions from the committee? What's the pleasure of the committee? Motion to pass by committee substitute. This is LC481305S. So you have as well. Yes. Thanks for getting this right. Is there a second? There already was a second. Discussion? Senator Watson. Number two, just clarification. So maybe the author can help me understand this. So the state will be responsible if you died from a public safety officer died from COVID-19 before April 15, 2022. So what we're doing? Yeah. So basically, I'm just going to just straight up read it. So the public safety officer, if he or she was diagnosed with COVID or evidence that indicates the officer had COVID within 14 days of a public safety officer's last day of duty, and the evidence indicates that the officer had COVID or complications from the time of death of the officer, the qualifications of OCGA 45985, regarding eligible recipients will be met. And just noting that April 15, 2022 is kind of like basically the end date. So this is an extending past when the state of emergency was basically declared. This extends it beyond? No, it does not. It cuts it off right there. So we're basically dealing with that population from the beginning to April 15, 2022. Okay. Any further questions? Just to keep it very narrow. I'll be back to the motion to pass by. Come to me. Substitute all those in favor. Please raise your hand. It is unanimous. I'm assuming you're carrying that bill and the Senate. I should ask that. I'm hoping they'll agree over there with this. All right. Last bill. Thank you. Last but not not not, I hope it's very easy though. It's a thick bill, House Bill 508. Working off of LC365881S. This bill is Senate Bill 157 that you've heard a lot of floor speeches. Some of you all have given ask in the House to move on this bill. This is the bill that I carried last year that I've got great support from a lot of folks in the building, including the tenant governor on this, that deals occupational licensing and how criminal records are addressed. Everybody's sitting up here voted for this bill. If you're on the committee then, which some of you all weren't, you voted for it. But you all voted for it on the floor of the Senate. This is the House Committee version from last year. Very briefly, there was one additional thing in full disclosure. Mr. Ashtray, you come up that the House added that was one other bill that was put in committee. And we went back to the House Committee version. Should I give this bill a chance to get passed? Mr. Ashtray. Yes. You tell us really quickly what that was, just in full disclosure for everybody. Thank you, Mr. Chairman. So that bill has passed through House Committee twice, both last year and this year. It is a minor cleanup to our record restriction laws. Many of you voted in 2020 for SB 288, which passed through the General Assembly unanimously, like with any new law. Once we get into the practice of it, you see how it can be made a little bit better. So this is some minor adjustments to that law to see what we have seen in practice to just make it work a little bit better for us. And this bill, as you see, passed unanimously in the House Committee last year, set for the last year. This is the bill we've asked the House to move on consistently. Any questions from the Committee, Senator Hatchett, or is the appropriate time? Motion to pass by committee, substitute from Senator Hatchett, is there a second? I get from Senator Walker. All those in favor, please raise your hand. Is unanimous. Good, you should watch and yell for it. All right, you don't know what it was, do you? All right, thank you all for sticking with us. He by the wants to be on judiciary next year, can submit requests to the Lieutenant Governor and the Committee on Assignments. And I know all you all want to be on the Committee. And the chairmanship may be up too, with that we're adjourned. You",
  "updated_at": "2026-02-13T15:59:59.865168+00:00"
}