{
  "video_id": "4HeeePFGVNI",
  "url": "https://www.youtube.com/watch?v=4HeeePFGVNI",
  "title": "Georgia Rules Meeting 2026 - Day 11 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Overview:\nThe morning Georgia Rules Meeting session focused on two bills - HB 980 creating the Georgia Ireland Trade Commission and HB 945 making various updates to the state's banking and finance regulations. There was some discussion around the elder financial abuse protections and cryptocurrency ATM regulations in HB 945.\n\nKey Actions:\n**HB 980**: Creates the Georgia Ireland Trade Commission to enhance trade relationships with Ireland.\n**HB 945**: Department of Banking and Finance's \"housekeeping\" bill including:\n- Allows financial institutions to place transaction holds for suspected elder financial abuse\n- Regulates cryptocurrency ATMs with consumer protections\n- Increases registration requirements for litigation finance companies\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Rep. Bonner introduced HB 980 to establish the Georgia Ireland Trade Commission.\n- Rep. Williams presented HB 945, highlighting the new elder financial abuse and cryptocurrency ATM provisions.\n- Chair Lady Cooper and Whip Parks asked clarifying questions about the elder abuse protections in HB 945.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nQuorum present, no noted issues.\n\nAdjournment:\nThe morning session adjourned. No information provided on the next session date.",
  "transcript": "Morning everybody.\nIf you will go ahead and take seats and\nwe'll we'll get started. Uh we're going\nto open the meeting. Ask uh\nRepresentative Williams if you would to\nopen us with a prayer this morning.\n>> God of our weary years, God of our\nsilent tears, thou who has brought us\nthus far on the way. Most holy and\neverlasting God, again we come thanking\nyou. Thanking you for the many\nblessings. We thank you, Lord, for those\nthings that we did not see that you\nprotected us from. And now, Lord, we\ngather as a unit. We ask you to be with\nus. Control us. Make sure that we\nremember that we sit for the people of\nGeorgia, not for each other. For it is\nin Jesus' name we pray. Amen.\n>> Thank you, sir. Uh it it's come to my\nattention that some of the members may\nnot have a binder at your desk where\nyou're sitting. Let me encourage all the\nmembers to sit toward the front maybe on\nthe first three rows or so. So we'll\nmake sure that we get everybody but we\nwant to make sure has everybody got one\nnow? We should have enough but we want\nto make sure everybody gets one.\nOkay. If if not let us know and we'll\ntry to make sure we get those around to\neverybody.\nOkay, let's go ahead and uh see what we\ngot this morning. Uh Representative\nBonner.\n>> Well, thank you, Mr. Chairman. I didn't\nrealize you did this meeting just for\nme. I really appreciate that. Uh it is\nan important bill. I'm bringing before\nyou House Bill 980. Uh this bill creates\nthe Georgia Ireland Trade Commission,\nwhich is a 15 member commission composed\nof appointees from the House, the\nSenate, and the Governor's Office. uh if\nuh passage of this bill will join 25\nother states that currently have this uh\nand another 15 or so that have this\npending. But this creates the commission\nthat allows us to interact and um\nenhance our trade relationships with the\ncountry of Ireland, which as you may\nknow is the is currently the largest\nEnglish-speaking country that still is\nin the EU. So by uh one of the benefits\nof this is gives us access directly to\nthose EU markets through the country of\nIreland. Uh we've got strong cultural\nand economic ties with Ireland already.\nThey're one of our larger trading\npartners and this will further enhance\nthat effort for us. There's no cost uh\nto the state. Um and all of the funds\nthat are uh utilized for this purpose\nare to be raised uh from private uh\nentities. So with that, Mr. Chairman,\nI'll entertain any questions.\n>> Okay. Have any questions?\nDon't see any. Thank you, sir.\n>> All right. Thank you.\n>> Okay. We don't have anyone else on the\nwall over there. Uh, Chairman Williams,\nyou have a request, right?\n>> Thank Yes, sir. Can you hear me?\n>> Yeah.\n>> Thank you, Mr. Chairman, members of the\ncommittee. I bring before you this\nmorning, House Bill 945 is halfway down\non your blue on the front of the blue\nsheet. It's LC620310.\nThis is the Department of Banking and\nFinances housekeeping bill. As always,\nit comes with a a full support of all\nthe regulated industries. There's been\nmany discussions, meetings over the off\nsession, and as we continue to\nstreamline, improve efficiencies, and\nbetter protect the consumers of Georgia\nthrough our entire bank financial\nlandscape. Uh there's three\nmeasures in this that included this bill\nof particular importance I'd like to\nhighlight. The first is for the first\ntime we're going to uh put some\nfinancial\nprotections for for our elderly\npopulation where there's suspicious\nactivity uh or if there's suffic\nsuspicions of financial fraud. Uh it\nwould allow institutions that been\ntrained u to spot financial fraud to be\nable to place a transaction hold of up\nto 15 days. Um, again, this would only\napply to citizens that are 65 or older.\nUm, and it would allow financial\ninstitutions to request that senior\ncitizens u name a trusted contact on\ntheir accounts uh that the financial\ninstitution could reach out to\nin the situation where they might\nsuspect that grandmother or\ngranddaddy was being\na victim or an apparent victim of a\nfinancial fraud. We know what's going on\nin our society these days on that. The\nsecond thing we're touching is first\ntime there are\nthere are kiosk virtual ATMs that uh\nATMs across the state of Georgia that\naccept uh that you can do cryptocurrency\ntransaction transaction zone and right\nnow there's really no consumer\nprotections for these cryptocurrency\nATMs. Uh this bill would provide\nprotections for the first time uh user\nuh that they would be protected. They\ncould only uh deposit up to $2,500 on\ntheir first transaction. Uh subsequently\nafter they become a frequent user of the\nATM, the transactions could go up to\n$10,000 a day. But importantly, there\nwould be clear disclosures uh to the\nconsumer uh that the the transaction was\nirreversible. It was high risk of fraud\nand your cryptocurrency subject to\nvolatility. And the third thing is it's\nadding some more\nguard rails around litigation financing.\nRight now litigation financers\nfinanceers who were uh approved during\nthe tort reform legislation of last year\nuh have to register just one time. This\nwould require annual registration of\nfinancial\nlitigation financers financeers\nin case the company was sold. They just\nwe don't want to know who owns not\nthere's any criminals involved and who\nowns the financial litigation firm.\nThat's a rather lengthy explanation. Mr.\nChairman, happy to take any questions.\n>> Okay, we got a couple of questions.\nChair Lady Cooper, you have a question.\n>> Thank you, Mr. Chairman. It's not really\na question, it's request. Is this bill\nit moves forward? Could you consider\nmaybe on instead of just that one time\nat $2,500, maybe doing it two or three\nin case there's some way that they can\nget around them? This is the biggest\narea of one of the biggest areas for\nfraud for elderly people in the nation\nand they're taking hundreds and hundreds\nof thousands of dollars for people. So,\nthank you very much. But\n>> it's it's a great question, Chair Lady.\nthe and I failed to respond that that if\nif if the suspected financial abuse is\nreported within five days and and and in\nfact financial fraud, then the kiosk\noperators will refund\n100% of the transaction. So this this is\na huge win for consumers in it all by\nitself. after five days and you were\nable to prove it. Uh you do get your fee\nback which is right now you don't get\nanything back. So it's a great step in\nthe first in the right direction. Thank\nyou.\n>> Okay, Whip Parks, is that yours?\n>> Thank you, Mr. Chairman. Uh thank you\nfor the bill. I I certainly appreciate\num the safeguards to address financial\nexploitation especially of the of\nseniors. The one question I had was is\nthere any recourse um to to overcome\nthis five day hold or uh you know up to\n15 additional days if it is something\nthat you know an elderly person needs\nyou know what if an elderly person has\nan emergency and needs these funds is\nthere you know bypass mechanism that\nwould address that type of situation\nthank you part to answer your question\nthat's what the trusted contact would be\nfor obviously no financial institution\nhas to do this but those that go through\ntraining It's all about protecting the\ncustomer. Uh I can see your concern. I\nwould have similar concerns, but you\ncould take it up the ladder rel\nrelatively quickly with management and\nget more eyeballs on the situation. This\nis just a good first step in preventing\nthat fraud. Nobody wants to deny anybody\naccess to their money for a legitimate\npurpose. We just don't want anybody to\nbe abused. Thank you.\n>> Okay. Don't see any other questions.\nThank you, sir.\nJim Chasers,\nHouse Bill 704.\nAnd this bill simply uh eliminates the\nunnecessary reporting from the\nDepartment of Audits for one report that\ndeals with architects and engineers that\ndo business with the state of Georgia.\nWe do it monthly and then they give a\ncomprehensive one annually.\nThe monthly one,\nthe\npeople that submit the information to\nthe department of audits,\nonly about 70% do it on a monthly p\nbasis, but 100% do it on an annual\nbasis. So the monthly reporting is\ninaccurate to begin with. We're not\neliminating it. We're just going from\nmonthly to annually. And I don't have a\nlist, but I could show you what the\nreport looks like. I didn't prepare\nadequately this morning. I had another\nmeeting. And it's just a list of\narchitects and engineers.\nAnd it just has the dollar amount of any\ncontracts they do with about a hundred\nstate agencies\nand and departments. That's all it does\nand I'll be happy to answer any\nquestions.\n>> Okay. Have a question. Uh leader Hugley,\nis that your\n>> Thank you, Mr. Chairman. Uh to the\ngentleman, uh talk to us about why it's\nimportant to remove the subcontractors\nfrom the reporting.\n>> I'm sorry, I don't understand that.\n>> As part of what you're doing, you're\nremoving the requirement for them to\nlist their subcontractors.\nexplain why that's important.\n>> Uh, I I don't\nI don't know how to answer that because\nthat's not what I understand the bill\ndoes. The bill simply goes from\nmonthly to annually, which we're already\ndoing, but eliminates the process for\nmonthly. That's all it does.\n>> So, let me just ask you this then. uh\nwhy would you not go to a shorter\ninterval? If you if you say monthly is\ntoo burdensome, why would you not go to\nquarterly or semianually as opposed to\ngoing from monthly to annually?\n>> Okay,\nwe've only got about 200 accounting\npersonnel in the Department of Audits\nand all we're trying to do is utilize\ntheir time wisely. That's all we're\ntrying to do.\nit in committee. There were some\noff-the-wall questions that had no\nbearing whatsoever from what I\nunderstand,\nbut I wasn't in the legislature at the\ntime when this accounting\nwas important. It was because they were\nafraid that the engineers in Atlanta,\nGeorgia would monopolize\nthe business of engineering and\narchitecture throughout the state. and\nthey wanted to make sure that engineers\nin the rural areas and architects in the\nrural areas would have a shot at that\nbusiness.\nThat's that's it.\n>> Well, I understand that transparency is\nimportant and that's why I don't\nunderstand why we would go from monthly\njust to an annual thing. But I\n>> if I was if I I better prepared, I would\nhave brought a copy of the of the\ndocument and I'll give you one when we\nget to the chamber so you can see what\nI'm talking about.\n>> Okay. We got a couple other questions.\n>> Yes, sir.\n>> Thank you, Mr. Chairman. Um, thank you\nfor bringing the bill. Uh, Chairman\nShokus, as as I read the the bill um on\n70 and 71 um line 7071,\nit doesn't provide for any level. It\nsays all all contracts, architect and\nengineering firms. So, so it doesn't\nseem to me that it would be removing the\nsubcontractors. It's all contracts\nperiod for architects and engineering\nfirms with the state. Is that correct?\nYes sir. Thank you.\n>> Okay. Thank you.\n>> Okay. Uh Quart.\n>> Thank you, Mr. Chairman. Um along the\nlines of what leader Hugley was asking\nand and how what you just stated\nearlier, you know, this monthly\nrequirement was to prevent the\nmonopolization of contracts uh with the\nstate of Georgia. My understanding is\nthat uh there's a 10% statutory limit uh\nwith respect to state contracts. Um how\nare you you know, with this bill going\nto ensure that um we don't see this\nmonopolization of state contracts since\nmy understanding of moving from a\nmonthly report to an annual report would\npotentially create a one-year blind\nblind spot essentially when it's\nretrospective as opposed to forward\nlooking. Well, as I said earlier,\nthe source of the information only 70%\nof the people are complying and so the\nmonthly reporting is not accurate in the\nfirst place.\nNumber two is that these accounting\nfirms when they they bid on projects, I\nmean, not accounting, but these\narchitectural firms and engineering\nfirms, you know, when they get a a\ncontract,\nit's a long-term situation. They've got\nit's like across the street in our new\noffice building, that same architect and\nengineer is going to be there throughout\nthe project. So I and historically we\nhaven't had any of that issue where one\nhas monopolized it. There's over 400 on\nthe list and I'll be happy to show you a\ncopy of it because this passed out a\ncommittee unanimously last year.\n>> Thank you.\n>> Represent Evans, you have a question.\n>> Thank you, Mr. Chairman. Um, Chairman\nChokus, the I think the concern about\nthe subcontractors comes because in\nlines 32 and then lines 40 through 42,\nit specifically crosses out language\nthat talks about if there are subs that\nare receiving uh more than a certain\ndollar amount. That also has to be\nshared who those subcontractors are.\nThat's all crossed out. And then\nstarting at line 70 is where we're being\nspecific about what's going to happen\ngoing forward. And that's not there. And\nsince the state is not contracting with\nsubcontractors, they're now only\ncontracting with contractors. That means\nthat information goes away. And maybe\nthat was inadvertent, but that's the\nconcern. And I was wondering if you\ncould speak to why we did decide to get\nrid of that subcontractor reporting.\n>> Okay. If and as I said I'm not\ncompletely prepared for this and I\napologize but the way I understand it\nthese hundred agencies and departments\ndo the uh do the the u contracts out\nindividually. We don't have a state\nagency that's doing that and it's based\non the funding that we as the\nlegislature provide. So, you know.\n>> Okay. Uh, leader Fraation.\n>> Thank you, Mr. Chairman. Uh, Chairman\nChokus, is my recollection correct that\nwhen this bill was considered in\ncommittee, the department indicated that\nthe issue was that either reporting is\nnot being made or when the reporting is\ndone, the information may be inaccurate.\nAnd in order to provide actually greater\ntransparency, there's a plan for there\nto be a dashboard where this information\nwould be more accurate and readily\navailable to Georgians who may want this\ninformation, actually providing greater\ntransparency and greater public access.\n>> Thank you, Mr. Leader. I I appreciate\nyou explaining it more better than I\nhave. U and going to that on the\ninternet. It is on the internet. That's\nhow they they don't publish a book. They\nprovide this information on the internet\nevery month. It's available. And\nspeaking to the dashboard, the dashboard\nis an interactive\nuh uh way of reporting on the internet.\nAnd so creating a dashboard, then the\nuser could actually go out and\num put in the parameters of what their\nsearch is on this report and find out,\nyou know, how many contracts there were,\nwhat the amounts were, the length of\ntime, the locations. This report doesn't\nprovide all that information. and it's\njust got a dollar amount and a uh a date\nand that's it.\n>> Okay. Thank you, Chairman Cooks.\nObviously, there's several questions\nabout this. Let me encourage the members\nif you have some questions to try to get\nwith the author offline and get your\nquestions answered so you understand\nwhere we're going with that. Thank you,\nsir.\nUm, okay. Let me tell you sort of where\nwe are.\nUh we're not going to set a calendar for\ntomorrow, Wednesday. We're going to have\nthe judiciary come over and visit with\nus tomorrow. So that'll that'll take up\nsome time. Then it's my understanding\nthat the appropriations is going to come\nout Thursday, have a committee meeting\nThursday. So what we will do as a rules\ncommittee is we will meet immediately\nupon adjournment of the appropriations\ncommittee and set the calendar for\nThursday and put the budget on there at\nthat time. So that's where we are there\nwith that. So let's go ahead and and set\na calendar for Thursday. Now that will\nbe uh legislative day 13 under the uh\nmodified structure 985.\nHave a move and a second. Is there any\nopposition?\nIt's on. So that will be our calendar\nfor Thursday, but uh be aware that we\nwill meet after the appropriations\nfinishes their meetings on uh on\nThursday. Thank you.",
  "updated_at": "2026-02-14T14:49:33.31075+00:00"
}