{
  "video_id": "4I9ZOMshGEo",
  "url": "https://www.youtube.com/watch?v=4I9ZOMshGEo",
  "title": "Georgia Senate 2026 - Day 10 AM Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": null,
  "duration_minutes": 232,
  "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 10 AM Session:\n\n**Overview:**\nThis session focused on the introduction of several new bills and resolutions in the Georgia Senate. There were no major pieces of substantive legislation passed, but the session included routine procedures, recognitions of guests, and a morning devotion.\n\n**Key Actions:**\n- **SB 438**: To amend the Official Code of Georgia related to education\n- **SB 439**: To amend the Official Code of Georgia related to public health services\n- **SB 440**: To amend the Official Code of Georgia related to services \n- **SB 441**: To amend the Official Code of Georgia related to local government\n- **SB 442**: To amend the Official Code of Georgia related to motor vehicles\n- **SB 443**: To amend the Official Code of Georgia related to criminal offenses\n- **SR 662**: Resolution recognizing and commending Taiwan\n\n**Bills Introduced (First Reading):**\n- SB 438, SB 439, SB 440, SB 441, SB 442, SB 443\n- HR 1,008\n\n**Notable Moments:**\n- Recognition of pages serving in the Senate\n- Morning devotion led by a guest chaplain\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nSenators from the 7th, 12th, 28th, and 43rd districts were excused.\n\n**Adjournment:**\nThe session adjourned. The next session date was not provided.",
  "transcript": "You\n.\n.\n.\n.\nGood morning, good morning.\nTime for giving has arrived.\nThe Senate will now come to order.\nAll on authorized visitors, please exit the chamber at this time.\nI recognize the senator from the six.\nWe're a recap of the journal.\nGood morning, Mr. President, to getting snow this weekend.\nWe had a few Flurries down in Kay to County.\nAnd when I say a few, I mean very few.\nBut I hope our friends up north got three of the mess,\ngot to play in the snow.\nMr. President, we got a great group of pages today.\nAt a sandy springs, we have Kristen Berner.\nOut of Johns Creek, we have Kiana Chabria.\nOut of conures, we have Jamora Harris.\nout of Atlanta, Promise Hill,\nfrom Hogan'sville, Stormy Howard,\nfrom Millageville, Catherine January,\nfrom Woodstock, Cohen Kirkley,\nfrom Johns Creek,\nAditi Kothari,\nfrom Marietta, Ava Paramore,\nand from Hampton,\nwe have Alaska Talent.\nY'all give these pages a big round of applause.\nWe appreciate you being here to serve this great state and this great Senate.\nMr. President, the journal has been read and found to be correct, so I'll move we dispense\nwith the reading of the journal.\nAll right, thank you, thank you, Senator, and we do appreciate all the pages that are\nhere today working hard for this chamber.\nIs there objections to spending on the reading of the journal?\nChair here is done.\nthe general is dispensed with is there objections confirmation of the journal chair here is none and the journal is\nConfirmed all senators who have bills and resolutions introduced please bring them to the secretary's desk first reading and\nReferences the Senate bills and resolutions\nSenate bill 438 by senator's pain of the 54th and others a bill to be entitled an act to amend chapter two titled 20 of the\nThe official code is to you.\nSenate Bill 439 by Senator still of the 48th and others.\nA bill to be entitled and act to amend part two of Article 15 of chapter one.\nTitle of services.\nSenate Bill 440 by Senator Kirk Patrick of the 32nd and others.\nA bill to be entitled and act to amend Title 1619.\nThe 17th and services.\nSenate Bill 441 by Senator's Harbin of the 16th and others.\nA bill to be entitled and act to amend chapter 83 of Title 36 of the official code of Georgia annotated.\nRelated to local government and.\nSenate Bill 442 by Sen. Dickerson of the 21st and others,\na bill to be entitled to an act to amend Chapter 5 of Title 40 of the official code.\nSenate Bill 443 by Sen. Summers of the 13th and others,\na bill to be entitled to an act to amend Article 2 of Chapter 11 of Title 16 of the\nOfficial Code of Georgia Annotated, relating to offenses.\nThank you, Chair.\nSenate Resolution 662 by Sen.\nof the 33rd and others, a resolution recognizing and commending Taiwan for its relations with\nthe United States and the State of Georgia.\nMr. President, that completes the order.\nFirst reading references the House bills and resolutions.\nHouse resolution, 1,0008, my Senator Smith of the 70th and others, a resolution to ratify\namendments to a certain comprehensive statewide water management plan to provide for force\nan effect to provide for construction to resources.\nMr. President, that completes the order.\nSecretary Reed reports the standing committee.\nMr. President, the Senate Committee on Regulated Industries and Utilities has had under consideration the following legislation and has instructed me to report the same back to the Senate with the following recommendation.\nHouse bill 219, due pass, respectfully submitted.\nSenator Calzard of the 46th Chairman.\nMr. President, the Senate Committee on State and\nLocal Government and Governmental Operations General has had under the consideration\nthe following legislation as instructed me to report the same back to the Senate with the following recommendations.\nHouse bill 244, do pass by substitute.\nHouse bill 521, do pass.\nRespectfully submitted.\nSenator Dixon of the 45th Chairman.\nMr. President, that completes the order.\nSecretary, we'll read bills and resolutions for the second time.\nSenate Bill 382 by Senators, how stetler of the 52nd and others.\nAdvilarium taxation, make the statewide base year homestead exemption mandatory for all political subdivisions.\nSenate bill 395 by Senator Kirkpatrick, the 32nd and others, Department of Public Health, eligible for the low THC oil patient registry.\nRequire a physician to submit certain information to the Georgia Composite Medical Board.\nSenate Bill 420 by Sen.\nEccles of the 49th and others, license, permit, tag, and stamp fees.\nFees for reef and migratory fish endorsement, provide.\nMr. President, that completes the order.\nIt is now time for the morning roll call.\nAre there any motions to excuse?\nAre we going to send it from the 33rd?\nThank you, Mr. President, and good morning, y'all.\nI ask for unanimous consent to excuse the senators from the 7th, 12th, and 28th.\nAll right, without objection, just outside the cap.\nOut of Jackson Senators from the 7th, 12th, and the 28th, are excused.\nWe're going to send them from the 41st.\nThank you, Mr. President.\nI ask for unanimous consent to excuse the senator from the 43rd.\nand Jackson Center from the 43rd is excused.\nAny other motion to excuse?\nSecretary will call the roll, Senator,\nsignify your presence by voting the yeses with.\nSecretary Lampt machine.\nYes sir, sit down and do it from the second.\nThank you Mr. President.\nI ask for unanimous excuse to excuse the general woman from the 12th.\nHe's already been excused.\nIt is now time for the morning devotion of the Lord, the Lord, the Lord, the Lord, the\nit is now time for the morning devotion all senators please take your seats at\nthis time since it's all conversation with acid doorkeeper to secure the\nchamber at this time like to recognize the good senator from Rome Georgia to\nintroduce our pastor today and lead us in our pledged allegiance senator thank\nThank you.\nWe all stand for the pledge allegiance to flag.\nI pledge allegiance to flag of the United States of America and to the Republic for which\nit stands, one nation under God in the visible with liberty and justice for all.\nAnd the Georgia flag.\nI pledge allegiance to the Georgia flag and the principal for which it stands with justice\non our way to be perfected.\nThank you, Mr. President.\nIt's great to have the past of the day here.\nMacVendome is the chaplain at the Advent Redmond Hospital in Rome, Georgia.\nHas been there for six years, came from Florida.\nNow, one thing we do, and I work at both hospitals in Rome, but one thing he does there in\nthe morning, we have a hospital-wide prayer where we all stop unless somebody's in emergency\nsituation, and the entire hospital stops and prays.\nNow, it just seems to me like he spends an inordinate amount of time praying for me that\nI'm capable of doing my job, but maybe that's just me, I don't know, but I seem to get\na little extra attention sometimes.\nBut he has served there as the director of mission and ministry for oversight at that hospital.\nHe's board certified chaplain and he tries to provide spiritual and support and comfort\nwhole patient, those are, as you know, very difficult times for patients and for families\nand help some navigate through the illnesses, the sometimes losses and the man's of health\ncare.\nSo he's been trained in crisis intervention and debriefing and is really a passion advocate\nfor whole patient care.\nWith that, if the chaplain would say a few words for us and then lead us in a prayer.\nThank you so much.\nThank you, Senator Chuck.\nThis is the old bio, I'm a company here with my fiance, and so it is good that men is\nnot alone, and so she's here with me and I just want to thank the senator, thank you\nMr. President and my man up there in the gallery, Scottie, I'm just a joy to represent\nAdvent Health.\nI serve as the director of chaplain services for Advent Health Georgia, and today I just\nwanted to talk to you about the city that I now live in.\nI came here from Florida not too long ago.\nI'm still adjusting to this cold.\nWhen I came, I didn't have a beanie or a scarf.\nNow I have the full gamut in my closet.\nI am ready now.\nBut today I want to tell you about the three rivers\nthat meet in Rome.\nIn Rome, there are three rivers that converge.\nThe Edoa, the Ustanala, and you have the Kusa.\nThe Edoa and the Ustanala, they meet to start to flow\ninto the Kusa River.\nAnd this is known as convergence.\nConvergence is what I would like to talk about today\nas these three distinct rivers joined together\nto form something that is stronger, that is life-giving.\nThey do not lose their identity.\nHowever, they meet to offer a new one.\nThis reminds me of the Forch Appalens.\nFebruary 3rd, there were Forch Appalens 1943\nthat would converge, different faith traditions,\ndifferent religions, different journeys,\nyet in the most pivotal moment,\nwhere there was a great crisis on the SS Dorchester,\nthey would converge together to meet a common purpose,\nthat they rather die and see others live,\nthen for them to live and watch others die,\nothers die in silence.\nThere are moments in life that will call for convergence.\nLike the rivers that meet at one point,\nthey choose unity over division,\nservice over self-preservation.\nWhen the life jackets ran out,\neach of these chaplains gave their life jacket\nto someone else.\nWitnesses will later recall as the ship was sinking.\nThey prayed, they sung,\nand they encouraged those around them.\nHear me, hear me well, my dear friends.\nThey didn't merge by abandoning who they were.\nThey converge by offering the very essence\nof who they were.\nThat is the heart of convergence.\nConvergence is not sameness, it is shared purpose,\nit is many paths flowing together for the good of others.\nToday I say to you, my descendant,\nMay we also converge.\nThe reality is, we all have different backgrounds,\ndifferent political parties, different opinions.\nBut for the good of the people of Georgia,\nmay we also converge.\nWe all have different beliefs.\nWe all sometimes, I can imagine,\nwhen you're crept up in this room,\nit's hard to stand each other.\nBut my prayers, may you always stand by each other.\nThere are times I can imagine,\nwhen you're going through a lot of delegation\nand then you start to get impatient with one another.\nBut my prayer is even when it's hard to like each other.\nMay you live up to the creed from the Almighty\nto love each other.\nAnd finally, on the days when your nerves begin\nto run a little low, I wanna let you know\nthat the Almighty's not just a giver of life.\nHe's the creator.\nMy prayer is that he'll give you more nerves\nto continue to encourage each other.\nAs the three rivers in Rome flow to create\nOne mighty river called the Kusa,\nmay all the different little rivers in this room,\nconverge together to create a mighty river\nof healing, of hope, of restoration.\nSo that Georgia will always be the ultimate\nand greatest state in all of the United States.\nAs the song goes, Georgia, Georgia on my mind,\nand I know that Georgia is always on God's mind.\nDear Senators, you not just have a position.\nYou have a calling and a purpose.\nMay you always live up to it.\nLet us pray.\nDear God, as we pause for a moment,\nI pray for these dear Senators.\nOn the days when they're tired,\nmay you give them strength.\nOn the days when the keyboard warriors\nwant to just simply destroy, may you build them up.\nOn the days when the opinions seem to be so loud,\nmay they hear the voice of the Almighty saying,\nwell done, my good and faithful servant.\nI pray to the Lord that all of the rivers in this room\nmay converge and meet you, the Almighty,\nat a place where you will be able to flow through them\nand Georgia will continue to be the light upon the hill,\na place that shines a love of Christ every single day.\nBe with us now.\nGuide this Senate in Jesus' name I pray.\nAnd all of God's children said, Amen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIf I could have everyone's attention, we always like to welcome our doctors of the day\nto day and we've got a good one from the Augusta Georgia area originally and I'll recognize\nThat's a good senator from the 14th to introduce our doctor of the day.\nThank you, Mr. President.\nGood morning, colleagues.\nI'm so proud to start off District 14's domination of the Doctor of the Day Space this\nsession.\nWith Northside Hospital on Georgia 400, we are renowned.\nStay wide for our doctors of the day.\nAnd today I have the distinct honor of introducing Dr. Osama Hashmi.\nhe went to the University of Georgia,\nGodawks, did the same program there that I did.\nIn fact, we just missed each other.\nWe were, he started right as I left,\nand Dr. Hashmi is a dermatologist in Atlanta.\nHe is successful in business as well.\nHe is the CEO of Impericus,\nwhich was rated on a fast 500 list\nas the number one fastest growing company in the United States.\nSo again, just underscoring that we can have medical,\ntechnical expertise and professionalism\nthat couples very well with the growth of small businesses\nin a state that is friendly towards them.\nAnd I now will introduce Dr. Hashmi\nto share a couple words.\nThank you.\nThank you.\nThank you.\nAppreciate it.\nEveryone, thank you for having me and looking forward\nto hopefully not seeing you all in the medical station.\nJust remember, I am a dermatologist.\nSo there's some more qualified physicians in this room.\nJust want to say thank you.\nI am a Muslim, I'm an entrepreneur, I'm a physician,\nI intentionally have a born race here in Georgia,\nstay here in Georgia despite having spent a lot of time\nin the Bay Area in New York.\nI wanted to thank you for upholding\nGeorgia's values of entrepreneurship,\nopportunity, empathy, diversity,\nand most importantly, southern hospitality,\ntreating strangers like their family.\nI don't have any Botox with me as well,\nbut if you guys do wanna come down,\nI think we have some snacks\nand happy to take care of y'all today.\nThank you very much.\nAll right.\nGood job.\nYou\nWe have a very special guest here today from Clark Atlanta University.\nThey are always welcome guests and I'm glad to have them here again today and I'd like\nto call them the Secretary to Read Resolution.\nSenate Resolution 639 by Senators Orock of the 36th and others.\nA resolution recognizing February 2nd, 2026 as Clark Atlanta University Day at the state\ncapital and for other purposes. Whereas Clark Atlanta University was the nation's first\nfour-year liberal-call arts college to serve a primarily African American student population\nand whereas the university's four schools offer 40 academic programs to 3,920 students\nannually. Whereas President George T. French serves as the longest serving HBCU president\nin the country and has for many years provided dedicated service to higher education of\nGeorgia citizens. Now, therefore be it resolved by the Senate that the members of this\nbody recognize February 2nd, 2026 as Clark Atlanta University Day at the State Capitol.\nMr. President, that completes the order.\nAll right, is there objection to adoption resolution? Chair here is on the resolution\nis adopted. Like to recognize Senator from the 36 to speak to the resolution and introduce\nThank you so much and good morning colleagues as we gather here on a cold Monday we are happy\nto be back under the gold dome and ready to do business and it's such a timely opportunity\nto recognize a historic institution that we have here in Georgia and we have with us\ntoday the leadership of that institution. That is Clark Atlanta University. There's a\nhistory that goes all the way back to the Civil War when this college of higher learning\nwas formed here in Atlanta. And it has played a critically important role in educating\nleaders and providing opportunities to those who had been locked out of access to higher\neducation historically. So I am particularly proud today to have this opportunity to join\nwith the leadership of the institution here on Clark Atlanta University Day at the State\ncapital. We have graduates of that institution with us that are members here in\nthis Senate and I will thank you, Governor. There's much rich history here. We\nwould all be well advised to learn from the history of Clark Atlanta University.\nThe esteemed leader, Dr. George T. French Jr., is the fifth president of Clark Atlanta University.\nClark Atlanta University is the largest United Negro College Fund member institution in the country.\nDr. French is the longest-serving sitting HBCU president.\nHe's driven transformative advances in education, including under his leadership,\nsecuring gifts from the Arthur and Blank Family Foundation of $16.5 million, and Mackenzie Scott's foundation of $53 million for Clark AU.\nHis strategic leadership has forged partnerships with major corporations, such as Apple, Google, and Microsoft,\nwhich has enhanced educational opportunities and technological integration for Clark AU.\nUnder Dr. French's leadership, the college has launched initiatives to improve access to\nhigher education, expand research capabilities, increase student success rates.\nThe university's reputation as a leader in innovation and social impact has been secured\nunder the leadership of Dr. French.\nHe's recognized in who's who in Black Atlanta, Georgia trends 100 most influential Georgians\nAnd he's actively engaged with other professional organizations as well.\nHe was the president of Miles College for 13 years where he significantly impacted the\nlocal economy and advanced educational programs.\nAnd there are close to a dozen high-profile organizations in higher education that he\nthat participates in and has had roles in leading being\nmember or chair or president.\nHe's just fits the bill of what the institution Clark Atlanta\nUniversity was looking for when he came on board.\nAnd his educational background is a BA in political science\nfrom the University of Louisville, a jurist doctorate\nfrom Miles Law School and a PhD in higher education\nfrom Jackson State University.\nHe'll share with us both the illustrious history\nand today's enormous contributions\nthat this institution continues to make.\nIt is my honor to bring him forward\nand present him with this resolution\non Clark Atlanta University Day,\nFebruary the 2nd, as we start a new month here at the Capitol, it's a great honor to\nbring to you Dr. George French, the President, and present this resolution.\nThank you.\nGood morning to the President of the Georgia Senate, our friend Lieutenant Governor\nBurke Jones, to all of our friends in the Senate.\nAnd I say that without qualification.\nBecause Senator, when I arrived in the great state of Georgia,\nto take the helm of Clark Atlanta University, six years ago,\nimmediately, Senator Orrick made sure\nthat I was introduced to the Senate.\nAnd in these six years, you all have become our friends.\nSo when I come now to the legislature,\nboth in the House and the Senate,\nwe have friends on both sides of the aisle,\nfor which we are grateful.\nAnd I'm grateful for my vice president\nwho have joined me this afternoon\nto include my chief of staff,\nto include a Sherry Klingmer,\nto include the senior vice president and provost,\nacademic affairs, Dr. Charlene Gilbert,\nMr. David for Boni, Vice President of Institutional Advancement, Dr. Marshall, Dr. Marshall\nTaggart, Vice President for Governor Affairs, and I don't think the lieutenant governor\nyou're not with us yet, are you, you're gonna, but you have been, and he has been with us.\nAnd of course to President Pro Tem Larry Walker, Senate Minority Leader and our friend\nHarold Jones, out of Augusta, and again we thank all of our senators to include those to my right and Max Burns who we saw in the back, Senator Anderson, Wicks.\nAll of these up here, you all know who they are, so I don't have to go through those names, but I say to each and every one of you, thank you.\nThank you for this recognition to stand yet again before this august body\nWith convergence we are converging. I heard the preacher say this morning. We are converging so we converge\nOn this upon this great chamber to say thank you and to let you know that on behalf of the more than\n4,000 students and remember that we offer\nfor bachelor's masters through the PhD.\nWe have the only institute HBC in the nation\nthat offers the PhD in cyber physical systems.\nI want you to know that we're over 4,000 students.\nOn behalf of those students, we have three things.\nWe bring talent to Georgia.\nWe bring prepared training for the future workforce to Georgia.\nAnd we bring support for cutting edge technology,\nresearch and education in cancer prevention\nthrough our Cancer, our CCRTD Cancer Research and Therapy\nLeague Development Center, and Data Science,\nArtificial Intelligence, and Machine Learning.\nWe bring these things to strengthen one of the greatest\nstates within the Union, our great state of Georgia,\nour great state of Georgia, our great state of Georgia,\nis what we celebrate and know that we come to contribute\nto our great state, to our great economy.\nThank you again, Mr. President, for this opportunity\nto represent Clark Atlanta University\nand to say thank you for your support.\nGod bless America and God bless the great state of Georgia.\nBecause Georgia's on my mind.\nThat's good.\nThank you so much.\nI love you.\nYou\nYou\nYou\nYou\nYou\nYou\nAre there any unanimous concerns?\nDoes any senator wish to rise on a point of personal privilege?\nWe're going to send them from the 8th for a point of personal privilege.\nGood morning, colleagues. This is my first time in the way of this session. I just wanted\nto bring something that came to my attention this weekend and wanted to bring it to your\nattention. You know, I tell people all the time that we've got our friends out in the\nhallway you know that lobbyists and you know what is our job our job is to be\na lobbyist for the common men and women of this state the everyday\nGeorgians that get up every day work either bills and keep this state running so\ntoday I'm going to lobby for Miss Mia Miss Mia is 20 years old Miss Mia is\nworking her way through school and she has got a bright future but she just\nwent to go buy a used car so that she could get back and forth to school into work. She\nwas buying a 2023 Nissan Centra. It was $17,500. The payment on that car was $338 a month.\nAnd she went to go get insurance, and she went to a very good friend of mine who was the\ninsurance agent, and he priced it with everybody that he could price insurance with, okay?\nThe best he could come back with for a quote, I've got it right here, for six months is $3,417\nfor six months, okay?\nSo for a year, those monthly payments are $600 a month for a $17,000 car that the payment\nis $338 for.\nAnd so I got to look in at it and I looked up the company that had quoted this price and the company's gross profit for the 12 months ending September the 30th of 2025 was 14.335 billion dollars, a 30.64% increase year over year.\nTheir annual gross profit for 2024 was $11.467 billion, a 106.72% increase from 2023,\nand their annual gross profit for 2023 was $5.54 billion, a 224% increase over 2022.\nSo in two years, she'll almost paid for that car with insurance payments, and the third\nyear, she'll have paid for that car and have $3,000 left over.\nHer insurance, her yearly insurance cost is more than her tuition.\nAnd so I just want to say this, as we all seek to be a lobbyist for the people that we\nrepresent back home, I want y'all to help me let's put our heads together and see if\nwe can't do something about this because it's wrong.\nIt is not right for somebody that's trying to get ahead in life and go to school.\nI voted for tort reform.\nI have been sued before.\nI know that we have frivolous lawsuits.\nBut at the end of the day, we were promised\nthat our insurance premiums would come down.\nThis is not happening by what I see here.\nSo to everyone out there, just know that we\nin the General Assembly are watching.\nAnd I'm lobbying on behalf of Miss Mia.\nTo let's see if we can't do better by the citizens of Georgia,\nMr. President, I yield the will.\nAll right, the Senate is yielded.\nWe're going to have the Senate from the 13th\nfor a point of personal privilege.\nI thank you, Mr. President.\nColleagues, this is a little update.\nWhat's coming up for tomorrow?\nThe gas authority, as you all will know,\nthey provide cities for natural gas,\nand they are excited about the passage last year\nSenate Bill SB 13.\nThis granted jeep of the ability to provide funding\nfor natural gas and infrastructure,\nespecially in rural Georgia.\nThe gas authority and its members are working hard\nto provide all these services needed to meet\nthe demand and growing areas of our state.\nTo highlight this work, the municipal gas systems\non their behalf have asked me to invite you all\nto come to February 3rd, 8 a.m. room 230 in the capital and just show their appreciation\nroom 230 in the capital 8 a.m. for the natural gas authority, Mr. President, you know the\nWe're getting out of the center from the night for point of personal privilege.\nGood morning, Mr. President, I rise today to acknowledge a tragedy that struck our Gwinnett\nCounty law enforcement family yesterday, leaving one officer dead, unfortunately, and\nanother officer critically injured in an unprovoked attack at a hotel.\nIt was a routine call that happened.\nThese brave officers would just serve in their community and answer in the call to protect\nthe residents of Gwinnett County when the tragedy occurred.\nMaster Police Officer David M. Reed and Police Officer Senior Perdit Tameh.\nTo the family of officer Tameh, I extend my deepest condolences.\nWords can express the pain of such a devastating loss.\nI hope people find comfort in knowing that he will be honored for his selflessness and\nultimate sacrifice.\nI think my colleague, the center of 445th, actually had a met officer to main in person at one\nof his events.\nHe was very young, a young officer.\nI'm grateful that Master Police Officer Reed is on the path to recovery and healing,\nAnd I stand with our community in continued plet prayer and support of our brothers and\nsisters in Gwinnett County Police Department, acknowledging that the days ahead will be\nchallenging.\nOur local law enforcement agents in Gwinnett County are truly the best.\nAnd matter of fact, this incident is very rare for Gwinnett County to lose officers.\nWe haven't lost officers in a line of duty in a while.\nThey do their best to keep us secure and gain our trust.\nWe're praying for them and we thank them all and be sure to keep doing that.\nTo all the law enforcement officers, all our first responders and anyone who has served\nthis great community in our nation in any way, thank you for your service and your sacrifice\nMay the good Lord bless each and every one of them and with that Mr. President I\nask for a moment of silence for officer. Senator Cresson, have you\nI remember staying as for a moment of silence.\nThank you, Senator.\nThank you, Mr. President.\nI yield the bill.\nBring it down to the center from the 50 second for personal\nribbons!\nI'm not going to do it.\nI'm not going to do it.\nYou might hit my butt.\nBreak it down the center from the 29th.\njust a little bit about the Gwyneth police officer who was murdered a couple\ndays ago. Showman was 25 years old, had been on the job for eight months and called\nout early in the morning for what the average non-post certified law enforcement\nofficer would consider a routine call. While all law enforcement officers, people that\nhave actually done the job understand there is nothing like a routine call. There's no\nsuch thing. If you go to the officer down website and you look at the number of officers\nwho are killed on traffic stops.\nIf you look at the number of officers who are killed\non domestic violence calls, if you look at the officer\nthat was just assaulted over in Warner Robbins the other day,\non a domestic violence call.\nIf you look at the tens of thousands of law enforcement\nofficers that are assaulted every single year,\nThere's one reason why more officers don't die every year.\nAnd I give that credit to the senator from the first\nand everybody in his profession that we've gotten better\nat saving lives.\nBut for a young man whose future lied fully in front of him\nto go out there and do the job and to give his life for doing\nwatch right is completely unacceptable. And sadly, I speak at a lot of\nmemorials throughout the year, and I remind people each and every day that we\nall die to deaths. We die the death when our heart stops beating, and we die the\nsecond death when our memory fades. And so I'm honored to go to Washington, D.C. and look at the\nmemorial there to the tens of thousands of law enforcement officers, men, women, white, black,\nbrown that come from all over the world and come here to this country to become an American citizen\nand then to turn around and serve the community who accepted them with open arms.\nI'm reminded that we can never let them die of that second death.\nPlease keep this young man in your thoughts and your prayers every May 15th.\nThanks to President John F. Kennedy, we have a day to remember all of these men and women.\nBut never forget that.\nSo, when you allow politics and ideology to build a cocoon around your brain when it comes\nto law enforcement, whether they are county, whether they are municipal, whether they are\nstate, whether they are federal, understand you're doing more damage than that initial bullet\ndid.\nThis officer will live a long, long life thanks to his memory, thanks to his sacrifice,\nhis dedication. This is not about politics. This is about people and dignity. Thank you, Mr. President,\nI yield the well. Thank you, Senator. We're going to have Senator from 39.\nThank you, Mr. President. I rise to speak with both disappointment and concern\nabout the direction of our nation's cultural center, the John F. Kennedy Center\nfor the performing arts. Yesterday's headlines confirm that the Kennedy Center\nwill halt its entertainment and operations for renovations for approximately\ntwo years beginning on our nation's 250th birthday on July 4th, a dramatic shift\nannounced by President Trump who in 2025 appointed himself chairman of the\ninstitution's board and recently oversaw a controversial renaming of the\ncenter itself. The Kennedy Center was never meant to be just a building nor\nreserve for a select few. It was meant to be a place where families brought\ntheir kids where students sitting far from D.C. could still benefit from its education programs,\nand where tourists and working people alike could simply walk through the doors for free or with\na ticket and see something meaningful on stage almost every single night of the week.\nThe center is not a small or symbolic operation. It houses multiple stages, is home to the\nthe National Symphony Orchestra and the Washington National Opera and anchors\ntouring productions seen by audiences from every state. For more than 50 years\nsince opening in 1971, the Kennedy Center has remained open through changing\nadministrations, economic downturns and moments of national uncertainty, making\nany shutdown, let alone a multi-year one unprecedented in its history.\nWhen an institution of this scale shows signs of instability, the consequences ripple far\nbeyond its walls.\nAs President Kennedy himself once said, the life of the arts, far from being an interruption,\na distraction in the life of a nation, is very close to the center of a nation's purpose.\nIt is a test of the quality of a nation's civilization.\nThat vision was never about art for art's sake.\nIt was about the role culture plays in a healthy, confident democracy.\nI speak to this personally as someone who had the privilege of chairing the President's\nAdvisory Committee on the Arts during the Kennedy Center's most recent $175 million\ncapital campaign.\nwork was about stewardship, expanding the campus, strengthening the institution's foundation,\nand ensuring this national center would remain open, welcoming and relevant to the American\npeople for generations to come.\nCan you imagine if another administration were to decide that the money that we just put\ninto building the new office building across the street didn't serve its purpose and we\nWe were to start all over again because new times, not good enough.\nThat is why I say with regret that the recent decisions at the Kennedy Center, the abrupt\noverhaul of its board, the departure of artists who no longer feel welcome, and now the announcement\nof a multi-year closure have not advanced the mission.\nWhen those doors close, literally or figuratively, we don't just lose performances.\nWe lose a shared civic space that brings people together across backgrounds, beliefs and\nincome levels, and that weakened something far bigger than the arts.\nInstitutions like this survive on trust, public trust, donor trust, community trust.\nOnce that trust is shaken, it is far harder to rebuild than any building itself ever could\nbe.\nThe board has a choice before it, to safeguard an institution that belongs to the American\npeople, or to preside over a decision that will diminish it for years to come.\nA multi-year closure is not an inevitability, it is a decision, and decisions like this\nrequire courage, especially the courage to say no, even when that pressure comes from\nthe most powerful person in the room.\nThank you.\nSenator from the 14th, you wish the point of person privilege.\nThank you, Mr. President.\nI'm sad that the Senate from the 8th is not here in this moment for me to boost him so\nenthusiastically.\nBut did you all hear what the Senate from the 8th said just a few moments ago about a\na constituent whose car insurance rates.\nThank you for coming back, sir.\nI wanna boost you, because that's a crazy story\nthat those car insurance rates keep going up.\nAnd in fact, our insurance commissioner, John King,\nsaid something to this same effect back in November.\nI don't know if you guys caught this,\nbut our commissioner on insurance and safety fire\ndid a tweet where he acknowledged\nthat insurance company profits have grown\nand that rates seem to keep rising.\nI'm curious if y'all remember the incident\nthat prompted our insurance commissioner to say\nthat insurance company profits should be capped.\nCapped, by the way, you know, hashtag Capitalism.\nOur insurance commissioner said we should cap\ninsurance company profits.\nAnd the reason he did that was not\nbecause he received constituent stories like this.\nThe reason was not because he got a PDF\nfrom insurance companies showing their exact financials.\nNo, the reason the insurance commissioner said\nthat we should cap insurance company profits\nis because the day before a Democrat\na state house special election in Athens, Georgia, in Clark and\na county counties after he had lost that same race the year prior by 22 points.\nSo I think what happened was the insurance commissioner was trying to warn\nthe Republican Party that if you didn't take real action on car insurance and\nother insurance rates, real action, not fake action, that you were probably going to\nkeep losing elections, which it turns out is actually the hammer that has to drop\nfor the political courant to change.\nNow let's be very clear about what Democrats were saying\nduring the entirety of the tort reform debate.\nWe were saying that insurance companies make profits\nin the billions with a B, not millions with an M,\nbillions with a B, and that threat that John King said\nwas so present and real that the insurance companies\nhad a gun to his head and said,\nwe will leave the state if you do not give us\nthe sacrifice we require.\nIf you do not sacrifice plaintiffs' personal injury\nlawsuit rights on the altar of insurance company profits, then we will leave the state.\nAs it turns out, that was probably baloney.\nAnd as it turns out, the only way that rates are going to come down is if insurance company\nprofits are capped, which is exactly what your insurance commissioner John King said back\nin November in response to a loss.\nThe last thing I'll say is that we were promise that even if the insurance rates don't\ngo down, they will at least stabilize.\nI would submit to you that the reason the word stabilize was used is because it was so\nfar fetched that insurance companies would somehow pass along savings to consumers and\nthat rates would come down that they knew that that was too bold faced of a lie to promise\nduring the tort reform discussion.\nWhat happened in 2025 is that the Georgia Chamber of Commerce quarterback, an insurance company\nled effort to lie to the people of Georgia through the mouth of Brian Kemp to tell everybody\nthat their insurance rates would go down or stabilize if we cut plaintiffs' rights\nat the knees. Plenty of opposition told you that in other states, like Florida and\nthe Carolinas, which by the way, both Donald Trump and Donald Trump Jr. went on record\nsaying that those were tort-reformed scams, we went on record telling you that every\ntime tort-reform had been passed, the rates didn't go down. So with the utmost respect\nfor the center from the eighth who is telling you what is admittedly and truthfully a sad\nstory about rates continuing to go up. Let's just do the most basic level of accountability\nin our political discourse and acknowledge that everything we heard from the pro-tort reform\ncamp in 2025 was a completely toothless and feckless scam. Thank you very much Mr. President.\nThank you, Mr. President.\nGood morning, Mr. President.\nColleagues, today I rise to recognize Lagrange chapter of the links incorporated\nchartered June the 30th of 1979.\nWhat began in 1978 as an interest group of 20\nservice-minded women has grown into a powerful network.\nNow 39 active members committed to enriching the lives\nof African descent through education, health, civil\nengagement, the service across multiple counties in Georgia\nand Alabama.\nTheir legacy includes youth scholarship initiatives,\nvoter-right efforts, programs like Lincoln Pink,\nblack care, the Dignity Project,\na dress-in-period property,\nalongside partnerships with organizations like NAACP,\nthe America Accounts of Society,\nthey were honored as the southern area\nof the start chapter, both in 2021 and 2022 and 2023.\nin 2023. Thank you so much. I yielded well.\nBreak it down to the center from 21st.\nThank you, Mr. President. I appreciate that.\nGood morning colleagues. It was good to see everybody here today.\ntoday. I want to take just one quick minute and recognize my page for the day. My page\nfor the day is Mr. Cohen Kirkley and he's a ninth grader from Ottawa High School. I've\nknown his family for 25 years and it's been amazing to watch this young man grow up. He's\nbeen an excellent student from elementary school all the way through middle school. This\nyear he joined the JROTC program as one of the Raiders. And furthermore, he won't be\nin the only ninth grader this year to compete on the A team for the JROTC for Ottawa High\nschool. So as a lot of you are aware, I'm a huge veteran advocate. I always support our veterans.\nI also want to make sure that I recognize all the veterans that we have here in the Senate\ntoday, both as senators and as staff members as well. There's quite a few of you. So I want to make\nsure that I say thank you for your service. Thank you for everything that you continue to do\nevery day for our veterans. And I just want to tell Mr. Cohen, currently it's been a pleasure\nknowing you. I look forward to seeing all the great things that you continue to do and looking\nYou can see where your lap takes you.\nThank you so much.\nMr. President, I yield the well.\nGreg and I are the senator from the Fitch fourth.\nThank you, Mr. President.\nI will try not to be too long because I know we're going.\nI just I did want to rise this morning just to say that as this morning as we're\nremembering those in public safety who give their lives to understand each\nthat we never one of us take a moment to realize that those in public safety do\na job that the vote those of us in this room the majority of us in this room\ncould not do could not do because there's a reason that you go through all that\ntraining, whether in the military or public safety, it's because it's literally, the Bible\nsays it's Christ of sin in heaven, He gave gifts unto mankind, and it's literally to have\nthe heart of a liberator that we're gifted with that allows some people to run forward\ntoward their own demise when anybody else in the right mind will be running away.\nSo let us always remember those men and women who put themselves on the front line each\nevery day in any regard that they do and just part of that I also want to let\neveryone know that tomorrow Georgia Aerospace and Defense Day will be\nGeorgia Aerospace and Defense Day at the Capitol and you have another\nopportunity and also if any of you ever want to be an F-35 pilot fighter pilot\nthey will have a simulator here today and tomorrow in the Rotunda and you're\nwelcome to take your turn is sitting in the hot seat and seeing how well you do\nMr. President, I thank you for the opportunity and I will yield the will.\nThank you, Senator.\nI recognize the senator from the 28th of a point of personal privilege.\nYeah, I'm so much nicer.\nYeah, I'm so much nicer for me.\nYeah, I'm soíssolane.\nThank you.\nI'm thinking, you're gonna stay up?\nThank you, Mr. Chairman, today is a wonderful day here at State Capitol.\nWe have great people who have come to join us as we soon deliberate, I think, on some\nWe had Clark Atlanta already and I had to mention them even though I graduated from Morris\nBrown College, two of my sisters graduated from there and my father, my mother graduated\nfrom Spelman College and my older sister.\nSo I think we made the round, oh and my late husband graduated from Moore House.\nSo I think we made the round so I have to give honor to them for coming today and already\nbeing Dr. French and Dr. Marshall's target always have me in the parade.\nSo I didn't want them to kick me to the curb.\nAll right.\nBut the greatest thing that I can say today is that I'm proud to be the one of the\nrepresentatives in Cobb County, namely, Mabelton George.\nAnd we have the other members who are also Cobb County.\nAnd Kay is somewhere, but she's so busy.\nRachel Hanks also represents Cobb County.\nToday, we have with us from the great city of Mapleson.\nWe have our very own mayor.\nAnd out of the little bit, come on.\nThey might not let you come up here, but because I'm so proud\nthat Mayor Craig Owens is with us.\nOh, I said, well, I have Craig on here.\nI know that it didn't sound right.\nAnyway, excuse me, we got you another name now,\nbut Mayor Michael Owens.\nAlso, we have the city manager, Bill Tanki, where are you?\nAnd Executive Director of the Epi Center, Dr. Chris Boyne,\nalso from Word of Faith, that's my other church.\nAlso, we have city council persons.\nEverybody, please raise your hand on this side,\nas well as this side, and Jaha, that's your twin in it.\nY'all look just alike, but I know you're probably not even,\nCouncilman Michael McNeely, Mayor Pro Tem, Ron Davis, and the list goes on.\nWe're recognizing today as Mabelton Day at the State Capitol.\nAnd we had a resolution that's been dropped, but not read, and it states, Mabelton, Georgia\nis a vibrant community located in Cobb County.\nIt was officially incorporated as a city\nfollowing a successful rev from Brindam.\nOh, we can't get it out.\nNovember 8th of 22, making it the largest city in Cobb County\nwith the population of approximately 47,000 residents.\nand, whereas the city was named after Scottish immigrant Robert Mabel, who purchased land\nin the area in 1843 and established a farm that would later become central to the community's\ngrowth with the historic Robert Mabel House and cemetery also, not serving as an iconic\nlandmark that hosts public performances and events.\nWhereas Mabelton's early development\nwas shaped by the arrival of the Georgia Pacific Railway\nand which is constructed a train depot in 1881,\nspurring economic growth and transforming\nthe area into a vital commercial hub.\nand then rural Cobb County,\nwhereas the community benefits from a strategic location\nalong major highways,\nincluding Interstate 285,\nproviding convenient access to Atlanta\nand supporting the city's economic and residential growth.\nIt goes on and on,\nbut we will say whereas Maplethane\ncontinues to experience growth and revitalization as well as uphold the commitment to fostering\neconomic development. I wish you'll give me a few more minutes. Okay, my time has expired,\nbut please all the people from Mapleton that's here and up in the gallery, please stand.\nAnd Senators, let's give them a warm Senate welcome, please.\nThank you for coming.\nAnd I wish I had put everybody else's name down so y'all could speak to you.\nThank you.\nSenator, we appreciate the people from Ableton being here more than you know.\nThank you.\nThank each and every one of y'all for being here today.\nThank you, Senator.\nAppreciate you.\nrecognize the center from 36 for a point of personal privilege recognize center from the\nThis is the 50th for a point in person privilege.\nMy distinguished colleagues, I rise today because I am concerned with where our nation is going\nin the form of our democracy and how it indirectly affects something that happened in my district.\nSomething happened yesterday in my district, and the whip is not here, but the whip acknowledged\nit.\nlaw enforcement officer who failed that was in my district, that was in less than 10 minutes\nfrom my house where this officer whose name has not been called, his name is Pre-Deep\nTemang.\nAnd I stand because of twofold, a twofold reason.\nHe was a law enforcement officer who failed and we got to recognize that.\nBut I stand also because he was born in Nepal.\nAnd if you saw him outside of this uniform, he may be one of the persons who have come\nup to me and said that they were so concerned that they were carrying around copies of their\npassport.\nIn my district, I have so many diverse people and pre-deep to Meng was born in Nepal, but\nhe was serving the people of Georgia.\nAnd we have to give him respect not only when he's in a law enforcement uniform, and that's\nThat's why I'm standing here because I despise any death, let alone a death of a law enforcement officer.\nBut I want to say that our political violence speaks, our hate speech has got not a hand.\nIt's created an atmosphere where people are not respected.\nThe value of life itself is depreciated.\nAnd we must elevate our speech to statesmanship nationally and states wide.\nAnd I believe Georgia can even lead the federal government in elevating our stance on how\nwe speak to one another, how we respect one another.\nWhy am I saying this?\nBecause I noticed with great disappointment.\nIn September we lowered the federal flags for a man that I don't want to die, but I despised\nwhat he stood for.\nHe stood for.\nHe was a Christian right advocate for Christian nationalism.\nI am a real Christian and I respect Christianity.\nBut there was a person who the flag was Lord for a person that espoused hate speech, a person\nwho criticized the Civil Rights Act of 1964, without which I could not stand right here\nwhere I'm standing right now.\nBut he was lifted up and the flags were Lord for him.\nWhen he criticized Dr. Martin Luther King, we Lord our flag for that same gentleman, as\nwell as promotion of false allegations of electoral fraud in 2020 and white genocide conspiracy theory.\nWe lowered our flag for that gentleman.\nAnd why is that important?\nThat is important because very few of you, I dare say very few of you, can remember in\nJune of the last year, when a person who was the minority leader in Minnesota, the person's\nname was Melissa Hartman and her husband, who died because she was the speaker of the\nhouse in Minnesota. She was the minority in 2017 to 2019. But in 2019, she became the\nspeaker of the house that said that the politics changed just because one\nparty is in power we should not shift our allegiances but we don't know the\nname of Melissa Hortman. We don't know that name. We don't know the name of\nPradeek Tamang but we should respect everyone and I say that we have to\nrespect because I don't want us to stop respecting police officers and being\nafraid to open our door for a police officer. Because you know what happened in Minnesota?\nA police officer, that's who the killer posed himself as when he shot and killed Melissa Hartman.\nHe posed as a policeman. And that was the only thing that we respected is that badge. And we got\nto elevate that badge and elevate all human respect for human life. I yield the well as I call the\nthe name of Pradeep Taman, as well as Melissa Hortman,\nbecause all life is valuable,\nas well as our law enforcement officers.\nThank you, and I yield the well.\nAll right, thanks Senator.\nDoes any other Senator which rise on point of personal privilege?\nSenator from 36.\nI called on the earlier Senator, but you.\nYou.\nYou were deep in conversation with somebody.\nThe colleagues I rise today to speak about\nwhat's going on in our state\nAnd in our nation, deeply, deeply troubling set of facts that we are observing.\nAnd I, of course, join with the senator from the cab in lifting up the name of Melissa\nHortman.\nI knew her.\nI served on boards with her.\nI knew her leadership.\nI knew her inclusive approach to leadership.\nAnd I mourn yet, and still, that this impeccable public servant was shot down in co-blood at\nthe door of her home, along with her husband, who both lost their lives at the hands of\nsomeone absolutely bought into conspiracy theory and political violence as the appropriate\nresponse.\nThat's what that was there.\nAnd we are going down that dangerous road\nat an ever-ever increasing pace.\nI'm from Fulton County.\nI represent Fulton County.\nFulton County's\nvoter center\nwhere we store all our ballots,\nwhere we administer the process of voting in our county.\nwas rated by the Federal Bureau of Investigation.\nWhat world are we living in?\nWhat world are we living in?\nWhen the FBI using some Missouri official,\ndeems that they have the right to storm our Bowdoin Center\nhere in Fulton County, and to take all the records\nfrom the 2020 elections, and refused to document for our local officials who were there on\nsite. The FBI refused to document what they took, how much they took, and it was not\nsmall, it was they wanted everything, everything, and what are they going to use it for?\nglorious accusations about the 2020 election. And I say to you what we're\nwitnessing today should alarm every Georgian, Republican, Democrat, and\nindependent alike. Put yourself in our shoes, those of us in Fulton County. What\nif the FBI came storming into your county and seized voter records, seized\nballots from an election? It's a terrifying escalation from the failing\nadministration of a wannabe strong man and we all know his name.\nSo let's be clear.\nAnd I doubt that anybody in this room disagrees with me.\nGeorgia ran a secure election in 2020.\nThat fact has been confirmed again and again.\nIt's been confirmed by Republicans.\nbeen confirmed by the Secretary of State, who's a member of the Republican Party, it's\nbeen confirmed by Democrats, it's been confirmed by independent verification, neither Trump\nor Giuliani or the My Pillow guy or any of Trump's other weird conspiracy theorist buddies\ncould find one actual piece of evidence to support their claims, contrary to what you've\nheard from this well last week.\nAnd here we are, six years later, still arguing about the 2020 election.\nAnd why is that?\nWell, Steve Bannon's on the record of saying, MAGA's core belief is they have to insist\nthat the 2020 election was stolen.\nAnd we see that in action.\nThey send in the FBI with the woman, uh, uh, uh, uh, uh, uh, uh, uh, uh, uh, uh, uh, uh,\nLord.\na woman who's in charge of intelligence down here stalking out in front of our election\ncenter. These are perilous times. These are perilous times. I don't know if the red lines\never going to be crossed for GOP members to say, you know what, I'm going to have to\nbreak with you on this one, honey. This is an invalid and inappropriate and illegal use\nof executive power.\nKeep on thinking about that, keep on looking at that behavior, state and local officials\nrun elections, not the president, not Washington bureaucrats, not law enforcement agencies.\nWe all know that.\nThere's a reason that they have unearthed the 2020 ballots of Fulton County and the next\nblow will be, don't wait till it's too late.\nThe hour is now.\nI yield the well, thank you.\nThank you, Senator.\nDoes any of the Senator wish to rise on a point of personal privilege?\nYou have before you a consent calendar or privilege resolutions?\nDoes any Senator wish to remove resolution from the consent calendar?\nIs there objection to the adoption of the resolution on the consent calendar?\nChair here's done, the resolution on the consent calendar is adopted.\nAre there any motions to withdraw and commit?\nMr. President, I move that Senate Resolution 563 be engrossed.\nSecretary Reed, the caption.\nSenate Resolution 563 by Senator Robertson of the 27th, a resolution urging the Georgia\nSecretary of State to immediately and fully comply with the request of the United States\nDepartment of Justice to securely produce Georgia's voter registration list and complies\nwith Georgia's obligations under the National Voter Registration Act, the Help America\nVote Act, and the Civil Rights Act of 1960 and for other purposes.\nMr. President, that completes the order.\nall right you beat me to it senator we have objection senator majority would\nyou like to speak to the motion you wave senator from the 41st would you\nlike to speak to the motion or the minority leader would you like to speak to\nthe motion you wave just want to vote it huh all right you want to do hands\nNo, you want to put it on the board?\nAll right.\nAll right, the motion is to the majority leader has moved that we engross SR-563.\nThere is objection to that, so we'll just put it on the board.\nAll those in the engrossment will vote yay.\nI'll oppose nay.\nSecretary, I'm not in the machine.\nAll in motion, the A's are 31 and the NA's are 21 and this motion has prevailed.\nSenator from the 25th for the purpose of your rise.\nMr. President, move the Senate bill 239 be recommitted to the committee on rule.\nHold on, hold on, hold on, Senator, just wait your turn on that one.\nLet's get this one through first.\nAll right, moving on to the rules calendar and now, Senator, we're ready.\nSecretary Reed, Senate Bill 239, please.\nSenate Bill 239, and by Senator's walkers of the 20th and others,\na bill to be entitled to an act to amend Article 1 of Chapter 18 of Title 43 of the OCGA relating to funeral directors and establishment and\nbombers and crematories.\nSo, as to remove the requirement that funeral directors be licensed in bombers to provide for\nrelated matters to repeal conflicting laws and for other purposes.\nThe Committee of the Senate on Regulated Industries and Utilities recommends that this bill do pass by substitute.\nWe're respectfully submitted Senator Cousard of the fourth district, Chairman.\nSenate Committee on Regulated Industries and Utilities offers the following substitute to Senate Bill 239.\nA bill to be entitled in act to amend Article 1 of Chapter 18 of Title 43 of the official code of Georgia annotated relating to funeral directors and establishment and\nand Crematory is so as to remove the requirement that funeral directors be licensed in bombers and for other purposes.\nSenator Williams of the 25th offers the following amendment.\nAmend the Senate Committee's substitute to SB 239 by replacing lines 14 and 15 with the following.\nProvide for responsibility of all funeral services offered at a funeral establishment,\nOrganic human reduction facility, or a crematory to change certain provisions concerning the deposition, deposition of cremated remains and for other purposes.\nMr. President, that completes the order.\nNow I recognize my favorite mortician from Baldwin County right here.\nThank you, Mr. President.\nYou know you're my favorite Lieutenant Governor, too.\nMr. President, I move that Senate Bill 239 be recommitted to the committee on rules.\nI Senator has moved that the Senate bill 239 be removed from the order and put back into\nrules.\nThat correct, Senator.\nYou more decisions, y'all are real, y'all are always the last ones to let us down, aren't\nyou?\nSo, would you like to speak to you motion, Senator, or you just, you know?\nNo, not at this time, thank you.\nWithout objection, without objection,\nthey will move it back to rules.\nSecretary Reed, House Bill 117.\nHouse Bill 117 by Representative Petra\nof the 160 CIS and others.\nA bill to be entitled to an act to amend a Article 13 of Chapter 2 of Title 26 of the official Court of Georgia annotated relating to food service establishments, so as to require notification of the country of origin of seafood items to provide for a definition to provide for related matters to appeal conflicting laws and for other purposes.\nThe committee of the Senate on rules recommends that this do pass by substitute.\nSenator brass of the six chairman.\nMr. President and the Senate Committee on Rules offers the following substitute to House\nBill 117, a bill to be entitled an act to amend Article 13 of Chapter 2 of Title 26 of\nthe official code of Georgia annotated, relating to food service establishment so as to require\nnotification of foreign imported shrimp to provide for related matters to repeal conflicting\nlaws and for other purposes.\nMr. President, that completes the order.\nThis is the infamous strip bill here today, huh?\nOh, wow.\nAll right, all right, all right, we're recognize my good doctor from the coast.\nMy favorite senator from Savannah, Georgia.\nGood luck senator.\nThank you so much, Mr. President.\nLet me just tell you, I am not here to talk about the Kennedy Center.\nI'm not here to relitigate, to reform.\nI'm not here to talk about the incompetence\nor maybe even criminal activity in Fulton County elections.\nBut let me tell you what I am here to talk about.\nWhat is affecting us here in the state of Georgia?\n77% of the shrimp tested in Savannah, Georgia\nwas imported shrimp, places like China, India,\nIndia and Vietnam where they grow these shrimp in ponds, swimming in their own\nfeces, given antibiotics and hormones. So in the state of Georgia, I'd native\ndomestic shrimp, called off the coast of Georgia, never has antibiotics, never\nhas growth hormones and are grown right here in the state of Georgia. And that's\nwhat this bill ensures is truth in advertising. All it says is that you must\npost by the shrimp whether or not or not whether or not if it is foreign\nimported shrimp or you can have a placard visible to your patrons there in the\nThat's all it does, and believe it or not, the Georgia\nRestorant Association has stopped their opposition.\nNow, why would they oppose such a thing like that?\nWell, I don't know, but I will tell you that our industry\nin the state of Georgia on the coast is better this year\nand last year than it was the year before.\nDo you think it has anything to do with the truth in advertising that is coming out about the shrimp in the state of Georgia?\nI think it does. Mr. President, I'll be happy to answer any questions relating to the shrimp in the state of Georgia.\nI think we're clear, Senator. No questions.\nWell, thank you very much. I ask for your favorable consideration for this matter for the state of Georgia and the shrimp industry.\nAll right, does any other center that was speak for against the measure?\nChair here is none.\nIs there objection to the previous question being ordered?\nChair here is none.\nThe previous question is ordered.\nQuestions on the adoption of the committee's substitute?\nIs there objection to the adoption of the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there objection to the Greens for the report of committee which is favorable to the passes of the bill?\nChair here is none.\nThe board of committee is agreed to.\nIs there objection to the main question being ordered?\nChair here is none.\nThe main question is ordered.\nThe question is on the pass of the bill by substitute.\nAll those in favor of the bill will vote.\nYeah, you pose nay.\nSecretary, we'll unlock the machine.\nis\nAll right, all the best of the bill, the yeas are 43, the nays are eight.\nBill Henry sees Ricks at Constituers of Majority is there for PASS.\nSix year will recaption of SR 563.\nThe Senate resolution, number five, 63 by senators Robertson of the 29th and others.\nA resolution urging the Secretary of State to immediately and fully comply with the request of the United States Department of Justice to securely produce Georgia's voter registration list and complies with Georgia's obligations under the National Voter Registration Act, the Help America Vote Act, and the Civil Rights Act of 1960 and for other purposes.\nThe Senate Committee on Ethics recommends that this resolution do pass by Senator Watson of the 11th Chairman.\nMr. President, a minority report has been attached.\nBring it on as the senator from the 29th, speak to the measure.\nThank you, Mr. President.\nColleagues, my time being in this body have yet to become surprised by the overreaction\nof small adjustments, yet to be surprised by the fear and trembling I see at times when\nwe have to address uncomfortable issues.\nAnd once again, it is played out exactly as I thought it might.\nThis resolution is very simple.\nIt's very clean.\nA lot of people have preconceived notions about me,\nabout where my politics is, and other things.\nAnd those who know me know my passion\nabout finding healthy mothers, healthy baby programs\nthroughout the state.\nThey know my passion about adoption.\nThey know my passions about foster care.\nThey know my passions about lowering taxes.\nand they know my primary passion about public safety\nand my primary passion about following the law.\nSo, and I know there will be caccles from the body\nof people who disagree and I've become accustomed to that.\nBut something else I'm accustomed to also\nis following the law.\nSeveral years ago, I had the opportunity\nto serve on ethics and we passed out SB 202.\nAnd as soon as SB 202 passed and became law,\nwhich to remind anybody, SB 202 was the voting legislation\nthat created the greatest turnout in the next election\nthat followed that than any other election prior to that.\nis the one that clarified the rules on what good voting\nis, what fair voting is, what transparent voting is.\nAnd not long after that was signed into law,\nI, along with 20 plus other colleagues,\nwere sued for passing SB 202.\nNot long after that, I received a telephone call\nfrom an attorney out of Pensacola, Florida.\nAnd I was told that this attorney had been hired to represent me and this lawsuit against\nSB 202.\nAnd this attorney told me, he said, Senator Robertson, I'm going to have to ask you for some\ninformation and it may be uncomfortable.\nAnd I said, what is that?\nHe said, I need all of your senatorial emails.\nI said no problem.\nHe said, I'm going to need all of your senatorial text messages.\nI said, no problem.\nHe said, I need all of your personal emails.\nI said, no problem.\nAnd he said, well, I'm going to need all of your personal text messages.\nAnd I said, no problem.\nAnd then I said, but wait, there is one problem.\nHe said, what is that?\nI said, you got to give me time to go to local department store,\nlocal electronic store, and buy an external hard drive\nthat is clean and never been used.\nSo I can download all of this information from my cell phone\nand from my computer and send it to you.\nAnd he got quiet, and I said, is that a problem?\nHe said, no, that's not a problem at all.\nHe said, just everybody else I spoke to\nwere a little concerned about that information getting out there.\nAnd I said, well, I'm not concerned about it at all.\nI grew up in law enforcement.\nI grew up in the courts.\nI understand what evidence is.\nI understand the requirements of the people I submit this\nevidence to protect what I submit.\nAnd I said, because you're going to go through all of my\npersonal and senatorial emails.\nYou're going to go through all of my personal and\nsenatorial text messages.\nAnd you're going to find nothing that this suit alleges.\nI said, but please never left any of the text messages\nfrom my wife to me on days when she wasn't really happy with me\nto get out into the public.\nAnd he assured me he wouldn't.\nSo I went and I purchased the external hard drive\nand I downloaded all of that information, all of that information.\nand I sent it to the attorney, because I understand the process.\nThere was no conspiracy theory.\nThere was nothing I thought that this attorney who I met,\nby the way, over the phone was going to do anything unethical\nor anything that would impair his licensing in the Georgia\nBar or the Florida Bar or any other bar,\nwhich he may have been a member of.\nbecause I understood the law, and if you read the resolution, you'll see that we are asking\nthat the Secretary of State provide the information in compliance with Georgia's obligations\nunder the National Voter Registration Act, the Help America Vote Act, and the Civil Rights\nAct of 1960.\nAnd if you read Georgia Code Section 21-2-225.1, if you go down to Section C, if you integrate\nthe definitions under 21-2-417, you'll see there's a section down there.\nHe says the information that's included in there, that any and all information relating\nto the birth dates or dates of birth to be exact, social security numbers, and driver's\nlicense numbers of electors may be made available to other agencies of this state, to agencies\nof other states and territories of the United States and to agencies of the federal government\nif the agency is authorized to maintain such information. And the information is used\nonly to identify the elector on the receiving agency's database and is not disseminated further\nand remains confidential.\nin Georgia law. It's really clear. As far as I know, the Secretary of State and I have\nnever had a cross word with each other. We've been in the room together. I knew him\nbefore he was Secretary of State. And what it says right here, if he were the Secretary\nof State saying I didn't want to cooperate, if he was the governor of Georgia and said\nI didn't want to cooperate, if he was the lieutenant governor of Georgia and said he\ndidn't want to cooperate, I would drop the same resolution. The law is clear on what\nwe're supposed to do. Now there's always going to be the politics that surrounds this. There's\nalways going to be those who go around and start conspiracy theories on the right, those\nwho start conspiracy theories on the left. What's funny is nobody will ever find a video clip\nthat they can play, showing me claiming that any election in Georgia has ever been stolen.\nBut they'll use that.\nThe first time I recall somebody claiming an election was done wrong or the ripper priorities\nis when a guy named Gore ran for president of the United States of America and it became\na big deal.\nAnd then after that, the next person I can recall is a former secretary of state named\nHillary Rodham Clinton that claimed there was election fraud.\nAnd then there was a lady running for governor of Georgia who lost and claimed that there\nwere improprieties and that there was possible fraud and elections.\nAnd then there was a guy who was the President of the United States and ran for re-election\nand he claimed that there was election fraud.\nThey're all in the same boat.\nThey're all there, but you know what?\nWe have laws we have to follow.\nWe have rules we have to follow in this state.\nIt's not personal.\nIt's not me against you or one party against another party.\nIs this uncomfortable?\nIt is for some.\nIs this necessary?\nWell, it depends.\nDo you want to do the easy parts of your job\nor do you want to do the full parts of your job?\nOur job is really simple.\nWe have a state constitution.\nWe have laws and rules that we have to go by.\nWhether we're comfortable with a law or not,\nwe don't get to deviate from it.\nBelieve me, I put handcuffs on many people I weren't comfortable with.\nAs I'm sure my friend from the 30th has also.\nWe didn't love the law we had to enforce every time we enforced it, but you know what?\nWe enforced it because this body or the federal government put laws down and said that.\nAnd so this resolution is very, very simple.\nLet's ask in the Secretary's State to do what other states have done and that is fully\ncooperate.\nOther states who felt uncomfortable about their information, they sat down at the table\nand they wrote and agreed on MOUs, they signed those MOUs with the Department of Justice\nand the information was handed over.\nI've heard several people talking about how their information is private.\nIf you have a Social Security number that was not given to you by the federal government,\nthat's a bad news for you.\nYou don't have a legitimate Social Security number.\nYou can't buy them.\nYou get them through a process.\nUser that process is birthed here in this country.\nIf you think your driver's license information is not out in the real world, then I've got\nsome cold news for you.\nIt's out there.\nAnd I can tell you, it's inside of state computers, inside of GCIC, it's inside of federal\ncomputers, inside of NCIC, your driver's license information is out there.\nAnd I can go to the white pages anywhere on internet and I can find out where you live.\nNot only do I find out where you live today.\nI can find out where you live 10 years ago and that'll take me about four and a half\nminutes.\nI can tell you what your birthday is.\nIt's not complicated.\nAnd this information I'm getting from you and about you is not information that is\nprivy to me as a peace officer or privy to me as a state senator.\nThis information is out there for everybody.\nI have friends that run private investigative agencies.\nI can give them your name, a partial of your name.\nAnd with short period of time, I don't know what all your vehicles,\nthe license plates on all your vehicles are.\nI don't know what the Venn numbers are.\nPeople steal identification through banking information.\nThey steal it through when we go in and we put our debit card in or our credit card\ninto a site where we were attempting to buy something and we don't realize that we're\nbeing fished for that information.\nThat's what you have to worry about about identity theft.\nAnd everybody in this room most likely has experienced some type of identity theft.\nWhich shocked me when somebody tried to do it to me.\nI don't know why anybody else would want to be Randy Robertson, but they made that attempt\nand luckily it was called in time and we were able to stop it.\nIt's not because I was willy-nilly with my personal information that we're talking about\nhere today.\nSo while many want to make this out to be some kind of battle for somebody, I want\nto hit you with a shocker.\nI love the pledge to the Georgia flag.\nMy loyalty first lies with the state of Georgia.\nPeople want to label me something, had somebody come up today and ask me if I was a maga.\nI don't think so.\nI think I'm a conservative state senator in Georgia who is a member of the Republican Party\nwho is a law abiding citizen who believes you stand up for what's right.\nwhat's for what's comfortable. If you want to stand up for what's comfortable then\nplease I heard somebody say it before. Don't join the team with me in the\nSenator from the 30th because people looking for comfort don't do that.\nPeople wanting to follow law do that. Retotal 21 and tell me what you think but\nBut today, all we're doing is urgent and elected official to do what Georgia law says he\nshould do.\nThat's all.\nIt's that simple.\nDon't make it more than it is.\nBut sadly, I know some will stand on the stage, built out of political wood, as they\nThey look to sell themselves, to sell a policy, or to sell the hate for a man that they've\nnever met.\nAnd with that, Mr. President, I yield the welcome.\nAs soon as you're able to bring it out as the center\nfrom the 22nd.\nThank you, Mr. President.\nI understand opposition to this particular resolution.\nI will say this, there won't be any cackling in this situation\nbecause it's a very serious moment for Georgia history.\nContext matters with this resolution.\nOn one level, the resolution may look clean and pristine,\nbut context actually matters.\nSo let's kind of look at what that context is.\nIt's two levels to it.\nThe first is the stated reason for the resolution.\nIt's basically if you break it down,\nis what the Department of Justice said.\nThey wanted the information forward,\nwhich is to maintain voter rolls.\nSo let's deal with that first.\nSo initial reason given by the Department of Justice\nwas to maintain voter rolls and voter rolls,\nvoter lists, et cetera.\nMake sure that the maintenance of the rolls are correct.\nAnd that is basically what this resolution is trying\nto develop.\nProblem in this context matters.\nAnd there was a recent court case that basically\nsaid, federal court, that said that this is not true,\nthat what the Justice Department is saying\nbasically a lot, KC United States versus Weber, with the Department of Justice\nadmitted, this just happened in 2025, admitted that they were handing over the\nvoter information to the Department of Hand Homeland Security, and that the\nrequest of the Justice Department mirrored similar requests that had been\ndoing by the Department of Homeland Security. And the court stated very bluntly.\nThe court does not take lightly the DOJ's\nassociation of its true motive in the present matter.\nThe actual law to palm by the Justice Department,\nmeaning the Civil Rights Act that is in the particular\nresolution, is to protect voting rights.\nIf the DOJ wants to instead use those statues for more than\nthe State of Purpose, circumventing the authority granted\nto them by Congress, it cannot do so under the guise of\nto protect your investigative purposes.\nAnd that is what the context is.\nSo this resolution may seem clean and pristine,\nbut when you understand that the DOJ themselves\nsaid we're handing this information over\nto the Department of Homeland Security.\nThat comes from them in a court case.\nAnd that a federal judge then said,\nbasically what you're telling us,\nall of this stuff about pristine maintenance roles is alive.\nThis is court. This is law. Second aspect of the context is what happened last week.\nSo now we're about to pass something which is basically based on a lie because we know\nthat it's based on a lie because they're going to hand this information over by their own\ntestimony over to other organizations, other agencies. It's not about voter maintenance.\nWe already know that's true. Now based on what just happened in Fulton County, this resolution\ntakes even greater context because now it is the context of actually trying to shield\nwhat really is a true goal of this administration which we understand is to undercut the 26 midterms\nand potentially even once again try to take those. The truth of this intent has gone over\nmany times but I do want to point out one story. In other times 20 years ago it would have\nbeen a major news story for years to come,\npossibly would have made a movie about it.\nBut in our click days, it kind of goes, comes and goes.\nThe scene is January 4, 2021.\nIn a real respected retired judge, Judge Lutick,\nwho is now retired, is at home.\nHe had been on the short list by George,\nbut President George W. Bush, was beaten out\nby Samuel Alito to be on the Supreme Court.\nSo a very serious person.\nHe receives a phone call from Vice President Pence's\npersonal attorney.\nAnd he's asked immediately, what do you think about John\nEastman?\nLudic knew that John Eastman was one of the president's lawyers.\nHe was understood constitutional law.\nAnd he said, well, basically, why do you ask?\nAnd he just told that Eastman is now written and orally\nstated that the vice president does not\nhave to certify the election.\nLudic said at that moment, he knew\nhe was facing a signal moment in history.\nHe immediately tells Penn's attorney\nthat no Penns must certify because the law was clear.\nThey hang up.\nThe attorney calls back.\nBut this time, with a sense of urgency as in his voice,\nit says you have to do something either morally or in writing.\nThey go back and forth and finally,\nit's determined that he would do in a tweet thread,\ntalking about this day and age, of course,\n20 years ago to be in the op-ed.\nbasically was a op-ed within tweet thread,\nbasically instructing Vice President Pence\nhe must certify the election, because the law was clear.\nVice President Pence, when he wrote a three-page letter\nsaying why he had to certify the election,\nhe referenced Judge Ludic's opinion, stating,\nbased on Judge Ludic, because everyone in conservative circles\nknew who he was, he carried weight.\nBased on his analysis, I have to certify this election.\nThat's how close we were.\nThat's how close we were, a phone call.\nThe next day, Vice President Pence called Judge Lutey\nthe two had never talked.\nThe first time they ever talked, and he called him and thanked him.\nA single moment in history, two men who had not spoken\ncame together to help save our republic.\nTwo men who are probably would not have\nvery little in common with politically,\nbut apparently we have a lot in common\nof wanting to actually make sure\nthat the American experiment actually succeeds.\nAnd so today we're facing that signal moment in history.\nThis is not a meaningless resolution.\nIt is a statement whether you truly believe\nin our democratic values that we have struggled to obtain\nand struggled every day to keep.\nWhat America could be, she has not been,\nbut we keep trying.\nThis resolution has greater meaning\nbecause of the context to it.\nBecause it is given in the Department of Justice,\nwhich a federal court has already said is lying,\nit is given in the Department of Justice\nwhose persons in that administration\nsupport somebody who literally tried to take an election.\nAnd if it was not before a certain thing,\none of those being a tweet from a federal judge,\nthat might have actually happened.\nIt has given them cover.\nAnd the context of today says that this body would agree with it.\nAnd what's interesting about all of this is within this American experience and many\nof my colleagues came up last week, we may not have a many come up today, but many came\nup last week.\nWhat's interesting about this when we talk about our values as America, those who come\nup, many are African-American, many are women, and many are LGBTQ and African-American.\nThey have received less from this nation than any other group, but historically they\nare always the ones that discuss and hope that the American experiment will actually succeed.\nThey are the ones who are actually consistently fighting to make sure that this country\ncontinues to go in direction that it should.\nWhat also is interesting is where you stand today.\nJudge Lutit was appointed by President Bush.\nWilkinson, which I talked about last week, was talked about the fact there would still\nbe time to save our democracy, was appointed by President Reagan.\nBoth have sounded the alarms that are very democracy is at stake within this administration.\nBut look who there were following.\nOne appointed by Reagan, one appointed by Bush, and although I probably disagree with Reagan\nand Bush on almost every political issue, I don't think there's any doubt that in their\nheart they wanted a better America.\nwe could disagree how to get there. Today, in your signal moment, you are choosing to\nfollow a narcissist, a person who cares nothing about this nation, person who knows nothing\nabout this nation, person who's never read anything about our institutions and doesn't\ncare. So we're ludic and Wilkinson followed Bush and Reagan, real patriots, even though\nyou disagree with them, real people who believed in America, even though you disagree with\nthem. You have chosen to follow somebody who wants to burn it all down. Today is your\nsignal moment and that is the choice in the path you follow. Congratulations. Without\nout of your world.\nSeniors yielded, recognize the center from 26.\nThank you, Mr. President.\nI wish I could speak as eloquently as the art deleter talked about this.\nhistory teaches us what we've been through, what we've been through. Let me tell you a story.\nWhen I was 13 years old and the neighborhood I lived in, how were you 49 ran around it?\nWe used to get a basketball, and under the street like we play full squad, get some sand\nand draw full squad, and if you missed hitting the ball in the squad, then the next person\ncame up.\nWell, I got picked up and accused of throwing a brick through somebody's window.\nI had a pair of cut off silk circle pants that were blue and white.\nThe folks said that the person that threw the brick had on striped pants.\nIf you'd seen the pants in the light, they would look like they were white.\nThey put me in the back of the car.\nI'm 13 years old, little guy gets out of the car,\ngot in the back seat of the police car,\nput a gun in my head.\nCall me everything but the child of God.\nThey stopped me out of hand there and there,\nwhich was about a mile from where I lived.\nThere was a white crew in there.\nWe used to stop in there and buy snacks and stuff\nand don't try to watch.\nHave gone with terrible gun smoke.\nA black school teacher was in the store.\nWalked out and saw me in the car and scared out of him\nbecause she was scared of the police.\nThe white clerk that was in the store came out and looked in the car and saw who I was\nand told the police, I know that boy here in his family come by the store all the time.\nThe police made the guy get out the car and they took me back to on the street where\nI was, but while I was sitting there crying, my mom and dad had run by the store in the\ncar running seven days a month now, trying to find their child.\nIn 1967, I left for your predominately black high school and went to a school called\nthe Near High, which was a military school.\nAnd when I went to practice, I went off a quarterback and everybody used to park on the side\nof the street watching football practice to see whether or not I could throw a football.\nThere seldom played quarterback, I played everything but quarterback and did it pretty good.\nI left high school in 68 and went to a college called Tuskegee Institute.\nI wanted to play football.\nI used to watch the Lenin movie with the Baltimore coach,\nand he will wear spats.\nAnd if you don't know what spats are,\nthey tape your ankle and the shoe together.\nAnd you look mighty sporty when you're running in the ball\nand you're going to touch that.\nWell, when I went to Tuskegee, I taught myself\ngoing to play quarterback.\nThe trainer for the football team was my homeboy.\nAnd he told me, he said, man, don't do that.\nThe coach told me to pick up your stuff at the practice.\nI went to the coach and said, coach, I can't go back on him.\nHe said, what do you mean?\nLook, I said, I can't go back.\nHe said, what were you going to do?\nI said, let me play defense and back.\nWe had a star running back by the name of Ralph Jenkins, all\nS.I.C. He had a pulling guard by the name of truck Robinson\na Mississippi way to about 260 and ran a 4-7 for them. That day at practice they ran\na suite. I hit the guy that was the way I had 260 spending the ride and hit the running\nback and drove him over to the bleachers. We used practice on the baseball field saying\ncoach jumped up in the outblown and said man you're about to kill my running back. I said\ncoach, you finna cut me. He said, come up now for that practice. I went up to his\noffice and he gave me a full ride to play football. While I was in school in 1969, I\nhad a professor by the name of Nenjaka. He was an African. And we had an\nan assignment to go register black folks in Barbara Connier, you follow Alabama. And while\nI was down there trying to get folks to sign up and register to be voters, somebody\nshot a gun. They were in a pickup truck. Almost got looped. The book shots and stuff hit\nthe side of the house while I was standing up there on the porch.\nGod back the Tuskegee.\nAnd we were having elections in Alabama.\nThere was a guy by the name of Fred Gray, who was the lawyer.\nAnd there was a guy by the name of Thomas Reed, who owned what we call the chicken coop.\nWe used to go in the middle of the night to get some chicken and come back to the dome.\nI saw a book and the people who were voting, some who were 100 years old, I took the book,\nput it up on my coat and went back to Tuskegee and we had them to look at it and so we had\na special election and read ran as an independent one so they became the first two black state legislators\nin Alabama.\nNow, I say all of that to tell most of you,\nthe thought of my little finger will brush your head\nwhile I don't.\nYou come to Atlanta, Georgia.\nFBI, take all the vote of the list\nbecause the president said he won the election in Georgia.\nAnd had it not been for the phone call that the Secretary of State recorded, he lied on him, too.\nLadies and gentlemen, we've got a president that a lot of you in here support.\nYou don't see it out loud.\nBut you support him because he couldn't do what he's doing unless he had your support.\nAnd so what I said, the men of you get some intestinal fortitude.\nYou don't have to be a Democrat.\nYou work.\nHis money don't affect you.\nYou send him money.\nThat's how he win the election and pay all the lawyers that he's got defending him.\n155's. He's smart now. He do everything and start something way in the news every day\nabout something else except the Epstein 5. Now most of us in here are soon what Trump\nalready know. Messing with them young girls. And many of you in your got daughters. It had\nit been your daughter. I know what you would have done. You'd have had this here. Here's a\ncriminal, being convicted and ran as president to stay out of jail. To stay out of jail does\nnot follow the law. I say this everywhere. That is to intimidate folks and keep them from\nvote, and change the narrative of the Epstein files for something else. But he is a man\nthat cares nothing about the law. The Justice Department does what Trump tell them to do.\nLadies and gentlemen, I'm a Democrat.\nI ain't no question about it, but I do have some dignity.\nAnd as I said before, Donald Trump gets into the pants\nthe same way David Lucas gets in here.\nOne leg at a time.\nBut yet, it's still you come and bring this.\nbecause he's trying to prove at the last election that he\nloves was a fast.\nSecretary of State, I get a governor credit.\nThey said that was nothing wrong with your elections.\nThen Trump talked about the governor and his wife.\nHe talked about her.\nBut what we got to do in this body,\nin this body that I serve in with you.\nSo you can be ever so smart,\nbut you can't pass a thing unless you got some friends.\nin the body. What we're about to do is a lot done Trump to be Putin. When you talk about\neye-sagents, killing folks, that's what Putin does when he has opposition. He take you out.\ny'all remember the guy that was going toward Russia and Putin stopped him and the next thing\nyou know he got blew up in the airplane being a dictator is what dictators do. If it didn't\nmany of y'all forgot about January 6th. I saw it on television and you trying to tell\nme I didn't see what I saw. And then when he becomes president, he pardoned all the\nthugs because they did his bidding. And yet y'all bring this to this body about give\nall the information. For what? So they can come and intimidate folks, get their names,\nbecause that's what they do. You're scared. Stop being scared. If you're scared, y'all\nyou're not the run for office. We need folks who will stand up. That's why you got\nprotests all across the country about this president. He's a criminal. That's\nwhat he is amongst other things that they keep talking about. And he's in it. They\njust redacking everything where his name come up because he the head of the\nfather. Well, ladies and gentlemen, let me say this to you. Get some goods. Get some\ngood. Do the right thing. That's how you get elected. Many are all aware about the coming\nup elections and how folks gonna vote. But most of them think it like me. I don't care who\nit is as long as it's a Democrat. You find that out in the public service commission\nelection. You know, we went to court on that and the judge ruled against us because we\ntried to draw districts on that. And they say why? But two Democrats won. That I'll\ntell you and send you a message. We're tired. And we're gonna fight. We're tired. And we're\ndon't fight for what's right. And so to all of you and all my colleagues in here, get\nsome instant, get some open year. Don't let Donald Trump call you and tell you to do\nsome of you ask them, hi, hi, get some intentional 42, represent the people that you are elected\nby. They are concerned about the grocery bill. How they going to pay the household, how\nThey're going to pay the cardinal.\nHow they going to see about the gentleman.\nAnd here we are in the Georgia Senate,\nplaying partisan politics and acquiesce to a tyrant,\na dictator, a person who doesn't even care about the law.\nHe's trying to see how far he can go, and what you're going to do about it.\nAnd that's the reason you see all these protests across the country, across the country,\nnot in a little small rural country, but in big cities, little cities, folks who stay\non the ocean, folks who stay at the Great Lakes, they are tired, and they're telling you\nthey're tired because every time you see you, the majority of the folks in the protest\ndon't look like me.\nThey look like you, the majority of you.\nSo you ought to get the message when you come time for re-election.\nDon't come up and tell the folks what you did when Trump said, jump, you jump.\nbe men and women with some intestinal fortitude to do the right thing.\nAll right, Senators yielding.\nWe're going to have Senators from the second.\nThank you, Mr. President.\nThis morning, colleagues, we've got Senate Resolution 563, which is an urging resolution,\nand I would like to highlight that that's all it does is it urges, but I want to talk\nfor a few moments about what it's actually urging.\nIt's urging the Secretary of State to comply with the quest of the United States Department\nof Justice to securely produce George's voter registration list and compliance with George's\nobligations under the National Voting Voter Registration Act and the help of\nAmerica Vodac and the Civil Rights Act of 1960 and for other purposes. But the\nproblem is what is urging and saying in one part of this resolution is the\njuxtaposition because the resolution is asking the Secretary of State to\nviolate the law. Why? Because in OCGA 21-2-225 and OCGA 21-2-219 it\nrestricts how voter data and information is to be shared.\nAnd I've sat in ethics committee meetings and been at 7 a.m., they've been at 5, they've\nbeen at 7 p.m., in fact, Ms. President, I got promoted on the committee and showed up\nto be the secretary.\nAnd I've been in these hearings and understanding that Eric and how we maintain lists and one\nof the reasons we don't maintain our lists with the state of Florida is because they've\ngot a full sunshine law and that they transmit their voter information by not\nobscuring the Social Security numbers but by displaying those Social Security\nnumbers. However, Georgia law does not allow us to share information in that\nmanner. And so since we can't share information that's why we don't use the\nstate of Florida to maintain our voter roles and compare our data to theirs\nbecause of how we protect folks information. Now when we talk about this\nresolution asking the Secretary of State to comply, well, we'd have to change state law\nin order for that compliance to occur. We'd have to allow for the unredacted version of\nfolks personal sensitive information to be made public. And I don't know about you, but\nI've got information that's online, but I don't want my social security number to be online.\nI don't want my information in the wrong hands because it's your personal information.\nSomebody can buy house, they can take out a loan, they can do whatever they got your\nSocial Security number.\nBut when we talk about how we access this information\nand how we should share,\nthen maybe this body should have prescribed the man\nin which we would determine how we would do that.\nBut then I also read in this resolution\nwhere we talked about the NVRA and the HAVA\nand that it states the responsibilities.\nI wanna be clear colleagues, the NVRA and the HAVA\ndo not give the Department of Justice\nAnd unlimited right to demand full vote of files and any format at any time.\nAnd so now we say the Georgia Secretary has refused to comply with multiple requests\nfor this information and full, and that is absolutely correct because he is abiding by\nGeorgia law.\nAnd so refusal to comply is not because somebody doesn't want to comply, because we have laws\nthat say you can't do that.\nNow when we talk about how folks break laws and how things go, and if there was so corrupt,\nwell, we spent a lot of time investigating, finding wills, but we didn't spend any time\ninvestigating Brad Raffensberger.\nWe could have done a special subpoena the same way you did there if it was serious enough.\nWe've had time to do this since 2020 if we were serious about it, but this is nothing\nmore than smoke emirals to make a political point that does not need to be made, but\nis about protecting folks' information.\nAnd I want to be clear, the federal government does not run election\nadministrations, neither does the president, states run elections.\nAnd if we were serious about how elections would be running the security,\nthen we wouldn't have an unelected, unaccountable board making decisions\nabout elections.\nWe don't put people on the pension board that can't count.\nSo why do we have people on the election board that don't know anything\nabout elections and how to administer them,\nhow the process should work.\nIf anything, we should have registrars\nand county boards of elections to be on the board,\nto go through the technical intricacies\nof our voting system if we were serious about it,\nnot political pointies, a hack job,\nbut this unelected, unaccountable board.\nAnd if we were serious about it,\nwe would put them on the ballot then.\nWe would make a constitutional amendment to empower them\nbecause right now, in a little small book on my desk,\nElections and the manner in which the information is tabulated and process comes to the secretary of state\nThat's a constitution officer and I read in that same small rectangular book that said the\nSecretary of State was a constitution officer not under the jurisdiction of this body\nBut this urging resolution is just theater and performance at best and so while we may want to\nUrge the secretary of state so I ask you the question if you vote yes on this are you urging the secretary of state the violates George\nBecause that is the question that I'll leave you with and that's the juxtaposition of what is absolutely fundamentally right and what is fundamentally wrong.\nAnd Mr. President's I year the well I'm concerned about the soul of America and the soul of our democracy but I will say this.\nWhat I think of where we weave when we seek to deceive and what that Mr. President I year the well.\nAll right, Senator from Sega, I don't worry about your soul, I can tell you that.\nStanley, you almost went to preaching on this right there, I like it.\nWe're going to have Senator from the 6th.\nWell, Mr. President, ladies and gentlemen,\nI ain't no preacher.\nAnd I don't have help to write speeches, so I pulled out my little AI app, and I put\nin, write me a two-minute speech on accountability versus hypocrisy.\nIt was interesting what came out, very interesting, I'm going to read it to you, it's so\ninteresting. It starts with ladies and gentlemen. Today I want to discuss the\ncrucial contrast between accountability and hypocrisy. Two concepts that\ninfluence our personal lives, our workplaces, and society as a whole.\nAccountability is the foundation of trust and integrity.\nIt means acknowledging our responsibilities\nand being answerable for our actions.\nWhen we hold ourselves accountable,\nwe foster an environment of honesty and growth.\nFor instance, a leader who openly admits\na project failure not only gains respect\ntype, but also encourages their team to embrace transparency.\nThis creates a safe space for everyone to learn from mistakes and contribute to success.\nIn contrast, hypocrisy, it undermines trust, it erodes relationships.\nIt's the act of claiming to uphold certain values while failing to live by them.\nof a public figure, now I've lived a little bit of this, I'm going to admit to that.\nThink of a public figure advocating for law enforcement while engaging in harmful rhetoric\nover previous weeks, months, and years toward law enforcement.\nOr telling my party we should be holding our party accountable, yet not word, one word\nfrom them about three house members from their party being investigated and charged with\npandemic and unemployment for all.\nAnd here we are today, Republicans holding our party accountable.\nWe're doing what you've asked us to do, but that's still not good enough.\nThis misalignment of ideas leads to disillusionment and cynicism, damaging credibility and discouraging\nthose who looked up to them.\nThe impact of accountability versus hypocrisy extends beyond individuals.\nIn our communities, accountability can drive social progress while hypocrisy perpetuates\ninjustice.\nleaders who promise reforms but fail to deliver create a disconnect that\nbreathes distrust among citizens. So how can we navigate between these two?\nSelf-reflect. Regularly assess our actions against our values to encourage\nopen dialogue, create environments where people feel safe expressing their\nthoughts like we are today. Lead by example, model accountability in your own\nactions. In number four, demand integrity, advocate for ethical practices and\nchallenge hypocrisy. In conclusion, embracing accountability and\nand cultivates a culture of trust and connection,\nwhile hypocrisy leads to disconnection.\nTogether, let's commit to being accountable\nand making a meaningful impact in our lives\nand in our communities.\nNow that was all done, probably stored in a data center\nthat may or may not get a tax credit.\nLadies and gentlemen, today's about accountability.\nIs it a statement?\nYes, it's a statement.\nIt's a statement about holding each other accountable,\nno matter what party.\nWhat is wrong with that?\nThere was nothing wrong with it last week.\nThere was nothing wrong with it the week before,\nand there's nothing wrong with it today.\nThank you, Mr. President, I yield well.\nAll right.\nThank you, senator Reagan-Eyes.\n14th.\nYou have to mind what you report, Greg.\nOkay, well then my own report should come after.\nIt's my turn.\nI can't wait.\nI'm going.\nYeah, I'm going.\nIt's coming from thirty-knife.\nOkay.\nThank you, Mr. President.\nThank you, Mr. President, and good afternoon again, colleagues.\nSo I rise to speak in opposition to SR 563, and I do so with seriousness, because this\nresolution is being offered at a moment of real uncertainty and heightened concern.\nThis resolution is presented as a review of voter rolls and election records, and let\nLet me say from the start that maintaining accurate voter rolls is important.\nConfidence in our elections depends on clear, transparent, and lawful processes for list\nmaintenance.\nAnd Georgia already has those processes.\nOur state has a listing laws that govern how voter rolls are updated, how inactive voters\nare handled, how challenges are reviewed, and how local election officials manage those\nresponsibilities.\nsystems operate every day under state law, under federal law, and under established procedures.\nSR563 does not improve those systems.\nIt does not propose new standards.\nIt does not add resources or clarity to the work local election officials are already\nrequired to do.\nInstead, it layers on an additional political exercise that duplicates processes already\nin place and ignores allowing current questions to proceed through the courts.\nAnd colleagues, we cannot ignore the context of last week.\nNot only am I a resident of Fulton County, but I serve as the chair of the Fulton County\ndelegation in this body.\nReports of the FBI activity connected to the Fulton County elections hub and offices\nhave raised serious procedural questions, particularly when materials are removed from\nlocal custody and taken out of the control and state of the officials responsible for\nadministering our elections to who knows where.\nWhen records, equipment, or voter files are seized in bulk, 700 boxes at a time, issues\nof chain of custody, handling, and access are not minor details.\nThey go directly to transparency, public confidence, and the reliability of any conclusions that\nmay later be drawn. And I want to pause here so we can remember that Georgia has dedicated\nprofessionals whose job it is to maintain accurate voter lists, Republicans and Democrats,\nlawyers and administrators, career civil servants who do this work quietly every day. The processes\naren't glamorous and they don't make headlines, but they are how elections actually function.\nAnd those professionals need stability and clarity, not additional political crossfire.\nIn that context, this resolution is simply not the right tool for this moment.\nIt asks this body to conduct a parallel review of voter rolls at the very time new uncertainties\nhave been introduced through the actions of the DOJ through the FBI, not by evidence presented\nto us, but by the manner in which those materials were removed from local control.\nOversight has a role, but it must be practical and forward looking.\nThis resolution does not clarify what happened last week.\nIt does not resolve the questions created by those actions, and it does not strengthen\nconfidence in how voter lists will be maintained going forward.\nInstead, it adds additional political heat\nto an already unsettled situation\nwithout improving transparency, accountability,\nor election administration.\nAnd I'll add this.\nIt also does nothing to address the issues people\nare dealing with right now.\nWhile we debate processes that already exist,\nthe people we represent are living in the present.\nThey are facing higher grocery prices,\nrising rents and mortgages, escalating insurance costs,\nHealth care that's harder to access,\nchild care that feels out of reach.\nThey are asking us plainly to focus on affordability\nand stability in their everyday lives.\nSR563 does not help address those concerns\nand given the unresolved questions raised\nby recent actions of the FBI,\nit does not provide a constructive\nor responsible path for oversight at this time.\nLet the courts who are already working\nthrough these decisions, figure it out, and do their work.\nFor those reasons, Mr. President,\nI do not believe this resolution moves the state forward\nand I cannot support it.\nThank you.\nI yield the well.\nThanks, Senator.\nRecognize Senator from 37th.\nThank you, Mr. President of the Senate, rise today in support of Senate Resolution 563.\nAnd I want to echo the words of the senator from the 22nd who said that context matters.\nContext doesn't fact matter.\nAnd what this resolution is about is about transparency.\nThe author of this resolution stood here about a half hour ago and talked about how important\nit is to share everything he shared, a personal example of how under investigation with a broad\nnumber of people handed over everything, even personal messages, he has nothing to hide.\nLadies and gentlemen, I propose that Georgia should have nothing to hide and when this\nresolution we're making sure Georgia hides nothing from full public transparency.\nI personally stand in a place, and I'd like to thank Vice President Mike Pence for his\nbold and stand on January 6, certifying the 2020 election.\nThat's where I stand.\nI stand with Vice President Mike Pence, because given the information they had at the time,\nthe time ones they had to certify election, that was the bold high integrity move.\nI stand there with many Republicans in making that statement.\nwhere I am today, with integrity and transparency.\nBut I stand in support of Senate Resolution 563 because this is a resolution truly about\ntransparency.\nNow those who are watching this online or here present with us in the Senate Chamber have\nheard some attacks on this, you know, the senators can bring their own perspective and\nthey would vote their conscience as they see it.\nIf you read the words, the words on the page of Senate Resolution 563, this is a resolution\nof transparency.\nNow there may be an effort to twist and contort what that all means.\nThere may be an effort to try to reframe this through some other words.\nDon't be deceived by that, though, read the words on the page.\nAnd read the efforts of this Senate and asking our Secretary of State to share information\nwith federal investigators.\nHe should do that because I asked the question.\nIf we have only valid voters in our system,\nwhat's there to hide?\nIt's very important.\nAs a state, if we have voters in our system\nthat are not valid, who wouldn't want to know that?\nWould interests not want to know if there were voters,\nThey're invaledly registered to vote and voting in our state.\nWho would want to hide that?\nWho would stand to gain from that?\nThis resolution makes it clear for everybody that Georgia has nothing to hide.\nLadies and gentlemen, one of the most important principles of our election system\nfrom our perspective is the state control of elections.\nState control of elections.\nI reject the premise of the federal government ought to have to come in and take over our\nelections. It's an important part of our compound republic. Why is this resolution so important\nto that? Because if we can't share openly what we do here, if we can't share our voted\ndata openly for anyone in the nation to inspect that has access to this information, as the\nauthor said, this is not being shared to the public. This is going to be law enforcement\npeople who will guide, who will guard personal information, so security numbers. It's not\nconcerned about that, they've already got that information. But if we can't share\nopenly our voter data, I fear that someday some real tyrant, some true tyrant's\ngoing to come in and try to nationalize our election system, saying the states\ncan't be trusted, the states can't maintain their local lists, and somehow\nsomeday the federal government might come in and in a true active tier and you\nto try to take elections away from our states.\nIn my opinion, in my belief, to maintain the integrity\nof state control of elections, having transparency\nof who a registered voters are is paramount\nto maintaining that state level independence.\nThat is paramount to me, and that's paramount\nto the voters of Senate District 37.\nLadies and gentlemen, this is an issue\nof integrity of voter data.\nList maintenance is in question and I think George has nothing to hide.\nI ask every member of this body to stand with transparency, to stand with the\nperspective of we should share our voter lists with valid government entities to make sure\nthere's nothing wrong with the data because we have nothing to hide.\nshare the voter list. We have nothing to hide.\nShare the Epstein list. We have nothing to hide.\nWe can stand together. This legislature ought to be about sharing information publicly.\nBecause if we care about the voters back in our district, they want to see transparency.\nThey don't want to have people trying to hide the ball, trying to hide behind their positions and point fingers about things.\nThey want transparency of public voter data.\nbecause if voters are registered to vote in Georgia,\nthey're not valid, their vote is undermined.\nTheir vote is compromised.\nFriends, this is a voting rights state.\nThis is a state we've cared deeply about,\nthe integrity of our elections we've had.\nWe've had a lot of attention over the years.\nI'm proud that this Senate stands\nwith openness and integrity,\nnot trying to hide the ball from anybody,\nnot trying to play games.\nAnd I think the Secretary of State\nshould follow federal law, this is not a federal takeover.\nIn my opinion, transparency protects the long-term integrity\nof state control of our elections.\nAnd that's why Senate resolution 563 stands\nwith transparency and integrity.\nThat's what I stand for.\nThat's the context in which I support this.\nNot the bogus narratives that you've heard\nfrom some of our members.\nThat may be why they're opposing it,\nSo the reason I support it is for transparency so that all voters can see that the work\nGeorge has been doing and that we're committed to an open fair election system for all.\nNo matter where you come from, no matter what you look like, no matter what your zip code\nis, or no matter who you vote for, without Mr. President, you'll be well.\nAll right, thank you Senator, Senator from the second, what purpose do you rise?\nIt's such an inquiry.\nMr. President, did the heating bill suffer laps and appropriations for anything the\nSenate of the 19th may or may not have done in this ice box in the chamber?\nSo you're seeing your little cold, huh?\nFrostbitten.\nFrostbitten.\nWell, the senator from the 19th is known for being a co-hearted individual, so he might\njust turn it on the temperature, thermostat.\nServing from the 9th, and then we'll have the minority report, and then hopefully we'll\nfinish up here.\nThank you, Mr. President.\nI rise today in opposition of SR 563 and echoing some of the sentiments of my colleagues\nhave already brought forward to this body.\nHere we are on legislative day 10 and this is where my Republican colleagues want to waste\ntime. While Georgians are waiting for us to prioritize things that really matter, while\ntheir needs lay by the wayside, this is day 10 of what we're dealing with, not any real\nlegislation, an urging resolution, which is not binding, by the way.\nNo legislation to move the needle on any of the priorities that Jordan's care about.\nI know this wasn't on any top of the list that my constituents are asking me for.\nLet's follow the path here.\nIt's been happening since 2021, the set up\nto interfere with our elections here in Georgia.\nAs we know, Georgia, all eyes are already always on us.\nClearly, we run rent-free in Trump's mind.\nBut let's follow this path.\nIt was to first Trump asking our Secretary of State to release those voter data.\nWas that last month?\nIn this week, we had the raid, I mean last week, we had the raid on the Fulton County election\noffice.\nPrior to that in 2021, we had a bill, a voter registration, I mean, a voter bill, I call\nit an anti-voting bill, that gave power to an election board of a majority of Republicans\nto basically go after unperforming counties, county elections, county election boards.\nSo it's no coincidence that now we have a raid last week on fooling county.\nWe don't know, we know the budget data was taken, but why was it taken, it wasn't about\ntransparency called everybody off guard so why so I want y'all to follow here was\nhappening here's the setup to start interfering in Georgia elections and\nRepublicans in this body should be concerned they want to sit up here and talk\nabout transparency and we need to trust you know our election process but right\nhappening in our faces. The Trump\nAdministration is setting up to interfere with our 2026 elections. Don't get it, don't get swayed by that.\nSo we have this petty resolution that we're dealing with today. And I want to be clear,\nthe Secretary of State is doing his job. He's protecting our data. He said no.\nHe's an elected official that is given the authority to protect our data and run our elections.\nAnd he's remained clear that that is exactly what he's doing.\nAnd it's funny how the alleged winner of 2024 wants to look back to 2020.\nabsurd. He can't accept that losing 2020 like he did. He can't accept the loss. And now\nwe keep relitigating it. And voters are paying attention. And I think the more this stays\nout here, people are going to start waking up. And Trump is going to be responsible for\nsome Republican losses in this next election,\nbecause Georgians aren't happy with these policies.\nThey see what's happening.\nSo I find it interesting that Republicans in this body\nare co-signing on the possible interference.\nThe FBI Rating Fulton County Election Office is just one more alarming, terrifying escalation\nfrom this failing administration of a wannabe king deflecting from his economic failures.\nPeople care about grossies prices going up right now.\nabout housing. People care about being priced out of their health care. And yet we have not dealt\nwith one bill in this body to deal with any of those issues that people are asking us to make a\npriority. State law is clear about what voter data can and cannot be disclosed. And there is no\nexception to that law because Donald Trump said so. If Donald Trump wants\nGeorgia's, Georgia voters personal information, that's too bad because\npresidents have to follow the law like everyone else. I'm asking everyone in this\nbody, including my colleagues on the other side of the aisle, as I, as, you know, my\nsenator, colleague has said, find some courage. I know y'all are following orders, but sometimes\nyou have to think, what's really happening here? Would you be okay if they walked up in\nyour county and start stealing your voter files without you knowing about it.\nLet's start looking at coffee county.\nThat might be where we really need to go and do some investigation because that's really\nthe only alleged voter fraud that we know we have evidence that happened.\nBut here we are, Raiden Fulton County as we all know is the largest, one of our largest\ncounties.\nAnd the move here is to delegitimize the authority of that county's board of elections to run their\nelections, and find cause to interfere with 2026. Pay attention, folks. What we should\nbe doing is queuing up some lawsuits because it's happening right in front of our faces.\nThe interference in our elections. I'm urging no today, not to protect any party, and\nAnd this shouldn't even be partisan.\nBut it's to protect Georgia law.\nGeorgia voters, it's to protect our Georgia voters and the integrity of our elections going\nforward with that Ms. President I yield well.\nhas yielded. We're going to have a center from 35th.\nAll right. Thank you, Mr. President.\nI stand in opposition to SRF 563, and in an effort to be clear-eyed and principle-based,\nit is my hope that a Democratic president, that if a Democratic president, say a President\nObama or President Biden, if one of their administrations kind of leaned on our constitutional officers\nhere in Georgia, leaned on them to find the votes. If a Democratic president, say Obama\nor Biden, went around the country and around the world denying the election results from\n2020. If a President Obama or President Biden's administration rated one of our counties\nvoter ballots, I'd like to think that I'd have the courage to also say no in that circumstance.\nIntegrity demands it.\nThis is an exercise that I welcome all of you to, which I'm sure you have.\nWe would just say it as simple as if the shoe was on the other foot.\nwould you vote? And that can help us know how to vote in these type of situations. It is my hope\nthat we are not blinded by power, echo chambers, and group think. It is my hope that we move with not\nthe word integrity but actual integrity. It also means that it's going to come back and be a\nchallenge for us when a shoe is on the other foot. It is my hope that my fellow Democrats will\nsee things the same way when we have to make a hard decision to vote that out of line with\nwith some heavy hitters in our own party.\nThat's when we'll see what we're made of.\nThat's when we'll see what we're made of.\nGod is not mocked.\nNow you yield the well.\nAll right, Senator on the 14th.\nOh, Senator from the 55th, you have your question light on or you want to speak in the well?\nNo, it's big in the well.\nAll right.\nCome on.\nThe well is yours.\nLadies and gentlemen, this all goes by, Mr. President, a rise in opposition to 563.\nHopefully, as no surprise.\nI rise because I am troubled by our nation.\nAnd where we are, if I have to stand as many that look like me,\nwho have been kissed by the sun, have become\nthe conscience of this nation to do what is right,\nI welcome the opportunity to stand.\nAnd I want to say that I rise simply because I did not really want to get up here, but\nas I look, I don't want it to be said that I stood by when someone is quoting the Civil\nRights Act of 1960 for the proposition of reversing history.\nThis is preposterous.\nYou look at what was happening in 1960 when I was walking down the street with my grandmother\nin Gryffin, Georgia, when people on the back of a pickup truck screamed out in hurls,\nsome words that I didn't even understand as a little kid, and I said, who is this disrespect\nthat my grandmother, calling her an end, get off the road.\nThis is what was happening in 1960, right down the street,\nright here.\nI was not, no one of my color was in here.\nAnd you were going to quote the 1960 Civil Rights Act\nto take my voting rights act away and me sit down\nand be comfortable with it.\nI'm telling you, this is 1984 when it\nrange down when you're doing something called urine and calling it rain, we can't stand\nby like that.\nSo in 1960, it was to strengthen voting rights acts, not to take voting away.\nIn 1960, we were trying to help people vote.\nAnd here we are saying we are helping people vote by taking voting a right away to intimidate\npeople.\nThere is a system to get data.\nCan you imagine, is this, am I in Russian now, the democracy stand for something?\nYou are going to forcefully come and threaten people.\nThat's where we are.\nWe have people living in fear.\nMy colleagues telling me they are afraid that someone is going to primary them if they\nare standing for what's right, that's what we have evolved to.\nSo I'm urging you to not obstruct, to facilitate America being great.\nAmerica great means something, means there are people fighting dying in the\nwater to get to this country because they see it as a beacon of fate of hope for\nan American dream. Let that dream remain something. Rome did not die because of\nof external forces. It was internal forces. And this is too dangerously, too dangerously\nlike Nazi Germany, when people refused to stand for what was right. As I quoted the other\nday, the pastor who said when the socialists, when they came for the socialists, I did not\nstand up. When they came for the unionists, I didn't stand up. When they came for the\nI did not stand up and then when I finally when they came for me that was no\none to stand for me and I'm saying to you I'm pleading for you whether it\nmeans anything or not I want you to think about where we are headed in this\ncountry. Dr. King said it. Are we gonna live together? I mean really we are\nshooting holes in our own boat. We are no longer number one in in literacy in\nAmerica in the world. Our students are not being able to compete with people in\nplaces we can't even pronounce. Is this truly America? Yes, I stand\nbecause we are quoting laws designed to make voting easier and manipulating it to make people\nafraid to vote, manipulating it to having an excuse to come in in 2026 and try to take over our\nelections. I never thought it could happen. I never thought that the federal\ngovernment, which was to protect us, would now be the instigator of taking our\nrights away because in 2026, some people are afraid of the results. We are there\nnow. And there were some people that look like me who didn't want to vote for a\nwoman who stayed at home. Look at the numbers and I'm gonna call a lot of people\nthat look like me, call black men. I didn't stand up here to say this but I'm\ngonna say it and you can get on me later. If black men had voted at the same\nlevel that they voted in 2020 when they put Biden in, when they elected the first\nperson of Jewish descent to the Senate, when they elected the first African\nAmerican to the Senate one-up, if they voted at the same level, just at the same\nlevel as the population grow in 2024, the election would not have been the same\nand Georgia would not have gone the way it went.\nIt would not have been him trying to convince someone\nto give him 11,790 votes.\nIt would not.\nWhy?\nBecause young African men get this message,\nmy men who are kissed by the sun,\nthose 50 and under who did vote in 2020.\nIf you want to look at the numbers, they did vote in 2020 and we elected those people.\nBut in 2024, only 70% of men of African descent even voted again.\nNot talking about the ones that were not registered.\nNot talking about the ones who were registered and did not vote.\nI'm telling you only 70% of the ones who did vote in 2020,\ncame back and voted in 2024, on an election\ndefied about 115,000 votes.\nWhy is this all relevant?\n2020, let's get, it's six years later,\nand we're debating over and trying to justify taking an election\nin 2026 about what happened in 2020.\nLook at the numbers.\nIf African American men came out last year,\nhe wouldn't have won this time.\nSo I stand because we can't call it civil rights\nand take away rights.\nWe can't take it, help America vote,\nand help America not vote.\nWe can't double speech it.\nThank you, Mr. President, because we\nneed to strengthen voting rights.\nI hear there's something across the hall.\nFirst time I heard about it today.\nAgain, trying to take my voting rights.\nWhy?\nFederal oversight was to protect voters.\nAnd now it's raiding voting voters, a federal government that people are afraid of.\nThat's what we'd be evolved to.\nI'm calling on people of real faith who really believe to come and take your country back\nbecause we're in trouble.\nWe're in trouble because some of you,\nyou will vote for this, but I urge you.\nGo take a cup of coffee.\nThank you.\nThank you, the well.\nThank you, Senator.\nSenator Gio did recognize the sentence from 34th.\nI'm sorry, I'm sorry, Senator.\nrecognize the senator from the pro-tam.\nThank you, Mr. President.\nIt's been some vigorous debate here today.\nWe've got a lot of committee meetings scheduled this afternoon,\nso I would respectfully call the question.\nYes, sir.\nI think this was the last speaker here.\nSenator, you wave.\nYou wave?\nOK.\nAll right.\nSo, and we're about to call for you this question as it is.\nSo we'll call the previous question,\nthen we'll hear the minority report,\nthen we'll hear the Senator the author of the bill\nwill fill a closed debate,\nand then we'll be ready to vote, Senator.\nSo thank you.\nYou had the minority report, closed debate.\nThank you, Mr. President.\nI appreciate the office of the Secretary of the Senate\nfor helping me with this visual aid.\nOn your desks this morning you found this very rudimentary chart that I've provided for\nall the senators today and I'll just in a second I'll get into what this chart means.\nBut the first observation I have today is that we all would like to imagine what we would\nhave done under certain circumstances, whether it's historical events, or maybe it's the\nstory the Emperor's new clothes. When we read that story in elementary school or\nmiddle school, we thought how ridiculous is it that there's an Emperor who's\nnaked and everybody in the royal court is pretending that the Emperor has\nclosed. But I think when you live through modern times like this you get a much\nbetter appreciation for the types of social pressures that could convince a\ngroup of very serious people with badges and pins and ties or formal attire to\nto lie about what their own eyes are seeing right in front of them.\nSo let's start with the truth and let me be very blunt and blunt in a way that I don't\nthink any speaker here to four has been.\nThe reason that Senate Resolution 563 is on the floor is because the president of this\nchamber, who is standing about six feet behind me, is running in a primary, again, Secretary\nof State, Ralph Raffensberger, to be held on May 19th to determine the Republican nominee\nfor Governor of the State of Georgia.\nAnd that's the only reason that this Senate resolution is on the floor.\nNow, that reason is complicated because it bears with it threads of other reasons that\nflow through it, such as Donald Trump as a narcissist who is still obsessed with the results\nof the 2020 election in Georgia.\nAnd his obsession runs so deep that it's 2026 and we haven't stopped talking about it.\nWhat that means for our state politics is that anybody who is a loyal Trump follower or\nacolyte is required to carry water for Donald Trump in every way that he sees fit.\nAnd in this election, that means continuing the baseless conspiracy theory claims that\nthe 2020 election was somehow stolen or that Fulton County somehow had quote-unquote\nsuitcases of ballots, the FBI array that we saw is an outcropping of this, this resolution\nis an outcropping of this.\nAnd it all it does is pit the Senate Republicans in this chamber against Brad Raffin's\nburger for purposes of primary politics.\nThat's 100% all that it does.\nAnd I think that most people in here,\nand the people in the anti-room, and who are checking their phone\nover on this side as well, are pretty tired\nof the normal political talking points on both sides\nof this issue, because we've heard them a million times,\nnot just today, but we've been hearing them since 2020.\nWe're very dug in in terms of the political narratives\nthat are being used to describe the situation.\nSo I thought it would be best to go to psychology 101.\nWhen it comes to narcissism, you're familiar with the DSM,\nwhich describes clinical psychological conditions\nthat you can be diagnosed with.\nClinical really just meaning it interferes\nwith your daily life, right?\nAll of us are a little bit egotistical\nand narcissistic when push comes to shove,\nbut if you have narcissistic personality disorder in PD,\nit means that you are clinically diagnosable.\nNow I do not have training as a psychologist,\nand I'm not qualified from a distance\nto diagnose the president, Donald Trump,\nas a malignant narcissist.\nBut let's just assume, let's suspend your disbelief\nfor a moment and pretend that Donald Trump\nis clinically diagnosable as a narcissist\nwith narcissistic personality disorder.\nIn that case, I would humbly submit to you\nthat Donald Trump functions somewhat like a parent\nto elected Republicans.\nI say somewhat because obviously you all have your own parents who came from families,\nloving or not.\nYou've walked along path professionally and personally to become members of the Georgia\nState Senate.\nAnd so I'm not saying that Donald Trump is literally your daddy.\nWhat I am saying, though, is that for political hierarchical purposes, he functions much like\nyour father.\nIn the sense that if he says something and you don't comply with it, there's a risk that\nyour basic needs as an elected will not be met.\nThink about that from the family context, right?\nIf a parent says, this is the way it goes, and the child says, no, I'm not okay with that.\nThe risk always looming in the background is that the basic security and provision of\nneeds that that parent provides will somehow be taken away.\nI think there's an easy analogy to be made that in the elected, Republican world, Donald\nTrump provides your basic needs at this point in history, or at the very least, he could take\nthem away.\ncould threaten you by targeting you, like the eye of Sauron, like a laser to put on\ntruth social or on Twitter, you know, Senator from the 30th. You've been very bad and\nI'm going to laser you and make sure that you get a primary opponent that is supported\nby Donald Trump. We have seen this time and time again that Republicans have been terrified\nto cross Trump because their basic needs might be undermined as elected officials. And\nI'll say more on that in a second because I think we need to unpack what your basic\nneeds are as Republican elected officials and how Donald Trump actually is\nthreatening them more than protecting them. But the literature is very clear.\nThere are three basic types of adult children of narcissistic parents. So what I'm\ntalking about is in the family context, when you're raised with a narcissistic\nparent, there are three personality types that develop among the kids who have\nthe unfortunate circumstance of being stuck in that environment. They are the\nGolden child, the scapegoat, and the invisible child.\nI'll go ahead and cover the invisible child quickly\nbecause we should get them out of the way.\nThey are invisible after all.\nThe invisible child is the person\nwho doesn't really fit the narcissist narrative\nabout what's happening in the family.\nThey're not useful to the narcissist.\nBecause see, for the narcissist, everything's about that, right?\nFor the narcissist, they don't care\nabout the needs of other people.\nAll they care about is making sure\nthat their very narrowly defined needs are met.\nThe NPD diagnosis has nine characteristics\nthat float around quickly.\nGrandioce sense of self-importance, right?\nIt's the best, it's gonna be the best you've ever seen, right?\nFrequent fantasies about having or deserving.\nI don't know, Greenland for example.\nBelief in superiority, America first.\nNeed for admiration.\nMy inauguration crowd was the biggest of all time.\nEntitlement, I can shut down the Kennedy Center\nfor two years.\ncan re-destroy the East Wing of the White House and put up gold,\ngilded, BS, all over the Oval Office.\nNumber six, willingness to exploit others.\nEvery single business deal that Donald Trump did before he became\npresident and, all the ways, his family has personally benefited,\nyou know, C. Jared Kushner, from his time in office.\nSeven, lack of empathy, saying that places are s-hole countries.\nAnd, you know, saying that, you know, Baltimore is a crap hole or\nwhatever, you know, just the absolute disregard for the human\nbeings that live in the cities of the United States, frequent envy, Greenland again.\nAnd also, why didn't I get the Nobel Peace Prize?\nI would like the Nobel Peace Prize, and nine is arrogance, patronizing behavior, behaving\nthe way that snobby are disdainful.\nI don't know, like having cabinet level officials buy new shoes, because their shoes weren't\ngood enough.\nDo you hear JD Vance crow about this?\nHe was gleeful, right?\nThe Donald Trump forced his guys to buy new shoes because of the optics of their shoes.\nThis is the President of the United States, folks, that we're talking about.\nSo I would say, even without a psychology degree, I feel fairly comfortable diagnosing Donald\nTrump as a narcissist from a distance.\nSo now let's talk about you.\nMy favorite topic here, always talking about you, Senate Republicans.\nIf you are smart politically, if you are in line with the president's plans for his own\nelection to the office of governor, which I think almost all of you are, I remember there\nwere like three of you who didn't endorse the president for governor a few months ago.\nAnd I remember I texted somebody about that.\nI thought that was odd and I was worried about the three of you.\nBut all of you fit the category of Golden Child,\nor at the very least you're playing the role of Golden Child.\nNow you notice the little Golden Crown.\nI did that for an honor of Donald Trump, right?\nThat's, he loves gold.\nBeing the Golden Child means something very specific\nrelative to the emotional crisis that the narcissist face.\nThe Golden Child is the reflection of the positive,\nlight-filled self-image that the narcissist has.\nI'll say that slightly differently.\nFor the narcissist to cover up his bottomless insecurity,\nhis bottomless sense of low self-esteem and low self-worth,\nhe must concoct at all times a narrative\nthat he is actually great, awesome.\nYou could imagine like that SNL speech,\nI'm good enough, I'm smart enough,\nand gosh darn it, people like me, right?\nYour job as Senate Republicans who vote for this resolution\nis to help Donald Trump with this quest.\nIt's to help him reinforce his positive self image.\nNow obviously there's a bunch of leaps\nthat have to happen before you get there, right?\nHe doesn't like that he lost Georgia.\nIt's a red state, right?\nWhat a smear on his public image\nthat he lost Georgia of all places in 2020.\nTwo cycles ago, really, really embarrassing stuff.\nSo for you guys, and as Georgia Senate Republicans,\nthe highest best use of your lives,\nyour attention spans, your work,\nis to help him fill that self-esteem gap,\nis to make sure that he doesn't have to look in the mirror\nand CA loser.\nThe scapegoat is Brad Raffinsberger.\nThe scapegoat is the member of the family\nwho was raised to take all the blame\nfor all the things that go wrong in the family.\nSo let's say, for example,\nthat the narcissist and the family setting,\nyou're all going out to dinner, right?\nYou've got the parent driving, the kids in the car,\nand then all of a sudden while you're in the car,\nThe president illegally deposes the leader of Venezuela\nand abducts him and takes him back\nto the United States for a trial, right?\nOr let's say while you're in the car on the way\nto the Olive Garden, the president raises tariffs arbitrarily\nthat crush small businesses and you know,\ncause a lot of economic harm in the country.\nNow you guys as the golden child aren't a pickle, right?\nBecause you have to reinforce the positive self-image\nthat the narcissist has.\nBut how do you do that when the facts are so bad?\nHow do you do that when ice and border patrol are killing people in the streets or tariffs\nare crushing small businesses?\nAnd I go, this is just me talking as Josh now, I go to an event for a group in Winnett\nCounty and the leader of that group, which represents an immigrant minority community, says\nwe were with Kemp, but now we're with Democrats because the tariffs are crushing our small businesses.\nThis is a challenge for you guys.\nWhat do you do to reinforce the positive self-image of Donald Trump and these circumstances?\nWell on tariffs, it's hard.\nOn ice, it's hard, right?\nI mean, you guys came up and gave some fairly circumspec speeches about the ice or the CBP murder of Alex Prede.\nYou acknowledge we should talk about it. It's tough. That's because your second amendment folks are getting wedged on that, right?\nSo like, that's much tougher. But elections, you guys are ready to go on elections.\nThat's been one of your favorite punching bags for the last few years.\nWe passed SB202, we secured elections, we made them more, you have more integrity.\nThis is easy for you guys. So this is actually a layup, right?\na Senate resolution that says,\nyou bad Brad Raffin's burger, you scapegoat,\nwhy didn't you overturn the election, right?\nWell, I don't know because it was his job.\nNobody in here had the job of certifying those elections.\nAnd I think if you guys were back into a corner,\nmany of you would not have taken the Jody Heiss route.\nI think many of you would have done the exact same thing.\nYou would have certified the election results\nbecause it's your job and you've got basic self-respect,\nright, when you look in the mirror and you do your job.\nBut nobody in here had to do that job.\nSo what did you do?\n16 state senators signed a letter that the president of the chamber took to D.C.\nDidn't give it to Mike Pence, did leave it in the Uber.\nBut that letter was a golden child move to say, we've got your back, daddy.\nWe've got your back, we're going to pretend alongside you that the election was stolen,\nand we're going to do tasteful polite trims on Georgia election law\nso that we can corroborate your narrative that something is wrong with these elections.\nAnd the scapegoat just gets beat up man why you always doing stuff Brad you know the back seat of the car right come on Brad\nWhy aren't you going with the team on this one Brad right and you all hate it\nI mean some of you personally hate this the Brad reference burger was on the cover of time magazine with his hand up\nRight like some defender of democracy and the fact that there are ladies who live in retirement communities in my district\nI saw them on no Kings Day. Guess what they were holding no Kings signs because they vote democratic and they love Brad reference burger\nAnd why?\nBecause there was a bipartisan consensus\nthat at least at that minimum level,\nthat Brad Rafford's burger\ncertified the elections the way he was supposed to.\nBecause it was his job.\nAnd there are a lot of people who appreciate that.\nNow, I'm not endorsing in the primary.\nI'm not endorsing Brad.\nI'm not endorsing the president of this chamber.\nI will be endorsing a Democrat for that race eventually.\nBut I think it's clear that on the three steps here\nto freedom, you can think of this\nlike three steps to freedom.\nThis is sort of the most trapped part of this cycle\non the conveyor belt.\nScapegoat is still kind of trapped, right?\nBrad is still stuck in the backseat\nof the toxic Republican family car.\nBrad still has to do messaging such as\na constitutional amendment to make sure\nthat people can't illegally vote,\neven though that's redundant and it's already in statute.\nOr Brad Rathansberger supporting SB202,\nwhich limited Dropbox hours and early voting access\nand created a right for the state\nto take over local elections,\nBecause, as Brad determined, that's not that bad.\nI should just go ahead and sign onto that.\nIt may not make me a full golden child,\nbut at least I can stay within this toxic family\nand not get completely kicked out.\nEven then, I can maybe run as a Republican.\nNow, this is not of interest to you guys\nbecause you guys wanna keep staying in office.\nSome of you wanna go to higher offices\nbut you wanna keep being Republicans.\nI would humbly submit to you\nthat the invisible child is happiest as a human being.\nThe invisible child doesn't matter to the narcissist\nand the narcissist doesn't matter to them.\nNow granted, it's hard to grow up as the invisible child.\nBecause the invisible child learns the lesson\nthat these other two also learn,\nwhich is my needs don't matter.\nMy voice doesn't matter.\nOnly the narcissist matters.\nI'm gonna say something difficult,\nbut I think it's true, and I think you need to hear it.\nI think that you have told yourselves\nthat you can continue being dignified Republican\nelected officials who can survive the Trump moment,\nthis too shall pass, and you can go back\nrepresenting your constituents the way\nthat ideally you're supposed to.\nWe hear a lot in this chamber and in the building\nabout how George is different.\nWe're not DC.\nWe're not caught up in all that partisan hand-ringing.\nYou know, we can represent our constituents\non the ground level.\nTo some extent, I think sometimes that's true.\nWhat I think you guys are chronically ignoring\nis that every day that this gets worse,\nthat becomes less true.\nEvery day that this gets worse,\nDonald Trump's narcissism becomes your main objective\nand it becomes the impetus for you to,\nas I said a few days ago,\nminimize, destroy your own voices.\nThat is actually the real tragedy of this.\nI'll say it again.\nThe destruction of your own voices\nand your own public consciences\nis the biggest tragedy in all of this.\nGeorge is gonna, somebody will get elected.\nSomebody will be governor.\nThe elections I think will happen this year,\nalthough if Trump thinks he can raid\na bunch more local and state offices with the FBI,\nthen some of that will be in question.\nBut assuming the elections happen this year,\nThis too shall pass, we will move on.\nDonald Trump will meet some kind of an end\nin terms of his time and office,\nand hopefully we can go back to our normal lives.\nBut the damage that you have done\nfor these last 10 years and on days like today\nto your own voices is gonna be very hard to recover from.\nAnd I wanna name a couple arguments I've heard today\nthat are golden child arguments.\nI was disappointed, Senator, from the 37th to hear\nthat the reason this resolution is harmless\nis because what do you have to hide?\nI was on a committee in a house\nof the center from the 37th, where we address sensitive constitutional rights, such as the\nFourth Amendment, where fed state government officials can't just knock down your door at\nyour house and take whatever they want. The exact same arguments you heard from the\ncenter from the 37th today could be used to justify limitless search and seizure authority\nby the federal government to enter homes. Well, if you don't have anything to hide, then\nwhat's wrong? What's the problem with that? So that's not really a robust argument,\nand I think that gets out of this framework.\nI think that transparently shows itself to be\na golden child argument that serves only one purpose.\nOr what about the senator from the sixth,\nthe esteemed rules chairman, who ripped out his own voice box\nand threw it on the ground and replaced it with a machine?\nI mean, it was funny, funny in a quaint or cute sort of way,\nbut not necessarily funny to his constituents\nwho want him to have a spine, to his constituents\nwho want all of us who are elected to come here\nand actually stand up for what's true and what's real.\nI thought it was one of the most deeply ironic presentations\nI've ever seen as a legislator in eight years\nthat he read a chat GPT speech about honesty and accountability.\nHe literally said, we need to self reflect.\nI was like, thank you for setting up my therapy talking points.\nCenter from the six, we do need to self reflect and be honest.\nAnd the machine spat out words like match our actions\nto our values or have open dialogue\nor an environment where people feel safe.\nSo if you think this is too snowflake,\njust consider the Senator from the Sixth Robot,\nwhich said that we need an environment\nto genuinely and honestly reflect\nand that that's the way to serve our constituents the best.\nOr let's go to the author's comments,\nSenator from the 29th.\nGoing back to that mirror speech, the self-affirmations,\nI am not a MAGA.\nI am a conservative Georgia State Senator.\nIt has the flavor of protesting too much.\nIf you have to look in the mirror and remind yourself\nthat you're something other than a tool\nin a Narcissist's toolbox.\nSo I genuinely have been impressed over the years\nwith some of the presentations that I've seen\nby the Republican majority to alter\nor distort the real purpose of a bill for public consumption.\nBut you should read the internet comment section\nif you haven't been recently.\nNobody out there is buying it.\nNot a single Georgian is gonna buy\nthat this resolution has anything to do with anything.\nexcept for that guy.\nAnd as reality starts to close in from all sides,\nelectorally, morally, practically,\non the failed arguments trying to prop up a narcissist,\nyou will hear your own voices, the ones you're destroying,\nring more hollow.\nYou will hear yourself say things like,\nyour social security number came from the federal government.\nAnd it's already in the federal government's possession.\nAnd let me tell you, if I wanted the white page search you\nand put sick a private investigator on you,\nyour driver's license, your date of birth,\nAll that stuff is in the public domain, so sit down and shut up, Georgians.\nAll the constituent emails we got over the last few days about our voter, our sensitive\nvoter information, not wanting it to fall on the hands of the federal government.\nAll those people, apparently, according to the majority, can sit down and shut up.\nAnd there are Republicans who are worried about data privacy, too.\nBut the message from Senate Republicans loud and clear today in this chamber is your data\nprivacy doesn't exist, doesn't exist at all.\nBecause it's already out there, it's already all shot, so why not tickle the narcissist?\nYou can almost imagine at the back of the car nudging Brad.\nCome on, Brad, what's the deal, man?\nGet with the program.\nThey already have all this data.\nCan you just make the narcissist parent happy so that we can all live in peace?\nBrad is doing some good messaging today.\nYou'll see his Groundhog Day messaging?\nPretty strong.\nI genuinely can't believe you all brought this on Groundhog Day.\nI genuinely can't believe it.\nBecause in that movie, is Bill Murray?\nGood actor, funny guy.\nHe wakes up and lives the same day over and over and over again\non February 2nd, and Punxitani Phil, the groundhog,\nkeeps getting trotted out, six weeks more weeks\nor whatever.\nAnd it's a hero's journey, right?\nA building's Roman.\nBill Murray has to learn how to laugh, love,\nand live in harmony with his community.\nAnd until he does that, he keeps repeating\nthe same day over and over and over again.\nHe gets so miserable for him that he throws himself\nin front of a train.\nHe drives a car off a cliff.\nHe'd rather die a million times than live this day again.\nSome of you may feel that way.\nSome of you might feel like that nothing is worth\ncontinually tickling this man's ego,\nthat biggest vote of all time, right?\nLike, it can't be worth it at some point.\nBut anyway, Bill Murray escapes the trap.\nBecause once he realizes that the power is not worth it,\nthat the humanity, the basic humanity of the people\nin that community that he looked down on,\nthat that's the most important thing,\nwhatever powers held him hostage, set him free.\nSo I guess the message from Senate Republicans\nhere on Groundhog Day is we are gonna live the 2020 election,\nday in and day out, over and over and over again,\nuntil we finally learn the lesson,\nthat if we really wanna represent our constituents\nas well as they deserve,\nIf we really want to be the people we look in the mirror and tell ourselves we are, then\nwe have to cut this BS out.\nThank you guys for your time today.\nI know.\nYou do have a long question, Senator.\nI'm happy to answer questions.\nI know you want to stay in the well a little longer.\nI'm happy to answer.\nWe're going to ask the majority later for a question.\nThank you, Mr. President.\nIs the Senator yielding?\nI do.\nSenator, is what you presented the minority report?\nIt is.\nreport of a minority as to a lot of things.\nSenator, will you further yield?\nProbably as long as you'd like me to.\nThat's up to you.\nSenator, are you running for Lieutenant Governor?\nWell, I wasn't going to bring that up, but as a matter of fact, I am.\nSenator, will you further yield?\nI would.\nIs this mockery of a presentation that you presented today\na tryout to earn the support of George Soros or Stacey Abrams?\nI don't know if I owned a processing plant\nthat had a canning line that I could can\na more canned talking point than the one that you just used.\nWhat I will say is that voters want honesty.\nThey want authenticity.\nThis is something I actually care about.\nYou know, 20% of Americans, it's estimated\nto have a narcissistic parent.\nThe likelihood is that up to what's divided by five,\nover 10 senators in here probably dealt\nwith a difficult childhood environment\nfor which a lot of this hits personally, right?\nAnd it just so happens that there is this template\nthat exists in a lot of our personal lives\nis also extremely useful for understanding\nwhat the country is going through right now,\nlaid bare.\nSo if you think this is a mockery of a performance\nor whatever it is you just said,\nI would invite you to consider the possibility\nthat this is the truest thing that you've heard\nin a long time about Donald Trump\nand about your work on election issues\nin the Georgia General Assembly.\nSo I'll defend this stuff till my grave,\nand it's really up to you whether you wanna really process\nand as the six robot said, create a safe space for self-reflection.\nDoes the senator further you all day?\nSenator, I don't use AI and I write my own stuff, so thank you.\nAs going back to your interesting comments, do you believe George Soros represents Main Street, Georgia?\nWhat I think is that somebody's calling me, hold on.\nI should.\nIt's probably George.\nYes.\nIt's probably actually it was a journalist.\nWhat I think the George Soros or Stacey Abrams or any names that we heard today, why haven't\nheard a thing about the people across the hall, I haven't heard a thing about, you know,\nalmost all of those hypotheticals you guys pose, there's a process in place, there's\na process that resolves it, there's an ethics board that assesses a fine, there's a criminal\nprocess that leads to a conviction and a sentence.\nThat's why we have institutions to process problems.\nThe problem with Trump is that because of you guys, because of the failure systematically,\nfor people to raise their voices in opposition to a would-be tyrant, we currently don't have\nthe institutional strength to check this threat as it currently exists.\nAnd so you guys are playing with live ammunition.\nYou've been playing with live ammunition for 10 years, telling yourself as the walls have\nbeen closing in that it's never going to be that bad.\nBut the second amendment groups I think are giving you guys a canary in the coal mine,\nright?\nWhich I didn't know how the second amendment groups would go, but after we saw the murder\nof Alex Prattie and we see that the Second Amendment groups are starting to say,\nhey, wait a minute, Christy Nome, Cash Patel, we don't want you guys to be saying\nthat you can't bring a gun lawfully to a protest. That should be a little bit of a hint for you\nthat some of this, what aboutism? They're like, well, what about George Soros?\nThat people are going to see through that transparently as a deflection, a move of what aboutism\nto distract from what you're really doing, which is what it's really all about.\nSenator, are you further ill?\nI'm happy to.\nSenator, do you believe Stacey Abrams was elected governor?\nNo, I don't think she was.\nI think she lost in a free and fair election.\nI think she knows that.\nI think we've all been saying that.\nSo again, it's like, like, you know, I hope Georgians,\nI don't know any cameras.\nIf Georgians are watching this, I hope that you are listening\nto the fixation of the Senate Republican majority.\nI hope that you're hearing that as the walls are closing in\nand Trump is, you know, annexing Greenland and deposing other,\nyou know, heads of state and doing tariffs\nand sending ICE and CBP to terrorized people.\nI hope you hear the Georgia Senate Republicans\nall they've gotten in the boxes,\nGeorge Soros and Stacey Abrams.\nLike that's all they've got.\nAnd so if you guys have a better way\nto meet this moment than to rehash five\n10-year-old talking points,\nI will yield for as long as you wanna try.\nSenator, I appreciate you being cute with your answers,\nbut at the same time,\nthat is the reality of what's going on in the state\nin your party and you can continue to deny it.\nBut we know where you're talking points are coming from and I hope that does help you on your road to lieutenant governor I think you're I think you've carried water extremely well for your daddy\nAnybody else\nWe're going out of center from 56\nThank you miss president with the senator yield I do yield to my colleague from the 56th\nSenator, are you familiar with the awful effects of Alzheimer's?\nI am.\nSenator, are you further yielded?\nI do.\nAre you also familiar with the terrible effects of dementia?\nI am familiar with that.\nSenator, are you further aware of the effects adult children can have when their parents have dementia or Alzheimer's?\nYes.\nIn fact, my uncle is suffering from some of that, so some of this is a fact to be personally as well.\nme as well. Thank you for being so genuine your answer. Knowing that the prior\nadministration was suffering from both of those things clearly and most of the\ntime couldn't put two complete sentences together I didn't see this same\nboard up during that time frame when you served in the Senate where we probably\nwould have seen someone as the caring child that wanted to just be there for\nmom or dad or dad in that case and I didn't see the one that said let's just\nhide and pretend that that really is okay. So Senator, isn't it a little bit\ndisingenuous that you are now focusing on the current president yet for four\nyears and the other one wasn't capable mentally or physically to be in office?\nYou didn't point that out. Do you know the meme of the dog that's in the room\nwhere everything's on fire and the dog says this is fine? You're familiar with\nthat? This is like a millennial Gen Z thing. So I apologize if it does the questions\ngo the other way that you're talking.\nSo imagine a room's on fire and we're in that room.\nAnd I'm saying, guys, we should get out.\nThe room is on fire.\nThis is the equivalent what you're asking me of saying,\nyou know, last week, somebody farted in the room,\nand it was very uncomfortable.\nBut you didn't want to leave the room then.\nSo I think it's pretty hypocritical\nthat you want to leave this burning building now.\nThat's what I think of your question.\nAppreciate the analogy.\nSenator, I'm afraid something smells,\nand it's coming from the well.\nThank you.\nAll right. Thanks very much. Listen, I know that this has gotten a rancorist, but we didn't want this. We really didn't want this\nBut you guys are insisting on it. Thank you, Mr. President\nThank you senator. Seniors yielded the will\nWe're gonna as the senator's room twenty-nine to finally close debate\nThank you, colleagues. I appreciate the attention you all have given to this resolution.\nThere I say I'm somewhat surprised, not my intent.\nMaybe it's because I carry a DSM-5 in the DSM-5TR in my office and I realize that sadly\nto the assumptions of many I'm not a toxic narcissist.\nBut I have witnessed at least one here today.\nIt's all a lot of distractions and I mentioned when we first spoke that we would see these\ndistractions. What the FBI raids in Fulton County have to do with the surrender of records\nduring a law enforcement investigation? Don't quite understand. I heard a rant about partisan\npolitics. The last time I checked, the Secretary of State and the Senator from the 29th are\nmembers of the same party. People saying that people do things to want to get elected.\nI may want to talk to the wife of the Senator from the 29th because there's a lot of times\nI give my opinions at rallies, whether it's about election integrity or other issues that\nare not popular.\nBut I said this the other day, the Senator from the 30th and the Senator from the 29th,\nthe only unforgivable Senator in our profession is to tell a lie.\nYou stand up and you take it like a man or a woman, whether you made a bad choice or\nwhether you made a mistake.\nSomebody brought up the fact that here we are day 10 in a real legislation.\nI think it was day two.\nI stood outside and talked about a will-barrow dump of legislation attacking federal law\nenforcement officers.\nDay two.\nNow day 10, day two, people want to come out in the state to take actions regulating\nthe policy's procedures and requirements of federal law enforcement officers.\nTrust me when I say civics matter.\nI heard somebody say that the current president is the alleged winner of the 2024 election.\nA alleged winner, let's talk hypocrisy.\nThe 1960 Civil Rights Act, newsflash, it is applicable to every American, every single\nAmerican.\nMy six-year-old daughter included.\nWhere people come up here, recklessly throw out Nazi Germany, Russia, throughout what you\nwill, I'm a proud American citizen, and that last word matters because today we're being\nencouraged not to be proud American citizens.\nIf we tell somebody we're a proud American citizen, then we're disparaging those individuals\nwho may not be yet, but are working toward that, or that maybe I'm not open enough, or\nmaybe I'm separating myself, and having forbid I bring up the fact that I'm a proud American\nChristian citizen, the same thing.\nSo the rhetoric I heard, coming, didn't surprise me too much.\nAnd I always hear people run down here talking about, get spines and get guts.\nWell, let me tell you, I've been in here for eight years, and I think the first person\nthat ever stood in this well and talked about the lack of\nspines inside this building was a senator from the 29th.\nAnd I still speak of it today because I will tell you,\nmy daddy left this world 1999 and I don't carry anybody's\nwater but the people I represent, faith and facts for what\ndrive me in that order.\nAnd then, for somebody to come up here and talk about somebody looking in the mirror,\nI know theater when I see it, and when you do theater, you're there to entertain an audience.\nYou're there for applause.\nYou're there to be recognized.\nYou're there to be grandiose.\nYou're there to fulfill your fantasies.\nAnd those are the first two identifiers of a narcissist.\nSo let's be clear.\nThis simple resolution is to urge Secretary of State to cooperate.\nThe DA of Fulton County got in the due process, and I got to give her credit there at the\nend with a subpoena from the senator from the 46 she showed up.\nSecretary of State has been given multiple opportunities to testify in front of our ethics committee.\nAnd our chairman, the esteemed Senator from the 11th, has been over backwards to accommodate\nand he has yet to show up.\nAnd the last time I checked, he was elected by the same people that elected us.\nAnd you know what it takes to show up when you're right, when you're wrong, when you're\nscared, when you're not sure.\ntakes a backbone and it takes guts and so I'm going to ask you to support this\nresolution don't be afraid of your party you're certainly not going to be\nafraid of me if you remember I'm the guy that carried the buckhead bill so it\nain't about winning and losing to me it's about doing what's right and with\nthat Mr. President I yield the will is there objection to agreeing to the\nreport of the committee which is favorable to the adoption of the resolution chair. Here's nine poor community is agreed to is there\nobjection to the main question being ordered?\nChair here's none of the main question is ordered center from 37th. What purpose you rise?\nIs there objective main question being ordered chair. Here's none main question is ordered questions on the adoption resolution. All those in favor of the\nResolution vote. Yeah, you pose nay secretary one lot of the machine\nThank you.\nYou're welcome.\nAll in the passage, adoption of the resolution, the A's are 31, the A's are 22, and this resolution\nis adopted.\nWe're going to ask the majority later.\nMr. President, I move that the Senate is in adjourn until 10 a.m.\n2 a.m. February 3rd, 2026.\nDirector later, his move.\nSecretary, read the announcements.\nThe rules committee will meet upon adjournment in room 450 of the capital.\nThe Public Safety Committee will meet at 2.30 p.m. in room 450 of the capital.\nThe Health and Human Services Committee will meet at 3.30 p.m. at in room 450 of the capital.\nThe Finance Committee will meet at 4 p.m. in Mezzanine 1.\nThe Judiciary Subcommittee will meet at 5 p.m. in 307 of the CLOB.\nThe Ethics Committee will meet at 6 p.m. at in room 310 of the CLOB.\nThank you, Mr. President, that could be sewered.\nAny other announcements?\nNo other announcements?\nI'm recognizing the protein for our announcement.\nThank you, Mr. President.\nFriday, February 6th, it's going to be John Bullock Day.\nWhere are your nice blue jeans, if you'd like to?\nYour nice press blue jeans, John Bullock Day, Friday.\nThank you.\nAll right.\nMajority leader has moved.\nAll those in favor of his motion,\nsignify by saying aye.\nAll those opposed, no.\nThat's clearly having it.\nY'all have a good day.\nYou know, something right in here.\n",
  "updated_at": "2026-02-12T01:24:20.761435+00:00"
}