{
  "video_id": "4ncHywziC6I",
  "url": "https://www.youtube.com/watch?v=4ncHywziC6I",
  "title": "8/23/2023 - Joint Tax Credit Review Subcommittee",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 132,
  "summary": "Here is a summary of the key points from the Georgia 8/23/2023 - Joint Tax Credit Review Subcommittee session:\n\n**Overview:**\nThe session focused on discussing the economic impact and fiscal benefits of a new Hyundai manufacturing facility in the Savannah, Georgia region. The discussion highlighted the significant job creation, wage increases, and tax revenue generation associated with the facility.\n\n**Key Actions:**\nNo bills were passed or referred during this session.\n\n**Bills Introduced (First Reading):** \nNo new bills were introduced.\n\n**Notable Moments:**\nThe committee heard a presentation from an economic expert detailing the projected economic impacts of the Hyundai plant, including:\n- Creation of around 20,000 direct, indirect, and ripple effect jobs\n- 75% increase in the regional manufacturing base\n- $470 million in annual wages and earnings\n- $114 million in net present value fiscal benefits for local governments over 20 years\n\nThe discussion focused on the wide range of residential options and commute times available for workers at the new facility.\n\n**Votes:**\nNo recorded votes took place.\n\n**Attendance:**\nA quorum was present, with members participating both in-person and remotely.\n\n**Adjournment:**\nThe session adjourned, with no specific date provided for the next meeting.",
  "transcript": "The way that allows these companies to have predictability is they move forward. So, in all world, if it ain't broke, don't fix it. But I know you all got a lot of work to do, and I know you all are reviewing everything, but we really appreciate all the stuff that you've done for us. And last but not least, I want to thank the partner of economic development, Commissioner Pat Wilson, the governor of course, and his team. It's been a, it's been an amazing past few years, and we've been very fortunate to, to work with everybody, and we're just very thankful for all its success. So, thank y'all for being here today. Thank you for all you do, and we wish you the best of luck as you get through the process. Thank you. Whoever's up next. Off, off, off, off, I'm sorry, I forgot one, the one poor thing, the city is not going to be monitoring the parking. So, if you saw something that says pay or whatever you only have an hour, don't worry about it, we talked to the city and heard them, hopefully, be nice. So, thank you. Well, Dr. Toma makes his way. I thought we'd take just a minute and very briefly introduce the panelists. I'll run down the house side, Chairman Huffsteadler. If you'll run down the Senate side, I'm going to hand the mic over. My name's Shaw Black, and I chair the ways it means committing to have. Matt Hatchett, Chairman of Appropriations in the House. My name is Chuck Martin from the 49th District. I chair higher ed and served with Chairman White when I'm ways it means. I'm Debbie Buckner, I'm a member of ways it means an appropriations, but I don't share anything. Casey Corp. and then I did not get over so last now that I got a nine-inch, so these sunglasses are not the hard to hang over. Representative Dalton Georgia, creative arts center. Entertainment Chairman, ways it means. We've got a couple of members doing it remotely and Senator Ratz here somewhere in town. I don't know. We should be here shortly. Anyway, check us out when I chair the finance committee. John Albury, Senator North Fulton, Cherokee and Cobb, Vice Chair, Finance and Chair Public Safety. I'm Blake Taylor. I'm Chairman of Appropriations in the Senate from the 19th District, most of South East Georgia. I'm going to give you a few more minutes to talk about the $58,000 a year. That's going to pump about $470 million into the regional economy. I'm going to give you a few minutes to talk about the $58,000 a year. $58,000 a year. That's going to pump about $470 million into the regional economy in terms of wages and earnings that's going to stimulate what I referred to as economic ripple jobs of the order about 4,600 jobs. So once we start to add all those up, that's about 20,000 jobs itself associated with the facility, its suppliers and the recirculation of the earnings and the regional economy to put that number into context. That's 10% of our employment base associated with just one facility. We approximately have about 200,000 jobs in our Savannah metropolitan area. So adding 20,000 to that is certainly altering and changing the nature of the economic fabric in the region in a very meaningful way. The 14,000 roughly direct and indirect, the manufacturing facility and the supplier jobs, if those are added into the manufacturing category, which most likely they will. This is the most stunning figure to me. It's a 75% increase in the manufacturing base in our regional economy. Just associated with one facility, a 75% increase in the manufacturing base in our regional economy. We know that manufacturing jobs pay well above average in terms of the salaries in the metropolitan area. The 5,800, 105 dollar annual wage of the earners of the facility at the Hyundai plant. That's 25% higher than the service sector wage in the Savannah MSA. And it's also 11% higher than the average private sector job in the metropolitan statistical area. So this is certainly going to have a significant influence on the nature of the economic structure of our regional economy. The fiscal impacts associated with the operation of the facility itself. So just the 8,100 jobs on site. For the four counties, the joint development authority here that is going to result in a net present value increase of about $114 million over a 20-year period horizon of analysis. So that does include the cost of providing public services, including first responders, police, EMT, cost of providing government services, anything that you can think of water, sewer utilities, cost of local government. That includes that in that net present value fiscal impact analysis. It also includes the cost of providing public school education to the children who would be associated with the workers at the facility itself. And it includes the and analysis of the locally provided incentives for the facility, including property tax abayment and the upfront subsidies. I mentioned that the $470 million in wages and earnings every year at full development at a 100 workers. That alone is going to generate approximately $226 million worth of taxable retail sales. So there's a significant knock-on type effect from the facility itself on local government finances. And again, just focusing on the facility itself. The expectation is that there would be about 3,100 new households that will form in the area as a result of this. That's about 9,000 persons or roughly a 2.7 percent increase in the local population base as a result of the operation of the facility. And it's interesting if you think about where these folks are going to live, they have a wide variety of options to select from in terms of distance to the facility that is a reasonable commute. Everything from the urban core in Savannah, if a person is interested in living there, that opportunity is there. That's about 30 minute drive. If folks are interested in a suburban type living, there are many areas in West Chattam and Bryan County that would support that that are within 20 to 25 minutes of the facility itself. If folks are interested in a university town, the city of Statesboro and the associated college university amenities would be associated with a large scale university. That's the way about 40 minutes away. And they're in the rural area, in the immediate vicinity of the facility. They're around the order of 10 to 15 small towns if a person would like to live in a small town. There are at least a dozen to 15 of those within 30 to 35 minute commute of the facility itself. And to put things into perspective, the average commute in Georgia is about 30 minutes and in our metro area varies from about 20 to 28 minutes to 32 minutes depending on the county. So this is a very reasonable range within which these opportunities for growth and development would occur in a wide variety of residential type communities in the area surrounding the facility. To wrap things up a little bit, I would offer that this is going to substantially the facility itself, which of course is incentivized, is going to substantially and meaningfully alter the economic fabric of this regional economy. It's going to create an enhanced economic opportunity throughout the region and not just for the workers who are employed at the facility or its suppliers, because you think about what would happen to kind of, again, sort of think about it as a knock on effect. As individuals who already have jobs in the region are recruited to work at this facility, it's going to create opportunities for growth, development, promotion, and advancement at their current employers. So it's not just the economic activity that jobs the facility and the suppliers, as folks may be recruited into working for those companies, it creates upward mobility for individuals who already have jobs here. So these career opportunities through promotion development will be widespread throughout the region. I think about the small business opportunities that are going to be present to serve the workers at the suppliers, the plant itself, the suppliers, the ad-hung jobs from the recirculation of the $470 million of wages earned every year. There's going to be a wide variety of opportunities, again, across all the types of residential development, whether it's urban core and savannah, suburban development, small town development, university town development. Their opportunities for small businesses are going to be widespread to use a phrase that you may have heard of. This is going to lift all boats legitimately. For our savannah metro area, it's going to significantly, meaningfully, in a positive way is alter the economic fabric of the region. If I might just offer one bit of suggestion, humbly offered, if there might be a way to encourage our local municipal governments to accelerate their planning process to account for population growth, that would be a good thing, and also to carefully consider the issue of affordable housing in the context of the population growth that we are expected to see associated with development of the plant and operation of it. So that will close my comments. Thank you, Mr. Chairman. I'll turn the mic back to you. Any questions from the committee on this? And I will say in my district, we've got the SK Battery Plant and Bartrow County coming 35 under new employee. So we're going to be looking at similar. Good problem is a bad problem with that, and I think the good is going to weigh it by far outweigh the bad, but it is challenging to, when you talk about housing and workforce and all that, it's going to be a challenge up there as well. Any questions? Obviously, very thorough. Thanks for getting us kicked off, Dr. Tottenham. I appreciate you being here and appreciate the information. Thank you. I've got a question if you don't mind, Chairman Blatton. No, I'm sorry. Dr. Tottenham, thank you so much. I'm great to have you on my day. It's not too far away from you. Some of the things you said, I've got a question just to follow up to get some context. You mix in 20,000 jobs. Is there any other industry that you know? Can you give us an example of another plant in our area or heck it might be a military base for all of us? That has created that type of job growth in an area so we can just have some type of context. We are very fortunate and so in-savanted to have a manufacturing opportunity and research and development facility that you may be aware of this Gulf Stream matter prices. That's comparable. It's larger in magnitude in terms of direct employment at the facility itself so that's the scale of operation that we're referring to. It's similar, somewhat slightly smaller than the Gulf Stream operation so that's a very significant impact on our regional economy as well. One other question I have was you mentioned if you could offer one small piece of it, lies to us was about municipal planning. Have you seen in your research or even anecdotally a community that seems to be ahead of that doing that better that we can look to that you're not going to ask to say, look here, these guys do arrive and we can maybe replicate and point other stores. I wish I could offer that. I have guidance. I'm not well versed in that literature but that certainly sounds like a very useful and practical research agenda to pursue to see what are the best practices for communities that have faced these sort of issues. We may look to the to the north and west at the Kia plant for example. But those sorts of developments and the communities in those areas have faced or will face similar challenges. There are a large number of mega scale type investments in electric vehicle and battery plant facilities across the country on the order of easily 50 to 75 billion dollars within the last say five years or so. So there should be a wide enough to say sample of communities that could be reviewed and considered to see exactly how they address that issue. And again with the idea of identifying best practices so that we can learn from others experiences both as you say good and good and bad. How do we get there from here? My doctor may follow up with you later on so what you got on that. Appreciate it. Thank you Mr. Chairman. Great presentation and wonderful development. I have two quick questions hopefully. One is do you have any suggestions of how communities can address or what they need to help address the affordable housing? And then the other one is what were the incentives that you think were the best incentives to lower on that year so that we'll know for other future developments? These are starting to address issues that are really outside of my area of expertise so I think I may prefer to defer in general on that in terms of which specific incentives matter the most to firms. I know there's an academic literature on that that I'm not well versed in so I could not point to a specific item on the list and say it was this one. I would offer that collectively these all matter to firms when they're evaluating different locations for growth and development and the establishment of new facilities. There's a significant amount of competition among states and municipalities for these types of operations and my casual observation is that in the state of Georgia these are projects that are pursued rationally and thoughtfully and my sense is that there's not the desire to give away the store just to attract a few thousand jobs. I think there's a very rational careful and planning approach that is associated with the recruitment and incentivizing of projects in the state of Georgia. With respect to planning for growth and development I'm going to have to offer that one over to the planning specialists. I'm an economist so you know I know there's a lot of complication nuts and bolts and wheels to be turned in gears perhaps to grind a little bit in terms of laying out a planning process that may take several years when you think about all right we're going to we're going to identify this parcel for residential commercial or industrial development it may take two or three years for example for a house to be plotted on residential out of new excuse me on a new identified parcel for residential development so accelerating that process in some way would be great I wish I had I could offer a specific guidance about that and how to make that happen but I'm unable to do so. Do you see it Chairman? The two things I guess with the plan going 22 miles west to here and you talked about the various places that people could live and this may be not for today but tell me where we could find this information. It worries me when something goes in that large that one county benefits the most from a tax base if you will. I mean I know there were some incentives for the actual footprint of the plant and so forth but and the other county has to do a lot of infrastructure for people to get their presence all the homes go in one area but there's a road between that area and the plant that needs to be improved so that goes into a county that doesn't get the tax base in in flux so just the economic so that and then also in conjunction with that you you said this this plan is like your analogy the rising tide lifts all boats and and then you tell us we need to worry about affordable housing. Well if if salaries are going up if those things are going up how is it that housing is going to become less affordable are you concerned that the inflationary impacts of all the building materials needed at one time is going to make that happen so I'm I'm curious to see if if incomes are going up in a region it seems like we would have less affordability issue than we do now. With regard to your second question about affordable housing I would offer that in combination with a planning process and the the free market there should be opportunities to develop affordable housing in the region one of the more significant costs associated with with residential development is land costs land costs would be lower in the more rural areas in the surrounding area of around the plant itself within 35 to 40 minutes so there are opportunities I would offer that there there may be lower cost residential land available for development that would contribute to this idea of affordable housing in the region so I tend to philosophically believe that the free market has the ability to allocate resources in an efficient manner but I think in combination with a planning process I believe that the planning process could augment that free market process right so that I don't know. Just maybe if anybody else has any questions but just maybe other thoughts overall I know we're focused kind of on some of the economic development tools here and we'll be looking at other things as we you know go across the state but overall tax policy in Georgia I don't know if you had any any other observations that you might want to share with us. Dr. Tom. Again I'll defer that to the public finance specialists I'm an urban and sort of regional generalist economist so things get very much into the weeds on tax policy but to echo what Mr. Talison said you don't get to be number one in the country in terms of business climate for nine years in a row without doing something right so in that sense as he says if it ain't broke don't fix it we got to tweak things around the edges as things are required but fundamentally Georgia's well positioned and has performed and outperformed its peers in the southeast over the last decade or so. Fair enough thank you. Quick question I might have missed that came in a little later I was trying to park in the wrong place but the job tax credit seems to be a good economic incentive is there any certain criteria to get that job tax credit or any particular industry I have to defer on the fine analysis of the details of tax credits that's not an area of specialization I'm sorry. I guess I get I started logging the finally. He helped me out with this math I just don't under understand I get 20,000 jobs expected at the facility you said we thought 2.7 percent of the growth were 9,100 new people in the area I'm guessing the makeup them would come from people in this area already here moving up a level of jobs but what they have is you expect them that the lower level jobs mechanize or go away or help me understand that delta between the 9,100 new people but the 20,000 jobs. The 9,100 new people approximately in terms of population change would be associated specifically with the plant itself the 8,100 jobs there at the facility so some of the workers at that facility will be recruited out of the local area it is likely that a majority of those individuals at the plant will migrate to this area from somewhere else most likely from within the state of Georgia but there will be some immigration from out of the state. I'm not sure if I'm answering the question could you remind me and it could be just you have a lot better grasp other than I do when I'm asking but I'm getting the delta if you got 9,100 people moving in we got 20,000 new jobs I get it that in the area we'll move some people up to a higher job that'll be at this facility they'll make money as you spoke about the rising type raising the ships. What do you expect happens then to the lower level jobs you expect those get filled do they go red do they mechanize because I'm trying to figure out how I get a delta with 20,000 new jobs but only 9,100 people to fill them. Well that the in terms of total population associated with the fill city I would offer it would be on the order of about 20,000 people a little more so the math effectively would be about 9,100 new persons associated with the 8,100 jobs and so the additional knock on type jobs the supply chain jobs the jobs that are created as a result of recirculating income those also would stimulate in migration and population growth along with so it's the 9,100 is associated more specifically with the 8,100 jobs at the plant and so the addition there would be additional population growth on about the same order of magnitude to support the spillover knock on type effect jobs to the extent that they would be mechanized I think we'll see sufficient immigration to fill the jobs that we need in addition to the efforts that are being the carefully thought out efforts I would offer that are being developed to establish a pipeline of talent for the facility itself associated with the institutions of higher education in the area the technical colleges and things of that sort so there is an effort to supply that plant with the labor that it needs locally as well as what we can expect in terms of immigration. We appreciate your presentation and information and look forward to growth in this area for sure. Thank you. If Georgia Port is next if you want to make your way up and this has certainly been a shining star for the state from the Megalrell system to the inland ports on it we've got one up in northwest Georgia have some very logistics people apparently because we seem to be out servicing the other ports and sort of the envy of the country and one other thing I'll add unless the numbers have changed my area of northwest Georgia while it's the furthest from Savannah does the most business with the port and it's great for the whole state. Let's elect a leadership at work right there. The Housewoman with another great job. Exceptional. How long will the Senate? So my name is Jamie McPerry for those that I don't know I'm the Chief Administrative Officer at GPA and I was told that Dr. Tommel was going to allow you with a bunch of power programs with some you know Dazzle and whatnot and I've had like five minutes to just say something. So here we are. Good job Dr. Tommel. I think that most of you have probably been inundated over time with the the story of the port and who we are and how we work etc but maybe not so much how we specifically work on the economic development projects so I thought I'd take a little bit of time explaining that and answering questions you might have but so for for GPA you know effectively we are a state and business operation and self-sufficient we generate revenues to cover all the expenses of the operation and our cat-backs our customer that pays the bills is the steamship line but we have our sales department is basically divided into three groups we have carrier sales who really the ones are working directly with the bill payers if you will then we have a group that's focused on what we call BCO sales or beneficial cargo on our sales so they're working with the importers and the exporters you know growing their business attracting new business etc sometimes that involves a new economic development project sometimes it's just matriculating growth for existing customers and then the third leg of that stool is the e-time and development department self so we have a director of industrial and economic development whose job it is really to point out with the development authorities around state certainly to partner with the Department of Economic Development and Commissioner Wilson's team and you know working parallel on this project it's not our job necessarily to land economic development projects but it is a mission to help create jobs and foster trade for the state of Georgia so we work closely with the Department of Development around the state and the state as a whole to accomplish that and I think that I guess in doing a little bit of storytelling when it comes to tax credits the best program is one of the stuff they've been very valuable for the state of Georgia and recruiting projects to the state about 20 years ago a small group of us and frankly it was a move working on the JCB project is a local manufacturing facility but to get it over the kind of finish line we needed to come up with something that was a little bit more than what was in the in the kitty to begin with and so we created with the help of Mr. Stevens is here and he was a great help to us then but we added on kind of bolt on to the best program this purse job tax credit that allowed you know candidate industries to come in if they were meeting all the criteria of the best program and also were growing trade through the ports there could be just a little bit more and that was a big key in getting JCB here in that program and then that's a local example I guess but when you look at whether it is northwest Georgia and northeast Georgia, southwest Georgia throughout the state there are projects that we've worked on that don't necessarily seem like their port projects because they're so far away but they are trading through the ports and are benefiting from the best program as a whole as well as that port jobs tax credit addition we're impacting well over half a million jobs a year in the state just the poor operations and a lot of that has to do with the work of the folks in the room again recruiting new business as well as growing the existing industry in the state and with that little story telling I'm happy to answer any questions again I need to be exhausted by Dr. Thomas PowerPoint so I just extended my presentation\n\nI'm pretty loud and that's better. All right, just a quick question. Follow up. Obviously I'm up in Dalton. Chatsworth's has a port rail system. You guys have up there. And my question to you is, do you see the, I guess the feeling I have about it is there's a lot of one way traffic headed up there. And is there a remedy in the future to kind of help alleviate just because I know dead legs are tough in your industry? And so the question is, what is the capability of us producing stuff that up in the Northwest quarter that actually leave the country and be more beneficial for the port itself? Sure. So I think, and I'm overly generalized and say it's about a 70, 30 ratio. I believe import to export going through that facility. And you're right, the more balanced. And this on import export at the terminal and the ships is on import export if it's coming to going from one to the rail facilities. Anytime you got balance, it's opportunity to be more profitable. I think when you look at what works in terms of a, as a rail destination, it's distance and volume to gotta get you to the math. You've got anchor industry up there. Certainly the flooring industry is, is she use her great customers of ours and it is a strong export industry. Continuing to grow manufacturing in any area is going to create export opportunity. Not that all manufacturing is export. A lot of it is certainly domestic. But just looking at the more opportunities to develop manufacturing in an area is going to help with the export. Of course, Georgia's largest export, largest industry period is agriculture. And so there are areas where like we do have a plant port in West Central Georgia, it would be very near the Kia plant. And that is an anchor, kind of like an anchor at a shopping center. But the ballast of that is the ag that's going to be coming out of that area. And so in time when we're able to develop that facility, it probably will be a little more balanced right at the start because of the heavy air ag coming out of that area. But ag and manufacturing is your export opportunity out of Georgia. Thank you. Yes sir. Okay. Thank you, thank you for what you do. Appreciate the presentation this morning for being with us. Great opportunity. Thanks for having me. Yes sir. Thanks. I will have PowerPoint. That's where everybody wants. All right. Next we've got the panel discussion with our Savannah Regional Business Advisors. If you want to make your way up. And I did finally after not being able to a few times get to go through the Gulf Stream facility yesterday for about, it's about three hours. It was a really good presentation. What they do there. This one. This one. Okay. You guys, please. You know, hold on. What do you want to say? Oh, I see. I'm going to kick it off, Mr. Man. Yes sir. Absolutely. Well, thanks again. I just had my appreciation for all the businesses that are represented here and what you do for George and George and thank you. Thank you, Mr. Chairman. Glad to be here this morning. I, in honor of our friends, Chris Clark and Kevin Perry, I've been wearing socks this morning. If you guys are at the congressional lodge, I hear chamber execs are not supposed to wear socks. So I'm trying to get into that mode after being 20 years in government. So really glad to be here. My name is Bert Browney. I'm a present CEO of the Spanning Area Chamber of Commerce. It's great to see somebody friends in the room. I've been down here since February and frankly, I moved down with my family because of the opportunity that you heard, Tripp and Dr. Toma talk about this region is really poised. It has been an incredible place for, you know, 290 years now. The city has been really a beautiful spot for heeling the coast for our stay, but really poised to do something really special down here. And really, if you look at the growth that's having in Savannah, it tracks the state's strategic industries. If you look at advanced manufacturing, which you're going to hear about with Hyundai and with JCB, that Jamie talked about with aviation and Gulf Stream and what's going on over there. With our tourism and visitation economy, the state has invested almost $300 million in expanding our convention center across the river. And so we're about to see, we've already seen a lot of growth in that space, we're about to see even more as well. Logistics and the port business that you heard about from Jamie. And so, and then of course, our film industry, which has been here for a number of years, but has been, has increased, certainly as the tax credit came in. And we've seen a lot of that work here as well. And so really across all of these really strategic industries that the state has put a party on, we've seen that growth happen here in Savannah. So a lot of that's due, turned it to the state leadership and making those areas a party, but then also our local leadership, which was welcoming of all that. You know, over my career, I've been in meetings with a lot of y'all as we tried to figure this stuff out, both on the tax credit side as well as on the balance in the budget side and it's difficult. And I can tell you that we appreciate the position that you guys are in to try to balance how we fund the necessary activities of government that will also be competitive and that we are helping our industries create new jobs for our citizens and higher-paying jobs where they can raise the quality of life for their families and then also participate in our communities as well. So it's been an honor to be a part of the system for a couple of decades now. I could not be proud of our team over the Department of Economic Development and what all they've done. And then the role that you guys have played in helping us to really be the envy of a lot of our neighbors and a lot of folks around the country who we compete with and really proud of the story that you're going to continue to hear as you are in the state and you think about all these different growth areas that we have. So I'm really pleased to get out of the way and let these guys next to us talk. I'll do, I'll go one at a time and introduce them individually. We'll start with Gulf Stream. The world's best business jets are built right here in Savannah, not just built, but also all of R&D is done here with a lot of Georgia educated engineers and designers that are here and only doing the cabins and the wings, all the aerodynamics, and really proud of the Department of Toma Mitch and the Colorado Lincoln, I'm going to pack those guys have as well. I'm not able to purchase a Gulf Stream myself and I am able to be proud of them being here. And so Mark Bennett is here. He's pinch-hitting today. Jay Nealey had a little moving injury that he's suffering from, recovering from. And so Mark has stepped in. Mark's been a part of all these conversations and is going to share this little bit about Gulf Stream story and how they have expanded, chosen to expand here in Georgia when they certainly could have went in other places. Good evening. Good morning, Mr. Chairman and committee members. Thank you for inviting us to make a few remarks regarding Georgia's tax policy, specifically tax credits and exemptions. Tax policy is a tool, particularly in economic development, to encourage companies to undertake activities, which may have short-term costs, but result in long-term benefits. And when you think about the many tax credits under review here in Georgia, they are often used as tools to encourage certain actions, sending signals to the marketplace, to encourage actions that are likely to result in broader and bigger benefits in the future. Many of these tax policy encouraged companies to make investments today that will pay off big tomorrow. I have a firsthand account of the investments Gulf Stream has made in Georgia due to your leadership in crafting Georgia's tax policies. You have to year Gulf Stream investments in Savannah and Brunswick have created high-paying jobs for Georgians. Gulf Stream relocated its headquarters to Savannah in 1967 for the stable positive business environment. And in 1999, General Dynamics purchased Gulf Stream and due to the same stable positive business environment that Georgia leaders have created today, General Dynamics has invested over $1.5 billion in Gulf Stream Georgia, making Gulf Stream the largest manufacturer in the state in terms of employees over 12,000, and a payroll which is $1.2 billion annually. The state's tax policies enabled and encouraged much of the square earth. For example, since the passage of the sales tax exemption on parts and labor used in maintenance of General Aviation aircraft, Gulf Stream maintenance business has grown so much that there is now more General Aviation maintenance done at the Savannah airport than any airport in the world. In fact, nearly 3,000 Gulf Stream jobs with an average salary of $87,000 per year, not including benefits, are in Georgia because Gulf Stream customers choose to fly their aircraft to Georgia for maintenance, flying over many states who do not charge, excuse me, who do charge the sales tax. Additionally, these customers come to Georgia with the aircraft and stay in local hotels and local restaurants for several days and even several months. In fact, nearly 400 hotel rooms are we not or booked by Gulf Stream customers, suppliers, and visitors. Similarly, the R&D tax credit draws research and development that requires highly technical and highly paid professional air space. General Dynamics has maintained its commitment to performing 100% of all of our research activities here in Georgia. We have nearly 3,000 employees here in Savannah who work in our innovation and research labs with an average salary of $155,000 per year, not including benefits. It's important to realize all new Gulf Stream technologies and aircraft are Georgia-grown and our primary competitors are based in France, Canada, and Brazil. New innovation is a competitive advantage for Gulf Stream as we compete against these foreign-based manufacturers. Our competitive environment requires Gulf Stream to continually invest in research and innovation. And we are investing in research and new technologies to manufacture aircraft that are bigger, can fly faster, and further, and safer more efficiently with less noise pollution and higher quality than our competitors. It's also important to note that we invest the tax credits back into the business and the state. Gulf Stream investments in support of R&D and Georgia extends beyond its gates and into the local community. Those investments support R&D for air space and other industries and include substantial contributions to public educational institutions for development of a highly skilled Georgia and workforce who can support the growing R&D economy. For example, we've invested more than $10 million in the Savannah Chatton County Public School System to fund the pipeline for our engineering jobs and our touch labor. Savannah Tech, Nicole College and TCSG, nearly $1 million invested in the local Savannah Tech to fund our manufacturing and our maintenance programs. In Georgia universities, Georgia Southern University College of Engineering, and UGA College of Engineering more than $3 million. In fact, Gulf Stream hires more engineers than Georgia Southern than any other employer in the state. As Gulf Stream celebrates its 56th year in Georgia, it supports the state's continued focus on tax policies like the tax exemption on maintenance and R&D credit. Both encourage high quality jobs in Georgia and expanding economy state. Mr. Chairman, committee members, appreciate your time today and your unwavering leadership and continuing to support Georgia being a great place to do business. Thanks, Mark. Chairman, you're on way tall after we get through the questions. I do want to point out, Mark grew up in Blackshear, Georgia, and he is not the most famous Bennett from Blackshear. Now, there are multiple Bennett clans in Blackshear that he can't claim to be related to our two-time national champion quarterback. Very pleased to introduce Chris Smith. Nash, Chris is the general counsel over at Hyundai, has moved into our community from Montgomery. Got a no-cress over the past few months. Really, really pleased to have somebody over there that answers their phone at which Chris does. And I know he's getting sick mostly of trip, not as much with me, but Chris has really been a great addition to our community and there's really been our connection point, our local leaders, and as they are whenever our folks call. And so after a long career in Montgomery, he's moved his family over here, and we're really pleased to have Chris here. Chris is going to share a bit more about the Hyundai development. Right. Yeah, thank you so much. Thanks for having me. So a little bit, I think the real value that I can share with this panel is the story of how Hyundai chose the Bryan County sites. I'm kind of rocky through that. And then of course, the big part of that's going to be economic incentives. So a little background on the, I came from Montgomery, worked for Hyundai in Montgomery for 17 years, serving as general counsel there. I kind of picked up economic incentives and negotiations with the state. That skillset over the last couple of years. And so, sort of an in December of 2021, Jose Munoz, our global chief operating officer, was composing a small group of Hyundai employees to do site selection. Because of my background with economic incentives, he asked me to join that team. And sort of in January, we started the process of looking at different sites throughout the United States. I think it's really, really important to note that Hyundai being the third largest car manufacturer in the world is making decisions on not only what countries to make or to place its plants, but also where in those countries. And so once Jose was given the green light to look in the United States, our team quickly got to work. In January, our team visited numerous sites, precisely 13 sites and seven states, and just a couple of days. One of those sites was the Bryan County site. From there, in February, our top management in the engineering team visited several the sites. At that point, we're certain to down select the different sites and kind of cross sites off our list. I will note it's highly, highly competitive. I would kind of describe it as a very intense competition. And with that, we got down from 13 sites. Then we got down to that point, five sites. And then in March, we then downgraded or deselected down to four sites. And Bryan County, of course, was one of those sites. Those four finalists came to Hyundai Motor America's office in California, made their presentations, and with those presentations, they actually gave their incentive offers as well. After that point, there were some rounds of negotiations, and then in April of last year, we notified Georgia that we had selected the Bryan County site. Our look who was sitting to my left works with KPMG, and Eric was a very, very key part of our team. Hyundai had hired KPMG to serve as our consultant, the whole process. They were with us during this first site selection tour in January. They were with us the whole process, and are so with us today, helping with construction management as well. So looking back on it, I kind of see kind of big picture, you know, why do we choose Bryan County? The first reason is aside itself. And without having the proper site, there's really no, it's just like an economically viable. So everything from the geotentical aspects of it to the configuration, the transportation, likewise, you want something very visible. So there's four miles of interstate 16 visibility. That's really important to our brand. Beyond the site, reason number two, would be the Savannah metropolitan area. In addition to having a great brand affinity, I mean, Savannah is just a great place to be, it has all sorts of brand attractiveness. It's also wonderful when it comes to logistics, and so the Georgia Port Authority gives us huge logistical advantages, like ours, all the interstates, and the transportation of well. Including real access. And then third is, you know, part of that is the corporate peers as well. And so there was over 25, fortune 500 companies located in the region. Of course, Gulf Streams, one of those. And that was a big plus in our books of locating in Savannah. The third reason is the Georgia and local officials. And I was just telling all right before this panel started that, I think during the process, I'm looking back in January, that's probably one of the areas that underestimated is how important it is to have a great team. The Georgia and the JDA have been absolutely fantastic. And fantastic partners, and that goes beyond money, nearly all the time. And so finding solutions when we have problems, being there and being supportive. And so in this room, a fantastic group of people. The fourth reason, there is one where we're here today is economic incentives. And economic incentives are absolutely critical for Hyundai's decision. And I think probably most company's decisions are where to locate. Going back to January of last year, when we were looking at what sites to visit, KPMG put together kind of the lists of on our 20, 25 or so sites. And of course, each of those sites were based on a number of factors, including what the economic incentives were probably look like among other factors. And then as we kind of progress through the process, going back to April of last year, during the final presentations, again, economic incentives came up. And trips at a best, we had an interview with German Public Radio last week and he said basically, and Synodes, you know, everything else gets you on the one-yard line on the football field, and Synodes gets you across the goal line. I would probably say it gets you on the 10-yard line, and then Synodes helps you kind of punch it into the end zone. So it's certainly very, very important. And with that, you know, it's, I know companies really crow, productivity and consistency, and knowing what we're getting on their front end, because we're running different business models to determine how profitable a facility is going to be, or even if it's economically viable. And so having that consistency and predictability is really, really key. So with that, again, I hope that's kind of health that I understand, kind of pull the cart, quote, and back a little bit, and be very, very transparent with you guys, how we located in Fountain Bryan County and in Chose Bryan County. And I'm happy to answer the questions, but I guess I'll turn over to all of it first. Thanks, Chris. I wanna just quickly pull out one of the points that Chris made there. I've heard the economic development projects described as dating, and you're trying to look for the right match and the right made. And I think Chris has pointed by that down-selection process is really important. It's really more like being on the bachelor, especially when it said OEM, because you've got this shiny stud, or the bachelor hat, I guess. I don't watch those shows, but I get, I get, I get my point. But you got this one company that everybody's trying to woo. And there's a lot of factors to go into that, right? And so we gotta get on the radar, obviously, to make that very first cut. But then it's really not about picking you. It's about not picking all the rest, right? And so every one of those steps in the process, we felt, the team felt great at every point, because we had a previous relationship with the sister company in Kia and New Chairman Chong and a lot of the team and all the work too, that I'll introduce in a second. But really, each one of those stages, you can get caught. And once that happened, you get in the limo and you drive off, you don't get to play anymore. And so we were really fortunate to stay through the end and really find a great partner that's gonna be here well past the five years that the job tax credits, when they are used up and they're expiring well past all of those incentives are gone. These guys are still gonna be here making, we're making the best planes. In the world here, we're all gonna be making the best vehicles if you guys have been, particularly in a Genesis EV, there was beating Tesla on all of the rankings and the ratings that are coming out. It's really, really special and unique vehicle. So really proud to have them in a region. So the third member of our panel today is Ulrich Schmidt from KPMG, Ulrich has become a really good friend to Georgia. When I was at the development in the mid 2000s, about a quarter of the projects that we worked had size selection consultants and that is completely flipped now. We see about three-fourths of the projects that we have that are companies that are hiring a partner to evaluate the sites and the geotechnical and the incentives and all the different, the workforce and all different pieces that go into that. We keep already busy. He's here a lot. He's actually been here on some site visits the last couple of days, not here, in Georgia. And that piece is something that we have really focused on developing relationships with a size selection consultants, making sure they know what sites we have, what our touch-grinder programs are, what our workforce looks like, what our educational system, what our transportation is, all those things that go into an analysis and really please have Ulrich here. And you know, always got this perspective. They didn't just work in Georgia. You know, he works all over the place and is gonna help us understand a little bit about that process and how we measure up. So, thanks for being here. My name is Ulrich Schmidt. I'm a principal with KPMG's location analysis site selection practice. I've been with KPMG for 24 years. I'm based in Philadelphia. First of all, I'd like to thank the state of Georgia for sending the entire Georgia Bulldogs defensive line to the Philadelphia Eagles. We'll see if it works out this year. It's gonna be important. Thanks for inviting me. I'd like to offer some comments and some perspective around the overall process on site selection. So, I'm what you would call a site selector. So, if you've never seen one, they could look like me. Our work involves advising clients really in selecting locations for major investments. We work through a wide spectrum of industries. The background on the site selection process is usually it starts with figuring out a targeted geography. And that could be a state. It could be a couple states. It could be entire East Coast, for example. And then we analyze locations that can meet the specific clients project demands. And those are manufacturers. As Chris has mentioned, you know, supply chain customers, suppliers, infrastructure, logistics, all figure into that overall location decision. And I'm talking about locations not yet sites. Once these locations are filtered to the ones that are perceived to meet most of these project requirements, we actually get down to the sites. And we prepare a comparative cost analysis. So, looking at all the different factors, a lot of times it's really workforce. Workforce is a key factor. How can that pipeline of, you know, five to 10,000 new jobs be met in a location? But also the site is the site ready for development. Can the site meet the project timeline? Projects are moving very fast these days, especially in the advanced manufacturing, automotive industry. Projects are moving at lightning speed. And need sites that are essentially shovel ready. So, you need to have a site to compete. And that already takes some investment up front by the state and the community to make these sites really marketable. Oftentimes, that's your first incentive to have a marketable site that has the infrastructure, the utilities, the road connections that can actually meet these aggressive timelines. The process then ends with the comparative cost analysis. So, we look at all factors from labor cost, utility cost, one time cost of acquiring a site, you know, construction cost to the tax environment. It's a recurring cost for companies to have, you know, pay taxes and various taxes. And then incentives are essentially the offset to what that bottom line might look like. At that stage, you're looking typically at two to three sites that are competing. In this case, it was four finalists' sites. Really, the construction ready product, I would call the first incentive, but tax credits are important to help offset certain costs. So, depending on the company, depending on the project, depending on the operation, various incentives could have various values depending on the industry. Not all companies are significant income tax payers or maybe not initially. So income tax credits may or may not have a very direct impact. Usually, they have an impact because they have a carry forward in companies that can then claim credits in the years where they actually have income tax liability. But there's sales tax, there's property tax. So really, everything goes into that calculation of a bottom line operating comparison, operating cost comparison. And that ultimately gets offset by incentives. Companies in Gulfstream have mentioned it both compete globally. And I think that's a point that needs to be kept front and center. Companies have the option to invest in multiple locations. At least, a lot of our clients have multiple operating locations in Asia and Europe, in the US. So it's not just a competition between states, it's a competition globally. And states and regions and countries also compete in this game. So you're not only competing with South Carolina or Alabama, you're competing with Mexico, Canada, Asia, Europe. And as we sit here, the European Union is developing some very aggressive incentives to attract the chip industry. And they've been successful. You've seen major announcements for Intel. You've seen announcements for Tesla in Germany, which is a high cost operating location. But it happens. So it's a competition globally. And what companies are looking for is locations that can be. They're operating environment really in all regards from a overall labor perspective, operating cost perspective, supply chain perspective, but also cost perspective. When you look at individual programs, and I know that's somebody that's on everybody's mind, like I said, it depends on the industry, the company, the type of project. But typically, these incentives are a temporary savings. Companies need to do something to earn these incentives. So states built in safeguards. So do the Georgia and Center programs have safeguards built in that you need to do something first before you even earn the incentives. And if you don't do something, they are clawbacks. So there are actually mechanisms if companies don't perform that money can be clawback. That is a good thing. So everybody's held accountable to their end of the bargain. And most states have these types of programs. And I would offer that the Georgia programs, like the Georgia Drop Tax Credit or the Mega Credit or the Quality Drop Tax Credits are very effective because they can help offset tax cost. In the case of the Mega Credit, they can provide direct cash rebates to companies based on their withholding taxes that are being paid. But you need to meet certain requirements to qualify. So this is not just a free giveaway. You need to have certain salary levels. You need to have a certain size of a project to qualify for the Mega Credit to even.\n\nin the discussion and that is again it's a good thing to have these types of requirements around some of the programs to make sure they really have the right effect and the right outcome. Now looking at Georgia's program or programs like the withholding tax credit for example which is very effective, Georgia is not the only state that has this program. So does Alabama, so does North Carolina, so does South Carolina. So you know programs are interesting at the front of this process where it's almost a marketing tool to get into the conversation. But in the end they're really effective because they get evaluated to help offset costs and it is truly a comparison of one location versus another. That always is the case that the cheapest location wins like we said multiple factors play a role here but incentives can be the final kicker that brings a project to fruition. So with that I'll answer any questions. Thanks Laura. Back to you. All right we appreciate all the presentations and we know this area is booming and Georgia is doing a great job in that. You know you talk about all the incentives and you mentioned North Carolina, South Carolina, Georgia of course Florida and Tennessee have higher sales tax but don't have an income tax so you're not going to need income tax credit there. So tell me the thought process on that. Yeah I think states have done a good job to adjust their programs and their tools to their specific environment. If states have low income tax for example they're typically looking to offset other taxes. They might increase some of their cash programs, they might increase you know other contributions to a project but I believe it takes both. It takes a competitive tax environment and it takes some incentives or the right tools that can be combined to address a company's need. Like I said you know companies oftentimes don't necessarily have income tax to begin with or it takes them four or five or six years to ramp up before they even generate a tax liability. In that case other programs are more effective. So states have figured out that there's not one size fits all approach either low tax environment or incentives it's usually a combination of both to make locations attractive. And after I said that I remember that Florida does have a corporate income tax of five or a half so that would be a factor there. So we had an audit done of the you know we send out through fiscal audits and we were hands off of it of the job tax credit and their analysis was that you know they had a lot more jobs than the direct jobs and all that but in the end they believe that only a small fraction of those jobs would have come where a direct result of the job tax credit that most of them would have come anyway. And so that's the hard part I know for you guys for us is you know how do we decide that kind of thing as a state. Chair, if I can jump in real quick on that. Well if I could add to it for you to do that too you know we'll have maybe ten different credits and the way each Greeks report comes out their one credit is solely responsible for everything that happened and measure anything you get against it so if you could drive that. Yeah that was going to be my point. I mean I think unless you talk to each company that located and ask them on their matrix what was you know what was the deciding factor and I think all were excited I mean there's never one. And so you know if you want to take one tax credit and say well they would have happened anyway without the jobs tax credit well I mean you also have the other programs that build the case and by the way investment and transportation and education is also an incentive right I mean the fact that we have a transportation system that they can use that we have a port system that is that's the best around that we've got education system and higher ed system so all those things are you can think about those as incentives as well because it all plays to a part of the story so unless you went and talked to each company and said you know would you have come here if not for the job tax credit I mean maybe because of all the other things too right and so it's a whole package together that they make the decision or they might not have because maybe not having that one program would it we wouldn't have got across you know the one yard line in the metaphor earlier and so you know I don't know how you would do that how you would say that with any confidence without having the companies themselves tell you yeah this was the factor you know that led to our decision or not to our decision and I don't think it's ever one factor that does it I think what Burke said is absolutely right you know it's the whole package is the environment it's the stable environment you know when Gulfstream looks at adding capacity we do look at a number of things in the tax environment especially as Mark mentioned the stable consistent approach to that is incredibly important so you know a real real example you know prior to the sales tax exemption on the MRO here in Georgia we had an opportunity to add capacity to maintenance and we really wanted it in Georgia we worked with our parent company general dynamics but at the time the business case made sense for us to put that MRO facility in Massachusetts and after that decision was made the sales tax exemption here in Georgia was put into place and a few years later the sunset was removed and since that time we have built so much capacity here in Georgia for the for the maintenance program as I mentioned earlier there's more maintenance done here they need any other place in the world so it is a kind of case by case expansion expansion consideration and one other thing too in in Bartow County with the escape plant coming there and with key sales between representatives of Carpenter's district and Bartow getting about I think they're splitting that about 50-50 anyway the local government there because of 75 and because it's booming their opinion is they're coming anyway and so they're getting their you know the property tax is right off the bat and because of that you know they're looking at close to a 50% increase in their digest but they also say you get something that's massive we've got constipation you know and otherwise it's on the backs of the other local tax payers to pay for it so these I know are you know well I don't know for sure because I don't have access but they appear to be projects of regional significance and I know that has to be hush I should understand why but it's it's just hard for us to get a grasp on you know what is what is needed what isn't needed in that yeah and I think the suburius of the Georgia system right I mean each local entity can decide what makes sense for their community we've had we've sat in meetings with with local governments that have put abatement schedules on the table that that you know that we didn't I won't say we didn't agree with but we were surprised that they were that they were so generous but that's a local elected official local economic developer they're making that decision local development authority deciding what what they want in their community and you know and if that's the decision in Barton that works for them then that's terrific that's great and other communities are more I mean I would tell you that a lot of rural communities that we we work in they you know they don't have a problem you know giving up a little bit in order to get jobs so that there people don't have to leave the county that they live in to work they can stay closer to home and I think this whole you know rural economic development push that we've seen we've allowed the communities to decide for themselves you know what they wanted to do in terms of partnering with a company and bringing them in and each project is different I mean you don't you know you're working with them you're seeing the numbers and you have to kind of put your you know your best foot forward but always there's an analysis of is this going to be worth it for our community and if not and so and we do that at the state level too I mean I don't you know I hope nobody ever thinks that there's no recognition of of what the cost is to you know to the state or to a local government when these things are made I mean there's a lot of analysis done to make sure that we're getting a you know a return and that the project's going to be beneficial for both our state and for our local community I was going this question or thought is for could be for bachelor number one two or three but I think when you look at tax exemption and tax credit you have to look at the halo effect that it has as it moved just beyond just the direct give and take but how to fix the community lumber electricians etc something that I think the least favorite Bennett talked about these guys but Dr. Thomas yes spoke to that too right I mean I think that's so important to recognize understand that it's it's really the generating factor right to your point it's it's not just the jobs at the plant but it's all the small businesses that that come along beside and provide services to to the project and really you know that's that's where we rely on our of our friends and the and economists were all to help us understand that and know what that that looks like but I can tell you I mean we've seen some of the numbers with with the Gulf Stream you know employees and how they're spread out not just here and not just in bronze but but literally all over the state and Jamie talked about the ports earlier I mean the impact is even far beyond just us locally yeah that's right senator you know the supplier relationships with Gulf Stream is as far reaching Effingham County for example is that the largest privately owned company in Effingham County is a Gulf Stream supplier it's Edwards Interior so we see that happen all the time but there's also some large companies who relocated to Savannah so most recently CIE which is a Canadian company they relocated are actually built a new facility here to support Gulf Stream CIE conducts flight training for Gulf Stream pilots and mechanics and flight attendants so you look at those jobs but you also look at those pilots are coming from all over the world to come into Savannah for six to eight weeks at a time every year to to be certified as a pilot so they're staying in local hotels eating at local restaurants for for six to eight weeks and that requires over a year those pilots you fly Gulf Stream have to be certified every year and they like coming to Savannah another example is on the aircraft it's it's a Rolls Royce engine so if you go out by the airport you'll see a new Rolls Royce facility that was built in Savannah because of Gulf Stream and we dropped the engines from a Gulf Stream carted across the street and they rebuilt those engines there so it is a far reaching you know opportunity or halo effect when you look at suppliers especially airspace suppliers and another high-tech manufacturing Good morning good morning my show this is working on thank you for the panel very very informative I think what we've talked about in the past is kind of an art and a science when you're measuring this right it's not simple just to put the numbers together with the halo effect I do want to give a quick prop to our Department of Audits they do include a halo effect when they do these reports so whether it be the folks on the committee or in the audience today they have taken time to put that in there thank you yeah yeah this is just a statement sort of in the form of question that seems to be the way we're going this morning I get it if somebody gives you more to come you know you're gonna come there well what I think we we see here and what the businesses that have been around and been investing in Georgia for hundreds of years see and I'm just gonna be honest if it I don't mean to dampen this you know but I want to be honest about it is Hyundai came here for those incentives tell me how much it mattered to them that three in four were coming online at and down in Augusta there's there's two nuclear plants and you weren't gonna build in Texas where they have an unregulated electric market and it gets really hot in the summer and really cold in the winter and you have it right so I just looking at that we're focused on tax credit here but I mean I think Georgia has a lot more to offer when you're lining it up if it comes down you're just picking us because we're we're spending more money there then we're not getting credit for the people that have built the state you know for the last 200 years and the investments that Georgia powers made and our ratepayers have made in doing that so I just it sets me back a little bit so tell me how much that met in the decision for Hyundai the fact you knew you're gonna have reliable clean reliable affordable energy yeah sure that's a great question um so as I mentioned earlier there's a number of factors while we chose Georgia economic incentives was kind of one of the four that I mentioned and to be perfectly honest with you Georgia did not offer the best incentives now they were within the ballpark but they weren't the best incentives and so how did it not go chasing after the dollars that have been speaking it's a decision to where to locate utility was a major component as well utility cost I recall KPMG doing analysis of how much energy cost and you know where they're facility obviously we're going to be Georgia powers probably one of the bigger customers and so but absolutely you're exactly correct I think energy reliability as well that was also another factor we looked at so yes you're exactly correct on that fine I just want to thank you for doing that that's the offensive line driving the out of the cash or businesses I just want to acknowledge that fact that it's not all about credits absolutely and I'm adding there too you know Georgia Powersman Fantastic Partner through this project they're you know ahead of schedule um that fantastic to work with on the construction side and and uh then a fantastic partner hang on with that microphone uh so I got a question because I I felt like I've done just a hair bit of research but I'm not fully educated on the process but I seem to recall that Georgia was not the low cost provider of incentives in this deal that Tennessee we left they they were actually came in much much more aggressive than we did but we were still able to land the project because of the port and electrical concerns etc is that correct can can a poker pay or say yes that was him that you're correct as um as I mentioned you just a second ago Georgia was not the did not offers the most incentives and uh um but again it was a within the ballpark is where I probably put it um if if it was you know grossly under everyone else then then we would not be in Georgia but um there's a number of factors and I really do think it's because of the um I think that I think the really good vision of our leadership to realize it's more than just the initial money it's also relationships and that's kind of touched on earlier having the great relationships with with uh commission Wilson the local officials as well I mentioned earlier the Savannah metropolitan area likewise aside itself and so but but again I think it's incentives kind of kind of using the football analogy kind of helps you kind of punch it into the end zone sure but I think as legislators that's what we want to hear I will want to hear the Georgia's competitive but we also don't want to feel like where the person has to take them out to the nicest restaurant to get her to go out with us right every now and then we'll be able to pull through Chick-fil-A drive through and make her happy and then I've got a I've got a question for uh Mr. Gulf Stream uh you know there's there's a lot of conversation on the R&D tax credit um um I'm obviously a big fan of it because I think that it invests into the future and and you can't monetize that R&D investment on what it's going to do for your business your your existing businesses and so I see it as it as an incentive for our existing businesses to grow and I would just like for you to talk a little bit more about um how Gulf Stream looks at an investment in R&D today and how you extrapolate that is it a five year window ten year window how do your models work on that yes sir thank you um the the the innovation of Gulf Stream is is what sells aircraft so it's a continuous investment in R&D facilities um it takes about ten years from the time uh an engineer first kind of draws out a product until a customer receives the first aircraft so it's a pretty time consuming process uh it's a reoccurring process we have three aircraft currently in some phase of R&D so if you if you keep up with airspace you probably read about the G 700 is we are hoping to get certification from the FAA this year and start delivering net aircraft to customers one right behind that is the G 800 uh we'll be coming behind that in a couple of years now it's the G 400 and those are the products that we have announced publicly um those of you who have toured Gulf Stream you you've noticed the black curtains that I don't talk about kind of what we have announced uh it is behind that curtain it's a very competitive industry uh as I mentioned earlier our competitors are the Brazilians the Canadians and the French uh they would love to know what we do in the R&D timeline um we we're typically about a generation of head of those other competitors because we're constantly reinvesting in the R&D um uh Blob cycle and in George is a good place you know you guys have invested heavily in supporting up that R&D landscape uh mentioned the Georgia Southern University College of Engineering a great school they're producing great Georgia graduates who grew up in Georgia they want to stay in Georgia we're very effective at recruiting those students the new College of Engineering at UGA similar situation uh the Dean there's doing a great job where we have a great landscape in Georgia to continue pushing this as a high tech area and aerospace as a part of that yeah I'll quickly add to the right notable chairman Fudont's point I uh we almost never the the most aggressive on incentives I mean I say almost because we may have in a very rural part of the state uh got really aggressive because we were you know trying to uh drive job creation in an area that had not had not seen it uh lately but um you know almost always and in some programs are very different other states write checks and they literally just write a check out of their budget to a company for them to use sort of however they want the vast majority of our incentives are uh our tax credit based as as Orrick mentioned where you have to do something in order to qualify in order to get it it's not a cash outlay that that um you know that uh that comes straight out it's you know it's it's savings on future uh taxes and and when you see those numbers that are they get reported uh in the media about what the the incentive package is you always have to remember that's a maximum they could qualify for right I mean a lot of times uh companies are are not able to fully qualify for every piece of the of the package and I sent them to analyze and see what's actually you know uh attainable uh for them but what our role is to give them sort of here's all the things that you could do uh you know don't work with their accountants and their and their and their consultants they'll figure out uh which programs are qualify for which ones they don't but ultimately our job is to say you know here are the different programs that the state has and and here's all the ones that you could potentially qualify for so that that number that gets reported in the in the offer letter you know is is most likely not the actual number uh that the company will end up uh qualify for but but they're able to do that analysis and and they know that so it's not we're not writing to check out the treasury we're not you know not uh giving cash out to companies which a lot of states do uh ours for the most part unless it's an investment in infrastructure whether it's a water sewer system or whether it's a new interchange or a training facility something like that other than that it is all based on your performance either investing or creating jobs or or doing R&D or whatever the whatever the program specifically incentivizes. I really thought about the best way to ask this question so I'm going to stumble through it a little bit maybe y'all can help me out but you know for bird for all of a kind do we um when you start uh saying that you know like a Hyundai or a Gulf Stream and they're out there in the market I mean do you have a pool of all these different international and domestic sites uh or all 50 states or do you kind of end up with uh a top 12 that you roll down and you know where you know I would think Georgia's over time is worked itself maybe up into that that short list if you will and then I guess shifting to boat a little bit you know you've been in a long time I mean what you've seen where you know when we you know we're at a point where we could you know just just wanted anything we could get and now we're at a point where you know maybe we we are more selective or can be more selective along those lines and then I was going to ask Chris if he'd go down that list of ABCD again if he would before. And so I think you're asking kind of two different questions um and I'll let I'll let Orrick give his perspective but there's the site question is a separate one that I'll I'll take care in a second the the are you a stable and business environment do you have good leadership are you a place that welcomes investment uh all those things that kind of gets you a reputation around amongst all of these colleagues about are these folks easy to work with you know can they do a project because ultimately they need to land the project for their for their client right and so that was a real push that that we started making really I'd say in the early mid 2000s and we continued that for for 20 years really putting a focus on making sure those guys know that we are open for business to your point that we are that we're ready to work with them a partner with them and figure out a way to solve the problems that they face when they may land a project the site question is a totally different question you know we have historically not had the sites that other state other states have invested heavily in site programs uh and and when you go to these conferences with the the site sliders they can tell you oh it's the megacite over at Huntsville or it's the megacite in Memphis and you know they get known these sites get known uh the the Brian County site is really you know an interesting story if you guys haven't heard it I won't tell a whole thing but we had the site in Puehler for 20 plus years um the the you know Mercedes-Benz Spinner project didn't end up making uh didn't happen so we had that site sitting there in the mid 2000s we put Mitsubishi heavy equipment over there to take about I guess a two-third a third of the site quarter of the site um and so we had that sit over there for 20 years it came in second a bunch and trips gonna break into halves in a second but it came into in second place a bunch and and and the local folks came to us and said the site's not big enough for the big projects though we um 450 acres or whatever the remaining site was not big enough and so we had a project with Amazon uh that we were working and Amazon bought that property from us and so for you know for 60 plus million dollars Amazon bought that property from the state which we used to partner with locals to go and buy that Brian County site which was almost ready to be developed into into distribution uh and we were not gonna have that on our on our site list and so firstly all the sites that we have are privately owned uh a few are locally owned few local governments that put in the investment uh to own their sites uh but we don't have we do we are short in terms of sites and well and we have been you know for years it's all the work that's happened all the projects that we've landed have been because our local partners have either invested in sites or we've had you know private partners uh that we've been able to work with and market essentially their site and then the company's coming and and look at it so kind of different questions we I would say we're ahead of the game in terms of these great relationships with consultants and making sure that programs are well known and we're a great state of your business I would tell you I think the economic developers that we're gonna tell you that we have we have lagged in terms of having sites that are publicly owned the speed to market piece for Hyundai was large partners we didn't have to go by site we had it we had it on we were able to uh turn that and they were able to start start to work very very quickly yeah and I think to the point of is there a you know the top ten list that is always being submitted I would say it depends on the project uh and really depends on the industry um if you think back to really stick with the automotive industry here for a second um there was no automotive industry in the southeast Mercedes in yeah in in Alabama was probably the first investment and collectively the southeastern states have been very successful in building an automotive industry an automotive cluster you know compared to what Detroit and Ohio and Kentucky might have been in the past so you know for automotive projects you look at places that have the right operating environment the right cost structure the cluster of the industry the workforce with the experience the shovel ready ready to go sites and and back to the point that was made before I think one factor was really speed to market can we get to market some things money can't fix right it's it's it doesn't matter if you throw another ten million dollars at this problem if it takes another year to get the power to the site that might be the death may or for that site so I think it's a number of factors and we work a lot on experience right where have companies been successful where have clients been successful where where do we know all those factors exist in terms of the good operating environment including the costs and taxes and that's the starting point and that might be a list of of eight ten twelve states that then quickly gets filtered down to the ones that get in-person site visits where everything is really checked on the ground to make sure that you know everything is really the way the data shows all right that's I think you want to Chris to run through the four things done twice I was going to ask a lot of you a little more time so if it's redundant I apologize but yeah I kind of just have something real quick because I will kind of reinforce what I would say we're like one of our top four finalists the major knock on the site and the reason one of the major reasons we didn't choose it was it was not ready for another year so in speed to mark was absolute critical to our project and so we just had to pass it over that was kind of the death now for that project so to speak so yeah so site ready shovel shovel ready it is really lucky just a few minutes by but doing pretty good so we we'll appreciate you being here I do and add one thing we were and the sin in the house we have kickball games we have rodeos we compete in we're with the simulator yesterday and that while the Senate did have to take a second pass to land the plane came into either first time the house didn't make it back to the runway were they crashed and burned I think maybe for God get the nose up I really don't know how much in that close but anyway in our ace pilot chairman teller still needs to do it at some point as he as he flies around we certainly appreciate the presentation and we're we're gonna move on to the x-rays and thanks for all the information we on this next one we had the college had won a test and we thought we had it was going to be on the screen and now they're having a technical problem with it so if you want to make sure everybody on their phone or laptop has a link and do this. Keenan after we get started I know you sent my phone up for it. All right well chairman Huffstutler chairman shaw Georgia thank y'all for having me especially somebody from big 10 country speaking to Georgia this time of the year my name is Ray Heterman I'm the executive director of the economic research center at the Buck Ey Institute in Columbus, Ohio we're a think tank that specializes in economic research analyzing the impact of public policy in Ohio and several other states I've been working on tax policy for almost 30 years at both the state local and federal level what I'd like to do today for my remarks is discuss the gold standard of tax policy drawing from economic research at spans decades economist at the organization for economic community development the OECD said taxes need to be set up to minimize taxpayers compliance costs and government administrative costs while also avoiding tax avoidance and evasion. Taxes affect the decisions of households to save supply labor invest in human capital the decisions affirms to produce create jobs invest and innovate as well\n\nthe choice of savings channels and assets by investors. The gold standard of tax policy should adhere to the following principles. It should be simple, transparent, pro-growth, and fair slash neutral. A simple tax policy is easy for taxpayers to understand and for government to administer an enforce. The more credits and deductions in a tax code, the more confusing it is. A more generous standard deduction, for example, is better than many itemized deductions. Times spend by individuals, firms, and businesses filling out tax reforms. It's time spent away from families and growing the business. So first, congratulations to Georgia on your tax reforms of last year, making your state individual tax code much more simple and efficient. A good tax code is also transparent. Transparency means tax payers should be easily able to gather information about taxes they pay directly independent or indirectly. Why those taxes are in place? How much revenue those taxes collected from whom and how those tax dollars are used? A tax system should be pro-growth. It should provide the least impediment to economic prosperity as possible. This means a broader base tax system with low rates is better than a narrow base with high tax rates. And finally, what I want to spend a bulk of my time on is discussing the principle of being fair and neutral. Essentially, government should not pick winners and losers. Taxes should not reward or discourage different industries or businesses. A tax preference is specific tax credits that can go to different regions, different companies for firms or individuals that engage in specific economic activity. Economist, political science, and other academics have long studied the impact of tax preferences. The evidence is clear that on average, using tax preference is an inefficient use of tax resources and does not produce results that policy makers hope to achieve. Additional economic activity is costly, especially on the margin. Because much of the economic activity would have occurred even without tax preferences. In short, most business activity would occur without tax preferences for reasons other than physical policy. First, consider that what the research says on tax preferences. Overall, tax preferences is essentially government spending through the tax code. Government is allowing specific industry, its region, cities, or people to pay less in tax and return for behaviors or investment. On average, and during a normal business cycle, the return on government spending is less than a dollar. That means for every dollar the government spends, the return in that spending is below a dollar, resulting in a dead weight loss. Government spending does not create stronger economies in the long run, either through tax preferences or direct government spending. Other research looking at specific tax preferences finds that these tax preferences are inefficient. The average affected subsidy is likely to change only one out of eight corporate location or expansion's decisions. This means roughly about 90% of subsidy spending is wasted because that economic activity would have occurred regardless of the tax preference. So for example, here in Columbus, when Intel announced that they were going to build their new chip plant in the nearby location in the Columbus metropolitan area, Intel said they would have moved to Columbus regardless of the tax incentive package Ohio put together. Other factors are at least or more important in tax incentives. These include, for example, the Intel decision, access to a major airport, access to a major metropolitan area with education senators, more affordable natural resources from land to water to energy, and finally quality of life, all played in an important part in making Intel to decide to locate in Columbus. Tax credits that go to an activity that were already going to happen is called what we call kind of buying the base. That means essentially what you're doing is your spending government resources on an activity that was already going to take place that raises the cost of any additional marginal job or economic activity. Other research shows that tax preferences are also inefficient because they change how dollars flow in the economy. They give money to companies that are protected from competition that can encourage less efficient production. They can motivate investment in production decisions that are suboptible and would not have been decided in a fair market. Other companies then may decide to pursue political favors and profits rather than focus on their core businesses. And finally, research has found that in many cases of economic incentive packages, companies fail to live up to their promises, producing fewer jobs and other forms of tax revenue. On specific tax expenditures, for example, it is not surprising that researchers in Princeton and other universities have found that direct subsidies can increase jobs in the subsidized firms or areas. Again, this is not a surprise because the government is directing a lot of money to these specific areas or firms. So then the question is, why then do tax expenditures found to be less cost effective if some areas and firms benefit? Well, the reason is, as we talk about the scene in unseen, Frederick Bastian says, it's easier to see what is happening directly in front of you and it is harder to see the unseen. In this case, it's easier to see the results of companies and areas that receive special tax treatment. It is harder to see the impact on areas in industries that must pay more in taxes for these subsidies. To large extent, tax expenditures are taxing Peter to pay for Paul. Unlike the federal government, state governments have a balanced budget constraint and you must raise tax revenue to pay for core government services. If you're using tax preferences to subsidize economic activity, that is for gone tax revenue and needs to be made up elsewhere. Thus, other industries, individuals and taxpayers will be paying more as a result to pay for these tax expenditures. Too often, studies that evaluate the return on tax preferences only look at the benefit of lower taxes and government spending and they do not look at the impact of higher taxes on other areas of businesses. So again, for example, here in Columbus, we've had a lot of people moving to Intel, people touting about how good it is for the Columbus region, which is true it has been good for Columbus, but what is good for Columbus is not necessarily mean it is good for the state of Ohio, has many of the people coming to see jobs here have come from other parts of the state. That is less that essentially that Columbus is cannibalizing economic activity that might have occurred in less fortunate areas, such as the southeast Appalachian area or northeast area that has been hit hard by the change of manufacturing, switching to a service and information economy. Those are cities like Northeast Cleveland, Youngstown, Ohio, that has continually lost population. If you're going to look at evidence on the return on tax preferences, a good economic analysis will not only look at the benefits, but also look at the costs. There is no magic money tree at the state level that can pay for these tax preferences and tax treatments without raising revenue or reducing spending in some other area. Other problems with state-specific tax preferences is that sometimes advantages accrue to people and businesses living outside the state. Investors, business owners, and even some workers may benefit from a subsidized firmer area, but will not pay taxes to the state of Georgia, resulting in a higher deadweight loss. Research has found this is particularly true in areas where there's easy to move across state or county or even national lines. Tax preferences also tend to reward large businesses and existing firms compared to smaller firms and entrepreneurs. Essentially larger businesses have more accountants, bigger staff, and more knowledge of how to take advantage of the policy process and the tax code compared to startup businesses and people with less tax expertise. So overall, lower tax rate is best for economic growth. Investments flow to what the market thinks that is best and has the best return on capital. New industries, particular smaller businesses and entrepreneurs will be allowed to flourish and thrive. The more tax preferences in place, the higher the tax rate has been needed to produce the needed amount of tax revenue. So this has created a vicious cycle in other states where it has higher overall state tax rates then require higher tax preferences for business to pursue that economic activity. My analysis is that Georgia benefits from an overall low tax environment. So you don't have to worry about that as much as other states that have a higher tax on capital and corporations. In those states, we have seen that businesses simply do not expand without significant tax evasements. And newer industries are throttled in the crib and will relocate to areas with lower taxes overall. So in my remarks, I have discussed basically what the literature has found on the overall average impact of studies on tax preferences. Yes, some stacks preference projects can be successful and create some economic growth. Just like in football, sometimes a hell-marry pass can result in a touchdown. But an offensive game plan that relies too much on how Mary's is not going to be successful. Just like any economic development plan that relies on continued use of tax preferences is not going to create sustained prosperity. For economic development, using dollars for core government services, such as better education and infrastructure, is a better route than using tax preferences. Companies want educated workers, being able to make sure that Georgia is producing talented workforce that meets the needs of modern companies will benefit all companies instead of a specific few. When engaging in tax preferences finally, you need to make sure that there is good oversight and accountability. Some of my fellow panelists have remarked on the importance of clawbacks. It is important that the state of Georgia has make sure that you have real benchmarks with clawbacks that are enforced and good legislative oversight of tax preferences. This is to ensure that tax payers are getting the best use of the dollars. Any economic analysis and academic analysis that looks at the benefit of tax preferences must be a real evaluation. It cannot simply look at the benefits, but also must look at the cost of this program. Again, these dollars are oftentimes zero-sum. We're tax dollars taking away from one area to give to a tax preference to another necessarily requires less economic activity in the industry or region that is now paying higher taxed. Dr. Timothy Bartick, who literally wrote the book on tax preferences at the state level, again concludes that overall tax preferences have failed to live up to their promises and expectations. And a dollar spent on tax preferences tends to generate less than $1 economic opportunity. So again, thank you for this opportunity to speak to you and I look forward to answering any questions. All right, hopefully you can weather my recent feedback. You want to? I'm working with that. So I'm working on, you're like a problem, and you can do the 30-second delivery, it's completely chatter. Okay, what if you just turn that off for a minute? I don't get the feedback. It's not so much of a mess. You can use yourself on your work here. I don't want it. Yeah. I don't know why, but... So I can tweak and type your questions to them in the chat. Okay, I just, I know he's worked with several sayings, so I'm reducing about $6 billion, and I know that's worth this thanks, but I think you could go through that. Okay. What have you done with those? What have you done? What have you done? What have you done? What have you done? What have you done? I can say one more time. Yes. Senator, you wanted to ask the question about, you know, how we've worked with other tax credits and other states. So, you know, a lot of times, like Georgia, states have recognized that states compete on tax policy. Businesses and individuals want to locate places that are more attractive for economic opportunity investment. These are states with lower tax rates, lower cost of living. So a lot of times with the question policy makers have, is how do we get to lower rates? And the answer is getting rid of a lot of time specific tax preferences and tax credits. We had been able to work with a state of Iowa, for example, on helping them move to the flat tax, like Georgia, identifying specific tax expenditures, both on the individual and corporate side, we felt that we're particularly ineffective. We gave them recommendations, totaling hundreds of millions of dollars that allowed them to have some of the capacity to move to a flat tax regime. We're currently in the process of starting a new economic analysis of Iowa, so they can move to a flat tax faster than the original schedule, so they can go ahead and hit the revenue and tax triggers well ahead of time, so they can reap those benefits. We've also looked for example, work with the state of Louisiana, taking a look at their tax regime as well, giving them specific suggestions on how they can pay for some of their tax reform, particularly for example, Louisiana had a franchise tax, taxing the property and wealth of businesses. This is particularly egregious, and so we were able to speed up and help eliminate the Louisiana franchise tax. And again, we gave them specific targeted tax credits. We found that we're inefficient for the state of Louisiana. So overall, and not just in those states, but in many others, we've seen a great deal of acceleration, where states moving towards a more broad base, low tax rate state, for example, paid for both by eliminating tax preferences, and also states taking advantage of the fact that many states are running record budget surpluses. Yes, so I am not an expert is not on the part of airplane craft maintenance on the state of Georgia, for example, I would be a, my expertise is more kind of looking at the overall use of tax expenditures and tax preferences. And again, I think you know, with the evident shows that there are other factors of physical policy that play at least as an important role. And I guess the question then becomes is kind of thinking through what type of economic activity that would occur without this exemption. And so that would be my concern there. So the mechanics of our analysis, yes. So I guess basically we use micro models. So my original start of the career was starting in federal policy, where federal policy makers move to what we call a dynamic scoring analysis is back in the 90s. At the time, for example, a lot of federal government policy makers only used that excursion use multipliers look at the impact of economic analysis. Dynamic scoring takes into effect a more complete analysis saying when you lower tax rates, you may get more economic activity by individuals and firms takes into account both sides of the equation. So we're able to pioneer major federal models. As you know, the federal government now includes dynamics scoring both the joint tax committed to federal level and at the congressional budget office level. We are now working on doing the same at the state level where we have built a state model where we use industry specific analysis. We use we use basically every state using sick code to replicate a state's economic profile. And then we look at tax data to build a taxpayer profile for those states both based on both corporate and individual tax returns. Designating those into marginal tax brackets using adjusted gross income classifications. Then we use a last Tisities on labor and capital formation using those from the congressional budget office. Has well to predict future economic activity. I have a question say much like the entire example what it benefit the state of Georgia to use business activities to go to non metro areas. So there is some evidence saying you know kind of thinking through like what is the least harm going for some of these tax business incentives. There is some evidence that there can be some return to disadvantaged areas in particular. And that it may be a better use of tax expenditures, the giving it to major prosperous areas overall. All that said the evidence there is not great in the first place. Think a bit like opportunity zones that have been used at both the federal and state level. Again, we found that some of the economic activity that was used to a disadvantaged areas. Some of that economic activity came from people located just outside the area that simply moved their business to take advantage of lower costs. So basically it was almost again a zero some game or maybe you're moving across the county you're changing a zip code. You're not creating additional economic activity within the state. Instead of your making decision of where that economic activity occur. On the other hand, there is some possibility that you can get some advantages from aggregation in some areas. So for example, San Francisco for a long time, even with a poor fiscal climate high costs of living with still attractive to tech people to live there because you had so much tax expertise. And that shows you know that companies are often attracted to places where there's a high amount of human capital educated population. And that has been seen more recently that there are limits there. The other part of the question is anything business incentives outside of the state. Not quite sure understand that. Other questions. Thank you very much, Mr. Chairman. It was a pleasure. I feel free to share my email and I'd be glad to provide any sources for any of my remarks here today or people interested in more information on what the academic research shows. I'm happy to ride that to the chairman in the committee. Thank you. Well, again, sorry for the difficulties here. They had tested that out and thought we had a good system, but it was good to have his testimony anyway. So I think we've got our last panelists here. Yeah, great. If you want to go on up with Stacy with the Georgia budget policy institute. And, Chairman, I won't take it just a minute, but we talked about last time that we're going to have a website and upload some of the materials from first meeting and going to continue to do that. And I guess put forward where the future meetings are, but we also have an email established if somebody wants to send in testimony outside of these meetings. It's tax panel testimony, House dot GA dot gov. And we'll work on making sure we get that out to anybody that it may want to use that. And I believe both this meeting as well as a recording of Dr. Heardman will be available on the Senate House webpage. All right. Great. Thank you, Mr. Chairman. Thank you all for the opportunity to speak today. I know we're on a little bit of time squeeze. So fast forward. You do have a copy of our slides. I will not get through them all today, but you have them for your reference. My name is Stacy Fox. I'm the president and CEO of the Georgia budget and policy institute. I am a Georgia native. My parents, but the house right off Moody Road, Chairman Blackman. So hometown. And I may not have an SEC ring like our lieutenant governor, but I do have a plaque in the student center as a founding member of the Arch Society at the University of Georgia. I'm proud, Georgia native and I'm very committed to what we do here. If you're unfamiliar, I would you be PI. We work really at the intersection of research and advocacy. Really to inform debate, inform decision making inform y'all's decision making. To advance our vision of a state where all Georgians prosper and you likely know that we have a team of experts when it comes to the Georgia budget, state physical policy and specific areas of state expenditure like education and health care. We are a strong proponent of a fair and equitable tax system. After all, taxes are for everyone. They pay for things we all share. And we'll have a lot to say as you can imagine this fall is you travel the state and do your work. We're really thankful to be here today and really want to focus on the work that needs to happen around the tax code in Georgia and amplify a little bit of Mr. Headman's comments around transparency. But we look forward to sharing our analysis research and recommendations as our process goes through this fall. I think really the bottom line that we want to share today at GBPI is that we believe that Georgians deserve to know where their money is going. And we've heard a lot today about a best state to do business in and that's really important. But it's also important that our residents are thriving both need to be true. We simply aren't right now. We have a, for example, a million Georgia residents that are food insecure. So we want to make sure that both are true in the state. And part of that is making sure that we get a good ROI on our tax incentives and programs throughout the rest state. I do want to share and I can fast forward this slide, I think, to just give you a visual here. Unfortunately, this is not where we're succeeding in Georgia. In fact, Georgia ranks 50th among the states as far as transparency related to information and state disclosures on who gets and how we use our tax incentives and tax credits. And that's really what I want to focus on today. You're familiar with Senate Bill 6 that passed in 2021 that allows for a limited review of 10 tax credits per year. And we can be split between the House and Senate committees. But even those limited number of tax credit reviews have produced reports that say we don't have enough information to produce a full evaluative process of those limited tax credits. So we need to be doing a little bit more there and wanted to talk about some recommendations around that today. We just have provisions that require or incentivize hiring residents over non-residents to qualify for tax credits. We don't have that in Georgia. Most states, in fact, 87% of states in this country cap large scale incentive programs. Georgia does not. And these states permit disclosure of individual companies or projects receiving tax credits, but Georgia does not. And these, what's happening around the country is part of what we use at GBI to inform the recommendations I'm going to share with you today. And establishing really a robust regular review of the full tax credit system in Georgia is really your fiduciary responsibility. And we wanted to provide you with some solutions to make that happen. We also, this is happening all around us as well. So just wanted to share with you that our neighboring states have adopted tax review cycles in which credits must be evaluated. All credits must be evaluated, including three years in our neighboring state of Georgia and four years in Tennessee and Alabama. South Carolina also recently distorted disclosing company names and award values. Some quick you said Georgia. I think you meant another state. Did I? Oh, Tennessee and Alabama maybe. Okay. I'm so Georgia centered. It's hard to remember. So to three years Tennessee and Alabama does that review every four years. Thank you for that correction, Mr. Chairman. South Carolina also recently started disclosing company names, award values, and new jobs, carols for its incentive programs and Alabama recently enacted legislation to acquire the state Department of Commerce to disclose online names of companies that receive economic development and centers. So let me just go back and share with you a little bit about our recommendations around transparency. Our first recommendation really is to enact a regular review cycle of the entire tax credit and the general assembly could appoint a permanent tax review committee that would provide an annual report to the body. And in 2021, we actually published some recommendations of what the outcome of that annual report could look like one of some of those pieces of that report. We also would like to recommend annual disclosures of recipients of tax credits and incentives across the state, including information on jobs created, especially wages. We heard a little bit about that earlier today talking about wages is really important and disaggregating that data. So this four recommendations include a sunset, adding a sunset to all of our tax credits in the state. You remember that even Dr. Dorfman mentioned that when he spoke to the spotty earlier this year, it is important that every tax credit that we put in place in the state has some type of sunset. So it is not just continuing into infinity without legislative review. We also like to see an automatic state audit on any tax credit over a million dollars that's happening as you as I mentioned in over 75% of states across this country. And you're just not doing that also requiring in state residency for all tax credits issued is really important. I think you probably know that a majority of the job tax credits that you issue from the state go to out of state workers, only about 19% go to in state workers. And so we want to Senator Tiller, you were talking about this about incentivizing helping those in Georgia get jobs and get good jobs. And I think we want to make sure that's happening with the tax credits that we're handing out. We also want to encourage all to think about requiring public reporting on total number of transferable credits. This is a large issue in Georgia. A lot of these large companies are selling their tax credits on the open market. And we don't have visibility into that and we should in the state. And we would encourage all to think about requiring a report on that annually. I think the last thing I just want to share with you all is really I think from our perspective at the Georgia Budget and Policy Institute.\n\nAnd its parents see is really the floor, not the ceiling here. When we talk about building a fair and equitable tax system in the state. And you know, transparency really just demands that our residents know where their money is going. And as fiduciaries of the state, you all have a really easy on ramp to doing that. And I wanted to provide you with some specific solutions today. This is really about ensuring that our state's finances are managed, respond simply and effectively, that we're getting the best return on our investments through our credits and incentive systems. And most importantly, that they're benefiting every Jordan. So thank you all for doing this work. We really believe this is a great start. And a term of black men, a term of house to other. We want you to know that GBPI stands ready and willing to be a collaborator to make sure that we're making meaningful progress this year as y'all do this work throughout the state and issue a report in December. And first question, and also I apologize. I know you feel like you had to be rushed. That's okay. We could go over a few minutes if we had to. So sometimes from your last. But I want to get back to that point. You said you thought we should do an annual review with maybe a permanent committee that does that. Yes, sir. But if I heard you, you're saying that Florida is doing it every three years and neighboring states every four years. Yes, sir. I mean, not every state is doing it every year. I mean, setting it up to permanent at some sort of regular interval is better than where we are now, which is not doing it at all. We'd love to see it happen every year. But certainly if it happened at some sort of regular schedule, that would be a fantastic move in the right direction. Is there anything we're doing that we ought to keep doing? That's a good question, turn them back. And I think what you're doing right now is exactly what you should keep doing. You know, we should be looking at this issue and talking about it and figuring out how that we can best review getting a return on our investment here. So I think this process is something we should keep doing. This is what we could be doing every three years, every four years or maybe every year. Do you come to some of our meetings during session? Yes, sir. I've been in Jimmy Paffer for about a year. So I've got my sea legs under me and you may have seen me in the back of this session, but you'll see a lot more of me. You said Moody Road. Did you say something about Moody Road? Yes, sir. You're off Moody Road? My parents built a house on Fox Band right off of Moody Road. Oh, fantastic. Yeah. Yeah, right down the road. There was no house in County High School when I graduated. Well, me either, but we're showing our age there. No, we are. Thank you for being here. Thank you, Mr. Chairman. If I may, tell me again what you mean in like in five over here, when you require in state residency. Yes. I mean, tell me exactly what you're referring to there. Yeah, when we're issuing job tax credits or any other type of tax credit or incentive for a corporation business moving into Georgia, we should have either some sort of percentage requirement of in state hires, residents of Georgia, about 19, only about 19% right now, the job tax credits the same. Okay. For what period of time? Well, I mean, I think that should be permanent as long as they're getting the tax credit. Well, that's and I'm not trying to be argumented. You know, I truly don't understand. So if a job is created in this place and somebody moves from Alabama to take that job, you wouldn't give them the credit. Oh, no, absolutely. Okay. As long as they are Georgia resident in that job. So if the company's providing, let's just say 10,000 jobs a year, right, that we want to say a majority of those jobs. So let's say 7,000 of those jobs are going to in state residents, folks that live in Georgia, whether they moved here or already lived here, we want to make sure that's happening right now. Well, I mean, that's, and again, I'm not trying to be argumented. My understanding was if the job created in Georgia, the job had to be worked in Georgia. So if the job was done, the job was done for all the jobs would be in state residents. Well, not all of the jobs are going to permanent residents of Georgia. A lot of times we have fly-in folks or a lot, because of COVID, now a lot of remote working is happening. So not only about 20% of those job tax credits are actually going to permanent Georgia residents right now. I'd like to see that information. Yes, sir. Happy to share that with you. And again, the question I wanted to have on that is when you talk about in state residents, they're talking about, they're from out of state, but they're working in Georgia for a period of time, six, eight months, you know, a year at a time, but they fly back home one weekend, et cetera, because if so, they're paying Georgia taxes while they're here. Well, they're paying Georgia income tax, but they're not paying Georgia property tax. Well, there's a lot of people that don't pay for their school systems and other things. There's a lot of people that don't pay Georgia property tax that you did not understand that. I understand that. Okay, so that was it. Again, I'm not trying to. These are simply recommendations from other states that we've seen that could be. Again, I'm not trying to be argumented. I'm just trying to understand what means in state because then the question I would have in this is truly actually to help us with help us with the interstate commerce clause. Yes, sir. And related to that because I'm of the opinion that we can't provide something for Georgia resident that somebody that comes in from out of state. I thought there was some sort of a prohibition about treating that difference to the commerce clause. So if you have some information from other states on that, that would be interesting. Yeah, absolutely. We'd love to help on that. And because of the interdependency of our economy, that's really hard to mandate. And I understand that. And so there are some past solutions that we've seen that have worked in other states and we'd be happy to offer those details. Any other questions? Oh, yeah. Representative Buckner, thank you. I do. I don't know if this is on or not, but I'm. That's a great question. Several years ago when Larry O'Neill was the chair of Houseways and Means, we started putting sunsets on almost all of the tax bills. Sometimes some get through without it. But we've been pretty consistent with that over the years. And I'm the one on the committee lots of times that say, oops, there's no sunsets. So I'm very familiar with that and very supportive of that. When that comes back at the end of that sunset, there generally is a pretty good review of what happened with that tax credit. Did that not count as when you said that all of the tax credit should be evaluated? We're doing that on a rotating basis. Tax credit by tax credit, it seems to me, but you may see it different. I just was curious. That's a great question, Representative. First of all, I would say based on R&L, such as GBI, there's a good chunk of tax credits that don't have sunsets. And so during this review process, we really encourage all to look at all of them and make sure that each of them has a sunset attached to it. And I think Representative, I would say that it really depends on the timing of that sunset. If you're talking a sunset in 20 years, you all aren't getting any information to really understand the return on investment of that incentive or credit until it's complement to be complete. And what if something's not working? What if you wanted to tweak it? What if you wanted to sunset it earlier? What if you wanted to grow it? You wouldn't know that until you were getting to the end of it. So I think in any of our financial investments, we all are getting balance sheets monthly. In our businesses to look how things are going, we encourage all to do that more often than you're doing now. I'd love to see the list of all the ones that don't have sunsets. Sure. Thank you. I don't know. This really is a question about tax incentives, which is what we're talking about. But just Georgia Public Policy, do you all have a stand only in your eye with reducing income taxes in general? Does a Georgia Budget Policy Institute have a stand on reducing income tax? Well, what we'd like to see is a more fair and equitable balance of income tax. Currently, those who pay the majority of their income, about 10% of their income are lowest earners. Those that are making $20,000 or less in Georgia are paying 10% of their income towards income tax versus our top 1% of earners that are making over $450,000 a year, only paying 7% of their income towards income tax. So our opinion is there needs to be some move to make that more fair and equitable. We certainly don't support a elimination of state income tax. I thought maybe a young woman gets reduction in income tax and women are trying to spend more in the budget to do other things. So just check it out. We have ideas about how to spend money, of course, but in this case. I have never spoken to anybody from GPB out buying anything that has to do with the budget. It is new and new to me. So I would love to have any discussion you would like to have. I'll follow up with you. Give the last chance. Give the last chance to be in contact. It's my understanding that people with $20,000 of income after the standard deduction, hardly pay any if at all the steady income tax. Right, but will that happen with the implementation of the flat tax I'm talking about prior to? So I'm talking about with the standard deduction in place. Right now that they pay virtually nothing. No, there's paying about 10% of their income. No, they're not because the state tax rate is 5.75. I'm happy to share that information with you. How would you pay 10% on your income if the rate is 5.75? Tell me how that works. I'm talking about a bit of your total income that goes out. It's not that percentage is the total income that goes out the door. Again, I understand what means out the door. You said they're income. If they make $20,000 a year and the maximum tax rate is 5.75, how do they pay 10% of that total income? I'm happy to share that math with you and the analysis that our analysts have done. You mean income tax? Not overall tax? Overall tax. Okay, we're setting up to say I thought you had to get back. Sorry about that. Thank you, Senator. I have a question for you. Yes. There's a Georgia budget policy institutional tax credits for racist. I think that's a bold question, Senator. I think that some of our tax credits are built on racist policies, yes. And I think that we need to be looking at who's most harmed by our policies and making sure that we are not targeting the harm of our policies on any particular population in the state. I mean, when we look at those suffering the most based on our tax code and tax system in state, it is black Georgians. And so I think that is an appropriate question to ask as we're doing this review of the tax code, is making sure that we adjust for that historical and systemic racism that's built into this system. Here's a question. I'm not saying we do get us in Florida and dialogue with the real. Absolutely. I appreciate y'all having us here and we certainly stand ready to provide information and be helpful. And I think y'all for being patient for some of my missed ups today as I'm learning too. All right. Thank you for that. Thank you, Chairman. The meeting is the entire agenda for today. The next meeting is in Rome. It's September 20th and it will be next to a big college and a nice facility that our governor has spoken at. And we'll get all the details out on that and work through the technical issues too. So with that, unless you need to add something. Thanks to all our presenters and speakers today and thanks to the panelists for being here. We enjoyed being in Savannah. We sure do. All right. Thank you, Chairman.",
  "updated_at": "2026-02-13T17:59:22.210775+00:00"
}