{
  "video_id": "4QotkBt4n3Y",
  "url": "https://youtu.be/4QotkBt4n3Y?t=1110",
  "title": "Georgia House - Day 22 (2026-02-22)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-02-22",
  "duration_minutes": 154,
  "summary": "Here is a summary of the key points from the Georgia House session transcript:\n\n**Overview**\nThe session featured a spiritual address by a guest speaker, Dr. Daly, who provided advice and encouragement to the legislators on dealing with the stresses and challenges of their roles. The speech focused on relying on prayer and faith to find peace and guidance in decision-making.\n\n**Notable Moments**\n- Dr. Daly delivered a lengthy sermon-like speech, drawing on Biblical passages from the Book of Philippians to urge the legislators not to be anxious, but to turn to God in prayer for the peace and wisdom to effectively serve the people of Georgia.\n- He emphasized the importance of the legislators seeing themselves as \"public servants\" rather than \"ideologues\" and developing trust with their constituents.\n- Dr. Daly encouraged the legislators to seek divine guidance in their legislative work, saying \"the only way to win in the battle is to have a general, general God.\"\n\n**Adjournment**\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you are say that I met him during an environmental rally. He also gave me a certificate and money for my schooling and that was the CT Vivienne Awards. So I just want him to come up and give us his work for today and then, and he's here, Dr. Daly. Thank you. Welcome, good to have you. Thank you. Good morning. I finally arrived in the big house. All of these years, I've been passing by wondering what do they do in there. And sometimes you wonder what did I do out there. But when we can get out there with the end there, we got something for the state of Georgia and we ought to be proud in the name of the Lord. Let me say a good morning to all of you and certainly to speaker Burns and Tishnakes for inviting me to come this morning. And I wonder whenever you're asked to say something with a distinguished body like this, what can you really say? And I've often known that when you're in doubt as to what you should talk about, you need to ask somebody. So I asked my son, what should I talk about? And he said, well, come on, Dad, just say anything to him. They're all right. Then I turned to my daughter and I said, what should I talk about? She said, well, Dad, be erudite. It's a distinguished body. And then I turned to speaker Burns and I said, what should I speak about? He said, speak about five minutes and sit down. We've got a lot of things to do today. We live in a world that seems to pull us all in so many different directions. And at the same time, we feel so overwhelmed. Well, I stopped by just for a few moments to offer a word of assurance that with all of the decisions that you have to make for the citizens of Georgia, how you can feel a certain inner peace in today's mayhem. Can you imagine never having to feel any anxiety when you come into this chamber? It seems like that possibly might be an impossibility. We all have worries on the job in our homes with our families and even wondering, sometimes did we make the right vote after we've cast the vote? Well, there is a solution, I think, to possibly when you come into this chamber and you feel all the distressors around you every day, just getting through the traffic, sitting in your seat, wondering what should I do, what side should I vote for? It's a stressful situation. And there was a young man named Apostle Paul. Can I use Apostle Paul in the sanctuary? Can I talk from the Bible in the sanctuary? I don't know. Sometimes there's a block under the door, but I got to do it because that's who I am. In Philippians 4th chapter, verses 6 to 8, here's what the Apostle Paul says about the reduction of stress, the reduction when there's something in your mind and your body that's challenging you, when all of the worries of the world seem larger than the mountains and the valleys are deep, you wonder, what can I do here with the Apostle Paul says? Do not be anxious about anything, but in everything by prayer and petition with thanksgiving, present your request to God and the peace of God which transcends all understanding with God, your hearts and your minds in Christ. In other words, when you read this particular paricka, when you read this text, Paul is saying this, he's given each of us a way to face stressful days with peace. Paul is saying what I want to share with each of you today, this beautiful morning, every legislative session you were, you have the awesome responsibility of accepting to meet the needs and expectations of those who sent you here. However, there will be times when you're conscious with challenge or decision which you may or may not have agreed upon. These are the times that filled you with anxiety. Paul is saying, don't worry, don't be anxious, don't become stressed. But do what we are going to do in a few moments and that is pray, the simple obligation to communicate with the God that listens to all that we do, a God that gives us the peace that surpasses all understanding and that peace will guide you even in the middle of the decision making. Where you find a certain commons and you know that you're in the right world at the right time for the right reason for the right purpose, bringing hopefully the right results for the citizens of Georgia. When you have that feeling down inside that you're doing the best that you can do, that's all that you can do. And that's what we're here to talk about. We're thanking God for the opportunity to serve every day when you get up, you come in, you wonder, but if you've got in your mind that I am a servant, God sent his son to serve and not to be a servant, not to be served, he sent him to be a servant. You are public servants who accepted the call to serve. However, to be effectively fulfill your calling, you must not lean on your own understanding, not on your own limited human understanding, but trust God to guard your heart and your mind in a nation, in a state divided on so many different ideological fronts, the people are looking for public servants, not ideologues who are running for their own particular self-angrildism, but simple public servants. You now must begin to create and establish and maintain something that seemingly is being lost in our nation. One of the obligations to be a public service is to develop trust among those who sent you here to serve them. It's there filled with so many fears, apprehensions and anxiety, but trusting God, your creator is a sustainer. When all comes in and you don't know which way to turn, don't look to the left, don't look to the right, don't look down at the shoes, but look up to something that's miter than any of us, a deity that will hold you in the palm of the hand. When doubt comes in, the only way that you can remove doubt is to have a power inside of you that gives you the strength. God did not give you the power of fear, but of a sound mind. This morning I asked that each of you would not see this as just another chaplain getting up here running. It's my off talking and getting excited, but this is a moment when each of you can make a decision within. How do I effectively go down deep down into the resources of my very soul, my mind, my heart, my body, and do make a difference, even though I might disagree with somebody across the aisle. How do we come together for the overall good of the state of Georgia? Not just another chaplain coming and then going back to business. Well, we pass that. What's for lunch? Sometimes something ought to be said from this day of us that makes me think. That makes me reorder my thinking as to how I respect and how I treat the other person, how I overcome the stressors in my life to go. This is the only day God has given each of us to seek divine His divine guidance in will. As you legislate this session, make your decisions after you pray, meditate, listen, and obey that creative spiritual force that is down inside of each of us, the spirit that I will continue to serve. One of the ways to do that I found whenever I'm in doubt, many mornings, even though I've been out on the field a long time, started in the Civil Rights Movement in 1959. I'm 82 years, 81 years old now. So I've been on the, here's another thing. Don't sing anymore. I'm on the battlefield. Don't ever. You're not on the battlefield. You're in the battle. It's the difference between being on the battlefield and in the battle. So we're in the battle and the only way to win in the battle is to have a general, general God. And general God will lead you in the battle to free victories. And that's what we want here. So we adjoin with me as we communicate with an Almighty God. Somebody ought to say, man, somebody ought to be thankful that the stress is less now. Stress is less. Almighty divine righteous God, the giver of every good and perfect excellent gift. It is once again that you've us summoned us to this powerful\n\nchamber, public servants, those that have committed themselves and their lives and their spirits to make a difference in this great state. This legislative body, God, individually, collectively, we ask that you would touch them and allow them to put their egos on the altar and crush and seek your divine guidance for governing your people. Dear God, I ask that you would bless their families. Touch them when they come to this place as chamber of power. Bless their families, bless their children, bless their wives, bless their daughters, bless all in their families that they can feel the assurance that their father, their mother, their uncle, their cousin is doing the right thing at the right time for the right reason for the right purpose to get the right result. Touch them, give them less and all fear right now and certainly God remove all stress. Even through the day after these words have been uttered. These mere human words, let that stress go down, go down, go down. And if you, God, we ask a special blessing this morning, our friend, President Jimmy Carter, God, go down there to play, touch rousing right now, Jason and the rest of the family, God, give them the assurance that everything not will be all right, that everything is all right. This legendary leader, this son of Georgia, God, touching right now, you told us don't worry about this little earth and tabernacle. But God, like the people in this chamber, I asked that you would touch his spirit to let him know that it is all right. If you let your finger of love touch him and God, I ask a special blessing for the people in Turkey and Syria, 40, 50,000 people wiped out in one fail earthquake. We come and we lose one or two in our lives, but all those people bless them as they face those cold conditions. Finally, God, I ask that you would bless my good friend Charlie Fleming, who is retiring in the Labor Department. Bless all that he has done for so many years in this place. And now empower this legislature body with wisdom, insight, compassion, caring, honesty, decency, and a sense of enjoying what they're doing. I ask for your total involvement on this day, God, touch him right now, let them feel a certain urging that from this day forward, this will not just be a chamber where we come that we've been elected, but this will be a chamber of transformation for making Georgia still one of the greatest states in the nation. And we ask it all in the name who understood what it meant to just lift it off, lift off the problems, lift off the stress, give it to God and God will give it back to you. And we ask it all in a powerful name of a living, living, risen savior and all those in the room who said, Amen, amen, let us salute the flag. Amen, thank you. Revolent and dearly we appreciate those words of encouragement. Thank you. They're well received. Doorkeepers will unlock the doors. May great chaplain early in the South Annie Room. Chairman Tarvan, the chair of the Committee on Information Audits is recognized. Just suspend just for a moment. Mr. Speaker, your Committee on Information and Audits has read the journal of the previous Legislative Day and found it to be correct. And just something else we need to think about, whatever you are, be the best one that there is. That's a working progress, Chairman Tarvan. But we're working, we're working. Chairman Tarvan, the chair of the Committee on Information and Audits reports that the journal of the previous Legislative Day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none. And the journal is confirmed. Mr. Clerk, will you please read the resolution establishing the order of business for the day? The registration of the 104th Miss Follinby establishes the order of business to the first part of the period unanimous consensus. Introduction bills and resolutions for a reading of reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none. And the resolution is adopted. First reading of bills and resolutions. The clerk will read. House bill 491 by Representative Jenner, the 85th card of the 93rd, Evans of the 89th, Davis of the 87th, Thomas of the 65th. Bill of New Tidal, an act to amend chapter 1 and title 12. Will the official go to George Antetta relating the general business regarding conservation and natural resources? Natural resources and environment. House bill 492 by Representative Paul of 33rd, a Bill of New Tidal, an act to amend, an act to provide a new chart of the city of Hartwell. And the federal governmental coordination. House bill 493 by Representative Hatch of the 150th, Newton, 1127, and Oliver of the 82nd. Bill of New Tidal, an act to amend, Code Section 43269, and the official go to George Antetta relating the renewal, surrender, and restoration. Health. House bill 494 by Representative Glaze of the 67th, and the GEC of the 68th. Gladly, the 130th Alexander of the 66th, Taylor of the 92nd. Bill of New Tidal, an act to amend, title 14. The official go to George Antetta relating the corporations, partnerships, and associations. Governmental affairs. House bill 495 by Representative Drenner of the 85th, Carter of the 93rd, Evans of the 89th, Davis of the 87th, Thomas of the 65th. Bill of New Tidal, an act to amend, title 12. Will the official go to George Antetta relating the conservation and natural resources? Natural resources and environment. House bill 496 by Representative Donna Huda of the 31st, Burr to the 20th, Smith of the 18th, Mathis of the 149th, Horn of the 3rd. Bill of the Tidal, an act to amend, title 16, the official go to George Antetta relating the crimes and offenses. Public and community health. House bill 497 by Representative Lehuda of the 175th, Williams of the 148th, C-Ball of 34th, Lomston of the 12th, Hitchinson, 161st. Bill of the Tidal, an act to amend, title 31, the official go to George Antetta relating the health. Human relations and aging. House bill 498 by Representative Mathis of the 149th, Green of the 154th. Bentley the 150th, Beverly the 143rd, Smith of the 18th and others. Bill of the Tidal, an act to amend, part 3 of Article 1 of Chapter 18, the title 43, the official go to George Antetta relating the licenses for funeral directors. Small business development. House bill 499 by Representative Hitchinson, 161st, MC of the 13th, Smith of the 70th, Stevens of the 164th, Ballinger of the 23rd. Bill of the Tidal, an act to amend, Article 1 of Chapter 6 of the title 19, the official go to George Antetta relating the general provisions regarding Alimony and child support. Human Ojustice. House bill 500 by Representative Silcox of the 53rd, Reeves of the 9th, Hilton of the 48th, Chokus of the 151st, Daniel of the 117th. Bill of the Tidal, an act to amend, Article 3 of Chapter 7, the title 16, the official go to George Antetta relating to Arson and Explosives. Public safety and Homeland Security. House bill 501 by Representative Silcox of the 53rd, Williams of the 112th, the 5th, Workhies of the 157th, Reeves of the 99th. Bill of the Tidal, an act to amend, Chapter 2 of the title 39, the official go to George Antetta relating the regulation of employment of minors. Industry and labor. House bill 502 by Representative Silcox of the 53rd, Hawkins of the 27th, Episodes of the 13th, Newton of the 127th. Bill of the Tidal, an act to amend, Article 9 of Chapter 34, Title 43, the official go to George Antetta, the Georgia Cosmic Laser Services Act. Hilt. House bill 503 by Representative Hawkins of the 27th, McDonald of the 26th, year to the 150th, Gull of the 19th, Part of the 5th, and others. Bill of the Tidal, an act to amend, Chapter 7, the title 48, the official go to George Antetta relating the income taxes. Ways and means. House bill 504 by Representative Hatch of the 150th, Jones of the 25th, Bill of the Tidal, an act to amend, Code Section 22, 164, the official go to George Antetta relating the local 5-mil share funds. Education. House bill 505 by Representative Chokus, the 150th, first silcox of the 53rd, Hilt, and the 48th. Daniel 117, three of the 99th, Bill of the Tidal, an act to amend, Code Section 16, 1130, the official go to George Antetta relating the riot. Public safety and homeland security. Bill 506 by Representative Hart of the 36th, or one of the 32nd, Jasper, 11th, 9th, and 134th, and Dubnick of the 29th. Bill of the Tidal, an act to amend, Title 20, the official go to George Antetta relating the education. Education. House bill 507 by Representative Ridley, the 6th, Smith of the 18th, final of the 73rd Williams, the 148th, Harvard of the 2nd. Bill of the Tidal, an act to amend, Article 30, 30th, Chapter 1, Title 10, and the official go to George Antetta relating the beauty pageants. Small business development. House bill 508 by Representative Ballinger, the 23rd, Hilt, and the 48th. Reves the 99th, Daniel 117, Chokus, the 151st, and others. Bill of the Tidal, an act to amend, Code Section 16, 594, the official go to George Antetta relating the restraining orders and protective orders. Do you have an injustice? House bill 509 by Representative Ballinger, the 23rd, Hilt, and the 48th. Reves the 99th. Daniel 117, Chokus, the 151st, and others. Bill of the Tidal, an act to amend, Code Section 16, 7, 1 of the official go to George Antetta relating the burglary. Do you have an injustice? House bill 510 by Representative Barnes, the 86th, Beverly, the 143rd, Clark of the 100th, Nathale, the 50th, Oliver of the 82nd, and others. Bill of the Tidal, an act to amend, Chapter 2, a title 20 of the official go to George Antetta relating the elementary and secondary education. House bill 511 by Representative Ballinger, the 3rd, and the 2nd. Bill of the Tidal, an act to amend, and act to provide a homestead exemption from all Coutuse, the County School District, and Valorum, Texas. Intergovernmental coordination. House bill 512 by Representative Kendrick, the 95th, Bill of the Tidal, an act to amend, Article 2, Chapter 7, the title 48 of the official go to George Antetta relating the impositionary computation, exemptions, and credence relative to income taxes. Ways and means. House bill 513 by Representative Clark, the 108th, Nathale, the 50th, Canada, the 58th, Barnes, the 86th. Bill of the Tidal, an act to amend, Part 2, Article 6, Chapter 2, a title 20 of the official go to George Antetta relating the competencies and core correctly. Education. House bill 514 by Representative Washburn, 144th, Baysmore, the 69th. Reuse the 99th, Limber the 98th, Ridley the 6th and others. Bill of the Tidal, an act to amend, Code Chapter 66, a title 36. Reuse the 99th, Bill of the Tidal, an act to amend, Code Chapter 66, a title 40 of the official go to George Antetta relating the zoning procedures. Governmental affairs. House bill 515 by Representative McCallum, 30th, Powell, 33rd, Jasperist, the 11th, Weed Hour, the 121st, Ridley the 6th. Bill of the Tidal, an act to amend, Title 40th, physical go to George Antetta relating motor vehicles and traffic. Motor vehicles. House bill 516 by Representative McCallum, 30th, Jasperist, the 11th. Reuse the 66th. Bill of the Tidal, an act to amend, Article 6 of Chapter 2, a title 32 of the official go to George Antetta relating the exercise and power to contract by the Department of Transportation. Transportation. House bill 517 by Representative Washburn, 144th, Baysmore, the 69th, Smith, the 18th, Limber the 98th, Ridley the 6th and others. Bill of the Tidal, an act to amend, Title 80, the official go to George Antetta relating the buildings and housing. Governmental affairs. House bill 521 by Representative Hilton, 48th, Cooper, the 45th Hawkins, 27th, Douglas, 78th, Newton, the 127th. Bill of the Tidal, an act to amend, Article 7, Chapter 4, Title 49, the official go to George Antetta relating the medical assistance generally. Public and community health. House bill 522 by Representative Fry, the 120th, Drenner, the 85th, Washburn, 144th, Roman, the 97th, Gallaudin, the 19th, and others. Bill of the Tidal, an act to amend, Article 6, Chapter 3, Article 3, Chapter 5, Title 44, the official go to George Antetta relating the property owners associations. Governmental affairs. House bill 523 by Representative Williams, 168th, Jackson, the 128th, Limber the 98th, Mitchell, the 88th, Hugley the 111st. Bill of the Tidal, an act to amend, Chapter 5, C, Title 48, the official go to George Antetta relating the alternative ad plurum taxes on motor vehicles. Ways and means. House bill 524 by Representative Ridley, the 22nd, Paul, 33rd, Ridley, the 6th, Year to the 150th, Momp to Hunter, the 17th, and others. Bill of the Tidal, an act to amend, Title 40, the official go to George Antetta relating motor vehicles and traffic. Motor vehicles. House bill 525 by Representative Ridley, the 22nd, Paul, 33rd, Ridley, the 6th, Year to the 150th, Clark, the 100th, and others. Bill of the Tidal, an act to amend, Article 1, and Chapter 10, and Title 17, and Article 3, Chapter 5, and Title 40. Bill of the official go to George Antetta relating the procedure for sentencing and imposition of punishment. Public safety and homeland security. House bill 526 by Representative Ridley, the 22nd, Reeves to the 99th, 4rd, Clark, the 100th, Miller, the 62nd, and others. Bill of the Tidal, an act to amend, Goat Section 52, 725, the official go to George Antetta relating enforcement of rules and regulations. Safety and homeland security. House bill 527 by Representative Barnes, the 86th, Taylor, the 92nd, Carter, the 93rd, Owl, the 50th, Maynard, the 56th, and others. Bill of the Tidal, an act to amend, Goat Section 22, 261, and the official go to George Antetta relating the common minimum facility requirements. Education. House bill 528 by Representative Gaines, the 120th, Saints of the 180th, Smith, the 18th, Wheedow, a 120th, first, Burtchetta, the 176th, and others. Bill of the Tidal, an act to amend, Article 15, Chapter 1, a title 10 of the official go to George Antetta relating the deceptive or unfair trade practices. Agriculture and Consuminate Affairs. House bill 529 by Representative Williams, the 148th, Lumps to the 12th, Gunner of the 8th. Bill of the Tidal, an act to amend, Title 33 and 40 of the official go to George Antetta, relating insurance and motor vehicles and traffic. Insurance. House bill 530 by Representative Burtchetta, the 176th, Smith to the 18th, Leather of the 23rd and Gunner of the 8th. Bill of the Tidal, an act to amend, Article 5, Chapter 11, a title 9 of the official go to George Antetta relating the deppositions and discovery. Judiciary. House of Resolution 255 by Representative Drenner of the 85th, the Resolution Creating, now study committee on environmental justice. Natural Resources and Environment. House of Resolution 256 by Representative Perkwell, 169th, and House to the 170th, Resolution Conning, and Life of Miss Sophia Ruth Fisher, dedicating an interchange in her memory. Transportation. House of Resolution 257 by Representative Hilton of the 48th, McCall of the 30th, Daniel 117th, Camp of the 135th, Gamble of the 15th, and others. Resolution requesting the United States Congress, co-located convention on the Article 5 of the Constitution. Rules. Senate Bill 13 by Senator Alvers, the 56th. Robertson, the 29th, Dugan of the 30th, Payne of the 54th, Beech, the 21st, and others. Bill Bittado, an act to amend, Code Section 913, 161, 40, 14, 162, and 48, 41, and the official go to George Antetta relating to where and when, sales under execution can be held. Judiciary. Senate Bill, 61 by Senator Strickland of the 17th, Dugan of the 30th, Walker of the 20th, Anderson of the 43rd, McLaren of the 14th. Bill Bittado, an act to amend, Code Section 34110, the official go to George Antetta relating the uses sick leave for care of immediate family members. Industry and labor. That completes first readers. Second reading of bills and resolutions. Let's suspend just for a minute, Mr. Clark. I see almost no activity in the any rooms. They're feeling lonely. I think that's what they were made for. For a little conversation, so if members will take part of this conversation to the any room, then we'll swap out. Some of y'all can come back in and talk and some of you can stay out there. So let's be respectful of the clerk as he has removed to the second reading of bills and resolutions. Thank you. House Bill 4455 by Representative Matthew of the 74th, hatched at the 150th, Smith of the 70th, Gunter of the 8th, Powell of the 33rd, and others. The bill relating to nurses, House Bill 446 by Representative Reeves of the 99th, so Cox of the 53rd, Hilton of the 48th, Daniel of the 117th, Crow of the 118th, and others of Bill relating to crimes and offenses, House Bill 447 by Representative Vance of the 133rd, Collins of the 71st, Mitchell of the 88th, Powell of the 33rd, Blaves of the 112th, and others. The bill relating to murder, vehicles, and traffic. House Bill 448 by Representative Scofield of the 63rd, Mitchell of the 88th, Scott of the 76th, Davis of the 87th, Bennett of the 94th, the bill relating to insurance, House Bill 449 by Representative Knight of the 134th, Corbord of the 174th, Roads of the 124th, Canon of the 170th, Perkel of the 169th. The bill relating to General Provisions for Adrenaline Taxation of Property, House Bill of the 18th, F. 134th, Rochette of the 176th, Reaves of the 99th, and others, the bill relating to courts, and General of the 751th, by Representative Sebald, the 34th, Canon of the 101st, Hitchens of the 160th, Varscans of the 120th, Camp of the 135th, and others, the bill relating to public officers and employees, House Bill 452 by Representative Perkel of the 169th, Jasper of the 11th, Meeks of the 178th, Roads of the 124th, Knight of the 134th, and others, the bill relating to General Provisions, Relentrum to Agriculture, House Bill 453, by Rempton, Hilton of the 48th. Cooper of the 45th, Sharper of the 177th, Hockens of the 27th Sebald, the 34th, and others, a bill relating to health, House Bill 454, by Representative Blackman of the 146th, Wilkinson of the 38th, Knight of the 134th, a bill relating to revenue and taxation, House Bill 455, by Rempton of the hood of the 175th, Cooper of the 45th, Newton of the 127th, Silcox of the 53rd, Rees of the 140th, a bill relating to General Provisions, Relentrum to Professions of Business, House Bill 456, by Rempton of Gunter of the 8th, Thumbs of the 12th, Gagons of the 14th, Silcox of the 53rd, Collins of the 71st, a bill relating to General Provisions regarding Municipal Courts, House Bill 457, by Rempton of the 147th, Irwin of the 32nd, Wade of the 9th, Wtf 29th, Cooper of the 134th, and others, a bill relating to employment under the Quality Basic Education Act, House Bill 458, by Representative Perkel of the 169th, Cooper of the 174th, Williams of the 148th, and Roads of the 124th, a bill relating to hemp farming, House Bill 459, by Rempton of the 12th, Collins of the 71st, Gunter of the 8th, Hitchens of the 161st, Gagons of the 14th, a bill relating to Children's Fingerprints, photographs and names, House Bill 460, by Rempton of the 23rd, Camp of the 135th, Rees of the 99th, Silcox of the 53rd, a bill relating to Juvenile Code, House Bill 462, by Rempton of the 23rd, Gunter of the 8th, or Shadow of the 176th, Oliver of the 82nd, Camp of the 135th, a bill relating to the Juvenile Code, House Bill 463, by Representative Ballinger of the 23rd, Sains of the 180th, Hitchens of the 161st, a bill relating to powers and duties of the Bureau, generally House Bill 465, by Representative Powell of the 33rd, a bill to amend the Georgia Lottery for Education Act, House Bill 466, by Representative Bonner of the 73rd, Jank of the 136, Cannon of the 172nd, Clark of the 100th, a bill relating to Massage Therapy Practice, House Bill 467, by Representative Tarvan of the 2nd, Cameraman of the 1st, a bill relating to courts, local governments, public officers, employees, revenue and tax action, House Bill 468, by Representative Bentley of the 150th, a bill to amend and act to provide a new charter for the City of Butler, House Bill 469, by Representative House of the 170th, Hagen of the 156th, Jones of the 25th, McCallum of the 30th, Crow of the 118th, and others, a bill relating to the Loitering Act, or disrupting schools, House Bill 450, 470, by Representative Cooper of the 75th, Harris of the 150th, over to the 123rd Smith, the 18th, Reeves of the 99th, a bill relating to medical and other confidential information, House Bill 471, by Representative Crow of the 118th, Powell of the 33rd, Washington of the 144th, Robert of the 52nd, Reeves of the 99th, and others, a bill relating to Commerce and Trade, House Bill 472, by Representative Crow of the 118th, Blackwood of the 146, Hitchens of the 161st, Lums of the 12th, Powell of the 33rd, and others, a bill relating to the Employees Retirement System of Georgia, House Bill 473, by Representative Daniel of the 17th, and Matthew of the 74th, a bill to provide a homestead exemption from Spalding County School District at Valaram, Texas, House Bill 475, by Representative Smith of the 18th, Year to the 102nd Franklin, with 160th, Scott guns of the 14th, Barrett of the 24th, a bill to amend the official credit Georgia annotated, and further into the work of the Coat Revision Commission. House Bill 476, by Representative Beverly of the 143rd, Bennett of the 94th, 520th, and the bill relating to tax credits for qualified low income buildings, House Bill 477, by Representative Lever of the 123rd, P3 of the 166th, Prince of the 130th, Jackson of the 128, the bill relating to soil amendments, House Bill 478, by Representative Holley of the 116th, Gailey of the 162nd, Crawford of the 84th Park of the 177th, a bill relating to purchase, possession, manufacture, distribution, sale, control substance, or marijuana, and penalties. House Bill 479, by Representative Hutchinson of the 106th, Hugh Glee of the 141st, Scott Field of the 63rd Crawford of the 84th, Barrett of the 142nd, a bill relating to general provisions regarding adoption. House Bill 484, by Representative Carter of the 93rd, Beverly of the 143rd, Evans of the 57th, Oliver of the 82nd, Blackburn of the 146th, and others, a bill relating to teachers of the time and system of Georgia. House Bill 485, by Representative Clayton of the 109th, Gailey of the 162nd, Friday of the 120th, Alexander of the 66th, Hugh Glee of the 141st, and others, a bill relating to minimum wage law, House Bill 46, by Representative Evans of the 89th, mentally of the 150th, Evans of the 57th, Fleming of the 125th, Mathes of the 149th, a bill relating to cemetery and funeral services. House Bill 487, by Representative Newton of the 127th, Owl of the 50th Cooper, the 45th camp, the 135th, a bill relating to assault and battery, and a bill relating to offensive against persons. House Bill 488, by Representative Reeves of the 99th, Daniel of the 17th, Elton of the 48th, Washburn of the 144th, Friday of the 120th, and others, a bill relating to income taxes, House Bill 489, by Representative Horner of the 3rd, Dunhu, the 31st, Clark of the 100th, the bill to amend the Georgia Entertainment Industry Investment Act. House Bill 490, by Representative Fry of the 120th, Second Base, more of the 69th, Willis of the 50th, Holcomb of the 81st, Romana of the 97th, others, a bill relating to income taxes. House Bill 418, by Representative Cameron of the 1st, Workhyes of the 157th, Anderson of the 10th, Sebald of the 134th, the bill relating to labor and industrial relations, House Bill 519, by Representative Paris of the 158th, the bill to create the Immanuel County Public Facilities Authority. House Bill 520, by Representative Jones of the 25th, all over the 82nd, the 2nd, the 1 104th, by the 1 143rd, Cooper of the 45th, and others, the bill relating to housing authorities, House Bill 529, House Resolution 229, by Representative Draper of the 90th. Resolution prohibiting amendments to the Constitution, so as to prevent, as a provision relating to failing vacancies in the Office of the Secretary of State Attorney General State School Superintendents, Commissioner of Insurance, Commissioner of Agriculture and Commissioner of Labor, House Resolution 230, by Representative Hatchett of the 150th, the Resolution honoring the life of Deputy Emory A. Roland, dedicating a road in his memory. House Resolution 231, by Representative Hatchett of the 170th, Williams of the 168th, Hitchens of the 161st, Resolution recognizing the Westbury and Vietnam War veterans, and dedicating a bridge in their memory. House Resolution 232, by Representative Hatchett of the 106th, Cooper of the 45th, Romana of the 97th, Bear of the 143rd, out of the 50th, and others. Resolution creating the House Study Committee on evaluating, simplifying, and eliminating duplication regulatory requirements for mental health and social service providers. Senate Bill 12, by Senator Albers of the 56th, Representative Lee 29th, Dougan of the 30th, Payne of the 54th, Beech of the 21st, and others, are bill relating to crimes and offenses. Senate Bill 56, by Senator Hatchett of the 52nd, and Williams of the 25th, are bill relating to Adeloran taxation. House Senate Bill 84, by Senator Hatchett of the 52nd, Estabes of the 6th, Kirkpatrick of the 32nd, Williams of the 25th, Boxing of the 1st, and others, are bill relating to amend the Georgia Uniform Security Act of 2008. Senate Bill 93, by Senator Invarca of the 31st, Kennedy of the 18th, Guitua of the 51st, Robertson of the 29th, Brass of the 28th, and others, are bill relating to Information Technology, Senate Bill 112, by Senator Invarca of the 31st, Robertson of the 29th, Payne of the 54th, Guitua of the 51st, Pickman of the 4th, and others, are bill relating to vocational technical and adult education through 2nd readers. Reports of standing committees, the clerk will read. Representative Robert Dickie, the 145th District Chairman on Committee on Agriculture Consumer Affairs submitted the firing report, and we speak to committee on Agriculture and Consumer Affairs, and set on a consideration following Bill of the House. The struck committee reports, saying back, the House following recommendations, House of the 33, do pass by Substitute House, but 187 do pass by Substitute, respectively submitted, Representative Robert Dickie, the 145th District Chairman. Representative Don Parsons, the 4th District Chairman on Committee on Energy, Utilities, and Telecommunications submitted the following report, but speaking to committee on Energy Utilities and Telecommunications, is that on a consideration following Bill of the House. And this was struck to me to report, saying back, the House following recommendations, House of the 73, do pass by Committee, Substitute House, but 438 do pass, respectively submitted, Representative Don Parsons, the 4th District Chairman. Representative Chuck Martin, the 49th District Chairman, the Committee on Higher Education, submitted the following report, and we speak to you committee on Higher Education, as that it's consideration following Bill of the House, is the struck to me to report, saying back, the House following recommendations, House of the 122, do pass by Committee, Substitute, respectively submitted, Representative Chuck Martin, the 49th District Chairman. Representative Gunner, the 8th District Chairman on Committee and Judiciary, submitted the following report, and we speak to you committee on Judiciary, said on it's consideration following Bill of the House, and it's the struck to me to report, the same back, the House following recommendations, House of the 30, do pass by Committee, Substitute, House of the 204, do pass, House of the 254, do pass by Committee, Substitute, House of the 44, do pass, respectively submitted, Representative Gunner, the 8th District Chairman. Representative Dale Washburn, the 144th District Vice Chairman, the Committee on Regulated and Industries, submitted the following report. Mr. Speaker, your committee on Regulated Industries, is that our next consideration following Bill of the House is struck to me to report, the same back, the House following recommendations.\n\nHouse Bill 155 to pass by committee substitute House Bill 212 to pass by committee substitute respectfully submitted�ndail washroom the 144th district vice chairman�ndam Karen Matthew act the 74th district chairman on committee and state planning community affairs submitted the following report but speak your committee on state planning community affairs as under the consideration the following bill of the house Instructed media report the same back to the House of following recommendation House of 43 new passes respectfully submitted because of Karen Matthew act the 74th district chairman That completes the reading of the reports of standing committees We'll move on to morning orders members we have some morning orders this morning We'll begin our morning orders this morning on one that I'm sure I'm sure every member of this house needs to hear So we need your full attention Pay attention to the chairman in the well who's going to bring some clarity To some information on your desk Chairman buddy the luch is recognized for a morning order Chairman the luch Thank you mr. Speaker On your desk you will find this blue book I want to thank the clerk's office and Office of legislative council for all the work they've done putting this together Under this blue cover You find everything you ever wanted to know about ethics They've done a tremendous job. I urge you to take time To study what's under this blue cover I promise you there's at least one member of this house That will get in trouble somewhere down the line because they didn't take time to read this Please don't let that be you If you come to me and ask me a question about ethics The answer is did you read the book Because it's in the book thank you mr. Speaker. Thank you mr. chairman. It can't be any clearer than that Members we have some morning orders and we're going to ask you We have a lot of business to take care of the day. I want to ask you to try to you're very very best to hold it to one minute Representative Bennett is recognized for a morning order Thank you, mr. Speaker Representative Bennett. Thank you mr. Speaker and colleagues. It's my honor To ask my alpha alpha women to colleagues to join me in the well today. We are recognizing kappa omega a Georgia chapter of alpha kappa alpha soror to incorporate it for their 100 Centennial anniversary in the early third decade of the 20th century a group of aka women living in Atlanta We're compelled by their own experiences as members of alpha kappa alpha to to organize the first graduate chapter in the state of Georgia So today we have with us in the gallery and I ask you to join me in welcoming kappa omega 100 years old this week and Atlanta Georgia The first chapter in Atlanta of alpha kappa alpha sorority incorporated Thank you, mr. Speaker and we yield the well Thank you ladies and welcome ladies and about in the gallery good to have y'all We represent Jasmine Clark represented Clark chairman prince chairman prince Here he is good. Thank you, mr. Speaker Good evening Good morning colleagues. It is my pleasure To welcome to the state house The Jefferson the Jefferson County youth leadership. That's one of the rule areas that I represent They should be walking through right now. You're of course you see all the seats up there No one can get in but they just walked through a little while ago, but they're the president Miss air avery berry of the Local chamber you also have Miss Tammy Hodges who works with those Young leaders But when you see them, please welcome them to the people's house. Thank you mr. Speaker Thank you, mr. Chairman and welcome Welcome Representative Jasmine Clark recognized for a morning order and she has friends coming with her to the well represented Clark Thank you, mr. Speaker good morning colleagues. I have the honor and pleasure of welcoming the guanette N. W. A. C. P and their president penny pool for their annual black family day at the Capitol They are here with us in the gallery. Please stand Stand in way Thank you so much for joining us today in the people's house Thank you, mr. Speaker and welcome to your House of representative your house our house representative Bentley Is recognized for a morning order here she comes Giver some room. She's coming through. Oh, yeah, she has friends as well. Yeah, come on down represent it Bentley's in the well Thank you, mr. Speaker. Thank you mr. Speaker today is a great day at the state capitol You know why because in the gallery we have the three public HBCUs represented here the Fort Valley State University The all-Buenestate University and the East of the state University So we ask that you all please stand and welcome them to their state capital Yes Fort Valley State University all-Buenestate University and Savannah State University We're so glad to have the alumni association of a three all three HBCUs represented here on today in the state capitol Please go by and visit them as the we are so happy to have them visiting today That was great. No, I don't want to see me. Yeah, all right. Thank you mr. Speaker and thank you colleagues I'm wearing my blue and go hat today and honor of Fort Valley State University Yes, ma'am and sir. Thank you. Thank you So try factor we're glad to have all of you here today Especially the Tigers from Savannah state All right Chairman green And chairman yurt are recognized for a morning order What miss speaker is really the second district Congressional district and friends and friends. Thank you mr. Speaker Ladies and gentlemen on the house We have in the gallery. I hope is congressman Sanford Bishop and Congressman Bishop is Visiting the camp to today he will be meeting with each one of us a little bit later on but he has served our State he has served our nation and it's our honor that's morning to welcome Congress from Sanford Bishop to the people's house. Thank you very much You know He's in the Senate I guess he's still in the Senate mr. Speaker Mr. Chairman Comments from Bishop's done a great job for us. He's a good man. He's welcome in the house Let's see here representative Holly represent McClain Representing Sheila Jones represented glaze for a morning order and some other friends All right Thank you mr. Speaker today it is a good day because it is labor day at the Georgia Capitol Mr. Speaker Joining us will you rise our invited guests here? We have oh man. This is beautiful Georgia. We actually have here's Sandra Williams as well as Eric Richardson of the Atlanta North Georgia labor council Come on give it up for them We have we have uh we have James Williams our friend here We have so many unions here that honestly if we name them you actually might find that you're naming every member of your community But I'm not the only one we're gonna make it quick go on Lydia Yeah And so in the best form we can do we will say that we have a union leader a She leader in the house That is none other than Evon T Brooks A native of St. Louis But the former secretary and treasurer of Georgia AFL CIO She has been duly elected now as the new president first woman first African-American Of AFL CIO Georgia and we came today to say thank you for your work Thank you for working for families and thank you for making work work in Georgia Thank you so much all right repeat after me see they were strong They were strong Thank you mr. Speaker Welcome to the people's house Chairman no Williams Recognize for a morning order Thank you mr. Speaker I would like to recognize the Polesky youth future leadership class They're up in the gallery with stacey vickers. We'd like to welcome you to the people's house and thank y'all for being here today You're welcome young people. Thank you mr. Chairman Represented to gilly hard Chairman gilly hard recognize from one order It's bigger. I think we have some neighbors adjourning your great district And we're glad to have from the seaport city from the waterways from the squares from the the tourism From all over Savannah Georgia members of Savannah Georgia I hear today Would you please welcome them to the people's house of energy a Thank you mr. Speaker Welcome neighbors good to have y'all You Chairman yirder would you come down and introduce us to the doctor of the day y'all give chairman yirder a little room there Thank you ladies chairman yirder You Good morning colleagues. It's my pleasure to introduce the doctor of the day doctor Kush decide he's a board certified internal medicine physician practicing hospital-based medicine that Phoebe Putney hospital And Albany he also serves as the assistant dean for the medical college of Georgia Southwest campus He's a two six two thousand sixteen graduate of ms mcg south west campus And return to the region to direct mcg's clinical campus and train the next generation of physicians Additionally doctor decide as an expertise and disease profession and as obtained numerous grants from the FCC USDA and the CDC to reduce health disparities in rural Georgia He co-founded a national program or a statewide program which successfully increased colon cancer screening rates for underserved clinics He utilized his experience to collaborate with partners from the CDC funded Georgia Coloratrical cancer institute program which he serves as a regional medical director Some of his recent Recognitions include Albany chamber of commerce 2021 under 40 young professional the year 2021 Phoebe impatient attending Doctor of the year medical college of Georgia's 2020 young alumnus of the year Please join me in welcoming doctor decide to the people's house Thank you mr. Chairman now. I hope all of you paid attention to that to that introduction Because that's what medical training in Georgia should be about right graduate of a medical college of Georgia and then return to Home area to practice like you Representative and till The physician how much we appreciate him being here and taking care of us today and what he's doing for the people down in southwest Georgia Mr. Clerk As soon as we get our attention focused in the right direction here We're gonna ask you to read a resolution Special resolution if you will Now sir if you read representing martin and representative Irwin House resolution 197 by resident martin the 49th Irwin of the 40th of the 32nd McDonald's 26th honor the 103rd and gamble of the 15th a resolution Recognizing February 22nd 2023 as governors honor program day at the state capital Cheerwin chairman Irwin chairman martin you're recognized chairman Irwin Thank you mr. Speaker In colleagues. We're fortunate to have 18 members of the 2022 governors are honors program with us in the gallery This program is served over 37,000 Georgia high school juniors and seniors in the past 60 years And by the way the general assembly has several members of our body that have been participated in the governor's honors program here including representative victor Anderson Representative Houston gains and representative marvin limb each year 650 to 700 of Georgia's most talented high school rising juniors and seniors are selected through a very competitive selection process to attend this four-week rigorous and intensive educational experience on the college on a college campus From those who have attended in the past year I have heard or over the past few years I've heard that the program was life changing and magical The rigor experienced during the program is not typically experienced in a high school setting The long lasting friendships continue to thrive over many decades or what some of our own colleagues have told me We are excited to have these students with us this morning to celebrate the governor's honors day At the capital and to recognize 60 years of magic for tens of thousands of students governors honors alumni alumni up in the gallery please stand and let's recognize you Thank you for attending We also have four members on the floor here with us today Anna Julia Costa Lima from Denmark high school majoring in Spanish Sophia Sun from Johns Creek high school majoring in visual arts And from my district Ella Strickland from East Jackson comprehensive high school majoring in agricultural research biotechnology and science colleagues thank you for your attention to this and I'm going to ask the deputy director of governor's honor program to say a word to Thank you mr. Speaker chairman Irwin chairman Martin and representatives my name is Donovan head And I'm the deputy director of the governor's office of student achievement where the proud host agency of the governor's honors program I want to give special thank you to governor Kim and to speaker burns for their support of the program along with Goza executive director Joy Hawkins school services director friend dundor Ricky Palmer and Trevor case and who manage the program The chairman just recognized our three distinguished Representatives that are alums and we want to thank them and also point out that out of our group here and up here We're hoping to have some members on the floor soon um That's future Georgia leaders of these these 18 representatives the other sides in the Senate, but they represent 30 of your house districts They represent 650 of their peers altogether representing 120 of your house districts Um and and over 37,000 alumni of the program as a whole We just want to thank you all for your support because of this house's support We're able to accelerate our 60th year of the program And we'd like to invite all of you to join us in room C-L-O-B 310 for lunch We've got plenty of lunch available and love to have you come by and speak with the students. Thank you 60 years of the governor's honors program What a great group of young people thank you for being here and those up here And mr. Director, thank you for what y'all are doing You Members these leaders will be out in the south any room if there's someone from your district that's up here We'd like for you to have a photo with them Thank you German Yoder And Excuse me Oh German Irwin in chairman martin You You You You Members You just heard the introduction of our physician of the day and now doctors aside Is they able to come back and join us on ask y'all to stand and give him a round of applause and thank him for his service Not only to this body, but to our state I just want to say thank you to everybody for your support for rural Georgia and physicians and rural Georgia As well as for the medical college of Georgia our goal is to train physicians that train in Georgia And then come back and practice here and that's what of course I've done So thank you guys for your support You Ladies and gentlemen, we have one more special resolution, but As is the custom of the Senate they're pretty slow so we'll we're gonna move on to the rules calendar We're gonna move on to the rules calendar mr. Clerk You The clerk will read the caption to house resolution 157 157 House resolution 157 by reps and a green in the 154th and others Authorizing at least a certain state-owned property located in Apple & County Authorizing the conveyance to certain state-owned property located in bacon county Leaderize and release of certain state-owned property located in bacon county And authorizing the conveyance of certain state-owned property in Morgan StNewton and Walton counties This be in that this resolution. Having been Assigned to the committee on state properties that committee recommends that this resolution be adopted by committee substitute. Chairman of State Properties, Chairman Green, is recognized, the dean of the House is recognized to present the resolution. Thank you, Mr Speaker. Mr Speaker and members of the House are bringing for your consideration House resolution 157 substitute. This is our annual conveyance resolution that allows and authorizes the state of Georgia acting through our State Properties Commission to convey or lease certain state-owned properties. Mr Chairman, Mr. Chairman, is the spend just for a moment? I bet you all can solve those problems in any room. Mr Chairman, I think they can hear you now and have their attention on the issue at hand. So proceed, Mr Chairman, continue. All right, thank you, Mr Speaker. The properties that you are considering in House resolution 157 by substitute, they are listed in the resolution and I'm not going to read each one of them, but if you were contacted by my office and by state properties, then you are in the list there. And Mr Speaker, if there are no questions, I would ask this House to vote in the affirmative for House bill 157 by substitute. You do a next lit job there. Do you agree? No questions? Is there any objection to the previous question being ordered? Chair, here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? Chair, here is none. The report of the committee is agreed to. Shall the resolution now be adopted? All in favor of adoption? Of the resolution will vote yes. All those opposed will vote no and declared will unlock the machine. Have all members voted? Or come on and vote? Have all members voted? If so, the clerk will unlock the machine. On the adoption of the resolution, the yeas were 168, the nay zero. The resolution haven't received the requisite constitutional majority is therefore adopted. We are going to suspend just a moment from the rules calendar. We have another special resolution that I think all of you all will be interested in. Mr. Clerk, we are going to allow Representative Brad Thomas to be a part of this and his guest. Mr. Clerk, would you read the resolution? House resolution by Representative Thomas, the 21st, the 11th, the 22nd, parts of the 44th and bird of the 20th. A resolution recognizing commending Bryce Leatherwood on being the winner of the 22nd season of the voice television series. Well. Representative Thomas, I very begrudgingly hand their microphone over to you, recognize Representative Thomas. Thank you, Mr. Speaker. In December 2022, Bryce Leatherwood won the voice on NBC. By the way, what a great name for a country music singer. With him today or his parents, Cliff and Hope. By the way, he's a Cherokee County native and one of my constituents. He starts singing in 7th grade at Dean Rusk Middle School in Canton, attended high school at Sequoia. The graduated May 22nd from the state's greatest university, Georgia Southern University, is a fellow alumni of many people up here. At 22 years old during a blind audition, he wowed the judges by turning three chairs and ended up on Blake Shelton's team. His last two songs.\n\nIn the competition, we're Don't Close Your Eyes by Keith Whitley and TROUBLE by Elvis Presley. Luke Bryan, Cole Swindle, and now it's my friend, Bryce Leatherwood. Thank you. Thank you all so much. Thank you all. Well, you know, I owe a lot to Georgia and everybody who lives in the state of Georgia. They've always supported me even before the voice, and they've continued to afterwards. We as artists were asked during the finale to write a letter of dedication to the people who mean the most to us, and a lot of people wrote about their families and stuff like that, and while my family is very important to me, I decided to write my letter to the state of Georgia. The people of Georgia mean the most to me, and it's thanks to them that I got all the success that I did. And God bless Georgia. Georgia is always on my mind and God bless the USA. Thank y'all. Georgia, what is this? Well done. What is it? I don't know. There you go. That was so much. That was a good start. By the way, the mayor would stop telling me to tell you, I can't really y'all talk to people. You don't do a couple of things. Oh, yeah, one of that. Come on, man. Yeah, come on, do it. Come on. You ready? Do it. Do it. Do it. There you go. Come on, man. Performance. Come on, rise. Thank you. Georgia, Georgia. The whole day through. Georgia is an old sweet song. Keeps Georgia on my mind. Yeah. Thank you so much. We're going to take a son over there. Never heard it done any better. Never heard it done any better. Thank you, Bryson. Congratulations. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. And panels, and scrolls. The chair recognizes representative Greene Chair recognizes Representative Green to present the bill. Thank you, Madam Speaker. To my colleagues, I bring you House Resolution 158. This is another annual resolution that authorized the State of Georgia acting through our State Properties Commission to grant easements over certain state-owned properties. These easements are listed in your resolution, and there are a number of them, so please look at those. And Madam Speaker, if there are no questions on House Resolution 158, I ask the House for a favorable consideration of House Resolution 158. There are no questions. And I yield the whale, Madam. The gentleman has yielded the whale. Are there any objections to the previous question being ordered? The Chair here is now in the previous question is ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The Chair here is now in the report of the committee is agreed to. Shall this resolution be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the adoption of the resolution. The yeas were 163, the nays were zero. The resolution haven't received the requisite constitutional majority is therefore adopted. The clerk will read the caption to House Bill 299. House Bill 299, our representative Thomas, the 21st and others will be titled an act to amend Code Section 159, 2.1, Title 16, Title 19, Title 20, and Title 2, Title 38, Chapter 2, Title 40 of the official code of Georgia annotated relating the appointment compensation authority qualifications training and other limitations of associate probate court judges. As Bill have in further committee on defense and veteran affairs, that committee recommends that this bill do pass. The Chair recognizes representative Thomas to present the bill. Thank you, Madame Speaker. It's common knowledge that we have the finest military on the earth, whether it be sea, land, or air. Now we as a civilization, we head out to space, the final frontier. This bill recognizes the space force as one of the branches of the state government. It actually listed out in 13 sections. We individually name every branch of the military, so this now adds to the space force as one of them. All they do is ask for your favorable consideration and beyond the behalf of all of our future space force people. I hope they boldly go where no man has gone before or person. Thank you. You have a question? I'll yield. The Chair recognizes representative Sains for question. Does the gentleman yield? Yes. No more in this bill. Does it relate to any other spaceships going from any other part of the state? There's no specific mention of Camden County anywhere in this bill. Thank you. Thank you. The Chair recognizes representative McCollum for question. This is gentleman you. I do. Is it true that you promised that we'd get a rocket ship ride if we vote for this bill? You go ahead and vote for it, and we'll see you about getting either ride on the rocket ship. There are no more questions. Thank you Madam Speaker. Ask for your favorable consideration. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 168. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 317. House Bill 317. House Bill 317, members of the tailor, 173rd and others to be titled an act to amend. The bill is written in 19 to title 47. The official code of Georgia annotated relating the state, employees insurance department. So, it's to provide for the assignment of certain group term life insurance benefits to pay for funeral services. Of an deceased individual as a member of the employees retirement system of Georgia. This bill I've referred to the committee on insurance. That committee recommends that this bill do pass. Chair recognizes Representative Taylor to present the bill. 17, LC432612. This is a bill that reflects on our retiree program. It's an old program that is no longer in effect, but it would allow the beneficiaries of life insurance to assign the benefits to the funeral home. I've passed this bill last year and it didn't get out of the Senate. And it basically does will allow those beneficiaries to pay directly to the funeral homes. Are there any questions? The lady has a question. Chair recognizes Representative Bentley for a question. Yes, ma'am. Thank you, Madam Speaker. That's the gentle lady yield. I do. Isn't it not true that I am extremely excited that age house bill 317 is being presented today and the strawberry queen is going to be so very excited when all of members of the House of Representatives vote yes for house bill 317 on behalf of the funeral home caucus of Georgia. Is that not true? That is very true. Thank you. Thank you so very much. And thank you, colleagues, for your yes vote to house bill 317. Chair recognizes Representative Taravan for a question. The lady yield. I do. Does this make it easier for the funeral home caucus to collect their money after a death of a person named Hannah LaBody? Yes, it will. It will. It's the decision of the beneficiary and it will help everybody. Thank you. We feel like we're all from here with that situation after nine years. Thank you. There are no more questions. Thank you. Are you the well and ask for your favorable consideration? Is there any objection to the previous question being ordered? The chair here is not the previous question is ordered. Is there an objection to agreeing to the report of the committee which is favorable to the passage of the bill? The chair here is not the report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 171. The A's were 1. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 285. House Bill 285. House Bill 285, aye. Chair of the Senate, frankly, 160th and others to be entitled to amend Article 7 of Chapter 20, Title 40, 70th, fiscal. The Georgia annotated the public retirement system's investment authority law so as to raise the limit for the total percentage of funds that the employment retirement system of Georgia may invest in an alternative investment. This bill haven't referred to the committee on retirement. That committee recommends the disbiddle do pass. The chair recognizes, I'm not sure I recognize this name, representative Franklin to present the bill. Thank you, Madam Speaker. Members of the assembly, on your desk, you will see a letter that's written from the director of the employment retirement systems of Georgia in full request of this bill and full support of the bill. I also want to add that it flew through committee with unanimous support. But this bill would amend provisions relating to the public retirement system investments authority law. Current law authorizes most eligible large retirement systems to invest up to 10% of their assets in alternative investments. However, the employment retirement system is limited to a 5% investment in alternative investments. If this legislation is enacted, the limited limitation currently placed on the employment retirement systems would be removed and the system would be authorized to invest up to 10% of their assets in alternative investments. So I ask your full support consideration of the bill and I'm Speaker, I yield the well. Not so fast. The gentleman has some legitimate questions. Chair recognizes Chairman Smith to your right or to your left for question. Does the gentleman yield? I yield. Is it not true that this is your first bill on the floor? It is. And is it not further true that although we may share the same alma mater that you are indeed a freshman? It is true. And is it not further true that we've led without this legislation until you got here? That is true. Aren't you glad that I arrived? The gentleman further yield. So it's your position here today that we cannot live without it since you got here. It is as the gentleman speaks. Thank you. Chair recognizes Representative Martin for question. Do you write? I mean, you'll for question. I yield. Don't you think we, isn't it true that we'd be better off in this world if we treated all things equally and we could all get along? In some cases, yes. You don't believe that in all cases. You clearly don't believe it in this case, isn't it true? Because in your bill, you only address large retirement systems. I'm wondering if the gentleman could tell the house what he has against small, medium, and extra large systems. And after you do that, can you tell me exactly what a large retirement system is and what's the difference between it and a medium and extra large? Well, a large system is a large system. A medium system is a medium and a small is a small. But with this large system, it is imperative that we pass this bill so that they can have a better return on their investment. Chair recognizes Representative Mom to him for question. Thank you, Madam Speaker. This is gentleman Yeal. I yield. I was looking at the documentation for your bill today from the great gentleman or state auditor, Mr. Greg S. Griffin. What I see that this letter is addressed to a chairman Carson and my eyes aren't good, but I don't see a chairman Carson out there. Can you explain yourself? Yes, sir. Thank you for that question. Chairman Carson is in full support of this bill and he was very much like you to vote for it. Then it's a great bill. Thank you, sir. Chair recognizes for a last question Representative McDonald. To your right. Thank you, Madam Speaker. I yield. I've taken House Bill 285 and I want you to set it flew through committee. So if this does not fly, can we vote against your bill? I'll go with that. All right. Just want to test. Oh, it's perfect. It's great. Mr. There's a speaker on the well. You know the questions and the gentleman has yielded the well. Thank you. Is there an objection to the previous question being ordered? The chair here is not in the previous question is ordered. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is not in the report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will unlock the machine. On the passage of the bill, the yeas were 171, the nays were zero. The bill having received the requisite Constitution majority is therefore passed. Clerk will read the caption House bill 203, House bill 203. House bill 203, but resident of Newton, the 127th and others to be entitled to amend chapter 12 with Title 31 of the official go to Georgia and Taterley in the control of hazardous conditions preventable diseases and metabolic disorders so as to revise provisions relating to restrictions on the sale and dispensing of contact lenses with respect to physicians. This bill I refer to the committee on health. That committee recommends a disbile do pass. Chair recognizes representative Newton to present the bill. Thank you Madam Speaker. And thank you colleagues. It's good to be here. I know we were all challenged by the chaplain. I know I was this morning to come ways we can work together just to better the lives of our fellow Georgians. I know each of us brings our area of expertise, our committee service that we volunteered for, we got assigned to. We all want to make a difference in the lives of others. This is one area of health care that I work in a little bit and what this particular bill does is expand an option for telemedicine. Much of telemedicine we tried in the during the pandemic. It's appropriate for some things but it's not appropriate for others and sometimes we've had to learn the hard way when that's appropriate. But it can't be tremendously important in our rural areas but it doesn't mean it's unimportant with our suburban and urban areas. House bill 203 in particular looks to expand the option for Georgians who wear contact lenses for vision correction, correction. The technology as well as our comfort level, both the patient and the provider and telemedicine is increased since we last addressed I care in 2015. Over the past two and a half years we've gotten valuable input from really all areas of I care professionals. We've gathered this from optometrist to prescribe most of the contact lenses in Georgia. We've gotten it from ophthalmologist, the medical association of Georgia plus input from I care professional organizations that provide telemedicine in 47 other states. These I care telemedicine providers actually use board certified Georgia licensed ophthalmologist to evaluate patients with what's called an I assessment to checking their vision and their I assessment by telemedicine with careful safety guardrails. This allows them to do that for up to 24 months of refills. Currently the current Georgia code calls for an in person exam every year by everyone who wears contacts. I will say the initial prescription for contacts still has to be done in person along with any follow-up visits. That's very important and very important that somebody haven't provided immediately available. It also puts guardrails around any telemedicine on people with higher risk conditions. In the bill we've described those as long as we stay between 21 and 50 where there's low risk of other I problems as long as there's no diabetes, hypertension or other high-risk conditions. It has felt and has been the input of all the professionals I've mentioned that this would be a safe expansion of telemedicine for I care in Georgia. I have appreciated the work of the I care professionals and the professional organizations outside this room. There's been great input. There's been great agreement and look forward to coming from this with better access, affordability and convenience for patients across Georgia. So I appreciate your favorable consideration, Madam Speaker. I'm glad to stand for any questions. You have a question. The chair recognizes Representative Ridley for a question. This is gentleman Eul. I know you said that this bill you've got to have your initial prescription. Is this just like if I'm renewing that same prescription? Correct. If you're in those age, you have none of the conditions mentioned in the bill that puts you at risk. If you're within the 21 to 50 age range, which is also a low risk, it's determined that as long as you've seen an I care professional in person in the last 24 months, you can get one or two refills. Okay. So there is a timeline on 24 months. Right. Yeah. Okay. There are no more questions. Appreciate your favorable consideration. Gentlemen, is Eul did the well? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose does Minority Leader Beverly rise? I pursuant to House Rule 133, I asked to be excused from this vote. The gentleman has that right and the journal will so reflect. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the A's were 171, the NA's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 207. House Bill 207. House Bill 207. House Bill 207, my motion of rose, the 124th and others to be titled. Next to a man, article 1 on chapter 7 of Title 52. The official go to Georgia, annotated relating the general provisions relative to registration, operation and sales of watercraft. So it's to provide for the carrying of night visual distress signals upon coastal waters of the state during certain hours. This bill then, it's signed on the committee on Game Fish and Parks. That committee recommends a dis bill do pass by committee substitute. Chair recognizes representative Rhodes to present the bill. Thank you, Madam Chair. I have before you, House Bill 207, this bill does two simple things. It's basically our dinner update. We're just updates and mistakes that were made in code from previous years. The first issue is our distress signals. We're just making it where it is for coastal waters, not all waters. Just coastal waters for the distress signals in this state. The second thing is, is for our voting operators currently in current code. If they have an accident, they can leave the scene and have 48 hours to report the accident. This legislation just simply says they have to stay on scene until authorities arrive. That's the bill, Madam Speaker. You have a question? Yes, ma'am, I'll take one. The chair recognizes representative Gallup for a question. Thank you, does the gentleman yield? Yes, sir. So a hit and run on a vehicle. Is that a felony today or is that a misdemeanor or do you know? I think you know that answer, don't you? Well, looking at the bill quickly, I don't know the answer. I think I have an idea, but I don't know the answer. I'm no attorney. I'm sure we have somebody who can answer that for us. OK, but this will be a felony on a voting. Yes, because you're dealing with water. And if you just completely ignore everything and leave, there are a lot more consequences on water than it is on land. Thank you. Yes, sir. I yield the way, Madam Speaker. There are no more questions. And the gentleman is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the report to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted if so, the clerk will lock the machine. On the pass of the bill, the a's were 170, the a's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill.\n\n167 House bill 167. House bill 167, Revive Reps of Monta-Hon of the 17th and others to be entitled and act to amend Code Section 4564. The Fish Quotid Georgia Annotated Relating and Limited Driving Permits for Certain Offenders. So to provide for standards for issuance of such permits, this bill I'm referring to committee on motor vehicles that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Monta-Hon to present the bill. Thank you, Madam Speaker, members of the House. Today I present to you House bill 167. House bill 167 simply adds language to the code that allows a person that is in a Rears for child support to receive a limited driving permit, allowing them to continue to work and pay the errors for that child support. Now, I've note a judge would still have to approve the issuance of such permit and it is not in any way an automatic process. A permit issued under this legislation would be revoked if the individual is not catching up on the child support owed and let's be clear. This legislation does not reduce any penalties on those who do not support their children. It doesn't encourage folks not to pay their child support. It just simply allows a judge who knows the facts of a case to recognize when someone who is behind on their child support can or cannot drive to work. And so we're giving that discretion back to these judges. It's not going to make it easier for them to get current, but it allows them to again work to get current. If a judge were to have viewed or I'm sorry, if a judge issues this name to driving permit to someone who chooses to abuse that privilege, this legislation makes it clear that they shall lose that permit if they're not catching up. Today we have 119,000 hard suspensions that are not eligible for these folks to go back to work. And I think we're aiming at trying to get these folks back to work and supporting their children. Madam Speaker, and I'm sorry, DDS and DHS are both in support. The child service division are in support of the bill. And Madam Speaker, I would yield for any questions. Do you have questions? The chair recognizes Representative Holly for a question. Thank you, Madam Speaker. Does the gentleman you? I you. Is it not true that I along with probably many members in this house look forward to you actually speaking from the well just because we love the tone of your voice? Well, thank you. I am. Yeah, I appreciate that. Thank you very much. Just general for the you. Certainly. If you got any more compliments, I'll take as many as I can get. Is it not true that about a few years ago used to work at that courthouse building about a couple of blocks from here, writing up child support warrants and it troubled me that we could actually have opportunities for parents to make good on getting a job, actually making sure they could pay for their family, but we just needed them to be able to get there. And so I certainly am going to support this and I appreciate you bringing this bill. Well, thank you. And I thank that you know children and families have to come first. And that's the intention of the bill. Thank you. I would like to present it mentally for a question. Thank you Madam Speaker. Does the gentleman yield? I do. Is it not true that I will be voting in support of House bill 167 because I believe that not only will this bill help get fathers back to work, it certainly will help with the transportation deficiencies that we face in rural Georgia. Is that not true? That's great. And is it not further true representative that this bill will certainly help address the workforce shortage that we are facing in rural Georgia and also be able to ensure that families can remain strong with the fathers working and being able to help with their families incomes and issues? That's not true. That's absolutely true. It's putting folks back to work and putting food on the table. That's a famous and children come first. Right. Thank you for your work on this bill. Thank you very much. The chair recognizes for a last question representative Paris for a question. Thank you ladies here. This is gentleman yield. I yield. Thank you sir. So I'm certainly in favor of the bill. Would you tell me what is the process that the delinquent parent father would have to go through in order to get to having their license reinstated? That's right. So under the provisions of this bill a deliquant parent could petition a court or judge that would then issue an emitter driving permit and would be of course monitored by all the parties. You've got a lot of folks that are invested in this process from lawyers opposing counsel making sure that in holding accountable to these folks are going to go to work pay this child support this in the rear. And that's important part right. We want to get to work but what else I want to pay back that child support in getting them to pay back that child support and putting that food on the table is a number one concern. Chair representative thank you for your work on this. This will unlock just a part of father's rights and appreciate your work on this bill. Thank you very much. Well that man of speaker I yield the well. The gentleman is yielded the well. Is there any objection to a. Is there any objection to the previous question being ordered the chair here is not in the previous questions ordered. Is there any objection to adopting the committee substitute chair here is not in the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here is not in the report of the committee has agreed to shall this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. If so the clerk will lock the machine on the passage of the bill the a's were 168 the nays were zero the bill having received the requisite constitutional majority is therefore passed. Clerk will lead the caption to House bill 121 House bill 121 House bill 121 by the represent of Anderson to the 10th to be titled an act to amend Article 1 of chapter 7 of Title 52 of the fiscal to Georgia and it's had a relating the registration operation in sales of water craft. Generally so is the provide for restrictions requirements regarding awake surfing and wakeboarding. This bill I refer to the committee on game fishing park second committee recommends that this bill do pass chair recognizes representative Anderson to present the bill. Thank you Madam Chair colleagues I bring before you today House bill 121 this have this bill is designed to protect personal property and also personal safety on Georgia's lakes and waterways. Currently the state has a regulation that says within 100 feet of the shoreline or stationary structures docs etc. In all lakes public lakes in the state of Georgia motorized water craft can operate above an idle speed not generate we can refer that as a no-week zone. A contemporary issue has come up within the last several years with a popularity of a sport called began as wakeboarding now it is wake surfing. This is where a boat that has specially designed ballast or a boat that has been retrofitted with ballast to be filled with water sit very deep in the water at a slow speed and generate a wake that is 3 to 4 feet high that can literally be surfed on with a surfboard. What this bill does is this for only that activity when that size of a wake is being generated that has the capability of being surfed this bill limits that activity to outside of a buffers on of 200 feet. It does not affect water skiing is defined in here that it is only pro activities that is related to boarding. It does not affect private lakes it does however protect the shoreline the personal safety the water craft of those in our lakes and waterways who own property and enjoy the activities along those areas. Madam Speaker that is the bill I will take any questions if there are. Gentlemen has a question the chair recognizes representative Ridley for a question. Gentlemen you yes sir you said that these wake boats when you put water in and they go down lower in the water to make bigger waves correct. Yes sir and that is the only boats that will be affected by this bill. This bill does not actually direct its enforcement towards a boat or a specific type of boat directs it to the activity of generating a wake of that size. So it could be a boat that is defined as a manufactured wake boat it could also be a boat that has been retrofitted to serve that same purpose. Gentlemen further you yes sir let me give you a hypothetical situation if I've got a regular boat and I put four liter McDonald in the back and it lowers it down in the water more. Am I breaking the law at that point if that causes a wake large enough for yourself or someone to surf on then yes sir. If you're if you're within 200 feet of the shore so the answer is yes four liter. Thank you. Thank you. Chair recognizes representative Dickie to your right for a question. Does the gentleman yield? Yes sir. Going from 100 to 200 is pretty big jump. How will operators be able to determine where 200 feet is and the size of the wake and some of those types of objective issues that they are might bring forward to operator. Thank you for the question that's a really good question. This bill was actually crafted with the cooperation of Colonel Bernard from DNR. His answer to that question is there when they promulgate the rules to enforce this they'll part of that process is an education process to make sure the signage is posted and that their rangers and the law enforcement agency of DNR understand and work with the public and the voting public to not necessarily use a hammer on this but to do that. Use a hammer on this but to make use of the educational process. Does the gentleman further yield? Yes sir. What do you feel like DNR is doing a good job and I enforce it in 100 feet. I know I know landowners and property owners complained about when they get close but do you think the hundred foot is being been used now in a proper way. Again another very good question and my answer would be this within the resources that DNR has I think that they're doing a good job of addressing the complaints that they get. Our DNR law enforcement agency is approximately 40% under staff at the time. A lot of that's due to a lot of reasons we've had a lot of discussion related to that from a budget standpoint and from a DNR standpoint that's something that we will need to address and we do need to address not just within that. I think it's not quite an arm of law enforcement but across the board. But to answer your question when they are contacted they're having to address those issues and they're trying to do the educational process as much as I can in between. Thank you. Chair recognizes representative Meeks for a question. Thank you Madam Speaker. Is the gentleman you own? Yes sir. Just wanted to ask does this pertain to inter-custom waterways as well? Does any publicly accessible waterway in the state of Georgia that DNR has the enforcement jurisdiction on? Thank you sir. Chair recognizes representative Mom to him for a question. Like you Madam Speaker this is gentleman you. Yes sir. I hate to follow up Representative Redley's question within the high pivotent but when I jump off the back of the boat it makes quite a wake. Now if these are totally man-made or organic or naturally made wakes is that included in the bill? Well in the case of the gentleman with the healthier diet that he is exercising that wake is nowhere near as much as it used to be. So no sir I don't think they would apply. Well you got a yes vote on that. The chair recognizes for a final question representative McDonald to your right. Thank you Madam Speaker. Is gentleman you? Yes sir. Isn't it true that a lot of the issues came from the late communities there being proactive and they are going to be producing maps at the passivist bill that they are going to distribute, educate their people not only with signage but map drawings to show where 200 foot buffers will be and 100 foot buffers just for educational purposes or all their lakes. That is correct. The lake associations that we have worked with in the crafting of this bill have been very proactive in their plans to provide education and to provide notices on their properties and the lakes that they work with. I will as a final note Madam Speaker if I may. This bill as it is presented has the full support of the national motor boat manufacturers association as well as the water sports industry association. So both the boat manufacturers and the water sports associations are in support of this bill as it stands. And with that I will ask for your favorable consideration. Madam Chair I will yield the well. The chair recognizes chairman Powell to speak to the bill. Madam Speaker and ladies and gentlemen the House. I want to come to you today in full support with my thanks to my friend represented from the 10th district. This is a bill that has been trying to get something done with a few years. But because of the nature of this is a recreational event. A lot of people don't understand the seriousness these week boat the week boats have created as far as danger not only to the other boaters but do not yet but to the to the lock to the docks and to the other boats that around. Now something about water at alcohol we always said they don't mix. Well this is water and entertainment and fun for people's families they buy these boats and I understand some of these are in excess of $150,000 for these specialty boats that make these huge weeks. Well right now the Georgia law is a hundred foot weight group. I think the question was asked about DNR and I will tell you that DNR does a great job. But they don't have enough manpower for the lakes and for the lakes in the recreation areas that we have in the state. I can tell you as a member of this house that lives on probably one of the bigger lakes in the state of Georgia. Lake Harle that transcends and joins both Georgia and South Carolina and it's a big lake. But even with that lake people come down they bring their weight boats down but there's a failure there's a disconnect in common sense. Instead of getting out into the middle of the lake where they can use these boats and the wakers subside by the time it gets to the docks or the other boats they don't do it. Somehow they always want to get right up close. Now they may stay a hundred foot out but a hundred foot quite frankly is not enough room to dispel a four or five foot wake. When I talk about the damage it's done floating docks it can literally throw you or your children or your grandchildren off of these docks. It breaks the cables on these docks. It will pick a boot up and sit it on the side of a dock when these wakes hit. So this is a good first attempt. Representative Anderson saw the need in this. He took it forward it didn't go as far as some of us would like for it to have gone. But I think it's a good first step. It defines that there's a four hundred foot barrier from bank to bank that these can be used in its two hundred feet. I opted for three hundred foot didn't go but I adhere to the committee action on that. It may come back at some point but right now the message should be give the Rangers a little bit more latitude so they can enforce something that common sense should have told me they should tell these people. Don't destroy somebody else's property with your fun and entertainment. That ladies and gentlemen is what the bill does. I would certainly commend this to you for your vote and do something for the vote and for the property owners and the folks who enjoy the lakes in this state. That's been all out of you the well. The gentleman has yielded the well is there any objection to the previous question being ordered the chair here is not the previous questions ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here is not the report of the committee is agreed to. I'll just bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no in the clerk will unlock the machine. All members voted. If so the clerk will lock the machine on the passage of the bill the yays were 164 the nays were zero the bill having received the requisite constitution majority is therefore pass. The chair postpones to the next legislative day House bill 226 House bill 226. We're moving on to afternoon orders the chair recognizes representative Nguisi. We'll from Reverend Dr. Durley. He's actually last of the iconic civil rights leader. So I'll tell you about him if you didn't know. I stand before you my assembly colleagues to recognize the world-renowned Reverend Jett Gerald Durley, a man of God whose life stretched across the struggle for racial equality against the Jack Jim Crow in the South. He was a wait, I'm sorry. He educated African Americans as to their family heritage to a long academic college career at Atlanta's own Clark University as well as none other than Morehouse College. To his current role as pastor and mentor as at Providence Missionary about this church, this man of God is the Paragon of Commitment to his community. When John F. Kennedy was assassinated Reverend Dr. Durley turns tragedy into triumph as he honored the late president with service in Nigeria with the Peace Corps. With deep knowledge acquired from years of study into psychology, his renowned faith by meddling civil and human rights under the banner of God's Kingdom and when he found another opportunity to help overlook and under serve communities, he left into action. By joining with George's ONTED Turner and Northern actress Jane Fonda, two prominent environmentalists as well as countless other leaders in the conservation movement, Reverend Dr. Durley incorporated the preservation of our scarce planet, especially when the abuses of our Earth fall, disproportionately upon those without means and pursued knowledge of activism once more in the name of the deeply rooted beliefs. While he is a proud Christian, Reverend Dr. Durley is a man of faith of all Christians, Muslims, Jews, Buddhist Hindus, he would tell you just like Dr. Martin Luther King Jr. said, none of us are free until we are all free. And I don't know if he's still in the galley, but he might not be. But thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Chair recognizes Representative Carpenter for an afternoon order. All right, folks. I know it's getting late. Everybody's getting hungry, but just a little shout out today is Georgia Restaurant Day at the Capitol. Just in case you didn't know, Georgia restaurants have an economic impact of $24.9 billion and employee over 11% of the employees in the state in the food service and restaurant industries. But more important tonight at the Georgia Freight Depot is the taste of Georgia from five to seven. It's the finest event that we have when we're down here. Sorry if Savannah and everybody else. But it's worth a bunch of restaurants. Bring a bunch of small tastings to come try them all out. So get down there tonight, support your restaurants, and load up. Thanks for having us. For what purpose does Representative Smith rise? To make a motion, Madam Speaker. Stage of motion. I move the House bill 267 be transferred from the House Ways and Means committed to the House Judiciary Committee. Both chairmen are in agreement. Clerk will read the caption. House bill 267, my representative Smith of the 18th and others to be entitled to amend Article 1 of Chapter 7 in Title 4080, the Fish and Put of Georgia and its editor relating to General Provisions relative to income taxes. On the gentleman's emotion, the House bill 267 be withdrawn from Ways and Means and recommitted to the Judiciary Committee. Is there objection? Hearing none at us so ordered. Clerk will read the caption to a group of privileged resolutions. Honoring the Life and Memory of Vincent Joseph Dooley. Honoring the Life and Memory of Dr. Crawford Lewis. Celebrating Black Economic Empowerment and Black Excellence in the Iron Hour of African American History Month. Recognizing Commending. Whether Dedicated Service to the Cab County Community. Graduating them on the Grandication of the 30th anniversary. Commending the C'Tusa County and GOP. Recognizing Commending Reverend Dr. Daniel Stephenson upon the Grandication of his retirement. Congratulations, Commending. Surely Barbara James for receiving the 2023 Yellow Rose Niki T. Randall Servant Leader Award. Honoring the men and women who have served. Are serving or one day serving. They're in law enforcement. The military branches of the United States. The firefighters in recognizing May 2023 is united in uniform recognition in Memorial Month. Recognizing Commending Elizabeth Carr Hurst. Recognizing March 1st, 2023 is a med-share international day at the state capitol. Congratulations, Dr. Amy Sharma for receiving the 2023 Yellow Rose Niki T. Randall Servant Leader Award. Recognizing Commending Cindy Marrella Portal Salazar. Commending Georgia Alignment. And recognizing April 10, 2023 is Georgia Alignment. Appreciation day at the state capitol. Recognizing Commending Bryce Leatherwood. I mean the winner of the 22nd season of the voice television series. Recognizing February 20, 2023 is Alpha Kappa Alpha Sorority Day at the state capitol. Congratulations, Commending. Carol Eisen for receiving the 2023 Yellow Rose Niki T. Randall Servant Leader Award. Recognizing the success of layperson CPR training and increasing the survival rate of cardiac and supporting efforts to enhance public awareness of the need to such training. And recognizing Commending Chief Stacey Ellicotton. And for other purposes that completes the reading with privilege resolution. Is there any objection to adopting the privilege resolutions? The chair here is not and the resolutions are adopted. We'll have announcements and then we'll have page photos. If you have an announcement, there's a long list. Please come up to the front so that you're ready and we can move through this efficiently. The chair recognizes Representative Corbett for announcement. Thank you, Madam Speaker. Eight o'clock in the morning. The Motor Vehicle Committee. Full Committee will meet in Room 606 CLOB. And the rule caucus will have lunch upon a German over the Ag Building. Come, join us if you will. Thank you. Chair recognizes Representative Gillier for announcement. Chair recognizes Representative Skofield for announcement. Good morning colleagues. Tomorrow is put on purple day. I see the leader of the chair. You just smile. It's a way your purple tie tomorrow. It's Lupus Awareness. Lupus advocacy day here at the Capitol. If you haven't gotten a Lupus cape, I still have some available. But everybody show up in purple tomorrow. Thank you. Chair recognizes Representative Bruce for announcement. Those of you that mistaking the picture this morning with the Black Caucus, we're going to meet on the same steps right after a German and take a picture of those that were not there this morning. So we looked forward to seeing you. Chair recognizes Chairman Workhouse for announcement. Thank you Madam Speaker. The House Industry and Labor will speak. We'll meet today CLOB 506 at 3 o'clock. Thank you. Chair recognizes Representative Mitchell for announcement. Thank you. The Democratic Caucus will meet very important meeting at 1230 in room 605 in the CLOB. Once again, that's at 1230, 605 CLOB. Lunch will be provided. Thank you Madam Speaker. Chair recognizes Chairman Knight and Representative Anulo-Witz for announcement. Just wanted to announce that remind you that it is the Georgia Japanese Caucus lunch. This is a Caucus lunch and today this is in CLOB 307. Right now upon adjournment and we'd like to invite all the Caucus members to come over there and join us for lunch. Thank you. Chair recognizes Representative Hilton for announcement. Thank you Madam Speaker. This is a reminder. We have our House Education Policy Subcommittee. The House Education Policy Subcommittee.\n\nafternoon four o'clock in room 406 CLOB. Thank you. Chair recognizes Representative Saints for an announcement. Thank you Madam Speaker. Special rules today is canceled for the two o'clock meeting and will meet on the 27th at 1 p.m. at 415 CLOB. Chair recognizes Representative Tarvan for an announcement. Interant subcommittee on Prop 10 casualty will meet in 403, capital 403 at 3 o'clock. Interant subcommittee on Prop 10 casualty. Chair recognizes Chairman Smith for an announcement. Good afternoon colleagues. Next morning at 8 o'clock, room 606 CLOB. Full committee meeting of the House Natural Resource and Environment Committee. Several bills before us. Thank you. Chair recognizes Representative Clark for an announcement. Thank you Madam Speaker. GLBC we will meet by Zoom today at 4 p.m. Check your emails for the Zoom link. Also future caucus, this is just a reminder that we're having dinner tonight at 6 p.m. Thanks. Chair recognizes Representative Hitchens for an announcement. The Georgia Association of Chiefs of Police are in town today and there will be a legislative reception. All legislators are invited from 6 to 10 at the Georgia Tech Conference Center. Come out and meet your chief of police and enjoy some refreshments. Chair recognizes Representative Jasper's for an announcement. Thank you Madam Speaker. Transportation, you've got it in your inbox. Repeatedly today, we have changed the room. It's at 2 o'clock in 341 to accommodate larger crowd. Hope to see you there. House Bill 189, Representative Meeks. Chair recognizes Representative Yurtiff for announcement. Thank you Madam Speaker. Code revision committee members, this is what you've been waiting for. We have a meeting today at 3 o'clock, 415 CLOB. Thank you. Chair recognizes Representative Ballinger for an announcement. Thank you Madam Speaker. Your juvenile justice committee will meet this afternoon at 2 o'clock in room 506 in the CLOB. Thank you. Chair recognizes Representative Petri for an announcement. Thank you Madam Speaker. To all the members of aging and human relations, we'll have a full committee meeting today at 4 in room 341 here in the Capitol. We're going to take up four important measures. Thank you. Chair recognizes Representative Jones for an announcement. Thank you Madam Speaker. The Technology and Infrastructure Innovation Committee will meet at 2 p.m. CLOB 406 to listen to a few simple bills. Thank you. If you have a page, please make your way down so we can take a picture. Chair recognizes the majority leader for a motion. Thank you Madam Speaker. I move that this house stand adjourned until 10 a.m. on Thursday, February 23rd, 2023. On the motion of the majority leader that the house stand adjourned until 10 a.m. Thursday, February 23rd, 2023. All those in favor will say aye. All those opposed will say nay. The aye is clearly have it and this house stands adjourned. If anyone, I did want to make one final announcement. If anyone finds a $100 bill, please bring it to me from my left pocket. Actually belongs to Representative Scofield. Pages, please make your way to the front.",
  "updated_at": "2026-02-13T05:39:32.623423+00:00"
}