{
  "video_id": "4Qs2er5Zilo",
  "url": "https://www.youtube.com/watch?v=4Qs2er5Zilo",
  "title": "Appropriations Subcommittee Meeting for Day 29 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 29,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Overview:\nThis transcript covers the Georgia Appropriations Subcommittee meeting for Day 29 of the 2025 legislative session. The subcommittee discussed several line items in the state budget related to the judicial branch, including increases in funding for judicial salaries, security initiatives, recruitment and retention efforts, legal fees, and new judgeships.\n\nKey Actions:\n- **HB199**: Bill carried by Vice Chairman Kelly that lowered funding for traditional security initiatives.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- Prayer led by Representative Matthew Gamble to start the meeting.\n- Discussion of various budget line items related to the judicial branch, including salary increases, legal fees, and new judgeships.\n\nVotes:\n- Motion to approve the subcommittee's decisions on the judicial budget line items passed.\n\nAttendance:\nNo explicit quorum notes.\n\nAdjournment:\nThe subcommittee adjourned after completing its business.",
  "transcript": "As early as we could be here, so thank y'all for being here, we'll get kicked off.\nAs we did last time, we're going to hopefully rapidly go through each section and move on\nthrough the next section without waiting for the publicized time to start, but we're just\ngoing to do that.\nfirst thing I'd like to ask representative Matthew Gamble if he would open us in prayer.\nThank you chairman let's pray Lord we thank you for today God we thank you for the rain\nand pray that you would just be with us during this time be with us during this day\nGod give us inside and wisdom lead us in the decisions that we have to make protect our families\nis we're away. In Jesus' name we pray. Amen.\nAmen.\nChairman Gallett, I'll turn it over to you.\nPlease.\nThank you, Chairman.\nGood morning.\nAll right, we'll start on Section 5,\na Pills Court 5.1.7 increased funds,\nannualized judicial judge salary expenses.\nThis is a two-time bump,\none beginning July 1st,\nJuly 1 and 1 beginning January 1. 6.4.5, increasing funds,\ntraditional security initiatives, that's something that we've lowered from\n340,000 to 108,600. That's as part of HB199 carried by Vice Chairman Kelly.\n6.4.6, increased funds for targeted recruitment and retention initiatives.\nThat's something we lowered a little bit just because retention is pretty good\nover there. We have some really dire needs elsewhere. 6.5.2 outside legal fees. We kept that\nthe same. I just want to call out. There's a number of lawsuits related to the JQC. For\n$50,000, 6.5.2 increased funds for us out legal fees. Again, we didn't change that,\nthere are a number of lawsuits there,\nand I think they'll have to be adjusted here soon.\n6.6, this is prosecuting attorney's qualifications commission.\nThis is something that was under PAC before\nand has been brought under judicial counsel.\nThat's for $1,125,000.\n$6.7.2 increased funds to annualize\nthe salary enhancement for judicial counsel's\njudicial compensation reform.\nAnd that's something that was brought to us at $29,871.\nWe've moved at the $50,478 for two salary increases coming up one beginning July 1st\nand one beginning January 1st.\nThat's all for judicial counsel.\nJuvenile courts, there's really no changes there, just a minimal things.\nWe'll do section 8, prosecuting attorneys.\npoint 1.4 provide funds for one conflict case investigator that was\nsomething that was $191,000 $191,289 we haven't seen sufficient caseload to\njustify that at the time 8.1.5 we've stricken that that was provide funds for one\nconflict case prosecutor at $289,021 again not sufficient caseload at this time\nWe have a revised number for $8.3.4, that was $201,409, we've lowered it to $201,340.\nThat was given to us by the PAC.\n$8.3.7 increased funds for one-year revised pay scale.\nThat's something that we're going to look at into the future.\nSo we've just shaken that $1,754,395.\n$8.3.8 provides funds for four districts attorney positions this is\nsomething that we added in the amended budget but was taken out when we\nactually passed it so we've added two of those positions back for a total\nof $451,781 we just want to call out 8.3.10 this is this new judgeship\npositions and something that we're funding half of and those judge ships these\nADA's because those judge start January 1st and we provided half at $260,000,\n$620, 8.4.6 for five funds for deputy general counsel. That was $260,000, $452\nof something that we have passed on at this time. $0,8.4.7 for one victim\nadvocate. That's something that was $60,469 and we will address that into the future.\nSo it was $0 and then you'll see the 8.5, really specifically 8.5.2. This is where\nprosecuting attorney's qualifications commission was under PAC and has now been moved to judicial counsel.\nThat's all for prosecuting attorneys.\nSuperior courts.\nYou'll notice 9.3.5, 9.3.6, and 9.3.7.\nThose are new judge ships for Alapaha Augusta and the Douglas Circuits, provided at\nhalf 225,847 and then eight point I'm sorry 9.3.9 judicial sour restructuring\nplan and this is something that we have increasing beginning on January 1st I\nI believe.\nSo that's a $14,465,177 dollars.\nSoftware Spear Reports.\nSupreme Court wanted to call out 10.1.7.\nThis is increased funds for the pay increase.\nThis is moved from $668,437 to $611,168.\nThis is a two-time bump, one beginning July 1st,\nand then the follow-up beginning January 1st.\nPublic Defender Council.\nI wanna call that 37.2.4.\nThis is increased funds for a juvenile conflict\ndivision manager position.\nIt was a 226,517 dollars.\nWe're stricken that is something\nwe also struck out during the amended budget.\nAnd then you'll notice 37.2.8\nfor the three assistant public defender positions for those new court\ncircuits we mentioned earlier that was 211,169 dollars and it's all we have do\nwe have a motion we have a motion do we have a second second all in favor say\naye all is opposed thank you motion passes subcommittee judicial is adjourned\nYou\n",
  "updated_at": "2026-02-12T18:04:54.250883+00:00"
}