{
  "video_id": "4RpuHoMK8VM",
  "url": "https://www.youtube.com/watch?v=4RpuHoMK8VM",
  "title": "1/23/2024 Senate Committee on Rules",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 15,
  "summary": "Here is a structured summary of the Georgia 1/23/2024 Senate Committee on Rules session:\n\n**Overview**: The session covered several pieces of legislation, including a resolution to form a special committee to investigate the Fulton County prosecution, as well as bills related to Cobb County Board of Education redistricting and a resolution recognizing Pure Bred Dog Day.\n\n**Key Actions**:\n- **SR 465**: Resolution to form a special committee to investigate the Fulton County prosecution. Passed unanimously.\n- **SB 338**: Bill to redraw Cobb County Board of Education maps per court order. Discussed.\n- **SR 158**: Resolution creating a logistics corridor in West Georgia. Discussed.\n- **SR 344**: Resolution recognizing May 1, 2024 as Pure Bred Dog Day. Discussed.\n\n**Bills Introduced (First Reading)**: None noted.\n\n**Notable Moments**:\n- Discussion around the subpoena power and enforcement for the special investigation committee.\n- Bipartisan collaboration on the Cobb County redistricting bill.\n\n**Votes**:\n- **SR 465**: Passed unanimously.\n\n**Attendance**: Quorum present.\n\n**Adjournment**: Session adjourned. Next session date not specified.",
  "transcript": "to order, we are going into standing committee where you have your agenda here and on the\nagenda's SR465, Senator Dozall, we've got the summaries being passed out as we speak.\nAnd Senator Dozall, I'm going to let you walk us through your fine piece of legislation.\nYou can go up there, that's fine.\nThat's where we do all our grandstanding in this committee room.\nHopefully no grandstanding today, Mr. Chairman, I'll walk you through this resolution.\nWe're with Legislative Council on the Secretary of the Senate's office in developing this.\nAnd we are forming this one relatively familiar to the way we form study committees in the Senate.\nAnd essentially what this resolution does is it forms the special committee on investigations.\nit empowers that committee of nine members,\nsix from the majority party, three from the minority party,\nto investigate the allegations that have been in the media\nrelative to the Fulton County prosecution,\nI think we're all familiar with.\nAs we know, the state funds about $30 million\nto the prosecuting attorney's council,\nabout $3 million of that goes to Fulton County.\nAnd so what a lot of my constituents have been asking\nis how has that money been spent?\nIs there anything that needs to happen with state law?\nWas there a conflict of interest here?\nThere's a lot of questions.\nMr. Chairman that are out there in the public\nand we are merely going to empower this committee\nto have those questions answered.\nAnd then the committee will be able to,\nas you see in the final whereas,\nis we'll be able to make recommendations\nas it relates to legislation that we may need to take\nas a body to ensure that cases are prosecuted\nin the state of Georgia as they should be.\nSo with that, I'm happy to take any questions, Mr. Chairman.\nI got a question from Senator Beatch.\nYeah.\nChairman Dolezal, could you talk about lines 50 to 54\nwith subpoena power under oath?\nYes, so we have inherent subpoena power in the Senate.\nThat's codified in law and the code sections\nthat are mentioned there.\nAnd obviously, due to the sensitive nature of this topic,\nAnd what this resolution does is it confirms the powers of subpoena and taking testimony under oath to this special committee very similarly to the way that the senate does that in the senate rules to the ethics committee.\nSo the ethics committee in the case of ethics complaints being filed has that same authority.\nSo this committee for similar reasons will have the same power that we confer in our rules to the senate ethics committee.\nAnderson has a question.\nSenator, how soon would this committee be created?\nIt would be created upon passage on the floor of the Senate.\nSo from here, we'll go from standing rules to regular rules.\nIf it makes out of regular rules, it goes to the floor.\nAnd then it goes to the floor.\nYou'll see language in here that gives the committee\non assignments the authority to make the appointments\nof the nine members that I mentioned before.\nSo should this all move through the process,\nthe committee on assignments would take that up.\nwho has sent letters to those on the committee,\nthen the chairperson would have the ability\nat any time to begin to have meetings of that committee.\nThank you.\nI got a quick question on the subpoena.\nWho enforces that subpoena?\nFulton County Court in a similar way\nthat the ethics subpoenas would be enforced.\nAnd we've seen in the past where they have chosen\nnot to enforce the subpoena,\nwhat measures could be taken at that point?\nI would leave that to what I think will probably\nlegal experts on the committee to help us cross that bridge, should we come to it, certainly\nhope it doesn't come to that. Fair enough.\nSenator Watts. Thank you, Mr. Chairman. Thank you, Senator Dullesall. I appreciate you\nbringing this. Just a question. This is a committee that is made and is there a time frame\non this, time limit, or is this in perpetuity? This would be an effect through this biennium.\nthis committee would exist as it's formed by this particular Senate chamber it would go\nthrough the end of the year and that it would be we would need to form a new committee should\nthe Senate choose to do so at the start of next session.\nYou know what goes through the same process again.\nCorrect.\nGot you.\nThere will always of course be the option for the Senate to adopt different rules at the\nstart of the next by any if they wish to have a committee that was a standing committee\nsimilar way there are existing standing committees. Any further questions. All right. Thank\nyou, Senator Dulles off for that fine presentation. All right. What's the will of the committee?\nMr. Chairman, I'll move the pass on SR 465. Sorry. All right. I got a motion from Senator\nBeach on the passing of SR 465 LC number 472726. I've got a second from\nSenator Anderson. Is there any other further discussion? All in favor raise\nyour right hand. I can't vote. I'm showing you what to do. One, two, three, four, five, six, seven, eight, nine, ten. I've got ten\nall the polls same sign one two three okay motion passes that will go on to\nthe floor and up back to rules all right I think by having any other actions\nI'd like to do and standing while we're here none all right standing is a\nadjourned. I'm going to call our rules committee into order. Got your yellow sheet\nhere on bills that are available for consideration. So let's start with SB338.\nSenator Setsler. The stand is yours. Mr. Chairman, members of the rules committee,\nbring before you, Senate Bill 338. As you may know, the Northern District of Federal\nCourt struck down the 2022 reapportionment plan for the Cobb County Board of Education\non December 14th and issued an order that the General Assembly should redraw maps following\nsome prescriptions by the judge that meet consistent\nreapportionment principles.\nThe initial order said that it should be done by the,\nand enacted into law by the 10th of January.\nThat's not achievable, of course.\nA subsequent order was given that that would be enacted\nby the 22nd of January through both chambers\nand some other governor.\nWe also know that's not procedurally possible.\nThat order was to achieve the 22nd of January\nstruck down by the in the 11th Circuit Court of Appeals last week. Now there's\nactually two motions in the 11th that affect the case. But in spite of all of\nthat, we as a legislature have an obligation to enact reapportionment\nplans that comply with court orders that comply with the Federal Voting Rights\nAct meet consistent reapportionment principles and that's exactly what you have\nbefore you hear.\nSenate Bill 338 is not the map passed by Representative Erhart in 2022.\nIt's not the map passed by any other partisan actor.\nIt is a map that is squarely committed to doing one thing and acting a map that follows\nJudge Ross's order and puts in place a map in time for the Cobb County Board of Education\nto have it be put in place in Cobb by the Board of Elections so that our primary can happen\nand we can proceed.\nSo I'm asking a federal consideration of this committee.\nWe've taken the time we needed to do this.\nA lot of work's gone into it.\nI met for over three hours with a bipartisan group\nof our delegation members.\nThe first week of session, over two separate days.\nThis had two hearings in committee\nand I offered to the committee.\nBe glad to take questions.\nAny questions from the committee?\nThank you, Senator Setswar.\nOkay, next up we've got SR 158, Senator Annert of the Tarte, in fact you got a couple\nhere if you want to cover both, that would be appropriate.\n7-1, just remember that.\nYour mic is hot.\nThank you, Mr. Chairman, SR 158, this committee voted on last session, basically created a\nlogistics corridor in West Georgia from Hurd County up to Walker County and then I'm\nSenator Dickson is actually going to present Senate resolution 344 on the floor if this bill ever gets called up\nSo I'm gonna let our expert of dogs here\npresent it\nThank you, Mr. Chairman\nSR344 would recognize May 1st, 2024 as pure bread dog day\nThank you\nReally\nSeriously been working hard this all season huh\nProud of you. Thank you proud of you. Do you run that through your education committee?\nNo sir. No we didn't\nBe glad to Mr. Chairman. I can't wait\nDon't forget about the earth dog\ndogs\nHow can we forget about earth dogs?\nAll right. Any questions for either of the authors? Senator Anderson, where are you now?\nSenator Dixon, could you all the logo for the pure bread dogs, be a bulldog?\nI think that would be purely appropriate here in the state of Georgia.\nAll right. Go doggies.\nGood dogs. Yes, Mr. Chairman.\nSenator Anderson's question, that may force me after voting, it's my\nability. If we do that, just for the record. I'll join you. Thank you. Okay.\nSenator Summers, did you have something you'd like to talk to the committee\nabout? Yeah, that's how you get a bill passed. Representative Skoggins, would\nas you like to address this fine, all-guess body.\nYes, sir, thank you, Mr. Chairman.\nThis is the same bill I presented last year\nto the committee.\nThis is House Bill 290LC50645S.\nAnd this is the bill that allows the tax commissioners\nto contract with municipalities in the county governing\nauthority to collect municipal court\ntaxes for that municipality.\nAnd we kind of put a few guidelines on it.\nWe limited the amount of the contract\ncould be far.\nIt could be no greater than 50% of the base pay\nof the tax commissioner.\nAnd it passed out of the House 161 to 1.\nAnd I'll be glad to answer any questions.\nWho is the one?\nI don't know, not worth mentioning in their name, huh?\nI know, there you go.\nAny questions?\nOK, thank you.\nThat one's on the general calendar,\nand we'll make that available as soon as we can.\nThank you, sir.\nThank you.\nAny other members here that I can't see?\nOK.\nSenator Jones, did you, I've missed you on SR323?\nI know we covered that in standing,\nbut if you want to give us a brief.\nChairman, it's number 12.\nAnd this is to see how we can improve caregiver services,\nsomething that many of us will have to face.\nAnd just to basically see how the state can improve,\nproviding those services to help family caregivers\nwhen somebody gets really sick,\ncatastrophic with sick and has to go home\nand be taken care of.\nGood deal.\nAny questions for the author?\nOkay.\nAll right, let's pick a few, so where am I on my list?\nSenator Alvers.\nI'll let you have a pick.\nMr. Chairman, I'd like to pick Senate Bill 338, please.\nOkay.\nMadam Leader, would you like a pick?\nWhat, can you say that again? I'm sorry.\nI'm going to let our newest member pick.\nI'm going a little out of order about senior order here, but I want to see if he'll pick\nhis own bill.\nWhat do you want?\nI certainly will.\nDrum roll.\nSR344.\nHold on.\nHold on.\nSay it again.\nI want you to say it loud for our people.\nThank you, Mr. Chairman.\nI would like to pick SR344.\nI can't believe he picked it.\nMan.\nI'm not backing down.\nI love it.\nAll right.\nSo for the floor tomorrow, we have SB338.\nSB338, SR323, and SR344.\nI've got a motion from Senator Albers do pass.\nI got a second from Senator Beach.\nAll in favor say aye.\nAll opposed, same sign.\nMotion passes, unanimous.\nWe're done.\nAll right, let's...\n",
  "updated_at": "2026-02-12T19:51:51.934095+00:00"
}