{
  "video_id": "4XNqboz_g_I",
  "url": "https://www.youtube.com/watch?v=4XNqboz_g_I",
  "title": "3/22/23 - Committee on Retirement",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 5,
  "summary": "Overview:\nThis session of the Georgia Legislature's Committee on Retirement focused on a single bill, SB 308, which sought to extend a recent increase in retirement benefits for current members of the General Assembly to those who had already retired when the change was made.\n\nKey Actions:\n**SB 308**: Extending a recent increase in retirement benefits for current members of the Georgia General Assembly to those who had already retired.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\nThe committee chair presented the bill on behalf of the absent sponsor, Senator Harbin. A committee member expressed support for extending the retirement benefit increase to retirees, stating they are \"very deserving of this retirement.\"\n\nVotes:\nThe committee voted to pass SB 308 on to the actuary for further review.\n\nAttendance:\nA quorum was present, and the session was able to conduct business.\n\nAdjournment:\nThe committee adjourned after addressing the single item on the agenda.",
  "transcript": "You\nYou\nYes, sir.\nYes sir, y'all stay with me please.\nDear Heavenly Father, we thank you for the day, Lord.\nWe thank you for loving us.\nWe thank you for the gift of salvation, Lord.\nAnd we thank you to be allowed to do the work of the people.\nAs we go about this meeting, Lord, we just ask that you be with us.\nWe ask, Lord, that you give us wisdom and discernment.\nand we pray. Amen.\nThank you, sir.\nOnly have one bill on our agenda today.\nAnd this was from Senator Harbin.\nHe couldn't be here this morning,\nso I'm just going to present the bill from here for him,\nbecause this is hearing only,\nbecause it's going to require an actuary.\nThis is Senate Bill 308, LC 43 2708.\nLast year, the General Assembly approved an increase from $20 to $50 a month in retirement\nbenefits for current members of the General Assembly upon their retirement.\nSenate Bill 308 extends this increase for those members who had already retired when\nthe change went into effect. If a member served one year, they would receive $600 a year\nin retirement benefits. If a member served 10 years, they would receive $6,000 a year\nin benefits. Any questions, any comments on the bill? Anybody want to talk about any\nyou all from out there. Yes ma'am. Thank you very much Mr. Chairman. Well we look at this\nand I think the bill that passed last year at the last minute the retirees were deleted\nbut I think they are very deserving of this retirement. Yes ma'am. Thank you. Anybody have\ncomments or questions? Seeing none, we'll move this bill for actuary. We don't need\na vote on it, I don't think. And do we? We do need a vote to move it on.\nI move that we pass this on to actuary.\nthank you so we have a motion second thank you in a discussion hearing none all\nin favor say aye any opposed so carry any other business to come before this\nCommittee.\nEric Nam will stand adjourned.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:17:11.163477+00:00"
}