{
  "video_id": "4Zxqh2LjHns",
  "url": "https://youtu.be/4Zxqh2LjHns",
  "title": "Georgia House - Day 22 (2026-03-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-03-02",
  "duration_minutes": 79,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 22 (2026-03-02) session:\n\n**Overview**\nThe session included discussions about several members dealing with personal and health issues, as well as the acknowledgement of the start of the qualifying period for the upcoming election.\n\n**Key Actions**\nNo major bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- The House opened with a prayer led by Pastor Mark Ikin, who acknowledged the challenges faced by many representatives due to being away from their families and dealing with personal matters while serving.\n- The Speaker noted several House members were dealing with family health issues, including Chairman Ron Stevens, Chairman Bonnie Rich, and Representative Mandy Balinger.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe House held a morning roll call to establish a quorum.\n\n**Adjournment**\nThe session details do not indicate a specific time of adjournment. The next session date was not provided.",
  "transcript": "You\nYou\nYou\nYou\nThey are of convening having arrived, all members will please report to the floor of the\nhouse and take seats. All members will report to the floor of the house and take\nyour seats. The clerk will ring the bell.\nAll members will report to the floor of the house.\nWe are going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber.\nand the clerk will unlock the machines.\nhave all members voted, have all members voted. If so, the clerk will lock the machines.\nkeepers will please close the doors and keep them closed.\nWell good morning.\nIt seemed like too many mornings this session I've had to bring to our attention members\nof our family that are going through problems and the same is certainly true this morning.\nWhen we go to prayer this morning, I'm going to ask you to remember Chairman Ron Stevens.\nWe just got word, I knew that he had put his father in hospice over the weekend, less\nthan a month after he lost his mother, and we just got word that he's on his way to\nto visit with him. He literally has very, very little time.\nChairman Bonnie Rich is still in the hospital, but we're hopeful that she will be discharged\ntoday.\nMandy Balinger. What a fighter. She is in the hospital. She had surgery Thursday and is\nhaving another round of surgery today. I talked with her late yesterday afternoon and her\nspirits are good. She already has a timetable laid out for when she gets out of the hospital\nand comes back to work, but she's got some challenges, but we are happy to have Chairman\nLynn Smith back this morning, Lynn, it's good to have you back.\nWe will begin our day with scripture reading and prayer by the chaplain after which we\nwill pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 104th House District\nChairman Chuck Eftration, Chairman Eftration.\nThank you, Mr. Speaker.\nGood morning, ladies and gentlemen of the House.\nIt's an honor today to introduce to you Pastor Mark Ikin of the Hamilton Mill campus of\n12 Stone Church.\nPastor Ikin has been in local church ministry for over 30 years.\nFor the past 17 years, he served as campus pastor at 12 Stone Church.\n12 Stone is a church of eight campuses that reaches over 25,000 people in Greater Gwyneth\nCounty.\nThis has been, he has been married to his wife Tina for 26 years, Tina has spent her life\nas an educator and is currently teaching in the Gwinnett County public school system.\nTina is here with us today. Would you please rise so that we can thank you for being here?\nMark and Tina have three children. Their oldest Carly is a recent graduate from Georgia State\nUniversity and is a Gwinnett County public school teacher.\nKyla is a current sophomore at Georgia Gwinnett College, and Marcus is a freshman at the University\nof North Georgia.\nIt's a great honor to have Pastor Ikin here with us today, Pastor.\nWell, good morning, Mr. Speaker, Representative Eftration, thank you for the invitation to\nbe here today. You know, you stand in a room like this and you get a sense of awe of\nthe history and the work that's been accomplished here. I know for many of you, this is just\nan ordinary day at the office, but for a regular citizen like me, it's certainly an honor.\nAnd I know it's not only a big day for me, but I understand for many of you that it's\na pretty big day too. It's qualifying day. And some of you have announced that you're\nnot qualify and that you're going to end your time of service.\nIn others of you have probably already refreshed the qualifying website three times in the\nmoments that I've been up here trying to find out who's running against you.\nBut I know that in addition to the agenda that is before you, they're in the pressure\nand the excitement of qualifying day, there's much that occupies your mind and your heart.\nI also know that this is month three of session and for some of you, this is a little bit\nlike being deployed. You come from districts, maybe where you're unable to travel home\noften and you're away from your family. And that occupies real estate and your mind\nand in your heart. I remember a number of years ago I was traveling to Sri Lanka. It was\nshortly after this tsunami had caused massive destruction and our church had been sending\nteams to help rebuild the communities. And I'd be gone for about 10 days, which is not\nvery long considering what you guys might be going through, but it was long enough to make\nme a little bit melancholy about being away from my wife and children.\nAnd I remember sitting in the plane on the tarmac looking out the window and it was a rainy\nday and that just kind of added to the mood.\nBut I remember praying a simple prayer, God would you watch over my family while I'm gone.\nSeems like a good thing to pray and I'm sure that some of you have said that prayer\nwhile you're here.\nAnd I felt like God responded with a gentle but clear voice of truth.\nAnd he said, Mark, like, I'm not the one who watches over your family when you are home.\nI said, you're right, God, thank you.\nThe same God who watches over my family when I'm home is the God who watches over my family\nwhen I'm away.\nYou see, no matter what part of the state you come from, no matter what party you represent,\nWe all have a life that's outside of this chamber.\nWe have spouses, families, parents, children, relationships, business responsibilities,\nand many of these things weigh heavy on you while you're here doing the work of serving.\nI was asking a friend who's also qualifying today, I said, how can I best serve in my time\nhere today?\nHe said, Mark, they're just regular people dealing with real issues like everyone else.\nMr. Speaker, you mentioned a few of those this morning.\nSo maybe the best thing that I can do is pray for you.\nThe truth is some of you have loved ones\nthat are dealing with health issues.\nMaybe a cancer diagnosis and you're here and they're there,\nbut your heart is with them.\nSome of you are missing ball games\nor missing recitals or important events\nin your kids' lives.\nSome of you have missed out on the birth of a child\nwhile you're here.\nSome of you are facing financial pressures outside of this room\nare overwhelming. Some of you are struggling in relationships or marriage and you can't solve\nthose while you're here. Some of you are trying to solve complex problems from a distance. And I\nthink how I can serve you, how can I serve the people who serve us, and probably the best thing\nthat I can do is point you to the one who can. There's a scripture that I've been sitting in for a\na while, it's from the book of Psalms, Psalm 33 says this,\nno king is saved by the size of his army,\nno warrior escapes by his great strength,\na horse is a vain hope for deliverance,\nand despite all its strength, it cannot save.\nBut the eyes of the Lord are on those who fear him,\non those who put their hope in his unfailing love.\nAnd just like I realized that I'm not the one\nwho is all powerful, God is all powerful.\nIt's not my strength, my wisdom, my resources,\nmy army, but Scripture says,\nGod is with those who fear Him, who put Him first.\nAnd when you do that, He steps in,\nand that's a much better place\nthan having it all rely on you.\nSo I want to pray for you.\nI want to pray that you would seek God's protection\nmore than your own.\nI want to pray that you would discern God's purposes\nmore than your own,\nand I want you to know that God's power\nis greater than your own.\nSo I'm gonna ask if you would rise and pray with me.\nGod our Father in heaven.\nThank you for our nation,\nfor this great state of Georgia which we get to serve.\nWe humble ourselves before you\nbecause we're capable of being proud towards you.\nSometimes our success blinds us.\nAnd sometimes we think it's all on us\nwhen really you're the one that's in charge.\nSo God forgive us, for you give grace to the humble\nbut you oppose the proud.\nWe all stand in need of your favor in our lives.\nAnd I pray over our families and our loved ones.\nAnd right now each of us has in mind\nGod, those we love,\nwould your presence be with them?\nWould you protect and provide for them?\nWell, we are here the same as you do when we are home.\nFor those who are dealing with illnesses,\nI pray that you would provide healing.\nGod, the struggles we face in life are not unseen to you.\nAnd as we gather this day,\nWe ask that you would do miracles.\nWe pray for those who have little ones at home\nwho are missing their mom or dad.\nAnd I pray that they would know how much\ntheir earthly parents love them and long to be with them.\nI pray for those who are dealing with financial pressures.\nGod that you would be their provider.\nAnd I pray for each person in this chamber\nas they do the work of the state.\nGod, we seek your favor in 2020.\nI'm grateful for a state government\nthat's committed to making difficult decisions head on\nand seeking your will.\nAnd, Father, you know the issues that are before us, the full agenda that needs to be accomplished,\nthe complexities of finances and people and parties, God would you grant us breakthroughs\nin unity to accomplish greater things for our state, both in our metro and rural areas.\nGod give us wisdom to lead state business, courage to walk with character and endurance\nto keep your word.\nAnd may your favor rest upon this house and those who serve on behalf of the citizens\nof Georgia and Jesus' name we pray. Amen.\nI pledge allegiance to the flag of the United States of America and to the republic for which\nstands one nation under God, indivisible, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits read the proceedings of the previous legislative\nday and found them to be correct.\nChairman Hogan, the Chair of the Committee on Information and Audits reports that the\nThe Journal of the Previous Legislative Day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns on the 59th was following me establishes the order of business during the first part\nof unanimous consent, introduction of bills and resolutions, first reading and reference\nHouse bills and resolutions, second reading of bills and resolutions, report of standing\ncommittees, first reading in reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is none in the resolution is adopted.\nYou\nYou\n1st reading of Bills and Resolutions, the Clark or Reed House Bill 1069 by\nRuss and a Polkum of the 81st Buckner, 137th Williams, 145th McLean, 51st\nParis, 142nd and others, Bill Beton on act to a menchample 3, total 17, the\nfish go to George Anitetti, relating the limitations on prosecution. Judiciary\nnon-civil House Bill 1070 by reps of gains, $117, $45, you leave the\n136 in wheat hour and 119th.\nIt'll be titled an act to amend Article 3,\nChapter 3, Title 44.\nThe official go to Georgia,\nannotating relating to condominiums.\nInsurance.\nHousemael 1071 by resident of Gallaudet\nof the 19th mountain of the 17th.\nMark of the 49.\nSkoggins of the $14, the 45th and others.\nIt'll be titled an act to amend Code Section 465, 27.\nRelating the telephone solicitations\nto residential, mobile or wireless subscribers.\nEnergy, utilities, and telecommunications.\nHospital 1072, Barbara.\nSo I've scoffed you to the 60th and Drenner to the 85th.\nBill Bitton and act to amend chapter 15 to title 25\nof the Fish Buddha, Georgia, and attended\nrelating to other safety inspections and regulations.\nPublic safety and homeland security.\nHospital 1073, Barbara.\nSo I have Watson, the 173rd Jasperist,\nthe 11th Corb of the 174th in England of the 116th.\nBill Bitton and act to amend chapter 62,\nTitle 36, the fiscal to Georgia annotated, relating to development authorities.\nGovernmental affairs.\nHospital 1074 by reps and administration in the 104th tubnic of the 29th.\nSustcer of the 35th.\nIt'll be a ton of an act to amend Article 1 of Chapter 2, Title 49, the fiscal to Georgia\nannotated, relating the general provisions regarding the Department of Human Services.\nJuvenile justice.\nHospital 1075, I'm Representative Holland of the 54th\nGardner of the 57th, Dryer of the 59th, Jackson of the 64th\nand Evans of the 83rd and others,\nBill Bitton-Nack to amend and act to continue the existence\nof the Atlanta Independent School System.\nThe Intergovernmental Coordination.\nHospital 1076 by Representative Holcomb\nof the 81st Hitchens, the 61st,\nFrazier of the 126th, Stepstration of the Auditor\nof the 4th Tramble of the 32nd and others,\nBill Bitton, an act to amend chapter 24, title 15,\nthe fiscal to Georgia annotated,\nrelating the sexual assault protocols.\nJudiciary non-civil.\nHouse Bill 1077, my roughs and of Kirby,\nthe 114 tram, the 130 second,\nwelts to the 110th, work highs to the 157th,\nMcLean to the 100th, and others.\nBill Bitton, an act to amend, code section 50, 132,\nwith the fiscal to Georgia annotated,\nrelating the definitions for the Georgia Administrative\nProcedures Act.\nIndustry and labor.\nHouse Bill 1078, my roughs and of welts\nthe 110th, Holly, the 111th, Douglas,\nthe 78th, Rutledge, the 109th,\nand Matthew Hack, the 73rd.\nBill Nitton, an act to the men.\nChapter one in title 15,\nthe fish go to Georgia,\nannotated relating the general provisions\nregarding courts.\nJudiciary.\nCost Bill 1079,\nI'm not sure if I've scrolled field,\nthe 60th, Gardner, the 57th.\nAllen, the 40th, Buckner, the 137th,\nAlex, Andrew, the 66th, and others.\nBill Nitton, an act to men,\nArticle seven, chapter four,\nTitle 49, in Title 33, the fish go to Jordan,\nAnnotated, relating to medical assistance and insurance.\nSpecial committee on access to quality health care.\nHospital 1080, by reps on a base,\nmore of the 63rd, Smileyery, 135th,\nBeverly, the 143rd, Tramlow, 32nd,\nVoting of the 62nd.\nThere'll be Todd and Actamen Code Section 42, 86,\nof the fish go to George Annotated,\nrelating the special license, motor vehicles.\nHouse Bill 1081 by Representative Rose,\nthe 120th part of the 103rd.\nBurns, the 159th, and Corbett of the 174th.\nBill Netano, an act of men, Code Section 12, 839.\nThe fish go to Georgia, annotated,\nrelating to waste management.\nNatural resources and environment.\nHouse Bill 1082 by Russ and Apollo,\nthe 32nd, Ridley, the 6th, and Corbett of the 174th.\nBill Netano, an act of men, Article 1A of chapter 11,\na title 40, the fish go to Georgia,\nannotated, relating to abandoned motor vehicles.\nmotor vehicles hospital 1083 my reps up Petri the 166 Williamson of 115th\nerror hard of the 36th Jones the 91st May the act the 73rd and others\nwill be taught an act to amend title 17 the Bishop of Georgia and\nattended relating to criminal procedure judiciary non-civil house resolution\n1325 I resident Bentley the 139th resolution honoring the life of\nof memory of Miss Asia Charles Daniels Jr.,\nand dedicating interchange in his memory.\nTransportation House Resolution 1326,\nby represent of Gardner, the 57th dryer,\nthe 59th Thomas, the 56th,\na resolution honoring the life of Dr. Vivian Harman,\nand dedicating a road in her memory.\nTransportation House Resolution 1327,\nby represent of Cecil or the 35th,\nyou believe the 136th,\ninstallation of the 104th and Reeves of the 34th,\na resolution creating the House Study Committee on Claims,\nunwrongfully convicted persons.\nAppropriations.\nHouse Resolution 1328 by resident of Gilear\nto the 160 second.\nThe resolution of recognizing the kick lighter family\nand dedicating a bridge in their honor.\nYes.\nTransportation.\nSenate Bill 362 by Senators Wilkinson of the 50th Anderson of the 24th Harper, the 7th\nBurke of the 11th and Raman of the 5th.\nThe building title back to a man chapter 3, a title 4 of the fish go to Jordan Ancetti\nrelating to livestock.\nAgriculture and consumer affairs.\nSenate Bill 371 by Senator Gooch of the 51st Beach, the 21st Jones of the 25th Butler\nof the 55th Harper, the 7th and others.\nWilmington an act to men article three at chapter two in title 32 the fish go to Georgia and it's a two relating officers in the Department of Transportation\nTransportation Senate bill 450 by senator Harper the seventh of Wilmington an act to men the act to reconstitute the O'Silla Irwin County Industrial Development Authority\nThe answer governmental coordination Senate resolution\n690 by senator ligand of the third hill of the fourth once in the first Jackson second and Harper to the fourth\nResolution encouraging the\nGeorgia Outdoor Stewardship Trust Fund.\nNatural Resources and Environment.\nThat completes First Readers.\nSecond Reading of Bills and Resolutions, the Clerk will read.\nHouse Bill 1055 by Representative Jasper's of the 11th Carpenter of the 4th\nand Target of the 2nd,\nthe Bill will lead to other educational programs under the Quality Basic Education Act.\nHouse Bill 1056 by Roosevelt Herald, the 106,\nA bill relating to sales and use taxes, House Bill 1057 by Representative Rhodes of the 120th,\nFleming of the 121st, Irwin of the 28th, Friday of the 118th.\nA bill relating to soil amendments, House Bill 1058 by Representative Selcox of the 52nd,\nand Willensky of the 79th.\nA bill relating to General Authority, duties, and procedures.\nHouse Bill 1059 by Representative Ayerhard of the 36th, tankers leave the 160th,\nSelcox of the 52nd, Taylor of the 173rd, Mathiac of the 73rd.\nA bill relating to the Georgia Special Needs Scholarship Act.\nHouse Bill 1060 by remiss of Airheart of the 36th, Stevens of the 164th, Chaspers of the 11th, Newton of the 123rd, Petrie of the 166th, and others, Bill relating to health, House Bill 1061 by remiss of Williamson of the 115th, the Bill relating to the State Administrative Organization, House Bill 1062 by remiss of the 178th, Hogan of the 179th, Sains of the 180th, Burns of the 159th, Corp of the 174th, the Bill relating to General Provisions, relative to Solid Waste Management, House Bill 1063 by remiss of the Park of the 101st, Clark of the 108th, more of the 95th, McLaren of the\n51st, Kenner to the 102nd and others.\nAbel relating to medical assistance.\nHouse Bill 1064, by Representative Jackson of the 64th,\nBayesmore of the 63rd, Scoffield of the 60th,\nKendrick of the 93rd, Bernal of the 77th and others.\nAbel relating to crimes and offenses, education and health.\nHouse Bill 1065, by Representative Smith of the 41st.\nWilkinson of the 38th, Lopez Romero of the 99th.\nWe'll be showing the 48th and win of the 89th.\nAbel relating to annual performance evaluation.\nHouse Bill 1066, by Representative Parsons of the 44th,\nand welcome to the 81st, a bill relating to imposition rate computation and exemptions from state income taxes, House Bill 1067, by reference to the Parsons of the 44th, welcome to the 81st and Jones of the 25th, a bill relating to imposition rate computation and exemptions from state income taxes, House Bill 1068, by reference to the registration of 104th, the bill relating to general provisions regarding parent and child relationship, House Resolution 1300, by reference to a park of the 150th, done who the 30th, or a Kaiser of the 150th and Jones of the 167th,\na resolution authorizing the change of use of certain property.\nHouse Resolution 1301 by Rep. Smirie, the 135th,\nBuckner of the 137th,\nthe 136th, the 134th, Smith of the 133rd.\nA resolution urging the Georgia General Assembly\nin the United States Corps of Engineers\nto perform additional environmental studies\nand evaluate the river banks of the Chattahoochee River\nabove Columbus, Georgia.\nHouse Resolution 1302 by Rep. Dempsey of the 13th,\nJones of the 53rd, Cooper of the 43rd, England of the 116th,\nNewton of the 123rd.\nResolution creating the Joint Study Committee on Chronic Weight Management and Type 2 Diabetes.\nHouse Resolution 1303 by Ronson Carson of the 46 and Harold 106 Resolution creating the House Study Committee on the Collection of Public Utility Edvilarm Taxes.\nHouse Resolution 1304 by Ronson Knight of the 130th Resolution proposing a members of the Constitution so it's to provide that the qualified affordable building projects may be classified as a separate class of property for\nEdvilarm property tax purposes and different rates methods and assessment dates may be provided for such building projects.\nSenate Bill 316 by Senator Thompson of the 14th, Miller of the 49th Albers of the 56th mollus of the 53rd Kirkpatrick of the 32nd and others of Bill Related to Professions of Businesses, Senate Bill 320 by Senator Payne of the 54th mollus of the 53rd, Logan Jr., the 3rd Robertson of the 29th, Cousin of the 46th and others, Bill Related to Sexual Offender Registration Review Board, Senate Bill 377, by Senator Jones of the 25th, Burke of the 11th mollus of the 53rd Robertson of the 29th, the Kirkpatrick of the 32nd, Bill Related to Inspections, 3 Second Readers.\nYou\nYou\nYou\nReports of Standing Committees, the clerk will read.\nRepresentative Sharon Cooper to the 43rd District Chairman of the Committee on Health and Human Services submitted the following report.\nMr. Speaker, Committee on Health and Human Services has had a consideration following bills of the House and Senate.\nSenate, and as instructed me to report the same back to the House, the following recommendations,\nHouse Bill 791, do pass by committee substitute, House Bill 1054, do pass by committee substitute.\nSenate Bill 345, do pass, respectfully submitted.\nRepresentative Sharon Cooper, the 43rd District, chairman.\nThat completes the reading of the reports of standing committees.\nYou\nYou\nYou\nmembers of the house will please take your seats all members will take your seats.\nWe, as you know, we have a lot of visitors here today, who are not visitors, but Georgians\nthat are signing up to run for office, and so the chair, due to our schedule, has decided\nto, well, they're going to recognize one, and that's our senior member in Washington.\nSo I'm applying the other no to both parties and all others, but we are very honored to\nhave with us our senior United States Senator David Perdue.\nSenator Perdue has been a great champion for agriculture, the military presence here\nin the state cutting regulations, helping being a partner with us and growing jobs here\nhere in Georgia, so we're delighted to have him with us and please make welcome Senator\nDavid Perdue.\nThank you.\nIt's a real honor to be here.\nI want to thank you for what you guys do for our state and our country.\nThis is really where it's at.\nI brag on you all the time in Washington.\nI tell them state government is where government works.\nYou guys work here.\nYou don't go home until you get the budget done, and I so respect that.\nBut Democrats and Republicans right here in this body will fight with each other and finally\nget to something called compromise so we can go home, you go home, and you live under\nthe laws that you write.\nAnd I think people in Washington could learn a lot from what we do here in Georgia right\nhere in this body and across the hall over there in the Senate.\nAnd I want to thank you for that.\nThird thing I want to just mention real quick is I want to thank you for your participation,\nyour partnership in dealing with a couple of big items.\nOne is this disaster relief that we just saw a couple years ago.\nYou guys were the first.\nThe state money was the first money that got to our farmers and people down there who\nwere really hurt by that devastating hurricane.\nThe second thing is this port that we've been working on for 20 years in the state of Georgia\nto get port of the Savannah deep in just five feet.\nThanks to you and now thanks to President Trump, we now have the full funding to get that\ndone.\nBut remember, over the last 15 years, the first funding, the first dollars that went into\nthat port came right here from this body.\nAnd I want to thank you for that partnership.\nGod bless you for what you do of our state and our country.\nGod bless you.\nThank you very much, Mr. Speaker.\nThank you.\nThank you.\nOkay, we're now going on to morning orders. Morning orders. Chair, the house will\nremain at order. Chair recognizes for a morning order. The Chair of the\nNatural Resources and Environment Committee Chairman Lynn Smith.\nThank you, Mr. Speaker, and good morning, everyone.\nI will begin by saying thank you for so many things, but I don't know how to express to\nyou what it's like to be a recipient of the body when we're not divided along party\nlines when we're united for the need of one of our members when the people in our hallway,\nwhen the speaker, our leadership, agencies all come together, it is so overwhelming and\nAnd so supportive and strong.\nAnd I had, I love geometry in high school and I liked it so much because of all these\ntheorems and if you would just learn the theorem you stood a good chance of solving that problem.\nAnd that day when I saw everyone there I kept thinking, oh, it really works not just on\na math page, and there is a statement, a theorem that says the whole is greater than the sum\nof all of its parts.\nYou are my whole, thank you.\nThe chair recognizes the remainder of the morning orders will be limited to one minute each and the chair recognizes representative J Collins for a morning order.\nThank you, Mr. Speaker, members of the House. If you would, please turn your attention to this good group of folks I got from Villarica High School. If you'll stand up, please in the gallery.\nWe've got some good folks from Bill or Casco here.\nLet's welcome to the People's House.\nThank you.\nChair recognizes representative Stovall\nfor a morning order.\nThis. Thank you, Mr. Speaker. In members today, in honor of Black History Month and Women's\nMonth, I will recognize Virginia Walden Ford. She spurred her passion for educational\nopportunity as inspiring families, filmmakers, and lawmakers to make positive changes. Look\nat the 2019 movie, Miss Virginia, by Netflix, to get a glimpse of her struggle with DC schools.\nIn 2003, Mrs. Ford, along with thousands of courageous parents, convinced Congress and\nPresident Bush to enact the nation's first ever opportunity scholarship.\nProgram for low-income children stuck in dangerous and low-performing schools.\nThis program allows them to attend private schools by boosting federal funding for traditional\nschools and public schools.\nThank you, Mr. Speaker.\nChair recognizes the majority who have representative Kelly for a morning order.\nThank you, Mr. Speaker, members of the House.\nI know that we all take great honor when we have constituents who come visit us at the\nCapitol that we can recognize for their accomplishments.\nand I have one of those individuals here with me today.\nI have 10th grader, Caleb Chambers.\nHere with me, Caleb is an eagle scout.\nHe's just been promoted to that rank\nwithin the scouting system.\nHe's also an ordained minister and just so much\nin our community, and that's a testament\njust so the family that he's came from.\nAnd we're so glad to have Caleb and his dad,\nChessley, here with us.\nWe all stand up and let us recognize you in the house.\nChair recognizes representative Dunahoo for a morning order.\nThank you, Mr. Speaker, ladies and gentlemen of the House.\nI have two honored guests here today from you'll recognize Jackson Ho Wyoming, actually\nfrom Wilpson, Don and Beverly Landis.\nYou can stand up with, thank you for coming.\nrecognizes Representative Scofield for a morning order.\nRepresentative Scofield, Chair recognizes Representative Lopez Romero for a morning order.\nThank you, Mr. Speaker. Good morning, everyone. I wanted to take a minute today to commemorate\nyesterday as a bloody Sunday, and also talk about the opportunity that I had to be able\nto travel to Montgomery and Selma. To visit not just across the bridge, but also the\nthe Peace and Justice Memorial Center,\nwhich is a lynching memorial\nand wanted to be able to read out today\nthe two names, the three names in Winett County\nof individuals that were documented\nto have been lynched in our county.\nOn January 28th, 1882, Mr. Thomas Muffet.\nMs. Muffet, February 12th, 1882, Williams-Smell, April 8th, 1911, Charles Hill.\nThank you for it.\nLet's have a moment, please.\nThank you, Mr. Speaker.\nChair recognizes representative Henson for a morning order.\nOkay, Chair recognizes representative Bees more for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI rise to let you know that Georgia is one of the top three states with the highest maternal\nmortality rate, with black women being the most likely to die prior to and after child\nbirth.\nIn addition, there is a grave shortage of OB physicians practicing in Georgia.\nWith the death of a mother, the question becomes, if there's no spouse, what family member\nof will assume responsibilities of that child\nand possibly other children.\nHow will this affect one's employment?\nAre grandparents expected to step up?\nI would without hesitation, but I am able to do so\nunlike most grandparents.\nMy daughter had complications during both of her pregnancies\nfour year old and two year old.\nUnlike these women, women she had access\nto excellent healthcare because of the insurance she has.\nLet's expand Medicaid so this story will be the norm\nand not the exception.\nThank you, Mrs. Speaker.\nThank you.\nWe are now going on to recognize some very special\nand distinguished Georgians that are with us today.\nThe clerk will read the caption to House Resolution 1315.\nHouse Resolution 1315 by Representative Rose, the 120th Rawls to the 7th, Kelly the 16th,\nhatched to the 150th, and Corbett of the 174th.\nA resolution recognizing and commending the 2019 Atlanta Braves and the teams award-winning\nplayers and manager and for other purposes.\nChair recognizes Chairman Trey Rhodes for an invite resolution.\nThank you, Mr. Speaker.\nGood morning.\nIt's a great honor for me to stand here today and talk a little bit about and talk about\nthe accomplishments that that our Atlanta Braves had last year.\nYou know, some people call them America's team,\nbut they're our team, they're our Atlanta Braves.\nWith us today from the organization,\nwe have Derek Schiller, president and CEO,\nMike Plant, president and CEO\nof the Braves Development Company, Greg Heller,\nexecutive vice president and chief legal officer.\nAnd one of the voices of the Braves,\nnot only of Braves, but I also remember he's a falcon.\nSo we have Brian Jordan with us here today.\nI'm not going to read this resolution, but I just want to tell you a little bit about\nsome of the phenomenal things that we did last year.\nWe won our 19th Division title in franchise history, which really we're back to back in\nL. East Champions the last two years, and you know, last time we started springing together\na few old things, some good things happened, so we're looking forward to that as it comes\naround.\nWe had three all-star players, Ronald Okunye Jr., Mike Soroka, and Freddie Freeman.\nWe had three National League Silver sluggers, Ronald Okunye Jr., Ozzie Albis, and Freddie\nFreeman.\nWe had the 2019 National League Defensive Player of the Year, Freddie Freeman.\nThe 2019 National League comeback player, the year Josh Donaldson, and the 2019 National\nStolen Baselator, Ronald Okunye Jr.\nAnd we just want to say that hopefully the weather or break here shortly, we can start\ngetting outside and playing some baseball and we're looking forward to some exciting things.\nAnd I think Derek Schiller is going to give us a few words.\nThank you, Speaker.\nThank you, Trey.\nEverybody here, I want to thank you on behalf of our entire organization for supporting\nthe braze.\nObviously, we're a Lannis team, we're Georgia's team and everybody here who has done so\nmuch great work for the state of Georgia. One of the things you also do is really support\nour hometown team. We really appreciate it. You know, all of our players are down in\nspring training right now down in Sarasota, or else they would have all joined me in this\nappreciation. Trey, I want to thank you specifically for helping with the resolution for our achievements\nin 2019, but I think myself, my plant, Brian Jordan, Greg Heller, who are all here, quite\nAnd frankly, in 2020, we want you to be doing a resolution that is achieving and celebrating\nthe World Series.\nSo we're hopeful that we can do that.\nThank you for having us.\nYou\nYou\nYou\nClerk will read the caption to House Resolution 1323.\nHouse Resolution 1323 by a repson of Dickie the 140th Bentley, the 139th Mathis of the 140th.\nPerkle of the 150th and Williams of the 37th, a resolution recognizing commending with the\nGeorgia Peach Scholarship pageant and the 2019 Georgia Peach Queens and for\nother purposes. The chair recognizes Chairman Robert Dickey to recognize some\nvery special guests. Thank you Madam part in and members of the house welcome\nthis morning. It's an honor for me to be here today to introduce the 2019\nGeorgia Peach Queens, these young women represent areas from all over our state.\nThis past year they've represented the corner fruits and my favorite fruit throughout\nour great state.\nThe Georgia Peach Paget is not just a beauty pageant, it provides scholarships and gives the\nQueens the opportunity to compete in larger pageants.\nThese pageants give the girls the chance to win additional education scholarships.\nThese girls will give up their crowns in a couple of weeks.\nYou know, an event like this has not happened by itself.\nI'd like for the House members to give a warm welcome to the Miss Georgia Peach Pageant\nBoard Member Donald Long, who along with the parents are in their gallery.\nSo welcome them to Georgia House.\nNow I'd like to introduce them starting with the youngest queen.\nMiss Georgia Peach Abigail Brooke Goss from Cochran, Georgia. She attends\nblackly primary school and next we have a little Miss Georgia Peach, Bella Grace\nSanders, from my district in Forsyth Georgia and she attends Hubbard Elementary\nSchool and Junior Miss Peach, Mary Alice Statham from Tipton, Georgia and\nattend a tiffed area academy, and we have then teen mispeeds,\nSophie Edwards from Marietta, Georgia,\nand Tins Marietta, high school.\nAnd finally, Miss Georgia Peach,\nAshley Moore from Oglethorpe,\nand the Tins University of West Georgia.\nWe have a very special queen who was just crowned today.\n2020 petite peach queen Madeleine Monroe Sanders.\nMadeleine and her family have had several difficult weeks in the past month.\nShe was diagnosed with bilateral thoracic glioma, which is EGFR.\nShe is only one out of eight children known with this type of cancer.\nso proud of Madeline and her family for that faith and courage. I hope everyone here today would\nthank y'all. She's a real trooper.\nI hope everyone here today will join me in the continued to pray for Madeline\nor sister Bella Grace, a brother and a parent. She starts treatment tomorrow. Now I want to turn\nto telephone over to Ashley Moore, I miss Georgia Peach.\nTell me.\nGood morning.\nI would first like to say thank you so much for having us all here today.\nReceiving this resolution means the world to us.\nYou know, there are two commercial areas of peach production in the state of Georgia\nwith 83% of peach production occurring in the central region of Georgia\nand 17% in the southern region.\nBut all of us ladies come from all around the state of Georgia, and it has just been\nan absolute pleasure to serve this industry and I would just especially like to thank\nour directors, mom, stads, my sister Queens and representative Robert Dickie and his wife,\nMiss Cindy, along with the speaker for allowing us to receive this resolution and for everything\nthat they've done for us in this industry.\nYou\nClerk will read the caption to House Resolution.\n12-22. House resolution 12-22 by Representative Bernal,\nthe 77th, that's the 55th, Hobson to the 153rd, Jones to the 53rd, and Stevenson to the 90th.\nA resolution commending Delta Sigma Theta sorority incorporated for its 107 years of service\nand recognizing March 2nd, 2020 is Delta Day at the State Capitol and for other purposes.\nthe chair recognizes representative Rhonda Brnoe of the 77th to introduce a very special\ngroup of women.\nThank you, Speaker Pro Tem.\nToday is Delta Sigma Theta Sorority Incorporated Day at the Georgia Capitol.\nDelta Sigma Theta Sorority was founded on January 13th, 1913 by 22 young women studying at\nHoward University.\nthis time, would you please welcome our Sauras\nwho are in the gallery.\nThey can stand.\nAnd our southern regional director, Sandra K. Horton,\nwill bring remarks.\nThank you.\nGood morning.\nThank you, Speaker Protein, and all the representatives\nhere today.\nWe rise because we are strong women.\nWe are social activists.\nWe are 55 chapters strong in the state of Georgia\nwith over 8,000 members.\nAs we converge on Atlanta in 2021\nfor our national convention,\nwe will have over 25,000 members here\nto celebrate our sorority and the work\nthat we do in our communities.\nWe thank you for the work that you do\nas you do the business of the state.\nThank you very much.\nYou\nThe chair recognizes representative Oliver to introduce the doctor of the day.\nThank you Madam Speaker.\nWe are very pleased to have Dr. Stephen Holbrooke with us again today.\nHe comes every year to help us out.\nHe was head of emergency services at the Cabnam Emory Hospital for many years and now works\nboth at Georgia Tech, in-house student services and at our VA Hospital on Claremont Road.\nThank you, Dr. Holbrook for your service.\nThank you.\nThat's good to see you.\nThank you, Miss Oliver.\nIt is good to be back again this year.\nPlease do remember the emergency providers that you have, EMS first responders in the emergency\nroom.\nin your thoughts, keep safe, have a good day, thank you.\nYou\nYou\nYou\nThe clerk will read the caption to House Resolution 1195.\nHouse Resolution 1195, I'm Representative Henson of the 86,\nWalensky, the 79th Silcox of the 52nd,\nRobert Show of the 48th,\nCouch of the 50th and others.\nA resolution commanding the Atlanta Jewish Film Festival\nwhen recognizing its 20th anniversary and for other purposes.\nCheryl give their attention to Representative Michelle\nHinson of the 86 as she introduces a very special group\nof guests.\nThank you very much, Madam Speaker.\nToday I'm pleased to have folks with us\nfrom the Atlanta Jewish Film Festival.\nThis is now started back in 1990 or found in 2000, excuse me.\nAnd it has now become one of the largest film festivals\nin the world, Jewish film festivals.\nStarted with about 1,900 people attending.\nAnd we're now up to 15,000, went from two weeks to pretty\nmuch a year now.\nAnd the folks I have with me today\nI'd like to recognize and then let them say something.\nSario, who is the vice president, Kevin Blank,\nwho is the executive director, Max Rubenstein,\nand Brennan Dicca.\nLike you to hear from Sario.\nThe chair asks for your attention, please.\nThank you so much.\nThank you for having us and for hosting\nAtlanta Jewish Film Festival for the last 20 years. We started out small about a thousand\npeople. We're now at almost 40,000 people. We now have events and programs all year long.\nAnd the reason for our success is the uniqueness of being in Atlanta and in Georgia. We are\na mission driven nonprofit. We specifically try to raise the level of social and cultural\nunderstanding through the lens of film, our board is diverse, our committees are diverse,\nour films are diverse, and our audience is diverse.\nAnd the reason for our success is because we're here in Georgia with you.\nSo thank you, we are very appreciative, and we hope to go another 20 years.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe House will move on to the rules calendar.\nPlease take your conversations to the any room.\nThe clerk will read the caption to House Bill 900.\nIt's been 900 by a reps and a corber to the 174th and others to be tunneled and act to amend code section 40.\nTwo, 86, the fish go to Georgia, annotate it relating to special license plates.\nPromoting or supporting certain worthy agencies, funds or nonprofit corporations as bill ever.\nHaving been referred to the committee on motor vehicles, that committee recommends this bill do pass.\nChair recognizes Chairman Silcox to present the bill.\nThank you, Madam Protum.\nGood morning.\nThis morning I bring to you House Bill 900,\nwhich creates not a new tag,\nbut a new improved design for the breast cancer license plate tag.\nThis tag generates funds to provide breast cancer education,\nscreening and treatment to many underserved women in Georgia.\nIn fact, 83% of the proceeds from these funds\ngo to women who come from a racial ethnic minority\nand three out of every four counties in Georgia\nbenefit from some grant from these funds.\nSo please join me in supporting all breast cancer patients\nin Georgia with this new design, the very brand new\nPrescancer Tag for Georgia.\nThank you.\nThere are no questions and the lady has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none, the previous question is ordered.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nThe chair here is none and the report of the committee\nhas agreed to shall this bill now pass?\nAll in favor of the passage of the bill will vote yes.\nAll those opposed will vote no and the clerk will\nUnlock the machine.\nHave all members voted?\nhave all members voted if so the clerk will lock the machine for what\npurposed his representative Williams rise all imagery stature inquiry I think\nit kind of froze up on me therefore I mean in any way we can get about five minutes\nof heating here but wasn't a while\nChair will work on it.\nOn the passage of the bill, the yeas were 157, the nays were zero.\nThe bill having received the requisite constitutional majority is therefore passed.\nClerk will read the caption to House Resolution House Bill 1003.\nHouse Bill 1003.\nHouse Bill 1003 by Representative Burns, the Lord 59th and\nAll those to be entitled an act to amend Code Section 15662, the fiscal to Georgia annotated relating the number of judges and superior courts this bill have refer to the committee on judiciary.\nThat committee recommends that this bill do pass.\nChair recognizes majority leader Burns to present the bill.\nThank you Madam Chair. Good morning colleagues.\nThis morning I bring you H.B.1003.\nThis bill would add an additional superior court judge in the Giche superior court circuit,\nwhich is down in southeast Georgia, is comprised of Bullet County, F&M County, Jenkins County\nand Scrooven County, represented by Chairman Hitchens, Chairman Tancersley and Chairman\nParrish and myself.\nLittle background on the district, F&M County is one of the fastest growing counties in\nthis state has been for a number of years and a fast one of the fastest growing counties\nin the country.\nSo we have a tremendous growth in population there.\nBullock County, Staceburg, Georgia is also a very fast growing county as well and is\nmost of all of you know it's home to Georgia Southern University.\nNow, I know personally as many of you do about the judges in your circuits, I'm aware of\ntheir schedules, their hard workers, they do a great job in administering justice in\nAnd that circuit, and this is one more tool that would help them make sure that justice\nis taken care of in an approved manner.\nNow the administrative office of the courts has certified last year due to the circuit's\nworkload is qualified for one additional judge.\nThat circuit was named number one circuit in the state qualifying because of its workload.\nAll of the judges in the circuit, their workload has been certified as them doing one and a\nhalf times the workload of the judges and other circuits.\nThis is a bill that's been, we've not\nhave a new judge in that circuit since 1995.\nSo the time is of the essence that we help these gentlemen\nand those that would feel this are the judge's ship,\nwith us a lady or a gentleman, but it's time\nthat we address the issues and the workload of that.\nI would ask this body's favorable consideration\nof HB1003 creating an additional judge ship\nin the Gichi Circuit in Southeast Georgia.\nMadam Chair, if there are any questions,\nI'd be glad to try to answer them.\nThere are no questions.\nThank you.\nIt asks for your favourable consideration.\nYou'll be.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe Chair, here's none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report\nof the committee, which was favourable\nto the passage of the bill?\nThe Chair, here's none.\nThe report of the committee has agreed\nto shall this bill now pass.\nAll in favour of the passage of the bill will vote yes.\nAll those opposed will vote no.\nand the clerk will unlock the machine.\nHave all members voted?\nAll members voted.\nIf so, the clerk will lock the machine on the passage of the bill.\nThe yeas were 163, the nays were zero.\nThe bill having received the requisite constitutional majority is therefore passed.\nYou\n",
  "updated_at": "2026-02-12T14:28:28.318958+00:00"
}