{
  "video_id": "542UQz88d18",
  "url": "https://www.youtube.com/watch?v=542UQz88d18",
  "title": "Lawmakers Day 32 03/18/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 32,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Overview:\n- The Georgia General Assembly session on Day 32 (March 18, 2025) saw the introduction of several bills and resolutions, including some controversial measures.\n- The session featured debates over bills related to maternal mortality, tax relief for timber farmers, and expanding farmland ownership, as well as resolutions praising Republican politicians.\n\nKey Actions:\n- **HB 111**: Allows the Maternal Mortality Review Committee to access psychiatric and medical records related to maternal mortality cases, in an effort to lower the state's maternal mortality rate.\n- **HB 223**: Provides tax relief for timber farmers who suffered economic losses from Hurricane Helene.\n- **HB 90**: Allows farmers to own up to 4,000 acres of farmland and receive lower tax rates, pending voter approval to change the state constitution.\n- **SB 6**: Allows the sale of fentanyl test strips to the public and excludes them from drug paraphernalia classification.\n- **SB 55**: Requires companies to pay Georgians with intellectual disabilities at least the minimum wage, phasing out sub-minimum wage programs.\n\nBills Introduced (First Reading): None mentioned in the transcript.\n\nNotable Moments:\n- Governor Kemp appointed Barbara Rivera-Holmes as the new Commissioner of Labor, replacing the late Bruce Thompson.\n- The Senate debated and passed resolutions praising former Congressman and current VA Secretary Doug Collins, as well as President Donald Trump, despite some Democratic opposition.\n\nVotes:\n- **HR 32 and HB 90**: Passed unanimously\n- **SR 245 (Doug Collins)**: Passed\n- **SR 246 (Donald Trump)**: Passed along party lines 31-18\n\nAttendance: No quorum notes mentioned.\n\nAdjournment: The session adjourned, with the House and Senate scheduled to reconvene on Thursday.",
  "updated_at": "2026-02-12T01:31:06.597713+00:00"
}