{
  "video_id": "542UQz88d18",
  "url": "https://www.youtube.com/watch?v=542UQz88d18",
  "title": "Lawmakers Day 32 03/18/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 32,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Overview:\n- The Georgia General Assembly session on Day 32 (March 18, 2025) saw the introduction of several bills and resolutions, including some controversial measures.\n- The session featured debates over bills related to maternal mortality, tax relief for timber farmers, and expanding farmland ownership, as well as resolutions praising Republican politicians.\n\nKey Actions:\n- **HB 111**: Allows the Maternal Mortality Review Committee to access psychiatric and medical records related to maternal mortality cases, in an effort to lower the state's maternal mortality rate.\n- **HB 223**: Provides tax relief for timber farmers who suffered economic losses from Hurricane Helene.\n- **HB 90**: Allows farmers to own up to 4,000 acres of farmland and receive lower tax rates, pending voter approval to change the state constitution.\n- **SB 6**: Allows the sale of fentanyl test strips to the public and excludes them from drug paraphernalia classification.\n- **SB 55**: Requires companies to pay Georgians with intellectual disabilities at least the minimum wage, phasing out sub-minimum wage programs.\n\nBills Introduced (First Reading): None mentioned in the transcript.\n\nNotable Moments:\n- Governor Kemp appointed Barbara Rivera-Holmes as the new Commissioner of Labor, replacing the late Bruce Thompson.\n- The Senate debated and passed resolutions praising former Congressman and current VA Secretary Doug Collins, as well as President Donald Trump, despite some Democratic opposition.\n\nVotes:\n- **HR 32 and HB 90**: Passed unanimously\n- **SR 245 (Doug Collins)**: Passed\n- **SR 246 (Donald Trump)**: Passed along party lines 31-18\n\nAttendance: No quorum notes mentioned.\n\nAdjournment: The session adjourned, with the House and Senate scheduled to reconvene on Thursday.",
  "transcript": "I will advocate for good-paying jobs that tap into our state's talent, ensure safe\nworking conditions and protect secure benefits.\nI look forward to working with my colleagues, legislators, and communities to advance this\nmission, strengthening Georgia's position as the number one state for business and the\nbest place to live, work, and raise a family.\nGovernor Kemp introduced the state's new Commissioner of Labor today, Barbara Rivera-Holmes.\nHolmes takes over from Bruce Thompson, who passed away last November.\nGood evening and welcome to Lawmakers.\nI've done a Lowry in Atlanta.\nWe'll learn more about the new Labor Commissioner in a moment.\nThis day 32 of the Georgia General Assembly, the action during the 40-day legislative session\ndetermines what happens in your life for months and years to come.\nFrom your child's school to the roads and bridges you drive, to the safety of your home and\nthe type of healthcare you receive, decisions made at the Capitol, shape it all.\nMuch of it is determined by how billions of dollars are spent.\nmoney that comes into the state budget from taxes through your income, sales tax, gas\ntax, and the corporate world. It's why tonight we're going to focus on money, especially given\nthat passing a budget is the only thing the Georgia Constitution requires the General Assembly\nto do each year. To break down the details, the budget chairman from the House and Senate\njoin the show. But first, it's time for an overview of the day at the Capitol from Correspondent\nSarah Callis.\nHi, Donna. Today at the Capitol, Governor Camp announced the new Labor Commissioner\nand the Senate debated a controversial resolution.\nThe Senate passed three bills and four resolutions today. House Bill 89 would allow the Maternal\nMortality Review Committee to acquire psychiatric and medical records related to the Maternal\nmortality cases in the state.\nWhat this bill is is an effort to try to lower the rate at which people are passing\naway after they give birth.\nHB 223 would provide tax relief for timber farmers who suffered economic losses from\nHurricane Helene.\nThis bill will allow payments made to producers from USDA block grants and crop loss payments\nrelated to storm damage to be exempt from state income tax.\nbills were easily passed, House Resolution 32, and its enabling law, HB 90, would allow\nfarmers to double the amount of farmland that they can own and receive lower tax rates\non.\nThis legislation will allow farmers in one name to own up to 4,000 acres, just trying\nto look at our code up to date with the family farm, family farm to bring over the years.\nThe bill and resolution were easily passed, but now we'll have to be approved by voters\nto change the state's constitution regarding the increase.\nMore controversial were two Senate resolutions praising Republican politicians.\nSenate Resolution 245 recognized former Georgia U.S. Representative and current Secretary\nof Veterans Affairs, Doug Collins.\nCollins, it's the first Iraqi war veteran to serve as Secretary of the Veterans Affairs.\nHis vision for veterans' care is rooted in his life as a military veteran ensuring world\nclass care for our American heroes.\" While some Democrats supported the resolution,\nothers said that Collins complicity and reducing federal workers from the agency could not be overlooked.\nUnfortunately, Secretary Collins has decided that he is a card-carrying member of the Doge crew,\nthat he is on board with 80,000 cuts, at least 25% of the VA's workforce's veterans.\nSo, it's the jobs at the VA, but it's also the services\nthat veterans receive.\nThat resolution was passed.\nAnd a similar resolution, SR 246,\ncommending President Donald Trump was\ndebated for over an hour.\nIt is highly fitting that this resolution\nbe presented to you guys today.\nAnd I hope that this body will join me\nand commend these pro-American policies.\nand we come in, President Donald Trump, who has gained the confidence of millions and millions\nof American voters and workers. Democrats push back again, wondering why the need for a\ncommendation to a sitting president. The only time that a resolution like this was passed\nin 2017 when this body did the exact same thing when Trump was the first time.\nAnd when matched up against presidents in my lifetime, both\ndid him and Republican.\nI don't see the need for the work that is for him to have any type of\nacknowledgement or recognition.\nWe've actually fired him during his last presidency.\nThey also called the resolution political pandering.\nThe majority thinks that they have to continue been the need to\nto the president, in order to get favor or preserve funding in Georgia or get\nendorsement in next year's elections or whatever the motivation is. As\nexpected, the resolution passed along party line 31 to 18. Also today,\nGovernor Brian Kemp appointed Barbara Rivera Holmes as the state's new\ncommissioner of labor. Holmes replaces Bruce Thompson, who passed away last year\nfrom Pinkriotic Cancer.\nIn the House, members gave final approval to Senate Bill 55, which would require\ncompanies to pay Georgians with intellectual disabilities minimum wage. Under\ncurrent law they can be paid as little as 22 cents per hour. We have eight of\nthose programs out of 60 or so still functioning in the state of Georgia. This\nbill would do away with those programs and or have them adapt. They have two\nyears with federal assistance helping them go from what they're paying now which\nmost is about the lowest I think is $2 an hour and help them get up to the federal minimum\nwage of 750. That's what the program does. It's about dignity and fairness and making\nsure that people with disabilities are paid at least what we consider the bare minimum\nwage for all other workers. They also passed SB6, which would allow strips that test if\ndrugs have been contaminated with fentanyl or another substance to be sold to the public.\nwould also exclude those strips from the drug paraphernalia classification.\nAnything we can to print desks as long as somebody is alive, we have a chance of helping\nthem overcome an addiction.\nWhen they're dead, there is no hope.\nThe bill passed unanimously and now heads to Governor Kim's desk to be signed into\nlaw.\nTomorrow the committees will work to pass legislation.\nThe House and Senate will convene again on Thursday.\nThat's my Capitol report.\nDonna.\nThanks, Sarah. The rest of the show we're going to spend talking about Georgia budgets,\nwhat spending is taking place now, and what lawmakers are discussing for the fiscal year that\nbegins on July 1st. Georgia's budget is not just about numbers, it's about those dollars,\nwho how they will be spent, and how they will affect the everyday lives of 11 million\nGeorgia's. Joining the show is Senate Appropriations Chairman, Republican Senator,\nlike Tillerie of Vidalia. He's also Vice Chair of Government Oversight and State\nInstitutions and Properties. Both of those committees, he became Approach\nAppropriations Chair in 2020. Also with us is House Appropriations Chairman,\nRepublican Representative Matt Patchett of Dublin. He's been the Governor's floor leader,\nMajority caucus chairman and the majority caucus with I want to thank you both for coming on lawmakers for this annual budget show\nRight to be here. Yeah glad to be here. Well, let's let's get right to it chairman Tillery\nI have you do this every year. Can you explain the budget process starting with where it begins and while you're talking we have some of the information up on the screen\nWe start in the fall with the governor's office of planning a budget.\nWe begin working through numbers there.\nThe governor sends out a revenue estimate, but he sends out a planning target for the\nagencies.\nThey bring back those numbers and the governor's office uses that to prepare a budget that\nthey will present to legislators in January.\nAfter the governor makes his proposal, Hatchet gets it first and picks it up and runs there.\nthe house will pass their budget.\nSometimes by crossover day, we pick on them about that,\nbut the budget's not subject to crossover.\nAnd then the Senate will pick it up thereafter\nand then it goes to conference where we try to work\nwith each other and then of course with the governor's office\nto make decisions that hopefully are the best\nfor the 11 million Georgians you've already referenced.\nYeah, and so right now we're at the stage\nwhere it is with the Senate.\nSo I know you guys are working on it.\nI want to get back to the governor's revenue estimate\nand so for briefly talking about an idea\nwhere the money is coming from.\nSo here's a breakdown of the amended 2025 budget\nfrom the House Budget and Research Office.\nA good chunk comes from individual income taxes\naround 38% and then there's sales taxes at 22%\nmore than 8% from corporate taxes.\nThen as you can see on the screen,\nthe percentages for fees,\nOne designated surplus and motor vehicle or fuel taxes, and the amount from the lottery\ncomes in at about 3.9 percent.\nIn between, there's that other category, which is, I guess, everything else then.\nBut Chairman Hatchett, earlier in the month, the House passed HB 111 to reduce Georgia's\nincome tax rate from 5.39 percent to 5.19 percent retroactive to the beginning of the current\ntax year. So explain what that all means for tax payers.\nSo that's it's a two tenths of a percent cut and that equates to around somewhere that\nI don't know that the actual number is somewhere between eight hundred and nine million dollars\nthat will stay in your pockets. It will not be submitted to the state government for us\nto spend so that's that's how that will work and I think it will probably go to the governor's\ndesk and get signed. Okay then well Sherman Tillery back to you each year the general assembly\ndeals with the two budgets I mentioned earlier they amended budget to add money to the current\nspending plan and the one for the upcoming fiscal year and Governor Brian Kim just signed that\nthat amended budget that'll go through June 30th,\nit's about $40.5 billion.\nOne of the things it offers is Hurricane Helene Relief,\nand I know that for you personally,\nand your community, because of the storm,\nit hit hard there.\nThis is important, so we're going to show\nsome pictures you sent and then talk a little bit\nabout what the Hurricane Helene Relief\nand the amended budget is all about.\nIt's been a long time since we've had a lot of\nthings that we've been trying to do.\nRight, I hit Chairman Hatchett's district\npretty hard as well of anywhere that existed in\nGeorgia between about Val Dosta and Augusta\nfelt the the wrath of that storm.\nWe obviously are thoughts and prayers go out\nto our friends in Pauline County who had\nsimilar storms this weekend.\nThe package for relief includes a variety of\nmeasures aimed at first of all just getting\nhouses, roofing materials, I mean gas stations that blew over and then of course\ntimber. The timber in my area, Chairman Hatchett's area, Senator Russ\nGoodman's area, Senator Max Burns's area, Billy Hickman, it is still\nleaning and that's a concern because we know if the the lean of those trees is\nover a certain percentage, I think it's 35% than the trees are gonna be dead, 80%\nof the time those trees are gonna be dead within 12 months. So we have more to\nto clean up. Just my little county of tombs county is one of the smaller geographic counties.\nThe bill for picking up on the state and local rideaways already has a clip $65 million.\nSo multiply that out across the other counties that were impacted, roughly 100 counties.\nYou see how that cost is going to be significant and severe.\nAlso in my area in Chairman Hatchett's area, you had a lot of folks who had there, we'll call them\ntimber 401ks. They had their retirement tied up in timber. That timber is gone. And timber\nis a little different than crops, of course. You can till under crops and plant them the next\nyear. It's not easy. I don't want to diminish the loss to someone who just lost crops.\nBut if you lost timber, that's a 20-year investment, not just a one-year investment.\nSo the time to recover is going to be significant. And so the funds that went in this year's\nbudget, it started out with a governor's plan of around 615 million. Those monies went to about\n200 million to DOT to just replace street signs and stoplights that had\nblown over that many of them. You had a hundred million dollars that also went\nin for the governor's suspension of the motor fuel tax during that time\nperiod. We needed to backfill that revenue. And then so that's 300 million\nout the door. You had 200 extra million that was put into the LARP program.\nLocal road assistance projects. Again, remember how much infrastructure was\ndestroyed during this time. About 25 is million to the end the Senate put\ntowards folks who were not timber people or local governments necessarily, and the house\nwas very kind to come along and say that that was a very good ad and to jump on that with\nus.\nThose folks are still having blue tarps on their roof even this past weekend, so a lot\nof repair to be done, even though we now sit roughly six months away from the storm.\nA whole lot to do and really thankful for our colleagues for jumping in and trying\nto help.\nI know a lot of people across Georgia are just grateful for this money that is coming in.\nChairman Hatch, dealing with the amended budget still, a billion dollars for another\nround of state income tax rebates for Georgia. Let's talk about that.\nYeah, the rebate is $500 for an individual. No, married couple, $250 for an individual.\nIt's what we've done in the past. So keep an eye out in your bank accounts.\nand sometimes people get checks and it's a rebate,\nit's a refund, so you have to have paid that much\nto get it back.\nWe get a lot of calls, I didn't get my check and all that.\nDon, if I could, I'd like to touch on the hurricane\nrelief a little bit, if that's okay.\nGo ahead.\nNo, it was $850 million worth of relief\nthat we put out there and $150 million\nin loans to farmers, $135 million to assist with timber.\nBut I can't stress enough for those not living in the area.\nIf you have not gone to see how much that hurricane changed\nGeorgia, you hear the term generational change.\nAnd it is.\nI mean, it, like Chairman Tilbury said,\nthe people whose retirement was in trees is now gone.\nand just the employees in the industries,\nthe loggers, the truckers,\nall the people that were needed to support that industry\nthat now are wondering what they're gonna do.\nSo it's had a huge impact on our state\nand on our part of the state.\nThere'll be something we'll be talking about\nfor years and years to come.\nSo I appreciate what you guys have done.\nBut we're just getting started\nbecause we're going to continue with our special budget show.\nWell, I just want to say, just for everyone's information,\nthis is House Bill 68, not Senate Bill 68.\nThere's a big difference.\nSo we'll find out what that means,\nand we'll dig into the budget for the next fiscal year\nWhen we return, you're watching Low Makers on GPB.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capital during the session and year round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen, I don't fear anyone.\nThis was a woman, people wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it by acknowledging our own worth.\nHelp please.\nDon't continue.\nCome on.\nUnderstanding the past gives a sense of the future.\nThis is the first time that anyone has seen this in 2000 years.\nOh, oh.\nOh, it's not the biggest happening.\nSo, hurry up, we're devil nudes.\nOkay.\nThis is amazing.\nNo, I'm excited now.\nPompeii is a battle against time\nYou think I'm joking, but look at this it really happened\nDon't let anybody tell you who you are\nHistory teaches us to honor the past\nWhen you look back they're like wow, that was pretty special\nThis is something that's actually altering the course of history\nYou're charged with keeping these stories alive.\n-♪ I don't know where to get you.\nWelcome back, lawmakers. I'm Donna Lowry.\nWe're continuing with our special budget show\nwith two of the most sought-after people at the Capitol,\nthe pair who lead the discussions on state spending.\nThe budget chairman, Representative Matt Hatchett\nand Senator Blake Tillery, who are joining the show\nright now from the state Capitol, we appreciate.\nYou both of you sticking with us.\nNow we've talked about the amended 2025 budget,\nalso known as the baby budget.\nNow we're going to talk about the big budget\nfor fiscal year 2026.\nAnd Chairman Hatchett, it's known as the big budget,\nbut as you pointed out when you presented in the house,\nit's actually smaller than the amended budget this year.\nCan you explain the difference?\nSo yes, the amended budget we come back every year\nand true up the expenses that we know are coming\nand the expenses and Medicaid, expenses in K-12 education\nbecause we always have an increase there.\nSo that's what we do in the little budget amended budget.\nBut the amended budget this year,\nI think, was right around $4 billion.\nSo the 26 budget that we passed out of the house,\n$37.7 billion, is an increase over the 25.\nThe first budget we did in 25, I think it's around $4 billion increased to maybe 3.5.\nI had really studied up on my fiscal year 25 notes, but 26 is what we were just passed\nout of the House and the Senate is considering it now.\nOkay.\nWell, I'm going to spend more time with you, of course, because, of course, could we\njust point it out that you passed the House past its version in Chairman Hillary and the\nSenator working on theirs right now.\nAnd as you said, Chairman Hatchett,\nthe biggest winners in that House budget\nare education and prison.\nSo let's start with education, A12.\nWhat's in that group?\nK through 12, you know, it's all of our high schools,\nmiddle schools, elementary schools, the enrollment.\nEnrollment was up slightly,\nbut I think there was like a $500 million increase\nin the expense with our schools,\na large adjustment for the year over the year.\nAnd the big, the other big part was a presence.\nWe put $345 million into the amended budget\ninto our Department of Corrections.\nOur recommendation for 26 puts another $250 million\nin corrections.\nSo it's a huge investment in our prison systems.\nand I think they're essential,\nit's essential for our safety,\nit's essential for our workers at the prisons,\nand it's essential for the safety of the prisoners.\nYeah, I wanna get into that a little more in a moment.\nI wanna stick with the education budget\nbecause it allocates $62 million\nfor a new program called Student Support Services.\nYou've called it an umbrella program.\nSo what exactly does that entail?\nSo, it's $10 million for, or $28 million for mental health workers and our counselors\nin our schools.\nIt's, you know, however, the school system would like to use that money.\nIt's a grant, $20,000 per school.\nThey could contract with telehealth to do consults at schools that could contract with\nmental health providers.\nAnd I know one of the things I said, mental health goes hand in hand with school security\nand the mental health of our units here.\nThere's $5 million for an additional portion of mental health at the schools.\nanother 25 million, I think for four day school security threat program, you may have\nto refresh my memory on the rest of that Donna.\nSorry.\nNo, all of that is good.\nAnd I don't know how you guys keep all those numbers in your head anyhow.\nI really don't have such admiration for that.\nI want to continue.\nYou get back to the budget part on corrections.\nYou mentioned the $250 million in new spending.\nAnd part of that is for pay raises to hire more than 700 guards.\nHow great is the need to shore up the workforce in Georgia's correctional system?\nYou know, Donna, I don't think I can stress enough how great that need is.\nWe've been so far we're seeing a successful increase in those that are applying and those\nthat are staying.\nWe've given them pay raises, we've helped, helped the number, having more corrections officers\nat the prisons actually helps for the safety and it helps people feel more secure in the\njob that they're doing and we have been at a certain officer to inmate ratio and we\nWe are recommending that we reduce that ratio to one officer for 11 inmates and that in\nitself cost more money because you should have more staff, but so far we're seeing a success\nat retaining and hiring new officers and we don't want that momentum to stop.\nThat's part of the reason of the situation we're in now because during COVID we lost so\nmany corrections officers that are prisons and then that therefore led to some of the\ndemise of the actual facilities and so there's kind of you got to have both the improvement\nat facility and more officers there to make sure the investment you're doing or making\nin the facilities will stay in it and it's going to you got to have a both.\nYeah, and I know that this has been something\nthe governor is pushing for to do better\nwhen it comes to the Georgia's\ncorrectional facilities.\nChairman Telleria, I know you're still working\non your budget, but can you give us any idea\nof some of the Senate budget priorities?\nSure, we finished up the subcommittee today,\nso we will start tomorrow morning coming through things\nprobably through this weekend to try to align our budget\nand our priorities with the houses\nto come out with the Senate's budget proposal,\nprobably by the end of next week.\nOne of the things that we know we're gonna address\nis the promised scholarship.\nIt was a reduction on the house side.\nIt was done based on mathematical reasons,\nbased upon uptake that you saw in other states.\nTheir number wasn't flawed.\nIt was just picked by some prognostication done\nby other states.\nWe believe in Georgia that the uptake\nis gonna be a little bit higher.\nSo you're gonna see us probably move\nto replace some of those funds.\nprobably all of those funds,\nat least on the Senate side as we enter into the debate.\nAnd then there's also some questions about\nthe House laid out a proposal\nthat was different from the governors\nand we're gonna have to make an internal decision\nwhich path we wanna follow.\nThat will lead us to make other decisions related\nto the budget, but back on the education portion,\nremember education makes up 53% of the dollar spent\nat the state level.\nSo 53 cents of every dollar you send to Atlanta\ncomes back to the local area\nin some form or fashion related to education.\nOne of the things that the Senate has looked at\nis seen that we've seen a 65% increase\nin central office and admin spending\nduring that time period.\nSo while we've increased things like 100 million\nto help out with people transportation,\nwe've also increased school safety funding,\na roughly $70,000 per school now.\nWe've seen that since we've also passed the bills\nthat allow local school systems to opt out\nof the funding mechanisms that QBA funds.\nIn other words, they can use their funding\nand a lot more a fashion that doesn't tie them back\nto the title 20 rules.\nWe've seen the jump in admin and central office spending\noutpace the jump that we would have rather seen\nin the classroom.\nSo those areas, I think, is where you'll probably see our focus\nparticularly on the promised scholarship\nand then picking who's gonna be our more aligned partner\nas we move forward,\nwhether it be the house's position\nor the governor's position.\nThose are the big things we have to decide this week.\nOkay, I know Chairman Hatchet,\nwe don't have a lot of time,\nbut can you briefly talk about the bond package\nthat's part of the house budget a little bit?\nWhy are you going that route?\nSo we chose to bond $321 million of capital expenditures\ndollars of capital expenditures that were previously being paid for in cash to\nfree up some money for us to do the education spending like I mentioned to\nbackfill the need in corrections DHS community supervision the different\ndepartments and some other priorities in the house. Okay. Chairman Tillery is the\nSenate going to have a bond package? Remains to be determined again we're\nwaiting to see what the position is of the senators as it relates to the\ngovernor's proposal and the House proposal. If we were to take the House's\nproposal then there's a bucket that we're going to need to fill on the\npromised scholarship. If we were to take the governor's proposal then there's a\nbucket that we're going to need to fill on the bond package. So there's still a\nwhole lot of work to done that work left to do. I think I would probably chair\nManhattan would agree with me that this might be one of those bills that gets\ndone last this year. I don't I don't think we get done early this time. Right\ndown to the wire on Steini Die.\nChairman Hatchett, as always,\nwe have the show around St. Patrick's Day.\nHow was it in Dublin yesterday?\nI got to get that in real quick.\nGood?\nSo we had a great weekend.\nFriday, Saturday, even Thursday.\nWe had a great, the weather was beautiful.\nAnd we had a great time.\nGreat 60th anniversary of our St. Patrick's Festival.\nThat's great.\nWell, I want to thank you both for coming on the show.\nIt's always wonderful to find out what's in our budget.\nBut for us, that does it today for lawmakers.\nWe'll be back on Thursday for an in-depth conversation\nwith Georgia's First Lady Marty Kemp,\nand she'll talk about our fight against human trafficking.\nHave a good night.\n",
  "updated_at": "2026-02-12T01:31:06.597713+00:00"
}