{
  "video_id": "57R9OIVuQvg",
  "url": "https://www.youtube.com/watch?v=57R9OIVuQvg",
  "title": "Lawmakers Day 29 03/20/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 29,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a summary of the Georgia Lawmakers Day 29 03/20/25 session:\n\n**Overview**: The session had a relatively mellow mood, with a notable visit from a Nigerian queen promoting her Elevate Africa non-profit. The legislature passed a banking cleanup bill and discussed effects of the Trump administration on the VA. They also prepared for a trout fishing event.\n\n**Key Actions**:\n- **HB-15**: Bill that adds cleanup language to banking and financial laws, passed 46-1.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- Visit from Queen Allori Atuache III of the Warri Kingdom in Nigeria, who promoted the Elevate Africa non-profit.\n- Lawmakers condemned proposed federal job cuts at the VA, which could impact veterans.\n- Lawmakers celebrated the success of the Municipal Electric Authority of Georgia.\n- Preparations for the Georgia Legislative Sportsman's Caucus trout fishing event.\n\n**Votes**:\n- HB-15 passed 46-1.\n\n**Attendance**: No quorum notes.\n\n**Adjournment**: No adjournment time or next session date provided.",
  "transcript": "I know that African royalty often raises eyebrows in America thanks to certain infamous emails.\nSo I can imagine the Google searches to verify that this Nigerian queen was legitimate.\nWell, here I am.\nAnd I bring you greetings from his majesty, Ogyama Atsu Ashe III, and the good people of\nthe warry kingdom in Delta State, Nigeria.\nIt was a royal affair at the capital today, as a queen of Nigeria paid a visit to promote\nher cause, Elevate Africa.\nGood evening and welcome to Lawmakers.\nI'm Donna Lauer in Atlanta.\nMore on the queen later.\nWe've all seen those missing personal alerts.\na new push to include people with autism in Maddy's call. We'll chat with the lawmaker behind\nthe legislation. We'll also discuss bills aimed at shaking things up for landlords, tenants,\nand property owners. One of the most talked about bills this session would ban transgender\nathletes from participating in girl sports. The sponsor of the bill in the House version is in\nthe studio. We also have a lawmaker who voted against it to tell us why. First, let's hear from\nfrom Sarah Callis on what happened on this rainy Monday\nin Atlanta at the Capitol.\nHi, Donna.\nPerhaps it was legislative hangover\nfrom Thursday's Frentate Cross over day,\nbut Monday took on a far more mellow mood in both chambers.\nIn the Senate, the day started with a royal visit\nas Queen Allori Atuache, the third,\nstopped in to promote her cause, elevate Africa.\nThe Queen Concert of the Worry, Delta State Nigeria,\nhad a sense of humor when it came to knowing\nwho she actually was.\nI know that African royalty often raises eyebrows in America\nthanks to certain infamous emails.\nSo I can imagine the Google searches\nto verify that this Nigerian queen was legitimate.\nWell, well, here I am.\nAnd I bring you greetings from his majesty,\nOgyame Atuache III, and the good people\nof the Warri Kingdom in Delta State, Nigeria.\nthe Elevate Africa non-profits role is to quote\nin power in spotlight new African leaders\nin indigenous solutions.\nLast month we inaugurated our 2025 Elevate Africa Fellows,\n17 remarkable fellows from 13 different African countries.\nAll of them embody the brilliance\nour continent offers to the world.\nTheir work spans from revolutionizing agricultural systems\nto pioneering AI-driven healthcare solutions,\ninnovations that can contribute meaningful answers\nto our global pressing problems.\nThe Senate then took on the only bill on the rule stocket.\nHB-15 is a bill that adds cleanup language\nin banking and financial laws.\nThis bill this year particularly contains revisions\nto laws impacting banks, bank holding companies,\ncredit unions, merchant acquired limited purpose banks.\nThat's a particular term of art.\nfarm bank offices, installments, lenders, money service businesses, money transmitters,\nsellers of payment instruments and check casters.\nAnd there are also a few areas that touch on mortgage lenders and broker laws.\nThe bill was passed 46 to 1.\nThe house quickly gabbled in and gabbled out after passing the local calendar.\nBut members made time to commemorate the municipal electric authority of Georgia.\nThank you to Reputation for Excellence in Governance, Operational Efficiency and Physical Responsibility.\nMay Ag's contingency success as a testament to the leadership of its management employees\nand participant communities who have made public power real asset in Georgia.\nAnd discuss President Donald Trump's administration and its effects on Georgia.\nOne lawmaker condemned more proposed government agency cuts from President Trump's administration.\nThe proposed 87,000 federal job cuts within the VA predominantly affected military veterans,\nwhich comprised one-third of agency employees.\nThis threatens to undermine the very foundation of honor, respect, and gratitude that we owe\nour veterans.\nThe Veterans Administration is not just another government agency.\nIt is the lifeline for millions of men and women who have dedicated their lives to protecting\nour freedoms.\nRepresentative Josh Bonner congratulated former U.S. Representative Doug Collins appointment\nas VA secretary.\nYour colleagues, I just wanted to take a moment to just speak a moment about how proud\nwe are to have one of our former colleagues, one of our former congressmen, Doug Collins,\nis our new secretary of the Veterans Administration.\nI've been in communication with Secretary Collins and I'm happy to report that he's doing\nan incredible job for us.\nWhile it is true that we will be finding some efficiencies within the veteran administration,\nthe sole purpose of finding these efficiencies is to do one thing and that's to serve our\nveterans better.\nAnd finally, lawmakers prepared to go trout fishing tomorrow.\nTomorrow is trout fishing day.\nThis is our Georgia Legislative Sportsman's Caucus event tomorrow, Tuesday, March 11, 2 p.m.\nto 6 p.m. at the West Palisades Park.\nOkay.\nThat's at 932 acres, res, drives, southeast, the closest place to the Capitol and you can\ncatch trout fish in.\nSo everything will be provided, the gear, the waiters, everything is provided.\nJust need you to come if you can.\ncommittee meetings will take on new importance this week as they start to look through the\n440 bills passed over from each chamber on crossover day with only a month left in this legislative\nsession. Tomorrow, the House is expected to vote on the budget for the upcoming fiscal year.\nAnd as you know, Donna, it's the one piece of legislation they are mandated to pass each year.\nThat's my capital report.\nThanks, Sarah. Now to some grim statistics. In 2021, the National Center for Missing and\nExploited Children reported 286 children with autism went missing. Wandering is common and\ndangerous for children with autism, especially during a warmer months when children are playing\noutside. Family gatherings can be high-risk situations for children with autism. Also,\nBut children with autism may be reluctant to come when their names are called, run away\nfrom police sirens, or be afraid of dogs.\nWe're going to talk about trying to help families of children and adults with autism and\nmore.\nJoining me is Democratic Representative Carl Giljard of Savannah.\nHe's Secretary of the House, Creative Arts and Entertainment Committee, and he's on\nthe House Appropriations Committee.\nAnd Democratic Senator Danzella James of Atlanta.\nof Urban Affairs and Vice Chair of Interstate Cooperation.\nWelcome to lawmakers to both of you.\nThank you.\nRepresentative Killier, we're going to start with you.\nWhat made you introduce House Bill H.B. 465,\nthe Autism Missing Person Alert System Act?\nWell, Donna, it's a bill that saves lives.\nMy brother, I'm one of 10 children,\nand my younger brother has Down syndrome\nand suffers from autism.\nBut there's a young lady named\nevery spencer who has a son who suffers from autism.\nAnd those are individuals that are a young and adult.\nThis bill is a saving life bill.\nAnd the GBI had gotten over 175 phone calls this year\nfor reports of people that were missing.\nSo how could we come up with a bill that would save lives?\nI think House Bill 465 is going to provide that.\nAnd so tell us what the bill would do,\nbecause it passed in the house unanimously.\nIt is, you know, a unique bill that patterns out the Maddie's Law.\nAnd Maddie's Law is the disability alert for those that have disabled family members.\nSo this will simply sound the alarm for those that have a family member with autism\ndismissing.\nThe chances are, through the GBI, that the timeframe will be cut down, that law enforcement\ncould have a better sense of finding that individuals, because of the way the alert goes out.\nAnd with the GBI being the persons that are orchestrating,\nI'm sure that I will have a chance to save lives.\nAnd Matty's call also is for elderly people too, so.\nIt is.\nIt will be encompassing a lot.\nYou, you favor this law.\nTalk about it a little.\nOh, yes.\nI also introduced legislation Senate Bill 211\nthat almost was exactly like the bill that passed.\nBut my bill didn't move much in the Senate.\nThe only difference in my bill was that it added\na ID bracelet for all the people with autism\nthey could wear it.\nLike the ones to say,\nI have heart condition or diabetes or whatever.\nWe want one for autism too,\nbecause these kids, I have a grandson that has autism.\nthat has autism.\nI have only two grandsons,\nso his big brother was a genius in doing great\nand he's seven years younger\nand he's still at Douglas County schools,\nbut he's different.\nHe was nonverbal until he was seven.\nBut when they, I think parents are often in denial.\nAnd so by the time my son and his wife knew something was wrong,\nthe lieutenant governor, Kasey Kegel,\nand I got an opportunity to introduce legislation\nso that insurance companies could pay\nfor the screening for children.\nFrom up to eight years old,\nI wanted to make it up to 12, but they made it up to eight.\nSo we found out, and when I found out\nthat it would not just help my grandson,\nbut thousands and thousands of children\neat right here in Georgia.\nSo yeah, so I'm working very hard on that.\nEarly screening is important, I know that.\nAnd so I know you'll be supporting his bill\nwhen it comes over the Senate.\nThat's where it is now.\nAbsolutely, and I'm very honored that he asked me\nto carry it when it got there.\nAnd I'm trying to talk him in to put in just\nthat little bracelet on there so that we would be able\nto also have another way in everything\nthat we can do to help our artistic young people.\nbecause my mother taught special education\nin Atlanta Public Schools,\nand the kids are so misunderstood,\nand she wants to make sure that we take care of them.\nWell, let's hope that we get unanimous in the Senate, too.\nBut I want to talk to you real quick\nabout a couple of the things.\nSeveral years ago, for you, for several years,\nyou fought for tenants' rights,\nand you have SB 106.\nIt would repeal the current law to place restrictions\na rent regulation by local governments.\nTell us about it briefly.\nThat bill is the rent control bill.\nYeah.\nAnd the state of Georgia has a rent prohibit any rent control.\nAnd it's only one of nine states that\ndoes not have some kind of rent control.\nSo they prohibited it.\nSo I want to lift that prohibition\nand let local control happen with the cities\nand the counties.\nBecause after Mr. Chair was,\nhe was a chair of Black Caucus,\nand he sent us to all the HBC schools.\nAnd I had an opportunity to talk to so many students\nthat were having problems finding somewhere to stay.\nAnd it was because the rent was doubling,\ntripling, and sometimes quadrupling.\nAnd that's what happens when they get ready\nto renew the lease.\nAnd then I found out it's not just the students,\nit's our seniors who are now needing to go get a small house.\nIt's the veterans who are coming back\nand want to rent something close by.\nSo we have a real serious problem with the escalating rent.\nAnd so it's hard to stop that.\nAnd then I found out that it's foreign entities\nthat come in and buy all these things\nand all the buildings and the empty places\nor by whole building and the leases that they have now,\nthose people are gone and they raise them up.\nSo we need to put this prohibition,\nthe mayors wanted, the county commissioners\nwant to have that control,\nand they know best was better for their area.\nWell, keep an eye on that.\nI want to get to some more things.\nI represent the Gilliard.\nAnother of your bills passed unanimously,\nH.B. 303, the original 33 act, it refers to Georgia's first 33 African-American lawmakers\nin 1868.\nAfter reconstruction, they were some of the first black state legislators in the United\nStates.\nAnd there's a statue on the Capitol Grounds and their honor.\nTell us what your bill would do.\nSo you know that the original 33, Donna, they stood up so we can sit down.\nAnd so this bill simply gives us 33 names that will be honored inside the Capitol as a\na memorial, you know, these were 33 heroic Americans.\nAnd they were kicked out.\nI didn't say that.\nThey were kicked out of them.\nThey were kicked out in 1868.\nThe legislature.\nThey were not able to serve.\nAnd 14 of them were lynched.\nI want to say that again.\nThey were lynched.\nWow.\nAnd so this is important that every time I have that little\nname tag on, and I think I'm all that in the bag of chips,\nI think about the giants of the shoulders that we stand on.\nAnd so this is a fitting tribute to 33 great Americans.\nOkay.\nAnd real quick, tell you, you've got some HOA bills, right?\nI do.\nGive me a little briefing, I'll tell you.\nOK.\nI want to say real quick, that my uncle, Lira Johnson,\nwas the first black senator since reconstruction,\nand he didn't come until the late 60s and early 70s.\nOh, OK.\nYes, but yes, I do have these HOA bills,\nbecause so many people are having so many problems\nwith the HOA's now.\nand getting their homes taken from them\nand sold on the courthouse steps.\nSo we have to do something.\nWe've had five hearings.\nI put legislation in.\nIt went through a couple of the committees\nand it stayed on the rules now\nbecause it didn't get crossover.\nOkay.\nUnfortunately.\nWe'll keep an eye on SB 107 and 108 then for you.\nCorrect. Thank you.\nThank you.\nI want to get in something with you, Representative Gillier.\nWe have a little time left\nand I know that you formed\none of the first positive rap groups\nin the nation called Candy Love.\nTell us about it and drop a few beats.\nCandy Love was the first.\nLet me, let me, let me clear it up\nbefore they was outcast, before they was good at mob.\nWe were the first.\nWe were the first kings of the South for rap.\nWe did positive rap die.\nOkay.\nSo one of the things we did our people fight against\nwith another, maybe one day they would discover\nothers lost their lives so we can gain\nthrow it in lives of crack cocaine.\nRelease the grip and then you will be free,\nget a taste of some spiritualality.\nWhatever you do, don't give up the fight.\nStand up and fight for what's right.\nAll right, Ed.\nI just needed somebody to give me a beat to go with that.\nAll right.\nBut we were the first.\nSo I'm looking forward to hearing my comrades\nin the General Assembly now try to get me to wrap.\nOh, yeah.\nI think that should happen anytime soon.\nWe'll have you back here on lawmakers.\nThere you go.\nWe'll be right here.\nThank you so much.\nWe'll be paying attention to your bills, which are now,\nboth of them now in the Senate,\nand we'll keep up with what you're doing.\nThank you both for being here today.\nI appreciate that.\nThank you, ma'am.\nThank you so much for the opportunity.\nAll right, coming up, we discuss bills\ndealing with maternal health and transgender athletes.\nTwo members of the Georgia House join us.\nThis is Lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capitol during the session and year-round,\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nAnd a queen.\nI don't fear anyone.\nThis was a woman.\nPeople wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it.\nFive-knowledge in our own worth.\nOh, please.\nDo continue.\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nUnderstanding the past gives a sense of the future.\nMUSIC\nThis is the first time that anyone has seen this in 2000 years.\nOkay, this is amazing.\nPompeii is a battle against time.\nYou think I'm joking, but look at this.\nIt really happened.\nDon't let anybody tell you who you are.\nWelcome back to Lawmakers I'm Don Allowing.\nBoth the House and Senate pass bills before crossover day to ban biological males from\nplaying girl sports.\nIn the Senate it's called the Fair and Safe Athletic Opportunities Act.\nThe House Bill is called the Riley Gaines Act, named after a swimmer who became an advocate\nfor removing transgender women from women's sports.\nWe're going to talk about that bill and more with two members of the House.\nRepublican Representative Josh Bonner of Fayetteville is chair of defense and veterans affairs.\nHe was commissioned as an active duty army officer in military intelligence before transitioning\nto the United States Army Reserves and Democratic Representative Ann Westbrook of Savannah.\nan attorney, and on the House Economic Development, Tourism Judiciary, and State Planning and\nCommunity Affairs Committees.\nWoo!\nWelcome to Lawmakers, both of you.\nI appreciate that.\nThank you.\nSarah Bonner, tell us why you wanted the Riley Gaines Act.\nSo I'm the father of two girls, have daughter of play soccer, and it's been very near and\ndear to me to make sure that in Georgia, that we protect female athletes.\nAnd so that's exactly what the Riley Gaines Act does.\nprotects female athletes in Georgia,\nand it keeps biological males out of their sports\nand out of their locker rooms.\nAnd so that's a subject very near and dear to me,\nand it's also with a lot of constituents\nand a lot of folks in Georgia.\nOkay.\nYou voted against it?\nWhy did you say no?\nI voted against it because there is nothing going on\nin girls and women's sports in Georgia\nthat is solved by this bill.\nThere were no, even prior to this bill,\nthere were no transgender athletes competing\nin athletics in Georgia, that's according to reporting from the AJC, even in the entire\nNCAA of 500,000 NCAA collegiate athletes, there were less than 10 transgender athletes\ncompeting.\nSo, with all the issues that we have in Georgia and your previous segment covered many\nof them beautifully, affordable housing, lack of access to health care, we don't need\nto burn precious legislative days of our 40-day session on an issue that is frankly non-existent\naccording to the numbers in Georgia. There are issues facing girls and women's sports\nthroughout the country, including in Georgia. Those issues are under investment and are\nprogramming. Those issues are harassment and abuse. And some of those scandals around\nsexual abuse have reached Georgians, but this bill just doesn't solve anything that's going\non in Georgia.\nAll right.\nYour response?\nWell, I was certainly pushed back on that.\nWe do know that it's happening in Georgia.\nWe know that it has happened.\nWe passed a rule a law two years ago that allowed the Georgia High School Association\nto put into rule a ban on biological males participating in female athletics.\nSo we certainly haven't seen it in that period of time.\nBut we know it's happening based on the testimony of those that came to committee that were\nagainst the bill, a number of those folks said that they did participate in female athletics.\nAnd so, and I would push back to say, even if it's just one, who wants to sacrifice their\ndaughter on this altar of ideology when we don't have to?\nSo who wants to be the one?\nOne is too many in my opinion, and I think we owe it to every female athlete in Georgia\nto offer a level playing field that they can compete on.\nYou did have some Democrats vote for it, but mostly in the long party lines, right?\nWe certainly was a majority party line vote, but we did, in both in the Senate version\nand the House version, we did have some Democrats vote with us, and we're certainly appreciative\nof that.\nAnd I think it certainly shows that this truly is a bipartisan issue that when the polling\nis done throughout Georgia and the U.S., it's overwhelmingly in support of this legislation.\nAnything you want to add?\nYeah, I'll just add, there have been many dark periods in our history where things have\nof pulled well, where things were popular.\nAnd, you know, history doesn't repeat,\nbut it often rhymes, and scapegoats change\nat different times in our history,\nbut one thing we often hear,\nwhen we are seeing individuals scapegoated\nas we're doing it for our women and our girls.\nAnd so as someone who played sports\nall the way through college,\nmy college athletics, my earlier years in athletics\nwere my leadership training, what got me here,\nand I know I have colleagues in the house\nwho have that same story, this isn't what girls and women need.\nWe need support for our programming and all those kinds of issues.\nWe don't need to be used as political props.\nAll right.\nChairman Bonner, now we've got you, you have passed it in the House to the Senate.\nThe Senate has passed the House.\nTell us what happens next with these two bills since they're so similar.\nCertainly.\nWell, so we're certainly working with our Senate colleagues.\nOur goal is regardless of what version emerges, our goal is the same, to protect female\nathletes in Georgia.\nAnd so whichever version of the bill does that, we're certainly going to push forward,\nbut we'll be working very close with our senate colleagues in making sure that the input\nthat they put forward is incorporated into the bill.\nOkay.\nWe'll see.\nWe're going to change gears right now.\nWe'll see what happens with that.\nWe're president Westbrook, HB488, another bill that you sponsored, the Pregnancy Center\nFraud Prevention Act, which aims to prevent pregnancy centers from misleading advertising.\nYou spoke on the issue last month during a big rally in favor of your legislation.\nWhat are pregnancy centers and what would your bill do?\nWell, these centers go by a number of different names.\nSometimes they're called crisis pregnancy centers.\nSometimes they're called anti-abortion centers.\nSometimes they're called fake clinics.\nBut they confuse and mislead women.\nThey are not clear about what services they offer, what services they don't offer.\nThey really exist to talk women out of having abortions, and they do that by sort of dressing\nup and masquerading as health clinics.\nBut they do not have to provide the range of health services that clinics do.\nThey don't provide the standard of care that medical clinics do.\nThey're not bound by HIPAA.\nAnd so women go into these centers thinking they're getting one thing.\nAnd what they're actually getting is counseling out of one of their options that's available\nto them under the law in Georgia.\nThey aren't regulated as business enterprises because they're nonprofits generally.\nAnd they aren't regulated as health providers because they aren't health providers.\nIn fact, you'll see those disclaimers sometimes on their website that we are not a substitute\nfor healthcare.\nSo at a time where we know that maternal mortality is sky high in Georgia and those rates are\nnot coming down, infant mortality is high in Georgia.\nWomen can't access OB-GYNs in half of Georgia's counties.\nPediatric care is hard to access in about 42% of Georgia's counties.\nWe shouldn't be funding these clinics that don't actually provide health care.\nWomen have a right to accurate evidence-based care.\nSo the bill on the first bill would prohibit basically false advertising by these crisis\npregnancy centers.\nAnd it would all, the second bill, the companion bill, two bills actually are companion bills\naddress the funding because Georgia funds these crisis pregnancy centers, these sort of\nfake clinics, to the tune of $2 million every single year.\nAnd given the state of women's health care in Georgia, Georgia's have a right to ask\nwhether that's the highest-invest use of their tax dollars.\nMy bills would redirect that funding\nto an evidence-based home-visiting program\nthat's already being used in Georgia\nand it's getting better outcomes for moms and babies.\nOkay, nothing passed by four crossover days,\nbut it's still alive.\nThat's right.\nWe'll see what happens next.\nNext, but next year because it's a biennium.\nI'm gonna change gears a little bit.\nYou spoke on the floor today.\nYou praised Georgia Congressman Doug Collins,\nwho is the new Secretary of Veterans Affairs,\ntell me what you learned about what he's planning.\nWell, as all of our federal agencies are doing now,\nthey're looking at how to find efficiencies in government.\nAnd the Veterans Administration is one\nthat routinely constituents of mine\nof folks all over the state of Georgia of Veterans\ndon't have great experiences with the VA.\nIt's a very bloated and inefficient agency.\nAnd so what Congressman Collins, Secretary of\nCollins, is doing is seeking to find\nefficiencies in that.\nSo it's not making any cuts to the frontline workers\nthat provide the service, but a lot of the administrative\nand back-end work.\nAll the things where the process has been kind of\ngummed up for veterans.\nAnd so the overall goal of finding those efficiencies is\nto make sure that the veterans receive the benefits\nthey've already earned and receive the best health care\nthat they can.\nOK, we'll keep up with all of that.\nI'm going to get one more bill in for you.\nYou have another of your areas of interest\nas maternal health care.\nAnd with health resolution 274,\nit would, you want to allocate more money\nto actually two million more dollars\nto the Georgia pregnancy and early childhood\nhome visiting program.\nTell us about that.\nAnd we'll run out of time soon.\nI'll be quick.\nBecause I kind of covered this a little bit already.\nThis is basically just reallocating those dollars.\nInstead of sending $2 million every single year\nGeorgia taxpayer money to clinics that don't actually provide health care.\nLet's redirect that.\nLet's direct that to this home visiting program that is already established.\nIt's serving women and babies in rural Georgia and it's getting great outcomes.\nOkay.\nAnd you had a veterans bill.\nTell us about it.\nSo there's a number of veterans bills that we got passed.\nIn fact, Representative Westbrook and our co-signed a veterans bill together.\nSo there are ways we can work together for our veterans.\nBut one in particular that I'd like to highlight is the Save Act.\nIt is a bill that regulates the claims consultant industry.\nThese are the companies that come in and help veterans assemble their packets to apply for\nbenefits and get them that much faster.\nWe provide a regulatory framework for those companies that allows them to operate in Georgia\nregulated and allows a veteran to get those benefits that much faster.\nAnd how did your bill do?\nSo it passed over to the Senate and we're hoping to have a hearing this next week in the\nSenate committee.\nWho's carrying it for you?\nThat would be Senator Chuck Payne.\nOkay, and is he a veteran too?\nHe is.\nAll right.\nSo you're feeling pretty good about that.\nI am.\nHe's the chairman of their veterans committee in the Senate,\nand that particular bill was voted out of the Senate last year,\nand we've got high expectations this year.\nYeah, can you believe after the day, ten days left?\nTen days.\nYou guys have a lot of work to do, and not much time to do it in, though.\nThat's right.\nBut you're ready, huh?\nWe are.\nOkay.\nWe'll stick with it.\nWell, thank you both for coming on the show.\nI appreciate it.\nThank you, John.\nThank you for having me.\nToday, tomorrow, my conversation with the Commissioner of the Department of Behavioral Health and Developmental Disabilities Commissioner Kevin Tanner.\nAmong other things, we'll talk about forensic beds for people in jail who may need mental health services.\nUntil then, have a good night.\nThe End\n",
  "updated_at": "2026-02-12T12:16:30.837904+00:00"
}