{
  "video_id": "5BLqpo2tP8A",
  "url": "https://www.youtube.com/watch?v=5BLqpo2tP8A",
  "title": "3/22/23 - Committee on Appropriations Subcommittee on Compensation",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 43,
  "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Appropriations Subcommittee on Compensation session:\n\n**Overview:** The subcommittee discussed and considered amendments to House Bill 364, which aims to establish a panel of experts to evaluate and recommend compensation for individuals who have been wrongfully convicted. The bill would provide a range of $50,000 to $100,000 in compensation.\n\n**Key Actions:**\n- **HR 364:** Legislation to create an expert panel to evaluate and recommend compensation for the wrongly convicted\n\n**Bills Introduced (First Reading):** None\n\n**Notable Moments:**\n- Discussion of the proposed compensation range and how it compares to other states' practices\n- Consideration of an amendment to allow for annuity payments for awards over $1.5 million\n- Emphasis on ensuring the compensation is exempt from taxation\n\n**Votes:** The subcommittee unanimously voted to adopt the amendment allowing for annuity payments.\n\n**Attendance:** Quorum was present for the subcommittee meeting.\n\n**Adjournment:** The subcommittee adjourned after considering the bill and amendment. The next session was not specified.",
  "transcript": "You\nI believe with a subcommittee, so I'm going to go ahead because he presented a great\nbill last summer.\nI want to make sure we take advantage of this time.\nWe won a rules committee meeting, and Senator Dolezal got me here on time, so you have\nhim credit for that.\nBut why don't you go and sort of give us a brief refreshment of what you've talked about\nearlier, and let's see if we can get some action on it, okay, yes.\nMy name is Scott Holcomb, and I'm presenting to you House Bill 364.\nHouse Bill 364 has been an effort that this General Assembly has worked on for many years.\nAnd I think there's long been a recognition that we would benefit by improving the process\nby which we compensate the wrongly convicted.\nAs you all are aware now and as the resolutions that follow will be presented, right now it\nrequires an individual resolution.\nSo every person who is wrongfully convicted has to have a resolution filed and go through\nthe whole gauntlet of the legislative process.\nMany members have shared with me and candidly I'm a practicing lawyer and a former prosecutor\nthat they feel a little bit uncomfortable making these decisions, is that they require an\nexpertise in understanding if the person was in fact innocent and reviewing the legal\ncase history to come up with a good decision.\nSo what this bill does in a very high level overview is it would create a panel of experts\nwhich would include a judge, a district attorney,\na defense lawyer, and then two appointments,\none from the House and one from the Senate,\nand those appointments would have to have specific expertise\nin wrongful convictions and particularly with DNA evidence.\nMy understanding was almost everybody\nwho has been exonerated, meaning that they did not commit\nthe crimes that they were prosecuted for and jailed for\nhad been released because of DNA evidence.\nWe've had great advances in DNA evidence and technology\nand testing over the last couple of decades.\nSo this group would then evaluate,\nensure that the person is innocent.\nWe've worked with the prosecutors\nto make sure that the language is tight\nand would only apply to those that are innocent,\nnot to those that may have then released\non a technicality.\nAnd then if they found the person was innocent,\nthen they could recommend compensation.\nSo we already do this as a general assembly,\nso we'd be deling getting this to experts.\nAnd the range would be between 50 and 100,000.\nThat range was determined based on studying\nhow this is done across the country.\n38 states have wrongful compensation panels,\nand the median dollar amount is 75,000.\nMost states set a specific sum,\nwhereas we are putting in place a range,\nand then the panel could take into account different factors\nin terms of making recommendation within that range,\nbetween 1,500 and 1.2 know is that in serving\nthe other states, there are some states\nthat are much, much more generous.\nSome states provide $200,000 per year of incarceration\nas well as even medical benefits afterwards.\nSo what George is doing is certainly significant\nand I support our measure but compared relatively speaking\nis we would be kind of right in the middle,\nbut we would also advance, I think this process,\nif this were to move forward, by being a state\nthat has a commission of experts\nto help the General Assembly with this decision.\nSo then finally, if there was a recommendation,\nit would go to the Chief Justice of the Supreme Court.\nThe idea there is that since the mistake took place\nin the court system, it makes sense for it\nto be within their budget.\nAlso because of separation of powers,\nmy understanding is that the governor\nwhen making his recommendation to the General Assembly\nusually does not change in any way\nthe recommendations that come from the judiciary.\nSo the General Assembly would then have it\nand would have final oversight for any recommendation.\nThen the last sort of substantive part in the bill\nto highlight is this also has a protective feature\nfor the state whereby if an individual had a claim\nfor wrongful conviction.\nThere is under civil law claim for wrongful conviction,\nthe state would get a credit for that.\nIn other words, if somebody participated\nthrough this process, they could not both get a dollar amount\nfrom this and then also receive a dollar amount unaffected\nin that claim.\nThere would be a credit and an offset\nbecause those dollars are coming from the state.\nSo I'd be happy to answer any questions.\nAnd the other thing Mr. Chairman did just point out\nis we did have a discussion earlier this week\nthat when we met about the annuity issue,\nas written now, the bill has recommendation\nthat the funds are provided in cash.\nThe primary reason for that is that these individuals,\nthe vast majority of people that we've compensated\nhave spent 15, 20, 25 years in prison,\nso they don't have assets, they don't have property,\nthey don't have retirement, they don't have Medicare,\nthey don't have Social Security,\nso experts in this space strongly recommended cash\nbecause the needs are very great for those\nthat have been harmed this way,\nbut there was a recommendation to have an annuity\nif the award were above 1.5 million.\nSo I had an amendment put together\nif the committee was interested in pursuing that.\nI actually think it's a really good idea,\nand I would support it if that were.\nYou have it on the will of the committee.\nYes, sir.\nI handed it in early.\nYou have to have a amendment out.\nRemember, you have the amendment.\nThey don't have it, okay.\nYou know, can we get a copy made of that so we can look at that and if what we do, I went\non line and looked at just a few of the exoneration across the country and it's really, really\nvaried, but you got about 1,000 a year in the United States of America.\nI looked at Texas, they all for 88 million dollars, 88,000 dollars a month.\nand then it goes paying taxes as well.\nSo where you aren't feeling on the taxes,\nyou should not be a mount,\nbut are you sort of feeling\nabout that as well?\nThere should not be tax,\nbecause this is a,\nit's not income,\nand we have a reference to that in the bill.\nIt may take me a second to find it,\nbut this money should be exempt from taxation.\nOkay, all right.\nBecause that happened to one of our persons\nwho had been exonerated and he was hit pretty much.\nSo what I will do right now is,\ndo you have a, do you each member have a copy\nof the amendment, you don't?\nOkay, pass it on, okay, thank you.\nWill you take a look at the amendment\nAnd let's see if this is something that we can look at.\nAnd I don't think it's at a trouble with the amendment\non this particular bill.\nAnd I also noticed that of all those, what I said about just\nunder 1,000 in the United States, the least of the medium\nis like $3.6 million compensation\nfor any length of time that doesn't deal with that.\nBut I just thought that was sort of interesting.\nBut, and we were listed as not having payments\nfor long-for conviction in the group of people.\nI don't know why that was like that.\nBut, so this would be our first recognized,\nbut we've been doing this for like 20 years,\nI believe at least 20 years or more,\nbecause I handle a John White case back in the 90s.\nSo I know we've been doing it for a while,\nit's just maybe perhaps not recognized in some of the areas.\nMr. Chairman, we have been doing it,\nbut it's been an ad hoc individual basis.\nI understand.\nYes, sir.\nHave members of the committee had the chance\nto look at the amendment?\nAnd if you do, do I have a motion on that particular\ncommission amendment?\nDo I hear a second?\nMoved in proper, a second is all in favor, say aye.\npost-like sign, now on the bill itself in the comments,\nsince the dollar's on.\nDo you?\nYeah, I was just going to ask a question\nof representative Holcomb.\nCan you walk us through the $5,000 to $100,000 range,\nhow that compares to maybe the last five years of compensation\nor some recent windows?\nDo we typically fall within that window currently?\nWe do, sir.\nYes.\nI think last years were maybe 60 to 65.\nI'm not sure what the ones are this year,\nbut I think they're probably within that same range.\nAnd so that has been generally where Georgia has been.\nAnd then as mentioned, it would be pretty close\nto the national mean, would be $75,000.\nAnd what I mentioned in the earlier hearing was,\nthe idea behind it, I think that this would be,\nif this were set up, how the board would apply it,\nwould be if you had somebody who maybe had a non-existent\nwar history for lack of a better term was kind of like a slacker,\nthey would probably be on the 50,000 range,\nand then if God forbid, somebody like me,\nmore on the higher earning stage,\nwere wrongfully convicted,\nI might be closer to the top end of it.\nAnd so it would give them an ability\nto consider the factors of work history, et cetera,\nand making the recommendation for the number.\nBut to your point is yes,\nwe are within this range now,\nso we're not dramatically changing\nwhat we're doing through our ad hoc process.\nThis is more so a comment for us to move through the process.\nI mean, this to me is probably one of the most difficult situations to deal with.\nIt's always unconscionable to imagine what it is like to be locked up and not having committed the crime.\nI would probably honestly discourage us from considering work history in terms of the value of that.\nFirst of all, second of all, I would consider length of time.\nAnd perhaps that is more of a consideration than what lost earnings may have been.\nbeen, because we very likely at this thinking of the scenario of a 20-year-old, we've taken\naway their ability to prove what their earnings could have been.\nThat's true.\nI would rather see that in consideration than work history personally.\nYou know the comments?\nJust a question.\nSenator Robertson.\nRepresentative, I hope you found them.\nThank you for bringing this forward as we talked about last time.\nI know this has been important to you and important to Chairman Efestration.\nAnd on our side, Senator Strickland and myself, is it your understanding or is it your feeling\nthat if we have a structure in place beyond what we're having now that the turnouts we have\nwould be much closer to what they should be as opposed to the system we have now where\nit goes to the Secretary of State's office, there's a committee there that's given information\nby whatever group and then that particular decision\nis made there, you think this has a little more integrity\nto the system, if you will?\nI think it improves it with Robertson, and by that,\nI think that it will prevent any potential mistake\nof us getting it wrong by having people that have real expertise\nto make this review instead of us as legislatures.\nLike it's, when I was asked to handle,\nI've shared this before, when I was asked to carry\nthe resolution last year, my immediate reaction was no.\nAnd then I had a bias of anybody that's in prison,\nI think committed it because I'm a former prosecutor\nand I had to kind of work through that.\nAnd it's not an easy process to really understand.\nreally understand. And so that's part of what we're trying to do is to make sure that we get it\nright and I think that this helps us achieve that. The other part is these individuals to Senator\nDolezal's point of having your liberty taken away for 10, 15, 20 years, not being able to be with\nyour loved ones for that period of time, not being able to invest in yourself in that time,\nmake money. All of those type of things of I don't want it to be subject to some\nof the politics that sometimes happens here. Sometimes the House and the\nSenate fight sometimes individual legislatures get sideways with other\nlegislatures and something could get killed just out of personalities and\npolitics. I don't know that that's ever happened but I don't want it to\nhappen either and so that's also part of what is driving this is what we could\njust have for lack of a better term a more sterile system that just really\nfocuses on the facts the law and makes a recommendation in terms of what is an\nappropriate remedy in terms of compensation and we still have oversight\nthrough the organic appropriations role that the General Assembly plays if we\nwanted to change the recommendation the recommendation is not absolute to us\nbut I think this puts really good guardrails in place to make sure that we make\nthe right call. Right and I'm not aware of the Senate and House ever disagree with each\nother so that's foreign to me. Especially this time of year. Especially this time of\nyear. But who makes these decisions now? What is the what is the expertise of the committee\nthat makes these recommendations now? It's us. No no I'm talking about these these\nresolutions that came to us they were vetted and someone said the other day that one of\nwas unanimous. So the way that it works now, you're correct in terms of there is a process\nnow and that process is that they come through the claims advisory board but the claims advisory\nboard is not filled with experts on wrong folk conviction. Is there a prosecutor on the claims\nadvisory board? I don't believe so. I'll say heads not in the back but I mean or shaken.\nBut so it's usually department heads. Yeah, so it's it's no one that's been involved as a prosecutor or within the criminal justice system\nSomebody that may not understand the evidence of a system somebody that may not understand the power of a\nHavius or or whatever that may may flow through the system. It's and is it\nWho presents to this commission?\nThe claimant, and then the claimant usually has provono council that represents that.\nSo the individual seeking compensation and their council present.\nAnd the legislator who's carrying the bill.\nRight.\nSo there is no one presenting from the other side.\nLet's say victims of this situation, victims, families or anything like that.\nThis is to be frank, I guess, a very one-sided presentation.\nThe ones that I've seen, yes, and I think that's because they were exonerating there wasn't\na victim by these individuals, but I don't know if the current process forecloses that\nfrom happening.\nThat's a question I'm not sure of the answer, but as I mentioned to you last time, this\ndoes have an invitation to the prosecutor in the district attorney or the attorney general\ndistrict attorney so if that person wanted to participate and object to the\nrequest for compensation they would be unnoticed and would be able to do so\nwhich I think is another good safeguard. That's current right now that you that\nthe person who was harmed or allegedly harmed by that alleged person perpetrated\nthey can appeal bringing to the attorney they could object. They could object.\nRight now right so you know that that the very line of the question in\nin comment and that, that's the very reason I think we need the kind of commission that\nwould sit in judgment and look at it because otherwise, just as he said, you're gonna have\nthose feelings going back and forth and people speculating and have another jury kind of\nsetting again, I suppose, so I would suppose that's why we want to move towards the kind\nof unbiased, whatever that is, unbiased commission. But anyway, any more comments about it, some\nThat was all.\nMr. Chair, would you like to ask the committee what they think about the current range,\nand even if Mr. Representative Holcomb could highlight for us again, I think you said\nthe average was $75,000 a year nationwide.\nAcross the country, yes sir.\nAnd you said the high end was in the 200-200.\nWith medical care.\nconsideration given to the medical care piece in this. I'm ultimately just to be transparent\nthat the $50,000 number to me assuming that we do reach the point where there is exoneration\nis pruned. The $50,000 number to me it seems really not as long to put too many adjectives\non this but I'm just wondering if it shouldn't be higher and if we shouldn't have our floor\nbe the average with the with the ceiling it's a little bit higher than we currently have.\nSenator Dullesaw, I would support you in that 100%.\nWe tried to make as flexible as possible\nto build the political consensus to pass,\nbut I see this very similarly of just the devastation\nthat it imposes on somebody to lose that much time\nand not to be able to invest in themselves,\ntheir career, et cetera, it's real.\nThe harm is real.\nAnd in some states, Mr. Chair, for your mind,\nin some states they had education incentives,\nsuch as scholarships and things this nature,\nto attempt to help the individual transition back into,\nas normal as society is today,\nbut normal society, is that right?\nYes, sir.\nEveryone has a cash, cash is the baseline,\nand then the question is, where along the spectrum\ndo you land in terms of the cash payment?\nAnd then it's a very, very small,\nminority of states that have health care\nor other type of services to help them get started.\nDoes any state cap legal fees?\nI don't know that off hand, I'm not sure if any of the other experts know.\nMy general understanding is that legal fees are included because of the sense that if you're\nwrongfully charged, as a practical matter, most of these people are going to have public\ndefenders, so there's not going to be legal fees, but let's just say, and this was a\nscenario used in the house when we discussed this was let's just say that there\nwas prosecutorial misconduct it's rare but it does happen you know you didn't\ndo it you have resources you invest your resources but you don't get a fair\ntrial because there's prosecutorial misconduct the sense was that that should\nbe compensable because you had you wouldn't have had that outlay of\nmonies but for the bad conduct so that's why we left it in but practically\nspeaking, I don't think that there will be a lot in attorney's fees, just because most\nof these individuals are going to be getting, as I mentioned, public counsel.\nThank you.\nAnd I've looked at several of these, including Senator Dozal's home state, which I won't\nmention.\nI don't want to embarrass him.\nAnd say.\nAnd say Illinois out loud, but also looked in Florida and other places.\nAnd so I do see where some, like you're talking about, have capped a few expenses and things\nof that nature.\nI appreciate it, Mr. Chair, when the time is right.\nYes, sir.\nYour time is right now.\nPlays of the committee.\nMr. Chair, I would move that we pass LC480912S is in Sierra.\nAs amended.\nAs amended, yes, sir.\nYeah, here, a second moment.\nCan I make a further motion to amend?\nYes, sir.\nI will make a motion to amend online 147\nby striking $100,000 in increasing replacing it\nwith $120,000 and striking $50,000\nand inserting it as placed $60,000.\nCan we read it back for the record, Senator Dole?\nGive me the line again.\nLine 147 would then read may include $120,000 per year,\nbut shall include no less than $60,000 per year.\nMoved it properly, seconded it, all in favor, sigh.\nNow, we have passed the bill as amended by itself, you know, as amended.\nAll in favor say aye.\nOpposed?\nAye.\nAye.\nAye.\nOpposed say aye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nAye.\nHouse resolution from 48.\nThank you.\nMr. Chair, would it be proper time for motion?\nYes, sir.\nYes, sir.\nLet me, you want to make the motion before she presents.\nI believe it's a mover if I make the motion.\nPlease do the committee.\nMy motion, Mr. Chair, having read through all of the resolutions, reached out to the\nGeorgia Bureau of Investigation on one of the cases reached out to other law enforcement\nresources on the other cases.\nOne of the case out of my district, I had already received information from the prosecutor\nin that county.\nI think we now understand that the system is not set up to deal with these properly.\nSo my motion would be to table the three resolutions until the committee has proper time to get\nthe resources and read through the resolutions along with evidence and statements from the\nlaw enforcement agencies in particular to understand these cases because as we mentioned\nin the last committee meeting there is a discrepancy on what the definition of exoneration\nare, and so I think for us to make an educated decision\non these resolutions, we must be educated on these three cases.\nSo my motion is that we table the four resolutions.\nAny on readiness on that particular motion?\nI'm sorry.\nSenator, see?\nWhy do you have a second?\nI'm sorry.\nI'm sorry.\nI can't.\nIt's my ears more than your ears.\nAnd this is my second time in this committee on these, and I think we are intelligent enough\nto have heard everything so far, and what we're, I disagree, yeah, okay, but let me\nsay this, before we accept it, and number one of this, that's four.\nThat's right.\nYou said three.\nI start out for you.\nOkay.\nThere are four resolutions for compensation.\nLet us get a brief comment from everybody.\nAt that time, we'll vote it all at once with the will of the committee, I'll accept\nyou a motion then.\nCan we have a brief date on four, 48?\nI'm sorry.\nYou would give us an update on 48, Miss Advent.\nThank you, Mr. Chairman and members of the committee.\nHouse resolution 48 and 49 are related, as in the last committee I mentioned, Mr.\nStinch, call me Mr. Wolflok or co-defendants who were acting in self-defense.\nThey ended up in a trial convicted for a crime.\nThey did not commit their statements of self-defense were consistent throughout, supported\nby physical evidence.\nThere was an eyewitness who changed their testimony multiple times.\nThat seemed to be the basis of the prosecutor moving forward the first time.\nThere was a witness found who was thought to be dead, who cooperated, the self-defense\ntheory.\nProsecutor would not have a new trial.\nAnd to Senator Robertson's point, I understand the concern about how these situations\nare vetted.\nAnd I also want to make clear to the committee that the compensation advisory committee, they\nThey don't decide, yes or no, the exoneration was right or wrong.\nThey accept that the court, or a prosecutor that a court has decided there should be a\nnew trial in the example of my resolution individuals, then the prosecutor did not move forward\nand did an all-prosmining, there was no case.\nThey don't go behind that decision because they recognize that courts and legal professionals\nare involved in them.\nthey are deciding solely is whether the agency that is attacked for lack of a better word\nby the resolution, usually that's GBI or law enforcement or Department of Corrections,\nthey make a determination that the exoneration where the wrongful conviction had nothing\nto do with Department of Corrections, for example, that's what happened in my situation.\nAnd we wouldn't contend that they did, but they were rightfully exonerated.\nAnd so the advisory committee, while they're not made up of experts, and it's not a yes\nthat evidence said this or no, it didn't, they are saying, they accept the exoneration\nand they are trying to decide whether the Department of Corrections, for example, is responsible.\nRepresentative David, would you go back one more, who, regarding the exoneration decision,\nhow does that come about, just in a nutshell, if you will.\nSo in the situation for Mr. Sinchkolma, Mr. Woolfolk, they had this new witness come\nforward and the defense attorney asked to present that new evidence.\nThe prosecution said, no, we won't agree to a new trial for you to present this.\nSo they had to move for a new trial, which ultimately made it up to the Georgia Supreme\nCourt.\nAnd the court's accepted it.\nAnd the Georgia Supreme Court said, yes, you should have a new trial.\nAnd then when it came time to have the new trial, the prosecutor in Fulton County said,\nI have no case.\nSo that's the exoneration.\nOkay.\njust to be just to be clear when we talk about exoneration if Fulton County had\nchosen to they could have retried this case correct this okay I mean I guess\nlogistically sure properly under the law no and that's why they didn't\nbecause they didn't have evidence well they they had the evidence that the\nbullet holes in the roof of the car and the the victim female sex worker was\nwas shot in the head through the roof of the car.\nBallistic showed that, which I think,\nand if you look at self-defense,\nwhen the individual disengages from the scene,\nthen the argument of self-defense stops.\nI think what the court was looking at\nwas the denial of the court where the appeal was made\nto setting up a hearing.\nAnd the George Spring Court said that the lower court aired\nand not allowing the hearing for the evidence,\nbut that if we're looking at physical evidence,\nthe lady got into an argument\nwith the individuals in the apartment, she was slapped,\nshe left, she went down to her car,\nsaid she was gonna get her stuff\nstated by one of the co-defendants.\nShe went into the car, got a revolver out.\nThere's conflicting statements between the two co-defendants as to how many shots she fired\nalong with, I think, Mr. Harris may be in or a witness there.\nAnd then the other two individuals went and got their guns and started firing back.\nAnd then, of course, Mr. Walfolk, I think, said his gun jammed, and that was proven to\nbe false based on testimony of others.\nbased on shell casings found on the ground outside of the apartment and so and I\nunderstand age and I know you're the professional but age does change the\njudicial process because evidence fades witnesses memories fade and all of\nthis and sometimes the courts are placed in precarious situations or excuse me\nprosecutors are placed in precarious situations that when they look at the\ndate of a case and realize the overall overwhelming responsibility of going\nand finding all the witnesses and doing all this and then they know the\nindividual has been incarcerated for 10, 15, 20 years. That has an impact on\ntheir ability to prosecute the case. So while I understand and I use that in a\ncase that's on another one of the requests, is that they basically have to say, you\nknow what, we can't retry this case, so they choose to know a process, and I respect\nthat.\nBut that is my concern, is that these two individuals and the victim did all have guns,\nand they were firing, and if you look at the evidence as presented in court that shows\nis what goes on, I mean, I think the most critical\nin me knowing what standard I was held to as a law\nenforcement officer, then I know that if I would have\nfired around through the roof of a vehicle after\ndisengagement, I would have had a really hard time\njustifying that use of force at that level.\nAnd so my concern is in talking about the commission\nis that it's an unbalanced process correct.\nAnd these right here are based on an unbalanced process.\nAnd so while I can't say that I would not support\ngiving any of these things out,\nI do disagree with my fellow Senator\nthat having two committee meetings\nwithout all of the information has not educated us.\nIt has not.\nThe stuff I received from the GBI,\nI received this morning because my intern\ndrove to the GBI and picked it up.\nAnd I've just started the process on that.\nAnd that's my concern because the monies\nthat we're going to hand out\nDo you not come from, it's not us chipping in a fair amount up here.\nThere's 11 million Georgians responsible for us making the right decision.\nAnd while I applaud what you're trying to do, I absolutely support changing the structure\nof this.\nSo it is more fair and equitable.\nI just feel at this point, based on the evidence I've read and the rest reports and stuff\nlike that, that I have an issue with the word exoneration.\nAnd so that's my only thing.\nAnd I have a tremendous amount of respect for you,\nRepresentative Evans.\nI've followed your career.\nI just don't necessarily agree with the definition\nthat this commission is using for exoneration.\nThank you, Senator.\nAppreciate it.\nAnd briefly, Mr. Chairman,\nthe physical evidence always supported self-defense.\nAnd the eyewitness that was thought to be dead\nthat the Fulton County District Attorney refused to hear from\nsince 2009, all the way until now,\ntestified that she was still shooting. That's why they went in and got guns and\nwhere those bullets went when they were trying to duck and keep from getting hit\nwhere they might have gone. I couldn't say but she was shooting out the window.\nShe was shooting toward them.\nWhen you and Senator Robinson are doing right now, doing the court thing again\nall over again. Well, agree, Mr. Chairman. And one thing I wanted to add, the court\nheard all this the court and the court decided that witness should be heard\nthere should be a new trial and also I would add that I might not have\nmentioned this in the last hearing I can't remember but the Fulton County now\nhas a conviction integrity unit they looked at this these were the first\ngentlemen exonerated under that unit so this wasn't just looked at by the court\nsystem which in and of itself is a multi-layered process and then looked at\nagain by prosecutors who I believe if there was a shred of evidence would have\nmoved. This is why I'm more than ever. We need the first bill to be passed on.\nAbsolutely. It's just an eternal mission to you did it. You didn't do it. I mean,\nit never ends. So I think at some point we don't have to go with what we got\nperhaps the best thing we did was pass that first resolution today so we\ncan get to where we feel comfortable. So okay. And then you don't have to get\ninto law enforcement against,\nseeming to be against the other guy and all that stuff.\nAgreed, Mr. Chairman.\nThe last thing I'll say is that,\nunless you want me to keep talking, I can talk forever.\nI need you from the other people.\nAbsolutely.\nThank you for representing them.\nI don't want to be abusive of your time.\nSure.\nLet me hear from the other two people coming up.\nThank you for and will.\nAnd then I act on Senator Robinson's motion.\nThank you, Mr. Chairman, members of the committee.\nAnd we've got to move for ten more minutes to represent the Buckner and Buckner and\nReps and Houston come up at the same time and make your final comment before we act\non the motion from Senator Robinson.\nGood afternoon, ladies and gentlemen, I'm Debbie Buckner and I have HR 55 and HR 74\nI kind of feel the same way that Representative Housen just said, I'm not an attorney and I was approached by law enforcement officers who were from the new area that I was drawn into with redistricting.\nI knew nothing about the case and so I did what I thought was the appropriate thing based\non the process that we have today when we are asked to carry a compensation resolution.\nI visited with the detectives, the police chief and I also met the person who had been\nexonerated and released from prison and I talked to his supervisors at his job at the\nhumane society where he works for the city.\nTo me, this is the most stressful bill\nwhere anybody in the house or senate will ever have to carry.\nEvery day we're up here making decisions about groups of people that are nameless, but\nthis is a person, this is a name, and this is someone I met, and this is someone who\nwent through being falsely accused at a time when they were desperate to find someone\nthat had committed some crimes and he just happened to be a in his own words, simple-minded,\nuneducated man that was picked up and was accused.\nAnd he had one trial that lasted one day with a set of jury and I most speeded up, I promise\nI know people will come in and say eight minutes they have.\nThis man has sat in jail for over 20 years.\nI'm frustrated because I started on this hoping to help a constituent who has gone through\nthe extraordinarily difficult process to be exonerated, to be released from prison, to\nbe told he was finally heard that he was not guilty of what they accused him of. He\nhad maintained his innocence. If we are going to use DNA evidence to identify those who commit\ncrimes, we've got to use DNA evidence to release people from crimes that they were falsely\naccused of. Okay ma'am at this time would you make your final comments as well. And I'm\nsorry about the time but it's just the time of season passing in the Capitol.\nI was talking about the claims advisory board not receiving information from the prosecutor\nor the victims that's actually factually inaccurate. The claims advisory board did seek\nout and does seek out and it's actually written into the rules and regulations of the claims\nadvisory board that they have the power to seek out.\nAnd in this, in Mr. Talley's case in particular, the prosecutor submitted a letter as well\nas at the claims advisory board reviewed that as well as the press release that was gone\nout at the time and the letter from Chief Decmar indicating that he believed that Mr. Talley\nwas innocent.\nSo these are, in a sense, cases, all four of these that are being brought before you,\nand postponing them for a year leaves these people that have been in prison for decades,\nnot earning any money, not establishing any credit, not getting any social security payments\ngoing in, coming out with absolutely nothing, Mr. Terry Talley works for the city, and he\nmakes $391 a week postponing this in his case, in all of these cases, is detrimental to people.\nThese are lives of people who are wrongfully convicted, who are trying to get reestablished\nin the community.\nI recognize the need of a strong bill and it's fantastic that we passed out Representative\nof Holkins bill.\nHowever, we should not kill these other ones,\nbecause that could solve the problem next year.\nOkay, I've got to cut it off right away.\nA few minutes ma'am, I'm sorry about this.\nIf you can, a few comments and then we got to vote.\nThis is-\nI just did, we will be very brief.\nYes, but-\nSo thank you, I'm here again on House Resolution 70\non behalf of Mr. Devanya and men.\nI'm sorry Senator Dulles-Olly did not get\nto hear the presentation in the earlier committee.\nMr. Inman served 23 years in prison for a murder\nthat he did not commit, and we have talked a lot\nabout exoneration, and we have talked a lot\nabout the benefits of bringing in experts.\nThe great thing in this case is that we have\nthose voices in this case.\nIn 2019, the presiding Justice Namios,\none of the most highly respected jurists\nand the former prosecutors said about my client,\nMr. Inman, during my decade of service on this court,\nI have reviewed over 1,500 murder cases\nin various forms.\nIn those cases, trial courts, habeas court,\nand this court, through a Pell Review,\nhave occasionally granted new trials to defendants\nwho appear not to be guilty of crimes\nfor which they are convicted.\nOf the multitude of cases in which a new trial\nhas been denied, Inman's case is the one\nthat causes me the most concern\nthat an innocent person remains convicted\nand sentenced to serve the rest of his life in prison.\nLet justice be done.\nHe closed his opinion.\nThank you very much and I apologize for the time,\nbut it's at the brust of this committee\nthat we have a vote pending.\nAnd the motion is to table the issues for the Romanian bills\nuntil next meeting, which is obviously\ngoing to be next year.\nAll in favor say, I pose like raise your hand,\notherwise I'll notice.\nAll in favor raise your hand on the motion,\nthe favor of the motion.\nI'm not raising my hand, I was asking a whole year, okay.\nOpposed like son, what do we have here?\nIt's a tie zone here.\nTie zone here, what is it, two to two?\nTie zone here, two to two to two to two to two to two.\nI would vote with my colleague right here because he said\nthat we didn't have enough time, so we'll,\nand we have no time to actually move on anyway,\nbut I believe.\nI'm not. Yeah, it's too late. Yeah, I'm the two users. Let's say again. What is the motion right now?\nI mean, what what posture are you in? They're just two years to come back after you've been released. No, man. It's\nit's next session. Am I right about that? Yes, it goes all. Did you give us a platter? I guess four\nresolutions have been tabled in order to really give this the time that it deserves.\nI would suggest that we find a time during the summer if we can get the documentation\nSenator Robertson has to each of the members of this committee that we would then take\ntime over the summer review and that we would take action upon this whichever direction\nwe go immediately upon returning the start of the next session.\nSo you voted with him.\nBut the vote is 3 to 2 in it.\nIt would be a 3 to 2 in it.\nFrom the same emotion like the judges over at the court here\nand superior courts should I get the same information you get?\nYeah, I would.\nThe vote is 3 to 2 that we were table anyway.\nWell, I just wanted to say if the court has the same information\nyou made, we're dismissed.\nThank you.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:13:57.294868+00:00"
}