{
  "video_id": "5GNX2WGX2mM",
  "url": "https://www.youtube.com/watch?v=5GNX2WGX2mM",
  "title": "Protecting Women in Georgia's Courts: Domestic Violence Offender Registry & Menstrual Data Privacy",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript on the Protecting Women in Georgia's Courts: Domestic Violence Offender Registry & Menstrual Data Privacy bills:\n\n**Overview**\nThis session focused on two bills aimed at protecting women in Georgia's courts and ensuring privacy for menstrual data. The discussion covered a domestic violence offender registry and legislation to restrict the use of menstrual tracking data.\n\n**Key Actions**\n**HB 1142**: Establishes a persistent domestic violence offender registry maintained by the GBI, where offenders would be listed after a second conviction or completion of a diversion program.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- Rep. Lisa Hagen introduced HB 1142 to tighten how Georgia handles domestic violence offenders, citing concerns about public safety and protecting women and children.\n- Rep. Stacy Evans discussed her co-sponsorship of HB 460, which would create a confidential line for attorney-client communications for incarcerated individuals.\n- Rep. Evans also spoke about the Menstrual Data Privacy and Protection Act, which aims to restrict the use and sale of women's menstrual data, especially in light of the overturning of Roe v. Wade.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nNo adjournment time or next session date given.",
  "transcript": "We're going to look now at legislation\nto help protect women through the court\nsystems. Joining us is Republican\nRepresentative Lisa Hagen of Lions. She\nis chair of the House Rural Development\nCommittee. Her other committees include\nAppropriations, Agriculture, and\nConsumer Affairs, and Transportation.\nAlso here is Democratic Representative\nStacy Evans of Atlanta. Some of her\nHouse committees include Appropriations,\nJudiciary, Retirement, and Rules.\nWelcome to lawmakers to both of you.\nThanks for being here. All right,\nChairman Hagen, you have HB 1142. It\nwould tighten how Georgia handles\ndomestic um violence offenders, the\noffenders in particular. How did you\ncome up with the need for this bill?\nWell, actually for me it was a young\nlady that that I worked with at the\ncapital who first brought the idea to me\nand we also heard that there is a young\nwoman down in Savannah who started a\npetition because she uh heard about the\nbill that just went to effect, the law\nthat just went to effect in Tennessee in\nJanuary. So it's the first in the\ncountry like it. And so if we can\naccomplish this here in Georgia, we\nwould be the second. And so it just\nseems like something that is timely.\nWe're concerned with public safety.\nWe're concerned about families, women in\nparticular, and their children. And so\nit just seems like um something that\nmakes good sense and is it's the right\ntime for it.\n>> Okay. We'll dig into it a little bit\nmore. Representative Evans, you're\nco-sponsor on HP460, and that would ex\nuh exclude from evidence certain\ncommunications made between attorney and\nclients with the client when the client\nis in prison. So, tell us how you got\ninvolved in that one.\n>> Sure. So, House Bill 460, I think,\nreally sets the record straight to how\nmost people thought it was. Um, when you\nask most folks uh about this bill and\nthey say, \"What does it do?\" And we say,\n\"Well, it protects conversations between\nfolks that are in prison and their\nlawyers.\" And most people look shocked\nand say, \"I can't believe that's not\nalready the law.\" So Esther Panic is the\nlead sponsor on this. It's bipartisan.\nUh chairman Tyler Paul Smith is also a\nco-signer. And this just sets back what\nwe think is probably the policy that the\nlegislature always meant it to be that\nwhether you're incarcerated or not, your\nconversations with your lawyer are\nconfidential. And so it would create um\nan unrecorded line because right now all\nthe calls that are um going in and out\nof the prison are recorded. Um, and this\nwould set up a system where you have a\nspecial line for conversations with your\nattorney.\n>> So, it's bipartisan.\n>> Bipartisan.\n>> Okay. We'll talk a little bit more. Our\nChairman Hagen, the uh bill would link\ndiversion programs um to future\naccountability. Explain what the\ndiversion programs would be all about.\n>> Sure. Well, currently a prosecuting\nattorney can agree that someone who is\ncharged with domestic violence offenses\ncould go into a diversion program and\nupon completion of that program um he or\nshe would be um it would not be a\nconviction. However, um in the current\nlanguage of this bill, that would be\nincluded as a first offense. The way the\nthe language is written currently is you\nwould not appear on this domestic\nviolence offender registry until your\nsecond offense. However, the exception\nis made for someone who's who's been\nthrough the diversion program that that\nit's not a it's not a conviction, but\nthat that second encounter would would\nrequire them to appear on the registry.\n>> So, talk let's talk about the registry\nthen. What exactly would it be?\n>> Sure. This this bill would create a\npersistent domestic violence offender\nregistry that would be maintained by GBI\nand\nupon the second conviction or the\nexception you just spoke of, a person\nwould appear on the registry. And the\ngoal is just to create uh another\nresource for people as they make\ndecisions about who they want to\nassociate with and um who they want to\nbe in relationships with. I know that\nthere are people who have been in\ndomestic violence situations and then\nthey the person maybe is charged that\nthe person moves into a different\ndomestic violence situation and another\nwoman or man is affected by it. So\nthat's what you're trying to prevent.\n>> Exactly. That's what we're trying to to\nprevent.\n>> Okay. All right. We'll get into that a\nlittle bit more. Uh let's talk a little\nbit about another bill. you're a signer\non um Representative Micaia McQueen's\nbill, the Minstal Data Privacy and\nProtection Act. What is the reason for\nthat legislation?\n>> So, when Row versus Wade was when that\ndecision was overturned, obviously that\nwas an earthquake across the country and\nrights that women thought were\nfundamental, our privacy, our right to\nmake decisions, it rocked. And so across\nthe country, you've seen a couple of\nstates, Georgia is not one of them yet,\num that has passed bills to try to make\nsure that um when women might want to uh\ngo across state lines where abortion\nlaws are less restrictive, that any kind\nof uh period tracker, menstrual tracker,\novulation tracker, that that information\nwouldn't be used against them to\npotentially be prosecuted in their home\nstates where there may be more\nrestrictive laws. So that's sort of why\nit started. But I think there's also a\nmore fundamental maybe more simpler\nthing to think about. We all use apps.\nWe all use technology and technology is\ngreat till it's not. Uh and this is just\nanother way to make sure that technology\nis useful to those who want to use it to\nmake their life easier but that it\ndoesn't become a weapon against them.\nAnd so this bill also would say that um\nuh apps and others that track this\ninformation that they can't sell it and\nthat if you decide you want you want\nthat information wiped from the system\nthat they have to do that right away\nthat it wouldn't be subject to third\nparty subpoenas and things of that\nnature. Just a a way to protect privacy\nin a world where we feel like less and\nless um is sacred and private. and um\nvery happy to support uh Representative\nMcQueen who's uh spearheading this\nlegislation this year and also\nRepresentative Park Cannon who's um\nspearheaded it in in prior sessions.\nThis is um something that has been\ntalked about for a couple of years now.\n>> And so this the there are probably\npeople who don't recognize that the apps\nthat they may use for menstrual periods\nand that kind of thing that people can\nget your information if you're in\nanother state. there have there been any\npeople prosecuted or I guess I'm just\nunfamiliar with it.\n>> Well, there are only um a few states\nthat have passed laws like like the\nmenstrual data privacy act. Um and it\ndoes have uh provisions in it for civil\nmonetary penalties, for example, for app\ntechnology corporations that might\nmisuse the information that might sell\nit. Um but as far as criminal\nprosecutions for misusing folks\ninformation, not so much. But it is it\nis very real. Like right now there are\nessentially bounties out on women who um\ntheir suspicion that maybe they missed a\nperiod and they went out of state to get\nan abortion and and so much so that if\nyou are trying to serve a third party\nsubpoena right now in certain states uh\nto get I mean it could be innocuous as\nphone records um you have to and this\nhas happened in my law practice you have\nto sign an affidavit that only in a few\nstates that have done this um that you\nhave to testify in an affidavit that you\nare not seeking information to use\nagainst a woman who might have been\nseeking to um exercise her reproductive\nfreedom rights that might exist in other\nstates but may not exist in her home\nstate. So this is newer because Roie\nWade being overturned um is is still\nit's been several years now but it's\nstill a new phenomenon and I think the\nlaws are trying to catch up to make sure\nthat as much as possible we are\nprotecting women in this new\nenvironment. Okay, we'll keep up with\nthat bill. I want to ask you, U, Chair\nHagen, would would names stay on this\ndomestic violence registry forever?\n>> No, they wouldn't. That's a good\nquestion. Um, the way it is written\nright now, upon multiple convictions or\nadditional convictions, that time would\nwould increase. But after a period of\ntime with no additional convictions for\ndomestic violence offenses, that person\ncould be eligible to roll off of the the\nregistry and be removed by uh GBI.\n>> Yeah. So GBI would keep all the records\non all of this all over the state. So\n>> that's right. Right. Upon a conviction,\nthe clerk in the county where the\nconviction occurred would submit that\ninformation to the GBI and they would\nmaintain that registry.\n>> What kind of reaction are you getting? I\nam getting very positive reactions to\npeople I from people um victims,\nsurvivors, uh advocates, um directors of\ndomestic violence shelters and sexual\nassault centers are have been very\nsupportive. Um my fellow colleagues in\nthe legislature have been very\nsupportive about it. Um it seems like\nit's especially with the advent of\ndating apps, things happening online, it\nseems like it's the right time to take\ncare of that.\n>> Well, I want to thank you both for being\nhere. We'll keep up with your bills.",
  "updated_at": "2026-02-14T14:41:47.690632+00:00"
}