{
  "video_id": "5hXfufW_cuw",
  "url": "https://youtu.be/5hXfufW_cuw",
  "title": "Georgia House - Day 24 (2026-02-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 24,
  "video_date": "2026-02-26",
  "duration_minutes": 102,
  "summary": "Here is a summary of the Georgia House session on 2026-02-26:\n\n**Overview:** The session featured a prayer by Pastor Levi Rozier, who delivered a sermon emphasizing the importance of obeying one's duty and mission, rather than being distracted by one's own agenda. The House also heard a report from the Committee on Information and Audits.\n\n**Key Actions:**\n- **HB336**: No description provided\n\n**Bills Introduced (First Reading):** None noted\n\n**Notable Moments:**\n- Pastor Levi Rozier gave a sermon on the importance of obeying one's duty and mission, rather than being distracted by one's own agenda.\n- The House heard a report from the Committee on Information and Audits.\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** Quorum was present, with all members reporting to their assigned seats.\n\n**Adjournment:** The session adjourned, with no mention of the next scheduled session date.",
  "transcript": "you you the is election room 341 and take your assigned seats. All members will report to their assigned seats. The clerk will ring the bell. All right, we're about to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. Good morning everyone. Welcome to Friday. It's going to be a long day though. So settle in and we're going to get some work done today before we go home late today. We will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 146 House District Chairman of the Ways and Means Committee, Chairman Shaw Blackman. Chairman Blackman. Thank you, Mr. Speaker and fellow members. I had the pleasure today of introducing a friend in a real blessing to Middle Georgia Pastor Levi Rozier. He and his wife have created the ministry at Harvest Builders Worship Center in one of the Robins. They are on a quest of putting together an army of builders and believers in equipping them to build their communities and homes and so much more. And I'll just tell you, he has really been a great leader, a great healing presence during the past year with COVID and everything and a true blessing. He and his wife to our community and it's real exciting for me to be able to bring him for you this morning. Without further ado, I present to you and is my honor, Pastor Levi Rozier. Good morning. Thank you, Speaker of the House and Representative Shaw for all the venerated guests, all of you for allowing us to members in the house today. Such an honor to be here as I stand as a priest, as a citizen and friend, and just a lusterous space today. It's such a powerful moment for me and for a family, for Georgia as a whole. Georgia has been such a vital part of our country for years and years to come and in this moment right now. I spoke on messages of a few sons ago at our church, precious on the Black History Month. I started reading and acknowledging it about say something, let's you forget. Say something, let's you forget. Taking that narrative from the scripture and the Bible said that the redeem the Lord say something. Now I used that to equate that to now to a place where we stand where I must obey, let's not forget. I say something calls me to remind me where I come from, why I'm involved in, why I so vital what I'm in. My obedience also speaks to that also. The great Charles Wesley and now part of our African American churches now in prison, I bet this construct called a hymn called the Charles to keep I have. The thing about all of us, we have a Charles, I have a Charles for my city, for my congregation, you have a charge for a citizen, we have a charge in Georgia to bring the good toward people the best that we know how it has to be, we must do. DeRoum in 612 says this as God had allowed his people to come out of a hard place, he told Moses to remind his people of this one thing. He said beware unless you forget the Lord who brought you out of the land of Egypt from the house of abundance. God put them in a position where he brought you out but we as human being, if we're not careful, we'll tend to forget. So God created stuff like Sunday, He created stuff like the Sabbath, He created stuff like the feast to remind us not to forget. We didn't gather, if you didn't gather here at the house, if you didn't gather there as a group, we tend to forget some of the things God has done for us. There was a guy in a Bible named Saul who was a king who God had allowed to take position of leadership. He had a charge to keep, he had a mission to do and there is time where we want to do for God beyond God's platform and then if we're not careful, we encorcape my charge with my own agenda. So Paul in 1st 75 or 1518, I got five minutes and I got three minutes and my preachers, I won't try to go into this tech as I should but just a backdrop of that tech, Paul Saul become the king because they like them, they want the king. Saul become king, Samuel is a prophet. Samuel's God, tell Saul, Saul, I need you to go take these certain people out, don't buy nothing, don't take nothing. Here's your charge and here's what I want you to do. What Saul does to opposite, he goes there, he listens to some of his constituents and he begins to take back some of the good of that land. Saul comes back and then Samuel walks up because we all need somebody to check us every now and then somebody to just be accountable for someone just to say, I like you, you the king but that might not be the way of doing thing. But Samuel was that guy, he was the prophet in the era of Saul. He comes to Saul and says, what did I, what is that I hear, what is that I'm hearing in my era that don't sound right. Saul said you know where the people spoke and they liked the good and so I know God gave me a charge and a mission but I thought it'd be best, it's bringing back some of the good and God would be okay because it looked good on paper. He said, I know but that was not your mission. That was not your charge. Your charge was to go destroy the land and come back and then celebrate God. I like what Samuel said, he said Paul, Saul, tell you something, obedience is better than sacrifice. My obedience, he said, I need you to obey unless you forget, continue to work out your charge and your mission that I have assigned you to and just because you encorcage your vision, your plan, your thoughts, your idea, your concept, it does not negate the charge that you and I have as citizens, you and I have as a leaders to still carry out the charge and the mission that God has assigned all of us and I love how Charles Wesley and now the first time I heard this, this is him was not by Charles Wesley, the first time I heard this him I was at my grandfather church in Montrose, Georgia and I was on the Baptist church and at that time with the young boy I had no idea what they were singing until I got older and realized my own charge. He said the charge to keep my hand, he said God to gruel and fire. This and those things I have to take on my charge, my mission and that's what I'm encouraging all of us as constituents, as Georgian to take on our charge, take on our responsibility. Every time I obey, I'm telling myself I will not forget, I will not forget. Every time I say thank you, it reminds me, does how far God has brought me, I encourage you heart, I encourage your mind, I encourage your spirit, I speak blessing over you to obey, bless you forget. Let us all pray. Father God today we thank you for this moment and we thank you for this space. God is by your omnipresent, your love us to be here, to be a part of the great assignment on our lives. All of us got a charge. God whether you're representing with your mom or dad or father, doctor or lawyer, whatever that is, we have a charge. We need help to obey. Sometime we get it twisted, but God we ask for your fresh grace on the members, fresh grace on the work of those who assign to help us carry out this charge. I speak your fresh honor and grace over our lives this day in Jesus name. Amen. That's it. Praise. I would have led you to this land of the United States of America and to this public relationship stand when they should not be indivisible. So my goodness. That was standing job. Doorkeepers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, solids and small are powerful tools. Small is the way to solve many problems and solids is the way to avoid many problems. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Ms. Burns, on a 59th, whose following be established as the order of business to the first part of the period unanimous consent, the introduction of bills and resolutions for a reading and reference files of bills and resolutions. Second reading of bills and resolutions for courts of standing committees. Third reading of passage. Uncontested local bills and resolutions. First reading of reference of set of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? First reading of bills and resolutions. The clerk will read. House Bill 638, Mr. Schoggins, the 14th Kelly, the 16th and Campbell, the 15th. Bill Nitton, the act to amend chapter 14 and the 15th, the physical to Georgia, and it's headed relating to Sbestos and silica claims. Special Committee on Access to Civil Justice. House Bill 639, Mr. Schoggins, the 14th, the 16th and the 15th. Bill Nitton, the act to amend chapter 51 of the physical to Georgia, and it's relating to Torx. Judiciary. House Bill 640, by the way, is on a Smith, the 18th, followed, the 32nd, the 22nd, the 23rd. Jasper, the 11th, the 68th, and others. Bill Nitton, the act to amend, the 16th, the physical to Georgia, and it's related to crimes and offenses. Public safety and homeland security. House Bill 641, by the rest of Williams, the number 45th, Chaupe, the 738, Ayerhardt of the 36th, Bill Nitton, the act to amend, part 8 of chapter 8 of Article 14 and Title 44, the physical to Georgia, and it's related to the leans, the hospitals, and nursing homes. Judiciary. House Bill 642, members of the Bernal, the 77th, the 76th, based on the 63rd, to build the title of the act to amend, Article 2, chapter 3, and Title 6, the physical to Georgia, and it's related to the powers of local governments. Judiciary. House Bill 643, members of the Bernal, the 77th, the 76, based on the 63rd, building the title of the act to amend, Code Section 485, 41, the physical to Georgia, and it's related to property tax exemptions. Ways and means. House Bill 644, by the rest of the dryer, the 59th, one of the 89th, Jackson, the 64th, Scofield, the 60th, Roba Show, the 48th. It'll be Title Act to amend, chapter 3, and Title 20, the physical to Georgia, and it's related to post-secondary education. Higher education. House Bill 646, by the rest of the clan, the 75th Jones, the 25th, Belton, the 112th, Eucalyth, the 136th, and Couch, the 50th. It'll be Title Act to amend, Part 4, Article 6, chapter 2, and Title 20, the physical to Georgia, and it's related to financing, and the Crawley Basic Education Act. Higher education. House Bill 647, by the rest of the Smith, the 133rd Smith, the 70th, lost by the 111st, Williams, 145th, and Dickey, the 140th. It'll be Title Act to amend, Part 1, of Article 2, chapter 8, and Title 12, the physical to Georgia, and it'll be the general provisions for solid waste management. Natural resources and environment. House Bill 648, by the rest of the school field, the 60th, Beverly, the 143rd, Grover Show, the 48th, Hutchinson, the 100th, 7th, Scott, the 76th, and others, it'll be Title Act to amend, Title 30, the physical to Georgia, and it's related to handicap persons. Helping human services. House Bill 649, by the rest of the valley, the 40th, Wilkerson, the 38th, Canada, the 58th, and Maclown, the 105th, it'll be Title Act to amend, Article 1, chapter 7, Title 31, the physical to Georgia, and it'll be related to regulations, hospitals, and related institutions. Human relations and aging. House Bill 650, by the rest of the Canada, 58th, Limit the 99th. The claim to the 100th, the school field, the 60th, Thomas, the 39th, and others, it'll be Title Act to amend, Title 34, the physical to Georgia, and it'll be related to labor, and industrial relations. House Bill 651, by the rest of the gillier, the 160th, and the Stevens, the 164th, Bill being Title Act to amend, the act authorized the Board of Commissioners, and Chatham County. The Intergovernmental Coordination. House Bill 652, by the rest of the valley, the 23rd, Bill being Title Act to amend, Article 2, chapter 11, Title 15, and the physical to Georgia, and it'll be related to juvenile court administration. The juvenile justice. House of Resolution 236, by the rest of the valley, the 120th, Green, and the 150th, Perk, and the 150th, LaHood, and the 175th, and Gillier, and the 160th, Resolution, Creative and House Study Committee on Safe Staffing, and Nurses in Georgia. Human relations and aging. Senate Bill 22, by the center of Jones, the 10th, the building, Title Act to amend, the act, providing for a new Board of Commissioners from Henry County. The Intergovernmental Coordination. Senate Bill 105, by the center, to strengthen the 17th, County of the 18th, Thompson, the 14th, Anderson, the 43rd, lots of the 1st, Building Title Act to amend, Article 1, Chapter 10, Title 17, the physical to Georgia, and it'll be a procedure for sentencing and imposition of punishment. Judiciary non-sevel. Senate Bill 133, by the center, tippens of 37th, Dugan, and 30th, Gucci, the 51st, Bill of the 49th, Kennedy, the 18th, Building Title Act to amend, Part 3 of Article 8, Chapter 14, Title 44, the physical to Georgia, and Tate of Relay, and the Mechanics, and the Interior, men. Judiciary. Senate Bill 159, by the center, to Gucci, the 51st, Miller, the 49th, Berk, the 11th, Shin of the 47th, and Paine of the 54th, building, Title Act to amend, Chapter 2, Title 20, the physical to Georgia, and Tate of Relay, and the Elementary and Secondary Education. Education. Senate Bill 193, by the center, and Mulles, the 53rd, Harper, the 7th, Harvest, and the 15, Jackson, the 2nd, hatched the 40th, and the 50th, and the others, Building Title Act to amend, Chapter 5, Title 40, and the physical to Georgia, and Tate of Relay, and the Lauren Taxation of Property. Ways and means. Senate Bill 211, by the center, and the Summars, the 13th, Building Title Act to provide that future elections for the Office of Judge, and Pro-Bate Court of Christ County, shall be nonpartisan. Intergovernmental Coordination. That completes First Readers. Senate reading of bills and resolutions. The clerk will read. House Bill 618, by the represent of Reves of the 34th, and the 4th, the bill will be laid into execution and into the station. House Bill 619, by the represent of House of the 170th, the bill will be laid into Heritage Trust Program, House Bill 620, by the represent of the 33rd, all over the 82nd, and the 2nd, and the 2nd, and the 4th, will submit the 88th, and the 14th, they bill will be laid into Guardian and Ward, wrongful death, and bond. House Bill 621, by the represent of Wilson of the 80th, Evans of the 57th, Allen of the 40th, and the Scopeh of the 60th, the bill will be laid into insurance, House Bill 622, by the represent of Dickie of the 140th, the bill to him, and the act providing a new charter for the city of Fort Valley. House Bill 623, by the represent of Ridley of the 6th, Carpenter of the 4th, the second, the bill to provide a new charter for the town of Cajada. House Bill 624, by the represent of Taylor of the 173rd, the 151st, Campbell of the 171st, and Dukes of the 154th, the bill will be laid into a number of judges of superior courts. House Bill 625, by the represent of Roge of the 120th, the 30th, the second, lever of the 33rd, the bill to create the Tri-Counting Natural Gas Authority, House Bill 626, by represent Glantz, and the 75th, the voting of the 62nd, Smirer of the 135th, the every leave of the 143rd, he will leave the 136th, and others, the bill will be laid into elementary and secondary education, House Bill 627, by the represent of the hood of the 175th, we'd our 119th, lot of the 120th, the second, Roge of the 120th, Ridley of the 6th, the bill relating to athletic trainers, House Bill 628, by represent of the hood of the 175th, Petrie of the 166th, Cooper of the 43rd, Newton of the 123rd, Ridley of the 6th, the bill relating to central caregiver registry, House Bill 629, by represent of Newton of the 123rd, Hawkins of the 27th, Cooper of the 43rd, Friday of the 118th, Dempsey of the 13th, the bill relating to control of hazardous conditions, provincial disease and metabolic disorders, House Bill 630, by represent of Beverly of the 143rd, Mitchell of the 88th, Wilkerson of the 58th, Camino of the 58th, Bayes of the 63rd, and others, the bill relating to medical assistance, House Bill 631, by represent of Chalk, the 138th, Newton of the 123rd, Kelly of the 16th, lumps of the 12th, Stevens of the 164th, and others, a bill relating to the powers and duties of the Georgia Crime Information Center, House Bill 632, by represent of Bayes of the 63rd, Bruce of the 61st, Mets of the 55th, Bowdy of the 62nd, Jackson of the 64th, a bill relating to the speed detection devices and red light cameras, House Bill 633, by represent of Bayes of the 163rd, Beverly of the 143rd, Williams of the 168th, Spire of the 135th, Mitchell of the 88th, and others, a bill relating to kidnapping, false imprisonment, and related offenses, House Bill 634, by represent of the Mathis of the 144th, a bill to provide the judge of the private court of Wilkinson County, so service the magistrate of the magistrate of Wilkinson County. House Bill 636, by represent of Bayes of the 62nd, Hughley of the 136th, by now the 77th, Davis of the 87th, Shannon of the 84th, and others, a bill relating to general proficient relative to labor and industrial relations, House Bill 637, by represent of Friday of the 118th, Neil of the 74th, McLaren of the 51st, Davis of the 78th, Howard of the 124th, a bill relating to control hazardous conditions, preventable disease, metabolic disorders, House Bill 645, by represent of the 67th, Spire of the 135th, Powell of the 32nd, Hatchet of the 150th, workhides over the 157th, and others, a bill relating to access to medical cannabis, House Resolution 220, by represent of House of the 170th, a resolution honoring the life of Mr. Charles D. Rogers, and dedicating a rodent, House Resolution 220, by represent of the 170th, resolution honoring the life of Mr. Charlie D. Rogers, and dedicating a rodent, his memory, House Resolution 220, by represent Anderson of the 10th, Thomas of the 21st, Carson of the 46th, Dickie of the 140th, Washburn of the 141st, and others, the solution creating the House Study Committee on annexation, House Resolution 220, by represent Evans of the 83rd, Washburn of the 141st, Buckner of the 137th, Thomas of the 21st, Calshire of the 50th, resolution creating the joint study of the House Sustainable Materials Management on State Properties, House Resolution 230, by represent of Friday of the 118th, clock of the 108th, will enslave the 79th, Alexander of the 66th, will pour into the 51st and others, resolution urging the United States Congress to pass a constitutional amendment to establish voting as a right granted to all eligible United States citizens. Senate Bill 51, by Senator Thompson of the 14th, and a verdict of the 31st for a harboring of the 16th pane of the 54th, Roberts of the 29th, and others, are billed relating to educational programs under the Quality Basic Education Act. Senate Bill 89, by Senator Miller of the 49th, Albers of the 56th, future of the 51st Kennedy of the 18th, and a verdict of the 31st and others, are billed relating to elections on primaries, kind of bill 100, by Senator Watson of the 1st, Doug, and of the 30th Kennedy of the 18th, Miller of the 49th, and of the 48th, and others, are billed relating to general provisions, relative to the state government. Senate Bill 119, by Senator Harper of the 7th, goodnight of the 8th, park of the 11th. Mullis of the 53rd, Anderson of the 24th, and others, billed relating to permit required for burning wood stands, marshes, or other flammable vegetation, and exceptions. Senate Bill 148, by Senator Hussetler of the 52nd, Miller of the 49th, Butler of the 55th, Doug, and of the 30th, parents of the 42nd, and others, billed relating to the general assembly. Senate Bill 157, by Senator Couser of the 46th, Mullis of the 53rd, Lucas of the 26th, Butler of the 55th, Harpison of the 15th, and others, the billed relating to the Fair Business Act of 1975, through 2nd Readers. Reports of Standing Committees, the clerk worried. Representative Terry England, the 116th District Chairman, Committee on Appropriations, submitted the following report. I'm going to speak to your committee on appropriations. This has had a consideration following bills and resolutions in the House. The instructor made the report same back to the House of the following recommendations. House Bill 511, do pass by Committee Substitute, House of Resolution 29, do pass, House of Resolution 24, do pass. House of Resolution 25, do pass, House of Resolution 26, do pass respectfully submitted. Representative Terry England, the 116th District Chairman, Representative Stevens, the 164th District Chairman, and Committee on Economic Development, Tourism, submitted the following report. I'm going to speak to your committee on Economic Development, Tourism, as well as consideration following the House as instructor made the report same back to the House of the following recommendations. House of Resolution 185, do pass, respectfully submitted. Representative Stevens, the 164th District Chairman. Representative Dave Belton, 112th District, Secretary and Committee on Education, submitted the following report. I speak to your committee on education, said on a consideration following bill of the House as instructor made the report same back to the House of the following recommendations, House Bill 60, do pass by Substitute, respectfully submitted. Representative Dave Belton, 112th District, Secretary. Representative Jan Tankas, the 160th District Chairman, on Committee on Intergovernment, Coordination, Local, submitted the following report. I'll speak to your committee on Intergovernment, Coordination, Local, as done on consideration following bills of the House as instructor made the report same back to the House of the following recommendations. House Bill 253, do pass by Substitute, House Bill 535, do pass, House Bill 546, do pass, House Bill 560, do pass, House Bill 595, do pass, House Bill 600, do pass, House Bill 603, do pass, House Bill 610, do pass, House Bill 614, do pass, House Bill 445, do pass, House Bill 616, do pass, respectfully submitted. Representative Jan Tankas, the 160th District Chairman. Representative Chuck, of the administration of the 104th District Chairman of the Committee on Judiciary submitted the following report, speaking committee on Judiciary, and said on the consideration of following bills in the House. Mr. Dr. Media reports, same back to the House following recommendations. House Bill 334, new pass by Committee Substitute, House Bill 468, new pass by Committee Substitute. House Bill 478, new pass, House Bill 480, new pass, House Bill 536, new pass, House Bill 553, new pass, House Bill 554, new pass by Committee Substitute. House Bill 635, new pass by Committee Substitute, respectfully submitted, Representative Chuck, of the administration of the 104th District Chairman. Representative James Pucheta, the 176th District Chairman of the Committee in Judiciary, and on the Senate submitted the following report. And speaking committee on Judiciary, and on the Senate, and the consideration of following bills in the House. And Mr. Dr. Media report, the same back to the House following recommendations. House Bill 94, new pass, House Bill 1-\n\n94 new pass by committee substitute House bill 371 new pass by committee substitute respectively submitted represent James Richett of the 176th district chairman Representative Mandy Valentin the 23rd district chairman committee on juvenile justice submitted the following report to speak to your committee on juvenile justice as that of the consideration following bills of the house This is directed me to report the same backthouse filing recommendations House bill 32 new pass House bill 464 new pass House bill 548 new pass respectfully submitted Representative Mandy Valentin the 23rd district chairman Representative Paula the 32nd district chairman committee on regulated industries submitted the following report Misspeak your committee on regulated industries as that on the consideration the following bill of the house is instructing me to report the same backthouse filing recommendations House bill 544 new pass by committee substitute respectfully submitted represent Paula the 32nd district chairman Representative Rick jasperous of the 11th district chairman committee on transportation submitted the following report to speak to your committee on transportation seven consideration following bills of the house is instructing me to report the same backthouse filing recommendation House bill 577 new pass House bill 588 new pass respectively submitted represent Rick jasperous of the 11th district chairman Representative Shaw Blackman of 146th district chairman on committee on ways and means submitted the following report to speak to your committee on ways and means Is that on consideration the following bills of the house is instructing me to report same backthouse filing recommendations House bill 32 new pass by committee substitute House bill 302 new pass by committee substitute House bill 477 new pass House bill 586 to pass by committee substitute House bill 587 new pass by committee substitute House bill 593 new pass respectfully submitted Representative Shaw Blackman of the 146th district chairman That completes the readings the report and the standing committees You All right, we're going on now to the local calendar Third reading and passage of uncontested local bills If there is no objection we will vote on the local calendar as a whole with a recorded vote Hearing none it is so ordered the clerk will read the local calendar House bill 253 by substitute by revs and implements the 29 Jones County House bill 445 by revs and approves the 61st city of Southville and House bill 535 by resident here to the 150 second city of Sylvester House bill 546 by revs and Stephen's on 64th city Richmond Hill House bill 560 by revs and a tailor the 73rd Thomas County House bill 595 by revs and a green the 151st clay county House bill 600 by revs and a dryer the 59st city of hate bill House bill 603 by revs and a mix of 178th Brantley County House bill 610 by revs and a dicky the 140th bib county House bill 613 by revs and a black one and the 146th city perry House bill 614 by revs and a mithiac of the 73rd Griffin judicial circuit Is there any objection to the previous question being ordered on the local calendar the chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills the chair here's none The report of the committee is agreed to shall these bills now pass all those in favor of the passage of the bills On the local calendar will vote aye those opposed will vote no and the clerk will unlock the machines You Have all members voted have all members voted If so The clerk will lock the machine on the passage of the bills on the local calendar the eyes are 154 the nasor zero these bills having received the requisite constitutional majority are therefore passed We're going on now to morning orders Morning orders Yesterday we didn't get to everybody So I'm going to ask you again to be mindful we've got Uh Way way more today than we will get to in 10 minutes, but we're going to start and get as far as we can Chair recognizes representative owl Williams for a morning order Thank you miss speaker It takes me 10 minutes to get up here, but um this morning I stand arise from my moment in black history Um I've chosen as you can see on the screen Lieutenant commander Ellis woman Ellis was a Atlanta native who in 1972 Congressman Fletcher Thompson appointed him to the naval academy He was one of the first African-Americans from Atlanta to be appointed to the naval academy At the pleasure of serving as chairman deacon with his His mother his father and his sister when I lived here in Atlanta After he came out of the naval academy he became a naval aviator He flew some of the best aircraft the navy had And because of that I've asked representative Sheila Jones and representative Roger Bruce If they will assist in getting him in the naval the aviator museum out at Charlie Brown airport This lieutenant colon Lieutenant commander. I'm sorry Near the end went home much too early as the good lord sent An even better jet and flew him home to glory And he came back and is now in turn In the Marietta national cemetery Giant of a person A true patriot who served his country well God bless his memory. Thank you, mr. Speaker chair recognizes representatives gravely and Mitchell for a morning order Thank you, mr. Speaker. Well today in black history. I have the great honor of Recognizing the Atlanta black chambers Whereas the Atlanta black chambers of commerce has long been recognized by the citizens of this state For the vital role that it has played in leadership and its commitment to the welfare of the citizen Georgia And whereas the Atlanta black chambers are focused on educating black business owners and consumers on the best way to understand and engage in the public policy process At the local state and federal level as well as creating opportunities to empower the black community I have the great pleasure of thanking and I want to recognize The creators and founders of advancing black business pack Mark Markie Tate Melvin Coleman Calvin Maddox and Dr. Dianne Adoma and also want to thank diana Harris for allowing me to present this resolution Thank you, ladies and gentlemen, mr. Speaker. I yield the will chair recognizes representative wasporn for a morning order Thank you, mr. Speaker I rise today to give a tribute to someone relative to black history month In 1984 Changes were made that changed the commission county commission structure in Jones county my home county from three county wide commissioners To a county wide chairman and four district commissioners I ran for one of those district seats and got elected at the at the age of 34 At that same time a young man a young afro-american man named Lewis Patterson There was only 27 years old was elected as well And I had the pleasure to serve there with us during that term We did not always agree on everything But overall we worked together and accomplished some good things for the county that still bad for you today Commission of Patterson when I want to become judge Patterson He's a municipal court judge in Jones county now and also one of the magistrate judges He is a good man And he has a significance of being the first afro-american elected to the county commission in my home county of Jones And it is my honor to recognize him today. Thank you mr. Speaker chair recognizes representatives Billy Mitchell and representative viola Davis for a morning order You We recognize Friday February 26th 2021 As city of Tucker councilman bill Rosenfield day at the state capital to honor the life and memory of late councilman Rosenfield Doing this morning order on the house floor Doing his tenure in the Tucker city council councilman Rosenfield was passionate About the city's development and worked diligently to improve living conditions for the residents of smoke rise Including resurfacing role rebap in parks and recreation areas and renovating the Peters Park neighborhood a historical African-American community located in the city of Tucker in decap county He was a successful businessman who advocated for small businesses in Tucker and active member of the Tucker rotary club and served On the board of directors for a Tucker North Lake CID Our city of Tucker mayor Frank almonds stated and I quote His public service Grue naturally out of a lifetime of private and personal service to his family many many friends and countless community organization We asked that you join with us for a moment of silence to recognize February the 26th as councilman bill Rosenfield day Thank you mr. Speaker To recognize his representative gamble for a morning order Thank you mr. Speaker Members today I rise to honor the life and passing of a great Georgian dr. Paul L. Walker Dr. Walker's impact has touched the lives of millions of people around the world Today this great man will be laid to rest He is the pastor emeritus of Mount Perin Church of God and the former general overseer of the Church of God Cleveland Tennessee Ephesians 4 11 says God gave some to be apostles some to be prophets some to be evangelists and some to be pastors and some to be teachers But God gave very few to be all of them Dr. Walker was one of those few men Please join me in a moment of silence as we honor his life and remember his wife Carmelita His son dr. Mark Walchur who is the president of the university and the over 164,000 Georgians who are members of the church of God denomination Thank you You Chair recognizes representative lot for a morning order Thank you mr. Speaker good morning colleagues I rise today to bring your attention to the coronavirus relief package that is being debated currently in Washington D C This is important and is not a partisan issue in Georgia. It affects all of our constituents The coronavirus relief package that is being debated is a 1.9 trillion dollar assortment of spending Programs and is too large to dissect every piece from the well today But I do need to highlight one part That is and that is the direct aid to the states Please listen all of us should be concerned Under the Cares Act assistance to state and local governments was distributed by population To ensure all citizens were treated equitably As we all recover from the impacts of this pandemic But now under the new administration and new leadership in Congress They have devised a formula that withholds funding From some states while rewarding others As a matter of fact Georgia is the number one state in the nation in terms of dollars withheld When compared to what we would be in line for under a per capita formula New Yorkers are slated to receive 50% more assistance per person than Georgians This ends up being almost 1.3 billion dollars less for our state A larger differential than any other state in the union Want to guess which state is the biggest winner? California California of course, which is slated to receive 5.4 billion dollars more than its fair share would be under a per capita formula To put this a little more bluntly the federal government is borrowing money that our kids and grandkids will have to pay back for Decades to come with the lion's share of the funds sent to bail out states like California and New York This is unacceptable and I hope that every member of this body Regardless of party will publicly encourage our congressional delegation to stand up and fight for Georgians And encourage the administration and congressional leadership to abandon this formula that clearly prioritizes one set of states over others Thank you mr. Speaker That concludes the time for our morning orders today We're now going on to the rules calendar Going on to the rules calendar Plurical read the caption to House Bill 437 House Bill 437 my resident of power to the 124th being Todd and act to amend chapter 60 Toddle 36 the official go to Georgia annotated Relating the general provisions applicable account using municipal corporations So as to require attendance itself service motor fuel establishments to dispense motor fuel to individuals Especially disabilities this bill ever referred to the committee on health and human services that committee recommends That this bill do pass by committee substitute chair recognizes Representative Howard to present the bill Thank you, mr. Speaker This is a I guess you would call it a redo bill We we pass this bill last year unanimously Out of the house and they got caught up over in the Senate due to covid and It's a simple bill and I say that So the reluctantly because it's not it's a big bill to those folk who needed and it's Simply acts the Service stations around the state to put up signage on their palms to Make sure that if a person with a disability drives up to that station They they will have a signage on the pump With a phone number that they can call into the station and acts for assistance If they need assistance in pumping their gas And as again again, I say the we passed this bill last year, but for the new members who were not here Hopefully you will see it as a major bill for your constituents with disabilities Thank you and I yield for questions You do not have any questions Thank you, mr. Speaker Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered is there any objection To adopting the committee substitute chair here's none the committee substitute is adopted is there any objection? To agreeing to the report of the committee which was favorable to the passage of the bill The chair here's none the report of the committee is agreed to shall this bill now pass All those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines You Have all members voted Have all members voted If so The clerk will lock the machine on the passage of house bill 437 the eyes are 142 the nasors 17 This bill having received the requisite constitutional majority is therefore passed You Clerk will read the caption to house bill 449 House bill 449 members and Smith and 133rd and others to be entitled back to men chapter 9 and titled 25 of the physical to Georgia And today related to blasting or excavating near utility facilities So as the revise the Georgia utility facility protection act this bill have referred to the committee and energy utilities and telecommunications That committee recommends a dis bill do pass chair recognizes representative vance Smith to present the bill Thank you, miss bigger ladies and gentlemen. We have a code update with a couple of revisions This is the Georgia utility coordinating council deals with underground Utilities whether it be gas or electric The 16 associations that get together they've been meeting since June and they've come to a conclusion that these are some of the items That need to be updated in the Georgia code so that we make sure we continue to handle the permitting and the inspection process So that the feds won't come down and take over this we want to make sure we're out in the front And we've done a great job. Georgia's a leader in this category They've also added a section where if it line is hit such as a gas or hazardous gas material They will call 911 and make them aware of it We appreciate the consideration of the subcommittee and the committee and I would certainly appreciate your consideration in this matter If you have any questions, I'll be glad to try to answer thank you miss clear You do not have any questions Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill The chair here's none the report of the committee is agreed to shall this bill now pass All those in favor of the passage of the bill will vote aye Those opposed will vote no and the clerk will unlock the machines You Have all members voted Have all members voted If so the clerk will lock the machines on the passage of House bill 449 the eyes are 160 the nasors zero This bill having received the requisite constitutional majority is therefore passed Clerk will read the caption to House bill 458 House bill 458 There's a Cooper the 43rd to be in total next to men Chapter 34 title 43 of the official to Georgia and it's either related to physicians physicians assistance and others So it requires certain training related sectional misconduct remembers the Georgia composite medical poor This bill ever further committee on health and human services that committee recommends a disbilled do pass By committee substitute Chair recognizes the chairman of the health and human services committee chairman Cooper to present the bill Thank you, mr. Spiger ladies and gentlemen of the house. I bring to you today the substitute From the health and human services committee for House bill 458 And before I start I'd like to thank representing Scott Hokeman for the work he's done On this issue and similar issues over the past few years This bill was brought to me by the medical board Because they realize that times have changed and that Members really need to be updated About sexual boundaries and sexual misconduct and exploitation of patients And that's what this bill does this bill requires the board That they themselves will have to have training It requires a minimum of three hours a one-time minimum of three hours for physicians to be trained on this issue And it also requires that our medical schools Put this into their curriculum Giving him a lot of leeway so that young physicians come out and know That times have changed and even among the younger people There are certain things that used to be accepted That are no longer accepted we have to take that training here in a much smaller way And we are not as on intimate terms with each other as you find physicians do as they go about in their daily lives I mean on the other day I padded one of my colleagues on the back on like they showed in our training and I went oops You know could that be considered of sexual advance and then I remembered it was only if it was done on repeated basis But you have to think about these days or these days the other thing that this bill does As the board one of the things that they have known that they could do and they have done Is that when a physician is being investigated from sexual misconduct That if it rose and the investigators from the board found that they felt like it was putting patients in danger They could suspend the license But that was not really explicitly spelled out in their law in the law So this bill puts that into law the last thing it does is it gives us a report And tells us How many people how many doctors have been reported for sexual misconduct How many have been found guilty in a court of law if the you know the board knows that yet But how the board handled them was there a private order given Oh, and a private order might be given like one of the thing the boards did there was an ER doctor He treated a patient in the ER He apparently they later on they dated and they got married And he got recommended somebody turned him into the board Because supposedly if that's going to happen the doctor has to send a written certified letter to the patient saying They will not going to treat them anymore But this was an ER visit and that doctor got sent off was given a private order But what happened was he got sent off for three weeks to a special course and training session On sexual misconduct so we will get a report of how many public orders were given private orders Was the person found guilty You know in charge by law the kind of information so we can see where we are In the state I would ask her your favor consideration of House bill 458 and Mr. Speaker if there's any questions I will be glad to answer them or I will yield the well You have a couple of questions if you care to you I'll take one or two sir Chair recognizes representative cannon to your left for a question Does the lady yields yes? What is implicit bias training? I would think that that probably means that how women feel about it or men feel about what is the limits and the boundaries I Really Representative cannon can't be more I can't really tell you more about that sorry Do you further yield one more Mr. Speaker chair recognizes representative base more to your left for a question Thank you. Does the lady you yes? Thank you If it's found that a health care provider is aware of a case of sexual sexual assault on a patient but has not reported it What are the ramifications? Oh, thank you representative base more for doing that If another physician Knows that one of their colleagues is conducting themselves in such a manner And does not report it to the board They can be find if found guilty they can be of not doing that they can be find a thousand to five thousand dollars or if The what they didn't report was egregious and I\n\nsay like if they were a sports doctor like the one that's just been reported in the news up north and they knew another sports doctor was sexually assaulting all those young athletes and didn't I would imagine and this gives the board the right to even further reprimand the physician. Thank you for those questions and Mr. Speaker I will yield well. Is there any objection to the previous question being ordered? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 458. The eyes are 100 and 31 the nays are 27. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 338. House Bill 338 by representative to the loach and 167th another is being talon act to men code section 45 36th the fish go to Georgia and to relay the veterans licenses honorary licenses another distinct drivers licenses so it provides qualifications for the issuance of veterans driver licenses. This bill I refer to the committee on motor vehicles that committee recommends a dis bill do pass by committee substitute. Well this is not your first bill. It's just your first bill in a lot of years. It's also the first time if somebody from that district passed a bill in a lot of years chair recognizes representative buddy de loach to present the bill. Thank you very much Mr. Speaker. It's nice to be back ladies and gentlemen of the House. This bill deals with the definition of veterans to qualify for veterans driver's license in state of Georgia over the years this definition got massaged and changed and really got to the point that it got so convoluted that the department decided that they would require all applicants for veterans driver's license to go to the VA and let them determine who was eligible so you have to go down to the VA and that could take four or five hours to see a counselor and get you a little certificate and take it back to the to get your driver's license. What we've done in this bill is take the definition of veteran directly from Title 38 of the U.S. Code. It makes it very simple so we believe when you pass this bill then veterans can simply take their DD214 down to the driver's license bureau show them their DD214. All they've got to do is verify your name, look and block 13a and if it says anything other than dishonorable you are qualified for a veterans driver's license. I want to thank Chairman Terry England for bringing this to my attention. He had one of his constituents asked him to look at this. I also want to thank my colleague representative, Al Williams. Al served his country in Vietnam and came home frankly to a nation that didn't care much about the veterans of his war. So Al I want to take this opportunity to give you that greeting that we all give one another welcome home. Miss Speaker if there are no questions I'll yield the well. You do have questions. You've got several. If it make them quick I know it's Friday and folks want to get out of here. Oh we're going to be we're taking our time here. Let's see. Well let's go to your friend from the coast representative Al Williams to your left for a question. Yes sir. I yield. Gentlemen will yield. I had another question for the gentleman but you'll kind words I changed my question. But is it not true that you were born and raised your most of your time and still have a business in Liberty Crown and which gives you access to the Ralph Johnson clinic there. That is true. And is it not true that a bill like this in an area that has as high a veteran population as we do this certainly is a help because it can really be determined to sit at the old age just to get a little forward. Thank you for that question and that's true. Liberty can't have to be the home of the premier fighting force in the world. The third infantry division rock of the morn. Oh tell representative Bill Hitches that again. Let's see what the other Williams cousin wants to inquire about. Chair recognizes up in the gallery representative Noah Williams for a question. He waves me. Well I guess I need to call on this gentleman. Chair recognizes the majority leader of the house to you arrive for a question. Thank you miss Speaker. My friend in the wheel. You yield. I do. From a historical perspective. When you were here first few years early. How long did you were you here before you passed your first bill? Well I was always in the minority. I don't know that I ever got one directly but they got a lot of amendments on there and I spent some time down in the well talking about somebody didn't like but I don't know if I ever got well I probably six years. Well you're certainly on the fast track now inside. Thank you. I hope to try to make a contribution. And you have and you're still making that contribution. Gentlemen you have one more question. I do. I certainly like you honor my colleague, Al Williams for his service in Vietnam but I'd also like to mention our other colleague who served in Vietnam was Chairman Bill Hitches and we're certainly appreciated both of them for their service to our country and their continued service our state. Thank you. It's a great bill and we appreciate you bringing it. Thank you for that question. Miss Begile-Yield-Aweil. Gentlemen is yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill who vote aye? Those opposed who vote no and the clerk will unlock the machine. What purpose does Chairman Martin rise? Parliamentary inquiry. Is it true? Mr. Speaker, I had a serious question for the gentleman about the bill and is it true of what I wanted to ask him is to make sure that it covered he and the other veterans of the Revolutionary War. What purpose does Representative DeLoturize? Mr. Speaker, I'd just like to talk about Parliamentary inquiry. Parliamentary inquiry, Mr. Speaker. Mr. Speaker, isn't it true that Chairman Don Hogan was my command and officer in that war? I believe that to be true and that's why we won the war. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 338, the eyes are 161, the nasors zero this bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 370. House Bill 370, Governor of the Jones of the 47th, be titled back to a man art of 4th chapter 7, Title 31 of the fiscal to George Anitetti relating county municipal hospital authorities, so it's to provide for term limits for members of joint hospital authorities. This bill I refer to the committee on health and human services that committee recommends that this bill do pass. Chair recognizes the Speaker, Pro Tem of the House. Representative Jones to present the bill. Thank you, Mr. Speaker. I'd like to present House Bill 370. And first I'd like to say it only pertains to the Fulton to Cap Hospital Authority, no others in the state. In 2008, when Grady Hospital was under extreme financial pressure to maintain its solvency, the Fulton to Cap Hospital authorities role changed and was considerably reduced. And at that time, the Grady Memorial Hospital Corporation was formed to take over most of its duties to run the hospital. Since that time, the authorities now receives $3 million in lease payments from the hospital, the majority of which is intended in current law to be funneled back to the hospital to pay for indigent care and to fulfill existing pension obligations. But that is not happening. We're hopeful that with this clarification on the hospital's role and how they are to spend their expenditures or spend the monies from the lease payments that over $1 million yearly will go back to Grady Hospital. So what the bill does, number one, is it further clarifies how those monies can be spent, most of which are already in current law. And it also imposes term limits very similar to the corporate boards, the Fulton, the Grady Hospital Corporate Board's term limits. And with that, Mr. Speaker, I'd be happy to answer any questions. You do not have any questions. Well, thank you and I appreciate your favorable consideration of House Bill 370. We have a member that wishes to be heard on the bill. The chair recognizes representative Bennett to speak to the bill. Thank you, Mr. Speaker. Colleagues, I rise in opposition to this bill because things are not always as they seem. Once again, this bill on the surface seems to enact term limits to an authority who, under local control, can set their own limits. Why this and why now? Things are not always as they seem. The Fulton to Care Authority is the only entity as Madam Speaker Pro Tem has offered affected by this bill. Although not mentioned by name in the bill, things are not always as they seem. Why this and why now? The Fulton to Care Hospital Authority is best statu in place and entered into a less sorely C agreement with the Grady Hospital Corporation. And any operational agreements can be worked out administratively. Why this bill and why now? Because things are not always as they seem. So today, my colleagues, I stand here in opposition to this bill. Heaven notified the author and had conversations with designers on this bill because I believe that this agreement can be worked out and continue to be given to local control. Because this is an attempt likened to taking a way local rule from an authority when this can be done administratively and upon agreement of both parties working together. So again, colleagues, this bill is targeted specifically at individuals and once again takes away local control. So I ask that if you are in favor of local control, that you vote no against House Bill 370 because it sets a precedence that exists in no other hospital authority in our state. Thank you, Mr. Speaker, and I do yield the will. You yield for questions. No, Mr. Speaker, I yield the will. Ladies, yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 370 will vote aye. Those opposed to vote no and the clerk will unlock the machine. What purpose is the Speaker, Pro Tem, rise? Parliamentary inquiry. Is it not true that I was asked by current board members, the corporate board and of the authority to make this change and that they are similar to the term limits in place for the corporate board as well as several other boards in the state, including the Athens Authority. If the lady states that to be true, then I have a no or to be a person of credibility and integrity. What purpose does representative cannon rise? Parliamentary inquiry. Is it not true that there are other members of this Fulton Decap Hospital Authority who say that they fear what is at the center of this bill is an effort to undermine their work? I have no way of knowing if that's true or not. I'm sure the lady believes it to be true. What purpose does representative Bennett rise? Parliamentary inquiry. Is it not true that there are also members on the House of the Louis Fulton Decap Hospital Authority that has spoken to me personally and have said that they are in opposition to such a move? I'm sure the lady believes that to be true. Have all members voted? Have all members voted? What purpose does chairman, House, and rise? Parliamentary inquiry. Is it not true if this body had not stepped in in 2008 with the assistance of representing Pam Stephenson, Grady Hospital would be in deep trouble? Believe that to be true. Thank you. Have all members now voted? If so, the clerk will lock the machines on the passage of House Bill 370. The eyes are 105. The nays are 59. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 336. House Bill 336 by Representative Corbett of the 174th, be titled an act to amend chapter 23 of Title II with the fiscal to Georgia and Tate who related the hemp farming skills to revive for compliance with federal laws and regulations. This bill having referred to the committee on agriculture and consumer affairs. That committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Corbett to present the bill. Thank you, Mr. Speaker. Members of the House, I'll bring you before you HB336, LC441689S. Over the past couple of years we passed legislation dealing with hemp farming in Georgia. What House Bill 336 does? We clarify what the definition of processing is in the bill. We're aligning Georgia's language in our bill with some federal language that they have in the federal rules and regs. They finally got out this past year. We're clarifying the background and fingerprinting process and we lowered the renewal fee. It was going to 50,000 a year. We lowered it to 25 the way that in the old bill was original setup and we raised a surety bond for the processors from 100,000 to 300,000 in this bill, Mr. Speaker. That's what we're doing and I'll stand for any questions if they are any. You have a couple of questions and do you yield? I yield for a couple. Chair recognizes representative Wilson in the gallery to your right for a question. Will the German yield? To my friend I will. Is it not true that you made some changes to this bill in committee listening to some complaints from small farmers and consumer advocates to make this a better bill? Absolutely. We had quite a good debate in the ad committee the other day and with Chairman Dickie did a great job with our committee and with the input that we got we did make changes to the bill in committee. I appreciate your input as well. I appreciate your help. You yield for another question or two? I will take one more, Mr. Speaker. Chair recognizes Chairman Setslor to your right for a question. Does Jim and you yield? Yes, I'll come up for him. Appreciate your efforts on this. I know a couple of years ago we had a kind of a little trip up where we were inadvertently created conditions where solicitors couldn't bring marijuana prosecutions because of the Confucianist Code section. Has that issue been fixed? Previously, does this bill fix that? Well, it would much debate last year between the Prosecuting Attorney's Council and the GBI and everything. This is what we came up with. There's a test that is out there that is available now to the law enforcement. It's sort of like the test they have for marijuana. It will contest it to tell you if it's positive. This will tell you if it's 1% or less. So they have a test out there available to them that they have that will do this. So this bill doesn't affect that. We already have that ability. The ability is out there now for they have a test where they can carry around the car. It's not as quite as cheap as the one that can tell if it's marijuana but this will hit it down to you if it's less than 1%. It won't take if it's less than 0.3 but if it's less than 1, it's not marijuana anyway. So just remember that that are concerned about the subject matter. This bill has been vetted. Does not affect that anyway. No, it does not affect that anyway at all. No sir. Thanks. Mr. Speaker, I yield the well and ask for your favour consideration. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favour of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Lewis Sward rise? Parliamentary inquiry. Make your inquiry. Is it not true that I supported this measure in committee and after having an aha moment, I realized that it does not help this small farmers sell their products to the market causing them to rely on their producers. If the lady so states, I guess that's true. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 336. The eyes are 153. The nays are 12. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 152. House Bill 152, by the way, we now are 119 to be titled and act to amend our 1A of Article 7 of Chapter 3 to title 20 of the fiscal to George Annotated relating non-public post-secondary education institutions. So as there are vise provisions regarding the exemption of applicable to certain institutions operating on military installations, this bill haven't been referred to the committee on higher education that committee recommends that this bill do pass by committee substitute. Chair recognizes representative Weedower to present the bill. Thank you, Mr. Speaker and colleagues. The bring you House Bill 152 is a department bill for the non-public post-secondary education commission. This bill does simply three things to hopefully make the department a little more efficient. One, there are some of these education services on military bases that are looked over by the federal government. This would bring them out from out from underneath the state umbrella and let the feds continue to monitor them separately. Second thing it does allows the director some leeway in reviewing these institutions remotely. There's hundreds of these across the state and with a very small department this would save the state money and time. The last thing it does is it adds two tiers to the bond requirements for these institutions to ensure the students at these schools are protected. That is what it does and I consider, look for your favoral consideration I'll yield for questions. You did not have any questions. I yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 152 or vote aye? Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machine. On the passage of House Bill 152, the eyes are 165. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 271. House Bill 271, my representative, reads the 34th and others be titled, act to amend Article 2 of Chapter 11 of Title 31 of the Fish Go to Jordan, to interrelated licenses for emergency medical services, so as to authorize the Department of Community Health to assess one or more provider matching payments on ambulance services. This bill I refer to the committee on Health and Human Services. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Reeves to present the bill. Thank you, Mr. Speaker. This is a pretty simple bill that simply creates some ambulance parity. Right now in Georgia there's essentially three types of ambulances or ambulance services. There's hospital, there's public, and there's private ambulance services. Private ambulance services are not currently able to draw down on federal matching funds because the federal law requires that we have language in our code, which is what House Bill 271 is, so that private hospitals can pay into the indigent care fund. Federal, the federal government will match those funds two to one, and then those funds can be redistributed. So this creates parity, and it helps our private hospitals or private ambulances. I'll be happy to yield for any questions. You have a couple of questions if you care to yield. Sure, I'll yield, Mr. Speaker. Chair recognizes Chairman Hawkins, do you're right for a question? Does Jim and you do? Is it not true that the federal government has not kept up its Medicaid reimbursement fees for some long time? And due to that we are losing private ambulance service in this state. That's true. And this bill solves that. Do you further yield? I do. Isn't it true that this bill would help save some of those companies and save George's lives throughout this state? The gentleman does have what he speaks. Thank you. Mr. Speaker, I will yield the well. Thank you. Gentlemen, he's yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no in the clerk will unlock the machine. What purpose does representative Bentley rise? State your inquiry. Mr. Speaker, is it not true that I was going to ask my seekmate about his bill relating to when ambulance is breakdown because the ambulance that was transported my husband to Savannah hospital on December 30th broke down between making and met a Georgia. Would this bill fix situations regarding maintenance of ambulance services across the state? I will get involved on that issue if it ever breaks down again for you. What purpose does chairman Allen Powell rise? He waves. Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 271, the eyes are 160. The nasors zero this bill having received. The requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 384.\n\nHouse Bill 384 by Mr. Dahlor, the 45th and others to be entitled to amend Title 40 of the fiscal to George Ante, related to motor vehicles and traffic. So it's a revive for the issue. It's a traffic citation of the vehicle owner in lieu of the individual operating motor vehicles. Certain instances this bill I refer to the Committee on Motor Vehicles. The Committee recommends a disbilled due pass. Chair recognizes Chairman Matt Dahlor to present the bill. Thank you, Speaker. Currently, the vehicle is pulled over for a vehicle infraction. That ticket has to be issued to the driver. All that House Bill 384 says is that it gives law enforcement the ability to issue that citation to the owner of the vehicle if they're not driving. And that's the bill, Mr. Speaker. We've passed this out before. I'm happy to yield for any questions. I have a question if you care to yield. Chair recognizes representative Al Williams to your left for a question. I don't yield, Mr. Speaker. Mr. Dunham and you. Yes, sir. I was wondering. Now would have the right to write a ticket to the passenger. I was confused because I got a ticket and was not even in the car and not on a public road. Is it not true? I was in the presence of Alice Walker before she wrote the color purple and a friend moved my car and I got a ticket because the friend didn't have a license but the car never got on the road. I was going to help with that. I want my money back. Yes, sir. I'm sure the gentleman knows it once he speaks. No further questions. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 384. The eyes are 133. The nays are 27. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 488. House Bill 488, my members. If Scott was the 14th and others being titled an act to amend title 15, if it's going to George Ante, relating to courts, just to provide for an increase in minimum compensation, for chief magistrates. This bill having referred to the committee on judiciary. That committee recommends that this bill do pass. Chair recognizes representative Scott Gans to present the bill. Thank you, Mr. Speaker. Members, today I bring to you House Bill 488. This is the same exact bill that we passed last year was House Bill 765. That passed out of here 142 to 25. It went over to the Senate and they changed the effective date. So it came back to us and we ran out of time. But this is a bill that would change and level the play and feel for the constitutional officers got a adjustment in their minimum compensation brackets in 2019. That was brought on by representative Knight. This would bring the magistrate judges up to that same level. It also deals with probate judges who also serve as magistrate judges too. There's this bill only affects about 70 counties in the state. Most all the magistrate judges, salaries are set by local legislation. So this only affects 70 counties and I would ask for your favorable, favorable consideration. And I will yield questions. You do not have any questions. Thanks sir. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 488. The eyes are 154. The nays are seven. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 289. House Bill 289, I will send a belt of 112th and others to be entitled to amend Article 2, Chapter 5, of a total 40. The official to Georgia, and Tate, related to the issuance, expiration, and renewals of driver's licenses. This bill I refer to the committee on motor vehicles that committee recommends this bill do pass by committee substitute. The chairman of the bill recognizes chairman Allen Powell to present the bill. Thank you, Mr. Speaker and ladies and gentlemen, I ask chairman Bell to apologize, but he's out at about 35,000 feet right now. I ask for me to handle this very simple bill. A lot of y'all know that his passion of working with things that were for the help of the military. What this bill does is it amends the Georgia statutes under the Georgia law. It was passed in 02 that said that you had to have a class D driver's license until 18. And what this bill does, ladies and gentlemen, it provides that if you're a 17 year old and you enlist in the military that you can then have a class D license, very straightforward, very simple bill. And I'm sure I'd ask for your consideration as with chairman Belton. Do you do not have any questions? Is there any objection to the previous question being ordered? The chair hears none? The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. You You You All members voted. Have all members voted. What purpose does representative mom to hand rise? I can't hear you. Okay, miss miss speaker can hear me now. I can hear you now. Okay, percent rule number 133. I would like to excuse myself from this vote. Gentlemen has that right and the journal will so reflect if all members now voted. If so, the clerk will lock the machine on the passage of House bill 289. The eyes are 162. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. And the bill is passing. The bill will be passed. We'll take a lunch break. Let me tell you why you need to come back. We've got a few bills. We have an adjournment resolution to take up after lunch. It should be ready by then. And it makes you feel better. The state's Senate is just now getting to work for the day, and they're going to be here for a while. Chair recognizes Chairman Hatchett for an announcement. Thank you Mr. Speaker. The majority caucus will meet upon recess for lunch when we recess in the Floyd Ram twin towers. This house will be in recess for lunch until 1.20 p.m.",
  "updated_at": "2026-02-13T09:38:32.459718+00:00"
}