{
  "video_id": "5im_VrGZOoI",
  "url": "https://www.youtube.com/watch?v=5im_VrGZOoI",
  "title": "Senate Session for Day 38 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 134,
  "summary": "Here is a summary of the Georgia Senate session for Day 38 of the 2025 Session:\n\n**Overview**\nThis session focused on the discussion and passage of House Bill 268, which aims to improve school safety and security in Georgia in response to a tragic school shooting incident.\n\n**Key Actions**\n- **HB 268**: Bill to create the Office of Safe Schools, develop policies and procedures for threat management teams, and enhance school safety measures.\n\n**Bills Introduced (First Reading)**\n- None noted in the transcript.\n\n**Notable Moments**\n- Emotional speech by the Senator from the 46th district, whose district includes the site of the tragic school shooting that inspired this legislation. The Senator honored the victims and expressed the importance of passing this bill to prevent such tragedies in the future.\n- Bipartisan collaboration between the House and Senate referenced, with several Senators having previously passed related school safety bills that were incorporated into HB 268.\n\n**Votes**\n- HB 268 passed with unanimous support.\n\n**Attendance**\n- Senators from the 22nd and 26th/17th districts were excused.\n\n**Adjournment**\n- The transcript does not provide the time of adjournment or the date of the next session.",
  "transcript": "Senator, come back in order. Secretary, House Bill 268. House Bill 268, representative Perfinger, 119th and others. Bill Tweeney, title of the Act to amend chapter 2 at Title 20. Those CGA will lead to elementary and secondary education. So it's a ride for safety, health, and well-being of students and school communities to create the office of safe schools within the Georgia emergency management and a home and security agency to provide technical assistance for local school systems, develop policies and procedures for the threat management teams, develop statewide behavioral threat management operational process, to ride for definitions and further purposes. Mr. President, the Senate Commune in Judiciary recommends that this bill do pass by substitute respect, dismiss, and assurances, and chairman. Mr. President, the Senate Commune in Judiciary offers the following substitute to House Bill 268. Bill Tweeney, title of the Act to amend, chapter 11, title 15, chapter 20, and chapter 3, title 38 of those CGA will lead to juvenile code and for other purposes. Mr. President, Senator Perfinger, the 44th and others are for the following amendment number 1 to amend the Senate Commune in Judiciary substitute to House Bill 268 by removing the quotation mark at the end of line, 2015, and inserting between lines 10, 15 and 10, 16, the following J1, the Department of Education and collaboration with the Georgia Emergency Management and Homeland Security agencies have developed information and other resources regarding the safe storage of firearms and for other purposes. Mr. President, that completes the order. Senator from the 41st, you have a point of personal privilege or what? I'm not sure. I'm not sure. For unanimous consent to excuse the Senate from the 22nd. The 22nd? The 22nd. Okay, yeah, without her Jackson, Senator from the 26th. And the 17th. And the 17th. Without Jackson, those two are excused. I recognize Senator from the 46th to speak to the bill. Thank you, Mr. President. Ladies and gentlemen, the Senate, this is not a happy bill to present. And it is very unfortunate that we're having to worry so badly about the safety of our children in our schools. But it's something that we need to do, and I'm happy to be involved in the process. Unfortunately, this began with tragedy back on September 4th of 2024 when there was a senseless shooting at Appalachia High School in Barra County. It's in the 46th district myself, the Senator from the 45th and the 47th chair Barra County. And it was quite the tragic day to hear the news coming out of there. To the best of my knowledge, this is the first school shooting in the state of Georgia. Certainly the first mass shooting I've not heard or learned of any before. And thank God there have been none since. Speaker and the House of Representatives adopted this as their number one priority for this legislative system. We want to make sure that this never happens again in the state of Georgia. And I give the highest accolades to Speaker Burns and the work that he's done in pulling together many different ideas to address the root of the problem and to prevent it from happening again in the future. And that if it ever does that we will be able to respond in a very efficient, fast manner, very similar to how Barra County responded in this case back in September. It's impossible to tell you how much detail the House education chairman Chris Irwin went to in drafting this bill came through his committee. And I am really, really impressed at the thoroughness and the thoughtfulness of the provisions that are included in this bill. I think we can all be very proud of the work product and representative hold person who represents the area as well. Very close to home to him took it very personal and he has driven this legislation through both the House and through the Senate now. You may remember we have had several bills in the Senate this year that we've passed that deal with aspects of school safety. And I will call the senators out by name, but we had one bill that deals with the criminal aspects of terroristic threats on school property threats to student threats to school activities. The Senate from the 27th pushed that legislation and it of course passed our Senate overwhelmingly and it has been folded into this House bill 268. Also the senator from the 31st had a very important bill, Ricky and Elise's law that dealt with how do you react to this? How do you prevent this from happening, but how do you make it easier for law enforcement and public agencies to respond? And that bill requires panic alert buttons to be present in the schools so that if something starts happening, help can be called immediately. It also calls for the mapping of schools and school properties so that law enforcement will know where they're going, where every entrance, every exit, the cafeteria, the art room, the theater, each classroom, the offices where they are on the diagram, on the schematic. And so if you get a call, we have an active shooter and Mrs. Jones eighth grade classroom, these folks will know where to go and how to get the other students out in a fast and expeditious manner. That has been largely implemented with very few changes in this House bill. And finally, the senator from the 45th who also represents the Appalachia area realized that one of the problems with that particular incident was the student had newly transferred into the district and the new set of teachers and administrators didn't know about any troubles he had been in the past. So he was a threat or a danger. And so we had a bill that the center from the 45th sponsored here that we passed out that requires the transfer of a student's record from the school they're moving from to their new school within five days. And so this is also embedded in this bill. So this is a joint work product of both the House and the Senate under the speakers stewardship, the lieutenant governors, broad endorsement of the bill and the work in the House and the Senate. As I looked at the issues and tried to get myself in the right frame of mind to present this to you, what is a very, very serious subject. It is truly a life and death subject matter. There's a lot of bills we deal with in here that deal certain business aspects or rights or beliefs or tax breaks. A lot of things we deal with that are business oriented almost mundane. But there's nothing like worrying about the safety of your children and your grandchildren. And every parent ought to know when they drop their child off at school or they put them on that bus to go to school every day that they're coming home safe. And that they're going to be an environment where they can learn and not be worried about their physical safety. We can't do everything on this, but this bill is a great step forward to ensure the safety of our children to protect them from this type of tragedy in the future. And I want to make sure that the lives of those lost at Appalachia are not lost in vain, that we prevent that from happening in the future. I would ask you to please join with me and let's honor the deceased if you would stand with me, please. The center's that's our moment of silence. Mason Skirmherhorn, a 14-year-old student. Christian Angulo, also a 14-year-old student. Christine Erami, a 53-year-old math teacher. And Richard Aspenwall, a 39-year-old math teacher and assistant football coach. In addition, there are eight students and one teacher who were wounded. Please join me in a moment of silence. Thank you. Let's don't let them die in vain. Let's talk about what we can do to prevent this type of tragedy from ever happening again in the state of Georgia. Let's do what we can to make certain that when we take our children and our grandchildren and future generations of children to school, that they're safe. And they're protected and they're to learn and to grow and develop and to responsible adults. I believe everybody here would agree with me that at the root of almost every one of these incidents nationwide or mental health problems. Almost always there's a mental illness. Many times there's a lack of parental involvement. There are lacks of discipline. There are warning signs, things that have happened over the years in classrooms and out of classrooms that should have put us on notice that something might happen. I am stunned how many times after the fact we go look at social media. Twitter, X or Facebook, Snapchat, all the different social media that the kids use these days. There's almost always some type of threat, some type of lashing out, some types of cry for help that when you look back at it after the fact, you're like, wow, we should have seen that coming. Or some people will say, I knew that kid wasn't right. That we were scared of him. Always feared that they might do something like this. What we're hoping to do in this bill is to try to identify those type of mental health problems, dangerous kids, and to intervene to give them help early. So that we can address those problems before they devolve into this very destructive behavior. One thing that the bill does, and I'm jumping around on it, I'll try to lead you through it. I can answer questions and tell you where we're going, but it is not in a sort of a linear order in the bill. So I'm going to take out the big picture for you and tell you what we're doing. In section two dash 20, this is all the way back on page 47 in our bill, which is I think 57 pages. We're requiring every school to have a school safety plan. Now most every school already has one. And this is how you keep your kids safe, how you respond to emergencies, et cetera. But I'll point you to lines 1196. Noted later than January 1st of 2027, each public school safety plan, which are already required, shall include provisions that address the behavioral health needs of students, and a behavioral threat assessment management plan that will provide a structured multi-disciplinary process to identify, assess, and mitigate potential threats while supporting the safety and well-being of the students and the school personnel. That's pretty flowery language, very aspirational language. But what we do right here is say part of your school safety plan has to deal with the behavioral health, the mental health that's acted out. So we want to identify mental health problems and address them, help the students, find help if they need it. Because then we make the entire student body a safer place. It's going to take some personnel to do this. And so we in the bill require each school to have an individual that will help them deal with this. We've identified those or sort of defined them as a qualified student advocacy specialist. Now that's not somebody that's like a lawyer advocating for the students. That's a mental health professional to help address mental health problems with students, how to identify them, how to respond to them, how to intervene in the lives of these troubled young folks. And so all public schools always say don't put any unfunded mandates on us. Don't tell us what all we have to do and then just leave us to ourselves. And so this bill doesn't. We set up state grants to fund these mental health specialists in each school system. And it's a sliding scale. If you have less than 18,000 kids in your school district, the state's going to pay for one of these student advocacy specialists. If you have 18 to 36,000 students, you'll qualify for grants for two. And if you're more than 36,000 students, your district will be funded for three of these specialists. Doesn't limit you as a school district just to those numbers. You can employ as many as you want to, but the state is going to pay for at least those minimum basic positions. And they will try to figure out how to educate the student population, how to educate the faculty, the administration, over what the threats are, how to identify them, how to treat them, how to respond to them, how to prevent any of these incidents from taking place in the future. That's a start. It's not the solution, but it's a start that we are putting focus on the mental health that we're going to have specialist in each school system to help coordinate the response to mental health problems, behavioral health problems. We also have put in training for the students that each student each year will receive one hour of training and instruction on suicide prevention. Suicide is a much larger issue with our youth than we wish. And this will help them understand the problems that they may be dealing with can be handled through other means. How to identify other students that are potential suicide risks to get them the mental health that they need, how to know to identify potential problems in themselves where they can reach out for help. And also one hour per year of violence prevention training to teach kids about violence in school, how to control your emotions and your impulses and your behavior, what the appropriate boundaries are and interactions amongst other students, and how to identify and recognize other children that might be a threat to committing violence in the school. That doesn't sound like a lot in our per student per year on the mental health, angle on suicide prevention and on the behavioral side violence prevention, but it's a darn good start. And it shows that it matters to us and we want to continue pushing that information out to our students so they are aware. Another part of the bill that I think is brilliant is to require each school system to have an anonymous reporting system where if you see dangerous behavior, here dangerous threats that you have a place to report those open 24, 7, confidentially, anonymously so you can share your concerns. So that the first we hear about your concerns are not after the fact where you go back and say, man, I knew something was wrong with that kid. I wish I told somebody, might have made a difference. The fact that their anonymous makes people more likely to come forward and they'll be staffed 24, 7 by mental health professionals that are able to know what to do with the information and know what is legitimate threat or concern to convey to school administrators and what is idle chatter amongst the students. One of the hardest things we dealt with in this bill in the Senate, it came through Judiciary Committee. I chaired the subcommittee where we heard two and a half hours of testimony, mostly from concerned parents. But one of the biggest concern was is what do you do with information that you receive about potential dangerous behavior? The House Bill had created a database, they called it the S3 database where there would be like a offline record of all the complaints, concerns, worries about kids. That was different from the online record, your student record that has your academic achievement, your attendance in the school, your disciplinary problems that you actually got suspended or expelled or whatever. And of course a criminal record if you've gone that far. But the original bill created another kind of database that dealt with complaints, let's say. Now I've got two boys and a girl, any of you with multiple children know every single one of them is totally different. Same gene pool with parents, more they come out unbelievably different, summer, risk takers, summer, quiet, studious, summer loud, boisterous, gregarious, it's a whole spectrum. But anybody with boys in particular, a juvenile boy is by definition immature. Their brains aren't formed, their personalities aren't formed, they're not wise like us parents and they say and do stupid irresponsible things. And we know that, they're our children, we love them and all the teachers do too and you discipline them and you bring them along and low and behold for you know what they grow up and they become productive citizens. And some of the stupid pranks you do in middle school or high school or the dumb things you might say. The parents kept coming and being heard saying, I don't think I want my child to be persecuted for life because they do something stupid in the eighth grade and they say, man I'd like to blow this bill up. I didn't good to say, that doesn't mean they're going to do it. And if the school faculty didn't think it was significant enough or serious enough to give them disciplinary action and create a record, why should we have this shadow database so to speak on misconduct of students that didn't arise to criminal conduct or disciplinary proceedings in school? So, you know, I mean, I don't want to do it. Amazing the number of boy moms that came saying, Lord have mercy, please don't stigmatize my son. And this is something that the entire political spectrum weighed in on most of the emails you've gotten are from parents that are like, I don't want my child to be labeled for some anonymous allegations or some concerns of other kids or parents. I don't want some racial profiling of my child because somebody claims they did something wrong or made a threat that they have not been convicted of or proved of. And same thing for right parents say, and this is an invasion of privacy, it is a stigma attached and how long will it last? It's going to stick with them the rest of their life till they get through high school, till they get through college. There were many, many confusing conflicting views on this. So, if that's your concern with the bill, it has been removed from the bill. They will not be a database kept with GEMA or anybody else. Students still have their school record, but there's not going to be some amorphous S3 database that can haunt a child even when they really never acted on their immature comments, let's say. That should eliminate a lot of potential questions that I may be asked before this presentation is over. Now, as far as reporting things, you've got the anonymous reports that can get back to administration, they can decide what's serious, what needs be acted on. We're also requiring law enforcement, for the first time requiring them if they have an official encounter with the school aid youth. So, they're investigating Rolfeconda. Thank you, Mr. President. They need to follow written report of that with the school. Whatever school the kids enrolled in public or private school, the administration needs to know, because most of the cutting up and bad behavior happens off campus after school hours weekends. But this again helps us report, learn about problem conduct. There are other aspects of the bill that are sort of on the prevention end. One thing we see over and over is the kids that act out and commit violent acts. Many, many times have very poor family structure, family support, parental influence. I don't know about y'all. I'm as old as I look. And boy, I'm gonna tell you right now, I was way more scared of my mom and my daddy than I was if any teacher or principal. Don't call my mom or whatever you please don't call my mom. You can give me that spanking. I don't want to have to go home and deal with Virginia and Willie, my daddy. Because that wasn't good. And I had to take that report card home. I very first grade. Bill is disturbing those around him. I never did that again. I promise you after that lesson was made. And I was so shy before then I was scared to go to kindergarten. I wouldn't go. I was a little mama's boy, I guess. When I got out in the big world, man, I had disturbed those around me one time and that game was over. And there on in I paid attention. I didn't always the case today. There's an awful lot of children that don't have a mom and a daddy in the household. A lot of them are raised by grandparents. A lot of them don't have to get disciplined if their grades aren't up or if they don't go to school or if they misbehaving school. I don't know how we deal with that but this bill will address part of it. It will require if a kid has been absent for more than 30 consecutive days. And the parents have not advised the school administration of why. You know, they've decided to homeschool the child. Or maybe they've been traveling. Or maybe there's been an illness or maybe a death in the family or maybe a change in jobs or location of the parents. Whatever reason. If the parents hadn't explained to the administration why their kids stop coming school, it might be because they don't know. And this helps them learn. It's required to be reported to the parents and to defects. To pay a visit to that house and say, do you realize your children aren't going to school or your child's and is there a reason because if you're out 30 days or more, you are falling behind for one thing in school. And it is also very possibly a result of a disciplinary problem or a warning of disciplinary problems to come. See how we have little pieces in this bill that everyone will make sense on their own. And when you add them together, they are an effective counterman. And an attempt for us to identify.\n\nthat behavior, mental health problems, potential problems in school, self-harm, and intervene, and let's help heal these kids. Let's help bring them back into the mainstream and reduce any threat. Now, the next stage is how you deal with the wrongful conduct. We've already made sure we have the school records that tell about their issues. We've already reported problems both out of school by law enforcement and school anonymously. We've got a plan. We've got behavioral health management. As we layer on there, there's a part of the bill that deals with how do you punish inappropriate, unacceptable student conduct? There are certain hard lines, red lines that we have to draw some column in the military, no fly zones. I call them in this context, zero tolerance. There is certain behavior that we are not going to put up within our schools. We can't tolerate it and keep them safe for our children. Center from the 27th had a bill here on Terroristic Threats. And that's one of the bright lines we're drawing in the sand on this bill. That if you make threats to harm other students, kill other students, blow up a school building, disrupt our public schools, that will be treated as an adult offense. We have a list of those already and they're murder and rape and aggravated assault, aggravated battery, other serious violent crimes. And what we're doing here now is saying, if you are making terroristic threats at school to harm other students or interfere with school activities, you're going to superior court. It's up to the prosecutor. They treat you as an adult if you're 13 to 17 and make that a felony offense. One to five years. There are certain behaviors we are not going to tolerate. To make a threat would be a misdemeanor, but you're threatened terroristic acts on school property, then that would be unacceptable, no fly zone, zero tolerance. Happy enough and I can't hit on everything in my time limit is the things I mentioned earlier. We're going to have each school equipped with these type of alert systems. We got them here. You click the button. Some of your admins may have them if you have a health issue or you're in physical distress or if they're worry shooter to come in here. I don't even remember. Public may not know. At the first of every session, we have sort of a school session with our capital police telling us, where do you go? I won't reveal our secrets. We are our safe rooms and we go if we're alerted that there is a shooter in the building. Unbelievable. We have to worry about that in our society. But each school is going to have a panic alert system for their personnel so they can call for help if needed. And each school will have mapping done of their premises that just thinking your head like a floor plan of the school's schematic diagrams, every entrance, every exit, every defibrillator in there, the identity of all the classrooms, hallways, gym, etc. so that if you have to call for help, they know where you're calling from and how to get to you and how to get everybody else out of harm's way. These are the highlights of the bill. There's more to it. I'm happy to answer any questions that any of you may have, but I strongly, strongly encourage your support for this comprehensive approach to help make our school safe for our children so they can learn and socialize and interact and grow up together in a safe environment. Mr. President with that, there are no questions. I will deal with what I'm going to ask for your, your, I want to see unanimous passage of this bill. Do you have one question, Senator? Uh, I'll read it down to Senator from 38. Thank you, Mr. President. Chairman, do you? I know you'll, so I really commend the speaker for his leadership on school safety. One of the big concerns that I have was the addition of Senate Bill 61 to this, this drastically changes his original bill in it, if I point to line 1275 for example, it makes a big change that goes beyond just school safety, does it not? I'll give it to you. It's on page 50. It's 50? Yes, sir. And the change that I'm speaking of, kids who are now can be tried in Superior Court, 13-year-old kid that can make aggravated assault if committed with a firearm. What was stricken was upon a public safety officer as such, acts are prohibited. And so that is beyond just school safety, right? So this could capture, for example, a kid who has been wrapped up in a gang and their lives could be drastically changed, as a result of this amendment. So where you are, this is great, as you all know how our bills act if a line stricken through something, you're deleting from the existing code if it's underline, we're adding to it. We just identified the code section that allows 13 to 17-year-olds to be prosecuted as adults in Superior Court. Murder, murder in the second degree, voluntary manslaughter, aggravated child molestation, aggravated sexual battery, armed robbery if committed with a firearm, and aggravated assault if committed with the firearm. It used to be just on an officer. Now we're saying, if you're shooting at people, you're, you're, you're, you're, you're doing adult behavior, and you need to be prosecuted as adult, and then which still has aggravated battery upon a public safety official. And all we're doing is adding to, and I'll go in reverse order, attempt to commit murder. Already, if you murder somebody and be treated as adult, now it's, you try to kill them and fail, you still are now doing adult behavior and need to be treated as such. And the other one is a terrorist act upon a school, not a threat in acts. But if you commit a terrorist act at school, zero tolerance, you're making adult choices and you need to be punished or treated as one. Right, Mr. Chairman. But you're right. Right now, the law is, if you have aggravated assault with a firearm on a public safety official, you can be treated as adult. Now we're saying, you know, we don't care if it's police off your, your shooting at. If you're trying to kill anybody, if you're shooting a weapon at them, then you need to be treated as an adult because you are a danger to our society. Right. So really that would be three additions or changes. Correct. And that is beyond just in a school safety. This behavior is anywhere except the terrorist act is at a school. Yes, sir. Mr. Chairman, do you have further your performance? Sure I will. You read a few of the things that we've noticed in commonalities between these school shootings across the country, mental illness, lack of parental involvement or as we all know, we tend, then we look back on your social media and see a lot of the warning signs were there. Does this bill do anything to limit assault weapons or deadly weapons, reduce the magazine, capacity or anything? Already. It is already illegal. It's criminal act to take any firearms, own school property. This doesn't touch that. It adds to that. That's another zero tolerance that's already in the law. We do not allow firearms to school. And this doesn't change that and it doesn't change the punishment for that. But that's good policy and I hope we can keep it. I did notice there's an amendment. I didn't have time to study it, but deal somehow with firearms or whatever. Whether that's a good idea or not, I'm not going to comment on it, but I think this is such a comprehensive bill. And it has been so thoroughly vetted through the House through our Judiciary Committee that my hope is we can pass this as is. That the House will agree and we can send the message to Georgia that we hear them loud and clear that our children's safety is. Our most important duty and that we're going to answer in these lives did not die in vain. You know for the questions. Thank you, Mr President. I yield the will. Senator from the board, can you lay the speech of the bill? Thank you, Mr President. I attended at least four schools safety meetings this past November, December. And I would personally like to thank the Speaker, Chairman Erwin, the representative, the person and now our Senate Judiciary Committee for bringing this bill forward. I was very naive when I first started attending these meetings. I thought that we could prevent the violence and schoolments, but through these meetings, I learned pretty fast. It is the best thing we could do is minimize it. And I think in my opinion, that's what this bill does. In Athens, Georgia, back in December, Chairman Erwin and I and some other representatives met with probably 29 schools to attend us. And they're concerned the biggest problem they thought was the transfer of school records. So when a kid comes to their school, they really don't know what the background of that child is or the history of child. Well, House Bill 268 addresses that. It requires all relevant student records to be transferred in a timely manner. What is student transfers? It also addresses allows for a GMM and home and security to establish a statewide alert system to report and monitor incidents of safety threats against schools. House Bill 268 requires all schools to implement a mobile panic alert system, which we know about. House Bill 268 creates a qualified student advocacy specialist. As I've heard in here so many times, certain of 46, there is no perfect bill. And this may not be a perfect bill, but this is a great place to start. I would hope that we would pass this bill. I pray that we pass this bill because we don't need as Governor Kemp has said on so many things. There is no next year to school safety. It needs to be done today. Thank you, Mr. President. I yield a well. Thank you, Senator. We recognize the Senator from the 44th has them speak to our amendment. Mr. President, good afternoon colleagues. I rise to present amendment one. This, like other parts of the bill, is an amendment about education. Kind of in the same vein as the violence prevention and suicide prevention education. And I'm hoping that it is something that we can all get behind. There's no mischief within it, and I'll explain what I mean. So I pulled this from Texas. This also passed a comprehensive school safety bill after the tragedy, tragic mass shooting at Rob Elementary in Uvalde. And as part of that legislation, which was HB3 in 2023, they mandated education about safe storage of firearms to be made available to all parents and guardians of children enrolled in Texas public schools. So through that legislation, they started keeping safe Texas. I put a, I put a flyer on your desk so you can see what kind of sort of educational materials keeping safe Texas, which is within the Texas School Safety Center, would make available on school websites to parents. So the only difference in amendment one and the law in Texas, there's actually one big difference is that Texas actually mandates safe storage. Understand that's not something that the General Assembly is interested in doing at this time. So through Texas' law, they educate, through keeping safe Texas, they also educated about the safe storage laws around minors to the schools. That is obviously not a part of this because we do not have any safe storage laws around minors laws here in Georgia. The only other difference is that I wrote it with the appropriate entities, with what we have in Georgia law for school safety and existing Georgia law and of course under HB268. So you'll see that it references the Georgia Department of Education and Georgia Emergency Management and Homeland Security agencies. These are the entities charged within our law and in this legislation with overseeing the new requirements of HB268. So it's simply an education piece, like I said, not unlike the violence and suicide prevention pieces of 268. I think I view it as a no downside way to try to make our kids in our schools a bit safer. There's no penalties, there's no mandates to any families or restrictions or burdens on any gun ownership. So I view it very much as a friendly amendment. I think it's a win-win for our state and I think that's why they did it in Texas. Now I know most of the time I'm up here yapping about my safe storage bill and putting the misdemeanor provisions in place that I have in that legislation. As I said already, but it bears repeating, this is a no mischief contained educational piece that I think again is a win-win and I am happy to answer any questions about it. You do have a couple questions, Senator. Reagan, I'm Senator from 22nd. Thank you, Mr. President. The General A.L. Of course. One of the things you mentioned here you put on our desk about Texas, can you kind of go into why it's so important that actually a state of Texas and their view on the bars of second amendment is concerned that that would be a good model for us to actually kind of follow too. Well, I think that's a great question, Mr. Leader, and I thank you for it. Look, I mean, none of us, I don't believe, would regard Texas as anything other than a very pre-second amendment state. So this is simply a after-evolty, a raw elementary. They are thinking along the exact same lines as the speaker of the House and rep personer and everyone else that has worked so hard on HB268. And as part of that legislation, they said, look, one of the things we can do is just, like we do with many, many, many other things, our public schools are a good way to get out civic education in sort of an efficient manner. And here it's even more appropriate because we're talking about children, right? So, what this deals with specifically, HB268 and amendment one is the safety of kids. Right? And of course, by association, everyone else in a school building. But we're really talking about children. So, I think that they're way of adding, Texas's way of adding education about safety around weapons for children into their comprehensive school safety bill after-evolty is something that's very much worth the serious consideration of this body, Senator, from the 22nd. And, you know, like I said, I kind of like the branding they came up with. There is nothing in this amendment that says what the language would be or what would be disseminated. That's all to be decided by DOE in concert with our public safety agencies, right? So, this was just kind of an example because that's what they did in Texas. But yes, there's nothing in there about what it would look like or even what it would say exactly, right? But I kind of like how they have the branding of keeping safe Texas with their two pistols because it's a very Texas branded, Texas culturally appropriate way to make widespread ownership of guns like they have there. And certainly like we have here and throughout our country, just more safe and that's all we really want, right? But Senator, you have one other question. Certainly. And that would be one of the things you mentioned was that this is not a mandate of actually any action as such. Can you kind of go into that a little bit further? Yes, no. There's no action mandated. There's no penalties. It's just like anything else that would come home with kids, although this would probably just go on the website of each school, right? As I understand it, as I understand how we typically do this sort of thing when we have said, look, we want parents and guardians to be educated about something through the public schools. And the understanding is that's typically a drop down within each school's website. But yeah, no, there's no mandates, no penalties, no one has to do anything or change their behavior when Iota as a result, just like anything else that's simply education based. The hope is that people will read it and maybe take some steps that they're not taken right now that will make our school safer, make kids safer, essentially. But if they choose not to or don't want to, they don't have to. We're going to have Senator from the 46. Thank you. Well, Senator Yeild. Of course. Senator, would you be willing to stand down on this amendment if I would agree to work with you? It is on it as a separate piece of legislation. It's great policy. Makes sense. Every responsible, apparent or adult needs to keep their farms secure away from children. But I am so concerned that if we change or add to this bill that it slows down a very important issue that my dream is this goes back across the hall, immediate, transmittal, and that they agree. And we have moved forward with helping keep our schools safe. And my fear is that despite your good intentions, this slows down that process and potentially creates an impediment. Would you be willing to consider withdrawing that so we can work on this as an independent measure? Well, thank you for the question, Senator. You know, I'm always, of course, happy to partner with you. One of our most veteran members of the state Senate. And I appreciate your view that this is kind of common sense and doesn't get in the way of anyone's rights around the second amendment. You know, obviously I view it as part and parcel of what's already in the bill regarding violence and suicide prevention and note that it would still be an agree. And you know, but in all honesty, I actually wish I had had time to deal with this a little earlier. So I could have come to you and I could have gone to the author and just with some stuff, with everything going on down here and with some stuff I had to do with my children, I just the time got away from me. So that really would have been my intention. So you know what, let me just say that I'll come and speak with you about it when I get when I get out of the well. And it's certainly something that I would consider partnering with you on. Thank you so much, Senator. I appreciate your consideration and your concerns, my children. Thank you, Mr. Chairman. Thank you. I've got a few people want to speak on this bill. You don't have a question to use. Okay. You want to speak on it. Okay. You don't have any more questions, Senator. Right. Thank you. Appreciate your consideration and I'll go to the well. I'm sorry, the Senator from the 34th, it does have early, she had her other line on, but she does want to ask her question. No problem. Does the Senator you? Yes, I certainly do. I just have one question. Do you know of any other state that has similar legislation? Yeah. I mean, as I was explaining earlier, Texas newly did this type of education after the Rob Elementary shooting, which, and I believe that the Senator from the 46th mentioned that he thinks, and to my knowledge, I think he's correct, that this is kind of the first school shooting of this type that we have had in Georgia. Frankly, we have been pretty fortunate. We do know that for a number of years, you know, more kids have died in a firearm-related incident or accident than other, any other cause, so that's part of why I offered it is because we would like to see that not be the case, right? And so it's really just about keeping people safe. And when I saw that Texas had thought to include it in their legislation, I know that Texas is not a state that's going to make our colleagues here on the other side of the aisle think, oh no, this must be a total gun grabber thing. And you know, that would be my goals to say, hey, if a state that's a second amendment, a prayer second amendment, is Texas, thought this was a good idea. It's worth the of our consideration here in Georgia. Thank you. All right, Senator. No further questions. All right, thank you. I'll go below. Mm-hmm. We're going to send it from the 41st, speak to the bill. 6th year read, the amendment that actually is a center from the 40th versus presenting. Mr. President, Senator Jackson, the 41st, offered the following amendment number 2 to amend the Senate Committee on Judiciary Subtute to House Bill 268 for placing lines 1360 through 1362 with the following. So chapters further amended by revising subsection name, paragraph 2, subsection B. By adding a new subsection to Code 20-2-1181, will you disrupt the operation of public school, school bus, or school bus stop penalty and progressive discipline to read this follows. By deleting the quotation mark of the end of line 1383 and starting between lines 1383 and 1884, the following see nothing in this code section shall be considered to apply to speech protected by George Constitution or the First Amendment to the United States Constitution by inserting between lines 1412 and 1413, the following. B.1 and determining whether a statement constituted a terroristic threat under subsection B of this code section, the trial of fact shall consider one, the full context and circumstances surrounding the disdainment to the person's capacity of form intent and understand their statements, consequences considering their age, education, cognitive development, three, any language barrier, intellectual disability development, developmental disability, cognitive impairment, mental health condition or neurological difference, and may affect comprehension or communication in four, whether a reasonable person fully read this individual's limitations and circumstances would perceive the statement as a genuine threat and further purposes, Mr. President, that completes the order. We're going to ask Senator from 41st. Thank you, Mr. President. In just a few moments, the amendment will arrive on your desk, hopefully, where you'll be able to see this up front. But I want to start by giving some shape to why I'm bringing this amendment. So this amendment essentially provides some measuring tests, some waitingness to determine whether or not a child is actually cognitively capable of understanding the words that they're saying. So why am I bringing this? Because we know in my own county, into Cap County, we had a young person who was over the age of 13 who made, who said some words, who made what, looking at the words alone, would constitute a terrorist threat. However, when you pull back the curtain, we learned that that child had disabilities, that that child really was diagnosed with autism, had clear cognitive diminishingments or in capability to truly understand the full weight, right? The whole purpose, I think, around trying to keep our children safe is that we want to keep our children safe from real threats, from people who are actually intending to do them harm, not from a 13-year-old who has no ability to really cognitively understand the meanings of what he or she is saying, who may just be copying something that they've seen or maybe they draw something on a piece of paper. We want to make sure there's some standards in place. So that those children who, in fact, just need somebody to talk to them, aren't getting caught up in this large web. And I heard the senator from the 46 talk about how he's removed the erratic threats from being charged as an adult. And I appreciate that. I appreciate the work that is here, but I think that it's really important that we protect all children. And that includes our children who may have some cognitive difficulties or may have an English proficiency issue. So they may be saying words that they don't fully understand or maybe even the person who heard it doesn't fully understand. And so this is really, it's a test. It just says, you know, before we determine that this is a tieristic threat, we're going to make sure we look at the full context of the circumstances. We're going to look at the whole child. And we want to make sure that they actually had intent. And then we're going to look at their language. It was their intellectual disability, a developmental disability, a cognitive impairment, mental health condition, or a neurological difference that may have affected their ability to comprehend and to communicate. And then there's this kind of a reasonable list. Actually, I mean, I feel really inspired by the senator from the 37th because he's always talking about these kind of weight-ness tests and reasonableness, right? So this says that there has to be...\n\nWas this a reasonable person who was fully aware of the individual's limitations and circumstances? Would a reasonable person perceive it to be a genuine threat? So I'm just trying to put some safeguards in place for what are in fact some of our more vulnerable children. Our children who are living with limitations cognitively or in terms of their speeds neurologically. And we're going to say let's slow down for a moment. And let's just make sure that that child who we know any reasonable adult knows by looking at all of these different pieces that they did not have the intent. We're going to make sure they don't have to go through a criminal justice process as it relates to criminal or to criminal terrorist threats. Again, this is considered a friendly amendment. I know I acknowledge a lot of work has gone on to create a over 50 page bill already. But I think it's imperative to this body that we consider and that we carve out just a test. Now, I'm not saying that someone who has mental limitations can't actually be a real threat. That's possible. But we just want to make sure we slow down long enough to ensure that that person, that child had real intent that they understood what they were trying to say and that they were actually intending to cause real harm in a school. So again, I know this body. We are a deliberative body. We care a lot for our children. This bill is fundamentally about caring for our children. And I ask that you would consider voting yes on this amendment so that we make sure that children who have limitations are not unjustly caught up in the system because they don't fundamentally understand the words that they're saying as they come out of their mouth. With that, I will yield for questions. Do you have a couple questions, Senator? I'm bringing out the senator from 37th. Does Lady Yulp? Yes, sir. I will. Thank you. This spirit is amendment. We were talking earlier about this. And I like where you go with this. You know, my wife's school teacher. She said circumstances were kids passing notes to each other that communicate a threat or a in writing. I think she said something that would be she can't ignore but she knows it's a joke. It's 14 year old boys, right? My only concern about the amendment is when you online 19 you have paragraph one, two, three, four. There's an an between three and four. All four of these conditions have to exist. You know, I'm not sure that this should be limited to kids that have intellectual disabilities. You would see that this really only applies to kids who are in some way neurodivergent. And that it's a little too narrow that perhaps other tests. I don't know if this should be an or. I just want to know if it's your intention that this should be limited only to kids who are. Have a discrete intellectual disability, developmental disability, cognitive impairment, and mental health condition. As a limiting factor to who this applies to. Yes, sir. Also a language barrier because we do want to acknowledge that some children are English is not their first language. There could be a real language barrier to understanding. Even us understanding what they're saying. We're trying to create some parameters here. We don't want it to be so wide open that all children. I could stand up here and actually make a very code and argument to say, listen, no child's brain is fully developed. And so, you know, we know from brain science that they should not even be charges in the adult because their brains are fully developed until 25. We could do that. I could make that argument. But we're not doing this here. We're limiting it to say, no, you need to look at the whole of the totally child and they do need to have either an intellectual disability, developmental disability, cognitive impairment, mental health condition, neurological difference, or a language barrier. Like we are limiting it because I think that that's right. We don't want to, this body has made it clear to me that we do not want to open it up. This body continues to decide to prosecute children who are 17 and older as adults. We've made some clear definitions. The senator from the 46 said they're making adult choices. They're doing adult things so they're going to have adult consequences. So I think it is right to confine this to children who have clear and known. It's also something that can be tested. There's documentation that can help us know whether or not we're failing this. So it's not just kind of one teacher's understanding, well, I think this child. So I hear you, senator, I have two little boys and I'm sure one day they will be bigger and they will say things that I really wish that they won't say. But at the end of the day, I think my responsibility here is to protect the most vulnerable. And I think that it's our children who have these limitations who are most vulnerable and who need to make sure they have some added protections here in the law. So that's what we're seeking you to do. Thank you. No further questions, Senator. Thank you. Again, I ask for your favorable consent, your favorable consideration as we consider this amendment number two. Thank you. Senator from the 46, you like closed the bank? I'm sorry. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. This very brief, because we got a lot of other bills to deal with. I can't imagine one that's more important than this one for us this year. Maybe, you know, in our careers, these amendments are not bad concepts. It's a lot of common sense in them. Senator, from the 41st, just raised some concerns that were raised in subcommittee. There were a couple of parents that were not proficient in English. And they were not. And that had been sort of lack of a better term falsely accused of making some threats. I think one of them had disabilities as well. And didn't, you know, maybe have the cognizance of what was going on. As it turned out in both of those instances, the disciplinary process worked and they were not punished. One of them maybe was, but got it reversed. I can't remember the whole details. I really appreciate the spirit of these. But the timing is wrong. I've already stated now publicly, I support the policy on the first one. The second one I really think is already in the law. I mean, the first line is that nothing in this code section is due to plot of speech protected by the Constitution. First amendment. Well, that's true with anything we pass. We can't violate constitutional right to free speech, et cetera. So even if we put something in language, the interpretation, the application by the courts would not allow us to do that. The rest of these factors that should be taken into account essentially deal with the intent of the actor. Did they intend to commit the crime? That's an element of the crime. The way of good defense council would raise those. We learn early in law school, first year law school, think back to the paper chase. Any of you old enough to remember that in criminal law, men's ray is the Latin term for having the requisite intent, criminal intent to do something. And all of these address that. I really feel like all of these deal with Senate Bill 61 that talked about the criminalization of terrorist threats. And these would more appropriately have been handled during our committee process, our floor debates on those issues rather than bring them up this late in the game. That's one of the beauties of this body is that we have free and open debate. We are known as the deliberative body because we're allowed to amend bills even on the floor. And if they're great ideas, you know, any time's better than the no time. But I may not. Let's don't take a chance of not passing this bill. Let's don't do anything to put sand in the gears that gives the other side of this building a chance to say no. And then come back and make other changes and let's go tit, tit, tit for the next couple of days because we are on day 38. We got two more days to hammer all any differences out. So I would ask us to reject these amendments, not based on the policy, but based on the timing and the potential that we could foul up. Maybe the most important thing we do this session. So I will work with anybody going forward. That is a great thing about this system. We're in. Every year we come back and we correct mistakes we made before we perfect things and we take them a step further. And hopefully that's what we're doing on school safety is we're setting the foundation and we're going to keep on going higher and higher and better and better year by year. But I would ask that we reject these amendments just so that we can pass this 57 page bill that does so much good. So for those reasons I ask for you to reject both amendments if they're not withdrawn. And let's all work together collaboratively going forward to see if there are ways we can perfect our legislation or give additional provisions to protect children in all aspects. Thank you so much. I yield the well. All right. Thank you, Senator. I was recognize from the 44. Thank you, Mr. President. In light of my conversation at the well with the senator from the 46th and his willingness to work on the policy that I'm trying to get it here in amendment one. I'd like to ask unanimous consent to withdraw amendment one at this time. All right. Is there is there objection? Senator's answer to draw her amendment. Objections. The amendment is withdrawn. Okay. So we are. The question is going to be on adoption of amendment number two. So someone was withdrawn. Is there objection to amendment number two, either by the senator from the 41st? That's the same. All right. All those in favor of the amendment will vote. Yay. All opposed. Nay. Secretary and lot of machine. Thank you. All right. All in the adoption amendment number two. The guys are 25 and the nays are 29 and this amendment has failed. Is there objection to the adoption of the committee substitute? Is there objection to agree to the 40 committee which is favorable to the passes of the bill? Chair here is none. The 40 committee is agreed to. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. The question is on the passes of the bill by substitute. All those in favor of the bill vote. Yay. Opposed nay. Secretary and lot of machine. You have passed by substitute. All the passes of the bill. Yay. All the passes of the bill. Yay. The nays are 9. This bill has received constitutional majority. Therefore, passed by substitute. Secretary, read a message from the House. Mr. President, the following message was received from the House. Mr. Riley, the clerk thereof. Mr. President, the House insists on its position in disagreeing to the Senate sub-sudent as appointed committee on conference to confer with the like committee on the part of the Senate with the following bill of the House House House. Is there objection? Here is no objection. Even from the caveman corner over there. The conferees will be the approach to the Senate from the 18th and majority of the leaders from the 21st and the appropriations to the Senate from the 19th. Let's get on with the budget done, guys. And then we can just adjourn out of here on Wednesday. What do you all think? There's not much left on the calendar for us to take up. Mr. Secretary, read House bill 288. House bill 288 for our president of the gains the 118th and others. Bill's main title tonight to men article 2 chapter 6, title 5, chapter 4 of title 9, article 1 of chapter 18 of title 15 and chapter 16 of title 17 of those CGA to appellate to appellate practice. Mr. President of the Senate Committee on Judiciary recommends that this bill do pass by substitute respect please minutes and a strictly chairman. Mr. President of the Senate Committee on Judiciary Office following substitute to House bill 288. Bill's main title tonight to men, title 15 of those CGA to court says to require a person qualifying as a candidate for sheriff, the app solvacer, not under revocation by the Georgia Peace Officer Standards and Training Council and for other purposes, Mr. President, I complete the order. Record as the Georgia Sheriff chairman for the 40 second. Thank you, Mr. President. Members of the Senate House bill 288 does two things first in section 1. It revises the qualifications for serving as a sheriff in our state to make certain that our sheriffs are post certified. The exception will be as you'll see in section 1, individuals that are former military, former law enforcing our first responders, they can get qualified within six months have your taking office and become post certified. The rest of bill deals with what's called a giggly list and this is where an officer has been placed on a list based on issues with their credibility as a witness when it comes to testifying criminal matters. We're creating due process for the officer to make sure they can be aware of the fact they've been put on this list and respond to that and try to object to it. In second, we're also making certain that post gets notified of this. So post could deal with any officers that need to have this one reaction as a result of that. Happy answering questions. One question, Senator. We're going to have a senator from the 53rd. Thank you, Mr. President. Will the sender yield? Yes, sir. So help me understand what is current law. If I want to run for sheriff and I'm not post certified, can I do that? Current law, you'll see in the bill yet to be a registered peace officer or as a certified peace officer. So I guess it depends upon the definition of registered peace officer right now versus someone that's certified as a Georgia peace officer standing centers and trains council. And also making certain someone has not had their certification in vote. And so I'm not sure exactly the difference in that definition. It's not in the bill as to what a registered peace officer is, but we're definitely making that certain now as well as the work. So what exactly is section one doing in your bill? So it's creating a standard where you have to be post certified. You can't have your post certificatory votes to run with the exception being first responders, former law enforcement or federal law enforcement that can still run and qualify to be sheriff. They must then get that training within six months of being elected. And that reflects current law within six months of being elected. That is a new change in the law. I have one more question, Senator. Regan, I'll send it from 15. Thank you, Mr. President. Senator Eam. Yes, sir. Just clarification on the last question from the center, the third. Did you say the change is now that before you run, you'd have to be post certified. Is that correct? It's at the time of qualifying as a candidate for the office. That's correct. With those exceptions being the individuals that can get the certification within six months of taking off. Oh, that's the same. That's the second one. That's correct. Ask your favorable consideration of House Bill 288. Thank you. Thank you. Yeah, I'm all right, man. Does any other senator which speak for against measure? Chair, here's none. Is there objection to the previous question being ordered? Chair, here's none. A previous question is ordered. Questions on the adoption of the committee substitute? Is there objection to the adoption of the committee substitute? Here none of the committee substitute is adopted. Is there objection to the Green to the Board of Committee, which is favourable to the passes of the bill? Chair, here's none. Board of Committee is agreed to. Is there objection to the main question being ordered? Chair, here's none of the main questions. Order, questions on the passes of the bill by substitute. All those in favourable vote? Yes, all opposed. Nay. Except chair and lock the machine. you you than to the CGA, we would like to add a culture. So, as to transfer the center for role prosperity and innovation to the Department of Agriculture, to our Director, to our assumptions and business and responsibilities to the Centers of Innovation, Agrary and Business, and collaboration with other entities, to our really Georgia World Development Council, to our fiduities of satellite offices, to our reference, to our reporting, and approval of strategic plans, to our related matters to build a lifting laws and further purposes. Mr. President, thank you, and our culture and consumer affairs recommends a disability pass or cyclist minutes and a goodman chairman that completes the order, Mr. President. We're going to send it from the 11th. Thank you, Mr. President. I'll be brief. This is House Bill 495. This is just moving the Center for Real Prosperity and Innovation from the Board of Regents over to the Department of Agriculture. We've already done that move in the budget, so we're just having to do that in statute. This is a great organization that works on a lot of our rural issues, a lot of our rural communities don't have staff and resources, and this Center that helps them not only from things like that and admin, but also grant work and just helping folks in rural Georgia. That's all I've gotten, I think I take the question, if there are any. Well, you have no questions. Thank you, Senator. Man of your integrity, they believe everywhere, it comes out of your mouth. Does any of you other Senator wish to speak for against the measure? Chair here's none. Is there objections to previous question being ordered? Chair here's none, previous question is ordered. Is there objections to the Green to the Board of Committee, which is favorable to the passes of the bill? Chair here's none, the Board of Committee is agreed to. Is there objections to the main question being ordered? Chair here's none, the main question is ordered. Questions on the passes of the bill? All those in favor of vote, yeah, you pose now, you say, Chair, I'll not move. I'll not move. All in the passes of the bill, the yeas are 15 and the nays are won, this bill hasn't received recisting Constitution, the majority is there for pass. Section 6A read, House Bill 303. House Bill 303. House Bill 303, the Senate of Guiliard, the 162nd and others are between town and act to men, Chapter 305, those in GAA, what's your state flag, sealant other symbols, let's provide replacement of a monument to honor the original 33 to arrive for short title, to arrive for late a matter, should be with the milking laws and for other purposes. Mr. President, the Senate committee has stated to institutions and property, recommends that this bill do pass, the request minutes and a harboursin, Chairman, that can be seen, or the vice president. I'm pregnant as a senator from the six. Thank you, Mr. President, colleagues. In 1868, we had 33 African-Americans that were elected to the Georgia General Assembly and they became known as the original 33. And what this bill does is it will honor those 33 men and as a person that believes there are no coincidences, 33 is an important number in this state, 33 represents the number of points on a compass, also known as areas. And I think that's important to understand today because in 1865, our country took a new direction and so these men represent that new direction that we took. They represent the direction that we continue to take as a state, always moving forward. And this simply is going to honor those men and we will honor them by placing a monument on Capitol grounds or in a prominent place around this Capitol. We're building a new building that could possibly be a good spot. And just simply honoring their sacrifice that they made back then when they went up against all odds. And that is simply what this bill does. Now yield for questions. I will add that this is just like any monument that goes up here, it is based on subject to availability of private funds. So it is a privately funded venture. I'll yield for questions. You have no questions, Senator. Thank you. Are your federal consideration for HP 303? Does any of the senator would speak for against the measure? Chair, is there objection to the previous question being ordered? Chair, is none of the previous question is ordered? Is there objection to agreeing to the Board of Committee which is favorable to the past of the bill? Chair, is none of the Board of Committee's agreed to? Is there objection to the main question being ordered? Chair, is none of the main question is ordered? Questions on the past of the bill? All those in favor of the bill vote. Okay, pose na a secretary and a lot of machine.\n\nyou you exemple remember the Georgia lottery for education next as the director of reference. Drive for the application of provisions of the Georgia and ministerial procedure act to certain provisions of the code related to bona fide co-operated amusement machines. Drive for exemptions from the Georgia and ministerial procedure act regarding the Georgia lottery corporation for certain matters not related to bona fide co-operated amusement machines. Drive for related matters. Drive for effective dates. We'll be able to look at the laws and further purposes. Mr. President of the Senate, come down to economic development tourism. Recommended this bill to pass. It was speculated that it's an obese chairman that completes the order. That was the president. Good night. Senator from the 45th. Thank you, Mr. President. colleagues I bring HB 74 before you today. This bill it simply places the CoM division of the Georgia Lottery Corporation under the Administrative Procedures Act, House Bill 74. It fixes an error from last year's CoM bill and it just places all licensure rules, regulations, policies, procedures, and hearings under the Administrative Procedures Act. With that Mr. President be happy to answer any questions or I'll yield the well. Thank you Mr. President I yield the well. You have one question. Senator from the 19th. Thank you Mr. President. Senator I do. Senator are there other entities that are not found underneath the Administrative Procedures Act? No there are. Would it be do you think we need to take another overall look at maybe well first I guess why would any agency not be bound by the Administrative Procedures Act? Yeah I don't have an answer for you there. Would you be willing to work on me in the future to potentially remedy the fact that some people do not have to provide notice when they provide rules? Yes sir. Thank you. Absolutely. New more questions Senator. I yield the well. Does any other Senator wish to speak for against the measures? Is there objections to previous question being ordered? Chair here's done. Previous question is ordered. Is there objection to agree to the report of committee which is favorable to the past of the bill? Chair here's done for the committee is agreed to. Is there objections to the main question being ordered? Chair here's none. The main question is ordered. Questions all the passes of the bill all those of favor vote yay pose nay secretary and lot of the machine. On the pass of the bill the a's are fidget one the nays are zero this bill haven't received a rickston constitutional majority is there for pass. We've got another message from the house here. Mr. President the following message received from the house to Mr. Raleigh clerk there of Mr. President the house is passed by the requisite constant constitutional majority the following bills of the house and senate house bill 111 by Arizona bill 175th and others the bill between town act divided home side exemption from Lowns County school district of Florida taxes for educational purposes and amount of $40,000. House bill 813 by representable hood of 174 house bill 814 by representable hood 175th and others house bill 815 by representable hood of 175 house bill 816 by represent roads 124 house bill 819 by represent washroom 144 house bill 820 by represent washroom 144 house bill 823 by represent a weighted 9th and others house bill 824 by represent a weighted 9th senator from the 14th what purpose you rise. Parliamentary agreement Mr. President. State you're inquiring. I never really thought about this is it my understanding is it correct that you have the ability to just send a message to the house and they can send messages back to you using the secretary's office as an official channel is that not true. Some would say that is. And Mr. President is it not true that up till now we've wasted that awesome power on a bunch of boring reading of bills and chamber activity when we could be sending we could be passing fun notes to the house Mr. President. You know you're exactly right senator and maybe in these last two days remaining maybe maybe we can come up with some things. I'll help you come up with a note to send the house Mr. President. All right that sounds great. I look forward to that you'd be our new communications czar. There we go the messenger we just the czar right there the senate messengers are. Senator for the 31st what purpose you rise. Parliamentary inquiring. State you inquiring. Is it not true piggybacking off the senator from the 14th and every single one maybe almost every one of those bills coming from the house as a statement that Georgians want lower property taxes. All right. Senator you're reading deeper into it than what I expected. Regan I send it from the six. Parliamentary inquiring. State you inquiring. Mr. President if the senator from the 14th is going to be our new communications czar would it not be good for the senator from the 53rd to actually deliver the messages force. That's a great question. That's a great question. We'll send them together. Just in case one message didn't get there. Senator from the 53rd you have a rebuttal to that. Point of order Mr. President. State. I'm scared for my safety when you're scared you're supposed to say you're scared. I'm going over the house. I just want to send a message statement of fact. Fire burns. All right. Moving on. Moving on. House bill 94. Secretary Reed House bill 94. House bill 94. Representative Lumpton the 12th another is the bill between 10 and 9 to men chapter 24. Title 33. The official go to Georgia annotated related to insurance generally says to require coverage for certain expenses for San refer to the preservation services. When a medically necessary treatment of cancer, sickle cell disease or a little bit may directly directly cause an impairment of fertility. So I for definitions, right for exclusion, so I for certain cost sharing requirements, right for rules and regulations, right for related matters, right for effective dates, to repeal the looking laws and for other purposes. Mr. President of the thank you. And insurance and labor recommends that this bill do pass by substitute respectfully submitted center Walker chairman. Mr. President of the thank you. And insurance and labor office following substance due to house bill 94. Bill to me, tell tonight to men chapter 24. Title 33. The official go to Georgia annotated. Well, it's you insurance generally says to require certain health benefit policies to who coverage for certain expenses for San refer to the preservation services and for other purposes. Mr. President, Senator Huff, settler of 52nd, I was the only amendment number one to amend the Senate committee substitute to house bill 94 by replacing lines 17 through 20 with the following. Policies or contracts executed by the state such terms shall not include self-funded employer. Mr. President, I complete the order. We recognize Senator from 52nd. Thank you, Mr. President. This bill is brought by the insurance chair of the House. And the word for today is, after genic and after genic illness is one that's caused by medical treatment. In this case, we're looking at lupus, sickle, cell cancer, where the chemo radiation, things like that could potentially make somebody sterile. So what this bill would do would say that this doesn't make insurance cover in vitro fertilization. It does say that the harvesting of such as the eggs would be covered and storage of up to a year would be covered. So this would let you store the gametes for up to a year under insurance. And the reason for the amendment was that I heard that Albat Secondhand, that the administration, one of this amendment on there, because it would make it revenue neutral, in which case they would look more favorably on it, which I guess that means they wouldn't veto it. I'm not sure. Anyway, I would urge your favorable passage of this bill as amended by amendment one. There's no questions. Are you able to? You do have one question. Senator from 47th. With the century yield, certainly for my back row seat mate there. You know, I'm checking my spelling. I hope you won't look at it when you tell me, but that word that you mentioned of the day, can you spell it without looking at it? I-T-R-O-G-E-N-I-C. I believe this is spelling. You win the prize. No further questions, Senator. Does any of the Senator would speak for against the measure? Is there objections to the previous question being ordered? Chair here is done and previous question is ordered. Questions only adopt some. Oh, we met. We got a adopt. We got amendment one here. Zee by amendment one authored by the Senator from the 52nd. Is there objection to amendment one? Objection of amendment one is adopted. Questions on the adoption of the committee substitute as amended. Is there objection to the adoption of the committee substitute as amended? Hearing none, committee substitute as amended is adopted. Is there objection to agreeing to the report of committee which is favorable to the passes of the bill? Chair here is done and the forwarder committee has agreed to. Is there objection to the main question being ordered? Chair here is done and the main question is ordered. Questions on the passes of the bill? All those in favour of vote? Yes, all opposed? Nays, they're turned on the machine. You All in the passes of the bill, the a's are 52, the nays are 1. This bill haven't received the rest of the constitutional majority. Is there for pass by substitute? Objection of second t投 reserved to the. Chief. Beat the one, two, two. I want to propose a minimum tax basis. For vielleicht not receiving the correct date as the chevour is contestous ordered. for definitions, by for notice of intent to claim intellectual disability, to write for pre-shout discrimination of one intellectual disability, to write for verdict, to write for a capital case procedure, to write for reports, investigating reversible errors, to write for saying reviews, to write for related matters, for building a law and for other purposes. Mr. President, the Senate Committee of the judiciary recommends that this bill do pass by substitute, which by please submit its interstrictly in chairman. Mr. President, the Senate Committee of the judiciary, I was following substitute to House Bill 123, Bill Twin, Title Act 2, and Title 17, to the LOSTGA, with the acronym procedure. So, it's for write for pre-shout proceedings and capital funds cases where death penalty is sought when the accused has an intellectual disability and for other purposes. Mr. President, that completes the order. We're going to have a senator from the 42nd. Thank you, Mr. President. Members of the Senate, House Bill 123, is ensuring that when we seek justice for capital crumbs in our state, we're not sentencing to death those with intellectual disabilities. We're creating now a pretrial process before a case gets to a jury, where the issue of someone's intellectual disability can be decided by the judge. The burden will be on that defendant to prove by the opponents of evidence that they have an intellectual disability. And if the court finds that they do, then the death penalty is off the table. This is a bill that has been worked on for, I think, three years by Chairman Workhizer, who's in the Chamber with us today. It's something that he's put a lot of time into. I also want to commend the Southern Center for Human Rights, Mike Adder, Admiral Rand, if I can say his name correctly, Senior Attorney with them, and also our prosecutors that all work together to make sure that we got this bill in the right place. Happy answering your questions. Do you have one question, Rick and I are Senator from the 29th. Thank you, Mr. President. Mr. Chairman, you? Yes. Thank you. Briefly, and I thought you did a great job presenting the bill. Could you give us a brief explanation of the difference between reasonable and preponderance? So the current standard is beyond reasonable doubt, which is our highest standard in every criminal case. The state has a burden of proving beyond reasonable doubt someone to commit a crime. A jury would actually decide an current law, which is the way intellectual disabilities consider an current law, at the phase of the trial itself, considering the actual guilt or instant of the person being charged with a crime, they could decide whether or not that person is guilty beyond reasonable doubt, but also has intellectual disability beyond reasonable doubt. With this bill we're moving it to preponderance of evidence standard, meaning that more likely than not, the defendant must prove, have the burden that they have intellectual disability with a pretrial hearing. Thank you, Senator Furley-Yield. Yes. So in hearing your explanation, does the burden shift and this legislation for where the burden would be today? Yes, the current burden is on the state to prove, just like any other criminal case, to prove the offense itself and the jury must then decide whether or not there's intellectual disability in that process. So I guess the way you're asking it, state's not proving intellectual disability, but the jury's deciding that beyond reasonable doubt. We shift this now on the front end for the defendant to prove by the ponderance of evidence that probably bring an expert in someone that would testify on from a judge in a pretrial hearing that they have intellectual disability while still preserving the trial option. And so at trial by preponderance, bill tend to be consistent, a second phase of a trial could happen where someone could still prove, yes, I'm guilty, but I had an intellectual disability when I committed that crime. The outcome would be that person cannot be sentenced to death, but in the judiciary committee, we also left the option of life without parole for the sentence in court. So someone that is a true threat to society that we're not gonna have subject to the death penalty, we also know that some people have to stay locked up and that option will still be there for the state of course to seek. And Senator further yields, the life of that parole was that added in on the Senate side? Is that added? What was the question? The life without parole option, was that put in on in Senate judiciary? It was the current law you have in these situations in looking at again after the trial itself, the current process is you just have a life sentence and not the death penalty. Since we're creating this new pretrial process with a lower standard, we still are not gonna have the death penalty obviously, but we left the option for life without parole, knowing that again, some people why they may have a disability still or such a threat to society that it should not be let out. Thank you, Senator. Yeah, no further questions. Ask for a Facebook consideration of House Bill 123. Thank you. Does any of the Senator Westerby for against the measure? Is there objection to the previous question being ordered? Chair here's not an previous question, is it ordered? Question is only adoption of the committee. Substitute is there objection to the adoption of the committee? Substitute. Hearing none, committee substitute is adopted. Is there objection to agreeing to the Board Committee which is favorable to the passes of the bill? Chair here's not an important committee is agreed to. Is there objection to the main question being ordered? Chair here's not an main question, is ordered, questions on the passes of the bill by substitute, all those in favor of vote, yay, pose, nay, secretary, and lock the machine. All the pass to the bill, the yay's are 53, the nays are one. This bill haven't received the constitutional majority. Is there for pass by substitute? Secretary, House Bill 144. House will 144, we're representing the Newton, the 127th and others. The ultimate time to manage chapter 7, type of 48. The Fish, Gros, Georgia, and the table will add to income taxes. So it's revising tax credit for certain medical perceptual rotations that have done to street increase the value of the tax credit. Tribes definition is required for an aggregate annual cap to extend the sunset provision for tax credits. For all those related matters, for the effective date and applicability to repeal some looking laws and for other purposes. Mr. President, thank you, Madame Finance. Recommend to this bill to pass, for the sake of spending, it's in your House, that will be chairman. Mr. President of fiscal note has been attached, and I can reach the order. I can ask Senator from the 50th second. Thank you, Mr. President. This is a renewal of the Sumed to Sunset Presetor Program that we have in the state. It would extend it another five years through 2030. It would begin January 1st next year. The other addition is that besides physicians, advanced practice nurses and physician assistants that dentist would now participate in this program. I believe there were about 18,000 of these training programs to get one of these credits. You train a student for 160 hours, and you're not paid for the training of the student. It's just a volunteer thing. With that, I urge your favorable consideration. I'll answer any questions. No questions, Senator. Does any other senator who would speak for against measure? Is there objection to previous questions being ordered? Chair, has none of the previous questions ordered? Is there objection to agree to the Board of Committee, which is available to the past of the bill? Chair, here's none of the board of committee is agreed to. Is there objection to the main question being ordered? Chair, here's none of the main questions ordered. Chair, here's none of the main questions ordered. Questions on the passes of the bill? All those in favor of the bill vote. Yeah, you opposed nay, secretary, and a lot of the machine. Thank you. The bill is on the pass of the bill. The a's are 48 and the a's are five. This bill hasn't received a constitutional majority. There's four pass. The bill is on the pass. Secretary, House bill 153. 153. House bill 153. Barrow of its November 1, 35th and others. Bill, we have an act to amend. Section 48-8-3.2. The official go to Georgia. Annotated or do sales and use tax exemptions from manufacturing equipment. Industrial machines, packing supplies and energy. So to extend the sunset date for an exemption for the maintenance. And replacement partners are machinery or equipment used to make sure transport concrete to run for later matters. People from looking to laws and for other purposes. Mr. President, the second we have finance recommends that this bill to pass. Respect with minutes and repost to our chairman. Mr. President, the official has been attached and that completes the order. Chair recognizes the senator from the 25th. My senator. Thank you, Mr. President. This is a very simple bill. This is deals with the concrete mixing trucks. And we have passed this bill a few years ago. All we're doing is extending the expiration date from 2026 to 2031. I ask for your favorable consideration and I'll yield the will. The second is a Senator. Senator. Is there objections or previous question being ordered? Is there objection to agree to the board of committee? Chair has done. The board of committee is agreed to. Is there objections to the name? The question being ordered. Chair has done the main question. Is the question is ordered. Questions on the passed of the bill? All those favor of the bill without egg. Opposed, no. Secretary will unlock the machine.\n\nyou on the pass of the bill the a's are 44 the nays are seven this bill him received the six year house bill one fifty five house for one fifty five percent of the end of the ten of the others built me down an actual seven chapter thirty six of title thirty six of the future good Georgia annotated what you procedure for solving annexation disputes so to revise procedures for the select an objection to arbitrators provides how arbitration panels report their findings and recommendation to rise for the president of the state committee and state of government operations general recommends this bill to pass by substitute for slightly submitted senator Dixon chairman the president of the state committee and state of government operation general offers to allow substitute the house bill one fifty five it builds me ten nine to men or the close to thirty six of title thirty six of the future good Georgia annotated what you procedure for solving annexation disputes for the select an objection to arbitrators and for other purposes Mr. President has to the fifty eight and others offer the following amendment number one to amend this the substitute to house bill one fifty five by inserting after definitions online twelve the following to amend code section thirty six that thirty six that's twenty those to get related to contiguous area defined says to revise provisions for certain properties owned by municipalities by the certainly after line four seventeen the following part of the second section two a-one code section thirty six that thirty six that's twenty of those cga way to contiguous area defined is amended by revising subsection c as follows c if at the time annexation procedures are initiated the entire area to be annexed is owned by the municipal governing authority and further purposes Mr. President that completes the order bring it on the center for the forty nine thank you Mr. President good afternoon colleagues you guys have probably at least some of you probably had some issues with annexations and in and around the areas that you that you live in hb one fifty five seeks to get some clarity on some of that over the past couple years the Georgia Department of Community Affairs has been able to find enough panels to serve on these panels for a lot of reasons including the increase of the number of these cases also alike a qualified people and volunteers to serve on the panels a very limited fifteen day timeline to establish the panel they say that's not enough and that's not enough for the last two years and that's not enough for the very limited fifteen day timeline to establish the panel they say that's not enough and then also the pay that those panelists receive so what happens is when dca fails to establish a panel the department ops to dismiss the annexation all together in favor of the the city so a couple points here it improves the timelines for these arbitration panel selections it extends that timeframe for dca to propose the annexation arbitrations panelists from fifteen calendar days to fifteen business days it also gives dca the time it needs to properly review the objections and propose qualified panelists it's a fair process for the panel selection once the panelists are proposed both the city and the county have five calendar days to strike certain panelists it maintains a forward momentum in those cases if either party chooses not to exercise their right to strike the process continues in dca retains the authority to appoint the panel and keep disputes moving forward the second part of the the bill deals with special administrative permits that are intended to simply be administrative approvals so they can be done reasonably and quickly for property owners or petitioning a business or applicant the legislation reverts simply reverts the special administrative permit process back to its intended administrative review process and also allows for direct appeals of zoning decisions to expedite the legal process when a zoning decision is challenged and the president of the question senator from the 42nd senator you of course from the 42nd I really appreciate your attitude I just wondered if you can weigh in on the potential amendment I see I believe it was on this bill and I'm going to let him speak on that and our good neighbor representative Anderson in between this is his legislation and he's kind of stuck dead senator myself and the senator from the 50th so I'll let senator from the 50th speak on the amendment okay I just want to make sure you lift the collar and are still what was in the amendment thank you thank you sir we're going to send you have a couple more questions you free yield at any time I yield the well you yield the well probably wise actually does any other senator which speak for against the measure recognize the serve from the 50th to speak to his amendments thank you miss president I rise to ask your support on amendment one what amendment one deals with is something called spoke annexation and it's a provision in state law where essentially a city they can follow a road a creek a river or anything like that that creates a spoke and can annex land along that highway or river we're starting to see this more and being from northeast Georgia no offense to those that live in Atlanta but I really don't want to land at an ex anything in my county we're also the head of the chat of Hootsie River so technically they could follow the river and annex and I just I don't think I'm not doing away with spoke annexation completely but what we are doing with this is not only does it have to be approved by the governing authority of the county which is the county commission but if you are going to do spoke annexation it also has to be a referendum on the ballot that the residents of the county have to vote for and approve before the annexation can occur and I'm happy to answer any questions you do have one question senator Rick down the center from the 14th thank you miss president senator yield is it not true that although you may not want Atlanta to annex parts of your county Atlanta has been considering quite the most beautiful parts of your county for annexation may be potentially to annex them into the beautiful city of Atlanta because you know we have a right to do that is that not true mr. senator I think everybody's trying to get a piece of our county it is God's country thank you senator senator from the 44th thank you mr. president with the germanium I will senator I would like you to let this body know what your official position is on the annexation of a greenland and be Canada by the united states of America I can assure you this there I to my knowledge there are no highways or rivers that connect Georgia with either of those so this would only affect things in the state of Georgia sounds like you're against those thank you senator thank you no that is president I will yield the well thank you does any of the senator which speak for against the measure chair his none his objections the previous question being ordered chair here's none previous question is ordered question is on amendment number one senator I'm sorry would you like closed debate all right I'm glad you did such a wonderful job before I don't think I need a closing or amendment number one is there objection to amendment number one object objection we do have objection from the center from the six all right would you like to speak to your objection senator just want to vote it up or down huh all those in favor of amendment number one vote yeah you pose nice secretary and lot machine he didn't know why he was objective just one object you the on the adoption amendment number one the a's or 47 the days are four and this amendment prevails is adopted questions on the adoption of the committee substitute as amended is there objections to the adoption of the committee substitute as amended hearing none the committee substitute as amended is adopted is there objection to agreeing to the port of committee which is favorable to the passes of the bill chair here's none for the committee is agreed to is there objections the main question be in order chair here's none the main question is ordered questions on the passes of the bill by substitute all those in favor will vote yay opposed nay secretary unlike the machine senator from the 36 I thought you want to end eight something to you from Atlanta on the okay all right so would you all would you like to speak to your objection no did I hear the you were drawing how about we do it on the hand gesture you a draw okay all right so we will table the rest of the bills we're going to take about a 15 minute break to allow the secretary to get everything in order and then we'll reconvene here the the the does he he doesn't have it all I'm just playing he never had it anyways",
  "updated_at": "2026-02-13T13:30:23.612825+00:00"
}