{
  "video_id": "5JO1WmsCODY",
  "url": "https://youtu.be/5JO1WmsCODY?t=921",
  "title": "Georgia House - Day 17 (2026-02-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 17,
  "video_date": "2026-02-13",
  "duration_minutes": 165,
  "summary": "Here is a summary of the Georgia House session from 2026-02-13:\n\n**Overview:**\nThe session featured a prayer and scripture reading by the guest chaplain, followed by routine procedural matters. The notable item was the introduction and first reading of HB 74.\n\n**Key Actions:**\n**HB 74:** Introduced and referred to committee\n\n**Bills Introduced (First Reading):**\n- HB 74\n\n**Notable Moments:**\n- Guest chaplain Jason Hampe delivered a sermon drawing parallels between biblical shepherds/sheep and legislative leaders/constituents.\n- Representative Meredith Hilton was recognized and wished a happy early Valentine's Day by her husband, the committee chairman.\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nQuorum present, all members voted to signify their attendance.\n\n**Adjournment:**\nThe session was adjourned. The next session date was not specified.",
  "transcript": "All members, if you'll please come to the floor. All members, if you'll come to the floor. The hour for convening having arrived. All members, please come to the floor and take your seats. Mr. Clerk, will you ring the bell? All members, we've gone to the floor. All members. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? All members voted. All members voted that you're present. All members voted. If so, the clerk will have one on the way. All members vote of this. Mr. Clerk, will you lock the machines? Doorkeepers, please close the doors and keep them closed. As is our custom, we will begin our day with scripture reading in prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the ninth house district representative, will we? Thank you speaker or colleagues. I'm very thankful and blessed to be here today to introduce our chaplain of the day, a friend of mine, a farmer, a father, and actually he was taught my dad in middle school. And so it was his wife. He's been a long time family friend. And I want to make sure my friend from the 168th doesn't get confused because this gentleman is the pastor at Liberty Baptist Church. But it's in Dawsonville, Georgia. And we're very thankful to have our pastor of the day, my friend Jason Hampe. Thank you. Thank you. Representative Wade, speaker Burns, and to each member of the house. Thank you so much for the leadership that you do for this great state of Georgia. We consider it quite an honor to be able to stay in before you today to share with you from God's holy word for just a moment. I'm told five minutes so that's what we'll try our best to go with. Through much prayer we've sought the scripture for the day. And as I see in this scripture for the day our mine and heart went back 3000 years ago to a young man by the name of David. He was chosen by God to be the king of Israel. David, his life, started out as a young shepherd much like so many young boys in Israel at the time. He was taught to be a shepherd. He was taught to take care of the sheep, to take care of the flock. As he grew he saw the sheep in peril. He saw them in need and he worked to overcome those needs. In due time there was a prophet by the name of Samuel that had nodded him to be the next king of Israel soon. He became a leader of the troops of Israel. In due time as a man he became the king of Israel. It was much later in his life that he said he wrote back and he reflected on his life how although he had been a leader he was always led. He wrote the 23rd Psalm which I'd like to read to you today very familiar. I know King David wrote the Lord as my shepherd. I shall not want. He makeeth me lie down in green pastures. He leaped me beside still waters. He restored my soul. He leaped me in the pads of righteousness for his name's sake. Ye though I want to the valley of the shadow of death I will fear no evil for thou art with me. Thou rod and thy staff they comfort me. Thou preparest a table before me in the presence of mine enemies that I know on his my head with all my cup runeth over. And he concluded by saying surely goodness and mercy shall follow me all the days of my life and I will poiled in the house of the Lord forever. King David although rising to the king and although being considered such a great leader by the time he looked back at his own life and he reflected at the things that had happened to him and it happened through him he considered himself one of the flock. I look out this morning at many many great leaders. I look at you and I desire to encourage you. I desire to compel you to consider the flock. Consider those that your decisions affect consider those that your words and your actions and the things that you do reflect back on them. Then through much prayer I'm reminded of the 10th chapter of the book of John, John 10, starting with the 11th verse is Jesus himself reflected on this very same thing of shepherd and sheep. Jesus said 10th chapter 11th verse of the book of John, I am the good shepherd. The good shepherd giveeth his life with the sheep. But he that is a harling and not the shepherd whose own the sheep are not seeeth the wolf coming and leaveeth the sheep and fleeth and the wolf catches them and scattereth the sheep. The harling fleeth because he is a harling and careeth not for the sheep. I am the good shepherd and no my sheep and I'm known of mine. Jesus said very compellingly there had been many other leaders throughout Israel that made many other leaders throughout the world. But none of them cared like Jesus Christ did himself because he was truly going to lay his life down for those that he cared for, those that he watched after, those that he wanted to make sure that they were taken care of. So with that I encourage you to be mindful of those that are your little flock. Seeing yourself as a leader, seeing myself as a leader, I know that my decisions at my little church, I know that they affect those within my flock. Likewise your decisions affect those within your flock. I would love to be able to look back in life and think about Almighty God for taking me and making me lie down in green pastures, a place where I felt comfortable and safe, leading me beside still waters and you likewise that those whose decisions that you might reflect them may you lead them in green pastures and beside still waters. And may they also look back, be able to say, I will dwell in the house, the Lord forever. Thank you so much for this opportunity. If you would please stand as we have prayer. As you bow your head please. Eternal Heavenly Father, God we thank you again for this day. Lord this moment, a tradition, Lord this great state of Georgia that allows our speakers and allows devotion and allows reading from God's holy word. God I beg that you will be with each decision that's made here today. God be with these men and women that we stand with. Lord be with their constituents, with this great state of Georgia that we love so so very much. Thank you for your blessings. You've pulled out upon us and we ask only in the perfect, holy name of Jesus Christ, amen. I asked if you would turn for the pledge of allegiance. I put the allegiance to the flag of the United States of America and to the Republic for which it stands. One nation, one God in Israel, with liberty and justice for all. Excellent. Good message. Thank you, brother Jason. We appreciate your message and we appreciate you making a trip down some Dawsonville. Door, keepers, you may unlock the doors, members. As you're aware, you may join brother Jason in this out to any room. And thank him for his service here today for us and have a photo with him. Members, our doctor of the day is brought to us day by Representative Katie Dipsy of the 13th, Dr. Shaheed Salis, because our doctor of the day and we appreciate her being here. And if you need her services, you know she's downstairs again. Thanks for being here, doctor. And we, Dr. Shaheed Salis, we appreciate you being here. Thanks Katie for inviting you today. Chairman Hilton, the chair of the Committee on Information and Audits is recognized. Chairman Hilton. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal the previous legislative day and found it to be correct. Mr. Speaker, if I may, I'd like to wish a happy Valentine's Day, early Valentine's Day to the most beautiful woman in all of Georgia. Mr. Meredith Hilton, thank you, Mr. Speaker. Baby, I'm coming home soon. I hope she's still there. I'm so lucky to tell you after that. You are a lucky man. Chairman Hilton, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there an objection to dispense with the reading of the journal? Here in the journal list, the reading of the journal is dispensed with. Is there an objection to the confirmation of the journal? Here in the chair, journal is confirmed.\n\nMr. Clerk, will you read the resolution establishing the order of business for the day? Reptile of the administration and the 104th Moose Follow Me establishes the order of business and the first part of period unanimous consensus. Introduction to bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills. And resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Here in the resolution is adopted. First reading the bills and resolutions, the clerk will read. Health before a seven by represent a billier to the 160 second Crawford of the 89th holiday, the 116th, track of the 80th, scope field of the 63rd, and others. Bill B. Tallah, an act to amend chapter 7 to title 48 of the fish go to Georgia and attended relating income taxes. Ways and means. Health before a eight by represent a billier to the 160 second can in the 58th, Scott of the 76th, Bill B. Tallah, an act to amend chapter 23, a total of 33 of the fish go to Georgia and attendee relating insurance licensing. Insurance. Health before a nine by represent a billier to the 160 second Jackson to the 68th, more of the 91st, after the 130th, Bill B. Tallah, an act to amend chapter 7 to title 48 of the fish go to Georgia and attended relating income taxes. Ways and means. Health before a 10 by represent a deloge to the 167th, lumps into the 12th, Williams into the 112th, Bill B. Tallah, an act to amend title 33 of the fish go to Georgia and attended relating insurance. Health before a 11 by represent a billier to the 32nd, Bill B. Tallah, an act to amend the act creating board of commissioners for bank's county. Andrew, governmental coordination. Health before a 12 by represent a Kelly, the 16th, Bill B. Tallah, an act to amend an act creating the poll county water authority. Andrew, governmental coordination. Health before a 13 by represent a Jenkins, the 136th, Huttleson, the 72nd, Campbell, the 171st, Ridley, the 22nd, bird to the 20th, Bill B. Tallah, an act to amend chapter 1 and a total of two of the fish go to Georgia and attended relating to the general provisions regarding agriculture. Agriculture and consumer affairs. House Bill 414 by represent a Jones to the 25th, the loach of the 167th, Gunner, the 8th, Skoggins to the 14th and Holcomb to the 101st, Bill B. Tallah, an act to amend chapter 5, a total of 21 of the fish go to Georgia and attended relating to government transparency. The government affairs. House Bill 415 by represent a Jones to the 25th, Seaball, the 34th, Beard to the 24th, Beatrie, the 166th, Corporal to the 174th and others, Bill B. Tallah, an act to amend, a total of 44 of the fish go to Georgia and attended relating to property. Judiciary. House Bill 416 by represent a vestition to the 104th, Blackmen to the 146, Kelly of the 16th, Bill B. Tallah, an act to amend chapter 88, a total of 36 of the fish go to Georgia and attended relating to the empty price. The empty price zones. Governmental affairs. House Bill 417 by represent a gains to the 120th, Hitchens, the 116th, Dickie, the 134th and Green in the 154th, Bill B. Tallah, an act to amend, a total of 23, 411 of the fish go to Georgia and attended relating to definitions regarding tuition, equalization grants. Higher education. House Bill 418 by represent a scope fetal to 63rd, Carper to the 4th, Tran to the 80th, Davis to the 87th and Scott to the 76th. Bill B. Tallah, an act to amend, chapter 2, a total of 39 of the fish go to Georgia and attended relating to regulation of employment of minors. Industry and labor. House Bill 419 by represent a Hawkins, the 27th, Gamble to 15th, Martin to the 49th, Jackson to the 128th, Mathis to the 133rd and others. Bill B. Tallah, an act to amend, part 2, Article 2, chapter 3, a total of 20 of the fish go to Georgia and attended relating to the university system. Higher education. House Bill 420 by represent a tailor to the 173rd, Hawkins to the 27th, Dempsey to the 13th, Matthew, the 82nd, Stinson to the 150th and others. Bill B. Tallah, an act to amend, Article 1, a chapter 24, a total of 33 of the fish go to Georgia and attended relating to general provisions regarding insurance. Insurance. House Bill 421 by represent a tailor to the 173rd, Rice to the 139th, three of the 99th, Ballinger to the 23rd, Matthew, the 82nd, Bill B. Tallah, an act to amend, Title 16 of the fish go to Georgia and attended relating to crimes and offenses. Judiciary non-civil. House Bill 422 by represent a McCallum of the 30th, Jones to the 47th, Perchette of the 176th, Williamson to the 112th, Blackman to the 146th and others. Bill B. Tallah, an act to amend, Chapter 18 to the total 45 of the fish go to Georgia and attended relating to employees, insurance and benefit plans. Insurance. House Bill 423 by represent a way to the 9th, on a 2G, the 105th reason, the 99th, Silcox to the 53rd, Hilton to the 48th and others. Bill B. Tallah, an act to amend, Article 12, Chapter 3 to the total 38th, Part 4 of Article 2, Chapter 5 to the total 46 of the fish go to Georgia and attended relating to emergency communications. Public safety and homeland security. House Bill 424 by represent a meek to the 179th, Dickie the 134th, Perchette of the 176th, Wade to the 9th, MacDonald the 3rd of the 26th and others. Continue. A bill to be entitled, an act to amend, Article 6 of Chapter 7 of Title 2, with the official go to Georgia and attended relating to liability for use of fertilizers. Agriculture and consumer affairs. House Bill 425 by resident, Perchette of the 176th, Hagen to the 156th, Camp of the 135th, hatched to the 155th, Osteen to the 169th and others. Bill B. Tallah, an act to amend, Article 2, Chapter 7 of Title 48, with the official go to Georgia and attended relating to the impositionary computation, exemptions and credits. So it's a provide for tax credit. The ways and means. House Bill 426 by represent a meek to the 40th, Eftration of the 104th, Hugh Glee the 141st, Perchette of the 176th, Park of the 107th and others. Bill B. Tallah, an act to amend, Chapter 10 of Title 15 of the official go to Georgia and attended relating to magistrate courts. Governmental affairs. House Bill 427 by represent a grease of the 140th green to the 154th, Smith to the 18th, Gull of the 19th, Alaliay the 59th. Bill B. Tallah, an act to amend, Article 1 of Chapter 2 of Title 44 of the official go to Georgia and attended relating to recording relative to property. House Bill 427. Yes. Did you do a sherry? House Bill 428 by represent a Franklin of the 160th Jones of the 47th, Silcox of the 53rd, Hilton of the 48th, Hong of the 103rd, Nullers. Bill B. Tallah, an act to amend, Chapter 1 of Title 31 of the official go to Georgia and attended relating to general provisions regarding health. Halt. House Bill. Presley and Mr. Clark. House Bill 429 by represent a Wilkeson of the 39th, Prince to the 130th, Sebal 34th, Blackburn of the 146th, Smith to the 41st and others. Bill B. Tallah, an act to amend, Part 2 of Article 10 of Chapter 5 of Title 4080, the official go to Georgia and attended relating to ad valorem taxation. House Bill 429. Yes. Yes. House Bill 430 by represent a St. of the 180th, Clifton of the 131st, Palette of the 147th, Ford of the 170th, Palette of the 23rd, Nullers. Bill B. Tallah, an act to amend, Article 2, Chapter 1 of Title 42 of the official go to Georgia and attended relating to sexual offender risk review board. Judiciary non-civil. House Bill 431 by represent of Jones, the 25th, Palette of the 33rd, Ridley the 6th, hatched into the 155th, Corp. of the 174th and others. Bill B. Tallah, an act to amend, Part 2 of Article 15 of Chapter 1 of Title 10 of the official go to Georgia and attended the Fair Business Practices Act of 1975. I got a lot of comments here. I'm sure that you guys can start reading. Yes. The big news is about the same thing. I think it's a problem. Yes. Let's go. You just talk to your own people. Yes. I'll have to take that. Banks and banking. House Bill 432 by represent of Kelly, the 16th, Rose, the 124th, Cannon, the 72nd, Dunne, who the 31st, Chastain, and the 7th. Bill B. Tallah, an act to amend, Goat Section 27, 2, 6th, the official go to Georgia and attended relating the trout licenses. Game, Fish, and Parks. House Bill 433 by represent of Ballinger, the 23rd, Campbell, the 135th. Rice, the 139th, Osteen, the 169th, Mithiac, the 82nd, and others. Bill B. Tallah, an act to amend, Article 2 of Chapter 3, Title 35 of the official go to Georgia and attended relating the Georgia Crime Information Summit. Public safety and homeland security. House Bill 434 by Rose, the 23rd, Campbell, the 135th. House Bill 639, Osteen, the 169th, Mithiac, the 82nd, and others. Bill B. Tallah, an act to amend, Article 1 of Chapter 12 of Title 16 of the official go to Georgia and attended relating the General Provisional Offenses against Public Health and Mortals. Judiciary, juvenile. House Bill 435 by represent of Ballinger, the 23rd, Campbell, the 135th. Rice, the 139th, Osteen, the 169th. Mithiac, the 82nd, and others. Bill B. Tallah, an act to amend, Article 16, 12, 100. The official go to Georgia and attended relating the sexual exploitation of children. Judiciary, juvenile. House Bill 436 by represent, Griffin, the 149th, Miller, the 62nd. Hewglie, the 141st, Lim of the 98th. Williams, the 168th and others. Bill B. Tallah, an act to amend, Title 20 of the official go to Georgia and attended relating the education. Education. House Bill 437 by represent of Lim of the 98th, Cannon, the 172nd, Hong of the 103rd, Olaaliay, the 59th, Reeves, the 99th and others. Bill B. Tallah, an act to amend, Part 3 of Article 6 of Chapter 2 of Title 20. The official go to Georgia and attended relating the education of programs under the Quality Basic Education Act. Education. House Bill 438 by represent of Crow, the 118th, Lumps, the 12th, Silcox, the 53rd. Hitchens, the 161st, Blackmen, the 146th and others. Bill B. Tallah, an act to amend, Chapter 2 of Title 47. The official go to Georgia and attended relating the employees, retirement system of Georgia. Retirement. House 439 by represent of Year to the 122nd, Tickety, the 134th, Williams, the 148th. Anderson to the 10th, Kelly, the 16th and others. Bill B. Tallah, an act to amend, Code Section 48850, the official go to Georgia and attended relating the compensation of Deedlenstrand reporting and paying tax. Banks and banking. House Resolution 250 by represent of Washburn, the 144th, Apollo 33rd, Ridley the 6th, Ridley the 22nd. Stevens, the 164th and others. Resolution proposing an amendment to the Constitution, so to abide that the government authority of any Kelly or consolidated government shall be authorized. Ways and means. House Resolution 251 by represent of Newly the 40th, Lestration of 104th. The people of the 141st, perchette of the 176th, park of the 107th and others. Resolution proposing an amendment to the Constitution, so to abide that all probate judges shall be elected. Judiciary, members, I know that you all don't really mind having a lot of interest in where these senate bills go, but I've got to hear the clerk. So you all have to take it down just a notch or two. We always want to respect the senate. Mr. Clerk. Senate Bill 5 by senator Patrick of the 32nd. Walker, the 20th Watson, the first, how's that? Over the 52nd. Harveston, the 15th and others. Bill B. Todd, elected to amend chapter 46, the title 33 of the official go to Georgia, annotated relating the certification of private review agents. Insurance. Senate Bill 47 by senator Antivarta, the 31st brass, the 6th, the 51st, begin to the 47th. Robertson, the 29th and others, the bill will be titled, act to amend code section 488, 3 of the official go to Georgia, annotated relating the exemptions from sales and use taxes. Ways and means. Senate Resolution 95 by senator Donald Zell, the 27th, the 23rd, government of the 8th. Watson of the 11th, Kennedy, the 18th and others. A resolution naming the forthcoming new legislative office complex. State properties. That completes first readers. Second reading the bills and resolutions, the clerk will read House bill 380 by reps of green of the 154th, the bill to repeal an act creating the lower chat of Hootsie Regional Airport Authority, House bill 381 by reps of green of the 154th, the bill to amend and act to create the lower chat of Hootsie Regional Transport Authority, House bill 382 by reps of Stevens of the 164th, the new of the 127th, a bill relating to schedule one control substances. House bill 383 by reps of Cox of the 28th, roads of the 124th, cannon of the 170th, second, the claim of the 109th, or one of the 32nd, a bill relating to education and minors. House bill 384 by reps of C, well, the 34th, the streams of the 99th, Carson of the 46, Hitchens of the 161st, Fleming of the 114th and others, a bill relating to abusive governmental office and official Oats. House bill 385 by reps of welcome to the 81st, Embarrass of the 24th, the bill relating to eligibility requirements for our hope scholarship and award amount. House bill 386 by reps of the 86. Hugh, the 114th, per now, the 77th Jackson on the 165th, or the 85th and others, the bill relating to exemptions or sales and use taxes. House bill 387 by reps of the 21st, the 100th, the 175th, the 19th, the 23rd, the 20th, the 20th, the 22nd, the 22nd, and others. House bill 388 by reps of the 100th, the 173rd, Hitchens of the 161st, Martinez of the 111st, Canada, the 172nd, and others. A bill relating to imposition rate, computation exemption, and credit from state income tax. House bill 389 by reps of the bill of 75th, Holland of the 54th, Sharper of the 177th, Drener of the 85th, 5 of the 120th, second, and others. House bill 38390 by reps of the 114th, Hagen of the 156th, Hitchens of the 161st, Skoggins of the 14th, McDonald of the 26th, and others. A bill relating to offenses against public order, and unsecured judicial release, House bill 391 by reps of Cox of the 28th, Powell of the 33rd, Jasper of the 11th, the 167th, Washington of the 144th. A bill relating to professions and businesses, House bill 392 by reps of Martin of the 49th, Gunter of the 8th, Oliver of the 84th, Reeves of the 99th, Levert of the 123rd, a bill relating to tax courts. House bill 393 by reps of Cooper of the 45th, Sains of the 180th, Cwalford of the 89th, Newton of the 127th, Rice of the 139th. A bill relating to traffic laws applicable to bicycles, operation upon paved shoulder, and signaling on right hand turns. House bill 394 by reps of the claim of the 109th. Hugh claims the 144th, Alexander of the 66th, Jones of the 60th, Jackson of the 68th and others. A bill relating to minimum wage law, House bill 395 by reps of the claim of the 100th, Hugh claims the 144th, Alexander of the 66th. Jones of the 60th, Jackson of the 68th and others, a bill relating to minimum wage law. House bill 396 by reps of Campbell, the 35th Wednesday of the 22nd, Ayerhard of the 36th. Seabalt the 34th between the 60 first and others a bill Mended act to be incorporated in the charter for the city of aqua with house bill 397 by represent Fleming of the 114th 100 the 175th lever to the 123rd dollar to the 19th scogins of the 14th and others a bill relating to elections of primaries house bill 398 by represent Hagan of the 156 gains of the 120 of dimsy of the 13th camp of the 135th Prince of the 130 second and others a bill relating to standards labeling Adrotoration of food house bill 399 by represent Oliver the 84th all all year the 59th for now the 77th Black one of the 146 the Friday the 120 second others a bill relating to landlords and tenants House bill 400 by represent Friday the 120 second all all year the 59th washburn of the 144th bell of the 75th Robert so the 52nd others to build relating to conservation and natural Resources highways bridges and fairies and state government house bill 401 by represent Friday the 120 second Mom's hand of the 17th red leave the 22nd bell of the 75th episode the 52nd and others a bill relating to regulation of rates underwriting rules and Related organizations hospital 402 by represent a Friday of the 120 second bell the 75th runner of the 85th Sanchez with 42nd Paris of the 140 second and others a bill relating to utilities and public transportation and state government House bill 403 by represent a bell of the 75th all year the 59th day was of the 87th scog of the 76 5th 120 second and others to build relating to property House bill 404 by represent Taylor the 90 second more of the 91st Carter the 93rd a bill relating to amended act creating a new charter for the city of Condia's House bill 405 by represent a Friday the 120 second we now are the 121st Evans of the 57th Crawford of the 89th Roberts of the 52nd others a Bill relating to licensing of agents agency sub agents counselors and adjusters house bill 406 by representing 11 of the 123rd a bill relating to the Georgia judicial retirement system Senate bill 39 by senator teller of the 19th summers of the 13th Roberts of the 29th Watson of the 1st walk over the 20th and others a bill relating to the employees insurance and benefit plans public assistance general provisions relatives the state governments have a bill 70 by senator Anderson of the 43rd a bill to provide for the creation of one or more community districts within the city of conures in about 78 by senator Watson of the 1st mile of the second hitman of the 4th Dixon of the 45th a bill to create the city of Tybie Island building and public facilities authority Senate bill 83 by senator have settler the 52nd settler of the 37th the bill to provide a home stay exception from Bartow County School District of Lawrence taxes for educational purposes senate bill 84 by senator albert of the 56th pane of the 54th burns of the 23rd still the 48th Williams of the 25th the bill relating to special license plates promoting certain where the agencies funds or nonprofit corporations through second readers and the committees the clerk will read Representative Victor Anderson of the 10th district chairman on committee on government affairs submitted the following report to speak your committee on government affairs is that in the roots consideration following bills of the house and senate as they struck the media reports saying back to the house the following recommendation House bill 113 do pass house bill 140 do pass by committee substitute senate bills 16 do pass respectfully submitted Representative Victor Anderson the 10th district chairman Representative Chuck Martin of the 49th district chairman on committee on higher education submitted the following report Mr. Speaker committee on higher education sat under its consideration following bills of the house as a struck committee report to same back to the house and the following recommendations House bill 562 passed by committee substitute House bill 172 do pass by committee substitute respectfully submitted represent Chuck Martin of the 49th district chairman Representative Steven Saints of the 180th district chairman on committee on interstate cooperation submitted the following report Mr. Speaker committee on interstate cooperation and has had under its consideration following the resolution of the house and the struck the media report the same back to the house and following recommendation House resolution 132 do pass respectfully submitted Representative Steven Saints of the 180th district chairman Representative Beth Campola 135th district chairman on committee on intercom coordination local submitted the following report Mr. Speaker committee on intercom coordination locals out under its consideration Following bills of the house as a struck the media report to same back to the house and following recommendations House bill 349 do pass house bill 355 do pass House bill 356 do pass House bill 359 do pass house bill 252 do pass by substitute respectfully submitted represent Beth Campola 135th district chairman Representative Lynn Smith 70th district chairman on committee on natural resources and environments submitted the following report Mr. Speaker committee on natural resources and environment. It has had an urge consideration the following bills of the house It's a struck the media report the same back to the house and following recommendation House bill 143 do pass by committee substitute respectfully submitted Representative Lynn Smith 70th district chairman Representative Clint Crowe, 1818th district chairman on committee on public safety and homeland security Submitted the following report. Speaking of committee on public safety and homeland security I said under its consideration the following bills of the house is struck to media report the same back to the house and following recommendations House bill 205 do pass by committee substitute House bill 246 do pass respectfully submitted representant Clint Crowe with 118th district chairman Perhaps I don't at least say hey again in the 156th district chairman on committee on rural developments submitted the following report Mr. Speaker committee on rural developments added under its consideration following bills of the house This is struck to media report the same back to the house and following recommendations Council 51 do pass by substitute house bill two sysky to do pass respectfully submitted representant release of hey again in the 156th district chairman Representative Jones the 25th district chairman of committee on technology and infrastructure innovation submitted the following report Ms. Speaker your committee on technology and infrastructure innovation I said under its consideration following bill of the house is struck to media report the same back to the house following recommendation House bill 58 do pass by committee substitute respectfully submitted representant Jones the 25th district chairman That completes the reading the reports the standing committees You Thank you mr. Clerk Members we do have a local calendar this morning We do have a local calendar We have one bill on the local calendar relates to homestead exemption requires a recorded to third row call vote for passage Members will come to the floor Third reading passage of uncontested local bills If there is no objection we will vote on the local calendar as a whole With a recorded vote Hearing none it is so ordered mr. Clerk will you read the local calendar House bill 349 by reps and of Alexander the 66 Douglas County House bill 355 by reps and of Tran in the 80th the city of Doraville House bill 356 by reps and of Tran in the 80th city of Doraville House bill 359 by reps and of Kelly the 16th city of cedar town And House bill 252 by substitute by reps and of Smith the 70th city of Nune Is there any objections to the previous question being ordered on the local calendar Hearing none the previous question is ordered Is any objection to agree into the report of the committee which was favorable to the passage of the bills Hearing none the report of the committee is agreed to Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote yes All those opposed will vote no and mr. Clerk will you unlock the machines You Have all members voted Almost all members Have all members voted If so mr. Clerk will you lock the machines On the bills on the local calendar the yeas are 163 the nays are zero these bills Have received the requisite constitutional majority are therefore passed Well We'll take up some morning orders now. I'm going to ask you to be fairly brief or we could be here Let's see chill Looks like about dark is as many many orders as we have We'll have to turn on the lights again So let's do about a minute to maximum absolute maximum two minutes But we're going to go with a minute. I'm going to start blinking the lights at you after that minute cheerleady balinger And This is run heart date so cheerleady balinger Reps. Is scog and representative bird representative Carson Reps. Just representative pro pro-tium Jones Reps. Is Thomas representing Parsons and representing Ridley if y'all will join The gentle lady in the well She would appreciate it and I would too Okay, thank you lady will suspend just for a moment. This is a good one Ladies recognized thank you, Mr. Speaker unfortunately our folks from Reinhart. We were taking pictures over here in the anti-ruin\n\nSo they haven't made it into the gallery yet, but it is run the heart day at the Capitol. It's a very integral part of Cherokee County. It educates a lot of our educators in Cherokee County. So we're very proud of that university being in Alaska. So we're just going to celebrate in if y'all would. I think some of them are coming in. So if you all could just recognize them, I would appreciate it. Thank you. Thank you. Great, great school. Thanks for recognizing. Thank y'all for being here. We're glad to have you. Representative Gaines. Are you talking about that dog or are you talking about something else? Sort of dogs and not the tick dogs. OK. Representative Gaines is recognized. And Representative Fra. Thank you, Mr. Speaker and Representative Wheatow. I don't know if he's if he's in the room yet, but I know we have a lot of dogs here today. But also we have a family consumer sciences day. We did a resolution on behalf of the house honoring the family consumer sciences day. But in the gallery, we have the University of Georgia College of Family and Consumer Sciences, Assistant Dean Melissa Landers-Pots, Kenna Torbert, the president elect of Georgia Association Family and Consumer Sciences, DJ Young Blood, Kayla Hartline, Jackie Ogden, Kristen Hankins, and Chris Cha Patel. If y'all are in the gallery, please stand and be recognized. Thank y'all for being here. Thank you so much. Thank you, Representative Oliver. Give the lady a new well, your attention. This is a good one as well. Thank you, Mr. Speaker. Please join me in welcoming new American State celebration at our State Capitol today. We have 11 of our 11 million people, over a million people are foreign born. One in five of our doctors and health care workers are foreign born, one half of our construction workers. They pay $11 billion in taxes. I am grateful that my church has helped sponsor refugees for 30 years. It is brought me closer and many of my friends closer to the struggles and the successes of this community. Please join me in welcoming new Americans day to the Capitol today. Thank you for coming. Thank you. Welcome in congratulations on your achievement, your citizenship. Thank you for achieving your church and your continued support of new Americans. Awesome. Thank you so much. Good to have you in the people's house. Representative Scofield, you have some friends here with you today all dressed appropriately. Are okay. Capes on and glasses on. Capes and glasses. You can't come down if you don't have your capes and your glasses. Give them just a moment. Thank you, Mr. Speaker. When we got a couple of folks walking slow, they forgot their glasses. All the cool people wear purple glasses. All the cool kids wearing glasses today. Ow. Can you get my glasses? Come on, Mr. Patty. Lord and David Hollman. Robert, please. Sure. Thank you. Thank you, Mr. Speaker. Today is Lupus Awareness Advocacy Day at the Capitol. For those that have been living with Lupus, caregiving for someone with Lupus, we are here today, your constituents, to talk to you about what it's like to not only live with Lupus, but the challenges in housing and working and the pain. But beyond that, we're champions. And so I want my colleagues and my Lupus family up in the gallery to recognize we stand with you as legislators because we hear you. We see you. We recognize every day struggles that you have. And we work collectively to make life better and improve the quality of life. As a person that not only lives with Lupus for 25 years, I'm proud to have our Lupus Research Team led under the guidance of Dr. Sam Lim from Emory in the gallery. And for many of you that don't know, we know that there's a challenge of shortages of rheumatologist, dermatologist, nephrologist, and rural Georgia. So the Georgia Council on Lupus Education and Awareness works across the state to identify these gaps. Also, make sure that people in rural areas have access through telemedicine, telehealth, to improve the quality of life. I would like all of our Lupus family and your constituents to stand up who trekked down here in the rain and traffic. This is not a good day for us, but it's a best day. So we say no Lupus, KNOW, and no Lupus. So today, I salute you. Thank you for being in the people's house. And I'm just going to step out for one minute to let you know. That we are champions. Okay, we are champions. Thank you. Thank you. Thank you. Thank you. Thank you, Representative Scrofield. We appreciate your passion. Welcome to the people's house. We look forward to continuing working with you. This house has always been dedicated to ensure we support the people of Lupus research and working with all of our folks. These glasses give you a different view of life, I can assure you. Representative McLean, you even look good when I have these glasses on. What can I say? No, no, no, no, no, no. Representative Scott. Representative Scott. Representative Sandra Scott is recognized for a morning order. Good morning and thank you, Mrs. Speaker. I'm here today to welcome the National Council of Negro Women's. I do not see them in the gallery as of yet, but just want to welcome them to their capital today. Thank you, Mrs. Speaker. Oh, okay. If you're all in here, there they are. Okay. I don't see the rest of them. It's about 150 of them here today. I just want to say welcome to your house. Thank you, Mrs. Speaker, you're the well. Thank you, Representative Scott. Representative Ron Dattaler. Representative Taylor. Thank you, Tom. You're okay. Thank you, Mr. Speaker. Good morning, colleagues. We have with us today the family career and community leaders of Heritage High School. If you're seated already, would you please stand? Yeah, they are. This is the Rockdale County chapter under the direction of Miss Millis at Holloway, and who's their advisor, and we're recognizing them with a resolution today that I'm not going to read, but I do want to let you know that family career and community leaders of America, FCCLA, is a national nonprofit family focus, inter-curricular student organization for family and consumer science students through grade 12. And they have them to use to assume their roles in society through family and consumer sciences education. In personal growth, family life and college readiness, career exploration, leadership, and community involvement. They will be on the steps of 1130 in South Wing for a photo, and they'll begin room 502 for lunch. CLLB, thank you, Mr. Speaker. Welcome, young people from Heritage High School, good to have you all. We represent, we represent Virginia and the Gwinnett delegation. Gentlemen, just for a moment. Can I keep my microphone? Yes, you can. Gentlemen, I was recognized. Thank you, Mr. Speaker. Today I'd like to recognize an outstanding constituent of mine, Alyssa Anderson. She's here with friends. Can she please rise? Alyssa currently serves as the founder executive director of the Women's Resource Inc. a 501C3 non-profit organization dedicated to 80 women and low income families by addressing their immediate needs and equipping them with tools necessary to achieve their educational, financial careers, and spiritual goals. She also has served over 80 families, provided meals to more than 3,600 individuals annually, and powered 24 entrepreneurs through training and mentorship. Conducting extensive street outreach and offered life skills, coaching, and professional development programs. I'd like to commend her because that's an outstanding constituent that's doing great work in the community. The work that we continue to support in this house. Welcome to our house. That's recognized her by standing up and giving a big round of applause. Thank you. Thank you for the work you do. Thank you, Mr. Speaker. No, go ahead. Reps. Carl Gileard. And Reps. Lin Smith. Chair Lady Smith. Y'all are recognized for a motion. Chairman Dickie. Representative Smith. Yeah. Please. Thank you. Now, I don't need you, Representative Dickie. I just want you to let her go. Thank you, Mr. Speaker. I'm honored to be here on today. My brothers and sisters. To thank you once again, Mr. Speaker and members of the Georgia General Assembly for the passage of House Resolution 625, the Gullah Gichi Society. In the balcony, our members from all over the coast, they come from Savannah, Liberty County, Brunswick, Darien, all over the coast of Empire. And today they're here not only to treat you to lunch at 12 o'clock, but I want to give you a pose of question. If you have tasted delicious seafood and the segues of the South, then you are Gullah Gichi. If you are a proponent of sweet grass and baskets and troughs in South Carolina and storytelling and you are Gullah Gichi. But not only that, they say in Saplow and beyond, we are the ones that got it going on around YAH. If you are El Williams, then you are Gullah Gichi. But thank you so much for our passing House Resolution 625. Can we get those members to stand that are here with us? They'll be joining us in Room 230 and I want to pass it over to our chairwoman, Liz Smith, for helping us make this a momentous and great occasion. Would you welcome them to the People's House? Thank you, Representative. I'll be very brief. We are looking at leaders of the community on this cultural movement and they are known now nationally and internationally, been published everywhere. It is an honor for us to welcome you today and we will not put nutmeg and cinnamon together in a sweet potato ever again. We are here. We are here. Thank you. Good to have you all and you learn something every day, don't you representative? Chair Lady Dipsy, Chairman Lomston, and Ripley Barton, Matt Barton. Ladies recognize and the gentlemen. Thank you, Mr. Speaker. Good morning, members. Today we are honored to have leadership room here with us. They've just stepped into our chamber to watch and see the great work that we do here today. So be on your best behavior, please. This is excellent. The class of 2526, number 43. I'm afraid I might have been in two or three or four or something very long ago. Welcome. We're so glad for all the good works that y'all do in our hometown. Mr. Speaker, I yield the well. Ladies yield the well. Thank you for being here and making the effort to be here, y'all. Welcome to the People's House. Representative Paris and Representative Petrie. If y'all welcome. Oh, they're separate. Okay, I'm sorry. My bad. Who will go first? Y'all look like you like each other for a second. Representative. Ladies first. Representative Paris. Recognize from morning order. Want to get my make-in delegation, please. Thank you, Mr. Speaker. We have a little bit of an opposition to this. It's not the same. We have a little bit of an opposition that we have. Big brothers and big sisters is here today and a make-in chapter is here. And for those of you that don't know a whole lot about them, I'm going to just give you a little slip. Since 1904, Big Brothers Big Sisters has operated under the belief that inherit and every child is incredible potential. monitored matches between adult volunteers, who are the bigs, and children, little's ages five through young adulthood, and communities across the country. They develop positive relationships that have a direct and lasting effect on the lives of young people. And if to make a big, people from Big Brothers, Big Sisters with Stan, they are under the guided direction of Ms. Betsy Fitzgerald. Ms. Fitzgerald, we thank you all. Also, any other Big Brothers and Big Sisters that we have, if you'll please stand. Thank you so much for coming to the People's House. You're very welcome here. Thank you, Mr. Speaker. Make and bib. Boys and girls, club. Big Brothers and Big Sisters, great job. Thank you all for being here. Appreciate what you do. Chairman Petrie's more than the order was on the same line. So we appreciate certainly what you all do and all parts of our state. Thank you. Thanks for taking time to come. Representative Terry Reese, over there you are already down there with leader Higley. Leader Higley and Representative Reese are recognized for a morning order. Thank you, Mr. Speaker. Mr. Speaker, so we'll know in fact that while we are up here in Atlanta, it's our local leaders back home, both elected and appointed, that keeps things moving forward. And so we want to pause for a second to recognize our chairwoman of the Muscogee County Democratic Committee who's here with us today. Ms. Rory Aniston, if you will please stand up and welcome to the People's House. Thank you. Thank you and welcome to the People's House. The Representative, we'd our and Representative Gaines, and Representative Frah. Thank you, Mr. Speaker. Recognized. Thank you, Mr. Speaker, row. We've got O'Coney County FCCLA in that building if you will stand where you are. I think you're spread out up there. Y'all it's always great to see young faces down here. A lot of these I showed hands earlier was at first time of the Capitol. So welcome them in the building today. And Mr. Speaker, while we, while the Athens delegation and Representative Rhodes is here with us too, but today is dogs at the domed day. And I want to say thank you for that beautiful tie you're wearing, Mr. Speaker. That looks really nice on you with the UGA look. So go dogs and to 11 o'clock there's the Strawberry Ice Cream Pie in the Rotunda. So please join us for Strawberry Ice Cream Pie. Go dogs, thank you. I'll be there for that, buddy. I'm going to be there for you. I'm going to be there for you. Thanks. Thank you. I'll be there for that, buddy. Thank you. I wore this for Boss Man Terry England. I can tell you. And to salute UGA. So good to have them. And thanks for the folks from O'Coney being here as well. That completes our morning orders. There's a gentleman on the floor. I wanted to recognize. I want to thank you all for joining me and welcoming a former member of this house, a former member of Congress who led in the UGA and who led for all the right reasons in America. Thank you Tom Graves for your service to Georgia and your service our country. We are especially glad to have you with us today. Thank you, sir. You look great. We also have Jannie Graves. She's working down on the second floor of the government. Keeping things straight down there. That's why the second floor is running so smoothly, Jannie. I'm sure that's why Jannie. That was good information. That completes our morning orders and our recognition. Let's move on to the rules, Caledir. You ready, Miss Clerk? Miss Clerk, will you read the caption to House Bill 3636? House Bill 36, by the represent of the lever to the 123rd. Another is being titled the act to amend title 29 of the fiscal to Georgia and it's had a related to guardian and ward. So it's revised list of providers who are authorized to participate in the process for appointment of a guardian for as an adult. Miss Bill, I refer to the committee on judiciary. That committee recommends a disbill due pass. Representative Rob Leveritt from over. What county are you from? Got a little granite there, don't you? Albert County, the granite capital of the world, I believe. Represent the bill. Thank you, Miss Speaker. That's not only Albert County. It's named for Samuel Albert, who was the colonel at the Battle of Briar Creek. You might recall. Absolutely, down in my neck of the woods. A little bit of Scraven County history for you in Georgia history. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I'm asking your favor. Consideration day for House Bill 36, a bill that seeks to address a crisis in our state right now. Regarding the ability of citizens of our state to care for elderly and others who are not able for whatever reason to look after themselves. This bill may look familiar to some of you who are returning. That's because we have voted it off the floor of the House three times in the last two years. Once as Judge Mitchell Skoggins bill twice as, what once as a bill, I sponsored in a second time last year attached to another bill. This bill expands the list of professionals who are in a proceeding to appoint a conservator or a guardian for an adult can provide to a probate court an evaluation of that adult. They're called a proposed ward in that proceeding. Currently, the following professionals can provide the evaluation, which is required by law. In the court, well, in some cases, required two or more evaluations. That's physicians, psychologists, and licensed clinical social workers. This bill adds to that list physician assistance, nurse practitioners, or clinical nurse specialists, and psychiatric or mental health, and a marriage and family therapist and professional counselor. In section 13, the bill also addresses a definition of gross settlement, which is material in determining whether a conservator can settle the claim of or against the proposed. That's the proposed ward, and I just try to clarify that definition. If you're above a certain amount of a gross settlement, you have to get court approval. If you're blowing, you can settle on your own as a conservator without court approval. So the question is why are we expanding this list? Well, the reason very shortly is because the professionals currently authorized by statute to perform that evaluation are not doing it. They're reluctant to do it. And I'm not trying to blame or censure them at all for that. I don't question the reasons, and I can think of a number of perfectly valid reasons why one of those professions might not be able to provide that evaluation. But the fact is they're not doing it, and as a result, the cases are being delayed and sometimes stalled. I hope all of you have a power of attorney and advanced directive. I hope everyone that you care about has an advanced directive and power of attorney. But if you don't or they don't, and they become unable to make decisions for themselves, this is your only option, is a conservatorship or a guardianship. And it is a lengthy, expensive, long, emotionally gut-wrenching process. And it should be, because you're after all you're proposing to put yourself in a position if you're the petitioner to make decisions for these folks. So currently our law requires that you file a sworn petition with a court. If it's only one of you filing the petition, you have to have an evaluation of one of these professionals with your petition. Once the court gets the petition, the court reads it and makes a determination if there's even a sufficient showing they can dismiss the case right there. If they think there's probable cause, they then order another evaluation. Well currently right now, they can't get the evaluation done, so the case stalls. So imagine you're a predicament. You're basically suing a parent or a relative or a loved one, and that case is just sitting there. And sometimes it's because the parent is getting in their car and driving places and doesn't know where they're going. It's because the parent is leaving pots on the stove and they dry up and start a fire. It's because they're giving all of their property and money away to anybody who comes to the door. So there's a degree of urgency here. Plus it also is not best for the relationship of parent and child usually to do this, but it's something you do because you love your parents. So that is why we're expanding the list because we owe it as a state to allow a process that is very deliberate and purposeful, but that happens quickly. I've had some concern expressed about the qualifications of the people we're adding. They are all qualified. I would submit there probably more qualified than some of the others on the list. They all have training and mental health. They all take continuing education and mental health, and it's what they do day to day. In other words, these are not, you know, if you hear therapists and counselors, a lot of people think of Kent Flounder Dorfman in Animal House or Stuart Smolley. But that's not who we're talking about here. So I would ask your favor was forward to this bill. The probate judges initiated it because they need it. And I would be glad to stand for questions. Gentlemen, you'll for yes, you you done I'm done. Okay, just make sure so glad I had everybody's wrapped the tension. Yeah, you do. I know how you lawyers are. You get to the end and you keep on going. Because you'll get paid by the hour. So we understand that I had this curious notion that folks might want to actually know what the bills about. This will speak. There's a couple that do. Represent for now is recognized for a question. Represent, you're on the banal to your left. Does the gentleman you I do. Yes, ma'am. I just want to say thank you. I did do my will and all those other documents. There's a program and I was able to do it for free. And so I really do understand the value and the importance. So thank you so much. Thank you for the question. Gentlemen, you are for another question. I do. Yes, sir. Chairman Hatchett to your right has a question. Thank you, miss speaker. Gentlemen, you yes to the gentleman in the well. Is this your first bill? This year, yes. Well, I was wondering because you said we had heard this I think four previous times and you still wanted to go into all the cliff notes. So thank you. Just trying to be careful. Mr. Chairman and he still wasn't briefed, but anyway. Gentlemen, you go for a question to. I'll you for one more. Chairman Sainz, your left has a question. General's recognized. Thank you, Mr. Speaker. This gentleman yields. Let me thank yes. I appreciate the elaborate presentation that the gentleman gave to us and in the law book he brought to make sure people knew his credentials. But normally the gentleman ends with a quote that really ties the bill together. So I'm still having a hard time comprehending the legislation because I didn't hear one in that elaborate speech. Well, I've got one for you. I want to a young man like you. Don't buy your kids an encyclopedia. Let them walk to school the way you did. Mr. Speaker, given the caliber of the questions, I'll yield the well and ask your favorable consideration of House Bill 36. And I'm going to take my book with me. You were doing pretty good to that last one there. Gentlemen, yielded the way we do have an opposing opinion and we would appreciate that if representative Stacy Evans would come up. Another very alerted attorney and we appreciate her inside as well. The ladies recognized. Thank you, Mr. Speaker. Can I borrow that law book so they know we're on equal footing here. Ladies and gentlemen, good morning. I rise to oppose House Bill 36 with a caveat that I don't oppose the idea. I understand the problem. I do agree we need to deal with it, but I don't think that this is the way. And I'm not under any grand illusions that I'm going to stop this bill.\n\nI want to share my concerns because I have a feeling they might be concerns for you and I would like for you to help share those concerns across the hall so that we can make this bill better before it finally becomes law. So what am I talking about? What are we talking about generally here? As the gentleman has explained, we are talking about a process where you go and put a loved one in a conservatorship or a guardianship. Typically that's going to be an elder family member. It's not always. It could be a mental health issue for someone younger as well. But we're essentially talking about a court order that says an individual, a citizen of this country, no longer has the power to make their own decisions. That means their individual freedom is suspended. This is a big deal. Is it sometimes necessary? Absolutely. Is it heart-riching and sad when it happens? Absolutely. Do we need this process to work efficiently? Absolutely. But we cannot go for speed when we are talking about freedom. We cannot shirk on qualifications when we are talking about freedom. So as the gentleman said right now, the law authorizes three professions to give an initial affidavit to allow one of these petitions to even start. That's a physician, a psychologist or a licensed clinical social worker. And after that petition is presented to a learned probate judge, that person will decide whether the judge will decide whether it can go for it at all. And if it does, then the court appoints an evaluator. Right now the law only allows three people to be those evaluators. The same professions I mentioned, physicians, psychologists, licensed clinical social worker. We are asking to expand that to include four more professions, physician assistants, who typically work under physicians, nurse practitioners, clinical nurse specialists, and marriage and family therapists. Again, I understand the need to have more professionals available. But again, we're talking about a individual right. And so we want to make sure that we, the people that set the law and tell a judge who is qualified to give you this opinion, we want to make sure that that person actually is. Now, I want to also admit something. This is sort of a, no matter how long you've been down here, you can learn things. I did vote for this bill before, exactly as it is before us today, multiple times. And those that express the concerns that lead me here today did not express those the last time we, we considered this legislation. There could be any number of reasons for that. Why those concerns didn't make it to us to allow me at least to slow down and look at this a little bit more. We all think everyone's watching us. I know this is broadcast and maybe we think everybody's gathered around the fireplace, watching us and hanging on every word. No, they're not. They're busy. Not everyone can afford a lot of us to set out in that hall and review every bill that we put to make sure that the people they're looking out for, that they might have concerns about, they can't all be here to catch everything. So when they do finally catch it, we don't chastise them for that and say, well, you never told us, guess what, they're telling us now. And so we owe it to them, to hear them, to slow down and make changes. I'm not as good at quotes as my friend, but I do have one. I don't normally have them, but there's a great quote by John Maynard Keens. When my information changes, I alter my conclusions. What do you do, sir? When you know better, you do better. When you get new information, you take care of it. Now, the new professions that we're adding here again, I said it's lengthy. It's longer than any other state, and I've done a 50 state survey from the Department of Justice in a section called Elder Justice. Our list is going to be longer than any other state except five states. And each and every one of those other five states has a very important qualifier that our qualifier that our law doesn't have. Namely, in each of those states, which is Florida, Kentucky, New York, Pennsylvania, and Vermont, their laws, they're going to be the same. They'll say that, yes, there's a broader list of professions that can provide the evaluations, but they have a caveat that they must have skill, knowledge, or training in the specific incapacity claimed for the proposed word before them. Not everyone is getting, not everyone's loved one is going to get a proposed conservatorship or guardianship for the same reason. It could be a physical incapacity. It could be a mental incapacity. All physicians, not all medical professionals, are equal. We want to make sure that the person that's providing the opinion actually has training skills, and knowledge in that specific situation. The other thing about these other states that have lists, either the same size as ours, or potentially a little bit longer, three of those, or two of those, rather, at least two of those, ask for a committee of professionals, not just one person, not just one medical professional, but a committee, one of which must be a physician. That's what happens in Florida and Kentucky. Now, I've heard in response to what I've just shared with you, you might hear, well, we currently let any doctor, any physician, provide these opinions, and if it's a physical issue versus a mental issue, we're not making those distinctions now. Well, again, you know now. When you do better, when you know better, you should do better. Maybe it would prevent us from having to do another cleanup. So again, I'm voting against this bill because I want to, not because I don't think we need to make a change to this progress, and process, not because I don't think we need to help our probate judges, but we need that caveat, ladies and gentlemen, because we're talking about freedom. We're talking about people in a very vulnerable position. And again, I've done this 50 state survey, I invite you to go there. It's on the Justice Department website. I'll give you the link or you can Google it and I think it'll come up for you. But again, I found no other state that has merits therapist as an option here as we're adding most require a physician, a psychologist or a psychiatrist. Some have Aureans, PAs or social workers, but most of those have that specific qualification that I told you about or they ask for a committee of people, not one, not just one person. And again, I want to be very clear. I don't have a problem with this proposed list. I think it will, I mean, expanded list. I think it will help our probate judges, but we need that caveat that our other states have seen fit to put in. So please join me in voting now just to make sure that the Senate here is loud and clear that while we want to help our probate judges and we want to make this, we want to make a change in this law. We're not done yet and we need a few more sentences to perfect this legislation to protect individual freedoms and those vulnerable folks that may be in front of our probate judges with someone asking to take away their freedom to make their own decisions. Thank you, Mr. Speaker. I yield. The lady has a question if she'll yield. I'd be happy to yield. To the gentleman to your right, Representative Reeves has a question. Thank you, Mr. Speaker, would the representative from Atlanta yield for a question? Yes, I would. Thank you. Isn't it true that guardianships help people with Alzheimer's, dementia, schizophrenia and other conditions where they're no longer able to care for themselves and that in the probate court guardianship proceeding, both the guardian ad light and attorney will get across examine the five professionals that have been added to the list in this bill as well as the probate court judge such as the Cobb County Judge who testified in judiciary and the other probate judges who were here at the Capitol yesterday asking for this bill. Yes, the gentleman is correct that this is a court proceeding. There will be a give and take process and the judge will ultimately make a decision. But just like in any piece of litigation where a judge has to rely on professionals was particularized medical or scientific qualifications, they serve a gatekeeper function and the laws that we write give those judges the gatekeeper parameters that they have to use to apply to decide who gets to come in and give that testimony from which the judge is making a decision. You don't just let anybody come in and give a scientific opinion. You don't just let anybody come in and give a medical opinion. You only get to give opinions on issues that you have specific training in. We do that in every other area of the law. I'm sure we'll hear a lot about it when we get to alleged tort reform and start talking about who gets to give opinions in medical malpractice cases. We don't let a foot doctor come in and give an opinion on a heart issue. Here I think we need to be careful about what we're allowing judges. It's not that judges would knowingly allow someone unqualified to come in, but they use the parameters that we set up for them. Yes, there will be cross examination, but once you put someone on a stand as an expert, that carries weight. We need to be very careful about the weight that we allow into our courtrooms. That's what I'm asking here again. No offense to these professionals. They are wonderful people that are trying to help, but we all have to follow rules. We all need guardrails. Especially when we're talking about individual freedom and the ability to make your own decisions, which is all of our God-given rights in this country, we've got to be careful. That's all I'm asking. Let's just add a couple of sentences. Thank you. Senator Yeal, for one more. The author of the bill has a question. If you yield. Only if he'll ask it in the form of a quote. I'm just kidding. Chairman Leverich, recognize for a question. Thank you, Mr. Speaker. Will the general lady yield? Yes. I think it's fair to say the general lady questions the qualifications of the three proposed or four proposed professions to assess mental capacity in a guardianship or conservatism per se? Yes and no, in certain situations. Just again, you may sometimes be trying to put someone into one of these situations because of a physical issue, sometimes for a mental. Even within those two categories, there are differences. I know in committee, we talked about how, well, we don't worry about that right now with doctors. We say any doctor. But again, my eyes are open. I didn't have these concerns last year, but you heard the testimony. I did. It was heart-wrenching to hear folks who feel that they are vulnerable to have someone come in and ask for this guardianship or conservatorship over them. I think they're right. We need to make sure that the person that's giving that opinion has specific training skills and knowledge for them and for whatever their particular situation is. And I would concur with, will the lady you'll find another question? Yes. I would concur with the General Lady, but is it not true that the probate court judges who presiding these matters are the ones who have proposed these particular professions for inclusion in the statute? I'm sure that they did. That was my impression. Further question? Yes. Does the General Lady not feel that probate judges are best qualified to determine what kind of evidence should be presented in their court to the issue of competency of a proposed ward? With all due respect to our probate judges, no. Just like we don't let a trial judge let anyone come in and be an expert on other issues where there might be a particular medical or scientific issue before them. We always have guardrails. It's the, you know, to get to just nerd out for a second on the law. It's the Dalbert standard. And we need that. I believe we need that here. And if we, if we tell the probate judges are going to follow the law, if we tell the probate judge that any nurse practitioner can come in and give one of these opinions, they will not be following the law. They don't let the person come in and give that opinion. Now what weight they give it? I don't know. But they will not be following the law if they don't let that person come in. And if we don't put an additional qualification on what nurse practitioner can come in, then the judge can't. We set that law. So it's the ladies, in my correct and I'm saying the ladies position that a judge does not have the discretion to disregard evidence because that's all we're doing here is allowing evidence in in a particular case. Sorry, there we go. Thank you. So I'll ask the question here for the benefit of the room. Is it the ladies considered opinion that probate judges cannot simply because we say this is an evidence that can be introduced? The probate judge is not qualified or empowered to either disregard that evidence or or assign certain weight to it based on the factors the lady has mentioned. The judge will always have that discretion to assign weight who they think is telling the truth who they think is spent more time. But we don't make laws for everybody in the best of situations. We don't make the law assuming that the judge is going to go behind these opinions is going to go behind every qualification. We have to make laws for the worst case scenario. And I think in every other situation of the law where we allow a medical or scientific person to come in and give opinions, we put guardrails around that. And again, I really don't understand the push back ladies and gentlemen and to the gentlemen with the question. And I know I'm not allowed to ask you questions, but I just want to pose a question for the body. Why do we not want this caveat? Why do we want to just let anybody come in and give these opinions to potentially take away individual freedom? It's not too much to ask to just add this caveat, which many of our southern states, like I mentioned Kentucky and Florida do the same thing. For one more, I know everyone's riveted and enjoying that we're eating up all of us time on my bill. I never believe a lawyer when they say it's the last question, but yes, sorry. Well, and I want to thank the lady for showing the room why I spent so much time in my presentation. But and I'm having said that pro-bate judges can't make these decisions. I hope the lady doesn't have an active practice in pro-bate court because it may be ending shortly. I respect very much the lady's opinion. Is it not true? We've had discussions about making changes when we get on the other side of the building to try to address those concerns. We have. And my understanding is that the author is open to those. And it is why that I am a little concerned about the questions I'm getting in the well right now that seem to not want to make those changes. And I hope that while we're having a little bancer here, that there is still very much an intention to perfect this legislation across the hall. Well, if I may, it's not the form of a question, but yes, there very much is. But I would like the rest of our colleagues to know that there is an argument that the process already in place in the pretty little book I had up there earlier requires the judge to do more than just receive one evaluation and then they're obligated to grant a conservatorship. They don't hand these out like candy. It's not like one walks into a probate court and says I need a guardianship on dad and they go, sure, how many? You need one of them, too. This is a lengthy, costly, arduous process where the judge has a discretion to consider evidence or reject evidence. And the, in my scenario, the parent is it not true? Also has a right to be represented by counsel and cross-examine themselves and present their own evaluation. Absolutely. Again, this is a, this is an adversary process in front of a judge where there are going to be two sides, but there is only, there's got to be an affidavit to start the petition. And right now we only let three people start that petition and that's not subject to the gatekeeping function. That is, you've got to have an affidavit coming in the gate. You can't get in the gate without that affidavit. And right now we only let three people do that. We're proposing to let seven people do that or eight people do that. And then again, we've got this additional evaluation process. And again, ladies and gentlemen, I understand the need. I understand that for whatever reason, probate judges are not able to find physicians, psychologists and clinical social workers to come in. These are difficult situations. But we don't, we don't just lower the quality and let anybody come in because we're having a hard time getting our first choice. Sometimes we, we need our first choice. And, and I want to go back to this. Again, I'm not, I'm not opposed to expanding the list. I just want to caveat to make sure that the particular situation at hand in the proposed guardianship or conservatorship that there is specialized knowledge for the situation at hand. That's it. I think we owe that to our citizens. And as much as I enjoy banter with my friend and we can, we can take this show on the road, I will yield the well. And ladies, let's, let's have one more question if you will. Kind of execs the legal community at least from the person who's posing the question. I want to represent the gentleman from the 168th representative Williams for a question. If you'll take it. Thank you, Mr. Speaker. The gentle lady yield. Yes. Is it not true that while I have enjoyed the butter between the two of you, it has been enlightening from two very learned attorneys? Is it not also true that I'm worried about who's going to get the bill for all the time we've listened to the two of you? Well, luckily, pro bono. There you go. Thank you, Mr. Speaker. I yield the well. Thank you for expressing your opinion and I appreciate the conversation. It's been very enlightening and very thorough. Thank you to the author and to the representative. Kevin's as well. Is there any objection to the previous question being ordered? At this time, the rules of this house allow the chairman of the committee from which the legislation comes to, come speak to the legislation. That's all. At this time, I recognize the chairman of judiciary, Representative Stan Gunther, to speak to the bill. Thank you, Mr. Speaker. The legislation gentleman, this did come through my committee. The one thing that I want to... Excuse me, Mr. Chairman. I'm going to limit you to 20 minutes. That's for our rules as well. If you don't mind me limiting you. I hope I don't have any bills on your committee any time soon. Thank you, Mr. Speaker. Don't worry. I won't go that long. This is an issue I think of moving cases through the court system. These three editions of people that are able to evaluate the mental capacity of persons that come into the pro-bake court, I think that that's the whole thing. That's the main thing. These people have the training to do the mental evaluation. These cases, if they're not handled, just sit there. The pro-bake court judges, if they come to us, they're asking for help in moving cases and the longer these cases sit, the decline of the individual continues and the loss of their assets also continues. So we need to do this. Now, the question of whether what the judge thinks of the testimony at the hearing, they look at the whole case as all the evidence that comes in and they make a decision based on that. They can accept what these people that have come in and done the evaluation, what they say about it, or they can reject it. So this idea that the judges are locked in to their testimony, that's not true. So they have an opportunity to decide the case for themselves. I was in this situation many times on different matters where an expert's put up on the stand and I don't have to accept what they say. I can use my own common sense and my own experience and knowledge to decide what's how this case is going to go. So that's all I have to say unless somebody has a question, I'm happy to answer. No, I think we've discussed this pretty thoroughly. Mr. Chairman, thank you for your insight. Do you have anything else? I think if not, you don't have any questions. All right, thank you. Mr. Jim Masier, the well is any objection to this previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? For what purpose is representing Hall and Ross? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that House Bill 36 proposes revisions to Title 29 to update the list of authorized providers in guardianship? In conservatorship processes. And that there is an evaluation that is done with the initial petition. And then another evaluation done that is appointed by the provate judge, providing for a detailed and thorough process regarding guardianship and conservatorship. I'm sure the lady knows of what she speaks. What purpose is represented? I'm not sure if it's a report. Ross. Parliamentary inquiry. Mr. Speaker. State Your Name. Mr. Speaker, is it not true that I really did pay attention to the debate that just happened here on the floor? And I would like to see some of the considerations raised by the general lady from District 57. And if we make this bill look similar to what other states that have a similar list look like over in the Senate that I would love to vote yes on the overall goal and objective of this bill. Is that not true, Mr. Speaker? I think the lady believes exactly what she speaks. And I think I've heard that that will be part of the discussion in the Senate. Have all members voted, all members voted this so the clerk will lock the machine. On the passage of the bill the yeas were 99 the knees are 70 this bill haven't received her exact requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption of House bill 74, 74 House bill 74 by rep. Senator Paul of 33rd know this to be titled not to amend chapter 27 in total 50 the fish go to Georgia annotated the Georgia Lottery for Education Act. So it's the correct a reference this bill in for the committee unregulated industries. That committee recommends this bill do pass. Chairman Allen Powell is recognized to present the bill. Chairman Powell, good to gentlemen your attention please. Thank you. Proceed. Thank you, Mr. Speaker and ladies and gentlemen, you know after all these years I constantly remind folks when we come back on second Monday in January is either about to repair something that got filed up the year before or to put out new ground. Well this is a bill very simple bill that we're repairing something that got filed up last year. But the members that were here last year we passed House bill 353 which was a major overhaul to try to move forward with the co-AM industry. And that's the those video games for the folks who don't know what we're talking about. Major bill last year a lot of controversy but the good thing to report is it's bringing an unprecedented amounts of money to the lottery for pre-K. That is the good news. A lot of the issues have been resolved. Last year one of the issues that we had that was I guess universally supported was a fact we had putting the lottery commission co-AM division under the administrative procedures act. Very simple proposition but in a rewriting of the bill there was a scrivener there. One Senate's put them under it the next Senate's took them out of it. So they're not under it right now. For those of you who aren't familiar with APA it's a simple proposition that government agencies that if they're going to pass rules and regulations they have to advertise them to the public and take public comment and go on from there. The second part of that is once they've done that they have to report back to the legislature what the outcome of those hearings were in the rule changes. In this case being the lottery co-AM division it would be reported back to the House Regulated Industries Committee and to the Senate Economic Development Committee because statutorily those are the committees that are charged with being the lottery oversight. That's quite frankly what it does it repairs an error from last year's bill and I would certainly appreciate your favorable consideration. I'm glad to answer any questions if there are any. You have a question, Ripley of the Earhart right at the center of the aisle. Will you yield for question? Yes ma'am. Thank you Mr. Chairman for bringing this bill. Is it not true that the updates in HB 74 will provide for a more transparent framework for the Georgia Lottery for Education Act to operate and it will not only benefit the public but also the regulated community. To the general lady that has set it on some of these oversight meetings you're exactly right. This is about transparency and government and I would even challenge go further to challenge every member in here. When you see agencies come forth and things that are being done to give agencies power I would certainly certainly encourage you to remember to put them under APA so that they are transparent when they pass these rules and regulations. I know I've been in broad and several issues over the years from cannabis licensing and everything else that there was no transparency and has led to a lot of major litigation. So that being said if there's no more questions you have one more question a few yield from any Washington to your left has a question. Thank you Mr. Speaker for the Chairman you. Yes sir. Is it not true that HB 74 improves the administration of the Georgia Lottery for Education Act and consequently ensures the continued funding of acts on programs and Georgia such as the Hope Scholarship. You're absolutely correct. Thank you for the question. Gentlemen has no further questions ladies and gentlemen I would certainly encourage you to pass this bill favorably as we move on to a cleaning up that that administration and agency. Thank you Mr. Chairman for being proactive make sure it's working like we intended. The general's yield of the well is any objection to the previous question being ordered. Here he none the previous questions ordered is any objection to a green or the report of the committee which was favorable to the passage of the bill. Here he none the report the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine. All members voted I got you take your time. All members voted if so the clerk will lock the machine.\n\non the passage of House Bill 7474, the A's are 169, the A's are 0, this bill haven't received, the requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption to House Bill 81, 81. House Bill 81, by the way, that it baller to the 147th and others to be entitled to an act to amend chapter 6 and title 20. The official code of Georgia annotated relayed in the education compacts, so I'm just answering to an interstate compact for school psychologists. This bill then referred to the committee on education that committee recommends this bill do pass. The lady from Warner Robbins, representative Bethany Ballard, has recognized to present the bill. Thank you, Mr. Speaker. I have House Bill 81. This is an initiative developed by the Council of State Governments in collaboration with the DOD, the Department of Defense and the National Association of School Psychologists. This bill enters Georgia into the interstate compact of school psychologists. It will reduce barriers to certification for school psychologists from the member states. And it will ensure that only qualified professionals are authorized to provide services to our children. This aligns with our priorities of school safety and literacy. And it was unanimous in both subcommittee and full committee. So thank you, and I will yield for questions. You do have a question, Representative Hathner, to your left has a question. Ladies recognize for a question. Thank you, Chair Lady, for bringing this bill. I want to reiterate, is it not true that this bill passed unanimously in both committees? It certainly did. Thank you for pointing that out again. Do you further yield, Madam? Is it also not true that this body most likely agreed to include military personnel and their spouses in this bill language in order to provide much needed financial relief and stability to those who serve our country, recognizing their sacrifices. And easing their transition to civilian lives. The general lady knows of what she speaks. Thank you very much, I yield. Lady Hathner, further questions? Hey, thank you, Mr. Speaker. I yield the well. The lady is yielded the well. Is any objection to the previous question being ordered? Here in none of the previous questions ordered. Is there any objection to agreeing to report report of the committee which was favorable to the passage of the bill? Here in the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We will vote yes. All those opposed. We will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 81. The A's are 165. The A's are 2. This bill, having received your requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 105105? House Bill 105, I represent a way to the 9th and others to be taught to amend Code Section 45, 978. The Fish Go to Georgia annotated relating to payment of indemnification for death or disability generally. This bill haven't referred to the committee on education. That committee recommends that this bill do pass. Gentlemen, Dalsenville, representing Wade is recognized to present the bill. Thank you, Speaker, colleagues. I'm here to present one of Governor Kim's priorities, which is the public school indentification fund benefit increase for our public school teachers. This is just to bring up, thanks, Speaker. If you've got public school teachers in your district, I think that this would be very important for you to hear. We are recommending that we increase, and listen, this is a very somber but very important piece of legislation in my opinion. Back in 2017, this body increased the back of the blue for when a service member, public officer, is killed in a line of duty from $100,000 to $150,000, a death benefit. Our public school safety officers deserve to then, and our teachers deserve it now, and this remedies that disparity in the law will increase it from $75,000 to $100,000. The death, the permanent disability benefit remains the same, is also in parity with both public school teachers now and public safety officers. That's what this bill does, and I hope that I have your favorable consideration, and I am happy to answer any questions if needed. Gentlemen, does have a question of a year's representative rice to your left. Has a question of representative Carmen Rice has recognized for a question. Thank you, Speaker. Does the gentleman yield? I do from my friend. Is it not true that House Bill 105 helps family of fallen educators navigate the sudden loss of income, ensuring they can maintain stability and avoid losing their homes during an already devastating time? The gentleman knows of what she asks. Yes, the gentleman has another question if you are yield. Chairman Hitchens, see your left. Has a question. Tell them in yield. I do, sir. Isn't it true in response to the last question that the money is intended to provide financial assistance to the immediate family? But if there's no spouse or no children, there's no payment. The gentleman is correct, yes, sir. I'd take one more question if necessary. Mr. Speaker. Gentlemen, has no further questions. Thank you very much. I hope we have your favorable consideration, and I yield the well. Gentlemen, as you are the will, we have a couple of folks who are going to speak in favor. I'm going to recognize Representative Barry Furs, and I'll remind that we have two speakers in representing McQueen. You have 30 minutes between the two of you. I take a call. I don't think you will. I'm going to give her some time, too. Yes, sir. You take your time. Thank you, Mr. Speaker. I rise today in strong support of HP 105. And first, I want to express my gratitude to the authors of this bill. This is a simple yet profoundly important piece of legislation, one that acknowledges the immense value of teachers and the sacrifices that we make every day. But while I appreciate this bill, I would be remiss if I would ignore the glaring of mission within its two pages. The silence is deafening, and so I must ask why? Why must the Identification Award for Teachers be increased in the first place? What has changed in the past year has finally forced us to acknowledge that teachers are on the front lines? The answer is tragic, but clear. The leading cause of death for teachers on the job is gun violence. Gun violence has haunted my generation for as long as I can remember. It has shaped our childhoods, disrupted our education, and now as an educator, it follows me into the classroom. But the difference now is not just my life as a stake, it's my students' lives. I have to train my students, children, on what to do if an armed gunman storms into our classroom with the intent to kill. I have to map out every possible scenario in my mind, ask myself where would I stand? How would I shield them? What could I do within my human limitations to protect my babies? As teachers, we have always known that we are essential in this bill, acknowledges that. We have always known that our profession is hazardous and dangerous. This bill acknowledges that. But what this bill does not do is address the root causes of that danger. And I hope that today is the start of that conversation. Teachers of my district, teachers across the state, are pleading for more than just financial compensation in the wake of another and effortless tragedy. We are demanding action to prevent that tragedy from happening in the first place. We need an assault weapons ban. We need universal background checks. We need comprehensive red flag laws. We need more school counselors and social workers. We need better mental health training. We need increased funding for security measures. We need gun manufacturers to be held liable for the weapons that they sell. We need to stop illegal guns from flooding our communities. We need to protect our school's safety zones. The list goes on and on and yet time and time again we choose in action. So yes, I am very grateful that we are providing financial support to the families of teachers taken too soon. But let me be clear, teachers do not enter this profession hoping for a payout. We enter this profession because we love our students. We enter this profession to teach, to inspire, to nurture. And most of all, we enter this profession hoping to return home to our families at the end of the school day. So I say to my colleagues, let today be the beginning, not the end. Let us not only recognize the value of teachers, but also hear our voices and hear our demands to bring true school safety to Georgia. Thank you, Mr. Speaker, you're the well. You have a question if you take a question. I will. The lady representative, do you approach him to this house? Jan Jones, right in front of you, is the request. Thank you, Mr. General Maniel. Yes, I do. Thank you. Is it not true that the leading causes of death for teachers do not include gun violence? That the leading cause of death was last year, was transportation incidents, the other causes are cancer, cardiovascular. Most of the causes of death for Americans, and then actually very few teachers died from gun violence on the job, not including domestic at home incidents. Well, we're talking about what has changed in past year. And I believe the other lady doesn't know what she's talking about. But we do know that teachers are still dying in the job because of violence. Thank you, Mr. Speaker, you're at the well. Jan, would you hear from another question? I will. Or you're well, and you're yelling for a question. I hear the well. Jan, would you hear from the well. Representative McQueen has recognized, speak to the bill. Thank you, Mr. Speaker. Colleagues, I rise today in strong support of House Bill 105, a measure that doesn't just recognize but affirms the dignity, the worth, and the irreplaceable role of educators. Across our great state. But let's be clear, teachers are the backbone of our communities. We are the ones who show up every single day to do the work, to inspire, to empower, to uplift. And we do so in the face of challenges, in the face of uncertainty, and all too often in the face of danger. I want to take a moment to recognize the increase in indemnification from 75,000 to 150,000. Now, let's be honest, that is a significant step. And I know teachers across Georgia are feeling perhaps for the first time in a long time that their lives are being thought about in a way that they simply haven't before. And that matters. It matters because we remember. We remember how during the COVID-19 pandemic, teachers weren't deemed essential workers. Even as we kept schools running, even as we supported teachers students, even as we stood in the gap for families. And now today, this bill sends a message that our lives, our contributions, our sacrifices, they matter. But we must also confront the harsh and uncomfortable truths that this bill lays bare. Because at its core, it is an admission. It is an admission that teachers, yes, teachers, are dying in the line of duty. Let me say that again. Teachers, dying at work. Now, for firefighters, for law enforcement officers, this makes sense. It is understood that their professions come with inherent risks. But for educators, the ones who poured knowledge into the minds of our future leaders, the ones who should be focused on algebra, on history, on critical thinking, not active shooter drills, which happens at the beginning of every year. This should not be so. This cannot be so. Thomas asked the question, why? Why are teachers in such danger? Why have we reached a point where a bill like this is even necessary? Why do we live in a country where classrooms have become battlefields? Why have we allowed this to happen? And let me be clear, this is not normal. This should never be accepted as normal. And so we must acknowledge that increasing indemnification, while important, is not the answer, it is a response. A response to a system that has failed to protect our educators. A response to school shootings that have become far too common. A response to a reality where teachers who dedicate their lives to building up others now have to worry about losing their own lives in the very spaces meant to foster learning and growth. And let me say this, as clearly as I can, the solution is not to arm teachers. They are not law enforcement officers. They are not soldiers. And we should not ask them to be. The answer is not more weapons in classrooms. The answer is ensuring that schools are places of safety, of enrichment, of possibility, not places of fear. I support this bill because it acknowledges what has been ignored for far too long, but acknowledgment is not enough. We must act. We must be bold. We must be unwavering in our commitment to ensuring that no teacher, no student, no staff member, ever has to fear for their lives in a place of learning. So let's get to work. Not just a compensate for loss, but to prevent it. Because our educators deserve better. Our children deserve better. And Georgia deserves better. Thank you, Mr. Speaker. I yield the well. The lady has a question or she can yield. Whatever her desire is. I'll yield the well. The lady's yielded the well. Is there it? Thank you for your comments. Is there any objection to the previous question being ordered? We now have up to 20 minutes for a chairman's time. This bill came from Education Committee. Chairman Erwin has recognized the speak to the bill. Thank you, Mr. Speaker. Colleagues, today I rise before you to show my firm support for House Bill 105. This bill is about fairness and doing right by those who dedicate their lives to our children, which I call heroes daily heroes. It ensures that families of public school personnel who fall in line of duty receive the same level of identification as others covered under this same law. For over two decades, this challenge for public school personnel. Mr. Chair, if you will, you will just for a minute. Yes, sir. Do you, will you close that door to the any room, please? Thank you very much. Proceed, Mr. Chairman. Thank you, Mr. Speaker. For over two decades, this fund for public school personnel have remained unchanged. While back the blue act of 2017 raised the identification level for public school officers from $100,000 to $150,000, the amount for public school employees have remained at $75,000. In that sense, the creation of the act in 2001, this bill addresses the disparity and brings the support for educators, families, and line with other public servants. The tragic events of Appalachia High School remind us of the risk our educators face. In the wake of this tragedy, we have a responsibility to support the families left behind. The teachers who lost their lives that day were not just educators. I want to remind you they were mentor protectors, fathers, brothers, mothers, and pillars of their community. Their families should not have to navigate financial hardship on top of their grief. This is not a partisan issue. This is about helping the families impacted by this tragedy and recognizing the essential role for educators play in our communities and ensure their families receive the same level of support as other public servants. Colleagues, I urge you support our educators in this bill and send a clear message that we stand with the educators in this state and with their children that they not only protect that they teach and they work with every single day. So I ask your support on this House Bill 105, Mr. Speaker, I will yield for questions. The gentleman has no questions. Then I will yield the well, Mr. Speaker. The gentleman's yield to the well is any objection to agreeing to the report of the committee which was favorable to the passage of the bill. Chair, here's none. The report of the committee is agreed to. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 105, the yeas are 168, the nays are zero. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to a group of privilege resolutions? Honoring life and memory of Brandon Beeseewaler. Honoring the life and memory of James Lee Roy Kendrick Jr. Honoring the life and memory of James Lee Roy Kendrick Jr. Honoring the life and memory of James Lee Roy Kendrick Jr. Honoring the life and memory of James Lee Roy Kendrick Jr. Honoring the privilege resolutions. Here in none, the resolutions are adopted. Members, we'll move on to afternoon orders. We have a fair amount of afternoon orders. I want to ask you to hold it to as close as you can to one minute. We'll start with Representative Patty Stenson. Representative Reese, if you'll come, I want to ask you something if you don't mind if you'll come up. Representative Stenson, you'll recognize for an afternoon order. Ladies and gentlemen, if you arise, I know it's all stand with Representative Stenson and friends in the well. Thank you, Mr. Speaker. Ladies and gentlemen of the House of Representatives. Today, we pause to honor and recognize the life and great legacy of the late Reverend Dr. Hosey Waters of Montezuma, Georgia. His pictures listed on the screen. He served as his superintendent for the making county school system for many years. Pastor Waters was a graduate and lower supporter of one of two land grant institutions within the University System of Georgia, deep for Valley State University. He served as the pastor to the Green Grove Baptist Church of Smithville, Georgia, Mount Pleasant Baptist Church of Forsyth, Georgia, Lebanon Baptist Church of Plains, Georgia, and Magnolia Baptist Church of Montezuma, Georgia. And I'm going to yield to our representative, our Williams. Thank you. A great loss to lose some one of the distinction of Dr. Waters. He would preach some of the most provocative sermons you've ever heard that were greatly researched. And he was just deep, very spiritual, very much entuned to the needs of our children and to make him county. With that, Mr. Speaker, will yield well. Thank you for that. Remember us. The lady in the gentleman of the way of Representative Reese members of your remaining standing. I'm sorry, won't make you get up and down. Representative Reese is recognized for her remembrance and condolence. Thank you, Mr. Speaker. Mr. Speaker, this last week the Columbus community lost a young man that was known to many of our community as a bridge or someone who bridged a gap between what some folks would call the streets and politics. His name was Brandon Waller and we call him Beasy. He was a friend of mine. He was a friend of many, but he was also known by many. You know, sometimes God will grant you the friends that you won't, but he will always give you the friends that you need. His leadership was an incognito demonstrative expression of the cross section of politics, community, and care for those with the leaves. His life reminded me of one of the most influential conversationalists in our lifetime. Two-parksha core who once said, I think I'm a natural born leader. I know how to bow down to authority if it's authority that I respect. To his mother, thank you for sharing your son with us. And just remember all my life you have been faithful. All my life you have been good, so good. And with every breath that I am able, I would think of the goodness of the Lord. Thank you. I give the well. Thank you. Members, you may be seated. Now I want you to listen pretty closely to this to this next young lady member, Reps and Kendrick. Are you by, are you going to be by yourself up there? You're going to be by yourself. So we're going to recognize you for a special afternoon order. Reps and Kendrick. Thank you, Mr. Speaker. Good morning, colleagues. I am bringing you the Black History Month moment. And today I want to honor and give flowers to somebody that's still living among us. He didn't ask me to do this, but I believe in giving flowers to people while they're still alive. And that's representative Al Williams. So did you know this about Reverend, representative Al Williams? He was born in Midway in Liberty County to Alexander and Kerry Williams. At 13 years old, he was a doorknaker for John F. Kennedy in his community. As a sophomore in high school in 1963, he participated in the March on Washington. And as a senior in 1965, he marched from Selma to Montgomery. He was jailed 17 times during the Civil Rights Movement. He was the first African American since reconstruction reconstruction to be elected to the House from Liberty County. He was the first black chair to be chair of the Liberty County Development Authority. And he's been married to his sweetheart, Olivia Williams for 46 years. And he has five sons and a yellow lap named Zeus. He is a much sought out speaker across the nation. And of course, we all know it's the best day of his life. So thank you. Thank you for marching. I represent a way so that I can run. Now we're not going to be binding for a speech because you'll make one. My friend, brother and colleague, you're greatly respected all over this state. No matter which side of the aisle you sit on, people love and respect Al Williams. Thank you for your service to mankind. And thank you to Olivia for putting up with you all these years, too, is what I want to... What a good woman she is. No doubt about that. Representative Clark is recognized for an afternoon order. Thank you, Mr. Speaker. Colleagues, today I rise to speak on behalf of the tens of thousands of Georgians, including over 55,000 Georgia students who have a 504 plan. For 50 years, Section 504 of the American Disabilities Act prohibits the discrimination of individuals with disabilities by any entity that receives federal funding. This includes protections that ensure disabled children have access to public education among many other protections. As a mother and also as a college professor, I know firsthand how important Section 504 of the ADA is for the civil rights of individuals with disabilities. That's why it breaks my heart to learn that the Attorney General of our state has joined in a lawsuit that seeks to repeal Section 504 of the ADA. I rise to implore our Attorney General, who has expressed interest in running to be Georgia's next governor, to please consider the lives that could be negatively impacted by the repeal of Section 504. Thank you, Mr. Speaker. I yield the well. Ladies, you are the well-represident of baseball. Recognized for an afternoon order. Somebody is supposed to be. You have somebody joining you? Yes. Thank you, Mr. Speaker. Just for my colleagues, please in observation and recognition of Black History Month, please on Tuesday, February 18th, come with your African garb. Oh, sorry, but no, thank you. And that does not mean working.\n\nmeans proper dress, some of the most beautiful outfits, African outfits, don't come in your working clothes, respect the dignity of the house. Thank you, Mrs. Beaver. Thank you to both of you. Thank you, Representative Williams. You're a stickler about that as we all should be. Thanks for that reminder. Representative Paris is recognized. There she comes. All right, a pretty cool day. Make a day. Yes, tell us about make a day. Beab County's navigation. Y'all, you're coming down. Thank you, Mr. Speaker. Oh, you make a night. Yep, make a night. They're not all gone. I'm here. OK, so all right. Guess what, y'all, make a day. It's coming back to Georgia. Freight, depot. It will be on February the 19th. And we're going to have a fish fry. The fish will be fried on site. You need to just, you know, we've got tickets. It's going to be a great time. We're going to have music. We're going to have a pickleball court there. So any of you all didn't know how to, oh, yeah, that's right. Yeah, pickleball, right. You know, we have the largest pickleball court in this country. OK, right. So it's a lot going on. We're going to have a really good time and do it in McLean the day when it equals make and be a. Thank you all, Mr. Speaker. Thank you so much for your 19th. That will be at the freight depot. Thank you. Thank you, sir. We're on migration. Thank you. Rifted is saying silk cocks in Clifton. Thank you, Mr. Charles. Just for me now, you OK? Let's go now. Thank you, Mr. Speaker. We just wanted to rise and in appreciation of one of our own, Mr. Chavanna Parker, who's a committee secretary for both of us. She, out of her own pocket, you should have gotten a heart flag and the representation of that has is her service as a sergeant in the army. She retired here and now serves us in the legislature. So we appreciate her. And Mr. Speaker, I think she sent one to you directly as well. So thank you, Mr. Parker. Thank you, Mr. Speaker. Absolutely. Now, I appreciate it. Thank you. And we'll be back to you. Thank you, Mr. Speaker. As many of you in this chamber know, our family is blessed with a child who happens to have special needs because of that we are deeply impacted by issues that impact the disability community. Recently, Georgia's joined Texas and 16 other states in a lawsuit, challenging the Biden administration's recent decisions. Some claim that it'll do away with the 504. And that's what we're going to do. Some claim that it'll do away with the 504. Let me be absolutely clear. This is simply not true. Section 504 remains intact. The lawsuit aims to challenge the Biden administration's you don't allow the decision to expand the definition to include gender dysphoria. This move will strip precious resources away from students who deserve them and need them most. And that is our special needs community. So let me reiterate to our community and families out there. If the lawsuit is successful, resources will go back toward those who deserve it and need it most. If it's not, Section 504 will remain in place. So let me reiterate again, to parent section 504 is not at risk. And I support Georgia and the other states challenging this decision. Thank you, Mr. Speaker. Yield the well. Gentlemen, you are the way of representing Draper. Recognize for it in afternoon order. Wow. Well, thank you, Mr. Speaker. I rise today to thank federal employees. And I'd specifically like to thank the more than 10,000 Georgians who work for the centers, for disease control and prevention. Much of what the CDC does is hard to see. Prevention often is. But we live in a remarkable time for public health. You can swim in a pool without fear of polio. Smallpox has been eradicated. Deadly E. coli outbreaks in our food can be controlled. And CDC staff help keep Ebola from spreading to the U.S. I thank you for your service. You are heroes, even though you aren't being treated like it right now. Since unelected President Elon Musk took over the White House, he has been hell-bent on dismantling certain government agencies, including the CDC. He has waged war on thousands of hardworking Georgians causing panic and instability. Because of his indifference and recklessness, public health will suffer. The Georgia employment rate and economy will also suffer. Yesterday, there were calls from this well for to work in a spirit of bipartisanship. Challenge accepted. I'm asking our governor and our other state leaders to step up and lead to call out this reckless behavior that does nothing more than carry out an unelected billionaires vanderas and hurt everyday Georgians. How many of you will join me in calling out these abuses of power? Thank you, Mr. Speaker. I yield the well. Representative Edna Jackson is going to talk to us about a pretty devotion of Edna and Representative Edna Allen Westbrook and Representative Chairman Ron Stevens, all from the great state of Chatham. All right. Good evening, everyone. I guess is that I can't keep up with the time. But we are here to attend on Tuesday morning Savannah State University Day. And we always include Representative Al Williams because he's in and out of us and he does a lot of work with us. It will be held in room 230 here at the Capitol. Not starting at 9 o'clock. Let me apologize for announcing this at this time. It is my fault. Also, the menu for that morning will consist of shrimp and grits coming from the hostess of the city of the South Savannah, Georgia. Thank you, Mr. Speaker. We look forward to a talk. I've never done you to forget anything when you led the great city of Savannah. You're always on top of it. As you are here, that completes afternoon orders. We have a couple of pieces of business we want to tend to. Fort purposes, Ripson, he's fry rise. To make a motion. State your motion. Mr. Speaker, I move that House Bill 402 be moved from regulated industries to energy utilities and telecom communications in both chairman and agreement. Thank you, Mr. Clerk. Can you read the caption? House Bill 402 by Representative Fry and others to be entitled to amend Title 46 and 50, the fiscal to Georgia and the Title relating to public utilities and public transportation in state government. On the gentleman's motion, the House Bill 402 be withdrawn from the regulated industries committee and recommitted to the energy utilities and telecommunications committee is their objection. Here, he's known as awarded. For what purpose is representative Pantit rise? To make a motion. State your motion. I move that the rules be temporarily suspended so that a bill may be read for the first time in a signed to committee. Mr. Clerk, can you read the caption to this unnumbered bill at this time? Unnumbered House Bill by Representative Pantit, to the 51st and others to be titled an act to amend Code Section 24 or 5-01 of the fiscal to Georgia annotated relating to certain communications privileged. On the ladies' motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed to committee is the objection. We will assign that bill to if there's no objection to judiciary non-civil. For what purpose is representative Brad Thomas rise? Make a motion. State your motion. I move that the rules be temporarily suspended so that a bill may be read for the first time in a signed to committee. Mr. Clerk, will you read the caption to this unnumbered bill at this time? Unnumbered House Bill by Representative Thomas, the 21st and others to be titled an act to amend Code 40 that fiscal to Georgia annotated relating to motor vehicles and traffic. On the gentleman's motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed to committee is the objection. Here he none. Motor vehicles. We have some announcements. Chairman Stevens, as recognized for an announcement. Thank you, Mr. Speaker. Before you go home this weekend, the Economic Development and Tourism Committee will meet today, 1 o'clock, lunch and learn room 403 capital. Representative Dewey McLean, recognize for an announcement. Thank you, Mr. Speaker. The working family caucus will meet in room 307 at CLOB and the days, the topic will be key health care priority issues in 2025. So 307 at CLOB, I know a lot of things are going on today, but look forward to seeing you all at 307 through the working family caucus. Thank you, Mr. Speaker. Thank you, Representative Claim. Representative Dina, recognize for an announcement. Thank you, Mr. Speaker. Colleagues, today I am hosting capital conversation and tours for members from my, from concerns for my district. I know you're all invited to come and have a conversation with them. We'll be talking about issues and education, safety, of course, the price of eggs. Thank you. Thanks, Mr. Speaker. You got it. Leader of the stretch is recognized for an announcement. Because we are famous speaker, because we're out on Presidents Day on Monday, there will be no committee chairman's lunch on Monday. Committee chairman's lunch will be on Thursday next week and we'll get out and notice for that. Thank you. Chairman Hilton, recognize for an announcement. Thank you, Mr. Speaker. Very important meeting, education, policy subcommittee meeting in room 506 at 1 o'clock. We're going to be taking up the school safety bill. So if everyone can be there, sharp and ready to go, 1 o'clock, policy subcommittee 506 at 1 o'clock. Thank you. If you're on that subcommittee, you need to be there. Representative Jasmine Clark, recognize for an announcement. Thank you, Mr. Speaker. Members of the Gwinnett delegation, we have a meeting today at 1 o'clock in mezzanine 2 of the capital. The sheriff of Gwinnett County will be there. I hope that you all can attend. Thank you very much, Mr. Speaker. Thank you. Mr. Rules, Chairman, you having a rules committee meeting this afternoon? Not quite. Chair, Mr. Recognize. Representative Parrish. Thank you, Mr. Speaker. Just to remind everybody we're going to be out on Monday. We will be having a rules committee meeting Tuesday at 11 o'clock. Tuesday at 11 o'clock. Hope to see you there. Thank you. Tuesday at 11 o'clock. Now let's see where we will be known to a very important announcement. Now, Representative, your mighty Holly is recognized for an announcement. What are you going to talk about? Getting old. Oh, yeah, you are. Thank you, Mr. Speaker. Our colleagues. Thanks. This is the very first time I'm doing this. I'm actually going to be not so much of a politician. And I'm going to ask for you to join me as well. On Sunday, February 16th, I'll turn the ripe age of 49 years old. But I want you all to join me because I'm going to have my very first Holly day. You'll get an email. You'll get an email out there. Let me tell you, you'll get an email. I would love for you all if time would permit to bring your funny uncles and your funny aunts out here and just loosen up. No suits, no ties, no formal attire. And let's just go have some games and some fun over at your third spot over there off of Ellsworth Boulevard. And let's just be humans. Is that okay? Just be just be who you were before you got here. And I love on you the same. But thank you, Mr. Speaker. The same hat. Happy birthday, Representative. On Sunday, we're going to wish both of these folks a happy birthday. Guess who else has a birthday. Representative Sheila Jones and Representative Holly on Sunday. Let's wish them both a very happy birthday. Thank you. Well, I think that completes our work for the day. So we're out tomorrow. Is that right, Mr. Leader? Sir. I'm going to enjoy your family's own Valentine's Day. Happy Valentine's Day. Is all of you here? And also on Monday is President's Day. Yes, sir. So we will come back to here at some time on Tuesday. And that's what you're going to tell us, right? Mr. Speaker, I move that this House stand adjourned until 1 o'clock PM on Tuesday, February 18th, 2025. I'm expecting a good vote on this one now. On the motion of the majority of this House stands adjourned until 1 p.m. on Tuesday, February 18th, 2025. All those in favor say aye. That's what I'm talking about. All those opposed, no. There's no doubt that I was having today. Like y'all, y'all be safe and have a good weekend. We'll see you back here on Tuesday. But if you have a committee meeting today, you need to be there. Thank you.",
  "updated_at": "2026-02-13T02:48:44.498132+00:00"
}