{
  "video_id": "5k0-Ad0oQzo",
  "url": "https://www.youtube.com/watch?v=5k0-Ad0oQzo",
  "title": "1/9/2024 - Senate Committee on Regulated Industries and Utilities",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 84,
  "summary": "Overview:\nThe Georgia Senate Committee on Regulated Industries and Utilities held a session on January 9, 2024 to discuss sports betting legislation. The discussion focused on the history of sports betting legalization in the U.S. and Georgia's previous attempts to pass related bills.\n\nKey Actions:\n**SB 172**: Enabling legislation for sports betting that was introduced by the committee chair but tabled before crossover day last year.\n**SR 140**: Constitutional amendment introduced alongside SB 172 to provide authority for sports betting.\n\nBills Introduced (First Reading):\nNone mentioned.\n\nNotable Moments:\n- The committee chair provided an overview of past sports betting bills in Georgia, including SB 57 which passed the Senate Economic Development committee but was defeated on the Senate floor.\n- The chair discussed his longstanding interest in gambling issues, including efforts to ensure the Georgia lottery meets its statutory profit requirement.\n- The chair noted the evolution of attitudes towards sports betting, from the \"taboo\" of the past to its widespread acceptance and integration into sports media coverage today.\n\nVotes:\nNo recorded votes mentioned.\n\nAttendance:\nNo quorum notes provided.\n\nAdjournment:\nNo adjournment details given.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nSo, like the second day of school here today to have the whole team back on board, we were\nencouraged this morning by our majority leader that committees needed to get to work, that\nWe had a lot of backed up bills from the last year\nand that we needed to make good use of our time here.\nSo we went ahead and called a meeting.\nStart off just kind of having a refresher\non one of the subject matters\nthat we know we're gonna deal with again this year\nand that sports betting.\nSo I thought I might give a little bit of an overview\nof what happened last year, the different bills\nand their outcomes.\nAnd we really only have one left in the breast\nthis committee and that Senate bill 172 that deals with sports betting was enabling\nlegislation for sports betting that I introduced and it was tabled just before crossover day\nand was not taken off the table or acted on by the Senate, you know, either yay or\nnay. So it got recommitted to our committee yesterday morning along with all the other\nbills that had been tabled or that were sitting in rules committee. I made some notes just\nsort of thinking back. This feels like it's been a sort of a long process almost. It's\nbeen multiple years we have been dealing with these different gambling issues. This became\nkind of a hot issue. I think it was 2019 when the United States Supreme Court struck down\nfederal law that prohibited sports betting. It actually had carved out an\nexception for states that wanted to opt out of that bill and as far as I can\nrecall it was only Nevada and Oregon that opted out and that's why all the\ncasinos allowed sports betting out in Las Vegas but that was not permitted\nanywhere else in the country. That was challenged by the state of New Jersey\nwent all the way to the U.S. Supreme Court, which decided that was inappropriate to prevent\ncertain states from participating in activity and giving others the exclusive domain there.\nAnd so it was thrown back to all the different state legislators to decide whether or not\nthey wanted to legalize sports betting or not.\nAnd there's been a movement pretty much nationwide since then, as states have considered\nthis issue, many have now permitted it.\nLast count I heard was somewhere between 36 and 38 states\nnow permit some form of sports betting.\nMany are going with the online route,\nwhere you do it on your cell phone or on your computer,\ninstead of going to a live casino.\nSome have only live casinos or sportsbooks where you can go.\nSome have a mixture of both.\nbut we're seeing quite a bit of that.\nSo last year in the Senate,\nthere were three different bills that dealt\nwith sports betting.\nOne was Senate Bill 57,\nthat was sponsored by Senator Hickman.\nIt did not come through this committee.\nIt went through economic development,\nand it passed out.\nIt provided for both sports betting and horse racing.\nAnd that bill was heard, it got out of that committee, got on the rules calendar, and was defeated on the floor of the Senate.\nI think it was 19 votes in favor, and 37 votes against.\nAnd that bill was crafted in such a way that they argued that it did not require a constitutional amendment.\nAnd it did that by defining sports betting as a lottery game that has already permitted\nunder the lottery corporation.\nUnique approach and it failed in the Senate.\nA similar bill, it's significantly different, but the same concept attempting to legalize\nsports betting without addressing a constitutional amendment is pending in the House.\nAnd I don't believe it's gotten out of committee.\nWe will see what happens this year.\nI got interested in this subject matter.\nIt's got to be four or five years ago now.\nBecause I've been active in a group called Nickel G's,\nNational Conference of Legislators from Gaming States.\nAnd they review and summarize and keep up\ntoday on all different forms of gambling.\nThat would of course include sports betting now,\nbut particularly casinos, Indian casinos,\nhorse racing, lottery, and I had a particular interest\nat the time in making certain that the Georgia lottery\nhad a high enough rate of return or profitability.\nIt was not returning what we had dictated\nby statute that it should, which is 35% of all the bets made.\nAnd it troubled me that that law was being pretty much\ndisregarded. So I wanted to learn what other states were doing. And I learned that most\nof them have very similar statutes that require a particular rate of return. And they average\nabout 30 to 32%. We were a little bit above the average, but there are a lot of states\nthat were 35%. At the time, Georgia was returning somewhere between 23 and 25%. We were\ntalking about revamping the hope scholarship program because it was inadequately\nfunded and it occurred to me that will heck the money's there if you just don't\ngive away so much in prizes and advertising and you keep that 35% for profit but\nI wanted to get the data so I started attending these meetings of this\norganization and in the course of that I learned about quite a few different\ntypes of gaming and as this issue came to the forefront with that Supreme Court\ndecision I began to learn about it. I had a meeting I think this was four years\nago at the Atlanta Braves offices with not only their personnel but all the\nmajor league sports franchises who were pushing for it. And they're pretty\nhonest that one of the reasons is this increases viewership. People will pay\nattention to games that's not their home team. Or even after the outcome of the game is over,\nit's determined you might still have other bets that are proposition bets or live bets that\nmake you want to keep watching. That increases the TV ratings, which increases, of course, the TV\nrights contracts that all of these leagues have been renegotiating and the increases in those\ncontracts has been exponential.\nMark Cuban, who owns the Dallas Maverick,\nsays the value of his franchise has doubled\njust since the acceptance of sports betting.\nIt is that much more lucrative because the interest in the sport\nhas increased, which means the viewership has,\nso the TV rights have increased, and other forms of revenue.\nSo it is a game changer.\nIt's really unique to have watched the change over time from the Black Sox scandal, from\nPete Rose being banned from baseball, old folks like Tripp here, Paul Hornig got suspended,\nfootball running back, I mean it was taboo to relate, you know, have any gambling association\nwith sports and one of the main reasons is because it impacts the integrity of the sport.\nIf you don't believe it's a pure contest that's being played without one team or the other\nshaving points or somehow having a financial benefit from changing the outcome, it's\nmuch less appealing to viewers.\nWell, that's changed so much now.\nWhen you watch ESPN down at the bottom line, it's telling you what the betting line is.\nWhat's the spread on a game?\nThey have on college game day, used to be the bear.\nI don't know the new guys name where they, hey, picks his games of the week.\nYou know, what's the best bets?\nWhat are your super dogs, et cetera?\nSo times have changed quite a bit.\nSome years ago, when I became chairman of this committee was when I was getting intrigued\nby this and thinking maybe it was time for us to prove it, but to regulate it.\nAnd I persuaded our lieutenant governor, Bert Jones, to carry the bill because it was coming\nbefore this committee and some of you may remember that the lobbyist in the room, well\nwe heard that bill thoroughly a couple of times and then I was instructed by leadership\nnot to vote it out of committee. So we never took action on that. Some years later there\nbeen other versions that have come and so finally last year I introduced Senate Bill 172\nis in our folders here today gentlemen ladies and also a constitutional amendment SR 140 and that\nwas to give constitutional authority for sports betting 172 was the enabling legislation and just before\ncrossover date SR 140 was presented and it also failed to send it and it had 30 votes in favor of\nof that approach and 26 against versus the 19,\nfour and 37 against for the version\nthat had no constitutional amendment.\nSo both of them failed and once that constitutional amendment\nfailed, we just kind of moved on.\nSo here we are again, it's just got thrown back to us\nand I got the bill and I said, you know, really,\nwe have spent a couple of years in this committee\nthrashing through all the angles, all the pros, all the cons.\nI had where we had three different hearings last year.\nWe had a hearing only on both the CA and the Navy and the legislation on February 16th of\nlast year, again on February 23rd, and then we passed this bill out on February 28th\nout of committee.\nAnd it passed 7-1, by the way, last year.\nfailed on the floor. I had spent a lot of time and I'm looking at our minority\nleader here as I mentioned this trying to generate bipartisan support. I think\nwhen you make a significant public policy change like this that you need to\nhave buy-in from everybody and all parties need to be at the table so I have the\noriginal blue back to copy from last year. I was the first signer our minority\nleader was the second signer. Senator Brendan Beech was the third\nsigner. Elena Parent was the fourth signer. Carden Summers signed and it went on\nand on and we had my friend Senator Harbison signed so it was pretty equal\nnumbers of Democrats and Republicans that supported this bill. One thing that\nwe spent a lot of time working out was where would the proceeds go and\nAnd one big advantage of a constitutional amendment is that is the only way that now that we\nare permitted to dedicate funds instead of going into the general fund.\nAnd we had worked out a formula that was agreeable to everybody, I think, maybe not Senator\nLucas.\nWe worked on him.\nHe was our one no vote.\nAnd I'll tell you why.\nWe had 50% of the money went to needs-based scholarships, which are not provided for under\nour hope scholarship system.\n25% went to health care, economic development, mental health treatment in rural areas of\nthe state and poverty stricken areas of our state, even if they're not rural.\nWe had 15% that went for problem gaming, both education to prevent it and treatment for\nit, because that has become one of my major concerns in this area.\nWe had 5% that went to innovation educational programs, and 5% to promotion of sports in\nthe state of Georgia.\nAnd that I think is where I lost you, Senator Lucas, all that we tried to word the language\nto give you money to promote that sports hall of Georgia,\nfootball sports hall of fame that you have in making.\nWe wanted to promote sporting events in our state,\nlike Final Four for Basketball,\nCollege Football Playoffs, Super Bowls, World Series, et cetera.\nSo some of that money of that 5% would be spent\nfor those type of efforts.\nIn any way, that was done with everybody at the table,\nBut we didn't get agreement of 38 votes in the Senate,\nthe two thirds.\nAnd so now we're back to the drawing board\nand kind of a Hail Mary pass for me is I'd like to see us look\nagain at SB 172.\nIt has not been changed.\nNo changes other than a little bit\nof grammatical corrections by the editors\nin the legislative council's office.\nAnd the changing of the name where the lieutenant governor was given certain powers to appoint\npeople to president of the Senate.\nAnd that's just a drafting preference of legislative counsel's office.\nBut other than that, this is the exact same bill that we've talked about at Nazim last\nyear and have voted out of this committee before.\nI wanted to talk a little bit about this whole concept of constitutional amendments versus\ngoing around that process.\nAnd I have in your folders committee members a copy of our constitutional provision that\ncreated the lottery.\nAnd I just made a photocopy out of the book.\nSo that is the area in the Constitution that mentions this is Article 1, Section 2, Paragraph\n8.\nAnd it specifically allowed Lotteries and the nonprofit bingo games.\nAnd it told what the money would be spent for.\nIt created the Lottery Corporation in accordance with this and dedicated its resources to pre-K\nprograms and hope scholarships, and that program has been wildly successful for our state.\nPart of the deal, though, part of the social contract, so to speak, when the voters of\nthe state of Georgia agreed to have a lottery, there's enough gray hair out here in the\nroom that remembers that was one of Zell Miller's big sort of ideas, or his agendas, his\ninitiatives, what his idea to start with, he fought it first and then bought in and\nendorsed it and it helped him get elected.\nBut part of that constitutional amendment allowed the lottery, but at the same time very\nspecifically prohibited Casino gambling and paramutual betting.\nSo it made it clear, all right, Georgia voters, we're going to ask you to approve a lottery,\nwe're going to dedicate the money to education, but to make sure that we're not opening\nup the gates wide to all kind of gambling, we're going to make it part of our constitution\nthat there's not going to be Casino gambling, there's not going to be paramutual horse racing,\nis how they take horse racing bets in this state. It did give the lottery a little flexibility,\ngave the legislature some flexibility to allow other lottery games. Now, so I would\nremind you at that time, there was no sports betting in the state of Georgia or any other\nstate except Nevada and Oregon. It was illegal under federal law, so there's no way that\nwas contemplated when the voters allowed our lottery, in my opinion.\nThere were other states that had lotteries, but the only kind of lottery games that I'm\naware they had other than the draw games, like Mega Millions, Powerball, now Fantasy\n5, were the scratch off tickets, and there were no other states that had sports betting\nas a lottery game, so I don't believe Georgia voters were approving that at the time\nthat they voted on the lottery.\nSince then, there have been a few people trying to find ways to circumvent that requirement\nof a constitutional amendment.\nI don't see anything to fear from a constitutional amendment.\nI think if you make a policy change like this, it ought to have the buy-in of both parties\nand the citizens ought to be on board to do that.\nSo I embrace that opportunity.\nBut we were presented last year with an opinion\nfrom Harold Milton, who was previously\non the Supreme Court of Georgia, that said,\nyou could do this without a constitutional amendment\nif the legislature defined it as a lottery game.\nI don't see Josh Belafonte in the room.\nHe may be, he's a back row like the Presbyterians but he wrote a very insightful letter to Senator\nHickman last February that also said it was possible to have sports betting and even horse racing\nwithout a constitutional amendment, a little bit different line of reasoning in his analysis.\nI'm sort of paraphrasing slightly here, maybe greatly, that you didn't even necessarily\nhave to call it a lottery game since it was not Casino gambling and was not paramutual\nbetting that you could do it without even running it through the lottery.\nAnd that was because Senator Hickman's bill did not use paramutual betting where you\npool your money and divide it up by winners.\nhis allowed for fixed odds, horse racing bets, as I recall it.\nA friend of mine from Athens, John Barrow, Democratic congressman, previously a city councilman\nin Athens and a Harvard law graduate scholar, wrote an op-ed and Atlanta paper that said\nthat's a bunch of bunk, you gotta have a constitutional amendment to have sports gambling.\nI think the majority of you lobbyists in the room probably agree with that, some prefer\nanother way because they don't think they can get two-thirds votes, but I would bet you\nI know of the people that have talked to me, the majority of you, I believe that.\nLegislative Council's office wrote a letter to Chairman Alan Powell back in 2021 that\nanalyze this same situation and said it could go either way, basically. In fact, in a clever\nphrase at the end said it's a toss of a coin. But the safe play is to do a constitutional\namendment because there will definitely be protracted litigation afterwards contesting\nanybody that tries to go forward without a constitutional amendment. And you're spending a lot of\nmoney on these licenses and that's pretty high risk. From my legal analysis, I\nagree with the version that this requires a constitutional amendment. I just\nthink it's a real stretch to call sports betting a lottery game when that was\ncertainly not the case at the time we created our constitutional\nexception to allow lottery and lottery games. So this to me seems to be the\nway to go. It is in my opinion legally required. The other huge advantage of it is it allows\nyou to dedicate funding. If you do it by a constitutional amendment, you can dedicate\nwhere the proceeds, the tax proceeds, the revenues are spent. And otherwise, there's only\na very narrow exception up to 1% of our budget can be dedicated funding. Otherwise, it naturally\nthat falls into the general fund.\nAnd we may very well discover or decide, agree together that that's the best place for\nany gambling proceeds to go is in the general fund and let us do our job in the budgeting\nand appropriations process to allocate it where it's most needed.\nBut we will be allowed to dedicate the funding if we can reach an agreement.\nMy proposal last year was not agreed upon by two-thirds of the Senate, so we didn't get\nthere.\nI do think the political reality gives us another reason to use a constitutional amendment.\nAnd that is that there are a lot of particularly conservative Republicans that are very hesitant\nsupport gambling because their constituents aren't all in on this.\nAnd it's much easier to say, I will vote to allow the public to have sports betting, although\nI personally don't participate in that, more of a libertarian take on it, you know.\nThen might go out on a limb and vote for a bill that isn't a company by a constitutional\namendment.\nJust legislation, enabling legislation without that.\nI really believe the math will prove as we go through this session, and I think last\nyear's votes did just that, that show there are greater amount of senators that will vote\nfor a bill if it's predicated on a constitutional amendment.\nAnd I think it's the right thing to do, to let the people aside when you're making a major\npolicy change.\nI do think times changed.\nIt's obvious that this is very popular around the country.\nBut I've also learned that if we're going to do this, we need to do it right.\nWe are seeing as states have allowed this, one thing is the revenue is not nearly as great\nas projected by the proponents of these bills.\nI think in my opinion, you're probably going to be closer to the 50 to 75 million range\nof revenue to the state of Georgia.\nan insignificant amount of money, but when you're getting about 1.2 billion from the lottery,\nit is a drop in the bucket comparatively.\nAnd that's one reason why this money was not dedicated in this enabling legislation to\nthe hope scholarships because they are well funded at this point, and this is not significant\nenough to move that needle.\nI don't know how that will change in the future,\nwhether those revenues will grow or not,\nbut it's relatively limited.\nAnd when you're at a time of $16 billion in reserves,\nthat is not to me appropriate motivation\nto be pursuing this legislation.\nIf we're going to do it, I do want us to do it right.\nAnd I think we need our job as a legislator\nis to set the regulatory framework, the rules,\nthe guardrails if you please, the protections for the public, and most importantly, I think\nwe need to deal with the potential for problem gaming.\nThat's the other thing we've learned through these other states experiments in this area.\nThe revenue is not nearly as significant as dreamed and hoped for, but there is a drastic\nsignificant increase in problem gaming or addictive gambling.\nAnd for some reason, that is the younger males are particularly susceptible to that.\nThe 18 to 35-year-old males are the highest incidence of gambling addictions.\nAnd that is destructive.\nAll right, I see an under 35 that you've got your laptop.\nAre you placing a bet now?\nI mean, you know what I'm saying, don't you?\nOkay, here we go.\nI wasn't necessarily planning on taking testimony today,\nbut we've heard so much, but I'm happy to,\nif you want to tell us about it, by name.\nLet's talk about a little bit,\na brief refresher of Senate Bill 172.\nWe do have a new number on it,\nLC number, although it is the same bill.\nIt is LC-36-5642S that we are considering today.\nAnd it does a number of things.\nI am going to pass the gavel at this point\nto my vice chairman, chairman Summers.\nCould you write it?\nIt could be rough here.\nSince I will be, yeah, I'm a little nervous\nwhenever I do this, so that I can present the bill\nbefore I do so I'd like to say if are there any committee members I know my\nfriend senator lucas may have a comment what's your number there buddy\nyes miss jimin I thought that we had worked out that the part of the\nprocedure would go to the sports hall of a we did you and I did and our colleagues\ndid not accept our proposal well I you and our colleagues but one\nCodley, son of the beach, it's one is stubborn, well, and opposed it with everything that\nwas in it.\nI do agree with you, though, a constitutional amendment, if we put it on the ballot, the\npeople will pass it.\nThe problem is getting it on the ballot.\nThe other reason on the amendment is that if it's constitutional amendment, the governor\ncan't veto it as he did when we changed the law to put funds in the ballot.\nin the Georgia budget for the Georgia Sports Hall of Fame\nand Eli and I had them be told it.\nAnd so we've been dealing with that.\nThat sports hall of fame and making it's not a local\nhall of fame, it is a statewide hall of fame.\nAnd it's the largest in the country.\nSo consequently, we have bills that affect that thing.\nIt's basically HVAC all doing it.\nBut I didn't vote against it.\nI voted with you because that language\nwas was put in for this for something and I'll continue my\nsupport of that as you know I'm a making boy that I visited that\nsports museum and I think it's a treasure for the state and it's worthy of\nexpenditure of state money and I'll continue helping you do that\nand the way I envision this is that I know and Senator Somers may have something\nto say he has shared with me that he intends to introduce a proposed\nConstitutional Amendment this year. Senator Beech has also indicated he intends to do so.\nI intend to try to rework mine that failed to see if we can find the magic potion\nthat would apply only to sports betting. We have some days to do that but since this one's\nbefore us I thought we might as well deal with it first. I will say, I mean if you look to the\nthe very end starting at line 15-16.\nThis is a 61-page bill, so it's very comprehensive\nthat it makes it clear at starting really down at 15-20\nthat this is contingent upon a constitutional amendment\nbeing passed, right?\nAnd if a one does not, this will be automatically\nrepealed upon the failure of a constitutional amendment.\nSo even though we don't know the details\nof the constitutional amendment yet,\nWe know that we have to agree on one\nand the voters have to approve it\nbefore this becomes a law.\nFair enough.\nOkay.\nAnybody else, did you have a comment?\nBox Chairman.\nAnybody else on the committee have any general thoughts\nor overviews or ideas?\nSenator Harbison.\nThank you.\nMr. Chairman, I just want to say a few words about,\nand you mentioned you're very thorough\nand I appreciate you as usual,\nyou're very thorough in your explanation of it.\nAnd I just want to express the concern that a lot of people\nhave about look cautionary or concerned about when we\npass these kinds of bills that we ring up.\nWe try to bring out earmarks and things\nto certain programs, including the sports museum\nand things like that.\nAnd even kindergarten and looking for moneys like that\nand looking for moneys like we had headed in the direction\nwhen we came up with a lottery in the first place.\nIt was a flat out, need-based scholarship program.\nIt was, and it was earmarked, and hopefully we'll come up\nwhen we come up with a constitutional amendment.\nIt will have our concerns in there about pre-K,\ntechnology, deserts, and we can, I think we can do\nof those kinds of things, as you mentioned in the Constitution amendment, I just want\nto let you know that we have those kinds of concerns in there.\nAnd I know, I think you've been very, very thorough, but in that little area, I think we've\njust sort of, we want to do the casual thing, as opposed to putting it into law.\nAnd I understand we can't do it unless it has that Constitution amendment, but I just\nwant to sound their alarm about the fact that we're feeling the need to have something\ndone earmarked towards those projects that we mentioned that passed over and over again.\nSports of the pre-Kindergaard programs and some of the programs that we've we've\nhad numerated from the from our leader all the way down to yeah and and it's a\nbig need there real hospital account just some things I think we can take\ncare of not being crazy broad but I'm just saying that we need to say took a\na look at some of those things.\nYou're preaching to the choir.\nThere's them.\nOkay.\nI agree with you completely on that, and I think that's an advantage of the constitutional\namendment process.\nThat's the only way we can sort of lock in those earmarks as you've called them or dedicated\nfunding what I call it.\nAnd those are the areas that are calling out for help.\nSo I'll continue to work with you as we try to get to that point in the game if we can\nand reach a consensus of two-thirds of our membership\nto agree to one formula or another.\nSo what this does is a few things,\nI'm gonna actually change chairs with you,\nChairman Summers, so that you can preside\nand I'll be sort of lay out the bill.\nThank you, John.\nSeven?\nOkay, so brief overview and I'm not going to go line by line because I really feel like we've talked about this quite a bit already.\nIn fact, I presented it from the floor of the Senate already as well as us having those three meetings in here last year and multiple meetings before.\nAnd y'all are such loyal committee members.\nWe have a lot of continuity on this committee that they're not a lot of turnover.\nSo I think most people know it, but I'm certainly willing to answer any questions.\nI'm going to give you the overview.\nNumber one, it does allow sports betting, which is not presently allowed under Georgia law\nunder any circumstances, whether it's a constitutional memo or any other type\nof legislation that is prohibited now.\nAnd it allows it in two formats.\nOne is the online applications or really any computer terminal, iPad, telephone,\nthat's a smartphone, et cetera, that can connect to a sports betting platform and make a bet,\nas well as any remote terminals, some call those kiosks.\nIf you are any gamblers, they've been to Las Vegas and the sports books out there,\nthey have little, look like little ATM machines where you can go up and type in your bet\nand put in your money and place the bet.\nSometimes those sportsbooks in Vegas will have a counter with live humans taking bets\nbehind it too and also have the terminals where people can make bets where they don't feel\nas pressure or maybe it's not as long of a line or feel a little more private or whatever.\nI think those sportsbooks, you know, like that because it takes less personnel from their\nstandpoint to accept the bets. But this permits either format electronically to be placing bets.\nSo if the Atlanta Braves or the Falcons wanted to have a sportsbook in their stadium and\nmany pro stadiums do now in other states, then you could go up and place your bets at\nthe game if you wanted to or you could have terminals either at a sportsbook or perhaps\neven in a sports bar if it was licensed to accept those bets.\nIn order to regulate this, it sets up the Georgia Gaming Corporation that will be made\nup of seven members, three appointed by the Governor, two by the Speaker of the House,\nand two by the President of the Senate.\nThose seven individuals will select an executive director to run the Georgia Gaming Corporation.\nIt also creates a identical Georgia sports betting commission to supervise and regulate\nthis entire program.\nIt's the same people in both the gaming corporation and the sports betting corporation because\nthat's the only type of gaming that will be allowed under this enabling legislation.\nI see Chairman Stevens from the House here with us and I think he and I have a similar\nvision in the event, the legislature and the people of Georgia were to want to expand\ngambling beyond just sports betting.\nIt would be very easy to then set up a horse racing commission and a casino gambling\ncommission as well that would all be under the umbrella of the Georgia gaming corporation.\nBut this bill is only dealing with sports betting so it sets up a Georgia sports betting\ncommission.\nThat commission would then be empowered to issue licenses to people that wanted to provide\nsports betting, to bookmakers, so to speak, as well as equipment manufacturers and whatnot.\nIt provides that there will be at least six licenses granted and it guarantees that the\nlottery corporation, if they want to, is entitled to one of those licenses.\nSo the lottery could serve as one of the providers, one of the licensees to offer sports betting\nthrough their marketing apparatus if they elected and wanted to do that.\nAnd then the others, that could be, there's no limit, but there'd be at least six to allow\nfair competition of the different vendors or people that would like to engage in this.\nI'd like to see it encourage citizens of Georgia to be providing these betting platforms\nnot just Las Vegas, and this encourages that.\nIt also then sets up for the taxation of the revenues, the profits generated from sports\nbetting has two rates, and I'll tell you why, generally speaking, it would be 20 percent\nof the net revenues from gambling activities.\nBut it would be 25% for certain types of bets\nthat are very high profit areas for the bookmakers.\nAnd those are parlay bets.\nMay some of you may remember the old parlay cards\nback in the day where you pick a number of teams\nand you gotta get them all to win your bet\nand they pay higher multiples than just the amount\nyou bet, they're harder to win, they're more profitable to the bookmaker.\nOr proposition bets, which have become very popular as to some outcomes of events within\na game, not just the outcome of a game.\nFor example, how many yards is a certain running back going to get?\nHow many receptions is a quarterback going to throw?\nWill there be a punt return for a TD?\nI mean, you can come up with innumerable proposition bets\nthat are difficult to win.\nThey have a higher profit margin for the bookmakers.\nAnd the most recent sort of development in betting\nis what's known as live betting, where\nthere are new bets that are created during the course\nof the game.\nYou know, whether a team's going to make a first down,\nthis set of downs.\nThe point spread changes as the game goes.\nYou may be betting on a baseball game\nand you're getting one and a half runs for your team\nand they're already losing by four runs.\nWell, why not just turn off the TV and go home?\nWell, you could start a new bet\nthat what's gonna happen for the duration of the game.\nAnd you can come up with a million permutations of that,\nbut those type of live bets,\nthey keep betters engaged in the game betting\nas they're watching the game\nor high-profit for the bookmakers,\nand so those type of bets,\nparlay's propositions and live bets\nwill be taxed at 25%.\nThere are also quite a few provisions in this bill\nfor the protection of bettors.\nAnd that's what we ought to be doing as regulators\nis making certain that citizens don't get fleeced\nin this whole operation.\nYou always laugh when they call those slot machines,\none arm bandits back in the way, the day.\nYou know, now they don't even have a thing to pull,\nbut that's because they're robbing you of your money.\nThey're the bandit.\nYou're the victim, voluntary, many times,\nbut anyways, in this case, we wanna make sure\nif you go place a bet and it's somebody that's been licensed\nunder our sports betting commission,\nthey're gonna pay that bet off.\nAnd so they're required to keep certain reserves here\nto make sure that they have kept enough liquid reserves\nto pay all the bets that they've taken in.\nAnd they have to have a minimum of 500,000 in reserves\nor bond in that amount.\nWe also require them to pay within a certain amount of time.\nWe require them to use official data\nas to the matters that you're betting on.\nEverybody can figure out what the score is,\nbut how do you know exactly how many yards\nHerschel Walker got in that ballgame?\nSomebody has to be keeping track of that.\nAnd so these bookmakers are required to use either official league data that's provided\nby the sports leagues or other official data that's been approved by the regulatory commission.\nThere are a number of provisions that are to protect betters and I can kind of just,\nlet me see my copy there.\nI can direct you to some lines in particular.\nI started line 418 on page 17\nwhere it starts listing a number of things,\nreally starts at line 420 that the commission must do.\nI'm gonna just read a few of these\nbecause this Nickel G's organization,\nI talked about came up with some rules or procedures\nThose are procedures or principles I think they call it a responsible gaming, responsible\nsports betting that were approved by this nationwide organization and encouraged for each\nstate to incorporate and I've incorporated all of them here.\nI was told by folks last year some of you may remember that came, they actually spoke\nagainst the bill.\nThey came to say how terrible gambling was but how this bill of all the ones they had\nscene had the most protections against problem gaming and addictive gambling.\nSo it requires the commission to establish and administer programs to assist compulsive\nor probably problem gamers, including educational information to teach people about making smart\nbets, so to speak, and what their odds are, the likelihood of winning bets are losing,\nthey'll basically know are they making a sucker bet or not? If they are at\nleast let them do it knowingly, don't take advantage of them. To have programs\nto educate folks of warning signs of problem or compulsive gambling and to do\nthings to prevent or treat the problem or compulsive gambling. To develop and\nfund responsible gaming education campaigns coupled with prevention and\neducational efforts within communities that raise the awareness of the\npotential signs or risk factors of problem or compulsive gambling.\nTo encourage the use of harm minimizing measures by better such as excluding yourself from\ngambling if you know you have a problem you can ask them the platform don't take any\nmore bets from me or limit the amount of bets that I can take.\nWe also ask for rules and regulations for betters to cool off self-limit or self-exclude\nthemselves from gaming activities.\nAnd we won't statewide advertising guidelines to ensure that the marketing of sports betting\nis not targeted at minors.\nAs I mentioned earlier, young people, particularly males, are very susceptible to compulsive gambling.\nAnd we don't want any marketing that has a special appeal to problem or compulsive\ngamblers.\nWe also, like most states have, you'll see the dial 1-800, whatever, I got a gambling\nproblem number, to make those type of helplines available and highly visible, and finally,\nto promulgate rules or regulations to limit the amount of bets a better can place if they\nhave exhibited signs of problem or compulsive gambling.\nIt is incredible what we can do with the technology these days, with the data that's accumulated,\ngathered on you, but if you are placing bets and they are now being tracked, it's easy\nfor the bet makers, the book makers that are taking your bets to know who's betting\nmore than they can afford to or more frequently, who's chasing their losses, who's making\na bunch of dumb bets and losing more money than they need to be, and shoot them a warning\nsign to tell them you're exhibiting signs of problems, but you might, we're going to\nto have to cut you off for a while.\nSo there's no whatever there is.\nI want that to be part of anything we do.\nI'd like it to be a constitutional amendment that\ndedicates some money to fund those programs.\nBut this is going to be required if you pass this enabling\nlegislation, whatever the terms of a final constitutional\namendment might be.\nIf I could figure a way to put that in here and require\nthose things to be funded, I would.\nAnd if anybody else has ideas, I'm\nperceptive to any kind of amendments that might do that.\nThere are prohibitions about any criminals, people with bad records, bad histories, and\nbeing in this business getting licensed or to take away their licenses in here.\nThere are pretty thorough regulations here in this bill.\nI don't know you guys don't want to hear 61 pages lined by line.\nIf you do let me know, I think I'll stop here, Mr. Chairman.\nYou're pretty good.\nTake any questions that there might be.\nWell, he was extremely thorough there.\nSenator Calder, any questions from the committee on this bill here?\nWhat number you got?\nThank you, Mr. Chairman.\nChairman, Calder, you are probably the most thorough and well-researched presenter.\nWe have the entire General Assembly, so thank you for your hard work.\nAs I refamiliarize myself with this bill because it's been some time since we did it.\nIf you could just help me, do we have anywhere we're actually defining net revenue as well\nas adjusted gross income and those might be standard accounting terms, I just want to\nmake sure that they're not being used to game the system.\nWe do let me flip my pages and I'll be able to point you to it.\nI can tell you what we basically do in figuring out your taxes so we take the amount of revenue\nreceived as bets, subtract from that federal taxes and the remainder is what's tax.\nWe are taxing gross revenue not net.\nSo if your question goes back to, are they able to subtract out marketing costs and\npre-bees and giveaways and comps to heavy gamblers and no?\nI can find that point if you give me one more second, it's under the...\nNo, that's fine.\nAnd I guess to even simplify it further, we would almost like to see it as whatever the\ncost of the bet is period to eliminate any confusion.\nI think it's a lot easier math for people to digest if the bet's going to be $10.\nFirst, the state is going to take X percent of it, and that's clean and easy, and it's\nup to an individual business to figure out their map on the scenes what makes their business\nrun.\nAgain, just in an effort to simplify, and I think that might be better.\nOf course, AGI is defined a little bit differently from standard accounting terms, and I see\nthat there's the difference between the two, and I understand you're logic.\nHowever, I think again, in the case of simplifying it, I think from the state's perspective,\nthat might be easier for people to understand.\nCan you help me on that?\nJohn Marie, do you have the site to the place?\nI saw it somewhere.\nWhere is it?\nHe wants to know what it is to sit.\nHe wants to know what it is.\nStarting old 95, right?\nYeah.\nPage five.\nJust the gross income means total of all monies actually paid to a licensee as bets minus\nfederal excess taxes and minus the total amount actually paid out to winning bettors over\na specified period of time.\nand that's what the tax has applied to that of gross,\njust a gross income.\nNot, I mean, that's our definition of it not.\nI know what your referencing accounting terms\nhow that can be, you know, net can be a lot lower for sure.\nSo I'll continue on another question if I can, Mr. Chairman.\nChairman, as far as the percentages are concerned,\nhow does that relate?\nI remember us looking, I think it was either day 39 or day 40\nwhen we had this on the floor.\nWe had a spreadsheet we were sharing around that had what other states had for percentages.\nDo you know at this time, because I'm sure some have come online since we looked at this\nlast of where that would rank us?\nAbove the median.\nAnd there are states significantly less that are 13%, there are some that are higher.\nMy thinking in setting this tax rate was, what do we get from the lottery?\nAnd the lottery is now generating a profit of somewhere between 25 and 27 percent.\nSo they have edged up over the years closer to the 35 percent we mandate.\nI didn't want this type of revenue to cannibalize lottery sales profits.\npeople that elected to put their betting money\non sports betting instead of lottery tickets\nis staking them make as much or less money.\nAnd so I was trying to get it at least as close\nas I could to the average that we receive\nessentially in tax money from the lottery.\nIt's close, it could be higher.\nBut like I said earlier, this is not as profitable\nas you might think for the bookmakers.\nif they were betting just straight bets, winner lose.\nPoint spread is seven.\nYou bet for Michigan, I bet for Washington or whatever.\nOne of us wins and wins the amount we bet it.\nSay we've both bet $100.\nYou bet $100, you win your 100.\nIt cost me 110.\nSo I had to bet 110.\nAnd so that 10 is their profit.\nBut they only made it off of me, not off of you.\nSo they're really only profiting 5%.\nYou can do your math on that if they're taking in, you know, $1 million in bets, they're\nmaking $50,000 and then we're taxing that at this 20 or 25 percent rate.\nThank you.\nAnd one final question if I could, this may be actually to your constitutional amendment.\nFor the dedicated funds, certainly, I think you've been so thoughtful in putting together\nor the dedicated dollars to those who might be directly\nimpact, who have a gambling problem,\nwho we need to make sure we don't cause more harm to sight.\nEven though in principle, I don't have a problem with it.\nI think the other part that I do have a concern with\nis we're constantly trying to pick different folks,\nto buy their support and their vote for any particular change.\nI personally would like you to maybe consider\nas you're going through this all going back\nto the hope scholarship, just like we have everything\ntoday, which funds the very successful hope in our pre-K programs, and I think that success\nhas been there in a time that we are having a bit of a childcare crisis, if you will.\nWe need more funding there than ever, so just something I would ask for your considerations\nbefore just to help simplify that as well.\nWell, I can answer that by telling you this, unless there is a constitutional amendment that\nspecifically dedicates funding, any tax proceeds from this enabling legislation will\ngo to the general fund and it's up to you and your colleagues on\nAppropriations Committee how to allocate how to appropriate that money which\nwould include if you wanted to hope scholarships you're not required to if\nif the lottery corporation exercises it right it's right to have one of\nthese licenses their proceeds will have to go to lottery in pre-K I mean to\nhope in pre-K but but you raise a great point that that's okay other states\nIt's envious for our Hope Scholarship Program where we have affordable, accessible college\neducation, everybody.\nSome of us over here believe we can make it better by having the needs-based component\nas well for those that still make good enough grades to get in college, but maybe not\nquite enough to qualify for the hope.\nBut it's up to the legislature and I have in each of the proposals I've dealt with over\nyears have been different negotiations to try to get a coalition of 38 boats, and I'm flexible.\nAnybody else have questions for the author?\nYeah, I got one.\nOne of your eight number eight.\nSo, would you still do the dedication to the sports hall of fame?\nYou bet.\nI.\nYou got my vote.\nWhatever you think.\nWhatever you think.\nWhatever you think.\nI'm sorry to get.\nThank you, Mr. Chairman.\nI was curious from the author.\nI know we see a lot of different legislation.\nYou always have usually some group.\nI was curious for the author.\nI know we see a lot of different legislation.\nYou always have usually some group\nthat's pushing legislation and the kind of things here.\nI was curious, who's pushing this particular style\nor format on the way that you've got this set up?\nBecause for me, other than that Senator Lucas said,\nbut I'm just looking at it from a standpoint of,\nstandpoint of you know we've had people pushing the horse racing and everything else and this is kind of a unique blend\nCan you expound on that a little bit for me? I'm glad to\nThis might be a unique product\nEssentially hand wrote this bill, you know not\nvirtually I'm good at plagiarizing I\nreviewed\nsports betting legislation of every state that had it, at least two years ago, and I picked and\nchose the parts that I thought made the most sense. It spent quite a lot of time with\nChoirmary there and legislative council's office walking through my\nconcept of what I thought worked. I\nHeard many many pitches from lots of different lobbyists representing lots of different gambling interest and\nand some of them persuaded me on parts of their ideas\nand some of my flatly rejected.\nI probably got two thirds of the room mad at me.\nThat's out here lobbying for that\nbecause they didn't get their way on certain things\nand I probably got another two thirds of them.\nThey're pretty happy with the outcome of this\nand think it maybe is a good blend,\nbut it's not model legislation from anywhere.\nanywhere and it is not something that was handed to me from one gambling interest\nor another that I edited off of. It's from a malgommation of many many bills\nfrom different countries, different states around the country as well as\ndifferent versions of gambling legislation that has been introduced in\nGeorgia over the last five years. I think I picked the best pieces but\nListen, I have been in this system for a long time.\nI have learned that our system is great.\nYou can always perfect something.\nMy feelings, I've got a real thick skin.\nIf you got a way to perfect it, have at it.\nEspecially if you can do more to bulk up problem gaming\nprotections.\nAnd if we get through the house, chairman Stevens,\nif you guys see some things that can make it better,\nbring it on, we'll see what works.\nI sat up one night literally a couple years ago tell about 230 in the morning and\nI was with my legal pad and pen was putting down the provisions that I wanted to\nmake sure we're in it the next morning I met with Sean Marie she'll remember\nthis I probably make sure you might have broken some room or something for all I\nknow but what do we call the new dining hall over there y'all got a name for it by\nL.O.B.\nWhat's it?\nNo, that Mullis is where you work it off.\nY'all know what I'm talking about.\nShe met me at a little table over there.\nBlereye, she, I think, had pulled it all night or two and I said, okay, here's what I'm\ntrying to do.\nCan you put this together with that together and then she said, you know, I just had stacks\nof papers and she put it together and made it work and this is much improved since that\nversion.\nAll right.\nThank you, Mr. Chairman.\nLet me reiterate before we talk about taking this off of the table, it without a\nThe CA, all these 62 pages, is a moot point, basically.\nWe're not going anywhere with it without a CA.\nSo we're going to move it off the table here.\nThe day we'll get the community to write\nand move it off the table, it'll go back to us,\nand he will have to work on a CA.\nAs Mr. Chairman, as Chairman mentioned, I have a CA\nthat I'm going to be presenting to the Senate Committee\nand Senator Bennett Beech has a CA.\nHe's going to be presenting to the Senate Committee\nin regards to a constitutional amendment to allow gaming\nor to remove the prohibition of gaming in Georgia.\nThat's where we are, and this will come into play\nif we can get those CAs across the table.\nSo, what is the pleasure of the board?\nI have a motion to do pass.\nI have a second on that motion.\nAll in favor, we're gonna have a show hanging.\nAll in favor of moving this legislation off the table?\nI thought you already did that.\nThe discussion usually happens after a motion.\nyou already been discussing. Go ahead. Thank you, Mr. Chairman. I just want to say I will vote\nto pass it forward, but I have asked our formally Senate research to get us a current analysis of\nall the states for all the states and what their current percentages as well as what they are\nbasing that percentage offer. That's right. Make sure that the terminologies there. So in\ndeference to the chairman for the great work that he has put into this, and I think it's very\nthorough but it is an answer that I do want to see before we vote on this and the\nfour. You want to kill it? I want to kill it. I vote against it. Let's go back over\nthis one more time. It's not sure if we get this thing right. We are voting\non Senate Substitute Bill 172 LC 365 642S one more time. What is the\nIt's a pleasure to board.\nHello, session.\nAll right.\nWhat are you to?\nThe motion is just to take it off.\nThe motion is to pass the bill to move it to.\nI thought it was a motion to take it off the table.\nWas it never on the table?\nIt was not on the table.\nIt's not on the table.\nIt's been on the table.\nSo the motion is to do pass, not take it off the table.\nMotion is to do pass.\nwithout a corresponding CA. Exactly. And I'll re-enter it again. Without a CA, the bill goes nowhere.\nChoice is choice. Any more discussion on this bill? You want to move to table this bill.\nWell, you don't have a CA, and for me, that's kind of like the one darts in the dark.\nI didn't make the motion, but I said I wouldn't make the motion.\nThat comment I have made the exact opposite argument many times that I didn't want to, you know, I thought to see it.\nI mean the enabling should be voted on first so the children to voters would know what it is\nthey're voting on when they they pass the CA and the same thing would be with us but they are\nmost definitely interrelated and that's why this does not become effective unless the CA passes.\nI agree they're interrelated which is why I think they should be looked at together.\nI've only been, this is only my sixth session, but I've never seen a CA presented without,\nI'm voted out without enabling legislation on this topic or another.\nI mean, there's a deal made here for funding for something, and I think without that bill\nbeing before us, I think it, I think it would be worthwhile for the committee to consider\nboth of us together.\nWe did a lot of, we did enabling legislation prior to, before we did the Constitution of\nthat man. Well, the judge did a lot of it.\nSenator Luke's, I was not here. I referred that to Senator\nCalzer. I'm open, not that old.\nHow was I here, sir?\nWe don't want to lose it.\nWe don't want to lose it. We don't want to lose it.\nYou\nAll the discussion, I think we can figure out, I'm going to call the question one more\ntime.\nThis is a motion to do pass.\nWhat is the pleasure of the board?\nYou're right, Madam Leader, Miss Leader, moved to do pass by Senator Lucas, now I have a second.\nNo.\nI'll second it.\nOK, so we have a motion in a second.\nAll those in favor of passing this bill raise your right hand.\nWell, one, two, three, four, five, six, seven, eight, eight.\nMotion has passed.\nAll those nose?\nI mean, you can put it out there.\nWe already know, right?\nBut you need to take the nose.\nOh, we'll count you.\nMinority leader?\nNo.\nSerred again?\nNice one.\nAll right.\nMotion passed I mean before y'all got you\nNo, I don't want it\nI don't want to do it. I've never voted on one of these read about this\nSo anyway\nAny more business come for the board\nAny more business come anybody got an announcement hold on I got one announcement before you adjourn to sir mr. Chairman\nWe are gonna have committee dinner\nat the 57th Fighter Group where we had last year is going to be on Tuesday, January 23rd\nwhen we get back from budgets.\nSo anybody interested in helping sponsor come see Cindy, everybody save that date on\nyour calendars, January 23rd.\nThank you.\nIf there's no more business coming forward aboard, we are adjourned.\n",
  "updated_at": "2026-02-12T19:46:16.489407+00:00"
}