{
  "video_id": "5u4P5d_I__c",
  "url": "https://youtu.be/5u4P5d_I__c?t=750",
  "title": "Georgia House - Day 21 (2026-02-21)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 21,
  "video_date": "2026-02-21",
  "duration_minutes": 154,
  "summary": "Overview:\nThe Georgia House session on February 21, 2026 featured a mix of bill introductions, procedural matters, and inspirational remarks from the guest chaplain, Reverend Timothy McDonnell III. The session focused on setting the stage for the legislative process rather than substantive bill actions.\n\nKey Actions:\nNo major bills were passed or referred during this session.\n\nBills Introduced (First Reading):\n- **HB 186**: (unknown)\n- **HB 221**: (unknown) \n- **HB 243**: (unknown)\n- **HB 280**: (unknown)\n- **HB 294**: (unknown)\n- **HB 369**: (unknown)\n- **HB242**: (unknown)\n- **HB80**: (unknown)\n\nNotable Moments:\nThe highlight was the inspirational remarks from Reverend McDonnell, who encouraged the legislators to \"do justice, love mercy, and walk humbly with your God\" in their work.\n\nVotes:\nNo recorded votes were taken.\n\nAttendance:\nA quorum was present, as indicated by the roll call vote at the start of the session.\n\nAdjournment:\nThe session adjourned after the chaplain's remarks. The next session date was not specified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you the the you leave Members will take your seats. The hour for convening having arrived. All members will please take their seats. Mr. Clerk will you please ring the bell. We're going to have the morning row call. All members present will please vote green to signify their presence in the chamber. And the clerk will unlock the machines. Oh, there he is. He figured out how it works. How long have you been here? Have all members voted? I think you have now. Have all members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. As is our custom, we will begin our day with Scripture reading. And prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 179th House District. Representative Rick Townsend. Thank you, Mr. Speaker. It's my honor to introduce Pastor Timothy McDonnell III. He's a Brunswick native. Husband, father, and pastor. Reverend Timothy McDonnell III is a founder of the African American Ministers Leadership Council. And the president of the African American Ministers and Action of People for the American Way. And the senior pastor of the first Iconian Baptist Church in Atlanta, Georgia. Where he has served since 1984, Reverend McDonnell III has taken first Iconian 35 members to approximately 1500 members. Reverend McDonnell has appeared on Oprah Winfrey Show, Good Morning America, the Bill of Raleigh Show, Nightline. The National Press Club is often quoted in USA Today, New York Times, Washington Post, LA Times, National Public Radio, and other national publications. Reverend McDonnell received a BA from Berry College in Rome, and holds a Master's at Divinity from Emory University, and completed some doctoral work as well. He is married to Miss Shirley Neil McDonnell, and their proud parents of three children, Nikisha, Timothy IV, and Ebony. I know Pastor Timothy by accident, really. I met a sister. It's a long time friend, Audrey Gibbons, and she called me up during a freshman caucus meeting, and said, hey, Rick, can you pick up a few books for me? Well, they're written by Dr. Bernice King, and therefore Martin Luther King event by Coleman Brunswick. I said, sure, I'll be glad to pick up a few books. Ten cases later, Pastor McDonnell III loaded the books in my car, and that's where I first met him, and realized he had a servant's heart, just like his sister did. He was part of the first integrated class at Brunswick High, and I believe the first black student council president as well at Brunswick High. He's in Ministers since the age of 16, grew up in 88 Brooklyn Homes, and that was the projects. We kind of talked about that. I went to Lithonia High School myself, and I didn't realize I was in Section 8 housing at the time. Nobody told me, you know, it was Section 8. And so we had a common bond there, and I think we all can live by this next quote, or next passage in the Bible, Psalm 3723. The steps of a good man are ordered by the Lord, handed a life in his way. He got us calling early, and we're a better place. Brunswick's a better place, Atlanta's a better place, and George's a better place, because of Pastor McDonnell's. And it's my honor to introduce him and welcome him to this Go Oniles Day at the Capitol. Thank you. Good morning. Mr. Speaker, thank you so much, and Representative Thompson, thank you, and to all of you elected officials, thank you, and to those in the Galleys. We're happy that you are joining this morning to participate in this democratic process. I'm very honored to be here, happy to be here. My father in the ministry served here for some 10 years. Some of you may have known the Reverend EC Tillman, a state representative. He licensed me when I was 16 years old, and ordained me, and I consider him my father in the ministry, and he considered me one of his sons. And so I'm honored to be here. I've been here before, even as a champion for the day. But today seems to be very special, because our state is one of the leading states in this country. And I believe that, even as an African-American, I believe that the state of Georgia is a good state. I've never worked in any other state but the state of Georgia, went to Barry College in Emory, and I'm a Georgia band. And I'm very proud of that, and very proud to be here this morning. I'm a Baptist preacher, and they told me five minutes. And then they say five-ish minutes. And so we'll see how the five-ishness goes this morning. But I try to be true to my time. And I want to thank you for your service, even before I began this morning. It takes a lot to offer yourselves to be an elected official in these times. And I appreciate all of you for offering yourself, because it takes a servant to offer themselves for these political positions. I want to draw out attention just for a few moments, Mr. Speaker, to Micah, the sixth chapter in the eighth verse. Micah, sixth and eighth. He has shown the old man what is good, and what is it that the Lord require of the... but to do justice, to love mercy, and to walk humbly with your God. It's one thing that man requires of us. It is something totally other. What God requires of us. And I know that as you sit here day after day, doing the legislative session, perhaps you have thought about what is that God requires of me. What is that... my spirit is calling me to do. And I think that's a good place to be. I've learned in my 47 years of pastoring that it is one thing to know about God, and it's another thing to know God. That is one of the fundamental principles of our faith. I know about Michael Jordan. I do. I know about him. But I don't know him. I know about Governor Kim. He's good governor in my opinion, but I don't know him. When I was in Sunday school, I learned a lot about God, but that didn't mean that I know God. Because when you know God, you conduct yourself in a different way. You think differently. You treat your neighbors differently. You look at the poor, the disenfranchised differently. You look at the person sitting next to you differently when you know God. Because what determines how we see other people is the lenses through which we view them. And it's one thing to say I know, and it's one thing to truly, truly know. The newly elected district attorney in Glen County, Keith Higgins, I spoke at the M.O. King commemorative service in Brunswick last month. And he gave me a medallion that said the Maka VI scripture. What is it that God requires of me to do justice, to love mercy, and to walk humbly with your God? It doesn't mean as an elected official into the gallows to be one who proclaims to be a person of faith, to do justice, to do is a verb. And it requires action. A lot of us, a lot of people think they don't get to hear them by talking. Some of us politicians and preachers and lawyers, we great talkers. And we take great pride in listening to ourselves talk. I know I do, I do, I confess it. But it says, do. What is that we do that makes a difference? What is it that we do towards justice? Not only for ourselves, or certain clans, or certain people, but for all of God's children. All of God's creation. Those that we agree with, those that we disagree with, those who were raised in public housing, and those who were raised in mansions. What is it that we do towards justice that makes us one? That's why I love reading the Bible. And I find the Bible, so number one bestseller in the world. People may not know that. The number one bestseller book in the world is the Holy Bible. To do justice, to not just talk about it, to legislate justice, and not just justice for a few, but justice for all. That requires a certain type of person, a certain type of human being, a certain man, a certain type of woman, to have a desire to do justice. So that when people look at you, when people converse with you, they look beyond you, and they see justice. They see the symbol of God. They see the mark of God, to do justice, to love mercy. Some of you may be aware that today is what we call in the Christian tradition. To this in fact Tuesday, and right now, Mardi Gras is going on in New Orleans. Both of my daughters are over there right now. Mardi Gras is the last day before Lynn, where you put to get all your sin and out. All your reveling out, all of your bad stuff out. You're sitting there and they're reveling and having a great time with the speaker, because tomorrow is Ash Wednesday. For 40 days you're supposed to be repentant. For 40 days you're supposed to be forgiving, more forgiving. To love mercy. To love, Mardi Gras have an association with mercy. It's not just to have some knowledge of mercy. But as elected officials, you will call to demonstrate mercy, which means you have to get outside of yourselves. To get outside of yourself, Dr. King said, we need leaders, not in love with themselves, not in love with money, but in love with justice, not in love with publicity, but in love with humanity. That's what you are called to do. That's what you are called to be as elected officials in the state. To love mercy. To epitomize mercy. To embody mercy. Lynn is a very important part of our church. For 40 days. I ask people to think of some things they can give up for 40 days. And then I ask them to think of things that they can take on for 40 days, like trying to be kind to vote. For 40 days, not cursing anybody out for 40 days. I know that's kind of impossible, you know, some of us. But what can I give up? But what can I take on? I'm going to be nice to the speaker of the House of Representatives for 40 days. Oh no. To love mercy. That's what we're called to do. To exemplify, to embody. And then to walk, umbly, without God. Pride counts before, before. To walk, umbly. To be a servant, you have to be humble, representative, Township. And I think you embodied that as well. That's how we met. Delivering books for little children, underprivileged children. 300 plus miles away. As a daughter of Dr. Marlotha King, Jr. To walk, umbly, without God, is one of the best traits that a person could exemplify. You mentioned President Carter. I met President Carter when I was at Ebeneers' about this church. As a full-time assistant pastor there, Daddy King still living as pastor emeritus. President Carter came to speak. Mrs. King had invited him to speak. I was in my, I was 24 years old, 25 years old when I met President Carter. You talked about a man. In my opinion, who exemplifies with this scripture, what he talks about. To love God, to love mercy, and to walk, umbly with your God. We keep President Carter, his wife and his family in our prayers. I want to be the best of me in 2023. That was my thing for the year, new years. I'm creating the best for me. I'm a pretty good guy. I am. I know this. Nobody has to tell me this. I'm a pretty good guy. But I know I can be better. I know I can be more loving. I know I can be more compassionate. I know that I can be more generous. I know that I could be more caring. So I want to create the best for me in 2023. Joshua 1 to 9 says, be strong and courageous. Do not be afraid or discourage.\n\nFor the Lord thy God will be with thee, whether so ever you go with. No need to be afraid. No need to be discouraged. Know that God is with you. Always, whether so ever you go with. What does the Lord require thee? But to do justice, to love mercy, and to walk humbly with your God, let us pray. O God, our Creator, the giver of all humanity, we thank you for this day, for these elected officials, these your servants, who offer themselves in service to humanity. We pray for a covering upon them in this session, that God you will impure them with courage inside, fortitude that will cause them to dream impossible dreams, and to fight unbeatable foes. Thank you for their willingness. Thank you for their courage. Now we ask this day that you will shower them with your blessings, that whatever they do might be pleasing in your sight. Thank you for our speaker, for all of the officers, for all of these elected officials. Bless God and keep them as they legislate on behalf of all Georgians is our prayer. We pray this prayer in faith and in the mighty name of Him, who says the perfect example of us for us, how to love one another, Jesus the Christ we pray. Amen. Join me in the pledge. I pledge allegiance to the flag of the United States of America, and to the republic of which is thanks, one nation on the God, indivisible, with liberty, justice for all. Thank you. Thank you, Mr. Speaker. Thank you, sir. And the pastor will come to you. Thank you, Pastor. That was a powerful, powerful devotion. Thank you so much. Doorkeepers will unlock the doors. Members may greet the pastor, the chaplain, in the south any room. Thank you. Thank you. Chair recognizes Chairman Tarvan, the chair of the Committee on Information and Audits. Mr. Speaker, your committee on information and audits has read the journals in the previous legislative day and found it to be correct. And just something else to think about, the only way to truly avoid criticism is do nothing, say nothing, or be nothing. Well, Chairman, that's very profound. And this body certainly will not avoid criticism, because they're doing a lot. And they are much appreciated. Thank you, Chairman Tarvan. Is there any objection to dispense with the reading of the journal, the chair here's none? The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair here's none, and the journal is confirmed. Mr. Clerk, will you please read the resolution establishing the order of business far of the day? Representative Strachan, 104th News following me establishes the order of business during the first part of the period unanimous consensus, introduction of bills and resolutions, first reading of reference of House bills and resolutions, second reading of bills and resolutions, first reading of reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business far of the day? Chair here's none, and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill 445, I'm resident of Mathy Act, 74th hatching of the home, 55th Smith, 70th, gunner of the 8th. All 33rd and others will be titled an act of men, chapter 26, the title 43, the official go to Georgia annotated relating to nurses. Pelt. House bill 446 by the Roads of Reaves, 99th Silcox, 53rd, Hilton of the 48th, Daniel of the 117th, per the 118th and others, will be titled an act of men, titled 16th, the official go to Georgia, annotated relating to crimes and offenses. You do share it non-subtle. House bill 447, I'm resident of advance, the 133rd columns, the 71st Mitchell, the 88th, Apollo 33rd, Williams and 112th and others, they'll be titled an act of men, title 40, the official go to Georgia, annotated relating to motor vehicles and traffic. Motor vehicles. House bill 448, bar relatives, Scofield, the 63rd, mentioned the 88th, Scott of the 76th Davis, the 87th, the 94th. Bill Bitton, an act of men, chapter 24, title 33, the official go to Georgia, annotated relating to insurance. Insurance. House bill 449 by the Roads of the 19th and 134th, Corb of the 174th, Rose of the 124th, Canon of the 172nd, Berk of the 169th. Bill Bitton, an act of men, article 1 of chapter 5, the title 48, the official go to Georgia, annotated relating to general provisions for advalor and taxation. Ways and means. House bill 450 by the Roads of the Gunner, the 8th Smith, the 18th, that's the 184th Berk, chair of the 176th, Reeves the 99th and others. Bill Bitton, an act of men, title 15, the official go to Georgia, annotated relating to courts and general. Judiciary non-civil. House bill 451 by the Roads of C ball, 34th, Kenner to the 101st, Hitching, Salmon 61st, Gaines to the 120th camp, the 135th and others. Bill Bitton, an act of men, title 45 with the official go to Georgia, annotated relating to public offices and employees. Public safety and homeland security. House bill 452 by the Roads of the Perk of the 169th, Chasper of the 11th, makes the 178th. Roads of the 124th, Knight of the 134th and others. Bill Bitton, an act of men, chapter 1 and title 2, the official go to Georgia, annotated relating to general provisions for adriculture. Agriculture and Consumma Affairs. House bill 453 by the Roads of Hilton to the 48th, Cooper to the 40th, Sharper to the 177th, Hawkins to the 27th, C ball, 34th and others. Bill Bitton, an act of men, title 31 of the official go to Georgia, annotated relating to health. Public and community health. House bill 454 by the Roads of the Blackmen to the 146th, Wilkinson to the 38th, Knight of the 134th. Bill Bitton, an act of men, title 48 of the official go to Georgia, annotated relating to revenue and taxation. Ways and means. House bill 455 by the Roads of the Hood to the 175th, Cooper to the 45th, Newton to the 127th, Silcox to the 53rd, Reese to the 140th. Bill Bitton, an act of men, chapter 1 and title 43, the official go to Georgia, annotated relating to general provisions, relative to professions and businesses. Health. House bill 456 by the Roads of the Gutter, the 8th, Lomston to the 12th, Scott, Gensel 14, Silcox to the 53rd, Collins to the 71st. Bill Bitton, an act of men, article 1 on chapter 32, a title 36 of the official go to Georgia, annotated relating to general provisions regarding municipal courts. You do, Sharper. House bill 457 by the Roads of the Baller to the 147th, or one of the 32nd, way to the 9th, Dubnic to the 29th, Cooper to the 174th and others. Bill Bitton, an act of men, part 6 of article 6 of chapter 2, a title 20, the official go to Georgia, annotated relating to employment under the Quality Basic Education Act. Education. House bill 458 by the Roads of the Perk, 169th, Cooper to the 174th, Williams on the 48th, and Roads of the 124th. Bill Bitton, an act of men, chapter 23, a title 2, the official go to Georgia, annotated relating to hemp farming. Agriculture and consumer affairs. House bill 459 by Roads of the 12th, Collins to the 71st, Gunnar to the 8th, Hitchens to the 161st, Skoggins to the 14th. Bill Bitton, an act of men, code section 15, 11, 702, with the official go to Georgia, annotated relating to children's fingerprints. Public safety and hung land security. House bill 460 by Roads of the Baller to the 23rd, Campbell, 135th, Reeves of the 9th and Silcox to the 53rd. Bill Bitton, an act of men, to chapter 11 of title 15, an official go to Georgia, annotated relating to juvenile code. Juvenile justice. House bill 462 by Roads of the Baller to the 23rd, Gunnar to the 8th, Perk, 176th, Oliver the 82nd, Campbell, 135th. Bill Bitton, an act of men, chapter 11, a title 15, an official go to Georgia, annotated relating to juvenile code. Juvenile justice. House bill 463 by Roads of the Baller to the 23rd, Saints to the 180th, Hitchens to the 61st. Bill Bitton, an act of men, code section 35, 3, 4, the official go to Georgia, annotated relating to powers and duties of the Bureau generally. Judiciary non-civil. House bill 465 by Roads of the Baller to the 33rd. Bill Bitton, an act of men, chapter 27, title 50, the official go to Georgia, annotated the Georgia Lottery for Education Act. Regulated industries. House bill 466 by Roads of the Baller to the 73rd, Gunnar to the 36th, Gunnar to the 172nd, Clark to the 100th. Bill Bitton, an act of men, chapter 24, a title 43, the official go to Georgia, annotated relating to massage and therapy practice. Interstate cooperation. House bill 467 by Roads of the TARVORN to the 2nd, Cameron to the 1st. Bill Bitton, an act of men, title 15, title 36, title 45, title 48. The official go to Georgia, annotated relating to courts and local governments. Governmental affairs. House bill 468 by Roads of the Baller to the 150th. Bill Bitton, an act of men, an act of men, a new charter for the City of Butler. Intergovernmental coordination. House bill 469 by Roads of the Baller to the 170th. Bill Bitton, an act of men, an act of men, an article 27 of chapter 2, the title 20, the official go to Georgia, annotated relating to loitering at or disrupting schools. Education. House bill 478 by Roads of the Cooper to the 45th. Parish to the 158th, Leather to the 123rd. Smith to the 18th, Reeves to the 99th. Bill Bitton, an act of men, chapter 12, the title 24, the official go to Georgia, annotated relating medical and other confidential information. Judiciary. House bill 471 by Roads of the Crow to the 118th. Poll of 33rd. Washburn 144th. Roberts to the 52nd. Reeves to the 99th and others. Bill Bitton, an act of men, title 10, the official go to Georgia, annotated relating to commerce and trade. Agriculture and consumer affairs. House bill 472 by Roads of the Crow, the 118th. Blackburn to the 146th. Hitchin, son of 61st. Loves to the 12th. Poll of 33rd and others. Bill Bitton, an act of men, chapter 2, the title 47, the official go to Georgia, annotated relating to employee retirement system of Georgia. Retirement. House bill 473 by Roads of the Deloge to the 167th. Bill Bitton, an act of men, part 2, Article 2, chapter 12, the title 16. The official go to Georgia, annotated relating to bingo. Regulated industries. House bill 474 by Roads of Daniel, 117th and Mathy Ack of the 74th. Bill Bitton, an act of divide a homestead exemption for Spalding County School District at Valoran taxes. Intergovernmental coordination. House bill 475 by Roads of the Smith, the 18th year to the 150th second friq, the 160th, Skoggins, the 14th, Farad of the 24th. Bill Bitton, an act of men, the official go to Georgia, annotated, so the revised, modernized and correct areas. Code revision. House bill 476 by Roads of the Beverly, the 143rd, bent out of the 94th fri, the 120th second. Bill Bitton, an act of men, go to section 487, 29.6, the official go to Georgia, annotated relating to tax credits. Ways and means. House bill 477 by Roads of the Deloge to the 123rd, P3, the 166th, Prince on 32nd and Jackson on 128. Bill Bitton, an act of men, article 3d, chapter 12. We'll title two of the official go to Georgia, annotated relating to soil amendments. Natural resources and environment. House bill 478 by Roads of the Polly, the 116th, Gilear, the 162nd, Crawford, the 84th, Park on the 107th, the Holcomb of the 81st. Bill Bitton, an act of men, go to section 16, 13, 30. Bill Bitton, an act of men, go to section 16, 13, 30. The official go to Georgia, annotated relating to purchase, possession, and manufacturing, and distribution. House bill 478 by Roads of the Deloge to the 123rd, P3, the 166th, the Holcomb of the 81st. Bill Bitton, an act of men, go to section 16, 13, 30. We've got several levels this Yeah. Did you do sharing non civil? House bill 479, my resident of Hutchinson 106, you'd lead the 141st scope field, the 63rd Crawford, or the 84th Paris, the 140 second, will be taught an act of men article on Chaparade, a title 19, the fish go to Georgia, and they were in general provisions regarding adoption. Did you do a sharey? House bill 484, my resident of the car to the 93rd, Beverly, a hundred forty-third Evans to the 57th, all over the 82nd black man in the 146th, will be taught an act of men chapter 3, a title 47, the fish go to Georgia, and they were leading the teachers retirement system in Georgia. Retirement. House bill 485, I was going to play into the 109th Gilly, the 160 second fry, the 120 second, Alexander the 66, hugely the 140 firsts and others, will be taught an act of men chapter 4, a title 34 that just go to Georgia, and they were leading the minimum wage law. Industry and labor, Mr. Clerk, if you'll just spend just for a moment. Mr. Clerk, receipt. House bill 484, by the way, the car to the 93rd, Beverly, a hundred forty-third Evans, the 57th, all over the 82nd black man in the 146th, and others, will be taught an act of men chapter 3, a title 47, the fish go to Georgia, a tentative, really, and the teachers retirement system in Georgia. Retirement. House bill 486, by the way, so Evans, the 8th Bentley, the 150th Evans, the 57th, the plumbing, the 125th, Mathis, the 49th, will be taught an act of men chapter 14, a title 10, the fish go to Georgia, and they were leading the cemetery and funeral services. Agriculture, I can sue my fair. House bill 487, my reps have Newton, the 127th, all of the 50th, Cooper, the 45th, and Camp of the 135th, will be taught an act of men, a title 2, chapter 5, a title 16, the fish go to Georgia, and they were leading the assault and battery and first related defenses. Judiciary non-subtle. House bill 488, by the way, is the 9th, the annual 117th hill, the 48th, Washburn, the 144th fry, the 120th second and others, will be taught an act of men chapter 7, a title 48, the fish go to Georgia, and they're related to income taxes. Ways and means. House 489, by the way, is the third, a Dunhu, the 31st, Clark of the 100th, hill, the 18th, the act of men, code 6, the 48th, 740, 0.26, the fish go to Georgia, and they're the Georgia entertainment industry, investment act. Ways and means. House bill 490, by the way, is the 50th, the 50th, the 50th, the 80th, the first, Roman, and the 97th and others, will be taught an act of men chapter 7, a title 48, the fish go to Georgia, and they're related to income taxes. Ways and means. House bill resolution 229, by the way, is the draper of the 90th. Resolution proposed to the amendment to the Constitution, so it's the revised provision relating to the filling of vacancies. Governmental affairs. House bill resolution 230, by the way, is the patch of the 150th, the resolution, on a life of deputy, Emory A. Rowland, indicating a roadness memory. Transportation. House resolution 231, by the way, is the house of 170th, Williams 168th, Hitchens 161st. Resolution recognized the West Bay Area Vietnam War Veterans, and dedicating a bridge and their memory. Transportation. House resolution 232, by the way, is the patch of the 106th, Cooper the 45th, Roman on the 97th, Beverly the 143rd, all the 50th and others. Resolution creating house study committee on evaluating, simplifying, and eliminating. Public and community health. Senate Bill 12, by Senator Albers, the 56th, Robertson 29th, Dugan the 30th, Paine the 54th, beats the 21st and others. The little bit tied on act to amend, title 16, in the official go to Georgia, Ancetta relating to crimes and offenses. Judiciary non-civil. Senate Bill 56 by Senator Huffstatt, letter the 52nd, Williams the 25th, Bill the title, an act to amend, chapter 5, title 48. The official go to Georgia, Ancetta relating to advaloring taxation. Retirement. Senate Bill 84 by Senator Huffstatt, letter the 52nd, S to the 6th, Karpatric the 32nd, Williams the 25th, Watson the 1st and others. The bill the title, an act to amend, chapter 5, title 10, the official go to Georgia, Ancetta, the Georgia uniform, uniform securities act of 2008. Banks and banking. Senate Bill 93 by Senator, an act to the 31st, Kennedy the 18th, Guts the 51st, Robertson the 29th, Brass the 28th and others. Bill the title, an act to amend, chapter 29, a title 50, the official go to Georgia, Ancetta relating information technology. Public safety and homeland security. Senate Bill 112 by Senator, an act to amend, a 30th, Robertson the 29th, Baine the 51st, Guts the 51st, Dekman the 4th and others. Bill the title, an act to amend, chapter 4, a title 20, the official go to Georgia, Ancetta relating vocational, technical and adult education. Higher education. That completes first readers. Second reading of bills and resolutions. You may want to move these conversations to the any room so you can really hear one another and solve some problems in this body. So if you don't mind, move some of the conversations to the any room. Second reading is a clerk will read. House Bill 416 by Ramps or Stilcogs to the 53rd, Cooper of the 45th, Steward of the 164th, Reese of the 140th, Hawkins of the 27th and others. Bill relating to practice of pharmacy, House Bill 417 by Ramps the 9th of the 134th, Cooper of the 45th, partner of the 5th, House of the 170th, hatchet of the 150th, a bill relating to insurance. House Bill 418 by Ramps of Smith of the 18th, Lever of the 123rd, Reeves of the 99th. A bill relating to wear and win sales under execution held and changed place to public sales by court order. House Bill 419 by Ramps of draper of the 90th, but now of the 77th all over for the 82nd, the new Louis of the 42nd, Scottfield of the 63rd, and others, a bill relating to primary elections. House Bill 420 by Ramps of Roberts of the 52nd, Fry of the 120th, Beverly of the 143rd, Mitchell of the 88th, a bill relating to landlord and tenant. House Bill 421 by Ramps and Roberts of the 52nd, Holland of the 54th, Tran of the 80th, Pantens of the 51st, a bill relating to general provisions, Relator to Cayman Fish. House Bill 422 by Ramps of Richard of the 176th, and corporate of the 174th, the bill to amend and act to create a board of elections and registration of wear county. House Bill 423 by Ramps and advance of the 133rd, Collins of the 71st, Hitchens of the 161st, Lumps of the 12th, Powell of the 133rd and others, a bill relating to general provisions, Relator to Dangers, Insurgentalities and Practices. House Bill 424 by Ramps and the fans of the 133rd, Crow of the 118th, Collins of the 174st, Hitchens of the 161st, Lumps of the 12th and others, a bill relating to general provisions regarding sheriffs. House Bill 425 by Ramps and Dull of the 19th Sains of the 180th, Mathis of the 149th, Collins of the 14th, Clemson of the 12th and others, a bill relating to petition for release from registration requirements. House Bill 426 by Ramps and Blackman of the 146th, Taylor of the 173rd, Jones of the 47th, Jasper's at the 11th, Ballinger of the 23rd, a bill relating to elections and primaries. House Bill 427 by Ramps and Kenner of the 101st, Chavins of the 25th, Hulcombe of the 81st, Carpenter of the 4th, Clark of the 108th and others, a bill relating to post-secondary education. House Bill 428 by Ramps and Fugley of the 111st, Buckner of the 137th, Alexander of the 66th, Fraser of the 126th, or now the 77th and others, a bill relating to medical assistance. House Bill 429 by Ramps and Smith of the 18th, Green of the 154th Jenkins of the 136th, Evans of the 57th, Mathis of the 149th, a bill relating to Georgia Comprehensive Solid Waste Management Act. House Bill 430 by Ramps and Smith of the 18th, Evans of the 57th, Green of the 154th Jenkins of the 136th, a bill relating to Solid Waste Management. House Bill 431 by Ramps and Kenner of the 85th, Carpenter of the 93rd, Hulcombe of the 81st, more of the 91st Taylor of the 92nd, others, a bill relating to county special purpose, local option sales tax. House Bill 432 by Ramps and Smith of the 63rd, Clark of the 108th, Beverly of the 143rd, Carpenter of the 93rd, Cannon of the 58th and others, a bill relating to definitions relative to fair housing, general provisions regarding education, general provisions regarding labor and industrial relations, and fair employment practices. House Bill 433 by Ramps and S. Kofield of the 63rd, Beverly of the 143rd, Scott of the 76th Davis of the 87th, the 94th, a bill relating to general provisions of the general assembly. House Bill 434 by Ramps and Hawkins of the 27th, Newton of the 127th, Dempts of the 13th, Dilloges of the 167th, a bill relating to Georgia Comprehensive Medical Board, House Bill 435 by Ramps and Smith of the 18th, Evans of the 57th, Green of the 154th Jenkins of the 136th, a bill relating to Solid Waste Management. House Bill 437 by Ramps and Hitchens of the 161st, thumbs of the 12th, fans of the 133rd, McCollum of the 138th, the bill relating to ensuring and dedemnification of public officers and employees. House Bill 438 by Ramps and Anderson of the 10th, Williams of the 112th, Parsons of the 44th, Frazier of the 126th, Gens of the 25th and others, a bill relating to general provisions regarding public utilities, public transportation. House Bill 439 by Ramps and House of the 170th, Minks of the 178th, Dickey of the 145th, Parkle of the 169th, a bill relating to farmers markets. House Bill 440 by Ramps and the standard of the 40th, Cooper of the 45th, Hawkins of the 22nd, Irwin of the 32nd, Bentley of the 150th, and others, a bill relating to Student Health and Elementary and Secondary Education. House Bill 441 by Ramps and Dempts of the 13th, Hawkins of the 27th, Hitchens of the 125th, Nildo of the 42nd, Mathes of the 149th, and others, a bill relating to Dental Hygienist and Dental Assistance. House Bill 442 by Ramps and Bucking of the 137th, a bill relating to disclosure into Semination of Criminal Records, the Private Persons and Businesses, House Bill 443 by Ramps and Warner of the 3rd, Dental of the 31st, Tarvon of the 2nd, Cameron of the 1st, New of the 64th and others, a bill relating to display historically significant documents, House Bill 444 by Ramps and the Freeways of the 99th Country of the 8th, Cell Cox of the 53rd, Evans of the 57th, Dental of the 40th, a bill relating to Liz Pendens, House Bill 461 by Ramps and Thomas of the 21st, Mom Tand of the 17th, Washroom of the 144th, Smith of the 138th, Crow of the 118th, a bill relating to General Provisions regarding a specific business and occupation taxes. House Bill 464 by Ramps and Blackwood of the 146th, Jones of the 47th, Williams of the 112th, Newton of the 127th, Crow of the 118th, and others, a bill relating to income taxes, House Bill 480 by Ramps and Franklin of the 160th, Rokaiser of the 157th, the plaintiff of the 109th Park of the 107th, Thomas of the 65th, and others, a bill relating to Workers' Compensation, House Bill 4801 by Ramps and Carson of the 46th, Thomas of the 21st, Kelly of the 16th, Taylor of the 173rd, Martin of the 49th, and others, a bill to amend the Public Retirement Systems and Investment Authority Law, House Bill 4802 by Ramps and Sains of the 180th, Blackwood of the 146, Williams of the 112th, a bill relating to income taxes, House Bill 483 by Ramps and Neil of the 79th, a bill relating to income taxes, House Resolution 207 by Ramps and Smith of the 18th, Resolution honoring the life of Mayor William Pete Bridges, and dedicating a road in his memory, House Resolution 208 by Ramps and the lever to the 123rd, Resolution honoring the life of Reverend Dr. Martin Luther King, Jr., and dedicating a road in his memory, House Resolution 209 by Ramps and Carson of the 46th, Lumsland of the 12th, Collins of the 75th, Sitchens of the 161th, Carter of the 93rd, and others, a Resolution creating the House Study Committee on Medical Crash Fatality Rates, House Resolution 210 by Ramps and Beverly of the 143rd, Park of the 107th, Evans of the 57th, Mitchell of the 88th, Benedict of the 94th, and others, Resolution proposing amendment to the Constitution and State of Georgia, so as authorized by the Georgia General Assembly to provide right general law for sports betting, paring mutual betting and casino gambling in the state, House Resolution 211 by Ramps and Smith of the 18th, Evans of the 57th, Green of the 154th, Jenkins of the 136th, Resolution creating the House Study Committee on Landfills, House Resolution 212 by Ramps and more of the 91st, a Resolution proposing amendment to the Constitution, so as to provide the members of the General Assembly elected in 2026 and thereafter, shall serve four-year terms of office, House Resolution 215 by Ramps and Jones of the 60th, Resolution recognizing women's golf day on the State of Georgia, House Resolution 216 by Ramps and Jones of the 60th, Resolution recognizing women veterans day. Senate Bill 6 by Senator Burns of the 23rd, a Bill to amend an act to authorizing the governing authority of the City of Pennsylvania to levy and excise tax, Senate Bill 47 by Senator House Stetler of the 52nd, curb Patrick of the 32nd. Thank you.\n\nThe 49th oracle of the 36th, each of the 21st and others are bill relating to general offenses against public health and morals. Senate Bill 59 by Senator Hatchett of the 50th Kennedy of the 18th, the Hodges of the 3rd, Goodman of the 8th, Robertson of the 29th and others are bill relating to the governor House Senate Bill 68 by Senator Williams of the 25th, Albers of the 56th, Anderson of the 24th, Burns of the 23rd, and in the Barclay of the 31st and others, the bill relating to definitions regarding racketeer and influence and corrupt organizations. Senate Bill 73 by Senator Tellerie of the 19th, Brass of the 28th, Hatchett of the 50th, Duggan of the 30th, Moore of the 53rd, and others, a bill relating to general provisions relative to telephone service. Senate Bill 130 by Senator Payne of the 54th, Moore of the 53rd, Huffset of the 52nd, a bill to amend and act in solidating and mending and codifying various acts incorporating the city of Dalton through second readers. Members, if you will, come into order, take seats, and do your best to cease conversation. Well, this morning we have a number of special treats and there will be introduced more appropriately in the gallery, but we are welcoming a former member of this House, Chairman Jason Shaw, Chairman Shaw. And a company in Chairman Shaw today is his lovely wife Katie, and his son Slayton, who will be better introduced in just a moment. Good to have you all as well. We have a number of morning orders today, so so everyone can have their time and we can move on. In the proper order, we're going to ask that the presenters hold it to one minute. First morning order is Chairman LeHood, Corbett, Birchett, and Ripley Sharper for a morning order. You are recognized for a morning order, Chairman LeHood. Chairman LeHood. Thank you, Mr. Speaker and members. We just wanted to recognize the Lounge County delegation wanted to recognize Viowood Schools 4-3 class here today. You just heard former representative Jason Shaw's son Slayton is a part of this class and we're just so glad you've come today to learn about the three branches of government and to see it in action. So, class, if you'd wave to us down here, we just want to welcome you and appreciate you being here. Thank you. Welcome young people. Chairman Carpenter. Chairman Carpenter has recognized for a morning order, Chairman Carpenter. Thank you, Speaker. We have a... Chairman Carpenter. Are you accompanying? Yep, I've got two guys with me here. The ball headed caucus. Oh. Come on in here. You're looking good. There's a big shout out to Dalton Witt, leadership Dalton Witt feels here today if you guys are able to show that you are in attendance. Thanks for coming. Appreciate what you do, Philis and the Chamber of Commerce. Really good groups all of them this morning. Welcome to the People's House. Glad to have you all. Chairman Corbett, recognized for a morning order. The chairman Stevens will be joining him. This is from one side of the state to the other. Thank you, Mr. Speaker. We do have a special group here with us today. They're down in room 230, it's decoding dyslexia. Today we introduced House Resolution 101, claiming February 21st is dyslexia day at the Capitol. Everybody, especially to the new members, if you take just a few minutes, get to meet somebody's young kids. They're great. Just listen to their story, excellent students, but they have a great story to tell and we need to continue our work on dyslexia. And if you all will stand, it's Miss Enberg. Is she up there today? If not, we all weigh that. It's y'all stand, it's thank y'all. Thank you, Mr. Chairman and welcome ladies. Representative Townsend's recognized for a morning order. Thank you, Mr. Speaker. I've got a couple joining me. Hopefully, good one a minute piece. So I just want to recognize the Brunswick-Gillen-House Chamber on Brunswick-Gillen-House Chamber Day here at the Capitol. We don't forget today at 5.30, we're having a low-country boil, the reception first. So we want to make sure you come again at 5.30 this afternoon. We also did a resolution that you'll hear in a few minutes recognizing the Chamber for their tourism, economic development, and also the importance to the the the the the the nature beauty that we have on the coast. Also joining our Chamber today, we have a special group of the Goen-House College of Curricutamies, the Goen-House FFA. I want to thank Dylan Dixon, Ethan Stalvy, Amy Stalvy, and Mr. Austin for being here today. And of course, the Chamber of Rouse Staff and Cedric King, Sam Thompson, Donna Davis, and President Lonnie Ropfen, Coastal Pines. Y'all please stand up. Goen-House, please stand up. Let's give them a round of applause. Goen-House Day at the Capitol. 5.30 at the Depot. Thank you. Good day. You said there's some wild Georgia shrimp going to be served there? All right, sounds good. Thank you, Chairman DeLouch and Cene's as well. Chairman Dickie has recognized for a morning order. And welcome, Golden-House. Glad to have y'all with us. Thank you, Mr. Speaker. I know many of you here have FFA chapters in your district. And today is FFA Day. And thank you, Mr. Speaker, for coming down to the depot this morning and speaking to our FFA members from across the state. It's one of the largest state FFA memberships in the country with 77,000 members and 380 local chapters. And we talk about workforce development in this state. And this program ag education is so important for the career and future of our young people. And it's a wonderful program. And I know I got many in the gallery that if they want to stand, they're walking around the Capitol visiting many of you. And I just thank you for your support of FFA Ag education, not only in high school, middle school. And as of last year, a permanent curriculum program in our elementary school. So it's a great success and great group of young people that are being prepared for future generations to come. And we got a former state FFA president here standing with me, Stephen Meeks. Chairman Meeks? Chairman? Former state president and just a few years ago. And you see where it got him. So thank you and thank you FFA members across our state. This chairman approves, in fact, his stranger than fiction sometimes. Welcome to the blue and gold. We're glad to have FFA here. You're out of great crowd at Deepo this morning. Thank you. River Cynthia Matahan is recognized for a morning order. And a group of friends. Thank you, Mr. Speaker. Members of the House, I would like to take a moment to recognize some great friends that are joining us in the gallery this morning. Leadership Piled in 33 is a civic organization based out of the Piledin County Chamber of Commerce. And over the years, these groups have taken on a multitude of civic relief projects, filling the gap for the needs of the community that would otherwise not be filled. They do these projects all the while building themselves as leaders in Piledin County. And we thank them for their service. If y'all will please help me welcome this group of leaders to the people's house. Welcome. Woo. I just stand there. Y'all please stand. Thank you, Mr. Speaker. Good morning. Good to have y'all. Appreciate you being here. Representative Sheila Jones. Sheila Jones is recognized for a morning order. Representative Jones. You waive? We'll get you later then. Representative Rhonda Taylor and the Rockdale delegation. Rockdale delegation. Representative Taylor. Good morning. Thank you, Mr. Speaker. They're coming up just a while ago. Good morning, colleagues. I just want to ask that you help us welcome the leadership Rockdale team in the house. They're here today with us. They were coming up the elevator a second ago. If you're in the house leadership rockdale, please stand. They're not in here. Thank you, Mr. Speaker. I'm following you anyway. Oh. I'm following you. I'm following you. I'm following you. I'm following you. Thank you. I'll recognize them when they show up. Thank you. I yield the web. I know they're on the way. We're representing Hornor. Recognize for a morning order. Thank you, Mr. Speaker. This is the first time to the well. So it's a very important moment. I want to welcome my local FFH chapter from all the way from Coutusa County. They drove a long way. So I expect a big welcome from Lakeview High School. Thank you. Thank you. You did yourself proud there, Representative Hornor. You're first time in the well and welcome to Coutusa County, FFA. Wip Berset. Do you have a morning order? Oh, yes, you have a morning order. Wip Berset's recognized. Thank you, Mr. Speaker. I'd like to recognize our about, also high school FFA, both their coordinators, Donnie Warren, Jesse Bullin, Victoria Solomon, Jared Wayne, and then the president, Bo Hicks, and Trezzler Frank Soriano. If you guys stand and be recognized from Baudosta High School. Thank you, Mr. Speaker. Chairman Wilkinson, excuse me, Chairman Wilkinson recognized for a morning order. Thank you, Mr. Speaker. Walton County, George, has got a very long and proud tradition of agriculture. Today we have some future farmers from Carver Middle School. They are few. They're proud and they are female. If your delegation will stand up there, welcome, welcome, Brianna and Kayla and their advisors. Thank you for coming, young ladies. That completes our morning orders, but we're going to have, if you're going to be carrying up and left into, introduce our doctor of the day who was on the way and got held up with some important business downstairs. So we'll make sure that our doctor is recognized appropriately when they're able to give it. Representative Lepton, you'll come up and tell us about our doctor of the day. Thank you so much, Mr. Speaker. Colleagues, I wish to represent and present to you, Dr. Richard Kaufman, our doctor of the day. Dr. Richard Kaufman was raised and educated in the Amish Mennonite tradition. Police has been just remote. Members, we need your attention. Members, this is important. These physicians give their time to come down to me with us and take care of us, unless properly listen to their public service and your credentials, if you will. Representative Lepton, please receive. Thank you, Mr. Speaker. Dr. Richard Kaufman was raised and educated in the Amish Mennonite tradition, spending his younger years on an Amish farm in Montezuma, Georgia. He was an Amish dairy farmer until the age of 26, and his education up to that point was strictly parochial through the eighth grade. He did not receive any further formal education until 1970. Dr. Kaufman then went on to obtain his undergraduate degree at Berry College, graduating Magna Cum Laude, and then received his MD from the Medical College of Georgia in 1976. He is a member of Alpha Chi of the National College Honor Society, as well as Alpha Omega Alpha within the Honor Medical Society. Dr. Kaufman speaks three languages, English, German, and Spanish. This has greatly helped him on his travels around the world, engaging in mission trips with the United Methodist Church and giving his time to volunteer with Haitian earthquake relief in 2010. Dr. Kaufman is currently an associate professor of medicine at Mercer University, works at North Atlanta Primary Care, and is a member of the AIDS Research Consortium of Atlanta. We thank Dr. Kaufman for all of his work over the years in many areas all over the globe, including South Africa, Vietnam, Cambodia, Malawi, and of course the great state of Georgia. Thank you, Dr. Richard Kaufman. Thank you, Representative Lepton Boy. Dr. Kaufman is pretty qualified. I'm surprised he has time to come mess around with us. Goodness, he's a busy man. And we certainly appreciate Dr. Kaufman. Hopefully he'll be able to join us so we can recognize him, but if not, I encourage you all to stop by and just say hello and thank him for his service to us. That completes morning orders. We're ready to move on to the rules calendar. Ready to move to the rules calendar. You ready, Mr. Clerk? Ask the clerk to read the caption to HB242-242. Hospital 242 by Reps and Epochins, 161st and others to be titled an act to amend Article 10 of Chapter 21, a title 15 of the Fish Go to Georgia Antietta, really, and the Georgia Drivers Education Commission. So it's a provide for additional penalty for violation of traffic laws or ordinances under John Sweslaw. This bill haven't referred to the Committee on Motor Vehicle. Second committee recommends that this bill do pass. Thank you, Mr. Clerk. Chair recognizes Chairman Hitchens to present the bill. Thank you very much, Mr. Chairman. This is a bill that I had last year and it went all the way through the House, through the Senate. And actually was the number two bill on the agenda when the Lieutenant Governor decided to give his go on the way speech, so it didn't make it. So I'm running it again this year. It's a driver training bill. It I'm doing on behalf of the Governor's Office of Highway Safety. And in 2005 Senate bill 205, known as Joshua Law, created a search ards on all traffic citations in Georgia. Originally 5%, during the recession it was reduced to 1.5%. The assessment of the fee sunset on June 30th, 2022, which was last June. When the bill to increase the fee to 3% and to remove the sunset failed to be bought to descend at floor on sunny die. House bill 242 reestablishes the search ards collection on traffic violations at 3% and will collect an estimated 5.3 million annually resulting in 10,000 drivers education grant scholarships awarded annually. Scholarships are currently awarded on a tiered priority system. First priority is given to grant scholarship applicants who are a child or dependent of a public safety professional disabled or killed in line of duty. Dependents and children of members of the United States military, killed in line of duty. And as a result of this bill last year, we incorporated into the rules and the Governor's Office of Highway Safety that foster children in the custody of the state of Georgia through defects will also get first priority. Second priority is given to scholarship applicants who can demonstrate a need based on family income. Financial need, eligibility is currently based on 175% of the free and reduced price school meal eligibility. Currently, including each month the program runs out of money and denies student scholarship applications because the man for the scholarship is so high. If more grant scholarship applications are submitted and grant scholarships are available in each priority level, grant scholarships are awarded using a computer generated random selection method from the priority level applications. Grant scholarships are evenly divided among Georgia's congressional districts to ensure that all Jordans are considered despite geographical location. Rejected applicants are automatically reconsidered for the next two cycles. Program is open to public high school technical colleges, universities and other state-owned driver education programs and privately owned commercial for profit driving schools and nonprofit organizations and private schools. Program awards driver education grant scholarships to students ages 15 to 17 years old who seek to complete a 36 hour 30 hours of classroom instruction and six hours behind the wheel of the vehicle. With an approved driver's education program a recent evaluation of the scholarship program showed that students who received scholarships were in significantly fewer crashes had higher road skills and higher test scores. They also have fewer convictions, fewer crashes and fewer serious injuries and fatalities from precedents students did not complete the 36 hour course. In calendar year 2022 there were 1,792 fatalities on Georgia highways. That's the second highest number of traffic fatalities recorded since 1974 behind the 2021 high of 1,818. Only four states in the country are ahead of us in traffic fatalities. That's California 3. California, Texas and Florida all who have double the population that we have in the state. So we very obviously have some some difficult drivers. The annual collection of the driver training fund is steadily clients since fiscal year 2017 as fewer citations are issued throughout the state. There's less law enforcement presence in the state and there are a lot of diversion programs. I'd be happy to take any questions if there aren't any. I'd appreciate your favorable consideration. Gentlemen, you have a couple of questions. How you representing Williams to your left is recognized for a question. Gentlemen, you look like you wouldn't go yield. But I didn't know it was going to be you. Is it not true? This is a very good bill and I support this bill. It is it not further true that you explain so much of it. I'm confused now. And thirdly, says this is your second year bringing it and three years of charm will see you next year. I hope not. Well, I won't say I hope not either, but I'm going to see the chair recognizes. Representative Kenner for a question to your left, Mr. Chairman. Mr. Chairman, you'll. I am. Isn't it true that I have that must respect for the author of this bill and the intention. However, I voted no in committee because I was concerned about the unintentional consequences and disparate impact financial impact on the poor because of the increase. And the fact that the broader poor community does not have access to the scholarship because it's not needs based. Because it's what not needs based. It is need based. The first the first year at need base, but the second year is need based. There's a third tier for all others, but the applications of exceated ability to fund them and it's never gone to the third tier. So everybody that gets it is either the child or somebody's been killed in the line of duty of foster child or somebody that has financial need. Would you yield for one more question? Isn't it true that I'm going to vote yes for this hopeful that the Senate will perfect it even further? Well, I certainly hope it passes. I that's a green vote, Mr. Chairman, I'd take it. Yeah, yeah. I don't know about the Senate though. Well, there's that part. Chair Lady Dimps, he's recognized for a question of your yield. Does the gentleman yield? Thank you so much. Mr. Chairman, I want to thank you so much for bringing this again. I know it's really hard when we get measures through here and they almost get out of the other chamber and don't. But I want to make sure that you and everyone in this chamber knows that Josh was mother is a friend of mine. Right. She lives in Rome. She's a great mom. Her heart was broken at the loss of her son and what this does to carry on and help with the healing and help prevent those outcomes is so very important. Thank you. And I appreciate that thought. I've never talked to the mother, but I've talked to the father previously of Joshua and he has the same same feelings about it. Chairman, you have one more. One more. We have some Jasmine Clark from the one hundredth and eighth to your left. Thank you, Mr. Speaker. Does the gentleman yield? Is it not true that prior to this lapsing because the Senate failed to vote on it? The fee was actually one and a half percent. It was. It was to bill last year tried up to three percent because of the demand. Does the gentleman further you? Are you just to clarify this is just a one time fee that will be tacked on to violations. Track any traffic violation. Well, my perspective is that those people who disobey the traffic laws make a dangerous for everybody paid to train those or future drivers so that they'll do better. Thank you. I yield the well, Mr. Speaker. Appreciate your favorable situation. The gentleman has yielded the well and we have no one who's speaking to the bill. So is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agree to the report of the committee which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor, the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose does Chairman Prince rise? Make a motion. I move that house rule except House rule 133 and be excused from this vote. So recognized and so done. Representative Mottehan, do you have a preliminary inquiry? Just pursuing a House rule 133 and I have to be excused from the vote. We can accommodate as well both of your excuse from the vote. If all members have all members now voted, all members voted. So the clerk will lock the machines. On the passage of the bill, the yeas were 161, the nays 9. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, if you'll read the caption to HB 243. 243. House bill 243, by the way, Smith, the 70th and others to be titled an act to amend Code Section 161562, the official go to Georgia, annotated, relaying the number of judges and the spirit courts. So as we provide for an eighth judge of the spirit courts of the Queeda Judicial Circuit, the spill have referred to the committee on judiciary. And that committee recommends the disbilled due pass by committee substitute. Chairman Lin Smith is recognized to present the bill. Thank you, Mr. Speaker and members of the House. This bill is very similar to a bill that's already passed the General Assembly this year. It was House Bill 77, which is a Darty County Judicial Circuit. So to draw a comparison for Yawa, you consider this bill, think of me as Gerald Green's for Donald Twinn. So this bill emphasizes the need for another Superior Court judge, the eighth judge, for the Queeda Circuit. This judge is needed to help, as most of these cases, to deal with a serious case load in my circuit. It has passed all the budgetary considerations that has the support of the community. It passed out of the committee unanimously and I ask for your favorable support. Thank you, Mr. Speaker. Lady has no questions. Thank you, Mr. Speaker. Are you the well? Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 172, the nays 0. The bill, having received a requisite constitutional majority, is therefore passed. Mr. Clerk, if you will read the caption to HB80. House Bill 80, by representative Leber, to the 123rd to be entitled to enact a amend, Article 1 of Chapter 14 and Title 24 of the Efficient Coated George Anitenter relating to general provisions regarding proof generally. So is the enact the Uniform Unspawn Declarations Act. Just to elaborate for the committee. I'm judiciary. That committee recommends this bill do pass by committee substitute. Representative Leber is recognized to present the bill. Representative Leber, thank you, Mr. Speaker, ladies and gentlemen, the House. I'm pleased to present you today House Bill 80. This is part of the continuing initiative that we've undertaken as a general assembly to assist with making Atlanta and Georgia a Center for International Arbitration. You may remember last year we passed the Uniform Mediation Act, which takes great strides toward that goal. This is sort of continuing that same move. It basically, it's got a very limited impact though, but in doing so, it's very important. It authorizes a court to consider a written statement that has not been signed before a notary. Apparently in pre-trial proceedings, that is before the trial, matters have to be considered by the court and the court rules on motions and things of that nature.\n\nthat needs to consider written testimony it does so by affidavit. That's a signed written statement that's signed in the presence of an odory. Most of the time, that's not that difficult or logistical step, but if you're overseas, that can be extremely difficult because you've got to go before a consular vice consul to get him or her to sign in the place of an odory. And that requires an appointment. It may take a lot of travel. And oftentimes, the appointments are months out. And not only are they months out, when you show up, the consul doesn't completely control their own schedule. That's controlled more by international events. And so you may miss your, not be able to attend. The consul might not be able to make the appointments. You have to then come back three months later. So it can be a very, very difficult process and during that whole process, the case is delayed, the disposition and the final judgment is delayed. So this would allow another option. It allows somebody who was out of the country to sign a written statement that while it doesn't have to be signed in the presence of a odory, would have to be signed under penalty of purgery. And the document has to be in a certain form where there's a notice above the signature saying that you're signing it under penalty of purgery. That's basically the same end result as signing in the presence of a odory. It's under penalty of purgery. And if you're lying, you can be prosecuted for purgery. So we simply add that as an option for civil cases and arbitrations when there is a witness who is out of country and needs to submit written testimony to the court. So it's fairly limited in its application. And this is not something new. It is new to Georgia, but it's not new. Federal courts have allowed this for about 50 years and somewhere between 20 and 30 states allow this in some form or the other. Some even allow you to submit a written declaration if you are located in the US or in state. We're not going that quite that far. It has to be a statement where you're signing when you're outside the United States, but it would greatly assist the progress of these cases, would reduce costs. It's a simplifying a logistical step to achieve the same end. And it will help, especially in these international cases, where we have businesses overseas or witnesses overseas and they can submit written testimony in that way. So the bill is supported and was actually initiated by the Atlanta International Arbitration Society. It's supported by the Board of Governors of the State Bar of Georgia, and it will help us not only in terms of making sure that arbitrations and cases can be disposed of more efficiently and quicker. It will reduce the costs for the parties involved. So I would request that you please do vote in favor of this legislation, and I will yield the well for any questions. Gentlemen, you yield for a question. I yield. To your left, Representative Clark has a question. Thank you, Mr. Speaker. Does gentlemen yield? I yield. So what type of cases are we talking about here? Are we talking about criminal cases? Are we talking about civil cases? Both. As we say in the game show business, I'm glad you asked that question. It would not apply to criminal cases at all. We initially as filed it would have, but we subsequently revised the bill to exclude criminal cases. It only applies to civil cases, civil administrative proceedings before some government agency, or an arbitration. Does the gentleman my further yield? I yield. So it says that it will be under the penalty of perjury, but if the person is overseas or in another country, how exactly would that penalty be enforced if they're not in the United States? Well, there could be enforcement through the auspices of the court in that initial proceeding. It could exclude the testimony or it could penalize the party that offered the testimony. And at some point, they might need to come to Georgia and then they would be subject to jurisdiction of the criminal law. Thank you. Thank you for your question. Gentlemen, you have one more. I yield. Representative Thomas to your right. Oh, can I, can I rescind my yield, Mr. Speaker? To late now. Thank you, Mr. Speaker. Just, is it not true that I actually enjoyed your speech is a lot better when you put Yogi Bear quotes in the front? I'm sure it is. That always does spice it up. Actually, I want to say, I think this is a good bill and I appreciate you bringing it. Thank you. I appreciate that question, Representative Thomas. Thank you. Gentlemen, has no further questions. Thank you, Mr. Speaker. I would ask your favor of consideration of House Bill Aiden. I yield the well. Is there any objection to the previous question being ordered? Is there any objection to adopting the committee substitute? Excuse me, the chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Child, this bill now passed. All those in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. All the yeas were 174, the nays 0. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to HB 186? House Bill 186 represent a lover of the 123rd and others to be titled an act to amend Title V of the Fish Go to George Annotated, relating to appeal and error. So as to revise an exception applicable to the filing petitions for review in reviewing courts from lower judicatories. This bill have been referred to the committee on judiciary. That committee recommends that this bill do pass. I hope you won't disappoint. You'll have some quotes this time. The gentleman has recognized to present the bill. Representative Leveritt. Thank you, Mr. Speaker. Yes. As Yogi Berra once said, I know having me come back up or seems like deja vu all over again. But I have another bill that just happened to make it on the calendar day. House Bill 186 amends the state and superior court of public practice act. This body passed it almost unanimous in last year and it actually was signed by the governor. As you recall, it made a very significant change in the way you can appeal a decision of a lower court to a state or superior court. There was a very old archaic process called petition for search or rory that we eliminated in that context and replaced with a thing called a petition for review, which is much is clearly set out in statute. We try to answer all the questions that sometimes arise in those kinds of appeals and try to provide a more uniform simple process so that cases could get hurt on the merits, which is sort of the goal, I think, of our system of justice. Because it was such a significant change, it was a judicial council bill that had been working on for about four or five years. We made the effective date this July instead of last July. In case we missed a few things and we missed a few things. There were some cross references and other parts of the code to petition for search that we had to change to petition for review. There was one other section where we had referred to some exceptions to some of the standards of review and we only referred to one of them and we came back and just made it a little broader statement to make it clear that we're not trying to change a standard review. We're just trying to change the process by which you invoke that review. So it's it is literally a very simple bill and it just simply fixes some cross references that we didn't catch the first time around. So I'll yield for any questions, Mr. Speaker. It's not a simple bill, but you did a good job. So you have no questions. Thank you, Mr. Speaker, ladies and gentlemen. I appreciate your favor of support and I'll yield the well. Thank you. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 173, the nays 0. The bill having received the requisite constitutional majority is thereby passed. Mr. Clerk, if you read the caption to HB 221, HB 221. Hospital 221 by the way, Mr. Lumpson of the 12th and others to be entitled back to amend code section 33921 of the fish go to George annotated relating to maintenance and filing rates, writing plans, rating systems or unwriting rules and examination of claims. Mr. Lumpson, this bill will refer to the committee on insurance. That committee recommends that this bill do pass by committee substitute. Chair, Mr. Lumpson is recognized to present the bill. Mr. Speaker, members of the House, I bring to you House Bill 221. This is a department bill that comes as a request from the insurance commissioner. It deals with rate filings for automobile insurance. This bill keeps the current filing use modeled in place for the state mandated minimum filings and adds a 60 day waiting period for all other filings. This is a compromised bill that all affected parties have agreed to. It provides adequate time for the department to review the filings and provides a guarantee of speed to market for the insurers. Mr. Chairman, that speaker, that's the bill. I would appreciate your favourable support. Mr. Chairman, you will for a question. I will. You will for a question. I would represent you, Bayes Moore, from the 60 nights you are left. How's the question? Thank you, Mr. Speaker. Good morning, Mr. Chair. It's not true that I've had a similar bill for a couple of years and I appreciate you bringing this bill and I support it. It was similar to how I did address this attack in a slightly different way, but I appreciate your concern for this. Thank you. Appreciate you all working together. I see no further questions, Mr. Chairman. Thank you, Mr. Speaker. Man, I'll yield the will. Is there any objection to the previous question being ordered? The chair here is done. The previous question is ordered. Is there any objection to adopting the committee substitute? Chair here is done. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is done. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? The clerk will lock the machine on the passage of the bill. The yeas were 169. The nays 2. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 279. 279. House Bill 279, my brothers and gentlemen, the 15th and others to be entitled to amend chapter 32, entitled 33. The fish go to Georgia annotated relating to property insurance. Those to provide for an insurance premium discount or rate reduction for property owners who build a new residential or commercial property. This bill has been offered the committee on insurance that committee recommends the dis bill do pass. Representative Gamble is recognized to present the bill. Thank you, Mr. Speaker. Members of the House are rise today on House Bill 279. You may be familiar with this bill. It's the same bill that we passed last year. 174-0 and it made it all the way over to the Senate. Unfortunately, we ran out of time on sunny day. But basically, what House Bill 279 does is that it promotes an insurance industry program called fortified, encouraging people to build more resilient structures. It is a voluntary and will remain that way under House Bill 279. It's a voluntary program. This is for people who do build to a fortified standard and have their structures certified as such. It would require insurance companies to offer a reduction on adjustment or a credit of some kind that they determine on their own. The insurance companies get to decide that incentive and again, that's completely determined by them. Consumers can shop around for better rates if they are not satisfied with the reductions in premiums. But it will help to bring insurance companies back into markets that are riskier. So if you live in an area that's more susceptible to tornadoes or to hurricanes, it could potentially help to bring insurance companies back into those areas. The insurance companies support this legislation. The insurance commissioners good with this bill. And again, this is a unique concept that we're starting to see where homeowners or those individuals building commercial properties can build to this fortified standard. And we're hoping to encourage more people to do that. So Mr. Speaker, that's the bill and I'm happy to yield for questions. The gentleman has a question if you're yield. I yield. Refined to clerk to your left has a question. Thank you Mr. Speaker. Does the gentleman yield? I yield, yes. So a lot of times when they are discounting one person, they make up the difference by charging another person a little bit more. Is there any protections for those who don't have the funds to retrofit or fortify their places where they live? Are there any protections from them bearing the brunt of the discounts offered to those who do? I appreciate your question and I would say that I think the spirit of this legislation is to encourage those that build this standard and again, it's completely voluntary. It can be a retrofit situation where you retrofit your residential or commercial property or you can build a new residential commercial property of this standard. The insurance company will determine that incentive on their own but we're just trying to encourage that through this legislation. So to speak specifically to your question, I'm not exactly sure that I necessarily agree that that would happen but that is not addressed in this legislation. Thank you. With that Mr. Speaker, I would ask this body's favourable consideration on House Bill 279 and I yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favour of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 172, the nays won. The bill having received a requisite constitutional majority is there for pass. Will the clerk read the caption to HB 280, HB 280? The council is to be entitled to amend chapter 24, Title 33. The officer goes to George Anandt and relates to the insurance generally. So to provide for additional value added products and services that are excluded from being unfair trade practices and unlawful inducements and insurance. This bill ever further, committee on insurance, that committee recommends that this bill do pass. The representative gamble is recognized to present the bill. Thank you, Mr. Speaker. Members of the House, it seems like it's insurance day at the Capitol today. I'm back with House Bill 280, another insurance related bill. And I want you to go with me. We were in the property and casualty side of insurance. Now we're over on to the life and health side of insurance. This bill builds off of a piece of legislation that we passed last year that allowed a property and casualty agent to offer a smoke detector, water leak sensor in the sale of property and casualty. What this bill does is it would allow a insurer for a life or health policy to offer a blood pressure cuff, a fit bit, some type of personal health device in the sale of life or health insurance. The product has to be a value that's reasonable in relation to the premium so this cannot be an expensive item. But the thought behind this legislation is that if you have that technology, it might help to minimize or lower your risk for stroke and high blood pressure and things like that. So that's what this bill does is it would allow those products to be offered in the sale of life or health insurance. With that, I'm happy to yield for questions. You have a question if you're yield. How will yield? Representing Bentley straight in the rear to your left. That's a question. Representing Bentley. Thank you, Mr. Speaker. Does the gentleman yield? I yield to my good friend, yes. Representative, explain to me exactly how house bill 280 is going to impact the funeral industry because when I hear you talk about life insurance, that definitely impacts my industry. This bill going to affect my method of payment so that I can buy a new hat. They are still going to come to you. It just may take a little bit longer. So you're saying does the gentleman further yield? I yield. So you're explaining to me the house bill 280 is going to delay my payment for the funeral industry? It could, but it will also help your workforce crisis right now because it could help you with some employees to assist with the work that goes on in your industry. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Well, you have one more question if the gentleman will. I'm going to go ahead and yield and ask for your favorable consideration, house bill 280. Good answer. I think this will help the funeral industry know that about that in the right kind of way and the right kind of way. Is there any objection to the gentleman's yield to the well? Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, you do, yes. If so, the clerk will lock the machines. From the passage of the bill, the yeas are 172, the nays 2. The bill having received the requisite constitutional majority is therefore passed. Let's see. We do have insurance today at the Georgia House. We certainly do. Mr. Clerk, well you read the caption to HB 294, 294. House Bill 294 by the motion of the Lodge, 167th and others to be titled an act to amend Article 3 of Chapter 37 of Title 33 of the Fish Go to Georgia and Tateau relating to procedures for rehabilitation. So it's a provide for the administration of contracts re-insuring life, disability income or long-term care policies or annunities. This bill I refer to the committee on insurance. That committee recommends the disbill do pass. And the Lodge is recognized to present the bill. Thank you, Mr. Speaker. For all of you that have long had a burning desire to know more about reinsurance contracts and seating insurers in liquidation, today is your day. House Bill 294 is model legislation from the National Association of Insurance Commissioners. This is not a department bill, but the department does support the bill. This bill deals strictly with life insurance, long-term care, disability income and annuity products. But provides for a means by which a successor to a company in liquidation and by that, I mean there are three possible entities. It could be the Georgia Life and Health Guarantee Association, which was created by this body in 1981. It could be the liquidator, which would be the insurance commissioner. It could and most likely would be an assuming company, which would be another life insurance company that was willing to step up and assume the obligations in return for the premium income from these products. It does one thing and one thing only for each one of these three entities, whichever one is standing in the place of the company placed in liquidation. Guarantees them the right to continue an existing reinsurance contract. There are many instances where that's a great advantage to the policy holders and to the assuming company or whoever is standing in the place to protect those policy holders. They might want to continue this reinsurance contract. The other thing it does is should these entities elect not to continue that reinsurance contract, there is a provision for settling accounts, figuring out which entity owes, which entity. And that can be a fairly complicated process and it's spelled out clearly in this bill how that's to happen. If there's no agreement on that it provides for arbitration, that's what it does and it does nothing more. It does not change any contracts. Does not deal with property and casualty at all. And Mr. Speaker, if there are no questions I'll yield the will. Well, Mr. Chairman, you do have a question. You do have a question and I have a statement. I'll, if you'll take this question I might answer my question. Yes sir. Chairman Corbett to your right has a question. Does the gentleman yield? I do. The chairman hits you and says, have you write that explanation? No but I'll remember next time to ask him. I don't think the gentleman has any more questions. So I'll lay the way. Well yes we do have a question. Chairman Carson has a question. I'm sure this will be spot on. Yes sir. Mr. Chairman. Thank you Mr. Speaker. Does the gentleman yield? I do. I appreciate you bringing this bill. Is it not true that this updates our policies that are relevant when an insurer goes into liquidation including reinsurance contracts? That is exactly right. It spills out the procedure and gives us some certainty about what's going to happen with that contract. Thank you for that. Is the gentleman further yield? Is it not true that this policy, this model bill is also from the NAIC National Association and Insurance Commissioners? Like you said earlier. The gentleman so staged. Thank you very much for bringing this bill. Mr. Chairman you have no further questions. But I will let you know I'll lay the way. Most of the night pondering these questions on this reinsurance last night. Thank you for clearing them up. Is there any objection to the previous question being ordered? Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? If so the clerk will lock the machine on the passage of the bill. The yeas were 174 the nay zero. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk if you'll read the caption to hb315.\n\n315. House Bill 315. My representative Taylor the hundred and seventy third be titled an act to amend chapter twenty four title thirty three the fish go to Georgia and it's had a really an insurance generally. So it's a reward for the commissioner of insurance from Paul McGate rules and regulations regarding cost sharing requirements for diagnostic and supplemental breast screening examinations. This bill I refer to the committee on insurance and committee recommends a dis bill do pass. Chair and chair lady darling Taylor is recognized to present the bill. Thank you Mr. Speaker. Today I bring you House Bill 315. I'm working off of LC 520242. This is a follow up bill from last year. It has to do with mammograms and when you need a follow up for identity it allows it to be paid as a preventive. It's adding some wording and allowing the commissioner to be able to make the decision what these decisions are based based on. It had been limited in the previous bill to the January 1st 2022 and those updates come frequently so this allows him to make those choices. I'll be happy to answer any questions. I don't see any questions. Thank you Mr. Speaker. I ask for your favorable consideration. Mr. Speaker. Is there any objection to the previous question being ordered? Chair here's none. The previous question is ordered. Is there any objection to bringing to the report of the committee which was favorable to the passage of the bill that the chair has done? The report report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill the yeas were 173 the nays won. This bill having received a requisite constitutional majority is therefore passed. That completes our rules calendar. That completes our rules calendar. We'll now move on to afternoon orders. Representing Sheila Jones is recognized. She's patiently weighted and she wants to talk to us about some folks she had here today. Representative Jones. Thank you, Mr. Speaker. Members, I rise today to recognize today as clock Atlanta University day at the state capital. We have with us the president of CAU, Dr. George T. French Jr. First Lady, Dr. Bashan Welch French, Marsha Taggart Jr. and Joleen Butts Freeman. Please stand and join me as we recognize and command the clock Atlanta University for their many years of dedicated service to the higher education of Georgia citizens and for attracting young scholars from across the nation to our great state. Thank you. Thank you, Representative. Representative Willis has recognized for an afternoon order. Representative Willis. Thank you, Mr. Speaker. Good morning, colleagues. I bring greetings and rise today to pay tribute to one of my favorite quotes. One of which includes those that don't got it can't show it and those that got it can't hide it. Zoranio Hurston is regarded as a folk-lorist and African-American author and anthropologist. In 1913, the president of the University of Georgia was the president of the University of Georgia's Department of Justice and Department of Justice. She published one of the most prolific works entitled Their Eyes Were Watching God. At age three, her family moved to Eatonville, Florida, which she regarded as her home. It was one of the first all black towns incorporated in the United States of America. sowed with Sכלone and her monochrome Account Everything FaSore Cos ожaventShe raisedeüber upside-by, boys sleep in a unparalleled book Phenix Zora spirit in her intellect and allowed her to give her gift to us in perpetuity. She began her collegiate studies at Howard University in Washington, D.C.. and a beacon of the Harlem Renaissance. Hurston fused anthropological folkloric and black experiences to make her literary mark. But often when we make our mark, it is not always received and regarded with favor or support. She was known as the genius of the South. And when she died, her papers were ordered to be burned. But an officer friend of hers stopped by her home and assisted in putting out the fire. Then her collection was given to the University of Florida. She was buried in an unmarked grave until the 70s, until her sister, writer and friend, Alice Walker sought out her unmarked grave where it now reads, Zorneal Hurston, genius of the South, folklorist and anthropologist, and in closing, Zorne Hurston wrote that there are years that ask questions and there are years that answer. May this house now be an obsession that answers. I thank you for your time. I praise the creator for writers such as Zorneal Hurston who inspired black women like me to stand before you today and Mr. Speaker, I yield back the well. Thank you. Thank you, Representative. Chairman Jasper has recognized for an afternoon order. All right. Thank you, members. First off, remember you have board DOT board elections this afternoon. I hope you attend. But Mr. Speaker and members, we're glad that you are a speaker. The 75th speaker of the house, and we appreciate your dedication to us and the state of Georgia. I'm from the home of Georgia Marble, Pickens County. It's the stone of choice since the 1850s. Our Capitol building has over two acres of white and pink marble on the floors and the walls. From Pickens County, but especially, take Georgia. Evan Howell and the family of employees at Blue Ridge Marble have created you, Mr. Speaker, a name plate for your desk. Now it's all a headstone, but a name plate. Because we appreciate you so much. Thank you, Senator. Thank you. Thank you. That's what it looks like right there. So. Thank you. And well, thank you, members, and I appreciate the Blue Ridge Marble Company. Thank you, Chairman Jasperes. And to one of the things that makes Georgia famous is our marble. That is beautiful. I humbled to accept it. And if you don't mind, just do your best to get it in my office. I don't know if I'm not sure I can handle that. But I'm. But yes, we have many beautiful Georgia marble stones and our little country church's cemetery. And they will last through eternity. And we have much appreciate this. Thank you. Thank you so much. Thank you so much. Chairman Bonner has recognized for an afternoon order. Thank you, Mr. Speaker. I rise today to honor a great Georgian and a great American. This past Thursday, Major General John King retired after 41 years of service in our National Guard. Now, many of you know Major General King. His story is a great American story and a great Georgia story. Immigrating here from Mexico at an early age, joining the Armed Forces and serving four decades. Over that period of time, he led soldiers into combat. He served in peacetime and in war. And I'll just tell you, friends, oftentimes in these halls, we are star struck by celebrity and athletes that come through these halls and petition. But if you want to recognize and meet a legitimate American hero, you will say thank you to Major General John King for his 41 years of service to the state of Georgia and to our country. Thank you, Mr. Speaker. We're representing Kennerds, recognized for an afternoon order. Thank you, Mr. Speaker. For a black history month, I would like to spotlight the person who was born in Louisiana to emancipated parents in 1870. As a very young man, he felt a call to preaching ministry and ultimately took his preaching ministry to Los Angeles, California, where God used him in 1906 to start a very important revival in the states called the Azusa Street Revival. It lasted for nine years from 1906 to 1915. And it was highlighted by an outpouring of the Holy Spirit that mirrored that in the book of Acts with the gifts of the Spirit and operation as well as healing and miracles. It got such national attention that it drew 1500 believers every night in the small storefront church on a Azusa Street. And one of the hallmarks was that it was a very deep multicultural experience where believers from all over, black people, white people, Hispanic Asians, immigrants, American citizens, young, old, rich poor, they all gathered there. And that was against the social norms of 1906 in this country, of course. And so from there, it gave birth to the modern pinnacle stool movement. Unfortunately, as multicultural as the revival was, once it formalized denominations, it segregated again, and it gave birth to white pinnacles of denominations, namely the assemblies of God, the tradition in which I was raised, and also the Church of God. Black pinnacles of churches were also born, namely the Church of God in Christ or the Kojik Church, as well as several black apostolic face. These believers a hundred years ago that experienced this outpouring, they would often testify in a church service, which would finish up their testimony by affirming, I thank God that I'm safe, sanctified, and filled with the Holy Ghost, and you'll hear that in modern churches today. So we thank you for the memory of William Joseph Seymour, who is important to black history and also to church history. Thank you, Mr. Speaker. Thank you, Representative, for that history. Now, members, I want you to pay attention, as you've done, been doing here since we were doing after-nordes. Chair recognizes Chairman Chokus for an after-nord. Thank you, Mr. Speaker. As many of you know, President and Mrs. Carter are my two most famous constituents. I've been asked about the news that President Carter is receiving hospice at his home in Plains. Well, we are all keeping him and his family in our prayers. President and Mrs. Carter are woven into the fabric of our community, even through their political success. President and Mrs. Carter have remained good neighbors and are active in the community of Plains. Just in the last few weeks, they were seen riding around in the community, checking in the sites. For the last few years, their son, Chip Carter, has been making weekly trips to Plains to visit his parents and attend to the family business. President and Mrs. Carter are both, as you know, devout Christians with an unshakable faith. They are both passionate about making this world a better place and through the Carter Center here in Atlanta, that's exactly what they have done. Fighting disease, waging peace, building hope. Again, please keep President Carter and the Carter family in your prayers. Thank you. Thank you, Mr. Speaker. Thank you, Chairman Chokus. Not much you can add to that. Thank you. Representative Butters recognized for an afternoon order. Thank you, Mr. Speaker. I'm here to recognize three of our own. There was a busy weekend and several people were honored. I'll do ladies first. We are here to recognize and celebrate with Representative Hewglie. 30 years ago, she started the AK that A Day at the Capitol. And so we're proud of her being recognized for that and bringing those fine ladies into the Capitol. And also Kim Alexander was recognized as a legislator of the year by A.K.A. So it's great that they all receive recognition. And then we had great fun. My family and I going to an event at the Atlanta History Museum Saturday night. Back in the day when Roy Barnes was governor, he was very upset that so many people in Georgia had to leave the state of Georgia to get cancer care. And he decided at that time we needed to establish some opportunities for people to get their cancer treatment here in Georgia and have an NIH approved cancer research program projects and hospitals. And that was the beginning of Georgia Corps. And one of our own chairman, butch parish, was recognized as a trailblazer for helping with establishing Georgia Corps, making sure it's still on the front burner when it comes to funding. And he's being shy, but he was the only legislator that was honored. So it was a really big deal after 20 years, Georgia Corps has helped save thousands of lives and have helped a lot of people live a lot longer. And it was a great night and it was a great honor and I'm proud for him. Thank you. Thank you, Representative Buckner. And congratulations to those that were honored by the way that some very impressive. We know the House leads in many different ways. Thank you all. Representative Reese has recognized for an afternoon order. And friends. Thank you, Mr. Speaker. Colleagues, it is with profound sadness and a shattered heart that I reflect on the horrific events and our hometown of Columbus, Georgia this weekend. 17 people were shot, including a five-year-old who were permanently losing eye. Five people died, including a 15-year-old, and a father and son in the same location. Mr. Speaker, people tired, citizens are weary. And they're not looking to blame anyone. This is not a democratic issue nor a Republican issue. When we are losing our babies and they are being harmed, we are all failing our babies equally. We must work to stop the problems before they even start. We must accept, fund, and embrace early-end adventure programs so that we can get our own youth before they are grabbed by the streets. Mr. Speaker, if you will, I would like to have a moment of silence for the five lives that we lost in Columbus, Georgia and all the lives that we lost this weekend to gun violence. Thank you, Mr. Speaker. I yield the will. Thank you, Representative, and certainly our heart prayers go out to those who lost this weekend. Mr. Clerk, will you please read the caption to a group of privileged resolutions? Honoring the Life and Memory of Bishop James, H. Morton and his lifelong commitment and dedication to preaching the Gospel of Jesus Christ. Honoring the Life and Memory of Brian Brown. Honoring the Life and Memory of Reverend Terence Alton Dix. Recognizing Commending Johnny Floyd on his outstanding public service. Recognizing Commending John Hope Bryant. Commending Grabslating Dr. Bernice A. King. Commending and the Georgia FFA Association of Recognizing February 21st, 2023 is FFA Day at the State Capitol. Recognizing Commending Judge John M. Ott. Recognizing February 21st, 2023 is Brunswick Golden Isles Day at the Capitol. Congratulations, commend the Senator Denise Taylor for receiving the 2023 Yellow Rose Nickety Randall Service Leader Award. Recognizing February 15th, 2023 is Certified Community Midwife Day at the State Capitol. Recognizing March 2023 is Triple Negative Brust Cancer Awareness Month. Congratulations, the Mill Creek High School football team for winning the 2022 G.H.S.A. Class 7A State Football Championship. Honoring Commending, Visiting Nurse Health System. Recognizing Commending, Star Hutchings Perdue. Recognizing February 23, 2023 is Community Health Center's Day. Congratulations, Atlanta Faisy for winning the 2023 Major 2 Call of Duty League Championship. Recognizing Commending, Guy J. Camiso Jr. Recognizing February 2023 is Career Technical Education Month. And recognizing Commending, J. Sutsk and for other purposes that completes the reading of the Privilege Resolutions. Is there any objection to adopting the Privilege Resolutions? Chair, here's none and the resolutions are adopted. All right, members, we're going to take up some motions now. What purpose does representing Cameron rise? To make a motion. State your motion. Requests the rules to be suspended so Bill can be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House Bill by Representative Cameron of the First and others to be entitled to amend Title 34 of the Fish Goat and George Anitetti relating to labor and industrial relations. Own the gentleman's motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed committee. Is there objection? Industry and labor. For what purpose is Representative Chairman Parish rise? Motion. State your motion. I move that the rules be temporarily suspended so the bill may be read for the first time in a signed committee. Clerk will please read the caption. Unnumbered House Bill by Representative Parish of the 158th to be entitled to amend to create the Immanuel County Public Facilities Authority. Own the gentleman's motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed committee. Is there objection? Intergovernmental coordination. For what purpose is Representative Jones, Todd Jones rise? To make a motion. State your motion. I move that the rules of this House be temporarily suspended so my bill can be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House Bill by Representative Jones, the 25th and others to be entitled to amend Article 1 of Chapter 3, Title 8 of the Fish Goat and George Anitetti relating housing authorities generally so to revise provisions relating the tenant selection. Own the gentleman's motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed committee. Is there objection? Public and community health. For what purpose is Representative Carpenter rise? Make a motion. State your motion. I move the House bill 369 be moved from the motor vehicles to the technology committee, both Chairman and Agree. Mr. Clerk will you read the caption? House bill 369 by Representative Carpenter, the 4th and others to be entitled to amend Title 40 of the Fish Goat and George Anitetti relating the motor vehicles to traffic. So it's a prohibit the use of personal delivery devices for certain type of deliveries. Own the gentleman's motion that HB 369 be withdrawn from the motor vehicles committee and recommitted to the technology and infrastructure and innovation committee is their objection. Hearing none, it is so ordered that completes our emotions. I'm ready for announcements now, but for planning purposes let me bring you up to speed on now some further business that will occur this week. In conjunction with the majority leader, last Thursday we came in at 1 p.m. This Thursday we will come in at 10 a.m. Is that correct Mr. Majority Leader? 10 a.m. on this Thursday for planning purposes. For announcements Chairman Parsons is recognized for an announcement. Thank you Speaker Barnes. Just a reminder to members of the Energy Utilities and Telecommunications Committee, we have a meeting at 3 o'clock this afternoon in room 403 upstairs at 3 o'clock. I'm mindful that there are maybe some DOT elections this afternoon. If we can be punctual, I think we can get in and out pretty quickly and need you there. Thank you. Thank you Mr. Speaker. Thank you Chairman. I know all the members heard that, all the members of the committee, you need to be punctual this afternoon. Lots going on, representative Alexander for an announcement. Thank you Mr. Speaker. Women caucus meeting room 514 CLLB, that's been a room change. Thank you. Representative Earhart, recognize for an announcement. Thank you Members for those of you who serve on the regulatory subcommittee of regulated industries. We will have a committee meeting today at 3 o'clock. I look forward to seeing you there. Thank you Representative Maynard, recognize for an announcement. Thank you Mr. Speaker. You all just received something on your desk. Tomorrow morning there's going to be a free breakfast and CLLB 605. It's hosted by FamilySearch.org. They went and did some research and they found that the people that are most likely to do research on their families, about 60% are non-minority and only 4 to 6% are minorities. So they're really trying to reach out. So if you are a part of a minority caucus, Black Caucus Asian Caucus, Jewish Caucus and so on, come to 605 tomorrow morning from 8 a.m. to 930 p.m. Thank you. Thank you. Chairman Lomston, recognize for an announcement. Members of the Full House Insurance Committee, there will be a meeting in the morning 8 a.m. CLLB 406. We have several bills to deal with. Please be there. Representative Vance Smith, recognize for an announcement. Thank you Mr. Speaker. This afternoon at 3 o'clock and 415 a CLLB will have a resource management subcommittee of the Natural Resources Committee meeting. And immediately following will have an environmental quality subcommittee meeting. 3 o'clock, 415, CLLB. Thanks, Mr. Speaker. Thank you, Representative Smith. Chair Lady Mathy, recognize for an announcement. Thank you, Mr. Speaker. I'd like to remind the state planning and community affairs committee. We will have a meeting today at 1 o'clock, 606 CLLB. 1 o'clock, 5.06. Excuse me, 5.06. It'll be a quick one so we need everybody there. Thank you, Mr. Speaker. Representative Jasmine Clark, recognize for an announcement. Thank you, Mr. Speaker. Members of GLBC, members of GLBC, tomorrow we will take our picture at 930 a.m. on the South Wing Seps. Please wear black. Also for planning purposes on February 28th, pull out your African print, your African garb, your African ties. We will wear our African print on February 28th, the last day of black history month. And Heritage Dinner is tomorrow 6 p.m. Please let me know or my admin know if you plan on attending so we can make sure that we know how many seats we need. How many seats we need for members?\n\nLast announcement, no policy committee today. Cheerly the Cooper is recognized for the announcement. What? Hold it. She needs to finish up, cheerly the Cooper. Representative Clark. Thank you, Mrs. Speaker, my apology. Heritage dinner is Thursday. So I got my days wrong. Thursday at 6 o'clock PM, my bad y'all. Wednesday pictures, Thursday Heritage dinner. Well, we're good now. We're good now. Cheerly the Cooper. Recognized for an announcement. Thank you, Mr. Speaker. There are a lot of meetings, short-term meetings that we're starting at 1 o'clock. So today, the public and community health committee will meet at 1.45, 1.45, 606. Let the other ones meet real quickly, and then we'll see you there. Thank you, Mr. Speaker. I yield well. Representing Hutchinson. Recognized for an announcement. Thank you, Mr. Speaker, and happy Maddie Grah. Everybody knows, well, most people know that I am originally from New Orleans, and this is the day that I am truly, truly homesick. So I brought King Cake. King Cake is representative of the three kings that brought gifts to Jesus, so the three colors represent the three kings. And I would like to say, because I think everybody is thinking this, Mr. Speaker, that giant piece of marble does look like a headstone, so I will watch out. Thank you, Mr. Speaker. Thank you, I think. But you're right, you're right. Chairman Dickie is recognized for an announcement. I can speak here, members of the House, I coach, Consumer Affairs Committee. We will be meeting in the morning, 8 o'clock. We'll have some bills to hear. 8 o'clock, 6 o'clock, 6 o'clock, 6 o'clock, and the morning. Wednesday morning. Chairman Bonner, recognized for an announcement. The Defense and Veteran Affairs Committee, 2 o'clock today, 506 CLOB. Thank you. Chairman Chokus, recognized for an announcement. Thank you, Mr. Speaker. Small Business Development Committee, 506 tomorrow morning, 8 a.m., 8 a.m., 506, Small Business Development. Thank you, Mr. Speaker. Chairman Chokus, recognized for an announcement. Thank you, Mr. Speaker. Leader, illustration, recognized for an announcement. Thank you, Mr. Speaker. There will be a Chairman's lunch in room 403 upon a German. Room 403 upon a German. Thank you. That concludes our announcements. We do have a birthday, members. We have a birthday. And then we're going to have one more announcement. But we have a birthday. Representative Victor Anderson has a birthday today. Happy birthday, Chairman. Mr. Victor Anderson, representative. We do have pages today, so if y'all will, meet your pages down front. And I want to let y'all know that prayers are answered. My granddaughter, Elizabeth, is a page today. And that's not the answer to the prayer. The prayer was when we were sworn in on the 9th of January. Elizabeth was here. On the 10th, she had been suffering from appendicitis. Appendicitis on Monday and Tuesday. She had emergency epindectomy on Wednesday night. And she's recovered. She's back to volleyball. And she's back to page. So thank the Lord for answered prayers. And welcome, Elizabeth. Chair recognizes the majority leader for a motion. Mr. Speaker, I move that this house stand adjourned until 10 a.m. on Wednesday, February 22nd, 2023. On the motion of the majority leader, that this house stands adjourned until 10 a.m. Wednesday, February 22nd, 2023. All those in favor will say aye. All those opposed will say no. Yep, now I have it. We're adjourned.",
  "updated_at": "2026-02-13T05:43:43.846263+00:00"
}