{
  "video_id": "5w0dYeaqFFY",
  "url": "https://www.youtube.com/watch?v=5w0dYeaqFFY",
  "title": "State Income Tax Debate and Party Priorities I 2026 Lawmakers Day 3",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia State Income Tax Debate and Party Priorities I 2026 Lawmakers Day 3 session:\n\n**Overview**:\nThe Georgia legislature discussed affordability and tax policy as key priorities for the upcoming legislative session. Governor Brian Kemp outlined budget proposals focused on infrastructure, homelessness, and workforce development. Legislative leaders from both parties highlighted plans to address property taxes and the state income tax.\n\n**Key Actions**:\nNo specific bills were mentioned as being passed or referred in this session.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced in this session.\n\n**Notable Moments**:\n- Governor Kemp announced plans to invest $1.8 billion in new express lanes on I-75 and $50 million in a homelessness response grant.\n- Legislative leaders emphasized affordability and tax relief, with the Senate aiming to gradually eliminate the state income tax and the House pursuing homestead property tax exemptions.\n- The House plans to introduce bills for an optometry school and placing a reading coach in every elementary school.\n\n**Votes**:\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**:\nThe quorum and attendance for the legislative session were not explicitly discussed.\n\n**Adjournment**:\nThe session adjourned without a specific mention of the next scheduled meeting.",
  "transcript": "For those who can think of nothing else but the upcoming election, let me share a word\nof advice.\nIf you fail to listen to the people, you will fail to earn their vote.\nSo let's stay focused on the future, where anyone who wants to work for a better life\ncan achieve it here in the best state for opportunity.\nThis morning Governor Brian Kemp advised lawmakers to keep their focus on the needs of\nGeorgians in this election year.\nGood evening and welcome to day three of the Georgia Legislative session.\nI'm Donna Lowry in Atlanta.\nWe'll have much more on the eggs and issues breakfast at the Mercedes-Benz Stadium this\nmorning later in the show.\nShow leaders in the House give us an idea of their policy goals.\nAnd in recent years, the General Assembly has lowered the individual income tax rate.\nA Senate committee studied how to eliminate it over the summer.\nAnd we'll hear more about that.\nWe'll talk to two members of the committee, including the chair.\nFirst, we lead off of what happened today with our Capitol correspondent, Sarah Callis.\nHi, Donna. Lawmaker started the day bright and early at the annual Exan Issues Legislative\nBreakfast. Legislators and business leaders gathered and discussed economic priorities\non the field at Mercedes-Benz Stadium, which will host the 2026 FIFA World Cup.\nWe got our first look at Governor Brian Camp's budget priorities at his final Exan Issues\nLegislative Breakfast. As the state's top executive, Camp says the state will invest 1.8\nBillion dollars in new express lanes in the most congested sections of I-75 in Henry County.\nCurrently 45 to 60% of commuters can't get in the express lanes when they need them the most.\nThis funding will enable G-Dod and Serta to address those issues head on.\nOur initial estimates indicate that once these express lanes are completed,\nAs much as 70% more vehicles will be able to pass through that corridor during the rush hours.\nThat's a great return on investment for our state.\nLocal road improvements will also be in the budget, Camp Said.\nHe also announced new funds to curb homelessness in Atlanta, ahead of the 2026 FIFA World Cup.\nKnown as the homelessness response grant, the state will make a one-time investment of $50 million.\nthat will be coupled with other funds\nfrom public, private, and non-profit partners\nto launch this initiative.\nThrough very targeted use of funds,\nthis grant will act as a force multiplier\nto complement the good work already underway\nby Mayor Dickens and other champions\non this challenging issue.\nAwards will go to local governments\nand non-profit organizations\naddressing street-level homelessness in Georgia.\nAnd it will ensure that every stakeholder,\nevery stakeholder has equal skin in the game.\nWe will also see more workforce readiness\nin this legislative session.\nCamp says.\nIn the coming days, my administration will propose\nthe education and workforce strategy at.\nIt will ensure the unprecedented collaboration\nbetween the University and technical college systems,\nthe Georgia Department of Education, and others live on,\nLong after many of us today are no longer in the positions that we currently occupy.\nLeaders of the House and Senate also took to the stage, emphasizing that affordability\nis this year's theme.\nLieutenant Governor Bert Jones said the state will focus on limiting property tax and\nreducing the income tax this session.\nWe'll concentrate on income tax, lower in it and property tax, getting a handle on\nthat, looking at insurance costs and everything else.\nare all things that are on people's mind right now. And so as legislators, it's our\nresponsibility to focus on those issues that are, you know, concerning our constituents.\nRepublican senators say they will put forth legislation to gradually eliminate the state\nincome tax. Speaker up the House, John Burns, said the House will also double down on\nreducing property taxes, but through the homestead exemption.\nThe House will put forward legislation enabling the elimination of the homestead property tax\nstatewide.\nBurns also said that literacy and workforce readiness remain priorities of the House.\nHe said lawmakers will push for an optometry school in Georgia.\nGeorgia does not have an optometry school and we know that access to vision care is so\nimportant as we continue our efforts to strengthen literacy.\nbecause that's what's more important to learning to read,\nwhat's more important to learn and to read,\nthan ability to see in the classroom, right?\nHe also said the House will introduce legislation\nto put a reading coach in every elementary school\nin the state.\nAfter the event, Georgia Chamber CEO Chris Clark\ngave his perspective on the business impact\nof several hot issues at the Capitol,\nlike reducing tax incentives on some industries.\nI think some of that is worth us taking a look at.\nWe do have some outdated tax incentives\nthat are still on the books,\nbut quite frankly, when you look at that total amount out there,\nit only comes around $3 billion every year,\nso it's not 13 or 14 or 17 billion\nthat's enough to make everything up.\nBut I think at the end of the day,\neven those states that don't have income taxes\nstill have tax incentives.\nThe difference is, those states don't have\nan anti-gratuity clause.\nIn Georgia, you can't give a grant directly to a company\nto do an expansion to come to Georgia.\nWe don't allow that here.\nAnd so we really do use those tax credits differently.\nLawmakers advocating for income tax elimination,\nsay reducing some tax incentives will help make up for the loss\nin income tax revenue.\nAfter the event, lawmakers filed back to the Capitol.\nThe House and Senate both met without passing any bills.\nTomorrow, we will hopefully learn more details\nabout the governor's proposals in his final state\nof the state address.\nThat's my Capitol report.\nBack to you, Donna.\nThank you, Sarah.\nOn this day three of the session,\nwe continue to learn what to expect\nduring the legislative session.\nTwo of the lawmakers who will help lead\nwhat happens join us.\nHouse Majority Leader,\nRepublican Representative Chuck,\nAbstration of Mulberry,\nhe was first elected to the House of Representatives in 2013.\nAnd House Minority Whip,\nDemocratic Representative Sam Park,\nof Lawrenceville,\nhis first election to the House was in 2016.\nWelcome the lawmakers to both of you.\nThank you so much.\nWe're going to talk about priorities.\nSo, leader registration for a couple of years now,\nthe speaker has talked about giving Georgia residents\na break when it comes to property taxes.\nIt tells us if this is the year, that's going to happen.\nWell, thanks for having me, Donna.\nAffordability is the big issue this year.\nAnd our speaker has outlined the elimination\nof the homestead property tax state-wide.\nAnd that legislation is to be introduced\nthis legislative session, Georgians are paying so much\nin property taxes as property values continue to climb.\nAnd so for their homes where they live,\nthe elimination of that property tax\nwould be a huge savings.\nOkay, we'll get more on a affordability in a moment.\nSo talk about that when it comes to taxes\nwith the Democrats.\nWe're certainly interested in looking forward\nto seeing what the Republican caucus will be proposing\nwhen it comes to property taxes.\nI think leader of Stration mentioned a key aspect\nthat I think there needs to be more focus,\nwhich is these increased valuations,\nthese increased property values\nin which the underlying cause is the lack of housing supply.\nYou know, over the past seven to eight years,\nwe've seen the median average price of a home\ngo from about $200,000 and more than $450,000.\nSo I think while looking at property tax reform is important,\nwe also have to do what we can't expand\nthe supply before the housing.\nOkay, let's move on to education.\nalways big at the capital every year during the legislative session.\nWhat are you talking about with the Republican caucus?\nSo childhood literacy is a major issue for this legislative session.\nSpeaker John Burns outlined in his speech this morning that\na top priority of the state house is literacy, particularly looking at the third\ngrade reading level when only one third of kids statewide are reading\nproficiently at grade level.\nThat's a major concern, particularly with the spending and\nand focus that we've had in education in the classroom literacy coaches who can assist\nteachers in following a curriculum which is proven to be effective for those kids is\nso critical for the long-term development of the child, for ultimately issues like workforce\ndevelopment and career readiness.\nYeah.\nSo that's a big thing with the Republican caucus, with the Democratic caucus.\nWith respect to education, you know, the Democratic caucus, we really look at it from the\nspectrum from cradle to career.\nCertainly there will be bipartisan support\nto ensure that we're investing more in literacy.\nBut with respect to K through 12 education,\nI think there's some disagreement\nbetween the two parties.\nOf course, over the past few years,\nwe've had a big debate over vouchers,\nin which just last year we sent $140 million\ntoward private schools and vouchers\nthat really undermine especially rural school districts\nand their ability to teach kids.\nThe last piece I'd mention on education\nis student loan debt.\nYou know, Georgia now ranks third\nwith the highest average student loan debt in the country.\nAnd of course, Senator Nan Orrick did an excellent job\nover the off session in doing a study committee\non needs-based aid for higher education,\nand which hopefully we'll be able\nto move something on that issue as well.\nAnd she'll be on the show later.\nSo, any more, anything more on education you wanna mention?\nI think education is the top priority right now.\nI think that the ability for every child in Georgia\nhave to world-class education and for us to meet those standards for reading are issues\nthat I expect will really advance this session.\nOkay.\nLet's get into health care.\nLet's talk about the fact that Democrats have for a while now pushed for Medicaid expansion.\nDo you expect to do that again?\nWe will be introducing additional legislation, including obtaining a fiscal note to understand\nthe true impact in cost, a full Medicaid expansion, but of course this is not a pilot.\nmore than 40 states that have expanded Medicaid. It has lowered the costs of private health insurance\npremiums because we're expanding the pool lowering the risk. And, you know, of course, you know,\nright now, healthcare prices are skyrocketing in large part because of the federal government and\nthe Republican majority, in which, you know, we're seeing healthcare premiums for those increasing\nby $1,000, $2,000.\nAlready about 190,000 Georgians with ACA plans have fallen off.\nAnd so it's a very, very concerning situation.\nEspecially when we're looking at tax cuts\nthat provide an average benefit of approximately $250\nto $300, that's fantastic.\nBut if your health care prices are going up by $1,000, $2,000,\nthe affordability crisis continues.\nSo you'll expect some legislation in that area.\nWhat about with health care, with your caucus?\nWell, a lot of issues have been raised, a lot to unpack.\nI'll just say this, the affordability issues\nis a major focus, accessibility,\nand affordability in health care,\nparticularly rural health care access\ncontinues to be a major priority of the Georgia House.\nAnd there are many measures which we've worked\nto advance in that area.\nI know that as we're discussing the costs\nthat Georgians are facing in these expensive times,\ncertainly in response to the skyrocketing inflation\ncaused by policies out of Washington DC over the past few years.\nWe're now in a position where we can, I think, actually address that with tax relief,\nwith insurance premium cost relief, with the study committee that we've had this year\nlegislation coming, and with reducing costs for first time home buyers to be able to afford\nthat first home, build long-term wealth through home ownership.\nI know the speaker also talked about trying to increase the workforce in the health sector,\nyou know.\nAbsolutely.\nSo there have been new educational programs open across the state over the past few years,\ntraining for healthcare workers so that we can meet the demand.\nCertainly, as we have a population that requires additional healthcare workers.\nOkay.\nWhat else would you have on your plate?\nI would say, you know, with respect to the healthcare workforce piece again, certainly\nsupport the speakers focus on expanding the workforce.\nThere have been multiple studies that say that full Medicaid expansion would create 30,000\nadditional health care jobs in the state of Georgia.\nSo I think the best way, if that is a speaker's priority, is to, you know, work in a bipartisan\nmanner to expand Medicaid for Georgia.\nI just have to address that.\nRight now we're seeing policy out of Washington, D.C., talking about not funding commitments\nthat were made previously to states that did expand Medicaid.\nin a terrific position financially right now because of the strong fiscal leadership of\nGovernor Brian Kemp and the Republicans in the General Assembly.\nWe don't have a huge hole in our budget that other states are facing.\nWe actually have reserves that make this state better prepared for any financial uncertainty\nwhich may happen in the future.\nDid you want to add to that?\nAbsolutely.\nI think we have a historic surplus right now in which we're simply sitting on it rather\nthan investing in people.\nYou know, I appreciate the governor's interest in building out a highway, two billion dollars\nin which I think the ground would not be broken until 2030.\nHow fantastic would it be if we invested $1.8 billion in the health of Georgia's today?\nI'm expanding access to health care, I'm expanding access to childcare.\nI think there's a lot the state of Georgia can do, but unfortunately under the current\nleadership we haven't done that yet.\nOkay.\nLet's talk about any other priorities that we haven't talked about that you were looking\nat.\nSo tax reduction is a major focus over the past few years.\nThe General Assembly has reduced the income tax by two tenths of a percent each year,\n$800 million savings for Georgians.\nAnd there's a proposal to do that again this year, actually bring the income tax rate\nbelow 5%.\nThat's in addition to the property tax relief and a real focus on reducing insurance premiums.\nThat's healthcare insurance premiums, auto, mobile, homeowners insurance.\nWe've actually seen three carriers since the passage of legislation last year to reduce\nrates and additional carriers are coming into the state.\nUltimately, more competition is going to drop down costs, which will help all Georgians.\nOkay.\nAnything else you want to add, Doug?\nData centers, I think, is something that we should certainly closely examine.\nThe cost of data centers, I think we're providing up to $470 million in tax credits every\nsingle year in which 70% of data centers coming in Georgia would still remain.\nOkay, unfortunately we're going to have to make that the final word but I thank you so much\nboth of you for being here and we're certainly going to keep up with everything.\nGreat idea.\nWell Georgia joined nine other states and eliminated state income taxes coming up.\nWe'll talk to two senators who serve on a study committee looking into that issue.\nYou guys are really, really great.\nThe creative tip-reserving Georgia agriculture, Farm Bureau advocates for all Georgia farmers\nat the State Capitol during the session and year round, Georgia Farm Bureau, the voice\nof Georgia Farmers.\nExplore the stories that move you.\nWelcome to the incredible world of GPB Passport.\nFrom inspiring science to endearing dramas, Passport is your access to an incredible catalog\na PBS programming, and new titles are being added all the time.\nTake a look at what's new.\nWho the cat wanna get?\nWe're going to have company.\nWell, that has been on season of Begoald.\nComfortable, bad, home-cooked meals.\nSounds perfect.\nShould we just stay here?\nOh, it's opening to say that.\nYou are very much in the right place.\nIntriguing.\nIntriguing and potentially rewarding.\nSomething for everyone if you catch my drift.\nWe can't wait to see where GPB Passport takes you.\nYour support is a monthly sustainer connects you to the high quality news, information,\nand entertainment that you've come to rely on from PBS.\nAnd for GPB, your sustaining support is the most reliable source of funding for the programs\nand essential services that you rely on right here at home.\nMake an impact with your sustaining gift today and start streaming.\nVisit gpp.org and click Passport now.\nAnd thanks.\nIt's not a mountain thing or a coastal thing.\nIt's a Georgia people, places, and stories thing.\nWe're going to have a kitchen on Georgia Public Broadcast.\nIt keeps Georgians everywhere, dialed into home.\nTune in to GPB.\nIt's a Georgia thing.\nWe're going to look closely at a Senate study recommendation to eliminate income taxes.\nme are Republican Senator Blake Tillerie of Vidalia. He has served in the state Senate since 2016\nand is the Senate Chair of the Powerful Appropriations Committee. And Democratic Senator Nann\nOroch of Atlanta, she was elected to the Georgia Senate in 2006 after spending 10 terms in the House.\nWelcome to you both to lawmakers. I appreciate having you here. So both of you has spent months\non the Georgia Senate Special Committee\nfor the elimination of Georgia's income tax.\nSo, Germantilary, I want to start with,\nwho did you have talk to you?\nWell, who testified?\nWell, hopefully saying the title is...\nI know, that's the longest pass I know.\nSo, I think it makes a lot of sense for folks.\nWe had everyday Georgians come in and talk.\nWe had a police chief.\nWe had people who owned businesses.\nWe had a mom who was talking about childcare expenses.\nAnd it turns out that it didn't take,\nyou didn't have to go very far to find out\nthat every day's origins are filling the affordability crunch in their pocket books daily.\nAnd they're screaming for help.\nAnd I'm listening.\nYou heard a lot too, Senator.\nI did.\nAnd actually I'd love to see some more experts than the ones that were brought in who have\nbeen beating the drum against income tax for longer than some of us been alive.\nthe devil's in the details, okay?\nAnd we'll see.\nWe're gonna get into some of those.\nOkay, so we're gonna go through some of the highlights.\nWe show the flyer in the committee's executive summary\nand have you both comment briefly on each one of them.\nSo let's start with, we recommend making the first $50,000\nfor individuals in $100,000 for joint filers,\ncompletely tax-free beginning in 2027.\nWe also recommend reducing the state income tax rate\nfor all other families and businesses.\nChair Matilary?\nYeah, I mean, it speaks for itself.\nWhat we have noticed is that the folks\nat the bottom end are filling that affordability\ncrosses the most.\nIf you're making a million dollars a year,\nyou may be filling a crunch.\nBut you're making $100, $125,000 as a married couple,\nmaking $50,000 individually.\nYou're trying to figure out how you're paying for gas,\ngroceries, childcare, your power bill.\nIf we can eliminate the income tax on that first $50,000,\nThat's $2,500 a year in a person making $50,000 pocket\nevery year.\nYou like it, Senator?\nWell, the other side of that story\nis that that cuts $16 billion out of our state budget.\nAnd long term, I don't see how we can afford that when\nwe have high needs in every sector of funding childcare,\nfunding our prison system.\nEvery agency in the state is down.\nWe're not fully staffing our agencies.\nAnd we've got our vulnerable children\nin the foster system right now.\nThe $180 million in the red.\nOkay, so let's talk about that.\nOkay, I'm gonna let you talk about it.\nI wanna get through some more, though.\nSure. First.\nAnother highlight.\nThese proposals completely eliminate\nthe state income tax on two thirds of all working\nGeorgians while drastically reducing the tax burden\non everyone else.\nRight, under our plan, if you're making $50,000 or less,\nyour income tax liability is eliminated in Georgia.\nIf you're married filing jointly, in 2027, it's gone.\nIf you're married filing jointly,\nyour first $100,000 is exempt.\nIf you're making more than $100,000,\nit's $5,190 in your pocket every single year\nfrom now into eternity.\nIt's not just $250 a year, $500 a year.\nIt's forever.\nWhat do you think?\nWell, I think the proposal actually would dramatically\nchallenge us as a state to find the funding\nthat we need for so many underfunded responsibilities\nthat the state has towards its citizens.\nOK.\nNext, two thirds of individual taxpayers\nwould have no state income tax liability\nunder this proposal beginning in 2027.\nNo income tax two thirds.\nCorrect.\nSo in this plan, as we were going through debating and hearing from our colleagues on the\nother side, one of the things they said is that all the benefits go to the rich.\nWe wanted to make sure that this benefit was applied equally to all Georgians.\nAnd so what we did is said, let's exempt the first 50,000 if you're seeing along all Georgians,\n100,000 if you're married on all Georgians regardless of your income.\nAnd apply it across what that ends up doing, though, is if you're making less than $100,000,\nit eliminates your income tax liability entirely.\nThat's two-thirds of Georgians.\nThere's no way you can say that this only benefits the rich when every family making\nless than $100,000 now has zero state income tax liability.\nSenator Orrah?\nWell, the devil's in the details 74 percent of the benefit would go to people earning\nsix figures or more per year, $11.8 billion I think is what it would come in at.\nOkay.\nLet's get to the next one.\nThis proposal does not increase the sales tax nor creates property tax, nor does it\ncut government services for Georgians.\nSherman Delory.\nThe folks who are talking about affordability but not willing to do anything about it will\nalways throw an excuse.\nAnd the excuse that was thrown out this time is what the state is going to do is instead\nof taking it out of your left pocket, they're going to grab it out of your right pocket instead.\nAnd we said no we're not.\nWe're not going to charge a new sales tax.\nWe're not going to add a property tax, the state charges no property tax now.\nHow would we add that on?\nAnd we developed a plan that literally answered those concerns, didn't raise a sales tax,\ndidn't put a tax on groceries, didn't charge a property tax, didn't majorly benefit the\nwealthy if you'll find out in the first two years it's a $6 billion plan.\nOver $4 billion goes to those making $100,000 unless.\nWe answer all those questions yet we still hear that affordability is an issue yet we're\nnot willing to do anything about it.\nSo where is the money coming from?\nHow are you replacing that money?\nSo you know I've chaired the budget now for seven, this will be my seventh term chair in the budget.\nSo I guess I'm uniquely qualified to talk about it.\nLast year we brought in about $2 billion more in its expenses than revenue.\nSo there's $2 billion, the first year you need three.\nIf you move back from a cash standpoint where we've done bonds in the past, back to bonds,\nyou create about $700 million more.\nThe total cost is actually $5.87 billion.\nThat's about $2.9 a year.\nThere's your $2.9 to cover year one, in year two.\nWhat we're suggesting is that all we should do is prioritize people over companies.\nI heard Chris Clark say $3 billion a year on tax credits.\nHe's playing funny math.\nHe's not talking about the sales tax exemptions.\nLet's add all those in.\nWe give away and corporate giveaways over $30 billion a year.\nTake 10% of those.\nYou can eliminate Georgia's income tax on two-thirds of Georgians\nand give every Georgian a break for every year until eternity.\nI'll take that bet, throw me in that brow patch.\nSo, cutting back on some of these tax breaks,\nbut also the money that usually goes into that pot\nat the end of the year that has the surplus,\nyou're saying that is some of the money you're talking about.\nYou're saying we brought in more revenue last year\nthan we had in the census?\nWe're going to apply it somewhere.\nLet's apply it and give it back to the people\nwho sent it to begin with.\nOkay. Well, you know, a person getting a tax refund\ncannot go out and build the services they need\nneed for their disabled child.\nWe need to put money together as Georgians to have a state budget that's robust enough\nto deal with.\nWe've got 7,000 families on the waiting list now with disabled children that cannot get services\nand what we keep hearing from the Republicans is, well, there's not, we can't afford it.\nThere's not enough money for that.\nThere's not enough money for us to have financial aid for needy students to go to college.\nnot enough money for this. There's not enough money for that. And that's what the\nword is that comes down, but yet you're going to really threaten half of the state budget\nby doing away with income tax.\nYour response?\nWe spend over $2 billion on mental health and developmental disabilities each year. We\nspend 54% over $13 billion on education. There is no way you can say by looking at what\nWhat we fund with health care making up 23% of our budget and education making up 54%\nof our budgets that Georgia does not prioritize those areas.\nWhat we need to prioritize now, though, is those families making less than $100,000 who\nI don't consider wealthy.\nThat's your firefighters, your nurses, your police officers, your teachers, that we have\nan opportunity to completely eliminate their income tax liability, why would we not do\nit?\nThey're the budget guys, so not getting rid of things that people are used to right now,\nafter what you're looking for.\nWe've shown a way to do it in the current budget space.\nWhat we have to get rid of is the corporate welfare and subsidies that we've been plotting\nout for years.\nI heard someone say earlier that the data tax credit is $470, know it's $740.\nThey transpose their numbers.\nIt was only $17 million years ago, so now it's $740 million.\nYou know we have a film tax break of $1.2 billion.\nYou start adding these up.\nYou only need 3 billion a year to eliminate Georgia's income tax.\nIt's there.\nYou just have to put people over companies.\nSo you would agree with the data centers, cutting the breaks to tax breaks to data centers?\nThat absolutely needs to be tackled.\nYes.\nBecause they got a tax break that they didn't need.\nThey would be here anyway without it.\nSure.\nThat's their place is to look for tax expenditures in the budget.\nBut we are one, the 48 states do financial aid for needy students to go to college.\nIn Georgia, we spend 1% of our financial aid on needy students to go to college.\nSo there are needs that should be funded that are not in our current budget, that should\nbe there.\nAnd that's one example.\nOur foster child system is very, very challenged.\nMental health, we're not beginning to scratch the surface of funding the needs for mental\nhealth for both adults and for children.\nSo we hear this every year that the state doesn't have the money to pay for children and\nfamilies facing hunger.\nit just or to run humane state prisons where staff and inmates don't have their lives threatened\nand taken in that setting. And we do a bit but with the commitment needs to be much greater\ninstead of blowing a hole in our state budget because $20 billion is what we gather in\nsales tax.\nA few seconds to respond.\nYou've heard Senator Orok tell you about all the things that government does poorly.\nWhy would we want to throw more money into a whole of things that we've done poorly?\nWe're incredibly inefficient programs.\nAllow people to keep their own money.\nThey can afford their own power bill, their own gas bill, their own grocery bill.\nI'm going to bet on them.\nOkay.\nWell, people all over the state turned out some public service commissioners that because\nof high electricity costs, we're going to have to leave it like that.\nI appreciate both of you being here.\nThere's so much more to talk about.\nThere is indeed Donna and we appreciate the opportunity.\nWell, that does it for our today's show.\nTomorrow, Governor Brian Kemp gives his final state of the state address and will have\na special one-hour show that, with that address and the Democratic response, have a good evening.\n",
  "updated_at": "2026-02-12T11:01:54.230237+00:00"
}