{
  "video_id": "60iCQ1KE1sQ",
  "url": "https://youtu.be/60iCQ1KE1sQ?t=1504",
  "title": "Georgia House - Day 24 (2026-03-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 24,
  "video_date": "2026-03-04",
  "duration_minutes": 158,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on several bills, including HB 1 which aimed to protect free speech rights on public college and university campuses. There was debate around the need for the bill given existing constitutional protections, as well as concerns about potential incitement on campus. Other bills were also introduced and referred to committees.\n\n## Key Actions\n**HB 1**: Bill to protect free speech rights on public college/university campuses\n\n## Bills Introduced (First Reading)\n- Bill to amend regulations on hospitals and related institutions\n- Resolution condemning Russia's invasion of Ukraine\n\n## Notable Moments\n- Debate on HB 1, with discussion of existing constitutional protections and potential for campus disruption\n- Procedural motions to temporarily suspend rules to allow bills to be read and assigned to committees\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nNo quorum issues noted.\n\n## Adjournment\nThe transcript does not indicate when the session adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you the privilege resolutions. The chair here's none in the resolutions are adopted. What purpose does representative O'Neill rise? Neil. Sorry. Parliamentary inquiry. State your inquiry. I move that the rules be temporary suspended so the bill may be ran for the first time and assigned to committee. Okay, so you had a motion. A motion. All right. Representative Neil has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time in the committee. Is there objection? Is there objection? Chair here's none and it is so ordered regulated industries. What purpose does chairman LeHood rise? To make a motion. State your motion. Make a motion to house rules be suspended so that a bill can be read for the first time and assigned to committee. The chairman LeHood has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time and assigned to committee. The clerk will read the caption. A number of House bill to be entitled next to a men article on chapter 7 of the title 31 of the fiscal to George Anatetti relating regulations of hospitals and related institutions. All the gentlemen's motion that the rules of the House be temporarily suspended to allow a bill to be read for the first time and assigned to committee. Is there objection? Is there objection to chair here's none there and it is so ordered human relations and aging. What purpose does the majority leader of this House rise be recognized make a motion to state your motion. Let's speak. I move to the rules of this House be temporarily suspended so a bill can be read for the first time and assigned to committee. The majority leader has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time and assigned to committee. The clerk will read the caption. A number of House resolution by Ross and the seventh and others resolution condemning the invasion of Ukraine by the Russian Federation. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time and assigned to committee. Is there objection? I'm just making sure hearing.\n\nobjection. It is so ordered that bill resolution will be assigned to the rules committee. Going on down to the rules calendar, going back to the rules calendar. Clark will read the caption to House Bill 1. House Bill 1, my friends, the bonner of the 72nd and others to be entitled to an act to amend chapter 1, title 20 of fiscal to Georgia. It is entirely related to education generally. So it is required for public forums and public institutions of higher education and to prevent the creation of free speech zones at public institutions of higher education. This bill ever referred to the committee on higher education. It is recommended to this bill do pass by committee substitute. Chair recognizes representative bonner to present the bill. Thank you, Mr. Speaker. Good afternoon colleagues. Bringing House Bill 1. Hopefully, number 1 in your hearts as well. I will put you down as a maybe, a definite maybe. I was in Beverly. Thank you for that. In fact, I am glad you did that because this bill would specifically protect your outburst. Thank you. Thank you for helping out. Thank you. Thank you for helping out. Colleagues House Bill 1 will protect and clarify the first amendment rights our students and members of our campus community and public colleges and universities. The bill seeks to accomplish this in two ways. First, by protecting what students may say. Second, by protecting where they can exercise free speech. It protects what students can say by ensuring that public universities and colleges do not ban expressive activity while on campus. So long as their conduct is lawful and does not disrupt the functioning of that college or university. It protects where they can speak by banning so-called free speech zones or areas of campus that are designed for free speech rather than all of the commonly accessible areas of campus. It also clarifies that universities can impose published reasonable time, place, and manner restrictions on speech that are content neutral and not directed toward a specific community. This bill applies to, as I said, our public universities to include our universities and our technical colleges. There is a portion of the bill that does require training both for the students and members of the campus community as well as those administrators that have to essentially enforce these provisions and they're maintained in this bill a reporting requirement that has been in place by USG to report offenses over time. With that, Mr. Speaker, that is the bill. It's a simple bill and I would stand for any questions. Do you yield for questions? I do. Chair recognizes Representative McLeod to your left for a question. Does the gentleman yield? I do. Is it not true that the US Constitution already has a first amendment right? Yes, that is a good question. Thank you for that. In fact, I have a copy of the Constitution right here along with all the amendments and I'll tell you, and I'm glad you asked that question because what I wish we could do and what I could do today is to come and take this and set it in the well and say, this is what we'll do. This is what we'll abide by. But the fact of the matter is we have laws and have to pass laws to reinforce the rights that are granted to us by the Constitution. That's a gentleman for the year. I just want to let you know how to read the Constitution to become a citizen of these United States. We welcome you in Representative and we are glad you're here and I'm glad you're here to vote. Yes, I do have another question. Is there free speech zones in the state of Georgia? Are there free speech zones in the state of Georgia? Are you asking about on our universities or you ask about in the entire state? I'm sure there are. Are you sure they are? I'm sure there are. Yes. Can you identify? I'm standing in one right now. Thank you. The well is a free speech zone. Thank you. Thank you for the question. I'll yield for another question, Mr. Speaker. Chair recognizes Chairman Knight to your right for a question. This is gentleman Yield. I do. To the gentleman in regards to the last question, the Constitution, I thought the entire state of Georgia is a free speech zone. Is that not correct? That is correct. I'll take one more question, Mr. Speaker. Chair recognizes Representative Moore for a question. Good afternoon. Does the gentleman Yield? Yes, I do. Is it not true that these free speech zones on a college campus where we have young minds that are developing quite possibly could entail incitement on a campus? Say ask your question again, please. Is it possible that these young minds on a college campus in a free speech zone could potentially erupt into an incitement? So this bill does not allow anything that is currently unlawful to take place. Now, if the question is, will this encourage speech and debate on our college campus? I expect that it might. And I think that's something we certainly need to encourage. But it does not allow anything that would be considered unlawful to take place. With that, Mr. Speaker, I know there are others that want to speak to the bill, so I'll yield the well. We have members that want to be heard on the measure. Chair recognizes Representative Wolenski to speak to the bill. Thank you, Speaker. Today, I speak against House Bill 1. We had earlier the school bill dealing with safety that we heard and this bill is about safety of schools. It's about safety of our students. And this bill, unfortunately, makes it harder for schools to protect their students. It makes it harder for schools to create and keep a safe environment for their students. It's undeniable that this bill will make it hard to limit the location and control of where people can speak. Now, this bill doesn't just talk about students. Online 24, when it defines campus community, it says, administrators, faculty, and staff at the Public Institute of Higher Education, most importantly, and their guests. That's the most concerning part for me, guests. That means that any person can invite somebody on the property and they get the same rights here as a teacher. So what are the unintended consequences of this bill? Well, for our schools, it will cost them more. It will increase the school's budget. It will increase specifically the school's public safety budget because right now, they get to control this speech and where people can speak. And that's good that they can do that. And we as citizens have a right to question when schools do and don't allow people to speak, but you know why those schools are doing that? To protect their students and let the teachers teach. Now, if we pass this bill, the schools won't be able to control who and how, I understand there's good speakers, but there are extremist speakers. And how those extremist people speak on their campuses. Schools will not be able to control that. Schools will now have to be forced to have a budget to prepare for speakers to speak at any time, anywhere. But also not just about when the speakers are speaking, but after that, the increase in hate and harassment that will occur on campuses from those speakers, they'll have to prepare for that. Also, we've seen specifically on college campuses for people of my community of the Jewish faith, the amount of anti-Semitism on the rise. And when people speak and all of the things the schools have to do, well, that's very concerning here with this bill. So from a cost standpoint, this will hurt the school system. It will increase harassment hate. And today, I believe in this at some point, we're going to have the divisive concepts bill. So my question is, where should complex and difficult concepts be taught? Well, I think it should be taught in school by teachers, in a classroom that's controlled environment where students can feel comfortable to learn and ask questions. But where should it not be by invited guests on college campuses who get to say whatever they want? That's not who should be teaching. So today, I asked that you vote no to house bill one, especially if you feel the need to vote on the divisive concepts, because they are actually going directly against each other. I think that the schools here in the state of Georgia are college campuses, we're seeing a rise of anti-Semitism, xenophobia, racism. We should allow those schools to make a security for their students decision of who can speak just like they have been. And you know what, if we want teachers to teach things and have control environment, then they should do that as well. And we can teach our kids outside of school. Thank you, Speaker, for my time. I yield the well. Chair recognizes his representative dryer to speak to the bill. Thank you, Mr. Speaker. I rise in opposition to house bill one. I want to be really clear first. This is not a free speech initiative, and I'll tell you why. It's also ironic and unusual that we're advancing a purported free speech bill for colleges and universities while, in a few moments, we're going to address censoring speech in middle and high schools. How can we do both of those things? And if you look at it really closely, you're going to see a common thread between both of them. Let's start with where HB1 was, and I want to give the committee and the chair credit for moving this bill a long way from where it started. But I want to say without exaggeration, when this bill started, it would have required taxpayers and the university's system of Georgia to fund racist student organizations. I'm not kidding. I'm not exaggerating. There's a national dark money group that has been advancing these bills throughout the country. Two years ago, I asked their general counsel at the committee meeting. I want to be, and I said, I want to be really clear, if there is a student group that bans members from interracial dating, you're telling me the university system still has to fund those groups. And the answer was yes. The answer first was yes. There was a few talking around, but eventually we got to the yes. And when this bill came back, this legislative session, that's the first question I ask, and that was still the case. And that's just one example of the racist student groups that the university system would have been required to fund. And I tell you, that's going to cost us national federal dollars, but it's going to humiliate us. It's going to undo the work of decades of people that have tried to build up the university system of Georgia. And it would have been immoral on top of it. So that provision is stripped out, but I want to tell you that's where this comes from. And it comes from a myth that conservatives are being discriminated against on college campuses, which we heard over and over again at the committee hearing. But every single incident that was addressed at the committee hearing had been properly resolved by the university system of Georgia. There was one case that didn't get quite properly resolved, even though USG quickly changed the policy to address the concern, but the plaintiff still took that case all the way to Supreme Court and they did it because they had to do it to get their attorneys to these out of the case because they wanted to win, which entitled them to judgment. But there were no dollar damages against the university system of Georgia because they promptly changed it. So when we start to look at the motives of the two bills that we're going to be debating this afternoon, we start to see what's really happening. On college campuses, conservatives, and let's be real, we're talking mostly about white men, are not being discriminated against. I think that's fair to say white men on college campuses are not being discriminated against. But what we're doing on the other hand is we're prohibiting conversations about diversity and inclusion in middle and high school and we're prohibiting folks in middle and high schools to saying that we're not a meritocracy and we're prohibiting people from saying that some people start out in different places in life and some people have different challenges. And I wish that wasn't the case. If that wasn't the case, I would get out of public service and I would go do other things with my life. But that is my mission, that is why I'm in public service and that's why I'm down here fighting. Okay? If you are born in South Atlanta in a poor neighborhood and you're black and brown, you have a 4% chance of ever making $70,000 a year or more. That's not a meritocracy and that is not a quality of opportunity in our country and that is connected to the history of slavery and racism in this country. It is undeniable. But if we can't teach middle school students that, if we can't teach high school students that, if we can't admit that to ourselves, we can't address the problem. And if you want to fix a problem, you've got to admit it. You've got to look in the mirror and say we have a problem and we've got to correct it. But we're not doing that. Instead, we have created a myth that conservatives are being discriminated against on college campuses. But there are costs to this bill. Even though this bill changes practically nothing with the policies at the University System of Georgia because the University System of Georgia is following the first amendment and when they haven't, they've been litigated against. And I'll say this, I found multiple first amendment cases against the state of Georgia. I currently have one pending in the Northern District of Georgia and the Georgia Supreme Court right now. I believe in the first amendment. But that is not what this is about. And we've heard testimony at the committee hearing that individuals felt threatened by some extremist speakers on college campuses and extremist groups on college campuses. They felt threatened multiple people. Now again, the chair added a couple lines to address that to some degree. But what we're left with is a bill that we don't need. We have a bill that is supported by national, dark money groups creating a myth to excuse behavior. If we don't have to address racism, I bet a lot of people would sleep better at night, but we're not going to be able to make a difference about it. So let's just call this what it is. It's an unnecessary bill to excuse some people feeling bad about what's actually happening in our country. And that if you were born black and brown, especially in a poor community, you don't have the same opportunities other people. And instead of running from that and excusing that and trying to make ourselves feel better at night, we could probably make a little progress on it if we address that. And I'll be voting no on this bill. Thank you, Mr. Speaker. I yield the well. Okay, we have other members that wish to speak on the measure. Chair recognizes representative Earhart to speak. Thank you, Mr. Speaker, ladies and gentlemen. With all due respect to my colleague who just spoke, I two things in particular stood out to me. Both of them, I believe, incorrect. One, that this is not a free speech bill, which it most certainly is. And two, these types of repression of free speech that that's not occurring on college campuses today. Again, it most certainly is. Free expression of thought is not fairing so well on American college campuses these days. In some places, the problem is students and in some cases, faculty taking grave offense at opinions that merit only minor umbridge or not at all. In other places, it's official speech codes. That's a thing. Or designated speech zones that essentially throw a wet blanket on the concept of open discussion that should be a hallmark of higher education. In other situations, its students or administrators so intent on preventing offense that they simply avoid all discussion of issues related to sensitive topics. There's a lot to be said for mapping people aware of the ways in which their words and deeds can do harm. No one wants to go back to the days when casual expressions of racial prejudice were common or when women were mocked for taking their place or taking the place that should have gone to men. I have four grown children. All four of them graduated from Georgia Public Universities. Two from UGA, one from Georgia College and State University, one from Georgia Tech. We had lots of discussions before they left home heading off to begin their freshman year of college. I fulfilled, I think, my maternal obligation to encourage them and to warn them about both the opportunities and the pitfalls that come with living away from home for the first time. We discussed how to stay safe on campus, time management and balancing studying with social time. Good eating habits. It's not easy. How to get along with roommates, the inevitable lore of the parting and drinking culture and how to handle that responsibly. I thought I'd covered everything. But some things never occurred to me at that time. For example, that I would have to advise my kids that once on campus the availability of locations where they could exercise their first amendment rights might just diminish. And in some cases, dramatically so. It never occurred to me to prepare them that when, where and how their speech was expressed could potentially be restricted by school administrators using subjective criteria in violation of the Constitution. When I encouraged them to get involved in campus activities and clubs, it never occurred to me to for warn them that depending on the ideology of the club they join, they might find themselves facing challenges with access to meeting rooms, resources and faculty advisors. Folks, I support this bill and I encourage you to do the same because we must all ensure that the ability of our students to engage in free speech on our Georgia campuses, college campuses is not suppressed, not directly or indirectly. It is crucial, please hear me, that we never shield our students, causing them to lose those precious, spontaneous and open interactions that they need, that they require to understand the world and the society in which they live. An education that spares students from unwanted challenges to their thinking is not much of a higher education and it most certainly does not prepare them for life in the real world outside the college campus. Thank you so much for the time and I encourage you to vote yes on HB1. Mr. Speaker, I yield the well. Chair recognizes representative Brad Thomas to speak to the bill. Thank you, Mr. Speaker. Today I rise in support of HB1, the Forum Act, the spill defends the very heart of American beliefs and that begins with free speech. Our first amendment right. Free speech should not be limited to free speech zones, free speech should be everywhere. Does any member of this body truly believe it's okay to say to a college student? You can express your beliefs in this area during this time, otherwise you're limited to whatever our approved language is. I felt colleagues, that's called indoctrination and fundamentally against the university experience. Much like this body, we're a body of debate. We should challenge, we should challenge our next generation debate ideas as well. Even I believe some people may find uncomfortable because that's how we work together and that's how we learn from one another. Forming open and robust university minds, it supports that cause. Now are there some in here that we've heard what concerns that allow free speech across our university campuses? It's going to create a hostile environment. If I could just digress for just a moment, on the seal of Georgia it has something doing what I do for a living. I try to always evaluate things, find moderation, see what makes sense, see what doesn't, find parity and balance. And I believe that HB1, it supports that core value. It does it by ensuring that any illegal activity or criminal activity is not protected. It does so by not protecting certain speech that may be unlawful. In conclusion, we should protect our civil liberties of our students by supporting substantive debate on our campuses. And this bill does that in such a way that it doesn't, without incitement or harassment. So I will be voting yes for HB1 and thank you for your time with that Mr. Speaker. I yield. Gentlemen is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a minority report and the chairman's time. 20 minutes each by rule. The chair recognizes for the minority report. Representative Jasmine Clark. Thank you Mr. Speaker. Today I rise to ask you to vote no on this bill. The sponsor of the bill did a good job of stating that the intentions of this bill is to protect what students, students can say and where students can speak. What he failed to mention is that it provides a definition for campus community which includes students, administrators, faculty, staff, and their invited guests. Nothing indicates that these guests must be on campus through any official invitation process. So a student simply stating hey that guy is cool he is with me. It is technically enough as this bill is written. So any person who steps foot on campus property now becomes a member of the campus community as long as one student is willing to vouch for them. So now that we have elevated guests to the campus to full blown members of campus on the same levels as enrolled tuition paying students. We are now granting them unrestricted access to all public areas of campus and unrestricted access to the tuition paying enrolled students within those spaces. Now security issues aside. There once they are in these spaces they can protest, distribute materials, carry signs and more. So basically your standard run of the mill free speech stuff. I actually don't really have a problem with that. As my colleagues have mentioned however the types of things that they can hand out are things that could be considered hate speech. The other things that they now have unrestricted access to talk about or hand out are things related to CRT or what you all like to call divisive concepts. This bill then goes on to state that these enrolled students who may oppose the views of these now new members of our campus community cannot materially or substantially disrupt this new member of their campus community except they can disrupt. The line between materially and substantial disruption and permitted disruption however gets a little fuzzy. For example you can't make loud and sustained noise but you can disrupt as long as it's minor or brief. So then my question is who decides what's minor? Who decides what volume is loud? Is the person who is doing the disrupting? Do they get to decide? Is the person being disrupted? Do they get to decide? Does the university get to decide? How long is brief? I think we can all agree that if you ask every member in this chamber their definition of brief we would get very different answers. So if these things mean different things to different people then how can we ensure that this law will be applied uniformly and objectively across the board? How can we protect our universities from being sued because of unequal application of this law when it comes to the right to counter-approval?\n\nTest. See, ladies and gentlemen, the rights of free speech isn't for the person who wants to speak. It's also a right for the person who wants to counter that speech. Look, the irony of today is definitely not lost on me. As my colleagues have already mentioned, today you will also vote on a bill that limits the speech of our teachers in the K-12 system by banning them from teaching divisive concepts. So now you are being asked in this bill to give individuals who do not pay tuition, who are not affiliated with the college, unrestricted access to teach those divisive concepts to the students. Some of them still in high school because we do have dual enrollment students on our campuses as they make their way to class. So in effect, if you find yourself voting yes to HB 1084 today and voting yes to this bill, then that is a vote to be anti-CRT in the K-12 sheets, worksheets, and pro CRT in the college campus streets. Thank you, Mr. Speaker, I yield the well. Chair recognizes representative Drenner for the balance of the minority report. Thank you, Mr. Speaker. I rise today in opposition for against HB 1 and I'm not talking to any of you here just so you know because I know that what I'm going to say is not going to change any of your minds. As a college professor, I am talking to my students right now and I want to make sure that my students understand why I oppose this bill. I've been a college professor for 10 years. I teach graduate studies in the Masters of Public Administration program. For the last five years, I have written three books on legislative decision making and these topics that we are talking about today. Now I'm not running for anything, Mr. Speaker, but I did want to prop up my book sales. Not really. I have spent probably more time than anybody in here researching these types of measures. They began in 2015 when same-sex marriage was legalized. Religious freedom bills popped up all across the country. Everywhere I looked through over 2000 bills. I did a deep dive and who were the people that introduced those bills? Who were they? Who were the people that not only introduced them, but what was their religious affiliation? What was their partisan affiliation? What gender were they? That's a teaser to buy the book by the way. I wasn't surprised, right? Because I know I've been in this body for 22 years. I know where these bills come from. And you know what? Believe it or not, I support that. I support your belief in the Almighty. I don't, however, support in discrimination. And that is what is at the heart of this bill. This bill has some serious conceptual flaws in that it implicitly disguises ideological censorship. It depicts it as protecting not infringing on the protection of speech. The fact that the legislature is purporting to protect students should send the obvious message that the state is favoring or disfavor the expression of these perspectives. In my classes, you know what? I encourage people to think beyond their biases. I encourage people to use academic rigor. These are textbooks. They have been peer reviewed. My methods of analysis are sound. I didn't just editorialize my conclusions. HB1 has a savings clause in it that purportedly limits the scope of the bill to better comport with the Constitution. These provisions that are in lines 84 through 87 state that nothing in the law should be construed to conflict with the protections of the First Amendment. These clauses should be best understood as attempts to conceal or get around the fact that this proposal will foreseeably silence speech. This is really the legislative equivalent of painting a happy face on a sad clown. They do not change the underlying nature of the thing but only help to cover it up. The Forum Act has a chilling effect on the important protections George's public colleges and universities have to bar discrimination. Personally, I support protecting free speech no matter how offensive it is. But I don't support this bill and I would ask you to vote no. Thank you, Mr. Speaker. I yield the well. I complete some minority report. We're going out of the chairman's time. The Chair recognizes the Chair of the Higher Education Committee, Chairman Martin. I couldn't resist the chairman England's not over there but I thought I'd bring a little water and we're speaker this might take a minute. I want to talk about what the bill does and what the bill doesn't do because we had a lot of people up here today that talked about the bear in the woods. The thing that's unforeseen, they seem to be able to look into everybody's heart and they see something out there that's just quite frankly not in the bill. When the bill was originally introduced, it did have language that talked about organizations that would exist because free speech and free ideas are allowed and how members of the organization would be selected. That was just a place that our committee felt like we didn't have enough information to discern how the university system should deal with that. But allow me to point out a couple of things in the bill that I feel like are very important. We heard about the unrestricted areas of campus unrestricted access. There is defined in the bill on line 54. Unrestricted outdoor areas of the campus means an outdoor area. This generally accessible, I'm not reading this word for word, you have the bill at your desk. Including but not limited to areas, walkways, common areas and does not include. So that's what it defines. Then it goes on and says one of the gentlemen earlier talked about things that it was making it harder to have people to speak. It talks about public institutions, that's TCSG or the university system of Georgia, may maintain and enforce reasonable time place and manner restrictions on the campus, narrowly tailored to service that. Let me say again, public institutions of higher education may maintain and enforce reasonable time place and manner restrictions for the campus community, narrowly tailored in the service of significant institutional interest as long as doing so is viewpoint neutral. So this idea that you can't have any restriction on where a group a faculty member or a student or an invited guest can speak is not in the bill. It's simply not in the bill. We heard another gentleman talk about it and we did have testimony from some students that said that they were harassed on campus. I followed up with that. That was a serious, that was serious to me, with or without this bill that our students were harassed on campus. In each case in which we followed up, there had been no reports on campus and the activities that were related to the committee, I am told, by the system office, would have been against the campus conduct, code of conduct, whether without this bill, whether the folks as it was depicted of us following someone and harassing them verbally, whether they opened their mouth or not, as was depicted to our committee. That is unlawful on campus today by the campus code of conduct today and most likely against state law. So don't mistake this bill for allowing any of that activity to happen. It shouldn't happen today under current law and there's certainly nothing in HB1 to allow that to happen. I'll draw your attention to lines 46-47 that explicitly talks about student-owned student harassment and further defines in the bill that that is not allowed and if conduct and expression rises to that point, it can be stopped. There was also a mingling of ideas here of somehow this bill to be confused with the bill will have later. Most of y'all know that I enjoy athletics. I think our young people learn a lot from athletics at whatever age they're in. As we used to coach football, we used to kind of laugh from time to time about 10-year-olds out there playing football and there would always be one coach that wanted to, you'd have a 35-year-old man out there that wanted to match wits with a 10-year-old quarterback and out-caller's defense. That's not really right. So don't confuse the issue of open dialogue on a college campus with what maybe talked about next of teachers and divisive concepts at middle school because that's like a 40-year-old doing a debate with a 8-10 or 12-year-old. We're talking about allowing for the most part grown adults to enter into conversations for a free and full exchange of ideas. So don't be confused with that. There was something mentioned about this would allow hate speech. As I stand here before you today, our Constitution allows hate speech. I don't like it. I think you Mr. Lear, you don't like it either. But what this bill does is it says if that rises to a level to be disruptive in our college communities, they can put a stop to it. To the level that they do not friend, in friends on the First Amendment. The lady immediately before me that talked about some clause in relation to the First Amendment that I hadn't heard of today. But I do know this that we have to recognize the First Amendment. And we can't put anything in this law that infringes upon it. So any reference to allowing activities and speech that are allowed in the First Amendment is I believe what some of my legal friends would call the Belt and Suspenders approach. It's not allowing people to do anything they can't do already. Ladies and gentlemen, I would just ask you to read the bill. It was introduced. It was quite a bit longer than this. It was much more complicated than this. And what we've done is it's simply made this a level playing field. If you're part of the campus community as long as you're not disrupting the educational process, you can have an event in an area that's been selected on the campus by a reasonable time manner as it's defined and you can have a spontaneous activity anywhere you would go. And I would say this, this takes away sections of the bill that did focus on free speech zones. And I, for one, am very disappointed that we had a time in Georgia where our college campus is limited where you could speak. Think about that for a minute. Think about for just one minute if you had to go on a campus and you had to stand in this circle, how much of a cooling sensation would that be on your right to speak that you had to go to a particular place? So this does away with that. I want to close and yield the rest of the time to the author of the bill and thank him for working with us. I want to thank the university system and TCSG for working with us. And I want to assure you that in that work with us, we developed a piece of legislation that will not put the university system or our technical college system in any type of jeopardy for funding that's very clear and a piece of legislation that they can work with. And I believe will improve access and conversations on campus. And the one thing we need in our country today is open, fair, and honest dialogue without bias toward one group or another. With that, Mr. Speaker, I would yield the rest of the time to the author of the bill, Governor's floor later. Chair recognizes representative Bonner for the remainder of the chairman's time. Thank you, Mr. Speaker. And I'll be brief. First of all, to my colleagues that spoke against the bill, I thank you. I thank you for your comments. In particular, my friends from the 59th, the 85th, and the 108th, I appreciate your comments. We've had many conversations. And I will say to my former office mate, she is an exceptional writer and everyone should buy her books. But what we saw here today, to me, certainly highlights that need for free speech. And frankly, I wish we didn't have to bring a bill like this before the legislature. But unfortunately, there are times when we must reinforce through state law those rights that we know exist. Right now, it's essentially governed by a rule of the USG. And we say they adjust those rules. Well, they do. They're good about adjusting those rules up until another court case comes up. Then they've got to adjust them again. So a question I would ask is how many more court cases do we need? Because keep in mind that every time the university system defends themselves, every time that they settle a case, like they did in Georgia Tech and students for life versus the state, they settled for $50,000. And I'll tell you, do you know where that $50,000 came from? That came from me and that came from you. Because that's taxpayer money. So unfortunately, there are times when we have to do that. There was a lot of talk about the speech and the types of speech. And what I basically took some notes on is that essentially what I was hearing is there's their speech that we simply don't like. But I'll just tell you the cure to overcoming bad ideas is not to limit speech, but it's to increase the amount of speech. Because if your idea is better than my idea, then we need to debate that in the arena and let the best idea win. At the end of the day, my friends, this is a simple bill. Simply says that all will be treated the same and that all will play by the same rules. So with that colleagues, I would urge your favorable consideration for House Bill 1. Thank you. I yield the well. Is there any objection to adopting the committee substitute? The Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 1? Will vote aye? Those opposed will vote no and the clerk will unlock the machines. What purpose does Chairman work, has there arise? Parliamentary inquiry? There's a not true that every day in rules, there's a motion made and then carried the limited debate for an hour. Is there ever been any consideration or discussion that might want to look at 10 minutes or so? You get no objection from the Chair. I'll tell you that. All right, we're going to do one more parliamentary inquiry. What purpose does Representative Wolensky rise? Parliamentary inquiry? They do inquiry. Is it not true that we would never allow random visitors to visit the UGA football team to protect their mental health and keep them focused on the game. But in this bill today, we're about random visitors to come to campuses and not giving the same protection to the students. I'm not sure I understood your inquiry, but if you're defending the integrity of our football program, then the answer is yes. All right, have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1. The eyes are 93. The nays are 62. This bill having received the requisite constitutional majority is therefore passed. What purpose is Representative Cannon rise? To make a motion. What's your motion? I'd like to move this be reconsidered on the next legislative day. You are serving notice that you're going to ask that this vote be reconsidered. Correct. Okay, lady has that right. We'll take it up on Tuesday. We'll take the motion up. The clerk will read the caption to House Bill 1084. House Bill 1084, where I'm saying the weight of the ninth and others to be entitled to an act to amend and title 20, the physical of Georgia and tentative related and education so to prevent the use of and reliance upon curricula or training programs which act upon promote or encourage certain concepts with exception to this bill ever referred to the committee on education. That committee recommends that this bill do pass by committee substitute. Chair recognizes Representative Wade to present the bill. Good afternoon colleagues. Thank you Speaker. I am here to present a bill House Bill 1084. It's called the Protecting Students First Act. And if I could have everyone's attention, I really want to remind us of how we started our day. When our chaplain discussed the concept of unity. And I understand that there are people that have varying opinions on this bill. And I even appreciate a colleague earlier sharing concerns about my bill when speaking against a different bill. But I really want us to have a conversation about what this bill does. What this bill does not do. And I hope that you'll listen intently and keep the children of this state at the center of this conversation. In recent months, national attention is focused on public education as well as educational trainings including some divisive concepts. Including racial discrimination. That's racial discrimination against all races. That's about stereotyping and scapegoating different students. This currently is happening rarely in Georgia. But it's happening. And I believe we must do something to be proactive to prevent it. I don't believe that we need to teach young students that an individual's moral character is based on their race. Or that the United States is fundamentally racist. Or that an individual bears responsibility for the past actions of others of the same race. It runs counter to the core belief that all human beings are created equal regardless of race or their ethnicity or their sex. It also sets back decades of progress made since Dr. King and many others dreamed that men and women would not be judged by the colors of their skin but by the content of their character. HB-1084 seeks to address the teaching of a very limited number of specific divisive concepts while also providing a recourse for concerned families ensuring their voices are heard and legitimate, realistic complaints are investigated and a discussion and a process are handled first at the local school system. And if needed, I actually first at the local school and then if needed at the local school system. And then the worst case scenario is potentially going on to the state board. This bill is focused on protecting students from the far radical ideologies that the media promulgates from I believe the loudest and sometimes the most unthoughtful sides of our parties. The classroom is dealing with children and students that are not adults. The last bill that was presented was discussing adults. Violence, by and large, mostly 18 year olds and above. Occasionally through dual enrollment, there are some students that are 17. Now I agree with that. But ultimately, I believe that we need to focus on what the language of the bill says. If you look at page two of the bill, we've outlined nine divisive concepts. This is so that teachers don't teach these specific things and only these specific things. I've also ensured that we listen to and we worked with associations like the Georgia School Board Association, GSSA, Gail, GIE, the Anti-Defamation League and even the ACLU. We went through a thoughtful process of hearing their concerns about how to address what I believe is a very important conversation for us to have. And that has to support teachers and parents and students all equally when there are difficult and confusing situations that happen, especially during the development of the children of this state. This legislation is not going to touch funds of schools. This legislation is not going to prevent the teaching of divisive concept as you have heard today. It's not going to change anything within the Georgia standards. At some point during this debate, you're going to receive a copy of the Georgia standards. The Education Committee members had an opportunity to receive the Georgia standards relating to the history of slavery, the history of racial discrimination from the onset of this nation, as well as other nations in this world. Whether it be United States history, world history, or Georgia history, this bill will not change one Georgia standard at all. It is limited to the nine divisive concepts. And I will share that when we went through this, I had a really great conversation with folks that were not in my party that were on the other side of the minority. And they shared their thoughts and concerns. I've not had a member come to me and tell me that they had any major concern with any of the divisive concepts outlined. I had a couple of members said that they thought line 30 was up for debate. And I believe there's a distinction between is and was. And we had that debate in committee. And I'll respect those members that think that that way. But ultimately, my goal as a legislator is to represent all students. And what is in the best interest of all students? Not trying to appease the loudest voices of those who may be the most angry. This bill will ensure that a process happens locally. This bill will support teachers and parents with a thoughtful, meaningful way to address when an issue arises around racial discrimination. This will benefit all students. This will benefit students in North Georgia, in South Georgia, in Metro Atlanta, in urban centers, and the ruralest part of this state. I really appreciate the opportunity to have worked on this bill because I truly believe in something that was instilled in me by my father and my mother who were both educators. They spent their entire career teaching children, young and old, middle school, elementary and even high school. I was a school board member for 15 years for the school system that I was a product of. I understand.\n\nthat we have issues related to barriers, to situations where people all start out in a different manner. Poverty is a major issue that is affected this state. That's affected all races. And I think that we need to ensure that rigorous instruction continues. If you'll note lines 81 through 100, we ensure that every teacher will continue to be supported in teaching the history, their courses in a rigorous, academically professional manner. But folks, this state went through a process of ensuring that we do not proclatize our faith in the classroom. And that was a hard process to go through as a state. But teachers adjusted. They understood that it wasn't appropriate for them to indoctrinate a student based on their individual faith belief system. I look at the world today and I see the political polarization that we have. And there is a distinction between K-12 and how we approach history and then how we allow younger adults in a college setting to have the freedom of speech to discuss those things. But folks, we have to come together as a nation. Look at the world around us. I shared this statistic. And I'm almost finished with my open remarks, but this is important to me and I hope it's important to you. There are over 40 million, 300,000 human beings who are living in modern day slavery on this planet. It has gone unaddressed because there's a lot of places in the world that aren't like America, that know how to face where we've been. Are we where we need to be? No. I know that. But before my dad passed on March 11th of 2021, he instilled in me a desire that he had as a student and as a young person who grew up in a little town called Leslie, Georgia, Sumter County. He grew up as a sharecropper. He lived in a dirt floor, one room place. His dad died as a crop duster when he was less than two years old. He learned to live with people who didn't look like him. He, through his faith, learned that we were all created equal. When, as he told the story to my brother and I, when he made big time and was accepted to a fellowship at LaGrange College, through a church foundation that, and his words was, they felt so sorry for me, they wanted me to see what a bigger town looked like. And he was pretty good at reading. He got to go to college. And he started experiencing that people started judging people based on the color of their skin and not the content of the character or the opportunity that they possess in their human race status. My dad taught me, son, if you have an opportunity, you always need to feed love and starve hate. This Bill's aim is to prevent the radical ideologies of our national media to interject themselves through individual teachers profilitizing their personal political beliefs. The best teachers that I had, even the best professors I had in college, I didn't know how they voted, I didn't know their political affiliation. We definitely don't need fifth graders in classrooms in which the teacher's political registry is known. This Bill, I believe, goes a long way to address those issues, and I appreciate everyone who's provided feedback. And I know that there's going to be some folks that vote no against this, because there's a political season. What I've tried to do with this Bill is to address the concerns of parents that have called me, of teachers that have called me, school board members, family members that believe that we can be a United States and that we have an opportunity. To continue in the pursuit of the most precious dream, which was MLKs, and that's to end racism. That's my aim, that's my heart. Are we perfect? No. But those nine items, look at those divisive concepts that are outlined. Line's 26 on page two, read them. We can debate if you think fully that one of those should be taught, that those should be taught to students. I'll accept your opinion, you as American have that right. But I believe in a K-12 setting, that those have been carefully considered, and I appreciate your favoral consideration on this bill, and I would yield for any questions. You have a fair number of questions. I'll yield for a couple of questions. Let's see here. Chair recognizes representative Hutchinson. Do you arrive for a question? Thank you, Mr. Speaker. Does the gentleman yield? I certainly do. Can you, can my seat meet, give me an example of any curricula in Georgia that includes, that is taught that an individual's moral character is inherently determined by his or her race? So the goal of the legislation is to ensure that that's not taught. And I was given about seven examples, two of which happened in Georgia schools that I shared with our education committee that would fall into that category for a local school system, for a parent and a school teacher and a student to sit down and determine if that teacher's behavior, and even in some cases if the student's behavior related to that issue was appropriate. So it doesn't happen often, but my goal is to make sure that it doesn't happen. This is gentlemen for the yield. I certainly do. Can you give me an example of any Georgia curricula that claims that an individual of a particular race consciously and by virtue of his or her race is inherently racist, or is inherently inclined to oppress individuals of other races? Thankfully in our Georgia standards, that does not exist. Thank you. Thank you. You further yield. This will be my last, yes sir. Chair recognizes representative Brad Thomas, do you write for a question? Thank you, Representative Wade, do you yield? I do from my friend, yes sir. Is it not true that in Gwinnett County, the school board chair has got several videos on TikTok stating comments such as that people have privileged just because of the color of their skin, that they are inherently racist or socialized racists, and furthermore has also gone on record as saying that people with black and brown colored skin have advantages that white people do not have. I believe the gentleman is sharing information that is provided to us in our committee, and I believe he what he states is true. Thank you, Mr. Wade. Thank you. Mr. Speaker, I appreciate the conversation. I think there's other folks that want to speak to this bill, and at this time I will yield the will. Chair, there are a few others that wish to be heard. Chair Reminder that 30 minutes of debate, and that can be allocated that your discretion amongst all the speakers. Chair recognizes representative Eric Atomis to speak to the bill. Thank you, Mr. Chair. Today I see that we may need some waking up and a little bit of livelihood, so I say that we open up my speech as if we are in a classroom. So I have a question. What is the Georgia motto? It's wisdom, justice, and moderation. So let's talk about wisdom. How can we believe to instill wisdom in our KTL students without giving them knowledge? How can we instill wisdom without telling them American history? How can we say that our Georgia motto is justice without teaching them about justice in the state of Georgia? How can we stand here and vote for the Citizens' Arrests Bill and not talk about how the justice system failed a mod obry? And not tell the full story of how it took 74 days for the murderers of a mod obry to be arrested. That's history. And how can we stand here and compare slavery to things that didn't happen to our counterparts? It's a question that I have and it is a question that my constituents have. So let's go back to the justice system. The justice system is something that we do study in school. And again, it was not created for us when I say people of color or by us. Again, I say 74 days was how long they covered up the murder of a mod obry. And it took the NAACP, it took protesters, and it even took one of our allies here representative Al Williams, fighting to make sure that the justice system as we see it and as we teach it stands for us. And it's uncomfortable. And everybody's talking about the words critical and divisive. We're using all these languages and our children are feeling uncomfortable. Yes, it is uncomfortable for your counterparts to hear about slavery. But it's also uncomfortable for people of color to hear about slavery. It's uncomfortable to hear about stories of when our people were enslaved and their child turned 10 and they were snatched away from them to be sold for $1. It is uncomfortable to hear about when a slave heard that his wife was being raped by the master that guess what? He was beaten to a pulp. That's uncomfortable. And it's not just uncomfortable for one side of the owl and it's not just uncomfortable for the other side of the owl. But guess what? When do we stop being uncomfortable and when you're uncomfortable you start to grow? And how can we talk about our future if we can't teach kids about our past? It's uncomfortable. It's divisive. It's critical. But it is American history. Let me tell you what else is uncomfortable. Putting your kindergartener on the bus for the first time and seeing them way that you as they leave, that's uncomfortable. Writing a bike for the first time and falling ten times off the bike until you figure it out, that's uncomfortable. Hey, when you have a smart student that skips the second grade all the way to the fifth grade and doesn't know anything about fifth graders or how they will respond to them, that's uncomfortable. But we do all of those things to grow. I'm not going to tell you long in my classroom today. But I do want to end with this. It's not just about black history being uncomfortable and teaching black history. Because that's not what we're going to do. We're not going to do that today. It's also about Native American history and how villagers were burned at a stake while they were sleeped just so someone else could take their property. That's American history. Slavery is American history. And if we want to say who can teach it, how they teach it, so they don't make us feel uncomfortable, this is what I say to them. You either teach all of history or don't teach it at all. I yield the well. Chair recognizes representative Becky Evans to speak to the bill. Thank you, Mr. Speaker. Hello, colleagues. Good afternoon. It's been very interesting. All our conversations this afternoon talking about First Amendment rights and free speech. I want to say I highly respect the Bill's sponsor, Representative Wade. And I recognize that he's made many edits to this bill in response to feedback. However, House Bill 1084 remains highly problematic and I am speaking an opposition to the bill. I especially find it troubling and ironic and frustrating that this body slipped in a vote yesterday in House Bill 517 that doubles the 100 million diverted from the general fund annually in the form of tax credit for private schools to 200 million in five years. These private schools will not be held accountable to these laws we've been talking about today while we add administrative burdens unnecessary burdens on our public school teachers and leadership. I've been listening to teachers and students in our community and my community especially let teachers teach and let students learn hands off our education, trust our teachers. Over 200 thoughtful, energetic and democracy-loving young people from my community gathered here at Liberty Plaza last week. I share their concerns that this bill will rob young people of an inclusive education and suppress speech about race and racism. Classroom censorship bills about race and racism like House Bill 1084 are at the cross section of racial justice and the First Amendment. Our students have and I think we've been talking about this today a First Amendment right to hear accurate information in our schools. I'm especially concerned about how this bill could affect crucial conversations between students and teachers about our recent history and current events. I remember watching the budget appropriations hearings and Senator Blake Tillery made a point to the USG president. We need to teach our students to be critical thinkers. If this law is passed will our teachers shy away from asking hard questions that they know will challenge their students? In referring to lines 38 and 39 in the bill and this is something I read as I asked in committee. That's where it says students shouldn't feel anguish or psychological distress because of their race. Of course we agreed no teacher should ever teach that. However I am concerned that we're a student upon learning some of our hard history such as Rosa Parks and the Bus Boycott as representative Wade talked about with his daughter. Lynchings of blacks in the Jim Crow South are in term of Japanese Americans during World War II that a student may feel anguish or psychological distress because they're human and have empathy and they have emotions. And most people those of us in this room would be like representative Wade and have that hard conversation with their children about discrimination in America. But a family member who holds prejudices may resent their child feeling those emotions and alleged that the teacher made the child feel that way. How does the teacher defend himself for herself? I'm concerned that this law may create an atmosphere or lead to an atmosphere of distress. Do we need to get body cameras on all our teachers to defend themselves? And along the same line how do we prevent multiple inaccurate allegations that an educator has taught a prohibited concept particularly those that teach history, economics or other subjects within the social sciences that cover race, race inequities, discriminatory laws and policies and other topics that are controversial. And how do we monitor the effects on teacher retention? I'm thinking of a cautionary tale of a teacher Matthew Hahn, a teacher whose white from Kingsport Tennessee with 16 years experience who in his contemporary issues class exposed to students to the concept of white privilege and he was fired for it. During the school board hearing several of his former students came to speak upon his behalf and one Christian Thomas said I quote, before meeting Hahn I don't know if I could have been the type of guy to listen to other people's arguments or see from their point of view. And let's listen to the voices of students like Katie Gunther, one of the Decatur students who spoke at the rally. If this bill passes teachers and students would live in fear of saying the wrong things, stymying, free thought and new ideas, the kind of discussion that prepares us for the real world by learning about our past and our present in each other just wouldn't exist in Georgia. All the while students who will suffer the most from the bill from these bills would be trapped in public schools that refuse to teach them anything but a white wash history. So Katie asks us what kind of state do we live in? What kind of state do we want to live in? She says, 1084, scares the next generation of thinkers from Georgia. I love this state and I want to live here freely just as I would anywhere else. I see my future in Georgia. I live in a state that has a diversity of thought in people where my neighbor looks and feels differently for me and that's okay. I want myself and every student in Georgia to feel safe whenever they walk into any school of any kind. Places of education should be safe spaces for thought and speech. I agree with you Katie and colleagues I hope you do too. I hope that we can vote no on this bill and let teachers teach and students learn. Our kids should learn about what we've done right and wrong in our history so they can celebrate the progress we've made and continue making it in the future. We can talk about race and racism here in Georgia. We can teach our children to love America and to love the truth. Mr. Speaker, I yield the well. Chair recognizes representative Cannon to speak to the bill. Thank you Mr. Speaker. Hello members. I'm rising in opposition to this bill. I'm the youngest woman member in this chamber and I am a current educator to Georgia students. I'm not sure if it's because I'm part of the county. I'm part of the county and I'm part of Georgia students. Why you've seen I might not have been here a few days. Our students need to be taught. I have been contacted by more than 200 parents, students, and school board members who oppose this bill. I want to tell you two reasons that I'm against this bill. The first is I am a product of Georgia public schools. And I have been subject to its curriculum more recently than any of you here. It's nearly impossible to comply with lines 38 and 39 that say an educator may not teach a divisive concept to which an individual should feel anguish or any other form of psychological distress. I have felt psychological distress here learning about racism in my county and in Georgia. But unfortunately, some of the things that have happened in my home county of Lee County and Dardi County in Albany with the Lee County Stockade were not being taught in public schools when I was in schools. It's being taught now. The unlawful arrests that happened on March 25 last year in this capital is being taught in public schools. I ask if you think that was divisive because students are facing psychological impact because they have empathy. And I think that when students have empathy and those empathy moments are turned into complaints, this adds to what our school boards cannot do. In fact, the Atlanta Public School Board passed a resolution last month against this bill and are asking that you vote no today or at least take a courageous walk. The second reason I'm against this bill so I can close out is it initiates what could be a 12 week process, which is three months out of the nine month school calendar against educators. It implicates them against school boards. They have to review the complaints. It implicates the school board against the department of education to determine whether the rule was violated. I'll finish by saying I've taken a look at the Georgia Department of Education, standards of excellence, GSC. As of August 21st, 2021, this is what we're teaching in schools right now. There are at least four standards that would immediately need to be changed, which within 77 days of this bill being signed. That is SS486, SS8H10, SS8H11, SSS, SS1, SSS, USS2, and SSWG2. If this bill does not address those specific GSC methods that need to be changed, I believe that all of our votes are flawed. I hope that you'll vote no. Thank you. Chair recognizes representative Carter to speak to the bill. Thank you, Speaker Rostin. Good afternoon, members of the Georgia House of Representatives. I rise to oppose House bill 1084. My hope when I finish and when it's time to vote, you will join me in voting no. This is the bill. I've read it a few times. And each time I read this bill, I come with the same question, and I ask the author of the bill, why? How do we get here? My free end, you're long-winded. He talked for a long time, and when he finished, I still had the same question. But he finally answered, and he said that we were being proactive. There's a definition for proactive, and I'm not going to read it to you, but here I'll sum it up. When we're being proactive, sometimes we're creating a solution in search of a problem. As he testified here, this afternoon, the concepts and concerns in his bill is not being taught in Georgia schools. The author of HB88 decided to share with you that the comment from the Georgia, the Gwyneth School Board member, again, not in the classroom. As a black female, growing in Atlanta, Georgia, went to public school with children, I agree that no child should be taught that they are inherently evil. They should not be taught that one race is inherently superior to another. They should not be taught that an individual by virtue of his race or her race is inherently consciously racist, or oppressive towards individuals of other races. And was interesting with these items that are defined between lines 29 and 42 of this bill, some of you have seen this language before. It was in the executive order signed by the former president, Trump. So this is not creative language that happened in Georgia. It came from the executive order. And so what's happening now in Georgia, we have decided that Washington is gonna dictate what happens in our schools. The other thing in this bill, it talks about the processes and the consequences. Well, the process can start with a child going home telling their parents something that may or may not be true. Could be true. Then the administration has to address that issue and then if that parent or whoever the person that made the complaint is not satisfied, they get to take it to the school board. And then if they're not satisfied with what happens at the school board, it goes to the state level, at the state school board or the state superintendent. If in fact they decide at that level that this action was in effort violating these concepts in this law, these school systems could lose waivers. There is nothing in here that addresses the teacher or the individual that calls the issue. The school system is who is going to be filling the consequences. Then let's talk about the professional standards commission which certify teachers in Georgia. In this bill, it talks about how the certification cannot include various types of languages or what we are now codifying in the law that define these items that I just share with you. But that isn't even the role of the professional standards commission. So here's where we are. You guys are gonna pass this bill. Some teachers gonna mess up, right? But we don't even have a system in place in this legislation to support the teacher. And then what happens to our children that have hard questions? This teacher's not gonna answer those questions because they don't want to violate this code.\n\nthat we're codifying into the law that came from the former president of the United States. So as a mom, I just want to plead with you for once since we want to unify. Let's vote no. And then let's do something different, right? Why don't we come together in the education committee and talk to each other about what is really happening in our classrooms and then we work together to come up with legislation that makes sense because this doesn't. Speaker Austin, I'd yield the will. There are recognizes representatives of Wilson to speak to the bill. Thank you, Mr. Speaker. Do some common sense here, shall we? The only reason that we can stand here and discuss which concepts are divisive, whether they are or not, and whether they should be taught in school or not, is because we learned them in the first place. If you think for a second that kids are not going to learn about racism in our society today and they're not going to talk about it in schools, you are fooling yourselves. All this bill does is muzzle our teachers and make them into a straw man for a political gain from the true divisive voices in our communities. I say this to you as a former sixth grade teacher. There is no better place to discuss difficult concepts and events than in the classroom, a safe space for our students where our trained educators can also teach them the skills to discuss, consider, question, and even reject ideas but to do so in a healthy and respectful manner. These by the way are the same skills, the same life skills that our children need to thrive in our modern global economy. Rational thought, critical thinking, civil discourse, mutual respect, humility, debate, spirit of generosity. When you and I say to one another all the time in this room, there is no set of skills more needed in society right now because what we have today is a society full of folks that cannot talk to one another about difficult concepts because they lack the ability to do so without resorting to violent words or violent actions. So we build walls between each other and echo chambers that we live in that make us feel safe because we are not challenged. You know I have served on the education committee since I first came to the house and in that first session we were still passing laws to reduce the number of standardized tests required. And I agreed with that policy but the argument that was made then and sticks with me now is that we need to do this to give teachers more freedom and flexibility. More flexibility so that instead of having to teach to the test they can teach life skills so that they have the freedom to respond to current events happening in real time and be able to tailor their lessons to empower our students with a skill set to navigate and better understand the events that we are all living through. We did have a great deal of discussion and committee about whether or not this bill would prevent educators from teaching our current events honestly. And we were told that there is a difference between what has happened in this country and what is happening. And that is where this bill tries to draw the line. So I just have to ask at what point did what we call history stop. It cannot have been with the emancipation proclamation because then we had Jim Crow and the clan. It cannot have been with the civil rights movement and desegregation because then they killed Medgar Evers and Dr. King. It cannot have been with the election of Barack Obama because then we had Donald Trump. We are living in very difficult days. The families of Amad Arbery, George Floyd and Breonna Taylor would surely agree. And so I just want to name the elephant in this room. This bill and the national version that it was modeled after are a clear response to the discomfort and fear expressed by many folks who share my skin tone. To be sure, this bill is wider than the paper it is printed on. But here is the thing. Honestly learning the history of this country should make white people uncomfortable. If our white public school students are learning about the continued impact of slavery and are coming home feeling uncomfortable, that's a good thing. It means we are teaching a generation of young Georgians to be people of conscience, to have empathy, to understand that we are still working on this to this very day to build that more perfect union. What this bill is not going to do is satisfy the people you aim to please. I spoke with the folks who came to the committee hearings and do you know what they want banned? Pride flags. Books written by African Americans that discuss their own lived experiences. They want to end the entire concept of public education by letting parents pull their kids out of class at the first hurdle and send them along with their tax money to private schools that teach that racism is over. The American experiment inequality was and is ongoing and imperfect venture. It's not too long ago that being a gay man like me was pretty divisive and it may still be to some of you. I don't know. We talked about it and this country grew and last year I was able to marry the love of my life, a man. Something unthinkable once upon a time to a little boy in Griffin. We cannot keep catering to the worst actors in our politics. Our nation is so divided and our political discourse is so toxic. This bill will only deepen the wound. It will only further widen the gap that exists between us. But it's an election year. So I'll watch the board here in a bit and we'll go home for the weekend. But this is not over. Our history is not over. And it will remember us for what we've said and done. On this vote I'll sleep just fine. I yield the will. Chair recognizes representative Brad Thomas to speak to the bill. Going once, twice, three times. Chair recognizes chairman Setslor to speak to the bill. Mr. Speaker, as much I will not have time to say. I will say this. I was talking to a group of high school football players a number of years ago and I said guys, why is there a difference between what you do and you're willing to let folks see when you're out with your friends on Friday night and what you do when you're around your grandparents and your youth pastor. Why is there a difference here? Why is there a difference? After a long talk, I had with these young guys. The point I made to them and what they came to understand was that they knew right and wrong. They knew their grandparents and mom and dad taught them right from wrong but sometimes as an adolescent they lived a double life. You know, that story strikes home to all of us. We think back to our upbringing that we've just aligning what we know is right with what we practice every day takes time. That's really the marks of adulthood is aligning what you know is right with the life that you live. Ladies and gentlemen, that's a powerful story I share with young people all the time because that's really a picture of the life of our nation. Our nation was founded on right principles. Our nation's promise that all of them are created equal. They're endowed by our creator with certain enalema rights is true to all people. Our challenge our nation faces is the idea that our nation's principles is right is being undermined across our nation. Our nation's principles are right but as we were to add a lesson in nation, we took a lot. There's a lot of years in our history that we didn't live as a nation of accordance with our ideals. In fact, 75 years after the signing of our U.S. Constitution on September 17th, 1862, a regiment of the Pennsylvania, New York, infantry, cross-burn size bridge across Antietam Creek, it was the turning point of the Civil War. 75th anniversary of our nation's constitution being put into action was the turning point that this adolescent phase of our nation where we believed one thing and practices another started to change. That's been the story of American history that even though our principles were right, it's taken years to make everybody be able to enjoy that truth. That didn't change everything. 100 years after that happened, there was still the struggle going on that all might be able to enjoy those founding principles on which our nation was founded. Ladies and gentlemen, the House, I share this story with you today because this is really the story of American history. And this is what's really under attack on our nation today, not the issue that our nation is right about its principles and it's taken time that everybody might be able to enjoy those principles. That is the story of our nation. But a narrative that's being pushed today is that our nation itself, the principles themselves are wrong and that the American is founding its principles itself needs to be scrapped in front of way. Mr. Speaker, ladies and gentlemen, I was in my campaign. I was going door to door in the fall of 2020 and a lady sat in her front lawn and told me. Representative Sester, this idea of our nation's principles being right is just wrong altogether. She said our nation is fundamentally broken, she told me. A constituent of mine. I can't say what she's neighbor and she lives. And her parents were college professors and she's about my age and she's an accomplished professional. She said, you know, you see that dead grass over there on the set of my yard, Representative Sester? I have a landscaper coming in on Monday and it's going to rip that out and put it on new side. She said to me, that's what needs to happen in America. She said, Representative Sester, our principles, our nation is wrong from its founding. She says, we need to rip our foundation off and completely replace what our nation is with something fundamentally different. That's what I believe. I was stunned. I appreciated the clarity. That's what's before us today, ladies and gentlemen, there's a belief system and as our wrap up, that's that is pernicious, that's taking hold across our nation, that not only was our nation founded on right principles that we've had a long struggle to allow to ensure everyone could enjoy, but the idea is taking root today that our nation and its essence is wrong. They're very beginning. Its principles are wrong and needs to be completely replaced with something else. I would call this a fringe issue. Had I not heard that from a fifth grade student just about eight years ago. I was passing out constitutions in one of my elementary schools and I passed them out to kids and I was talking about our nation's principles. I had a 10-year-old young man who had the guts. I candidly I respect his guts, but he said to me, I don't want this. I don't want this constitution. This document is just, it's trash. It's based on evil things. Everything our nation ever has been has been wrong. I don't want this thing. Well, you know what? People our age may come to believe silly things, but fifth graders don't learn that from nowhere. So ladies and gentlemen, I want to share with you this issue of critical race theory. This issue that there are people being taught inherently divisive concepts is something that exists as a cancer in our culture, but should never be taught in our schools. It wasn't taught in our County schools, and I hope it's not being taught in years, but it never should be. Because the principle our nation's founded on our right and our goal as leaders, all of us, is to never take our out of this principles, but to make sure every single person or culture can participate in the promise that is America. Ladies and gentlemen, that I ask you to support HB-1084. Gentlemen, has yielded the well. Is there any objection to the previous question being ordered to chair here's none? The previous question is ordered. We now have the minority report. 20 minutes by rule for the minority report. Chair recognizes as the first speaker representative, when. Thank you, Mr. Speaker. You know, I don't think I'm the only member who felt this way today, but when we were listening to the debate on House Bill 1, and I heard the speeches from those in support of the bill, I literally said, we can take these talking points from these speeches and use them for House Bill 1084. But what I want to do today is share with you all a little bit about my history. A few weeks ago, my older sister told me that her five-year-old boy came home from school. He had just learned about Rosa Parks. And he asked, Mommy, why did white and black people have to drink from different water fountains? And then he went on to ask her about his own race. Because he knew he was Vietnamese, but he didn't know that he was Asian-American. My nephew knows he is Vietnamese because his grandparents speak a language that he does not understand because he eats Vietnamese food like his grandma's fah noodle soup. And as he grows older, he will learn just like I did that his grandparents fled from a repressive regime that restricted them from having the freedoms we have here in America, the freedom of speech, the freedom of press, the freedom to assemble, and the freedom to criticize our government without the fear of retribution. My nephew will also learn like I did that his grandfather, he was a lieutenant in the medical army. He was a pharmacist. He will learn that in 75 after Saigon fell, my grandfather was part of the tens of thousands of Vietnamese people who were imprisoned by the communist regime. Doctors, lawyers, teachers, South Vietnamese officers, and allied forces with Americans. His grandfather had several sins. The sin of being educated and the sin of being allied with Americans. For three years, my dad was held in a remote jungle. He was a political prisoner and went communist called reeducation camp. And in this camp, he was subjected to hard labor and starvation. But also in this reeducation camp, my dad was forced to learn about his new form of government. This included the erasure of history, the rewriting of history. They forbade prisoners from keeping and reading old books from the former government. They forbade prisoners from singing love songs of the former government. They forbade discussing political questions that were not authorized. And they forbade harboring any reactionary thoughts. When my dad was released three years later, my parents fled in the middle of the night on a boat to seek refuge in America. A country who promises to guarantee those very same freedoms that were denied to them. Essential to America is academic freedom. In this bill, in fringes on that crucial tenet, by censoring what happens inside our public school systems, this bill will create whether or not it intends to a chilling effect for both teachers and students. And it does the opposite of what the author intends. Whether or not we are white, black, Asian, or Latino, we all want to live in a unified nation. But in order to be unified, we need truth. Truth and reconciliation, they go hand in hand. Without the ability to teach accurate and honest history, we cannot heal. We cannot make amends for our past or our present, or we cannot prevent history from repeating itself. I shared with you the history of my parents from Vietnam, but we don't need to even look there. We can look at our own history. And we have already been here before. It happened before. It's called McCarthyism in the Red Scar, where we engage in a witch hunt against our educators in our librarians and it impacted all levels of education. We allowed fear and paranoia to pit Americans against each other. We sacrificed our academic freedom and we turned our educators into enemies. Because of teachers lost their jobs during that time. Because they were given a directive of what they could say, what they couldn't say, how they were able to teach, and what they could say in the classroom. And if they were suspected of violating that, we turned our backs on them. Here's the thing we don't have to repeat the past. Because we've already learned what a bill like this does. It prescribes the type of censorship used in authoritarian governments like Russia, like China, like Vietnam. It suppresses free speech and intellectual curiosity. It turns our classrooms into spaces where educators and students will not feel free. They will not feel safe to discuss the hard aspects of history. The history of race and racism in this country, how our country is still to this day impacted by discrimination that was built into our laws and into our institutions years ago. The mark of a great nation is one that understands she must protect democratic norms. Even if it means her citizens may not always agree with her, may not always talk about her past or present in a good way, but she must be willing to withstand the good and the bad about her history in her present day. In academic freedom, that is a democratic norm. This bill, this bill is not. This bill is a censorship bill. This bill violates freedom of speech. This bill will instill fear, not patriotism, not unity. I want to close with this. As I have listened to the debates that have taken place in our legislature, both in this chamber and in our committees, I am becoming increasingly alarmed at a pattern. Unfair redistricting maps, voter suppression bills, anti-protest bills, classroom censorship, book bans, all in violation of democratic norms. My parents have been in this place before, and that is why they came to our country. I am not naive enough to believe that any member of this body is going to change their vote. But I do want to strongly urge us to recognize that while these bills may sustain power, they may sustain control in the short term, we have got to recognize what this will do to us in the long term. Because eventually the dam has gone to break. And when the dam breaks, we will have done irreparable harm to our country. Mr. Speaker, I yield the well. Chair recognizes for the balance of the minority report representative Burnham. Thank you, Mr. Speaker and good afternoon, colleagues. Before I was a member of the Georgia General Assembly, I was a classroom teacher, instructional lead teacher, community relations liaison for Clayton County Public Schools, where I retired after 25 years. I also taught in Detroit and Houston in both public and private schools. My career expanded over 35 years. I am the daughter of a 40-year educator who went on to become a Detroit Public School board member. I love to be an educator. I woke up every day proud to serve the students, families, teachers in my community and worked hard to ensure the next generation of leaders received the high quality education they deserved. The last thing hard working teachers need are legislators meddling in their classroom, who know nothing about what it takes to educate a student. When COVID hit, parents were responsible for teaching their kids, suddenly everyone started talking about how much they appreciated their child's teacher. When the governor was first selected, he pledged to give teachers a $5,000 raise until they realized that the librarians, counselors, social workers, and psychologists were all paid on a teacher's contract, so they had to reduce the money to make sure everyone received a raise. Thanks for today with additional funding from the federal government for education. They will receive the balance of the raise at the same time. This legislation will start the dismantling of the teaching profession in public schools. Who wants to go to college, graduate with student loans, and go into a profession where no one is talking about providing additional resources to ensure their students who are at least one great level behind, through no fault of their own. Listening to stories about how educators survive teaching during COVID, first year teachers losing students, and still showing up online to make sure their students are okay. Instead, legislators are talking about how to punish educators if they don't teach what they tell them. Most educators are women who are single, head of household, their salary and insurance benefits take care of their families and contribute to the economy. Schools are nurturing environments where students come to learn about each other, their county, state, country. They want to know the truth, paraphrasing, if you don't know your history, you will continue to make the same mistake. Their job as educators is to teach students how to think critically. This skill is taught across the curriculum. They are preparing students for real-world jobs where they will have to be problem solvers. How can our students learn to think critically if they are only given one side of history? Guess what? If they hadn't taken time to teach you reading and writing and mathematics, where would you be? We have spirited debates in the chamber. We learn from each other and we come back the next day and start over again. Are we saying our children are not resilient enough to do the same? How is it that these same students can play sports where they are challenged by coaches who are not always kind telling them that they are looking for winners? So the average student cannot be a part of the team. Are we worried about their feelings? No. The legislation is making waivers for public school contingent upon teaching what legislators want. Instead of allowing the educators to make that decision based on state standards. If you thought we had a teaching shortage before, you really are going to have one. Neither public nor private schools will have highly qualified educators. Get ready because you are going to be your child's teacher or your grandchildren's teacher. Thank you, Mr. Speaker. I yield the will. That completes the minority report. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote aye. The chair here is opposed to vote no and the clerk will unlock the machine. What purpose does representative Kowsha rise? Parliamentary inquiry. Isn't it true that when I was a high school student in Germany and I learned about Germany's atrocious past that that made me highly uncomfortable, made me feel anguished and distressed? It isn't it true that going through this painful process was then the only way to move forward confront this atrocious past in its painful reality. This is my history with I like it, not isn't that the truth? If the lady so states what purpose does representative bird rise? Parliamentary inquiry. State your inquiry. Is it not true in 1882, Congress passed the Chinese Exclusion Act and was not repealed until 1943? Where was the justice for Chinese children? I don't remember any other race being excluded from the United States. That is history but I'm not whining. This bill, HB 1084, is about making sure all children are not discriminated against. Thank you. Okay. Chair recognizes representative Park. What purpose do you rise? Parliamentary inquiry. Picture inquiry. Thank you, Mr. Speaker. Is it not true that perhaps the best way to teach our kids in the next generation not to be racist and to end racism is to lead by example and not take actions that are racist and to end racism is to lead by example and not take actions that are racist and\n\nsuch as passing redistricting maps that may likely be found to be racially discriminatory in violation of the voting rights act in the US Constitution. All right let's do one more. What purpose does representative Derek Jackson rise? Quarry. Parliamentary inquiry. Mr. Speaker, is it not true that if we pass House Bill 1084 that we will have to remove all of the historic relics, paintings, change all the displays on the fourth floor because they will prompt a teacher that's given a tour in the capital to discuss some of the history around these paintings and statues on the capital grounds? Well I think that's a separate issue frankly but all right. After we debated it a long time we had a few parliamentary inquiries. Have all members now voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 1084. The eyes are 92. The days are 63. This bill having received the requisite constitutional majority is therefore passed. What purpose representative cannon rise? To make a motion. I'm sorry. Representative Wade got here first. The purpose representative Wade rise. Mr. Speaker I make a motion that we immediately transmit House Bill 1084 to the Senate. Gentlemen is moved that House Bill 1084 be immediately transmitted to the Senate. Is there objection? Sir sir sir I would draw all that that's fine. You withdraw your motion? I would draw my motion. Motion is withdrawn. All right let's go back to representative cannon. To make a motion. State your motion. Notice to serve intent to have this bill reconsidered on the next legislative day. You're serving notice of your intent to ask for reconsideration on the next legislative day. Yes. Lady has that right that'll be taken up on Tuesday. What purpose does representative Wilkerson rise? He waves. Okay. House Bill 1194 will be postponed until the next legislative day. House Bill 1351 will be postponed until the next legislative day. Carc will read the caption to a group of privilege resolutions. Commanding Carl Vogel, Miss Cobb County, 2022 recognizing February 1 through 28, 2022. His career technical and agriculture education. Recognizing February 13th and 19th, 2022 is future business leaders of America Week. Commanding Georgia alignment and recognizing April 18th, 2022 is Georgia alignment appreciation dates state capital and for other purposes that completes the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions? Chair here is none and the resolutions are adopted. All right, we've got some announcements. If you signed up for an announcement, make your way to the front of the chamber. We're going to take up announcements now. Chair recognizes representative Victor Anderson for an announcement. Thank you, Mr. Speaker. The uh, the subcommittee on solar consumer protection that was supposed to be at two o'clock today, that meeting will be at eight o'clock Tuesday morning. The location will be announced in an email. Thank you. Chair recognizes representative camp for an announcement. Thank you, Mr. Speaker. Colleagues, the juvenile justice committee will meet Tuesday at 2 p.m. and room 341. Thank you. Chair recognizes representative Gullet for an announcement. Thank you, Mr. Speaker. Two quick announcements. Governor LaFaire's local government subcommittee will meet on Monday, nine o'clock, room 506 also is hybrid. The Governor LaFaire's general government subcommittee will meet 10 o'clock, room 506. That's also a hybrid meeting availability as well. Thank you. Chair recognizes chairman Billy Mitchell for an announcement. Thank you, Mr. Speaker. There will be no meeting of the Democratic Caucus today. Please go home and enjoy yourself. One o'clock Monday, be on the lookout for notice. We are going to have an in-person meeting on Monday. We are going to look out for that notice. Thank you, Mr. Speaker. Chair recognizes chairman Collins for an announcement. Thank you, Mr. Speaker. Public safety and homeland security members. Please make sure you check your emails. We're going to have a subcommittee meeting on Monday that'll go out sometime today. Thank you. Chair recognizes representative Barr for an announcement. Subcommittee of natural resources will meet Monday to a clock, 406, and that is not a hybrid meeting. That is an in-person meeting. Thank you so much. That completes our announcements, but we're going to end on some happy note here. We've got some birthdays. Today, celebrating a birthday today. The distinguished member from Talbot County, representative Debbie Buckner, happy birthday. And on Monday, representative David Jenkins, celebrating a birthday, representative Jenkins. And on Monday, happy birthday to chairman Mary Margaret Oliver. Purpose is representative Sharper rise. Thank you, Speaker. Thanks, since we've had a rough week. I think we need a quick happy birthday song for those people, okay? You lead it, brother. All right. Happy birthday to you. Happy birthday to you. Happy birthday, everybody. Happy birthday to you. We did need that, representative. All right, to chair recognizes the majority leader of the house for a motion. Miss Speaker, if I could, I would, but I won't. But I'll do it this way. Miss Speaker, I moved this house stand adjourned until 10 a.m. Tuesday, March the 8th, 2022. Well, the motion is music to my ear. So the majority leader has moved that this house be adjourned until 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. And this house will be adjourned until Tuesday, March 8th at 10 a.m.",
  "updated_at": "2026-02-13T09:31:57.299109+00:00"
}