{
  "video_id": "64eDkR6rxu0",
  "url": "https://www.youtube.com/watch?v=64eDkR6rxu0",
  "title": "1/22/2024 Senate Committee on Government Oversight",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia 1/22/2024 Senate Committee on Government Oversight session:\n\n**Overview**\nThis session focused on the discussion and potential passage of SB337, a bill to create a more robust \"Georgia Kernel\" program as an honorary lifetime appointment for distinguished service to the state.\n\n**Key Actions**\n**SB337**: Establishes a \"Georgia Kernel\" program for lifetime appointments to honor distinguished service to the state, replacing the existing \"Lieutenant Colonel\" program.\n\n**Bills Introduced (First Reading)**\nNone.\n\n**Notable Moments**\n- Sen. Kirkpatrick, the bill's sponsor, explained the intent to create a more formal program similar to the \"Kentucky Kernel\" program he was once part of.\n- Several senators, including Sen. Moore, expressed concerns about the bill, arguing it gives the governor too much power to hand out political awards.\n- The criteria for selecting \"Georgia Kernels\" was discussed, with it being noted that it would be at the discretion of the sitting governor.\n\n**Votes**\nNo recorded votes, but the committee appeared divided on the bill.\n\n**Attendance**\nQuorum present.\n\n**Adjournment**\nThe committee adjourned after discussing SB337. The next session date was not specified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe government oversight, there is a sign-up sheet down on the front if there's a\nfor public input is available.\nWe're going to use our handy-dandy mallet that we've been given by our rules chairman,\nGowel. Gowel. It's not a mallet. Okay. Okay. To call us the government oversight committee\nin the session in order and we're getting started. There's more coming. Senator Sam would\nyou open us in a word of prayer and you are 14 and we'll get started. All right. Let's\nI just pray.\nDear invite, we just thank you this day.\nThank you for all your mean blessings.\nJust ask and pray that you be with us in this meeting.\nLead and guide us.\nBe with our families while we're away.\nAnd just watch over them in your name and pray.\nAmen.\nThank you, sir. I appreciate it.\nWe started out with a short agenda.\nIt looks like SB337.\nSenator Kirkpatrick.\nAnd this apparently was done last year.\nthis is the new one, okay, this is new, okay, and I know you've got one more that you ask us to wait on,\nbut if you will come forth and give us a presentation of what we're dealing with, we will turn it over to you.\nThank you, Mr. Chair, and I'm so happy all these people showed up to listen to my bill.\nI don't think that's why they're here, actually.\nAnyway, Senate Bill 337 has to do with the Georgia\nKernel Program.\nMany of you may be familiar with the Kentucky\nKernel Program.\nI'm actually from Kentucky and was honored to be\nnamed a Kentucky Kernel in 1973.\nAnd as I recall, this was related to my representation\nof Kentucky in the National Spelling Bee.\nThis commission not only has a place of honor in my\noffice, which I brought it with you,\nWith me, so you could see it, but I also participated in the Honorable Order of Kentucky\nKernels, which is a charitable and social organization that has chapters around the country\nand in other countries raising money for good causes.\nOur current code has an aid to camp law, which our governor can use to appoint honorary\nlieutenant kernels, but the appointments are only good for the term of the governor.\nThis bill creates a broader framework for creation of a more robust program that would\nbe a lifetime appointment and it does not create a program like Kentucky's with a 501C3\nand all the trappings, although that could be done at a later time.\nThe bill requires that the selection is based on distinguished service to the state of Georgia.\nThat's in lines 15 and 16.\nIt does not require military service and actually the current code has a conflict because\nin one spot it does relate to military service and in the other part it doesn't.\nThe other thing it does is it states that it's for the lifetime of the recipient rather\nthan the term of the governor which is lines 23 and 24 and I have discussed this with\nthe governor's office they don't have any concerns about it and again it just lays the\nframework to make this a more honorific thing for people who provide distinguished service\nto Georgia.\nSo I hope this is the easiest bill that you all deal with, this session.\nYou actually have a question, so that's how to, we want to make sure it's right.\nRoberson.\nThank you, Mr. Chairman.\nis there a fiscal note associated with this at all or you're aware of one?\nThere is no fiscal consequence to that.\nOkay. And you said, you know, how old would you have to be?\nAnd just generally, you have to be an adult to be a Kentucky colonel.\nYou'd have to have lived long enough to provide the state,\nto serve us to the state. So most of the time these would be adults.\nBecause I just noticed you were recognized by Kentucky when I was 11 years old.\nSo I was just trying to I was trying to make sure that because I'd always assumed that I was older than you so I know how old I am.\nYes, ma'am. So I was just trying to verify. I do appreciate it. Thank you, ma'am.\nI'll just say I told us a governor bill when I looked at it upon the governor's personal. So I guess it's not governor bill.\nSo it's governors is okay with it, right?\nYes, the governor's office did not, I met with them about it.\nThey did not express any concerns.\nOne thing is we have a program right now called Lutin,\nLieutenant Colonel.\nWe've got an AIDD camp, Lieutenant Colonel program,\nbut I don't think anybody's ever heard of it.\nAnd that would be one reason to do this,\nto make it something that would be,\nsomething people would like to have.\nIt's good to know that I didn't know about there either.\nSo I figured out maybe you had a little company try to\ntry to upgrade and make it a good promotion to make it a\nfull kernel, but you know, that's I'm okay with it, you\nknow? So maybe some day I can be, you know, I wanted to.\nSo we all can be, you know, thank you.\nThank you for the, I think he's asking if you'll consider\nhim for this next award coming up this next year.\nif it passes.\nAll right, any other questions?\nSenator Moore?\nYes, sir.\nThank you, Mr. Chairman.\nI don't have a question for the author,\nbut I would like to engage in some discussion before the vote.\nIf that's appropriate.\nOK.\nYeah, I just, it's going to be no surprise to many,\nbut I'm going to be a hard no on this piece of legislation.\nI think it's a bit embarrassing to the people of Northwest\nGeorgia when the first piece of legislation that we have come before government oversight\nis granting the governor more power to do something.\nAnd that's, you know, hand out political awards to his political friends.\nMeanwhile, you know, we've got 19 people that have been indicted and they're the constitutional\nrights are being violated and the governor hasn't done anything about it.\nYou know, our southern borders being invaded, people are being human trafficked.\nYou know, yesterday the news comes out that our election machines can be hacked with\na pen.\nAnd this government oversight committee isn't doing anything to address any of those issues\nthat I think really needs them oversight.\nBut meanwhile, we have our first piece of legislation to give more power to a governor.\nAnd I'm just extremely embarrassed and disappointed by that, Mr. Chairman.\nSo I'm going to be voting.\nWhat does that respond to that?\nYes, ma'am.\nWhy would you do that?\nThe governor already has this ability,\nbut the commission only lasts for the term of the governor.\nThat's the only difference.\nAnd when you're expanding into a greater amount,\nit's getting the governor more.\nLet's maintain your quality.\nOkay.\nOkay.\nI'm going to ask a question.\nWhat determines the criteria for getting this award?\nthis award. That is not stated here. Is that at the discretion of the governor, then\nis my guess as far as that portion? Is that how I would understand this?\nYes, it would be at the discretion of whoever the sitting governor is at the time.\nAt the time. Okay. I just was, I didn't know if there was any outline of, you know,\nwhat was there that I didn't say here. Okay.\nNo, sir, and I would hope that eventually we would use the wording change to be able to\ncreate a non-profit to raise money for charity like Kentucky has done but\nthat is not entertained in this legislation. Could I also ask how you got\nchosen to be an official Kentucky colonel? Was that based upon just the\nopinion of someone or did you do specific things for that? As I said I think it\nwas related to representing Kentucky and the national spelling bee and so I\nI think the idea of this is to honor accomplishments\nand things that people do,\nwhere they do something out of the ordinary.\nSo you were the participant in the spelling bay, correct?\nYes, sir.\nWhat was your disc, did you go all the way to the end?\nI'm just curious, what word was the last word?\nI went to Washington DC and lost in the National Bee\nMisspelled Award that I'd never heard of.\nIt was the word called Kalama, C-A-L-A-M-U-S.\nThat's how you spell it.\nI didn't spell it that way.\nI'm glad that you learned from that.\nAll right.\nSenator.\nThank you.\nThank you, Mr. Chairman.\nYeah.\nTwo R's.\nTwo T's.\nTwo R-C-T's.\nThank you, Mr. Chairman.\nAt the appropriate time, I like to close debate.\nI mean, discussion.\nAnd move, do pass.\nThis is the appropriate time for that,\nand we will have a motion for,\ndo pass for LC, 46, 06, 81.\nIs that correct bill number, I believe?\nLC, 46, 06, 06, 84.\nOkay.\nOkay, any other discussions?\nSecond.\nWe got a second.\nAny further discussion?\nJust briefly.\nSorry.\nFirst of all, I want to thank Madam Chair for bringing this bill forward.\nI have a tremendous amount of respect for everybody on this committee and the work each of you do in your communities and the voters who support each of you, especially the chair.\nAnd all of us know on this and this should not be something that I should have to do in public, but I will.\nEach one of us knows how a bill gets passed in this chamber.\nIf any of us want a bill written to say a particular thing, then we do it.\nWe go sit with the attorneys and we write that legislation.\nIt goes through the process and it's assigned to a committee.\nAnd then it is up to the chair of that committee to determine what the hearing is.\nand while we may disagree on many things and my good friend from the North\nhe and I agree on many things. One thing that I think we all agree on is that\nthere's decorum and respect given to any senator or any citizen or any house\nmember who comes before these committees and I hope that we never lose\nside of that and that we always show due respect to the chair of whatever\ncommittee that we're sitting on representing in front of. Thank you Mr. Chairman.\nAll right, let's see we have a motion we have a socket. What is the pleasure of the committee?\nAll in favor raise your hand.\nOne, two, three, four, five, six, those opposed. We'll get out. Six, four, and one against.\nAnd your bill moved forth. Thank you so much. We appreciate it.\nand this committee is adjourned.\nAre we good?\n",
  "updated_at": "2026-02-12T19:48:26.731485+00:00"
}