{
  "video_id": "64I3Xw0yjNU",
  "url": "https://youtu.be/64I3Xw0yjNU",
  "title": "Georgia House - Day 4 (2026-01-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-01-16",
  "duration_minutes": 209,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 4 (2026-01-16) session:\n\n# Georgia House - Day 4 (2026-01-16)\n\n## Overview\nThe session featured a speech by the House chaplain, Dr. Harris Malcolm, reflecting on the importance of faith and finding peace amidst life's uncertainties. The transcript also mentions the recent passing of a former House member, Alfred J. Powell.\n\n## Key Actions\n**HB 276**: Not mentioned in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- House chaplain Dr. Harris Malcolm gave a speech reflecting on the resurrection of Jesus and the importance of finding peace in uncertain times.\n- The House honored the memory of former member Alfred J. Powell, who had recently passed away.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe transcript notes the Speaker calling for all members to report to the floor for the morning roll call.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "you you you The I'll convene now having arrived all members of the house will please report to the floor and take seats. All members of this house will report to the floor and take seats. Mr. Clark would you ring the bell. All members will report to the floor we're going to have the morning roll call here momentarily. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. A couple of items before we have the chaplain. I spoke last evening with the minority leader and leader Tramble asked me to express his gratitude to all the members for their prayers and for reaching out to him and he was very, very humbled by that. I told him that I'm not a doctor but if he needed to take off till about April or May to rest that that probably would be good for him. He laughed too but he expects to be back on the 27th. The other thing is we have a busy day today so I'm going to ask your cooperation and sort of keeping the chaos down a little bit and stay in close to your desk. We've got a busy morning. We have the joint session at 11 and then immediately upon dissolving the joint session we will come back into doing business here in the house. We will begin our day though with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 115th House District Representative Bruce Williamson. Representative Williamson. Thank you Mr. Speaker. Fellow members of the House it's my joy and honor to this morning to represent to introduce a lifelong friend but when I was pondering how to introduce someone you've known your entire life all these adjectives kept just piling in I was trying to come up with how to best talk about somebody that I admired in respect my entire life and when I was doing my devotional Wednesday morning I flipped open to the book of James in chapter 1 verse 2 says counter doll joy is when we face trials and the just of that scripture as we all know is we're going to find joy when we trust God and lean into God and nobody I know has leaned into God and trusted him more than the man I'm about to introduce again I tell you we're from small town everybody knows everybody everybody's parents is raising you and your parents are raising them it's the way things are kind of supposed to work well nobody had more joy than Mr. Mrs. Billy Malcolm and as well as his uncle Brandon his wife Miss Margaret so I've seen I've come to the conclusion the best way I can describe my friend Harris Malcolm is he has joy and that joy only comes to the Lord he's been very faithful and obedient God's calling on his life in fact his parents one of their biggest joys was the fact that of their two sons both are recalled into the ministry and both are accepted that call so it gives you my joy this morning to introduce my friend and I'm going to tell you a little bit about why he's been so faithful to that call he serves as a state missionary of the George Babis Mission Board so I've explained he's a native of Monroe he and his wife Philates a parents of three daughters Shauna Natalie and Katie and believe it or not he's been married for 46 years some of you I we came through a gauntlet a southern Babis right down here and the most of you recognized him immediately or need he knew your pastor but some of you might recognize him as being one of the characters in the movie fire proof that was produced by Sherwood Babis Church down in Albany Georgia a number of years ago he and his wife Philates played the parents of Kirk Camerone's character in that film they're now back in the hometown of Monroe and our members of faith Babis Church so I'd like to welcome Dr Harris to the podium Good morning tight quarters up here it is honor to be here today and I want to thank my friend Bruce Williams for that great introduction Mr. Speaker thank you for your grace's invitation and the opportunity to be here today and members of this body I appreciate you I pray for you I respect you and thank you for the service that you render to our great state November the 26th of last year Camilla Georgia Southwest Georgia and this body and my self lost a good friend in Alfred J. Powell I had the privilege of being J's pastor for 14 years he served on the search committee that called me the way Babis do it to that church our girls grew up together and so I want to thank you I understand that on one day of this week you paid honor and respect to him and I I want to thank you for that you know death leaves a void death puts life in perspective it's a reality that is unavoidable as a matter of fact the Bible says it is appointed a demand to die once a friend of mine recently said you and I don't have the luxury of staying dead after we die because eternity awaits I was thinking the other day as I was preparing to come here about that first Easter morning that wasn't Easter in the minds of the disciples but for us it was that first Easter morning we're told in scripture that there were some ladies that visited the tomb to prepare the body of Jesus for burial but when they got there he was gone Peter and John later ran to the tomb and when they got there he was not there and so gathered in an upper room where there last remembrance of the aroma the the presence of that room was when they had had a last meal with the Lord Jesus the Bible says that they were held up in that room out of fear for their very own lives because of their relationship with the Lord Jesus and the Bible tells us excuse me the Bible tells us that in a moment just like that Jesus appeared and that what he appeared he showed them his scars he showed them his hands he showed them his side and the Bible says that when they saw the Lord they were rejoiced you know life is full of uncertainty there were moments in that room to where they were discouraged they were depressed there was discontent there was heartache there was a void but then Jesus invaded their space Jesus showed up where they were and just a few things I want to mention before I close out and pray is the fact that Jesus came to where they were you know Jesus is good at that finding where we were where we are and coming to where we are coming to their place and then he showed them he reminded them of who he was they'd been three years with him and on a daily basis they were reminded of who he was and there was a lot of that they didn't understand but he showed them the scars of redemption he showed them the marks of sacrifice and then he gave them what they needed peace I heard the speaker while ago used the word chaos now I'm sure that that meant something to you that it would not mean to me because I don't sit where you are but we all understand what the word chaos means nobody wants chaos nobody wants conflict we don't we don't seek chaos we don't seek conflict but I'll tell you what everyone in this room I will guarantee you no matter where you sit you desire peace the Bible talks about peace that passes understanding the Bible says that Jesus is our peace there was one guy that was missing in this whole scene his name's Thomas now Thomas gets a bad rap sometime we he's gotten the name doubting Thomas I don't know if that's fair unfair you know I'll let you come up with your own opinion but I do know that there was another time he was there he showed up and they said man we have seen the Lord and he said well unless I see for my self I'm not going to believe and then Jesus shows up just like he came into their space he comes into Thomas's space and Thomas looked at the scars of redemption Thomas looked at the marks of sacrifice and he said my Lord and my God this is 2020 we got a lot of 2020 yet to go I don't know what your 2020 is going to look like I'm not even sure what my 2020 is going to look like I don't know what's going to come down my path I don't know what path God is going to take me down but I do know this we're going to go on we're going to go into tomorrow and into the next day and into the next day and guess what he's already there I tell my wife she says I need to find a better way of saying this but I hadn't found a better way God's got this thing rigged he does is rigged it's going to everything is going to end up exactly where he wants it and so here's what I close with today as you face this new year find your contentment in Jesus find your confidence in Jesus find your companionship in Jesus but cause then and only then will you find your courage and your comfort in Jesus so how do we enter each day with faith instead of fear how do we deal with uncertainty and get perspective we welcome Jesus into our space would you stand with me as we pray Father God is just as you walked into that room that day unfettered uninhibited by any human barrier we invite you to walk into our space this morning Lord to make your presence known to grant your wisdom to grant your peace Lord to feel and to flood each man in one one's heart and life with your power and your presence Lord we thank you that we can walk every day this year with a certainty that you've got it all worked out and we just need to simply trust you and Lord we thank you that we can begin this day with you we can continue this day with you and we can go to sleep tonight and put our head on our pillows knowing you work all things well in the name of the Lord Jesus Christ we pray amen would you join me as we pledge the flag I pledge allegiance to the flag of the United States of America and to the Republic or which it stands one nation under God indivisible with liberty and justice Christ Door Cavers will unlock the doors the chair recognizes chairman Hogan the chair of the committee on information and audits. Thank you, Mr. Speaker. Your committee on information and audits, read the proceedings of the previous legislative day and found them to be correct. Chairman Hogan the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is not and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. The chair here is not and the resolution is adopted. First reading of bills and resolutions. Second reading of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is not and the resolution is adopted. First reading of bills and resolutions. House Bill 775 by reps and a Mitchell of the 88th Building Title Act to amend Article 2, Chapter 5, Title 40, the Fish and Putta Georgia annotated relating to property tax exemptions. Ways and Mains. House Bill 776 by reps and a Mitchell of the 88th Building Title Act to amend Article 1 of Chapter 14 to Title 44 of the Fish and Putta Georgia annotated relating to mortgages. Judiciary. House Bill 777 by reps and a quarter of the 174th Burns, the 159th McCall, the 33rd England of the 116th Smith, the 70th and others. Bill and the Title Act to amend Chapter 2, a total of 8th at the Fish and Putta Georgia annotated relating to standards and requirements for construction. Agriculture and consumer affairs. House Bill 778 by reps and a turn of the 21st at Bill and the Title Act to amend Part 1 of Article 2, Chapter 5, Title 40, 80th at the Fish and Putta Georgia annotated relating to add the lorum tax exemptions. Ways and Mains. House Bill 779 by reps and a blackman of the 146th, Williams of the 115th Carson of the 46th, Bri, the 118th. Stevens of the 164th, the Building Title Act to amend Chapter 5c, the Title 40, 80th at the Fish and Putta Georgia annotated relating to alternative add the lorum taxes on motorbills. Ways and Mains. House Bill 780 by reps and a purple of the 150th Green and the 150th first, a lot of 120 second in Lomston of the 12th. Bill and the Title Act to amend Code Section 50, 16, 34 of the Fish and Putta Georgia annotated relating to powers and duties of state properties commission. State properties. House Bill 781 by reps and a Williams of the 115th, a phrase of the 126th, Ridley of the 6th and a house into the 170th. Bill and the Title Act to amend Chapter 1 of Title 7 of the Fish and Putta Georgia annotated relating to financial institutions. Banks and banking. House Bill 782 by reps and a cloud of the 105th, Paris of the 42nd, Stovall of the 74th. Glant and the 75th, fry the 118th and others. Bill and the Title Act to amend Chapter 4, Title 1 of the Fish and Putta Georgia annotated relating to holidays and observances. Governmental affairs. House Bill 783 by reps at Thomas the 39th, Odie the 62nd. Gordon the 163rd, Scott of the 76th, Hutchinson the 100th and 7th and others. Bill and the Title Act to amend Title 20, the Fish and Putta Georgia annotated relating to education. Education. House Bill 784 by reps and a Lomston of the 12th, Chasriss the 11th, Hitchens the 116th, Wiedhauer the 119th, Gaines the 117th and others. Bill and the Title Act to amend Chapter 14 to Title 50, the Fish and Putta Georgia annotated relating to open and public meetings. Governmental affairs. House Bill 785 by reps of gullet of the 19th, Jones the 25th, Rogers the 10th, Reeves the 34th and Washburn the 111st. Bill and the Title Act to amend Article 2, Chapter 6, the Title 15, the Fish and Putta Georgia annotated relating to clerks, the Superior Courts. Judiciary. House Resolution 896 by reps of Petrie the 116th, Stevens the 1164th, Hitchens the 116th, Gillier the 116th, Gordon the 163rd. A resolution in recognizing the likes of Mr. James Jimmy Allen Petrie and dedicating a bridge in his honor. Transportation. That completes First Readers. Second reading of bills and resolutions, the clerical read. House Bill 745 by reps of Thomas of the 56th, Canon of the 58th, Shannon of the 84th, Kendrick of the 93rd and Stevenson of the 90th, the Bill with the Ladies of the Department of Public Health. House Bill 746 by reps of Kendrick of the 93rd, Scott of the 76th, Canon of the 58th, Thomas of the 56th, Shannon of the 84th and others, a Bill relating to women's rights and no act. House Bill 758 by reps of Powell, 30th, corporate of the 174th, Smith of the 133rd, Harold the 106, Montaghan of the 17th and others, a Bill relating to the Georgia Motor Carrier Act of 2012. House Bill 759 by reps of Paris, or the 158th, statements of the 164th, Fleming of the 121st, welts of the 110th, burns of the 159th, the Bill relating to control substances. House Bill 760 by reps of Cooper of the 43rd, Lums of the 12th, Jackson of the 128th, Hitchens of the 161st, Green of the 150th, a Bill relating to examination and treatment for mental illnesses. House Bill 761 by reps of Carson of the 46th, Parsons of the 44th, a Nile of the Wits of the 42nd, Alan of the 40th, Dekki of the 140th, a Bill relating to public utilities and public transportation. House Bill 762 by reps of Carson of the 46th, a Bill relating to imposition rate, computation and exemptions from state income tax, House Bill 763 by reps of Jones of the 25th, called well of the 20th, a Bill relating to selling and other trade practices. House Bill 764 by reps of Jones of the 25th, Jones of the 47th, controlled the 22nd, Stov of all the 74th, a Bill relating to facility grants for charter schools, purpose for which grants may be used, a Peepe of Charter School property and availability of unused facilities. House Bill 765 by reps of Skoggins of the 14th, Gamble of the 15th, Powell of the 32nd, Benton of the 31st, Galad of the 19th, the Bill relating to courts, House Bill 766, May reps of Scott of the 76, Jackson of the 64th, Mitchell of the 88th, McLean of the 100th, Douglas of the 78th and others, the Bill relating to Peepe of the 70th, others, the Bill relating to post-secondary education, House Bill 767, May reps of Scott of the 76, Williams of the 168th, Jackson of the 64th, Skoggins of the 60th, Beasley of the 65th, Bill relating to vital records, House Bill 768, May reps of Scott of the 76, Williams of the 168th, Jackson of the 64th, Skoggins of the 60th, Beasley of the 65th, and others, Bill relating to rights, privileges and prohibitions regarding military personnel. House Bill 767, 9 by reps of Scott of the 76, Williams of the 168th, Jackson of the 64th, so that he'll be able to 60th, Beasley of the 65th, and others. Bill relating to veterans education, House Bill 770 by reps of Scott of the 76, Williams of the 168th, Beasley of the 65th, Glantz of the 75th, Hutchinson of the 170th and others, Bill relating to the Department of Veterans Services, House Bill 771 by reps of Scott of the 76, Williams of the 160th, Beasley of the 65th. 75th, Glantan of the 75th, Hutchinson of the 107th, the Bill of Relating to the University of System Georgia, House Bill 772, my representate Scott of the 76th, Williams of the 168th, Jackson of the 64th, Scott Field of the 60th, Peasley, take of the 65th, the Bill of Relating to the Georgia Bureau of Investigation. House Bill 773, by representate Turner of the 21st, Jones of the 25th, Parkwell of the 150th, the Bill of Relating to Professions and Businesses, House Bill 774, by representate Allen of the 48th, Wilkinson of the 38th, Dryer of the 59th, Jones of the 53rd, Nellowix of the 42nd, and others of the Bill of Relating to Air Quality. House Resolution 893, by representate Scott of the 76th, the bill, you'll live the 60th. Resolution proposing a amendment to the Constitution of the State of Georgia, so as to provide that person who are at least 16 years of age, may vote in school district elections and elections affecting school funding. House Resolution 894, by representate Scott of the 76, Williams of the 168th, Scott Field of the 60th, Jackson of the 64th, Peasley, take of the 65th and others, Resolution creating the Joint Study Committee on Veteran Suicide. House Resolution 895, by representate Allen of the 40th, Wilkinson of the 38th, Dryer of the 59th, Jones of the 53rd, Nellowix of the 42nd, others, a resolution creating the Joint Ethylene Oxide Study Committee, three second readers. We have a couple of matters that we need to take up before we go into morning orders. The chair is going to appoint a state of the State Escort Committee. So listen up. Chair appoints as a committee of Escort, the Speaker, ProTIM, Jones of the 47th. Representative Larickia from the 169th, Representative Reeves from the 34th, Representative Lot from the 122nd, Representative Rodgers from the 10th, Representative Dickerson from the 113th, Representative Holmes from the 129th, and Representative Smiley from the 135th, will be the committee of Escort. What purpose does the chairman of the House Ethics Committee rise? Parliamentary inquiry, Mr. Speaker. State your inquiry. Mr. Speaker, is it not true that when you appointed me to be the chair of the ethics committee, that we had a discussion and you told me that I might be involved in some difficult decisions related to some of our members. That would be correct. I may have one of those situations. Is it not true that I am also a charter member of the T. Toddler Caucus in this House? I know that to be true. Is it not also true that yesterday there was an invite resolution, recognizing a major development project in rural Georgia, especially in Richland, Georgia, that just happened to be a rum distillery, and that my name was on that as a sponsor. I was very shocked when I saw it on there, but you never know. I mean, we evolve as we get older. But that is true. You were on there. The invite resolution was for a distillery of alcoholic beverages. Is it not also true that my former good friend, representative Gerald Green, whose name I will not mention, asked me to sign it, but failed to tell me that it was a liquor bill. If the gentleman so states, I am certain that he knows what he is talking about. Mr. Speaker, I am not sure whether to file an ethics complaint against that sponsor for failure to disclose or against myself for failure to read. You do have a quandary there. One more brief point. Stay sure and query. Don't you think that if that former friend of mine wants to be a current friend, he should give me one of those rum cakes you described so that it would be in a form that I could try it out. I can tell you, he'll heal a lot of what's wrong in the world. Those cakes will. What purpose does the chairman of the State Properties Committee rise? Parliamentary inquiry. Mr. Speaker, is it not true that our Lord and Savior turned wine and water into wine? That is true. Further parliamentary inquiry. Mr. Speaker, is that your inquiry? The rum cake is on its way. Now that we got that out of the way. That wine was not rum, though. We're going on now to morning orders and given the amount of business that we have to do today.\n\nI'm going to ask members to limit their mourning orders to one minute each, one minute. Chair recognizes the chair of the Game Fish and Parks Committee. Chairman Rhodes for a mourning order. Thank you, Mr. Speaker. We're blessed to have a state that is blessed with many great resources. Today is Keep Georgia Wild Day here at the Capitol. This annual event gathered sportsman and coastal advocates from across the strait state to celebrate their contributions to Georgia's economy and quality of life. Hunting and fishing is created almost 40,000 jobs for Georgia's, generated 216 million in state and local tax revenue, and has a total economic impact of almost four billion dollars. I want to thank these individuals and the DNR Commission and more Williams for what they do to ensure that our wildlife populations are maintained properly and can't thrive. Thank you, Mr. Speaker. Chair recognizes Representative Al Williams for a mourning order. I don't see him. Chair recognizes Representative Kendrick for a mourning order. Good morning, Mr. Speaker. And good morning, colleagues. I am presenting your Black Fact for today because every day is a day for Black history. And today, Mr. Speaker, it took me two hours to get from life-thuling to the state capital. And I plan on writing a very angry email to my state legislator. And hopefully they can fix that issue. But I wanted to highlight Mr. Garrett Morgan, who blazed a trail for African-American and vendors with his patents, including those for hair straightening product, a breathing machine, a revamped sewing machine, and an improved traffic signal. Mr. Garrett was the first Black man in Cleveland to own a car and he worked on his mechanical skills and developed a friction drive clutch. Then in 1923, he created a new kind of traffic signal, one with the warning light to alert drivers that they would need to stop after witnessing a carriage incident. He quickly acquired patents for his traffic signal, which is the modern version that you see of the three-way light today in the United States, Britain and Canada, but eventually sold the rights to generally electric for $40,000. This is today's Black Fact and thank you, Mr. Speaker. Chair recognizes representative Elmadi Holley for a morning order. Thank you, Mr. Speaker. Today I ask that we stand and honor the 176 victims of the Ukraine flight PS752 that was in route from Iran. Among those victims, there were peace-loving humans flying back to their families unaware that their lives would be sacrificed. These include Shedash Akku, age 41, Valeria Overchuck, age 28, Maria Miyachuk, age 24, unintended victims themselves citizens from American ally countries, Canada, Germany and England. Unaware of an unescalated war, may we honor them today and let us unite in a moment of silence. Thank you. Chair recognizes chairman Hauston for a morning order. Thank you, Mr. Speaker. It's with the sad heart that I come before you today to tell you of the passing of one of our former members. Last night, Hansen Carter, who served this state and this country well, passed away. And I would like to remember that silence and Hansen, Hansen not only served the state of Georgia and he was head of the agricultural farm service. He represented the district in South Georgia for many years and he served as mayor for many, many years. He was a true public service. And I just want to tell you, his daughter also, you might know, is Chandler Hayden and please think about the family in these coming days. And if we could have a member of silence, please. Thank you, Mr. Speaker, and I'll leave the well. Chair recognizes chairman Alan Powell for a morning order. Thank you, Mr. Speaker. Just to echo a lesson, you might have learned from chairman Nick Swalligo, always read something before you sign it. But I want you to take pay attention on your desk today. You see the lottery oversight report. And I understand how the house says that you get so much clutter on your desk, it might get swept away. I would encourage all to take this and to read this document. It was a very comprehensive work and I want to thank the members of the regulated industry's committee for all the work and the time and the forward thinking they put into it and into digging into the operations of the lottery and even some of the other repercussions as to the drain on the lottery. So if you would, pay attention. This on your desk, care it with you. And if you can, I'm sure you can probably get an extra copier, so but please do. And I thank you so much. Chair recognizes representative or chairman Petrie for a morning order. Thank you, Mr. Speaker. I just want to make sure everyone here is aware that the service providers association for developmental disabilities is here today. Spat as an organization that is dedicated to providing the best care to individuals of developmental disabilities in this state. As most of you are aware, Georgia has doubled down on making sure that individuals with developmental disabilities are given the best care in this state and removing individuals developmental disabilities absolutely out of institutions all across the state. Those providers are here today. Make sure you recognize them if you get a chance. Thank you, Mr. Speaker. Chair is going to ask our special friends up in the gallery to please understand that we're still conducting business and some of the noise level kind of needs to go down. Chair recognizes representative Morris for a morning order. Good morning, Mr. Speaker. The Forsyth County delegation today rises to honor one of our local citizens Miss Muriel Jackson. Miss Jackson is the mother of three, the grandmother of five, and the great grandmother of three. She's involved in her local community, both at her church and civic activities. And her most positive attribute is that she has me for a son-in-law. We want to wish her a happy 90 second birthday from the house today. So if you'll join me in congratulating her on her birthday. Thank you. Provost Sherrod. Chair recognizes to introduce the doctor of the day, Representative Holland. Good morning colleagues. It's my pleasure today to introduce our doctor of the day. Dr. Saida O'Marova is a family medicine and urgent care physician at Northside Family Medicine in Midtown Atlanta. She received her undergraduate degree from Emery University and then went on to Ohio State University to complete her residency. We won't hold that against her. She returned to Atlanta in 2015 and has been an active member of various medical organizations in Georgia. Please welcome our doctor of the day. Thank you for your hard work legislators. Good luck and I appreciate the opportunity. Thanks. The house is going to stand at ease until about 1055. So stay close to your desk and we'll come back in then and start the proceedings for the state of the state. We'll be at ease till 1055. I've been asked to make an announcement that the Committee of Escort needs to report downstairs to the governor's office.\n\nthis here just a moment where we're trying to find the Georgia State Senate. Okay, members of the House, members of the House, I know that not all of you have had the opportunity to greet Senator Isaacson, but hopefully he'll be around after the State of the State and you can have that chance. Chair is calling to order this joint session of the 2020 Georgia General Assembly. Ms. Dorkieper. Mr. Speaker, the President, President, Pro Tem and the Senate of White Answers to the House Chamber. Ms. Dorkieper, please allow the President, the President, Pro Tem and the members of the Senate to enter the House Chamber and will the messenger please escort them to their designated seats. Ms. Dorkieper, please admit to the Chamber of the House the justices of the Supreme Court of Georgia, the Chief Justice Harold D. Melton. Ms. Dorkieper, please admit to the Chamber of the House the judges of the Court of Appeals of Georgia, Chief Judge Christopher J. McFadden. Ms. Dorkieper, please admit to the Chamber of the House the justices of the Court of Appeals of Georgia, the Chief Justice of the Court of Appeals of Georgia, the Chief Justice of the Court of Appeals of Georgia, the Chief Justice of the Court of Appeals of the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the Court of Appeals of Georgia, Chief Justice Harold Dorkieper, please admit to the Chamber of the House the personal person to me and to this body, the Speaker Proteam Jan Jones. The President of the Senate who got his training here in this house, Lieutenant Governor Duncan, Lieutenant Governor Duncan. The President Proteam of the Senate, he's out, here he comes. Probably selling a car out there. Three of the most important people, the most important people to the work of this body, beginning with a lady that has walked through the valley with me and along the tops of the mountains and truly the light of my life, the first lady of the house, Sheree Bradburn. And a lady who I know does the same thing for the Lieutenant Governor. And this first lady of the Senate, Brooke Duncan and their son Parker Duncan, please stand. And our very distinguished first lady, Marty Kemp and their daughter Amy Porter Kemp. We also have two very special guests with us today. They're both statesmen and I'm pleased to say they are both friends. One pulled this state out of the worst recession that had been experienced since the 1930s. He led on historic reforms to our criminal justice system and under his leadership, Georgia started its streak of seven consecutive years as the number one state in the nation in which to do business. Please welcome back Governor Nathan Diel and First Lady Sandra Diel. Only one Georgia in the history of this state has served in both the Georgia House of Representatives and the U.S. Senate and in the U.S. Senate. And his career has been a leadership model for those of us in public service integrity,lessly reforming strict statutes and alertness ofesque, intercity being ecclesiastical. now we're going to keep him busy. Few Georgians, few Georgians will have left their footprint on the history of this state, such as Johnny Isaacson there. Please welcome Senator Johnny Isaacson. Mr. Speaker, I'm sorry, the Governor Brian Peacamp awaits interest into the House Chamber. Madam Dorkey for please allow the Governor. His Committee of Escort and his distinguished access to the House Chamber. Thank you. Mr. Clark, would you please read a caption to a resolution? The House Resolution 878 by Rips and Burns 159th, a resolution calling a joint session of the House of Representatives in the Senate for the purposes of hearing a message from the Governor, inviting the Justice to the Supreme Court and the Judges of the Court of Appeals to be present at the joint session and for other purposes. Members will please take their seats. This session will continue to be at order. Brian Peacamp has had a very distinguished career as a member of the State Senate, a successful businessman, did a tremendous job for the State as Secretary of State and was elected in November of 2018 to be the Governor of Georgia. He has led this state in a very strong way and reflective of the fact that he has a heart for all of Georgia. I am proud to call him my friend and I am proud to call him my Governor. Please make welcome today, Governor Brian Peacamp. Thank you all. Thank you very much. Thank you all so much. Thank you all very much. Thank you for the kind introduction, Mr. Speaker. Lieutenant Governor Duncan, Speaker Austin, Mayor Bottoms, Governor Mrs. Deal, President Pro Tem Miller, Speaker Pro Tem Jones, and Members of the General Assembly. Constitutional officers, members of the Judiciary, members of the Consular Corps, and my fellow Georgians. During my first state of the State speech, I talked about a wise builder who put his house on a sure foundation. The rain and the winds came, the flood waters rose, but the house stood firm. I tipped my hat to Governor Deal and those lawmakers that came before me, those who poured the concrete and laid the footings, hard work in Georgians who left this place better than they found it. One year ago, I urged those in this room, in this historic space, to join me in building a safer, stronger, and more prosperous state. A state where small businesses are empowered to grow, invest, and thrive, where government is responsive and effective. A state where health care is affordable, accessible, and where the rights of the unborn are protected. I ask lawmakers, both Republicans and Democrats, to join me in the fight for Georgia's future, to crack down on gangs and sex trafficking, to invest in education and our educators, to stand up for our values and those we value, to put politics and partisanship behind us in unite for the greater good. Over the last 12 months, we have realized incredible success and endured hardships. We have seen the fruits of our labor and we have seen the power of God's providence. In 2019, we stood together on the construction site, building on a sure foundation. I'm proud of what we accomplished, but there's still more work to be done. As your governor, I have been honored to travel this great state. In everywhere I go, I start out by saying the same thing. It is a great time to be a Georgian, wouldn't you agree? Right now, our unemployment rate is 3.3%. That's the lowest in our state's history. We have a record number of hard work and Georgians in the workforce. Our state is the number one place for business for the seventh year in a row. During the last 12 months since I addressed this joint session, we have added over 64,000 private sector jobs. Of the 371 economic development projects announced by the state in 2019, 79% of them were outside of Atlanta. In communities like Cairo, Carter'sville, and Commerce, creating economic opportunity no matter what your zip code. The state of the state is strong and folks we are just getting started. I was raised to work hard and I know that my mom who's in the audience today remembers driving me around with a pushmower in the trunk of her red Buick-Lassabre. I had a bunch of odd jobs growing up, but construction is the one that stuck. There's something about the process that drew me in. Every step is important. Every moment matters. I started with a pickup truck and a shovel, digging ditches, pouring concrete and hammering nails. Over the years I've built homes, apartments, light commercial, multi-use. I've volunteered on habitat houses, remodeled the rape crisis center in Athens, and even built my own home where we live today. But I will be honest, I'm proudest of what we are building right now. Under this gold dome, we have framed the house with strong Georgia-grown lumber, cutting a local sawmill and brought to the job site. In year two, it's time to set our sights on the sheet rock, the siding, and the bricks. Each side of the structure will protect those inside by providing an environment, right for learning, opportunity, and growth. Every window looks to the future, a door that welcomes those in need and those who won't help. While Republicans and Democrats disagree often, we all know the value of a good education. We know the impact that a teacher can have on a student. We know that learning has the power to lift people out of poverty and help many realize their full-god-given potential. As we move forward as a state, we must reaffirm our commitment to Georgia schools. Trust parents to make decisions in the best interests of their children. Support our superintendents, teachers, counselors, and specialists as they work to educate and inspire the next generation. I want to applaud Governor Deal and First Lady Sandra Deal, who are in the gallery today for fully funding quality basic education and for investing in early learning for Georgia students. Thank you, Bob. I also want to thank this legislature for working together to champion education.\n\nin the 2019 session. Together, we fully funded QBE for the second year in a row. We provided over $69 million in school security grants for all 2,314 schools. We increased funding for mental health services in our high schools. And we gave teachers a long overdue in historic pay raise. I am so proud of our teachers and school leaders for what they do on a daily basis. And while we spend a lot of time honoring athletes and elected officials, these are the public servants who really deserve the credit. Joining us in the gallery today are two hard work in Jordans who deserve all the accolades and applause that we can muster. Miss Samantha Fury of Newton County is George's superintendent of the year for 2020. I thank you. We also have Ms. Tracy Pendley of Atlanta Public Schools who is our 2020 Georgia Teacher of the Year. Let us thank her as well. To truly honor their service, we have some work to do in the days ahead. Let's fully fund public school education for a third year in a row, accounting for growth in resources needed to properly educate. Just dismantle the remnants of common core, reduce the number of tests, and give teachers the opportunity to do what they best. Do best. Teach. And finally, let's give our educators another well-deserved pay raise. In my budget, I have included a $2,000 pay raise for all public school educators. This raise will continue to enhance retention rates, boost recruitment numbers, and improve educational outcomes in schools throughout Georgia. By investing in education, we can build a strong house, a place where everyone learns and all Georgians have the opportunity to thrive. As a father of three, I know that a healthy home is a happy one. The same is true in our state, and while we are the hub for job creation and business growth, we also live in a state where many hard work in Georgians can't access quality health care. Premiums are too high, and many families have to compromise coverage because of the cost. Empowered by the patient's first act, we crafted a Georgia-centric health care solutions to lower health care cost, reduce insurance premiums, enhance access to top-notch care, and ultimately improve health outcomes for Georgia families. For nine months, we developed two unique and innovative health care programs that meet the needs of hard work in Georgians. Keep our budget balanced and reflect on our values and vision as a state. These proposals, Georgia Access and Georgia Pathways, shake up the status quo and put patients first ahead of the special interest. While these reforms will provide a new pathway for 408,000 Georgians to access affordable care, lower insurance premiums for millions more, this is only the beginning. We have friends and neighbors who need our help, so we must keep chopping. Right now there are countless families who just receive a surprise medical bill in the mail. A specialist who is out of network, a procedure that wasn't approved or covered, nights in the hospital that didn't meet the requirements. We have hard work in Georgians who, by no fault of their own, are on the brink of bankruptcy because there's no transparency in health care billing. Families are living on a prayer because the system is rigged against them. This year we will implement long overdue reforms that put our families first. Working with patients, providers, and the private sector will craft legislative remedies to reduce surprise medical billing. We will demand transparency, embrace empathy, and insist on fairness. We will take care of each other in sickness and in health. Now I know that reform, especially in health care, is dawning. And while the road ahead is long, there are plenty of men and women who have gone before us, bold leaders and public servants who blaze the trail and set a standard for countless Georgians to follow. One of these people is Senator Johnny Iserson. Upon the year of the Georgia Republican Party, Johnny Iserson is a man of character and incredible determination. He served under this gold dome in the Georgia General Assembly, chaired the state board of education, and went on to represent Georgia's sixth congressional district in the U.S. Capitol. And for 15 years, Johnny Iserson was our U.S. senator. He is a gentleman, a statesman, and a true patriot. Like you, I was incredibly saddened when Johnny announced that he had Parkinson's disease. And again, when he called to announce his retirement from the U.S. Senate. While I'm confident that Kelly Leffler will do an incredible job representing our state and our best interests, we are truly losing a giant in Washington. I've heard it said that words matter, but actions mean more. That's why today I want to take another step in honoring Johnny Iserson's service. Right now, over 20,000 Georgians are living with Parkinson's disease, with new patients diagnosed every single day. And while treatable, Parkinson's disease has no cure. I don't know about you all, but I want to change that. Thanks to the leadership of President Jerry Morehead, we are creating a Johnny Iserson professor ship for Parkinson's research at the University of Georgia. Once recruited, this PhD researcher will develop better treatments for patients like Johnny, better medication, and a better quality of life. Through this partnership, we will use technology and innovation to break new ground. With the grit and the resolve of Johnny Iserson, we will move one step closer to a cure. Our house here in Georgia will be a healthy one, with a big frame photo of Johnny right there on the wall. Our children and our grandchildren will walk past and ask about the statesman pictured. His story is Georgia's story. His legacy will live on for generations to come. Ladies and gentlemen, please help me again welcome and thank this great man for his great service to our state. Senator Johnny Iserson. RAbsents. Thanks. While Georgia is experiencing historic growth, we have a statewide threat that undermines our safety and our future. Criminal street gangs continue to grow in size and scope, impacting every county and every part of our state. These organized crime units are flooding our streets with weapons, violence and fear. They are ripping apart the fabric of our communities. They are eroding the foundations of our families. This year with your help, we launched the anti-gang task force at the Georgia Bureau of Investigation. Under the bold leadership of Director Vic Reynolds, we are partnering with local law enforcement and prosecutors to stop and dismantle gangs throughout Georgia. We are providing the resources and training needed to put these dangerous criminals behind bars. We are working around the clock to keep our neighborhood safe. While Georgia already has tough gang statutes on the books, there's more that we can do to stop violence from taking over our state. There's more that we can do to prevent another innocent person from being shot, another law enforcement officer being killed. And while summing the media refused to acknowledge the gang crisis, I don't have to convince Debra Ryder. A decade ago, Debra's son, Nicholas, was sleeping in his room when gunshots rang out and ripped through the walls. A drive-by shooting organized by a local gang left Nicholas dead at the age of 10. Debra, we are sorry for your loss. And while we can't bring Nicholas back, we will champion tough anti-gang legislation in his honor. Thank you for being with us. This session, we will empower law enforcement and prosecutors. So these people will get the justice that they deserve. We will work around the clock to prevent this tragedy from happening to another family, another Nicholas in our state. We will do our part to make this right. Ladies and gentlemen, please help me thank Debra again for her service and her relentless commitment to honoring her son's life. Thank you for being with us today. Gangs and drug cartels are feeling another public safety crisis. Every day hundreds of people are bought and sold for sex in our state. Traffickers use Atlanta as a hub, trading human life like it's a commodity. Early after taking office we created the Grace Commission to help coordinate efforts into modern day slavery in our state. Under the leadership of our First Lady, Marty Kemp, the Grace Commission has worked to raise awareness. They have partnered with elected officials, law enforcement, nonprofit organizations, and those that had been in the trenches for years fighting human trafficking. They had traveled the state to sound the alarm and urge action. During this time Marty has met some incredible inspirational Georgians who have devoted their lives to help another others. Today in the gallery we are honored to have Katie, Shemika, and Nikki. Sadly these women have something in common. They were trafficked as kids, robbed of their innocence and childhood, forced to see and experience things that we cannot imagine. But these women are survivors, their fighters and their powerful advocates who are working to turn Georgia into a safe haven for those who have no voice, who exist in the shadows and who need an ally to shine a light into the darkness. Members of the House and Senate, we are asking once again for your help to win this fight against human trafficking. We must advance legislation this session that closes loopholes that leave children vulnerable to exploitation. We must help victims tell their story in the courtroom without the fear of retaliation. We must support survivors who want to enter the workforce but still bear the scars of the past. The House we are building will be safe and secure and we will not stop working until it is. I hope you will join me in applauding the bravery of those that are with us in the gallery today. I also hope you will join me in thanking our First Lady Marty Kemp, our daughters, Jared Lucy, Amy Porter, as well as the members of the Grace Commission. If you all stand, thank you so much for raising awareness. The state and the country are taking notice. We are a blessed people, Americans who proudly live in our nation's greatest state. But what makes us great is not just what we produce on the farm or in the factory. We are great because of who we respect and what we value. During the debate on the heartbeat bill, I would always start by saying a simple statement. Georgia is a state that values life. Honestly, it's hard to disagree with that. We live in a place where every person matters. Younger, old, richer poor, any race from any place. As a pro-lice governor, I believe we need to protect the unborn and the born. We have to... Thank you. We have to defend those in the womb and then champion those when they leave the delivery room. It's incredibly sad how many children are abandoned in our hospitals, hundreds every year, living, breathing babies discarded, forgotten, innocent and full of potential, now awards of the state. Over the years, the General Assembly and Governor Deal have made incredible progress in updating our adoption laws in Georgia. It's now time to build on those efforts. First, we will triple the adoption tax credit from $2,000 to $6,000 to help offset the incredible cost of adoption. We will lower the adoption age from 25 to 21, so more qualified Georgians can adopt and more children can be placed. Finally we will launch the family's first commission so we can begin to change the way our state's foster care system operates and serves the most vulnerable among us. Our goal is simple, keep our kids safe to encourage adoption and ensure that every young Georgian, no matter where they live, have the opportunity to live in a safe, happy, loving home. In closing I want to tell you another Bible story about a builder, a man from the Old Testament who took on a massive construction project. You see, Nehemiah learned that his hometown was in ruin. The city gate was destroyed and the people were in turmoil. With a blessing from the king, he traveled back and started building. He shook up the status quo. He brought hope to a hopeless place. There were distractions along the way, those who wanted to slow his progress, some who wanted Nehemiah and his building project to fail. But he had a calling, a clear desire, a goal to build, restore and revive. When the opposition came calling, he always delivered the same message. There was pressure in prodding, but Nehemiah responded, I am doing a great work and can't come down. He refused to leave the job site until the project was done. He refused to let division divide his attention from the task at hand. Like Nehemiah, we are doing a great work right here in Georgia. We have a construction project that demands our attention. We have a people who are counting on us to get the job done. So let's put the politics aside and build a state where we invest in education. Let's build a state where we lower healthcare cost and improve access for patience. Let's shake up the status quo and build a state that is safe where gangs and sex traffickers want to leave and families want to stay. Let's live out our values and build a state that gives all Jordan's the opportunity to live, grow and prosper. A house where all are free to realize their full God-given potential. These 2020 folks is a year for building. Pick up a hammer and keep working until the project is complete. Because remember, we are doing a great work and we can't stop chopping. Thank you. May God bless you and God bless this great state that we are honored to live in. Thank you very much. Great job. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Ms. Dorkey, will the committee of escort will be asked to escort the Honorable Brian P. Kemp, Governor of Georgia and his distinguished guests from the Chamber. Chair recognizes the Senate President Proteum for emotion. Mr. Speaker, I move that we dissolve this joint session of the Georgia General Assembly so we can all go home and sell a car. In the case of the House of Representatives, we are going back to work. Mr. Speaker, as they say, there is a first time for everything. On the motion of the Senate President Proteum that the joint session of the Georgia General Assembly be dissolved, all those in favor of the motion will say aye. Those opposed will say no. The eyes clearly have it. And this joint session is hereby dissolved. Members of the House will remain in the Chamber. We're going to need about 15 minutes to remove all of the equipment that's in here so that we can properly conduct business. This House is going to be at ease until 1215 and then we will come back into session and stay until we're finished. 15 minute recess.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nIs there any objection to adopting the privileged resolutions? The chair here's none and the resolutions are adopted. We have a supplemental rules calendar and also I think we have some other business. Chair recognizes the chairman of the House Ways and Means Committee, Chairman Harrell, for a motion. Thank you, Mr. Speaker. Ladies and gentlemen, on the House, I move that we adopt the Conference Committee report on House Bill 276. Chairman Harrell has moved that this House adopt the Committee of Conference report on House Bill 276. The clerk will read the Conference Committee report. The Committee's of Conference on House Bill 276 recommend that both the Senate and the House of Representatives recede from their positions and that the Attach Committee of Conference substitute, HB 276, be adopted. Mr. Steltler, the 52nd, doobin, the 30th, Henson, the 41st, Harold, the 106th, Williamson, the 115th, and $1 of the 45th. Chair recognizes Chairman Harrell to explain the Committee of Conference report on House Bill 276. Thank you, Mr. Speaker. Ladies and gentlemen in the House, this is the bill that this body passed twice last session called the Marketplace Facilitator Bill. What it attempts to do is identify the responsible entity, the entity that is responsible for collecting and remitting sales taxes to the state of Georgia. There's some good news. Just released this morning. Holiday sales were up 4.1% this season. Online sales up 14.6% this season. The bad news is 53% of those sales are now online and not in brick and mortar stores. The 47 out of 45 states that have a sales tax have already passed legislation like this bill that is before you today. Failing to pass House Bill 276 puts Georgia retailers at a further disadvantage because if a Georgia retailer happens to ship a product outside of the state to any one of those 37 other states, they're going to collect and remit sales tax. If a competitor to a Georgia company ships a product into Georgia and we do not pass this bill, we will not collect that sales tax and your Georgia retailer will be at a disadvantage to those retailers outside of Georgia that are shipping into the state. This bill does not tax any product or service that is not taxed today. There's no expansion of taxable products and services. If it's currently tax, it will remain taxed. If it's currently tax exempt, it will remain tax exempt. No expansion. No rate change. No tax rate is going up or coming down in this bill. This bill simply identifies the entity responsible for collecting and remitting those taxes already do. The bill is supported by GMA, ACCG, Georgia retailers, Amazon, Google, Walmart, Home Depot, and the list goes on and on and on. You will recall some of our rideshare companies were concerned in years past from Uber, the item on the newspaper's website this morning is incorrect. Uber is sending a request right now for correction. We will ask for action on rideshare after facilitator bill passes. Mr. Chairman, I don't know who they're talking about in this article, but it's not lift. We have no desire to work against marketplace facilitator. This bill will, I believe, at a minimum result in over $100 million in additional revenue to the state of Georgia and our local towns and cities. This is revenue that is, as I mentioned before, currently do do and going uncollected. Certainly we'll have an impact on the budget pressures that we're all aware of. And so I would ask that you give favorable consideration to this measure. All those interested parties that I mentioned before have been active participants in crafting this legislation. I received a nice letter from our nice response from the Georgia Society of CPAs. They sent this legislation to a number of their members that are working across the nation on legislation like this to make sure that it is consistent and streamlined. And their response was that this bill was very well crafted and meets the same intent as those 37 other states have done. So they think that it will be able to be implemented in an efficient manner. And that will, especially on those national retailers and those national platforms that they will be able to implement it without much difficulty. I would just be glad to answer any questions, specific questions about the conference report or what it is we're trying to achieve with House Bill 276. Chair recognizes representative Wilkerson to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Yes, sir. You say that there's not going to be any new taxes, but $150 million is coming into the state. I guess my concern is not necessarily leveling the playing field. I agree with that. It is why do we have to wait to fix the Uber lift side because I'm fine with you working out a deal with Uber and Lyft. But I actually represent the 50,000 plus people at home that are going to be paying more taxes that use Uber and Lyft as a way to get around for a lot of lower income families. That is their transportation services. To that point, Cobb County is actually looking at Uber and Lyft as a way to be their transit system. So is there a reason why we did not include the five lines that the Senate had in the original bill to exclude Uber and Lyft? Several reasons, yes, sir. First, there is a question of whether or not that service is taxable or not. That question is before the tax tribunal today in litigation. So clearly, if the service is not taxable, the bill has no impact on them whatsoever. Second, as going through this process, as you might imagine, there are a number of different groups and entities that wanted a special favor for that industry or a special favor for that company. Beginning to open the bill to say, we're going to credit this company or this industry with a special favor in the bill would lead to multiple companies and industries making the same request, which would effectively collapse the ability to pass the bill at all. So what you have before you today is an absolutely clean measure that does not carve out any industry. You would expect that there will be other groups and industries going forward that may have standalone legislation. Just as we do every year in ways and means with a credit or an exemption for one industry or another. And we think that that's the better, more appropriate way to handle the evaluation of that request as a standalone measure. Does gentleman further yield? Yes, sir. So to that point, whether you open that bill up now, whether you open that bill up later, we will be passing one of the largest tax increases on the state of Georgia. And all I can worry about right now is the bill in front of me. So is it not true that I am very concerned about passing that tax increase when we heard this same promise 10 months ago that Uber or Lyft would be fixed? So is that not true? I would disagree representative. And this again, you make a judgment for yourself. Is the service taxable or not? If it is not, this bill has no effect on it. If it is taxable, I would ask you to ask the follow-up question, why has that tax not been paid? Yes, sir. Chair recognizes Chairman Setslor to your right for a question. Does Jim and you appreciate your bringing this. I wanted to ask a clarifying question for myself. I have real concerns, typically, when we are picking winners and losers that the sale of a product that this entity might not have to tax it. I have issues really across this body when we pick, we get special status to one versus another that is similar in position. Isn't it true that this bill really just makes different sellers or facilitators as it were who would be selling the same product to have the same tax status for the sale? Yes, sir, it is. But I just wanted to thank you because I have a real aversion to this idea of picking winners and losers and I think there are many among us who have that same concern. I think this bill levels the playing field and really turns the corner on that and I think we can all be proud of. I agree. We all have our favorite companies and our favorite industries. But if you meet the standards in this piece of legislation, if you do meet the requirement that you are a facilitator, if you are selling a taxable good or service in the state of Georgia, you are included in this bill without exception. There is no car about of any kind for anyone anywhere. If you are selling a taxable product in Georgia and meets this threshold, you ought to be collecting and remitting. Keep in mind, if we are collecting and remitting the taxes that are already due, at the state level that releases the pressure on income taxes. At the local level, if you are collecting and remitting the sales taxes that already do, that releases the pressure on your property taxes. We can't serve our state in all the varied interests if we are allowing various groups to be exempt or if we are not collecting what ought to be collected today. Again, keep in mind, 37 states have already passed this bill 37 out of the 45 that have a sales tax. So this is going to put Georgia at a further disadvantage. I would ask you if you have a favored industry, how they are competing in the other states that have already passed the measure, I think you will find that they are doing just fine. Chair recognizes representative Oliver to your left for a question. Does the gentleman yield? Yes, ma'am. I have attempted to follow the litigation before Judge O'Neill and the tax tribunal and attempted to be patient with all of that process. Does this bill mood that litigation? Does this bill give evidence to that litigation on behalf of Uber or on behalf of the taxpayer? Explain all that to me, please, sir. I will do my best. I don't believe it does either. I don't believe it renders that litigation or that argument invalid in any way. Again, I think their argument is that perhaps they are not subject to the existing transportation tax. And again, this doesn't tax any product that is not currently taxable. So prevailing in that case, it has no impact. Yes, ma'am. I'm concerned that it's going to extend the litigation, that it's going to add new barriers or new wrinkles or new support for one side of the other. That's my concern and I'm confused about that. Do you further yield? Yes, sir. Chair recognizes Chairman Houston to your right for a question. Is it not true that more and more people are shopping and buying online? Yes, ma'am. Is it not true that if you were buying some of this merchandise from your local merchant, you'd be paying taxes anyway? That's true. And is it not true that it's a brick and mortar people in towns that have to support your schools, pay your property tax? And if more and more people shop online, we're going to have less and less money to operate on. Yes, ma'am. Is it not true if I have to pay taxes on a blouse that about in a basis that if I ordered online from eBay, I'll pay taxes too. According to current state law, Georgia's assails in the use tax state, you the consumer are liable for the same equivalent value as a use tax. But as you understand, it's impossible to collect from 11 million individual consumers. And what this bill does, it says that online facilitator, that out of line facilitator that sold you that blouse will collect and remit on your behalf. Well, is it not true that the facilitator has to have a certain 100,000? Yes, ma'am. That's the minimum threshold. The minimum threshold is 100,000. Yes. So it's not true if we go stand up for our local merchants and try to keep economy on a local scale, especially in a small town, you vote for this bill. I would hope that's the case. Yes, ma'am. Mr. Speaker, I appreciate the time, members of the House. This is an important bill for Georgia. We all have individual desires and needs and industries and companies that we support. There are ways to do what it is that you might want to do. This bill is clean. It is consistent with what is being passed across the nation. It is important for the state of Georgia to continue our competitive stance and to support those businesses in Georgia doing business and competing around the country. I'd ask for you to favorably consider this bill and to vote yes on this conference committee report. Mr. Speaker, I'll yield the well. On the adoption of the conference committee report on House Bill 276. All those in favor of the adoption of the conference committee report will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the adoption of the committee of conference report. The eyes are 111. The nays are 54. This House has adopted the conference committee report on House Bill 276. We have a supplemental rules calendar. Clerk will read House Resolution 882. The House Resolution 882. The clerk of the 147th and others, recognizing the President Donald J. Trump and the brave men and women of the United States Armed Forces and intelligence agencies on their successful military operation. The neutralized, cussemed, soul of money and for other purposes this resolution never been referred to the Committee on Defense and Veterans Affairs. That committee recommends that this resolution be adopted by committee substitute. Chair recognizes the chairman of the Defense and Veterans Affairs Committee, Chairman Heath Clark, to present the resolution. Thank you, Mr. Speaker, members of the House. On January 3, 2020 members of the U.S. Armed Forces carried out a successful mission to eliminate cussemed soul of money. This mission was ordered by the President of the United States and the mission was authorized based on intelligence gathered by the intelligence community. So, the money was the leader of the CUDS force, a group that the United States designated a terrorist organization in 2007. Four years later, in 2011, the United States announced new sanctions on him and three other senior leaders of the CUDS force, in connection with the plot to assassinate the Saudi ambassador to the United States. The United Nations at that same time placed a travel ban on soul of money. This is a designation only for the most dangerous people in the world. Soul of money was responsible for killing over 600 American soldiers in meaning thousands more. There are members American citizens without limbs today, and all of our VA's across this country, hospitals, because of this man. This resolution we have today is simple and it's to urge the support and commend the intelligence agencies that gathered the information, the brave men and women of the United States Armed Forces and the Commander-in-Chief President Trump for this successful mission. A mission that resulted in the loss of zero innocent civilian life because of the precision and excellence of our men and women in the Armed Forces and the intelligence community that gathered the information to carry out this successful mission. And with that Mr. Speaker, I will yield for any questions. You have a couple of questions. I will yield. Chair recognizes representative Rogers to your right for a question. Thank you, Mr. Speaker. Well, the gentleman you, I yield, is it not true that there are protocols in place that the Commander-in-Chief used it? To make decisions of this nation? That's absolutely true. And it's not also true that those protocols have a long and storied history dating back all the way 50, 60, 70 years with national security advisers, intelligence agencies and everything else. And that those protocols have been used for the President to make a decision to keep Americans safe, including the Georgians that are currently serving in the Middle East. That's correct, yes, sir. And is that not further true that this country has always had the resolution that we would not in any form or fashion tolerate terrorism? And that is correct. Thank you, sir. Thank you. Chair recognizes Chairman Tarvan to your right for a question. Thank you, Mr. Speaker. The gentleman you? I yield. Is it not true after I heard of this resolution, I spoke with you on my findings shortly after this event took place. People I had met, the defense of supply chain at the DSCP, on this older center, and Kwanakow, including some people in the CIA, that their findings were that this was this person. Had been at war with us for years, including being responsible for killing hundreds of Americans and our allies, killing and maiming our allies and ourself will also let them return home with disabilities plus thousands of his own people. Is that not true? That is true. Is it not further true that this resolution speaks directly to the event of January the 3rd when this individual was taken out? And it commands our armed forces, our military intelligence, CIA intelligence, and our commander-in-chief. That is correct. This is specific to a certain mission in commending and urging the support for everybody involved in that operation. On January the 3rd, that is correct. That is two weeks ago from the mall. And I think it is very appropriate and a timely resolution. Thank you. Chair recognizes Representative Petri to your left for a question. Thank you, Mr. Speaker. Mr. Jim Maniel. Mr. Jim Maniel's title is not true, that peace loving people all over the globe celebrate the death of Selamon. I believe that to be true. And it is not true that the country of Yemen celebrated the death of Selamon and stated, and I am going to quote this, quote, to stabilize security and stability in the region and in our country. He in the Iranian regime, the chief sponsor of terrorism in the world, are responsible for killing and displacing thousands of innocent people in Yemen and the Arab world, in quote. Is that not true? I believe that to be correct, yes sir. Thank you, Mr. Chairman. Thank you. Chair recognizes representative Sains to your right for a question. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Is it not true that I'm privileged to represent the Naval submarine base, Kings Bay and the brave sailors and Coast Guard and Marine Corps attachments who provide national defense through the Ohio class submarine system? Yes sir, that is true. Is it not true that this state has air and Army National Guard attachments currently that put themselves in harm's way overseas? That is true. Is it not true that the decisive action of President Donald J. Trump and the brave men and women who are under his command have helped prevent unnecessary, have helped keep us in peace and keep those brave servicemen and women out of harm's way? I believe that to be true, I believe that this decisive action will prevent this man, Soleimani, from carrying out further attacks on our armed services that are currently deployed, including some of Georgia's own National Guard. Does the gentleman further yield? Yes sir. Is it not true that there is a lot for our state to be proud of and a lot of unnumerable actions of sailors, of servicemen, women across this state and across this nation that deserve equal commendation from this resolution, from the resolution, and that this scope of this bill is not to limit those brave men and women not to give anything but a specific and timely affirmation of their sacrifice through this bill. That is correct. Thank you. Mr. Speaker, I'll take one more. If there are any. Well, we don't have any. Oh, okay. Well, I know there are some people that wish to speak to the bill, so I will yield the well. There are a couple Chair recognizes Representative Bonner to speak to the bill. Thank you, Mr. Speaker. I rise today in support of House Resolution 882. It is both right and fitting that we as representatives of the state of Georgia pause and recognize the significance of what occurred on January 3rd, 2020, at the Baghdad International Airport. In a matter of seconds, the most despicable and most prolific terrorist on the planet was eliminated. And who was this individual? General Kaseem Salamani was the leader of the Kudz force within the Iranian Revolutionary Guard Corps. Throughout his career, Salamani was directly responsible for the deaths of hundreds of Americans, thousands of Iraqis, Iranians, Libyans, and scores of others across the Middle East. He was sanctioned by the international community for his activities. The recent interview General David Petraeus said it is impossible to overstate the significance of the attack that takes out Kaseem Salamani. This is bigger than Bin Laden. It's bigger than Al Baghdaddi. Kaseem Salamani was a very embodiment of evil. As an Army Intelligence Officer for over 23 years, I have served under four presidents, Democrat and Republican. And I have deployed in support of the Global War on Terror three times. The most recent deployment was to Iraq for 12 months. Throughout my career, I have witnessed firsthand the death and destruction delivered at the hands of Salamani. Thousands of improvised explosive devices detonated in Iraq bore the handprints of Salamani in the IRGC. His death was the result of countless hours of intelligence collection and the precision execution by highly trained members of our armed forces. The decision, however, to eliminate this terrorist was vested in one individual. Our President and Commander-in-Chief Donald Trump. As Commander-in-Chief of our armed forces, he is the very top of the chain of command. This speaks to the importance of this decision. I applaud our President for taking decisive action to remove the world's most dangerous terrorists. And I am eternally grateful for the men and women of our intelligence communities and our armed forces for placing themselves in harm's way, no matter who holds the office of President. They are the best among us for they are willing to give their lives for all of us. So Mr. Speaker, I'll close where I started and say it is fitting and right that we as the representatives of all of Georgia to pause and recognize the significance of this event. Thank you, Mr. Speaker. I will take any questions. You have no questions. Thank you, Mr. Speaker. I'll yield the will. Chair recognizes Chairman Belton to speak to the resolution. America has been fighting bullies for 250 years. Ever since 1770, our history has been dominated by a single thing. America never wants war. America never seeks war. But if you kill one of our citizens, you will face our wrath. Our guardianship of American lies begins before the beginning of America. On March 5, 1770, British soldiers fired upon American civilians. Those martyrs of the Boston massacre were led by Crispus Atts, the first American hero, a black, ex-slave who sacrificed solidified American opinion against the abuses of the British Empire. The death of an American and ex-slave, a man who had already won his own freedom, became the spark, the start of the American Revolution, and won the freedom of millions and millions of others. A few years later, during our nation's newborn infancy, Barbary Pirates attacked American merchant ships, Killing.\n\nand enslaving American sailors. The Spanish Empire advised the United States to offer tribute to these pirates. President Thomas Jefferson sent the Marines instead. The very first USS Enterprise to feed the British fleet and Stephen Decatur and Presley O'Bannon led the brave Marines and stormed the shores of Tripoli. A moment this from ever more moralized as Colonel Bill Hitchens knows in the opening stands of the Marine Corps him. On June 22nd, 1807, the British warship HMS Leopard attacked an American frigate just off the coast of Virginia. The British enslaved four Americans and killed another. President James Madison reluctantly responded with the war of 1812. Andrew Jackson and later became president, Andrew Jackson, the father of the modern Democratic Party, finished that war humiliated the British in the Battle of New Orleans. In March of 1836, 1500 Mexicans slaughtered 257 Americans. Remember the Alamo became the Battle Crywards General San Houston defeated Santa Ana, the Battle San Jacinto. February 1898, USS Maine was sunk in Havana Harbor. 260 Americans were lost. Republican president William McKinley reluctantly responded. Remember the Maine became the Battle Cry when we trounced the Spanish Empire. March of 1915, the RMS Lucitania, a civilian merchant was torpedoed by a German U-Boot U-20. 1,198 civilian passengers, including 120 Americans were lost. Democrat president Woodrow Wilson reluctantly responded in America into the World War I. As Sergeant Al Williams knows, the very first encounter with the American Third ID, which by the way, hails from Orts Stewart in Liberty County, Georgia, the German Empire sued for peace. On December 7, 1941, a date which will live in infamy, this Imperial Japan Navy attacked Pearl Harbor. 2,335 Americans were lost that day. Democrat president Franklin Delano Roosevelt reluctantly launched America into World War II. Freeing not only the people of Japan, but also the people in Germany who live in freedom today because of our response. On April 5, 1986, Libyan agents bombed the nightclub in Berlin. Three people were killed, including an American soldier. In response, Republican president Ronald Reagan reluctantly ordered an airstrike in Nellibia. On September 11, 2001, Al Qaeda terrorist brought down the twin towers. 2,977 Americans died that day. Republican president George W. Bush reluctantly responded, decimating the terrorist organization of Al Qaeda. Democrat president Barack Obama finished the job when he took out Osama bin Laden. It was President George Washington in his 1793 state of the Union address who said, we must have peace through strength. If we desire peace, he said, it must be known that at all times we are ready for war. There's a common theme here among Democrat and Republican presidents. It is best exemplified by President Teddy Roosevelt, speak softly, but carry a big stick. American never wants war, American never seeks war, but if you kill one of our citizens, you will face our wrath. The Reverend Dr. Martin Luther King Jr., you lawgized the very first American martyr in the forward of his seminal book, Why We Can't Wake. This is what this great Georgian said. He said, crispus attocks is one of the most important figures in American history, not for what he did for his own race, but what he did for all oppressed people everywhere. His heritage begins the beginning of America. The significance of these recent events pales in comparison with the monumental, cultural, spiritual sacrifice of crispus attocks, but their principle remains the same. America's response to the murder of one of her own citizens is the same now as it was 250 years ago. America never seeks war. America does not glorify war. America hates war, but if you mess with the bull, you will get the horns. I yield the well. Is there any objection to the previous question being ordered? The chair here is none of the previous question is ordered. We have a minority report. And under the rules of the House, the presenter of that will have 20 minutes. Chair recognizes representative Mike Clinton to present the minority report. Thank you, Mr. Speaker. Ladies and gentlemen of the House, this afternoon I rise to speak on House Resolution 882 and to deliver the minority report. Mr. Speaker, I first acknowledge my own personal commitment, dedication and loyalty to the service and sacrifices of the brave men and women of our armed forces. Regardless to the length of service, regardless to the branch of service, or occupation within our various services, I also recognize and honor the service and sacrifices of every member of this House military caucus. For the more, Mr. Speaker, I acknowledge and honor the service and sacrifices of the spouses and the family members of our armed forces. Likewise, Mr. Speaker, every member of the Democrat caucus from our leadership to our nearest rank and foul member has expressed nothing but unconditional loyalty and support to our military men and women. And we hold heartedly, recognize and command the brave men and women in the United States armed forces and our intelligence agencies on their continued service and sacrifices for our nation. Mr. Speaker, for any member of this Agha Subadi that has served for more than a day, hopefully, can attest to my relentless and untiring support of our military, regardless of whether we're speaking in terms of active forces, reserves, or national guard. And as a member of the military community, I am proud to have served. And I consider myself and my commitment to our military as a lifelong commitment and obligation. I am proud, Mr. Speaker, to be a member of the Army of One. Mr. Speaker, not only did my father serve and is a recipient of the Purple Heart, wounded and combat. My wife is a veteran. My son is a veteran. And my daughter is currently in her 18th year of active duty. And her daughter, my granddaughter, is on active duty at Ford Hood, Texas. We believe in our military. And we believe in our oath of enlistment to protect and to defend the Constitution of the United States of America against all enemies, foreign or domestic. And to further guard our country and its way of life. Mr. Speaker, I say that to make sure that there is no question as to my personal loyalty to our military. However, I respectfully submit that this resolution, Mr. Speaker, has absolutely nothing to do with honoring our military. This resolution is not about the brave actions of our military. This resolution is not about principles or protections. This resolution is not about policy. Simply put, Mr. Speaker, this resolution is clearly about positioning and politics. Every member of our Democrat caucus has expressed their unwavering support of our military. House resolution 882 does nothing to bring attention to the present matters for our service members, especially as it relates to affordable housing for our military families. Improve health care for our veterans. Vocational rehabilitation upon transition from military to civilian life or homelessness among our military families. It does not address the mental health crisis, social science, divorces, family separations, drug and alcohol addictions and dependencies, PTSD in our military community. Mr. Speaker, over the last 12 years, we have utilized our guard and reserves in unprecedented ways. But what we have not done is address the unique concerns and issues and challenges of our military community in unprecedented ways. This resolution not only serves as a distraction from the business that had. It does nothing to improve the lives of Georgians. As a matter of fact, Mr. Speaker, it does nothing to improve the lives and the conditions of a military in Georgia. But what it does is it burns valuable and limited time that we have here at the capital for the legislative session to do the people's business. The business we were set here to conduct. The Democrat caucus is interested, is ready, is capable, and certainly able to conduct the people's business. As we often say as the number one state in the nation to do business, that Georgia is open for business. Likewise, Mr. Speaker, the Democrat caucus is open for the people's business. Let's do business. The people of Georgia put their faith in us to utilize our 40 legislative days as efficiently and effectively as possible, ensuring that every passing moment of this session is spent in the best interest of Georgians. This resolution brings national politics into the Georgia General Assembly. When the people of Georgia would be better served by us focusing on the present issues facing our state. And so the call today, Mr. Speaker, from the Democrat caucus to our Republican colleagues is simply this. Let's do business. With that, Mr. Speaker, I yield the well. The gentleman has yielded the well. We now have the chairman's time. And by rule, that will be 20 minutes, and the chair recognizes chairman Clark for the chairman's time. Thank you, Mr. Speaker. I'll be brief. The gentleman from Clayton County is absolutely correct. This resolution has nothing to do with the myriad of issues that he spoke of. This is a specific resolution on a specific event. We have had numerous bipartisan bills in this house that we led on through the military affairs committee, study committee. That bipartisan support to address several of those issues. And we're going to continue to address several more issues that keep coming to our attention that we can address. And we've had bipartisanship across those on those issues. I don't know when he mentioned this is partisan and politics. I don't know when it became partisan to support the men and women of our armed forces and the intelligence community and their commander-in-chief who execute a mission to take out a known terrorist. When did that become a partisan issue? When did that become something that divided us? I don't know. Maybe y'all can tell me. Because the truth is the men and women executed a flawless mission that did not harm a single innocent civilian and took out the greatest threat to free the free world. A man that had killed hundreds, not thousands of Americans. A man who was killing his own people in his country and oppressing his own citizens had plans to carry out more actions against United States interests. When did this become partisan? Because of the name of the commander in chief? With that Mr. Speaker, I'm going to yield the remainder of my time to representative Mata-Han. The gentleman has that right. The chairman has yielded the balance of his 20 minutes to representative Mata-Han. Thank you Mr. Speaker. In 1977, my father left the country of bell bottoms, platforms, shoes, free speech, technological advances that rival that of American Western democracy. He left a country and a system of capitalism that allows families to achieve their own version of the American dream. Major cities were constructing buildings, not unlike the growth that we find right here in the beach state. Two short years later in 1979, my father's family fled a country that was being overthrown by radical Islamic regime. One that was killing their political enemies that didn't allow women the right to drive, that didn't allow my grandmother to inherit the family property. They weren't allowed to participate in a free and open society. Their economy was strangled by radical Islamists and it brought the country to a standstill. It's a sad day. When we learned that there are those that would elevate a man who was both directly and indirectly responsible for the death of hundreds if not thousands of Americans. Invowsons, if not tens of vowsons, of Iranians. No matter your clever with the methodology, carrying water for Selamani, a radical Islamic terrorist is carrying water for an Iranian militant regime. For 41 long years, the regime that I told us has pillaged Iran. Systematically robbing the people of their wealth, their dignity, and their God-given liberties. Iran is a nation where Christian evangelism is punishable by death. Political activists, protestors, college students, or in prison and tortured. Where the government shuts down access to the internet, distinely political rivals on a whim. This is a place where there hasn't been a legitimate election since before the release of the first IBM computer. I refused to accept that there were members in this body who were in interities banks. American and Iran's history is far too long and far too well known for those members to simply not know the brutality of the regime of Ayatollah. Shame on them. In a day and age where there are political operatives that opened the gong for Googles in political re-education, we have a grim reminder that the spirit of control and oppression is never far from our own shores or within our own borders and even with our own politics. Again, I say, shame on them. In the words of my father, as he marched with other Iranian-Americans in front of President Jimmy Carter's White House in Washington, D.C. in 1979, say no to come any. Say no to come any. I stand before you today as a member of the Georgia House of Representatives. And I say, say no to radical Islamic regimes. Say no to brutal Islamic enforcers like Soleimani. My family has lived through these atrocities. They lived through the fling of their homes to the unknown. They felt the impacts of changing themselves to the fence outside of a foreign US embassy knowing that if they were to return home, they would be dead anyway. At the hand of these Ayatollahs. For those that would elevate these radical Islamists, these terrorists, these war criminals, these those shame on you. Mr. Speaker, I'd you the well. Gentlemen, as you'll did the well, is there any objection to adopting the Committee substitute? The chair here's none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the adoption of the resolution? The chair here's none. The report of the Committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of House Resolution 882 will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the adoption of House Resolution 882. The the eyes are 93. The nays are 68. This resolution having received the requisite constitutional majority is therefore passed. Before we come back on Monday week, we will have members who will celebrate birthdays. Representative Josh McLaren is celebrating a birthday tomorrow, January 17th. Chairman Gerald Green on Monday, January 20th. Representative John LeHood, Wednesday, January 22. Representative Noel Williams on January 23, next Thursday. Representative Scott Turner on Thursday, January 23rd. Listen up for announcements. Listen up for announcements. Chair recognizes the chairman of the House Appropriations Committee, Chairman England, four and announcement. Thank you, Mr. Speaker. Ladies and gentlemen, starting next Tuesday morning at 9 a.m. and room 341 here in the Capitol will begin our first of three days of budget hearings. Those of you that are on the committee, we're looking forward to having you with us. Those of you that are not on the committee, you're also welcome to attend. The proceedings will be live streamed as well. And I'll go on and make this announcement today that if you're not a member of the committee, you're welcome to join us in the room. But I would ask that you allow committee members to set up the desk so they can open their books and make notes. The budget books are available. You should have an email in your house email account telling you the details, but they are available over at the House Budget Office on the fourth floor of the CLOV. You will need to sign for your book or if you send someone, they will need to sign for your book. Please bring that book with you to the hearings. That will be the book we will be working from next week. Look forward to seeing you all there. I hope you all have a safe travel home and safe trip back up here next week and enjoy your holiday. Chair recognizes representative McClain for an announcement. Thank you, Mr. Speaker. The working family cox will meet in room 307 at the CLOV for lunch. Please, if you get an opportunity, you want some lunch, come over to 307 at the CLOV. Thank you for speaking. Chair recognizes representative Bennett for an announcement. Thank you, Mr. Speaker. As we enter into this great holiday honoring a great Georgian Dr. Martin Luther King Jr. The entire house are invited on tomorrow to the Georgia Department of Community Affairs. Martin Luther King Jr. Holiday Tribute right here in the North Wing of the State Capitol beginning at 12 noon. 12 noon tomorrow. Join us. Thank you, Mr. Speaker. May I? The speaker, keynote speaker for tomorrow will be the Council General of Canada. Madam Nadia Theodore, thank you. The Chair recognizes the majority leader of the House for a motion. Mr. Speaker, I move this House stand adjourned until 10 a.m. Monday, January the 27th, 2020. The majority leader has moved that this House will be adjourned until Monday, January 27 at 10 o'clock a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Monday, January 27 at 10 a.m.",
  "updated_at": "2026-02-13T10:33:45.650412+00:00"
}