{
  "video_id": "65coXPnKDxk",
  "url": "https://youtu.be/65coXPnKDxk",
  "title": "Georgia House - Day 30 (2026-06-15)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 30,
  "video_date": "2026-06-15",
  "duration_minutes": 150,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 30 (2026-06-15)\n\n## Overview\nThe Georgia House session on June 15, 2026 featured the first reading of a notable bill, HR 1384, as well as procedural updates on safety measures and COVID-19 testing for members.\n\n## Key Actions\n**HR 1384**: A bill introduced for first reading, details not provided.\n\n## Bills Introduced (First Reading)\n- HR 1384\n\n## Notable Moments\n- Speaker provided updates on mandatory mask wearing, COVID-19 testing availability, and procedural changes for the session.\n- Speaker recognized Rep. Randy Nicks to provide the opening prayer and devotion.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\n- The Speaker directed the clerk to conduct the morning roll call.\n- Quorum appears to have been present, no issues noted.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "The hour for convening having arrived. All members will please take their seats. All members of this House will report to the room to which they have been assigned and take their seats. The clerk will ring the bell. We are about to have the morning roll call. We are about to have the morning roll call and the clerk of the House will audibly say on the roll call beginning with the chamber. Mr. Clerk, please unlock the machines and call the roll. Alexander Anola Woods, Ballinger, Bar, Barton, Belton, Bennett, Bentley, Blackmond, Boate, Bruce, Burns, Carpenter, Carson, Chocus, Clark, Collins, Cooper, Dimsey, Dickie, Dollar. The clerk, H, Collins, Cooper, Cooper, Corvette, Corvette, Dimsey, Dickie, Dollar, Donald, Drenner, Dubnick, Abstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glenn, Gravelie, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson, Jasper's, Jones, Kelly, Kendrick, Knight, LeHood, Lurekia, Lomston, Martin, Matthew, McCall, Morris, Newton, Nick's, Oliver, Parish, Parsons, Petrie, Perkel, Powell, Ralston, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Sussler, Silcox, Smith, L, Smith, R, Smith, V, Smyrie, Stevens, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yurda, Allen, Baysmore, Bernal, Cannon, Carter, Clark, David, Clark, Jasmine, Cook, Davis, Douglas, Blair, Dreyer, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Holly, Hopson, Howard, Hutchinson, Jackson, Derrick, Jones, Sheila, Jones, Todd, Jones, Vernon, Couch, Kennerd, Beasley Teague, Bonner, Bonner, Buckner, Richett, Caldwell, Campbell, Cantrell, Dickerson, Dukes, Campbell, Gileard, Rums 341, Beasley Teague, Connor, Buckner, Richett, Caldwell, Campbell, Cantrell, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, Dickerson, stress is increasing, Carry on, Mr. Clark. Room 341, Beasley T. Here. Honor. Buckner. Perchette. Call well. Campbell. Cantrell. Dickerson. Dukes. Campbell. Gamble. Gamble. Here. Gileard. Gileard. Here. Gordon. Gordon. Here. Green. Here, Green. Goal. Here. Jeff Jones. Woo! Here. Tom Kirby. Tom Kirby. Lot. Lot. Here. Mathis. Mathis. Here. Metz. Metz. Here. Brandon. Mom to have. Mom to have. Out there! If it's mom to hang on here. Park. Park. Here. Here. Pruitt. Pruitt. Rogers. Here. Singleton. Singleton. Stovol. Williams. Here. Here. Williams Rick. Williams Rick. Here. Here. Here. Thank you. Please the roll call. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Okay, we're going to do the gallery again. So, if you're in the gallery, listen up for your name and answer audibly. Loud and clear. Mr. Clerk. Allen. Here. Bassmore. Here. Bernard. Here. Cannon. Carter. Here. Clark. David. Here. Clark. Jasmine. Here. Cook. Here. Davis. Here. Douglass. Here. Dreyer. Here. Dunawhu. Here. Here. Awis. Herb. Airehard. Evans. Frasier. Here. Gilligan. Gertler. Hansen. Here. Hill. Here. Hogan. Here. Hale. Holland. Holland. Here. Hoppsom.稍 next. Howard. Here. Johnson Jackson Jones Sheila Jones Todd Jones Vernon Couch Kennard Lopez Romero Marin McClain McClaren McCloud Meeks Mitchell Moore Beth Moore Colton Morris Nelson Wen Paris Prince Pullen Robyshow Sainz Scofield Scott Shannon Sharper Smith Michael Stevens Mickey Stevenson Thomas Turner Wollensky Wilkerson Williams Mary Francis Williams Noel Wilson Okay what I want all members to do is to take a moment and look at the board and make sure that your name has been checked. Chairman Setsler. Okay Mr. Clark will lock the machines. First order of business has been successfully completed. Well welcome to legislative day 30. Doorkeepers will please close the doors and keep them closed. Before we have the chaplain I had a few housekeeping things I want to go ahead and call your attention to. The way we did the roll call is the way we will be voting so it's very important that we kind of keep noise to a minimum so people can hear their names called out. The first change that you will experience is when the chaplain has completed today there will be no greeting of the chaplain today or the remaining days in the session. People members will be speaking from the well on morning orders and on bills. Speak from your assigned seat and designated area we have mics to make a motion parliamentary inquiries and the like. In order to be recognized you will raise your hand and just bear with us because I've got people helping me monitor and we will try to make sure that we see you. Every member will have access to the house floor but we are strongly encouraging that the reserve space in the hallway back here be used for discussions and conversation in order that we can maintain social distancing standards. I wanted to announce that Augusta University is operating a mobile health unit which is located on the Liberty Plaza side of the capital and COVID-19 testing is available there. COVID-19 antibody testing will be available in the capital room 230 next to the medical aid station. The medical aid station now in the second floor will continue to be available for any acute healthcare needs that members may have. We have restrooms obviously still are accessible here on the floor. There is a ladies' restroom on the fourth floor but you will need to see the doorkeeper for a key to that for those in the gallery. Final point we sent out a memo last week and I want to thank again the bipartisan committee that worked really hard for several many weeks actually to help us implement the best practices that we could for the safety of members and expediting our business. I want to thank Leader Burns, Leader Tramble for their outstanding work, Chairman Hatchett Wipboate representative Newton, Chairman Mark Newton and all the staff people that assisted them on that. They did some great work and you saw the result of that last week which was incorporated into a memo we sent you. That memo advised in advance of today that the wearing of mask was mandatory. And I know that some people aren't happy with that and you're looking at one up here that's not real happy with that, frankly. But you know what it's not just for me, it's for others. And so those of you that are having some concerns about that, let me ask you not to be selfish but to think about your neighbor and where the mask, you can take it off if you're speaking at a microphone and the mask are also to comply with house rules on the dress code. So with that we're going to go ahead now and have our devotion. We will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. And thinking about today and who would be appropriate after we have been away for a long time and we've been through a lot, still going through a lot. It just occurred to me very clearly that we, a perfect person would be Chairman Randy Nicks. I don't know of anyone who is regarded for their integrity more than Chairman Nicks. He chairs our ethics committee in the house. He's a Methodist minister. He always has a sense of humor and his sermons have blessed me many, many times. And so I told him earlier today, I said that you know it came, I just sort of had a feeling it had to be you and I'm not going to defy that feeling but I am going to introduce to you now our chaplain of the day, Chairman Randy Nicks, a member of this body. Thank you, Mr. Speaker. You've already given me a chance to practice my prayer and in my first prayer has been answered. I was just praying we could get through the roll call. I've asked several people to pray for me. This is a day of great consequence and a lot of things are going on and I assure you before I start that I am the one that's standing in the need of prayer this morning. And it's not been that long since we were here but it seems like almost an eternity. I love the first line of an old George Jones song. He says, has it been a year since the last time I saw my God I could swear it's been ten. I feel that way today it's been about three months but I should seem like it's been three years or maybe longer. Just think of the headlines that we've seen since we were here last. Things that were in those headlines, the coronavirus, COVID-19 with over 2400 Georgians dead. Ahmad Arbery, George Floyd, Patrick Underwood, Rayshard Brooks, peaceful protest in the streets of Atlanta, violent protest with arson and looting in the streets of Atlanta, etc. These are the headlines and I could add to them, you know where I'm going but these are the headlines that we have experienced in the three brief months we've been away. As I thought about those headlines I thought about something when I was growing up over in Central Alabama there was a great morning show that came on on a little FM station in Montgomery and they had a guy by the name of Robert Charles who did the news and Robert used to always have this little tagline. He would read the news and when he finished he would say the moving finger rights and having written moves on I'm Robert Charles. Well I got curious about that and I went and I looked up that quote and I want to give you the complete quote. It was written by Omar Kayam, a Persian mathematician, astronomer, philosopher and poet and he writes this, the moving finger rights and having written moves on I'm Robert Charles.\n\nZong, Nor all the piety, nor wit shall lure it back to cancel half a line, nor all the tears wash out a word of it. Now, as this little verse points out to us, we can't change yesterday's news. It is what it is. And we can't run from it. We can't hide from it. And we can't deny it. So the issue becomes what will we do about it? When the speaker asked me to serve his channel in the day for today, a particular verse of Scripture came to my mind from the Old Testament prophet Ezekiel. Now, Ezekiel was a priest who became God's spokesman during Israel's exile in Babylon. He was called to warn his devastated and demoralized people of impending dangers. And here is what God said to Ezekiel in Ezekiel 22 30. God said, I looked for anyone among them who would build up the wall and stand before me in the gap on behalf of the land so I would not destroy it. But I found none. I find this concept of standing in the gap so applicable to our positions in this house. The people we represent indeed the people of Georgia have commissioned us to stand in the gap for them. Now, while this is true in a normal session, whatever a normal session may be in the future, it is even more true in this extraordinary session taking place under the headlines that I just read. The gap that we must feel can't be filled by just a few. It is too big. How's leadership can't feel this? It is too big. The entire minority party can't feel this gap. It is too big. The entire majority party can't feel this gap. It is too big. This gap can only be filled when we all, regardless of party, regardless of race, regardless of gender or anything else that divides us, when we all stand in the gap together. Standing arm in arm and shoulder to shoulder as women and men of good will, respecting each other, listening to each other, and engaging to find common ground to meet our unique challenges. Now, Ezekiel 2230 ends on a negative note. God said he looked for someone to stand in the gap on behalf of the land so that he would not destroy it, but he found no one and that led to great suffering in the land. But the good news for us today is the positive message is God is still looking for gap standards. God is giving us the opportunity today to stand in the gap right now for the people of our district and for the people of Georgia. And I implore you to please answer yes to that call because there is no problem that we together with God's help can't solve. Will it be easy? No. Is it impossible? No. When confronted with the situation that his disciples thought was impossible, Jesus said this to them in Mark 1027. Jesus looked at them and said with man, this is impossible, but not with God. All things are possible with God. Proverbs 35 and 6 says, trust in the Lord with all that heart and lead not until that owner distanding in all that ways acknowledge him and he shall direct that path. I found a quote that I thought was very interesting from somewhat of an unlikely place. This is under the topic of we are all in this together and the quote is actually from Albert Einstein. Albert Einstein writes, the estranged is our situation here on earth. Each of us comes for a short visit, not knowing why, yet sometimes seeming to a divine purpose. From the standpoint of daily life, however, there is one thing we do know that we are here for the sake of other men above all for those upon whose smile and well-being our own happiness depends for the countless unknown souls with whose fate we are connected by a bond of sympathy. If you would please stand with me for a prayer, I don't normally read a prayer, but this prayer touched my heart as I was looking for something that I thought could express the feeling that I have that I want to lift to God this morning and I hope that you will lift this prayer with me. Almighty and everlasting God, you are strength to those who suffer and comfort to those who grieve. Let the prayers of your children who are in trouble rise to you. Here I prayer, we claim your promises of wholeness as we pray for those who are ill or are suffering loss and long for your healing touch. Here I prayer, make the weak strong, the sick healthy, the broken whole, and confirm those who serve them as agents of your love. Here I prayer, to everyone in distress, grant mercy, grant relief, grant refreshment. Here I prayer, as we begin to rebuild, we commend our neighborhoods to your care. Give us strength of purpose and concern for others that we may create a community where your will may be done. Here our prayer, God of compassion, you watch our ways and weave out of terrible happenings, wonders of goodness and grace. Here our prayer, surround those who have been shaken by tragedy with the sense of your present love and hold them in faith, though they are lost in grief, may they find you and be comforted. Through Jesus Christ who was dead but lives and rules this world with you. Amen. Please join me now in the pledge of allegiance to our flag. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Well a lot of prayers come on up. Thank you. Thank you for doing so. Thank you. Thank you. Doorkypers will unlock the doors. Let me go back and two or three things on some housekeeping things from earlier. Because of the social distancing requirements, we are still going to do morning orders. But because of the social distancing requirements, it's going to be one person in the well at a time. So no groups because that would violate those procedures. And going on one final point on the mask, my staff and the doorkeepers have plenty to do today without policing mask. So I'm instructing them not to police because we have plenty of people out there in blue and gray and I might even find a National Guardsman or two. And they will escort you from the room in which you are in if you violate that rule. The chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Mr. Speaker, thank you. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, only 59. The moves following me establishes the order of business. The first part of the period unanimous consensus introduction to bills and resolutions. Second reading of bills and resolutions. First reading in reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. Second reading of bills and resolutions. The clerk will read. House Bill 1163 by Representative Green of the 151st Bill to amend an act to reconstitute the Board of Education of Randolph County House Bill 1164 by Representative Williams of the 168th Parkies of the 157th Jones of the 167th Bill to amend an act to provide by supplementary to the composition expenses and allowances for the district attorney of the Atlantic Judicial Circuit House Bill 1165 by Representative Williams of the 168th Bill to repeal an act creating the joint Liberty County City of Gumbran, the Midway City of Rice Pro City of Walphire Protection Facilities and Equip Authority House Bill 1166 by Representative Bonner of the 72nd Singleton of the 71st Mattiac of the 73rd Bill to provide a new home state exemption from a county school I've learned just taxes House Bill 1167 by Representative Cannon of the 58th Thomas of the 56th Garden of the 57th Drive of the 59th Scofield of the 60th and others Bill to provide for a new home state exemption from City of Atlanta, Adelorn, Taxes, House Bill 1168 by Representative Hill of the 3rd Bill to be relating to coursework in the founding of philosophy and principles of United States of America House Resolution 1474 by Representative Nixon of the 69th Watch of the 110th Smith the 133rd Tramble and the 130th Second by Senator of the 137th and others Resolution Green House Study Committee on Recovery, Recycling and Reuse Scrapped Tires House Resolution 1475 by Representative Watson of the 172nd Martin of the 49th Hogan of the 179th Douglas of the 78th Resolution encouraging the Georgia High School Association to perform a thorough assessment of its operations and practices pertaining to the inclusion of GHA member officials on the GHA Executive Committee House Resolution 1476 by Representative Jenner of the 85th Henson of the 86th and Carter of the 92nd Resolution supporting the National Internet Privacy Standards House Resolution 1477 by Representative Jenner of the 85th Henson of the 86th drivers of the 87th Evans of the 83rd Stevenson of the 90th and others Resolution supporting the passage of HR 1384 House Resolution 1478 by Representative Jenner of the 85th Henson of the 86th Carter of the 92nd Resolution supporting parity for breast-prone collection and storage supplies House Resolution 1479 by Representative Jenner of the 85th Henson of the 86th Resolution supporting the creation of the Gender Pair of the Task Force House Resolution 1495 by Representative Couch of the 50th Williams of the 37th Gailiard of the 162nd Oliver of the 82nd Evans of the 83rd and others Resolution creating the House Study Committee on Regulatory and Oversight Process and the Environmental Protection Division of the Georgia Department of Natural Resources House Resolution 1496 by Representative Gertler of the 8th more of the first single ten of the 71st Calpe of the 20th book of the 18th and others Resolution all urging all 159 counties of the State of Georgia to be designated as Second Amendment Constitutional Counties Senate Bill 40 by Senator Jackson of the 2nd Jones of the 10th Henson of the 41st Sims of the 12th Ramen of the 5th and others Rebellious to Sexual Assault by Persons with Supervisory or Disclinary Authority Senate Bill 102 by Representative Jenner Jones of the 10th Org of the 36th Henson of the 41st but the 55th Jones the 2nd of the 22nd others Rebellious to the 22nd Education Senate Bill 272 by Senator Robertson of the 29th Rebellious to the 2nd S<|hi|>gaedges Offences and penalties regarding Regulation of Control Substance Senate Bill 288 by Senator Anderson of the 43rd Jones the 2nd and the 22nd Jordan of the 6th parent the 42nd Jones of the 10th and others a bill relating to review of individual's criminal history record information Senate Bill 327 by Senator Karnschach of the 48th Black of the 8th James of the 35th 8th 38th Martin of the 9th and others of the bill relating to General Provisions regarding Labor and Industrial Relations and the bill 349 by Senator James of the 35th Karnschach of the 48th 7th Port of the 44th Tate of the 38th Save the 34th the bill relating to health Senate Bill 375 by Senator Mullis of the 53rd Watch some of the first work of the 11th career Patrick of the 32nd Miller of the 49th and others Bill relating to sale or distribution to or possession by minors the secrets and tobacco related products Senate Bill 370 and I might send her a stone of the 23rd Anderson of the 24th Bill relating to professions and businesses Senate Bill 384 by Senator Liggen Jr of the 3rd Miller of the 49th Doug into the 30th Stone of the 23rd 23rd Hillary the 19th the bill relating to General Provisions relative to solid waste management Senate Bill 408 by Senator Strickland of the 17th Doug into the 30th Miller of the 49th Unchirment of the 45th Anderson of the 43rd Nothers of the bill relating to use of sick leave for care of immediate family members Senate Bill 410 by Senator Kennedy of the 18th Doug into the 30th Goodyearth of the 51st Miller of the 49th Stone of the 23rd Nothers of the 50th over relating to creation of county boards the equalization duties review of assessments and appeals Senate Bill 412 by Senator Robertson of the 29th Wilkinson of the 50th due to the 51st Harborson of the 15th pain of the 54th and others of the bill relating to property insurance contract requirements rules and regulations and exemptions Senate Bill 413 by Senator Martin of the 9th Per Patrick of the 32nd dollars all the 27th Albers of the 56th Abilbo relating to conflicts of interest in zoning actions Senate Bill 416 by Senator Mullis of the 53rd Bill are the 49th Doug and of the 30th Kennedy of the 18th block of the 3rd of the 23rd Nothers the bill relating to the Office of College and Career Transitions and hours and duties Senate Bill 418 by Senator Thompson of the 14th Albers of the 56th Entrance of the 45th Mollis of the 53rd Harborson of the 16th and others the bill relating to Georgia State Indumentification Fund Senate Bill 423 by Senator Albers of the 56th Beach of the 21st Kerr Patrick of the 32nd Martin of the 9th Bill relating to hazing Senate Bill 426 by Senator Strickland of the 17th Hillary of the 19th Per Patrick of the 32nd Ratt of the 33rd James of the 35th and others the bill relating to air quality Senate Bill 428 by Senator Calder of the 46th Mollis of the 53rd again at the 47th Miller of the 49th Martin of the 9th and others the bill relating to the Fair Business Practice Act of 1975 Senate Bill 432 by Senator Harbin of the 16th Jones of the 25th block of the 30th Albers of the 29th Harborson of the 15th and others the bill relating to life insurance Senate Bill 446 by Senator Walker of the 30th of the 20th Kennedy of the 18th due to the 51st again at the 47th Miller of the 49th and others the bill relating to the authorization of posting cash bonds generally Senate Bill 451 by Senator Kennedy of the 18th Calder of the 46th House out there the 52nd again at the 47th they can turn your third of bill relating to limitations on recovery for deficiencies connected with improvements to realty and resulting injuries Senate Bill 463 by Senator Kennedy of the 18th Doug and at the 30th due to the 51st Jones of the 25th Mollis of the 53rd of the bill relating to primary elections generally Senate Bill 464 by Senator Kennedy of the 18th Doug and at the 30th due to the 51st Jones of the 25th Mollis of the 53rd of the bill relating to civil practice and at the 476 by Senator Kirkpatrick of the 32nd black of the 8th Unchment of the 45th Stone of the 23rd parent of the 42nd others the bill relating to general provisions relative to animal protections Senate Bill 477 by Senator Kirkpatrick of the 32nd Strictland of the 17th parent of the 42nd Kennedy of the 18th Jones of the 22nd bill relating to investigation a family violence preparation of written report Senate Bill 480 by Senator Huffington of the 52nd to bill relating to the state administrative organization Senate Bill 484 by Senator Kirkpatrick of the 32nd Burke of the 11th to bill relating to health Senate Bill 489 by Senator Gute to the 51st Kirkpatrick of the 32nd beach of the 21st Jones of the 25th Watson of the 1st of the bill relating to lighting equipment of motor vehicles Senate Bill 493 by Senator Thompson the 14th beach of the 21st Harveston of the 15th Cows of the 46th Harbond of the 16th the bill relating to selling and other trade practices Senate Resolution 841 by Senator Kennedy of the 18th Cows of the 46th Huffington of the 52nd Stone of the 23rd the congenial of the 3rd and others resolution proposing a memo to the Constitution so it's required that the people of the state make a decision to judge hearing for declaratory relief Senate Resolution 844 by Senator Miller of the 49th Wilkinson of the 50th Robertson of the 29th Gute to the 51st Antrimon of the 45th and others resolution honoring the life of deputy Nicholas Blaine Dixon and dedicating a bridge in his memory Senate Resolution 885 by Senator Harper of the 7th Hill of the 4th Park of the 11th Jones of the 25th Gute to the 51st and others resolution proposing a memo to the Constitution so as to authorize the state to incur general obligation debt 3rd second readers Reports of standing committees the clerk will read There are no standing committees we are now going on to morning orders We only have three We have three morning orders Three morning orders the chair recognizes representative Todd Jones for a morning order Mr. Speaker and on behalf of the Forsyth County delegation I stand in to honor Daniel Dugin Daniel was the youngest son of Mike and Laurie Dugin And in April of this past year he took his own life The early spring of 2020 for many in Forsyth County will be marked by near two weeks of hoping And praying for a miracle That miracle didn't come and we lost Daniel The duchons the delegation and we hope every member of this chamber Stand with us as we look to advocate I'm sorry as we look to advocate For greater work for greater resources and suicide prevention For streamlining organ donation And equally important to all of that to bolster research and depression and its ties to suicide Today we honor Daniel was something pretty simple We put it on all your deaths His favorite teams were the bulldogs and the falcons So notwithstanding I'm a modern and we all know where I graduated from We're all going to be I hope read in black today And where the bulldog pin and the falcons pin as a way to honor Daniel And to honor how we can make a difference Finally on a personal note and on behalf of the delegation Mike you're with us today You're not just my predecessor sir But you're a confidant you're a mentor But most importantly you're a friend And And I hope God blesses you Lori and the boys Thank you, mr. Speaker chair recognizes representative Eric Atomas for a morning order Thank you, mr. Speaker I Rise today To honor the life Of mr. Amad ques Arburn Of bronze week, Georgia His life was taking from him stolen from him on Sunday, February 23rd 2020 I Amad Arbery nickname quest Was born on May 8th 1994 in bronze week, Georgia He was a loving son brother Uncle nephew cousin and friend He was humbling kind and well mannered And he always made sure he never departed from his loved ones And I love you He had a smile that would light up the room He loved to tell jokes And he loved to laugh and had a beautiful personality He enjoyed downtime with his family and friends and he loved sports basketball football And he was one of the tops and those were his top choices He was a great athlete and chose the word the football jersey number 21 Which was passed down from his older brother Marcus Amad And he was among the graduating class of 2012 at bronze week high school He later attended south Georgia technical college in america's Georgia His life was stolen from him and today We take a moment of silence in honor of Amad Arbery Thank you Thank you, Mrs. Speaker, I yield the well Chair recognizes the chair for a Morning order We were last together here on March the 16th Today Today that seems a lifetime ago When we left here three months ago We were stepping out into the unknown of a pandemic That had claimed many lives in Asia and in europe We didn't know what to expect but we knew that we would be tested as a state and we were I I'm not sure when or what will tell us that this is all behind us If it ever is all behind us But I do know this we as a state have met the test We have discovered new heroes And we found them in hospitals and long-term care facilities and assisted living homes We found them among our first responders and health care professionals And we found them wearing the uniform of our national guard As I called members of this body all over the state during our time away I found another group That are heroes of mine And it was the women and men Republican and Democrat Of the Georgia House of Representatives I know how much you have given of yourselves to your community And you have made this chamber proud We will honor those who have led our state efforts as we go through this session And I will not attempt to list each one today But I think special attention is due To Dr. Kathleen Toomey of the Department of Public Health Director Homer Bryson of Jima In general Tom Cardin of the Georgia National Guard They have truly gone above and beyond the call of duty And together with Governor Kemp their leadership has made a difference for Georgia Right in the middle of this pandemic We were sickened and horrified By the video of an act of evil that defied belief An act of evil right here in our state All Georgians were shocked by the senseless murder of Ahmad Arbery Who was hunted down like an animal And shot with a shotgun at point blank range And then we later learned that the shooter stood over his body as his life ebbed away And pronounced his benediction With the most vile of racial slurs Members of this body that is hate There is much we do not There is much we do not know about our mods murder We don't know why or how this case was so Casually brushed off We don't know who bears the responsibility But I want to commend GBI director Vick Reynolds For his diligent pursuit of justice And I salute Attorney General Chris Carr For his pursuit of the unanswered questions For all we do not know This we do We know that if we leave here this session Without passing a hate crimes bill House bill 426 It will be a stain on this state that we can never wash away This house has done thank you this house has done its part That bill has been sitting in the other chamber For 465 days Not one committee hearing Members of this house\n\nlip service and talk will not pass this or any other bill. Chairman Chuck, frustration and deemed smiley have done statesmen like work, working hand in hand. So many others have helped too many to name, but I must say job well done to the representative Al Williams and the chairman Don Hogan. Their efforts helped unify a community trying to deal with this challenge and they met that challenge together. We have some challenging days ahead dealing with adopting a balanced budget for fiscal year 21. Painful and difficult choices lie before us. The budget is the one thing we must by law do, but I declare to you today that House Bill 426 in this year of 2020 is just as important. We must proclaim from every corner of this state that Georgia is better than this. House Bill 426 will not be the end of the path. It is a beginning to binding up our wounds. There are other issues. Citizens arrest and police reform among them that will be part of a broader conversation and I have committed to promoting that effort when this session has ended. Ahmad Arbery, George Floyd, Breonna Taylor, and now Rayshard Brooks names that are seared into our consciousness, not because they are the only ones, but merely the most recent. We must come together. We must embrace the creed that was the most once followed by the city of Atlanta which proclaimed itself the city too busy to hate. We must now be the state that is too busy to hate. Finally, we had a primary last week. It wasn't very pretty. For days now we have engaged in mutual finger pointing. This is the beginning of the third decade of the 21st century and we are still having problems conducting an election in this great state. I am not interested in finger pointing. I am interested in facts and that is why I have charged Chairman Shaw Blackman and the House Governmental Affairs Committee with conducting an independent investigation. I want them to drill down into the lines of authority, find out what went wrong and why and bring back recommendations on how we can fix it. I want them to tap the resources of the great corporate citizens here in Georgia that transact business all over the globe every day. I believe they might can help us to bring their expertise and partner with us. So I say to you that it is time we get to work. Not only are Georgians watching us, but the eyes of this nation are on us. May God bless each of you and may God continue to bless the great state of Georgia and may He give us the wisdom to do that which is right in the coming days. Thank you very much. For what purpose does the Speaker Pro Tem rise? State your motion. I move rules be temporarily suspended so that a local bill may be introduced to me for the first time. Speaker Pro Tem has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee. Clerk will read the caption. Unnumbered House Bill of our Representative Jones, the 47th being Todd O'Neck to amend the act to re-incorporate the city of Mountain Park in the counties of Fulton and Cherokee. On the ladies' motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee is their objection. Is their objection the chair here is done and it is so ordered. What purpose does Chairman Benton rise? Speaker Pro Tem has moved that the rules of this House be temporarily suspended to allow a bill to be read for the first time, three bills to be read for the first time in a signed committee is their objection. Is their objection. Clerk will read the caption. Unnumbered House Bill of our Representative Benton of the 31st being Todd O'Neck to amend the act to providing a homestead exemption from Jackson County School District Admiral Alarm Taxes. Unnumbered House Bill of our Representative Benton of the 31st being Todd O'Neck to amend the act, providing a homestead exemption from the city of Commerce, Independent School District Admiral Arm Taxes. Unnumbered House Bill of our Representative Benton of the 31st being Todd O'Neck to amend the act, providing a homestead exemption from the city of Jefferson Independent School District Admiral Arm Taxes. On the gentleman's motion that the rules of this House be temporarily suspended to allow a bill to be read for the first time in a signed committee is their objection. Is their objection hearing none it is so ordered. All three bills are assigned to the Intergovernmental Coordination Committee. Did I? And the Speaker Pro Tems bill, I think I forgot to assign it. That will be assigned to the Intergovernmental Coordination Committee. We are now going on to the rules calendar. Going on to the rules calendar. For your planning purposes Senate Bill 43 will be postponed to the next legislative day. Senate Bill 43 will be postponed until the next legislative day. The clerk will read the caption to Senate Bill 134. Senate Bill 134 by Senator Capatric, the 32nd Jackson, the 2nd clerk of 13th on November the 45th. The title of the act to amend Article 8 of Chapter 12, the title 50, the fiscal to Georgia Annotated Relating, Georgia Commission on the Holocaust, so as to reassign the Commission for Administrative Purposes. This bill haven't referred to the committee on Governor Lfarer. That committee recommends that this bill do pass. Chair recognizes Chairman Silcox to present the bill. Thank you, Mr. Speaker. I bring to you today from Senate Bill 134. This bill simply moves the Commission on the Holocaust from the Department of Community Affairs to the Board of Regents per the Governor's recommendation in our original budget. If there are no questions, Mr. Speaker, I'll yield the will. You have a question that representative McLaren? Sorry, I was just going to wing that one. Represented Silcox, my understanding when we were having the budget discussion was that we were going to be collapsing potentially two independent sites for Holocaust study or education into one. I'm curious if that is the case and that's what this bill facilitates. If Sandy Springs is going to be affected anyway by that, which I know is a topic you and I particularly interested in. Thank you, Reverend Sonic McLaren. To answer your question number one, it will remain independent. The Holocaust Commission will remain independent and separate from the Kennesaw State facility. Number two, my understanding is that it will not adversely affect Sandy Springs in any way. In fact, this is consistent with the mission of the Holocaust Commission for educational purposes and it's actually going to save them so many. Thank you, Representative. Thank you. There are no more, Mr. Speaker, I'll yield the will. You may just a moment here. You do not appear to have any other questions. Thank you. Is there any objection to the previous question being ordered on Senate Bill 134? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 134 will vote aye. Those opposed will vote no and the clerk will sound the roll. Alexander. On all of its valinger, bar, Barton, Belton, Bennett, Bentley, Blackman, Vody, Bruce, Burns, Carpenter, Carson, Chokus, H. Clark, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Abstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, M. Jackson, Jasperst, Jay Jones, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, G. Morris, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, L. Smith, R. Smith, V. Smith, Hyry, R. Stevens, Tancersley, Tanner, Tarvin, Taylor, E. Thomas, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, A. Williams, Williamson, Yurda, Allen, Beesmore, Bernau, Cannon, Carter, Clark, David Clark, Jasmine Clark, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holly, Holland, Hopson, Howard, Hutchinson, Derek Jackson, Sheila Jones, Todd Jones, Vernon Jones, Couch, Kennard, Lopez Romero, Marin, McLean, McLean, McLean, McLeod, Meeks, Mitchell, Beth Moore, Colton Moore, Morris, Nelson, when, Paris, Prince, Pullin, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith, Steven, Mickey, Steven Sin, Abel Mabel, Thomas, Turner, Wollensky, Wilkerson, Mary Frances Williams, Noel Williams, Wilson, Beasley Teague, Bonner, Fuckner, Richard, Calwell, Campbell, Andrew, Dickerson, Duke, Campbell, Gillier, Gordon, Gordon, Green, Gullet, Jeff Jones, Kirby, Lott, Mathis, Mets, Lomptaha, Yes, Fomet, Park, Truett, Roger, Rush, Singleton, Stovall, Rick Williams, Yes, Alan, Belton, Boate, Bruce, Campbell, Canton, Cannon, Carson, Carter, De Clarke, Duke's, Dunahue, Frazier, Gordon, Harold, Hogan, S. Jones, Lopez Romero, Setsler, Steven Sin, E. Thomas, I'm going to ask members whether they're on the floor of the house or in the gallery or in 341 to look very carefully at the board and make sure that you have voted and you have voted the way you desire to do. Okay, Mr. Clark, we can lock the machines on the passage of Senate Bill 134. The eyes are 160, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. I'm just trying to keep you up today and to keep you sort of, so you know the system that we're doing. The clerk is calling the role for those seated on the floor of the house alphabetically. Then he is calling the role for those in the gallery alphabetically. And then 341 is being called alphabetically. So that's kind of the order that we're going in and maybe that'll help you understand the process a little more. Clerk will read the caption to Senate Bill 188. Senate Bill 188 by Senator Walker, the 20th Jones, the 25th Marker, the 9th Kirk of the 13th and Harbin of the 16th. We can talk about an act to amend Code Section 33714, the official to Georgia annotated relating to reinsurance of risks. So it's to provide adequate regulation of reinsurance. This bill ever refer to the committee on insurance that committee recommends a disbill do pass. Chair recognizes representative Noel Williams to present the bill. Thank you, Mr. Speaker. I rise bringing before you house members Senate Bill 188. It is a Georgia Insurance Department bill that it contains the National Association of Insurance Commissioners Model Law updating our credit for reinsurance laws in the state. We are required to update our model laws in order to maintain our NAIC accreditation. We must do this every four to five years and it be in time that we do it at this time. The purpose of accreditation for state insurance is to meet certain standards of solvency regulation, particularly with respect to regulation of multi-state insurers. Accreditation allows the insurers non-domestic regulation to rely on the accredited domestic regulator of the insurer. Senate Bill 188 updates the credit for reinsurance law which governs the amount of reduced liability a Georgia insurance company gets when it purchases reinsurance. This Senate bill contains two updates. Number one, updates allow the insurance department to issue regulations for statutory accounting and solvency requirements. And number two, updates make sure Georgia law and the authority of the Georgia Insurance Department regulate certain re-insurance agreements and are not preempted by federal and European Union treaties. If the updates are not passed then the treaties will preempt Georgia law. Senate Bill passed through the insurance committee and it passed through the Senate and I respectfully request you to help us pass this today. Thank you Mr. Speaker. Linger for a moment if you would, let's be sure there are no questions. You do not appear to have any questions. Thank you Mr. Speaker and thank you colleagues. Is there any objection to the previous question being ordered? The chair here is none, the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none, the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 188 will vote aye. Those opposed will vote no and the clerk will call the roll. All right. All right. Alexander, on all of its fallinger, bar, Barton, Belton, Bennett, Bentley, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, H. Clark, Collins, Cooper, Corbett, Dempsey, Dickie, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, M. Jackson, Jasper's, J. Jones, Kelly, Kendrick, Knight, Lahood, Larickia,\n\nLomston Martin Mathyak McCall G. Morris Newton Nick's Oliver Parish Parsons Petri Perkle Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox L-Smith R-Smith V-Smith Smirey R-Stevens Tankersley Tanner Tarvan Taylor E-Thomas Tramble Washburn Watson Welch Workhizer Weedauer A-Williams Williamson Yurda Allen Bayesmore Berna Cannon Carter David Clark Jasmine Clark Cook Davis Douglas Dreyer Dunahoo Earhart Evans Frazier Gilligan Gertler Henson Hill Hogan Holland Holly Hobson Howard Hutchinson Jackson Derrick Sheila Jones Todd Jones Vernon Jones Kaush Kennerd Lopez Romero Marin McLean McLaren McLeod Meeks Mitchell Beth Moore Colton Moore Mark Morris Nelson Quinn Paris Prince Pullen Robyshow Saints Scofield Scott Shannon Sharper Smith Pam Stevenson Abel Mabel Thomas Turner Wollensky Wilkerson Mary Frances Williams Noel Williams Wilson Beasley Teague Yes Bonner Yes Buckner Yes Vergette Caldwell Yes Campbell Yes Cantrell Yes Dickerson Yes Dukes Yes Campbell Yes Gillyard Gilly Yes Gordon Yes Green Yes Goat Goat Yes Jeff Jones Jeff Jones Yes Kirby Yes Lot Lot Yes Mathis Mathis Yes Metz Yes Mopthag Mopthag Yes Park Yes Prude Pruders Raj Singleton Yes Stovall Rick Williams Rick Williams Yes Alexander Bennett Bonner Cannon Cannon Dick Dickerson Dick Dickerson Dick Dickerson Dick Dick Dickerson He has a good feeling about it. The members have all members voted. I would ask members again to take just a moment and look at the board. Okay, Mr. Clerk, lock the machines on the passage of Senate Bill 188. The eyes are 165, the nays are zero. This bill having received the requisite constitutional majority is therefore passed. I'll go read the caption to Senate Bill 345. Senate Bill 345 by Senator Krapatsrick, a 30 second tip is at the 37th, the red of the 33rd, and Jordan of the 6th. We entitled an act to amend Chapter 2, a title 26. The official code of Georgia annotated relating to standards labeling and adulteration of food. First to provide for nonprofit organizations to prepare and provide food in accordance with Department of Public Health requirements. This bill I refer to the Committee on Health and Human Services. That committee recommends a disbilled do pass. Chair recognizes representative Reeves to present the bill. Thank you, Mr. Speaker, members of the House. This fate would have it Senate Bill 345 is actually more important to our state right now than it was when we actually left here a few months ago. And as we all experienced when we left here in our schools closed, we all were faced with the reality that we, every part of our community that's represented here in North South, East, West, and every corner of the state has children that if they do not go to school, they do not eat. And luckily our state has nonprofits all over this state that are there to, as we said this morning, to stand into that gap and fill that gap. This bill came from a situation in Cobb County last year. There's a nonprofit called must ministries that serve seven counties and providing food for children in the homeless. And the way that the food was prepared and distributed, believe it or not, had, wasn't consistent with what Georgia Law allowed. And so some strong community leaders, including Dr. Ick Reichard, who is the chair of must, former governor Roy Barnes, Senator Kurt Patrick, and several members of some of our state agencies got together and figured out how to craft Georgia Law with some common sense regulations so that these nonprofits can help prepare food and meals to be served to those folks. I think we'll go out and yield for any questions. Chair recognizes representative Carter. Thank you, Speaker. Does the gentleman yield a deal? A way up here. So I believe. Thank you. First of all, I appreciate the thought of this bill because absolutely we want everyone to save. But my question to you is the clause in the bill in this legislation that says that a non-profits who are selling or providing a food service. And I think next to the last page, there's a line that says that non-profits will be prohibited from providing a food service if the food was processed in the home. Now I give what you're saying and I understand what happened in Cobb County. But in the state of Georgia, we have a lot of non-profits. They're very small. Some are very small and they're trying to do the best they can to support these hour constituents. And some of them may or may not have kitchens in their facilities. How are we prepared to address these small and non-profits that do not have the resources that they're only option may be in a home? How are we prepared to address that? Thank you for the question. And to be perfectly honest with you, I don't know what the perfect answer is but I can tell you that what we need is for ways, our non-profits that don't have the benefit of having a kitchen or those type resources to be able to partner up with other entities and institutions, churches, most churches have some kind of kitchen in place to be able to partner up with those entities to produce the meals. The bill does specifically prohibit it being prepared in private homes and then distributed. And those are for through commonsense safety reasons. There needs to be, you know, with the Department of Public Health and others input in here, there needs to be some kind of commonsense regulation over the preparation of this food and and a degree, some degree of accountability to how it's prepared and that there could be some administration in that. So I think that what we really need in situations like what you're describing is for entities that have a kitchen to offer, to offer up those services and offer up their, what they can in order to make this happen. That's the gentleman further yield. I do. And again, I wholly understand what you're saying. Because of the situation in Cobb County that is driving this legislation, I don't see where we've been thoughtful enough to think about nonprofits around the state that are maybe in some rural areas and we're making some assumptions that churches have kitchens and not all churches have kitchens. So will there be an opportunity or will there be a time lapse? How will we be able to ensure that some of these non-svalon nonprofits that are providing food for the much needed will have the opportunity to make that transition if we're going to tie their hands and not allowing them to be able to have food prepared in a private home? So I think this bill solves a lot of problems, but it doesn't solve every problem. And there is a degree that I don't know how to answer your question. I mean, if there's work to be done on this issue, then so be it. And let's continue to do that. But hopefully within the construction here, the Department of Public Health and the counties and the local governments that are involved in the permitting process of all this can work together to connect those dots and get the organizations that are willing to have the volunteers to come together to provide this food that they can be an asset to bringing those parties together. And again, I can't answer your question with 100% certainty because it's going to be up to how our communities choose to handle that. Let's just speak our yield well. You had other questions. It's up to you. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of Senate Bill 345 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Thank you. Representative Cannon. Parliamentary inquiry. State your parliamentary inquiry. Is it not true that this bill removes the ability for organizations to appeal determinations of food safety inspections? Well, I think that's going to be left to the judgment of each and every member. A reading of the bill should be able to answer that question. There's two. You have a few minutes if you want to come down and ask the author. I'm sure it will be happy to help you. Okay, Mr. Clark, was... Alexander Anola Woods, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Burns, Carpenter, Carson, Chokus, H. Clark, Collins, Cooper, Corvette, Dempsey, Dickie, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Bradley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, M. Jackson, Casper's, Jay Jones, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, Macau, G. Morris, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Paul Smith, R. Smith, V. Smith, Smyrie, R. Stevens, Tankersley, Tarvin, Taylor, E. Thomas, Ramel, Washburn, Watson, Welch, Workhizer, Weed Hour, A. Williams, Williamson, Yurda, Colin, Beesmore, Bernard, Cannon, Carter, Jasmine Clark, Cook, Davis, Douglas, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holly, Hopson, Hutchinson, Derrick Jackson, Sheila Jones, Todd Jones, Vernon Jones, Couch, Kennard, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Beth Moore, Colton Moore, Morris, Nelson, Wen, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith, Pam Stevens, Able Mabel, Thomas, Turner, Wollinsky, Wilkerson, Mary Frances Williams, Noel Williams, Wilson, Beesley Teague, Noah, Bonner, Buckner, Birchette, Caldwell, Campbell, Yes, Cantrell, Dickerson, Dukes, Gamble, Gordon, Green, Gullard, Jeff Jones, Kirby, Lot, Yes, Mathis, Mets, Mammothahan, Park, Rogers, Singleton, Yes, Stovall, Rick Williams, Cook, Dreyer, Holland, Houston, Knight, Marin, McCall, Uncle, Rutledge, Stevenson, Tarvin, E. Thomas, Washburn, Wollinsky, William, Scott, Scott, Gilligan, Scott, I would ask members to take a moment, look at the board, make sure that your vote is consistent with your intentions. Hearing nothing to the contrary, the clerk will lock the machines. On the passage of Senate Bill 345, the eyes are 150, the nays are 12. This bill having received the requisite constitutional majority is therefore passed. What purpose does Chairman Gerald Green rise?\n\nto make a motion this speaker. State your motion. I know that the rules of the house be temporarily suspended and that two bills be introduced in red for the first time. Chairman Green has moved that the rules of the house be temporarily suspended to allow two bills to be read for the first time in a signed committee. The clerk will read the caption. House bill 1173, by represent of Green and the 150 first metadelman act to amend the act to provide a new charter for the city of Bluffton. House bill 1169 by represent of Green and the 150 first to be a toddler and act to amend the act to provide a new charter for the city of Shelman. On the gentleman's motion that the rules of this house be temporarily suspended to allow two bills to be read for the first time in a signed committee. Is there objection? Is there objection? The chair here is none and it is so ordered intergovernmental coordination. The clerk will read the caption to a group of privileged resolutions. Recognizing an honoring Dr. Joseph Hobbs, honoring the life of memory of Roy Edward Gaines, honoring the life of memory of Rebecca Chase Williams, commending and congratulating Jonathan Gravis, recognizing commending Sherry D. Smith on our outstanding public service, recognizing the 50th anniversary of heart pharmacy incorporated in commending Marvin Wyman Griffin senior, recognizing commending Dr. Manjit Chinan upon his election to the International Academy of Food Science and Technology, recognizing in commending Maggie Bell Cheetah, Cartwright, honoring the life and memory of Glenn E. Nicholson, honoring the life and memory of Garnett P. Webb, honoring the life and memory of Roy W. Painter Senior, honoring the life and memory of Jeanette Ray Kyle, recognizing commending Shiloh Baptist Church on the occasion of its 180th anniversary that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here is none and the resolutions are adopted. The chair recognizes the majority leader to discuss a resolution. Thank you, Mr. Speaker. Well, it's going to be good morning, but good afternoon. I'm going to bring to you House Resolution 1507, which has been placed on your desk. Mr. Clerk, would be appropriate to read the resolution or should I go forward? Yes, Mr. Clerk, would you read the caption to House Resolution 1507? House Resolution 1507 by Burns, the 159th, amending the rules of the House of Representatives to allow for virtual meetings of the House of Representatives and for other purposes. May proceed. Thank you, Mr. Speaker. Thank you, Mr. Clerk. Colleagues, we certainly do live an extraordinary times in every sense of that word that we're experiencing now. But of course, our mission as we come back to this place is to complete the work that we began in January of this year. Finalize a budget and enact important legislation and important initiatives and policies for the people of Georgia. In order for us to carry out our responsibilities, we need to make a few changes to our rules that will allow us, under any circumstance, to complete the work of this body in an efficient and transparent manner. I'm going to give you an overview of the rules that have been put before you. And you can look at those, and if you have specific questions, I'll be glad to answer those. Now, House Resolution 1507 provides for the speaker to allow committee meetings and session to be conducted electronically in emergency situations. It requires the committee meetings and session to be conducted in such a way that all meetings that would normally open to the public are able to be viewed by the public, complete transparency. Now, the speaker also has the ability, and I would say my colleague, Minority Leader Tramble and I, look to these rules and the suggestions in both of us, we have something here that we need to act on. But the speaker also, in consultation with the Minority Leader and the Majority Leader, can allow this House to meet electronically if it is impossible to meet here at the State Capitol. It also reminds you that any document that is considered if we were meeting electronically would be the same rules as far as those documents being placed on our desk here in person, that those documents would be delivered electronically to comply with the same requirements on the time, whether it be an hour or whatever that time frame is with the budget and other imported items that we placed on our desk. It would also allow us to have a quorum based on electronic participation. Mr. Speaker, that's an overview of what the changes to our House rules would allow. If there are specific questions, I'll be glad to answer them. The rules and the changes to the rules are on your desk before this body. I would yield for any questions, Mr. Speaker. It looks like you do have a question to recognize as representative Bruce to your right. Representative, they're going to bring you a microphone. I believe is how we're going to do that. Hold tight one second, Representative Bruce. Thank you. There's the gentleman you. How are you, my friend? First, I wanted to say thank you for this effort. This is the right thing to do. We absolutely don't need to be in this building. I was going to go and do a morning water tomorrow, Mr. Speaker, but you're addressing it now, so I appreciate it. But I'd like to know when will this go into effect because it's really important that we protect. Not only the people that end this room, but we protect our families when we go back to them. So when will this be effective? Thank you, Representative Bruce. If we adopt this rule today, it will be an effect today. But I would say to you, and thank you for your concerns. We've spoken, and we've had information shared back and forth. But certainly we believe the policy that was recommended to the speaker that was adopted as we conclude this session by that bipartisan committee that the speaker reported that we would believe that those issues that come from public health that have been endorsed by public health, by Department of Public Health, certainly meet the criteria of protecting the members and certainly protecting those members of our families that we're associated with back on when we leave this place. So we think we have a good plan here. I believe I see the members are cooperating and certainly we believe that if we cooperate and put into place the rules as they exist today, right now that protects us. But certainly these are additional tools in a toolbox when the speaker, when we need to enact different protocol as far as virtual meetings and tele meetings. So it would be available as soon as this as soon as we adopt this and I would ask you to adopt these rules. Chair recognizes representative Wilkerson up to your left in the gallery for a question. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Just a clarification. Thank you for doing the resolution and giving us the rule changes. So for committee meetings, is it going to be up to each individual chair to decide when a meeting by a meeting basis, whether or not they want to have electronic meeting? Or will there be a set process on how committee meetings are conducted? I think as all of the members, these rule changes would allow those committee meetings in the future to be conducted remotely through electronic means through different types of communications. Our committee chair now, as our rules exist right now, certainly have latitude to conduct their meetings in each and every situation that the committee chair has that latitude. We've encouraged the committee chairs are encouraged and they will be allowing committee participation virtually, if you will, as we go about our business now. But this resolution, these changes will simply expand that if we get into a new normal, if you will, where we are not in this building, if we have to meet virtually in the future. Thank you, Mr. General, for the meal. I do. Just to add on to that. So is the expectation that each committee will revise the rules appropriately or will it be on a meeting by bill basis for that? And then, yeah, let me answer that question. The committee chairman will certainly be bound by the rules that we adopt for this house. And they will be able to conduct their meetings virtually, yes. No, I mean, retirement has nine committee meetings. I mean, like nine stipulations in their committee. So in order to change the rules to allow electronic voting, is that something that you expect each committee chair to have in their next meeting a vote on whether or not to allow those? My concern is that if a bill comes up where votes are needed, it will be electronic. If votes are not needed, then it will not be electronic. So what I would like to do is establish a procedure that is clear guidelines for every committee to follow if they still choose. Thank you. Those decisions will be made by the committee chair. The committee chair has latitude to make those decisions. But these will be tools in two box for future use. But the committee chair still has latitude to help determine the rules for that committee. Chair recognizes representative dryer up to your left for a question. Thank you, Mr. Speaker. Does the gentleman you? I you. Thank you. Looking at 175.1. We certainly have seen a circumstance lately and presently where this is necessary. I think my problem is Mr. Majority Leader is I read too much history and I've seen it times abuses of power. And I believe that this effort is a good faith effort between the majority of the minority party, the speaker and his staff. But 2040, 60, 80, 100 years from now. The concern there could be something that a leader considers an emergency that it would be, quote, imprudent to return to the Capitol, which could yield to an abuse of power. So I wonder if there's a way that we could put some sort of limit on this that if maybe 20% of the members of the General Assembly petitioned and said that there was not an emergency that would justify meeting remotely that we could come back here in this body and we could conduct our business. And of course protect our democratic republic. Thank you for the question and I think the time and time that we're in and our lives right now in existence of the work for this body and our state and our country. Certainly you can look at and forecast all sorts of things that could happen. But I will remind you that each year when we come back for a new biennial session, beginning of a new session, which would occur in 2021, we will adopt the rules for this house. So the rules, if we adopt these rules today, will only be for the remainder of this year, 2020. That's a fair point. Thank you, Mr. Mayor. Chair, recognize is the majority caucus whip representative Kelly to your right for a question. Mr. Speaker with a leader yield. EO to Mr. You, Mr. Whip. Mr. Luthor, I want to thank you as well, the other members of your committee for the work you've done and I apologize some matter to help us get through this crisis that no one saw coming six months ago. So I'll take a thank you for that. Second on the issue of committee meetings, isn't it your intention with these rules that the committee chair would have the opportunity and the agenda that they're required to pose to describe whether the meeting will be conducted electronically or in person. Wouldn't that be the process? That would be. Chair recognizes representative cannon to your left up in the gallery for a question. Thank you, Mr. Speaker. Do you? I do you. Thank you. Can you help explain the difference between electronic and virtual? Basically, we were just trying to cover the different parts of technology, whether it be via just the ability to connect by the Zoom type meetings and whether it be just whether it would be just by a phone type meeting. We cover all the options from electronics that are available to us to be interactive with with each other. Do you further you? I do you. So based on that, if you're saying that electronic means telephone, then wouldn't we include telecommunications? I'm trying to truly understand the difference between electronic and virtual, but as a millennial, virtual would be Zoom, electric, electronic. I don't know what that is. What is electronic communication with someone? It could be over your cell phone or over a telephone, landline. Final question, if you further you? I would you if one more. So then online six where it says representatives are conducted through electronic means, wouldn't why doesn't that also have virtual? I think the electronic intent with electronic and the virtual were consistent with each other, but of course our rules here on the floor that you can't speak into a your cell phone and use your cell phone on the floor. So that would also allow the amend those rules that would allow those type devices to be used in the communicated process for an open meeting. If we have to go to that, that platform for future use future use, future reference. To ensure that we have an open and transparent meetings for the public and as we conduct our business. Okay. I think Mr. Speaker, there's no further questions I would ask this body. There are further questions, but you don't have to take any more. It's up to you. I think I've extended on answered most of the questions and my technological knowledge has certainly been expressed. So at that point I would ask this body to do what we need to do and that's to adopt these rules and the practices we set out in House Resolution 1507 to enable us to complete our work here and for the people of Georgia when anything different becomes necessary in the future. So without our yield the will and ask for your favor consideration. Thank you Mr. Speaker. I'm going to commend you Mr. Leader. You know Winston Churchill once said courage is knowing going to stand up and speak out and courage is also knowing when to sit down and listen. So is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. We have a parliamentary inquiry. Chair recognizes representative Bentley for a parliamentary inquiry. Parliamentary inquiry. Is it not true that my husband is in a assistant living center and I have to go there nightly to put him in bed and I'll go back in the morning, get him out of the bed. And is it not further true that this bill will really help me be able to take care of my husband due to work of a state representative all at the same time. I know it would representative. I know. Thank you. You are an amazing human being. Thank you. Okay. A couple of ways we can do this. Chair, it requires 120 votes. The chair will ask first if there's any objection to adopting the rule change by unanimous consent whereby the votes of everyone would be cast for it. Is there any objection? Any objection? Here, there is objection so we will do the roll call. Mr. Clark, the question before the House is on the adoption of the House Resolution 1507. All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will read the roll call. All right. Alexander. Chocus. H. Clark. Collins. Cooper. Corbett. Dempsey. Dickey. Dollar. Drenner. Dubnik. Abstration. England. Irwin. Fleming. Fry. Gaynes. Gardener. Gravley. Harold. Hatchet. Hawkins. Hitchens. Holcomb. Holmes. Houston. Hugley. M. Jackson, Jasperus, J. Jones, Kelly Kendrick, Knight, LaHood, LaRickia, Lomston, Martin, Matthew, McCall, G. Morris, Newton, Nicks, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Arsmith, V. Smith, Smyrie, R. Stevens, Tankersley, Tarvin, Taylor, E. Thomas, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, A. Williams, Williamson, Yurda, Allen, Faizmour, Bernal, Cannon, Carter, Jasmine Clark, Cook, Davis, Douglas, Dreyer, Dunhu, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Hopson, Howard, Hutchinson, Derek Jackson, Sheila Jones, Todd Jones, Vernon Jones, Koush, Kennerd, Lopez Romero, Marin, McClaren, McCloud, Meeks, Mitchell, Bethmore, Colton Moore, Morris, Nelson, Quinn, Paris, Prince, Pullin, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith, Stevenson, Abel Mabel, Thomas, Turner, Walensky, Wilkerson, Mary Francis Williams, Noel Williams, Wilson, Beasley Teague, Yes, Bonner, Yes, Buckner, Yes, Richard, Yes, Caldwell, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Dukes, Yes, Gamble, Yes, Gileared, Yes, Gordon, Yes, Green, Yes, Gullet, Yes, Jeff Jones, Yes, Kirby, Yes, Flood, Yes, Mathis, Yes, Mitz, Yes, Mampdahan, Yes, Park, Yes, Rogers, Yes, Singleton, Yes, Stovall, Yes, Rick Williams, Yes, Sir, Belton, Cook, Dickerson, Dryer, Gilligan, Holmes, Hopson, Colton Moore, Morris, Stevenson, Tarrvin, Abel Mabel, Thomas, That completes the roll call and the voting. I'll ask members to take a moment and be sure that your vote is reflected accurately on the board. Mr. Clark, would you lock the machines? Wait, wait, wait, that is recorded. Now, Mr. Clark, you may lock the machines. On the adoption of House Resolution 1507, the eyes are 154, the nays are 3, the resolution has been adopted, which contains the\n\nchange to the rules of the house. We do not have any announcements. We do not have any birthdays today. Mr. Chair recognizes the majority leader of the house for a motion. Mr. Speaker, I move that this house stand adjourned until 10 a.m. Tuesday, June 16, 2020. The majority leader has moved that this house adjourned until Tuesday, June 16, at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The ayes clearly have it and this house will be adjourned until tomorrow at 10 a.m.",
  "updated_at": "2026-02-13T23:46:02.2631+00:00"
}