{
  "video_id": "69_LcFetNAc",
  "url": "https://youtu.be/69_LcFetNAc",
  "title": "Georgia House - Day 31 (2026-03-11)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 31,
  "video_date": "2026-03-11",
  "duration_minutes": 54,
  "summary": "Overview:\nThe key highlights of this Georgia House session include a heartfelt speech by Pastor Fred Goodwin, a Naval Academy graduate and longtime minister, who shared his personal story of faith and calling. No major legislative actions were reported in the transcript.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Rep. Brad Thomas introduced Pastor Fred Goodwin, who shared his powerful testimony about his journey from the Naval Academy to ordained ministry. Goodwin spoke about a pivotal moment when he faced a life-threatening situation flying a military mission and turned to his faith.\n- Goodwin encouraged the representatives to seek their true purpose and calling in life, beyond just pursuing personal goals and accolades.\n\nVotes:\nNone recorded.\n\nAttendance:\nThe session began with a quorum call and members reporting to their seats.\n\nAdjournment:\nNo specific adjournment time was provided. The transcript ends after Pastor Goodwin's remarks.",
  "transcript": "They are of convening having arrived.\nAll members of this house will please report to their assigned seats.\nAll members of the house will please report to their seats.\nMr. Clerk, we're in the mail.\nAll right, we're about to have the morning roll call.\nWe are about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nall members voted, have all members voted. If so, the clerk will lock the machines. Well,\ngood morning. I guess this is the equivalent of a Friday, huh? Yeah. Okay. We will begin\nour day with scripture reading and prayer by the chaplain after which we will pledge allegiance\nto the flag of our country. Our chaplain this morning will be introduced by the gentleman\nfrom the 21st House District Representative Brad Thomas, Representative Thomas.\nThank you, Mr. Speaker. Today, I'm proud to introduce to you my friend and constituent\npastor Fred Goodwin. Before receiving a dramatic call to the ordained\nministry as an Anglican priest, Pastor Fred graduated from the U.S.\nNaval Academy in 1975 and flew carrier-based aircraft. He served as a youth\npastor, senior pastor, national teacher, and he and his wife, who was also his\nhigh school sweetheart, Jill made their home in Cherokee County. They have three\nmarried sons and eight grandchildren. Pastor Fred is a leader in our community serving\nas senior pastor. He's president of the Cherokee ministerial association before\nretiring in 2019 and currently he serves the chairman of the board of serve\ninternational. Serb international is a Cherokee based ministry that last year served\n8.5 million meals and as they shared their love of Christ. Also he coaches\nHe coaches pastors. He's a middle school track, assistant track coach. And on a personal\nnote, I've always believed that God brings people together when he knows that you need\neach other. And God brought pastor Fred into my life. And I told you that he was a friend,\nbut he's more than a friend of me, he's confident.\nAs I struggle and I have my own tribulations in life,\nhe's the one person I know that I can call\nand to be there for me and to help guide me through.\nAnd it is really an honor today\nfor me to introduce all of him to you.\nThank you.\nBrad, I'd really love to meet that man.\nSounds very interesting.\nMr. Speaker, Brad Distinguished Representatives\nand guess, it really isn't honor to be here with you today.\nYou can probably imagine, after nearly 40 years\nof ordained ministry, I could wax many, many hours,\nif I were given that time, on any scripture passage\nthat you like and tell many stories.\nBut I'd love to go back even before that,\nbecause 50 years ago this year, I did start as a plea,\nbut the Naval Academy.\nAnd I found that structured discipline,\nhaving been raised by a Marine Corps sergeant\nfrom the Second World War, fit my lifestyle.\nI love the challenge.\nAnd even though it was plea beer,\nas many of you freshman representatives know,\nthey it's a lot to learn.\nYet I was doing well.\nAnd yet there was a question that was asked of me\nby one of my classmates near the end of that first year\nthat I shall never forget.\nWe had just finished our workout in lightweight crew.\nWe were standing by the boat house, and he turned to me and said, Fred, why do you take\nthis game so seriously?\nAnd I had absolutely no idea what he's talking about.\nSo I said, what game are you talking about?\nAnd he said, Fred, it's all a game.\nWhat's remarkable is he never went any further.\nAnd that question never got out of the insides of my being.\nSo I finished up my remaining three years of the Academy, did very well.\nGraduated with honors was on the fast track for the space program.\nAs Brad said, married my high school, sweetheart Jill 10 days later, off to flight training.\nGot my wings as a backseater and reported to duty in San Diego, flying S3 anti-submarine\naircraft off of carriers.\nAnd once again, just getting all the checks in the box, you all know the game.\ngot to get the check in the box and getting all those evaluations that said\nearly command and everything else. Until that one day I was flying a mission of\ntracking Soviet submarines about 300 miles off the coast of Southern California.\nIt was a secret mission so we were not filed in those days with FAA or anyone\nelse. Dropping sonobois which are listening devices into the water, flying\nabout 200 feet off the deck and listening and we were indeed tracking a Soviet\nmissile submarine.\nWhen suddenly there was a sound in the aircraft like a shotgun going off and I leaned forward\nfrom my back seat and saw that our windshield cracked.\nThe next words I heard I'll never forget, the pilot said to me, Fred, if this glass\nimplodes, that is if the glass comes in on us, get you in the sensor out.\nThe sensor was the enlisted man sitting next to me who processed all the technical equipment.\nI was a mission specialist, and what the pilot was essentially doing is telling me that\nif the glass came in, the two of them would already be dead, and he was given me permission\nto eject out of the aircraft.\nI began crying out, Mayday, Mayday, November Golf 702.\nMayday, Mayday, November Golf 702, and of course no one responded.\nNo one knew we were there, and we drove to the horizon, and therefore our radio signal\ndidn't get there.\nWe could quickly check the radar and found we didn't have any ships on the horizon.\nWe were also flying over sharp, infested waters.\nThe survival rate of the ejection seat in the S3 was not that good.\nAnd it was an interesting time in life, you can imagine.\nEventually, as we climbed to the lighter altitudes in the hopes that the air would not destroy\nour windscreen.\nMy arms came off the primary ejection harness over my head, and one arm went between my legs\nfor the auxiliary harness to eject, allowing me to take my hand and get below my torso harness\ninto my flight suit and pull out a little book I'd been given by the Gideons when I graduated\nfrom the Academy.\nAnd I turned to the one song I remembered reading, and I read the Lord as my shepherd.\nI shall not want.\nHe makes me lie down in green pastures.\nHe leaves me beside quiet waters.\nHe restores my soul.\nAnd as I continued crying out Mayday, Mayday without any response, I realized the next face\nI probably would encounter was the face of Jesus, the Christ.\nAnd I knew at that moment I was not ready.\nI'd lived my life for myself, for my goals, for my dreams, and taught my wife to do the\nsame, to live for my goals, my dreams.\nI had mastered the game.\nNow I was confronted with a vastly different reality.\nI wasn't sure about my destination.\nAnd as you all know, I'm sure if you don't know your destination, how will you\never get there. We just spend our lives wandering. Yes, eventually, the Los Angeles\nTower heard our Mayday and asked, what are your intentions in November golf? And I\nreplied, sir, we just want to get home. When we finally got home, reached the\nbeach as we called it. I began to commit myself to figuring out what life was\nreally all about, because it clearly wasn't about me anymore. After considering many\ncareers, yes, including politics, I realized God wanted something else. And some months\nlater, on my knees, I said, Lord, I'm yours. I need you in my life. So yes, I committed\nto a vastly different path.\nAnd when I was offered an opportunity\nto get educated in a specific program for this space program,\nI replied, no, thank you.\nI have another purpose in life.\nI'm here to remind you today that you all\nhave a very special purpose in life.\nWe who know this language refer to it as a calling.\nAnd we realized this not about how much we accomplished\nin a given day, though you all have\naccomplish much. It's not about pleasing everybody because we never can. It isn't\nnecessarily feeling good about what people think about us because while their\nopinion is nice, the ultimate opinion is the one who died for us, who rose for us.\nThe one in whose presence we will one day stand and hopefully and willingly\ndrop to our knees. My brothers and sisters, I like you. Try to serve. I serve\nChrist by trying to serve other people, serving malnourished people around the\nworld and trying to get food to the hungry and well right now or in four counties.\nAnd if you need to get food then contact Brad Thomas and he'll give you my\nMy contaction will get some food for your people.\nBecause ultimately what matters is not everybody else's opinion, or whether we had a good\nday, but whether our audience of one is pleased, isn't that right?\nSo I'm here to remind you of the one who will be standing waiting for you when it's all\ndone.\nI'm here to remind you that we have one who died for us.\nrose to give us hope and a new life. I invite you to recommit yourself to what really matters.\nIt's where we work together. It's where we serve others. And when the end of the day,\nwe turn to Lord and say, Lord, I hope you're pleased with me. And if not,\nthe word forgive me because I want you to be pleased tomorrow. Would you please stand\nas I pray over you? Blessed and holy Father, we need you. We need your blessing. We can\nget distracted by so many needs in this world. And so Father, I ask the anointing of your\nHoly Spirit now in the Holy Name of Jesus.\nUpon these, your servants, these leaders upon whom we all\nendure to depend, they would continue to work together,\nbut they would continue to encourage each other,\nthat they would make the decisions that need to be made,\nto be agents of blessing, hope, and life.\nLord, we need you, and we need these, your leaders,\nso bless them now in the holy name of Jesus. Amen. I invite you to draw your attention to the flag.\nI pledge allegiance to the flag of the United States of America and to the Republic for which\nwhich stands, one nation under God, indivisible, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nChairman Hogan, the Chair on the Committee for Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, Prime Minister Winston Churchill was having an argument on\nthe floor with a lady and he asked her, says, I bet you don't even know how many toes a\npig has.\nAnd she said, Mr. Prime Minister, you're taking shoes off when couch it toes, is it?\nChairman Hogan, the chair of the Committee on Information and Audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 50th United States, following me establishes the order of business to\nenter first part of the period unanimous consent and reduction bills and resolutions, first\nreading and reference of house bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, first reading and reference of Senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution\nestablishing the order of business for the day?\nThe chair here's none and the resolution is adopted.\nFirst reading of bills and resolutions,\nthe clerk will read.\nHospital 748, by represent Petrie of the 166th.\nHogan of the 179th St, the 180th,\nDeloge of the 167th, Stevens of the 164th and others.\nThey'll be taught an act of men article 4,\nchapter 5, but titled 12.\nThe official go to Georgia,\nand tentative-related coastal waters, beaches, and sand dunes.\nNatural resources and environment.\nHouse Bill 749 by Representative Gillier\nto the 160-Second Stevens, 164th Hitchens on 61st\nand Malrow the 163rd.\nBill Bitton and act to create establish the Chatham County Building\nand Facilities Authority.\nIntergovernmental coordination.\nHouse Bill 750 by Representative Gillier\nto the 160-Second Stevens, 164th Hitchens, 161st and Malrow the 163rd.\nwill be titled an act to create the Chatham County Legislative Gang Prevention and Intervention\nCommission.\nIntergovernmental Coordination.\nHouseful 751 by Robson.\nJasper is the 11th bar, the 103rd Chocus of the 138th.\nNext to the 69th at Evans of the 57th.\nBill being titled an act to amend Part 3 of Article 7, Chapter 3, and titled 20 of the\nfiscal to Georgia annotated relating the Georgia Student Finance Authority.\nHigher Education.\nHouseful 752 by Robson.\nCooper, the 43rd, Dempsey, the 13th,\nHogan, the 179th, Oliver, the 82nd,\nand Attria to the 150th.\nBill Nitton, an act of mental health.\n37 of the physical, and Georgia annotated,\nrelating to mental health.\nHealth and human services.\nHouse Resolution 372 by Roester Holley, the 111th,\nWilson, the 80th, Hugley, the 136th,\nGillier, the 162nd, and Campbell, the 171st and others.\nResolution, urging members of the Georgia Employment First\nCouncil develop recommendations.\nIndustry and labor.\nThat completes First Readers.\nSecond reading of bills and resolutions,\nthe clerk will read.\nHouse Bill 745, by Representative Jackson of 128,\nthe Bill to amend and actually reconstitue the Board\nof Education of Washington County.\nHouse Bill 746, by Representative Lim of the 99th\nand Maynard of the 56th.\nThe Bill will lead into an employer's duty\nwith respect to provision of safe employment.\nHouse Bill 747, by Representative Lim of the 99th,\nThe remainder of the 56 are billed to relating to definitions relative to air quality.\nHouse Resolution 369 by Representative Basemore of the 63rd.\nBruce of the 61st, Jackson of the 64th, body of the 62nd, Thomas of the 65th Resolution honoring the life of Congressman John R. Lewis, and dedicating a road in the memory.\nHouse Resolution 370 by Representative Roberts of the 52nd Williams of the 37th Scofield of the 60th, Lopez of the 86.\nMaynard, the 56th Resolution, creating the House Study Committee on the Impact of Active Shooter Drills in Schools.\nSenate Bill 280 by Senator Gouge of the 51st to build to amend and act to create a Board of Commissioners of Lumpkin County.\nSenate Bill 282 by Senator Anderson of the 24th Miller of the 49th Mollison of the 53rd Duggan of the 30th Gouge of the 51st and others.\nA bill to amend and act creating a Board of Elections and Registration for Lincoln County.\nSenate Bill 283 by Senator Anderson of the 24th Miller of the 49th Mollison of the 53rd Duggan of the 30th Gouge of the 51st and others.\nA bill to reconstitute and reestablish the Board of Elections and Registration of Lincoln County through 2nd Readers.\nReports of Standing Committees, the clerk will read.\nRepresentative Donnelly and Taylor, 173rd District Chairman of the Committee on Governmental Affairs submitted the following report.\nAnd the Speaker of the Committee on Governmental Affairs has had under consideration the following bill of the Senate has instructed me to report same back to the House following recommendation.\nSenate Bill 182, do pass, respectfully submitted,\nRepresentative Darlene Taylor, 173rd District Chairman.\nRepresentative Jan Tancke,\nso the 160th District Chairman and Committee on Intergovernmental\nCoordination submitted the following report.\nMr. Speaker, your committee on Intergovernmental Coordination has\nhad a consideration following bills of the House.\nThis is Dr. Media Report, the same back of the House,\nfollowing recommendations, House Bill 703,\ndo pass, House Bill 704, do pass, respectfully submitted,\nRepresentative Jan Tanker, so the 160th district chairman.\nRepresentative Gerald Greene and the 151st District Chairman on Committee on State Properties submitted the following report.\nAnd the speaker, your committee on State property, has done a consideration to filing bill of the Senate as an instructor meeting reports.\nSame back, the last filing recommendations, Senate bill 140, do pass.\nRespectfully submitted, Representative Gerald Greene and the 151st District Chairman.\nThat completes the reading of the report's standing committees.\nWe're going on now to morning orders.\nGoing on to morning orders.\nChair will remind members of the 10 minute time limit at this point of the session.\nrecognizes for a morning order, Chairman Jan Tancersley.\nThank you, Mr. Speaker.\nToday, I would like to honor a bullet-canny woman, Linda Brannon-Williamson, whose dream\nwas to leave a legacy that would encourage and prepare young women in Southeast Georgia\nfor a professional role in leadership.\nwas a great example of selfless service, devotion to her family, her church, her community,\nand a job that she loved with Georgia Power.\nShe never missed an opportunity to encourage others and met life with a smile.\nDuring her lifetime she broke professional barriers for women with respect, honor, and humility.\nIn Linda's last year of life, she shared her dream with two of her best friends and expressed\nregret that cancer was not going to allow her to develop her ideas. Those friends encouraged\nLinda to move forward her dream and make it a reality. Linda gained renewed strength and\nenergy and she researched successful foundation boards and she even had the privilege of\nappointing the founding board members. I'm proud to say that I was appointed by her and\nand continue to serve on this board today.\nCancer did not win.\nThe LBW Foundation was established in August of 2014,\nand the first graduating class was in 2015.\nThe Academy has graduated a class every year since.\nIn 2019, this Academy expanded into Rome, Georgia.\nAnd in future years, other plans have\nbeen made for other expansions across the state of Georgia.\nIn this same year, the LBW Foundation\nreceived the Innovation and Community Leadership Award\nfrom UGA's JW Fanding Institute for Leadership.\nThis institute facilitates the Academy every year,\nbringing premier content and speakers\nto each of the eight sessions.\nI have hosted one of the sessions annually\nsince 2015 and many of you have participated in it\nto bring the class to the Capitol to hear legislators\nand other professional women to share a bit\nabout their journey into leadership.\nNominees come from Academy alumni, board members,\nbusinesses, and community members.\nYes, we lost Linda, but hertering lives on\nand will continue to impact future generations\nof great leaders.\nThank you.\nChair recognizes Chairman Lynn Smith for a morning order.\nThank you, Mr. Speaker and members of the House.\nMy capsule of history for women's history month is about a woman known as Susan Cobb,\nMilton Ackinson.\nShe was the first lady of Georgia as the wife of Governor William Yates Ackinson, who\nservice governor from 1894 to 1898. She used her position to advocate for state\nfunding for women to attend college, which led to the Georgia College and\nState University. From there she went into the insurance business and later in\nlife she served as the post-Mrs. Inunin, a title given to her by President\nTheodore Roosevelt. First Lady Ackinson was not only a visionary but a\nAnd a leader for her time, a time where women did not have the right to vote.\nI'm certain if she could see noon and now in 2021, she would be pleased to know that\nher legacy of service is being followed by one of her descendants, Luanne Connell, my\nneighbor and friend.\nShe is still carrying the torch for the well-being and advancement of women.\nAnd that is a circle of life with history to know that your legacy can live on.\nThank you, Mr. Speaker, members of the House.\nI yield the well.\nChair recognizes representative Scothield\nfor a morning order.\nAll right.\nJust trying to get him all up here.\nOkay.\nThank you, Mr. Speaker and members of the House.\nEach year, I stand before you to recognize Lupus Advocacy Day.\nEach year, the House and Senate stand together to publicly support and acknowledge over 55,000\nGeorgians living with or impacted by Lupus.\nI am very thankful and appreciative of my colleagues.\nThis year, our event will be held virtually at 7pm tonight, but we as members of the\nGeorgia General Assembly have a House Senate Resolution Governor's\nProclamation and we wear our lupus capes in solidarity of the strength that it\ntakes to live with lupus. Our work continues. Mr. Speaker, this flood of purple\nyields the well.\nChair recognizes the representative Hutchinson for a morning order.\nChair recognizes the minority caucus whip representative Wilkerson for a morning\norder.\nThank you, Mr. Speaker.\nToday we come down to the well to thank our legislative delegation at the federal level\nfor the hard work they did in passing the American rescue plan.\nSo that will provide immediate relief to middle class\nGeorgians across the state.\nI know there's some concern about the fact\nthat we might not be able to cut taxes,\nbut I think everybody will appreciate the $10,200\nthat will not be taxed unemployment.\nThat's a real tax cut to Georgians, almost $600.\nThey'll appreciate the stimulus checks that they'll be getting.\nThey'll appreciate the help to our local restaurants.\nI think they'll appreciate all those things.\nI just want to say thank you and that we look forward\nworking with this whole house as we have some great legislation in deciding what we're\ngoing to do with five billion five billion dollars and with that I yield the well thank\nyou chair recognizes representative McLeod for a morning order thank you mr.\nspeaker and big up to my colleague today I've come to the well to declare that\nThe leadership has come back to the United States of America and to let you know that\nhealth is on the way.\nWith the American Rescue Act, Georgia will receive $5 billion.\nMy County Gwyneth will receive $181 million.\nGwyneth County Public School System will receive $279 million.\n$79 million.\nThe American Rescue Plan cuts the cost to expand Medicaid so that between 350,000 to 500,000\nGeorgians could gain access to health care.\nThis package also provides billions of dollars to disadvantaged farmers, especially black\nfarmers.\nExperts say this is one of the most impactful legislation since the Civil Rights Act of 1964.\nThe Farm Bureau stated that $10.4 billion out of the American Rescue Plan will support\nagriculture.\nSo I want to correct the record.\nYesterday my colleague tasted that the Rescue Plan would prevent us from giving tax credits\nto farmers.\nThis is false.\nYes my friends, help us on the way.\nAmericans deserve a return on investment.\nall after the communities have been impacted by the COVID-19 virus. And again, this is the first\nanniversary of the fact that the pandemic was declared on March 11, 2020, to be an epidemic,\na pandemic. Thank you, Mr. Speaker. I yield the well. Chair recognizes Representative Hutchinson\nWe're a morning order.\nThank you, Mr. Speaker and I apologize for being late\nToday on the one-year anniversary of shutting down the state for COVID I bring to you a\nfuture chef and future\npop star\nMichael\nWho is a kind, respectful, fun loving and family-oriented boy who enjoys spending time with family\nhelping others and working with organizations that provides meals to those in need.\nColleagues, Michael is one of the hundreds of beautiful children that are available for adoption today in Georgia.\nThank you, Mr. Speaker, and I yield the well.\nOkay, we're about to go on to the rules calendar.\nBefore we go to the rules calendar, I got something I just need to say.\nYou know, last week, the rules chairman from the other lesser chamber came over to visit.\nWe gave him a warm and gracious welcome, but you know, no good deed goes unpunished.\nSo, he understand he went to the well yesterday to complain about this chamber.\nAnd you know, nobody disrespects this house.\nI have sent a message over there that, you know, I think they're afraid of the dark\nin this over there because they don't like to work after it gets dark.\nthey proved that cross-over day. And I understand now why they voted down the compensation bill because\nI guess they think they're being paid too much for what they do as it is.\nSo, but I've asked Chairman Smith to move some Senate activity and he has.\nSo we have one bill on the rules calendar today.\nClark will read the caption to Senate Bill 4.\nSenate Bill 4, Westerner Cropatric of 32nd Roberts in the 29th red of the 33rd\nBerk of the 11th and Watson in the 1st.\nWe title an act to amend chapter 5 of the title 26.\nThe fiscal Georgia annotated relating to drug abuse treatment and education programs.\nSo to prohibit patient brokering this bill,\nI'm referring to the committee on insurance.\nThat committee recommends that this bill do pass\nby committee substitute.\nChair recognizes representative Reeves\nto present the bill.\nThank you, Mr. Speaker.\nI don't know if I'm excited or scared now\nthat I'm in here on the first Senate bill.\nI have the session here for the House,\nbut I mean, my God, these Senate bills need lots of work.\nThey need a lot of work.\nyesterday in my subcommittee, we started some of those processes and good Lord they need\na lot of work, but I am happy to tell y'all that this Senate Bill 4 is actually, this\nis a great bill. It's a bill that's actually personal to me. Myself and Senator Kirkpatrick\nhave been working on this issue for several years. We have a non-profit recovery center\nin Cobb County that's called the Davis Direction Foundation and it was one of our school counselors,\na very active person in the community, lost her son who was a student at KSU to a heroin overdose,\nand she's dedicated the rest of her life to addiction recovery. And she has started the Davis\nDirection Foundation in the zone in Cobb County and has become a leader in the state of Georgia\nthat she's set a model that the rest of the state is following.\nAnd she's frankly developed a voice on the national scale.\nBut with the rise of how we treat substance abuse differently\nand how our different approach to recovery,\ninstead of criminalizing, we focus on recovery.\nAnytime an industry develops, there's always bad players.\nThere's always bad players that come up\nand figure out how they can make a buck.\nOne of the issues that I've been dealing with in my district\nis the concept of these sober man houses\nthat are totally unregulated,\nwhere there's not necessarily anything good going on there,\nbut there's somebody that's getting\nto build an insurance company.\nSo instead of flipping houses these days,\nwe just turn them into sober man houses.\nThere is a lot of aspects of this industry that are shady.\nAnd there are two, there's patient brokowing\nwith referrals where people are essentially committing\nwhat should be fraudulent acts and making money,\nfiguring out how to make money.\nAnd then significantly, there's this drug testing.\nMany of you might be aware there's\nwhat we call multi-panel drug screens,\nwhere they take one drug screen and it tests\nfor five or seven different substances.\nAnd because you've got insurance involved in all this,\nwhich is a good thing, there are some testers\nthat are breaking if it's a five-panel drug screen,\neven though it comes from one year in screen,\nthey're breaking it into five separate tests\nand they're building accordingly.\nAnd that's just wrong, they've figured there've been ways\nthat folks have figured out loopholes\non how to gain the system on this.\nFlorida, which is a state that much like Georgia\nhas suffered with substance abuse in a lot of ways.\nAnd a few years ago, the state of Florida passed a bill\nthat did the same exact things that we're doing in this bill.\nAnd ironically, what happened was a lot of those players\nin Florida just moved on up across the state line\nand set up shop in Georgia.\nAnd now they're essentially predators.\nAnd this is going to allow the state\nto regulate these things and the Department of Insurance.\nSo this is a great bill and I'll yield for questions,\nMr. Speaker.\nDo you yield for questions?\nI do.\nChair recognizes representative Hutchinson\nto your ride up in the gallery for a question.\nThank you.\nDo you yield?\nI do.\nIs it not true that I am a mental health provider who also\nprovides addiction treatment?\nIf the general lady says speaks, yes.\nI do so say since 2002, I have been a mental health provider\nwho also provides substance abuse treatment.\nIs it not further true that I am contacted constantly\nto offer referrals for a fee.\nIf you say speak, yes.\nI do, and I just wanna say thank you\nfor bringing up this bill\nbecause this is a problem that really needed\nto be addressed in Georgia, so I appreciate you.\nThank you.\nThank you, Representative.\nI'll yield for one more question if I can ask you.\nChair recognizes Representative Williamson\nto your right for a question.\nMr. General, Neil.\nI do.\nIs it not further to a representative\nthat these sober houses are a blight\non all of our communities across Georgia,\nand the ultimate harm is being done\nto those men and women that these houses\nare purportedly there to serve.\nIs that not true?\nIt is true, and the problem with these sober houses,\nI have a neighborhood in my district\nwhere about five or seven have popped up in the neighborhood,\nand it's frankly changed the nature of the neighborhood.\nThese are because the Constitution considers addiction recovery to be a disability, these\nsober houses enjoy a constitutional protection that makes it very difficult for local communities\nby zoning and other methods to control this.\nAnd so they're really fitting through a loophole that, frankly, we need Congress to act\non that.\nBut what this is doing is we're trying to figure out all the ways that we can bring accountability\nthrough regulation. It's a multi-step process and we'll continue to see legislation like this,\nbut thank you for your question. Mr. Speaker, I will yield the well.\nGentlemen has yielded the well. Is there any objection to the previous question being ordered?\nThe chair here is none. The previous question is ordered. Is there any objection to adopting\nthe committee substitute. The chair here is none. The committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill. The chair here is none. The report of the committee\nis agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote\naye. Those opposed to vote no and the clerk will unlock the machine.\nWhat purpose does representative mom to hand rise?\nThank you, Mr. Speaker, pursuant to House Rule 138 and I'd like to be excused from this vote.\nGentlemen, has that right and the journal will so reflect?\nHave all members voted?\nhave all members voted, if so, the clerk will lock the machine on the passage of Senate Bill 4.\nThe eyes are 151, the nays are zero. This bill having received the requisite constitutional\nmajority is therefore passed. What purpose does Chairman Martin rise to make a\nmotion to state your motion? I move that Senate resolution 154 be moved to the\ncommittee on house higher education from the committee on insurance both\nchairs agree. Clerk will read the caption. Senate resolution number 154 by\nSenator R.O. of 36, sub-steadler of the 52nd malls, the 53rd and Butler of the 55th, a resolution\ncreating a joint study committee for strengthening Georgia's future workforce.\nOn the gentleman's motion that Senate Resolution 154 be transferred from the insurance committee\nto the Higher Education Committee. Is there objection? Is there objection? The Chair\nhears none and it is so ordered. Chair recognizes Chairman Parsons for a motion.\nMr. Speaker, I move that House agree with the Senate Substitute to House Bill 156.\nChairman Parsons moves that this House agree to the Senate Substitute to House Bill\n156.\nThe clerk will read the caption.\nHouse Bill 156 by Representative Parsons, the 44th Martin, the 49th Kelly, the 16th and\nothers to be titled an act to amend title 38 and title and 50 of the fiscal\nto Georgia annotated relating to military emergency management and veteran\naffairs in state government. Chair recognizes Chairman Parsons to explain his\nmotion. Thank you Speaker Rustin. We we passed House Bill 156 out this\nchamber about two or three weeks ago unanimously. You will recall this is a\nbill that sets up a process for agencies, state agencies, county, local government agencies\nto report cyber attacks, breaches, cyber ransomware attacks, things of that nature to the director\nof emergency management and home and security. The Senate passed a bill with no changes\nto the language that we adopted over here. There were two things added that are very important\nand I completely agree with and I would ask you to agree also.\nWe added that there'd be nothing in this code section\nthat would relieve any agency or any utility\nfrom notifying customers if there had been a breach\nthat involved them.\nAnd it also added this, which is very important, I think.\nIf the governor makes a determination\nthat a memorandum of agreement with one or more\nof the major military commands established in the state\nwould substantially enhance the education or job placement of Georgians in the areas\nof science, technology, engineering, math, or cybersecurity, he's authorized to enter\ninto such agreement and any state expenditures would have to be provided in accordance\nwith the appropriations.\nAnd that's it.\nThat's the bill.\nThat's the changes that were made in the Senate.\nMr. Speaker, for any questions, I'll be glad to try to answer them.\nYou do not have any questions.\nLadies and gentlemen, I ask that the House and you agree\nwith the Senate substitute to House Bill 156.\nI yield well.\nOn the gentleman's motion at the House\nagree to the Senate substitute to House Bill 156,\nall those in favor will vote aye.\nThose opposed will vote no in the clerk will\nunlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines on the passage of our on the gentleman's motion the eyes are 147 the\nNays or zero, this House has agreed to the Senate substitute to House Bill 156.\nMr. Clerk, please read House Rule 1.10 and 1.11.\nHouse Rule 1.10.\nWhen another member has the floor and is speaking, the members of the house shall refrain from private conversations persons on the floor or on cell phones so as to preserve silence.\n111.\nExcept for emergency situations in which meetings of the House of Representatives are conducted through electronic means, there shall be no speaking into any telephonic device or any audible sounds admitting from any such device in the House of Representatives Chamber.\nchamber. However, members may use the messaging capabilities of such devices.\nFor two days in a row, the chair has received complaints that members are either\nown cell phones or their cell phones are going off during the devotion.\nNow, I know I'm a little bit lenient on during session, but I am not going to tolerate the\nuse of a cell phone or hearing a cell phone during the devotion each day.\nI'm just not.\nSo I want you to be mindful of that tomorrow.\nAnd I also want you to reflect a little bit.\nThis is what I read the room for.\nBut the last two, a couple of three days, I am convinced that the most dangerous place in Georgia\nis in front of the any-room doors right before we lock the door to do the devotion.\nIf you're on the other side of that door, you can get killed.\nAnd I bring that up and we laugh about it, but if you know, we bring\nministers from all over the state here and they're sitting up here watching\nthe Exodus and it's not a good look. So I just wanted to call your attention to that. Thank you\nfor letting me talk about that a little bit. Clark will read the caption to a group of privileged\nresolution honoring the life and memory of James A. Walters honoring the life and\nmemory of Erica Michelle Robertson honoring the life and memory of Henry\nCounty Commissioner Gary Barham recognizing commending Brianna Drake\ncongratulating commending Hazel Sullivan's Striggles for receiving the\n2021 Nickel T Randall Service Leader Award, congratulating\ncommending Foster Brady Farms, commending a leadership\nPutnam class of 2021, congratulating and commending\nTamara Carrera for receiving the 2021 Yellow Rose\nNikki T Randall Service Leader Award, and for other\npurposes that completes the reading with privilege\nresolution.\nIs there any objection to adopting the privilege\nresolutions. The chair here's none and the resolutions are adopted.\nWe're going on now to announcements. Going on to announcements. Chair recognizes\nChairman Dubnick for an announcement.\nThank you, Mr. Speaker.\nYour House Education Committee will meet upon adjournment in the CLOB.\nWe have a couple of Senate bills, but Mr. Speaker, after your message this morning about the rules, Chairman, from the other Chamber, I guess maybe we'll adjust the agenda and not include his bill.\nAnd since the Yellow Jackets are playing this afternoon, this will be a quick meeting.\nThank you, Mr. Speaker.\nChair recognizes Chairman England for an announcement.\nThank you, Miss Speaker.\nEveryone, I think you know now that Sunday is a big day because we spring forward an\nhour, but Sunday is a big day for another reason.\nMany spring forwards ago, and a few fallbacks ago, it was the birth of our speaker.\nAnd so he is celebrating a birthday on Sunday.\nWon't say him any years.\nBut if y'all would join me in singing happy birthday to him.\nI'm going to start it off like we do the pledge,\nand I'm going to get away from the microphone\nbecause you don't want to hear me sing happy birthday to you.\nHappy birthday to you.\nHappy birthday, Mr. Speaker.\nHappy birthday to you.\nThank you.\nThank you.\nThank you all very, very much.\nI hope he didn't jinx me.\nI hope I am here Sunday.\nSo what purpose does representative Sharper rise?\nHe should have had you down here.\nYeah, well, actually, I was going to sing it to you\ndid my first time not having my oxygen on,\nto see if I can actually sing a little bit\nwithout the oxygen.\nHappy birthday to you.\nHappy birthday to you.\nHappy birthday, dear speaker.\nHappy birthday to you.\nThank you very much, Representative Sharper.\nChair recognizes Representative McClain for an announcement.\nThank you, Mr. Speaker.\nWorking family caucus will be on Zoom at 12 o'clock, so please stop by 310 and get your\nlunch for members. Again, working family cocks will be at 12 o'clock\nnoon and lunch will be in 3-10. Thank you, Mr. Speaker. Chair recognizes\nrepresentative Ridley for an announcement.\nGreater Lighted Industry subcommittee on Professional License will be\nmeeting at 1 o'clock in room 606. So it's moved from 3-30 now 1 o'clock in\nsix oh six. Thank you. We're going to get out of here because the chair will be\nout of the grid from noon until about one thirty or two watching the\nfennon county women's high school basketball team win the state\nchampionship today. So I got my cap and I'm already. What purpose is\nrepresented to Bennett rise. Parliamentary inquiry. Happy birthday to you. Happy birthday to you. Happy birthday, Mr. Speaker.\nThank you, Representative Bennett. I'll put Chairman England to shame on the singing. I'll tell you that.\nAll right. Chair recognizes the majority leader for a motion and many more miss\nspeaker. Miss speaker, I move that this house stand adjourned until 10 a.m. Monday\nMarch 15th, 2021.\nMajority leader has moved that this house be adjourned until 10 a.m. on Monday, March 15th.\nAll those in favor of the motion will say aye. All those opposed will say no.\nThe eyes have it. This house will be adjourned until Monday, March 15th at 10 a.m.\n",
  "updated_at": "2026-02-12T13:59:47.686926+00:00"
}