{
  "video_id": "6D0d0QRac0o",
  "url": "https://www.youtube.com/watch?v=6D0d0QRac0o",
  "title": "House PM Meeting 2 for Day 28 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 51,
  "summary": "Here is a structured markdown summary of the Georgia House PM Meeting 2 for Day 28 of the 2025 Session:\n\n## Overview\nThe session focused on passing several bills, including HB 579 to modernize professional licensing in Georgia, HB 549 to extend the reimbursement window for law enforcement training expenses, and HB 150 to require quarterly reports on foreign funding to state universities. There was some debate around the scope and approach of HB 150.\n\n## Key Actions\n**HB 579**: Provides better constituent services and modernizes professional licensing in Georgia.\n**HB 549**: Extends the reimbursement window for law enforcement training expenses from 15 to 36 months.\n**HB 150**: Requires the university system to report quarterly on funding received from \"foreign countries of concern.\"\n\n## Bills Introduced (First Reading)\nNone mentioned.\n\n## Notable Moments\n- Debate on HB 150 regarding the scope of reporting on foreign funding to universities.\n- Questions raised about labeling individuals from \"foreign countries of concern\" as concerning.\n\n## Votes\n- HB 579 passed 158-2.\n- HB 549 passed unanimously 164-0.\n\n## Attendance\nA quorum was present, with all members voting on the bills.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified.",
  "transcript": "All members, all members will please come to the floor, all members, Mr. Clerk, will you ring the bell and let our members know we're ready to get started.\nYou\nHouse will come to order, Mr. Clerk, will you read a caption to House Bill 5, 7, 9, 579?\nHouse will 579, I represent a revenues of the 99th and others, to be entitled back to a man title, 43, if you should go to Georgia,\nto annotate and relate to professions and businesses, so as revised provisions relating to licensure to engage in the practice of a profession, business or trade in this state,\nhave been referred to the committee on appropriations, not committee\nrecommends this bill do pass by committee substitute.\nRepresentative Matt Reeves recognized to present House Bill 579.\nThank you, Mr. Speaker, House colleagues. House Bill 579 is the product of the Blue Ribbon\nProfessional Licensing Study Committee want to thank Chairman Hatchett for co-chairing it with the Senate.\nI want to thank the majority leader, Chairman Marcus Wiedauer, Chairman Prince for leading that effort.\nAs well as House-regulated Industries Chairman Powell for working on this issue of professional licensing for many years.\nWhat this bill does is it provides better constituent services.\nIt brings professional licensing into the 21st century.\nIt gives what the people of Georgia and our small businesses deserve, which is a better\nprofessional licensing system so that hardworking Georgians and small businesses can get to work\nand not have to fool around with burdensome regulations during licensing.\nIt also gives the professional licensing division the authority to grant licenses that are\nin order and it frees up our boards to focus on bad actors.\nMr. Speaker, if there are no questions, I yield the well.\nGentlemen, I have no questions.\nThank you.\nGentlemen, is yield of the well is there an objection to the previous question being ordered?\nHere in none the previous question is ordered.\nIs there an objection to withdrawing the committee's substitute?\nHere in none the committee's substitutes were drawn.\nIs there an objection to adopting the substitute offered by the committee on rules?\nnone the rules committee's substitute is adopted, is there any objection to agreeing to\nthe report of the committee, which was favorable to the passage of the bill?\nHearing none the report of the committee is agreed to, shall this bill now pass?\nAll in favor of the passage of the bill, will vote yes, all those opposed?\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nhave all members voted all members voted if so Mr. Clerk will you lock the\nmachine on the passage of House Bill 579 the A's are 158 and a's are two this\nThis bill, however, is either requisite constitutional majority, is therefore passed.\nMr. Clerk, will you read the caption to House Bill 549-549?\nHouse Bill 549 by Representative Seaball, 34th, and others to be entitled to amend Code Section 35-8, 22 of the fiscal code of Georgia.\nAnd it's any relating to reimbursement of training expenses by subsequent employer or peace officer.\nthis bill have referred to the committee on public safety and homeland security.\nThat committee recommends that this bill do pass.\nRepresentative Seabaw has recognized to present the bill House Bill 549.\nThank you, speakers and members of the House.\nI rise today to present House Bill 549.\nUnder current Georgia law law enforcement agency may seek reimbursement for\nmandated training expenses when a peace officer is trained by one agency and\na way by another within 15 months of completing that training.\nLast year the required mandating training was increased by 50% from 400 hours to 800 hours.\nAnd all House Bill 459 does is extend the reimbursement window from 15 months to 36 months.\nEnsuring agencies have a fair opportunity to recover their investment in their officer's training.\nThat is the bill and I'll stand for any questions.\nMr. Speaker.\nAnd gentlemen, I have no questions.\nThank you. I yield the well.\nAnd gentlemen, is yielded the well?\nIs there an objection to the previous question being ordered?\nPeary Nunder, previous question is ordered.\nIs there an objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nPeary Nunder, the report of the committee is agreed to, shall this bill now pass?\nAll in favor of the passage of the bill, we'll vote yes.\nAll those opposed will vote no.\nAnd Mr. Clerk, will you unlock the machine?\nwho\nhave all members voted\nAll members now voted if so, Mr. Clerk, will you log the machine on the passage of House\nBill 549, the yeas are 164, 164, the Mays are zero, this bill having seated records\nthe constitutional majority is therefore passed. Mr. Clerk, will you read the\ncaption of House Bill 150, 150? House of 150,\nI represent a plumbing of 114 to be titled and act to amend Part 2, Article 2, Chapter 3,\ntitled 20 of the Fitch go to Georgia and Tate relating the university system.\nSo it's required quarterly reports regarding certain funding received from\nindividuals or entities related to China, this bill ever referred to the\nCommittee on Higher Education.\nThat committee recommends a dispelled do-pass by committee substitute.\nRepresentative Fleming is recognized to present the bill.\nRepresentative Tim Fleming.\nThank you, Mr. Speaker.\nColleagues, I bring you to today House Bill 150.\nIt is the combating threats from foreign countries of concern act for 2025 regarding higher\neducation.\nForeign countries of concern means the country whose government is designated as a foreign\nadversary by the United States Secretary of Commerce.\nWhat House Bill 150 does is promotes transparency in foreign funding to our higher ed institutions\nin Georgia for the university system to report quarterly to the General Assembly and to\nthe Governor of any funding received from these foreign countries of concern, other than\nsimple tuition payments for an individual.\nIt requires a university system to track and report the type of funding, its source,\nAnd it's a mount, it's purpose, and it documents its basis.\nMr. Speaker, that is House Bill 150, and if there are no questions, I'd yield the well.\nYou have a question to your layoff representative.\nWe're mine, I just recommend I ask for a question.\nYes.\nThank you, Mr. Speaker.\nIs it gentlemen yield?\nYes, ma'am.\nWhy do we always limit these bills to a specific list?\nBecause sometimes there are some unique circumstances we have to be on lookout for in the state of Georgia.\nSo wouldn't it make more sense for the sake of transparency to get a full report on all the\npossible foreign funding that our universities are getting?\nSo this is a, represent, this is a moving list.\nSo it changes, it could change month, month, week to week\nwith countries coming on and coming off.\nAnd that's why we're used that language\nbecause it's actually a list that the Secretary of Commerce,\nDepartment of Commerce puts out in updates pretty regularly.\nDoes the gentleman for their year?\nYes, ma'am.\nYes, I'm aware of how this list works.\nAnd my issue with it is that one, like you mentioned,\nit does move around a lot, which creates uncertainty\nfor creating these types of reports.\nAnd my concern is that when we are so narrowly focused\non just one thing, we do risk missing\nother potential threats.\nSo that's where my questions come from.\nThank you.\nGentlemen has one more question.\nRepresenting Jasmine Clark to your left.\nYes, sir.\nThank you, Mr. Speaker.\nDoes a gentleman yield?\nYes, ma'am.\nBriefly, you know, we had a chat about this in committee.\nAnd while I understand the premise of this bill,\nMy biggest concern is that it labels any individual who lives in one of these foreign countries\nas a person or an individual of concern, and I just have some heartburn about dislabeling\nanyone who lives in one of these places as a concerning individual.\nYes, man.\nWe had that discussion in committee through the hearing, and it does say in the bill\nthey have to be domiciled in those countries, but this is not pertaining to tuition.\nSo anybody who's playing tuition is not pertain to,\nit's just for all other funds\nthat are people who are domicating those countries.\nBut yes, ma'am.\nThank you.\nThank you.\nMr. Speaker, I yield the well.\nThe gentleman's yielded the well.\nIs any objection to the previous question being ordered?\nHere he none, the previous question is ordered.\nIs any objection to adopting the committee's subsidy?\nHere he none, the committee's subsidy is adopted.\nIs there any objection to agreeing to report the committee\nwhich was favorable to the passage of the bill.\nChair, here's none.\nAnd the board of committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill?\nWe'll vote yes.\nAll those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted.\nAll members voted.\nSo, Mr. Clerk, will you lock the machine?\nOn the passage of House Bill 150, the A's are 145, the A's are 22.\nThis bill having to see the requisite constitutional majority is therefore, therefore passed.\nMr. Clerk, will you read the caption to House Bill 288?\n288.\nHouse Bill 288 by Representative Gaines, the 120th and others to be titled next to a men\narticle 2, chapter 6, title 5, chapter 4, chapter 9, article 1, chapter 18, and title 15,\nand chapter 16, and of title 17, the official go to George annotated relating to fellow\npractice, declaratory judgements, prosecuting attorneys, and criminal trials.\nThis bill have inferred the Committee on Public Safety and Homeland Security.\nThat committee recommends this bill do pass by committee substitute.\nWe're representing Houston Gaines as recognized to present House Bill 288.\nThank you, thank you, Ms. Speaker.\nHouse Bill 288, I believe, is a common sense bill that will provide due process for law\nenforcement officers when accused by a prosecutor of not being credible or what's so being put\non what's so called a giglio or Brady list. Currently, a prosecutor can single-handedly\nruin a police officer's career by putting a cop on such a list with no due process. When\nput on a Brady giglio list, getting a new job for an officer becomes almost impossible\nbecause their credibility has been questioned. It's important that an officer does have\na real credibility issue that can be resolved and investigated. Currently, the officer\nis just placed on such a list and there is no investigation.\nHouse Bill 288 will provide necessary due process for officers by ensuring a review of\nposts upon an accusation by a prosecutor which will provide the factual basis for putting\nan officer on such a list.\nIt also ensures an officer cannot be disciplined solely for being put on the list until an investigation\nhas been resolved and the officer has been founded and acted improperly.\nThe bill requires posts to be notified\nin the officer's employing agency,\nwhich would then be required to notify the officer.\nCurrently, some officers don't even know\nif they're put on such a list.\nThey also ensure the investigation occurs,\nso if the officer does have a credibility issue,\nthat can be resolved,\nand if there's an officer's done something wrong,\nthey would no longer be employed.\nI will note that in its initial form,\nthe prosecutors in the state had some concerns,\nwe worked very closely with PAC to address\nthose concerns, I believe we've crafted a piece of legislation that resolves those\nissues. And so I also want to say thank you to represent Matt Reeves and Chairman Clint\nCrowe, Chairman Tyler Paul Smith who worked with us on this. Several states have recently\naddressed this issue. North Carolina, Iowa and Minnesota are just a couple of examples.\nAnd I'm going to speak, I'm happy to answer a question or two if there are any.\nGentlemen, have some questions. Thank you, Mr. Speaker. Are you the will?\nGentlemen, as you are the well, is there any objection to the previous question being ordered?\nHearing none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHearing none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to the past of the bill?\nHearing none, the report of the committee is agreed to.\nShall this bill now pass all in favor of the past of the bill?\nWe'll vote yes, all those opposed, we'll vote no.\nOkay, Miss Clerk, will you lock the machine?\nI have all members voted, all members voted, if so, Mr. Clerk, will you lock the\non the passage of House Bill 288.\nThe A's are 146.\nThe A's are 20.\nThis bill here is either requisite constitutional majority,\nis therefore passed.\nMembers, I'm going to take a speaker's moment here.\nI have a good friend who just came in to the gallery of the house.\nMr. John William Meeks.\nand his fifth fourth and fifth grade class from down in Wayne County, Georgia.\nThe gifted class is here visiting with us today. So let's make them welcome.\nY'all stand up. Let us see who you are. Stand up, John William.\nThank you members, the folks will be sitting in our seats for too long.\nSafe travels y'all, y'all be safe.\nMr. Clerk, will you read the caption of House Bill 583-583?\nHouse Bill 583 by Representative Glazer, the 67th and others,\nto be entitled back to a men code section 40,\nto 85.1 of the official code of Georgia annotated\nrelating a license plates for certain veterans,\nso as an increase in number of re-licensed plates issued\nto certain veterans, this bill I'm referring to,\nCommittee on Motor Vehicles,\nthat committee recommends a dis-build due pass\nby Committee Substitute.\nRepresentative Duayes, are you ready?\nThe lady's recognized to present the bill.\nThank you, Mr. Speaker, and my esteemed colleagues.\nHappy cross over day.\nToday I rise for your favorable consideration of HB 583.\nThis bill is just a simple upgrade of recognition and relief\nto the veterans in our state.\nIt is our honor always to show gratitude to all our veterans.\nToday, we know that they dedicated themselves\nin years past, serving and protecting this nation,\noften facing significant challenges, sacrifices\nduring their military careers.\nIn recognition of those who became disabled while serving,\nthis bill will allow them to have a second free license plate,\nwhich they can use for their spouse, another vehicle,\nor a motorcycle, caveat here.\nMy husband is a disabled vet,\nand I'm in line behind the motorcycle\nif this passes to get a tag on my car.\n40 years, I'm still a second.\nThis bill is supported by service men, women,\nretired veterans, disabled veterans,\nVSOs, VFWs, and other veteran organizations.\nI ask your favorable consideration of this second tag\nfor our veterans.\nIf it's being called, I yield for questions.\nYou have a question, I saw this one coming,\nbut I wasn't sure if it's gonna happen or to you left.\nKind of thought she might have a question on this\nfrom the ladies recognized.\nThank you, Mr. Speaker, because the lady you.\nYes.\nWould it not be my honor in my county\nto be able to advise the constituents\nthat come in and ask, why can I only get one plate\nwhen we have two vehicles?\nThis will allow that family the same security\nand they can additionally still receive their handicap\ncracker.\nThank you for your work, Madam.\nThe military veteran knows of what she speaks.\nLady did a great job.\nShe has no further questions.\nMr. Speaker, I yield the well.\nThe lady has yielded the well.\nThank you for the bill.\nIs there an objection to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there an objection to adopting the committee's substitute?\nHere in none, the committee's substitute is adopted.\nIs there an objection to agreeing to report the committee,\nwhich was favorable to the passage of the bill?\nHere in none, the report the committee has agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes.\nAll those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nhave all members voted for what purpose does Chairman Prince rise?\nMr. Speaker, pursuant to House Rule 133,\nX-Bake, excuse from this vote.\nThe gentleman has that privilege's record with so reflect.\nHave all members now voted?\nIf so,\nclerk will lock the machine on the passage of House Bill 583,\nthe yeas are 171 to naso zero.\nThis bill, having seated requisite constitutional majority,\nis therefore passed.\nCongratulations, Representative Goes.\nAppreciate you.\nMr. Clerk, will you read the caption\nof the House Bill 5484, 484?\nHouse Bill 484, by the represent of year\nto the 150 second and others to be entitled\nand act to amend Title 2080,\nthe fiscal code of Georgia annotated,\nrelating to general assembly,\nso it was a provide for the digitization\nand electronic publication of the Georgia laws.\nMiss Bill Emmer for the Committee on Code Revision that committee recommends that this bill do pass.\nFor anything you're recognized for the House Bill 484, Chairman Yerland.\nThank you, Mr. Speaker.\nToday I bring you House Bill 44, which is for the Georgia law books, which are the tan books in your office rather than the black code books.\nWhat this bill does is allow the books to be published in either hard copy form or digital form\nand maintaining a digital option can improve accessibility to everyone.\nAnd it's also important that this becomes law because it's often difficult to find a cost effective publisher these days.\nSo I ask for your favourable consideration on this bill.\nGentleman has no questions I yield well. Jim is yielded the well. Is there an objection to the previous question being ordered?\nHearing none the previous questions ordered is any objection to agreeing to the report of the committee\nWhich was favorable to the passage of the bill hearing none the report of the committee has agreed to\nShout this bill now pass all in favor of the past to the bill. We'll vote. Yes. All those opposed will vote no and\nMr. Clerk, were you in like the machine?\nYou\nWe have all members voted, we have all members voted this, Mr. Clerk, when you lock the machine.\nOn the past of House Bill 484, the yeas are 173, the nays are zero, this bill haven't received the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 529-529?\nHouse Bill 529, my pleasure to bear to the 24th and others to be entitled, and act to amend title 13.\nThe Bishop go to Georgia and annotate it relating to contracts, so to provide consumers with the option of having service contracts that contain automatic or renewal provisions terminate.\nThis bill emits committee on agriculture and consumer affairs, that committee recommends this bill do pass by committee substitute.\nYou\nI want to recognize the majority leader for a motion on this bill on House bill 529.\nWhy does the gentleman, what's the fourth purpose of the gentleman's race?\nMake a motion.\nState your motion.\nMr. Speaker, I move that House bill 529 be recommitted to the rules committee.\nLet's clear it where you read the caption.\nHouse will file 29 by Representative Barrett of the 24th to be entitled back to a mental 13 in the fish go to Georgia\nI am today to relate to contracts. It was to provide consumers with the option of having service contracts and today to automatic renewal provisions terminate\nOwn the gentleman's motion a house bill 529 be recommitted to the rules committee. Is there objection period none is awarded\nThis clerk has a read the caption of the house bill 535-3-0.\nHouse will 5-3-0, Representative Leveritt and the 123rd to be entitled to amend Article\n4, Chapter 9 and Title 15, and the fifth to go to Georgia annotated relating to time.\nand procedure so as to provide for the authorization for the electronic filings and pleadings in Pro-Bate Court.\nThis bill evidence for the Committee on Judiciary, that committee recommends this bill, due pass.\nChairman Leveritt is recognized to present the bill.\nHave you presented this one in the last two or three years, is this the first time?\nNo, Ms. Speaker, this is the first time.\nAll right, Mr. Chairman was recognized.\nthis one. Ladies and gentlemen, House Bill 530 simply authorizes electronic filing in civil\ncases and probate court. It's the statute is based on the one that we I think this body passed\nseveral years ago for electronic filing and spear court. The statute addresses limitations\non the vendor and what they can charge and what they can charge for people that they have\nI have to allow to file without charge and those kinds of things.\nThe council probate judges has requested it and it just requires that they be ready by January 1 of 2028.\nSo they've got some time to prepare and get ready to implement the system.\nAnd that's all that the bill does, Mr. Speaker.\nAnd I'd be glad to answer any questions.\nAnd gentlemen, has a question to your left representative Evans has recognized for a question.\nThank you, Mr. Speaker, does the gentleman kneel?\nYes, ma'am.\nIsn't it true that we both love our probate judges so much and we both hope that this bill passes unanimously?\nYes, that is true. I'm so delighted to hear that's true.\nThank you.\nThe lady had me nervous for a minute.\nThank you, Mr. Speaker.\nAnd gentlemen, has no further questions.\nLadies and gentlemen, I want to thank you again for your support.\nAnd since the give blue is quote, the other day went so well, I've got two more for you today.\nI want to thank each and every one of you for having extinguished yourselves during this session of the legislature.\nAnd my favorite one, this is unparalleled in the state's history.\nThank you, and I yield the well.\nI don't think you were authorized to do that, Mr. Chairman.\nBut since I was paralyzed, I guess you could.\nGentlemen, as you were the well, is there any objection to the previous question being ordered?\nnone of the previous questions ordered is any objection to agreeing to the\nreport of the committee which was favorable to the passage of the bill.\nHearing none of the report of the committee has agreed to shall this bill now\npass all in favor of the passage of the bill will vote yes all those\nopposed will vote no and Mr. Clerk will you unlock the machine.\nAll members voted.\nHave all members voted if so, Mr. Clerk, will you lock the machine?\nOn the passage of House Bill 530, 530, the yeas are 174, the nays are zero.\nThis bill, Henry C. The requisite constitutional majority is therefore passed.\nRepresentative Panich, Mr. Clerk, will you read the caption of House Bill 460, 460.\n460 by Representative Panage of the 51st and others to be entitled back to a man code section 24 or 5 501 of the fish\nProdigiorge amintated relating to certain communications privilege\nSo it's exclude from evidence certain communications may be between an attorney and client when the client is in a penal institution\nThis bill ever for the committee on judiciary now and civil that committee recommends a disbilled do pass by committee substitute\nRepresentative Panage has recognized to present the bill.\nGood afternoon colleagues, this is a simple bill and it's something that many of us already\nthought was the law.\nWhile a client is in a penal institution, the Sheriff Law Enforcement cannot record the\nconversation between a lawyer and their client.\nIt is a sacrosanct privilege and one that we need to make sure is now codified into law.\nThe prosecutors and the sheriffs have no objection to this bill.\nI yield for any questions.\nThe lady has no questions.\nI'd like to briefly remind her button may be pushed,\nbut I'll see her to a desk.\nThis unstuck now, the lady has no questions.\nThe lady's yielded the well.\nIs there any objection to the previous question being ordered?\nHere he none the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere he none the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere he none the report of the committee has agreed to.\nShall this bill now pass all in favor of the passage of the bill?\nWill vote yes, all those opposed?\nWill vote no, and Mr. Clerk, will you unlock the machine?\nI'm on board.\nI am all members voted.\nRepresentative Roberts, guys.\nParliamentary inquiry.\nState your inquiry.\nIsn't it true that we somehow miss\nthat this is Representative Panditch's first bill?\nAnd we, I think we're a little too, oh, it's not?\nI thought she said it was.\nYeah, it is.\nAnd I think we are a little too easy on her.\nI saw that him burglar outside so the representative\npennies came in and burglarized the well there and got out.\nI'm going to ask the representative to come back up and join me up front.\nCan I do that, Mr. Clerk?\nShe you to the well I'll get her back up here. Don't worry. Oh, there she is right there.\nNow you've you to the well, so I'm afraid I can't do it, but you'll pay for it.\nI know rules will be made to be broken, but I'm not going to break this with Mr. Will.\nThe ladies you to the well have all members voted.\ngetting closer all the time have all members voted if so Mr. Clerk will you\nthe machine.\nThis bill, having received a requisite constitutional majority, is therefore passed.\nRepresentative Panich, you pulled a fast one on the speaker and he won't forget it either.\nI can go in and tell you that now.\nMr. Clerk, will you read the caption to House Bill 647?\n647?\nHouse Bill 647 by Representative Donald Tucci, the 105th to be entitled an act to amend an act to incorporate the City of Mulberry.\nThis bill haven't been referred to the Committee on Intergovernmental Coordination.\nThat committee recommends that this bill do pass.\nMr. Speaker, members, thank you for hearing this bill today.\nThis bill is about annexing 45 small parcels into Mulberry.\nAll of these parcels are in my district.\nMy background is in land use.\nI served as a county planning commissioner.\nWhen I was running for office,\none of the most frequent complaints raised by voters to me\nbesides inflation, was the issue of growth in Wunette County.\nSpecifically, high density apartments\nand the rapid pace of growth and overburdening\nlocal infrastructure.\nThe city of Mulberry was born out of this frustration\nand the request of the people giving citizens\nwithin the city local control over planning and zoning.\nNow that I've been elected,\nI can do something to help give my constituents\nmore control over growth in our community.\nThis annexation bill simply allows the city of Mulberry\nto expand into my district, adding roughly 45 parcels\nto the city limits.\nThese parcels are a mix of residential dwellings,\ncommercial properties and undeveloped land,\nprimarily located along one road\non the north end of my district.\nMoving these parcels into the city of Mulberry\nwill allow my constituents to have a greater local voice\nover how this land is developed and used in the future,\nallowing decisions to be made by five locally elected\ncity councilmen rather than the majority,\nthan a majority of county commissioners\nto do not live in the community.\nMr. Speaker, I yield for any questions.\nYou have one question to your right\nright up the center aisle representative Gamble.\nLet's recognize for a question.\nThank you, Mr. Speaker.\nDoes the general lady yield?\nI do.\nJust for clarification, the city of Mulberry\ndoesn't have anything to do with the Palmetto Berry.\nDoes it?\nIt does not.\nAll right, thank you.\nI think this is the first time I've seen the lady in the well, I believe, isn't it?\nNo.\nNo.\nThat's not the first time I've seen it.\nJust checking.\nHerpes even washburn to your left is recognized for a question.\nWay to your left.\nThank you, Mr. Speaker.\nYes.\nWill the general lady yield for a question?\nI do.\nIs this your first time in the well to present a bill?\nIt is my first time to present a bill. Yes. Okay. Is it will you give for another question? I do.\nAre there any Mulberry bushes in the city of Mulberry?\nThere used to be.\nThank you.\nWe're going to take a couple more lady, couple of questions for the lady from Mulberry.\nAnd then we have a couple of folks that want to speak to the bill.\nWhat, no, let's see.\nChairman Stevens has recognized for a question.\nThank you, Mr. Speaker, way over to your left.\nIs I recall Barney Fife is from Mayberry?\nIs that not true?\nDoes he live in your town?\nHe used to.\nDoes he have a lady, thank you.\nThank you.\nThank you, he was all through the bill last year,\nbut lady, you for another question?\nfor one more, Mr. Speaker.\nRepresentative Martin to your right.\nForm a mayor of a small city.\nThis is going to be a big city.\nIt's recognized for a question.\nThe lady, you know, I do.\nIs it true?\nI appreciate the questions.\nAnd I'm kidding you a little bit about the name of the city.\nBut this is a serious question.\nIsn't it true what the ladies try to do\nis bring government closer to the people.\nAnd you can do this without an increase in their taxes.\nYes, it is.\nThank you.\nMr. Speaker, are you yield the well?\nLady proceeds like a veteran, because you are the well.\nGood move.\nSo we do have a couple of folks to speak in opposition.\nI'm going to give them seven minutes each to speak to the bill.\nUp to seven minutes, you don't have to take that long.\nPresident Jasmine Clark has recognized to speak to the bill, HB 647.\nGive the lady your attention, please.\nGood afternoon, colleagues.\nToday I rise in opposition to House Bill 647.\nAs the chair of the Gwinnett delegation, my concerns about this bill\nare based on procedure and precedence.\nLet's be clear, House Bill 647 is a hyper local bill\nthat annexes certain county properties\ninto the city of Mulberry.\nIf you remember, the city of Mulberry was created\nwhen the city hood process that normally takes\nabout two years was expedited through this chamber\nand took only 20 days in the last legislative session\nto the objection of the majority of the Gwyneth delegation.\nDuring debate, we stated that when you rush the process,\nit will lead to issues, and alas, here we are.\nLess than a year later, and we are seeing bills\nthat try to annex additional properties.\nAnd hey, I get it, annexations happen.\nBut in Gwinnett County, we have a very specific delegation\nprocess in order to maintain the integrity\nof the local legislative process.\nAnd we have successfully used that local process\nfor other annexations, including this year,\nwhere we are doing some annexation in the city of Lawrenceville.\nOur process is quite simple.\nThe city and the county go to the table and negotiate\nabout the properties to be annexed\nwhen negotiations are complete.\nThe city and the county notify the members\nof the delegation legislation is drafted\nby legislative council and then in a bipartisan manner,\na majority of our delegation members sign the bill.\nIt then goes through the local legislation process\nof the Intergovernmental Coordination Committee.\nThis process works, it has works,\nand it recognizes that while bills must come through\nthe legislature, we respect our local governments\nand will not force things down their throat.\nMoving this very local bill as a general bill\nthrough this body and an effort to skirt the rules\nthat both Republicans and Democrats signed on to.\nAnd let me be clear, I have placed article three\nof our delegation rules on everyone's desk\nfor you all to see in section three,\nwe specify how annexations are supposed to be done\nin Gwinnett County.\nWe had a majority of our delegation,\nincluding the sponsor of this bill, sign on to these rules.\nSo a vote for yes on this bill is a vote against local control and local government.\nIt basically states that you are okay with the state going behind your back, snatching\nup properties from your county without allowing you to even come to the table.\nI sincerely believe that most of us do not want that happening in our counties.\nLet's protect the integrity of the local delegation process, vote no on this bill, so\nthat we can actually do this process the proper way.\nAnd with that, Mr. Speaker, I yield the well.\nThe ladies, yield to the will, will part, represent Sam Park is recognized to speak to the bill, represent the park.\nThank you, Mr. Speaker.\nColleagues, I rise in opposition to House Bill 647.\nYou know, I think it's important, especially in the political environment,\nto remember the importance of the rule of law.\nWe are a nation, what's made us great as a nation is respecting the rule of law.\nAnd yet this bill demonstrates that might makes right,\nwhich is unfortunate.\nNow, I rise today to speak against House Bill 647\nfor the following reasons.\nAs public servants, our duty is to uphold\nthe interests of our constituents\nand ensure government serves them,\nnot the other way around.\nThis bill, which seeks to expand the corporate limits\nof the city of Mulberry,\nand there's two or three additional\nMulberry-related bills because the process was not followed,\nThe rules of government affairs committee was not followed with respect to creating the\ncity of Mulberry.\nThrough annexation, this raises serious concerns about property rights, taxation, and government\noverreach.\nFirst and foremost, we must protect private property rights.\nThis is one of the foundations of our democracy, which is the right to own and control property,\nAnd this bill proposes to Annex numerous parcels of land and we must ask, have all affected\nproperty owners been consulted?\nHas there been a local ad notice provided for this legislation?\nAre we respecting their right to choose how their land is governed and whether or not\nthey want to be forcibly annexed into this new city?\nThat's resulted in litigation and unnecessary fights that's divided and exacerbated\npartisan flames unnecessarily.\nThis bill represents an unnecessary expansion\nof government power.\nWe should be focused on reducing bureaucracy, not expanding it,\nnot forcing an additional layer of government\non people without their consent.\nWe cannot ignore the financial consequences\nof this annexation.\nWith expanded city limits come increased taxes, municipal fees,\nother hitting costs that will be passed on homeowners and small businesses, again without\ntheir consent.\nMany of our constituents are already struggling to keep up with the rising costs of living.\nWhy add to their burden?\nOur job is to fight for lowering costs and for responsible spending, not imposing unknown\nand uncertain financial hardships on working families.\nNow zoning and land use regulations are another major concern.\nWhen a city annexes property, it imposes new zoning restrictions and land use rules.\nWhat was once under Winnett County's governance will now be subject to different regulations,\npotentially limiting how property owners can use their land.\nAgain, these property owners having no opportunity to voice whether or not they want to be included or excluded in this city.\nThis is a state government forcing upon the people of Georgia a decision which they have\nno notice or opportunity to decide upon.\nThis bill also weakens county governance and local control.\nWhen that county has managed these areas effectively and there is no clear reason why city oversight\nwould be an improvement.\nWhen that county is one of the few counties, the second largest in the state of Georgia that\nhas a AAA bond rating.\nHere's the written documentation and again an opportunity for voters to determine their\nown future with their homes, with their own property.\nSo where does it end?\nIf we approve this annexation, we open the door for another and additional forced annexations,\nforced city expansions without the consent of the governed, more state government overreach\nand disruption for affected communities.\nNow, I'm a member of the minority party,\nand hopefully that won't be the case all the time.\nBut I want to ask members of the majority,\nwhat would you do if you were in the minority\nand the state government forcibly annex parts\nof your district that you represent?\nThat's what this is about.\nWe must consider the long-term consequences\nof setting this precedent.\nFinally, and I think most importantly,\nwe demand transparency and voter input.\nThe residents of these areas will not have an opportunity\nto vote on this change.\nDoes this legislation have a referendum?\nNo.\nThen this process fundamentally lacks democratic legitimacy.\nWe should not be making decisions that fundamentally alter the governance of a community without ensuring that the people have had their voices heard.\nAnd so again, colleagues, House Bill 647 is not just about adjusting city limits. It is about standing up for property rights.\nIt is about standing up for fiscal responsibility and the principles of limited government.\nIt's ensuring that we are a nation of rules and we demonstrate that as leaders with our\nactions, rather than perpetuating the falsity that might make right, the falsity that\nif you and the majority, you can do whatever you want because you have the votes.\nSo for all these reasons, I urge all members in this body to vote no to House Bill 647.\nLet's stand together in defense of common sense American principles and responsible governance.\nThank you, Mr. Speaker.\nI yield the well.\nThank you, Mr. Will.\nThe gentleman is yielded the well.\nIs there any objection to the previous question being ordered?\nHere he none, the previous question is ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in the other board, the committee has agreed to show this bill now passed all in favor of the pasture of the bill.\nWe'll vote yes, all those opposed.\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nAll members voted if so, Mr. Clerk, will you lock the machine?\nOne of the passes of House Bill 647, the A's, or 98, and the A's, or 76, is Bill having to see the records of constitutional majority as their four past.\nAll right, here's our posture of members.\nThis House is going to stand in recess until 3.30 p.m. today.\nThank y'all can.\nMr. Chairman, I'm going to recognize you.\nYou think you can get your work done by 315?\nThat would be better if you can.\nOkay, let's revise that plan.\nBest lead plans of mice and men.\nThis house will be back in action at 315-315.\nRules chairman is recognized for an announcement.\nrules chairman recloss for now so give the general your attention. Thank you miss\nspeaker I'd like to form the rules committee we're going to be having a\nrules committee meeting at three o'clock three o'clock see you in three forty\none thank you rules committee at three o'clock we're back here to go back to\nwork at three fifteen this house will stand in a recess until three fifteen\nYou\n",
  "updated_at": "2026-02-12T18:14:17.660718+00:00"
}