{
  "video_id": "6eoYABMwwDg",
  "url": "https://youtu.be/6eoYABMwwDg",
  "title": "Georgia House - Day 27 (2026-03-10)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 27,
  "video_date": "2026-03-10",
  "duration_minutes": 175,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-03-10:\n\n## Overview\nThe session focused on procedural matters related to the ongoing coronavirus pandemic, including suspending certain House activities and limiting access to the House floor. There was also a debate on House Bill 793, the state's budget bill, with members raising concerns about proposed cuts to healthcare and social services.\n\n## Key Actions\nNo bills were passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The House leadership announced new precautions related to the coronavirus, including suspending the Page program, invitation resolutions, and limiting access to the House floor.\n- There was a motion to remove House Bill 793 (the state budget) from the table, which passed.\n- Members debated the budget bill, with concerns raised about cuts to healthcare, social services, and public health programs.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nThe transcript does not provide specific attendance details, but notes that a quorum was present.\n\n## Adjournment\nThe session adjourned, with the next session scheduled for Thursday.",
  "transcript": "you you you you you you you you you you you you you you you you you okay we are about to go on to the rules calendar Before we do that, I wanted to make members of the House aware you will be getting a notice later this afternoon about some precautions that we are going to implement here in the House regarding the coronavirus. After adjournment today, the PAGE program will be suspended until further notice. Invitation resolutions will be suspended until further notice. We will continue to have a chaplain of the day, but the chaplain will not be given guest passes. Our intent and goal is to make sure that access to the floor of the House is limited only to authorized personnel. Members of the House authorize staff, the media as permitted by rule, and that's all. The gallery will continue to be open because this is the people's house and this is their government. But we are going to encourage during this time, do we get through this, that people who have an interest in following the proceedings of the House here in the chamber do so by watching video stream because I think that is safer. We are not being alarmist, but we are being cautious. And I don't think that we can be too cautious at this point in time with what we are dealing with. You will get a notice or reiterating all of these points this afternoon. As you know, we are out tomorrow. And we come in Thursday. We will be operating under these new conditions until we notify you otherwise. I have discussed that also with the majority leader and the minority leader and they both are aware of what we are doing. The chair recognizes the majority leader for what purpose does he rise? May I speak a rise and make a motion? State your motion. May I speak a move that House Bill 793 be removed from the table? The majority leader has moved that House Bill 793 be taken off the table. What purpose does the majority caucus whip rise? Thank you, Mr. Speaker. I would like to second the motion. The motion has been seconded. Clerk will read the caption. Council 793 by Rochden of the 7th and others to be in the act to make and provide appropriations for the state fiscal year beginning July 1st, 2020 and ending June 30th, 2021. On the gentleman's motion that House Bill 793 be removed from the table, is their objection? Is their objection? The chair here is none? He is off the table and is back on the calendar for consideration at this time. We are down to the point where we have a number of members who have signed up to speak. I have discussed the Rules Committee. First of all, has adopted a time limit of one hour to be allocated by the chair between those opposing and those favoring the measure and the chair is going to make an equal division of that. That will be 30 minutes to each side. We have, it looks like eight or nine. We have eight members of the minority party. I am sorry, seven members of the minority party and one member of the majority party have signed up to speak in opposition. They will be given an equal amount of time and while the first member is in the well, I will have the messenger calculate what eight goes into 30 because I don't know. It will be more than three minutes each but less than four, isn't that right? Okay. Miss messenger, your job is to be calculating. Your recognizes to speak to the bill, representative Rova Show. Okay. I'm told that the representative will step back just a little bit. I am advised that it will be three minutes, three and three quarters a minute for each member. Trying to be fair here. Lady May for seat. Thank you, Mr. Speaker. Everyone knows the sacred creed of healthcare professionals. First do no harm. I've lived by this creed by entire 37 years in healthcare. I've been improving care for everyone across the southeast United States. The budget before us does not live up to this high standard. The proposed cuts will harm our most vulnerable citizens across Georgia. These cuts will affect citizens of all ages, regardless of race, background or zip code. They will affect people living with addictive diseases, developmental disabilities and mental health issues. Cutting almost $11 million in personal services will reduce the number of home health aids, counselors, social workers, therapists, nurses and other providers that help those in need. Cutting monies for crisis stabilization units and crisis respite homes will adversely impact our vulnerable youth in need of suicide prevention help. When we cut over $34 million from behavioral health and developmental disability programs, we cannot say first do no harm. We are watching the spread of coronavirus across the United States now in 34 states including Georgia. Cutting over $3.8 million from county boards of health will affect our ability to contain this public health problem. My career was spent correcting problems created by a lack of funding and support for evidence-based medicine and the damage that can be done. All health care professionals know that harm can be done with inadequate resources are available and ready. Ready to perform testing, ready to treat those that are sick and ready to give medical advice to those who ask. In tight budget times, our job is not just to mitigate risk. We as Georgia legislators must now create and live up to our own sacred creed. First and always do no harm, especially to the most vulnerable among us. In the interest of time and respect for the other speakers, I yield the well, Mr. Speaker. He has yielded the well, Chair recognizes Representative McCloud to speak to the bill. Thank you, Speaker Austin, and big up to my colleagues. Let me start by saying that I appreciate all the hard work that has been done to produce this budget. But I'm taking this opportunity to once again speak out against this budget that does not represent the best interests of my district or the people of the state of Georgia. I want to clarify some misinformation that given people a return on their investment is given them free stuff. They're not getting free stuff. 75% of our $28 billion comes directly from the pockets of our taxpayers through income tax and sales tax. Our job is to make sure that money is used in the best interests of the taxpayers, also known as our bosses. We are being asked to make cuts to the budget because of poor decision made by the Trump administration to cut taxes to the very rich, causing a shift in our tax base, reducing our growth from 4.5% to 1%. This is unfair to the taxpayers. It blames them for poor decision making. We should not allow a budget that disguises itself as a necessary timing of the belt. When truthfully, it challenges the livelihood of many of our employers, the people. In this budget, we are providing a small, a small, pay increase of $1,000 to our educators. By reducing their pension, this budget, we demonstrate that health care is not just for the healthy because we are not expanding Medicaid or Medicare. All in need and we have no money in the budget for the coronavirus. In this budget, we allow private prison owners to line their pockets with a budget increase of $2.5 million while decreasing the funding in state-run facilities. The constant drum beat about gang violence is definite. I absolutely believe that where there is gang violence, we need to stop it. When I'm seeing is a base on this budget, is the drum beat is not about solving the problem but rather increasing the prison population. All that gained by Governor Deel is being erased. At a time when the United States leads in prison population, but accounts for less than 5% of the world's population. How are we supposed to face our constituents and tell them that this is the best we can do to give them a return on their investment? This is an unacceptable budget for the people of this great state. Our budget should reflect the values on education, health care and our fundamental rights. This budget should benefit the people who we serve, our employers, the people of the great state of Georgia. Thank you. I yield the well. Chair recognizes Representative Derek Jackson to speak to the bill. Thank you, Mr. Speaker. There are approximately 18 million military veterans in the United States. 4.2 million are over the age of 75. Over 485,000 served during World War II. But let's bring this down to Georgia. We have over 800,000 military veterans and largely they are over the age of 55 and their families called Georgia home. So I want to call your attention to the budget on page 110, specifically 48.3.4, 48.3.5, and 48.4.4. This does not reflect taking care of our military veterans. When you start to reduce field service office positions, see because when military veterans retire or transition from the military, their first recommendation is to go to a field service office. So they can understand the transition from military back into civilian life. Now I understand that the budget is very complicated. I do. I also understand that the budget is a all or nothing vote. But much like our men and women who are on the front line protecting and preserving our democracy, some of them pay the ultimate sacrifice. And their family is also sacrificing. It's also all or nothing for them. I also understand that the budget could be very complicated, especially when the process changes. But also democracy is very complicated. And when we all give the opportunity to participate in the process. See there are 2.2 million active duty service men and women right now. Serving in armed forces, you will not see them come up here and sit in the gallery or call you to the ropes. You will not see a military member to complain. They execute their mission that's given even to a commander in chief that they may or may not respect. But in the end, when they come home, they are expecting for us to do the right thing. So the question is, does this budget have our military members on your mind? We are the number one state to do business. The question is, can we also have the goal to do the number one state for military veterans? In the interest of time and respect, Mr. Speaker, I yield the well. Chair recognizes representative Dreyer to speak to the bill. Thank you, Mr. Speaker. I want to begin by acknowledging the progress and the good work, Chairman England and the staff. They have taken a terrible budget, made it a little bit better. One thing I want to flag are the accountability courts. We had cut substantially accountability courts from the governor's budget. This restores them. If you look in the state budget highlights that was on all of our deaths this morning, there is a stat in there. Says for every dollar invested in accountability courts, we save $7.74 as a state. Why is that? We are saving money on incarcerating individuals by giving them the mental health care services and the second chance to improve. Again, the staff of the budget office has done an incredible job, but we have made a policy decision in this budget that we would rather cut taxes than adequately serve many of our Georgia residents. I also got an email this morning from a constituent whose family is affected by autism and they are hanging on by a thread. They have two jobs, a child with autism and they are not making it through the week. We all know family suffering from mental health issues, including substance abuse issues. I toured a jail with some of my colleagues the other day right down the street. They are 20% over capacity. People are sleeping on the floor in the jail. There is over 20% of the people there need to be in a state mental hospital, but there are no beds. That is our policy decision to not adequately fund that. Foster children need help. We are making cuts to our most vulnerable people in society. We are leaving behind families with intellectual disabilities, developmental disabilities, mental health issues, people in jail and foster kids. We are cutting $3.39 million from adult addicted disease services, $11 million for child treatment, adolescent mental health services, $3.8 million to county boards of health, which people depend on. 21.1 million to the Department of Human Services, as my colleague flagged $1.58 million to veteran services. We are cutting $3.5 million from reentry programs which will keep people from going back to jail and costing us money. We are cutting $1.45 million for child support services and $3.800 million for child welfare services by cutting 127 positions. What happens when we don't fund these programs? There is a judge down the street that says half the people that are incarcerated now, if they had adequate mental health services would be on the streets and they would be paying taxes and working. Just like the figure, if we invest $1.00 in accountability courts, we save $7.74 down the road. We can make investment in vulnerable populations, save money down the road, which is the fiscally responsible thing to do, but morally, it's definitely the right thing to do. So today I stand with children and families in foster care. I stand with families that have a member that is intellectually disabled or has a developmental disability. I stand with the person sleeping on the floor of a jail sale and I stand with our veterans. And I am going to stand with them by voting no and I ask you to do the same thing. Thank you, Mr. Speaker. Her recognizes the vast chair of the minority caucus representative Thomas. Thank you, Mr. Speaker. I want to talk about being number one. Everybody wants to be number one. The number one state to do business. We love that. We want to be number one. But no one wants to be number one for maternal mortality. And that is what we are. Right now in this budget, I want to say that I'm happy that we are extending Medicaid to six months from others, but it's not enough. My daughter is now seven months old. And I know that I need coverage right now and I deserve coverage. I have health insurance, but there are so many mothers just like me that don't have it and deserve it. And we talk about numbers and how we can't afford to give more. We don't have it in the budget, but we do. Right now if you look at your budget in line 17.8.1, we're reducing the funds in Medicaid for growth based projects. $21 million. We're taking from Medicaid to give to Medicaid. We're giving 19 million. I want to tell you how important it is that we give mothers their coverage. Postpartum is real and it doesn't end as six months. These women are suffering from depression, addictions, and they don't have the coverage. So what happens when a woman is suffering from depression and addiction and she can't get the treatment and she looks to opioids and she looks to drugs and she can't get the treatment that she deserves? What happens to the children that lie in the gap? I'll tell you what happens to them. They go into our foster care system. And yes, we talk about doing a lot for foster care this year. But what about stripping and reducing funds? 127 positions. What about stripping those funds?\n\nthat you have the budget that you have in the budget before you. 127 vacant positions we say from case workers, case workers that have more than 30 children on their case load. So when you think about taking money from our case workers, you think about taking money from our children because these are the case workers that are in front of our children every single day. They get calls in the middle of the night, sometimes 1 o'clock in the morning, 2 o'clock in the morning to come rescue a child from a neglectful home. But we want to reduce the money. These case workers are coming to rescue our kids. But they can't even afford to pay for sitters to babysit their own children. And we can reduce that money, I think not. I want to tell you that it is so important that we do two things today. And you remember the mothers that are dying. And the mothers that are not just dying that are suffering from maternal morbidity, which are severe cases that can lead to death even after 12 months. Think about them and also think about our foster kids and reducing the money for our case workers that deal with our most vulnerable every single day. I yield the will. Chair recognizes the minority caucus whip, representative Bowdie to speak to the bill. Thank you, Mr. Speaker. They are wise not to speak about a budget cut in the FYI 2021 budget with a budget addition. Line item 19.70 page 43 in your budget book and page 35 in your tracking book. Line 19, seven appropriates and increases funds and amount of $2.5 million in private prisons. This line item really concerns me. It concerns me because we don't know exactly what the $2.5 million is being used for. And this is taxpayer's money. It is taxpayer's money being used for operational costs for the private prisons. Is the taxpayer money being used for administrative costs for the private prisons? Or is it being used for health care services for inmates in those private prisons? Or is it caused associated overcrouting in private prisons? Well I guess from this budget line description we just don't know. However I may have an idea. Back in January during the appropriations week during a joint House of Senate appropriations hearing that very question was asked about that line item. What is the $2.5 million going towards? The response was that the $2.5 million is going to be used to pay for additional correctional officers at private prisons. I must be honest I was completely shocked. This response baffled me because obviously there's a contract somewhere between the state of Georgia and these private prison corporations. To house, to fee and supply medical services for these inmates. Without reading the actual contract I'm sure these are some of the terms that I laid out in that contract. So I find it very troubling that the state of Georgia is using $2.5 million to pay for additional correctional officers employed at private prisons and Georgia. So if you're looking for additional correctional officers, just think about that for a second. That's like hiring a roofing company and paying that roofing company to put a roof on your house and then once you pay the roofing company you then have to go back and pay each and every worker that asks to put the shieldies on your house and on that roof of that house. But yeah that's like paying a general contract to debil your house and then paying each and every individual subcontractor for the individual services of building that house. So I ask you why do Georgia taxpayers have to pay for services of these additional correctional officers at the private prisons? When they, the private prisons should be paying the corporation, paying the correction officers themselves. So my question is what is the private prisons doing with the money that they're supposed to be paying for these additional correctional officers? This budget line item just does not make sense to me. With the National Training Criminal Justice Reform, we are seeing more states move away from contracting with private prisons. The other south, I say that we are better than the 2.5 million dollars being appropriated to private prisons. With 3.8 million dollars in cuts for county boards of health that operate defect hospitals in rural Georgia, we could do a lot better with keeping these hospitals open. So I would be voting no to this budget and no to the private prisons. Mr. Speaker, I yield the well. You have a question if you care to yield. Mr. Speaker, in an essence of time, I will be yielding the well without taking any questions. The gentleman is yielded the well. Chair recognizes to speak to the bill representative Gertler. Thank you. Thank you. I rise today in opposition to House Bill 793. By now, most of you know that I most assuredly vote no when I see something that is not the proper role of government. And while there are many things in this budget that fall in line with protecting life, liberty, and property, there are as usual many things that hurt our state and go against conservative values and principles. Conservative values and principles that I hold dear and are the backbone of this nation. Climate time again, the case against subsidies and corporate welfare has been made and shown to hurt the free market we profess to support. And yet the Department of Economic Development is getting over 30 million to medal in the private sector and 70 million in bonds to compete directly against the private sector. Also the Department of the Community Affairs is getting another 18 million to expand the welfare state and dole out federal so-called free money. It's not free. It's a debt and a tax on future generations that directly puts my daughter's future at risk. Of course, you cannot forget the one Georgia authority who has been getting over 20 million dollars of taxpayer money to their slush fund run by politicians and unelected bureaucrats with no real oversight or accountability. Particularly it grids to me as a representative of a rural district, the people who elected me are being asked to pay for and subsidize the Atlanta Transit Link Authority. And the Georgia Regional Authority to the tune of over 18 million. I challenge you to justify why hardworking people and retirees from the beautiful mountains of North Georgia are being forced to pay for Atlanta transportation needs or why we are subsidizing transportation for that matter when the free market does it so much better. We also have hundreds of millions of dollars being collected from the largest tax increase in Georgia history, the HB-170 and the Hotel Motel Tax, which was rejected by the people that ballot box and forced upon them by this chamber. Finally, as I alluded to, the debt is not conservative. As Benjamin Franklin said, when you run in debt, you give to another power over your liberty. I understand bureaucrats and politicians are good at twisting the truth, but you won't convince me that it is responsible and good for Georgians or caring toward children and our grandchildren to settle them with over a billion dollars in debt every single year, not to mention the unfunded liabilities. Having said all that, I very much empathize with my colleagues and their frustration with the budgeting process. I understand trying to find a way to navigate this process is difficult, and that you are trying to uphold the things you are elected to do. However, this budgeting process is broken. We look at DC with the stain yet we employ the same budgeting process they to do. An omnistile budget bill that is jammed through and rushed down through our throats, the good, the bad and the ugly. That is why I think it is so important to split the budget up and separately, so we can vote on individual merits of each appropriation like I have proposed in House Bill 4 to last two years. Other states do this? Why can't we not do this? Other businesses do this, why can't we do this? Families do this, why can't we do this? I will not let the establishment force me and my constituents to vote for something that we think is ill advised and certainly not let them force us to vote for something that I think and we think that is morally wrong. Georgians deserve better, the free market is better and this solution is simple. A fair open process for the budget is voted on separately based on its own merits. I don't want to need to repeat myself. My point has been consistent for four years. I urge you to vote no, and I urge you to support House Bill 4. Thank you and I'll yield the well. You have a question if you care to yield. Any answers to time? I'll yield the well. Gentlemen has fled the well. Chair recognizes the minority leader of the House leader tremble to speak to the bill. Thank you, Mr. Speaker. And I'm going to use my three minutes to talk about 600,000 Georgians that aren't represented in this budget. Those are 600,000 Georgians that we could cover as a state under the Affordable Care Act if we took the step to expand Medicaid. 36 states have done it and we have yet another budget upon which we are about to vote in which we are opting not to do it. And I understand the budgeting process is a reflection of priorities. But when you look at what we are doing today in the General Assembly, we're going to vote on a budget and then we're going to vote on a tax cut changing the personal income tax rate to a flat tax rate, that's going to be a communication of our priorities. And what it's going to say is that we care more about passing along a tax breaks to Georgians who make over $108,000, then we do about covering 600,000 Georgians that we could cover if we expanded Medicaid. You know, it's easy to talk about the benefits of expanding Medicaid in a lot of different context. But you know from a public health standpoint, we are more vulnerable in Georgia than states that have expanded Medicaid to pandemics. And in this budget upon which we are about to vote, if you look at line 17.8.9, you find that we take a $20 million step toward partial Medicaid expansion. And if you compare that to what it would cost in year one, based on the fiscal note for Medicaid expansion, $139.4 million in state funds to $147 million in year one. We're already taking a step, $20 million in that direction. We're moving hundreds of millions of dollars in the budget on our desk. And year after year, the defense to not doing Medicaid expansion is it's too expensive. Where are you going to find the money? Well the money is moving all around the spreadsheet. So let's just be honest, when we pass upon this budget, what we're doing is we are passing up the chance to expand Medicaid expansion. You know when the supplemental budget was on the floor, I said the roof was leaking. And I've looked through this budget and there's some euphemisms that you have to get passed like reducing funds for personal services. And what that really means is eliminating positions. Let me tell you something, it's not just the roof that's leaking. The foundation is shaky. And this budget, we are paying a tab from a tax cut we did in 2018. And I know we have another measure that we'll debate. But the structural imbalances and deficits that we build in here. This was a hard process. The appropriations committee had a hard job. Let's not make it harder in subsequent years. Mr. Speaker, I'll be voting no. And I urge those who care about the foundation because revenues are the foundation upon which this budget is built. To think about what we're doing today, Mr. Speaker, I yield the well. You had a question if you cared to you. One has yielded the well. That completes all of those who wish to speak in opposition to the bill. We have one member that wishes to speak in favor of the bill. And the chair is going to allocate the same amount of time to that member as to the others. Three minutes and 45 seconds. Chair recognizes Chairman David Knight to speak to the bill. Thank you, Mr. Speaker. You know, Georgia has been a place for years, for decades, in which this budget and the physical sadness of Georgia has been a priority. And it still is. And the chairman England and the rest of my fellow appropriation subcommittee chairs, I'm appalled at what I heard today. I am sick and by the politics of what you've done. We came in here with reduced revenues faced with cuts. We rolled up our sleeve and we went to work to try to figure out how to allocate the resources that we had back to Georgia. And if I remember, we took a week off and every one of you in this house was extended an invitation to come to the budget hearings and to show up at any and all subcommittee appropriation hearings. How many of you that got up here in the well got up and it took the time to come up here and to provide input. Well, maybe one of you did. But then you have the audacity to get up here and do this. Georgia's a balanced budget state. We take our jobs and our responsibilities seriously. And to come up here and then demagogue in an election year about how Georgia's house is falling or the foundation is crumbling. Historically if you look at it, people are flooding into this state because of the physical responsibility that this legislature under this chairman and its subcommittee members have had for well over 15 years. So your rhetoric does not line up. And as far as the health care issue, I've heard all of it. You got up here and you talked about how there's no more beds or we're going to have people out. Well, why don't you look at the mental health? Why don't you look at the fact that we added in into the crisis units new core services fundings that will allow the department to serve another 6,800 individuals in this year. Did you see that? What about the resident capacities for the addiction? We increased the bed counts statewide. What a cut. But yet you'll get up here in front of the media and you'll sit there and say you've got a cut. We added about $5.6 million for another additional slides for the new waiver program. You know what I've learned about the general assembly is the fact that we're citizen legislators. What's more, I love about the fact that the people who come here and they do it for the right reasons. And they go home and they've done it in a way that clear conscience and they don't play politics about it. It's a serious job. I'm from England and to my fellow members and to the budget staff. You did one of the best jobs I have ever seen since I've been up here in 05. And I want to congratulate you for the hard work that you've done in the face of the cuts. Chairman Andy Welch, what you've done. And for people to get in here and get demagogued about this, this just infuriates me. That's what people hate about politics. Mr. Speaker, I'm on what else you can say. I yielded well. Gentlemen has yielded the well. That is all of the speakers who had signed up. Is there any objection to the previous question being ordered on House Bill 793? The chair here's none. The previous question is ordered. What purpose does Chairman Cooper rise? Thank you, Mr. Speaker. I have a poem. I'm asking you why. Does this budget not include almost $20 million to expand the number of months from 2 to 6 for mothers who have Medicaid mothers who have delivered babies in our state? The lady is absolutely correct. I stood with her this week when we announced that initiative. Further power among two inquiries, sir. And does research and all not indicate that most maternal mortalities and near misses occur during the time or right before delivery and that those that do not occur at that time or right after delivery occur the largest majority almost all of them within those six months time period. I know the lady knows of which she speaks. Thank you, Mr. Speaker. Further Parliamentary inquiry. State your inquiry. Is this not a major step in taking care of our Medicaid mothers in preventing maternal maternal mortalities and in general increasing the health of mothers and Medicaid mothers and babies in our state? Well, the lady has made a very compelling case, but that addresses itself to the judgment of each and every member for what purpose does Chairman Dimpsy rise? Inquiry, Mr. Speaker. Inquiry. Is it not true that it was stated earlier that we had a hard job that things since seemed to move all around the spreadsheet. And when I first saw this budget, I actually didn't think we'd have anything to move that we were stuck with a budget full of cuts. I'm sure the lady believes that to be true because that was that's the way it looked at that time. It did. Mr. Speaker, further Parliamentary inquiry. State your inquiry. Foster heard people here talk about mental health and addiction and development disabilities and veterans and foster care and caseworkers. And those are particularly each and every part of that budget that I work on and that the subcommittee on human relations does. And we spent six hours hearing just on this budget alone, not the amended, but on this budget from people, real people who were facing the realities of that. And our hearts melted. And therefore, we did find ways to move things around on spreadsheets and put them in to direct services to change these most vulnerable Jordan's life. I believe that to be true and I also believe the lady to be one of the preeminent authorities in this state on the mental health issue. Thank you, Mr. Speaker. And one more final thing. The challenge is to be a part of the parliamentary inquiry. Yes, it is a parliamentary inquiry. State your inquiry. Yes, yes, sir. So to vote against this budget today is to vote to not help some because we are not able at this moment in time to help all. Therefore, I will stand and I will vote proudly to help some. What purpose does Chairman Lynn Smith rise? State your inquiry. Is it not true that the House and this budget has put funds in the Environmental Protection Division to work together with the comrades across the House to ensure the public safety of our citizens by funding two engineers and third party testing? Is that not true? That is correct. What purpose does Chairman Dickie rise? Parliamentary inquiry. State your inquiry. Is it not true, Mr. Speaker, that this budget does not cut teacher retirement. In fact, in a couple with the $1,000 increase in teacher pay, it absolutely increases future teacher retirement. So is that not true? That was for the Parliamentary inquiry. Does this budget not increase the number of school counselors for those children? And for the Parliamentary inquiry. State your inquiry. Does this budget not increase our reach scholarship program that is the state's only needs-based scholarship program that we have that is in 140 counties? It does and the gentleman shares the chair's passion for that program. Thank you, Mr. Speaker. What purpose does Representative Perkel rise? Inquiry. State your inquiry. Is it not true that this budget contains $10 million for DCH's rural hospital stabilization program that helps hospitals that have between one and four days cash on hand? If the gentleman so states, I know he is the vice chairman of the committee, knows where off he speaks. One further part of the inquiry, Mr. Speaker. State your inquiry. It also includes $500,000 for FQHCs that are the lifeblood in some communities that do not have hospitals and do not have doctors. They also include $11 million for crisis beds and $6 million for 100 additional slots for now and comp waivers. Is that not true? That is correct. Thank you. What purpose does Chairman Andy Welch arise? Parliamentary inquiry. State your inquiry. Is it not true that the contract for private prisons are available and fully vetted by the members of our subcommittee? In those contracts for private prisons, one would read them and inquire about them. One would also know that there are per-dem allocations within those contracts that have not been met for the last five years. Furthermore, the per-dem allocations go to fund and help assist with the employment and compensation for CEOs who are citizens of the state of Georgia and are employed to benefit the citizens of the state of Georgia. I know the gentleman knows where off he speaks because I don't know anyone who has drilled down in that issue to the extent that the chairman has. What purpose does Chairman McCall rise? Parliamentary inquiry. State your inquiry. Is it not true that I am just a dumb country boy and I have to have things. When I hear somebody describe themselves that way, I start reaching for my wallet. I have to have things in a simple, suffice plan to tell her mine or any of you. If we take a notion to vote no on this budget, it is not true that we are voting against every school teacher, public education system. The guys with the blue uniforms outside that take care of us. That is as simple as I can put it. If you want to go home and tell folks you are voting against your school system and your school teachers and the troopers and every other state employee from food safety all the way down to the simplest health department in rural Georgia, then vote no. Not to mention millions of Georgians that have lots of needs. All right, we are going to do one more parliamentary inquiry and then we are going to put it on the board. What purpose does Chairman Petrie rise? Parliamentary inquiry. Mr. Speaker, is it not true that this budget contains an additional 225 waivers for developmentally disabled adults in this state who need to be in the community and avoid institutional placement? Is that not true? I think that is correct. And is it not also true that not only does this budget include increases for all state employees, but especially for surveyors of sensitive facilities that deal with the age, the blind that is able to developmentally disabled? Is that not true, Mr. Speaker? I believe that to be true also. Okay, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted?\n\nhave all members voted. If so, the clerk will lock the machines on the passage of House Bill 793. The eyes are 134. The nays are 35. This house has passed. This version of the 2021 Fiscal Year Budget. The chair wants to add its own thanks to the absolutely amazing work that has been done by Chairman England, by every single one of his appropriation committee chairs, and by the greatest budget staff any state is blessed to have in this country. Okay, we have a supplemental calendar. We're going to kind of go back and forth a little bit. Chair, what purpose does Chairman England rise to make a motion, Mr. Stature motion, move to immediately transmit the committee sub the House Bill 793 to the Senate. Chairman England has moved that House Bill 793 be immediately transmitted to the State Senate. Is there objection? Is there objection? The chair here is done and it is on its way across the hall. The clerk will read the caption to House Bill 1114. House Bill 1114, our representative Cooper, the 43rd and others to be entitled to enact two men, Article 7 and Chapter 4, Title 49, if you go to Georgia and Tady relating to medical assistance generally, so as to provide for Medicaid coverage for lactation care and services. Is Bill ever referred to the committee on Health and Human Services? That committee recommends that this bill do pass. We're still on the rules calendar, so I know y'all are entitled to a victory lap. You might want to go out in the hall and have that though. We've got to move on. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House Bill 1114 is the bill that instructs the Department of DCH to produce two Medicaid waivers. Those are 1115 waivers to be sent to our National Medicaid Office in order for us and for their approval to be able to spend almost $20 million that we have put in the budget for an expansion of the time that we take care of new mothers after they deliver. It also includes more money for lactation specialists to help mothers that are trying to breastfeed and have true problems with it. So I would ask for your favourable consideration of this bill, House Bill 1114. If there's no questions, Mr. Speaker, I yield the well. You have a couple of questions. Do you yield? I'll yield for one or two, sir. Chair recognizes Chairman Lynn Smith to your right for a question. Thank you, Mr. Speaker. And is it not true that I wish to take this opportunity to thank Chairman Cooper for her phenomenal leadership in the House on all our health care issues? Thank you. Thank you. You are kind. Thank you very much for that. I'll take one more, Mr. Speaker. Chair recognizes Representative Huggley to your left for a question. Thank you, Mr. Speaker. Does the gentle lady yield? I will, Mr. Speaker. Thank you so much for this particular piece of legislation. I just wish that we had an opportunity to show the full bipartisan support of this particular piece from its inception. But thank you so much for the bill. Thank you very much, Representative Gilley. Mr. Speaker, I yield the well. Lady has yielded the well. Is there any, I'm sorry, we have one other member that wanted to be heard on the bill. Chair recognizes Representative Aval Mabel Thomas to speak to the bill. Thank you, Mr. Speaker. I rise today in support of House Bill 1114. And it's been a long time coming, but it's a moment in time that we cannot acknowledge. I do want to thank the members of the Public Health Suffolk Committee, specifically. I want to thank Representative Bush, which parents who have in the last, at least four years that we've been talking about it and moving things forward. Also, obviously, I want to thank Representative Carolyn Hugley, because she was sort of like our point person, kind of connected. Women's caucus, the black caucus, and all of the folks that were committed to it. It's been a lot of work done in this area, and many of you have helped us along the way. I could not not speak in favor of the bill, because it's a lot of things. In other words, don't steal my title, but there's a lot of times that says something called the backstory. There's a lot of backstory on this particular legislation. And you have to do what you have to do, because you know something is so important. So when I came back in 2012, and I heard that that black women was dying three to four times more than any other race, I knew that it was, it was an epidemic. I mean, it seemed like an epidemic in my mind. And so immediately when I came back into the journal, so I've been here three separate times, and I must admit, one time I was in the Democratic Caucus meeting, and I was listening to see what the freshmen needs to do. And he said, people said to me, oh, you already know you've been around. I said, well, you know, maybe some new stuff I better check it out. And then L Williams said, yes, she's been here three separate times. I hope she gets to write this down. So I think I got to write this down. Thank you, L, for that. But I just want to thank our Renita Shannon, who had House Bill 693, which was a bill that, as of, that she allowed me to sign on as the second signature that basically talked about postpartum care being going from, from two months to a year. And so she was a pioneer in sports, putting that legislation out. A lot of people in the room have galvanized around her and with her to keep pushing. And then there was a study committee that, Dashaan Kendris was asked by me, who I was asked by Karen Bennett to go ahead and put a study committee and to deal with this issue. And that was not a hearing given. But when I found out from Park, Canada, that there was House Reserves of 589, I went to the hearing. And I was allowed to be able to speak at that hearing. It was five members of the committee and I asked as a member that I'd be allowed to add to the bill, make it seven members. And there'd be two African-American women legislators in the committee on it that. And the committee came together in the recommendations that they came back with. Coralettes with two additional study committees, one deal with infants and toddlers. And they think it was the mortality data review committee as well. That was all, these three study committees this summer that asked that we move from. Two months to a year. Okay. So we didn't right now, as a right now because all things are possible. But as a right now, we have moved the ball down the court. We're at the 50-yard line because we're at six months and we need a year. So I think that we have a good team of people here. And I think that the team here can move us to the touchdown and move us to where we need to go so that black women don't die at childbirth at this level. But I would also have to think the members of that committee, I would have to thank Sharon Cooper for her leadership. I would have to thank Deborah's silo, silcox and darling Taylor and Valencia Stovall and Mark. Dr. Newton, I would have to think who else I miss on that committee? Oh, yells, representing Chuck's station. I like that name. So I want to thank all the people, those people, I know. Don Hogan, he's a man. But all I'm saying now is, it was a lot of people I even went to the Democratic Caucus. And for a while, the Democratic Caucus was shaking it to me too. And I was like, stop shaking y'all here. We got to get something done on this bill. So we are here today. We got something done on the bill. I think that all of you made your contribution. I can't call everybody a name, but I know one time I did come up and thank people. And when I got back sit down, they say you name everybody. That's why you didn't thank me. So for all those I did not think, it was not because I didn't want to thank you. It's I don't want to go too deep in thanking you. And people be mad at me for didn't thank. Because I know Wes Carroll that sits back there with me. He want me to thank him for something. So anyway, I just want to thank this body for moving this ball down the court. And moving it down the football field and moving it down the court. And we got six months and we hope he, and if the Senate wants to put it in to a year, don't be mad at him. And when they sent it back for us to agree, we wanted them to agree, us to agree to what the Senate put in if they can take it to a year. So I'm not giving up on a year, but I am thankful for six months. And it will make an impact in the state of Georgia for women. Thank you and I yield the will. See. You had a question if you care to yield. There's a grounds well of support. I'll take I yield. Mr. Speaker. You yield the well. No, I yield to that question that they got one from it. Well now you've gotten three or four. Oh, okay. I'm not going to take more than five, because that's the number of grace. Chair recognizes representative Bennett to your left for a question. Thank you, Mr. Speaker. Will the gentle lady yield? Yes. Is it not true that because of all the passion, compassion and the hard work of the able-mable Thomas, that we were able to make this situ-issue of maternal mortality rise to be first and foremost in all of our genders? I'm sure the gentle lady knows when will she speak. Thank you. Do you further yield? Yes, sir. Yes, I do. I'm just going to take that back now if you stay up there. Chair recognizes representative Bentley to your left for a question. Thank you, Mr. Speaker. That's the gentle lady yield. Yes, I do. Is it not true that this rule Georgia legislator have been fond of you for many, many years when I first met you with representative Tyrone Brooks down in Savannah, Georgia? Yes. Is it not further true that this bill will not impact the future industry at all? And actually it will. We wanted to stop. We want to slow the future up on this one. I'm going to slow the future up on this one. Here we go now. Okay, I yield the wheel, Mr. Speaker. I never had that much fun in the well. No one else had signed up to speak. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of House Bill 1114? Will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1114. The eyes are 162. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1094. House Bill 1094 by motion of gains of the 117th and others to be entitled and act to amend Article 1 of Chapter 20 of Title 45, the fiscal of Georgia and Tate related to the general provisions regarding personnel administration. The committee is also required to provide for paid parental leave for state employees. This bill has referred to the committee on health and human services. The committee recommends that this bill do pass by rules committee substitute. Chair recognizes representative gains to present the bill. Today I bring House Bill 1094 to build on the good work the general assembly did last year by ensuring its employees have access to paid parental leave. Today's legislation ensures that every state employee has access to three weeks of paid parental leave. This would apply to approximately 246,000 state workers in Georgia including 132,000 teachers and educators, 48,000 employees of the university system of Georgia and 60,000 other state employees. Any financial impact will be realized when they separate or retire and should be negligible. We must remain competitive with the private sector and keep our best and brightest employees. Other states are beginning to offer this benefit and President Trump and Ivanka Trump have led at the federal level by offering paid parental leave for all federal employees. I'm especially proud to be carrying this legislation today because of my hometown Athens. With the University of Georgia local school systems and thousands of other state employees this legislation is going to directly impact the lives of so many families in my district and across this state. Mr. Speaker I'm certainly happy to answer a question or two authority. You have a couple of questions if you care to yield. Oh, you'll chair recognizes representative Perkall to your right for a question. You have a question? No sir. He waves. Chair recognizes chairman Setsler to your right for a question. Thank you. Is Jim and you? I do. Appreciate your bringing this. In my district there's a lot of families that need two incomes to be able to make the household work. This applies not just to the mom but also the mom and the dad. So both mom and dad could get this if both need to stay home from maternity and for purposes for these three weeks. If there are both state employees that would be correct. Okay. Jim and further yield. I do. I ask this because there's a lot of folks as judges are growing state a lot of people are moving from other states and moving here. And they will have perhaps their parents or extended family networks to help care for moms who are newly delivered. So isn't it true this bill allows people without a large familiar support network within the household a mom and a dad to both be able to take care of those needs in a very sensitive setting. That's right. And this bill also does apply to foster care and adoption as well. I was going to ask that question. I appreciate your bringing the bill. Thank you. Thank you. Do you further yield? I'll yield for one more. Chair recognizes chairman Newton to your right for a question. Thank you, Mr. Speaker. I do. I think you just touched on that at the very end. I think something this body is cared a lot about is adoption and foster care. Do you say that this paternity leave or maternal leave applies to that as well? It does. That's correct. The legislation applies. The qualifying event would be a birth of a child foster, a placement of foster child or adoption. Thank you so much for this. I think that is something this body has been committed for for several years. This is just one more piece of advancing that culture of life. Thank you. Thank you, Mr. Chairman. Mr. Speaker, I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute offered by the committee own rules? The chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 1094 will vote I? Those opposed will vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1094. The eyes are 164. The nays are one. This bill, having received the requisite constitutional majority, is therefore passed. The bill is agreed to. The clerk will read the caption to House Bill 949. House Bill 949. My reps of 9 to the 130th to be entitled to men, title 40, 80, the fiscal to Georgia, and Tate relating to revenue and taxation. The chair here is the chairman. The chairman says to find the terms in turn of revenue code in turn of revenue code in 1986. Is bill 11 for the committee on ways and means? I recommend this bill do pass. The chair recognizes chairman Harold to speak to the bill. The bill is the one. You should all have a fiscal note attached to the bill and your binder. What this bill does is a few very special and specific things. First and foremost, we keep our promise to the citizens of this state. The promise we made two years ago on passage with House Bill 918. The bill is 275% to a flat 5.375%. That rate is the personal rate that also includes the past through rate for small businesses. That's S corporations, LLCs, partnerships, and sole proprietorships. The bill keeps the corporate tax rate at the current 5.75%. The bill is the first to compensate for the flattening of the brackets. There is a implementation of a new Georgia income tax credit so that there is no one is harmed by the flattening of the tax bracket. And of course, all taxpayers will ultimately benefit by the lower rate. The bill also includes the foster care adoption tax credit that triples the adoption tax credit for foster care from $2,000 to $6,000. The bill is $2,000 each year to the child as age 18. And it also includes the annual internal revenue code update that allows taxpayers in Georgia to take advantage of a number of federal codes that have been changed since we met last year. Some of those changes include the ability to itemize and deduct 7.5% of medical expenses that had previously been raised up to 10% of income as well as expansion of your budget. And it also includes the expansion of your ability with regard to individual retirement accounts again responding to the federal tax legislation. If you will look at your fiscal note, if you have that before you, on the implementation dates for this bill, there are three different implementation dates. With regard to adoption of the internal revenue code update and complying with federal tax law, the implementation date there will allow taxpayers to amend back to their 2018 tax returns. So if they have a benefit to be gained, they can file an amended return back to 2018. With regard to the foster care adoption tax credit, a proposal supported and offered by the governor, that proposal becomes effective January 1 of our current calendar year 2020. So families that adopt children this year in 2020 will be able to take advantage of that. And then the remainder of the bill, the income tax rate reduction, the flattening of the brackets, the closing of the loophole with regard to deducting state income taxes, those provisions become effective January 1, 2021. So if you look at your fiscal note, the fiscal impact for 2021, that first line federal conformity, that is the internal revenue code update. So the numbers are already planned for each year and included in the budget projections. So the balance of the cost and fiscal year 2021 of this bill is approximately $98 million in revenue reduction. Now I will bring to your attention that there are a number of issues that we have in process and pass this year that will more than compensate for that revenue reduction. As you will recall in the first week of our session we passed the marketplace facilitator bill that is estimated to raise approximately $80 million per year. That bill becomes effective April 1st. That revenue is not included in the projections. That's $80 million per year. There is a bill that will come before you before crossover dealing with our lodging facilitators. That is not included in the revenue projections. That's an additional $15 million. And the State Department of Revenue has recently issued three RFPs for pilot programs that are looking at collecting under reported and fraudulent reported sales tax. And we have estimates of between $100 and $400 million on revenue that will be realized from that program. None of these revenueraisers are included in the current budget projections. Therefore our decision to postpone implementation until fiscal year 2021 allows us additional time to verify those revenue projections and further mitigate the loss of revenue by virtue of reducing our taxation. You'll notice as we go out the years 24 and 25 the ultimate value to the Georgia citizens receiving this tax reduction is on average $250 million per year, a quarter of a billion dollar in tax savings and tax cut. Again, I believe it's important that number one we keep our promises. We've just heard the debate on the budget and the things that I am proud that this house is done to restore fund.\n\nfor critical programs and critical needs. We are not putting any of those services, any of the core services at government at risk, the very people that are generating income and paying taxes to the state to pay for those wonderful programs and benefits that all our citizens benefit from. They also deserve to benefit from our work here today and House Bill, the substitute to House Bill 949, is a step in that direction. Madam Speaker, that is the bill. I will yield for questions. There are a couple questions. The chair recognizes Representative Carson for a question. Thank you, Madam Chair. Mr. General and you. I do, yes sir. Thank you for bringing this bill. I just wanted to ask a couple of clarifying questions. Is it not true that what we're doing in House Bill 949, 949, is not just the IRC update, but we're making structural changes to make a fair and flatter income tax for Georgia. I would agree, yes sir. Mr. Chairman, further yield? Yes sir. Is it also true that this will directly or indirectly benefit all Georgians by making us more competitive with our surrounding states and states in the region? That's also true. We are already very competitive with our C Corporation income tax rate at 5.75%. We are a little bit high on personal income tax and this will address that issue. And again, keep in mind with a focus on growing small and mid-size business, all those businesses that have passed through income, S Corporations, LLCs, partnerships, sole proprietorships, all the small and mid-size businesses in your communities will benefit by the lower tax rate. Our corporate tax rate is already flat, so this puts small business at a flat tax rate as well. Chair recognizes a minority leader trample for a question. Will the gentleman yield? Yes sir, I will. Could you tell me what the cost of just section 2-1 is? So just implement, if the bill was just section 2-1 implementing the flat tax, what would that cost the state? So again, the economists and the fiscal note generated at Georgia state and the analysis they do and the modeling they do is based on a little over 3.5 million anonymized Georgia income tax returns. The data is based on Georgia data, not IRS federal statistical analysis, not think tanks in Washington DC, but actual Georgia tax returns. Their analysis says that these numbers and a standalone silo cannot be accurately reflected because as a package, the policy varies. But as you've heard in the past, some have suggested that a quarter point rate reduction from 6% to 5.75% was roughly $500 million. So if you want to use that as a standalone to give you a general estimate on what the three quarter point reduction you can do that math. Again, the analysis will tell you as a standalone, that's difficult to rely on. Yes, sir. Well, the gentleman further you will. Yes, sir, I will. So just to do that, calculate that math very quickly, I mean, if you were using that sort of metric to calculate the cost of section 2, 1 as a standalone, that would be somewhere between 600 million to 800 million dollars a year. Roughly, yes, sir. Well, the gentleman further you. Yes, sir. So I just want to understand the fiscal note and I think I do. So the way we get to the numbers that are in the attached fiscal note is we're adding back in a different section of the bill that results in increased revenue from the state by eliminating the ability of taxpayers to take a deduction on their state income tax. Well, we did a couple of things in this, putting this measure together. First of all, in the bill, as you all recognize, the bill is several different proposals. House Bill 949 was the original IRC update, the internal revenue code update. Part two that you just asked about has been contained in House Bill 432 for two years. And there are fiscal notes and analysis on that bill. All these fiscal notes are available on the OPB website. Section 222 dealing with the repeal of the Georgia income tax has paid the ability there is containing House Bill 1000 into that was vetted separately and independently in fiscal notes there. And section 2.3, the triple link the foster care adoption. That was contained in House Bill 934 with fiscal notes and analysis on that. So there is information publicly available for many weeks or in some cases a year on each of those component parts that have been vetted. But again, the analysis and the economists will tell you that the modeling is dependent on how those parts work together. So we wanted to be fiscally responsible to the budget process and to the other needs throughout the state and the other programs that needed funding and needed in many cases increased funding which you just saw in the budget we passed. So we put together these various standalone measures into a package that would allow us to be fiscally responsible and include it within our current budget constraints. Madam Pro Tem, Madam Speaker, with that I know there is a minority report filed there may be others that wish to speak on the bill and I will yield the well now and reserve the chairman's time to conclude. Thank you. Gentlemen is yielded the well. The chair recognizes Representative Walkerson to speak to the bill. Thank you, Madam Speaker. I guess I'm here to do the minority report. And I apologize if I move a little slower today because- Gentlemen, we'll suspend. This is just to speak to the bill and the minority report will come later after. Okay, just speak to the bill. I was recognized to speak to the bill. Okay, so I'm speaking to the bill. I can do that as well. My right mind- Against the bill but the minority report will come after the previous question is ordered. Can I do both and you want me to get out? Sure. Okay, thank you. And I apologize, as I said, the fiscal note is dated yesterday. So I apologize if I move a little slow. So I'm just going to touch on basically real quick. Actually, let me just come back from the minority report. It is what it is. I mean, we talked about this two years ago. At that point, it was a $500 million hit to the budget. And that's why we're making cuts now. The budget, 4% last year, 6% this year, is because we say we're being fiscally responsible. And you saw what fiscally responsible looks like. It means you cut to health care. You fund private prisons. You fund gang databases, but you don't fund maternal mortality. So I'm going to go back and finish taking a look at this fiscal note that's dated yesterday. And I will be back for the minority report. Thank you. Gentlemen, as you all do the well, the chair recommended. For what purpose does Chairman Sutsler rise? He waves. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. There is a minority report. The chair recognizes leader trample, a minority leader trample, to present the minority report. Thank you, Madam Speaker. I'm going to be brief because I have another colleague that wants to speak to the bill. But here's the deal on 949. We are fundamentally changing the way personal income tax is treated under Georgia law. We're shifting from a graduated income tax to a flat tax. And the consequence of that is that the taxpayers who will be in position to benefit most from this bill are higher income taxpayers. Specifically, taxpayers that earn over $108,000 are the ones who stand to benefit the most. If you earn over $545,000, about 42% of this entire tax break will be those taxpayers. And the cost to Georgia, if we just talk about section 2.1, in the flat tax is about $600 million. Now, the way we get to the fiscal note, and the cost in this fiscal note, is we combine a couple of bills into this one bill. So we soften the impact on the revenue. But the danger of changing the structurally is every year that we convene, we start to make changes to our tax code. So while we make this fundamental change to one part of the tax code by going to a flat tax from a progressive income graduated income tax that we've had, basically, for eight decades, then we risk coming back and doing something to the other part of the bill that was supposed to generate revenue. And all of a sudden, we decide we want to give that away. And we're looking at a $600 million a year whole. This bill, as is, creates a whole in terms of revenue. Now, maybe there's revenue generated from other measures that we've passed that will compensate that. Time will tell. But I would submit to you that we should go very slowly before we proceed into a change of this nature. And we should think about who it benefits. And we should think about who bears the brunt of the tax cuts or the budget cuts that we will have to do as a result of less revenue. Madam Speaker. There are a few questions if you want to take them. I'm happy to. You'll do a couple of questions. I'm cognizant of time. So I may not take them all. But I'm happy to yield to a question or two. Chair recognizes Chairman Knight for a question. Is it gentleman you? I will. To the gentleman, Will, I know that you represent area fairly close to me outside of, we would say, the metro Atlanta area. Correct? That's true. Further inquiry, wouldn't it be true that a lot of your area probably looks like a lot of mine as far as small business individuals, individuals who own their own business, who are what was mentioned earlier as pass-through entities? Is that not true? I think in any district you would have a small business. I assume that we would have a comparable. Don't know that for a fact. Further inquiry to the gentleman. I do. And you're probably right. Outside the metro area, I would agree with you on that segment. But wouldn't it be true that constituents from your district and my district and probably other parts of Georgia who are small to medium business owners, those individuals who own that business, that this would greatly help them and reward them for the hard work that they've done in creating those businesses? I think that's a question that each and every member will have to decide for himself or herself. What I can't tell you is not a single constituent has contacted me in six years and asked me for flat tax. But innumerable constituents have contacted me and pleaded with me about budget cuts that we've done and about restoring those cuts. And so Madam Speaker, in the interest of time, I'm going to yield the balance of my time to the gentleman for making the chair of the House Democratic Caucus representative Beverly. Chair recognizes Representative Beverly to speak to the bill. Thank you, Madam Chair. We hold these truths that be self-evident that all men are created equal, that they are endowed by their creator with certain and alienable rights, that among these a life liberty and a pursuit of happiness, that to secure these rights, governments are instituted among men deriving their just powers from the consent of the government. As a kid, I learn the value proposition of love. What love is is the voluntary openness to the possibility of being affected by someone else. My father and my mother would say to me, Jake, keep your eye on the big picture, but always take care of the little guy. Keep your eye on the big picture, but take care of the little guy. Fully implemented, my colleagues will tell you that this will only cost about $98 million. Truth of the matter is, is that most of the benefit of this bill, 42% of this bill, the benefit will accrue to the 1% of the 50,000 souls in Georgia who make over $572,000 a year. Keep your eye on the big picture, but take care of the little guy. 88% of all the money coming from this bill will go to. The benefit will go to people who make over $108,000 a year. Keep your eye on the big picture, but take care of the little guy. The little guy sent us up here. We are here because on some level, we all know that we love the folk who we serve. But most of those people don't make over $108,000 a year. Keep your eye on the big picture, but take care of the little guy. Business at the base of the pyramid is the backbone of this country. Most of the Georgians, that 2 million Georgians make between $38,000 and $108,000 a year. Keep your eye on the big picture, but take care of the little guy. The little guy in this proposal, according to this bill, will have to pay an additional $5 a year. It's going to cost more money. And yet we know in this general assembly that we were sent here by the consent of the govern. And when we violate that right, then it is to the govern to tell us what the future will look like as we move forward. I would encourage my colleagues to really take a deep look at this bill, but keep that tension in your mind. Keep your eye on the big picture, but take it a little guy. This bill harms a little guy. Gentlemen, as you'll do the well, the chair recognizes Chairman Harrell for the Chairman's report. Thank you, Madam Speaker. First of all, I am the little guy. So those that oppose this measure like to focus on the benefit the tax cut received by those at the lower income spectrum. And they will tell you the lowest percentage received $3, $5, $6 in savings. And someone at the high end, this high earner, is saving $2,700 under this bill. The person that saves $3 pays state income taxes of $64 and $50. The person that saves $2,700 pays state income taxes of $60,000. It's a percentage. So that's the way the bill works. Let me suggest also that the analysis, the forecasting, the economic models, while necessary and helpful. And I think especially when we're dealing with state analysis based on state income tax returns are reliable. But what is also reliable is the actual hard revenues that are received into the state of Georgia each year. Through the seven months of this fiscal year and in January 31, 2020, both personal income tax revenues and corporate income tax revenues are up combined up by $93 million over the prior year at the lower tax rate. And I believe the step that we've just laid out today while in the first year is only a $98 million reduction. As I mentioned in my comments, grows to a quarter billion dollars and out years. But we also have mechanisms in place to compensate for that. So we are not going to put the state, the citizens of Georgia, the valuable programs we offer at risk at the same time reducing the burden of government on those that are funding these wonderful programs. And at the end of the day, I think it's important that we keep our promises. And whether you voted yes or no in a prior year, the will of the General Assembly was yes. And the majority of the General Assembly was yes. And the law signed into law was a yes. And that's what we told the citizens of Georgia. And that's what we're attempting to do today. I don't presume that I've swayed those of you that had planned to vote no in advance of this presentation. I don't presume, or at least I hope I haven't discouraged anyone that plan to vote yes. I'm confident that this measure is prudent. It's measured. It's fiscally responsible. It rewards those that are hardworking in our state. With some small amount of tax reduction as compared to the burden that we place on them at all levels of government. And I would ask you to vote yes on the substitute a House bill 949. Thank you. And I'll yield the well. Gentlemen, as yielded the well, is there any objection to adopting the committee's substitute? Chair, here's none. The committee's substitute is adopted. For what purpose does Chairman Martin rise? Portland entry inquiry. Statue of inquiry. Madam Chair, I was going to ask the gentleman a question while directed to the Chair if I may. Isn't it true under this bill? If this flat tax is adopted, every salary increased that any Georgian gets at any level would be taxed to the lower rate after the passage of this bill than it would have been had this bill not passed. Every single Georgian, every new dollar they make at any level would be taxed at a lower rate because of this bill's patches. Isn't that true, Madam Speaker? The gentleman knows of what she speaks. For what purpose does Representative Clark rise? Portland entry inquiry. Statue of inquiry. Isn't it true that many reputable economists have forecasted that we might head into a recession? And that was prior to the coronavirus. And so right now at this very moment, this is a very risky venture to take on. And that while I do want to reduce taxes for my constituents, I do also want to be careful about when we do these things. The lady will be able to answer that question just a moment. For what purpose does Representative Park rise? Partly men are inquiry. Statue of inquiry. This is not true that the medium income in Georgia is $56,000 in the vast majority of these benefits from this bill would go to top earners, meaning that this bill will make the rich richer and the poor, poor in this state. I do nothing to help most of the constituents in which we serve. The gentleman is entitled to his opinion. For what purpose does Minority Leader Beverly, or well, not Minority Leader, Representative Beverly rise? He waves? What purpose does Representative Carpenter rise? Parliamentary inquiry. Statue of inquiry. Is it not true that by flattening our tax, any future tax cuts will help all Georgians have the same percent? We'll find out real soon, won't we? For what purpose does Chairman Dollar rise? Parliament inquiry. Statue of inquiry. Is it not true that there is a tax credit within the bill that will offset the flattening of the tax brackets ensuring that working families will not be harmed in this bill? That is the chairman's, that is the pro-TIMs understanding. For what purpose does Representative Williams rise? Parliamentary inquiry. Statue of inquiry. I want to ask the gentleman, and I was listening very close to the figures, just for clarification, was that comparatively on the existing tax raise or the tax, or the tax that's going to be levied, the example he made on the savings? The chair believes that typically the fiscal note projects upon adoption of the bill. Fall of Parliament, Jay. The state are in for it. In that case, then, is it not true that I'd be rushing to fire my accountant and put him in jail if I'm paying the full rate? You know, for clarification, the speaker is speechless. Nobody pays, nobody pays the full rate if you got an accountant that finished high school. Well, the gentleman is a lucky gentleman. The chair recognizes Chairman Corvette for Parliamentary inquiry. Statue of inquiry. Parliamentary inquiry. Statue of inquiry. Is it not true that Republicans cut taxes? I'm sure the gentleman knows of which he speaks. Is it not further true that two years ago, we as a house took a historic step to lower the income tax rate from 65.75% with the promise that we were lower to get in the future? Gentlemen, knows of which he speaks. And is it not further true that today, we're making good on that promise by further lowering the income tax rate to 5.35%. The house will find out in just about a moment. There's about 15 more listed with Parliamentary inquiries and considering how late it is in the day and the link that the calendar, the chair asks, is there any objection to adopting the Committee Substitute? Chair, here's none. The Committee Substitute is adopted. Is there any objection to a green to the report of the committee, which was favorable to the passage of the bill? The chair, here's none. The report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? Yes, all those opposed will vote no. And the clerk will unlock the machine. Hand me the student council to welcome his What purpose does Chairman Martin rise? Parliamentary inquirer Ms. Speaker. I think I heard the Speaker Pro Tem say she had done all those she was going to do. Is this something that hasn't been asked? Yes, sir. It's clear a point. I was just asked a question by a member if the Speaker would allow. Statue your inquiry. Isn't it true, Mr. Speaker, that those that are concerned about their constituent losing what are the so-called double deduction that those individuals too will benefit from the passage of this bill. They would pay less tax even though the double deduction goes away. The 5.375 will put them in a better place. Isn't that true, Mr. Speaker? I think the gentleman is correct in that statement. Okay. I don't know what. Chairman Setsler, you're recognized. What purpose do you rise? Parliamentary inquirer Ms. Speaker. Statue your inquiry. While we're at it, I just wanted to remind members that isn't it true this bill takes the tax credit for parents who adopt children from our foster system from $2,000 a year to a $6,000 your credit straight to their family's pocket. That's my understanding. And that Mr. Speaker, you did further true that I've passed for five years. So it's true that a family that adopts a child out of the foster system if we pass this bill will get a $20,000 direct benefit for taking care of those who the little guys among us. If the gentleman so states, all right, here's the final parliamentary inquiry. What purpose does Chairman Tarvan rise? Well, I'm in inquiry. Statue your inquiry. Mr. Speaker, isn't it true that something is dear to my heart that's in this bill is a provision that triples the current tax credit for adoption? If the gentleman so states, I know that's in the bill. Thank you, sir. There's a lot that's dear to your heart. Representative Carpenter behind you says he's one of them. Okay, all members in favor of the bill are voting aye. Those opposed are voting no. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 949. The eyes are 100. The nays are 68. This House has given a constitutional majority to House Bill 949. I'll get right now. Clerk will read the caption to House Bill 807. House Bill 807 by Representative Muntman, hand of the 17th and others. The Italian Act to amend Code Section 4813-4. The official to Georgia and Antony relating 11 on business or practitioner with location or office in more than one jurisdiction. This bill I'm referring to the Committee on Ways and Means. That committee recommends that this bill do pass by Committee substitute. Chair recognizes Representative Monda-Han to present the bill. Thank you, Mr. Speaker. Members of the House, today present to you House Bill 807. This is a bill that allows businesses to use a CPA to certify and gross rece-\n\nsee the amounts. They're an affidavit after a verification of all client tax returns or other financial data. Business taxes and financial data should be protected. This is a issue as a small business owner that is very near and due to my heart. And we need these protections for the proprietary contracts and vendor relationships that a business may engage in. However, under current law, there's a provision that financials, that I'll financials in a local municipality or area where they collect grocery seats must then be that financial data must be given and all financial data necessary must be given over to the local municipality. It's something that this bill addresses. Another provision of this measure is to restrict the use of regulatory fees to only the administration of the regulatory activity and not for use of general government. Mr. Speaker, that is the bill. I give for questions. Do you have no questions? Thank you, Mr. Speaker. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass. All those in favor of the passage of House Bill 807 will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 807, the eyes are 111, the nays are 51. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 879. House Bill 879, I'm sort of a hero of 106 and others to be entitled next to a man article 1 of chapter 3, title 3, the physical to Georgia. It's a two relating provisions regarding the regulation of alcoholic beverages generally. This bill have referred to the committee on regulated industries that committee recommends that this bill do pass by committee substitute. Chair recognizes representative or I'm sorry, Chairman Harrell to present the bill. Thank you, Mr. Speaker. I hope to redeem myself with some of you from the last bill I brought. This one House Bill 879 deals with provisions that would permit under very strict circumstances and very strict regulatory control for the home delivery of alcoholic beverages in Georgia. A little background I met with industry members several times throughout the past off season. This bill strictly complies with our three tier system in Georgia, supported by members of all three tiers. It is supported by GMA and ACCG. It has local control provisions in the bill so if your community chooses not to participate there is a way for them not to participate. It has strict requirements on the firms that would be and the companies that would be offering or potentially offering delivery on the drivers that require training and so forth and background checks and on face-to-face transactions at the front door where proper identification is provided. Age is checked, name, address, signature, secured to make sure that the product remains under legal control and not provided to those that should not be provided to. The bill also has regulatory oversight by the Department of Revenue where any violations can be addressed up to and including revocation of the permit to allow delivery and also those penalties would be in addition to existing penalties in law criminal penalties for example for providing alcoholic beverages to a minor. As a little bit of background one of the companies that participates in this business in another state and there is about approaching 30 states that provide for this today through their app there were over 400,000 requests during calendar year 2019 for home delivery in the state of Georgia which of course they had to say no to each and every one of those requests. So clearly that is one indication of consumer demand and as you all recognize more and more people are going online and placing their grocery orders online for home delivery and what this bill primarily does is it allows your grocery stores and others are included but primarily allows your grocery stores to include a bottle of wine or six pack of beer with your bread and milk when they bring it to your home. Very detailed bill we went to several subcommittee hearings before it came out of full committee but at that point Mr. Speaker I will yield for questions on House Bill 879. Chair recognizes Chairman Cantrell to your left for a question. Does Jim and yield? Yes sir I will. Chairman Harrell isn't it true that Randy Knicks is not only the chairman of the ethics committee but he is also the chairman of the T. Totelers Caucus. I believe that to be true and I was not counting on his vote. But isn't it further true that he was concerned that these alcoholic beverages be that they might be delivered in kind of discreet packaging? That could be a benefit for some perhaps. Does the gentleman continue to yield? Yes sir. Is it not true that I am the original little guy prior to you? We just kind of devolved into a whole different subject here. Mr. Speaker I will yield for another question if there is one. Thank you. Chair recognizes Chairman Lynn Smith to your right for a question. Thank you I'm right behind this tall guy who's blocking your views so thank you. I'm encouraged by your presentation and the fact that 30 states are also either doing this or consider doing it however is it not true that I'm hearing from parents of teenagers who need more reassurance that there will not be an avenue for these underage students to be able to acquire alcohol. If you could speak to that please. Yes ma'am I would be glad to there are more restrictions in this bill than are currently present at the counter in a retail store. So there's less likelihood that the information is captured in detail to prohibit underage purchase or distribution at the counter inside a store than there would be under this bill. So for example the companies have to follow a more strict regimen. The product can only be delivered during the lawful hours that it's available for sale. The product can only be come off the retail shelf in a licensed store within a licensed jurisdiction and delivered within that same jurisdiction. There can be no delivery to a front porch a mailbox a mailbox is et cetera it has to be at the front door face to face. The signature must be retained by the company that delivers that verifies the age of the person that is receiving it. So quite frankly there's more protections in this form of transfer than there quite frankly is in a in a counter in a store. Yes ma'am. Go through that list it takes all the fun out of it I'll tell you that. Mr. Speaker if there are no other questions House Bill 879 will request your favorable consideration again members of all the various industries have been participants and are generally supportive. There's questions this is strictly a delivering bill not a shipping bill. There's one or two questions that were concerned with some but I hopefully were continuing to discuss those one on the ability of this bill to become law in Georgia the Department of Revenue also believes that it is drafted in a manner that will allow them to effectively enforce. I would ask you to vote yes on House Bill 879. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here's none the report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 879 will vote aye those opposed to vote no and the clerk will unlock the machines. What purpose does representative Chocas rise Mr. Speaker according to rule 133 I request to be recluse from voting on this bill. Representative Chocas has invoked the protection of House rule 133 and he has that right and the journal will so reflect what purpose does representative lorickia rise. Parliamentary inquiry. Is it not true Mr. Speaker that this bill actually says if you have lost your license because of DUI's no worries my friend will just deliver the alcohol to your house. Well that's a question that addresses itself to each and every member I think. Sounds like a public safety measure to the chair. What purpose does representative holly rise. Parliamentary inquiry. Is it not true that with all this talk and going back and forth about who's the little guy first and who's the little guy second that it makes me wonder how they voted on the bill about the Paul Medo berries. I know we're not to trade okay. What purpose does representative Rick Williams rise. Parliamentary inquiry. Yes sir is it not true that if we're confined and quarantined for 14 days we might need to utilize this bill. I don't believe I'd tell it but all right we've got we need to move on we've got committees that are actually going to be meeting later today. Members in favor of the bill are voting I those opposed are voting no have all members voted have all members voted if so the clerk will lock the machines on the passage of House bill 879 the eyes are 110 the nays are 54 this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to House bill 791. House bill 791 by Robson of Stevens in 164 to be entitled to amend code section 264 80 the official bill to Georgia annotated relating the license required for practice of pharmacy. This bill haven't referred to the committee on health and human services that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Stevens to present the bill. Thank you miss speaker this is a very simple measure and it's some of you may wonder why you'd be wanting to have a 90 day supply placed in law to allow you to dispense a 90 day supply and it's all because again back to the PBM issue so all this bill does very simply is if there is sufficient quantity whenever you go into your pharmacy that you may have a 90 day supply at your at the pharmacist's discretion it cannot be used for the initial prescription this field and it cannot be used for control substances and the physician still has the authority if he so chooses say this angle happening put that on the prescription as well but I want to ask you for this maintenance medication for your constituents back home so they don't have to make so many trips to the pharmacy that's all the bill does and I'll ask for any questions if there are any you have a couple of questions if you care to yield certainly chair recognizes representative Stovall to your left for a question that's a gentleman yield yes ma'am this this bill have to do with insulin medication or is that that different and not a part of the 90 day supply it is anything that's that's non-controlled if it is maintenance medication and that's clearly one of those that should fill within that in that purview yes ma'am okay thank you do you further yield yes yes chair recognizes representative Bentley to your left for a question thank you mr. Speaker that's a gentleman yield yes ma'am is it not true that my husband will be returning to the Shepherd Center April 27th and we live down in rural Georgia away from our local pharmacists and having a 90 day supply of medication will help us while we are away from Taylor County at the Shepherd Center the general lady is correct and unfortunately this is another one of those bills that might prevent something you from having a lot of business because it'll keep people living thank you mr. Speaker I'll yield well is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines have all members voted if so the clerk will lock the machine on the passage of House bill 791 the eyes are 164 the nasa zero this bill having received the requisite constitutional majority is there for past clerk will read the caption to House bill 1082 House bill 1082 by reference to Paul the 32nd and others to be titled an act of a medical one-day of chapter 11 of title 40 the physical to Georgia annotated relating to abandoned motor vehicles so survived for notification letter for retrieving a motor vehicle held by a towing and storage firm this bill ever referred to the committee on motor vehicles that committee recommends that this bill do pass chair recognizes chairman alan Powell to present the bill thank you mr. spick and ladies and gentlemen of rain yity this afternoon House bill 1082 last several years we've been trying to clean up the non-consensual to problems has been experienced these these are the folks you might remember the last couple of years we've had bills that said that these towing operations that are ordered by law enforcement to pick up vehicles most of these are derelicts their junks their abandoned vehicles but because of their still considered private property and personal property they just it can't easily be just done away with last year we worked through it through the help of the good help through the magistrates we were able to trim the cost down to these vehicles because the junk yards are filling up they have no place to put them and they can't dispose of them so we passed the legislation you passed the legislation last year and now the only other problems has came up was with the filing fees one of the things that we agreed with last year was that a filing fee would be $11 would no other charges and the quarter or court order certified court order for the judgment would be $14 that was $25 but what we found is that some of the clerks have been charging upwards of $50 or $60 surcharges on top of the filing fees in the court orders this clarifies this this says again that it is just $11 and $14 the other thing it does is because of the drive system that's been enacted over motor vehicles that we have reduced from 15 to 10 days which is to the benefit of the owner of record of those vehicles that have to be notified in that 10-day period that this particular salvage yard or junk yard or towing operation that they have in fact tow that vehicle ladies and gentlemen that's pretty soft one that's what it does to be glad to answer a question and if are not I'll sit down you can sit down there are no questions is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of house bill 1082 will vote aye those opposed to vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machines on the passage of house bill 1082 the eyes are 162 the nays are zero this bill having received the requisite constitutional majority is therefore passed the clerk will read the caption to house bill 216 house bill 216 by represent of annullo what's the 42nd be titled an act to men code section 42 86 the fish go to Georgia annotated relating special license plates promoting and supporting certain or the agencies funds or nonprofit corporations this bill ever referred to the committee on motor vehicles that committee recommends this bill do pass by committee substitute chair recognizes representative annullo it's to present the bill thank you mr. speaker this afternoon i'd like to present to you house bill 216 i will be very brief this bill creates a special license plate honoring the Georgia tennis foundation the funds raised through the sale of the plate will be dispersed to the Georgia tennis foundation the tag will look like this you have a black and white copy of it at your desk and the Georgia tennis foundation has met all of the requirements of the Georgia Department of Revenue including the special license plate sponsor bond and they have 1000 pre sold tags i hope for your favorable consideration and with that i yield the well you have no questions thank you i would remind the members that this bill requires a two thirds majority is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines and have all members voted have all members voted if so the clerk will lock the machines on the passage of house bill 216 the eyes are 161 the nays or two this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 245 House bill 245 by rupture the book nerd 137 to be titled act to mend code section 47 1780 the fiscal of Georgia and to relating to retirement benefit options and payments to surviving spouses this bill have a further committee on retirement that committee recommends that this bill do pass chair recognizes representative buckner to present the bill thank you mr. speaker house bill 245 is a retirement bill that was requested by the peace officers in newty and benefit currently in the law benefits paid to surviving spouses are terminated if the surviving spouse remarries so hb 245 simply removes this prohibition from the law allowing the spouse that survives who remarries to continue to receive the benefit as a background the average age of the people receiving the peace officer a newty benefit fund survivors are set in their 70s and these beneficiaries have pre-selected this benefit choice to have a slightly lower monthly payment in order to cover the surviving spouse over their lifespan because of this there is no actuarial impact to the fund the fund requested this piece of legislation and can afford to offer this benefit I ask for your favorable consideration and if there any questions how would be willing to answer them you have no questions good thank you please vote yes is there any objection to the previous question being ordered the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor the passage of house bill 245 will vote aye those opposed will vote no and the clerk will unlock the machines have all members voted have all members voted if so the clerk will lock the machine on the passage of house bill 245 the eyes are 162 the nays are zero this bill having received the requisite constitutional majority is therefore passed clerk will read the caption to house bill 913 the council 913 by representative Reeves 34th and others be titled an act to amend title 19 with the official go to Georgia and Tate relating domestic relations so it's the strengthen clarify and update this bill then refer to the committee on juvenile justice that committee recommends that this bill do pass by committee substitute chair recognizes representative Bert Reeves to present the bill thank you mr. speaker members of the house this bill is simply put a a cleanup of the major adoption rewrite that we did a few years ago in house bill 159\n\ncontains a lot of clean up language, couple of policy movements, reducing the age from 25 to 21, which is something that everybody that was in the prior term of the House voted on three times unanimously, and also it adds a new type of fraud and scheme that we are seeing in adoption law. I'll be happy to stand for any questions. You have a question if you care to yield. Absolutely. Chair recognizes Representative Shannon to your right for a question. Thank you, Mr. Speaker. There's a representative yield for question. I do. So I understand what you're trying to do in lines 580 through 587. You're trying to make sure that those who would like to adopt are not taken advantage of, but in this section, I'm just worried that this is going to put undue pressure on somebody who's trying to make the decision about whether or not they want a parent. It's a complicated decision, and the way that you've got this listed is that it would be unlawful for anybody to basically say that they are willing to allow someone to adopt when they know that they don't have intentions to do that. My concern is that this is a tough decision, and this will put pressure on somebody who, at the beginning, made a side, they want to place a future child up for adoption, but changes their mind later. So where it says it would become unlawful, what level of a crime would it be for that person? And how would you prove it or disprove? Well, do you see what I'm saying? Well, thank you for your question. There have been, we had testimony in committee. There's been about 25 examples in the state of Georgia where there are people out there in the state, not just in a state around the country, who get their kicks by contacting parents who are intending and wanting to adopt a child and convincing them that they are pregnant and that they intend to have this other person adopt their child, which causes all types of things to go in motion, which usually involves financial expenses. And the whole entire time, it wasn't an accident or there was no hard decision. It was a sinister plan to trick somebody. Why anybody on this planet would ever do that to another human being? I cannot answer the question, but we know at least 25 examples in the state of Georgia where this has happened. And so this would qualify that activity if the person on the other end, expended resources and spent money, it would make that criminal conduct. Does the representative yield for another, same question, just more specific? Sure. Okay, so I understand what you're saying, and I'm aware of that. There was an entire Tina Fey movie around that, around that type of fraud. It's called Baby Mama. I get that, but you're focused on 25 cases where there are folks who may literally change your mind and throughout this process and decide that they don't want to put a baby up for adoption. So my question again is, how do you prove that you genuinely change your mind versus, I'm just wondering if folks would be criminalized for changing their mind? You can't change your mind when you were never pregnant in the beginning and you knew that you were never, what you're describing is not what this bill captures. This is for examples when somebody knows that they were never pregnant and they intend to offer up their baby for adoption and how it would be proven as in a court of law proof beyond a reasonable doubt that that person actually had that knowledge and knew that they were never pregnant and intended to implement the sinister scheme on someone. Okay, but line 583 says also, and I'm not referencing the part about if you're not pregnant and offering a future child for adoption, line 583 says, if the person purported to be offering the child for adoption has no intention of placing the child up for adoption. So that means that somebody who changes their mind could be potentially criminalized. And that is not what it is. They're worried about, well then explain to me how do you prove that you genuinely changed your mind? Explain that to me. If I don't think that I'm gonna be able to answer your question I don't think that I don't think I'm gonna be able to change your mind on this. But if a person is putting forth a fraudulent scheme that they are pregnant and that this child, this imaginary child, they're offering to these individuals who intend to adopt. If those persons incur financial costs as a result of this, then it would create a criminal penalty where all of these elements would have to be proven beyond a reasonable doubt and a court of law. Right, but what I'm saying is take out the person who is intentionally committing fraud. How does somebody who is not intentionally committing fraud but just change your mind prove that it was a genuine change of mind is what I'm asking. Are you saying if somebody thought they were pregnant and they actually weren't pregnant? No. Well then this wouldn't apply. No, no, no, it does. Line 583 says that if you say that you have the intention to allow someone else to adopt a child and then you have no intention that you say that you, so line 583 says the person purported to be offering the child for adoption has no intention of placing the child up for adoption. And where you're worried about the 25, I'm worried about folks who might genuinely change your mind. So take the fraud out, but just let's just consider the case of somebody who doesn't have one has nothing to do with the other. It's changing your mind. Changing your mind if you are pregnant and you are seeking to have your child adoptive and you change your mind, you have every right to do that. You don't only have the right to do that while you're pregnant. You have the right to do that up to four days after you've delivered the baby and after you've surrendered your own parental rights and given that baby over to the adoptive parents, you have the right to change your mind and there is no criminal penalty. This is strictly related to a fraud. You ask to remove the fraud from this. You can't remove the fraud from this because this is a provision that relates to a fraud. Respectfully, your bill does criminalize somebody who does change your mind. It just does. And line 583 says it plain and I'm just asking you how somebody can prove that they made an honest, that they honestly changed your mind. Thank you for your thoughts. Right. This is not, this is a forum in which to ask questions, not to debate or maybe even argue would be a better word. Do you yield for further questions, representative? I will yield for one more. Chair recognizes Chairman Dollar to your left for a question. John and you. I do. Is it not true that you spent more time on this issue than any other than ten, any ten people that I know in the last few years? I'm going to say that you may know of what you speak. Thank you. Mr. Speaker, I will yield the well. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the Committee substitute? The Chair here is none. The Committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 913 will vote aye. Those opposed will vote no. The clerk will unlock the machine. For what purpose does Representative Thomas rise? Parliamentary inquiry. State your inquiry. Is it not true that I want to vote for this bill? I have no idea. Further inquiry. State your inquiry. But is it also true that I am scared about the language that states that if a woman is pregnant with child and she goes and spends time talking to this baby day and night and gets an attachment to this child and wants to keep this child that she will get criminal charges? If the lady is so states, I am sure that she believes that to be true. That would address itself to each and every member's interpretation of the bill. What purpose does Representative Wilson rise? Parliamentary inquiry. Mr. Speaker, is it not true that I put my name on this bill and Representative Mary Margaret Oliver who's been fighting on issues like this for decades put her name on this bill and either one of us would have done so to fears that have been elucidated were actually true? Well, I can assure you that Representative Oliver has my chairman and days gone by that she doesn't like to be reminded of. You can't get her to do much of anything she don't want to do. All right, we're going to do one more parliamentary inquiry and then we're going to move on. What purpose does Representative Jasmine Clark rise? Parliamentary inquiry. Is it not true that I also will be voting for this bill but I have concerns about one word online, 582 and that word is the word or. If the lady so states. Thank you. Okay, members in favor of the bill are voting on. Those opposed are voting no. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 913, the eyes are 153. The days are seven. This bill having received the requisite constitutional majority is therefore passed. House Bill 952 will be postponed until the next legislative day. House Bill 641 will be postponed until the next legislative day. What purpose does chairman Ron Stevens rise? To make a motion. State your motion. Mr. Speaker, I'd like to move House Bill 244 back to rules. Chairman Stevens has moved that House Bill 244 be recommitted to the rules committee. The clerk will read the caption. House Bill 244 by resident of Stevens, the number 64th and others to be entitled next to a men part two of Article 4, Chapter 3, Title 46, the official of Georgia and Totted relating to corporate purposes and powers of electronic membership corporations. On the gentleman's motion that House Bill 244 be recommitted to the rules committee, is there objection? Is there objection that Chair here is none and it is so ordered? What purpose does representative Kirby rise? Make a motion. State your motion. I move that House Bill 474 be moved from industry and labor committee to the special committee on access to the civil justice system in both chairman and agree. Representative Kirby has moved that House Bill 474 be moved from the industry and labor committee to the special committee on access to the civil justice system. Clerk will read the caption. House Bill 474 by resident of Kirby, the 114th and others to be entitled next to men, Chapter 9 and Title 34, the official of Georgia and Totted relating to workers compensation. So I'll give you that back. On the representative's motion that House Bill 474 be moved from the industry and labor committee to the special committee on access to the civil justice system, is there objection? Is there objection that Chair here is none and it is so ordered? Chair recognizes, Chair recognizes the majority leader of the House for a motion for a resolution. Clerk will read. Make a Miss speaker. Miss speaker, I would ask that the clerk read a resolution, please. Unnumbered House resolution by Representative Burns, 159th and Kelly, the 16th, a resolution relative to meetings in the Germans of the House of Representatives and for other purposes. Chair recognizes the majority leader to explain the resolution. This is a House-only or a German resolution. It's posted on the board. As usual, our most important work that we do here today was partially accomplished in the past past budget. And when much thoughtful and considerate purposeful work and respect for the members of this House, we work to provide adequate time so we can continue our work through the remainder of this session. Having said that, the Senate and their wills them has passed a passed on a German resolution that does end on April the 2nd, signing die, as does our resolution. Some of the days in the internal between them are different than the Senate resolution. We are able to do that and we are able to conduct. Our business and they are able to conduct theirs. As you can see and you can read for yourself the terms of the resolution. The days out will provide adequate time for us to consider the remainder of our work as we go through the remainder of the session. Monday and Tuesday, Friday will be in for first readers after the crossover. On Monday and Tuesday, the 16th and 17th and respect for many of the members around this state who will be attending the events around St. Patrick's will be out. And also in consideration of our members who travel as I do, great distances to be here for the session and respectful of those who travel even further than I do, we will be out on Monday as well so we can take care of the business at home. But there will be committees meeting and we will be our committee work day. Mr. Speaker with that, I think that explains pretty much as you can see the days for yourself. This will take us through the end of the session and we appreciate your favorable consideration on this adjournment resolution. Mr. Speaker, I'll take any questions. You have no questions. I'll ask for your support and I'll you the will. Thank you, Mr. Speaker. Is there any objection to the previous question being ordered on the unnumbered House resolution? Hearing no objection. The previous question is ordered. Is there any objection to agreeing to the report of the committee which is favorable to the resolution that chair here is done? The report of the committee has agreed to shall this resolution now be adopted? All those in favor of the adoption of the adjournment resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the adoption of the adjournment resolution, the eyes are 156. The days are zero and this House has adopted an adjournment resolution which will take us to Sinidai for the 2020 session on April 2nd, 2020. If you have signed up for an announcement, clerk will read the caption to a group of privileged resolutions. Welcome being H.E. Stanley representative of Taipei Economic and Cultural Representative Office. Recognizing celebrating Hosea Antonio Guerrero by President of the Georgia Latino Film Alliance and Festival. Recognizing commending, Yvette Moise, co-founder and president of the Georgia Latino Film Alliance and Festival for working and helping the Georgia Latino Film Industry. Recognizing and celebrating Hosea and Antonio Marquez as co-founder chair and CEO of Georgia Latin Film Alliance and Festival for helping the Georgia Latino Film Industry thrive. Recognizing and commending the Georgia High School fencing league and its team members and for other purposes. Secondly, it's the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions? The chair here is none in the resolutions are adopted? If you have signed up for an announcement, please make your way to the front of the chamber to recognize as Chairman McCall for an announcement. Thank you, Mr. Speaker. On your desk, y'all saw that tomorrow morning at 7.30 is that annual legislative state biscuit breakfast put on by the cattle association down in 2.16. There's one caveat. If you are against the right to farm bill, we ain't going to give you a biscuit. And it's also a ag meeting at 8 o'clock in the morning, thank you. That means you don't need many for the Senate, do you? Chair recognizes Chairman Hatchett for an announcement. Thank you, Mr. Speaker. The majority caucus will meet tomorrow at 1 p.m. and room 403. Tomorrow 1 p.m. and 403. Chair recognizes Chairman Houston for an announcement. She waves, Chair recognizes Chairman Parsons for an announcement. Thank you, Speaker Rostin. The Energy Utilities and Telecommunications Committee that was meeting that was scheduled for today, we will not have it today, we will have it in the morning, 9 o'clock in the morning and room 403 of the Capitol. Thank you. Chair recognizes Chairman Newton for an announcement. Thank you, Mr. Speaker. Two committees meeting today, Health and Human Services in 606 CLOB in about 10 minutes at 5.30, that will be a brief meeting for us to go over a couple of quick things. Also the committee on access to quality health care will meet in the same room also for a brief meeting. So Health and Human Services and Committee on Access to Quality Health Care both in 606 CLOB. Thank you. Chair recognizes Chairman Cantrell for an announcement. Academic support subcommittee will meet upon adjournment in 406 of CLOB and that will be immediately followed by the full education committee. So if you're on education committee will be in 406. Chair recognizes Chairman Barr for an announcement. Good afternoon, y'all. Fellowship will happen tomorrow, but we're going to bump it to 8 o'clock. So pipe down, no cheering now. 8 o'clock, Fellowship meeting tomorrow same place. Chair recognizes Chairman Watson for an announcement. Thank you, Mr. Speaker. Rule caucus will meet tomorrow for lunch. Food will start fixing plates around 11.45 so we can be done in time for majority caucus. Two at one, Department of Ag. Thank you. Chair recognizes Representative Todd Jones for an announcement. Good afternoon, judiciary will not be meeting today. Will not be meeting today. We will meet tomorrow at 1.30 and room 132. Chair recognizes Chairman Martin for an announcement. Thank you, Mr. Speaker. One reminder members of the higher ed committee. We will meet tomorrow in 606 of the CLAB. We're scheduled at 1 o'clock. That will be pushed slightly because of the majority caucus meeting. But plan on seeing this will be over there between 1 and 3. We have three measures to hear. Thank you. Chair recognizes Chairman Blackman for an announcement. Thank you, Mr. Speaker. The full committee of governmental affairs will meet tomorrow morning at 10.30 in room 403 of the Capitol. Thank you very much. That completes our announcements. I'm sorry. Chair recognizes the majority caucus will representative Kelly for an announcement. Thank you, Mr. Speaker. Your House special committee to the access to the civil justice system will meet at 5.45. We will be adding a measure to the agenda House Bill 474. That completes now our announcements. The chair recognizes the majority leader of the House for a motion. Mr. Speaker, I move that this House stand adjourned until 10 a.m. Thursday, March 12, 2020. The majority leader has moved that this House be adjourned until Thursday, March 12, at 10 a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes have it. This House will be adjourned until Thursday, March 12, at 10 o'clock a.m.",
  "updated_at": "2026-02-13T12:10:09.377043+00:00"
}