{
  "video_id": "6Ez7Rcdzd60",
  "url": "https://www.youtube.com/watch?v=6Ez7Rcdzd60",
  "title": "3/22/23 - Committee on Rules",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 68,
  "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Rules session:\n\n**Overview**: This was a busy rules committee meeting where the chair outlined the process for the day and upcoming rules committee meetings. The committee considered and passed numerous study committee resolutions.\n\n**Key Actions**:\n- **HR 256**: Resolution to create a study committee on expanding early learning in Georgia\n- **SR 121**: Resolution to create a study committee on learning loss and impacts of COVID-19 on students\n- **SR 155**: Resolution to create a study committee on issues facing the trucking industry\n- **SR 203**: Resolution to create a study committee on pediatric safe storage of firearms\n- **SR 273**: Resolution to create a study committee on EMS reform\n- **SR 275**: Resolution to create a study committee on workforce development\n- **SR 282**: Resolution to create a study committee on foster care and adoption\n\n**Bills Introduced (First Reading)**: None noted\n\n**Notable Moments**:\n- The chair outlined the process for the day, noting they would set the calendar for the next rules committee meeting rather than letting members pick bills.\n- There was some discussion about potentially pulling certain study committee resolutions if related legislation was already moving, but no resolutions were ultimately pulled.\n\n**Votes**: No recorded votes noted.\n\n**Attendance**: Quorum present, no issues noted.\n\n**Adjournment**: Not specified, but the next rules committee meeting was scheduled for the following day or Friday morning.",
  "transcript": "Get a little quiet out there. It's getting a little loud in here. I know we got some anxious folks and\nFirst off let me start by saying\nIf you have already come here and presented your bill, you do not need to do it again\nIf you won't tell you can\nBut for sake of time if you have already presented your bill, you do not need to go again\nSo if anybody has other things they want to do or need to do, feel free to leave and exit\nnow.\nSeeing none.\nWell, for all y'all standing, I tried to help you out.\nNow, another rule, since this is rules committee, I like rules.\nAs you present today, you do not need to come back.\nWe'll hold one more rolls committee.\nIt will either be tomorrow night or it will be Friday morning.\nThat's going to be kind of dependent on the Senate schedule tomorrow.\nWe're going in at 1 o'clock tomorrow and depending how fast we move through bills,\nwe'll kind of determine when rules will meet.\nAnd I'll make that decision fairly early in the day.\nSo rules committee, y'all just stand by.\nWe're really going to meet early evening tomorrow\nduring a recess, or we will meet at 9 a.m. on Friday morning.\nAnd again, house members, if you present today,\nyou will not need to come back and present again.\nOr if you have already presented,\nyou do not need to come back and present again.\nNow, for you house members that are new to this,\nUnder normal circumstances, I make the bills available.\nSo that is the yellow sheet you're looking at.\nThose bills are available for the committee to be picked.\nBut the committee numbers are the ones that pick the bills.\nAgain, that's under normal circumstances.\nToday is going to be an exception of that rule,\nbecause I'm actually going to set the calendar\ntomorrow with about 17 bills.\nand then the rest, when we come back in,\nrules committee members, you're gonna have about two to three,\npossibly even four picks, when we come back in,\neither tomorrow night or Friday morning, okay?\nSo just giving everybody a heads up.\nSo House members, lobby the committee members.\nLobby them, because they are the ones\nthat will pick your bills outside of today.\nI'm gonna pick them today,\nbecause there's a lot of department bills we're trying to get on the floor\ntomorrow so they don't get caught up and cross over and a few other bills\nwe're trying to get on the floor tomorrow so I'm sorry for signing by signing\ndie all right so that's kind of the groundwork so let's go through first we're\ngoing to we're in standing committee all right we're going to briefly go\nWe're going through our study committees.\nAll right, so starting out, Senator James, you got SR-37.\nAll right, go for it, give me one sentence on it.\nSR-37, Senate Property Owners Association,\nHome Owners Association,\nCondominium Associations, any questions?\nNo. All right.\nNext SR 85 Senator Walker\nPerfect\nSR 121 Senator Butler. She's she's on committee on administrative affairs. You won't cover that forward there\nThat's just a committee to learn about students who may have got behind because of COVID\nAll right 121 that's what we just did. I'm sorry 144 center Estevez he ran up to the podium.\nThank you mr. Chairman. It's a study committee on expanding early learning in Georgia.\nPerfect any questions. Thank you. All right, uh Senator Mallow you with us\nSenator Jones you gonna cover that for us. Yes, study committee to determine on what\nwhat Garreal should be in place at the end of the agreement for a loss in the splice between counties and cities.\nAll right. Thank you. Senator Ann Vittarty, are you with us? I don't see anybody want to cover SR 155?\nGreat job. Thank you. Any questions? All right.\nSenate resolution 159, Senator Strickland. I know you've been working hard on this one.\nthis one. This will study child support guidelines when it comes to parenting\ntime deviation. See how much money you owe, Mr. Chairman.\nI'm not sure any of them are mine.\nThat's what they always say. My kids are smart, so I'm not, I'm not getting a DNA test on them.\nAll right, Senator Halpern, SO 186. If you'll go to the podium.\nThis is a Senate resolution just in honor of the day at the Capitol for the Democratic\nWomen Federation of Democratic Women.\nOkay.\nAny questions?\nOkay.\nAll right.\nSenator Jones of the 10th.\nI guess you have the only Senator Jones right now.\nWe lost the one to the LG office.\nWe used to have three now or down to two.\nAt least we got the good to go ahead center.\nThank you, Mr. Chairman.\nAny resolution 203, pediatric safe storage or weapons?\nPerfect. Any questions?\nAll right.\nSenator Resolution 251, Senator Davenport.\nShe will see if I want to cover that.\ntwo fifty one this is senior Rosenwald school study committee you may know\nwhat Rosenwald is number two got it he was one of the founders of Sears\nRoba he was instrumental in African American studies early on education\nperfect thank you all right Senate resolution 273 center albers EMS reform\nokay you're going to reform emergencies love it all right Senate Resolution 275\nSenator Alvers.\nStanding Georgia's workforce.\nI was looking to make your head when I had a chair here.\nI would have taken it.\nAll right.\nSenate Resolution 279, Senator Dolezal.\nWhat's that?\nOh.\nAll right.\nSenator Resolution 282, Senator Kirkpatrick.\nThank you, Mr. Chair.\nThis is a study committee on foster care and adoption.\nI like it.\nAll right, Senate Resolution 286, Senator Beech.\nYeah, this is to create a study committee to look at minority business, women, business, and\nveteran owns, but I will tell you, we have House Bill 128 on the calendar, which really kind of has done this.\nSo do we need to pull this off?\nYeah, I mean, there's no need for it if House Bill 128 passes to Representative Long's Bill.\nAssuming it gets picked.\nIf it gets picked and passes, then we would not need this study committee.\nWe're moving on for now.\nOkay.\nAll right.\nSenator resolution 293, Senator Halperen.\nOkay.\nIn fact, you got 293 and 296, go ahead and cover them both please.\n293 is a study committee that would look at an equity impact tools and it would just\nlook at equity impacts and what we might be able to do as it relates to legislation.\nThis is, here equity you think raised generally, but this really is looking at disparities\nand it could also be impacts and unintended consequences\non our rural areas versus urban.\nAbout 296.\nAnd 296 is a subject.\nNot to cut you off, but I'm going to cut you off.\n296, excessive noise.\nWe still have an issue with loud mufflers, loud music.\nAnd so this would be figuring out what the state could do\nto help our people solve this.\nAnd in this room.\nCan we have this room?\nYes, but that's it.\nEverybody's behaving nicely.\nAll right, thank you, Senator.\nSenator Matarte, 314.\nMike number one, 314 is a Solar Study Committee\nand apologize I was late.\nSenator Resolution 155 was a trucking and\nsort of study committee.\nMy car is on the right.\nThank you.\nAll right, Senator Resolution 323.\nFamily caregivers, Mr. Chair.\nAll right.\nSenator Resolution 354.\nMayor Wanda, Mr. Chair.\nMayor Wanda, what are we studying?\nWhat are we studying with it?\nWe're studying the impacts, the negative impacts\nof the use of Mayor Wanda, especially recreational Mayor Wanda.\nWe'll be working with the FDA\nand the Centers for Disease Control.\nGotcha.\nAll right, so here's what we could do if it's the will of the committee we can pass this onto a local consent calendar if there's any resolution any study committee anyone wants to pull off they can make that motion once we have a motion on the table for the consent calendar or is there any actually before I make is there anyone that would like to pull one off for individual consideration?\nOkay, all right, which one's what's your number there for?\nIt's in one of the most important ones.\nIt's and I don't see it in front of us.\nIt's a study committee on study committees.\nHave you looked at it?\nIf we adopt all of these, we'll be here all year.\nYou don't have to serve on all of them.\nI know, but if anything you'd like to pull off,\nnow would be the proper time to do that.\nAnd then we will vote on those individuals.\nWe go to make each one individually or just do it.\nWe just did.\nWe are going to pass on to a local consent calendar\nof resolutions creating study committees.\nAnything you would like to pull off of that consent calendar\nnow would be the proper time.\nAnd I will take that motion.\nAnd then we will have an individual vote on each.\neach, Senator Diggin, you have a question.\nThank you, Mr. Chairman, number two.\nNumber two.\nSo if we pass it to a local consent calendar,\nwe can still challenge on the floor\nto have it removed from the local consent calendar\nand vote for it individually.\nAll right.\nI said local consent calendar.\nIt's just a consent calendar, but my understanding is,\nthat we could do it, we could do it on the floor as well,\nbut since we're getting,\nI would pull off as many as you can at this point,\nif that's what you want.\ntrying to say if you see something but yes you're saving time now but we're\ngoing it's going to hurt us later yes question center albers thank you\nMr. Chairman are we in the standing committee we're in the standing committee at\nthis time so isn't it true if we pass all these they still then have to go and\nbe redone for a consent on the rules committee once their passes and that\ntrue that is we have another step to do still that is correct they would pass\nout they would go to the rules calendar so if we just pass these now we'd have\nsome time before you put them into the rules committee to figure out which\nWe might want a moment. They're going to be in the rules committee as soon as we get out of standing, which is going to be momentarily\nI'm sorry it will be tomorrow\nThank you. I'm sorry. I'm learning the rules too\nAll right\nWhat is the will of the committee?\nAh chairman Walker\nI have a parliamentary inquiry.\nOkay.\nIs it not true that even if we were to pass all of these on the floor of the Senate,\nit's still at the discretion of the Lieutenant Governor whether or not to appoint the committee.\nYou know, you being a former four-lative Lieutenant Governor, you would know that best.\nAnd I think that is a great point to bring up to the committee.\nAll of these to be appointed up. I wouldn't it be unusual\nFair enough to keep that mind committee now back in my\nRegional question. What's the world committee? I got a motion do pass to the consent calendar of resolutions\nCreating study committees. I've got a second any further discussion\nI'm sure you know what to do.\nAll right, all right, keep them up.\nWe'll get a count.\nWe're going to have some of what we got.\nYeah, he's getting the shaper wave left hand count to\nAll right, all the pays raise your hand\nGachandolls all the riff raff for the Senate\nWhich one are you riffing he's raff?\nI just didn't want to.\nAll right, motion passed.\nAll right, this meeting is adjourned.\nNew meeting is start.\nWait, what?\nD pass.\nOh, oh, oh, oh.\nWhat?\nResolution 186.\nI'm sorry, meeting was not adjourned.\nThat was a false alarm.\nWe did not have Senate Resolution 186,\ncommending the Georgia Federation a Democratic woman.\nThat one actually is separate because it's not a study committee.\nWhat is the world of committee?\nYou got a motion do pass from Senator Robertson and second\nfrom Senator Dugan.\nAll in favor?\nSay aye.\nAll opposed?\nSame sign?\nMotion passes unanimous.\nThose will all go on to Rolls Committee tomorrow\nAll right, thank you all right now means adjourn and we will call this next meeting to order\nWe are now in rules and we will go to the general calendar and\nRules consideration calendar your yellow sheet\nHouse members. Thank you for being patient\nI tell you what, let's just say we're standing, are representative towns, you want to hop up there?\nYes sir.\nTell us what bill and what page.\nIt's House bill 181.\nIt's LC339513S.\nBasically this is a constituent base bill on a plant-based product called Cratern.\nIt's right now, it's not safe for Georgians.\nIt's when you buy it off the shelves of a convenience store\nin front of the counter, you're not sure what you're getting.\nIt could be a low-dose, high-dose.\nWe've had two bad reactions.\nI know her recently in St. Simon's,\nand one actually committed suicide,\nbecause he was on that and other drugs.\nSecond one actually used it in a half-way house.\nIs that a lonely bill?\n181, yes sir, 181.\nOkay, thank you.\nAny questions for the author?\nThank you.\nGreat job.\nRivers and Corbett, I know you got another meeting.\nIf you don't go ahead, hop up there, trying to be accommodating.\nThank you, Mr. Chairman.\nMembers of the Committee, House Bill 81, first page.\nThe base we're doing here, we're just helping some schools that would not be able to qualify\nfor this low wealth project-specific grant that's in code now.\nWhat was the board member?\n81.\nLC 491061.\nAll right.\nAll right, but we're changing criteria once once a system needs have been met\nThey're roll off of that list and allow the next school to roll on qualify for this grant\nAll right any questions for the author. Thank you. Thank you\nLet's see represent my home. Did you I think you're chair in a committee or something?\nGo ahead, Sherry. Thank you, mr. Chair. I have house bill 128 LC 36 5 3 8 7 dash EC this\nThis stream lines to state business certification process by taking out the federal certification\nprocess requirement and it will also add women in businesses and veteran in businesses\nto the state certification process.\nAll right, thank you.\nRepresentative Cooper.\nThank you, Mr. Chairman.\nI have two bills for consideration.\nThe first one is House Bill 309, it's the bottom of the third page and this is a department\nrequest. It clarifies what CPAs can do when evaluating whether somebody thinking\nabout opening an assisted living facility has the financial backing and\nsecurity to do so. Okay, what was your other one? 470? Yeah, yes sir.\nAll right, fourth page, three fourths the way down. Thank you sir. This is one\nthat perhaps made the capital shake last week. We had agreement between the\nThe trial lawyers, the hospitals, the doctors, the insurers, it's a new way, just one small\nway of doing something differently in trying to resolve in a positive way when patients\nhave unintended unexpected consequences happen to them without involving the legal system.\nIt's totally voluntary between patients and the hospital or the doctor and the hospital\none. That's what it is. I'll be glad to answer questions.\nAny questions for the author? Thank you. All right.\nRepresentative Taylor, come on up.\nThank you, Mr. Chairman and members of the committee. I bring you House Bill 317.\nThis is a bill that has to do with the retirement plan for some, it's an old plan that the\nstate has. And for some reason, they did not allow an assignment of life insurance benefits\nto the funeral home. And funeral homes have been left without their\nbill being paid and this allows them to accept an assignment for the funeral expenses.\n317 is not on the yellow sheet but she can go ahead and present one of the\nissues were because it is a pension plan but once the beneficiary once the\nemployee has deceased it's the beneficiary's money so the state as we leave\nthey're doing what the beneficiary wants and assigning the benefits. Thank you\nThank you.\nQuestions for the author.\nThank you.\nRepresentative Ballinger.\nGo ahead.\nThank you, Mr. Chairman.\nI don't know if I'm on the yellow sheet or not.\nActually, I was trying to sneak over to Chairman Cooper.\nJust show us your bills.\nIt's 508 and 509.\n508 basically establishes a shot clock for the temporary\nprotection order to be given to the respondent.\nIt's a domestic violence bill.\nAnd 509 basically adds under burglary you can if you unlawfully enter the dwelling of another and you commit a theft or a felony then you're charged with burglary\nI'm just adding a basically a family family violence act to that burglary statute any questions for the author. Thank you. Thank you.\nThank you very much, Mr. Chairman, members of the committee.\nThis is House Bill 294 by Senate Committee Substitute.\nIt deals with reinsurance contracts when the seating insurer is in liquidation.\nIt simply creates the ride of the successor of that insurer in liquidation to continue\nre-insure its kind of trait.\nAll right. Any questions for the author?\nSeeing none. Thank you, Representative Gamble.\nI didn't see you sitting over there.\nThank you, Mr. Chairman.\nI just didn't call on you.\nThank you. House Bill 130.\nIt's on, I don't know which page it's on.\nI hadn't seen your sheet.\nOkay. This is Governor Kemp's administrative initiative.\nThe Georgia Peace Officer Service Loan Repayment Program.\nThis will allow someone coming into law enforcement that's post certified or someone that's currently there to be eligible for up to\nExcuse me for up to $20,000 in loan forgiveness for in exchange for working five years in law enforcement\nThe degree has to be specific to criminal justice if they're currently in law enforcement\nAll right, thank you. I've got one more. Hurry. All right house bill\n279. It deals with fortified construction. You've probably heard this before. It basically incentivizes\nConstruction of fortified construction and it allows the insurance companies to determine an incentive to offer if you build of that\nStandard that's house bill 279. Thank you. Thank you\nSenator tillery you want to come up here. You got a little bull\nThank you, Mr\nchairman appreciate your your time. HP 19 FY 24 budget.\nAny reason why it's 19? Well, that is my district.\nHow'd you get the house to do that? Gotta have friends on both sides of the\naisle to pass a bill.\nIt's the best you got. It's all I got. All right. All right,\nrepresent foul.\nThank you, Mr. Chairman, bring to you House Bill 76, Mary's therapy upgrade bill, which\nI'm intricately familiar with the subject matter, and I understand that you'll have a little\nbit of a special information it might be on the back of it that should be great news\nfor all members of the legislature.\nYes, your next marriage won't have to get approved by Gork.\nAbsolutely.\nOr be appointed by the government.\nsecond bill is a house bill 353 and I believe that is on page four that's\nupgrade bill to the co-am division puts APA and open records into the co-am\ninvite into the co-am division that regulates industry allows gift cards per\nthe two-year pilot project that the lottery commission has been\nexperiment with and they say it's a good to go and protect the private property rights of the land\nlords that lease these properties to the licensees. Okay, any questions for the author? Thank you.\nRepresentative, come on up. Thank you, Mr. Chairman. I've got two bills on your schedule and I don't\nhave the form with it, so I don't know where it is, but the first one is on House Bill 480 and\nAnd it's an agency bill from the State Board of Workers' Compensation.\nIt just cleans up the language of what a dependency is at the time of the death.\nIt also allows for an increase in the max benefits of when you get injured on the job.\nAll right, next.\nThe next one is House Bill 285.\nAnd this is Department Bill.\nIt basically allows the public, I'm sorry, the employee retirement system to be able to invest an alternative\ninvestments from 5% to 10% and they just are requesting that increase.\nRivers and Franklin are you a department.\nForward wager.\nNo sir.\nOkay.\nYou just got to department bills.\nI just got you just say that so they'll get picked.\nThat's part of it.\nThat's a good good method because there's like 82 department bills on here.\nUh, all right.\nThank you.\nAny questions for the author?\nThank you.\nThank you.\nRepresentative Smith.\nMy former delegation member.\nThat's right.\nThank you, Mr. Chairman.\nBefore you beat me out of the troop county.\nThank you, Mr. Chairman.\nI've got to send it now.\nThank you.\nThank you.\nI've got to send it, Finance, Substitute, House Bill 264.\nThis is a tax payers' bill during their appeal process for property taxes.\nIt balances the time between the tax assessors and the hearing officers and I appreciate\nyour consideration.\nand your other one. Was that it?\nSir. All right. Thank you.\nRepresentative Yeard, come on up.\nThank you.\nI have, uh, substantive, Senate\nSubstitute Fransfield 204.\nIt creates a Georgia Municipal Court\nCouncil, which, uh,\nthe courts and, uh, municipal courts in Georgia are very,\nvery varied from Atlanta to small cities.\nUh, this would aid in them\ngetting grants for federal type grants that would, uh,\nSo they could create a municipal court clerk certification program.\nI'm convinced it would make this state better with municipal courts.\nThe second part of the bill clarifies the law that the legislature can only reapportion\ncounty commission districts.\nAnd the other part of the bill just says that if you're in a county commission seat for\nthe term for years that you would not be able to, that you would be able to serve the remainder\nyour four-year term. And that's the big thank you. Representative Stevens come on out.\nThank you, Mr. Chairman. On the last page House Bill 557 brings us in line with the rest of the\ncountry and with the API ends and PAs being able to prescribe certain emergency prescriptions\nfor a five-day emergency order for class two narcotics. Okay any questions for the author?\nthank you that it that's all you got all right man\nRepresentative Jackson thank mr. Chairman's little committee nice coat by the\nway excuse me sir nice coat thank you thank you house bill 82 I saw in the\nfront page and this is a rule physician tax credit that's been perfected by\nboth houses and the Department of Revenue and we think it's a perfect bill\nperfect bill all right you got some might I got some questions out of that\nanybody got a question now I guess not thank you perfect bill needs no\nquestions chairman jester's come on out yes sir what you got brother I've got\nuh since substitute the house bill 406 Mr. Chairman I'm not on your yellow\na seat but I got a call from your fine staff today, yesterday.\nThis bill does three things.\nIt's the work of the Joint Commission on Electrification, Transportation, Senator\nGutes and I cheered this past year.\nThose three things allows for the cell of power by retail, by others, the\nand George Power of the EMCs, allows the regulation of electrical vehicle charging stations\nfor safety accuracy and the collection of the excise tax and the taxing of the\ncell of electricity.\nOkay.\nThank you.\nSenator Watson, Senator Sam Watson back there.\nI know the house is calling.\nWe're going to represent that.\nYou did such a great job that no questions.\nThank you.\nThank you, Mr. Chairman.\nI've got a house bill 291 for Representative\nSkoggins.\nHe's out with Strip.\nand I'm carrying this bill for him on the floor.\nI think it's on the second page, third page,\nHB291.\nThis is dealing with the Council of Probate Judges\non deals with Guardian and Ward.\nThey've asked to allow some other folks\nto help them out in this area.\nAnd that's basically what the bill does.\nAll right, thank you.\nThank you, Mr. Chairman, members of the committee.\nI'm going to go to the\nschool.\nRepresentative.\nCome on up.\nHey, I've got House Bill 538, the Georgia Early\nLiteracy Act.\nIs this your first bill?\nYes.\nOkay.\nIt gets our students reading on grade\nlevel by the end of third grade by\nrequiring the use of scientific\nevidence-based foundational principles\nthat have been proven to work.\nIt gives the teachers the tools and\ntraining to teach children to read and\nit gives students the tools to read\nof Comprehension and it provides a timeline for implementation of this plan and assessment\nof the students.\nOkay.\nAny questions?\nAll right.\nLet's hang on.\nI know.\nHang on.\nOne number one. What's the bill number again?\n538. It's on the very back page.\n538 are represent baller continue, please.\nOkay. Well, I was done. Do we get through it all again?\nNope. Good job. Thank you. Any questions? Thank you.\nCome on up.\nMr. Chairman, I just looked at the list and I'm not on the list,\nbut I'll be glad to present this really good. Yeah, go ahead. House Bill 31\nAnd as a dedication of all the hazardous waste fees to the hazardous waste trust fund\ncan be used to clean up hazardous waste sites in Georgia.\n31.\nI don't think 31 has made it to rules yet.\nDid you come out of, when did it come out of committee?\nLast week.\nI don't know.\nIt's House Bill.\nOkay.\nYeah, we got it.\nOkay, thank you.\nAny questions?\nThank you.\nThank you.\nDr. Nguyen, come on up.\nSir Mr. Chairman, I have two bills that came out of,\nsubstituted out of Senate Finance,\nHouse Bill 308, LC-432813S now.\nThat's a bill to continue a program that's worked well,\nreal well, training our PA's nurse practitioners\nand medical students by using a physician,\na tax credit for a preceptor who's willing to take them on\nfor a month at a time, this bill currently,\nthis process will currently expire\nfor all our Georgia schools into this year\nif we don't renew it.\nso it would be very valuable to our medical\nand PA in nurse schools.\nAll right, is that all you got?\nI got one other, House Bill 230,\nalso a bill that came out of Senate Finance Substitute,\nLC-432803S.\nThat bill recognizes the consolidated government\non the border of South Carolina\nfor a regional project on arena\nthat we want to rebuild in place\nand that allows us to, through a sales tax,\nhalf penny sales tax, it allows us to get money\nfrom those out of state that will enjoy\nbenefit of that arena. Okay. Thank you. Thank you, sir.\nA fellow vice chairman gains. Come on up. How are you, Mr.\nVice Chairman? Good, Mr. Vice Chairman. How you doing?\nGreat. Good to see you. Good. Thanks for having me.\nYeah. I'm honored to have you.\nGood. Got two bills that on the yellow sheet House Bill 88,\nwhich is the top of page two. And this is Coleman Baker Act allows\nfor re-investigation of co-case homicides and allows for\nreporting of co-cases and for coroner's issue, non-specific homicidal means of death,\ntrying to address several issues related to co-case homicides, and then also on the\nbottom of page to House Bill 185, which would provide tuition grants that we have included\nin the budget for students with intellectual disabilities who attend what are called\nthe IBC programs, UGA and colleges throughout the state,\nGeorgia Tech, Georgia Southern.\nAnd so that allows students with intellectual disabilities\nfor tuition funding,\nbecause currently they're not eligible for hope.\nI mean, I did have House Bill 528\nthat I think was on the yellow sheet.\nI'll just mention, but I think it's no longer on there.\nThat allows for consumers to,\nwho subscribe to something online, automatic renewal.\nThey'll make sure they can also cancel that subscription\nonline so you don't have to call and sit on hold and wait in order to cancel a\nsubscription okay thank you any questions thank you thank you thank\nMs. Vice Chairman yes sir come on up represent me how are you doing great\nMr. Chairman how about you today doing well thank you for the opportunity to be\nhere on top of page three is House Bill 189 Mr. Chairman is being brought from\nthe Senate Transportation Committee as a substitute the language was brought\nfor by both Chairman Dolezal and leader Gooch.\nMany of you may know, under both the last three years,\nwe've had the opportunity to operate it at 95,000 weight\nexemption by executive order of the governor.\nThat exemption has expired.\nSo what this bill does allows for a 10% variance,\nfor a total of 88,000, for forestry and agriculture only,\nrestricts the miles traveled to 75 radius of the farm,\nor wherever the point of origin is,\ngrants local law enforcement the ability to weigh trucks,\nif they have scales and restricts the trucks from entering the non-attainment area around\nMetro Atlanta area.\nAll right.\nIs that your only bill?\nYes, sir.\nAll right.\nThank you.\nThank you.\nThank you, Mr. Chairman.\nWe're representing Verbal.\nCome on up.\nThank you, Mr. Chairman.\nThere are two bills of mine here on your list.\nOn the first page, House Bill 87 there is our completion school bill continuing with\nthree of our current programs, which is Mount Ned,\nfoothills, and coastal plains, and also setting up seven\nzones in the state for like type drop out prevention\nschools to be set up working with our nontraditional\nschools. All right, what else? And the other is 338, which\nis a bill that we heard last year here in rules also is a\nfiltering bill for handheld devices devices that children\nare issued through their schools,\nfiltering it for inappropriate material\nand trying to keep pornography off of those items\nand securing them.\nOkay, any questions?\nThank you.\nThank you, Mr. Chairman.\nRepresentative Washington, come on up.\nThank you, Mr. Chairman.\nI'm presenting a Senate Committee substitute\nto House Bill 514.\nIt deals for moratoriums on residential construction.\nIt does not allow moratorium for longer than 180 days\nexcept under some specific conditions.\nAlso does not allow the imposing of the new moratorium\nfor another 180 days.\nAlso limits permitting fees to the cost of administration\nof the permitting process.\nLastly, it allows local government to waive some fees.\nAllows doesn't require them to waive fees to incentivize residential construction, and that is the bill.\nAll right, any questions for the author?\nThank you.\nRepresentative Silcox.\nCome on up.\nThank you, Mr. Chairman.\nI have four bills.\nThe first two are department bills.\nThe first one is for Chairman Tyler Paul Smith.\nHouse Bill 475 is the annual code revision to revise and modernize the code.\nModernize the code.\nThe second bill is for the Department of Human Services.\nThat's House Bill 571, and it's going to ask the Georgia Alzheimer's and\nrelated dementia state plan advisory council to update our statistics related to\nAlzheimer's and dementia every two years and give a report, official report every four years.\nThe third bill is House Bill 416, and this is since the federal emergency is expiring on May 11th.\nThis is going to allow our pharmacies to still utilize pharmacy technicians to administer vaccines only.\nThose vaccines would still be dosed by the pharmacist.\nBut this would allow them, like I said, to use the pharmacy technicians going forward.\nAnd finally, I have House Bill 500, which would make it a crime to set a police vehicle on fire.\nAnd those are the four bills.\nSo it's not a current crime set of vehicle on fire?\nIt is a crime to destroy government property, but this would make it a felony to do so to a police vehicle, and it would be a fine of $100,000 and or three to 20.\nAll right, let's get a little order in here. We've got a lot to do, a little time to do it.\nI already have questions for the author. Thank you.\nThank you.\nCome on, let's represent representative Sharon Henderson, HP 384.\nIt's not on your list, however, HP 384 prostate cancer is the second meeting cause of death\nin Georgia among men.\nThis year alone, almost 9,000 men will be diagnosed with prostate cancer and over 800 lose\ntheir battle to prostate cancer. This will simply as insurance companies to send notifications\nto men upon reaching age 45 to have a PSD test done which would diagnose the level of PSA\nthat they have. Early detection is key. Early detection saved lives. And this is simply\nall this world does. It detects early detection and save lives in the state of Georgia. Thank\nThank you.\nThank you.\nAll right, no questions.\nYou're good.\nCome on up.\nThank you, Chairman Brash.\nThank you, members committee.\nI got two bills.\nGot House Bill 143 is the continuous glucose monitors.\nWe're going off a substitute, changing it from medical pharmacy to most cost effective method.\nSo that's the only change in House Bill 143, I think we've heard this several times.\nOkay.\nOkay.\nThe second one is House Bill 498, Spinal Directors, Laps, License, Ten Years, Lapsed.\nThey can get them reinstated by meeting certain criteria.\nAll right, any questions?\nSir James no questions thank you sir parent do you have something you have\nsomething to present okay what you got hand her mic nine there please\nThank you very much, Mr. Chairman and members, this is our 250 number one on the first\nI mentioned that urges the city of South Fulton at East Point to form a hospital authority.\nThey have an opportunity to do that and because of the well-star South Fulton hospital closing,\nand people in Heyville, East Point Coast Park,\nthe United City Fairburn Palmetto,\nChattahoochee Hills, and Southwest Atlanta.\nDon't have access right now to a hospital.\nAnd we have the, we have.\nWhy don't they have access?\nWhat was it that closed?\nExcuse me?\nWhat, what closed nearby?\nThe only thing nearby is greater hospital and that.\nWhich one closed?\nthe South Fulton East Point Regional Center.\nOkay.\nAnd then the AMC probably didn't help either.\nAnd then the AMC closed, too.\nWho manages that?\nA well start.\nThat's right.\nYeah, it's under.\nAll right.\nSo it's nothing against well start.\nWe just have people who know who need it.\nThey need an authority in order to get the bonds, but we have funding available.\nBut we have to have either a hospital or a party or some other\nthe governor or somebody to ask for it.\nThank you.\nRight.\nNow, I apologize for not calling on you.\nI didn't see you.\nYou never went on the list right there, and I didn't see it.\nI'm sorry.\nThank you.\nYeah.\nThank you.\nOK.\nRevolution of Jenkins.\nGood afternoon, Mr. Chairman.\nCahida Delegates.\nYes.\nGood to have you.\nGlad to be here.\nhave two bills for you this afternoon.\nHouse bill 132 on the second page,\nwhich I have previously presented,\nrelating to graded lumber.\nSo we won't talk much about that.\nNext.\nHouse bill 254 is my second bill.\nThis bill pertains to legal organ.\nIt's an organ, it's a three-part bill.\nThe first part makes it changes the criteria\nfor selecting a legal organ.\nThis is aimed primarily at our rural counties\nwho may have lost their legal organ.\nThe second part of this bill,\nadjust ad rates, it actually increases\nthe legal notice rates for inflation.\nThen the third part of the bill is basically,\nif the legal organ fails to publish a legal notice\nthat it was running the paper,\nthis allows electronic means to back that process up\nand proceed without interruption so that we can continue\nprocesses without delay.\nAll right, in question for the author.\nThank you.\nGreat job.\nThank you.\nRepresentative Hilton.\nThank you, Mr. Chairman, distinguished members here\nto present to you House Bill 219.\nIf you turn to the top of page number three,\nHouse Bill 219 provides victims of financial crimes\nwith justice by changing the venue\nfrom where the assets reside to where the victim is.\nI got another one. Two more. Turn the next page. Top of page four. House Bill 318 removes\nthe redundancy in state government by removing responsibility for the oversight of state\nand local charter schools to one agency of the State Charter School Commission here in\nGeorgia. Okay, what's your third one? Third one, not on there yet, but House Bill 453 removes\nan ambulance provider fee that's been paid for the better part of 20 years without matching\nreimbursement. Okay, thank you. Thank you, sir. All right.\nRepresentative, come on up. Good afternoon, Mr. Chairman and members of the committee.\nI have, I believe it total of six bills. I've looked at the sheet. I think three of them are\non there. House Bill 80, which I presented a few days ago. I'm 500. I ain't bad.\nHouse Bill 80, I presented a few days ago and I'm assuming you don't wish to hear that again.\nNope.\nAll right.\nThen House Bill 220, without getting into the legalities of it, it basically would require\nHOAs and condominium associations to go to court first before they go on to property\nto cure any kind of deficiencies.\nAnd then House Bill 227 creates a new crime of damage to critical infrastructure.\nIt makes it a subset of criminal damage to property.\nAnd the first degree increases the penalty.\nThis is for folks who damage power substations and things like happen in North Carolina\nback just before Christmas.\nOkay. Any questions? Thank you.\nThank you very much.\nCome on down.\nGood afternoon. I have House Bill 43, which is on the top,\nnear the top of the first page on the yellow sheet.\nThis bill is requested by our Council on American Indian Concerns\nand our three state recognized tribes.\nIt number one updates the addresses for those three state recognized tribes\nso they can properly be found and two ensures that those tribes\nhave representation on our council which is under DNR.\nCool. Any questions? Are you in a tribe?\nNo, I'm not. Certainly we should be supportive of them and am.\nYeah, obviously. I was just checking.\nThank you. You said we are tribes. I just wanted to.\nI was just curious. We're all part of some tribe. That's exactly right.\nThank you. Some we don't want to be part of.\nAll right. Thank you.\nThank you, Mr. Chairman.\nBring you today's substitute to House Bill 244.\nThis is a Department of Natural Resources Bill.\nYou don't need to worry about it a bit,\nbecause it came through Senator Lee Anderson's committee,\nwhich means it's thoroughly vetted.\nAnd this bill is about four years ago,\nI carried the Oyster-Merry Culture Bill.\nMost of this is some improvements there related to defining cages\nfor new technology with growing oysters.\nWe also have some language in here allowing the governor\nthe governor to replace board members like they do in other boards across the state.\nAnd we actually also in here allow, as you'll notice, electronically calling Fox and Bob\nCat in this state as during hunting season for those species.\nOkay.\nSo your oyster bill, the original oyster bill, if I remember correctly, at a house member\ntest five against it and if I remember the number right, he kept saying 37 members\nand the House voted against it.\nI can't remember that, I can't remember that.\nI know we had a member on the coast to actually\noppose that measure.\nWell he was basically enough.\nI had to remind him 37 wasn't enough.\nYes, that's right, not quite enough.\nIt's a good bill, and by the way,\nanybody interested, we are only awaiting the Corps\nof Engineers approval.\nFederal bureaucracy is the only thing keeping us\nfrom farming oysters in Georgia at this very minute.\nWe're still waiting, and we have been for quite some time.\nAll right, well thank you.\nThank you Chairman.\nAll right.\nRepresentative Dempsey.\nCome on up.\nMy mama would be enjoying this if she was watching.\nIn fact, maybe.\nMaybe she can go back and watch us, OK?\nShe'd probably watch it, actually.\nJust her buys information.\nI was in high school with the chairman's mother.\nWe graduated together.\nAnd I was in college with her daughter.\nYeah, and I'll work down in it.\nYes.\nHere we are.\nSo here we are today.\nPage three, the fifth one down.\nThe Senate substitute to HB228, this is a great opportunity\nfor several of our colleges and a university\nthat were not eligible for tuition equalization grants\nback in 2011 when 33 schools were grandfathered\nin to that program.\nIt allows in section two, it allows for two HBCUs\nto be considered, Penn College and Mars Brown College\nin section three, South College, which was\nSenator Burns bill that passed out of here and was just being heard again over in House\nHigher Education. And then in section four is the underlying bill for Chamberlain University.\nThey each address critical shortages in our state to help with the education process\nas well as particularly the nursing shortage. So, my whole takeaway from your presentation\nwas I heard you saying the house is actually taking up some of our bills, so I'm glad\nWe are and I I mean, I'm just like I'm here. I will tell you this at Senator Burns came to pitch this to y'all\nBecause we didn't have a quorum and then the quorum was reached at that moment\nSo we're looking out for you. Yes, he yelled at us. Yeah, okay as usual. Okay. Thank you\nRepresenting raise come on up\nThank you chairman brass members of the rules committee. I'm here to present House Bill 383 the Safe or Hospitals Act\nThis bill came through Chairman Watson's Committee and was passed unanimously.\nThis bill puts all hospital employees on par with emergency room workers in terms of\nprotections from assault and battery.\nIt also allows all hospitals in the state to form a hospital campus police department\nlike some hospitals currently have the ability to do through grandfathering or through being\naffiliated with the college.\nRespectfully request approval of House Bill 383 and then three bills which I presented\npreviously just to recap those and respectfully request\napproval of House Bill 182.\nThat is the State Bar of Georgia's commercial real estate\nbill and some other mortgage and title insurance matters.\nHouse Bill 444.\nThe Liz Pendence Bill to give clear title to real estate.\nAnd a department bill House Bill 572,\nthe State Ethics Commission Bill,\nwhich formally renames the State Ethics Commission,\nthe State Ethics Commission.\nThank you.\nOkay, for the bill.\nThank you.\nAny questions about state ethics?\nBeing named State Ethics.\nThank you, Representative, for bringing this.\nWhat was the State Ethics Commission called\nbefore it was called the State Ethics Commission?\n15 years ago, it was the State Ethics Commission,\nand now it is a tongue twister\nthe Georgia transparency and accountability,\nblah, blah, blah, blah, blah.\nThat's, thank you.\nAnd just, nobody can say it five times faster.\nI'm just glad we've passed so many laws in 15 years\nthat we're going back to starting all over again,\nI appreciate it.\nThere are a few things that Mr. Amadi requested\nthat are technical cleanups also in the bill,\nimportant legally and the committee recommended it\nunanimously.\nI got, I was just picking on you, go ahead.\nThank you.\nAll right, everything's advanced, come on up.\nYes, sir, Mr. Chairman,\nit's house bill 396 that is not on your yellow sheets,\nbut it passed out of Chairman Anderson's committee.\nweek or so ago and all it does is add the president of Georgia College of\nState University and or designate to the Georgia, excuse me, the O'Coney River\nGreenway Authority. Okay, any questions? Thank you. Thank you sir.\nRepresentative LaHood, come on up. Thank you, Mr. Chairman. I'm here to present.\nI'm here to present the House Bill 497, it's second from the bottom on page 4, and what this bill does is address the health care, some of the health care workforce challenges by allowing certified medication aids to work within state penalism.\nPino institutions. Pino institutions. Yes, thank you. You can say Pino. Well, I wasn't sure. I\nDidn't want to offend anybody\nAnd also in section two it removes and barriers to to becoming a certified nurses assistant and\nBoth the Department of Corrections and the Department of Community Health are supporting the bill all right any questions for Chairman Lehood\nThank you. All right. Thank you\nThen, come on up.\nThank you, Mr. Chairman and committee.\nI'm here today presenting House Bill 306,\nwhich deals with performance contracting\nfor local governments.\nIt's on the bottom of page three, I believe.\nAnd it's provided for performance contracting\nfor local governments and school boards.\nIt has three things in a line's title 20,\nwith title 50.\nProvides a performance contract,\ncan be based off the revenue generation measures.\nAnd then three, just simply defines\nwhat a facility is as in code.\nQuestion from my vice chairman.\nThank you, Mr. Chairman.\nHow long are those contracts in play?\nSo the contract depends once it goes through the bidding process, the local government.\nI mean, it could be a year, depending on the procurement process that the local government\nuses.\nA performance contract could it be extended to like ten years?\nYes, sir.\nBecause it pays for itself over the term of the contract.\nThank you.\nYes, sir.\nAll right.\nAnother question.\nThank you.\nIt's not on the sheet, but House Bill 269 passed out of government oversight on Monday.\nIt's regarding workforce development boards and allowing them to meet via teleconference.\nOkay.\nI'm making note of that.\nIt was supposed to be available.\nThat one's available, just FYI.\n269.\nThank you, Mr. Chairman, members of the committee.\nThank you, Chairman Black.\nYou're good.\nRepresentative Perkel.\nThank you, Mr. Chairman.\nHB51 allows flexibility for school systems in the transport of students,\nallows the student athletes, all student athletes access,\nprotections and best practices afforded by the National Federation of High Schools.\nHB51.\nAll right.\nHello?\nYes, sir, HR 256 is the road daming bill.\nThat is time constraints.\nGot to come over and go back.\nSo HR 256, I think, came through.\nHBC.\nWhen did that come out of committee?\nRoad naming bill, when did that come out of committee?\nThat's HR256, okay, HB607 allows student finance to adjust the ACT composite score to be equivalent to a 1200 SAT score\nregarding eligibility for a zeal miller. Pretty simple, apples to apples bill. Thank you.\nAre you representative you got a just you don't have a white badge on how about the old only old school today sir throwback 37 days and a\nPort hamstring later. I'm glad to be here throwback Thursday. That's right house bill 404 save at home act\nFirst time in Georgia code. It provides a cap on security deposits for four for two months\nminutes. It provides a three-business day right to cure. It provides the\nproperty be fit for habitation and it makes sure that it's clear that during\nthe eviction process you can't cut off the AC. I'm just impressed you get a\nbill out of the house. Barely. Barely. Somebody behind me had to be pushing it\nI feel quite certain. And then I got another one but we'll talk about that for\nanother day. I'm sure that's not on your list today. You can mention if you like\nwhile you're here. Yeah, I have to come back. Absolutely. House Bill 170. That's two things. First,\nit gives us tax parity across the internet with our brick and mortar stores in our community.\nIt's a digital download tax on books, music, art, etc. And then it also has a piece in there about\nallowing a bill that we passed a few years ago to distribute, to deliver alcohol to residents.\nIt would allow a 25 mile radius. All right. Any questions for Representative Carpenter?\nThank you. Appreciate you. All right. The whip. Mr. Chairman, committee member, thanks\nyou for allowing me to present to you House Bill 611. Yes, something on your lip there.\nYou might want to know. You know, this is a distraction. It is for me. I just don't recognize you.\nBut go ahead.\nI'm sorry.\nHouse bill 611 requires that after June 1st of this year, any litigation that the state\nsettles on all those proceeds shall be appropriated by the general assembly?\nAll right.\nAny questions?\nGot a question from Senator Rett.\nThank you, Mr. Chairman.\nThe Chairman wanted me to tell you that just because your bill is the last one on the list,\ndon't take it personally.\nThank you.\nActually, I didn't tell him that I'd take it personally.\nThank you, Mr. Chairman.\nThank you.\nAppreciate you.\nAll right.\nRepresentative Sains, did you have something?\nSenator Harbson, you got something.\nSenator Davenport, did you have something?\n842.\n842.\nThank you very much, Mr. Chairman, and members of the Committee, sorry, I was running late,\nbut I had to be over in the house to get that bill out for the blind for burial.\nAre you here to talk about your study committee, SR-251?\ntwo fifty one eight two fifty one eight forty two eight forty two we\ndidn't have that many we had a lot of study committees we didn't have that\nmany is it a H what's your full number H.B. is it H.B. HR SR SR I know she\ncredit is awful. I mean, um, it's\nconcerning the Rosenwald school. Yeah,\nso it actually passed on a consent\ncalendar for study committees. Would\nyou like to pull that off and vote\non it separately? Okay.\nWell, then you're, you're so\nefficient at got done before you\neven got here. Congratulations.\nThank you so much, Mr. Chair. Yes,\nma'am. All right. Were there any\nAny other, did I miss anybody?\nSenator?\nSetsler, you know, crossever was a couple weeks ago.\nYeah, I'm worried about Mr. Chairman.\nHouse Bill 204 down on your yellow sheet,\nbut it's Representative Jürgen's bill\nthat creates a council of municipal court clerks\nand also accomplishes a bill that did not make crossever.\nOkay.\n204 year, all right.\nHe was here earlier to make sure we're coming to go\nover the rest of them, reiterate all of them.\nIt's your pleasure.\nNah, I hear you talking enough.\nThank you.\nAnd I mean that in a good way.\nAll right.\nSo did everybody speak representative senators\nthat wanted to speak?\nDid I miss anyone?\nI'm looking out in the crowd.\nI don't represent Wade, you good?\nYou want to tell the committee hello?\nAll right, that's enough.\nKeep it down.\nNo, you know, you had asked me about the mercy rule\nand I think the mercy rule kicked in.\nSo I took the scoreboard down out of respect to my,\nwell, I wanted some bills out of the house,\nso I took the scoreboard down.\nI want to jealous build out of the house too, so we just, you know, we're beating them like a drum.\nAll right, like I said earlier, I'm going to go ahead and set the calendar for tomorrow,\nand then when we come in for our final rules committee of the year,\neach committee member will have somewhere between two and four picks.\nand so house members and fellow senators you will need to be lobby in the\ncommittee these are the people that will pick your bills I don't pick bills\nexcept for these 17 them about to pick and but they will be picking so lobby\nthem they will pick your bills they will they will have to prioritize and we'll\ngo from there. So we'll set the calendar from Monday and then on signing die we'll be doing a lot\nof degrees and disagrees and probably picking up whatever whatever's on the table. So that's where\nwe're at. Alright so for tomorrow we're going to have assuming the committee approves we're going to\nto do the budget. Figure that's important. So HB19, HB76, HB80, HB87, HB126, HB128, HB175,\nHB 189, HB 243, HB 309, HB 327, HB 353, HB 383, HB 437, HB 475, HB 475, HB 383, HB 437,\nHB 475, HB 480, HB 529, HB 572, what's that?\nIt's on there now.\n529 and 572.\nOkay. Make sure to miss anything. Okay. What's the will of the committee? I got a\nmotion of de-pass from my vice chairman. I got a second from Senator Albers in\nin Harveston in discussion all in favor say aye all opposed same sign motion\npasses you nameless thank y'all and I will see you tomorrow meeting adjourned\nYou\nYou\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T01:32:29.362486+00:00"
}