{
  "video_id": "6peVTiMdWfU",
  "url": "https://youtu.be/6peVTiMdWfU?t=1627",
  "title": "Georgia House - Day 28 (2026-03-06)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 28,
  "video_date": "2026-03-06",
  "duration_minutes": 265,
  "summary": "Overview:\nThe Georgia House session on 2026-03-06 featured debate and passage of several bills, including legislation related to professional licensing reforms and tracking foreign funding at state universities.\n\nKey Actions:\n**HB 579**: Provides reforms to the state's professional licensing system, including giving the licensing division more authority and allowing boards to focus on disciplining bad actors.\n**HB 549**: Extends the window for law enforcement agencies to seek reimbursement for training expenses when an officer leaves for another agency, from 15 months to 36 months.\n**HB 150**: Requires the University System of Georgia to report quarterly on any funding received from \"foreign countries of concern\" beyond standard tuition payments.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- Rep. Reaves presented HB 579, highlighting how the bill modernizes professional licensing and improves services for constituents and small businesses.\n- Rep. Seabolt presented HB 549, explaining how it helps law enforcement agencies recoup training costs when officers leave for other agencies.\n- Rep. Fleming presented HB 150, which aims to increase transparency around foreign funding at state universities. There was some debate around the scope of the reporting requirements.\n\nVotes:\n- HB 579 passed 158-2.\n- HB 549 passed 164-0. \n- HB 150 passed, but the vote count was not explicitly stated.\n\nAttendance:\nA quorum was present, as all members were called to the floor at the start of the session.\n\nAdjournment:\nThe House adjourned, but the transcript does not specify the exact time or the date of the next scheduled session.",
  "transcript": "if you want to know more about the events in the future, please subscribe to our channel. Thank you very much. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. I am John. All members will please come to the floor. All members, Mr. Clerk, will you ring the bell and let our members know we're ready to get started. House will come to order, Mr. Clerk, will you read a caption to House Bill 5-7-9, 579? I represent a review of the 99th and others to be taught on that to amend Title 43, the Fisher go to Georgia, and say to relay any professions and businesses, so as revised provisions relating to licensure to engage in the practice of a profession, business or trade in this state, this bill haven't been referred to the Committee on Appropriations, not Committee, recommends this bill do pass by Committee Substitute. We represent the Mint Reaves, recognize to present House Bill 5-7-9. Thank you, Mr. Speaker, House colleagues. House Bill 5-7-9 is the product of the Blue Ribbon Professional Licensing Study Committee. I want to thank Chairman Hatchett for co-chairing it with the Senate. I want to thank the majority leader, Chairman Marcus Weedow, Chairman Prince for leading that effort, as well as House-regulated Industries Chairman Powell for working on this issue of professional licensing for many years. What this bill does is it provides better constituent services. It brings professional licensing into the 21st century. It gives what the people of Georgia and our small businesses deserve, which is a better professional licensing system, so that hardworking Georgians and small businesses can get to work and not have to fool around with burdensome regulations during licensing. It also gives the professional licensing division the authority to grant licenses that are in order and it frees up our boards to focus on bad actors. Mr. Speaker, if there are no questions, I yield the well.\n\nNo questions. Thank you. General Masjid of the well is Any objection to the previous question being ordered? Hearing none the previous question is ordered is any objection to redrawing the committee substitute? Hearing none the committee substitutes were drawn is any objection to adopting the substitute offered by the committee on rules? Hearing none the rules committee substitute is adopted is any objection to agreeing to the report of the committee Which was favorable to the passage of the bill hearing none the report the committee is agreed to? Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no in this clerk Will you unlock the machine? Have all members voted All members voted if so Mr. Clerk will you lock the machine? Owned the passage of house bill five seventy nine the yeas are one hundred fifty eight and the nays are two This bill haven't received a requisite constitutional majority is therefore passed Mr. Clerk will you read the caption of house bill five forty nine five four nine? House will five forty nine by represent a sea ball the 34th and others being titled an act to amend code section 35 22 of the fiscal to Georgia annotated relating the reimbursement of training expenses by subsequent employer or peace officer This bill have referred to the committee on public safety and homeland security that committee recommends the disbill do pass Representative sea ball is recognized to present the bill house bill five forty nine Thank you speakers members of the house. I rise today to present house bill five four nine Under current Georgia law law enforcement agency may seek reimbursement for mandated training expenses when a peace officer is trained by one agency and hired away by another Within 15 months of completing that training last year the required mandating training Was was increased by 50 percent from 400 hours to 800 hours and all house bill 459 does it extend the reimbursement window from 15 months to 36 months Ensuring agencies have a fair opportunity to recover their investment in their officers training That is the bill and I'll stand for any questions mr. Speaker And gentlemen has no questions. Thank you. I yield the well The gentleman is yielded the well Is there an objection to the previous question being ordered? Here he none the previous question is ordered is there an objection to agreeing to the report of the committee Which was favorable to the passage of the bill Here he none the report the committee is agreed to shout this bill now Pass all in favor of the passage of the bill will vote. Yes. All those opposed will vote no and mr. Clerk will you unlock the machine? You Have all members voted All members now voted if so mr. Clerk will you lock the machine on the passage of house bill five four nine The years are 164 164 the nays are zero This bill here we see the requisite constitutional majority is therefore passed mr. Clerk will you read the caption of house bill 150 House for 150 boy represented plumbing of the 114th be titled like to amend part two article two chapter three titled 20 of the fish go to Georgia annotated relating the university systems So it's required quarterly reports regarding certain funding receive from individuals or entities related to China this bill have been for the committee on higher education that committee recommends a dispelled do pass by committee substitute We're representing fliming is recognized to present the bill Rept. Tim fliming. Thank you mr. Speaker colleagues. I bring you to today House bill 150 it is the combating threats from foreign countries of concern act for 2025 regarding higher education Foreign countries of concern means a country whose government is designated as a foreign adversary by the United States Secretary of Commerce what house bill 150 does it promotes transparency and foreign funding to our higher ed Institutions in Georgia through the university system to report quarterly to the general assembly and to the governor of any On any funding received from these foreign countries of concern other than simple tuition payments for an individual It requires a university system to track and report the type of funding It's source and it's amount its purpose and the document is its basis mr. Speaker that is house bill 150 and if there are no questions I'd yield the well You have a question to your left representative of mine is recommend for a question Yes Thank you mr. Speaker does it gentlemen yield yes ma'am Why do we always limit these bills to a specific list because sometimes there are some unique circumstances We have to be on lookout for in the state of Georgia So wouldn't it make more sense for the sake of transparency to get a full report on all the possible foreign funding that our Universities are getting so this is a representative this is a moving list so it changes it could change month month week to week With countries coming on and coming off And that's why we're used that language because it's actual list that the Secretary of Commerce Department commerce puts out in updates Pretty regularly does the gentleman for their year. Yes ma'am. Yes. I'm aware of how this list works And my issue with it is that one like you mentioned it does move around a lot which creates uncertainty for creating these types of reports And my concern is that when we are so narrowly focused on just one thing we do risk missing other potential threats So that's that's where my questions. Thank you You know, I have one more question representing Jasmine Clark to your left. Yes, sir Thank you, mr. Speaker does a gentleman yield. Yes, ma'am briefly You know, we had a chat about this in committee and while I understand the premise of this bill My biggest concern is that it may it labels any Individual who lives in one of these foreign countries as a person or an individual of concern And I just have a some heartburn about just labeling anyone who lives in one of these places as a concerning individual Yes, man. We had that discussion in committee through the hearing and it does say in the bill they have to be domiciled In those countries, but in this is not pertaining to tuition So anybody who's playing tuition does not fun is not pertain to it's just for all other funds that are people who are Domasat in those countries, but yes ma'am. Thank you. Thank you. Mr. Speaker out yield the well Gentlemen's yielded the well is any objection to the previous question being ordered period none the previous question is ordered Is any objection to adopting the committee substitute? Hearing none the committee substitute is adopted is there any objection to agreeing to the report the committee Which was favorable to the passage of the bill chair here's none the report the committee is agreed to you. This bill now passed all in favor of the passage of the bill We'll vote yes all those opposed we'll vote no and mr. Clerk where you unlock the machine You Have all members voted All members voted If so mr. Clerk will you lock the machine on the passage of house bill 150 the a's are 145 the nays are 22 This bill haven't see the requisite constitutional majority is therefore adopt therefore passed Mr. Clerk will you read the caption to house bill 288 288 House bill 288 by representative gains the 120th and others to be titled back to a man Are to do chapter six and title five chapter four chapter nine article one of chapter 18 and title 15 And chapter 16 and set of title 17 to the physical to Georgia annotated relating to fellow practice to Claretary judgements prosecuting attorneys and criminal trials this bill have inferred the committee on public safety and homeland security That committee recommends this bill do pass by committee substitute You We're representative Houston gains is recognized to present house bill 288 Thank you name is speaker house bill 288. I believe it's a common sense bill that will provide due process For law enforcement officers when accused by a prosecutor of not being credible or what so being put on So-called a giglio or Brady list Currently a prosecutor can single handedly ruin a police officer's career by putting a cop on such a list with no due process When put on a radio get Brady giglio list Getting a new job for an officer becomes almost impossible because their credibility has been questioned It's important that if an officer does have a real credibility issue That can be resolved and investigated Currently the officer is just placed on such a list and there is no investigation House bill 288 will provide necessary due process for officers by ensuring a review of posts upon an accusation by a prosecutor Which will provide the factual bait which must provide the factual basis for putting an officer on such a list It also ensures an officer cannot be disciplined solely for me putting being put on the list until an investigation Has been resolved and the officer has been found to have acted improperly The bill requires post to be notified and officers employing agency Which would then be required to notify the officer Currently some officers don't even know if they're put on such a list It also ensure the investigation occurs so if the officer does have a credibility officer credibility issue that can be resolved and if there's an officer has done something wrong They would no longer be employed I will know that in its initial form the prosecutors in the state had some concerns We work very closely with PAC to address those concerns I believe we've crafted a piece of legislation That that resolves those issues and and so I also want to say thank you to represent Matt Reeves and chairman Clint Crow Chairman Tyler Paul Smith who worked with us on this several states Have recently addressed this issue north Carolina Highwood Minnesota or just a couple examples And I'm gonna speak I'm happy to answer a question or two if there are any Gentlemen has no questions. Thank you. I speak. Are you the will? Gentlemen as you are the will is there any objection to the previous question being ordered Hearing none the previous questions ordered Is there any objection to adopting the committee substitute Hearing none the committee's substitute is adopted Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill Hearing none the report the committee is agreed to shall this bill now pass all in favor of the past to the bill We'll vote yes all those opposed we'll vote no and miss clerk. Were you locked the machine? Oh Have all members voted all members voted if so Mr. Clerk were you locked the machine On the passage of house bill 288 He is our 146 the nasa 20 this bill here and see the requisite constitutional majority is therefore passed Members I'm gonna take a speaker's Moment here. I have a good friend who just came into the gallery of the house Mr. John William Meeks and his fifth fourth and fifth grade class From down in Wayne County, Georgia the gifted classes here visiting with us today. So let's make them welcome Y'all stand up. Let us see who you are. I'm not going William Thank you members. I asked the folks would be sitting in our seats for too long You're all being safe And this clerk will you read the caption of the house bill 583 583 House 583 by representative glazed the 67th another is to be entitled back to amend code section 42 85.1 of the official go to Georgia annotated relating license plates for certain veterans So it was an increase in number of free license plates issued to certain veterans this bill having for the committee On motor vehicles that committee recommends this bill do pass by committee substitute Representing glazed Are you ready? Ladies recognize to present the bill. Thank you mr. Speaker and my esteemed colleagues Happy crossover day Today I rise for your favorable consideration of hb 583 This bill is just a simple upgrade of recognition and relief to the veterans in our state It is our honor always to show gratitude to all our veterans Today We know that they dedicated themselves in years past serving and protecting this nation Often facing significant challenges sacrifices during their military careers In recognition of those who became disabled while serving This bill will allow them to have a second free Licensed plate which they can use for their spouse Another vehicle or a motorcycle caveat here My husband is a disabled vet And I'm in line behind the motorcycle if this passes to get a tag on my car 40 years. I'm still second This bill is supported by service men women retired veterans disabled veterans Vs old vfw's and other veteran organizations I ask your favorable consideration of this second tag for our veterans Where's the speaker? I yield for questions. You have a question. I don't know. I saw this one coming I'm sure representative hefner to you left Kind of thought she might have a question on this from the ladies recognized Thank you, mr. Speaker. This is the lady yield. Yes Would it not be my honor in my county to be able to advise the constituents that come in and ask Why can I only get one plate when we have two vehicles This will allow that family the same security and they can additionally still receive their handicap placard Thank you for your work, man. The military veteran knows of what she speaks Lady did a great job she has no further questions mr. Speaker I yield the well The lady has yielded the well. Thank you for the bill Is there an objection to the previous question being ordered here in none the previous questions ordered Is there any objection to adopting the committee's substitute here in none the committee's substitute is adopted Is there any objection to a green to report the committee which was favorable to the passage of the bill hearing none the report the committee has agreed to shout this bill now pass all in favor of the passage of the bill Will vote yes all those opposed will vote no and mr. Clarek will you unlock the machine Have all members voted For what purpose does chairman threats rise Oh, mr. Speaker pursuant the house rule 133x base excuse from this bill The gentleman has that privilege is record with so reflect Have all members now voted if so The clerk will lock the machine on the passage of house bill 583 The yays are 171 denays or zero This bill having to be requisite constitutional majority is therefore passed congratulations represent goes Appreciate you You Mr. Clarek will you read the caption the house bill five 484 484 House will 484 by represent a year of the 150 second another is to be entitled an act to amend title 2080 the fish Dakota Georgia annotated relating the general assembly so is the provide for the digitization and electronic publication of the Georgia laws this bill emperors the committee on code revision that Committee recommends that this bill do pass Represent your to your recognized present house bill 484 chairman your Thank you mr. Speaker Today I bring you house bill 44 which is for the Georgia law books Which are the tan books in your office rather than the black code books What this bill does is is allow The books to be published in the either hard copy form or digital form and maintaining the digital option can improve Accessibility to everyone and it's also important that This becomes law because it's often difficult to find a cost effect to publish through these days So I asked for your favorable consideration on on this bill You know Gentlemen has no questions I yield the well. I'm as yielded the well. Is there an objection to the previous question being ordered Hearing none the previous questions ordered Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill Hearing none the report the committee has agreed to shout this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed real vote no and mr. Clerk were you in lock the machine You Have all members voted Have all members voted this so mr. Clerk were you locked the machine Older past of house bill 484 the yeas are one seventy three the nays or zero this bill haven't received the requisite constitutional majority is therefore passed Mr. Clerk were you read the caption to house bill 529 House will 529 my represent a bearer to the 24th and others to be a tile an act to a man title 13 the fish go to Georgia annotated relating to contracts So to provide consumers with the option of having service contracts that contain automatic or renewal provisions terminate This bill ever for the committee on that culture consumer affairs that committee recommends this bill do pass by committee substitute You Want to recognize a majority leader for a motion on this bill on House Bill 529. Why does the gentleman, what's the first purpose of the gentleman rigs? Make a motion. State your motion. Mr. Speaker, I move the House Bill 529 be recommitted to the rules committee. Just clerk where you read the caption. House Bill 529, my revs and I bear to the 24th to be entitled, not to amend title 13. The fish go to Georgia, annotated, relating to contracts. It was to provide consumers with the option of having service contracts to state automatic renewal provisions terminate. Own the gentleman's motion and the House Bill 529 be recommitted to the rules committee. Is there objection? Here, none is awarded. Mr. Clerk, as you read the caption, the House Bill 53530. House Bill 530, my revs and I've levered to the 123rd to be entitled, not to amend Article 4, Chapter 9, the title 15 and the fish go to Georgia, annotated, relating to time, place and procedure. So it's a revive for the authorization for the electronic filings and pleadings and probate court, this bill, I've heard the committee on duty to share that committee recommends this bill do pass. Chairman Leveritt is recognized to present the bill. Have you presented this one the last two or three years? Is this the first time? No, Mr. Speaker, this is the first time. Oh, right. I just want to ask you to recognize. The second is the House Bill 530 simply authorizes electronic filing in civil cases and probate court. It's the statute is based on the one that I think this body passed several years ago for electronic filing and spear court. The statute addresses limitations on the vendor and what they can charge and what they can charge for. People that they have to allow to file without charge and those kinds of things. The council probate judges has requested it and it just requires that they be ready by January 1 of 2028. So they've got some time to prepare and get ready to implement the system. And that's all that the bill does, Mr. Speaker. And I'll be glad to ask her and answer any questions. And gentlemen, has a question to your left representative Evans has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Isn't it true that we both love our probate judges so much and we both hope that this bill passes unanimously? Yes, that is true. I'm so delighted to hear that's true. Thank you. The lady had me nervous for a minute. Thank you, Mr. Speaker. And gentlemen, has no further questions. Ladies and gentlemen, I want to thank you again for your support and since the give blue is quote, the other day went so well, I've got two more for you today. I want to thank each and every one of you for having extinguished yourselves during this session of the legislature. And my favorite one, this is unparalleled in the state's history. Back in IU de Well. I don't think you were authorized to do that, Mr. Chairman. But since I was paralyzed, I guess you could. Gentlemen, you're the will. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee has agreed to. Shout this bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? No. Have all members voted? have all members voted if so, Mr. Clerk, were you locked the machine? On the passage of House Bill 530, 530, the yeas are 174, the days are zero. This bill, Henry C, the requisite constitutional majority is therefore passed. Members, any comments? Representative Panich, Mr. Clerk, were you read the caption of House Bill 460, 460? House Bill 460, by Representative Panich, the 51st and others, to be entitled, an act to amend Code Section 245, 501 of the fish, go to George Amintet, relating to certain communications of privilege, so it's to exclude from evidence certain communications made between an attorney and client when the client is in a penal institution. This bill ever heard the committee on Judiciary Noun, similar that committee recommends a disbilled do pass by committee substitute. Representative Panich, is recognized to present the bill. Good afternoon colleagues. This is a simple bill and it's something that many of us already thought was the law. While a client is in a penal institution, the Sheriff Law Enforcement cannot record the conversation between a lawyer and their client. It is a sacrosanct privilege and one that we need to make sure is now codified into law. The prosecutors and the sheriffs have no objection to this bill. I yield for any questions. Lady has no questions. I think, briefly, for mine, her button may be pushed, but I won't say it or desk. This unstuck now. Lady has no questions. Lady Gielder the well. Is there any objection to the previous question being ordered? Here in Noun, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in Noun, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in Noun, the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? To what purpose do you represent in Roberts' eyes? Parliamentary inquiry. State you inquiry. Isn't it true that we somehow miss that this is representative Pannitch's first bill? And we, I think, were a little too... Oh, it's not? You said it was? Yeah, it is. And I think we are a little too easy on her. I saw that him burglar outside, so Representative Pannitch came in and burglarized the well there and got out. I'm going to ask the representative to come back up and join me up front. Just... I knew that, Mr. Clerk. She eewed at the well. I'll get her back up here, don't worry. Oh, there she is right there. Now you've eewed at the well, so I'm afraid I can't do it, but you'll pay for it.\n\nI know rules were made to be broken, but I'm not going to break this, Mr. Whip. The ladies, you are the well, have all members voted. It's getting closer all the time, have all members voted. So, Mr. Clerk, will you lock the machine? Thank you. This bill, having received a requisite constitutional majority, is therefore passed. The representative, Panich, you pulled a fast one on the speaker and he won't forget it either. I can go in and tell you that now. Mr. Clerk, will you read the caption of House Bill 647? House Bill 647 by Representative Donald Tucci, the 105th to be entitled and act to amend and act to incorporate the City of Mulberry. This bill, having been preferred to the Committee on Intergovernmental Coordination, that committee recommends that this bill do pass. Representative Donald Tucci has recognized to present the bill. Representative Donald Tucci. Thank you, Mr. Speaker, members. Thank you for hearing this bill today. This bill is about annexing 45 small parcels into Mulberry. All of these parcels are in my district. My background is in land use. I served as a county planning commissioner. When I was running for office, one of the most frequent complaints raised by voters to me, besides inflation, was the issue of growth in Winnett County. Specifically, high density apartments and the rapid pace of growth and overburdening local infrastructure. The City of Mulberry was born out of this frustration and the request of the people giving citizens within the city local control over planning and zoning. Now that I've been elected, I can do something to help give my constituents more control over growth in our community. This annexation bill simply allows the City of Mulberry to expand into my district adding roughly 45 parcels to the city limits. These parcels are a mix of residential dwellings, commercial properties, and undeveloped land, primarily located along one road on the north end of my district. Using these parcels into the City of Mulberry will allow my constituents to have a greater local voice over how this land is developed and used in the future, allowing decisions to be made by five locally elected city councilmen rather than the majority of county commissioners who do not live in the community. Mr. Speaker, I yield for any questions. You have one question to your right right up the center aisle representative gamble. This recognize for a question. Thank you, Mr. Speaker. Does the General Lady yield? I do. Just for clarification, the City of Mulberry doesn't have anything to do with the Palmetto Berry, does it? It does not. All right, thank you. I think this is the first time I've seen the lady in the well, I believe, isn't it? No, no. That's not the first time I've seen just checking. Representative Washburn to your left has recognized for a question. Way to your left. Thank you, Mr. Speaker. Yes. Will the General Lady yield for a question? I do. Is this your first time in the well to present a bill? It is my first time to present a bill, yes. Okay. Will you yield for another question? I do. Are there any Mulberry bushes in the City of Mulberry? There used to be. Thank you. We're going to take a couple of lady, couple of questions for the lady from Mulberry. And then we have a couple of folks that want to speak to the bill. No, let's see. Chairman Steven is recognized for a question. Thank you, Mr. Speaker. Way over to your left. Is I recall Barney Fife is from Mayberry? Is that not true? Does he live in your town? He used to. Uh-oh. Does the General Lady thank you? Thank you. I think he was all through the bill last year. But lady, yield for another question? For one more, Mr. Speaker. Representative Martin to your right. Form a mayor of a small city. It's going to be a big city as recognized for a question. The lady, you know, I do. Is the chair, I appreciate the questions and them kidding you a little bit about the name of the city. But this is a serious question. Isn't it true what the lady is trying to do is bring government closer to the people? And you can do this without an increase in their taxes. Yes, it is. Thank you. Mr. Speaker, are you yield the well? Lady proceeds like a veteran. She's risked. As you are the well, good move. So we do have a couple of folks to speak in opposition. I'm going to give them seven minutes each to speak to the bill. Up to seven minutes. You don't have to take that long. Representative Jasmine Clark is recognized for the bill. Is recognized to speak to the bill. HB 647. Give the lady your attention, please. Good afternoon colleagues. Today I rise in opposition to House Bill 647. As the chair of the Gwyneth delegation, my concerns about this bill are based on procedure and precedence. Let's be clear, House Bill 647 is a hyper local bill that annexes certain county properties into the city of Mulberry. If you remember, the city of Mulberry was created when the city hood process that normally takes about two years was expedited through this chamber and took only 20 days in the last legislative session. To the objection of the majority of the Gwyneth delegation. During the debate, we stated that when you rush the process, it will lead to issues and alas, here we are. Less than a year later, and we are seeing bills that try to annex additional properties. And hey, I get it, annexations happen. But in Gwyneth County, we have a very specific delegation process in order to maintain the integrity of the local legislative process. And we have successfully used that local process for other annexations, including this year, where we are doing some annexation in the city of Lawrenceville. Our process is quite simple. The city and the county go to the table and negotiate about the properties to be annexed when negotiations are complete. To meet the city and the county, notify the members of the delegation, legislation is drafted by legislative counsel, and then in a bipartisan manner, a majority of our delegation members sign the bill. It then goes through the local legislation process of the intergovernmental coordination committee. This process works, it has works, and it recognizes that while bills must come through the legislature, we respect our local government and will not force things down their throat. Moving this very local bill as a general bill through this body in an effort to skirt the rules that both Republicans and Democrats signed on to. And let me be clear, I have placed Article 3 of our delegation rules on everyone's desk for you all to see in Section 3, we specify how annexations are supposed to be done in Gwyneth County. We had a majority of our delegation, including the sponsor of this bill, sign on to these rules. So a vote, yes, on this bill is a vote against local control and local government. It basically states that you are okay with the state going behind your back, snatching up properties from your county without allowing you to even come to the table. I sincerely believe that most of us do not want that happening in our counties. Let's protect the integrity of the local delegation process, vote no on this bill so that we can actually do this process the proper way. And with that, Mr. Speaker, I yield the will. The lady is yielded the will. We'll park, we'll represent Sam Park is recognized to speak to the bill. Representative Park. Thank you, Mr. Speaker. Colleagues, I rise in opposition to House Bill 647. You know, I think it's important, especially in the political environment, to remember the importance of the rule of law. We are a nation. What's made us great as a nation is respecting the rule of law. And yet this bill demonstrates that might makes right, which is unfortunate. Now, I rise today to speak against House Bill 647 for the following reasons. As public servants, our duty is uphold the interests of our constituents and ensure government serves them, not the other way around. This bill, which seeks to expand the corporate limits of the city of Mulberry, and there's two or three additional Mulberry-related bills because the process was not followed. The rules of government affairs committee was not followed with respect to creating the city of Mulberry. Through annexation, this raises serious concerns about property rights, taxation, and government overreach. First and foremost, we must protect private property rights. This is one of the foundations of our democracy, which is the right to own and control property. Yet this bill proposes to annex numerous parcels of land, and we must ask, have all affected property owners been consulted? Has there been a local ad notice provided for this legislation? Are we respecting their right to choose how their land is governed and whether or not they want to be forcibly annexed into this new city? That's resulted in litigation and unnecessary fights that's divided and exacerbated partisan flames unnecessarily. This bill represents an unnecessary expansion of government power. We should be focused on reducing bureaucracy, not expanding it, not forcing an additional layer of government on people without their consent. We cannot ignore the financial consequences of this annexation. With expanded city limits come increased taxes, municipal fees, other hitting costs that will be passed on to homeowners and small businesses again without their consent. Many of our constituents are already struggling to keep up with the rising costs of living. Why add to their burden? Our job is a fight for lowering costs and for responsible spending, not imposing unknown and uncertain financial hardships on working families. Now zoning and land use regulations are another major concern. When a city annexes property it imposes new zoning restrictions and land use rules. The government will now be subject to different regulations potentially limiting how property owners can use their land. Again, these property owners have no opportunity to voice whether or not they want to be included or excluded in this city. This is a state government forcing upon the people of Georgia a decision which they have no notice or opportunity to decide upon. This is also weekends, county governance and local control. When that county has managed these areas effectively and there is no clear reason why city oversight would be an improvement. When that county is one of the few counties, the second largest in the state of Georgia that has a AAA bond rating. Where is the written documentation and again an opportunity for voters to determine their own future with their homes, with their own property? So where does it end? If we approve this annexation we open the door for another and additional forced annexations, forced city expansions without the consent of the government, more state government overreach and disruption for affected communities. Now I am a member of the minority party and hopefully that won't be the case all the time. But I want to ask members of the majority what would you do if you were in the minority and the state government forcibly annex parts of your district that you represent? That's what this is about. We must consider the long term consequences of setting this precedent. Finally and I think most importantly, we demand transparency and voter input. The residents of these areas will not have an opportunity to vote on this change. Does this legislation have a referendum? No. Then this process fundamentally lacks democratic legitimacy. We should not be making decisions that fundamentally alter the governance of a community without ensuring that the people have had their voices heard. So again, colleagues, House Bill 647 is not just about adjusting city limits. It is about standing up for property rights. It is about standing up for fiscal responsibility and the principles of limited government. It is ensuring that we are a nation of rules and we demonstrate that as leaders with our actions rather than perpetuating the falsity that might make right, the falsity that if you and the majority, you can do whatever you want because you have the votes. So for all of these reasons, I urge all members in this body to vote no to House Bill 647. Let's stand together and defense of common sense American principles and responsible governance. Thank you, Mr. Speaker. I yield the well. Thank you, Mr. Will. The gentleman is yielded the well. Is there any objection to the previous question being ordered? Here he none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here he none the report the committee has agreed to shall. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted. All members voted if so. Mr. Clerk, will you lock the machine? All the passes of House Bill 647, yeas are 98 and yeas are 76. This bill having to see the records of constitutional majority is there for passed. All right, here's our posture of members. This House is going to stand in recess until 3.30 p.m. today. Thank you all can. Mr. Chairman, I'm going to recognize you. You think you can get your work done by 3.15? That would be better if you can. Okay, let's revise that plan. Best lead plans of my cement. Will this House would be back in action at 3.15.315. Rules chairman is recognized for an announcement. Rules chairman recognized for an announcement. Give the gentleman your attention. Thank you, Mr. Speaker. I'd like to form the rules committee. We're going to be having a rules committee meeting at 3 o'clock. 3 o'clock. See you in room 341. Thank you. Rules committee at 3 o'clock. We're back here to go back to work at 3.15. This House will stand in recess until 3.15. Thank you.\n\n\n\nHouse will come to order. House will come to order. Mr. Clerk. You will you read a caption to House Bill 370370. House will 370 by represent of gains of the 120 and the Senate. The bill is to be entitled to an act to amend Code Section 48534. The district will be entitled to join the law and property tax bill for any school district that is outside of the state wide base year. Home state exemptions state the total amount of the school district reserve funds. The committee recommends that this bill do pass by committee substitute. House bill 3703. Members will give your attention to the gentleman in the well. Thank you, Mr. Speaker. House bill 370 is a taxpayer transparency piece of legislation. When sure if a local government, whether it's municipality county or school board voted to opt out of House bill 581, the constitutional amendment that the voters overwhelmingly approved in November, that passed in all 159 counties in this state. And you name it almost unanimously approved by this body and by the Senate. If they opted out of House bill 581, they would have to put on property owner's tax bill that that local government, specifically the board, either the county commission school board or otherwise voted to opt out of home under tax relief, the date of the vote and the phone number, the concerned, concerned citizens can call to share feedback on that decision. Additionally, any school system that voted to opt out would have to include how much money they have in cash reserves and how much they have in reserves per student. Many of you may have recently seen that our school systems across the state have $6.5 billion in reserves. And at the same time, many of them are opting out of homeowner tax relief. And relief that I'll note that it's important to note, I think this is not going to decrease revenues. Instead, it would slow the growth in revenue. And again, it's common sense legislation that will help homeowners across the state so they can know how much limit the increase in their assessed value of their homes. And so, Mr. Speaker, that's what the bill does. Also, I do think it's important to note that any local government that already has a similar home set exemption or if they have a 100% senior exemption will be exempt from this piece of legislation. Mr. Speaker, I'm happy to answer any questions. Gentlemen, has a question. Then we do have a speaker on the bill, then, suppose. To your left representing park, Canada is recognized for a question. Thank you, Mr. Speaker. Do you? I do. I'm concerned about the language related to reserves. Can you speak to that? Because school systems are supposed to hold a certain amount in an account. And it might be misleading to make them write that amount as if they're just holding and stockpiling that. So can you speak to the reserves, please, please? Be happy to. And I do think we've seen, and I actually have the statistics right here for every single county in the state, how much money to have in cash reserves. Over the last five years, the amount of reserves has doubled for our school systems combined. And so certainly I agree. I think there's an appropriate amount. But when you've seen, when you see $6.5 billion statewide in reserves, I certainly think that property owners and homeowners would find that to be unacceptable when they're opting out of simple homeowner property tax relief. Do you further yield? Sure. So to just put some data to it, you said you have all the school systems there. Can you speak to Atlanta Public Schools? How will this impact? What amount is an APS going to be told that they have to put on the notices with the understanding that some of that they should have in there? Sorry, I'm scrolling through all of our school systems here real quick. So Atlanta Public Schools has 258 million in reserves. Pretty significant number. That's over $5,000 per student. Thank you, Miss Speaker. I'll yield the well. Jim was yielded the well. We have one member signed up to oppose that is supposed to this bill. I'm going to recognize the representative Barry. Can you get two yours in about five minutes? Gentlemen has up to five minutes. Representative Barry's recognized. Thank you, Mr. Speaker. With respect, I rise today in support of local control. That phrase is thrown around often this chamber yet is not always loved up to. This two page bill presents itself as simple and it is a simple bill to bully school districts. A simple bill that ignores the gross underfunding of our schools. A simple bill that ignores the fact that today is the 40th birthday of the QBE formula that isn't working on 2025 standards. This is a simple bill that is not a real solution to support our local districts and is misrepresenting why local districts may opt out of the home to exemption. Our schools are underfunded and the consequences are dire. This is not an abstract issue. It is a reality that affects all our children's education, our community's economic prosperity and our state's future. The root of this crisis is simple. A lack of sufficient state funding and an outdated funding formula that has failed to put the needs of modern education. Because the state fails to provide adequate funding, local school districts are forced to rely on property taxes to take the difference. This creates a system of inequality where wealthier districts with higher property values can provide more for their students, while poorer districts struggle to keep up. This is not just an education issue. It is an issue of fairness and opportunity and every child regardless of where they live deserves access to a high quality education. But when districts are left to thin for themselves due to inadequate state support, those in less affluent areas suffer the most. Yet instead of a addressing the root issue, we expect the shame districts for having a reserve of funds, funds that by law, they are required to maintain. The book is not acknowledged that districts hold reserves for a reason to prepare for emergencies, economic downturns or unexpected costs. Requiring districts to disclose these reserves on tax bills doesn't just create confusion for tax payers. It opens school districts up to financial scrutiny that can be weaponized against them. It invites bad faith attacks from those who want to claim that schools are hoarding money when in reality they are still trying to survive in a system that underfunds them year after year. Furthermore, this bill assumes a one-size-fits-all approach disregarding the fact that each district has unique financial needs. Some districts may need larger reserves due to volatile local revenue streams, while others may be preparing for future infrastructure projects. Instead of bullying districts for finding ways to keep lights on, I challenge this body to do the right job. The time to act is now. Education funding is not an expense, it is an investment. And investment in our children, our economy, and our future. We must demand that our state provide the funding necessary to give every child the opportunity they deserve. Let's stand together and fight for the future of Georgia schools, rather than increase the burden on local districts to raise property taxes in the first place. Thank you, Nia Udawal. In general, as you order the well, there is no further speakers on House Bill 360. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Yes, all those opposed will vote no in Mr. Clerk, will you unlock the machine? Have all members voted to what purpose is representative Wade rise? Parliamentary inquiry. Is it not true that this body with bipartisan has fully funded QBE and the last several budgets since I've been serving in this body? And that we have increased teacher pay to the highest in the South Eastern United States. And does this also recognize that schools, boards, counties and cities still have the ability to raise their milled rate if their needs exceed that of their assessment growth for their total digest? Is that not true, sir? The gentleman knows what he speaks, he comes from that life of that management before he came here. Have all members now voted if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 370, the yeas are in 96, the nays are in 77, this bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption of the House Bill 360, 360? House Bill 360 by frustration of the 104th to be entitled to amend Article 2, Chapter 7, in Title 48 of the Fish and Coded, Georgia, and it's an inter-related income tax infecation rate, computation, exemptions and credits. So as it revise a tax credit for the rehabilitation of historic structures. This bill let them further the committee outweighs and means that committee recommends a disbilled do pass by committee substitute. The representative of the administration has recognized to present the bill, Mr. Leader. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring to you HB360 designed to jumpstart development in downtown Atlanta in 2025 and 26. Prior to the World Cup beginning in June of next year, many of you are familiar with the Georgia Historic Rehabilitation Tax Credit, which has long supported the revitalization of historic structures by encouraging private investments in historic buildings. This legislation will encourage the development of downtown Atlanta through historic projects from those who are currently in line to receive the historic tax credits over the next few years. If in these developments they're able to obtain a certificate of occupancy, that's complete their projects by 2026. And important to note, this does not increase the cap on the historic tax credits. I'd ask for your favorable consideration and Mr. Speaker, I'm happy to answer any questions. The gentleman has no questions. You'll do well. The gentleman's yielded the well. Is there any objection to the previous question being ordered? Here in none of the previous questions ordered. Is there any objection to adopting the committee substitute? Here in none of the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none of the report, the committee has agreed to shout this bill now passed. All in favor of the passage of the bill. Will vote yes, all those opposed. Will vote no. And Mr. Clerk, will you unlock the machine? No. No. No. Have all members voted. All members voted yes, so Mr. Clerk, will you lock the machine? On the passage of House Bill 360, 360.\n\nThe yeas are 168, the nays are three. This bill, Henry C. The rec was a constitutional majority is therefore passed. Is this your first bill? Yeah. Two of our female members tricked me. So I wanted to make sure I thought I remember your face. Mr. Clerk, will you read the caption of the House bill 494-494? House bill 494 by representative McLean of the hundred and ninth and others to be entitled back to a men part four of our thirteen to chapter six and total forty. The fiscal to Georgia annotated relating the moped so it's required moped to be covered by a form of minimum financial responsibility for accident damages. This bill I remember the committee on motor vehicles that committee recommends a dispelled do pass. Representative, this is about moped. Do you have a moped? I was wondering about that. I'll let you explain. Representative, do you McLean is recognized to present House bill 494? Thank you, Mr. Speaker and colleagues. I do have a real simple bill on moped. Moped is. You know, the reason that six years ago I got this, I received this from one of my interns, Michael Richards. Michael is probably watching a lot of y'all know Michael, but he was coming to the Capitol and what happened he was re-ended by a moped. And when he was re-ended everybody was okay, but that's that's Michael's car right there. And it was twenty five hundred dollars worth of damage on that vehicle and he had a five hundred dollars deductible college kids, parents gave him the vehicle. And the reason I said that was because he had to pay all of it. He had to pay the five hundred dollars deductible one, two. He also had to get his car fixed and then three, I think his insurance rates went up. But it is a real simple bill. It says, no person shall operate a moped upon the highways of this state unless such moped is covered by a formal financial responsibility, which provides for the ability to respond and damages for liability on the count of accidents and the amount specified in a sub paragraph of code section 33.7.1.1. And early today I did put on your desk there are twenty five states right now that do have a moped insurance. Of those are red states, there was a blue states, you know, I wanted Alabama, California, Illinois, Mississippi, Mississippi, Alabama. Did I say that already? Okay, I'm sorry, Miss New York, Burma, Texas, Washington, Alabama, Mississippi. I just want you all to know Oklahoma, Oklahoma, Oklahoma. Miss Speaker, how did you know about that? You got it too. But yes, including Oklahoma where I'm from, it also has this. So all I want you all to know is is that this will help a lot of the, there will help a lot of citizens enjoy. So with that, I'll be happy to speak our actual your favor support of this legislation. I know I've had some comments and I want to make sure that I'm here to answer any questions that you all may have. I can answer. So Miss Speaker, I'd be happy to take any questions. You have a dozen or so. Let's see how it goes. Reps. A reminder has been angiously mentioned her button to the right of ladies recognize for a question. Thank you, Mr. Steehrens, Jim and Neil. Yes, I do for my sweet mate. Thank you. So I actually had two questions. The speaker took my first one. But for our second question, we were wondering, can you explain the difference between a moat pad and a motorcycle? Okay, a motorcycle is a lot faster than a moat pad. I mean, I mean, gentlemen, knows the boy he speaks. What can I say? You have another very well-versed member who would like to ask questions. I'm representing Jason Heriddly to your extreme right over here. Gentlemen, recognize. Thank you, Mr. Buckingham. Jim and Neil. Yes, I do for my something. It's funny. My wife describes me the same way. Does a moat pad have pedals? Some moat pads have pedals. That's the reason that you have the word moat head because it's like moat pedals. But then the scooter, but the scooter part of the moat head is not. It has a flat area. All right. Let me ask you this. If I'm on a bicycle and I'm making motor noises, is it considered a moat pad then? No, that's considered noise on a bicycle. Thank you. Gentlemen, you go for a couple more. This is something I know a lot about so I can stay here all day. Well, this gentleman is down on the farm. He makes no, he weighs. I don't think he wants to get involved. This is a more urban question. I think where these things are around. I think the gentleman Martin is recognizing us for a question. Jim and Neil for a question. Yes, I do. Isn't it true what you represented there to us was you were worried about if something hit the car from behind like that and did some significant damage, it needs to be insured. Is that right? Yes, I do, Mr. Chairman. In fact, the problem I think we have a lot of is a lot of uninsured, I guess uninsured motorists, hitting and having damages and you becoming liable and you paying. I understand. Isn't it true that you know, I think once upon a time you play a little football here and linebacker I think. Yes, yes, but yes, it's a big, I had an influence. And isn't it true that I think if you had a car from behind walking down the road, you'd make significant damage. I'm just wondering if we got to get you injured. Mr. Chairman, that's what I had insurance. Yes, I got paid for all my violence. Yes, sir. Thank you, Mr. Chairman. Mr. Speaker, if there's no other question, I do ask for a favorable support for this and I know Mike is watching and he's in Maryland watching. So, Mike, we've taken, we've taken Mike's car down, but thank you all and Mr. Speaker, I do yield a well. Thank you, Representative McLean. We had a little fun, but this is serious and could cost some money some dollars, so we appreciate you bringing the bill. Gentlemen, you're the will. Is there any objection to the previous question being ordered to chair? Here's none. The previous question is ordered. Is any objection to agree to the report of the committee, which was favorable to the passage of the bill. Here he known the report of the committee's agreed to shout this bill now passed. All in favor of the passage of the bill, will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? For what purpose is represented McLean, rise? All men in the quarry. If you can't ask for them, I know I can't. My goodness. The state's inquiry, sir. Mr. Speaker, is it true that this, that by voting yes on this bill means a lot to a lot of Georgia citizens? I know the gentleman knows of what he speaks. We appreciate him bringing the bill. Have all members now voted? All members voted if so. Mr. Clerk, will you unlock the machine? On the passage of House Bill 494, the yeas are 160, the nays are 14. This bill hasn't received it. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read a caption of a group of privileged resolutions? Recognizing and commending Reverend Schirren L. Geter, recognizing commending Dr. Constance Levant Abbott, congratulating commending Catherine Hardrich for receiving the 2025 Yellow Rose, Nicky T Randall Service Leadership Award, recognizing commending Maurice Davis, owner of JMR Tires, Southeast Atlanta for his outstanding contributions to his community, recognizing commending Larry Campbell in corners outreach, recognizing commending Joana Cacito, recognizing commending Araceli Barrentios, commending the Title I parent centers of the mental Creek cluster and the parental instructional coordinators, commending four corners primary care centers, recognizing and commending the contributions of Leslie Palomino, recognizing and commending Dr. Young Ha Kim and the community resource corporation, and for other purposes that completes the reading of the privileged resolutions. Is there any objections to adopting the privileged resolutions? Here in none the resolution are adopted. Members, we have our supplemental rules calendar. It's just coming out on your desk right now. There are two bills that will be rules, substitute that will be on your desk. We will not call them until they're all on your desk. Members, while everyone's in the room, I'm going to recognize the, we're still in the rules calendar, but we're going to take a little side track and recognize the chairman of appropriations, chairman Hatchet, for announcement while everyone's here. Thank you, Mr. Speaker. The appropriations committee and their subcommittees will be meeting at 9 a.m. Monday morning in room 341. We have a very important piece of legislation to get out of committee. We have the FY 26 budget. We need even good a break from you and you guys working again on the budget. Sounds good. Mr. Clerk, will you read a caption to House Bill 614. House Bill 614, a representative Jones of the 47th and others to be entitled to amend Code Section 2510 to the Fish Dakota Georgia annotated relating to prohibited fireworks activities. An application of noise ordinances, as authorized local governments prohibit the use or ignition of consumer fireworks in the proximity to certain facilities, housing, equines, bill having referred to the committee on agriculture and consumer affairs. That committee recommends that this bill do pass. The proteam of this house, representative Jan Jones is recognized to present House Bill 614. Thank you, Mr. Speaker. This bill is a little bit of a departure for me, but I would appreciate your favorable consideration of House Bill 614. It would allow a city or a county to adopt a local ordinance to prohibit fireworks within a hundred yards of a commercial facility housing equines in a confined area. It would help to mitigate the deleterious effects of loud, sudden noises on horses which when spooked oftentimes run in defenses and have to be put down. It's particularly a concern for our suburban and ex-urban horse farms that are being crowded out by growth. And in code already, there are about 17 uses that have the same hundred yard restriction. This would add another restriction to that list, but it would be the only one that requires passage of a local ordinance. I did that so that it would not affect the rest of the state unless your city or county found this to be an issue and chose to put it in place. That's what the bill does. I'm happy to answer any questions. The lady has no questions. I appreciate your favorable consideration. Ladies, you, the well, is any objection to the previous question being ordered here in none? The previous question is ordered. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill here in none? Report the committee's agreed to. This bill now passed all in favor of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted this so, Mr. Clerk, will you lock the machine? On the passage of House Bill 614, the yeas are 168. The nay is won. This bill here in the seat of the records of constitutional majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 513, 513? House Bill 513 by Representative Lehu to the 175th and others of being titled an act to amend Article 2, Chapter 70, Title 36. The fiscal to Georgia annotated relating service delivery, so as to revise provisions related to the county share of funding for joint funded county wide services be borne by unincorporated residences. Bill ever further, the committee on government affairs, that committee recommends this bill do pass. Chairman Lehu, it is recognized to present House Bill 513. Thank you, Mr. Speaker. And members, I bring to you House Bill 513, which is, I described this as a clean up bill to House Bill 1407 from last year that updated the service delivery strategy for the cities and counties in the state to negotiate every 10 years on how they will deliver services to their citizens. So what this simply does is clarify, this came to me from ACCG and GMA. They are all in agreement, and this just clarifies the sources of revenue that counties can use to service unincorporated areas. Mr. Speaker, I'll take any questions. If there's none, I'll yield the will. The gentleman has no questions. The gentleman has yielded the will. Is there any objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill hearing none the report of the committee's agreed to. The next bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no, Mr. Clerk. Were you in lock the machine? Have all members voted? All members voted. If so, Mr. Clerk, were you in lock the machine? On the passage of House Bill 513, the yeas are 169s. 169, the nays nay is one. This bill hearing see the records that constitute majority is therefore passed. Mr. Clerk, were you agreed to caption to House Bill 250? House Bill 250 by Representative Taylor, the 173rd to be entitled back to a men title 33 and 34 of the EFG to Georgia annotated relaying the insurance and labor and industrial relations respectively. So it's a provide for the registration regulation and professional employer organizations. This bill I'm referred to the small business development committee that committee recommends this bill do pass by committee substitute. The lady from Thomasville representative Darleen Taylor is recognized to present the bill. Chair Lady Taylor. Thank you, Mr. Speaker. Thank you committee. Thank you folks. I'm excited today to bring you a very good bill. This is House Bill 250 and it concerns professional employer organizations. These are very helpful to small businesses. These organizations do not currently have any oversight. And these companies are like a staffing firm. They do a lot of things to provide small companies with benefits that they can't usually afford. They're like their HR departments. The variety of services they provide are things like a payroll and they provide tax remittance, retirement plans and purchasing insurance through a larger organization helps them be able to afford it. This bill sets the foundation and rules for them and they'll be regulated now under the insurance commissioner. The only concern that was in the committee had to do with workers compensation and that was all removed. So there's no reference at all to workers comp in this bill. I would ask for your favorable consideration. Ladies, no questions. Thank you. Ladies, you're the well. Is there any objection to the previous question being ordered here in the previous questions ordered? Is there any objection to adopt in the committee's substitute? Here in the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the under the board of the committee is agreed to shall this bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no, Mr. Clerk. Will you unlock the machine? Have all members voted? Oh, I got you. Take it down. All members voted if so, Mr. Clerk. Will you lock the machine on the passage of house bill to five? Excuse me. 250, 250 of the yeas or 165. The nays are seven. This bill Henry see the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of the house bill to 2424? House bill 224 by Representative Bono. There's 73rd. The 73rd and others to be entitled. And act to men chapter one of Title 32, the physical to Georgia and Tate relating to general provisions relative to highways, bridges and fairies. So, it's authorized the construction or maintenance of roads upon military bases or installations by the Department of Transportation. This bill I refer to the committee on transportation. That committee recommends a dis bill to pass. Chairman Bono is recognized to present the bill. Thank you, Mr. Speaker. Colleagues, to bring you house bill 224. This is a measure that was brought to us by the leadership of Fort Stewart. This would simply allow the state, the Georgia Department of Transportation through the state of Georgia to enter into a regional intergovernmental support agreement with the Department of Defense so that the DOT could do work on our military installations in Georgia. This will allow work to be done that much more efficiently and will also allow state vendors to do that work. That's the bill, Mr. Speaker. I'll be happy to stand for any questions. Gentlemen has a question to your left representative, Hethner, to recognize for a bill for a question. Thank you, Mr. Speaker. Does the gentleman, you? I do. Is it not true that my first duty station was forced to a Georgia sir? The lady knows what she speaks. Thank you very much for bringing this bill. Thank you. With that, Mr. Speaker, I'll yield the will. Jim was yielded the will. Is there any objections to the previous question being ordered? Here he none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here he none the report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill. Will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. All members voted if so. Mr. Clerk, will you lock the machine on the passage of House bill 224. The yeas are 172. The nays are zero. The bill has been received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to House bill 161. 161. House bill 161 by reps and a crow of the hundred and eighteen. The others to be entitled an act to amend article one and chapter three, title 35. The official go to Georgia annotated relating to general provisions relative to the Georgia Bureau of investigation to provide for the authority to issue subpoenas of electronic communication records for purposes of investigating certain crimes related to cyber enabled threats to life and property. This bill then refer to the committee on judiciary non-civil that committee recommends a dis bill do pass by committee substitute. The clent crow is recognized to present the bill. Mr. Chairman. Thank you, Mr. Speaker. Colleagues, this is House bill 161 on behalf of the Georgia Bureau of investigation. Currently the director with oversight from the Attorney General can issue an administrative subpoena for very limited evidence for subscriber information for telephonic and computer information for certain crimes. This bill would simply add to those certain crimes including swatting, terrorist threats or asking phone calls and domestic terrorism because those crimes are often committed via computer or telephones and getting that information to be able to source where it's coming from quicker. This would prevent a delay for them getting the information from those companies and that's essentially all it does and I'll stand for any questions if you're already, Mr. Speaker. The gentleman has no questions. Thank you. I ask your favor. Consideration. Gentlemen, as you did the well, is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. This bill now passed all in favor of the passage to bill. We'll vote yes. All those opposed. We'll vote no. Mr. Clerk, where you unlock the machine. Have all members voted? All members voted if so. Mr. Clerk, where you lock the machine. I want the passage of House Bill 161. The A's are 158. The A's are eight. This bill, having to see the requisite constitutional majority is there for past. Mr. Clerk, where you read the caption of House Bill 5656. House Bill 56 by represent a P tree of the 166th and others being titled an act to amend subparts 7 to part 3 of Article 7 of Chapter 3 entitled 20. The official go to Georgia and it's a related to grants to children of law enforcement officers, firefighters and prison guards. So it's to provide for tuition grants, dispouses of law enforcement officers, firefighters and prison guards who are killed are permanently disabled and the line of duty. This bill I've referred to the committee on higher education that committee recommends a disbilled do pass by committee substitute. Chairman Petrie has recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I'll bring you today House Bill 56, which passed last year and went to the Senate ran out of time and died there. As a reminder, this bill provides. We already have a Georgia public safety memorial grant that provides free tuition in this state, either in the university system or the technical system for the children of slain public safety officers, firemen, police officers, paramedics, hero, highway emergency response operators and prison guards. This bill began as as a bill to add spouses of those slain or permanent.\n\nWe've been able to see the process of improving this bill. This bill will add the spouses of those individuals. In the process of improving this bill, you'll see something new this year. And that is in section three, you will see that we are now adding a separate benefit through a separate fund for teachers and for the spouses and children of teachers that might be killed or permanently disabled in the line of duty as well. Mr. Speaker, that's very simply what this measure does. Glad to answer any questions if there are any. Jim, one has a question if you're used. Yes, sir. Are you? Representative Brinnell to your left. Is recognize for a question. Thank you, Mr. Speaker. Does the gentleman you? Yes, ma'am. Are you aware that the Justice Department pays for spouses to go to school? No, it's not. I'm not. There's no time frame on it. And then for children, they pay for them up to 27 years old, so they can get an undergraduate and a master's degree. No, ma'am. I'm not familiar with that. I'm not. This was, but this ad came out of out of the committee. After it went to rules, there was a desire to add teachers. And so I certainly supported that measure, but I'm not aware of that benefit that you just want. The life of a slain police officer gave me that information. But thank you for the video. Thank you very much. Thank you. The gentleman has no further questions. Thank you, Mr. Speaker. The gentleman is yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. hearing none the report the committee has agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine do all members voted all members vote if what purpose is represented representatives 2001 to podium All members voted. All members voted for what purpose is representing Martin? The Parliamentary requirements, Speaker. The State's inquiry. Isn't it true, Mr. Speaker, that in addition this bill also adds a checkoff on our tax returns and our driver's license if we want to contribute to that teacher memorial fund. Just wanted to sound that out. It's that true that if we want to contribute to that fund when we follow our taxes or get our driver's license, we can check that box and help these folks that are there for us every day. I know the gentleman knows what he's speaking to. He's read the legislation very carefully. What purpose is representing sharp or rice? Parliamentary requirements. State you inquiry. Isn't it not true that I have the honor of being on lawmakers with P.T. as he was able to tell the people in the world about this bill and I wanted to support him in this bill? It's a love fist. It's a good bill. Have all members now voted if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 56, the yeas are 172, the nays are zero. This bill here is either requisite constitutional majority is therefore passed. Thank you members. For what purpose is House Bill, excuse me, Mr. Clerk, would you read the caption? It's not even late yet. Mr. Clerk, would you read the caption to House Bill 248? House will 248 by representative Jasper's to the 11th to be entitled back to amend chapter 7 to the 48th, the fiscal to Georgia annotated relating to income taxes that are applied for tax credit for certain expenses incurred by taxpayers for certain geothermal machine installations at residential dwellings. This bill ever further, the Committee on Ways and Means, that committee recommends a disbilled do pass by committee substitute. Chairman of transportation, chairman Jasper's is recognized to present the bill. Thank you, Mr. Speaker. Mr. Jasper's I bring to you House Bill 248, which allow more Georgians to utilize the unique aspect of earth's natural heat to heat and cool their buildings and their homes, excuse me. This bill will allow for a 25% tax credit income tax credit on the installation expenses of the residential geothermal system. The residents will only be applied over five years and be $5,000 for any taxable year. It also has a sunset, which has been very good. These systems require the workers a two or three times with a normal HVAC system will require. It has been proven to reduce our peak electrical grid use and our overall general less energy use. The sub also includes some information that help DOR to guidance and enforcing this tax credit. Mr. Speaker, that's my bill. I'll be glad to answer any questions. Gentlemen, has a question to your left, Chairman Parsons, is recognized for a question. Thanks, Speaker. Gentlemen, yield? Absolutely. To the gentleman, incident true that I know you've worked very hard on this and it's a good issue and I'll be right there with you voting for it. Thank you, Chairman. I appreciate your support. Gentlemen, has there further questions? Thank you, Mr. Speaker. Ask your favourable vote. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Hearing none, the Committee's substitute is adopt. Is there any objection to reading to the report of the committee, which was favourable to the passage of the bill? Hearing none, the report of the Committee's agreed to, shall. This bill now passed all in favour of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Who do you want to vote? We have no confusion. No, I should say Zoe.Do you approve? Yes. I would have liked to see Milk. You then should vote for elected Catalunya. We have no leg contains? All members voted. Yes, you mentioned directly. Sorry, we will vote for Cecil. Madam Chairman. where you locked the machine. On the passage of House Bill 248, 248, the Yays of the 170, the Nays are three. This bill has received the requisite Constitutional majority is there for a past. Okay, members. I ask you to pay attention to the gentleman in the well. We have our rude naming bill that chairman Prince is going to bring to us. He's going to give you some instructions as he presents the bill. Chairman Prince. Thank you, Mr. Speaker. As Speaker said, this is our annual road naming bill. We have three that are memorial and I ask that you please stand at this moment. House Resolution 7 dedicates a portion of state route 38 in Grady County as the George C. Truluc, Jr. Memorial Highway. House Resolution 31 dedicates a bridge in U of U.S. Highway 29, state route 8 in Madison County as the R. George Strickland, Jr. Memorial Bridge. House Resolution 303 dedicates the interchange in Chris County as the honorable Johnny Floyd interchange. I accept we have a moment of silence for our fallen Georgians. Thank you, Mr. Speaker and colleagues. The last resolution is House Resolution 96, which dedicates a portion of state route 155 in the Cab County as the Dr. Gregory B. Levin, senior Parkway. I ask for your favor for consideration of these resolution. Thank you, Mr. Chairman. I have the other wheel. Gentlemen, Jeal to the Wheel. It's always a special time when members honor an individual by a road naming. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Hearing none, the Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? Hearing none, the report of the committee is agreed to. So this resolution now be adopted. All in favor of the adoption of the resolution, we'll vote yes. Those opposed, we'll vote no. And Mr. Clerk, will you unlock the machine? No. Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine on the passage of House resolution, resolution seven, the yeas, a 172, the nays or zero. This resolution haven't received a requisite constitutional majority is therefore adopted. Mr. Clerk, will you read the caption to House Bill 638? 638. I have still caught the 53rd. Now there's been titled an act to amend Article 2, Chapter 9, and Title 32, of the official code of Georgia annotated relating to the Metropolitan Atlanta Rapid Transit Authority. So it's prohibiting the stopping or parking of motor vehicle, other than a transit vehicle, and it designated transit vehicle lane in the city of Atlanta. This bill that referred to the Committee on Transportation, that Committee recommends a disbilled dupe, by Committee Substitute. And representing Deborah Silcox is recognized to present House Bill 638. Representative Silcox. Thank you so much, Mr. Speaker. I come to you today to present House Bill 638. But before I get into the bill, I do want to sincerely thank the Speaker Proteam for her immense help in proceeding. As well as Chairman Jasper's and the Transportation Committee for their input on this bill. House Bill 638 would allow Marta to enforce their BRT lanes. What is BRT? BRT stands for Bus Rapid Transit. In the City of Atlanta and the Atlanta City Council have designated lanes in Atlanta. Specifically as transit only lanes, meaning that only buses may ride in these lanes. But in order for people to travel rapidly in these lanes, they cannot be slowed down by other vehicles blocking the lane. House Bill 638 would allow Marta to have camels in the city of Atlanta. So, I would like to thank the Speaker Proteam for his sincere support. They cannot be slowed down by other vehicles blocking the lane. House Bill 638 would allow Marta to have cameras on their buses to ticket vehicles that are parking in these lanes. For the first six months of the implementation of this bill, Marta would conduct a public education and awareness campaign. And the cameras would only issue warnings to people who park in these lanes. After six months, the bills of course can be issued a citation. The citations are minimal and match the same fines with the distracted driving bill that we did several years ago. The bill also requires that there be visible signage of the use of cameras in the bus only lane. Violations will not contribute points against a person's motor vehicle record. Furthermore, they will not prohibit anyone from renewing their tag and will never result in an arrest. First responders may still access these lanes in congested areas. And the camera vendor will only be paid with grant funding and no administrative fees. The fees may only be used by Marta for public safety initiatives. And finally, the bill has a sunset of January 2030. So I would ask for your favorable consideration of House Bill 638. And I'll be glad to stand for questions. The lady has a couple of questions. Representative Parsons to your left has recognized for a question. Thanks, Speaker. I was trying to find the bill. I hadn't got it up yet. My question is, where would these cameras be located? I mean, they can't be located on the whole route, can they? No, that's a great question. I appreciate that. They will be located on the buses themselves on the Marta buses. So the bus would have to pass this car that's parked, is that not correct? No, the cars. They would have them forward in rear-facing. They could take the tag in front of the, yes. Okay, thank you. Great question. Thank you. Any other questions? Yes, ma'am. We have a couple more room things. Jazz bring Clark to your left. Is recognize for a question? Thank you, Mr. Speaker. Does it generally yield? Yes. Thank you so much for this legislation. I do believe it. It's good legislation, but I would like to ask about vehicles that are disabled, not because they just went to run into the store or something. But what if a person has a flat tire? Are their car breaks down? Is there any possibility that we can work on the bill to make sure that we're not punishing people who are already kind of in a bad situation? Thank you. That's an excellent question. These lanes are designated specifically for buses only. And so there shouldn't be cars in those lanes. Ideally, the cars will not be in those lanes. But right now, it is only citations for park to vehicles. So I believe someone could show that the car was disabled in some way. They would not receive a citation for that. Thank you. Thank you. Mr. D. Chris, to your left, is recognize for a question. Thank you, Mr. Speaker. Does the lady, Leo? Yes. Thank you. Is it not true that this measure will allow some of us, while we're in the Atlanta area to drive the bus, that way we can know what time we'll get here in a smart way? That is true. The idea, this is rapid transit. And there are many other cities in the United States that have bus rapid transit. And it's a very easy and quick way to get around town. Thank you. Thank you for the question. Representative Washburn, to your left, is recognize for a question. Thank you, Mr. Speaker, for the chair lady yield. Thank you. Yes. Is it not true that this legislation and the cameras reference didn't have absolutely nothing to do with the schools on cameras, which we addressed at length in past two bills out of the house to deal with? Is that not true? Representative Washburn, I thank you very much for making that distinction. Yes, these cameras have nothing to do with the school cameras whatsoever. Will the general lady yield for another question? Yes, sir. Is it not true that this is, in my opinion, very good legislation that will help a great deal with the traffic congestion in the city of Atlanta? The general may know what he speaks. Thank you so much for the question. Lady has no further questions. Oh, yield well. Thank you, Mr. Speaker. Ladies, yield to the will. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed? Will vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk, will you lock the machine? On the passage of House Bill 638, the yeas are 145, the nays are 22. This bill, having received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you lead the caption to House Bill 445-445? House Bill 445, by Representative Martin of the 49th, to be entitled to enact to amend chapter 5 of the title 48, the Fish Quotid Georgia Annotated, ruling the ad valorem taxation property. Those are revised in language required to be included in the notices of current assessment. This bill, ever, for the committee on ways and means, that committee recommends that this bill do pass. Chairman Chutton Martin has recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, this is a redo of House Bill 36 from last year. We passed it 170 to zero. So, if you like confusing assessment notices, an inefficient appeal process, inefficient appeal process, you're not going to be for this bill. But if you like the idea of creating a clear assessment notice, so our voters will know what's going on, and a better appeal process, so we end clogged the spirit court. You're going to like this bill. House Bill 445 gives property owners with personal property greater than $200,000, the option to appeal directly to a hearing officer, where they get a knowledgeable individual to settle the appeal and state a superior court. This is a taxpayer-friendly bill. It also gives the counties the ability to procure more hearing officers, so on clog the assessment process, with that there are no questions, Mr. Speaker. I'll yield the well and ask the House again to send this over to the Senate. Chairman, would you do the well? He has no questions. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee has agreed to, shall. This bill now pass all in favor of the passage of the bill. We'll vote yes. All those opposed? We'll vote no, and Mr. Clerk, will you unlock the machine? For what purpose is represented, Donna, who arrives? I'll pass. He waits. Have all members voted? All members voted if so. Mr. Clerk, will you lock the machine? On the passage of House Bill 445, the A's are 167, the NA's are 0. The bill, however, see the requisite constitutional majority is there for past. Mr. Clerk, will you read the caption to House Bill 466? House Bill 466 by Representative Cameron, the first to be entitled to amend the Article 3 of Title 350. The official go to Georgia annotated, relating to the state's symbols, so it does agate the March tacky horse as the official Georgia Heritage Horse breed. This bill, I have heard, is heard committee on special rules that committee recommends this bill, and do pass. The gentleman from the very first House District. Representative Cameron has recognized to present the bill, Representative Mike Cameron. Thank you, Slur, and thank you for your time. Today I bring you full HP 466, which designates the March tacky horse as the official Heritage Horse of Georgia. At the beginning, this was brought to me. I didn't think much of it, but the more I got into this bill and looked at this horse, it has a great history in America. It came over with the Spanish about 500 years ago. It was used by Native Americans for many centuries. It was used in the Gula culture in Georgia, South Carolina. It was also used in the Revolutionary Civil Wars, but after the turn of the 20th century, New to Disease, they started the population started dwindling. By designating this horse as a heritage horse, like it has been in several other states, we are recognizing the importance of this horse not only in Georgia history, but the horse itself and how we need to preserve the horse. In Georgia, currently there is only a couple of hundred horses in here. There is some in South Carolina, Florida, Mississippi, and a couple other states, South and North Carolina. So Mr. Speaker, that is what the bill does, and I will take any questions. You have a couple of questions. Representative Sains, tell you a letter from Donald Kost has a question. Thank you, Mrs. Gentlemen. Certainly, from my friend from the coast. Isn't it not true that though these are important heritage horses, they have no resemblance to the beautiful horses on Cumberland Island, which are actually feral horses since they are let go by the carnigees on the island. That would be true, and I had mistakenly thought they were on Cumberland Island. These horses are smaller than the average horse. They only go about 14 hands, which is about 54 to 56 inches tall, but they are very sturdy horses. And the reason they are called Marsh Tacky Horses is because the word tacky means common horse, but because they have such large feet, they don't get stuck in mud or in marshland lands. Thank you. Representative Al Williams has a question. Representative Williams is right. You are my good friend. Thank you, Speaker. Mr. Gentlemen, you are here. Yes, sir. Is it not true that even though they are small, they are very sturdy and sturdy, and they are used in the Galagiti culture, with a plough, small farm areas, and they did a great job because of the size of the hooves and their durability and strength. That is correct. And that is why we need to teach this to our younger people, why are these horses came from, and why, and the things they did in culture and in history? Yes, or are you guilty? And then maybe our urban whip will get an opportunity to plough one of these fun and horse. Well, and I tell someone too, these horses are so small that probably I could get on them without a step ladder, so that helps. You too. He is getting personal name, Mr. Whip. Representative Deloots, to your right, is recognized for a question. He knows about these horses. Yes, sir. Thank you. Sir, you named several states that you said have these horses. Do you know how many of those are red states and how many are blue states? I think there are red states. Where the matter is? Great history lessons. But I don't know how they vote. I suppose you have a clay red states. No. You know my house no further questions. Thank you, Mr. McGraw. You all the well and ask for your favorite consideration. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report, the committee has agreed to. This bill now passed. All in favor of the passage of the bill. Will vote yes, all those opposed. Will vote no and the clerk will unlock the machine. All members voted. If so, Mr. Clerk, will you lock the machine on the passage of House Bill 466? The yeas are 168. The nays are one. This bill has either requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 491? House Bill 491 by reps of Chastain to the 7th and others be titled an act to amend Article 1 of Chapter 3 and Article 2 of Chapter 4 of Title 27 of the Efficiency of Georgia and it's interrelated relating to hunting and non-commercial fishing respectively so as a move and exception for the use of air guns to hunt wildlife. This bill ever for the committee on game fishing parks. That committee recommends this bill do pass by committee substitute. Representative Chastain, are you ready to present your first bill? Just saying that gentlemen from Blue Ridge is recognized to present House Bill 491 representing Johnny Chastain. Thank you Mr. Speaker. I have HB 491 this evening. Really it hopefully will be a simple bill but this bill extends the current sunset of July 2025 to July 2030 for the hunting with air guns and air bows. On the second section we have two minor changes for fishing with bow and arrow for catfish and we're changing channel catfish and flathead to any catfish and we're striking through the Savannah River and changing that to species from the waters of this state. That's really the only changes that we have in this bill. I mean I can't hardly help it. I'm so excited for you to take a couple of questions. For God to turn on the microphone. You do have a question from a neighbor and that's a gentleman from the sixth referencing Jason Ridley to your right if you will yield for a question. Yes sir. This gentleman yields. Yeah I'll yield to my neighbor. Good. In section one lives 12 315. Could you rate those for us? 12 315. Yes sir. For the purposes of this subsection the term air gun means any pistol, handgun or shoulder held device such of not less than 0.3O caliber 30 caliber or air bow that propels projectile in the form of a slug shot or arrow equipped with the broadhead utilizing. Unignity compressed air or gas. Air guns are legal weapons for hunting big game only during primitive weapon hunts, primitive weapons seasons and firearm seasons. Okay in this bill about fishing. The second section is. Okay so the first thing. So in that first section right there would would what we call up up were from a potato gun. Be legal to use. I don't think a potato gun would be. Sure air gun or air bow. Well it says anything it projectile that form a slug. I don't think that would be legal. But like. Gentlemen has a couple more questions for your yield. Yes sir. I'll yield. For rubsid Thomas to your right in the back. Is recognize for a question. Does the gentleman yield. Yes sir. My seat made I will yield. Congratulations on your first bill. I'm curious do you prefer cat fishing via noodling or you more of an online cat fisherman. I. I have heard there is an online cat fishing but I prefer noodling. Thank you. Congratulations. Rich speaker I'll yield the well. Amen. That was a pretty good move because you had a lot of questions. You had a whole slew of questions no matter of fact. The gentleman's yield to the well is any objection to the previous question being ordered. Is there any objection to adopting the committee's substitute? Is there any objection to agreeing to the report of the committee which was favorable to the\n\nThis bill now passed all in favor of the passage of bill will vote yes all those opposed will vote no and Mr. Clerk were you in lock the machine? Have all members voted For what purposes represent part cannon rise the parliamentary inquiry is it not true that there are members who are concerned that this bill prioritizes special hunting interests over the long-term conservation efforts of catfish Yes, sir I'm sure some people do have that concern yes, ma'am For what purposes represent represent a Montaghan rise Parliament to inquiry miss speaker State you inquiry give the gentleman your attention miss speaker isn't it true that I sleep about those narrows But I don't see nothing in this bill about Newtland. I Think we passed that years ago representing covers that newtly nespect if all members now voted All members voted if so Mr. Clerk will you lock the machine On the passage of house bill 491 that yeas are 171 the nays or three this bill intercede a requisite Constitution majority is there for past You Mr. Clerk will you read the caption of house bill 439 439 house of 439 by reps at every year to 150 second and others to be entitled And act to amend code section 48850 of the official code of Georgia annotated Related to compensation of dealers for reporting and paying tax and reimbursement deductions Those are revised deductions allowed to dealers this bill haven't heard of the committee on banks and banking that committee recommends a Dispilled do pass by committee substitute For a Presented yearda is recognized to present the bill Chairman yearda Thank you, miss speaker. I bring you house bill 439 439 is bill relating to the compensation of dealers or merchants for reporting and paying sales tax and the reimbursement deduction This means your local restaurant your local boutique or your hardware store and 2024 the Georgia House voted just for my study committee on credit card fees sales tax Exxise tax and they're impact on Georgia merchants and consumers the committee looked at the effects of credit card Processing fees on merchants and consumers and whether the fees should apply to the state tax portion of transactions The key recommendation that the study kid committee did come up with was Changing the vendors compensation to support small businesses Every merchant and Georgia is required to report and collect Taxes on sales and remit them to the state currently vendors may retain 3% of the first $3,000 and one half a one percent exceeding $3,000 a collected tax This bill proposes to raise this to 3% of the first $10,000 and One half a one percent of the collected tax exceeding $10,000 This begins on January 1st, 2026 This this would help small businesses cover some of the cost associated collecting sales tax The revenue I'd ask the revenue department when this was last changed and they looked at back as far as 2005 20 years ago and it hadn't been raised since then Work with the locals on this bill including ACCG This bill would add to the bottom line of small businesses that are struggling with the effects of inflation supply chain issues and finding qualified employees and I certainly also think about the hundreds of businesses that were impacted by Hurricane You know, Georgia's been voted the best place to do business for the last 11 years Let's do something to take care of our small businesses in Georgia. I'd appreciate your favorable consideration Gentlemen has a couple of questions for your yield. Yes, sir. I think we to your right in the in the back right has a question How will you does well? Thank you. Yeah, sir Chairman is it is not true that the small businesses that were impacted by Hurricane Helene as they open their doors They are expected to continue collecting or emit those sales taxes and this will be just a small token to help them as they build back those Businesses out of the recovery for many other things as they just done the chairman of the steady committee knows what he speaks Thank you for carrying this bill appreciate your efforts and work. Thank you Representative Roberts to your left Yes, ma'am I am all for Helping small businesses. I was just curious if you know what that financial impact will be when Let's say what it would be on last year's revenue from this. I don't have that exact figure, but It was we actually came up with something that was actually a little bit less than the steady committee Recommended on the back end with the original study the steady committee recommended going up a half a percent per year What we did was just take the first years recommendation. Okay. Thank you Gentlemen has no further questions. Let's speak our yield well Jim was yielded the well is any objection to the previous question being ordered period none the previous question is ordered Is any objection to adopting the committee's substitute here in none the committee's substitute is adopted is any objection to A green to the report of the committee which was favorable to the passage of the bill here in another report the committee is agreed to Shall this bill now pass all in favor the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock the machine You Have all members voted all members voted if so mr. Clerk will you lock the machine? Owned the past of house bill 439 the yeas are 170 and these are one this bill here and see the requisite constitutional majority is Therefore passed mr. Clerk will you read the caption of house bill 447? House bill 447 my reps that I'm going to the 19th being titled an act to amend article 4 chapter 9 and title 16 to the fiscal to Georgia Identity relating to fraud and rate related offenses So it's a provide for the crime of gift card theft gift card forgery and gift card fraud This bill I refer to the committee on judiciary not civil committee recommends a dispelled do pass by committee substitute Representative gullet is recognized to present the bill Jeremy gullet Thank you speaker Today I rise to present house bill 447 a Crucial measure to combat the growing epidemic of gift card theft sophisticated criminal enterprises are stealing gift cards from stores Recording their information and waiting for unsuspected customers to activate them only to drain the funds instantly This isn't a small time crime Is organized theft and is costing consumers and businesses nearly a billion dollars last year alone Because these cards have no value and activated Prosecuting these crimes has been difficult Leaving businesses and law enforcement will limited options HP 447 closes the gap ensuring these criminals can be properly charged and held accountable This bill protects Georgia businesses safe cards consumers and strengthens our fight against organized retail theft and our urgent support Mr. Speaker I'm happy to answer any questions Gentlemen has no questions. Thank you so much Gentlemen geol to the well is there any objection to the previous question be in order Hearing none the previous questions ordered is there any objection to adopting the committee substitute hearing none the committee Substitute is adopted is there any objection to agreeing to to the report of the committee which was favorable to the passage of the bill Hearing none the report the committee's agree to shall this shall this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed will vote no mr. Clerk. Were you unlocked the machine Have all members voted all members voted if so mr. Clerk were you locked machine on the passage of house bill 447 the yeas are 168 the nays or two this bill here to see the requisite Constitution majority is therefore passed mr. Clerk Where you read the caption to house bill 331 331 House will 331 by reps of camp 135th and others to be tunneled not to amend article 1 Chapter 11 of title 4 of the official go to Georgia annotated really in the general visions Regarding animal protection so to prohibit the transfer of certain domestic animals at certain locations This bill emphatically unackled for the consumer affairs that committee recommends that this bill do pass by committee substitute Representing Beth camp is recognized to present the bill charity camp Thank you mr. Speaker house bill 331 is a consumer and animal protection bill What this bill does it allows for transfer with consideration of dogs cats and rabbits at your home at your place of business of veterinarians office police department or sheriff's office FFA 4-H a KC events and any legal location is stipulated in the Georgia Department of Agricultural License regarding animal sales It prohibits people selling animals roadside flea markets and parking lots The bill protects consumers because it provides more contact with the sellers and information on the animals origin In the event there's a health issue or the animal is later to found to be misrepresented Further it should slow down or stop puppy mill type organizations that bring animals from other states in poor health Raised in deplorable situations to our state Because there are penalties involved Often animals that are purchased on impulse and parking lots later found to have poor health end up in animal shelters Which cost every single one of us tax wise the Georgia Department of Agriculture and the KC support this measure mr. Speaker I'm open for any questions Lady has a Question to your left representative more is recognized for a question Good evening. Does the general lady yield I do Parliamentary in karek. I should say that now now um I know that you say domestic animals, but what about these exotic animals Why didn't you include that in here? Is there something a reason why the exotic animals and I included in this Well, I thank you very much representative more for that question the animals that are primarily Sold in this manner are dogs cats and rabbits So that's what we're addressing in this particular bill. I'm not objectionable to addressing animals All animals to be sold in a in a humane manner Is the lady for the youth I do There there are so many people selling snakes and lizards and bunny rabbits They're not considered domestic the bunny rabbit mate but And that should have been included in this I'm wondering if there's something else somewhere Well, we stopped you from putting that in here because that's really important. It does address dog cats and rabbits So rabbits are included yes, but um it doesn't address reptiles. No, it does not thank you though Lady you for a couple more questions I do Reptility drenner to your left is recognized for a question Thank you mr. Speaker does the Generated yield I do for my friend Thank you very much. Is it not true that my county has been working Substantially on this issue and a couple weeks ago. I went to Walmart On a Saturday morning and somebody tried to sell me puppies from out of a car And I just want to say thank you very much for doing this bill. It's good job Thank you. I appreciate your support One more question represented gullet right at the center aisle when you're right and it's recognized for a question Generated the yield I do isn't it true that um this is Something really important to my county as well. Not only is it addressing I believe people getting animals Really without being thinking about how much of an animal really cost your lot You know how much of animal affects your life, but it also When animals are not wanted they overrun our our humane societies and our local animal shelters And this will this to really help put a stop to that as well. Is that not true? I it is true when I appreciate your comment and I appreciate your work in previous years on this bill I know you love animals as much as I do Lady has no further questions. Thank you mr. Speaker. I yield and ask for a favorable consideration on this measure The ladies you do the well is there an objection to the previous question being ordered Hearing none the previous question is ordered is there an objection to adopting the committee substitute Hearing none the committee substitute is adopted is there the objection to agreeing to the report of the committee Which was favorable to the passage of the bill hearing none the report the committee is agreed to Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote No and mr. Clark clerk were you unlocking the machine You Have all members voted all members voted if so mr. Clerk will you lock the machine on the passage of house bill 331 the yeas are 161 the nays are 13 this bill having to say the requisite Cost of majority is therefore passed mr. Clerk were you read the caption to house bill 451 House bill 451 by a represent of can in the 170 seconds to be entitled not to amend part 14 of article six The chapter two entitled 20 of the fish go to Georgia annotated relating the other education programs under the quality basic education act So authorize provide that local boards of education so we authorize to prevent instruction and hunting safety and grade six through 12 this bill have referred to the committee on game fishing parks that committee recommends a dis bill do pass by committee substitute Ripsing chairs Kenan is recognized to present the bill Thank you mr. Speaker I have a house bill 451 House bill 451 would authorize local boards of education to provide instruction and hunter safety In grade six through 12 by Georgia DNR certified instructors The courses already being taught in more than 100 schools across the state by over 400 certified instructors Some of the instructors are from our own DNR law enforcement division Some are volunteers and some are our own local school teachers The bill requires that any instruction provided must be based on the hunter education safety courses already Established by the DNR and it must be taught by a DNR qualified instructor And crafting the bill we work very closely with the Department of Education And the DNR to follow what is already being taught in our schools across the state the lanes we have now just makes it part of the code I'll stand for any questions and ask for your favorite consideration mr. Speaker representative McDonald to your right is recognized for a question This is you Yes Yes, sir Does anywhere in this bill is a word koova and what koova stands for head I can true we can add it over to synod if we need to Representative Petrie to your left is recognized for a question This gentleman you I do to the gentleman from the coast. Yeah representative and friend Is it not true that there's not much better we could have young people doing today than being outdoors? Whether it's not in a fishing or whatever else, but is is that not true? Do you know the news of what he speaks Representing the Sanchez to your right Is recognized for a question. Thank you mr. Speaker to the gentleman you How you thank you? Is there a reason why this bill is narrowed only to hunting safety and not for general gun safety in general 100 safety could include that Okay, thank you. Yes, sir Chairman Irwin to your right is recognized for a question Thank you mr. Speaker does gentleman you you're the my seat make do you mind if I ask you how many times you took this course before you passed it? I'm not gonna answer that one Thank you mr. Speaker good bill Do you the well I was coming with a question, but the gentleman you were the well The gentleman is you the well Is any objections to the previous question be in order here in none the previous question is ordered is any objections or adopting the committee's substitute Here in none the committee's substitute is adopted. Is there any objections to agreeing to the report of the committee Which was favorable to the passage of the bill chair? Here's none the report the committee has agreed to Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and the clerk will Unlock the machine Have all members voted all members voted for what purpose is there more rice Parliamentary inquiry is it not true that not everyone wants to see a young man a young woman between six and twelve Great running around with the gun outside Seriously, I'm sure the lady has her opinion She's welcome to it for what purpose is representative hagan rise Parliamentary inquiry extension choir mr. Speaker isn't it true that this bill does not require any local school assistant to adopt this program But it leaves them the option instead of the parents don't want to see their children doing that they can let their local school board now I know the lady knows of what she speaks for it What purpose is representative Berk Chet rise parliamentary inquiry Isn't it true that this bill allows for when kids are outside with guns. They are trained properly in safety I'm sure the gentleman knows what he speaks. He has two young boys Now have all members voted all members voted if so mr. Clerk will you lock the machine? On the passage of house bill 451 the a's were 159 the nays or 16 this bill haven't received the requisite Costition majority is there for past mr. Clerk will you read the caption to house bill 593 593 house with 593 by represent of green to the 154th be a title next provide for the future elections for the office of pro-b Judge Baker County shall be nonpartisan elections this bill ever further committee under grubble coordination That committee recommends the dis bill do pass The dean of this house represent Gerald green is recognized to present house bill 593 Thank you mr. Speaker and mr. Speaker I can assure you this is not my first bill I Want to thank the the committees that helped me bring this bill to today's vote and This is a house bill 593 and it's to provide the future elections for the office of probate judge of Baker County shall be nonpartisan I have Letters from the probate judge. I have the county commission that has sent They're requesting that that I present this bill to you my colleagues So mr. Speaker if there are no questions. I would favorably ask that each Of you vote for house bill 593 Gentlemen has no questions. Thank you mr. Speaker knows what he's doing gentlemen you were the well is any objection to the previous question be in order to chair He's done previous question is ordered is there any objection to agreeing to the report of the committee Which was favorable to the passage of the bill hearing none the report is of the committee's agreed to shout this bill now Pass all in favor of the passage of the bill will vote yes all those opposed will vote new and the clerk will unlock the machine Have all members voted All Members voted if so mr. Clare where you lock the machine on the passage of house bill 593 the yeas are 150 the nays or 20 this bill have received the requisite constitutional majority is therefore passed mr. Clare where will you read a caption to house bill 536 Excuse me 535 535 House will 535 I represent a smith of the 18th to be entitled back to amend code section 42 38 the fiscal to Georgia annotated relating the rest to graduating sanctions for vote pro House Roy for probationers violating terms hearing disposition of charge and procedure when probation Revoked and counting other than that of conviction this bill ever for the committee on judiciary now and civil that committee recommends the disbill do pass Grief of the entire upholst myth is recognized to present house bill 535 Thank you mr. Speaker members of this August body. I bring to you house bill 535 This is in response to the case decided over across the street in the Kellan case This bill would fix that and eliminate the confusion and almost all context of a person sitting in jail waiting a Judication of a case Georgia law dictates that their time sitting in jail counts as time served if their sentence to more jail or present time This bill provides a very simple fix it would count time served for probation revocation cases in the same ways in the other case This house courts count of time served for years before the court of appeals decision Created the legal fiction that time in jail on accounts as time on probation for purposes of time served calculations That miss speaker is the bill in a nutshell and I will yield the questions Gentlemen has no questions. Thank you miss pick out a yet well-matched as his body's favorable consideration. Gentlemen's yield the well Is there any objection to the previous question being ordered hearing none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill Hearing none the report of the committee is agreed to shout this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed. We'll vote no and mr. Clerk will you unlock the machine Oh Have all members voted all members voted if so mr. Clerk will you You Lock the machine Have all members voted I think you have looks like a dengue wow On the passage of house bill 535 the yaser 178 and the nays are zero This bill had received a requisite constitutional majority is therefore Past mr. Clerk will you read a caption to house bill 521 521 house will 521 by representative Anderson to the 10th and others to be entitled and act to amend Article 8 of chapter 36 entitled 36 of the physical to Georgia antenna relating to municipal DNXation So it's a revised procedures related to the DNXation of certain properties This bill I've referred to the committee on governmental affairs that committee recommends a disbilled do pass by rules committee sub chairman Anderson is recognized to present house bill 521 Thank you mr. Speaker colleagues once again. I bring a follow-up bill to some of the actions we've done over the last few years With a little addition here the section one of the house bill 521 requires that any DNXation when that occurs that at the appropriate shape files be provided to the legislative and congressional reapportionment office Section 2 of the bill applies only to one particular County and one particular tract of property Which is the 9000 somebody could attract a property in Pauline County that is currently owned by I believe the city of Atlanta that's that they're looking for a buyer for\n\nAnd all this does is it says that once that occurs, that there is an agreement between the city and the county regarding the future annexation of that property. Section three is where this bill started and that is requiring that when a county wants to DNX county owned properties, only county owned properties, that the municipality must provide a response within 90 days. It's currently in code that the county can request the annexation, but there's no time limit. And this is something that was overlooked when we did the annexation rewrite a couple of years ago. With that Mr. Speaker, I'll stand for any questions. Gentlemen, ask no questions. Thank you. I request your favorable consideration and I yield the well. Jim, I yield the well. Is there any objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to withdrawing the committee's substitute? Here in none the committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? Here in none the rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none the report the committee is agreed to shall. This bill now passed. All in favor of the passage of the bill will vote yes. All those opposed. We will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is represented? Holly, rise. Probably the minister inquiry. State your inquiry, sir. Mr. Speaker, it is not true that this substitute for this bill is actually providing enough transparency for the public. And is good not only for the county of the sponsor, but also for those counties that actually find themselves applicable to this measure. I know that gentleman carefully reads legislation. I appreciate his insight. Have all members now voted? If so, Mr. Clerk, will you lock the machine? All in the passage of the bill, the yeas are 165. The nays are 10. This bill House Bill 521 has received a requisite constitutional majority. And therefore, passed. Mr. Clerk, will you read the caption to House Bill 433-433? House Bill 433 by request. And a balance through the 23rd and others to be entitled. And act to amend our two, chapter three, title 35 of the official go to Georgia and it's it related to Georgia crime information center. So it's a revised department of human services. Shelby authorized access restricted and sealed information that conduct employee oversight in certain circumstances. This bill emphurred committee and public safety and Homeland Security. That committee recommends a disbilled do pass by committee substitute. Representative Ballinger has recognized to present the bill. The lady has the will. Thank you, Mr. Speaker. I appreciate your attention to this matter. Right now, our Department of Family and Children's Services, as well as our Department of Human Resources, cannot access certain GCIC information. According to the NCIC information, this is due, this is required of our out of state partners that function in the same capacity as our DHR and our division of Family and Children's Services. But it's not available to our own in state Department of Human Resources and Division of Family and Children's Services. So this just allows them access to that information, changing the GCIC rules. I'll be happy to stand for any questions. The lady has no questions. Thank you. I appreciate your favorable consideration and I yield the will. The lady's yield of the will. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is there any objection to a green to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shout out this bill. Now pass. All in favor of the passage of the bill. We'll vote yes. All those opposed, we'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted? If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 433, the yeas are 177, the nays or zero. This bill has received the requisite constitutional majority. It's therefore passed. Members, we're moving along now, but I have a request of you. If you have a space heater, I know it gets a little cool in here sometimes. If you have a space heater, this plug in, and the chamber now, you need to unplug it for a few minutes. I'm sorry, get up, run around. If you're cold, so you need to unplug them for a few minutes, just cause some issues with our circuitry in other parts of the Capitol. He's a premier of the Senate. They're out of lights over there. Plug them back in. I'm not sure they were doing anything anyway, so what's the big deal? So if you will, oblige me with that, and we so we can continue, we won't have to light any candles or anything like that. So if you're willing, plug them for a few minutes, we'll move on with our day. Mr. Clerk, will you read the caption to House Bill 54 or 54? House Bill 54 by reps on the Clark of the 100th, and others to be entitled, and act to amend Title 1631 and 43, the Fish Dakota Georgia annotated, relating the crimes and offenses, health, and professions and businesses respectively. So it's authorized advance practice, registered nurses and physician assistance, door to home health care services to patients of licensed home health agencies. Let's bill that refer to the committee on health. That committee recommends a disbilled do pass by committee substitute. Representative David Clark, if recognized to present the bill or representative Clark. Thank you, Mr. Speaker and colleagues. I bring before you House Bill 54, a bill that allows PAs to order or prescribe home health services. According to the Georgia Department of Human Services, Division of Aging Services in 2022, 14% of Georgia's population was 65 older, up from 12.7% in 2019. Georgia's ranks 7th among states attracting older adults with aging boomer population, the demand for home health care will only continue to rise. According to the World Health Information Hub, home health is vital for those with chronic conditions, disabilities, a short term rehabilitation needs after hospital discharge. Many rural residents depend on home health care to maintain independence and avoid hospitalization or nursing home placement. This care is cost effective and proves recovery and eliminates unnecessary travel, yet rural population still faces barriers to access. Now, why House Bill 54 matters? In 2020, the Federal Care Act permanently authorised PAs to order home health services if individual states also allow it. In passing House Bill 54 brings Georgia in line with this authorization, improving access to essential care. Also, I know many of you have asked why the APRNs are not included in this bill. There's a committee process that shapes legislation and this remains an ongoing discussion. I know it's been brought up yesterday in COVID-19, the Governor granted APRNs temporary authority to approve home health services, which specifically sped up patient care. I recognize the importance of this issue and look forward to working with all of you to always put patients first and urge all of you to vote and support House 54, and we'd be glad to take any questions. Gentlemen, you ask for a question, and I'm going to bend it to your left as I recognize for a question. Thank you, Mr. Chair. With the gentleman here, is it not true that by passing this bill, it will allow for continuity of care for a lot of patients that will otherwise have to wait could be weeks and months before they could get that done. Thank you, great bill. The gentleman has no further questions. Thank you, Mr. Speaker. I ask for your favorable vote of House Bill 54. Thank you. Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? Here in none of the previous questions ordered, is there any objection to adopting the committee's substitute? Here in none of the committee's substitutes adopt. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none of the report, the committee has agreed to. This bill now pass all in favor of the passage of the bill. We'll vote yes. Those opposed will vote no. And Mr. Clerk, will you unlock the machine? All members voted. All members voted. It's so, Mr. Clerk, will you lock the machine? On the passage of House Bill 54 of the year, the bill is now being ordered. Have all members voted? All members voted. It's so, Mr. Clerk, will you lock the machine? On the passage of House Bill 54 of the year, the year is now 177, the days are zero. This bill, however, is either requisite. Cost of majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 511-511-511 by reps? On the 12th and others to be entitled to amend chapter 32, in code section 48, 727 of the official code of Georgia, and tentative relating to property insurance and computation of taxable income. This bill now refers to the committee on ways and means that committee recommends a dispelled do pass by committee substitute. Chairman Lomston's recognize to present the bill. Chairman Eddie Lomston. Thank you, Mr. Speaker. Members of the House, I bring to you House Bill 511. This is a piece of model legislation that comes from the National Council of Insurance Legislators. In light of recent devastating storms that have impacted our state, this is a small measure that will help provide an opportunity for our citizens to better prepare to recover from future catastrophic events. I would note that several of our other neighboring states, Mississippi, Alabama, Tennessee, and South Carolina, have already passed this legislation, and several other states are considering it. This bill provides a way of reducing one's taxable income by way of a catastrophic savings account, which can be used when a declared catastrophic event occurs. It works similar to a health savings account. The savings account may be a regular savings account or a money market account, but it must be designated as a catastrophic savings account. One must have the corresponding funds in the amount to receive the reduction and must show money spent or for qualified catastrophic expenses. This only applies to individual taxpayers who own their own home, and it must be a residential property that is their primary residence, and it only applies to a declared catastrophic event. Mr. Speaker, that's the bill, and I would appreciate your favorable consideration. Gentlemen, has no questions. Thank you. I yield the well. The gentleman is yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. This bill now pass. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Yes, sir. All members voted. If so, Mr. Clerk, lock the machine. On the passage of House Bill 511, the yeas are 177, the nays are zero. This bill haven't seen the records that constitute the majority, is therefore passed. Mr. Clerk, will you read the caption of the House Bill 718, 718? House Bill 718, by the represent of Jones, the 60th to be entitled back to amend chapter 4. Title 1 of the official code of Georgia and it's in ruling the holidays and observances. So it's to provide that the first week in April of each year shall be women's golf week in Georgia. This bill haven't referred to the committee on special rules that committee recommends the dis bill. Do pass. Representative Sheila Jones is recognized to present House Bill 17718. You give the lady your attention, please. Thank you, Mr. Speaker. I remember so the house I have. Thank you. I have before you HB 718 which provides for the first week in April of each year to be women's golf week in Georgia. And I ask for your favorable vote on this bill. May I ask the lady a question? Yes, sir. Isn't there a little golf tournament that goes on in Augusta? Maybe the week after this that your lady amateurs are going to be. Oh, excuse me. I'm sorry. I beg your pardon, your chairman prince. I'll let you have the question. I was getting them ahead of myself getting ahead of you. Chairman Prince is recognized for a question. Sorry, chairman prince. Thank you, Mr. Speaker. We'll give the lady a year. Yes, I will. As the speaker was alluded to. Is there not another small golf tournament that usually recognized the first week in April, the first four week in April that this might have some decoupliction with? Yes, this is the time that the master's take place. And the women's league, golf league has something going on during that time as well. Is the lady further than you? Yes. Isn't it true that it's part of the master's week there is a woman's pro golf tournament that this would fit right in line with? LPG. Yes. Thank you, miss. Thank you for bringing the bill. Thank you. Lady Yield, one more question. Yes, sir. Representative Dawson. To your left, just recognize for a question. Representative Dawson. Does the lady yield? Yes, I will. Is it not true that 23% of all golfers are women and that women make up a very active group of golfers? Yes, sir. That is correct. Thank you for this bill. Thank you. The lady has no further questions. I know she's working very diligently on this bill. We appreciate her work. The lady has no further questions. Thank you. And I ask for your favorable consideration. Is yielded the well? Is there any objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report of the committee has agreed to shout this bill now passed. All in favor of the passage of the bill. Will vote yes. All those opposed. Will vote no one. Mr. Clerk, will you unlock the machine? Yes. Yes. Yes. Yes. Yes. Yes. Yes. Yes. Have all members voted? All members voted this so, Mr. Clerk. Will you? Yes. Yes. Yes. We will stop the proposal. Lock the machine. All in favor of the passage of House Bill 718. The yeas are 174. The nays are won. This bill and records that constitutes majority is therefore passed. Congratulations. It's a good bill. Mr. Clerk, will you read a caption to House Bill 571? House 571 by Representative Hawkins, 27th, be titled, NACTO MEN, Chapter 34 of Title 43, the district of Georgia and Tady relating positions, assistance, and others. So to provide the licensing of a radiologist assistance, Ms. Bill ever further, the committee on health, that committee recommends that this bill do pass by committee substitute. Chairman Hawkins is recognized to present the bill. Thank you, Mr. Speaker. You have before you House Bill 571, this deals with radiology assistance. Right now they're very invaluable to the workforce. You know that health care is being expanded in technology in a lot of directions and radiologies, one of them. This is an important bill to allow the radiology assistance to help increase access to health care to keep up with an expanding technology. And most of all, it will help patient access and patient safety. That's the bill, Mr. Speaker, and I will stand for any questions. Gentlemen, you have a question, Dr. Newton. Do your right answer our question? Thank you, Mr. Speaker, with the gentleman yield. Yeah. Isn't it true that radiology is a very unique specialty and they haven't had the benefit of physician assistance and nurse practitioners that work close together, but this bill kind of fixes that. It leaves the board certified radiology, reading the films, but allows a lot of the interventional things to be done with an assistant who's well trained as you describe. That's right, that's right. And you know, this is a future that we're moving into at a rapid pace. There needs to be some thought and the board of medicine is going to be involved with some of that process. Thank you for your work on this advancement, thanks. Thank you. Gentlemen, has there further questions? Sorry? You have no further questions. Now you have the well and ask for your favorable consideration. Gentlemen, is yield the well? Is there any objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to adopting the committee substitute? Here in none the committee substitutes adopt it. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none the report of the committee has agreed to shall. This bill now pass, all in favor of the passage of the bill. Will vote yes. All those opposed? No, Mr. Clerk, will you unlock the machine? Have all members voted? All members voted yes, so. Mr. Clerk, will you lock the machine? All the passage of House Bill 571, the Yays are 162, the Nays are 11, this bill having to see. Their requisite constitutional majority is therefore passed. Mr. Clerk, will you read to caption to a group of privileged resolutions? Honoring the legacy of the Battle of Briar Creek, recognizing commending Michelle Riggs, recognizing commending Dr. Teresa T. Bird, recognizing commending Dr. Paula Grieves, honoring the life and memory of Steve Mensch, recognizing May 20th as my own site Titus Awareness Month. And for other purposes that completes the reading of the privileged resolutions. Rules chairman is recognized for an announcement. Mr. Rules chairman, Chairman Parrish. Thank you, Mr. Speaker. We'd like for the Rules Committee to join me in 341 at 630. 630, 341, Rules Committee. Thank you. Thank you, Mr. Chairman. Members, y'all all understand and have your tickets for the food trucks that are outside the Capitol for our dinner. Would that be correct? If you don't, you need to come by my office and pick up a ticket. If you do not have a ticket, you want to enjoy the food that we're providing. Okay, this house will stay in a recess until 7pm, 7pm, House in a recess until 7pm.",
  "updated_at": "2026-02-13T02:59:14.483856+00:00"
}