{
  "video_id": "6pN071XFL5w",
  "url": "https://www.youtube.com/watch?v=6pN071XFL5w",
  "title": "Conference Committee HB189 (Pt. 2) - 3/29/23",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Here is a structured markdown summary of the Georgia Conference Committee HB189 (Pt. 2) - 3/29/23 session:\n\n## Overview\nThis session focused on discussions around HB189, a bill related to agriculture transportation regulations. The key points of debate centered around the radius for farm vehicle operations, the role of local law enforcement in enforcement, and provisions related to fines and fees.\n\n## Key Actions\nNo specific bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Representatives engaged in discussions around the appropriate radius for farm vehicle operations, with 120 miles being proposed to align with federal FMAP program.\n- There was debate over the role of local law enforcement in enforcement, with some wanting to limit or sunset their involvement, while others argued it was important to have that option.\n- Concerns were raised about \"policing for profit\" and ensuring that any fines or fees went to the state treasury rather than local jurisdictions.\n- Amendments were discussed to include the transportation of agriculture finished goods in the bill's provisions.\n\n## Votes\nNo recorded votes were detected in the transcript.\n\n## Attendance\nThe transcript does not provide information on quorum or attendance.\n\n## Adjournment\nThe timing of adjournment and the date of the next session are not specified in the transcript.",
  "transcript": "You\nWe're going to need to call it order now.\nYeah, come with my order.\nYeah.\nAll right, we are, I don't know about the local law enforcement, that's it, I don't\nIf I bring it to the floor, you're going to throw it against the farm, I'm done with you.\nYou ain't going to try.\nI know, man.\nI'll be up.\nYeah.\nWe'll just go test them.\nYeah.\nAll right.\nYou all ready?\nWe're back.\nYeah.\nWe'll be back in court.\nIf anybody hadn't figured out, Russ Goodman is pretty passionate about farmers, so if\nyou hear anything, it's not, I am a farmer, 200 years.\nAll right, let's get this thing started.\nWe've talked, and the Senate talks amongst themselves, and we have had some discussion.\nOne of the things that we want to propose is that the radius be 120 miles.\nsomething uh where we said 120 I don't want you order and state I don't want you\norder and stakes for me you gonna get the smallest one the lean that's right\ntwo-year sunset is what the Senate proposed the point of contention that we\nWe have, and James, the local law enforcement is something that a lot of people have, a lot\nof heartburn with.\nYes.\nWhat's your position on that?\nWell, personally, now, we're a little bit of a split of opinion.\nI wish it wasn't in there.\nThat's me.\nThat's my personal opinion.\nBut I'm also trying to give something\nthat's a lifeline to...\nWe've got to compromise on that.\nI'm trying to give a lifeline to some folks.\nEspecially, y'all, this is different since COVID.\nWe're looking at $4.50 diesel and everything else.\nYeah, we need to move on.\nSo do you have anything you want to add, representative meets?\nYes, I'm sorry, but representative Bush it please so you want to keep it in there. Do you want to do you want to amend it in any sort of way?\nWell\nSenator Gooch has proposed making it where the law enforcement is in there, but it sunsets with the laws\nSo after two years the local law enforcement goes away, and if we can't come up with some kind of compromise in two years that the\nbasically the entire turn that you don't mind turn that might come yes basically the\ntwo-year sunset would be for the entire piece of legislation applicable to\nthe I like that provision what do you think what do you say this what do you say\nthis senator Gucci what if we say we leave the local enforcement in there but\nwe ask that any penalties or fees be they would go to the state not to the\nIt's already under current law that way.\nWe do have an amendment that we had for the bill earlier\nthat would direct it to the locals,\nbut that never got added to the bill.\nSo as written, all the funds will go to the state treasury.\nSo if the locals were to enforce\nthen all the money would go to the state.\nYes, no fees going anywhere else.\nYes, but in the future I would suggest we reconsider that\nand direct those funds to the jurisdiction\nof which the fines are written just like if a state\nI am concerned about policing for profits with that on the work of men.\nAnd I can say that today it would go to the state treasury.\nBut just know that if a state trooper pulls you over in your county chairman, the fines\ngo to the local county or city where the ticket is written.\nYou understand that.\nIt doesn't go to the state.\nIf a state trooper pulls you over on your way home tonight to Forsyth County, yes,\nwe're speeding ticket.\nfind revenue goes to that county or that city where that ticket is written, it does not\ncome to the state. State police are writing tickets at state expense, but the revenue\ngoes to the local governments. A lot of people don't know that. But as this bill is written,\nthat fine revenue would come back to the state treasury. So there would not be an incentive\nto set up speed traps for local revenues, which adds a bill is written today.\nThere's a lot of consternation amongst folks about that.\nWell, this protects your concern on that.\nI want to recognize Representative Meek's sister's bill.\nRepresentative Meek's, I think you should have more to say than anybody about it.\nWell, the 120 miles, the reason we'd recommend a hundred feet to keep it consistent with F-MAP,\namong the commodities, which is the federal program that allows you to drive within 150 mile radius of your farm.\nI don't know why we would go anything short of that.\nWe were looking at it three years instead of two, and again we can negotiate that.\nBut the limiting local law enforcement I think is important.\nI get everybody's position if we're going to sunset this in two years to take a look at it,\nthen, you know, that's what we're going to do in, you know,\nregardless.\nSo, you know, Mr. Chairman, however you want to proceed from there,\nwe did look at adding a provision that we had talked about amongst ourselves,\nat least on the house side that would include those that are hauling agriculture\nfinished goods for distribution or for retail consumption.\nIt was in a previous version of a bill that we had drafted.\nWe'll put it out there for consideration as well.\nThe other thing that we eliminated from the 10% variance\nwas solid waste.\nI know that was important.\nSo we eliminated that from the 10% variance.\nSo we would stay at the 5% variance, 84,000.\nYeah, I'm sorry.\nYeah.\nChairman Jasper's number five.\nThank you, Mr. Chairman.\nI concur with the Chairman Meeks on Love Law Enforcement.\nI'd like to see them eliminated.\nthey just letting MCG do that.\nYou know, did look at locking in the attainment area\nto the current date with the bill signed,\njust on the, you know, we talked to,\nlet's say, council to do that.\nIt looked very carefully at the current bill\nto make sure none of the fines are stackable\nand that was very important.\nAnd it was correct, they're not stackable.\nThey're not stackable.\nChairman, I'm with them on the local law enforcement. I would love to reach a deal here.\nAnd one of the concerns that the Chairman brought here, Chairman Dolezal, was that then\nyou have someone that's not fully trained to perform these way in there on the side\nthe road. I mean for the fact that that the locals have, you know, they've been asked\nto do this and I think it would just we even had the sheriff's association said that they\nwere not keen about it. Can I respond to both of those comments? Please. Terry Norris is\nin this building every day that we're in this building. He is neutral on that bill.\nhe's not supporting it or opposing it.\nHe did say, and I asked him to verify this,\nhe said that DPS does 24 weeks of training,\nwhich includes weights and inspections.\nThey have no training for weights only,\njust like trip or school.\nThere is a lot of added to the minimum.\nApparently it takes 40 hours to train the deputies\non the weight side.\nAnd so if the local governments want to do\nlocal law enforcement, they have to certify\nthese police officers or these deputies in order to be able to write those tickets through\nthis state required training. It's not something they're going to give\nMarty five as we heard earlier. They have to be certified. They have to have\nthe equipment. There's a possibility that hardly any of these cities or counties\nwill do this in the next two years, but give them the opportunity to do that as\nan option, not a mandate. I think it's the right thing to do. Otherwise, you're\nYou're looking into the camera and you're saying we don't want to enforce the law that\nwe're going to sit here tonight.\nI don't know how you can go home and justify that to people.\nIf people are killed in truck wrecks, and they come down here and testify next year that\ntheir daughter or certain sons got killed, and your response is we didn't want local\nlaw enforcement to be enforcing overweight trucks.\nThat's going to be hard for us to be able to face those people and explain how we came\nacross that decision.\nSo I think we leave it in for an option for the locals to do it.\nThere may not be any that chews to for two years, after two years, we'll have a new bill.\nWe'll have a new comprehensive freight logistics plan, Chairman Jasper's, that will include\nweights for all industries, not just ag and timber.\nSo I think it's a good compromise.\nWe met you guys in the middle and I think it's a fair compromise we should accept and\ngo get this printed tonight.\nWhat do you think about, instead of the locals doing it, how do we beef up?\nMCC, the motor care group, how can we do that until next year and propose a new budget\nwhich kills another 12 months?\nNobody is in here saying that we don't want to enforce a law Senator Gooch it's a\nwhere you're you're expanding the enforcement to local to local law enforcement when\nwe have a motor care group for just this specific purpose and so I would say\nI would be in favor of somehow increasing that staff or we just pass a budget.\nI know.\nFor which you didn't include.\nWe just pass a budget.\nFor which the Senate did include a pay raise for MCCD.\nHouse did.\nI understand it's not in the final budget.\nBecause our balance, our budget at the balance.\nIt lasts a two.\nHere we go.\nGuys, look, how do you stand here and say we don't want to enforce the laws that you're\nagreeing to adopt?\nYou're afraid of either facing the reality or you're afraid that some copy is going\nto go out there and start harassing truck drivers. Do you think your sheriff and your county commissioners\nare going to be allowing that for very long.\nYou and I will all hear from it next year,\nand we'll be back in here changing the law,\nand we'll take this power away from it,\njust like we can authorize them to give it tonight.\nIt's my understanding, Mr. Leader,\nthat that's been done over history,\nand it didn't work so well, and it was changed.\nAnd we've given one more chance to prove the throng.\nMr. Chair, we have a couple of those\nthat we reconvene in 20 minutes.\nIs that going to give us some extra time?\nWe're running out of time.\nWell, Mr. Later, it seems there's Senator Dulles, I wish your failings on the in order\nto make in terms of the legal law enforcement.\nI think that if you're concerned with policing for profit and the money goes to the state\nI think that I'd keep coming back to what I said earlier and I think that the leader\njust said it as well.\nThe law enforcement piece very much feels like we know we're under 95, 80% of the time\nand we just don't want to have to be accountable for it.\nAnd whether that's, we look at that from a safety perspective, a road degradation perspective,\nI don't know how you pass a law and say don't enforce it and Chairman, maybe you have\ninformation that I don't have but if there's one person running around this state on a\nweekend and forcing we essentially have zero enforcement and so I don't I have\nit I have a hard time accepting that as a solution a compromise to put this\nout there could be the local law enforcement has one year where everything\nelse has two years and then that forces our hand on the budget next year I\nhaven't discussed that with anybody else but that's a thought that I have of\nhow you split the baby but I think that it's I think the hand of the industry is\nbeing exposed when the industry fights against enforcement. At every angle, whether that's\nreporting at the mill, whether that's being able to, you're essentially telling light\nsheriff that if he sees a truck that is grossly overloaded, he can't do anything.\nWell, what if we allow, in the bill, it allows for them to see it, if they see a truck\nthat's grossly overweight, they hold them. They say, hold fast, we'll get MCC here.\nChairman where do you live? I live in Millwood. How long would it take to get from\nMillwood to Delininger? Six hours. You've made the trip this past year. You\nwant your truckers to be sitting on the side of the road for six hours for that\none inspector on that Saturday afternoon? I don't think that's practical.\nWell but is it can we have the conversation with MCCD on that topic and see you\nknow is that the norm or is it not I don't know if it is it may not be that may\nnot and it may be it may not be a fair characterization they just came off\nof a long weekend working the the I know there was a bunch of over in\nSavannah St. Patrick's Day parade yeah they set up right outside of mills down\ndown south so they're catching the folks coming we see them frequently in my\npart we see them all the time because you look at us one and when his\ndistrict and they're parked outside of the pellet mill it makes you made the\npoint earlier they're not enforcing them on back roads they're on four lane\nhighways. These two lane roads and counties and cities are their concern for the local\ngovernment. So we know they're not they don't have the resources to do it. Today we can't\ngive them the resources until next year at the earliest. But you want to hold the bill\nhostage so you can get some resources whenever we knew this was coming. We want to make\nthe right policy so we can move this bill forward. I believe it's the right thing to do.\nWe're asking people to enforce the laws and then honor the laws. How can that be the\nWe're working under this assumption that the MCCD is not doing that, doing that.\nBut you're saying the MCCD is not capable of doing their job.\nSir, you are totally misrepresenting what I said.\nWell, we're saying we're all agreeing that they don't have the resources to cover\n110,000 miles of roads in the state.\nSo we have 100,000 miles of roads in the state.\nThey're covering the interstates, they're covering the state routes of four lanes.\nThey are not covering these local county roads.\nbut I don't mean to misrepresent what you're saying,\nbut where I see MCCD is on my local roads,\nnot on my state roads, I see them right there on,\nwell, I see them on 82, I see them on the bypass,\nI see them in the US one, I see them on the state routes,\nwhich are the routes where the meals are back home.\nI don't know of the meals that are just off of,\noff of like county districts.\nI'm just gonna add this and I'm gonna go home,\nand I'll be back as soon as this votes over.\nLeader Grooch is committed to,\nBecause I will remind you guys the posture that I believe\nthat worry, which is that I don't know that you,\nI think you lose senators when you radically change this bill.\nThe leader has committed to Russ that with what he's\nproposed, he will speak in favor of the bill\nand will work the caucus for it.\nI believe your position is also the inverse if I would think\nthat let's take 10, 15 minutes, talk to you that reconvene.\nWhat do you want to, can't we meet back here in 10 minutes?\nI'll be back here as soon as this vote's done.\nCan we get some clarity language in there to assure that those fees are going to the state?\nYou can ask Jenna Dole, she has already emailed me that, and I started to prepare the amendment.\nThat was a week or two ago.\nSo the bill hasn't changed, and it didn't change before it went to the floor.\nSo the way it passes in it, the revenues go to the state's treasury, but she can confirm that for me.\nOkay, thank you, Ms.\nWe're going to stand to these 15 minutes.\nYou\n",
  "updated_at": "2026-02-12T02:59:47.211635+00:00"
}