{
  "video_id": "6SmvCznSaDE",
  "url": "https://youtu.be/6SmvCznSaDE?t=760",
  "title": "Georgia House - Day 11 (2026-01-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": "2026-01-29",
  "duration_minutes": 210,
  "summary": "Here is a structured summary of the Georgia House session transcript from 2026-01-29:\n\n**Overview**\nThe session involved the introduction and consideration of several bills, with a focus on education and law enforcement issues. There were also some notable moments, including a prayer and recognition of a fallen member.\n\n**Key Actions**\n- **HB 1214**: Providing additional funding for teacher salaries\n- **HB 37**: Increasing penalties for assaulting law enforcement officers\n- **HB 881**: Establishing a law enforcement mental health support program\n- **HB 950, HB 952, HB 958, HB 961**: Various education bills\n\n**Bills Introduced (First Reading)**\n- SB 338: Expanding school choice options\n- SB 92: Increasing funding for school resource officers\n\n**Notable Moments**\n- Opening prayer and recognition by Chaplain Bud Womack\n- Touching story shared by Chaplain Womack about the importance of love and friendship\n\n**Votes**\n- HB 1214 passed unanimously\n- HB 37 passed with some opposition\n- HB 881 passed unanimously \n\n**Attendance**\nAll members were present and accounted for.\n\n**Adjournment**\nThe session adjourned, with the next session scheduled for the following day.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you All members, our convening have arrived. All members will take your seats. Come to the chamber. We're going to have the morning roll call. All members present will please vote green to signify their present center chamber and the clerk will unlock the machines. All members voted. Representative Reese, you may want to reconsider. Oh, you got it now. Just checking. Let's be know how you're going to vote all day today if you start off the way. All members voted. All members voted if so, the clerk will lock the machines. Well good morning. It's a great day to be a Georgian. I think we can all agree on that. Doorkeepers. Thank you. Please close the doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by our chaplain who's been here a record. How many times? At least nine times. We still let him come back. It is what it is. After which we will pledge allegiance to the flag of our country. Not going to ask you to stand on what that will be standing at the prayer and we will have a morning order to recognize the loss of one of our finest. We'll ask Pastor Bullock, Pastor Bud, Chaplain Bud to just prayer to remember that situation. So with that, our chaplain this morning will be introduced by the gentleman from the 151st House District, Chairman Mike Chokus. Thank you, Mr. Speaker. It is indeed my pleasure to again introduce you all to my good friend, Pastor Bud Womack. But before I give you a little bit of history about him, I'd like to introduce his wife of 35 years. Ms. Fay Womack, please stand. Let us greet you. Thank you. She's a very patient woman. Anyway, and Pastor Womack has two children, Kayla and Kelsey and Kayla's married to Earl. They have one grandson and he made it a point that that's the one I needed to introduce. Captain, who's two years old and also the light of him and Ms. Fay's life. Pastor Bud is the pastor at life point church in America's and he's also the district overseer for the Church of God. But let me tell you a little bit more about Pastor Bud. He's been shepherding the Georgia, I mean America's Sheriff's Department for 19 years and the Georgia State Patrol down in America's for 11 years. And as many of you know, when people go into law enforcement, it's out of a mission. It's definitely not for the money. And they need support in many occasions. And so I'm grateful and I want to thank Pastor Bud for that service for what he does. He's been a dear friend of mine for, I don't know how many years, 10 or 15 years. And he calls me his job security. So I'm still working progress. But with that, I know we're all anxious to hear the message of Pastor Bud. Pastor Bud, turn it over to you. Thank you. I heard Speaker Burns say a comment a few moments ago about how tall he might be by the end of the day and I just wanted to report that last year I had neck surgery and they put a disc in my neck and picked me up a quarter of an inch and I'm very, very proud of that quarter of an inch. Thank you, Mr. Speaker and Representative Chokus and all this legislative body for allowing me to be here today. Thank you for the service you do for the great state of Georgia. I've always lived in Georgia, don't want to live anywhere else. And you do a great job. I want to thank you for the tax breaks that came. And on behalf of my children who are educators, both of them and my son-in-law, which we only tolerate because he's the daddy of the grandbaby. I'm just joking about that too. But thank you for what you've done for education and for the teachers. They are very, very appreciative of what you guys have done and what you have accomplished for them. I do have to give a shout out. Both of my daughters' classrooms are watching today, Kayla Dupri, is at Sly County Middle School, teaching sixth grade, probably the hardest age to teach. Some of them want to be grown but don't know how to be. And in our youngest daughter, Kelsey is teaching at Lee County in third grade. So to both of them and their classes just want to say hello to them, I always like to start with a humorous story before I get into the depth of the message. And I believe what the Bible says on every aspect and that is that laughter does good like medicine. So I hope that this little story will bring you some laughter and maybe help do some healing. The story goes, one day there was an older couple from the state of Alabama that came over to the state of Georgia on a trip. And the wife was driving and she was extremely hard of hearing. So they put into the service station where there used to be more than just a gas station and the attendant comes to the door to the window of the car and says, how y'all doing? Good to have you. Can I help you? And she looks at her husband and says, what do you say? And he said to her, he wants to know if he can help you. And the lady said, yeah, fill it up, fill it up when you're some gas. And he said, okay, I'll do that. You want me to check the oil? She looked at her husband a little frustrated and said, what do you say? And said, he wants to know if you want him to check the oil. Said, yeah, check the oil. So one by just a few minutes later, the man come back to the window, the attendant did. And he said, it's a beautiful day, isn't it? She said, what do you say that time? Husbands getting a little irritated now and said, he wants to know if it's a beautiful day. And said, yes, it's a beautiful day, sir. And the guy looks at her again and says, can you, you know, it's just a great day and it's a wonderful time. And the woman looked at her husband and said, what do you say? And he said, he wants to know where we're from, Agnes Goodlord. She said, we from Alabama. And the attendant said, whoo, said, the main is a ugliest woman I've met in my life was from Alabama. And she looked at her husband frustrated. She said, dear God, what do you say that time? And the husband said, he said, he thinks he knows you. So I, number one, hope nobody from Alabama in here. Number two, I hope there's not a lady named Agnes. And if they are, that story was not about you. I want to talk to you about a very simple four-letter word this morning called love. Let me give you a story about that's titled for love of Jim. Jim and Jack were best of friends, devoted and separable. So when Jim lost both of his legs and an accident on his job with the railroad, he thought for sure his railroad career was over. And when he was thinking this, the company come up with the idea that they would move him to a lonely little stop more than 200 miles from anywhere. And his friend, Jack, went alone to help him for a while, to get him accommodated, to get him moved in after all water friends forward. Jim had barely recovered from the trauma of the double amputee. And when the railroad had given him the new assignment, and he was now over a signal tower. And it was going to be this lonely place out there that he was by himself living in a little shack and he would go out and switch the railroad tracks. He'd had to live in that little wooden shack about 150 yards from the signal tower. And it's going to be lonely there, but Jack would be in the friend that he was was determined to help him at least long enough for Jim to overcome those adjustments that he would have to make. In the beginning, Jack stuck around mostly for company. And he swept out the shack and pumped water from the whale and he'd bring Jim some food once in a while. All the things that Jack couldn't do for himself was a little signal seat, a little trolley that led from the shack to the signal tower. And every day Jack would push Jim in that little trolley seat several times a day. And he stood there while Jim operated the big levers and moved the tracks around and did the adjusting. As this begins to go on eventually, Jack got so familiar with Jim's routine that Jack started doing all the work himself, giving Jim a break because of his disability. He operated everything, moved the tracks, done the levers, made all types of adjustments. And sure enough, pretty soon in addition to house cleaning and the rest of the things that he was doing, Jack gradually began to take over all the duties that Jim had. And he wasn't even an employee, but he stayed because he loved his friend. There was a lot to remember on that job and a lot to be done and daily responsibilities at the signal house and the signal tower included working the levers and as well as tower controls that open and close slides and things so the trains could get through. But Jack never complained one time. And why? Because he loved his friend Jim. After all, Jim was his friend and is the least he could do for him. For more than nine years, Jack did all that for Jim. For more than nine years, he made the daily trip to the tower to operate the heavy equipment. For more than nine years, he was dedicated to helping his friend because of his love for his friend. Not one accident in nine years, not one misalignment, not one near miss, not one near delay was ever done in those nine years. Not one accident. Jack, however, was diagnosed with tuberculosis and he died after nine years. He's buried in Cape Colony South Africa not far from the outpost where he worked for almost a decade for his friend. His grave is a silent testimony to the selfishness. And by the way, I didn't mention to you that Jack was not human at all. Jack was actually a chimpanzee. And here's what I found out. If a chimpanzee can demonstrate love in that type of manner, how much more can we as human beings display the act of a four-letter word called love? Love is not for hoarding. It's for giving away. Love's not something we just hold on to and pretend that it's all ours and we should get it, get it, get it without giving it, giving it, giving it. There's an old gospel song that used to be sung that God would say I'm drinking from my saucer but cause my cup is overflowed. The truth of the matter is God never gave us a saucer. He only gave us a cup. That's why the scripture says my cup runs over. So it's not for hoarding. It's for giving away. It's doing for somebody else what they can't do for themselves. President John F. Kennedy said this one time, ask not what your country can do for you, but ask what you can do for your country. He was asking how much do you love your country? Dr. Martin Luther King said darkness cannot drive out darkness. Only light can do that. And hate cannot drive out hate. Only love can do that. This is what he was asking. Which do you want more? Lighter darkness, hate or love. We can still love and disagreement. I've been married 35 years as I was previously stated. We've had to love and disagreement. And there ought to have been 75 a.m. right there if anybody's there been married. There were times that we didn't like each other, but we loved each other. So we decided to hang around where she decided to hang around. I shared with my church just yesterday preaching on this very subject that I love my wife dearly. Then our children come along. And I found love on a different level than being married. I told my church and it's a true statement. I was so overjoyed to have children that one of my first things in the morning that I wanted to do, I didn't do it because I thought I'd get kicked out of the neighborhood, but I just wanted to stand on the front yard and put me a fence post out there and get on it and crow like a rooster. I was so proud, so proud. Until one day we had a grand baby.\n\nOh yeah, now the eight men's come rolling in. One man said it like this, grandchildren is your reward for not killing your own children. I thought I'd never get them raised, but more that grand baby. When he looks at me at two years old and says, Papa, play with me. It can be 30 below zero. Papa's going to wrap up and we're going to go play outside if we need to. Whatever we got to do. Papa, I won't. He opened the cabinet yesterday and his parents said, you don't need to be in there. I said, leave that baby alone. Well, Daddy, when we were growing up, we couldn't do that. And I simply told him, because I love him more than I do y'all. Love is a strong word. Would you agree? It's a strong word. But I discovered a love for him like never before. Just the other day, he was putting him in the car. They were about to go home to their house. He had a banana. He loves bananas and he was eating this banana. And he got into the seat and he had about that much left. I'm not a panic person when things go bad. I just accept with him. And he put the rest of that banana in his little mouth. And I said, son, you're going to choke. And it looked like he was choking. So I put my finger in his mouth and swept that banana out of his mouth. And he cried. Big old tears rolled out of his cheek. Poppups took my banana, looked on his face. And I did it because I loved him. I didn't want to hurt him because I loved him. And that night, I had a dream that the same thing happened. And I couldn't get my left leg up in that car to get to him. And then my dreamy was really choking. And the next morning, I woke up with my hip hurting from trying to get in that car. And I thought, why in the world would I dream something like that? Because I love him. Because I love him. Love is so powerful. Jesus said this in John chapter 13, verse 34 and 35. So now I'm giving you a new commandment. Love each other. Those three words, they're so powerful. Love each other. Just as I've loved you, you should love each other. Your love for one another will prove to the world that you're in my disciples. Paul wrote this in 1 Corinthians chapter 13, and it's known as the love chapter. It's about eight verses, but listen to it. If I could speak all the languages of earth and of angels, but didn't love others, I'd only be a noisy gong or a clinging symbol. If I had the gift of prophecy, and if I understood all of God's secret plans and processed all knowledge and possessed knowledge, and if I could have such faith that I could move mountains, but didn't love others, I'd be nothing. If I gave everything I have to the poor and even sacrifice my body, I could boast about it. But if I didn't love others, I would have gained nothing. Love is patient and kind. Love is not jealous or boastful or proud or rude. It does not demand its own way. It's not irritable, and it keeps no record of being wronged. It does not rejoice about injustice, but rejoices whenever the truth wins out. Love never gives up, never loses faith, is always hopeful, and endures through every circumstance. Prophecy and speaking in unknown languages and special knowledge will become useless, but love will last forever. You know, last forever. My friends love is the most powerful tool and emotion that's ever existed. The most powerful one on this earth. And let me share one more scripture with you, very familiar verse, John 3.16, for God so loved the world, that He gave His only begotten Son, that whoever believes in Him should not perish, but have everlasting life. Why would He do that? That four-letter word, love. Love, it's a simple, simple four-letter word, but it can move mountains and it can move people. It can do what no other word can do. Love, love, amen. Will you stand with me? December 2016, we had two officers that lost their life in America. I stood there on seeing loading those two officers, trying to get them an ambulance to help save their life. The most devastating day that I've ever had in my 59 years of living, my heart still breaks today because I knew both of them personally, watched them grow up, seen them sworn into the chair's office, was a devastating time for this family, for the Georgia State Patrol officer, that lost his life. They're hurting a hurt that very few people know about, but those that do know how deep it is. So I want us to remember that family in prayer this morning as we pray. Heavenly Father, we come to you today with graciousness and thanks-given. God today, before we say anything else, before I pray anything else, Lord, I lift up this family of this trooper that lost his life in the line of duty. God, the heartache, the brokenness, the things that they're going through right now, God, is incomprehensible to a lot of people. But God, I know that there's something that you give that nobody else can give greater. And that's just what I spoke about today and that's love. So God, I ask you, in your way, and only the ways you can do, God, to wrap your arms of love and compassion around this dear family, hold them close, Lord, send them people that encourage them and help them and lift them up. And I pray God for comfort for them. Lord, I thank you for the fact that we can come together and we can talk about the word love in such a powerful way. And we can know that beyond a shot of a doubt that you love us, God, we're thankful for that today. God, we're honored to be in this building, at this place at this time. So Lord, I ask for guidance for those that are in this legislative body. God, I pray that love would overshadow them in a mighty way and they would experience deeper and greater than they ever have in their life from this point forward. Lord, we ask that you continue to do great things in our state and we lift up all of our leadership to you today in Jesus' name we pray. Amen. Amen. Would you join me for the pledge? I pledge allegiance to the flag of the United States of America and to the Republic, which stands one nation under God, indivisible with liberty and justice for all. Thank you, brother bird. We appreciate that door. Keepers may unlock the doors. Members, you can join the chaplain of the day for the Wilmaq in the south any room for a photo. Members, our doctor of the day, two doctors of the day, have brought us by Representative Vince Smith, who certainly has been needed in some doctrine lately. We have a husband and wife team, Dr. Anna Cowell and Dr. Ken Horlanger. So if you need their assistance, they're downstairs in the medical office. So let them know we appreciate them being here and thanks for that. Chair recognizes Chairman Tarvan, the Chair of the Committee on Information Notice. Members, if you give him your attention please. Chairman Tarvan. Mr. Speaker, your committee on Information and Audits has read the journal from the previous legislative day and found it to be correct. And on another note, life is like an orchestra. If you wish to lead, you must face the music and turn you back to the crowd. And I'll hold it back. Well, Mr. Chairman, that's profound and absolutely true. Chairman Tarvan, the Chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct, is there any objection to dispense with the reading of the journal that Chair here has done, the reading of the journal is dispensed with, is there any objection to the confirmation of the journal? Chair here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for all the day? Reps. Amestration of the 104th Moose Follomew establishes the order of business in the first part of the period unanimous concerns. Introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for all the day? Chair here's none and the resolution is adopted. Okay, members. Mr. Clerk, are you ready for bills and resolutions? We'll now have Mr. Clerk reading the bills and resolutions. The clerk will read. House bill 1049 by Mr. Williams and in the next part of the period, the bill is approved by the motion. Okay, members. Mr. Clerk, are you ready for bills and resolutions? We'll now have Mr. Clerk reading the bills and resolutions. The clerk will read. The resolution is the clerk will read. House bill 1049 by Mr. Williams and in the 112th, lumps into the 12th, Taylor, the 173rd, work riser to the 157th, bill be total enactment, chapter 52, in total 33, the fish go to Georgia, annotated, relaying the assumption, re-insurance agreements. Insurance. House bill 1050 by Mr. Matthew, act the 74th Hawkins, the 27th green and the 154th, follow the 33rd, Hutchinson, the 106th and others, bill be total enactment, article 1 of chapter 10, A, a title 43, the fish go to Georgia, annotated, relaying the licensing provisions relative to professional counselors. Regulated industries. House bill 1051 by Mr. Bernal, the 77th, Scofield, the 63rd, Jackson, the 68th, Evans, the 57th, Scott, the 76th, bill be total enactment, part two, Article 7 of chapter 14, a title 44, the fish go to Georgia, annotated, relaying the four closure on mortgages. Agriculture and consumer affairs. House bill 1052 by Mr. Can, the 170th, Tickley, the 145th, Huttleston, the 72nd, McCollum, the 30th, meets the 178th and others, bill be total enactment, Code section 485, 7.4, the fish go to Georgia, annotated, relaying the bona fide conservation use of property. Ways and means. House bill 1053 by Mr. Barrett, the 24th Williams, the 148th, Bursinger, the 119th, Clark, the 110th, Kelly, the 16th and others, bill be total enactment, Title 50, the fish go to Georgia, annotated, relaying the state government. Bankson Bankie. House bill 1054 by Mr. Neal, the 79th, Hitches, the 161st, Vance, the 133rd, Huttleston, the 81st, Reeves, the 99th, bill be total enactment, Code section 40, 13, 2.1 of the fish go to Georgia, annotated, relaying the signature on citations required. Motor vehicles. House bill 1055 by Mr. Neal, the 79th, Tyler 173rd, Senator, the 40th, Leather, the 123rd, bill be total enactment, Code section 44, 750, the fish go to Georgia, annotated, relaying the demand for possession. Judiciary. House resolution, 918 by Mr. Mathis, the 149th, Jasper, the 11th, Perkle, 169th, Montenegro, the 17th, Garland, the 19th and others. Resolution designated, the Golden Isle Greenway as an official court or in Georgia. Transportation. Senate bill 355 by Senator Robertson, the 29th, brings the 23rd, Williams, the 25th, and in the Barthay, the 31st in Donazale, the 27th, bill be total enactment, Article 1 of Chapter 2, a title 21, the fish go to Georgia, annotated, relaying the general provisions, regarding elections and primaries. Governmental affairs. Senate bill 358 by Senator Burns, the 23rd, Gute to the 51st, Robertson, the 29th, Donazale, the 27th, and in the Barthay, the 31st and others. Bill Beetotal, an act to amend, Subpart 1, a Part 1 of Article 2, Chapter 2, a title 21, the fish go to Georgia, annotated, relaying the state elections board. Governmental affairs. Senate resolution, 158 by Senator, and in the Barthay, the 31st, the 28th, the 28th, more of the 53rd, Hofstetland, 52nd and others. Resolution, designated in Northwest Georgia, logistics corridors, an official logistics growth corridor in Georgia. Transportation. That completes First Readers. Second reading of bills and resolutions, the clerk will read. House Bill 1033, my representative, the 120th, Smith of the 18th, Anderson of the 10th, Williamson of the 112th, Huttleson of the 72nd, and others, the bill relating to crimes against the person. House Bill 1034, my representative, Franklin of the 160th, corporate of the 174th, Hagan of the 156th, Dickey of the 145th, Parish of the 158th, the bill relating to holidays and disturbances. House Bill 1035, by representative Cooper, the 45th, Hagan of the 27th, the 34th, Stoner of the 40th, Dempsey of the 13th, the bill relating to dangerous drugs. House Bill 1036, my representative, Daniel of the 117th, Dubnak of the 29th, Ballard of the 147th, Jones of the 25th, New of the 64th and others, the bill relating to prescribed course, with respect to competencies and court curriculum and the Quality Basic Education Act. House Bill 1037, by representative, Daniel of the 117th, Hatch of the 155th, Maynard of the 56th, Vance of the 133rd, New of the 64th and others, the bill relating to the Department of Public Health. House Bill 1038, by representative, Daniel of the 117th, Levered of the 123rd, Hilton of the 48th, Vance of the 133rd, Mathiaque of the 74th and others, the bill relating to assault and battery. House Bill 1039, by representative, Hilton of the 48th, Ballard of the 147th, Daniel of the 117th, Mop to hand of the 17th, Sains of the 180th and others, the bill relating to campaign contributions. House Bill 1040, by representative, Hilton of the 48th, Williams of the 148th, Barrett of the 24th, McCollum of the 30th, Chastain of the 7th and others, the bill relating to licensing of mortgage lenders and mortgage brokers. House Bill 1041, by representative Stevens of the 164th, Hitchens of the 164th, P3 of the 166th, Westbrook of the 163rd, Jackson of the 165th and others, the bill relating to creation of the Savannah, Georgia Convention Center Authority, membership and powers. House Bill 1042, by representative, the 95th, McLean of the 109th, Martinez of the 111th, Hestration of the 104th, Clark of the 108th and others, a bill to amend and act, creating the recorders court of Gwyneth County, House Bill 1043, by representative, Hilton of the 48th, Roads of the 124th, Jackson of the 128th, a bill relating to making a finance, commerce and trade, local government, public utilities, public transportation, taxation and revenue. House Bill 1044, by representative, Anderson of the 10th, Thumbs of the 12th, Hawkins of the 27th, Year to the 150th, Leather of the 123rd and others, a bill relating to contracts for public works. House Bill 1045, by representative, Clark of the 100th, Jones of the 25th, Jasper's of the 11th, Barrett of the 24th, Ridley of the 6th and others, a bill relating to elementary and secondary education, House Bill 1046, by representative, Clark of the 100th, Jones of the 47th, Powell of the 33rd, Barrett of the 24th, Matthew, the 74th and others, a bill relating to the sale, distribution, possession of dangerous drugs, definitions, relic to state, health planning and development, home health agencies. House Bill 1047, by representative, Burt of the 20th, a bill relating to individual tax rates, credit for withholding and other payments and applicability to a state's interests. House Bill 1048, by representative, Carpenter of the 4th, Hilton of the 72nd, Cameron of the 1st, Hilton of the 48th, Van's of the 133rd, a bill relating to other state symbols. House Resolution 871, by representative, Coyay of the 102nd, a resolution promoting amendment to the Constitution, so it's provided that members of the General Assembly elected in 2026 and thereafter, she'll serve four-year terms of office, House Resolution 872, by representative, Burt of the 20th, a resolution voting of impeachment charges against Vanity T. Willis District Attorney for the Atlanta Judicial Circuit. House Resolution 901, by representative, Demtie of the 13th, a resolution compensating, Mr. Darrell Lee Clark, a resolution 902, by representative, Demtie of the 13th, a resolution compensating, Mr. Joseph Samuel Watkins, through second readers. Thank you, Mr. Clerk. Okay, members, I'm trying out my old gavel that I broke that's been strengthened, so we're going to try that out, Mr. Clerk. So members, if I can have your attention, we have a couple of members that are serving this body that are on the floor today. I'm going to introduce one of them that I met this morning over at the GMA event. Former Chairman Tom Dixon, Tom, wait a minute, no standing innovation yet. Tom now is the mayor of Varnell, Georgia. He's doing a great job. When he was here, he chaired the K-12 Appropriations Committee, and he and Chief of Staff, and Chairman Knight, and several more of us came into this house together a good many years ago. So welcome, a dear friend, and a great Georgian, Tom Dixon. Reps. Tom Dixon, if you will. This is what happens. AC displacement has this role. What happens if you give it a chance? Sarah, all sorts of visual Hongedo Matters.\n\nGet back here, sir. Good to see you. Appreciate your service as well. We have one more member that I'm going to recognize as soon as I find her. And so you can come in. There she is right there. So a dear friend from down in the Albany used to be, you represent the Albany area, represent Camilla Hobson, now Camilla Hobson Jackson. Welcome to your house, the people's house. Thank you. We miss you. Hope the boys are good as well. Great. Good to have you back. Appreciate your service as well. Thank your members. Three members that we all have good memories of. Mr. Clerk, are you ready? Reports of standing committees that Clark will read. Representative Beth Camp on the 135th District Chairman on Committee and Intergovernmental Coordination Locals submitted the following report. And the speaker, your committee on Intergovernmental Coordination Local. Is that it or it's consideration to following bills of the House and Senate and instructing me to report the same back house of the following recommendations. House Bill 950, do pass, House Bill 952, do pass, House Bill 958, do pass, House Bill 961, do pass, House Bill 972, do pass, House Bill 989, do pass, House Bill 1077, do pass, House Bill 1088, do pass, Senate Bill 338, do pass, respectfully submitted. Representative Beth Camp on the 135th District Chairman. That completes the reading of the Reports of Standing Committees. Third. Thank you, Mr. Clerk. Third reading and passage of uncontested local bills. You will see that we have a local calendar today. Members, we have a local calendar. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Here he known as so-ort. There is objection. Does the lady move? Mr. Speaker, I so move. Lady moves. So members, our vote will be on voting as a local calendar as a whole. The lady has moved all those in favor of voting. For the local calendar as a whole will vote yes, those will vote. Opposal vote no and the clerk will unlock the machines. Have all members voted? For what purpose does will part rise? Mr. Speaker, at the appropriate time, I would like to make a motion to have SB 338 pulled from the calendar and voted separately at the appropriate time. We will close this vote and then we will accept your motion. If the clerk will lock the machine, if all members are voted, I think they had. The motion to vote the local calendar, the age of 67, the age of 65. Now time for your motion. Thank you, Mr. Speaker. I move to have SB 338 pulled from the local calendar because it violates House Rule 18.1 and have it voted separately. You've heard the Germans motion. He has moved that SB 338 be removed from the local calendar and voted separately. Mr. Clerk, will you read the caption? Senate Bill 338 by Senator Sussler, 37th Cobb County, a bill to change the district description of the Board of Education of Cobb County. Now do you all understand what the motion is that this bill would be removed? SB 338 would be removed from the local calendar and voted separately. On the gentleman's motion, that SB 338 be removed from the local calendar. So I passed you as we will vote on the gentleman's motion. All those in favor of the gentleman's motion will vote green, those opposed, will vote red and the clerk will unlock the machine. Parliament. What purpose does... Representative, illustration rise. Parliamentary inquiry. Hey, state you're inquiry. Mr. Speaker, is it not true that SB 338 has been treated the same as any other Senate bill during this biennium with light character? I'm sure the gentleman has read the rules of this House and believes that to be so, for what purpose does will park rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that unfortunately the majority party continues to break decades of precedent by bypassing the local delegation with respect to local legislation? Well, the gentleman's opinion in mind is a little bit different. I think the president of this House that we followed last year by our rules is that we receive a local bill from the Senate. This is the way we did it last year and this is the way we continue to do it now. We may have a little bit different opinion than I respect the gentleman's opinion, but I believe this is the way this House is conducted, this witness, and this is the way we continue to do that by honoring our rules. What purpose does Representative Mayner rise? Parliamentary inquiry, Mr. Speaker. State your inquiry. Is it not true that since this is an election bill that it must be in the Secretary of State's office in order for the vote to happen in the local community? I'm sure the lady knows what she speaks. I'm not sure about the Secretary of State's office. On the gentleman's motion that SB338 be removed from the local calendar and be voted on separately. Mr. Clerk, will you like that machine? I think everyone's voted. On the gentleman's motion, the yeas are 71, the nays are 95. His motion has failed and we will vote on the local calendar as a whole. Mr. Clerk, will you read that local calendar, please? HB950 by Representative Alexander, the 66 Douglas County, HB952 by Representative Anderson, the 10th Habersham County, HB958 by Representative Lada, the 131st Columbia County, HB961 by Representative Lumson, the 12th City of Mendelung, House Bill 972 by Representative Warner III, City of the 4th, O'Goal Thurber, House Bill 989 by Representative Anola, the 42nd Cobb County, House Bill 10, 107 by Representative Levere to the 123rd Lincoln County, House Bill 108 by Representative Lede, the 138 by Senator Sussler, the 37th Cobb County. Is there an objection to the previous question being ordered on the local calendar? Chair, is none the previous question is ordered? Is there an objection to agreeing to report the committee which was favorable to the passage of the bills? Chair, is none the report of the committee is agreed to? Now these bills now pass all of them in favor with the passage of the bills on the local calendar. We'll vote yes. All those opposed will vote no and the clerk will unlock the machines. All members voted for what purpose is representing Bruce Ries? Parliamentary inquiry. Date you inquire representative? Isn't it true that historically we did not require a vote to remove something from the local calendar. And if anyone objected we just took it out. We never had a vote before. Is that not true? Representative I think that's the way that motion was made and that's we followed the process and so that's where we voted. And so I think that's where we are at this point in time. We've voted on the local calendar for what purpose is represented Collins Ries? Parliamentary inquiry Mr. Speaker. State your inquiry Mr. Chair. Is it not true that House Bill 950 is a bill to allow a technology fee for the probate judge in Douglas County? Looks like that to me. Further inquiry please. State your inquiry. Is it not the hope of this representative that maybe with the technology fee that the probate judge in Douglas County would call me back after four calls? Would you mind repeating that? I said I want to make sure they heard it. I said maybe with the hope of a technology fee that the probate judge in Douglas County would call me back after I placed four calls to her. I bet you get a call pretty quick. I'll be watching my phone. Sounds reasonable to me. Reasonable to me. Technology is an amazing thing. All members voted if so, the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 96. The knees are 71. These bills haven't received the requisite constitutional majority or therefore passed. Okay, members, we have a little dilemma here this morning. We have a great group of wonderful guests in our gallery. Each one of them deserves our recognition and our appreciation for them being here. So we have, as they say, a whole slew of, and that's a bunch of morning orders. I think, Ripley and Al Williams helped me with that word a couple times. So with that, we're going to begin our morning orders. One minute, watch your lights and we need you to comply. So everyone can get their morning orders in. Representing Bayesmore. You have a great group here. Representing Bayesmore is recognized for a morning order. Thank you, Mr. Speaker. I appreciate it. And I have my colleague, my seatmate and my sweet mate standing here who stood in for me while I was gone and I appreciate it. And I see some of my students left, but we're going to recognize them this morning. So they are here from Bennerker High and from Fayetteville High School for District 69 High School Checking Day. A lot of times, as we are leaders, we have stressors and we know these are leaders and they have stresses also. So I want to recognize them. I want to recognize Nami for partnering with me and all of the staff too. So if you would stand and please welcome them. Welcome and we're glad to have you back as well, Ripley and Bayesmore. Thank you so much. I'm glad you're feeling better. Welcome to the People's House. Thank you all for being here. And please stop by room 216 to say hello. From 216, I'm going to greet these young people. Representative Edward Jackson, Representative Cummins, Representative Burnout, Representative Davis, y'all have some special friends. So I invite you to recognize those special friends. You have a whole minute. Okay. Thank you, Mr. Speaker. Today, we welcome the members of Delta Sigma Theta sorority and cooperate it to the Georgia Don for their day at the Capitol. They are here to talk to their representatives and observe the legislative process. I would also like to congratulate my chapter, East Point College Park Alumni Chapter of Delta Sigma Theta sorority and cooperate it on becoming the 2022-2023 Alumni Chapter of the Year for the Southern Region. And Representative Douglas has something he wants to say very quickly. Oh, God. I totally hate it. I totally hate it. Thank you. I would like to say that we have the Henry County Chapter down here today. We will be in room 510 with the representatives. If you're on the fifth floor, you're not on the fifth floor. Will you please stop by and say hello. Thank you. Welcome. I was wondering where Representative Jackson was. I'm glad he was a later rival. I'm glad you made it, sir. And we let Representative Douglas come up here because his daughter is a member of Delta Sigma Theta sorority and cooperated. Thank you, Mr. Speaker. Thank you all for being here. We appreciate you all 100 years. Is that right? Uh-oh. Oh, that's him. Way over here. So now we're going to do that. Okay. Thank you all for being here. Congratulations on 100 years. We got it. That's right. Thank you, Mr. Chairman, for allowing me to do this. I did want to introduce the Atlanta Alumni Chapter, which was the first alumni chapter here in the state of Georgia and in the city of Atlanta. I wish that you arise and say, thank you also. Thank you so much. I didn't know. Good to have all of you. Representative Nullowicz, are you on the floor? Yes, she is. I could see you. Representative Deere Nullowicz has recognized for a morning order. Good morning, everyone. I would like to take a moment to recognize from the gallery the Smirna Youth Council. They are here today at the Capitol. If they want to stand, we will greet them. And I'm so glad you all came down and you all have actually got to see some pretty interesting stuff this morning. This morning, Youth Council, they're learning all about municipal government, how municipal works in Smirna and how it works within the state. And I'm so glad they're here today. It's a pleasure to welcome them. Thank you. Thank you, Representative. And welcome to the Youth Group. I saw them on the stairs this morning. It's good to have them. Representative Reese, Representative Hugley, you have some guests as well. Thank you, Mr. Speaker. The National Urban League was founded in 1910, 113 years ago, to provide assistance to African Americans to further economic and social justice. It's a nonpartisan historical civil rights organization that also advocates against racial discrimination in the United States. It is the oldest and largest community-based organization of its kind in the nation. The Urban League has been widely supported by Democrat and Republican presidents of the United States of America. We have two chapters here in Georgia. The Urban League of Greater Atlanta and the Urban League of the River Valley. And we are honored to have here with us today the President of the Urban League of the River Valley, Mr. Tracy Mosley, there in the stand with us. Stand up, Mr. Mosley. Say hello to everyone. Thank you, Mr. Speaker. Thank you, Representative Reese. And welcome to the People's House. The events in Chairman Hitchens recognized for a morning order. Come on down, Mr. Chairman. Clock's running. Chairman Jackson is also welcome as well. Mr. Speaker. Thank you, Mr. Speaker. Today, we rise to acknowledge Georgia Military College Prep School Day. They are the best dressed people in this house today. They have, as part of their curriculum, duty, honor, country, and character above all. And as a parent of two children that have graduated from there, I can truthfully say that that is their mission. Thank you all very much for being here and give them a round of applause. Duty, honor, and mission. Awesome. Good to have you all. You all look great. I love you, uniform. You look very sharp. Cheer Lady Silcox has recognized for a recognition, I think, on her morning order. Thank you, Mr. Speaker. And I rise this morning to commemorate International Holocaust Remembrance Day. The actual day was Saturday, January 27th, but we are not in session that day. So I come this morning to bring this international event to your attention and to recognize some important guests in our gallery. Nearly six million European Jews were killed by the Nazis during the Holocaust. And Poland, a ceremony marking the 79th anniversary of World War II liberation of the Auschwitz Burkinau camp was held. In Germany, people brought flowers and lit candles at memorials for the victims of the Nazi terror. Even Ukrainian President Zelensky posted a picture of a Jewish menorah on X, formerly Twitter, saying that human life must remain the highest value for all nations of the world. So today, I recognize our wonderful state agency. The Georgia Commission on the Holocaust could commend their statewide programs that educate all Georgians on the importance of teaching young people not to hate, of teaching them the value of a healthy democracy so that this horror will never happen again. The Georgia Commission will be in room 230 this afternoon of the Capitol from 1 to 3 so you can learn more about their work. We do have a flyer on your desk this morning that outlines some of their work. And I do want to recognize the following members of the Commission that are here. Executive Director Sally Levine, Chair of the Commission Chuck Burke and Commission member Gary Alexander, please rise so we can recognize you. Thank you, Representative Ed. Welcome. Thank you for what you're doing. Kevin Mac Jackson's recognized got a special mayor here I think. I do miss speaker. Thank you miss speaker. Ladies and gentlemen today I want to welcome to the People's House, the Honorable Mayor of Tental and the Mayor Pro Tem, Mayor Earth of Commons and Mayor Pro Tem, Brain of Crawford. I ask that you stand in the gallery. I ask that you stand so that we can welcome you to the People's House along with Mr. Calvin Jordan. I want you to stand too. Welcome to the People's House. Thank you miss speaker. Tental's a pretty great place. We're glad to have y'all here. Thanks for what you do down there. We'll see more is recognized for a morning order. Thank you Mr. Speaker. Good morning. I wanted to recognize that today was Georgia Municipal Association Day here at the State Capitol and for breakfast at O-Dark 30. Thank you off of the French toast. I have three counties. I'd like to acknowledge the cab county. The City of Stonecrest, our Mayor Kabul is in the house. I just hope she's in the gallery. And there's one of our council women and so are ours. All right. The City of Stockbridge, Mayor Ford and some of our council members, are you here? We had breakfast together. They're here at the Capitol. Welcome and Rockdale County. Mayor of our municipal people from Rockdale County, please rise. Welcome to the People's House. Thank you so very much for being here and thank you all for breakfast. Thank you representative. That's a great group. I made the mistake of looking at when I made a couple of comments over there this morning and looking at the mayor of Atlanta and said, I'm glad to see you mayor and I realize there's another couple hundred of them in the room. I'm like, okay, let's see all of you. But a great group. We appreciate what GMA does and our state and all the cities. So it's good to have tenel here. Chairman Sains, you're recognized for a morning order. Thank you, Mr. Speaker. I think we're all reminded today that our life has made a whole lot easier by local leaders in our districts and I'm lucky enough being the farthest district away. I don't often have constituents and leaders from back home but if y'all will please stand I would like to recognize the city of St. Mary's and the city of Woodbond. My former boss at the Sheriff's Department, Mayor Kizzy Knight, Mayor Pro Temp Lewis Mitchell, City Manager Samantha Young and in St. Mary's Mayor Pro Temp, Lisa James. Thank y'all for being here. Thank you. Thank you. That completes our morning orders, doesn't it? Messenger? Awesome. We're ready to move on to the rules calendar. We have one bill on the rules calendar today and that's HB881, Mr. Clerk, where you read the caption to House Bill 881. My represent of Gollett of the 19th and others to be titled back to amend Code Section 15, 1832 with the official go to Georgia annotated relating to prosecuting attorneys, qualifications commission, authority, membership, expartei, communications, governance, disciplinary actions and confidentiality. This bill I refer to the Committee on Judiciary, non-civil. That committee recommends that this bill do pass by committee substitute. Members, if you'll give the member in the well that we would be presenting the bill, give them your attention. I'm sure there's a couple people who wants to hear what he has to say. Chair, recognize the represent Gollett to present the bill. Thank you, Mr. Speaker. First today we stand at a pivotal moment to reinforce the integrity of our legal system. Last year, as I'm sure you all remember, SB 92 laid the groundwork by establishing the prosecuting attorneys' qualifications council. I'm in commission. Since then, I'm pleased to report that this commission and its investigative and hearing panel members in place and standards and rules established is poised for action. And once HB881 has passed, this commission will not, will be able to begin their real work. That is bring a accountability to those rogue prosecuting attorneys who abuse their office. Sexually harass their employees and do not show up for work. That is reaffirming that our state's prosecuting attorneys will have the highest ethical standards to ensure that those in power and prosecuting cases are not above the law, but rather will uphold the law impartially and justly. And for many members in this body, this commission will give you confidence that each criminal case will be reviewed on its own merits rather than dismissed by a written memo that informs\n\nspecific laws that will not be enforced in areas of this state, basically giving criminals the playbook. Now on to the specifics. Back in November of last year, the State Supreme Court declined to review the rules for the vestigatory and hearing panels, which installed out the ability of the commission to review complaints. To address this issue, we have removed the requirement that the Standards and Rules of the Commission be reviewed and adopted by the Supreme Court. We have also clarified what mental and physical incapacity cannot be. You'll see that it now says a medical leave of absence of less than 10 months, or medical leaves in the aggregate of less than 10 months in a 12-month period does not trigger the mental or physical incapacity section. Lastly, we have changed the jurisdiction of appealing a decision of the hearing panel to the judicial circuit where the district attorney serves, rather than the Fulton County Judicial Circuit. That court's decision is then appealable directly to the State Supreme Court. Colleagues HB881 allows this commission the ability to do the work that we've legislated and told them they need to do. It gives our constituents the confidence that their district attorney and solicitors general will uphold the law impartially and justly. Let's come together to pass HB881 not just as a legislative act, but as a testament to our unwavering commitment to justice and the well-being of our communities. Thank you, Mr. Speaker. I'm happy to answer any questions. The gentleman has completed his remarks. You have a couple of questions. He's agreed to answer them. I will. Minority Leader to your left has a question. Representative has recognized for a question. Thank you, Mr. Speaker. General, you. I do. I'd like to draw your attention to line 15 and 16. As you struck the requirement for rules, she'll be effective upon the review and adoption of the Supreme Court. What is the effect? And you'll learn an opinion of that striking of those two lines. That the rules and standards that's written will they go to effect? Do you not consider that once that is done, that would lead to a minimum or no oversight to be had by an independent body? Well, I believe, I don't believe that to be true, because one, if there's an action that is taken, that is there is an opportunity to appeal that decision through the Superior Court and ultimately the Supreme Court. So their rules, their rules as the action is taken by them is actually does have oversight on the actions that are taken by the body. Thank you. Gentlemen, for the yield. I do. Reverend Lee, say Roberts to your left right in front of you, Representative Roberts. Thank you, Mr. Speaker. Does the speaker or the do you yield? I will. Okay. Sorry, I can't speak today. Okay, so we all know litigation is really expensive. And your understanding of the bill does it cover the legal cost for a DA or a solicitor who has had a file complaint to filed against them and they have to now litigate that. And if not where should they be able to afford that on their current salaries? Yeah, this bill doesn't address the funding of the district attorney. So that's for district attorneys to figure out on their own. If the state does cover that by default, I'm not sure. I can't say they don't, but that's for the district attorneys and solicitors to figure out. Thank you. Gentlemen, has a question to his right and the back representative Montaghan is recognized for a question. Thank you, Mr. Speaker. Representative, isn't it true? I think he yields. I think he's going to yield. I don't know if he is or not to you, but maybe. Yeah, go ahead. Isn't it true that this issue? Was that first arrived in a case out in Pauline County, Georgia? Or a district attorney abused his power and used it to hurt women and others in his office? Yes, absolutely. You serve with me in Pauline County and that's exactly the case. Yes. Thank you. That's it. You have another question if you're yield. I will. Representative Maynard, to your right is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Representative Gullett, thank you for the bill. The very first time that I came to this body, I went up to you and I said, thank you for this bill that you've been working on prior to me even being elected. So again, thank you for the bill. My question for you is this, is it not true that if a district attorney is being charged or not necessarily charged, if a district attorney is being questioned on moral turpitude, if a constituent went to the Georgia State Bar or if a constituent went to that district attorney through the County Ethics Committee, is it not true that they are responsible for defending their character? If it is nothing to do with the duties as a district attorney, just strictly their character. That the bar or the County Ethics will defend their characters, what you're saying? So if a constituent files a bar complaint or ethics complaint against a district attorney based on moral turpitude, the district attorney is responsible for their own legal fees if it's regarding their behavior. I believe it to be true. Thank you. Thank you for the question. Gentlemen, has another question. If you're used, I will represent pennies to your left about the person pennies for recognized for a question. Will the gentleman yield? I will. Isn't it not true that in Paulton County, that particular district attorney was suspended and then prosecuted and disbarred in the process that was in effect? Isn't it true that the process worked the way it should without the need for this council? So no, I would not say that's not true. That district attorney served for two years and was not actually ever in trouble for what he did to those employees. What he got in trouble for was lying in an affidavit after an investigation about offering someone from another county a plea deal in exchange for someone in his office a plea deal. He didn't realize there were recordings happening and the recordings he got caught perjuring himself, which ultimately led to his disbarment. It wasn't anything to do with what he was doing sexually harassing, severely sexually harassing a woman in his office. Gentlemen, has no further questions. Thank you, Mr. Speaker. I ask for your favorable consideration and I yield the bill. In the wisdom of the rules committee, pursue it to House Rule 333.3 debate shall be limited to one hour. So I'm going to divide that hour up between those opposed and those in favor. And I'm going to allow you guys that are on either side of this question to impose your own time restrictions within that 30 minutes. And then we'll also have a minority, minority report. And we finished this discussion. Representative Tony Miller recognized speak to the bill. Representative Miller. Thank you, Mr. Speaker. Colleagues, I rise today to speak in opposition to House Bill 881. Now as Georgians, we know the phrase muddy waters refers to more than just some of our treasured rivers. Muddying the waters means that we make a situation more confusing by introducing unnecessary complications. I submit to you that that is precisely the case with H. Bill 881, the supposed technical fix for the legislation establishing the prosecuting attorneys, qualifications, commission. This is why I rise today as a former prosecutor, both for the state and federal government, and now a practicing trial attorney who specializes in civil rights. We all agree that competent, effective, and fair prosecutors are key to making our criminal justice system more just in our communities more safe. We however disagree that this bill in any way serves that noble purpose. Today I'll speak briefly about two important ways in which House Bill 881 is terminally flawed. First, the commission created by HB, excuse me, SB 92, referenced in HB 881, lacks accountability, transparency, and infringes on voting rights. Second, the proposed commission creates serious, fatal, terminal due process concerns. Number one, instead of creating a transparent, fully accountable commission that respects the voices of local voters, passage of HB 881 would create an unreviewable, disciplinary process susceptible to abuse, would substitute the will of an unelected board for the choice of local voters, and skirt the issue fundamentally raised by the Supreme Court, questioning whether the court has the authority under the Georgia Constitution to approve rules establishing the commission as required by the new law. Far from a fix, HB 881 will only further muddy the waters by improperly blurring the lines between the separation between our three branches of government while creating unnecessary and expensive bureaucracy. As was stated during the debate over then, SB 92, this prosecutorial oversight commission is unnecessary. As the Office of the Attorney General, the Georgia Bar, and even this body itself has the power and processes in place to deal with wavered prosecutors, our very own Constitution already provides a remedy. We have the power to impeach. This new taxpayer funded commission undermines our democracy by silencing local voices while doing nothing at all to make our community safer or remove violent criminals from our streets. It usurps the will of Georgia's voters by putting a politically motivated commission in the business of overseeing duly elected prosecutors throughout our state. Now this commission is different from the judicial qualifications commission because the JQC has the safety net of the Georgia Supreme Court, which this one does not. Now I want you to imagine for a second a duly elected prosecutor being removed by non-elected partisan appointees who have zero accountability to voters. Now imagine that these partisan appointees do not share your political point of view. I hear a lot of talk from my colleagues in this body about the importance of fiscal responsibility and local control in fact during a judiciary hearing in 2023 of which I was a part. While debating then Senate Bill 92, solicitor general Bill Fitch from Forsyth County said this bill does not pass the bar for GOP standards, which are limited government, local control, fiscal responsibility and respect for the ballot box. I challenge my colleagues who are supporting this bill to keep that same energy and trust voters and support local prosecutors by making sure they have the tools, the training, the funding necessary to do their jobs and to make our community safer. Now most importantly let's get to the due process problems with this bill. HB881 fails to provide necessary due process protections for prosecutors. If HB881 becomes law, prosecutors found to be in dereliction of their duties by a vote of this commission would be required to appeal their case to the Supreme Court where they actively practice law. Now most of us know and practice that when prosecutors elected DAAs have issues that are unique to them, personal to them, they're divorced. For example, a custody issue for example, most of the judges in that circuit will recuse. They won't hear it. And the reason why they won't hear it is because of the relationship, the personal relationships that are forged between active participants in our criminal justice system who work together on a day-to-day basis to administer justice. Now that may work out for you well if you as a prosecutor brought up on charges, have a good relationship with your superior court bench. But what about those that don't? That's a practical reality as well. This process as it has been rewritten undermines the core tenets of due process because those personal relationships are apt to influence judicial determinations and compromise the objective evaluation of cases, thus eroding the fundamental principles of the legal system and due process. Threatening the overall integrity and reliability of the court's decisions regarding prosecutor's actions, moreover in this one you need to listen to, it remains unclear based on the drafting of this bill that prosecutors have a right to appeal. This bill bypasses all together the court of appeals. These cases do not and we all should have our state constitution in our desk. These cases do not fall under the category of cases that the Supreme Court must hear under our constitution. It is questionable whether or not the Supreme Court would even have discretionary authority to review these cases. I refer you to Section 6, paragraphs 2 and 3, which explain to you constitutionally what our Supreme Court has the power to do and what it does not have the power to do. I submit to you this body cannot simply put in a line that the prosecutor can appeal to the Supreme Court and have it mean anything. Our Georgia prosecutors must make tough calls every single day, including the disposition of cases they must make decisions based on the law only the law and the facts of a given case and never because of politics or prestige. As a result prosecutors who are simply doing their job face criticism all the time. The commission created by this legislation would provide a venue for these complaints but would not provide those prosecutors facing discipline or removal a solution. At a time when it is difficult to attract talented lawyers to become prosecutors this lack of due process will make it even more difficult. And that matters because without enough prosecutors our criminal justice system will grind to a halt delaying justice for all involved. According to the prosecuting attorney's counsel of Georgia the five year average turnover rate for assistant district attorneys is 25% coupled with a 10% vacancy rate for state prosecutors. In 2021 Georgia saw its highest turnover rate for prosecutors for a single year peaking at 43.5% and eight of Georgia's 49 judicial circuits face assistant district attorney vacancies exceeding 25%. The law itself required that this commission work the prosecutor oversight commission work with pack to come up with rules that will be applicable to the commission. Those rules were then required to be sent to the Supreme Court for final approval. This was supposed to be an important safeguard. And indeed pack did appoint a bipartisan commission to work to draft rules for the oversight commission pack sent those rules over to the commission appointees. Those appointees disregarded the work done by pack ask them about it. The commission submitted the rules that they drafted to the Supreme Court within 30 minutes of receiving input from pack now how much credence did that input actually get. And we all know that those rules drafted by those partisan appointees were slapped down by the Supreme Court. So here we are imagining a commission who is packed with partisan appointments who get to draft their own rules who get to disregard the input of pack and who will now not have any review by the nonpartisan Supreme Court. Imagine them being able to remove duly elected district attorneys. The question we should all ask is who will police this commission who will they be accountable to certainly not voters because they are not elected. This should terrify all of us. We are elected. We have the power ourselves under this constitution as elected legislators in the Georgia Assembly, General Assembly, to impeach wayward prosecutors. Do process already baked in? We should not shirk that responsibility ourselves. Do processes enshrined in our state's constitution? It gives us the roadmap to address exactly what this so-called commission is being charged to do except they will do it with no oversight. And we can do it if such a time comes in a bipartisan way with no cost to the taxpayers and with accountability to the voting public because we are accountable to the public. We must ensure due process protections for those who are willing to offer themselves for service on the front lines of our fight for safer communities. HB881 fails to do this and for that reason alone it should be rejected by this body. If our shared goal is to make our communities safer and not simply punish prosecutors we don't agree with. Then we should be spending our time here promoting proven strategies to prevent violent crime. Such strategies do exist. And I stand here today to tell you that what is proposed by HB881 is not a solution. It is at best an unwieldy, confusing experiment. I urge you to vote no on this bill. Then I urge you to work with us to focus on real solutions, abandon this experiment, and allow the mechanisms and processes already in place. Most importantly that the will of Georgia voters determine whether or not a prosecutor keeps their job. Thank you, Mr. Speaker. I yield the will. The time was paused. Representative Roberts, you have 15-16 minutes. Thank you, Mr. Speaker. Good morning, colleagues. I also rise in opposition to HB881. You know, I've told my daughter since she was little, but when I get angry it's because I'm scared. Scared for her. I've had colleagues here say they're inspired by my passion after a committee meeting. Well, I'm most passionate when I'm scared too. Since my first speech from this well three years ago I have expressed passionately my concern that some in this chamber are grabbing power wherever they can no matter the consequences. Slowly eroding the rule of law. All eligible Georgians are constitutionally entitled to one vote. But some in this chamber think it's okay for them to substitute what they want when they don't like how the people voted. That scares the heck out of me. And it's dangerous for both parties under this gold tone. Why? Because power shifts. Parties have the majority one day and lose it the next. But more importantly this arrogance that we know better than the voters of this state is dangerous for the people. We represent it in dangers there one vote and silences their voices and often the Georgians whose voices are being silenced don't even live in the district where they can hold the offending politicians accountable. Some in this chamber also don't respect our constitutional officers duly elected by the voters of this state. They insist without the same education or access to evidence that their discretion should trump that of our district attorneys. It's disrespectful to our predecessors in this body who granted DA's prosecutorial discretion in the first place. How would we in this chamber feel if someone dared to tell us how to do our jobs? We don't have someone overseeing how we make the laws in this state. Our only our voters hold that power or at least they're supposed to. Last session over the objection of my democratic colleagues and I had this body passed SB 92. The majority passed it over the objection of both Republican and Democratic DA's across the state. It passed despite our laws already providing multiple ways to remove a DA for incapacity or a violation of their oath. And arguably it passed that those in power currently could undo a district attorney election if they don't like who the people chose. So some could disrupt a prosecution of an alleged criminal for political purposes. When we talk about public safety it's dangerous to weaponize these processes to help any alleged criminal avoid being held accountable. Really dangerous because power shifts. So pursuant to SB 92 and because the same political party currently has the majority in both chambers and the governor's office. All eight members of the prosecuting attorney's qualification commission or P.A.Q.C. have been selected by Republican leadership. Down the road if power shifts. Democrats could pick all eight members. But there were two things in SB 92 that gave a glimmer of hope that at least the process might be fair even if the people making the appointments were purely partisan. And that was that PAC had to work with the prosecuting attorneys. I'm sorry the P.A.Q.C. had to work with the prosecuting attorneys counsel to draft standards of conduct rules for the governance of the commission. And the Supreme Court had to review and adopt those rules neither of those things have happened. The P.A.Q.C. never even considered the pages of recommendations from the prosecuting attorneys counsel and instead submitted their own rules to the Supreme Court. And the Supreme Court refused to review and adopt the rules raising constitutional questions about whether that adoption could violate separation of powers. So despite Georgia's highest court indicating its concern about the constitutionality of SB 92 supporters of this unnecessary and expensive commission just won't stop. They're essentially saying to our democratic and Republican DAs are voters and now the Supreme Court. You don't like it. You voted for these people. You think it might be unconstitutional. We don't care. HB 881 removes the requirement that the Supreme Court has to review and adopt the rules even in appearance of fairness in the process has gone under this new bill. During our committee hearing on HB 81 in light of removing this requirement for the Supreme Court adoption my colleague made a motion to amend current law to allow the minority leaders in each chamber to a point two of the five members of the investigative panel and to expand the hearing panel to five members giving a point of power to two members of the minority leaders. Again, power could shift. The attention was to make the appointments more fairly balanced regardless of power shifts in the future. The motion failed. I hear my colleagues routinely justify legislation under this dome saying that we have to restore faith, the public's faith in our government and its leaders. This bill is partisan in all its parts. How does that restore faith in us? At the first available opportunity, SB 92 came lost. Some of my senate colleagues filed a complaint against DA Fannie Willis alleging she was prosecuting Donald Trump for political purposes. The complaint is in direct contradiction to the reason asserted by sponsors who supported it. We heard time and time again in committee meetings. Rogue DAs are not prosecuting crimes. In fact, they added ledges added to the existing law an additional duty that a DA be required to review every case where probable cause for prosecution exists and make a prosecutorial decision. Current Georgia law requires the DA to draw up all indictments or presentments requested by a grand jury and prosecute all indictable offenses. The law is not a political purpose. If you are helping on passing it, why not make it more balanced from the beginning? The people of the state are sick of partisan fighting. They want to see us work together for them. They want processes that are fair to all Georgia's, not just those who are in the party in charge. They want to know that when they vote, their vote counts. That the party in charge won't remove their DA of choice. That the party in charge won't take an end run around the rules to pass local maps that people don't want. They want to be confident that if a majority of Georgians want to...\n\nTalk about certain issues that their voices won't be silenced, that their leaders, no matter which party, will hold hearings on bills that are important to them, bills that offer solutions they want and need. Georgians want to know that we are representing them, all of them. This bill does nothing to restore the public's confidence. The creation of this commission from its inception was to weaponize it for political purposes and now you have stripped the process of even any parents of fairness. Colleagues, let's not give our constituents another reason to lose faith in us. If you vote no on HB-881 today, the PAQC can't do anything because the current law requires adoption of the rules by our Supreme Court and they won't do it. Vote no on HB-881 and this political clown shows stops and we show all of our constituents, Democrat or Republican, that we want fairness in our processes, that when the power shifts, the way we conduct business remains fair for everyone. Listen to the duly elected Republican Democratic DAs, the Supreme Court of the State and the voters and please vote no on HB-881. Thank you Mr. Speaker, I yield the well. The lady is yielded the well, the chair recognizes representative Al Williams to speak to the bill. Thank you Madam Speaker. Usually takes me about eight minutes to clear my throat and get from my seat, but just to remind this House that the problem was supposedly addressing here. Does not just apply to Atlanta and it should not be just responded to by lawyers. I'm just a country boy from down in Midway, Georgia who spent a little bit of time in law school, but I do know the vast majority of people are neither one in Georgia. 53 district attorneys here. I would have liked to, my intentions were in our cut them short, to go through a little history back when these were called solicitors in Georgia. Back when corruption was rampant in a whole lot of our 159 counties and we could exclude Fulton. And all you had to do to be fleeced when you crossed the South Carolina line was have a tag on there was north of the Mason Dixon. And you might stop the pick up a spread, but you might have to wire district attorney to get Weston Union to get you some money just to get out of Georgia. But I never once heard from the well of this House. The idea that we need oversight of district attorneys because we have so much corruption in Georgia. Never once did I hear anybody complain from the well of this House when corruption was rampant in one of our Southeast Georgia counties so rampant until a governor who could ride a bicycle backwards had to go down there and set up a roadside. But we never talked about oversight. Now when we decided the Supreme Court of Georgia is not the ultimate definer of law in Georgia we've really gone off the track. You don't have to always agree. You don't. But right will never be wrong. And one thing about the majority because the majority of the wind does not mean the majority is always right. There are people and I don't refer to just hard work in Georgians. I call them Georgians. I believe in working, some can't work, some disabled, some too old work, but Georgians need justice. And from the district attorney's office if I disagree with it what you're telling me is if you're not a member of the House of Representatives then you can't be disagreed with out in your district because somebody has some oversight. Things get not a handful and I'm closing now but it's getting out of hand because anytime you start deciding law based on what you liked and didn't like politically and not what the Constitution says and the people are still the ultimate decided who we did tell for who live in counties that you elected this district attorney but we know more about you even though I've never been through there. I'm a right legislation to decide that's not how this state was designed to be run. Why do we need a Constitution? Let's just tear it up and say on the whim we can come here and pass laws. We don't need a Constitution who needs a Supreme Court. I don't know what they're talking about. Let's just bypass them. You can't thumb your nose at what's brought us this far. All of this corruption all over Georgia in the days of the Wild West. Georgia worked it out. We're still standing and we didn't have to go in and pluck for corrupt district attorney's went to jail. But I didn't hear anybody stand up here and ask for oversight when a corrupt district attorney in Brunswick, Georgia decided to hide evidence when he bought Albury died. Nobody said it's time now to let's do something about road D.A.'s if they didn't road then grid say grocery. It's been here. We have not addressed it but we worked our way through it because laws are on the book still had it not been for a district attorney from my Atlantic judicial circuit appointed to oversee that case in Brunswick who realized we did not have the staff and turned it over to General Cah and a prosecuting attorney was sent. The whole thing was swept so far under the rug until the rug had bumps in it. But we didn't come up here and philosophize about how we're going to save what happened in Brunswick. How are we going to stop it from ever happening again? Let's don't be selective in our doing good. New good should be almost like the lady justice and lady justice who has a blindfold on for a reason, holding a scale for a reason. But when you let a people under the blindfold and hide the scale you have perverted justice. This is not the place for it. I don't want us history to say. We were a legislative session that just got pay back. Spank folk we didn't like. But we didn't. Don't read Michael to me up here. But it asked us to do justice and we selectively do justice. It's not right or it'll pass but that won't make it right. That won't make it right. But I still believe it in the arc of justice no matter which way it swings. It usually ends up on the side of right and justice. I got enough confidence in this country can overcome even this won't this coming up this day can overcome it getting hard and harder. I was just getting heavier and heavier but I still believe we can overcome it. I didn't get up here. I got a lot of friends in here. I didn't get up here to even hold on to the ones I got a hope for can. I got up here to speak truth to power. When you're wrong you're wrong. I don't care what your designation is. And this little red light says, the either you tired of hearing me but the chair said it's time to sit down. Madam chair much be gone. The gentleman has yielded the well. The chair recognizes representative briefs to speak to the bell. Thank you speaker pro town House colleagues the the state constitution and the US Constitution clearly provide that no elected official should be above the law House bill 881 guarantees that no elected official in Georgia will be above the law specifically prosecutors in Georgia will not be above the law if you vote yes on House bill 881. Judges have the judicial qualifications commission. We legislators have the state ethics commission the House and Senate ethics committee and of course prosecution and public safety law enforcement to keep us accountable in addition to the voters. Last week a senator asked the inspector general to investigate a DA and the response back DA's are part of the judicial branch. In the committee last week we heard that DA's are part of the executive branch. Whatever branch DA's think they are or are are this bill clearly says they are not above the law. Florida has a model that we looked at last session in 2023 where the governor can fire a district attorney just like the Falcons can fire a football coach. That's not this model this model gives checks and balances similar to the judicial qualifications commission. You have heard about impeachment that this body can have an impeachment proceeding during a regular session or a special session that hasn't occurred since the 1960s and it requires a vote which I do not believe would be achieved in here. The argument has been voters alone. Voters alone can take a DA out but we heard in the committee instance after instance of a bad DA whether it's through having criminal activity having nervous breakdown or various reasons across the state over the last 10 or 20 years have six months or a year of disruption in their office that inflicts five years or 10 years of chaos. The vote is not acceptable. The voters want us to establish good checks and balances for prosecutors because public safety depends on it. What this bill says is don't ignore entire categories of laws on the books. That's not prosecutorial discretion if you take the criminal code is that high now in title 16. If you write off an entire category of the criminal code and nullify the hard work of this body in years past that's not prosecutorial discretion. Across the country there's a movement to define entire criminal codes as nonviolent offenses and not to give the retention and smashing grabs that's not a nonviolent offense that can be written off car break ends that is not a nonviolent offense stalking that is not a nonviolent offense for anybody who was ever encountered that riots. Those are not non nonviolent offenses that can be ignored and written off. We heard earlier about assistant DA vacancies and that they are at high numbers but I would ask you to look in your area about those vacancies from 2020 to the present and ask why they have occurred it is demoralizing to officers on the streets as well as to career prosecutors when they see entire sections of the court. The criminal code written off the books by prosecutors by politics by partisan politics because the ones who suffer are homeowners and citizens who are getting their cars and their homes broken into that's just not right. There was also a reference about cases in recent years and the response to it. I would point out that before Representative Gullet spent years working hard on this issue that state representative Bodie a former member of this body who is a Democrat he is the one who started this idea and we salute him for doing that and that was in response to abuses of process. The public safety and criminal code shouldn't be watered down by partisan politics. Georgia should have a non partisan law enforcement and public safety approach. Georgia citizens deserve to be safe in their homes and their businesses and parking lots that they park in. This bill focuses prosecutors on putting criminals behind bars and away from partisan politics. That's what House Bill 881 is about and we request your support for it. The committee did its work again this year if this bill is better than it was the last time that you voted for it. Thank you. Gentlemen is yielded well the chair recognizes representative Maynard to speak to the bill. Thank you Madam Speaker. Thank you for my colleagues that have already spoken to the bill. I want to start by just saying we talked a lot about this bill is a partisan bill. I want to reiterate that a Democrat representative Tramil at the time in 2020 HB 1214 similar bill. Why we don't like it now why the other party doesn't like it now I'm not sure. HB 37 that was Nikki representative Nikki Randall and representative Sandra Scott again a prosecutor oversight bill. Now we don't like it. How did this start I was elected in 2020 when I came in in 2021 I was reading through the code not the code but I was reading through the legislation that was coming forward and I saw that representative gullet had a prosecutor oversight bill. Now as the victim of stalking and what I have personally gone through I went up to representative gullet this is prior to Donald Trump being indicted I went up to representative gullet and I say representative gullet this has happened to me I had a rogue prosecutor in Fulton County this happened to me I want to sign on to your bill. January is stalking awareness. California had the very first anti stalking laws on the book because Rebecca shaffer was murdered. This is a crime that does not receive attention it needs most victims are haunted by stalking Georgia's Marcy's law gives protections to women and men stalking victims but prosecutors. Prosecutors do not have to prosecute this bill if they don't want to in fact the United States justice department said stalking is one of the number one crimes that prosecutors just don't get. Many prosecutors don't take stalking seriously yet women die at the hands of their stalker daily women repeatedly ask for help and repeatedly die because prosecutors choose not to prosecute these crimes. Stalking is a high risk factor for death 54% of female homicide victims report stalking to the police before they die. 46% of stalking victims experience at least one unwanted contact each week. Two-thirds of stalkers pursue victims at least once per week. Gracie thinks 23 fatally stabbed ten times by a stalker but her complaints were ignored. Zora Sadeji, I'm probably saying that wrong, makes she rest in peace, requested a protective order to last 99 years because she knew her stalker would never leave her alone. She did that right before she was murdered. Prosecutor did not hear her cry. Jessica Smith killed with a PIXX after she was murdered by her stalker the family said what good is it getting a protective stalking order if nobody enforces it. Shana Grice murdered after the criminal justice system failed her reported attempts to get help. In the past 30 days my colleagues, my friends, I called 911 three times in the past 30 days because of a stalker. After he served one year, he came to this capital, he is on state trooper video, lying saying that a state attorney asked him to come up here to my job. Several weeks ago I had to seek another protective order because a Fulton County judge never ruled on my extension request. In 15 minutes at 12.30 I'm supposed to be online for my TPO hearing but guess what? The sheriffs have still not served him. So I'm going to have to wait again. We're going to have to postpone my trial so I can get another stalking order. During National Stalking Awareness Month we should all want to shine a light on the incidious crime of stalking, recommit to protecting survivors and reaffirm that every American deserves to live free from fear, intimidation and threats to their well being. Annually, 3 million people, 16 are older are victims of stalking, whether it's in person or online. The criminal justice system lack less to response to stalking, encourages stalkers to become bolder in the future than before. And you're right, this is about relationships. Someone that was opposed this feels said, prosecutors don't need oversight. Prosecutors don't need oversight because they do the right thing all the time. Let me tell you why that is not true. In a Fulton County DA's office, when I met with the DA, I was concerned of the conflict of interest happening between her and my stalker's attorney. My stalker's attorney was the county commissioner. The county commissioner does the budget for her office. That is a conflict of interest. Then I was concerned that the Fulton County DA, I was concerned about a judge because someone from Fox 5 News contacted me and said someone in the Fulton County DA's office contacted them to let them know that they were in the office. They were in the office with them, no, about improper conduct happening on my case in Fulton County. When I went to the DA, she said she chuckled. She chuckled and she said, because this was about a judge, we know which judges do favors for this commissioner. Why do I say all of that? I say all of that to say I have done a lot and it's not just me, it's other victims throughout the state of Georgia. I have done a lot to try to protect myself when I should not really have to go through everything I've gone through. Just recently I did a bargain point. It's 255 pages to go through a professional code of conduct. This bill would allow people to just go to the qualification commission. We do it for judges, we do it for other people. This makes it easier for victims. And I want to end there, I yield the well, thank you. The lady is yielding the well. The chair recognizes representative gains to speak to the bill. Thank you, Madam Speaker. There's a few points that I wanted to respond to that came up from the minority party's comments earlier and just respond to those. And there's so many to respond to, but I wrote down as quickly as I could, some of those remarks made just everything from saying that the appointees to the commission ignored the PAC's recommendations and submitted the rules within 30 minutes. I think we're given those recommendations 30 minutes before the deadline and so they had to complete the deadline and do their job to submit the rules on time. One other was that the state Supreme Court slapped down the legislation we passed last year. That's not true. The Supreme Court had a very narrow order that this bill addresses. The Supreme Court did not slap down our bill. In fact, it was also brought up about the constitutionality of the legislation passed last year by Representative Gullitt and Senator Robertson. And I want to read from the Georgia Constitution where it actually specifically outlines and contemplates legislation like we have here today. Article 6, Section 8, paragraph 2. Any district attorney may be disciplined, removed, or involuntarily retired as provided by General Law. That's what we passed last year. That's what this legislation does that gets up and moving. And that's why this legislation is so important because we can't wait any longer. The appointees are done. The funding is there. The rules and regulations are ready to go. This bill simply gets the prosecuting attorney's qualifications commission up and running. And the reason we can't wait anymore is because if you talk to victims across this state of district attorneys who are not doing their job, you'll recognize why we can't delay this any further. I visited in my district. I know last year I'm not going to relitigate it. But last year I went through issue after issue with my district attorney, Debra Gonzalez and Clark and O'Coney counties. Well, just since that we've had the first Marcy's Law Violation and State History by our district attorney. Victims who are not having justice talked to families who I think about two cases in particular where I had the chance to talk to two fathers of young women, one whose daughter was killed in a car wreck by a drunk driver. And there was no justice for his daughter. Talk to another father whose daughter committed suicide because of lack of prosecution by our district attorney. So tell those victims across this state and there's plenty of others whether it's in Clark and O'Coney counties or other parts of the state. Tell those victims that we don't need oversight for this year's attorneys. They deserve to have their voice heard. They deserve to make sure the DA's are actually prosecuting the law that we pass year after year making sure that they're doing their job. So this what this bill is all about is getting that commission up and running and making sure we're looking out for victims. And I urge those in this body to vote yes, Madam Speaker I yield the will. You were not looking behind you. I'm honored to be associated with Pro-TM Jones I can show you that. I want to speak to a rule 1.3 in the rule book. The rule does allow the mention of a member's name as long as it's not done in an evidently manner. Here's my rule. That's a fine line. I believe the best posture for this house is not to mention any one's name any former member or current member. They refer to them any more general sense if you will. I think you can get the same impact with your comments. I believe it allows this body to function properly. Any very professional matter. I hope members will comply with my request on that. If we go forward, I'm not calling anyone specifically out. It's been a question in my mind in the first 10 days. As we go into the 11th day and I'll ask members if you will comply with how we'd like for this house to move forward in the future. So if you will, as we move forward into the next phase of this discussion. Is there any objection to the previous question being ordered? Chair here's none. The previous question is ordered. We'll move into the minority report. Now we have 20 minutes for the minority report. Our first speaker will be representing Stacey Evans. Representative Evans. You have up to 20 minutes. Thank you, Mr. Speaker. Good afternoon, colleagues. I want to step back for a second and talk about why we're here right now again. I think this is the, I don't know, fourth or fifth time I've been in the well to talk about this prosecutor oversight commission. Why we're here now is because we thought as a body at least in spite of all the other problems about this commission. We thought at the very least the rules that are going to be set up by this commission should be reviewed by someone. We decided that the governor signed that. We thought it should be the Supreme Court. The Georgia Supreme Court looked at their own jurisdiction, their own oversight power, they had concerns. They said we don't think we could do it. So what's our answer? No oversight. For a body so concerned about oversight. When the person we picked to do the oversight said they can't do it, we didn't pick a substitute overseer. We just said we're good. Don't oversee us. Ladies and gentlemen, for your side note, I think this is the first time I've been in the well that I've had to use my reading glasses. I came here as just a baby and I've grown so mature. The other thing that is new in this bill is some discussion about, well, I'm not sure that it's new, but actually it isn't. We've discussed how the Superior Court is going to hear the appeals if somebody doesn't like what the oversight commission does. And then that's going to be directly appealable to the Georgia Supreme Court. And we've heard concerns here today and I think they're right that the Georgia Supreme Court is probably going to tell us again they don't think they have the ability to do it. So are we going to come back again? It's been more time on this to pick somebody else to have these appeals go to. Here's a change that I found really disturbing and I just noticed that this morning as I was getting ready to come up here. The appeal is going to go to the Superior Court where the DA has his or her job and we've already heard concerns about the relationships there. Without a jury, again, for a group of people that are so concerned about oversight, we're going to put this appeal in the hands of one person who everybody acknowledges likely is going to have some relationship with this DA that may be good, that may be bad for the DA. But no oversight.\n\nof anyone, no jury, no voters. I heard that this, I heard a lot this morning about how this is about victims of crime and how we can't continue to let victims of crime not have their, not have these crimes prosecuted. Is it really that or is it that we want different things prosecuted? Is it really this or is it possible that this isn't even partisan these decisions to prosecute, but that beyond a reasonable doubt, which is what a prosecutor has to prove when it takes a case before a jury is hard. And so we hear horrendous things in the news, we hear horrendous things in our communities, but we don't have to stand in front of a judge and jury and bring that case. We don't have to worry if we have enough evidence, we don't have to worry if we can meet that very, very high standard of beyond a reasonable doubt. Is it possible that our DAs want to bring cases that they can win? Is it possible that our DAs want to bring cases that their communities want them to be spending time on? I think that's right. I want to address another thing I heard this morning that why can't we just, and this has come up a couple of years as we've been debating this bill. Judges have oversight with the JQC, why can't the prosecutors have oversight? Here we go again, ladies and gentlemen, write it down. Not all judges are lawyers. That means not all judges are overseen by someone like the State Bar. Every prosecutor is a lawyer, which means they are overseen by the State Bar. If you've been watching the news lately, you know that every prosecutor who brings a case, their conduct is overseen by the judge in that case. State Bar, judges in the case, you know who else oversees elected DAs, prosecutors, the voters. If the DAs are not spending time on the crimes that the community wants to see prosecuted, they can do something about it. The oversight is there. You know, it is so easy to tell other people how to do their jobs. Isn't it? I mean, don't you feel like that when you go home sometimes? Somebody's telling you you should have done this, you should have done that, you did this wrong, you did that right? It's really easy to complain from the cheap seats. You want to pick what a DA does? Run for DA. If you don't have a law degree yet, go get one and then run for DA. How about we do our jobs? There are so many things that need addressing in our State that only we can do, only us, no one else. Not DAs, not judges, not the federal government, not the Georgia Supreme Court, us. How about common sense gun safety legislation to address the number one killer of our kids, our babies? Nobody else can do that in the State except us. How about healthcare legislation to make care more affordable to address the number one reason that people file personal bankruptcy? Only we can do that. We have limited time here. You all know that. We're already a quarter of the way done. What have we done? What's our scorecard look like? We have a limited amount of time. Let's not spend it again trying to add oversight to a group of people that are already overseen. And consider this. If you don't want to address those pieces of legislation that I laid out, common sense gun legislation, healthcare legislation, whatever the case may be, think about it. Is it in your discretion to decide what legislation you spend time on? Probably. You can't do everything, right? We can't solve all the world's problems in one session. Well, a DA can't prosecute every case during their term. Prosecutorial discretion is not a problem. It's necessary. Let's stop trying to oversee people who are overseen. Stop trying to get away from our own selves being overseen and just do our own dang jobs. Thank you, Mr. Speaker. I yield the will. The lady has yielded the will. Representative Sam Park has minority whippers recognized to speak to the bill representing park. Sam, you have like 12 and a half minutes. Thank you, Mr. Speaker. I rise in opposition to this dangerous bill that will undermine the will of the people. As noted by the solicitor general from Forsyth County in the Judiciary Non-Civil Committee on January 22, 2024, this prosecuting attorneys qualifications commission does not reflect principles of republicanism and it is always dangerous to create rules to overcome results you do not like. It has been said by the author and supporters of this bill that this is not a partisan issue. It only members of one political party are currently able to appoint individuals to the five member investigative panel and a three member hearing panel. Moreover, its initial utilization has had clear partisan and dangerous implications and trying to undermine an ongoing criminal investigation based on a grand jury indictment issued by Georgia citizens. It has also been said by the author that the purpose of this bill is to restore trust and confidence in our courts and our system of justice, our judicial branch of government. Yet efforts to ensure by partisan oversight by amending this bill were explicitly rejected in committee that would have helped build that trust. Moreover, as we've seen this new commission operate in practice, partisan conflicts of interest are made manifest. As a partisan elected official has a power to appoint people to this new panel and at the same time file a complaint to this panel. How do you think that a point he will act? That clear conflict will further erode confidence that the will of the people govern here in the state of Georgia. On its face, this bill seems simple. Based on my experience down here when I hear one of my colleagues say this is a simple bill, that's a red flag that necessitates further scrutiny and examination. So if this bill passes and is signed into law, what is its effect? Currently the prosecuting attorney's qualifications commission, which is currently being litigated on the grounds that it is unconstitutional, is stalled and inoperative. Because the Georgia Supreme Court on November 22, 2023 issued an order declining to take any action regarding the commission's draft standards of conduct and rules for the commission's governance. Per OCGA 15832 subsection G, standards and rules that would govern the commission would only be effective upon review and adoption by the Georgia Supreme Court. Per that very short six page order, if the statute or if this bill we are voting on mandated the Georgia Supreme Court to approve draft standards and rules, they would be required to decide whether such a provision was consistent. So if such a provision was constitutional, and if so, the Georgia Supreme Court would comply. Rather than, however, rather than trying to ensure the rules and standards governing this commission would be reviewed and adopted by the Georgia Supreme Court, comprised of nine nonpartisan justices, this bill seeks to bypass the Georgia Supreme Court altogether. So you can see online 15 to 16, which my other colleagues have also mentioned. Rather than nonpartisan statewide elected justices creating the standards of conduct and rules for the commission, it will be partisans appointed by partisans who create their own standards of conduct and rules for a commission that is empowered, empowered to undermine the will of Georgia voters. Furthermore, without needing approval from the Supreme Court regarding its governance, once this bill is signed into law, the commission will be able to unilaterally proceed and have the ability to interfere and undermine an ongoing criminal investigation against Donald J. Trump. From my Republican colleagues across the aisle, I want to make it crystal clear that by voting for this bill, you are taking action to protect former President Trump from an ongoing criminal prosecution. It is unfortunate that the same partisan politicians who support this dangerous bill, who also voted for racially gerrymandered mass that prevent the people from freely electing their representatives, along with voting for legislation that imposed barriers to the ballot box, are seemingly unable or perhaps afraid to trust the will of the people, the will of my fellow Georgians, what a sad day in Georgia. But one that makes clear the priorities of today's majority party, partisan politics before the will of the people, the pursuit of power before bipartisan efforts to serve the people of Georgia. I appreciate the bipartisan opposition last year to the creation of this hyper-partisan, undemocratic commission, and I urge all members of this body to vote no. If you want to demonstrate that you trust the people to hold their elected officials accountable, vote no. If you want to demonstrate respect and trust in our American system of justice, and that you will not take action to undermine an ongoing criminal investigation, vote no. If you want to demonstrate allegiance to the principles of republicanism, to foundational values of liberty and an alienable individual rights, recognizing the sovereignty of the people, not partisan politicians, as a source of all authority and law, vote no. With that, thank you, Mr. Speaker, I yoke the well. Gentlemen, as you did the well, that completes the comments on the minority report. We will now hear from the chair of the committee from which it came. Chairman Tyler Paul Smith for 20 minutes, as he allocates all 20 for himself, for whatever his allocation may be. Chairman Smith. Thank you, Mr. Speaker. I yield a portion of my time to the majority whip and the gentleman from the 19th House District. We'll, Burshiett, from down in the Wakefalls area, is recognized to speak to the bill. Thank you, Mr. Speaker. I won't take too much time, folks. I know we're getting close to lunch, but I did want to come in here and, you know, speak to this bill. I want to speak to the bill, but I also want to speak to some of the comments, because again, you know, I'm sort of a one-trick pony. I like to read the bills that we put on the floor here, and this bill doesn't constitute the oversight commission. The oversight commission has already passed. We passed it last session. I know that everyone knows that in here, but it appears as though they don't. My colleagues on the other side, and good friends and very impassioned speeches, spoke to the underlying bill, Senate Bill 92. That bill is long gone and passed. This bill simply is a correction and to speak to that correction. First off, I want to say many of our folks that came in here and gave a speech, mentioned the fact that we shouldn't tell people how to do their jobs. Well, folks, we're the policymakers. That is exactly what we do. We draft the laws to tell them how to do their jobs. That is what we do. So that I want to make sure that we're clear on that. I think everybody knows that, but that's what we do here. We draft the laws that people adhere to when they're doing their job. And my very good friend, Parks next to me, there in the chamber in the parking lot, he says that we, the majority party, somehow supporting this bill is intertwined with the support of Jerry Mandarin of our districts. Well, I think we've seen that the courts have sided with this chamber, right? Sided with us. And I would just direct my friend to look to the courts and their opinions. We are doing what is right. We're doing the good work of the people of Georgia. So we're policymakers one. And where do we derive our authority? We derive our authority from the Constitution. The Constitution, folks, Georgia Constitution. And it's already been read once. And I'm not going to go after my good friend, the vice chairman for reading it out, but I want to read it again because it bears repeating discipline, removal and involuntary retirement of district attorneys. District attorney may be disciplined removed or involuntary retired as provided by general law. So that's policy makers, the legislature. We passed the Senate bill 92, a provision that constructed an oversight commission. And what that oversight commission does is investigate and then discipline any attorneys, district attorneys. We're adhering to the construct of our Constitution. Right here it says it plain as day by general law. We have that authority. We do it every day. It is written in plain and black and white right there for you to see if you go and look at it. I can point it to you if necessary. We can go and look and see that we have the authority by general law to do exactly what we're doing. I can't I'm not a good speaker as some of folks in here and one of my good friends from South Georgia. He mentioned the fact that we had an awful case down on the coast that we recall in a mod arbor. Well, one one thing that is enlightening is that members of the minority party put forth House bill 1214. Guess what House bill 1214 is? It was all minority party signers and the leader of the minority party at the time. It is this bill. It is Senate bill 92. It is almost exactly the same bill. The same provisions for appointments from the governor, same provision for appointments from the speaker, same provision for appointments from the lieutenant governor. The only thing was it was so hastily put together that it still had references to the JQC over there. It was just basically the same language. And that's essentially what we're doing here. What we've already done. We're just we're just fixing something now to the Supreme Court. What does the Supreme Court said? I think they you know gave us a wink. They're saying what branch what branch is the the district attorney's in? They're in the judicial branch. They are in the judicial branch. Now there's some court cases out there contending whether they are not. Well, what the Supreme Court said was our bill Senate bill 92 required that they approve the rules. They may approve the rules. We didn't mandate. They may approve the rules. Well, they looked at it and they said well this may be an overreach on our part. If we jump into what clearly is delineated for the legislature to discipline DA's. If we approve those rules and we're jumping over into another branch of government. We are going beyond what the Constitution says we can do. So they said you know we were going to refrain from that. We're going to we're not going to go and reach into somebody else's ballgame and make a determination of what shouldn't shouldn't happen. They just they gave us a wink and that's what we're doing. We're fixing that. We're striking that provision. The commission is ready to go to work. We've passed a Senate. We're hopefully going to pass it here today and I'm hoping that you all support it. The Supreme Court told us they cannot approve the rules. We're striking the rules. That's this as simple as that folks. We're not creating this commission. The commission is already there. They're ready to go to work. Let's just pass this bill. Strike this one provision out. One of my good friends says when you're wrong, you're wrong. Talked about a lengthy history of of DA's having mishaps or are acting inappropriately. Well, it appears to me that my friends in the minority party can't figure out whether or not we're wrong or we're right with the passage or at least the dropping of a bill that mirrors exactly Senate bill 92. And when full support of it then for a nasty case down in the coast that we all can agree on. But when we come now and now because we have an issue in Fulton County and we have an issue with a former president, now it's all a sudden political. It was supported supported 2020 but not supported 2024. That's very it's very hard for me to understand why everybody can support it in one year but just two years four years later no more support. With that, Miss Speaker, I'm going to yield a well but I want to ask my friends just think about this folks. This is what we're here to do. And there was a ton of testimony about the changing of power and the ability for the appointments to change. But the fact of the matter is listen if the structure of the house and the Senate change the every bill can be rewritten every law can be rewritten period. That's just the way the way there's elections have consequences folks. I'm pleading for you just let's just pass this and understand what we're doing here. We've already set this commission up. It's a done deal. We're strictly making a correction from the wink from across the road. I appreciate it and I yield the well. The author of the bill represented gullet is recognized to speak to the bill. HB881 represented gullet. Thank you, Mr. Speaker. We heard a lot from my minority party today. I do hope the members of the media fact check things that were said. I think that's vitally important. Number one, one of the most important that's been mentioned. And I wasn't here back during the times my friend from the coast mentions related to district attorneys, but I am here now. And that's why we're taking action. House built 1214 and 2020 members in this body still here today. We're signers of that legislation from the minority party. House bill 143 and 2021 members in this body here today. Look it up. Get on your phones. Look up 2021 House bill 143. See who are signers on that legislation. They're here today. I can't wait to see the votes. I really can't. As far as it's been harped on a bunch, I just want to say one more time. This bill, the appointment to this bill are no different than when the minority party drafted the legislation. No different twice. Not just once twice. But now there's a problem. It's absolutely amazing to me. But again, we're here. To have oversight of our of our road delays to make sure they're doing the jobs that they're elected to do. To make sure that they're holding their offices with an ethical and ethical ways and that they are supporting public safety back home. You can't say I'm not going to prosecute a wide range of bills and expect people back home not to do those wide range of offenses. I can go do these things with no with no repercussions. That's what this bill does. Terribly sorry about what happened in Glen County. Terribly sorry what happened in Columbus. Terribly sorry what's happened kind of all throughout the state, whether you're Republican district attorney, whether you're a Democrat district attorney does not matter. We've had problems on both ends of the spectrum and that's what this bill is going to correct. Thank you, Mr. Speaker. I yield the rest of my time to the chairman of the committee. The chair of the committee weighs that completes the discussion. That completes our discussion on HB881. We've heard a thorough debate at this point in time. Is there any objection to adopting the committee substitute? Chair has known the committee substitute is adopted. Is there any objection to agreeing to report the committee which was favorable to the passage of the bill? Chair has known the report of the committee has agreed to shall this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purpose does chairman Petrie rise? Parliamentary inquiry. State you in court. Mr. Speaker isn't not true that there are heap of family members in Chatham County whose family members are victims of violent crime will rejoice in the passage of this bill. Well, the chairman is from Chatham County so I'll have to take him that he knows of what he speaks. For what purpose does leader Beverly rise? Thank you, Mr. Chairman. Parliamentary inquiry. State you in court. Isn't not true that the former leader and former whip of the minority party filed a similar bill because there were three Republican DA's in South Georgia who refused to hear the mod Arbery case. I'm sure the gentleman believes what he speaks. My recollection is that this house did outstanding works and justice was served in that case. Further Parliamentary inquiry, Mr. Speaker. State you in court. Is it not true that Republicans wouldn't even give us a committee hearing when we filed this bill? Is that not true? I'm sure you've looked back at the record. My memory does not reflect on that specific point but I'm sure you did lots of talking about it at time. For what purpose does RIPSA say in German say in rise? Parliamentary inquiry. State you in court. Is it not true that a mod Arbery case has been mentioned several times today in that the current district attorney, the one that was replaced by the voters of our circuit, heavily supports this legislation and he has no better insight than anyone else in this body to know that this rectifies some of the systematic failures that occurred there. I thank the gentleman's from down in that part of the state. So I'm sure he knows what he speaks. For what purpose does RIPSA draper rise? Thank you, Mr. Speaker. Parliamentary inquiry. State inquiry. Is it not true that one of the first actions taken under this commission was to file a complaint against a district attorney who is leading a criminal prosecution against former President Trump? I don't have to go back and look at the record on that one. But I'm sure the lady believes what she speaks. Thank you, Mr. Speaker. For what purpose does chairman Tyler Paul Smith rise? Parliamentary inquiry. State inquiry. Mr. Speaker, is it not true that we have before us House Bill 881 and not Senate Bill 92? That's an astute observation. And Mr. Speaker, further parliamentary inquiry. State inquiry. Is it not true, Mr. Speaker, that this bill House Bill 881 is in response and does respond so accurately to the Supreme Court order and also make sure that the process is fair to those who are brought before this commission? Is that not true, Mr. Speaker? Well, Mr. Chairman has a learned counsel in someone who heard this bill in your committee. I'm sure you thoroughly vetted this issue so it does comply. So we appreciate your work. For what purpose does will park rise? Parliamentary inquiry. State inquiry. Is it not true that SB 92 has been repeatedly referenced because that oversight prosecutorial commission has been stalled and is currently in operative because the Supreme Court declined to approve the rules in which this bill will reactivate and allow that commission to proceed. Is that not true, Mr. Speaker? I'm sure a part of that is true, Mr. Will, but I think the learned chairman sits to your right just made a statement along those lines. For what purpose is referencing Miller rise? Parliamentary inquiry. State inquiry. Mr. Speaker, is it not true that HB 881 does not provide a right to appeal to the Georgia Court of Appeals for a prosecutor who is disciplined or removed? Sure, the lady has a strong opinion, strong facts about her situation. She believes that. Further inquiry. State chamber. Is it not true, Mr. Speaker, that HB 881 does also not confer jurisdiction on the Georgia Supreme Court to hear the case of a prosecutor who is disciplined or removed? I'm sure the lady has her reading of the legislation, but I'll go back to my point. I think it's been thoroughly vetted in the committee to comply with the Constitution and laws of this state. And every member of this house will have an opportunity to, as they have now, show their vote on this. We have two more that I'm going to take. I'll hear from Representative Odin Sanyay for a question for what purpose is represented rise? Thank you, Mr. Speaker. Is it not true that this bill— Is this a Parliamentary inquiry? Parliamentary inquiry. State inquiry. Is it not true that this bill that we're voting on today is politically motivated? I don't know. Many things you're doing is placing that are politically motivated, sir. I think what we've heard is there's been a thorough vetting on—\n\nthe other side of the aisle and the chairman's made his statement on what he listened to. One more inquiry, Mr. Speaker. The State's inquiry. All right. Is it not true that by moving forward with this bill, members are setting a wrong precedent that might end up biting in the foods down the years? I'm sure the gentleman believes that. And that's what his vote will reflect. Well, we have no more polar meaning in parliamentary inquires. So we have all members voted. If so, the clerk will lock the machine on the passage of HB881. The Yays are 95. The Nays are 75. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to a group, a group of privileged resolutions? Honoring the life and memory of Collette Lewis and Gundby. Honoring the life and memory of Cameron Jackson. Honoring the legacy of Zach and Camilla Hubert. Recognizing commanding the Samira Fasili for her public policy work on economic, industrial and supply chain issues. Recognizing the 2024 banard Rustin, Audrey Lord, breakfast, recognizing commanding Dr. Syed Rashan name for his academic impact on the students in Georgia. Commending Dr. Winita Bino. Commending Palmer Williams, Jr. Recognizing February 2024 as American Heart Month in Macon, Bibb County. Recognizing commanding runs with Kiwanis upon its 100th anniversary, recognizing commanding Georgia State University, legislative health policy certificate program, and advanced health policy institute. Commending the Atlanta Jewish Film Festival and recognizing his 24th year, congratulating the Perry High School Panthers football team for winning the 2023 G. S.A. Class 4A State football championship, recognizing commanding Tony Guerrero, recognizing commanding the damn Dillon. Recognizing May 5th to 11th, 2024 as Tardive Diskinesia Awareness Week. Recognizing Hemophilia of Georgia and for other purposes that completes the reading with privilege resolutions. Is there an objection to adopting the privilege resolutions? Chair has known that the resolutions are adopted. We're going to move on to afternoon orders in just a moment. We're going to take care of a couple of bills, a couple of issues that I'm and recommit a couple of bills. So for what purpose is representative Anderson rise? I think you're all now. Okay. Thank you Mr. Speaker to make a motion. State your motion. Mr. Speaker, I move that House Bill 813 be recommitted from rules to governmental affairs. Both chairs agree. Mr. Clerk, will you read the caption to House Bill 813? House Bill 813 be titled back to amend chapter 31 in Title 36 of the Fisher go to Georgia annotated relating to the corporation of municipal corporations. All the gentlemen's motion at HP 813 be moved from rules back to governmental affairs is their objection. Here he known as a ward. What purposes chairman Todd Jones rise to make a motion. State your motion. I move that I move that House bill 986 be moved from the committee on governmental affairs of the committee on technology and infrastructure. Both chairman are in agreement. Mr. Clerk, will you read the caption? House Bill 986 be titled back to amend chapter 2 of Title 21 in the Fisher go to Georgia annotated relating to elections and primaries generally. On the gentleman's motion that HP 986 be withdrawn from the governmental affairs committee and recommitted to the technology infrastructure and innovation committee is their objection. Here he noted is awarded. Ladies and gentlemen, we have a number of afternoon orders and I want to give a little extra time here. And hopefully everyone won't use it all but I'm going to ask you to hold your afternoon orders to three minutes or less. Before I recognize chairman Hitchens and chairman Collins and I guess chairman Lomston as well. If you'll be ready. And leader of station. I want to make you aware that our own chairman that do big his father-in-law. His dear wife Katie her father Jim Mathis passed last night. So let's keep that family in our prayers as well. So I've been through a lot in the last few years and I know they'll appreciate your. Your thoughts and your prayers being offered for them. So at this time members I'm going to recognize those chairman Hitchens, chairman Collins, leader of station. Members of your join me in standing. Thank you miss speaker. I think everybody here realizes today that last night we lost one of Georgia's finest. Jimmy Trooper, Jimmy Senazar, graduate of the 114th Trooper School. He just graduated on September the 8th, 2023. Lost his life in the Gwyneth County in a high speed chase. Although he wasn't very experienced with the state patrol having been there only three months. He spent several years with the Atlanta Police Department before he came to the state patrol. And checking in this history I found out that he won the life saving award when he was put to the Atlanta Police Department. A car went over a bridge and buttoned down the hill, landed upside down on railroad tracks. And nobody would go down the embankment and Jimmy went down there and extricated the man who didn't get out of the vehicle. And I think we all stand in sympathy. I think most of you know I spent 43 years in Georgia state government before I came here. Seven of them is the commissioner to Georgia Department of Public Safety. During my time we lost 15 people. When I was the commissioner it was a pretty regular occurrence for me to run over to Grady. When they were metevacking somebody from around the state, into the trauma center, who had been shot, cut, beat with a tire on, run off. It's a dangerous job. And this is the third law enforcement officer we've been up here for this year. And we haven't got to February yet. So I think we all stand in agreement that they do a great job. And we're here to memorialize them. And I hope that we take a moment of silence and memory of Jimmy. Thank you Mr. Speaker. Thank you for the Colonel Mr. Chairman. I know all over this, all over this house. Our thoughts go out and our prayers go out to those folks as well, to the family. Representing my to hand you're recognized for an afternoon order. Members give the gentleman in the will you're attention as a remembrance. Thank you Mr. Speaker. Members today we gather to honor and remember an incredible individual. Miss Nora Wood Goodman of Temple Georgia was born in April 20th, 1940 in Madison, Georgia. Nora's journey was one of dedication service in an immense contribution to our community and the field of agriculture. Miss Goodman who passed away on January 9th at the age of 83 was not just a member but a pillar of the Georgia Farm Bureau serving as their district director. And as a president of the Pauley County Farm Bureau since December of 2003, her commitment spanned over two decades. Nora was a beacon of strength and leadership tirelessly working for the betterment of our farming community. That worked with the Georgia Farm Bureau extended for 45 remarkable years. Nora's roles in various Georgia Farm Bureau community advisory committees, particularly the four-street committee from 2005 demonstrated her dedication to the agriculture sector. But her work was not just limited to those committees. She also represented us as a voting delegate to the American Farm Bureau Federation. And beyond the Farm Bureau Miss Goodman's influence stretched to other areas of agriculture. She was an active member of the Georgia Countdowns Association, a director of the Georgia Agriculture Land Trust, and a member of the Tri-Counting Countdowns Association. Her leadership was also felt in the healthcare sector where she served as a director of the Pauley County Hospital Authority. Her educational and professional journey in nursing, including her time at the Georgia Baptist Hospital in Mayo Clinic, where she became a certified registered nurse and ethnicity. She's pleased volumes about her dedication and her care for our community. As we remember Nora today, we celebrate her life, her contributions, in the indelible marks she had left on our community, and on the hearts of those who had the privilege of knowing her. Her legacy is one of resilience, commitment, and passion, a guiding light for every member here. In the Northwood Goodman, a chair's leader, a dedicated former, a passionate healthcare provider, and a beloved community member will be profoundly missed and always remember. Thank you, Nora. Thank you, member. Thank you for your attention, members. Wilbur Chett is recognized for an afternoon order. Thank you, Mr. Speaker. Today we gather with heavy hearts to remember and honor three brave members of our armed forces who made the ultimate sacrifice and service to our nation. One of those members was Kennedy Sanders, a constituent of mine from Wakecross, Georgia. These courageous individuals lost their lives in a drone attack in Jordan, and more than 30 others have been injured. As we reflect on the profound impact of their dedication and sacrifices, let us extend our deepest condolences to the families and loved ones affected by this tragedy. The loss of these three troops is a stark reminder of the sacrifices made by our military personnel in the pursuit of peace and security. Their commitment to the duty and the defense of our values will forever be etched in our hearts. We also stand in solidarity with those who are currently recovering from the injuries and our thoughts are with them and their families during this challenging time. We are grateful to the moments like these that are essential that we come together as a nation offering support and gratitude for the sacrifices born by our servicemen and servicemen. As we mourn the losses of these three heroes, let us also express our gratitude to all of those who continue to serve, ensuring that their dedication to our nation's security is never taken for granted. We may the memories of those we have lost inspire us to uphold the values for which they fought, and may we always remember the profound debt of the gratitude we owe to those who serve in the defense of freedom. If you all will, observe a moment of silence with me. Thank you, Mr. Speaker. To our servicemen and women around the world, but especially in the troubled areas of the world, we owed them our greatest, a great debt of gratitude. Remember that family. We'll park, recognize for an afternoon order. Thank you, Mr. Speaker. Per House rule 40.3, I rise to bring attention to actions taken by Republican members in this body that are undermining the integrity of House proceedings with respect to local legislation. Republicans are continuing to break longstanding precedent by manipulating House rules 18.1 and 56 to pass local legislation that does not have the support by a majority of the local delegation. They are treating a local bill like a general bill to move through the legislative process and violation of House rule 18.1 and then treating it like a local bill to get it on the local calendar to prevent the minority's ability to file a minority report and compliance with rule 56. For example, in 2022, just two years ago, Republicans here bypassed a local delegation in Cobb County which resulted in every single Republican in this body voting for racially discriminatory legislation, House Bill 1028 that was stopped by a federal court. Now today this Republican majority is once again deviating from the regular legislative process and bypassing the local delegation to impose their unrepresented on accountable will on the people of Cobb County. This sets a dangerous precedent that will undermine local control. Now any majority in this House has precedent that may follow to impose its will on any county or city throughout the state of Georgia regardless of opposition by the local delegation or the will of the people in that area. May I reap what you sow? Thank you, Mr. Speaker. Are you the will? The gentleman has yielded the will. Leader, frustration. You haven't have an order. He waves. Representative Kendrick. Excuse me. I'm sorry. My bet. Representative Rees, maybe your group's gone, but you certainly need to recognize them. Thank you, Mr. Speaker. House colleagues, if you saw the second largest group here today, it was the Tamil community here in Atlanta. They were here at the Capitol through Dr. Ender and Andrew Krishnan who was on the state board of health care workforce and faithfully serves as a doctor of the day here at the Capitol. He's a gastroenterologist in Gwinnett County. The Tamil community, they are in India, Sri Lanka, and other countries. They are 100 million people strong. They have a culture that is over 3000 years old with culture and language. And they are keeping that moving forward here in Georgia through a school in Forsyth County. There is a Christian church in my area in the Tamil community that has reaped what is sown by the Apostle Thomas who traveled to India back 2000 years ago. The good news is come back to Georgia through the Tamil community in Gwinnett County. So let's salute them for 3000 years of heritage that they are here. They're celebrating Ponga, which is the equivalent of Thanksgiving and their culture. They are thankful to be at the people's house today. Thank you, Tamil community. Thank you, Mr. Speaker. Mr. Speaker, I rise today to speak to the greatest border crisis in American history. The Indian million illegal border crossers have entered the United States since Joe Biden was inaugurated three short years ago, 10 million in three years. That is more than individually the population of 41 U.S. states and almost as many people illegally entering in three years as the population of this state. I remember alone just a month ago over 300,000 people were allowed into the country illegally as more than the population of Chatham County where I live in Savannah. The Biden administration's policies have most benefited criminal aliens. And this administration has gutted our nation's immigration enforcement system with no concern for public safety. I'll give you some examples of that. In spite of the exponential increase in illegal migrations to this country, when you compare fiscal year 17, 18 and 19 to 21, 22 and 23, there has been a 57% decrease in criminal, the arrest of criminal aliens. And there has been a 67% decrease in the deportation of criminal aliens. The Biden administration's claims that somehow its policies are designed to focus on the criminal aliens in this country are demonstrably false. Tens of thousands of criminal aliens live in communities all across this country. And the Biden administration has no concern for public safety or for national security. So finally to my colleagues, I want you to be aware of something and I'm going to put some information on your desk tomorrow. Today in Georgia State prisons today right now, not including jails, in state prisons alone, there are 1,579 criminal aliens in our state prisons with ICE detainers alone. 241 child molesters illegally here who molested Georgia children, 182 murderers in our state prison illegally here who murdered Georgia citizens, 179 rapists illegally here who raped Georgia people, Georgia women, 116 aggravated child molesters in the list goes on and on, I'll put it on your desk tomorrow. My friends, this issue affects all Georgians and all Americans and this administration is abandoning its duty and they are ignoring this issue and it's time that that changes. Thank you, Mr. Speaker. I yield the well. Thank you, Mr. Chairman. He's yielded the well. Representative Willis. There she comes. Recognize for an afternoon order, Representative Angue Willis. Thank you, Mr. Speaker. And you have some friends that want to join you. I thank you. I love friends. Here we go. Yes, ma'am, you're recognized. Thank you, Mr. Speaker. Good afternoon, colleagues. Access begets success in all things. Food insecurity is lacking access to adequate, healthy and affordable food. And I have found through conversation with my colleagues, it is an issue impacting both urban and rural Georgians. I've spoken with both Republican and Democratic colleagues who express concern around food access. Some of my colleagues said they are 20 minutes away from a grocery store. Some of my constituents buy groceries out of convenience stores. In 2021, the rate for food insecurity in Georgia was 10.7% overall for all ages. That's one in nine people. For Black Georgians, the rate was 17% for our white Georgians, 7%. The American Heart Association recently reported that a racially diverse group of pregnant women who reported eating a diet rich in vegetables, fruits, fish, nuts, olive oil, and whole grains had a 20% or greater reduced risk of developing pre-clampsia as an issue. Notably, the study showed that Black women who consumed these foods had a 26% reduced risk of pre-clampsia. I find this to be extremely significant. More action must be taken in order for low income women and their children to improve their intake of the healthy foods listed above because they otherwise have limited resources to buy the healthy foods. There is forthcoming bipartisan legislation addressing this lack of access and I ask that this body address the connection between access to healthy foods and healthy outcomes for all Georgians. Thank you, Mr. Speaker. I yield back the well. Thank you. The lady has completed her afternoon order and yielded the well now. I'm ready. I'm sorry. We had to get you in the proper order right, Representative Kendrick. So that's your time. Thank you. Thank you, Mr. Speaker. Good morning, colleagues. I'm doing this a little bit early this year, but this is my annual birthday rent. Because my birthday is August the 28th. It is outside of the legislative session and I don't get to hear the speaker call my name and all of you stand up in a clause. I get a car, but I don't think that's sufficient. So in this chamber, if you have a birthday that is outside of the legislative session, will you please rise so that our colleagues can give us a round of applause because of our birthdays outside the session. Thank you, Mr. Speaker. I yield the well. How to give you about 10 to 15 minutes if I know that's what you're going to do for all of us. Because a bunch of us in that category are adhering to you. Thank you, Representative. And happy birthday. Oh, we're ready for announcements, but since we own the birthday deal, cheerleading, darling Taylor has a birthday right down up front. Thank you, Representative Darling Taylor. I think she's about 39, I believe. Pretty close. Pretty close. I know a gentleman doesn't do that to a lady, but I thought Nurti 39 worked. All right, let's have some announcements, chairman Corbett. You're having a committee meeting over here. You're going to, oh, okay. Chairman Corbett, recognize for announcement. They did it to your own purpose. I bet. Thank you, Mr. Speaker. The motor vehicles committee will meet at 8 o'clock in the morning room 606. Thank you. See who your friends are now. Representative Ballard and Representative Hilton recognize for announcement. Thank you, Mr. Speaker. The House Education Subcommittee on Policy will be meeting upon adjournment in CLOB 506. The House Subcommittee on Curriculum will meet immediately following chairman Hilton's meeting. 506. Representative Tran has recognized for announcement. Thank you, Mr. Speaker. The cab delegation, we have a room change. We will be meeting in room 514 upon adjournment. The cab delegation room change 514 upon adjournment. Thank you. 514. Representative Jasmine Clark. Recognize for announcement. Thank you, Mr. Speaker. The Georgia legislative black caucus will have a meeting today at 130 in room 216 in the capital. A hot meal will be served. Thank you. 216 and hot meals serve. Representative Carter, representative Doreen Carter, recognize for announcement. Good afternoon and thank you. You all had this sheet on your desk today and it has some information for you about Thursday, which is I'll go read for women. And this is an announcement, but I want to put this in your spirit so you'll be thinking about this as you decide on what to wear on Thursday. Heart disease is the leading cause of death in Georgia and in many cases it is preventable. Will you wear red and help us educate your families, friends, co-workers and networks on science and symptoms on how they can protect their hearts. Thank you. Thursday. We're red. Now I have an announcement. We have pages today. If you have a page, don't leave the room. Let's go to the front just a month. We're almost done. Chairman Mitchell. Chairman Billy Mitchell is recognized for an announcement. Thank you, Mr. Speaker. There will be a democratic caucus meeting tomorrow morning 9 a.m. We'll join others in 307 in CLOB tomorrow morning at 9 a.m. It is an important one. Look to see you all there. Thank you, Mr. Speaker. Thank you, Mr. Chairman. Chair Lady Taylor. Happy birthday, lady. Recognize for an announcement. Thank you, Mr. Speaker. I have two announcements. The Insurance Life and Health Subcommittee will meet today at 2 p.m. in room CLOB 415. And right now as we speak, if you're so inclined, there is a special group from Southeast Georgia here honoring the Oki-Fanoke and everyone is welcome to come. Thank you. Chairman Hawkins is recognized for an announcement. Thank you, Mr. Speaker. The Health Committee will meet today at 2.30 rather than 2 at C.O. Excuse me, cap 403. It's 2.30 rather than 2. Thank you. And it's capitol 403, Mr. Chairman's got you. Mr. Leader, Leader of Strations recognized for an announcement. Thank you, Mr. Speaker. The Chairman's lunch will be in room 403 of the Capitol upon adjournment. 403 of the Capitol upon adjournment. Thank you. Representative Hong is recognized for an announcement. Thank you, Mr. Speaker. Judiciary, non-civil Hong Subcommittee will meet at 2 o'clock today. Thank you. Hong Subcommittee, where will that meeting occur? Do y'all know? 132 Capitol Building, thank you. That's your traditional spot, right? 132 Cap. Representative Gamble. Thank you, Mr. Speaker. Tomorrow morning, the House Fellowship will meet at 7 a.m. in the House Judiciary Committee. All members are invited. Thank you. The majority leader of this House.\n\nis recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Tuesday, January 30, 2024. For the month's almost over, on the motion of the majority leader that this house stand adjourned until 10 a.m. Tuesday, January the 2024, 2024. All those in favor say aye. All those opposed say no. Yes, I have it. We're adjourned.",
  "updated_at": "2026-02-14T03:42:17.276133+00:00"
}