{
  "video_id": "6wSNUlyYuKc",
  "url": "https://www.youtube.com/watch?v=6wSNUlyYuKc",
  "title": "Capitol Report Day 25 02/28/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": null,
  "duration_minutes": 2,
  "summary": "# Georgia Capitol Report Day 25 - 02/28/25\n\n## Overview\nThis session saw the passage of a bill to expand the Georgia Promise Scholarship to the biological and adopted children of fostering families, a move aimed at incentivizing foster care. The House also passed a bill to modernize the state's 911 call center system. Additionally, Senate Republicans filed legislation to further investigate the New Georgia Project and its founder Stacey Abrams over alleged financial misconduct, despite a previous investigation by the State Ethics Commission.\n\n## Key Actions\n**HB 423**: Bill to implement geographic information systems in 911 call centers to improve emergency response times.\n\n## Bills Introduced (First Reading)\nNo new bills detected.\n\n## Notable Moments\n- Debate over the foster care scholarship bill, with Democrats objecting over concerns about potential misuse of funds and the lack of a similar scholarship for foster children themselves.\n- Senate Republicans filing legislation to further investigate the New Georgia Project and Stacey Abrams, despite a previous investigation by the state ethics commission.\n\n## Votes\n- The foster care scholarship bill passed 32-22 along party lines.\n\n## Attendance\nA quorum was present for the legislative proceedings.\n\n## Adjournment\nThe legislature adjourned and will reconvene on Monday for Day 26, leading up to cross-over day on Thursday.",
  "transcript": "The Senate debated a bill that would allow the biological and adopted children of fostering\nfamilies to access the $6,500 Georgia Promise Scholarship.\nThis is an important step to ensure that those people that take care of the most vulnerable\nin our population have an initial incentive to do so.\nDemocrats objected because of the threat to families misusing the funds, as well as\nwe are not giving that same scholarship to the very foster children they will have in\ntheir households.\nbill passed 32 to 22 along party lines. Across the hall, the house passed a bill that would\nmodernize the state's 911 call center system. House bill 423 would implement geographic information\nsystems to more accurately locate the caller and reduce emergency response times.\nWhether it be folks in rural Georgia, suburban Georgia, or in our urban centers, all across\nour state, we see a great need to utilize current technology.\nAlso today, Senate Republicans filed legislation to investigate the new Georgia project, and\nits founder, Stacey Abrams, for alleged financial misconduct.\nThe State Ethics Commission already investigated and levied a large fine on the organization.\nBut Lieutenant Governor Bert Jones says that more scrutiny is needed.\nDemocrats say it's a waste of time.\nLawmakers return on Monday for day 26, as the lead up to cross-over day on Thursday continues.\nFor GBB News, I'm Sarah Callis at the State Capitol.\n",
  "updated_at": "2026-02-12T12:18:40.99512+00:00"
}