{
  "video_id": "7-9FGiVCu9o",
  "url": "https://www.youtube.com/watch?v=7-9FGiVCu9o",
  "title": "Senate Committee on Finance | 03/04/2024",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 44,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Finance | 03/04/2024 session:\n\n**Overview**\nThe session featured a presentation by the Georgia Public Policy Foundation on tax policy modeling. There was discussion around adjusting the state's tax structure and the impact on the economy.\n\n**Key Actions**\nNo bills were passed or referred.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- The session began with an invocation from Senator Eccles.\n- The committee discussed a bill related to T-SPLOST referendums, with changes made to the previous version. \n- The committee unanimously approved the T-SPLOST bill after brief discussion.\n- The Georgia Public Policy Foundation presented tax policy modeling and analysis to the committee.\n\n**Votes**\n- The T-SPLOST bill was unanimously passed by the committee.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe session adjourned. The next committee meeting date was not specified.",
  "transcript": "We will get started, we do have a quorum, and Senator Eccles, would you do the invocation\nfor us?\nDay number 12, is that it?\nLet us pray.\nDear Heavenly Father, thank you for today, Lord.\nThank you for allowing us to be here to do the work of the people of Georgia.\nI pray that you'll give us clear minds as we make decisions and let us do what is\nbest for Georgia. Your name I pray. Amen. We're going to have a presentation. I may let Senator\nHawkins go ahead here. I was the presentation was going to be first, but I'm thinking you might\nbe quick just because we voted on this pretty much before. So if you want to come on up to the mic.\nAll right. How are you today, Mr. Chairman?\nEither one you want. We'll turn it down.\nThank you, Mr. Chairman.\nAnd let me start first and say we heard from Senator Eccles, a similar bill.\nI think yours has one change to it.\nYes, it passed down.\nI think there may be a couple of new votes.\nSo it may not be an animal's vote, but probably be somewhere lines again\nSo tell us maybe the difference between what she had and what you think that she had the\n0.75 still in there\nYeah, and the 0.75 was taken out by advisement at eccg\nAnd that 0.75 you're referring to for the committee members is that if the county goes it alone without the cities\nright that's exactly right because house bill 946 is a house bill we're\ntalking about LC number 500730S right now it teasplots is only splice that\nrequires a 100% dissipation so we have had counties in this state loser\nteasplots because one city or one municipality decided not to sign the IGA\nWe had to, the last time that we tried doing a T-Splots,\none was Resthaven of 45 people.\nThe other one is Buford, it comes into part of Hall County.\nAnd so the 7.5 that Senator Eccles,\nI was referring to, was what you would,\nwhat the T-Splots would be based on,\nif it was not a unanimous vote.\nHall County decided not to do that\nbecause of all the computations,\nin all the other situations that would arise with that.\nThis bill cleans that up.\nSo as long as you have over 50% of the municipality\npopulation, municipalities in favor of the teach blocks,\nthen the teach blocks will be put on a referendum\nfor the people to vote for.\nAnd that's it.\nThis bill has been agreed to by GMA,\nACCG and the Chamber of Commerce.\nEverybody's gonna thumbs up on this bill.\nOkay, any questions of the sponsor of the bill?\nWe've got a couple of people signed up to speak,\nincluding I think maybe the administrator of Hall County,\nbut I don't know if that's necessary.\nReally, it's up to the committee.\nEveryone okay to go ahead and vote\nwith any further tests.\nWe've seen this same bill with one change taking out the option of counties going it alone\nOkay, is that sender teller? Thank you mr. Chairman. I think it's important to point out\nChairman Hawkins that if there is not unanimity doesn't this bill drop it down\nIt's not a 10-year referendum or a 10-year tax is a six-year tax\nCorrect and thank you for saying that yeah, yeah, we've heard from counties\naround the state that is an extra year allows them a little more time to get\nthings up and going. So yes, thank you. That's a good point.\nNo other questions is the committee. I mean, out here a motion now if we feel like we're ready.\nWe've got a motion from Senator Eccles, their second. Second from Senator\nRamontarte, any other discussion?\nAll those in favor of the motion, raise your hand.\nOK, and all opposed.\nSenator Ork, did you vote either way or?\nOK, so your bill passes.\nAnd who's your sponsor over here?\nSenator Eccles.\nOh, good choice.\nI think so.\nSort of cute too, isn't she?\nYeah.\nAll right, we've got Kyle Wingfield here\nwith a presentation for the committee.\nIf you want to come up,\nthere was a lot of work done over the off session.\nWe haven't, no.\nOkay, so the floor is yours. I'll tell the committee. Part of this was Rhea Headerman\nwho's been working a lot of states, worked with us some over the off session in our committees\nthat some of the people here were part of the tax credit study committees, and I think\nI've got it right.\nYou're going to start on page 14 and go through all the derivatives there in the presentation\nand break down for everybody that didn't have calculus three, how those formulas work.\nBut I think we'll just do an after-class tutoring session on that, and y'all can tell me how\nthose things work.\nBut yes, no, thank you, Mr. Chairman and members of this committee.\nI'm sorry.\nSomebody said I didn't introduce you properly.\nKyle Wingfield, introduce your sub name and address for the record, if you would.\nYes.\nKyle Wingfield on the President's CEO of the Georgia Public Policy Foundation and Georgia\nPolicy Impact, and we, as you know, are a think tank based here in Atlanta.\nwe work on state public policy issues.\nAnd as the chairman alluded, we participated\nin the tax credit study committee this summer\nand brought down our, or rather had via Zoom,\nour colleague from Ohio Ray Hederman\nfrom the Buck Eyre Institute, our sister,\nthink tank and Ohio, which has a center\nthat does economic modeling.\nAnd so after the discussion that Ray had with the study committee,\nSo we took some things that we'd heard that were of interest to people and commissioned\nthis modeling study that Buck I put together for us in which we published a couple of weeks\nago.\nSo I'll go through that in a moment, but I wanted to start with just kind of some kind\nof opening thoughts in terms of how we approached this and how we approached tax policy generally.\nAs many of you know, Georgia is a low tax state.\nYou can see that by virtually every metric that is out there.\nHowever, we compete in a very highly competitive region when it comes to taxes.\nSo we're sandwiched between two zero income tax states in Tennessee and Florida.\nTo our northeast, we have North Carolina, which 10 years ago had a higher income tax rate\nthan Georgia does.\nthrough some steady reductions of that rate,\nit is now come to have a lower rate than we do.\nAnd that's both on the personal side and the corporate side.\nSo, and then we compete with states like Texas, of course,\nwhich are not neighbors of ours,\nbut, you know, and we compete nationally, obviously,\nfor workers, for talent, for companies,\nfor investment, that sort of thing.\nSo it's important to note that just because we're doing\nwell from a tax rate standpoint doesn't mean we've done all the work that there is to do\nbecause we know state is sitting idly by and that's particularly true over the last few years\nas states have seen lots of revenue come in and they're trying to figure out okay how do we\nadjust and we've seen lots of states adjust by cutting those rates. Now how the state raises\nthis revenue is also matters just the fact that we're a low tax state is not the only important fact\nThere's good bit of agreement among economists that different taxes have different effects\non the economy.\nSome of them are more harmful to the economy than others.\nSo income taxes versus sales taxes, for instance.\nSo it's important to look at the structure of the code in addition to how much money it\nraises.\nAnd then the final point that we come to the table with is that generally speaking, the\nprivate sector spends money more productively\nthan the public sector.\nNow that doesn't mean that the public sector\ndoesn't do important things if that were the case.\nChairman Tillery could come in and put zeros in the budget\nand y'all could go home after a couple of days.\nObviously the state funds some very important functions\nand must continue to do so.\nBut when it comes down to a decision\nof do we do a little bit more here?\nDo we do a little bit more there?\nfrom an economic standpoint, from growing the economy,\nyou want to err on the side of giving that dollar back\nto the private sector rather than finding another way\nto spend it here in the public sector.\nSo with all that said, those are the outline here.\nAnd we had the four scenarios modeled.\nSo I believe you have these in front of you.\nIf you turn to page six, scenario one was accelerating\nthe tax cuts that this body passed in 2022, House Bill 1437, and extending them.\nSo if you look at this table number one, the top part of each of these tables represents\nthe baseline. That's tax according to current statute in terms of the rate. These are projections\nof state GDP, the number of jobs in the state, tax revenues, consumption, and investment.\nAnd then the bottom part of each table represents what would happen according to the models\nif changes were implemented.\nSo in the bottom part of this table, one on page six, you can see that the tax rate\ngoes down about twice as fast at this, under this scenario, and ends up going a percentage\npoint farther, so going overall about twice as far as current law holds.\nAnd what you see there is that you get a big boost in state GDP.\nYou see about by the end of this, you would see about 16,000 more jobs, more investment,\nconsumption and ending at a tax rate of 3.99. The second scenario was we asked it's employment.\nOh, so it's four column. So there's two, five, seven, nine, eleven, four, two, six,\nThat would be, so when you got to, on the first line, 2024, if you were at a 5.19% tax rate,\nyou would expect to have 2,000 more jobs than the baseline number in the top part of the table.\nThose are the sales.\nThose are, yes.\nThese are all in, in thousand.\nOkay, thank you.\nWell, those numbers are in thousand.\nSome of the others are larger.\nPage six.\nPage 6.\nPage 5 describes the scenario and page 6 has the table.\nIt looks like this.\nSo we're on five on our sheet.\nOh, I see.\nOK.\nOK, it's number 6 on mine.\nYes, yes, scenario one, table one, then scenario two, table two looks at, instead of lowering\nthe personal income tax, it actually looks at eliminating the corporate income tax over\na period of five years.\nAnd so you can see the same baseline top of the table, and this is table two, and then\nthe projections from the model on the bottom of the table.\nWhat I draw your attention to here is,\nif you look at the last number in both table one and table two,\nand they're next to each other on mine,\nit looks like they may be on opposite pieces of paper\nfor y'all, so it's a little bit harder to do.\nWhen you get to the end here,\nyou've cut twice as much tax revenue on the personal side,\nBut the growth to GDP is actually greater on the corporate side, and that's because of the much higher level of investment that you get.\nAnd so what I would tell you that kind of take away from that is when you're looking at the most bang for your buck,\nwhen cutting taxes, you're going to get a larger economic response from cutting on the corporate side than on the personal side.\nAnd in fact, there's a couple of lines here where you can see where they line up exactly\non the tax revenue side.\nTable three, and I'm trying to go through this quickly because I know you'll have questions.\nLet's go back to table one there.\nI think people may still be confused on this a little bit from I'm sensing that in the\nroom I guess.\nBut let's go on our page five there.\nThe tax revenue is at $33 million now.\nYou're saying at $20, 30, if the tax rate was 4.99%, we would be bringing in $38.8 billion.\nYou would have growth that would be increasing taxes.\nYou would be cutting the tax rate, it would be decreasing taxes.\nAnd then the chart at the bottom is, I guess, going down from 5.19 to 3.99, how much tax\nrevenue is lost from the price line by doing that?\nYes.\nSo when you get to the bottom of that table at 3.99, the tax revenue shows a minus 4.9\nbillion.\nSo that's how much you would subtract from that 38.8.\nAnd that's how you, what you would have at that point.\nAnd one of the things, I guess, the calculations try to figure out, I try to put it in non-calculus\nterms or something, if you were at a zero percent tax rate, you would bring in the zero dollars.\nIf you were at a hundred percent tax rate, you might also bring in zero dollars, because\nwho's going to work if the government takes a hundred percent of it?\nAnd so we in between, it's a little bit fluid, and you try to derive economic activity\nversus taxes where you're going to be at and I think that's obviously we can't get\nit to the calculations the economist used back on page 14 and on but that's sort of where\nwe're at on that so your tax revenue in 2030 where you're going down you're 3.99% and\nthe tax revenue you've lost what are the assumptions in that that you haven't made any changes\nand your budget are.\nSo this is just looking at the revenue side.\nThat's right.\nSo it's not trying to project versus spending\nor anything like that.\nIt's just telling you how much revenue\nwould be projected to come in.\nI will point out, these are inflation-adjusted numbers.\nSo these are all, so you would see these numbers\nplus some measure of inflation.\nThey're kept constant to try to make comparisons.\nThat's a good point that inflation's\nbeen taken out of these numbers.\nAnd the way that, just if I could very simply explain\nhow the model works, you're familiar with a lot\nof economic models where they use a multiplier\nto try to say, well, if you increase this spending,\nthen that's going to go, then someone's going to spend\nthat dollar and so on.\nAnd so it really matters what multiplier you use.\nThis model doesn't do that.\nWhat this model does is it tries to take the empirical data\nbased on when similar changes have been made in the past.\nWhat was the response?\nIn other words, when a state cut taxes by this amount,\nhow many jobs were created above what was expected?\nSo it's not trying to calculate how many times\nmoney's gonna move through the economy.\nIt's trying to say, okay, based on what we've seen\nin the past, this is what we would expect to happen\nif this were done.\nThat's the way this particular model works.\nAll right, Roger.\nThank you, Mr. Chairman.\ngreat to see you, appreciate all the great work you've\nwritten forward to us.\nSo, in looking at your chart, you know, going down to\nthe 3.99 percent tax rate, so it's an offsetable\nco-op for round numbers, $5 billion, a budget impact.\nAs other states have done this, obviously they've had\nto find either some type of offset either they're\ngrowing fast enough, they could absorb those, or they\nadd attacks as in other areas, such as Mark of\nFacilitator, things that nature to make sure we're\neven with main street. Has anybody been doing what we're doing is looking at those tax credits\nthat some are not providing return on investment and could easily fill some of this gap in?\nI believe there are some states that are looking at that. I couldn't give you a state-by-state breakdown,\nbut I'd be happy to do kind of a round up and get that back to you later. One thing that we've\nseen the state of Iowa attempt to do is set aside some money in what they call a taxpayer relief fund.\nand the idea would be you're going to have to match your budget, you're spending to your revenues,\nbut while times are good and you've brought in more revenues, you could set some of that aside,\nand then if revenues come in short of what you've projected,\nyou've got some money to pull out of reserve and dedicate toward that and make the budget whole\nto kind of smooth the transition as you're doing that.\nSo that would be outside of a traditional rainy day fund then?\nYes.\nOkay.\nAnd then I know you've helped us and looked at some of the measurements that we've done over\nover the last few years, especially, and certainly some have come back positive, but a great\nmany have come back with an upside down ROI and could be a great way to help all Georgians.\nVery well could be.\nWell, North Carolina is an example.\nYou mentioned them that have gone down to $3.99 and are trying to get it lower.\nThey quit matching the federal R&D tax credit as an example.\nOur film tax credit that I think is at $1.4 billion, that would be what, $1,400 million.\nThey made a cap of don't anybody fall on the floor out there 31 million was their cap\nup in North Carolina on that tax credit because their theory was if we reduce everybody's\ntaxes we actually get more growth and you know then pick in the winners and lose your\ncenter or I'll give her next.\nThank you, Mr. Chair.\nThank you, Pat.\nOn your introductory remarks in the second paragraph includes a sentence that says Georgia\nIt looks unlikely to continue to attract or retain relocating workers without more\ncompetitive tax reforms.\nHow do you support that given our meteoric growth in job creation and attracting incredibly\nimportant manufacturing and particularly in the EV space and in the battery space?\nHow do you support that sentence that you assert there that we look unlikely to continue to attract or retain relocating workers?\nWell, the differentiation there between what we're talking about, you're talking about job creation, which is the company creating jobs.\nWhat this is talking about is the workers to fill those jobs.\nAnd I know that that's been a very important topic during this session.\nrecognize that we are growing jobs at a rate that's faster than we're growing\nworkers who are prepared to fill those jobs. We've got to bring people in to\nfill those. And if you're if you're someone who is thinking about moving to\nanother state, one of the big factors you're going to take into account is what\nis the return of my own work? What is that what rate will I be taxed if I go to\nGeorgia versus another state and so that that would be the thinking behind that\nsentences that we're not talking about the employers we're talking about the\nemployees to fill those jobs because as you say the state has has had a very\ngreat record in recent years in particular in attracting companies but we\nneed people to fill the jobs that they're creating and the people to fill the\njobs are what this is talking and you think people stay away from here because\nour tax rate is too high. I don't know that there is that the underlying\nassumption. I think the assumption would be they're not moving here in the\nnumbers. They could be moving if we made it more attractive to them on this\nfront. Now obviously people have lots of different factors. They take into\naccount. But this is a big one. I just think that's hard to support.\nThank you. Thank you, sir. I'm still having trouble with the chart. I'm\nI should have in trouble and I'm not being too thickheaded on it, but I'm still having\nanother trouble with not enough zeros on the numbers or what the what the titles mean\nwith you.\nAnd I know we've got time as an issue here too and we probably need to study and then\ncome back.\nBut just on the personal income tax, I mean, kind of walk down and tell what I know what\ngross domestic product means and employment means and tax rate.\nI don't know what consumption means.\nI don't know what investment means and then come on down through the holes.\nSo consumption is, so you've got the tax rate, you've got the tax rate, and then the\nyear that it supplied to, just got it left to right.\nYou've got the state GDP in the next columns.\nThat's how large the state's economy is.\nThen you've got employment, how many people are employed, that's in thousands.\nThese other numbers are generally in millions.\nThen you've got tax revenue, how much is coming in.\nAnd then you've got consumption, consumer spending,\nhow much are consumers in the economy spending,\nand then investment.\nHow much is being invested, whether it's\ninto a new business or into expanding a business,\nor that sort of thing?\nSo how many zeros have to go in those numbers?\nThat's what I'm.\nAnd so if you look at the tax revenue number,\nyou're going to add six zeros there.\nSix zeros?\nYes. Okay. That's probably why I'm struggling with it.\nOkay. On three zeroes on the employment census.\nOkay. Thank you. I appreciate it.\nIt wouldn't have fit on the page if we included all the zeroes, unfortunately.\nYeah. Well, it looks like we did something anyway. Okay.\nOkay. And we're going to get shortened on for the same year.\nI'll send her. I'll just go ahead. I'll read it.\nMr. Wingfield, thank you for bringing this. Some.\nThe proper way to evaluate the four scenarios.\nareas to try to chart a path forward, the best path forward.\nHow do you do that?\nI mean, can you just look at each one and take, you got an increase, you got a fall-off\nin tax revenues, but you've got an increase in GDP, increase in consumption, increase\nin investment.\nWould you add those and those three and compare against the tax revenue drop, or I mean,\nHow do you wisely go about looking at these four scenarios and say, we need to do one or\ntwo or three or four, we need to do a mix or, I mean, I read your conclusion it basically\njust said keep the tax rate under four percent.\nSo I think the way that I would answer that is to say it really depends on what the\npriorities of the General Assembly are.\nAre you trying to grow the state's economy as fast as you can?\nAre you trying to attract workers, you know, to the earlier conversation we were having?\nYou're growing jobs, but are you attracting people to fill those jobs?\nI think you have to decide what your policy priority, what your goal priority is, and\nthen these scenarios help tell you, okay, if that's your priority, then you want to look\nat something along these lines.\nAnd the scenarios really are meant to look rather different so that you can have a diverse\nmenu of options here.\nIt's not so much to say you should cut this tax rate by this amount in this year, so much\nas directionally, if you go in this direction, you're going to boost the economy the most.\nYou're going to get the most bang for your buck that way.\nAnd so on through the other priorities that you can set.\nAll right, Senator Estabés.\nThank you so much, takeoff.\nReally quick, do these calculations, particularly on the consumption and investment side, take\ninto account, similar to what vice-trailers was talking about, you make up the money somewhere,\nso whether it's fees, whether it's increase in sales tax, whether it's increase in property\ntaxes, take into account the fact that consumption may be impacted by what's happening in other\nareas?\nNow, this simply looks at the results of making this policy change.\nIf you made other policy changes to accommodate that, then there would be other effects from\nthat, right?\nWe didn't model, for instance, like trying to do a overall revenue neutral while cutting\nthe income tax by this amount.\nYou would have the effects of, well, the government's going to spend less or we're going to\nraise sales to whatever, as you mentioned, there's a lot of different options you could\nhave at that point.\nThis simply looks at this particular policy change, and then you would have to look at,\nokay, if we wanted to achieve this goal, then we would either need to reduce spending\nby that amount or we'd need to offset somewhere else, that kind of thing.\nI would point out, since we've had some talk about tax credits, table four in scenario\nfour, we asked them to look at, well, what if you cut tax expenditures across the board\nby 500 million, and that would be tax deductions, exemptions, credits.\nThat's what we mean when we say tax expenditures.\nAnd then lowered personal income taxes by the same 500 million.\nWhat would be the effect?\nAnd you'll see a lot of zeros here.\nAnd so what that tells us is the model says, one, it can't quite go finally enough to any\nparticular change, and this doesn't really specify which credits we're talking about.\nway, but the most important takeaway from that is what matters from an economic standpoint\nis how much is coming out of the economy to be spent by the government rather than staying\nin the economy to be spent by private actors.\nSo that's really the main takeaway from that table four and that sort of highlights it\nthat a revenue neutral change doesn't necessarily give you the economic growth where you get\nthe growth is by putting keeping more money in the hands of your of your\nprivate sector rather than spending it as a state government.\nAll right, and I think Senator Tilbury had a question.\nHe's been waiting for a speech.\nI don't really have a question as much as I have a comment and I want to tell you,\nI want to cut income tax as much as I can and or much as we can.\nThat being said, I will tell you, my son lived in Tennessee for three years.\nHe said it was very expensive to live there. He's moved back to Georgia,\nand he's so happy to be back in Georgia and he is paying income tax,\nbut he's saving a lot more money. So I think you, you know, we got to look at the whole picture.\nSo I just want to caution everybody that, you know, some of these states that don't have income\ntax, they get you in other ways, and he noticed it. And now he notices it. Now he bought a\nhouse series back he's married and he loves being here and he's saving a lot more money\nliving in Georgia.\nYeah, and I think Georgia has, you know, you've got obviously the Kansas model where they\ncut and hope the revenue would come.\nYou've got North Carolina that's been a measure approach over the last 10 years and we've\nbeen even much more cautious than them, I think.\nAnd we certainly don't want to go out there and do anything beyond that.\nIs that Senator Red that's got a question?\nWe're gonna go ahead.\nThank you, Mr. Chairman.\nThank you, Kyle.\nYou know my position on income tax.\nI think Georgia's still 47, 48, 49 in per capita spending.\nMy question is on all these models,\ndid any of them show a reduction in income tax\nthat did not result in an employment growth?\nSo I think if you're running,\nI mean, even when they run the trackers for the hurricanes,\nthere's always this wild one that never comes here and goes to Vermuda, is there was there any that didn't show\njob growth or consumption growth or investment growth at some point? These are the only four we ran.\nSo we didn't run 20 and pick forward to show you. We designed\nfour and said let's see what they say. So you might\ncreate one that would come up with something like that. I guess\ntagging on that, do you know my instrument? Do other states that have tried this, have\nthey seen, have you seen a state or no of a state that you can give us a point to that\nthey made one of these changes and did not see either the increase in state GDP, jobs\nor consumption? The chairman mentioned Kansas and I think that's kind of the cautionary\ndetail that where the idea was we're going to cut taxes and we're not going to do anything\nelse to match that and we're going to count on growth to make up the difference.\nAnd that has proven not to work.\nSo you're going to have to offset the changes either by making cuts to the budget that you're\nwilling to live with or by raising revenues elsewhere that you're willing to live with.\nI guess the disastrous scenario would be we're just going to make this one change and we're\nnot going to account for it anywhere else.\nAnd growth makes up for a portion of the revenue loss, but only a portion.\nIt's not going to make up the entirety of it or even the majority of it in the short\ntime.\nAnd that might have big gut too.\nSenator Rhett.\nOh, I was just going to say that we need to make sure we move with caution because I\nI remember when I took economics 101,\nthey would always emphasize that this is a model or vacuum.\nIn the real world, anything can happen\nlike a tsunami or a pandemic, military mobilization.\nI know you want to get to a certain rate,\nbut I just wanted to state that we should exercise,\ncaution us to how fast we move.\nAnd I think we have been cautious\nand we also have real world examples of other states\nthat we can model after and say they did this,\ndon't do that.\nThe state's got a $68 billion deficit,\nwhatever they did, don't do that.\nThe state cut their taxes below us,\nmaybe we want to look at what they did.\nSo yeah, we've got to be conscious\nand we've got to do it the right way.\nAny other, I saw there was a lot on over here\nand then it went off, go ahead.\nI was, this is kind of maybe even somewhat,\nnot trying to, but contradict what Senator Rhett said.\nThe House sent us a bill a couple of years ago to immediately go to 4.99 percent.\nAnd had we done that, we would have had the revenue.\nAnd we would have had the revenue last year, we would have had the revenue this year.\nSo I don't, I guess my question for you is how do you juxtapose that with Kansas, right?\nSo we, the Senate put the throttle on there to phase it in over eight years or whatever\nwe've done.\nAt least in the years we've had so far we know that it has not been necessary.\nSo do you have to overlay that with migration patterns because obviously the growth of\nthe state here is very different from Kansas and would that not give a different result\nbecause how we go on to even 4.5% when the House sent us the bill that went to 4.9 that\nwe would have had the revenue and still had a surplus?\nCertainly the economic conditions were entirely different when Kansas made its change versus\nthe last couple of years that we've seen here in Georgia.\nSo you do have to take account of those things.\nI think what I would describe to kind of get it at the two comments here, I think what\nI would describe these scenarios is more aggressive than current policy but not recklessly so.\nSo going faster because we've seen revenue continue to remain strong, even as it's been\nslowing down, it's not really falling off a cliff at this point.\nWe're not reverting back to the preinflationary numbers from a revenue standpoint.\nSo this really is, we've talked about an accelerator for the tax cuts that were passed two years\nago.\nThis is a faster accelerator, you might say, than that.\nBut without going, jumping directly to 399 or something like that in one fell swoop.\nFollow up to that.\nSince we did not go to the 499, we were put in a position of refunds as opposed to a lower\nrate.\nIf you all looked at or even not, I know you haven't here, but at a macro level, the\nvalue of these kind of responding to surplus is with refunds versus a lower rate across\nthe board.\nDoes that, would that impact these employment numbers at all due to predictability?\nWe didn't model that, but I would say generally, I think it's fair to say that it is better\nfrom an economic standpoint to set rates and lower rates and give businesses and employees\nsomething to expect coming down the road rather than to hand them back some of their\nmoney in a rebate. It should, it's going to drive investment which is going to help smooth\nsome of the inflation that you might see from some of that rather than just giving people,\nif you think about a rebate is giving people back more money for what they already did,\nlowering rates in the future is incentivizing them to do more, to work more, to save more,\nto invest more, and that's what grows the economy.\nSo we, I think generally speaking, it's safe to say that it's preferable to provide\ntax relief through rate cuts rather than a rebate.\nAnd I guess I would add to that, we're not talking about cutting services.\nI always like pouring on our teachers and the state of Georgia have the highest average\nby anywhere in the South and Texas, Virginia.\nThat's another argument we're saying.\nWhat will be the right that will get us growth\nin the state and create jobs.\nServices aren't really a part of this discussion.\nHow much longer have you got on your presentation?\nThere might be another question or two.\nI think I've made most of the points I wanted to make.\nSo I know that the committee has a lot of work to do today.\nI'm happy to stick around until after the hearing, though,\nand speak with anyone who wants to be able to speak.\nSenator, one more question here.\nThank you, Mr. Chair.\nEarlier in your remarks, I believe you said something to the effect that this approach,\nthis analysis did not include the multiplier effects of money spent by government in the\neconomy.\nAnd I'm not sure why you would leave that out.\nThat's number one.\nAnd then number two, what do we make of the fact that during the pandemic, when the federal\ngovernment made major infusions of money to the states and into the economy. And we flourished\nin that setting with this infusion of federal investment. And we pulled back from a real\nnegative projection that we had expected as a result of going into this pandemic. And in\nIn fact, we flourished, our economy flourished, it grew and helped contribute to this big surplus\nthat we have.\nSo how do you account, for one, why would you not look at the multiplier effect?\nIt's the basic part of the picture, and two, we had the real-life demonstration of\nthe infusion of public funds into the economy and so significant, healthy growth.\nSo to answer your first question, the reason, as I understand it, that our colleagues at\nthe book I institute don't use the multiplier approach is because you've got to pick what\nnumber you use as the multiplier.\nAnd the one thing that I think you can be certain of is whatever number you pick is not\ngoing to be the right number.\nYou might be close to the right number.\nYou might be far from the right number, but you're just sort of picking a number and\nsaying, well, we think this is what it's going to be.\nWhat they've done instead is look at the record, the historical record and say, all right,\nwhen states have changed their tax policy, what happened?\nAnd they've pulled all that into the model.\nSo in a way, it is acknowledging that money is going to move and that there's going\nto be growth.\nBut instead of picking a number and trying to base everything on that, it's taking the\ntotality of the changes that have been seen across a lot of different changes.\nSo empirical data rather than a forecast, I guess, is the way that I would try to describe\nit as the difference in approach.\nBut you're not doing a multiplier on anything argue the the private money or if I understand all those Greek\nLetters and formulas at the back correctly that that's right\nThat's right, okay, and then for the second thing at the the sheer volume of money that was put into the economy was bound to have an effect\nWhat we're arguing here is that the greater effect and the more efficient way to grow the economy is\nis to reward people for working,\nsaving and investing more,\nrather than handing them more money regardless.\nSo I got the check, you know,\nthe pandemic relief check.\nI didn't work anymore to do that.\nI didn't produce anymore.\nI tried to go ahead and spend it to get into the economy\nbecause I understood that was the effect\nor the intended use of that money.\nBut it didn't change my behavior\nin the sense of what the fundamentals of the economy\nneed to grow, which are work savings and investing.\nSo that would be the distinction we would draw.\nYou can put more money into the economy,\nand something's going to happen.\nBut we believe the more efficient and effective use\nof that money is to give people an incentive\nto do the things that you would like them to do,\nthe things that are the building blocks of the economy.\nAnd the money was put into the economy\nby the federal government in a very bipartisan manner.\nNo doubt.\nAnd it did cause growth no doubt.\nThe downside of that is because of the deficits,\nwe were spending about 300 billion on interest.\nNow our interest rates have climbed over $1 billion\non a $4 trillion budget.\nSo if we, as a state, were saying,\nover 25% of our budgets kind of go to interest,\nwe'd be in big trouble around here.\nAnd that continuing interest, which\nlooks like it's going to climb, that's the problem with that.\nYeah, if we max out our credit cards in a year,\nwe can have a really good year.\nAnd then we've got to pay them off the next year,\nwe're in trouble.\nThe federal government kind of did that.\nAnd they probably needed to do some of it\nto keep the economy going.\nBut there was a big downside as well for what they did.\nSenator Audius, I guess you can have a last word here.\nThank you.\nKyle, wouldn't you say that you really did use a multiplier\nrather than project in one, you used what actually happened\nwhen states took these actions.\nSo money did move around.\nAnd there was a multiplier.\nAnd this is actually the actual effect of what\nhappened, as opposed to picking one out of the air\nand put it in, right?\nYou can think about it similarly.\nI'm trying to avoid the word multiplier,\nbecause I think there's kind of a technical use\nof that term or, and that's not what was done.\nBut yes, it's acknowledging that when you incentivize people\nto work more, they're going to work more,\nand that's going to put more money into the economy.\nWhen you incentivize them to save more and invest more,\nthey're going to do those things,\nand that's going to build the economy.\nSo you can think about it that way.\nI'm just trying to keep my technical jargon\nas clean as I can.\nAll right, we certainly appreciate your presentation.\nObviously, had a lot of initiative, the committee.\nAnd if you'll get offline and go through the derivatives\nstarting on page 14 with everybody,\nafterwards, make sure everybody's good on all of it.\nMeet me here at 10 o'clock tonight,\nand we'll go through all that.\nSo thank you for your time today.\nAll right, is Representative Perkel here?\nDid he make it in?\nI know he was tied up in another committee.\nI tried to fill a buster to get him here,\nbut I don't think I did.\nSo I guess we'll catch that on the Wednesday meeting\nand we'll be adjourned.\nIt's right now, it's four o'clock\nunless I get an earlier meeting.\nCan you get me an earlier meeting?\nThey will all accept committee meetings and corporations, it's hard for me to even keep\nmy public safety community.\nYeah.\nThey try to cancel me.\nGuys, we're really near the meeting.\nYeah.\nI mean.\nSo.\nI'm interested in getting more information.\nHere's the.\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T19:20:34.024386+00:00"
}