{
  "video_id": "763dpMC45yk",
  "url": "https://www.youtube.com/watch?v=763dpMC45yk",
  "title": "3/20/23 - Senate Appropriations Subcommittee on Compensation",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 76,
  "summary": "Here is a summary of the key points from the Georgia Senate Appropriations Subcommittee on Compensation session on 3/20/23:\n\n**Overview**: This session focused on hearing public comments, particularly from a man named George Johnson who was wrongfully incarcerated and faced challenges after being exonerated. The committee also discussed a resolution (HR 7) related to compensating another wrongfully incarcerated man, Mr. Inman.\n\n**Key Actions**:\n- **HR 7**: Resolution to compensate Mr. Inman, who was wrongfully incarcerated for 23 years.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- George Johnson, who was wrongfully incarcerated for 18 years, gave emotional testimony about the difficulties he faced after being exonerated, including being taxed on his compensation and struggling with medical bills.\n- Representative Houston spoke about bringing the resolution (HR 7) for Mr. Inman, who was wrongfully convicted in her district, and Tiffany Bracewell from the law firm representing Mr. Inman provided details on the case.\n\n**Votes**: No recorded votes detected.\n\n**Attendance**: Quorum present.\n\n**Adjournment**: The session did not adjourn, as the committee moved on to other agenda items after hearing the public comments.",
  "transcript": "You\nWe have a couple of people signed up to speak for this, and if you don't mind, I'll ask\nSenator Robinson to offer a brief prayer.\nThank you, Mr. Chairman. Those who are comfortable with your head with me.\nAfternoon, our Father in Heaven.\nWe thank you, Lord God, for the blessings you've given us today.\nWe thank you for the beautiful day you've given us, provided for us, Lord God.\nAnd God, please remind us of the responsibility we have, Lord.\nContinue to remind us as we move through this legislation, the impact that it has, Lord\nGod, not only on the individual's involved, but the citizens throughout this state.\nAnd remind us, always, Lord God, to keep our minds open in our hearts.\nWe ask these things in the name of your Son, our Savior, our Lord Jesus Christ.\nAmen.\nAmen.\nThank you, Senator Robinson.\nAs I said earlier, we're going to have a hearing today and kind of get to the areas we\nwant to get to and deal with a static committee as well.\nWe might just move that one out so we can get that going.\nI'm very, very interested in this Senate static committee because I think it's something\nthat we really need, so we can just sort of streamline this thing and take a lot of,\nI think, unnecessary input into it after it's been adjudicated and filter through a lot\nof committees and things like that, that way we can deal with it.\nSo, what I will do, what I will do, I'll go by the hearing first and then I go down\nthe list, we got four bills and we got one study committee and I'll start with the hearing\nwith input from, is this Clarence Harris?\nWould you come up, sir, and sit like that,\nwe'll like to hear your comments.\nAre you speaking on any one of the bills\nwe have here today, or generally?\nCompensation bill is safe going to the meetings\nfor the other needs and the procedure.\nAll right, go ahead.\nYeah, some own claims here.\nGeneric.\nAnd I'm George Johnson, project, first exottery.\nI was exotterated in 2000 in Poe.\nAnd I served on my 18 years in prison for a crime,\nwhich I did not commit.\nIn 2005, I was awarded,\nI was supposed to be awarded a million dollars\nin which it was, at that time, they didn't know how to proceed to go forward with their\nduties and things, which they awarded me a million dollars for a period of 20 years,\nand they awarded to me 47,000 a year for 20 years, in which me just coming out of the\nhaving no knowledge how to finish that ponds like that. It was very difficult\nme and a lot of that. I was never able to keep my life together. And then on top of that\nthey turned right back around and I was text. I had to say the annuity to pay the\ntaxes off, you know, from the annuity which they gave them. I'm on this\nsalary and Georgia who was text. And after that happened, I ended up I got hit\nby a car and we lived for dead and on the Saturday road\nduring the snowstorm and I ain't\nabout to pay for my own medical bill because I had no insurance.\nSo a little money that they gave me was going in for I even\nrealized.\nBut when we came up from a new other thing,\nwe tried to talk about the main thing that was important,\nthat would benefit to a medical.\nto have tax, to be exempt from taxes,\nand to have so secure to be on the pitch\nto be established for the salary.\nThese was out there with the main thing\nthat we were all when they knew it came up.\nWhen asked whether I feel like that state\nwill hold me, I said, well, I can't tell you,\nI want to put a price on my life,\nbecause I couldn't do that, you know,\nbecause of what I went through.\nI said, well, what I will ask you all to do\nis to be fair.\nThat's the only thing to ask them to do it be fair.\nBut when nothing about the conversation with Fairbke,\nthere was no sick hug behind him.\nYou give me money, then you take it back by taxing me\nand then you make it where I can't even deal with it.\nOne year up till the next is already coming.\nAnd I hadn't enjoyed my life since I've been out.\nAnd I'm not only speaking about myself,\nbut see there was five others,\na reason when they got out from the time that I got out who ended up getting certain\nstipulations on how to go through drugs and all this, like they still locked up.\nThen you got many help people that I rob a club, who's at their home listening thing,\nPete William's thing, John White, you know, all this other reason, George's stuff, don't\nhave no kind of gun upish now.\nYou see, he had their grant number news, like they should have, give us the amount of\nmind that they told if you want to get it to me and knew it, why wouldn't it\na lifetime of new it? If you give me me a dollar, I'm entitled to the interest\non, you know, because you only gave me four or something thousand out, which is\nfive percent interest, that's the interest itself. Okay.\nSo I never touched the mind that you gave me. Okay, Mr. Harrison, what I'm going to do\nand I didn't realize I thought you were going to talk the record about one of\nthese bills. What you're saying is very important. So what I'm going to have to do\nis ask you to sort of stand off to a sit over to the side and I'll get back to\nin a minute, but I have some bills I got to take care of.\nOkay, I thought we'll talk about a secret room in New York.\nI think you're talking about the structure of it.\nYes, I am.\nIt's been a judicator, so it's very important, trust me.\nOkay.\nAnd we'll listen to you.\nBut what I want to do is go in the order of my agenda right here, if you don't mind,\nsir.\nOkay.\nThank you very much.\nThank you.\nThank you.\nThank you.\nIf you stick around, I'll have you come back and say.\nI'll be here.\nYes, sir.\nRepresentative Houston, you come forward.\nHouse Resolution Number Seven.\nThank you.\nYes, and I have, with me, Tiffany Roseville from Trentman's Pepper and Sanders, too.\nOkay.\nHow to see like that.\nMultiple, isn't it?\nThank you.\nThank you.\nOne of the reasons I'm here is that this Mr. Inman was from my district, and this crime\nwas committed in my district and I have been encouraged by constituents to bring this\nresolution to you because so many people at home really feel terrible about the way\nthe man was treated and realize that he served 23 years of a crime he didn't commit.\nAnd this bill has been gone through the claims advisory board and I'm sure you saw that\nand they approved the payment of this\nand recognized that he had been done wrong.\nAnd like I told the committee and the floor of the house,\nthere's no amount of money that can compensate somebody\nthat went through what he went through.\nAnd I'm sure you've read this,\nand then Ms. Bruce will give you a few highlights of it.\nBut he, it's just a travesty that we had people\nin our judicial system that did some of the things\nto him that they did.\nAnd I think she'll just give you some highlights\nto the case, and I'd be glad to answer any questions.\nYes, ma'am.\nYes, ma'am.\nGo ahead.\nGood afternoon.\nThank you all.\nWe'll identify yourself again soon.\nSure.\nTiffany Bracewell.\nI'm a partner at Troutman, Pepper Hamilton Sanders,\njust down the street.\nI'm the firm and I have had the honor and pleasure\nof representing Mr. Inman formally since early 2016.\nAnd thank you again for the opportunity to be briefly heard here.\nIn boking a 2019 opinion that Justice Namias issued in Mr. Inman's case, we're here today\nbecause everyone involved in our criminal justice system should dread the conviction and\nincarceration of innocent people.\nAnd that includes this esteemed body and the claims advisory board and other folks who\nhave taken a look at Mr. Inman's case.\nI submit the Mr. Edmund's case as extraordinary, it's unique.\nIt is momentous and it's tragedy, not only for Mr. Inman, but for the ADEL community.\nThere were victims of other crimes carried out by the man that committed the offense for\nwhich Mr. Inman ultimately was convicted.\nAnd I believe the draft resolution before you outlines that well, but as quickly as I can\nand cover 23 years of injustice.\nI'll give you some quick facts, some evidence,\nand then what the key courts in this state\nhave said about Mr. Inman's case.\nIn brief, Mr. Inman had just celebrated his 20th birthday\nwhen he was hastily arrested for the murder\nof Miss Donna Brown.\nShe was the night manager at the Taco Bell in Adele.\nHe was the new kid on the block.\nHe had been in Adele for a matter of weeks\nwhen he was arrested.\nThe investigation and the trial were infected with constitutional deficiencies and misconduct\non a scale that, in my opinion, is pretty difficult to comprehend even today, kind of\nmost importantly, Mr. Inman's trial council pushed the district attorney and the GBI and\nthe ADEL police department to investigate a man named Hercules Brown, who had an alarming\nhistory of unprovoked attacks, violent attacks in Adel around this time. Of note, Hercules\nBrown worked with the victim at Taco Bell. He was one of the regular closers at the restaurant.\nHe knew how the night shift worked. He knew the closing procedures. He knew who would\nbe there at the end of the day.\nMr. Inman's Council and the District Attorney's Office received evidence to that effect. The\nThe DA's office and the GBI, for whatever reason, maybe chose not to believe it or chose\nnot to pursue it.\nAt least one witness had reported that Hercules Brown had solicited her and maybe other Taco Bell\nemployees to help carry out an inside robbery.\nAnd at least three witnesses reported that Hercules Brown had confessed for whatever reason\nthat was not enough.\nAnd to make matters worse, the GBI was permitted to testify that it had no information about\nHercules involvement in this offense, and that was\nthe lied by information in their own files.\nThere were no eyewitnesses in this case.\nNo one came forward that saw the crime occur.\nThere was no forensic evidence that connected\nMr. Inman to this crime.\nHis fingerprints were not a match to those found\nat the scene or in the victim's car.\nLaw enforcement never located a gun.\nThere was forensic evidence that someone else committed this crime.\nAnd years later, well after Mr. Inman's conviction\nwith advanced methods, DNA from the inside\nof a homemade ski mask found in the victim's stolen car\ncame back to one person only, one in 18 quadrillion\nto Hercules Brown.\nThere's no room or interpretation for error\nthat Hercules Brown wore that mask,\nand he had good reason too, because he knew the victim.\nUnfortunately, before the trial compounding these issues,\nthe prosecutor failed to disclose\nthat Hercules Brown had been arrested\nwith another homemade mask.\nJust down the street from the Taco Bell\nwill also in possession of a gun and crack cocaine.\nIf you were to let me ask, just one,\nsure.\nCould you explain to me the atmosphere\nthat would require some matter to reveal something?\nIs that ordinary procedure and the law setting?\nYes, so yes.\nOf course, yes.\nOf course, under the Constitution, the prosecution team\nor the state is required to turn over information\nthat is favorable to the defendant.\nAnd let's, if we can keep it as brief as you can,\nI don't mean that.\nIt's very, very important.\nWhat I'm getting at, can you address also, what\nabout the process that we had involved in right now?\nI think you mentioned something about it.\nCan you give us some insight on that,\nwhat your perspective is?\nAbsolutely.\nSo echoing representative Hausten's remarks,\nI think in February, the claims advisory board\nkind of made its own extraordinary statement in this case,\nthey recognized the evidence of innocence\nin Mr. Inman's case, and they unanimously approved\nthe claim for payment.\nMy understanding is that has never happened before,\nin the case of an exonery, they did so without qualification\nand deferred to the General Assembly\nto compensate Mr. Inman.\nI'm sure some of the folks here in the audience\nhave more experience with exonries over the years\ncomparatively.\nBut it's been a multi-step process.\nWe started with the claims advisory board.\nWe've worked through various hearings,\nand here we are.\nMr. Inman believes, and consistent with other exonries,\nhas sought a standard amount of compensation\nper year for which he was wrongfully imprisoned.\nbut total is 1.61 million for the 23 years\nhe spent in prison related to this case.\nOkay, members of the committee comments.\nQuestion of some of the robbing soon\nand then some of the kind of robbing soon.\nThank you, Mr. Chairman.\nMa'am, the not of the murder\nwere there witnesses near the crime\nthat reported seeing the vehicle flee the scene?\nYeah, so the state had essentially, all the witnesses\nin the case except for one, recanted their testimony\neither before or at trial, not decades later,\nas we commonly see in these cases,\nwith the exception of one witness,\na state's witness who testified she saw,\nshe came forward a month after the crime occurred,\nafter an award had been announced,\nwhich she ultimately received.\nShe reported seeing a vehicle speed away from the scene.\nSo did not see the murder occur,\nor the weapon or anything like that.\nSo the short answer is yes.\nThere was some people who claimed to have seen individuals\nand two individuals standing on the corner, I believe,\nand it was late at night.\nIt was two in the morning, sir.\nAnd the vehicle they were fleeing in,\nwas that the victim's vehicle?\nIt was the victim's vehicle.\nAnd the victim's vehicle, is that where the ski mask\nwas recovered from much later?\nIt was the ADL police department failed to collect it\nand it was recovered.\nRight, I think we're saying the same thing.\nI mean, I'm not trying to trap you, I promise.\nBut it was much later, the ski mask was recovered\nfrom that vehicle.\nYes.\nAnd that's the ski mask that was tested\nand the DNA came back to the individual Hercules Brown.\nNot related to that.\nWho later assaulted the individuals at the convenience store\nor the general store.\nYes.\nIn a brutal daytime murder, right, right?\nOK.\nNow, Mr. Inman, when he was released,\nhow was he released from prison?\nI'm thinking, and I'm trying to go back to my notes.\nA habeas was granted by the judge in the Superior Court.\nThat's correct.\nOK.\nAnd so the habeas sent it back to the prosecutor, correct?\nYes.\nAnd what was the basis of the court\nsending it back to the prosecutor?\nBut that's the procedure because the prosecutor has to decide on whether to move forward with\na new trial or not.\nRight.\nBecause of the DNA.\nNo, it was on the totality of the evidence, including the withheld evidence from the\nprosecutor.\nRight.\nSo it would have been the prosecutor's decision, was this the same district attorney when\nit was sent back?\nNo, it was not.\nThat was my nephew.\nIt was that bad.\nOkay.\nAnd he chose not to prosecute the case, correct?\nThat's correct.\nOkay, and was the prior prosecutor, was that individual charged with any prosecutorial\nmisconduct?\nNo, we were three steps removed if you include the current district attorney.\nYes, ma'am.\nAnd so that prosecutor just lost an election, I guess, and moved on?\nNo, he was appointed to a judgeship.\nOkay, thank you, ma'am.\nSorry.\nAny more comments?\nI'm sorry.\nAnd the first district attorney ended up going to prison, the district attorney that\nwithheld evidence ended up going to prison, but not for this trial, not because of this,\nbut in another instance he ended up serving time.\nLater on, my nephew was a DA who is now sentenced as a spiritual judge.\nSo it was your nephew that chose not to prosecute the case?\nThe second time around.\nOkay, thank you.\nSo, Mr. Studsdale, District Attorney Studsdale.\nOh, yeah.\nOh, okay.\nWhat about the first time around?\nI can't remember.\nI'm not sure what you mean by the first time around.\nThis is just a strange one.\nOne thing that bothered me so much is that the withheld evidence and then the GBI agent line.\nWell, and I'm not going to step into that.\nI got some information on that and I've been told that information is incorrect.\nabout somebody lying because perjury is a crime in Georgia.\nWell, you might not know more about it,\nbut when I've understand people down there,\nthis man was not guilty.\nAnd I don't know what the...\nI don't think you would have brought this\nif you thought he was guilty.\nI don't think you would.\nAnd I don't know if we,\nthe only information I've got is talking to the DA.\nYes, ma'am.\nThank you.\nThank you.\nComments by the members of the committee.\nAll right, we thank you for the input.\nAnd we, like I said, this is a hearing only today.\nbut we will take action and look at it next week.\nAnd one of the bills, all of the bills will be up for\na vote or consideration at that time, okay?\nOkay.\nThank you.\nI want to say, when you're having the study community,\nwe need to do something to these people\nwho do things wrong like withhold an evidence.\nThey need to be punished somewhere, right?\nWe have a prosecutorial,\nMr. P.\nThe floor, Mr.\nBiel and the House right now in Judy Non-Sevil and if you'll reach out to the committee and tell them to pass Senator Robertson's legislation we'll do something about\nThank you.\nThank you.\nThank you very much for your time.\nThank you very much for your time.\nThank you for your time.\nAnd it's in Judy.\nYes, ma'am.\nThank you.\nAppreciate it.\nThis time, Representative House Resolution 55, Representative Buckner.\nThank you, Mr. Chairman.\nI also have a couple of people that are here.\nI did that one.\nCome on up.\nI'm sorry.\nI'll get back on schedule in a minute.\nI'm sorry.\nDo you need to...\nGo ahead and sit down.\nThis is Claire Gilbert and Chief Deckmar.\nChief Mars, a police chief that is from LaGrange, Georgia, where this happened back in the 80s.\nWhat I would like to do is just kind of give you an overview.\nI was drawn into a new district as many of us were drawn, and I was invited to come into the LaGrange troop county area.\nAnd when I got there, I learned about this.\nand was asked to carry this compensation resolution on behalf of Mr. Terry\nTalley of LeGrange, who was falsely accused, wrongfully convicted of sexual assault.\nHe served almost 26 years until he was exonerated and released from prison and\nalthough he had always maintained his innocence. His exoneration came\nfollowing a re-investigation by the police district attorney and the judicial\ncircuit there. There were in this re-investigation, they learned that there was unreliable witnesses\nin testimony, biological and physical evidence had been lost or destroyed before and after\nthe trial. And there was withholding of information. But the most important thing is that the\nthe DNA evidence that was used did not match the DNA of\nMr. Terry. Following the re in investigating of the cases and\nthe DNA that had proved that Mr. Talley was not the person\nthat did the some sexual assaults. He was exonerated for the\n25 years, 9.7 months that he had served. We're here today\nbecause the legal system has demonstrated his innocence.\nIt's extraordinarily difficult to be exonerated.\nAnd he was exonerated.\nHe was released from prison.\nAnd he currently works for the city of the Grange\nand the animal services unit.\nI'm not certain what else you'd like to know at this point,\nbut I'll be glad to answer your question.\nJust your input and your opinion about,\nespecially about the process we're going through here\nand give us an idea of what your thinking is about.\nOnce you are, the steps of being exonerated\nand coming before this committee or the appropriation committee\nand all of the steps you built through in that context,\na brief sum of options of what you think about it.\nWell, I'm very much in favor of the bill\nthat I hope you'll hear in a little while\nthat is HV364.\nI have worked with fellow delegation members\non that bill several times we've introduced it.\nI feel very strongly that this is a process\nwe should go through and as with as little politics as possible and have people that know\nabout evidence, evidentiary, I have trouble with that word, processes and that it needs\nto be in a commission.\nBut since we don't have that commission, this this gentleman is a in his own words a\na simple-minded man that has a limited education.\nHe has served time for something.\nHe continually said he was not guilty of.\nIt was proved that he was not guilty of it.\nHe was exonerated.\nHe's been released.\nAnd I think the state did him an injustice\nby incarcerating him, those $25.\nYou're aware of a house bill, $364.\nThis is a bill that we're looking\nat the wrongful conviction compensation review panel,\nWe're trying to get set up.\nThat's the one I mentioned.\nI'm in favor.\nThat's what, okay.\nWe really, I think that, that stream line, the process, we need to get as many legal people\nthat tell us, give us a put on it and whether we move forward with it or not, but any members\nof the committee?\nYes.\nSenator Robinson.\nSenator Robinson.\nI want to thank my delegation member for coming forward and my instructor from the\nat Command College, Chief Lou Deckmar,\nwhose hair was a lot darker when he was my instructor.\nSo it was mine, I do wanna thank y'all for coming for it.\nAnd to talk about briefly the legislation\nthat you were discussing on 364,\nI also have a bill over in legislative counsel\nthat I agree with you 100% I think that we need\nto come up with a product that does take this\nout of the hands of the General Assembly.\nNow, to Mr. Talley's case, you mentioned several times\nthat he'd been exonerated.\nI just want to be clear, and of course, Chief,\nI know you're very familiar with the case.\nThe DNA cleared Mr. Talley of one of the cases\nthat he was sentenced to prison force, that correct.\nAnd I'll call that, and Chief, I know you\nknow from your intimate involvement in this process,\nHe was exonerated from case number 969, I believe.\nBut he also had convictions in case number 972, 973, 974.\nAnd I believe case 970, and speaking to the district attorney there in that circuit,\nMr. transfer, there was some concerns saying that though that he was\nIt's honored for DNA, based on the DNA from that one particular case.\nThat was not the case in the other cases, and the district attorney still strongly\nfills that Mr. Talley was guilty of involvement in those other cases.\nAnd I know at one point there was a testimony that the DNA could possibly belong to another\nindividual, and a search warrant was conducted, and that individual submitted DNA and was\nalso cleared of the sexual assault, and that the information that led to Mr. Talley having\ncontact with law enforcement to begin with was Mr. Talley encouraging or attempting to\nforce a young lady near or on the campus of the Grange College and that she's the one\nthat called 911 when Mr. Talley left the scene and later came back and said he was only\njoking and this kind of stuff and kind of got him involved in this net where he became\nand a suspect in multiple sexual assaults\noccurring in the jurisdiction if I'm correct.\nIs that right?\nClose.\nClose.\nThe incident that brought him to the attention\nof the police actually occurred\naway from the college at a residence\nwhere I think he had been raking\nor doing some yard work.\nHad heard that a woman was offering sex for money.\nHe went to that residence, showed her the money.\nShe kind of waved him away and he took off.\nAnd that's what brought them to the tension.\nBut I would also like to make one correction.\nHe didn't serve 26 years.\nHe served 40 years.\nAnd there was an extraordinary motion that was brought jointly,\nI believe, by the Innocence Project and the District\nAttorney's Office that set aside the sentence\nand allowed him to be released.\nSo with regard to the exoneration, you're correct.\nIt was the one that was based on DNA.\nBut to your point, Mr. Chair, the Senator and I,\nSenator Robertson, I have been talking about this case\nfor two years, and I want to thank you for one of the concerns\nwe had was just the logistical gymnastics you have to go\nthrough in order to get wrongful convictions addressed\nin a way that compensates those that have suffered\nfrom that wrongful conviction.\nSo thank you for that, sir.\nThe issue that concerns me just real quickly background, I just retired 50 years, 32 years\nas a police chief.\nThis came to our attention in 2008 when the Innocence Project contacted us and said that\nthey believe that Mr. Talley was innocent.\nWe said we'll work with you to get a buckle swab, sent a detective down there.\nHe got a buckle swab.\nThat was 2008.\nThere wasn't a finding for the DNA, which exonerated him from the only case where there\nwas DNA available.\nThat occurred in 2012, and that conviction was set aside.\nBased on the information that I had, I was concerned about the nature of the investigation.\nI signed a sergeant to reopen those cases.\nAnd it took him from 2004 until 2012 to 2017 to get enough information.\nAnd this is one of the issues that's a share that you talked about is evidence and how\nit's handled here.\nWe had evidence at the PD, at the Sheriff's Office, at GVI, the court reporter archives.\nThere needs to be legislation that addresses where the evidence goes.\nIt should be warehouse and a central location.\nin their dog had the evidence. And so as a result, evidence is lost, evidence is misplaced,\nevidence is destroyed, and as a consequence, the only physical evidence we had was for\nthat one case. So that would be a recommendation that I would make is that on any serious felony\ncase, there be a central depository where all the evidence goes. It's not farmed out\nto, you know, various folks that are involved in the case.\nSo, so when you're doing it, if I may, she's, so when the active investigation is, you\ndon't share with the sheriff department, it's not some kind of data center that houses\nall of this until the case is finalized or something.\nIt depends on the role.\nWhen you have a multi-jurisdictional investigation, the detective taking that evidence is going\nto follow the protocol for their agency.\nSo if GBI is handling one aspect of the case, and they get evidence, it goes to GBI.\nIf the sheriff's off, in this case, we had an envelope that was found on one of the college\nstudents windshield.\nAnd that was processed for prints, Mr. Talley's prints were not on that envelope.\nBut the sheriff's, it was turned over to the sheriff's office.\nSo now they've got that evidence.\nAnd so to say that it's a bit chaotic in terms of how that evidence is handled would be\nan understatement and would, I think, be a right opportunity for the state to come in\nand have central depositories or give GBI the room in their evidence component to take\nall that evidence and hold it.\nI don't know what, but I really thought we'd already did that, and I really did.\nI thought.\nfor you talking at the conclusion of the case.\nYes.\nOkay.\nAs it's entered as exhibits in the court, and it becomes part of that court record, when\nthat case is over, it ought to go somewhere where it's all together.\nAlong with the chain of custody of each piece of evidence that has been picked up along\nthe way that can all be tied into a neat bow if it we ever end up in one of these hearings\nlike this so that we could show how all the pieces came to this one conclusion.\nYes sir, more important than that is technology evolves and you want to analyze that evidence\nyou can get your hands on it.\nSo in this case, you're dealing with one case\nand there were some other peripheral cases\nthat may or may not have involved him.\nWell, he was just one that we're dealing with\nand that's what the exonerated.\nIt was all of them.\nSee, the working theory of the police chief\nat that time was this was a serial rapist.\nAnd when Mr. Talley was taken into custody,\nthey put all those individual cases together\nand those are the cases that he was ultimately convicted on.\nThere was evidence that was not admitted.\nExculpatory evidence, for example,\none of the witnesses was a Senator Roberts\nand will understand the significance of this.\nOne of the witnesses had a blood alcohol of over 0.3\nand she made an identification based on voice.\nAnd her alcohol limit was what, four times,\nwhat the legal limit is to operate a vehicle.\nThere was gloves that were identified belonging\nto that alternative suspect at the scene.\nThose were never recovered.\nThere were a host of issues that,\nwhen the two sergeants got done investigating this\nfrom 2012 to 2021, they came to me and said,\nand said, and these are not liberal individuals here.\nThese are folks that have been doing this 15, 25 years.\nThey came to me and said, I don't know how they pulled\nprobable cause for a warrant let alone convicted them.\nI think this was a case where heightened concern\nin the community, a serial rapist.\nThere arguably may have been some racial components in it.\nBut the fact is that it was a time where when you look at\nthe evidence, you're curious as to why these convictions occurred.\nOkay.\nNice one, quick.\nYes, sir.\nChief, did he plead any of these cases?\nHe had a one-day trial, and that included two one-day trial.\nHe had one day trial was convicted, refused to plead, had another one-day trial, jury\ntrial, refused to plead, and then after he was convicted back-to-back, he pled.\nHe played to the last three charges.\nWas it five sexual assaults?\nThere were a total of six.\nSix, yeah.\nOh.\nThere were a total of seven separate charges.\nSo my name is Claire Gilbert.\nI am the former executive director of the Georgia\nInnocence Project.\nI would see executive director for six and a half years.\nCan you speak up closer to you so we...\nI would see executive director for six and a half years\nand oversaw GIP's work in the latter years\nwith the Lagrange Police Department on the Terry Talley case.\nAnd so he did end up serving 40 years\nand went to trial on two back-to-back, one-day trials\non serious, very serious assaults, sexual assaults,\nwas found guilty.\nThey both drew from the same jury pool.\nHe received two life sentences plus 10 years back\nto pack each day and then was encouraged by his attorney and his family and he was completely\ndistraught over the fact that he had been found guilty though innocent on these two cases\nand ended up taking a plea on the remaining charges.\nHe on one in the one case, one of the two cases that he went to trial on is the only one\nwhere the Georgia Innocence Project or the Lagrange Police\nDepartment was able to find any physical evidence whatsoever.\nThat evidence was tested and definitively\nproved Mr. Talley's innocence on that case.\nAnd then over the years, there was the reinvestigation\nthat Chief Decmar talked about, some by GIP,\nsome by the police department, some cooperating with each other.\nThat is where information came out about the,\nfor example, the blood alcohol concentration of 0.34\nin one of the cases that was never disclosed\nto the defense, the fact that witnesses had identified\nan alternate suspect was not disclosed to the defense,\nthe fact that an alternate suspect had been developed\nand gloves matching that suspect identified\nas that suspect's gloves was never disclosed to the defense.\nSo there were a series of problems in these cases.\nIn Mr. Talley admitted to one of the crimes.\nAnd he had always admitted to one of them.\nAnd that was the first one that you discussed\nSenator Robertson.\nThat was what we referred to as the botched attempt\nto pay for sex.\nThat case was never the claimant in that case\ndid not come forward until about four months\nafter the incident had occurred.\nShe did not call the police at the time\nthat the incident occurred.\nAnd it was after all of this was in the news.\nAnd she saw Mr. Talley again in the community\nthat she came forward about it.\nMr. Talley is not seeking compensation for that case\nor for another case that the DA chose not to exonerate him on.\nHe was exonerated on four separate cases.\nOne of those had DNA evidence of innocence which enabled pulling the thread to show the\nsevere flaws and lack of evidence in the other four cases.\nThose all four were with agreement with the Lagrange Police Department and we have a letter\nhere that I will distribute that Chief Deckmar wrote in support of Mr. Talley on behalf of\nthe Greenwich police department. Those four cases were exonerated. The DA chose to have\none and then two were not. Those convictions were not vacated and they remained on his\nrecord. However, Mr. Talley is not seeking any compensation for those cases or for the\ntime that he served on those cases, only the ones that he was exonerated on. And finally,\nI just want to add in terms of the nature of a plea that as executive director of the\nGeorgia Innocence Project for years, I certainly learned about the fact that roughly 95\nto 97% of cases resolved in police,\npeople who are prone to influence and suggestion,\nlike Mr. Talley, who the highest grade he graduated from\nwas sixth grade in school,\nmay be more subject to pressure to take, please.\nAnd here, in this case, he fought hard,\ntwo separate cases, trial to trial,\nand they vacated those convictions.\nthey convicted him despite the fact that he was innocent\nand those were vacated as well.\nSo I would just, and I would also note that the fact\nthat someone has pled guilty does not prohibit their convictions\nfrom being vacated or them from receiving compensation.\nOne in over, one in 10 DNA exoneration cases\ninvolved a guilty plea across the nation.\nAnd just last year, Mr. Dennis Perry was exonerated\nby the legislature in the amount of $1.2 million\nfor his wrongful conviction despite that he had waived\nhis right to appeal in order to avoid the death penalty.\nMembers of the committee in the comments, questions.\nThank you very much.\nI appreciate you inputting your comments.\nIf I may say one very other brief thing related to your first questions.\nWe are strong supporters of House Bill 364.\nWe believe it's extremely important to have a reliable, predictable, objective process\nthat these cases can go through.\nTake the leg switch out of it.\nCorrect.\nHave a quick question.\nMa'am.\nHow's the Georgia Innocence Project funded?\nThe Georgia Innocence Project Fund is funded largely by donors, private foundations, thousands\nand thousands of individual donors.\nIt's a 501C3 nonprofit.\nThere are two federal grants to work with conviction integrity units, but that's generally\nthe basis of them.\nThank you.\nI appreciate that.\nAnd that brings up another point.\nIt is so cumbersome when there's exculpatory evidence that somebody that's been in prison\nAnd now you get evidence that maybe they're not guilty.\nAnd right now, it's a nonprofit that's carrying that banner.\nAnd there needs to be some mechanism.\nIn fact, this case, I presented to the Georgia Chiefs\nand also to the Commission on Accreditation\nfor Law Enforcement Agencies.\nAnd as a result, they adopted standards for law enforcement\nthat if there's post-conviction,\nexculpatory evidence, then law enforcement\nhas to have a process to handle that.\nWe shouldn't be circling the wagons\nand creating obstacles to getting folks\nthat ought not be in prison out of prison.\nChief, to that, don't you?\nWe're talking about a case is there for 40 years.\nIt's obvious that some of the rate kits\nwere not sent to the GBI or missing.\nSo in the perfect world would we hold on\nto this evidence for 40 years somewhere?\nAnd that gets to my recommendation\nof some central, which means there needs to be some big\nwarehouses.\nAnd I'm thinking Senator Robertson, that's a good point.\nI'm not even sure you have to maintain all that physical\nevidence.\nYou take, you know, swatches or samples of it and then\npreserve it.\nBecause as you know, we've gotten DNA off of a small piece\nof clothing 20 years later.\nIt's just a recognition that, you know, there may be\nas technology advances.\nBut I think we're solving more cases now by people trying\nfigure out their genealogy than anything else sadly so but I do want to\npoint out that the information the testimony of the district attorney in the\ndistrict does differ then you know like the and I think you reference that to\nthe botched attempt to pay for sex where Tally grabbed her by the arm and pushed\nher back inside the front door and tried to close the front door and they got\nto a struggle and she got away from him, said the Asian female who identified Tally as\nthe person who attempted to grab her.\nAnd so, I mean, there's always going to be those differences.\nSo we need to make sure through the process because it's a lot clearer when we have all\nof the evidence.\nRight.\nAnd the thing with Mr. Tally and that we have these, this one case where obviously he didn't\ndo it, the suspect that they created obviously didn't do this either for basing it, put\nin the same amount of weight on the DA in both of those cases,\nbut then we have all these other cases.\nAnd some of those, like you said,\nwhere he is not seeking compensation on,\nbut did what's convicted on.\nAnd so, you know, all of that comes together\nand tries to give us the reason to do or not do\nwhich are our attempt.\nAnd so that's the other thing, isn't it?\nIn that one case, the botched attempt to pay for sex\nwas initially charged as a misdemeanor.\nAnd then it got conflated with all of these other charges\nto a felony.\nAnd in the other case that he ended up also pleading on\nand that we're not seeking compensation on,\nhe has always maintained his innocence.\nAnd he still maintains his innocence on that one.\nThat is just, he was given a choice\nwhether he would accept exoneration and immediate freedom\non the other four cases, or he could have stayed in\nand continue to fight.\nThe real weighty issues we've got to move on,\nbut a comment from Senator C.\nPlease.\nYeah, I just want to thank you all for your service.\nI tell you, it's tough to listen to folk who are innocent\nand having to go through years of incarceration\nat the dime, but it is hard to listen to that.\nAnd I'm just hoping at some point,\nand I've been listening to it for 20 years now.\nand it doesn't get any easier,\nand we've compensated several folks,\nbut you can't buy back your life.\nYou just can't do it.\nThat's all, Mr. Chairman.\nRight, thank you.\nThank you for your comments,\nand like I said, we'll look at next week,\nwe'll have another hearing,\nand another meeting at the time.\nThank you, Mr. Chairman.\nThank you.\nRepresentative Evans,\nwe're apologized,\nbut these comments get pretty.\nThat's good to have a time, man.\nYeah, it needs a whole new session, don't worry.\nThank you for your time and your patience.\nNo, thank you.\nThank you, Mr. Chairman and members of the committee.\nAnd I have two, but they're related.\nAnd so if it's okay with the chairman,\nI'll just talk about it together.\nYes.\nSo how's for us?\nYou're going to do it three, six, four, first.\nI'm sorry, 48 and 49.\n48 and 49.\nYes, go right, yes.\nYes, Mr. Chairman, House Resolution 48,\nwhich seeks to compensate Michael Stinchcomb and House\nResolution 49, which seeks to compensate Michael Wolfolk.\nThey were co-defendants in the same case.\nCode defense.\nYes.\nAnd they both served 18 years for a crime\nthat they did not commit.\nThey were the first individuals\nexonerated by the Fulton County Conviction\nIntegrity Unit.\nThey shot in self-defense.\nThey had maintained that from the very beginning.\nAt all times, in this case, the physical evidence\nsupported that they had acted in self-defense.\nThe conviction happened really with the help of one\neyewitness testimony who did not have great vantage point\nfor what happened that day and had been inconsistent\nin their story several times.\nBut nonetheless, it happened the best eyewitness\nto see what happened was actually in the car\nwith the person who ultimately was shot\nand was in his deceased was sitting in the car\nwith that person.\nThat eyewitness was thought to be dead for a number of years.\nThe prosecution found out that this person was not dead.\nOnly a few years after the convictions happened,\nnever brought that to the attention of the defendants\nor their counsel.\nBut luckily, those defendants were\nable to find that person on their own later.\nAnd that person's testimony, which\nwas consistent with self-defense,\nis what ultimately led to the grant of the new trial\nand the ultimate null process,\nwhich was the exoneration here.\nBut very briefly, the gentleman were in a house.\nThere was a woman, the lady who died.\nShe was shooting at these men in the house.\nThey were ducking and trying to find cover within the home,\nbut they were not able to do so,\nbecause she was shooting through the window.\nSo they grabbed a gun to shoot back in self-defense.\nAnd one of the bullets ultimately hit the driver of the car\nand I think she was passenger of the car,\nbut that's how it happened.\nSelf-defense from the beginning,\nbacked up by I witnessed testimony\nthat unfortunately it took too long to find.\nAnd these men, just like anybody who serves time\nin the prime of their life, you know, missed out on their\nbest earning years, missing kids grow up,\nmissbearing loved ones.\nAnd while we can't fully compensate them\nfor what happened, we asked for compensation\nthat's in line with what this general assembly\nhas done in years past.\nAnd appreciate your consideration.\nThank you.\nAny comments, Senator Robinson again?\nYes, sir.\nI'm sorry.\nThank you.\nNow, you said was she the driver of the passenger?\nShe was the passenger.\nOK, and so she was shooting at the Elm in the house?\nYes.\nAny reason as to why she was shooting at them that we know of?\nI think they were in a fight.\nShe was in a fight with one of them.\nIt's a domestic type situation then?\nYes.\nOK.\nAnd the eye witness that was later found,\ndid that person give a statement at the time of the death?\nNo, they were thought that the driver,\nhe was thought to be dead.\nAt the time that Mr. Stinchcom and Mr. Wolfhoek\nwere going through their trial, he\nwas only located years later.\nSo he never testified in the original.\nSo he was never witnessed, never spoke to police\nuntil he testified in the later trial for the exoneration?\nYes.\nYeah, there was, there ultimately they won their motion\nfor a new trial from the Georgia Supreme Court\nafter talking about the availability of this new witness.\nAnd then the Fulton County District Attorney's Office\nultimately did a null process\nso they didn't move forward with the new trial\nbecause the evidence wasn't there.\nSo when did the prosecutor become aware of this witness?\nWe believe as early as 2009,\nwhich was only about four years after.\nAnd who made them aware of this eyewitness?\nWas it the defendants?\nNo, he became known to the Fulton County District Attorney's Office\nbecause he was an eyewitness in other cases for them.\nHe's an expert eyewitness, is what we like to call him.\nHe's trying to, yes, thank you.\nComments, questions, thank you very much.\nThank you, Mr. Chair.\nAppreciate your time.\nAppreciate your patience.\nThank you.\nNext, Representative Hokeham.\nThank you for your patience.\nThank you, Mr. Chairman and members of the committee.\nIt's my pleasure to speak with you about House Bill 364.\nAs just a little bit of background, I am a former prosecutor.\nAnd the first time that I was asked to work on one of these issues was last year.\nI worked on a resolution for Mr. Kerry Robinson, which Senator Beach then carried in the\nSenate, and to be candid with you when I was first asked about it, I did not immediately\njump at the chance to help.\nMy own biases, I assume that people that went to jail were in fact guilty, and I had\nto work through that.\nAnd one of the things that I've thought about a lot since becoming involved in this\nis there is no human institution on this planet that is perfect every single time.\nAnd our juries are a very good system.\nThey work very hard, but they are not perfect, and they do not have a perfect record.\nSo it is very important for us to have this possibility of compensation for individuals.\nAnd you've heard some of the harm already, I'll touch on it very briefly, besides just\ntheir liberty being taken when it should not have been, one's health is greatly diminished\nif you spend time in prison.\nwho spends time in prison, you have a shorter life expectancy than everybody else.\nThey are not able to invest in their skills and in their careers and often they are spending\ntime in jail during the years when they should most be working.\nThat means that they're not contributing to social security.\nThat means that they're not contributing to Medicare.\nAnd so when they come out, they don't have access to the services that are available\nto everybody else who wasn't put in the same position.\nSo what are we trying to do with House Bill 364?\nI'll give you an overview and then I can go through any\nof the specifics.\nWhat it does is it effectively would end this process.\nI heard from many members in the House and you all may feel\nthe same now that this is a really hard decision to make.\nAnd many legislatures do not really feel like they have\nthe background, the understanding, and the information to make these decisions.\nSo what is proposed in House Bill 364, which is a bipartisan bill, and it might be helpful just\nto provide a little bit of context. This is not in any way, shape or form, a partisan bill.\nIt was initially worked on by now leader's abstraction. He started on it last year before.\nHe was promoted to become the majority leader. He worked on it, drafted it, and then asked me to\ncarry it because he had a lot on his plate and it was able to pass the House last year.\nThere were some questions in the Senate and to be fair, there were some issues that were\nunresolved at that time.\nBut over the last year we've worked to address some of those unresolved questions and specifically\nwhat those were was the Supreme Court had weighed in last year informally and it said that\nthey had a little bit of concerns in terms of the separation of powers issue.\nThose have all been resolved and what we have done is we have set up the bill so that\nis an administrative function where if there is a recommendation for compensation it would\nbe a recommendation to the Chief Justice to then put it into the Judicial Council's budget.\nIt is not the legislature directing what the Judiciary does and instead it is directing\nan administrative function of putting a line item in the budget.\nSo what this bill would do is as you've heard the existing process requires an individual\nfile claim against the state, that claim goes to the claims advisory board which is administratively\nattached to the Secretary of State. Those individuals don't have the expertise to really evaluate\nthese claims either. You heard that there was one individual that they recommended have a compensation,\nhave their compensation be approved, generally what they do if they deny the claim.\nThey may still say in their write-up in their recommendation that we believe the person is innocent\nand there's compelling information as to the person being innocent.\nBut they generally deny the claim because the claim may be against the Department of Corrections\nand the Department of Corrections didn't actually do anything wrong.\nThey were provided with an inmate, they housed the inmate, cared for the inmate,\nand then they released the inmate.\nSo we have this claims advisory board which is not really well suited to make these decisions.\nSo what this would do is we'd keep the claims advisory board but then underneath it\nAnd the Meadeville starts on Section 4 on page 3\nis this first, and this is really, really important.\nThis only applies to the innocent.\nThis is not for individuals that were released\non a technicality.\nThis is not for people that committed crimes.\nAnd for whatever reason are being released,\nthis is for people who are innocent.\nSo that category of individual who did not commit the crime,\nbut for whom their liberty was taken from them.\nSo part four on page three outlines that,\nthis has been reviewed by the prosecutors\nto make sure that it's tight\nand that we're only covering innocence.\nAnd then we would set up a panel.\nThe panel, and certainly if the Senate has different views\non how to do this, we're all ears.\nBut this is what we tried to do.\nYou'll see on line 71, a judge,\nretired judge or retired justice.\nThe retired judge or retired justice,\nthat was a recommendation from the Supreme Court\nto broaden the pool of individuals.\nAs you all know, we have former Chief Justice Namios,\nwe have former other members of the Supreme Court\nwho potentially serve in this capacity.\nThey would serve on it.\nSo we'd have that expertise of having a judicial officer\nwho could make sure that this person is actually innocent.\nYou would have a district attorney to represent the prosecutors.\nyou would have a criminal defense attorney.\nAnd then since most of the exonerations concern DNA,\nyou'll see that the appointments from the House\nrepresentatives and the Senate would be individuals\nthat have that expertise, expertise in forensics,\nso that way they could help, because that is usually\nthe basis by which people are exonerated.\nThe panel would be able to promulgate rules and regulations\nand develop forms, et cetera.\nThe bill also carves out one of the things that you've heard in the testimonies relating\nto the others.\nSometimes there are other crimes that take place that perhaps the individual did, but\nthey are convicted of something that they didn't do.\nThey cannot be compensated for those crimes and there is a carve out for compensation\nfor them to satisfy the sentences related to those other crimes if that is in fact what\ntook place and then the amount for the bill is this panel would review the evidence make\na recommendation and then the amounts which is on page seven we did a survey of all the\nstates and my understanding is that 38 states have a process by which they have an independent\nboard similar to this make these decisions instead of them coming through their general\nassembly. So Georgia is a minority state right now as not having one of these processes.\nThe average across the country is about 75,000. In real dollars, it may sound like a lot,\nbut if you really take a step back and ask, would you take the deal of 10 years, 15 years,\n20 years in prison for 75,000? Nobody on this planet would take that deal. But this puts\nwithin the board a range between 50 and 100,000 recognizing\nthat the midpoint is that national average.\nBut it provides some flexibility.\nSo if the board believes that an individual should have\na lower amount and let's just say that that individual did not\nhave much in terms of work experience,\nwhereas perhaps somebody like me might be more towards the\nhigher end of the scale if I was wrongfully convicted.\nSo it gives a little bit of flexibility.\nThere was debate about whether to set it as a flat fee\nor a set figure or a range.\nAnd what we settled on was a range.\nAnd those are some of the reasons for that.\nI will also, just in terms of context,\nit may be helpful to inform your decision-making.\nThere are some states that are far more generous.\nThere are some states that provide up to $200,000 a year.\nThere are some states that provide health care\nfor format inmates.\nAnd so this proposal is candidly fairly limited,\nbut at least has a good procedure set forth\nto make sure that one, the individual is innocent\nand then two to give a recommendation.\nAnd the last couple of things that it does substantively\nare after this board, if it were to make a recommendation,\nfor compensation, is it would transmit to the claims\nadvisory board because that will be administratively\nwhat it will be under, and then the claims advisory board will transmit it to the Chief Justice,\nwith the recommendation that it be put into the budget.\nWith that, the General Assembly will still have some oversight, so there is a safety valve,\nso let's just say that for whatever reason the board gets it wrong, before we appropriate\nthat, they could alert us and then we could make a change to the budget.\nI think that's highly improbable that that would happen.\nAnd so then this would just be placed into the public state.\nI think how we do it in the different chambers is slightly different.\nIn the house we have a public safety subcommittee on appropriations.\nSo it would come through that with the Judicial Council presenting it.\nAnd wherever the Judicial Council presents to the Senate,\nwould be where that would be presented.\nIt would be line items for those specific individuals.\nAnd then that's the basic gist of it.\nAnd then the final thing, and this is on page 9 and 10,\nan individual can have a claim for wrongful conviction.\nSo what this would do in beginning online 204\nto the end of the bill is it would provide a credit to the state.\nSo if an individual has a claim for wrongful conviction,\nthey don't effectively get to double dip.\nis the state will get a credit for that.\nAnd the second paragraph, the second paragraph,\nfee is that it's pending, and then there is a judgment.\nAny amounts awarded under this would just be applied\nto that wrongful conviction of war.\nSo we think that we put together a pretty thorough\npiece of legislation to address this,\nbut I'd be happy to answer any questions at y'all.\nYes, Representative Hogan, let me,\nOf course, I really appreciate the effort in this bill.\nIt's represented in this bill.\nI think it's really a soul and it really is.\nAnd we've complained over the years,\nat least I have, that we need to just take this out\nof our arena directly, so to speak,\nand do the thing that I think your bill is attempting to do.\nSo I'm sure we all have some input on it,\nbut I wish you well, and I certainly hope it gets some input\nfrom everybody so it can be pretty well structured\nand can stand the test of time.\nRepresentative, Senator Beach.\nYeah, thank you, Mr. Chairman.\nThank you, Representative Holtman, for bringing this.\nWe talked about this last year,\ncreating something like this.\nSo if this panel, this five-member panel,\nis created, they would be hearing these\ninstead of us today, correct, number one.\nAnd number two, if they decided this person,\nshe'd get $75,000 a year for 10 years of wrong conviction,\nwrongfully being convicted.\nWould that be paid in an annuity?\nOr would it be $750,000 in cash?\nAs written right now.\nIt's just cash, doesn't it?\nIt does say cash.\nSo right now we pay in an annuity, right?\nWe give an upfront payment and then pay over annuity.\nExactly.\nSo you would have to have some oversight\nfrom the appropriation standpoint if we have to.\nBecause right now we've got $5.6 million just\non these cases here.\nknow, some of that's an annuity. I don't know how much is up front payment. I'd have to add\nit up, but I just want to ask you that how the payments would be made. And I did see\nin cash online. I forget what line, I mean, what page it was, but it's not a robber's\ninvalid either. Yeah, line 164 payment of compensation should be made in the form of\ncash. Correct. So, I mean, do you think we should look at annuities or no, or do you\nI think they should just get a check for whatever.\nI do think that they should get a check.\nAnd the reason is, is the vast majority of cases\nthat have come through the General Assembly,\nthey're not people that spent six months or a year.\nThey're people that spent 15 years, 20 years,\n25 years, 30 years.\nThey don't have cash.\nThey don't have resources.\nWhat we hear about the challenges for when people\nare released from prison, how they get restarted,\nthey need housing, housing is really expensive.\nSo this money, again, it sounds like a lot,\nbut if you're working all year, you're paying a mortgage\nand then you're having a home that's worth something.\nSo by giving these individuals money\nto make an investment in housing,\nto take care of their medical bills,\nwhich undoubtedly they are going to have,\nyour health 100% is less good when you come\nout of prison than before.\nAnd then, as stated, they don't have retirement.\nThey don't have retirement because they've been locked up.\nAnd so to have cash, and what I will tell you is,\nI had the concern initially of, well,\nbeing a little paternalistic, admittedly,\nin terms of this view, of would they make good decisions?\nThere are organizations that help these individuals\nto make good decisions when they're released.\nthere's an organization called After Innocence,\nthere's other organizations that work with these individuals,\nso they're not spending it in a way that's frivolous or wasteful.\nAnd I think they have an appreciation of time\nthat's very different from almost everybody else\nbecause they lost so much of it.\nAnd I would like to think that they would be good stewards\nwith the monies that they receive for that purpose.\nSo my recommendation would be to keep it as cash, certainly,\nif the Senate wanted to move in an annuity way,\nyou certainly can but I think I think I think cash better serves the purpose\nthat we're trying to achieve. Okay. Thank you Mr. Chairman. Senator Robinson. Yeah\nthank you Chairman Harveston. I want to be clear now once the individual\nreceives the money do they does the state pay the attorney's fees out of the\nmoney or does the individual required to pay the attorney fees out of the\nmoney that they receive. Because that's part of the legislation that they\nreceive the amount less attorney fees. Because I can only imagine, especially\nin some of these bigger cases, that's going to be a fairly good hit.\nCorrect. They would be paid the monies than the legal fees would have to be\neffectively, they'd be reimbursing for the legal fees that had already been\nAnd putting the legislation together, I know Senator Beech was talking about it last\nyear.\nWe looked at some of this and we were looking at the possibility of hope for the individual\nwhen they got out to go to two-year, you know, tech school or possibly even we discussed\nfour-year college funding for some of these individuals and various things.\nBut do you know of an avenue to where, and I'll use one of the judicial circuits that\nI represent, but we'll say Chattahoochee Circuit, if an individual is convicted, and it's\ndetermined that evidence was hidden by the prosecutor.\nOther misconduct occurred, maybe I would never do it, thanks to Chief Deck Marby and\nmy instructor, but an officer that may have perjured themselves in court.\nAnd once this is discovered, is there any responsibility put back on the circuit that\nput this individual in the prison system to start with?\nBecause like you said, it's not the Department of Corrections fault that they received\nthe individual and processed them in and took care of them.\nAnd I will push back a little bit on the health care because the health care and prisons\nin jail have to be equal or better than the community standard.\nI've written a lot of RFPs for health care, for prison, for jails.\nAnd they have great dental care, psychiatric care, and medical care.\nBut is the circuit responsible at all for their mismanagement or just wrongly causing an\nindividual to be convicted?\nI think there's different factors that could lead to a wrong conviction.\nAnd what we're trying to do is to compensate the harm.\nThe cause I agree with you is important.\nIt could be that the jury just got it wrong.\nAnd one thing of note on that is once you're convicted, in America we're very lucky that\nyou have the presumption of innocence before you're convicted, afterwards you don't.\nAll the legal cards are stacked against you when you're convicted.\nSo to get to a place of exoneration is extraordinarily, extraordinarily difficult.\nWhere did you find your definition of exoneration that's in the legislation?\nWas that, was that ledge council?\nLedge council?\nYes.\nAnd the prosecutors reviewed it for me too because I wanted to make sure that it wasn't\noverbroad.\nYeah, because when I, when I spoke to ledge council and we got hung up on the definition\nof exoneration, I did what any good student from Harris County would do and I went to the\ndictionary.\nAnd it says, free from guilt,\nin which I think is a very high standard.\nIt means the individual is not guilty.\nAnd so we run into some of these,\nand I think you pointed it out\nwhere we had a getaway driver\nwho was involved in an arm car robbery\nwhere an individual was murdered.\nThis person went to prison,\nstayed there for 20 years,\ngot out on a technicality.\nThere was never any doubt that he was,\nand the prosecutor at that time said,\nyou know what, this case is old.\nWitnesses have died, this other thing.\nI just don't have the evidence to prosecute this individual.\nSo under that circumstance, that individual would not qualify under your legislation\ncorrect?\nCorrect.\nAnd what I would invite you to just say is that the district attorney would be invited\nto the panel, and that would be another safeguard.\nAnd I hear what you're saying, and I try not to do policy\nmaking by anecdote, but sometimes it helps inform policy making.\nI had a case that I prosecuted once that involved sexual\nassault and it involved a very young victim,\nand it was pretty egregious misconduct.\nThe young victim was very, very shy.\ndid not want to testify to everything that had happened.\nAnd so in how we charged things, we\nwere very careful taking that into account.\nSince the individual pled guilty, we got a conviction.\nBut then, as you know, we have to deal with the sentencing.\nSince the victim did not want to talk about some of the humiliation\nthat was inflicted upon her, the judge\ngave what I thought was a pretty lenient sentence.\nWe had what's called bridging the gap session afterwards,\nwhere the judge met with the lawyers.\nAnd I was in the army at the time.\nI was a Jag Officer, and I'll admit,\nI was beyond disrespectful.\nAnd I can't swear here.\nI tend to do that from time to time.\nBut in my remarks, I said that you got it wrong.\nand he said, well, if I had known that A, B, and C had happened, I would have\nissued a different judgment. And I said that did happen. I just couldn't put it\nin front of you. So that's different in terms of the court system. But this, there\nwon't be those rules of evidence. And so a prosecutor could come in, could say,\nlook, I tried this case, this person did it, don't award it, and I'm telling you, and\nI think a panel, it would be highly improbable that a panel would overrule a prosecutor\ncoming and saying that.\nFor all of the exonerees that the state has moved forward on, my understanding is that\nthe prosecutors have not taken that stance.\nI have not done a survey of all of them, but I can tell you from the one that I worked\non last year, that was certainly true.\nBut I do think that we have a safeguard in there by providing that information or that\nopportunity for the DA to come and share his or her views with this panel.\nWell, I think you've had a lot of the marks in here and I appreciate your work on this.\nAnd I do think it's important that we disconnect our heart from some of this stuff when we\ndo write policy because we can't put a face on it because our intention is for it to\nimpact 11 million George and should they find themselves in the circumstance.\nI do appreciate your hard work on this.\nSenator, see that Senator Beech,\nand let's be mindful of Beecher is getting weight,\nand I don't want to, yeah,\nSenator, see that Senator Beech.\nNo, I was just going to say I have my point, Matt.\nI didn't want to leave, and it's really, really.\nIt is not my health, thank you very much.\nSenator Beech.\nMy look's all right, though, don't be afraid of something.\nIf it's over 1.5 million, the 1.5 million would be cash, and then the other money would\nbe in an annuity.\nBecause I tell you, if you got 25 years times 100,000, you're talking 2.5 million, would\nyou be?\nI know cash is important to get a house and to kind of get them back on their feet.\nWould you be amenable to a set amount of cash, not to exceed a certain amount, and then\nthe remainder be paid in an annuity.\nAnd I think it would protect that person a little bit,\nbecause you're gonna have family members\nand so on trying to come in and say,\noh, you got a two and a half million dollars,\nI need some money, you know?\nYou follow what I'm saying,\nand I think it might even protect them\nover the next 10 years if they had a 10 year annuity\nafter they got the initial 1.5 million, for example,\nand limited to no more than 1.5 million in the cash payment,\nand the rest would be paid out in some kind of annuity\nor payment plan.\nSenator Beige, I think that sounds very reasonable.\nThe only suggestion that I would have would be to make sure\nthat the newity would be inheritable by the individuals.\nSo if the individual's life doesn't-\nYeah, I think we've done that before.\nRight, correct.\nOne case I hadn't read it, I think we've made-\nLet's just something for the committee to consider.\nAnd I think this is a real, real good legislation\nworthwhile of our attention.\nSo if I could ask a your consideration of it,\ndo you want to move it up to the largest center\nwhere we'll pass it up next week\nand we'll look at it and try to perfect it\nwith some of the amendments\nso we can perfect it between some of the concerns.\nThere's some of us how we can just,\nand we're next week we'll move it out.\nIs that amenable to us?\nYes, remember that.\nWell, if you come back, they would take care of it, okay?\nAny time that's true.\nThank you.\nThank you.\nI know I got some other people,\nsomebody else had to get forget Tiffany brace well that that was already you okay\nand let me let me find we just really it's some real serious stuff here we\nwant to make sure we are very careful about how we crafted and pass it out so\nplease if you come back next week we'll we'll we'll give it more time okay\nhopefully we have the early in the day so we can have back members of the\ncommittee if there are no other comments.\nOf course, we stand adjourned.\nThank you.\nEven for the Army guy, we'll really.\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T12:25:48.064404+00:00"
}