{
  "video_id": "76oHNPIrpGQ",
  "url": "https://youtu.be/76oHNPIrpGQ",
  "title": "Georgia House - Day 16 (2026-02-21)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 16,
  "video_date": "2026-02-21",
  "duration_minutes": 72,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 16 (2026-02-21) session:\n\n## Overview\nThe session featured an introduction and remarks by Representative Gerald Greene on the work of Reverend Darryl Alexander in the community. Reverend Alexander then delivered an impassioned speech encouraging the legislators to be open to God doing \"new things\" and not to be stuck in the past.\n\n## Key Actions\nNo major legislation was passed or referred during this session.\n\n## Bills Introduced (First Reading)\n**HB780**: *Description not provided*\n\n## Notable Moments\n- Representative Greene introduced Reverend Darryl Alexander, highlighting his community work and service.\n- Reverend Alexander shared a personal anecdote about searching for salt and pepper, using it to illustrate the importance of being open to God doing \"new things\" and not clinging to the past.\n- Reverend Alexander delivered an inspirational speech urging the legislators to embrace change and not get stuck in old ways of doing things.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present, as the session was convened.\n\n## Adjournment\nThe session was adjourned. The next session date was not provided.",
  "transcript": "All right, so Leonard and Joanne, they are great individuals\nin Blakely, Georgia.\nHe is the oldest five children.\nHe's a veteran.\nHe was in the United States Air Force,\nwhere he went on to Olimberley's serve,\nhis country for 20 years.\nAnd we find that when he got out of the Air Force,\nhe came home.\nHe came home to Georgia, and that's so important.\nHe didn't think about Florida anymore,\nGeorgia became his home.\nDarrell has a master's degree in theology\nfrom North Carolina College of Theology,\nand he's the pastor of New Zion Baptist Church\nand Seahoke Ministries there and Blakely.\nI've had the opportunity to visit with him\nand with Jason there and talk about some of the things\nthat are important and what's going on in Blakely, Georgia.\nAnd I know that we have another lady\nthat is very important to Blakely Georgia\nand early county.\nAnd I hope she will make sure that she speaks\nto Darryl and just a little bit.\nBut I wouldn't tell you just quickly,\nwhen early county was hit by Hurricane Michael,\nDarryl coordinated and oversold the utilization\nof visiting and local Southern Baptist disaster relief\nteams. They fed over 1,000 meals a day for three weeks and took care of individuals in the area.\nAnd I have the great pleasure to this morning to introduce the Reverend Darryl Alexander,\nbut more than that I introduce my friend to you this morning. Thank you.\nGood morning, I'm just so thrilled to be here this morning with you all.\nThank you so much, so much my friend representative Greene for the invite, and I thank you so\nmuch represented Speaker Ralston for allowing me to come and share my convictions with\nyou all this morning.\nAnd I thank you so much.\nEveryone is here in the house.\nI truly do.\nI thank you.\nThank you for my friends and my family that traveled in support of me.\nSo I thank you.\nI thank you.\nI thank you.\nYou're staff.\nYou're staff so graciously sent me all the documents and everything that I needed\nfor today. They gave me what to expect and what not to expect. But Alicia told me that\nthere was an error on one of the documents that they sent to me. It says that I was supposed\nto speak for five minutes. She said it was 20. Just joking.\nWhen I met for the first time Representative Green, I was still in the Air Force, so\nover 15 years ago, and I was visiting my parents who had just moved to the area, hadn't\nbeen there long at all.\nAnd as I'm walking in the front door, I see this guy, it looked like somebody or something\nwas chasing him.\nHe had his tail, his shirt tail out.\nHe was drenching, drenching wet.\nSo he came, fell on the porch.\nAnd I said, come in, come in, quick.\nMy dad come running out.\nHe's like, what is going on?\nAnd this man says, can I have some water of the first day\nhe wanted, it was water.\nHe got down the water.\nHe says, how you doing?\nI'm representative Gerald Green, now I want you to vote.\nEvery since then, we've been friends.\nHe was so down the earth and I just really, really appreciate him.\nSo let me get on with the task at hand that I have for today.\nWhat I want to impress upon you today, it comes out of Isaiah, Isaiah the 43rd chapter.\nIsn't it Old Testament?\nAnd if you don't know, you can find some fresh stuff in an old well.\nIsaiah the 43rd chapter, I'm going to be reading verses 18 through 19 and I'll use the King\nJames version.\nit reads, remember ye not, the former things, neither consider the things of old. Behold,\nI will do a new thing. Now it shall spring forth. Shall ye not know it. I will even make\na way in the wilderness and the rivers and the desert. Here we have the children of Israel\nwas expecting God to show up like he's shown up before and God was reminding the children\nof Israel to remember not how I did it before. Remember not how it was done before. We are\nare so quickly to look at the blessings of before.\nWe're so quickly to look at how God had done it before.\nWe look at how he did it with Samson, and we expect that same thing.\nWe look at how he did it with David, and we do expect that same thing.\nWhen he shows up with manner, we look for him to do it the same way.\nWhen he showed up and parted the red sea, we look for him to do it the same way.\nBut the Scripture tells us to remember not those former things.\nwants us to not allow that old baggage that we carry around. Old baggage for us may be\nthe hurt, the pain, the sorrows that we've had, the scars. He says, remember not. Perhaps\nlegally speaking, you may be hurt partly by the word that declares, forget the former\nthings so that you will probably position to embrace what God is ready to do for you.\nPaul tells us in Philippians 3 and 13 that his approach was to forget those things that\nare behind him.\nMy brothers and sisters, anything that would keep you glued to the past, God is telling\nyou this morning to just cut it off.\nAnd I know the business that you all are in, a lot of times we look at how things have\nbeen done in the past, how things have played out in the past.\nGod is saying he wants to do something new, don't even consider those things of old.\nAnything God does, he wants to consider not to consider those old things.\ndoes however ask you to focus on the new. He's doing a new thing. God is not going to recycle\nor resurrect anything old. He's going to do a new thing, new meaning not old, not seen\nbefore. That's what he wants to do. No eyes have seen, no ears have heard what God is\ngetting ready to do. A couple of weeks ago I started my diet a little\noverweight and that dieting is something new for me. So I get up one\nmorning and I boil me some eggs. I started the keto diet, high protein, low\ncarbohydrates. So I got up this morning, I speak\nand I began to bore my eggs and I bore my eggs and when I got finished\nboiling my eggs, what do we have? There's two things we got to have with the\nboiled eggs. Salt and pepper. So I began to look for my salt and pepper and I go\ninto cabinet and I can't find the salt. And I'm looking and I cannot find the salt\nknow where then I said well it's got to be in here so I begin to look for the\npepper and I can't find the pepper anywhere now at this point if you like me you\nwant to find the things you salt and pepper ought to be there if you like me\nand you're going to aggravate it where is the salt and the pepper so by this time\nI pull out everything in the cabinet and I can't not find the salt and the pepper.\nAnd now I am aggravated and my wife is in the back and I'm wondering thinking to myself,\nwhat kind of a house is this with no salt and pepper?\nSo I'm trying to contain myself before I go back and I ask my wife, where is the salt\nand the pepper?\nSo I'm marching back and steadily I'm trying to contain myself about the salt and pepper\nand I get back to my wife and she's back there, she's doing her makeup and doing a facial\nand getting ready.\nI said, honey, she says yes.\nI said, we don't have any salt and pepper, she says yes we do.\nI said, no, we do not.\nShe says, honey, we have salt and pepper.\nI said, no we don't.\nI went and looked in the, in the China cabinet,\nwhere I looked in the little crystal salt shakers,\nand there's nothing in it.\nWe don't have any salt and pepper,\nand she just mosey on up to the kitchen,\nwhere I had taken out every seasoning out of the cabinet.\nShe had went up in that same cabinet,\nreached up and pulled out salt and pepper,\nand I'm looking at what is she pulling down,\nand I look and I see sea salt, I wasn't looking for sea salt, I was looking for the canister\nwith the blue boat on it.\nShe pulls out the pepper, it was the ground pepper, and I'm the wait-a-man, I'm looking\nfor the little can of pepper, what I'm trying to tell you this morning is we'll miss\nWhat God is doing in our life by holding on to the old things, the old ways, the old looks,\nwe will miss it.\nWhen God says that He wants to do that new thing, stop looking for that old thing.\nGod wants to open up a released new solutions to the problems that you may have been troubling\nyou.\nconnections will spring forth. New doors are open. New relationships will be\nestablished. New fellowships. New ministries. New churches. New way of doing\nbusiness. God wants to do this new thing in your life. And when he says, I do, I do.\nSays God says, behold, I do. The alpha and omega, the beginning and the end to all\nthings. He says, I do. He's the one that's going to do it, not you, and it's power in his name.\nHe says it's going to spring forth. The Bible declares that the new thing will spring forth.\nThat means that everything that you touch, if you embrace what he's trying to do, it will bloom.\nIt will blossom. It will spring forth. And that's what he's letting us know on today. The time is\nnow. This battle is not for the strongest. Your time is now. Your testimony is\nspringing forth. And since it's the giver of life, we expect Jesus this and\nJesus mighty name. When he says, I'll make a way in the wilderness and rivers in\nthe desert. You'll begin to get the victory where normal circumstances and\nsituations is impossible. Nobody be able to explain it because it will be beyond human\nreasoning. A way will be made for you when it seems to be no way. God would begin to\nreveal Himself as the waymaker, the solution giver, the way, the wisdom, the understanding.\nAll we have to do is begin to grab a hold of what God is telling us this day, this time,\nthis season.\nI stopped trying to hold on to the new thing that God is doing.\nI know when I was a kid, I love to come up and develop my own presentations.\nI knew it that I kind of wanted to be a preacher or speaker or something.\nWhen I would develop slide shows, y'all, some of y'all know y'all remember the old slides\nyou put up and you got the microfiche, someone had microfiche and yet the slides.\nWe progressed from the slides and we went into, as I got older, PowerPoint became very\nrevelant, prevalent. My son, he wasn't just in the ninth grade, he took my PowerPoint\npresentation that I'm preparing for my work and he added some animation and he had helicopters\nflying in, things of that nature. And now my granddaughter, she was over the other day\nand she had my phone and she casted my presentation on the TV. I learned how to cast\nstill. What I'm trying to tell you is we got to let go of some of our old ways, our old\nideas, our old and embrace the newness what God is bringing forth with us on today. Let\nit go and let God do what He is calling each and every one of us to do. Can we stand\nin prayer. Father, we thank you for your word. Father, we thank you for your word is\nfresh. And it reminds us of Father God. Sometimes we are guilty of holding on to our old\nmindsets, our old way of thinking, our old way of doing business. But today, Father,\nYou let us know, Father God, that it's time to move forward and to the newness and to\nthe thing that you're bringing in for us.\nSo Father, we pray now that we'll be able to see and recognize what you're doing for\nus in our life.\nWe'll be able to see what you are doing.\nSo now, sensitize our ears so we'll hear you.\nWe'll hear you, Father God.\nHear the voice coming from you.\nWe know, Father God, that this is how you lead us and guide us to all truths.\nWe pray these things in Jesus' magnificent name, the ever heart say, man, amen, amen.\nWould y'all stand with me as we honor the pledge of allegiance.\nto the flag of the United States of America, and to the republic for which it stands,\none nation under God, individual, with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nChair recognizes Chairman Hogan, Mr. Spaker, the Chair, and I'm not finished yet.\nI got to tell them who you are.\nThat would be hard to do, Mr. Speaker.\nThe Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the Journal of the Previous Legislative\nDay and found it to be correct.\nChairman Hogan, the Chair of the Committee on Information and Audits, reports that the\nThe journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none in the journal, he is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 59th news following the establishes the order of business during the first part of the period unanimous consents, introduction of bills and resolutions.\nreading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports\nof standing committees. Third reading and passage of uncontested local bills and resolutions. First\nreading of reference of Senate bills and resolutions. Morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for\nfor the day. The chair here is not in the resolution is adopted. First reading of bills\nand resolutions, the clerk will read House Bill 962 by Rumsund. Lumps into the 12th\npile of the 32nd rounds of the 25th. Taylor the hundred and seventy-third and Bentley\nthe hundred and thirty-nine. Bill B. Todd on the act to amend code section 55. 51 of the\nGo to Georgia, annotated, relaying the power, authority, and duty.\nGovernmental affairs House Bill 963, by Russell Gillier, to the 162nd Bruce, the 61st.\nHe'll be titled an act to amend title 30, the physical to Georgia,\nannotated, relaying the handicap persons.\nHealth and human services House Bill 964, by Russell Mitchell, the 88th,\nHe'll be Todd and act to men.\nChapter four, Todd on one of the fish go to Georgia and Tady,\nrelating to holidays and observances.\nSpecial rules.\nHouse will 965 by resident base,\nmore than 63rd brews to the 61st.\nGo to the 62nd,\nthat's the 55th and Jackson, the 64th.\nHe'll be Todd and act to men and act\nto incorporate the city of Southville and Fulton County.\nThe Intergovernmental Coordination.\nHouse will 966 by resident Perchetta, the 176th.\nCorp with 174th, Perchetta with 155th.\nI call it a 33rd, really the sixth and others.\nWilmington, an act to amend chapter six,\nit titled 12 of the physical to Georgia,\nannotated relating to forest resources.\nAgriculture and consumer affair.\nHousehold 967, my grandson of Smith,\nthe 133rd Smith, the 134th,\nwhy are you 135th, you believe the 136th?\nI'm bucked under the 137th.\nWilmington, an act to amend and act\nestablishing the municipal court of Columbus, Georgia.\nIntergovernmental Coordination, House Bill 968.\nI'm going to have a situation in the 104th,\nFleming of 121st Burns, 159th.\nWilliamson to the 115th, hatched to the 150th,\nand others.\nBill being taught an act to amend Article 3, Chapter 3,\nTitle 9, fiscal to Georgia, anxiety-relate to limitations\non recovery for deficiencies.\nJudiciary, House Bill 969, I represent a registration\nin the 104th.\nBill being taught an act to amend Article 4, Chapter 3,\ntotal eight if they fish go to Georgia and Tated, relating to fair housing.\nJudiciary. Household 970 by reps. I'm Smith and 133rd. Smirory 135th\nrich of the 97 hatch into the 150th Buckner the 137th and others.\nBill being taught an act to a men article two. Chapter seven, top of 40, 80\nto fish go to Georgia and Tated, relating the imposition rate, computation,\nand exemptions from state income taxes. Ways and Mains. Household 971 by\nand I grab really the 67th reads with 34 checks\nand the 128th, how come are they 81st?\nGoal of the 19th and others.\nTo build me title and act to amend chapter 11\nto title 15 in the fish, go to George Anterty\nrelating to juvenile code.\nJuvenile justice.\nHouse bill 972,\ngovernor of set of housed into the 170 thing\non 116th, 90 to the 130th,\nas far as this is the 44th,\nthe quarter to the 174th.\nBuilding title and act to amend Article 5 of chapter 2,\ntitle 46, the fish, go to George Anterty.\nrelating to miscellaneous offenses and penalties.\nThe energy, utilities, and telecommunications.\nHouse Bill 973.\nRemember, I'm son Paris, the 142nd February, 143rd.\nBetter than 94, Tramble, 130 seconds,\ninspiring 135th and others.\nBill Nintada, an act to amend Code Section 141.\nHe fiscaled a Georgia annotated,\nrelating to public and legal holidays.\nGovernmental affairs House bill 974 of our residents and lumpston to the 12th McCall of the 33rd Watson and 170 second\n155th\nJasper's to the 11th\nMillie Todd and act to amend code section 48 541\nIf you should go to George annotated relaying their property exemption from Madville Lauren taxation ways and means\nHouse will 975 I mentioned McCall 33rd Paul 32nd\nthe building title act to provide a homestead exemption for Madison County ad valorem taxes\nIntergovernmental coordination\nHospital 976 by reps. I'm takers leave the 160th burns on 59th and perish the 158th\nbuilding title act to create the Bullock County Public Facilities Authority\nIntergovernmental coordination\nHospital 977 by reps. I have Jones and 91st Davis to the 82nd\nCarter, the 90 second Kendrick, the 93rd and Mitchell, the 88th.\nAbility, title and act to amend code section 16, 13, 2.\nBishop go to Georgia, annotated relating to conditional discharge.\nJudiciary non-civil.\nHouse bill 978 by representative.\nOne of the 89th, Duke Lee, the 136th,\nCanada, the 58th, Gardner, the 57th, and Hutchinson, the 177th, and others.\nAbility, title and act to amend code section 5.\nChapter 5, the title 30.\nthe fish go to Georgia annotated,\nrelating the disabled adults\nand elder person's protection act.\nHuman relations and aging.\nHouse bill 979 by resident of Martin of the 49th,\nJones the 47th, hatch of the 150th silk cocks\nof the 52nd, Harold the 106th,\na bill being titled an act to amend chapter five\nof the title 48 of the fish go to Georgia annotated,\nrelating to ad ballorum taxation to property.\nWays and means.\nHouse bill 980 by reps of Anola Woods\nto the 42nd Stevens on 64th.\nWell, Linsky, the 79th, hence in the 86th\nand Carpenter in the 4th,\nthe Bill B. Tyler Nack to amend code section\nchapter 66 at Title 36.\nThe fish go to Georgia annotated\nrelating to zoning procedures.\nGovernmental affairs.\nHouse Bill 981 by Russ.\nI've mentioned to the 88th,\nthe Bill B. Tyler Nack to amend title 1620 and 31\nin the fish go to Georgia annotated\nrelating to crimes and offenses.\nGovernmental affairs.\nHouse Bill 982 by Russ.\nof Jones, the 167th and Clark with the 98th.\nIlby Todd on active men.\nArticle seven and chapter 10 and title nine\nand Article two, chapter eight and title 17\nwith the fish go to George Anandated\nrelating to continuances,\nrelative to civil practice.\nRooms.\nHouse well, 983, Barbara Center Williams\nand the 145th Hitchens on on 61st,\nPaul the 32nd and Lomston of the 12th.\nIlby Todd on active men, Article two, chapter one\nand title 42 with the fish go to George Anandated\nrelating the sexual offender registration review board.\nJudiciary non-civil.\nHouse Bill 984, Marissa.\nProcred to the 176, Fleming on 21st, Bodhi, the 62nd.\nThe Saints of the 180th, McLaren of the 51st and others.\nBill B. Todd, on act to amend Article 1 of Chapter 10\nof Title 17.\nThe fish go to Georgia, annotate the rating.\nProcedure for sentencing and imposition of punishment.\nJudiciary non-civil.\nHouse Bill 95, Marissa.\nof Erwin of the 28th.\nBill B. Todd on act to amend the act\nto provide for a new charter for the city of Homer.\nIntergovernmental coordination.\nHouse bill 96 by reps.\nI have Jackson, the 64th,\nBayesmore, the 63rd, Bruce, the 61st and Bodie,\nthe 62nd.\nBill B. Todd on act to amend chapter 62,\na title 30, 60 for Scota George annotated\nrelating to the development of authorities.\nGovernmental affairs.\nHouse resolution 1215 by reps.\nMcGillier to the 160 second, Hitchens on 61st.\nOliver the 82nd, Gordon the 163rd,\nSteven's on 164th and others.\nA resolution recognizing Judge Willie J. Lova Jr.\nand dedicating a building in his memory.\nState properties house a resolution 1216,\nby Rosa McGillier to the 162nd, Hitchens on 61st.\nGordon on 163rd, Steven's on 64th\nand Petrie of the 166th.\nRecognizing Miss Betty and DePetro Repay\nand rededicating a road on Georgia\nPort's authority property in her honor.\nTransportation.\nHouse Resolution 1217.\nI represent Gillier to the 162nd, Gordon 163rd.\nI resolution honoring Mr. Marvin Leon Curtis Jr.\nand dedicating a building in his memory.\nState properties.\nHouse Resolution 1218.\nMy resident housed him in the 170th.\nresolution honoring the life of Mr. James Edward Giddens and dedicating a rodent\nhis memory. Transportation. That completes First Readers.\nSenate Bill 134 by Senator Capatric of the 32nd Jackson, the 2nd Kirk of the 13th,\nHonourment of the 45th and Huff Stetler of the 52nd and others, Bill Binton on that to\namend Article 8 of Chapter 12, the Title 50 to fiscal to Georgia and Antietta, relating\nthe Georgia Commission on the Holocaust.\nGovernmental Affairs Senate Bill 268\nby Senator Jackson, the second harvest of the 15th.\nThey'll be titled an act to amend chapter 17\nto title 45 to fiscal to Georgia and attend\nwho are related to the Notaries public.\nDefense and veterans of affairs.\nSenate Bill 335 by Senator Brass of the 28th,\nno to the 49th Walker, the 20th Mollis of the 53rd,\nStone of the 23rd and others.\nThey'll be titled an act to amend Article 1 of chapter 3\nTitle 12 and Chapter 11, the title 15 in Chapter 5,\nthe title 49, the physical to Georgia,\nand Tadya relaying the general provisions\nregarding parks, historic areas, and memorials.\nJuvenile Justice Senate Bill 345 by Senator Capatric\nof the 32nd, tippens of the 37th,\nred of the 33rd, and Jordan of the 6th.\nHe'll be taught an act to amend Chapter 2,\na title 26, the physical to Georgia,\nand Tadya relaying standards, labeling\nan adulteration of food.\nHalt in human services.\nSenate Bill 356 by Senator Ligon of the third.\nAbility in Title IX to amend part one of Article II,\nchapter eight of Title XII.\nThe fiscal to Georgia annotated relating\nto general provisions regarding solid waste management.\nNatural resources and environment.\nThat completes first readers.\nSecond reading of bills and resolutions, a clerk will read.\nHouse Bill 946, by rep.\nnight of the 130th hatchet of the 150th England of the 116th Stevens of the\n164th Jasper's with the 11th and others. A bill relating to regulation and\nlicensure of pharmacy benefits managers House Bill 947. I represent night of\nthe 130th hatchet of the 150th England of the 168th Newton of the\n123rd Hawkins of the 27th and others. A bill relating to Medicaid House\nBill 948 by represent still Cox of the 52nd Cooper of the 43rd. Hence, in\nthe 86. A bill relating to the Georgia Commission on the Holocaust House\nbill 949 by Representative Knight of the 130th Harrel, the 106th Carson of the 46th Williams of the 115th Blackburn of the 146th,\na bill relating to revenue and taxation.\nHouse bill 950 by Representative Kenner of the 102nd Kendrick of the 93rd Bennett of the 94th Wilson of the 80th\nWar Kaiser, the 157th and others, a bill relating to review of individual criminal history, record information.\nHouse bill 951 by Representative Kenner of the 102nd Dryer of the 59th Kendrick of the 93rd,\nMcLaren of the 51st and Bennett of the 94th, the bill relating to procedure and\nsentencing and imposition of punishment and probation.\nHouse Bill 952 by Rep. Cooper of the 43rd, Silcox of the 52nd hatchet of the\n150th night of the 130th, Wilson of the 80th, the bill relating to pharmacies.\nHouse Bill 953, by Rep. Richard of the 97th, Williamson of the 115th,\nwelcher of the 110th, Watson of the 170th, Jones of the 25th, the bill relating\nto the general authority, duties and procedure of state purchasing.\nHouse Bill 954 by Representative Richard the 97th England with the 116th Campbell with the 111st Mathiac of the 73rd Bonner of the 72nd and others a bill relating to theft House Bill 955 by Representative Abstration of the 104th Cooper the 43rd and Oliver of the 82nd a bill relating to crimes against the person House Bill 956 by Representative Belton of the 112th Newton of the 123rd mix of the 69th Williams of the 168th Prince of the 127th a bill relating to speech language pathologist and audiologist House Bill 957 by Representative Belton\nthe Jones of the 47th Jaspers of the 11th Chalkers of the 138,\nnext of the 69th, Setslow of the 35th,\nthe bill relating to education.\nHouse bill 958 by reps of Setslow of the 35th,\nRichard of the 97th,\nwith hour of the 119th,\nGaines of the 117th,\nthe bill relating to children and youth services,\nHouse bill 959 by reps of the meeks of the 178th,\nSmith of the 133rd,\nWashburn of the 141st Smith,\nthe 70th,\nParkhizer of the 157th and others,\nthe bill relating to waste management,\nHouse for Reimbursement and Surcharges, House Bill 960,\nby Representative Hutchinson of the 107th,\nMarendra of the 96th, Wilson of the 80th Park of the 101st,\none of the 89th and others of Bill relating\nto offenses involving illegal aliens.\nHouse Bill 961, by Representative Park of the 101st,\nMcClarin of the 51st,\nall under the 54th,\nRobert Sherwood of the 48th,\nmore of the 95th and others of Bill relating to health.\nHouse Resolution 1166, by Representative Prince\nof the 127th, Frazier of the 126th, Nelson of the 125th,\nNewton of the 123rd, Howard of the 124th.\nResolution supporting the creation of a state veteran\ncemetery in Augusta, Richmond County, House Resolution 1167\nby Representative Green of 151st,\nDunnerhood of the 30th,\nParkle of the 150th,\nParkhizer of the 157th and Lumston of the 12th,\nResolution authorizing the conveyance\nof certain state-owned real property,\nHouse Resolution 1168,\nby resident park of the 101st Williams\nand Williams of the 37th Couch of the 50th,\nmore of the 95th Hutchinson of the 107th and others,\nResolution creating the House Study Committee\non adverse childhood experiences\nto improve the health of women and children,\nHouse Resolution 1169 by Brooks and Hutchinson of 107.\nMerit of the 96 Wilson of the 80th.\nPark of the 101st win of the 89th and others.\nResolution encouraging the replacement of the term\nillegal alien with the term undocumented person\nin the official code of Georgia annotated.\nThree second readers.\nreport of standing committees, the clerk will read.\nRepresentative Sharon Cooper, the 43rd District Chairman of the Committee on Health and Human Services submitted the following report.\nI'll speak to your committee on health and human services\nat a consideration of following bills of the house.\nAnd then it's a destructive media report\nto same back the house to filing recommendations.\nHouse Bill 521 do pass by committee substitute,\nrespectfully submitted,\nRepresentative Sharon Cooper, the 43rd District, chairman.\nRepresentative Jan Tancersley, the 160th District Chairman\nof the committee and intergovernmental coordination locals\nhave been at the following report.\nAnd I'll speak to your committee\non intergovernmental coordination locals\nat a consideration of the following bills of the house.\nis instructed me to report the same back to the House following recommendations.\nHouse Bill 826, do pass, House Bill 921, do pass, House Bill 923, do pass, House Bill 924, do pass, House Bill 935, do pass.\nHouse Bill 944, do pass, House Bill 945, do pass, House Bill 933, do pass.\nRespectfully submitted, Representative Tankersley, the 160th district.\nChairman.\nRepresentative Station, the 104th district chairman of committee on judiciary non-civil submitted the following report.\nMr. Speaker, committee on judiciary non-civil side of the consideration of following bills of the house is instructed me to report the same back to the house to following recommendations\nHouse bill 799 do pass respectfully submitted representative of station 104th district chairman\nRepresentative corporate of the 174th district chairman committee on motor vehicles submitted to following report\nMr. Speaker, committee on motor vehicles is out of the consideration of following bills of the house\nThis is struck to me to report the same back to the House of the following recommendations House bill 819 new pass House bill 861 new pass\nRespectfully submitted representative Corbett of the 174th district chairman\nRepresentative John Carson the 46th district chairman on committee on transportation submitted to the following report\nMr. Speaker your committee on transportation has had on the consideration following bill of the House\nThis is struck to me to report the same back to the House of the following recommendations\nHouse bill 808 do pass by committee substitute\nrespectfully submitted, Representative John Carson, the 46th district chairman.\nRepresentative Brett Harrell, 160th district chairman on committee on ways of means submitted to following report.\nLet's just speak to your committee on ways of means that's had a consideration.\nFollowing bills, the House and the Senate is instructing me to report the same back to the House following recommendations.\nHouse Bill 378, do pass by committee substitute, House Bill 448, do pass by committee substitute, House Bill 715, do pass.\nHouse bill 779 do pass by committee substitute House bill 807 do pass by committee substitute House bill 846 do pass by committee substitute\nHouse bill 949 do pass House bill Senate bill 144 do pass respectfully submit it represent a Brett Harrell the 106 district chairman\nThat completes the reading the reports of standing committees\nWe have a local calendar today.\nAnd now we're going on to the local calendar.\nThird reading and passage of uncontested local bills.\nOne bill on the local calendar relates to homestead exemption\nand requires a recorded two-thirds roll call vote for passage.\nThird reading and passage of uncontested local bills.\nIf there is no objection, we will vote on the local calendar\nas a whole with a recorded vote.\nHearing none, it is so ordered.\nThe clerk will read the local calendar.\nHouse Bill A26 by Representative Watson,\nthe 172nd City of Miggs.\nHouse Bill 921 by Representative Bruce\nthe 61st City of South Fulton.\nHouse Bill 923 by Representative Corbett of the 174th,\nclinch county.\nHouse Bill 924 by Representative Rogers\nthe 10th, Habersham County.\nHouse Bill 935 by Representative\nRestoration of 104th, Gwyneth County, House of 944 by resident of dukes of 154th, Miller County, House of 945 by resident of dukes of 154th, Miller County, House of 933 by resident of next to the 69th, Troop County.\nAre there any objection to the previous question being ordered on the local calendar?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bills?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar will vote aye.\nSuppose we vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the passage of the bills on the local calendar.\nThe eyes are 149, the nasors zero.\nThese bills having received the requisite constitutional majority are therefore passed.\nWe are going on now to morning orders, morning orders.\nMembers will have one minute each on morning orders and the chair recognizes for a morning\nOrder Representative Matthew Wilson.\nThank you, Mr. Speaker.\nLast year we lost some very special people in Georgia.\nWe lost sons and daughters, brothers and sisters.\nWe lost parents and loved ones.\nLast year we lost almost 1,500 Georgians to suicide.\nIt's the 10th leading cause of death in Georgia.\nAnd if you look at the one page that I provided on your desk this morning, you'll see it's\nactually the second leading cause of death in Georgia for our young adults.\nBut we have great people in this state who are working to turn that around and change\nthat.\nOne of those groups is the American Foundation for Suicide Prevention who is here with\nus today.\nSome of them are in the gallery and I'd ask them to stand and be recognized.\nWe thank them each year they do the hard work to raise money to change this and turn around\nthese death rates, last year they raised nearly half a million dollars and were the largest\nchapter in America.\nWe thank them for their great work and the work that they are just to do.\nThank you.\nChair recognizes representative Dickerson for a morning order.\nThank you, Mr. Speaker.\nToday is February 21st and we would like to wish Representative John Lewis a happy\nbirthday today. And pray for his recovery. Thank you.\nChair recognizes representative Stovall for a morning order.\nThank you, Mr. Speaker. Today is Georgia election officials\nand registrar's day here at the State Capitol.\nAnd the registrar's responsibility\nis to register individuals to vote,\nto keep record of these individuals\nand to issue absentee ballots.\nThey, we are recognizing them for the vital importance\nthat the elections play with their role\nin the foundation of any democratic system of governance\nand also with our new voting machines,\nthe challenges that they will have.\nWould you please join me in welcoming\nand acknowledging our elections, officials, and registrars\nwho are here in the gallery on the right-hand side here.\nWell, you all please stand.\nThank you, Mr. Speaker.\nChair recognizes Representative Scott\nfor a morning order.\nThank you, Mr. Speaker.\nA moment in black history, black women in the movement,\nIn April, 1960, Civil Rights Aleda, Ella Baker urged student\nactivists at Shell University in North Carolina\nto form an organization based in participatory democracy\nand grassroots advocacy.\nThe students created the National Violet Coordinated\nCommittee in 1961.\nSNCC Freedom Riders, Challenge Segregated Interstate Bus\nTravel, Ella Baker's Activism and Mentorship\ntransformed their landscape of the Civil Rights\nstruggling and exemplify black women's key role in the movement.\nFor years before Rosa Park famous arrests launched the Montgomery bus boycott,\nblack women board the daily humiliation of segregation, sexual harassment,\nand violence from the bus driver, say police.\nThough leaders like Dr. Martin Luther King,\nJr. became the face of the protest scholars, recognized that the boys got\nboth counts, success relied upon the black women who initiated and\nmaintain it.\nBlack women like Constance Baker-Martler, Diane Nash,\nAmelia Boyton, Robert Samarion Wright,\nElderman, Elaine Jones, David Bates,\nthe team of Clark, Fannie Lou Hamer,\nand Charlotte Chisholm,\nwith indispensable active civil rights lawyers\nand political leaders whose efforts advance\nthe fight for injustice and equality.\nBefore her death in 1986, Ella Baker distributed her strength\nto her grandmother who suffered brutal violence\na resistant insolatement, like Harriet time\nof sojourner truth and out of the wells\nand so many other ancestors, the black women\nof the civil rights were criticized and shaping\nthe resistance to racism and sexism in America.\nToday's moment in black history.\nThank you, Mr. Speaker.\nChair recognizes representative Cannon\nfor a morning order.\nGood morning, colleagues. For this moment in black history, we're discussing the Alvin\nAiley American Dance Theater. For over seven decades, they have been visiting Atlanta\nand Georgia, helping to promote the uniqueness of the African American cultural experience,\nAnd they have been bringing modern dance heritage to more than 25 million people.\nWe ask that you understand the importance of the work they're doing and teaching our\nchildren empathy through dance and cultural expression.\nIf you are in Atlanta, please also go and check them out this moment in black history today.\nThank you.\nChair recognizes representative Hutchinson for a morning order.\nGood morning colleagues.\nThank you, Mr. Speaker.\nToday I'd like to introduce you to 13-year-old Larry.\nLarry wants to visit Disney World and learn to play basketball and football sometime in the near future.\nLarry is a fun, neat, loving, caring, and helpful child.\nHe loves watching video games, playing football, and making everyone laugh.\nLarry is one of the hundreds of children that are available for adoption today in Georgia.\nThank you, Mr. Speaker.\nChair recognizes representative Clark\nand representative Moore for a morning order.\nThank you, Mr. Speaker.\nIt's very evident there's a lot of age\na lot of wisdom in this chamber, but we're here to create something new. It's called\nthe Georgia Future Caucus and it's a bipartisan effort to look at issues that affect a younger\ngeneration and how we can benefit future Georgians.\nSo my colleague and I, Colton and I, will serve as co-chairs of this caucus and we invite\nany one to join the caucus, but we are specifically looking for legislators under the age of 45\nand we'll be focusing on issues affecting Georgians in that age group. This is a bipartisan\ncaucus and we are pleased to be joining more than 900 state legislators in 29 states as a part\nof the National State Future Caucus Network.\nThere's more information on the flyers on your desk.\nAgain, anyone is invited to join,\nbut we are specifically looking for our younger legislators,\nand that is the group that we will be focusing on issues for.\nThank you, Mr. Speaker.\nThank you, colleagues.\nChairman Hogan wants to be your speaker at your first meeting.\nHe's concerned about the exclusionary policy of preventing him from mejoining.\nWe have, we're going on now to invite resolutions, and the House will be at order.\nClark will read the caption to House Resolution 937.\nHouse Resolution 937 by resident of Howard of the 124th, a resolution recognizing and\nand commending Terry D. Elon upon the grand occasion of his retirement and for other purposes.\nChair recognizes representative Wayne Howard for an invite resolution.\nThank you, Mr. Speaker.\nI am joined by a deal of friend and a Georgian that has put in 40 years in the technical\nschool system here and at Augusta Tech and Augusta Georgia. But I think we\ncalled it Augusta Technical College now. And I would like you all to first\nwelcome him and his family here to the to the Capitol.\n40 years of service to this state.\nWe have Missouterra Elam, his wife Patricia, his son and daughter-in-law, I'm sorry,\ndaughter. I'll marry the son and the daughter there. That's not the way it goes. But we are\nso happy to have them. And this family means a lot to the Augusta and to the area and\nto the state. And I wanted to invite him and his family here to just have a quick word\nof his, you know, I'll leave it up to Terry. Terry is known for being the one that if\nyou ever sit in the board meeting with him or any kind of meeting, he'll sit back and\njust wait. Everybody expresses their opinion and Terry will come in at the last minute\nand make a statement, and his statement will literally change the minds of everybody from\none place to another, and colleagues, I want you to welcome Mr. Terry Elam.\nThank you, and formally this is my wife of 50 years, Patricia, my daughter, Joy, and\nmy son, Brandon, to the speaker. Thank you. I'm running the state from a\nlegislative standpoint. You get 40 days to set the agenda for a year. And then\nit's people like me who work for the state. I work 47 years. 23 is a college\npresident and I can tell you three things kept me in the right mind. First of all\nit's integrity. Second is looking for truth and last always looking for\nknowledge because you didn't wake up every day as smart as you go to sleep that\nthat afternoon. Hopefully you learned something every day and as a lifelong learner my time\nrepresent thousands of students, thousands of employees, and working for economic development\nin the CSRA. We even helped South Carolina a little bit every now and then. So I can tell you\nIt was tough getting up at 4.30 this morning driving up here when 8 o'clock is now my\nrise time.\nSo I'll end with just a statement, my wife gave me for my birthday two weeks ago, I turned\none of those magic numbers of zero at the end.\nShe said you're not, it says you're not retired.\njust under new management. Thank you.\nYou\nYou\nWe are going on now to the rules calendar.\nClerk will read the caption to House Bill 780.\nHouse Bill 780 by Representative Perkwood, 155th Green and 151st and others to be entitled\nand lack to amend Code Section 50, 1634,\nthe fiscal to Georgia and tentative relating the powers\nand duties of the State Properties Commission.\nMr. Levin referred to the committee\non State Properties,\nthat committee recommends this bill do pass.\nChair recognizes Representative Perkel\nto present the bill.\nThank you, Mr. Speaker, colleagues.\nHB780, I have for your consideration.\nWe often want to just pass bills that provide more efficiency in our government and able\nto save money.\nThis is one of the bills.\nIt's very small, seven word change, and let me just give you some background.\nPresently, if you have a new technical school in your district, we have to grant, if Georgia\npowers providing the power to it, we have to grant them an easement in order to lay\nthe overhead line or dig a trench to provide power to us.\nThe way our Georgia code presently exists,\nif we grant an easement to a private entity,\nwe must get an appraisal on the value of that.\nWhen we annually, we have the easement,\nannual easement conveyance bills from state properties,\nand there are between 10 and 20 per year.\nAll of the valuations come back in that $10 range,\nthe value of the easement.\nAnd we are spending $3,000 to get a $10 evaluation.\nThis bill will allow us to bypass that\nand allow the state properties to value that.\nAnd that's what the bill does, Mr. Speaker.\nIf there's any questions, I'll do my best.\nYou have no questions?\nThank you, sir.\nIs there any objection to the previous question being ordered?\nThe chair here is none the previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none the report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of House Bill 780, will vote\nThose opposed will vote no and the clerk will unlock the machines have all members voted\nhave all members voted. If so, the clerk will lock the machine on the passage of House Bill\n780. The eyes are 149. The nays are zero. This bill having received the requisite constitutional majority\nis therefore passed. Clerk will read the caption to House Bill 487.\nHouse Bill 487, my friends, in a bonnet of the 72nd and others to be entitled back to\nMonarchal 6th, Chapter 3, Title 38, the official go to Georgia Antony, relating the disaster\nvolunteer relief act.\nLet's bill that referred to the Committee on Public Safety and Homeland Security.\nThat committee recommends that this bill do pass by Committee Substitute.\nChair recognizes Representative Bonner to present the bill.\nThank you Mr. Speaker, colleagues, I rise this morning to present House Bill 487.\nThis amends the disaster voluntary relief act for Georgia.\nIt extends the same courtesy that we currently provide to state employees that are members\nof the Red Cross, to state employees that are members of the Civil Air Patrol.\nThis would provide a state employee that is also a member of the Civil Air Patrol up to\n15 days paid leave in a 12-month period in order to respond to a disaster here in Georgia.\nThis can only be done upon the name, a name disaster by the governor and at the request\nof the Civil Air Patrol and an agreement with that employee's department.\nThe other thing this bill does is to rename that act to the Robert Argo disaster volunteer\nrelief act as a way to honor one of our former colleagues who was very active in the Civil\nAir Patrol during World War II.\nCivil Air Patrol provides important functions here in the state of Georgia.\nThe Georgia Wing of the Civil Air Patrol is actually one of the largest in the country.\nThey respond during Hurricane Michael with over 152 flight hours.\nThey perform missions such as search and rescue, aerial reconnaissance, and aerial photography.\nThey are volunteers and so they are providing a vital service to the state of Georgia.\nSo with that, Mr. Speaker, I'll stand for any questions.\nYou do have a question if you care to yield.\nI'll yield.\nChair recognizes representative Rodgers to your right for a question.\nThank you, Mr. Speaker.\nMr. Chairman, would the gentleman yield?\nI will.\nIs it not true that this bill has passed a couple of different times in the house and just gotten called up and crossed the way?\nThat's correct, the bill previously came out of the house but did not make it through\nthe Senate.\nAnd is it not also true that the bill after being named for former representative Argo\nwho was a gold congressional metal winner for his service to the civil air patrol in World\nWar II?\nThat is correct.\nGreat.\nThank you, sir.\nIt's a great bill.\nThank you.\nNo further questions.\nThank you.\nI yield the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill will vote aye?\nThose opposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nso the clerk will lock the machine on the passage of House Bill 487.\nThe eyes are 157. The nasors zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nChair recognizes representative Mets to introduce the doctor of the day.\nGood morning, good morning, good morning.\nI am so happy to be able to introduce my friend, my constituents, and my health advisor,\nDr. Lajun Oliver.\nThis is my third time introducing Dr. Oliver, and I would just introduce her by saying\nMy friend, my constituents, and my neighbor\nin Southwest Atlanta.\nThank you.\nThank you.\nGood morning.\nHow are you doing?\nThank you so much.\nThank you, Representative Metz, for such a kind introduction.\nMr. Speaker to our representatives\nand all of our distinguished guests,\nit is certainly my honor and privilege\nto be with you today.\nAgain, I am Dr. LaJune Oliver as a native Georgian,\none who's done all of my medical training here\nin this great state of Georgia\nat the Medical College of Georgia\nand residency at Emory University School of Medicine.\nAnd now working for the Southeast Permanente Medical Group,\nthe largest physician-owned and physician-led group,\nmedical group in Georgia, serving over 300,000 Georgians.\nIt is certainly my privilege and honor to serve\nas your doctor of the day today.\nAs you continue along in your busy legislative session,\nmake sure you take some time for yourself, eat healthy,\nget plenty of rest, and keep thriving.\nHave an awesome Friday.\nThank you.\nThank you very, very much.\nOkay, if you listen up now, if you have pages here today, we're going to start lining\nthem up. If you are not here when your page group is ready to have their photograph, they\nwill have it without you. So we'll start lining up now for page photographs. If you have\nan announcement be prepared to come down front, soon for what?\nWhat purpose does Chairman Cooper rise?\nThank you, Mr. Speaker.\nI rise to make a motion.\nState your motion.\nI would rise to ask that House Bill 918 be moved from insurance to the special committee on access to quality health care.\nBoth chairman are in agreement.\nThe lady has moved that House Bill 918 be withdrawn from the insurance committee and\ncommitted to the special committee on access to quality health care, clerk will read the\ncaption.\nHouse Bill 918, members of Cooper, the 43rd and others to be entitled to amend Article\n6th chapter 4, title 26, the official go to Joe Janitetti relating to pharmacies.\nOn the ladies' motion, is their objection? Is their objection? The chair here is none\nand it is so ordered. Clerk will read the caption to a group of privileged resolutions.\nDuring the life and memory of Ronald Ronnie Riggs-Smith.\nRecognizing February 25th, 2020 is after school day at the State Capital,\nrecognizing commanding Atlanta Girl School for 20 years of exceptional education\nand outstanding academic achievements,\nrecognizing commanding Evanton Blair.\nRecognizing March 20th, 2020 is STEM Advocacy Day at the State Capital\nand commanding the WireCats Robotics Team.\nAnd for other purposes, I complete the reading with privilege resolutions.\nIs there any objection to adopting the privilege resolutions that Chair here is known in the\nresolutions are adopted. We're going on now to announcements.\nChair recognizes the chairman of the House Rules Committee for an announcement.\nWe will not have a rules committee meeting this afternoon, but we will have one Monday morning at 9 o'clock.\n9 o'clock Monday.\nRules committee meeting Monday at 9 a.m. Chair recognizes Chairman Darlene Taylor for an announcement.\nThank you, Mr. Speaker. The House Appropriations Transportation Subcommittee.\nRight and early, 8 o'clock Monday morning, we'll be meeting in the cap 132.\nAppropriations Transportation Subcommittee, 8 a.m., thank you.\nThat completes our announcements.\nOne final reminder to be up here if you have pages.\nOne opportunity to have your photograph made with them and then we're not going to go\nlooking for you.\nrecognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this House stand adjourned until 10 a.m.\nMonday, February the 24th, 2020.\nThe majority leader has moved that this house be adjourned\nuntil 10 a.m. Monday, February the 24th, 2020, all those in favor of the motion will say aye,\nthose opposed will say no. The eyes clearly have it in this house will be adjourned until Monday\nmorning, February 24 at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T14:57:28.90503+00:00"
}