{
  "video_id": "7a32TKVHP5g",
  "url": "https://www.youtube.com/watch?v=7a32TKVHP5g",
  "title": "Legislative Day 36 - 2023 Session - 03/20/23",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2023,
  "day_number": 36,
  "video_date": null,
  "duration_minutes": 143,
  "summary": "Overview: The Georgia legislative session on March 20, 2023 featured the introduction of several new bills and resolutions, as well as the recommittal of SR334 to the Rules Committee. Notable legislation included bills related to city charters, tax exemptions, and school systems.\n\nKey Actions:\n**HR 334**: Resolution changing the rules of the Senate, recommitted to the Rules Committee\n**HB 373, HB493, HB545, SB 140**: Bills not explicitly mentioned in the transcript\n\nBills Introduced (First Reading):\n- SB 309: Homestead exemption for City of Hampton ad valorem taxes\n- SB 310: New charter for City of Powder Springs\n- SR 347: Honoring life of Mr. Sean P. Kornakian\n- SR 352: Committing Atlanta Public Schools on 150th anniversary\n- HB 597, HB 666, HB 695, HB 702, HB 703, HB 708, HB 709: Various city charter and school system bills\n\nNotable Moments:\n- Senator from the 28th moved to recommit SR334 to the Rules Committee\n- President recognized senators and pages for their service\n\nVotes:\n- SR334 recommitted to Rules Committee (objection raised, motion passed)\n\nAttendance:\n- Quorum present, no issues noted\n\nAdjournment:\n- Transcript does not indicate when the session adjourned or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you Katie Huggins, Teran Alev, Caleb Matin, and our very own senator from the 42nd son, Brooks Brisening, and Drew Peter Jackson. So, pages, thank you all for your service today. Look forward to working with you. Y'all get them a big... Mr. President? Little side note for you on this day in 1907. Governor Ellis Arnold was born in none other than Nannon, Georgia. And many of y'all may remember Ellis Arnold as the one of the three governors we had at one time, calling the phrase, usurper and pretender. But he was elected to the legislature at age 25 in attorney general at age 31 and then became the 69th governor of the state of Georgia. Mr. President, I do want to wish you a happy extra terrestrial abductions day. A happy international day of happiness. It's international Earth Day. It's national ravioli day, world frog day, and world storytelling day. Mr. President, the journal has been read and found to be correct. Thank you senator. Always, always interesting what you go come up with for the journal of the day. Yes, so is there objection dispensing of the reading of the journal? Chair here's none of the reading of journals dispensed with. Is there objection to the confirmation of the journal? Chair here's none of the journal is confirmed. All senators who have bills and resolutions to introduce please bring them to the secretary's desk at this time. Senator from the 28th. What purpose do you rise? Mr. President, I move the SR334 be recommitted to the committee on a roll on rules. Secretary read the caption. Mr. President, pursuant to Senate rule 10-1.3 Senate resolution 34, a resolution changing the rules of the Senate is made in order for consideration by the Senate. That completes the order, Mr. President. Senator has moved that SR334 be recommitted to the committee on rules. His objection, objection, the resolution is moved. First reading, references of Senate bills and resolutions. Senate bill 309 by Senator Jones of the 10th and others of the bill between tall and act to provide a homestead exemption from city of Hampton ad valorem taxes from municipal purposes and amount equal to the amount of. State and local government. Senate bill 310 by Senator Rhett over the 33rd and others of the bill between tall and act trading and new charter for the city of powder springs as amended so as to adopt by reference a certain map to update the boundaries of the city to provide related matters. Senate resolution 347 by Senator Moore of the 53rd, a resolution honoring the life of Mr. Sean P. Kornakian, dedicating an intersection in his memory and for other purposes. Transportation. Senator resolution 352 by Senator Halperin of the 39th and others, a resolution committing Atlanta public schools upon its 150th. That completes the order, Ms. President. First reading, references of House bills and resolutions. House bill 597 by Representative Bentley of the 150th and others of the bill between tall and act to provide a new charter for the city. House bill 666 by representative Jenkins of the 100th for 36th, a bill between tall and act to provide a new charter for the town of Lono State and local government. House bill 695 by Representative Camp of the 135th, a bill between tall and act to provide a new charter for the city of Tomiston to provide for related matters. House bill 702 by Representative Westbrook of the 163rd and others of the bill between tall and act to governing the school system of the city of Savannah and Chatham County approved March 21st. House bill 3703 by Representative Westbrook of the 163rd and others of the bill between tall and act to minting the several extra-related to the incorporating. House bill 708 by Representative Chess Stain of the 7th, a bill between tall and act to authorize the governing authority of the city of House bill 709 by Representative Washburn of the 150th, 44th and others of the bill between tall and act to provide a new charter. That completes your Mr. President. Secretary Reed report of standing committees. Mr. President the Senate Committee on Children and Families has had under consideration the following legislation has instructed me to report the same back to the Senate with the following recommendation House bill 291 due pass by substitute. respectively submitted to the clerk Patrick of the 32nd district chairman. Senate Committee on Economic Development and Tourism has had under consideration the following legislation has instructed me to report the same back to the Senate with the following recommendation House bill 128 due pass. respectively submitted to Senator Beach of the 21st district chairman. The Senate Committee on Economic Development and Tourism has had under consideration the following legislation has instructed me to report the same back to the Senate with the following recommendation House bill 237 due pass by substitute House bill 353 due pass by substitute House bill 514 due pass by substitute respectively submitted to the Senator Beach of the 21st district chairman. Senate Committee on Higher Education has had under consideration the following legislation has instructed me to report the same back to the Senate with the following recommendation House bill 607 due pass House bill 228 due pass by substitute respectively submitted Senator Hickman of the 44th district chairman The Senate committee on Judiciary has not under consideration the following legislation has instructed me to report the same back to the Senate with the following recommendation House bill 126 due pass by substitute House bill 204 due pass by substitute House bill 2202 due pass House bill 227 due pass by substitute House bill 243 due pass by substitute House bill 298 due pass House bill 302 due pass House bill 543 due pass the House Bill 498 due pass, House Bill 406 due pass by the committee's substitute, respectively submitted to Senator Calciter of the 46th District Chairman. The Senate Committee on wrote his own continuation and the ParliamentUN registration has been shaken to refer to the senate by the Department of Audit and the following recommendation, House Bill 511 hatched, House lease 161 due passes, House bill 6196 due pass, House sechs, House Bill 680 due pass, House Bill 681 due pass, House bill 682 due pass, House Bill 683 due passed, House Bill 686 due pass, House Bill 688 due pass, House Bill 689 due pass, House Bill 690 due pass, House Bill 6191 due pass, respectively submitted a LEE enrollment submitted the senate again. of the 47th district chairman, that completes the Order Miss President. Secretary Reid, bills and resolutions for the second time. House Bill 43 by Representative Lim of the 98th and others, Council on American Indian Concerns Revised Membership, House Bill 82 by Representative Jackson of the 128th and others, income tax limit eligibility for rural physician tax credit to physicians who qualify on or before December 31, 2023. House Bill 119 by Representative Corbett of the 174th and others, uniform rules of the road, procedure for passing stationary vehicles, provide House Bill 126 by Representative Smith of the 18th and others, appeal and error judgments deemed directly appealable change of provision. House Bill 128 by Representative Haung of the 103rd and others, revenue ad and taxation, representative minority business enterprises, women and veteran owned businesses, and procurement of state contracts provide. House Bill 130 by Representative Gamble of the 15th and others, Georgia Student Finance Authority Student Loan Repayment for Peace Officers Provide. House Bill 163 by Representative McDonald of the 26th and others, Georgia Board of Healthcare Workforce Student Loan Repayment for Medical Examiner's Employee by the Division of Forensic Sciences of the Georgia Bureau of Investigation Provide. House Bill 167 by Representative Momtehan of the 17th and others, motor vehicles and traffic, standards for issuance of limited driver permits for certain offenders provide. House Bill 185 by Representative Gaines of 120th and others, education provide for hope, inclusive post-secondary education grants. House Bill 204 by Representative Yeartav, the 150th and others, Georgia Minnities of the Civil Courts, Clerks, Council, and Create. House Bill 220 by Representative Leberet of the 123rd and others, property, means of enforcement of condominium and property owners, association instruments, rules and regulations provide. House Bill 2201 by Representative Lumsden of the 12th and others, insurance filing review process for private passenger motor vehicle liability coverage, providing the minimum limits offered by the carrier review revised. House Bill 222 by Representative Lumsden of the 12th and others, insurance department of Clarify Streamline and make transparent the practices of the department. House Bill 227 by Representative Leberet of the 123rd and others, crimes and offenses offense of criminal interference with critical infrastructure provide. House Bill 228 by Representative Dempsey of the 13th and others, education tuition equalization grants at private colleges and universities to expand definition of approved school. House Bill 230 by Representative Newton of the 127th and others, revenue and taxation, qualified consolidated government special purpose local option sales tax provide. House Bill 237 by Representative Hagen of the 156th and others state government, southeast Georgia soapbox Derby as official soapbox Derby of the state of Georgia's Eximate. House Bill 243 by Representative Smith of the 70th and others, Cawita judicial circuit, superior court provide aiff judge. House Bill 244 by Representative Petrie of the 166th and others, board of natural resources effective date of certain rules and regulations extend. House Bill 254 by Representative Jenkins of the 136th and others, civil practices alternate procedure for designation of official legal organ provide. House Bill 264 by Representative Smith of the 138th and others, revenue and taxation, handling of appeals of property tax assessments, revised certain deadlines and procedures. House Bill 273 by Representative DeLouch of the 167th and others, board of natural resources extend date by which rules and regulations must be in effect for purposes of establishing criminal violations. House Bill 279 by Representative Gamble of the 15th and others, insurance discount for property owners to build a new property that better resist tornado, hurricane or other catastrophic windstorm events provide. House Bill 291 by Representative Skoggins of the 14th and others, guardian and ward, add to the list of providers who are authorized to participate in the processes for appointment of a guardian for an adult. House Bill 294 by Representative DeLouch of the 164th and others, insurance administration of certain rehabilitation policies by a seating insurer placed into liquidation provisions. House Bill 298 by Representative Daniel of the 177th and others, courts and exemption of deferment from jury service for natural and adoptive mothers of children six months of age or older provide. House Bill 302 by Representative Franklin of the 160th and others, crimes and offenses, issuance of a temporary or permanent protective order by the court provide. House Bill 308 by Representative Newton of the 127th and others, revenue and taxation, certain medical perceptor rotations revised tax credit. House Bill 353 by Representative Powell of the 33rd and others, Georgia Lottery for Education Act, administrative procedures regarding coin-operated amusement machines, shall be subject chapter 13 of Title 50 provide. House Bill 383 by Representative Reeves of the 99th and others, safer hospitals act and act. House Bill 396 by Representative Vance of the 133rd and others, Econi, River Greenway authority, add president of Georgia College and State University House Bill 406 by Representative Jasper of the 11th and others, Georgia Public Service Commission, regulation of the provision of certain electricity used as a motor vehicle and electric vehicles provide. House Bill 408 by Rubin and Williamson of the 112th and others, sales and use tax exemption for competitive projects of regional significance change sunset provision. House Bill 412 by Representative Williamson of the 112th and others income tax repeal limitation on types of partnerships that may elect to to pay income tax at the entity level. House Bill 416 by Rubin and his cell cocks of the 53rd and others, pharmacies authorize qualified pharmacy technicians to administer certain vaccines. House Bill 431 by Representative Drener of the 85th and others, special purpose local option sales tax counties provisions. House Bill 436 by Representative Corbett of 174th and others, surface mining, revised maximum criminal penalties for violations. House Bill 437 by Representative Hitchens of the 160th person, others, Georgia State and Demification Commission, abolish an authorized commissioner of administrative services to assume duties provisions. House Bill 453 by Representative Hilton of the 48th and others, health, ambulance services, pay and annual license fee repeal requirement. House Bill 480 by Representative Franklin of the 160th and others, workers' compensation benefits change certain provisions. House Bill 498 by Representative Mathes of the 149th and others, funeral directors and embalmers, reenstatement of lapse license change certain provisions. House Bill 514 by Representative Washburn of the 144th and others housing regulation transparency act enact. House Bill 528 by Representative Gaines of the 120th and others, Georgia Online Automatic Renewal Transparency Act enact. House Bill 543 by Representative Reeves of the 99th and others, courts, six person jury trials and civil actions, revised an exception. House Bill 557 by Representative Stephens of the 164th and others, professions and businesses authority to certain nurses and physician assistants to prescribe, schedule two control substances authorized. House Bill 571 by Representative Silcox of the 3rd and others, Georgia Alzheimer's and related dementia state plan, updated every four years provide. House Bill 572 by Representative Reeves of the 99th and others, elections renamed Georgia Government Transparency and Campaign Finance Commission as the State Ethics Commission. House Bill 607 by Representative Perkel of the 169th and others, education revised definition of zeal miller scholarships scholar by changing ACT score requirement for certain students. House Bill 611 by Representative Birch of the 176th, a budgetary and financial affairs disposition of state funds derived from certain legal judgments or settlements provide. That completes your unanimous president. It is now time for the morning roll call. Are there any motions to excuse Senator from the 21st? Yes, President, I ask unanimous consent to excuse the Senator from the 27th for business inside the Capitol. Without objection, Senator from the 27th is excused. Any other motions to excuse? What my Senator from the 33rd? Nobody? All right. Secretary will call the roll senators to signify your presence by voting the ye swiss. Secretary, we'll unlock the machine. Senator from the 4th, what purpose do you rise? Mr. Bebs, I'd like to excuse Senator from the 20th, please. Okay. Without objection, Senator from the 20th will be excused. I'm for the morning devotion. All senators, please take your seats and cease all conversation. I would ask the doorkeepers to secure the chamber at this time. I would like to introduce my good friend from the 53rd District and the purpose of leading our pledge allegiance and introducing our chaplain of the day. Senator? All right. Let's stand in play. A pledge allegiance to the flag of the United States of America. To the republic, to withstand one nation under God, indivisible, with liberty and justice to the world. Out of the Georgia flag, a pledge allegiance to the Georgia flag, to the principles for which it stands, wisdom, justice, moderation, and courage. Good morning, everyone. Got somebody really special here today, pastor of the day, pastor Eddie Can Trail. Lobby is outside in the hallways. They're always expected to know our names.\n\ndon't always know their names and this is true for Pastor Eddie Cantrell. I've known him my entire life but I don't think he's known me my entire life. I can remember going to his church when I was a little kid being asked to go to the children's services and saying no, I want to stay in the main congregation. But Pastor Eddie Cantrell, he's been a pastor at Trenton First Baptist. I don't think it's the the biggest church in town. Maybe the biggest church in town. I'm not sure. But he's also the pastor for the the high school basketball team and has been my entire life. He's the pastor for the southeastern lineman training school. He's also a good community servant when it comes to government. He serves on the water authority. So definitely an influential and great person to know and Trenton Georgia. Please to introducing to you, Pastor Eddie Cantrell. Thank you, Colton. Thank you, Mr. President, for that introduction. Thank you for being here and allowing me a little time to share with you. I don't travel to Atlanta much during the rush hour, but when I do, I always come to certain conclusions. Let me give those two you're really quick. There are four groups of idiots out there. Those who drive too slow, those who drive too fast, those with those wacky, co-exist mother earth bumper stickers and those people in those jacked up trucks with some bumper sticker about the second amendment. Now, I know I've hit some of you. Sorry about that. And what I've what I've come to conclude is that I am the only perfect driver out there. And that if everyone was just like me, our roads would be safe, no problems, no issues. And I'm reminded that I am the only perfect driver out there until that state employee with the lights on his or her car pulls in behind me and reminds me that I'm not. Of course, I'm being somewhat sarcastic, but I'm also sharing a truth that goes through most of our minds. The thinking that if you don't agree with me, act like me, look like me, something must be wrong with you. The feeling that I'm right and everyone else is wrong and from what we can hear, it seems like that is taking over our communities, our churches, and our governments. If you're not just like me, I'm going to find some reason to dislike you. I'm going to find a way to make you look bad. I'm going to find a way to put you down. And I'm going to do all I can do to make myself look better at your expense. The first time I was at this podium two years ago, I never dreamed I would get invited back, but I did some homework on you folks before I came down. I read all of your bios. I read all I could find about you. I even ran a book that one of you wrote. I did the same thing for today's message. I didn't read the book and the bio again, but I've come to the same conclusion that I came to two years ago. You're some of the finest men and women in the state. Successful people who sacrifice time, family, and privacy just to serve you. You come from different backgrounds, different walks of life, different experiences, and so you have developed your ideas and your philosophies based upon those backgrounds. But I believe with all of my hearts, you care about your district, you care about our state. And your whole idea is to make life better for all of us. You may have a co-exist bumper sticker on your car. You may have a, you'll take my guns from my co-dead fingers bumper sticker on your car. You may drive too fast, you may drive too slow. I don't know, but I think you're coming together in an effort to make Georgia a better place. I read of doctors and lawyers and military members and parole officers and immigrants, social workers, public school teachers, contractors, airline workers. What a privilege it is to have a few minutes before you today. You're giving your time and your lives to serve people like me and the people of our state. Forgive me, let me take a moment, I'm going to give you a standing ovation. Thank you very much. This morning, I want to remind you that you're on a great journey and you're a journey in with those in this room. People just like you who decided to serve, who want to take our state in a better place, you know, kind of like the traffic coming down here, right? I'm sure that there are times you think somebody's setting next to you might be an idiot. I hope you never say it, just keep it to yourself, but I don't know. But this morning, I made the same journey coming down here, like I always have, but I decided to do something a little unusual. I decided to get along with those people around me, you know, those different people. I decided that I would leave in an attitude in which I would thank God for the journey, that I would pray for those people who passed me and those people who slowed me down for those people who got on my bumper and tried to irritate me and that I would pray that they would be safe and get to their final destination. You know, at most of work, I don't mean to brag, but I was here an hour early and traffic was great. I can't believe that. Men and women, you're taking our state on a journey and every day you have a decision to make. You can be mean, hateful, angry, mad. You can trick people around you poorly, you can talk about people, or you can pray for each other. You can allow each other the freedom to cut in front of you ever once in a while. You can realize that everybody is different and you can try your best to arrive with kindness and gentleness and in peace with each other. And I think your direction will influence the way our state goes. I challenge you like I did two years ago to get to know each other better. I challenge you rule senators to ask the urban senators to come up to see what we look like. You know, in Trenton, Georgia, we get so mad at traffic, because sometimes there's a line of 20 cars that are red light. It's unbelievable. Some of you have no clue what that's like, do you? You urban senators, I encourage you to invite some of the rural senators to your district and maybe we might see each other's needs just a little better. Take time to listen, take time to care, take time to get to know one another, and you know what, we will all discover that we're not a bunch of idiots. We're just different. In this chamber, I know there are different views about my Lord and my Savior, Jesus Christ, I respect all of those views, but I challenge you to read his book, learn about him, dig deeper to find out how we got our Bible and you will discover it's the most reliable book we have that Jesus came to earth to live like us, to walk like us, to help us. One of the most amazing accounts of Jesus in my mind is just hours before his arrest. He got out the wash basin, and he washed the feet of those people who would betray him. And he would tell them that the world would know how much they love him by how much they love each other. Men and women, to be in the position you're in, to go through what you must go through, to be able to sit in that seat you've got to love your district and your state. I challenge you to lead us in Georgia by the way you love each other. I challenge you to treat each other with respect and kindness and gentleness, especially when there's sharp disagreements, learn to put yourself in the place of that person you disagree with, and show Georgia a group of people who truly love one another and it's not about just a political party. Show Georgia what it means to agree to disagree agreeably. Be an example for us because our kids and our grandkids desperately need it. Lead with love and lead with peace and kindness and gentleness and service each other. In closing, I think we all need to ask ourselves what can I do? So let me tell you what I can do. I can pray for you. I can pray that God blesses you. I can pray for peace in your lives. I can pray for success and prosperity in your families. I can pray for your good health. I can pray that you know God better and better as the days go forward. I can tell you that if there is any way I can help you I would love to and I've said this before from this very spot but if you're buying me lunch I'll come down. It's amazing how many hours a preacher will drive just for a free lunch. I will join you if you will invite me. I can't sit in your seat. I don't know how you feel and I would probably get arrested if I tried to wash your feet but I can reach out one person at a time and try to help and try to listen. I was thinking about this coming down here maybe when I get home what I need to do is test drive an electronic Subaru and test drive a big old pickup truck so I can know how those people feel. I don't have either. Maybe I can just look at someone and I and try to help them in some way. May God bless you and the days to come. Thank you again Senator Moor, Mr. President for this opportunity and thank you for being here to listen. Let's stand together for prayer. Father, may your peace be on this chamber. May you bless each and every one in this room. I'm so grateful for the men and the women here who have sacrificed their time to serve us. I pray that they would serve you first and foremost. I pray that you would keep their family safe. I pray that you would give them clear minds and pure hearts and I pray that we would look to this building and the people of Georgia would be led by the examples we see here. We pray in the days to come that we would turn to you for our guidance and our strength. Allow us to open your word and listen to you and follow you. Use us for honoring glory in Jesus name. Amen. Thank you. For Africa M针! Thank you. Regan has a center from the 39th for a point of personal privilege. It is always good to have our special guest down to the Capitol and we've got a great group with us here today. Secretary Reed the caption. Senate resolution 180 by Senator Albers of the 56 and others resolution committing and congratulating Rome Police Chief Denise Downer McKinney as Georgia's 22, 2022, their outstanding police chief of the year and for other purposes. Whereas Rome Police Chief Denise Downer McKinney is highly regarded by the citizens of her community and state and by local government officials as a person of unquestionable. And where as in 2022 Chief Downer McKinney was the first female police chief to be named as the outstanding Georgia Police Chief of the year by the Georgia Associations of Chief of Police. And now therefore be it resolved by the Senate that the members of this body come in the care courage and selfless dedication exhibited by Rome Police Chief Denise Downer McKinney and carrying out the difficult duties of her vocation and congratulate her upon her recognition of Georgia's 2022, 2023 outstanding police chief of the year. That completes the order Mr. President. It is my honor to introduce the senator from the 56 and the 54th for our special guest. But before that is their objection to the adoption of the resolution. Chair here is known the resolution is adopted. It is now my honor to call on the senator from the 56 to speak to the special presentation. Thank you Mr. President. We are honored today to bring up Chief Downer McKinney from Rome, Georgia as the police chief of the year. Each one of our districts has police departments throughout that are there serving us these are our finest, the brave women and men who service in uniform each day. And I'd like to call on the senator from Rome to acknowledge his very own police chief senator. Thank you. We're proud to have the deast downer McKinney here today, the Rome Police Chief. She had to put up with one of my wife's brothers that is detective for many years and now she's putting up with another of my wife's brothers as a city commissioner there. But she has been with the department in Rome since 1981 had moved up to captain and then major and then six years ago became our police chief. And she's been through FBI training and many other areas and I could go on about that. But I want to say that when trouble was happening in a lot of communities a couple of years ago and a couple of different times, they got together with the community and they talked. And we worked hard on working things out in a, you know, in a peaceful protest way without violence and because of her work and others, Rome escaped things that were going on in other communities because of her hard work and dedication on meeting with the people and making sure that everyone understood where the boundaries were and what was out there. I think she's been great for this community. It is a slightly minority majority population in Rome. It's a tough job. There's, there are a lot of differing people there. But we seem to have been able to work together by talking and get it all worked out and it's a great community to be in and proud to have her here and she'd say a couple of words for us. Good morning and thank you for this recognition. It is an honor to be here and an honor also to be chosen as Georgia Chiefs of Police Chief of the Year. One of the things that I've strived for is to hire people and for myself to always have a servant's heart. You have to have a heart to serve your public, serve your community and serve the citizen. So I thank you for this honor and I appreciate your recognition. Thank you. Thank you. It is a pleasure to have our former ad commissioner with us here today. Mr. Gary Black. I always a pleasure have he and his wife here today and he has a special presentation that we'd like to recognize. Secretary Reid Decaption. Senator resolution 209 by Senator Walker, the third of the 20th and others a resolution recognizing and committing Gary W. Black on his outstanding public service and for other purposes. Whereas Gary W. Black has been long recognized by the citizens of the state for the battle role that he has played in leadership and his deep personal commitment to the welfare of the citizens of Georgia. Whereas as the 16th commissioner of agriculture for the state of Georgia, he implemented disaster relief efforts for Georgia farm families in the aftermath of Hurricane Michael, one of our nation's most devastating weather events. Whereas he further led the development of the nationally recognized Georgia grown brand opening opportunities for small business streamers is fanning trade across the globe and building bridges with culinary and school nutrition professionals. Whereas as the distinguished gentleman has given inspiration to many through his high ideals more morals and deep concern for fellow citizens and he possesses the vast wisdom which only comes through experience and the strength of character which is achieved through overcoming the many challenges of life. Whereas he is a person of magnanimous strengths and within an unimpeachable reputation for integrity intelligence fairness and kindness. Whereas Gary W. Black has served of honor and distinction as vision and unyielding commitment to excellence has set the standard for public service. And whereas as abundantly fitting and proper to the outstanding accomplishments of this remarkable and distinguished Georgia, Georgia will be appropriately recognized now. Therefore, be it resolved by the Senate that the members of this body recognize and commend Gary W. Black for his efficient effective unsolvable and dedicated public service to the state of Georgia and extend the most sincere best wishes for continued health and happiness. That completes the order, Mr. President. His objections to the adoption of the resolution chair here is none the resolution is adopted. I'd like to recognize my good senator from the eights to introduce special guest. Obviously Gary. Gary Black served this state for a long time. His agricultural chairman or commissioner, but also he worked for the commissioner's office for a long long time. So we appreciate all his great service. Glad to be joined by our new commissioner, Tyler Harper as well. And we've got all our ag guys up here on the own stage today. He's centered from the 24th, the eighth and our new center from the levy. But I'll yield the floor to the center from eight. Thank you, Mr. President. I'm sorry that the senator from the 20th wasn't able to be here today. But I'm honored to get to present this to somebody that has had a huge influence on my life. You know, I was Gary Black's county chair and every election ever ran in and I can tell you I would not be standing here today talking to y'all without the influence that he's had on my life. And it's been said that the wealthiest people are those that invest in others. And if that's the case, then Gary Black is one of the wealthiest men in the state of Georgia. He is always the hard work and farmers of our state, the folks living in rural Georgia, the folks with broke backs and busted knuckles that supply the food, fiber and shelter that makes this state run. He's always had their back. He's always had the backs of rural Georgia and he's always told the truth. And you know, no public servant does it alone. And I can tell you the wonderful woman that's standing behind me, Miss Lydia. She has been beside him throughout at all. And Miss Lydia, we thank you for sharing him with us. I want to read something to you. It's not going to be a long speech, Senator. But this this dates back to 2018 when when Gary was up for re-election for Ag Commissioner and I was his county chair and I I shared this on my social media. I shared this on my social media. It's a picture that I cherish of JR, my son, and he's just a little boy at the time. He's now a freshman at Georgia and Gary and they're standing in front of the Ag Hill statue there in Athens. And I said, this is one of my favorite photos. I remember when JR was electrocuted and had to be life-lighted to Jacksonville. Gary called and checked on him every day. He was hit by a great freeze, was headed towards Blueberry Country and Gary called in and prayed to the community prayer services for farmers at first baptists of home reveal and Alma. I remember when a farmer's fish were floating in his pond and his cattle were drinking the water and he couldn't get the water test back quickly and Gary intervened to help. I remember when Clinch County beekeepers were having trouble getting their bees into California and Gary intervened to aid and getting the bees across the border. I remember when we needed to get our message out to the folks in Washington concerning natus effects on Blueberry farmers and Gary organized a trip to meet with key policy makers in DC. I remember when the government had a backlog on H.2A Vases and farmers couldn't get their workers to pit their crops. Gary was relentless with calls to Congress and the Department of Labor. I could go on and on speaking of the tireless efforts Gary has undertaken on behalf of the farmers of Georgia. He deserves to be reelected and Georgia needs him and I hope everyone gets out and helps him win by the largest percentage in Georgia history. He is most definitely a great American. He won that election and friends.\n\nWe all owe a debt of gratitude to a great man who has done great things for the farmers of this state and for rural Georgia. Please welcome my great friend, Gary Black. Thank you all. Mr. President, my good friend, the President, and the Pro Tem, and my long time good friend, the Secretary of this body. Ladies and gentlemen of the Senate, it is a great honor for Lydia and I to be here today. I hope you'll also allow me the opportunity to celebrate, and Lord Willen, April 30, will be the 40th anniversary of God's call on Lydia's life to rescue me. And so we will celebrate that here and not to just at future, but I'm so glad that she could join us and for everything that I've been able to be a part of with all of you. It certainly is because of support at home and our partnership these 40 years. I am grateful last week for the call of the senator from the 20th. He's in my prayers today and I know he'd rather be here certainly and we had a good conversation yesterday. But when he called, I was wondering if this was perhaps a session of the General Assembly where there'd been two few recognitions and two few urgent resolutions. And perhaps he needed to fill some of the time and space. I doubt that that's the case. He assured me that this was sincere and I'm very grateful for every member of this body. I'm thankful for the senator from the 20th and the senator of this thing was chairman of the Senate Ag Committee who has been a long time friend, but there are many others of you. I will do a quick roll call in just a moment, but I do want you to know that when I arrived here, 33 years ago outside, I was able to be 12 years of being across the street and working with so many of you. But 33 years ago, I arrived to this body working in this body with the names that many of you will remember. Some of you very few were able to serve, but you certainly remember the dignity and integrity of those. And those were the individuals that I had an opportunity to learn from. Those names like Gillis and Tysinger and Egan, certainly Star Bullock and Hill and many, many others who had impact on my life. There's a former senator from the 18th who has another job down the street today. He's had several jobs and I've been pleased to learn from him every step of the way, but I can remember one of the instances in this body when he was president pro-tem. And this was before cell phones, folks, and that door opens and closes just like it does so many times, but particularly it's important during the latter days of the session. Secretary was a late time and we were in one of those discussions where we had something in the budget that said, may, and it had to say, shall, and I was one of the early lessons I learned of the great difference in may and shall. I hung at the door for 20 minutes just to catch the presiding officer's eye because at his instruction, I've gotten it fixed over on the other side. But so, shall was where it needed to be and I can remember those doors open and him standing right here and I was able to do that and he was able to do that and we had some good progress for the ports of the state of Georgia. So my point is, look, the Senate has been very important in my career and every success we've had, we've had it together. But here's the thing. One of my mentors has always proven to told me that all of us are better than any of us. And when I think of the Senate from the 47th, his dad was a mentor of mine, the Senate from the 28th, but from his boss yelling at me on the third floor in a phone booth, the years of ghost saying, are you going to do this? Meaning run the very first time 18 years ago. I think of the Senate from the majority leader who probably got the first call when I was going to run because it was my only cousin that called him. I think of those who stood with me, the Senate from the 24th, the 8th, the 49th, the 17th, the 11th now. And matter of fact, I attended the Senate from the 11th waiting. There are others who contributed time and talent and treasured of my success. And it goes on. The Senate are certainly from the 4th, who was the account of the campaign chair. The Senate from the 19th, whose wife worked on a campaign of mine, the Senate from the 21st, who made sure I had an opportunity to come to North Fulton when nobody knew my name. The Senate from the 23rd, we've shared many constituents and times and supporters together. The Senate from the 29th introduced me to the Attorney-Lord of Police before he ever shook my hand personally. It just goes on and on. The Senate from the 36th, I've always respected you, Ma'am, and your prowess and your intellect. And we've had a lot of good times because of Mitchell County Roots. The Senate from the 12th, we stood together to rescue our farmers during her game, Michael. And certainly the distinguished minority leader of the Senate from the 55th, I probably known her the second longest, anyone in this body appreciated that friendship. Folks, I learned one or the less than this building. I hope we can carry forward to all of you, particularly in these waning days of the legislature. I'm thankful that my commute in the house is 45 seconds. We've got a little opportunity now of helping some companies. I've got some folks that were helping them marketing and advancing the economy in Georgia, and I'm really thankful for that. But I hope that you'll take one of those other first lessons that I learned in this building and put it to practice in these coming days. Because I learned it from another member of your colleagues over in the house, Richard Royal, when I stepped forward to a committee, a subcommittee post-subcommittee meeting down in the basement. And that was when Chairman Royal, I had lost a vote in subcommittee. I was indignant. I could not believe the things that I was passionate about, members of the house did not agree with. I was very upset about it. I was a member of the house when Chairman Royal with his great compassion and deep interest in my personal opinion looked up at me and said, boy, you better learn how to count three beats two every day. I never forgot that message. And after that message, don't remember losing much in this building. Because we work together. But here's the lesson moving forward, and I hope I can impart it to you and I hope it will see that it will take root in these coming days. The first is this, sometimes you are the three. Sometimes you're the two. But you know what, before you get there, you better know which one you are. But always remember to be respectful. Because there will be more votes. There will be more votes. I thank you, Mr. President. May God bless the great State Senate of the State of Georgia and this blessed state we all call home. Thank you, God bless you. you you you you we have with us today some special guests. The secretary will please read a resolution Senate resolution 289 by senator till area 19th and others resolution recognizing and committing Courtney Glanville and for other purposes. we have been beneficial to the senate and the senate budget and evaluation office and its operations and decision making with the annual appropriations process. For 20 years Courtney has provided exemplary service to this legislative body. And whereas the senate budget and evaluation office appreciates all of the assistance Courtney has offered over the years to new and well-tinured staff in the use of systems or budgetary processes as well as its efforts to ensure the system over emerging platforms. Now therefore be it resolved by the Senate that the members of this body recognize and commit Courtney Glanville for efficient, effective, unselfish and dedicated public services to the state of Georgia and extend the most sincere best wishes for continued health and happiness. That completes the order, Ms. President. Is there objection to the adoption of the resolution that Chair here is none of the resolution is adopted? I'd like to call upon the distinguished senator from the 19th to introduce our very special guest. Thank you, Mr. President. Ms. Protum is my honor to present today Courtney Glanville. Courtney has been, he was one of our startups when we started the Senate Budget and Evaluation Office 20 years ago. But more than an analyst, not that there's anything wrong with the analyst, we have our analyst teams in the back. But after we get to the numbers, Courtney is the man who actually wrote our Senate Budget and Evaluation Computer Program that allows us to double check against the governor's programs and the House's programs. At times we found inconsistencies. The joke about Courtney though is if Courtney goes down, we all go down because Courtney is the only person who can fix the system. He is a dedicated worker. This today memorizes his 20th anniversary. Again, he was on the start up of our Senate Budget Team and Courtney, we just want to tell you thank you for 20 years of service to the Senate Budget Office. If you guys will, please just give him a round of applause. And a standing evaluation. Courtney, you deserve it. He is a dedicated worker. The only time he is at our office when we're there until 11 o'clock at night, he stays there with us keeping the system going. Unless it's Wednesday and he's at church, that's the only time he asks for a break. He has with him a couple of other guests. His brother, the Chief Judge of the Fulton County Spirit Court, Judge Jura Lannville, and his sister, and his sister, Dr. Denise Lannville, along with his niece is a bail in Courtney. Because of this day, we'd like to give you a few moments to say a few words if you'd like to do so. I just want to say it's been honored and privileged to work for the Senate Budget Office. These past 20 years, I'd like to thank the chairman for his encouragement and support for the past few years as well as I thank my family for being here with me this morning. They had to readjust their schedule to be here and I'm thankful for them. And I'd like to thank my best friend, my dearest friend, my Lord and Savior Jesus Christ, who redeemed me from my sins when he suffered and shed his blood on Calvary. Without him, I would not be here standing for you today. It's without a doubt. I've fumbled, I've made a lot of missteps, but he's always been there to pick me up and set me back on the way. He's always been there for me. He's been closer than a brother. He's never forsaken me or left me and I just want to say thank you to him as well. So thank you for this recognition. Senator from the 42nd. Let me recognize the center from the 42nd to introduce our doctor of the day. Thank you, Mr. President. Good morning colleagues. It is my honor to introduce Dr. Kathy Bunk. She is a private practice OBGYN physician indicator with over 30 years of experience. She's the managing partner of her OBGYN midwifery group at Lanna Gynecology and obstetrics. Dr. Bunk has been named by her peers as an Atlanta top doc for 10 years in a row. She is a member of the board of directors of Emory Healthcare and the DeCab Regional Health System. Her other accomplishments include being the past president of the Georgia OBGYN society and current Georgia section chair for Atlanta College of Obstetrics and Gynecology. She is a proud graduate of Leadership to Cab, Class of 2017. Please join me in thanking and welcoming Dr. Kathy Bunk. Thanks Dr. or thanks Senator. It's my honor to be here today to in some small way help care for you who care for me, my patients and their families. I have the opportunity to help bring new Georgians into the world as I did at 1 a.m. yesterday. And I want to thank you for making the Georgia that they are born into a healthy and safe place for them to grow and thrive. I know some of you might be worried that a gynecologist is manning the clinic down there, but do not worry I have an ER doc and an internal medicine doc on call on my cell phone ready to answer any questions. And this really did happen. I looked in my medicine closet on Friday to see if I could bring any samples to stock the clinic and there was nothing in my gynecology medicine clinic closet except hemorrhoid medicine. But having spent 30 seconds in this room, I can see that none of you need hemorrhoid medicine and the session will end quickly. Nobody sits very long. So thank you for this opportunity. Are there any unanimous concerns? Does any senator wish to rise on the point of personal privilege? Chair recognizes the senator from the 50th. Thank you, Mr. President. I rise today just to bring your attention to the packets that I put on your desk. April is prevent child abuse month in Georgia and I have with me a proclamation from Governor Kemp and I have some members in the audience that I would like to recognize after I read this. Children are our most valuable resource and they are also our most vulnerable. All of Georgia's children have a right to be safe and an opportunity to thrive, learn and grow in an environment that fosters healthy development. Whereas child abuse and neglect can be prevented by supporting and strengthening Georgia's families, thus preventing the far reaching effects of maltreatment and providing the opportunity for children to develop healthy, trusting family bonds and consequently building the foundations of communities and whereas strong and nurturing communities where all children grow up safe, people have jobs and provide for those they love and families receive the care they deserve, strengthen families and promote child, family and community well-being. Whereas effective child abuse prevention strategies succeed because of partnerships created within communities among citizens, human service agencies, schools, faith communities, healthcare providers, civic organizations, law enforcement agencies and the business sector and whereas by providing a safe, stable and nurturing environment for our children, free of violence, abuse and neglect, we can ensure that Georgia's children will grow to their full potential as the next generation of leaders helping to secure the future of this state and nation. And with that, Governor Kent proclaimed that April 20, 23 is child abuse prevention month in Georgia. Today, we have with us prevent child abuse Georgia, division of family and children's services and members of the Georgia Essentials for Childhood Initiative and I just want to recognize them, thank them and give them a round of applause for really devoting their lives to the children of the state of Georgia. If y'all would, recognize them with me and give them a round of applause. Thank you. That I yield the well. Thank you Senator. The Senator's yielded the well. The chair recognizes the senator from the 17th. Thank you, Mr. President. I just want to take a second. Some people have asked where these roses came from. I just want to thank all those advocates out there working on mental health reform that are providing these roses out in the halls to us. I know we're working this year on a little house bill, House Bill 520. And last year we had a big bill, House Bill 1013 that we all worked together on. I just want to thank all the advocates out there on the state that have worked so hard on all these issues and thank them for their patience with us as we work through this bill this year as well. And I'm confident that come this time next week we'll have an meaningful piece of legislation we're going to pass to help build mental health issues in our state. Thank you. Thank you Senator. The Senator's yielded the well. The chair recognizes the senator from the 17th. Thank you. This morning I rise to recognize and commend the smiley council of the southeastern United States and celebrate the festival of Navruz, marking the beginning of the Persian New Year and the first day of spring. This festival is a season of rejuvenation, spiritual renewal and a chance to reflect on our blessings. This is also a time to exude hope and optimism for the New Year and reflect on Islam's core values. Service, peace, compassion and care for the vulnerable. The smiley Muslims are a culturally diverse group of almost 15 million people worldwide, led by his highness, the aga Khan, the mom or spiritual leader. The smiley community in partnership with the aga Khan development network has been active across the nation over the last 60 years. They have worked to alleviate poverty, improve living conditions, and create opportunities for people around the world and in Georgia through the fields of health, education, art, culture, rural development and the promotion of private sector enterprise. Many organizations have directly benefited from the contributions and partnership of a smiley civic, including the American Red Cross, the Atlanta Community Food Bank, hands on Atlanta and Interfaith Atlanta. As you may have seen when coming to the chamber this morning, we are host to a Navruz celebration and exhibition of the aga Khan Award for Architecture in the South Wing of the State Capital. And by you to stop by to visit with this incredible community, they will be here till noon. And if the members could welcome them to the chamber, they are here today. Thank you so much. Thank you. I yield a well. Thank you, Senator. Chair recognizes the senator from the 8th, the distinguished senator. Thank you, Mr. President. I just wanted to remind everyone that tonight from 5 to 8, the Georgia Legislative Sportsman's Caucus, we're having a range day. It's at Starter's Ranging Guns and I hope everyone can join me and maybe help me burn a little bit of gunpowder. So, hope to see you all there. Mr. President, I yield the well. Thank you, Senator. The senator has yielded the well. The chair recognizes the senator from the 21st for a brief presentation from the Ross Room. Thank you, Mr. President. I'm here to recognize the best field goal kicker in NFL for Atlanta Falcons. Koo, can we say Koo? And he grew up and came to this country and started kicking in New Jersey in high school that he went to Georgia Southern. He's a graduate of Georgia Southern where he was a 13th All-American. Then he went to the Chargers and now he's been with the Falcons and he's all pro. And I just want to quickly recognize him in thanking for all he does on and off the field. And I want to give him this resolution and give him just a minute to say hello to the Senate. Mr. Koo? Football has brought me to so many different places. It continues to bless me with the places I get to visit and the people that I get to meet on this journey. And I'm extremely grateful and I'm forever grateful for this opportunity to be here. So thank you very much. Thank you. Chair recognizes the senator from the 43rd for a point of personal privilege. Thank you, Mr. President. Good morning colleagues. Today I rise to recognize and commend the National Council of Negro Women. This is a nonprofit organization with the mission to lead advocate for and empower women of African descent, their families and communities in CNW as it is formally known. Fulfills this mission through research, advocacy, national and community-based services and programs in the United States and Africa via 32 national affiliate organizations that enlightens, inspires and connects more than 2 million women and men. The state of Georgia in CNW has a rich history under the many years of leadership and guidance from the late Vardel Plummi. And in 2016, Louis Keith had the foresight to reorganize the state of Georgia by empowering key leaders in the cap, greater Atlanta, Rockdale, Newton, Savannah and Veldaustalown sections to collectively organize a state conference in Atlanta on August 20, 2016. For the first time in NCNW Georgia history, the state committee elected state president Sharadinton, state secretary Derrick Williams and state treasurer Murdle Mayfield during the conference that the state committee planned and implemented the Movers and Shakers Award. And its first recipient was Louis Keith. The state of Georgia provided support and assistance to families in Albany, host about Dr. Dorothy Height, stamp reveals, state leadership trainings, state conferences, no before you vote forums and GLTV phone banks. The coalition chartered additional sections throughout the state to now reflect 11 community and 14 collegiate sections. The state of Georgia, NCNW elected its second president, Dr. Darlene Ruffin Alexander at the 2021 state conference with the focus of continually working toward the mission, values and goals of the national conference and vision of the state coalition. Today our national president is the one and only Dr. Louis Keith from the cap county. If you see the women around and black and purple today, please welcome them to their state capital, the national council of Negro women. Thank you, Mr. President. I yield the will. Thank you, Senator. The chair recognizes the senator from the 28th for a point of personal privilege. Thank you, Mr. President. Good morning. Today I rise on two occasions. Number one is my middle child's eighth birthday today. He is at this moment eating lunch with my beautiful bride. And so happy birthday to Archibald Walker Brass. And Mr. President also rise today to congratulate the new and coweated chamber of commerce. Today is actually their 75th.\n\nAnniversary. Again, 75 years old today and just a couple little highlights. They're, they were the national chamber of the year, just a few years back. So in keeping in good faith here in state of Georgia, we like national champions. Well, our chamber was a national champion. I just want to congratulate and think their fearless leader, Candice Boothby, and then the many leaders from our community and Newton and Caledity County that have served on that board. Just a representative, Lynn Smith, my representative. She's, she's a former chair of that board. There are many others. So again, Newton, Caledity Chamber. So I'm a maybe in here, maybe not. I know they're over in the house, but wanted to congratulate them again and wish them a happy birthday and a happy anniversary on their 75th year. Thank you. Chair recognizes the senator from the sixth for a point of personal privilege. Thank you, Mr. President. I just wanted to rise briefly to send my appreciation and give my love to the advocates who are in the hallways and at home who are advocating against SB 140. I appreciate those individuals, particularly the organizations that have helped organize them like the human rights campaign and Georgia quality. I want to appreciate all of them for being here and using your voice and ensuring that your voices are heard at the Capitol. And I also want to appreciate my colleagues for going out and listening to those individuals here today and every day. Thank you, Mr. President. I yield the well. Thank you, Senator. The chair recognizes now the senator from the 16th for a point of personal privilege. Thank you, Mr. President. Good morning. I'm here this morning to recognize the association of Georgia's General Aviation Airports. I think we've got part of their leadership up in the gallery. If you'll give them a clap or wave from that standpoint, they are responsible for helping us with our general airports. We got them up there. You raise your hand. Jell, OK, good. And General Aviation pilot myself is the firsthand knowledge of how important the economic impact of general aviation airports are in Georgia. Our general aviation airports are the gateway to many local communities. CEOs don't arrive in Greyhound buses. Most of their members in this house have at least one general aviation airport in your district. But did you know that Georgia ranks third in the nation for annual output from general aviation, fourth in the nation for job supported by general aviation and fourth in the nation for the general aviation contribution to the GDP. We need to understand that our local airports make the world accessible to rural areas and to areas that don't reach our metropolitan area. And I want to thank them for their help in supporting our general aviation airports. And thank you, Mr. President. Thank you, Senator. Does any other senator wish to rise on a point of personal privilege? Chair, here's none. You have a consent calendar of privileged resolutions before you. Does any senator wish to remove a resolution from the consent calendar? Is there objection to the adoption of the resolutions on the consent calendar? The chair, here's none of the resolutions on the consent calendar are adopted. We have one more privileged resolution. I'll ask the secretary to please read the resolution. Thank you. Senate resolution 353 by Senator Harbin of the 16th and others resolution recognizing the association of Georgia general aviation airports as an industry association for general aviation airports in the state of Georgia. That completes the ordinance. So you're going to miss President. Is your objection to the order of the resolution just read the chair, here's none. The resolution is adopted. Are there any motions to withdraw and commit? The chair, here's None. You have a consent calendar of local bills before you. Mr. Secretary, are there any objections filed to any bill on the local consent calendar? consent calendar. Mr. President, no objections filed. Thank you, Mr. Secretary. Is there objection to agreeing to the report of the committee on state and local governmental operations, which is favorable to the passage of the bills on the local consent calendar? The chair here is known and the report of the committee is agreed to. The question is on the passage of the bills on the local consent calendar. All those in favor will vote yeh. Those opposed will vote nay. Mr. Secretary, please unlock the machine. On the passage of the bills on the local consent calendar, the yehs are 46, the nays are zero, and the bills having received the requisite constitutional majority are therefore passed. Moving on to the rules calendar. The committee is agreed to. Mr. Secretary, please read the caption. House Bill 545, I represent the candidate of 172nd and others, the bill is billed to audit an act to amend Article 2 of Chapter 8 of Title 2 of the official code of Georgia annotated relating to agricultural commodity commissions generally, so as to provide for an agricultural commodity commission for citrus fruits. The committee of the Senate on agriculture and consumer affairs recommends that this bill do pass to the secretary of the Senate for the government of the 8th district chairman. That completes your name, Mr. President. Thank you, Madam Secretary. The chair recognizes the senator from the 11th, the distinguished senator to present the bill. Thank you, Mr. President. This is HB545, is creating the agricultural commodity commission for citrus fruits. This is a fairly new industry in our state. In 2013, we had about 4500 trees in our state and today we have an excess of 500,000 citrus trees in our state. This is a voluntary commission. We have 13 of these already in existence in the state, so we're just adding to that. They're a producer funded and they provide research, marketing and promotion funds for the citrus industry. And if there are no questions, Mr. President, I'll yield the will. Senator, you do have a question. The chair recognizes the senator from the 24th. Senator. We yield for question. Yes. Senator, would this be your first bill as a senator? It would be my first house bill as a senator. Yes, sir. Could you tell us which county, all of them? What did you say 540,000 trees? 500,000. 500,000. Could you tell us which county is in trees in? I could not, Senator. But they're in most, all of the South Georgia counties. The industry's moving out of Florida into the state of Georgia, the cooler the temperatures, the sweeter the citrus. So it makes Georgia a greater marketplace and a better, sweeter citrus fruit. So we're getting a lot of growth in that area. I appreciate you bringing this sweet bill. Yes, sir. Thank you. Senator, you have further questions. There seems to be greater interest in your bill now. Chair recognizes the senator from the 33rd. Thank you, Mr. President. Will the Senate yield? Yes, sir. You mentioned something about South Georgia. Can you tell me where South Georgia begins and ends? I said that is a good question. I'm going to say, yeah, I'm going to go below making. Yes, yes. Mr. President, I know we've got a lot to do today. I'm going to yield the well and appreciate you, Senator. Oh, Senator. Oh, my goodness, Senator. All right. Don't have an answer for that one, guys. Does any other senator wish to speak for or against the measure? Well, chair recognizes the senator from the sixth. Mr. President, I ask for unanimous consent to excuse the senator from the second. So excuse without objection. Very good. All right. Is any other senator wish to speak for or against the measure presently on the board? The chair here is none. Is there objections to the previous question being ordered? The chair here is none and the previous question is ordered. Is there objection to the agreeing of the report of the committee, which is favorable to the passage of the bill? The chair here is none and the report of the committee has agreed to. Is there objection to the main question being ordered? The chair here is none and the main question is ordered. The question is on the passage of the bill. All those in favor of the bill will vote, yeah, and those opposed will vote nay. Mr. Secretary, please, unlike the machine. For what purpose is the senator from the 33rd rise? Mr. President, before we vote for this bill, shouldn't we verify that the senator knows the south Georgia begins and ends in south Georgia? That is reached senator to determine, senator. Thank you. On the passage of the bill, the yeas are 47, the nays are 3, and this bill having received the requisite constitutional majority is therefore passed. Moving on down the rules calendar, HB493, Madam Secretary, please read the caption. House bill 493 by representative Hatchet of the 155th, and others of the bill to be taught on act to amend Code Section 43, the 26th, 9th of the official code of Georgia annotated relating to renewal, surrender, and restoration of registered professional nursing licenses and continuing competency requirements, so as to revise the provision regarding verification of competency. The committee of the Senate unregulated industries and utilities recommends that this bill do pass, which is actually submitted by Senator Calcitor of the 46th District Chairman, that concludes the ordinance, president. Chair recognizes the senator from the 20th to present the bill. My apologies, the chair recognizes the senator from the 50th as the substitute presenter for the bill. Thank you, Mr. President. Due to the absence of the senator from the 20th, I'm going to be presenting this bill. What this bill does is in the healthcare community nurses have to get a certain number of hours working in facilities. As the law stands right now, they will not, they are not allowed to get recognized hours if they work in the VA hospital. This just includes VA hospitals in the list of accepted licensed facilities. If you have any questions, I'm happy to you. Senator appears you have no questions. Thank you, Mr. President. I'll yield the well. The senator has yielded the well. Does any other senator wish to speak for or against the measure? The chair hears none. Is there objection to the previous question being ordered? The chair hears none and the previous question is ordered. Is there objection to the agreeing to the report of the committee, which is favorable to the passage of the bill? The chair hears none and the report of the committee has agreed to. Is the objection to the main question being ordered? The chair hears none and the main question is ordered. The question is now on the passage of the bill. All those in favor of the bill will vote ye. Those opposed nay, Mr. Secretary, please unlock the machine. The chair hears none and the report of the committee has agreed to. On the passage of the bill, the ye is 50. The nays are zero and this bill having received the requisite constitutional majority is therefore passed. Moving on down the rules calendar, the next is hb 414. Madam Secretary, please read the caption. House bill 414 by representative blackman of the 146 and others of bill to be taught in act to amend chapter 1 of total 37 of the official quota George annotated relating to governing and regulation of mental health. The committee has been told to provide a grant program within the department of behavioral health and developmental disabilities to provide behavioral health services to military service members, veterans and their families. Committee of the Senate on Veterans Military and Homeland Security recommends that this bill do pass by substitute respectfully, Smith, by Senator Dugan of the 30th District Chairman. Veterans Military and Homeland Security offers the following substitute to house bill 414, but a bill to be taught in act to amend article 1 of chapter 4 of title 38 of the official quota George annotated relating to the Department of Veterans Service, so as to provide for a grant program to aid in the provision of behavioral health services to service members, veterans and their families. Senator more of the 53rd offers the following amendment amendment 1 to amend Senate Committee substitute to house bill 414 by adding online 53 if grant funds total 50% of nonprofits total funding with any combination of federal, state or local grants, nonprofits shall be subject to the Open Records Act and re labeling section E to F that completes the ordinance president. Senator Dugan of the 30th and more of the 53rd offer the following amendment amendment 1A to amend amendment 1 to house bill 414 by striking if grant funds and replace with if taxpayer funded grants that completes the ordinance president. Thank you Madam Secretary. The chair recognizes senator from the first distinguished senator from the coast to present the bill. Thank you, Mr. President. Here presenting house bill 414. This is pretty straightforward. Came out of the Veterans Military and Homeland Security Committee and if a grant is available, Department of Veterans Services would have matching and competitive grants relating to a nonprofit community and behavioral health program. This stems from a community health behavior facility down in my district. It is adjacent to Fort Stewart and it helps veterans and their families relating to mental health and examples of PTSD, depression, anxiety, etc. It has been a success in our community and they are looking to consider expanding it to the rest of the state and that is basically what it does. Mr. President, I will be happy to answer any questions if there are any questions and then I would like to address the amendment or follow up on that if there are no questions. Senator, you have no questions. Thank you. The amendment, I am going to let the chairman of the Veterans Military Homeland Security speak to the amendment and to the amendment to the amendment. How about that? Thank you. The senator is yielded the well. The chair recognizes the senator from the 53rd to speak to his amendment which is amendment number 1. Thank you, Mr. President. I submit amendment 1 today as a simple amendment of transparency. There is no doubt in my mind that the proper role of government should be to support our veterans in every way we can. If you are going to see a whole list on the first page of nonprofits that are doing this and if we are going to be ditioning out the grant money, I just want to make sure that there is a level of transparency there. That is why I ask that if any combination of federal, state or local tax dollars as amended coming in 1A, that is subject to the Open Records Act. With that, Mr. President, there is no questions out yielded the well. Senator, do you have questions. Chair recognizes the senator from the 42nd. Thank you. Mr. President, will the senator yield? Thank you, senator. My question is this language that you have added, does it appear in other statutory schemes? This would need to theoretically be a fairly common change that we might want to make to other programs if such does not exist, which is why I was wondering what your base level of knowledge is about the civil language and the type of program. I am not sure about that, Senator. Thank you. Chair recognizes the senator from the 37th. Thank you, Mr. President, gentlemen yield. I am supportive of the gentleman's policy. I guess the question is, as you are drafting this and again I know the gentleman from the 30th helped you rephrase some wording there. The six-year amendment shall be subject to the Open Records Act. I am asking you, and maybe even parenthetically this body, instead of saying Open Records Act would it be better to phrase that provisions of Article 4 of Chapter 18 of Title 50, the official code of Georgia Antitented, that is the Open Records article that deals with the whole framework. I don't know that Open Records Act is necessarily clean, but wanted to see if you might be friendly to the amendment that further specified the details. There is an open spot for one B, Senator. Thank you. Chair recognizes the senator from the 43rd. Thank you, Mr. President, does Jim McGill. Is it not true that as a veteran and to the question that's already been raised, is there any particular reason why veterans meant to help you would prefer that it be subject to the Open Records Act? I mean, I have a family full of veterans. I remember growing up and not being allowed to shoot off fireworks with some of my dad's friends that were in Vietnam because of Shell Shop. So I understand the issue, and I want to make sure if our funds are going to that issue that were subject to transparency, right, so that we're doing the absolute best job that we cannot. The worst thing that could happen would be taxpayer-funded money going to something that wasn't benefiting our legislative intention is. Well, we're legitimate for the year. So is it not true that probably half of the state's funds are going through that process and are not subject to Open Records? Well, maybe that's something we should consider as a body. I would be happy to work with you on that. Yes, ma'am. Thanks. Senator, you have no other question. Okay, thank you, Mr. President. The senator has yielded the well. The chair recognizes the senator from the 30th to speak to his amendment, which is 1A. Thank you, Mr. President. I greatly appreciate the intent of the senator from 53rd is doing here. This is not supposed to be intended to be an adversarial amendment to his amendment. It's designed to be clean up. As y'all know, just from January through February of this year, we've had three National Guardsmen kill themselves. We've had two suicides because of mental health issues, because of multiple deployments. Anything we can do to strengthen their mental health care would be greatly appreciated across the state and use kind of as a model across the nation. Now, I just want to be clear, if this is federal dollars, state dollars, county dollars going in, then they should be accountable for them. There's a lot of grants that come in that have nothing to do with taxpayer funds. They should not be held under the same scrutiny, because if I'm entity X making a contribution to a cause that I believe in, then it's on me as entity X to do the audit to make sure that funding is done the way I had prescribed be done. Next dollars, we should have them hold them accountable. So that's all the amendment 1A does. Ms. President, if there's no questions, I will yield the well. Senator, you have no questions. Thank you. I yield the well. We have another amendment that's been filed. Amendment 1B, as in Bravo. Madam Secretary, please read amendment 1B. Senator Sussler of the 37th, untilery of the 19th offer, the following amendment 1B to amend amendment 1 to House Bill 414 by deleting online six of the amendment. Open Records Act and replacing with the following provisions of Article 4 of Chapter 18 of Title 50 of the official code of Georgia Anatey. That completes the ordinance, President. Thank you. The chair recognizes the senator from the 37th to speak to his amendment amendment 1B. Thank you, Mr. President. Again, in the spirit of the gentleman's underlying amendment 1 of open transparency. What amendment 1B simply does is rather than saying Open Records Act, it actually specifies the article within the code Article 4, Chapter 18 of Title 50, which is the Open Records Act. The whole framework is packaged in a couple of code sections, which is Article 4. That's all the amendment does. It just specifies exactly where that is and doesn't leave it open to the broad language of Open Records Act. Let's take questions. Senator, do you have no questions? Does any other senator wish to speak for or against the amendments or the bill? Chair, here's none. Chair recognizes the senator from the first. Would you like to close the debate? Senator Waves. All the amendments beginning with 1A as in 1 alpha, is there objection? The chair hears none and amendment 1A is adopted. Amendment 1B is in Bravo. Is there objection? Chair, here's none. Amendment 1B, Bravo, is adopted. Now, in the main amendment, amendment 1, is there objection to amendment number 1? There is an objection. All those in favor of amendment number 1 will vote ye. Those opposed to amendment number 1 will vote nay. Mr. Secretary, please unlock the machine. Mr. Secretary, please. All in the adoption of amendment number 1, the ye is 37, the nays are 16, and the amendment is passed. The question is now on the adoption of the committee substitute as amended. Is there objection to the adoption of the committee substitute as amended? The chair hears none. The committee substitute as amended.\n\nis amended as adopted. Is there objection to agreeing to the report of the committee, which is favorable to the passage of the bill? The chair here is none and the report of the committee is agreed to. Is there objection to the main question being ordered? The chair here is none and the main question is ordered. The question is now on the passage of the bill by substitute. All those in favor of the bill will vote ye. Those opposed will vote nay. Mr. Secretary, please unlock the machine. The chair here is none and the main question is ordered. The chair here is none and the main question is ordered. The chair here is none and the main question is ordered. For what purpose is the Senate of the 14th rise? Parliament, I agree, Mr. President. State Chair and Quarantine. Mr. President is not true that with that amendment, we made the entire non-profit subject to the Open Records Act, even if it's just federal local funding. They don't have to be state funded at all. And so now, those non-profits will be subject to exhaustive open records requirements, just like state agencies. Is that not true, Mr. President? The Senator is passionate about which he speaks. On the passage of the bill, the ye's are 51. The nays are zero. This bill, having received the requisite constitutional majority, is therefore passed. All right. Moving on to calendar. House bill 373. Secretary, read the caption. House bill 373. Representative Jones of the 60th and others have been sent to the act to amend. Chapter 4 of Title I of the official code of Georgia annotated relating to holidays and observances. So as to designate September 11th of each year as first responders day in Georgia. The Committee of the Senate on Rules recommends that this bill to do pass, which is definitely submitted by Senator Brass of the 28th District Chairman. That completes the ordinance, President. Reganise the Senator from the 35th to speak to the bill. Senator's going to speak from our chair. We're going to make a exception for the Senator. Thank you. Thank you, Mr. President. I stand for the fireman, police, EMTs, and all public safety personnel in our health care professionals by offering HB 373. It's a bipartisan piece of legislation and it will just recognize invaluable service to our community that so many essential workers have presented since 9-11-2001. The first responders often put their lives on the line each day when we dial 9-1-1. Police and firemen have no guarantee when they answer a call if they will make it home safely or without injury. So our EMTs must be on call for 24 hours to help rescue Georgians experiencing a medical crisis. And of course, we know the pay for these responders does not equal the risk that they put on their lives when answering the 9-1-1 calls. So colleagues, I ask for your favorable decision on voting for remembering the sacrifice patriotism and humanity of so many who show their humanity and their against the terrorists who really struck fear into the lives of all when they went into the twin towers 22 years ago. So Mr. President, if there are no questions, I'd like to just ask my colleagues for their favorable vote on HB 373. There are no questions, Senator. Does any other Senator wish to speak for against the measure? Chair, here's none. Is there objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to agreeing to the Board of the Committee which is favorable to the passes of the bill? Chair, here's none. The Board of the Committee has agreed to. Is there objection to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the passes of the bill? All those in favor vote, yay. All those pose, nay. Secretary-in-law in the machine. Thank you. you All in the passes of the bill, the a's are feet to two, the a's are zero, this bill having received requisite constitutional majority is their four pass. Moving on, House bill 207. Secretary, read the caption. House bill 207 by Representative Rhodes is 124 from others of the bill to be dialed an act to amend Article 1 of Chapter 7 of Title 52 of the official code of Georgia annotated. relating to general provisions relative to registration, operation, and sale of watercraft. So as to provide for the carrying of night's visual distress signals upon coastal waters of this state during certain hours. The Committee of the Senate on Natural Resources and the Environment recommends that this bill do pass. respectively submitted by Senator Anderson of the 24th District Chairman, that concludes the order Ms. President. I recognize the senator from the 24th. Distinguished Chairman of Natural Resources. I don't know how you got this House member. Trick to you end the carrying this bill, you'll eat this senator. Thank you, Mr. President. This is a Department bill for Commissioner Mark Williams. It just brings upgrades to the lighting system on all vessels that's on the coastal waterways of the state that they had the proper lighting for at night. And also it currently in the Georgia waters, fresh waters. If you have a boating accident in alcohol and drugs is involved, you have 48 hours to report it. This bill changes it to where it has to be reported right then. As you vote green. You have no question, Senator. Thank you. Does any other senator wish to speak forward against the measure? Chair here is not. Is there objection to the previous question being ordered? Chair here is not in the previous question is ordered. Is there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill? Chair here is none. The Board of Committee has agreed to. Is there objection to the main question being ordered? Chair here is none. The main question is ordered. Questions on the passes of the bill. All those in favor of ye. Opposed nay. Secretary-General, on the machine. Chair here is not in the previous question. The Board of Committee has agreed to. On the passes of the bill, the A's are 53 and the A's are zero. This bill having received the requisite constitutional majority is therefore passed. The bill is finished with House Bill 35. Secretary, read the gifts. House Bill 35 by representatives of the 161st and others have billed to be entitled to amend chapter 2 of Title 52 of the official code of Georgia and it hailed. Committee on the passes of the bill, the A's are zero. The bill has been ordered. The bill has been ordered. Committee of the Senate on transportation recommends that the bill pass by substitute respectively submitted by Senator Dulleslaw of the 27th District Chairman. Senate Committee on transportation offers the following substitute to House Bill 35 of billed to be entitled to amend an act to amend chapter 2 of Title 52 of the official code of Georgia and it hailed relating to Georgia Ports authority. So as we provide the powers of the authority to expand the rest of the authority of officers of the Georgia Ports authority in certain circumstances. That completes the ordinance, President. We're going to ask the senator from the first to speak to the measure. Thank you, Mr. President. House Bill 35 is about the Georgia Ports authority police force. It has at present about 206 total post certified policeman. At any one time there are 30 to 40 on duty. As you can imagine this is a very large facility includes bronzewick and the inland ports. All of the jurisdictions relating to Georgia Ports authority is in favor of this bill. Now I'll give you an example of comparison. If the Georgia Ports authority has 30 to 40 officers on duty at one time the port went worth which is adjacent to the facility and responds most of the time they have three to five officers on duty. They are in favor of this. Mostly it is a traffic issue at their gates as you can imagine they have hundreds of trucks in and out there and at times there are accidents. This is what it does. It extends it to one mile outside the Georgia Ports authority property in Chatham County and in Glen County. There was an amendment that was added in committee that refines it to still remain owned property on the inland ports throughout the state. That is all it does. Mr. President I would ask for your favour consideration. I would be happy to answer any questions. You have no questions, senator. Thank you. Does any other senator wish to speak for against the measure? Chair here is none. Is there objection to the previous question being ordered? The question is on the adoption of the committee substitute. Is there objection to the adoption of the committee substitute? Is there objection to the agreement to the report of committee which is failed to pass the bill? Chair here is none of the board of committees agreed to. Is there objection to the main question being ordered? Chair here is none of the main question is ordered. The question is on the pass of the bill. All those in favour? Yes. All those opposed? Nay? Secretary in line to the machine. Chair here is none of the board of committees agreed to. Chair here is none of the board of committees agreed to. Chair here is none of the board of committees agreed to. Chair here is none of the board of committees agreed to. On the passes of the bill the ayes are 54 and the ayes are zero. This bill haven't received the rest of the constitutional majority. The ayes are constitutional majority. This bill has been passed by substitute. The senator from the senator, the pro-tum, has lunch for everybody in the any room here. We've got a few more things we're going to try to get done today but the pro-tum has been kind of to provide everybody with lunch today. At the appropriate time the food will be waiting on late U.L.A.'s engenomen in here. I recognize senator from the 17th for motion. Mr. President, I should am his consent that senate rule 3-1.2A be suspended so that a series of local bills can be read and assigned to committee. The senator has moves. Secretary read the caption. Is there objection to the motion without objection. Secretary now read the caption. And it's about six bills in a row just so everybody's on the same page. Six bills in a row and all assigned them as they read on each one of them. Senate bill 3-11 by senator Shricland of the 17th and others of bill to me tallow an act to amend an act providing home safe. State bill 3-12 by senator Anderson of the 43rd of bill to me tallow an act to amend an act providing an annual salary for the coroner of Rockdale County and lieu of a fee system of compensation. State bill 3-13 by senator Anderson of the 43rd of bill to me tallow an act to amend an act creating a magistrates court of Rockdale County approved March 13 1978 as amended. Senate bill 3-16 by senator Anderson of the 43rd of bill to me tallow an act to amend an act providing an annual salary for the judge of the probate court of Rockdale County and lieu of the fee system of compensation approved March 4 1969. Senate bill 3-17 by senator S. de Ves of the 6 and others of bill to me tallow an act to amend an act to continue the existence of the Atlanta independent school system under the management and control of Atlanta. That completes your misrepresentation. Senate bill 3-14 by senator Anderson of the 43rd of bill to me tallow an act to amend an act creating the state court of Rockdale County approved April 2 1987 as amended particularly by an act to prove June 29 2020. So as your revised provisions relating to compensation of the judges of the fed court to provide for related matters to revive for an effective date to repeal conflicting laws and for other purposes. Senate bill 3-15 by senator Anderson of the 43rd of bill to me tallow an act to provide for the supplementary compensation of the judge of the juvenile court of Rockdale County to provide for an effective date to provide for related matters to be approved. That completes your misrepresentation. Senate from the 33rd. Thank you, Mr. President. My fellow senators, colleagues, friends, and the rest of y'all. I move that the Senate agreed to the House substitute to Senate bill 1-04. Senator has moved that the Senate agreed to the House substitute. Secretary Reed, the caption. Senate bill 1-04 by senator Red of the 33rd, a bill to me tallow an act to amend an act changing the compensation of the clerk of the superior court of the sheriff and the judge of the probate court of Cobb County. The House has offered the following amendment to Senate bill 1-04, a bill to me tallow an act to amend an act changing the compensation of the clerk of the superior court of the sheriff and the judge of the probate court of Cobb County from the free fee system to the salary system. That completes your misrepresentation. I recognize senator from the 33rd speak to the speak to the bill and the motion. I'm sorry. Something as easy as this is a local bill and it's good for my district. Be fine, Senator. It's a local bill and it's good for the district and I yield the well. That is a smart man. That is why I call the senator from the 33rd when he wants something special. Is there any objection? Does any other senator wish to speak for against a measure? If not, we will. The Senate has agreed to the House's substitute. All those in favor of signify by saying aye. Excuse me, voting, aye. All those opposed vote nay. Secretary Long there's Shane. Thank you. On the passage of the bill, the yeas are 54 and the nays are zero. This time we receive the registered constitution majority is therefore motion is granted. I recognize the majority leader for motion. I move that the senate senate adjourn until 10 a.m. on Tuesday, March 21st. The rules committee will happen upon adjournment of 450 of the capital agriculture and consumer affairs committee meeting as cancelled. The transportation committee meeting will happen at 1 p.m. and mes one of the capital. The government oversight committee meeting will happen at 2 p.m. and 307 C.L.O.B. The health and human service committee meeting will happen at 2 p.m. and 450 of the capital. The finance committee meeting will happen at 3 p.m. and mes one of the capital. The appropriations compensation subcommittee meeting will happen at 4 p.m. and 450 of the capital and the judiciary committee meeting will happen at 4 p.m. and 307 C.L.O.B. That complete stormless president. Thank you secretary. Would any other senator wish a given announcement. All right. So the majority leader has moved. All those in favor of the majority leaders most are signified by saying aye. All those opposed no. I clearly have it. We're adjourned. Thank you.",
  "updated_at": "2026-02-13T19:33:06.608937+00:00"
}