{
  "video_id": "7EvK7jE-ukY",
  "url": "https://youtu.be/7EvK7jE-ukY",
  "title": "Georgia House - Day 38 (2026-06-24)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 38,
  "video_date": "2026-06-24",
  "duration_minutes": 244,
  "summary": "Here is a summary of the key points from the Georgia House session transcript on 2026-06-24:\n\n**Overview**\nThe session was focused on the passage of Senate Bill 344, which failed to receive a constitutional majority, as well as the introduction and referral of Senate Bill 370 to committee.\n\n**Key Actions**\n- **SB 344**: Bill to amend code related to requiring prisoners to serve as witnesses or defendants in criminal cases. Failed to pass with a vote of 81-68.\n- **SB 370**: Bill to provide for compliance with safety and permit requirements for electric membership corporations working in railroad rights-of-way. Referred to the Transportation committee.\n\n**Bills Introduced (First Reading)**\n- None detected in the transcript.\n\n**Notable Moments**\n- Extensive reading and recognition of various privileged resolutions.\n- Procedural discussions around the reconsideration and voting on SB 344.\n- Presentation of SB 370 by Chairman Tanner.\n\n**Votes**\n- SB 344: Failed to pass, 81-68.\n\n**Attendance**\n- No specific quorum notes provided.\n\n**Adjournment**\n- The transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "House will come back to order. This House will come back to order. Mr. Clark, would you ring the bill? House will come back to order. Mr. Clark, would you ring the bill? House will come back to order. The House will come back to order. Clark will read the caption to a group of privileged resolutions. The Clark will read. Recognizing commending the Wayne Hall. Recognizing commending Travis Gatson. Recognizing commending Sharon Barnwell. Commending Sarl J. Quentin. Recognizing commending the International Women of Hope. Recognizing commending Patsy Austin Gatson. Recognizing the importance of ensuring access to higher education for all Jordan. Recognizing the need for federal fiscal relief. And new state revenue streams to ensure an equitable economic recovery in Georgia. Recognizing that Black Lives Matter. Recognizing the need for reform. Use of force policies to protect lives and keep communities safe. Condemning racism and discrimination against Asian Americans and Pacific Islanders. Recognizing commending. Janice B. Reddick upon the grant occasion of a retirement. Recognizing commending Tom Kleinline on his outstanding services Georgia Southern University's Director of Athletics. Recognizing commending. Elizabeth Zoller Hershey on her outstanding public services clerk of court Effingham County. Recognizing commending. O'Feedle Burrows on the grand occasion of her retirement. Recognizing commending the 2020 graduating class of North Pauling High School. Recognizing commending. The 2020 graduating class of Pauling County High School. Recognizing commending. Representative Abel Mabel Thomas our outstanding public service. Recognizing commending. Joe Z. Dean on her exemplary service and achievements in her work as a community activist. Recognizing commending. The 2020 graduating class of High Room High School. Recognizing commending. The 2020 graduating class of East Pauling High School. Recognizing commending. The hearts of the community foundation. 2020 Board of Governors Award recipient Gordon Lightner. Celebrating the birth of Mary Gardiner Hopkins. Recognizing commending. Mac Stancell celebrating the 103rd birthday of Jimmy Mima Lutton and for other purposes. That completes the reading of the privilege resolutions. You You You You You You You Is there any objection to adopting the privilege resolutions? The chair here's none in the resolutions are adopted. You You You You You You You You Good Bye All right the action of the House in failing to give the bill, a constitutional majority, was reconsidered by the House. So upon extended discussions with the clerk and legal counsel, it's the opinion of the chair that we now must take that bill back up before we transact any other business. So, Mr. Clerk, you want to read the caption and then we'll put it on the board. Senate Bill 344 by Senator Mulles, the 53rd Millenium of the 49th, dogo to the 30th, gooch to the 51st Kennedy of the 18th and others. You can title the act to amend Code Section 24, 1360, of the official go to Georgia annotated relating the order requiring prisoners delivery to serve as witnesses or criminal defendants in general. All right, if there's no objection to the previous question being ordered, the chair here's none the previous question is ordered. All of those in favor of the passage of Senate Bill 344 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Alexander Anolo-Witz, bar, Barton, Benton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnick, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulkam, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Brnau, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Hwynn, Paris, Prince, Pullin, Robyshow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wilinski, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, D, Bonner, Buckner, no, Perchette, Calwell, Campbell, yes, Cantrell, Dickerson, Duke's, Duke's, Campbell, yes, Gillard, no, Gordon, no, Green, yes, Jones, J, B, no, lot, lot, yes, Meets, no, Park, no, yes, Rogers, Singleton, no, Stovall, no, Williams R, yes, Alexander, Bagemore, Beesley T, Belton, Beverly, Blackman, Bodie, Cantrell, Cook, Dickerson, Dixon, Dollar, No, Dreyer, Dreyer, Duke's, no, No, Evans, Harold, Hatchett, Hawkins, Hopson, Jackson D, Jackson M, Jones T, Jones V, Kendrick, Kirby, Larickia, Wen, Saints, Scott, Setsler, Smith M, Stevens R, Tanner, Thomas A, Members will look at the board and make sure that it is accurate, and the clerk will lock the machine on the passage of Senate Bill 344, the eyes are 81, the nays are 68, this bill having failed to receive a constitutional majority is therefore failed. Clerk will read the caption to Senate Bill 370. Senate Bill 370 by Senator Gooch, the 51st, the 28th, the 56th, Jordan and the 6th and others, the Natal men, the 46th, the Democratic, the public utilities and public transportation so to provide for compliance with certain safety and permit requirements. This bill I refer to the committee on transportation that committee recommends a dis bill do pass. Chair recognizes chairman Tanner to present the bill. Thank you, Mr. Speaker. I come for you today with Senate Bill 370. It's a pretty straightforward measure. If you'll remember I believe it was last year we passed Senate Bill 2. That was some broad sweeping broadband legislation that our former rules chairman Powell and Senator Gooch and others had worked on for an extended period of time. As part of that, the EMCs had the ability to run broadband and rideaways, which would include railroad rideaways. In doing that, it was inadvertently left out that they would still have to comply with safety insurance requirements and safety measures. The railroad, as you know, is governed for the most part by the federal governments and say travel across state lines. So the bill you have before you today is a result of a compromise between the EMCs and the railroad industry who all were in agreement with this legislation that it would just make it clear that if the EMCs are going to be in the railroad rideaway, they have to comply with all safety requirements, all insurance requirements, etc. Just like any other contractor working in the railroad rideaway. It's a simple piece of legislation that's all the bill does. Again, all parties involved the EMCs and the railroads have worked very closely together. And this is very much a compromise between all parties. Mr. Speaker, with that I'd be happy to answer any questions if there are any. There doesn't appear to be any questions. All right. Would that I'd ask for favorable consideration from Senate Bill 370? Thank you very much. The gentleman is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Alexander Aneloets, Var, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Boate, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Bart, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulkham, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Mathyack, McCall, Morris G, Newton, Nick's, Oliver, Perish, Parsons, Petri, Perkle, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Alan, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Moore C, Morris M, Nelson, Wynn, Paris, Prince, Poland, RoboShow, Sanks, Scofield, Scott, Shannon, Sharper, Smith M, Thomas Am, Turner, Wollensky, Wilterson, Williams M, F, Williams N, Wilson, Beesley T, Bonner, Buckner, Yes, Richette, Callwell, Yes, Campbell, Yes, Cantrell, Yes, Dickerson, Gordon, Yes, Green, Yes, Call it, Jones J, B, Kirby, Yes, Yes, Mathis, Yes, Yes, Yes, Long Tahoe, Yes, Park, Yes, Prew it, Yes, Rogers, Yes, Singleton, Yes, Stovall, Yes, Williams R, Yes, Alexander, Elytee, Vetton, Beverly, Burnow, Chokus, Fire, Dunhu, F-Straight, Frazier, Graveli, Hitchens, Hopson, Jackson D, Jones J, Jones T, Jones V, Kendrick, Martin, Park, Petrie, Powell, Setsler, Smith M, Stevens R, Thomas E, Watson. Have all members voted? Does the board accurately reflect your intention? If so, the clerk will lock the machine on the passage of the bill. The yeas were 149. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 482. Senate Bill 482 by Senator Berkley, 11th, Miller, 49th, Dugan, 30th, Watson, the First, and Kirkpatrick, 30th, to be titled an act to amend chapter 53, a title 31. The official go to Georgia annotated relating the office of health strategy and coordination, so as to revive for a state all-payer claims database. This bill haven't referred to the committee on health and human services. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Cooper to present the bill. Thank you, Madame Speaker. Ladies and gentlemen, the House, I bring to you the substitute to Senate Bill 482.\n\nThis is a health care transparency bill. It sets up an advisory committee to make recommendations on the creation and the operation of a state all payers claim database. Already there are 30 other states that have these databases or are in the process of developing them. What will happen is once we have the database, which is being developed and in conjunction with Georgia Tech, Georgia Tech, the health insurance companies, the CMOs, DCH, and our dental people will all submit their claims to the database. And once we have that kind of data, then we will be able to really analyze what is happening in healthcare in regards to cost, quality of care, the differences between the type of treatments that are happening, which ones are successful and which ones are not. It will be a wonderful way of improving healthcare across this state, in cost, in access, and in quality, and in transparency. Mrs. Speaker, if there are no questions, I will ask for the members of this body to vote on a positive way on this bill and to move us forward in improving our healthcare across Georgia and ask for their favorable vote. If there are no questions, I'll know the well. There is a question. Chair Rick Pysch is representative Walensky for a question. He waves. No, he's waving, but he did not wave. I'll wave back to you, sir. Check it. I was saying hello from way up here. Just one quick question. In terms of the privacy, do you yield? Yes, I will yield. Thank you. In terms of the privacy, is this information just for the state to hold or under this bill could insurance companies get a hold of any of this information? No, it's for the insurance on their claims. It's for the state. And there will not be any names that go with the data that goes into this database. It will be strictly the data will minus the names of the people that... Do you want to form a question? Yes. Will all insurance companies be able to see all of this data or just the states, the data collected from the insurance companies? No, just the state. Okay. Thank you. There are no more questions. Thank you. I asked your favor, vote, and I yield the well. The lady is yielded the well. Is there any objection to the previous question being ordered? The Chair, here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair, here is none. The committee substitute is adopted. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair, here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. All right. Alexander Anoloids, bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodey, Bruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper, Corbock, Dempsey, Dickie, Dollar, Drenner, Dubnick, F. Strachan, England, Irwin, Fleming, Fry, Gaines, Gardner, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulcom, Holmes, Houston, Hugley, Jackson M. Jasperce, Jones J. Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silkcocks, Smith L, Smith R, Smith V, Smirey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Baysmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Moore C, Morris M, Nelson, Wen, Paris, Prince, Pullin, Robesho, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams MF, Williams N, Wilson, Beasley Teege, Yes, Connor, Yes, Fuckner, Yes, Perchette, Calwell, Campbell, Yes, Cantrell, Yes, Dickerson, Yes, Dukes, Yes, Campbell, Yes, Gillierd, Yes, Gordon, Yes, Green, Yes, Gullet, Jones J, B, Jones J, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Yes, Yes, Lomp-to-Hon, Yes, Perch, Yes, Perch, Yes, Pruin, Yes, Rogers, Yes, Singleton, Yes, Stowe, No, Stowe, Yes, Williams R, Yes, Lamp-to-Hon, Benton, Ben, Beverly, Blackman, Shannon, Chokus, Dollar, Dyer, F. Stratian, Frazier, Gullet, Hatchett, Hopson, Jackson D, Jackson M, Jones J, Jones T, Jones V, Kelly, Kendrick, Lopez Romero, Setsler, Thomas E. Watson, Have all members voted and check the board for accuracy. Is the board accurate? If so, the clerk will wait one moment. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 144, the Nays were four. The bill having received the requisite constitutional majority is therefore past. The clerk will read the caption to Senate Bill 473. Senate Bill 473. Senate Bill 473 by Senator Harper, the seventh to be titled, an act to amend chapter three, a title 12, the official to George Antony, relating to conservation and natural resources, so as to transfer duties, powers, responsibilities, and other authority relative to historic preservation from the Department of Natural Resources, the Department of Community Affairs. Ms. Bill, I'm in for the Committee on Natural Resources and Environment. That committee recommends that this bill do pass. Chair recognizes Chairman Corbett to present the bill. Thank you, Madam Speaker. I bring you before you today, LC45-0463ER. In basing this is a legislation that enables the move of the historic preservation division from the DNR to DCA. This move has already been accounted for in the budget, and this is just a legislation that enables that. Both departments are in agreement, and it is a net savings to the state to do this, and I'll ask for your favor. Consideration. Are there any questions? There are no questions. I yield the oil. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill, although yes, all those opposed will vote no, and the clerk will unlock the machine. Alexander Aneloids, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokis, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnik, Goughstrace, England, Irwin, Fleming, Fry, Gaines, Gardner, Graveli, Herall, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones, Jay, Kelly, Kendrick, Knight, Lehood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Perish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yurtah, Alan, Bayesmore, Pernau, Cannon, Clark, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kinnerd, Lopez Ramero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, Wen, Paris, Prince, Pullen, Robeshoe, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas, A.M., Turner, Walensky, Wilkerson, Williams, MF, Williams, N, Wilson, Beasley Teague, BCT, Yes, Foner, Yes, Fuck Meer, Furt, Furt, Furt, Furt, Furt, Carl Well, Furt, Yes, Campbell, Yes, Can, Can, Trell, Yes, Can, Dickerson, Dickerson, Dukes, Dukes, Yes, Campbell, Yes, Gilliard, Yes, Gordon, Yes, Gordon, Yes, Green, Yes, Green, Yes, Cullet, Yes, Cull, Jones, JB, Jones, JB, Yes, Kirby, Yes, Kirby, Yes, Lot, Yes, Lot, Yes, Mathis, Yes, Metz, Yes, Metz, Mop-to-Hon, Yes, Mop-to-Hon, Park, Park, Pruitt, Yes, Pruitt, Yes, Rogers, Yes, Wrong, Singleton, Yes, Stole, Stole, Yes, Williams R, Yes, Yes, Yes, Felton, Beverly, Cantrell, Clark H, Dollar, Douglas, Estration, Frazier, Gaines, Herald, Hopson, Jackson D, Jasper's, Jones J, Jones V, Kelly, Kendrick, Knight, Lopez Romero, Petrie, Pullen, Smith M, Thomas E, Turner, Watson, Wilkerson, have all members voted and checked the board for accuracy. First, Mr. Gaines, Kelly, Felton, Felton, Felton, Felton, Felton, Felton, Felton, Felton, Felton, Felton, If so, the clerk will lock the machine on the passage of the bill. The A's were 151, the NA's were zero. The bill having received the Constitution, the Constitution of Majority is therefore passed. Clerk will read the caption to Senate Bill 426. Senate Bill 426 by Senator Strickland, the 17th, Hillary, the 19th, Karpatric, the 32nd, right of the 33rd. James, the 35th and others to be entitled an act to amend our co-owner, chapter 9 and title 12, which annotated relating the air quality, shows the provide for the reporting of any unpermitted releases. Ms. Bill, I'm referred to Committee on Natural Resources and Environment. That committee recommends that this bill do pass. Chair recognizes Chairman Parsons to present the bill. Thank you, Speaker and ladies and gentlemen, the House. I have Senate Bill 426 as a pretty simple proposition. Actually, we had, we had voted this exact same language out on a House bill back in March sometime before we left. This bill has to do with the permitting of Ethylene Oxide, Ethylene Oxide is a man-made chemical that's used for many things, but in particular, it's used for sterilizing medical equipment, which has even more importance today and throughout these last months than when we were here before. The bill actually does two things, the only two things. One, the bill requires that as a condition of a permit for operations that include the emission of Ethylene Oxide, any spill or release of Ethylene Oxide shall be reported to the EPD within 24 hours of discovering such a spill or release. The second thing it does is requires EPD to put that information about the spill on their website when that happens. Those are the only two things that the bill does, a simple bill, but it is a very important issue. I would ask your favorable consideration of Senate Bill 426, and Madam Chair, I will yield the well unless there are questions. Are there questions? There does not appear to be any questions. I yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The Chair here is none of the previous questions ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair, here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Yes, all those opposed will vote no, and the clerk will unlock the machine. The bill is not even ready. All the bill is ready. The bill is not just ready. The bill is not just ready. Alexander the Nolowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Boate, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulcombe, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Mathyack, McCall, Morris, Newton, Nicks, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yarduk, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Popson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Morris M, Nelson, when, Paris, Prince, Pullen, Robesho, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, B, C, D, Yes, Bonner, Yes, B, Yes, B, Yes, B, Yes, B, Callwell, Yes, Yes, Dickerson, Dukes, Yes, Yes, Gamble, Gillier, G, Yes, Gordon, Yes, Green, Yes, Gullet, Jones J, B, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Mech, Yes, Mop Taham, Yes, Park, Yes, Fruit, Yes, Rogers, Yes, Singleton, Yes, Stovall, Yes, Williams R, Yes, R, Yes, R, Yes, R, B, B, B, Burns, Cantrell, Cooper, Dollar, Dubnic, Eftration, Frazier, Gamble, Holly, Hauston, Jasper, Jones J, Jones T, Jones V, Jones V, Kendrick, Kendrick, Kendrick, McCall, Morris G, Morris G, Lynn Reeves, Reeves, Ridley, Ridley, Rogers, Sharper, Smith L, Smith L, Smyrey, Thomas E, Watson, Burtchette,\n\nBoard for accuracy. If so, the clerk will lock the machine on the passage of the bill. The yeas were 150. The nays were one. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate bill 367. Senate bill 367. My senator martin of the 9th strickland of the 17th artillery, the 19th Kirkpatrick of the 32nd brass, the 28th and others to be entitled to amend part 12 of Article 6 of chapter 2 of Title 20. The official go to Georgia annotated relating effectiveness of educational programs. So as to reduce the number of student assessments, this bill I have referred to the committee on education that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Jasper's to present the bill. Thank you Madam Speaker and members. Do you want to make some people happy? If so, Senate bill 367 by senator martin and many others is your pathway to do so. If you want to go home and tell students and school kids and parents that you reduce testing, this is your bill. What we are doing in Senate bill 367 is on line 34 we are continuing our emphasis on third grade reading and fifth grade rip mastery of math. We are also just below it we are removing one test in elementary grade in history. This is the US history test but don't despair. They will be retested now in high school when the teachers only take US history in high school. Countability has always been important and in this bill you will see we are asking DOE to use the well placed questions in our state wide test to compare us to other states. In our committee chairman nicks made a number of comments how well Georgia students are doing and how with this we knew how well they were doing. In line 60 is the headline of the news article. We are removing four of the six tests above the state minimum leaving only two. A social studies test. It is Georgia history in the eighth grade in American history in high school. We are removing one each of the core subjects of language arts, math, science and social studies. This is a response into your citizens and their desire to see us reduce testing. In line 67, writing will be assessed in high school and gives DOE the flexibility of local systems and scheduling this. We have all heard about the after the test, the time between the testing at the end of the year and what we are doing is setting a date of 25 days before the end of school that those tests need to be given. This allows for schools to teach a little longer and reduces that amount of time. Testing is often frequently talked about whenever you are around a group of people in education. Many of the evaluations are done by local systems to assess their children at any given point. We have no power over this and we really don't want to because we ensure local control. But what we do, what you will see in the bill, is we are allowing DOE and to help a system that wants to evaluate the testing procedure if they ask. They don't have to, but I think community and parents alike are wanting them to do to reduce testing, and this will do that. That's it. It's a great bill. I think it's one that many of you all will use in your newspaper articles and on your direct mail pieces and as you talk to parents and families this year and I appreciate everybody's work on it. I would be glad to answer any questions, Madam Chairman. Are there any questions? There is a question to your right, Chairman Nex. There's Jim and you. Absolutely. Is it not true that I want to thank you for doing a lot of hard work on this bill? Thank you. It's been hard. Is it not further true that we kind of got left out on this early on? But you worked extremely hard about sure that the priorities of the house that we have worked on over the last six or eight years were maintained in this legislation. Absolutely. We've shared it. We worked very hard on the work you, Chairman Tanner, many people, and I appreciate your work. Thank you. Are there any other questions? I yield the well. Thank you for your favour. Consideration on this great bill. Gentlemen, is yielded the well? Is there an objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All those in favour of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Alexander Lenellovitz, Bar Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Boatey, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnic, Abstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Hauston, Hugley, Jackson M., Jasperce, Jones J., Kelly, Kendrick, Knight, LaHood, Lurickia, Lomston, Martin, Matthew, McCall, Morris G., Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yurda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J., Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks Mitchell, Moore B, Morris C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, RoboShow, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A.M., Turner, Wollinsky, Wilkerson, Williams M.F., Williams N, Wilson, Beasley T, B-C-T, Bonner, Yes, Buckner, Yes, Barchette, Barchette, Carl Whale, Yes, Campbell, Yes, Cantrell, Dickerson, Dukes, Yes, Dukes, Dukes, Yes, Campbell, Yes, Ging, Yes, Gillierd, Yes, Gillierd, Yes, Gordon, Yes, Gordon, Green, Green, Yes, Gullet, Gullet, Jones J.B., Jones J.B., Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Metz, Yes, Mopthahan, Montelun, Parks, Parks, Crewy, Yes, Rogers, Yes, Singleton, Yes, Stovall, Yes, Williams R, Yes, Beverly, Yes, Bodie, Cannon, Cantrell, Carter, Clark H, Dollar, Fleming, Frazier, Gaines, Gardner, Henson, Hitchens, Holly, Jones J. Jones V., Kendrick, McLeod, Sharper, Smith M., Thomas E, Watson, Williams N, Yes, Yes, Yes, Yes, Have all members voted and checked the board? All members voted. So the clerk will lock the machine. On the passage of the bill, the a's were 151. The bill has received the requisite constitution. The majority is therefore passed. Clerk will read the caption to Senate Bill 445. Senate Bill 445. Senate Bill 445, Senator Kennedy, 18 Jones, 25th and Luke, 26th to be titled an act to amend chapter 7 to title 12. The fiscal to Georgia, annotated relating to control of soil erosion and sedimentation. So to authorize certain water and water and sewer authorities to be designated as local issuing authorities, as bill I refer to the committee on natural resources and environment. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Dickie to present the bill. Thank you, Madam Speaker. This bill was requested by a Macon Bibb County commission. Came before our delegation back in the fall and Senator Kennedy delegation chairman has passed it over in the Senate. Macon Bibb wants to transfer that stone water responsibility to the Macon Bibb County water authority. And the attorneys tell me without this legislation they can't do it. So all parties want this bill. Macon Water Authority has expertise to do it. And Bibb County commission would like to give that to them to do. Macon Water Authority is an elected authority and would need to get the LIA permit. Now LIA permit is a licensing issuing authority that EPD gives those cities and counties who want to do this type thing. And so EPD has also expanded this bill a little bit to let other wardens who authorities who can also do this type work. So straight forward bill EPD is good with it. Macon Bibb is good with it. Macon Water Authority. And I'll be happy to answer any questions if there are any. There is a question. Are there any questions? And I see none. I'll yield the well. No questions. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none. The report of the committee has agreed to shall this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Alexander Aneloets. Bar Barton. Belton. Benton. Bentley. Benton. Beverly. Blackman. Bodie. Bruce. Burns. Carpenter. Carson. Chokus. Clark H. Collins. Cooper. Corbett. Dempsey. Dickie. Dollar. Drenner. Dubnick. Abstration. England. Irwin. Fleming. Fry. Gaines. Gardner. Clinton. Grabley. Harold. Hatchett. Hawkins. Hitchens. Holcomb. Holmes. Houston. Hugley. Jackson M. Jasperus. Jones J. Kelly. Kendrick. Knight. LeHood. Lerickia. Lomston. Martin. Matthew. McCall. Boris G. Newton. Nick. Oliver. Parish. Parsons. Petrie. Perkle. Powell. Reeves. Rhodes. Rich. Ridley. Schoagans. Setsler. Silcox. Smith L. Smith R. Smith V. Smirrey. Stevens R. Tankersley. Tanner. Tarvin. Taylor. Thomas E. Tramble. Washburn. Watson. W. E. W. W. Williams A. Williamson. Yerda. Allen. Baysmore. Bernal. Cannon. Carter. Clark D. Clark J. Cook. Davis. Douglas. Dreyer. Duna Hoo. Earhart. Evans. Frazier. Gilligan. Gertler. Henson. Hill. Hogan. Holland. Holly. Hobson. Howard. Hutchinson. Jackson D. Jones S. Jones T. Jones V. Couch. Kennerd. Lopez Romero. Marin. McClain. McLaren. McCloud. Meeks. Mitchell. Morbby. Morris C. Morris. Nelson. When. Paris. Prince. Poland. Robo Show. Saints. Schofield. Scott. Shannon. Sharper. Smith M. Thomas A.M. Turner. Wollensky. Wilkerson. Beasley T. B.C.T. Bonner. Yes. Yes. Burtchette. Callwell. Yes. Campbell. Yes. Cantrell. Yes. Campbell. Yes. Gantrion. Dickerson. Dukes. Yes. Dukes. Yes. Campbell. Yes. Gillier. Yes. Gordon. Yes. Green. Gollett. Gollett. John J.B. Yes. Jume C. Yes. Kirby. Yes. Lot. Yes. Mathis. Yes. Metz. Mopthahan. Yes. Park. Yes. Rogers. Yes. Rogers. Singleton. Yes. Stovall. Yes. Williams R. Yes. Beverly. Burtchette. Cannon. Cantrell. Cantrell. Yes. Dunahose. Frazier. Green. Henson. Hitchens. Jones J. Jones B. Jones B. Kelly Kendrick. McClaren. Prince. Rose. Rogers. Smiley. Thomas E. Turner. Wilkerson. Williams A. Wilson. Have all members voted and checked the board for accuracy. Have all members voted. If so, the clerk will lock the machine on the passage of the bill. The yeas were 139. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. Yes. The bill has been voted. The bill has been voted. The clerk will lock the machine on the passage of the bill. The yeas were 139. The nays were zero. The den two workers had Для cesc and then the flocks and the broot of the mill. The pauses passed. The clerk will read the cap to senator ball 416. Senator Mulles. Tuesday. 20 20 other other. Twenty four 370. May guardian and So it's to change the name of the Office of College and Career Transitions to the Office of College and Career Academies. This bill I have referred to the Committee on Rules that Committee recommends that this bill do pass by Rules Committee substitute. Senate Bill 416 is on the supplemental calendar so it is not on your desk or in your in your book. It's on the tables outside Outside the gallery 341 and outside the chamber if you would like a copy of the bill We'll wait a moment for those who want to get a copy of the bill The chair recognizes Representative Gaines to present the bill Thank you, Madam Speaker As we all know we we have an ongoing economic and health crisis and Georgians are suffering The revenue estimate that will be passing in our budget will be a 10% reduction from our original budget to this house pass back in March this legislation Senate bill 416 Will match that cut and cut our legislative salary by 10% to match the to match the budget cuts for this upcoming fiscal year As elected officials it's this is an important step and important message that we take this pay cut to help George to help ensure that we Make up the cuts Not only for our staff that workforce and work with us in the general assembly But also full-time staff across the state Madam Speaker. I'm happy to take any questions. Are there any questions? The chair recognizes Representative Jasmine Clark for a question That's a gentleman you I do I recognize that right now we're in time time and that we all are gonna have to make sacrifices My question is actually a little bit more general though Are there other ways that we could increase revenue and this fate to help offset these budget cuts that we're dealing with such as what we're trying to do with this bill? I think there's certainly ways we can we can look at Different avenues to ensure we pass a balanced budget, but this bill before us today I think is an important step To cut our own salary and make sure that we're looking out for Georgians across our state And as a gentleman further you'll sure do you feel that by lowering the earth by having a very low salary which we already pretty much have as a part-time legislature that it discourages people who may not have the ability to take 40 days off or in this case 6 to almost seven months off From work to come down to the capital and do the people's work. I Think it's again, I think as we have this ongoing health and economic crisis This is an important step that we make sure we send a message to Georgians That as you say all Georgians are suffering and I think is we're cutting our budget by 10% we should also cut our own pay by 10% Chair recognizes representative Carter to your left in the gallery Thank you just a does the gentleman I do Okay, I take the mask off Thank you for this gesture So my question is if we are cutting the budget 10% and you are including the legislators in the budget their salaries How will we also address the unlimited amount of committee days that Those was who are not Primitude we get to you, but there are some of you all that have excessive Committee days will you also be eliminating those? I don't have excessive committees. I'm limited to 10 as well and this legislation just for clarity does only apply to this current fiscal year Happy to answer any other questions The chair recognizes representative Stovall in room 341 That's a gentleman you I do When these cuts were considered\n\nbeing that we are considered part time but majority of most of us work full time. What's the consideration given to cut the governor's salary that state superintendent, Department of Labor, Public Service Commission, AC, and all of the other statewide elected officials cutting their salary as well? That would certainly be something that makes sense to me to include. It's obviously not a part of this bill. This is as members of the General Assembly that we're cutting our own salary, but if they'd like to propose that, that's certainly something that makes sense to me. Chair recognizes whoop Kelly for a question. Thank you Madam Speaker, with the gentleman yield. I will. Isn't it true that this House has a policy that we in committees are meeting outside of session that our chairman have an opportunity to award committee days to any member regardless who attends those meetings. Isn't that true? That is true. Chair recognizes representative Dubneck for a question. The gentleman will suspend. Chair asks members to please keep take your conversations to the Annie room. Chair recognizes representative Dubneck for a question. Thank you Madam Speaker, with the gentleman yield. I will. Isn't it true that in tough times we all need to roll up our sleeves and do our part? That's right. Isn't it true that the people of Georgia elected us to lead them? That is correct. Isn't it true that leaders lead by example? That's right. Thank you. I agree this bill is leading by example and Madam Speaker, I will yield the well. Thank you. The gentleman has yielded the well. The chair recognizes representative Williams to speak to the bill. Excuse me. I do want to be here in January. Thank you Madam Speaker. Arise is very simple. Yes, Georgians expect us to lead by example. But example should not be cherry picking. If you don't cut somebody, everybody need to take some of this. Everybody. And first you should take from those who got something because you don't pay us enough to move the scale. There's not enough money in this deal to move the scale. So if you want to be symbolic, do something. Let's think of something else to do. And to the very honorable whip, Stacy Abrams is not serving now. Those of us here have to deal with this issue. The issue is 23 years, two, three years has been how long has been since this legislature saw fit to give itself a raise. Now hope when we get all excited about cutting it, that when times get good and they will get good again, that we stop being bashful about raising it. An independent commission made a recommendation and mysteriously they disappeared as if David Kofferfield had put them on the show. No word on what we're going to do about that commission. Now what you're doing by doing what you're doing for 23 years is you're creating a legislature where eventually only two types of people will serve here. The very rich and the dirt poll. Those who don't need it and those who any money would be a pay raise. Yes, I don't see where it takes any guts to cut 10% of $17,400, $170, going to really help a $2.5 billion deficit. The thing of the matter is there are no part timers here that really do their job. You need to tell those folks who stop me in Walmart on Saturday or grab me and Krogel's own Sunday, I'll call my house late at night and I'm part time and the sessions out after 40 days that I can't talk to you until the second Monday in January. Folks, stop being hypocrites about this thing. Now if you are so weak in your district until you can't raise your pay truly, you need to let your opponent come on down here. Because folks are not interested in that kind of weakness. Now, hey, I don't care when they go home and say, I will use why I do vote against that. I said, don't reason I vote. One vote it wants to give to because I didn't have but one vote. It was so hypocritical to revoke it. I could have voted 10 times I would have voted. Come on, vote. This is symbolism is not helping our situation. Let's vote to do what we need to do. We're going to take a hit. Let's start on the second floor and go all the way out to the Labour Department and cut everybody who's making six figure incomes. That's who's figures need to be cut. Six figures. Thank you. God excited but I'm so broke I can't do nothing but talk. The gentleman has to ask you. Do the right thing. The gentleman has to ask you. And vote this down. If you care to take them. I will take a question and two I don't get a chance to do this often. The chair recognizes representative park in room 341. Does the gentleman yield? I would love to yield. I love here. Go ahead. Thank you. Is it not true that this does nothing to mass more than one billion dollars being cut in K through 12 education? You sure got that right? Big difference between $170 billion or billion. The chair recognizes representative Wilkerson for a question. Thank you. Does the gentleman yield? The gentleman yields. Is it not true that earlier this session I was one of the few people to vote against a pension increase and I heard it from several members. It is true, sir. And I was one of those you heard from and I hope you heard. Does the gentleman further yield? I yield. Is it not further true that if the committee chairman limited themselves to ten days, I might be swayed by this. But this is purely a way to punish those that are not empowered to make a small difference that will not close that billion dollar gap that we're taking from pre-K and from the college kids. That is just purely political and I agree with the gentleman. Is that not true? I believe you believe what you just said but until you relent and start talking about pay raises and increases in retirement, I reserve an answer to your question. Thank you. Thank you Madam Speaker, also get out of this well. Gentlemen has yielded the well. The chair recognizes the majority wept Kelly to speak to the bill. What a day. We are getting an opportunity to see so many people who don't want to do anything to help those out that do so much for us. Because this is what we're dealing with. This is what we're dealing with. This isn't symbolic and you can go around and ask any one of the staffers that staffs this house. Because if we don't do this pay cut today, it will be them that get furloughed. We have an opportunity to be leaders. We have an opportunity to say just like we're asking other state agencies to give. Just like we're asking our staff to give here, we have an opportunity for us to say us first. Us first. That's what we should do as leaders. Every one of us put our name on the ballot two years ago and many of us have it on the ballot this time. If we weren't happy with our pay, we shouldn't have signed up to do it. We signed up for this job. We begged people to give us this job. And then we're trying to do the responsible thing and take care of the staff that gives so much to us here who are risking their lives really to make sure we're able to do our job today. But we're talking about budgets and this and that, but I'll tell you what, now's the time for us to do the right thing and lead by example. And when we put this on the board here in a minute, we'll have an opportunity to see who wants to lead in this chamber and who wants to responsibly respond to the COVID-19 crisis and I'll yield the well. The gentleman is yielded the well. The chair recognizes Representative Thomas. For what purpose does Representative Thomas rise? Statue your inquiry. Can you hear me? Thank you. Is it not true that we are standing in this chamber and most of us that have standing this chamber have said that we want to stand for justice for all? If the lady so states. Further inquiry. Statue your inquiry. Is it not true that justice for all and in order to have justice for all means that we have to have people that represent all of us. And in order to have people that represent all of us, that means authors, farmers, teachers, mothers, nurses, service members, blue collar workers. Is it not true? One more further inquiry. Final inquiry. If we want to represent everyone in the state of Georgia, then we should give everyone the right to be represented at this capital, not just the people that are lawyers and doctors and that make thousands and thousands of dollars. Therefore, I believe that it is true that we should allow everyone to be elected to office and to get just $17,000 a year a year. I'm a you. Every member will make that decision quite publicly in just a moment for what purpose does representative Martin Rives. An inquiry, Madam Speaker. Statue your inquiry. Isn't it true that I believe the representative missed spoke when he talked about $170 that in fact 10% of $17,000 is $1,700 and multiplied by 180 members of the House is over $300,000 and represents 15% is it not true of the budget cut that the House will take. So by us taking that, that is money that will not have to come out of furlough days of the House. Is that not true? And remember, we'll make that decision shortly. But what? Is it not? Go ahead. Final inquiry. I do. That this is for this fiscal year and we'll go back and we hope the economy comes back. So we're not putting a terrible burden on anyone long term. We're doing what we're asking the rest of the staff at the state to do is all get in the boat and row the same way to put Georgia in the place that we can continue to square people. Thank you, Madam Speaker. So what purpose does Representative Beverly rise? Parliamentary inquiry. Stature inquiry. Is it not true that we have not considered the budget as of yet? As the gentleman so states. For the inquiry. Stature inquiry. Is it not also true that if we haven't considered the budget yet, we don't know if there's just across the board, 11%, 14% cut. Maybe there's some revenue enhancements that we haven't considered that doesn't necessarily necessitate that we take a cut. Is that not true? I'm sure the gentleman knows of what he speaks. For what purpose does Representative Bayes more rise? Parliamentary inquiry. Is it not true that I am considered a disabled retiree? If the lady so states. And is it further not true also true that I have for a loud part of my income to be taken away to serve my district and my constituents as the lady so states. And that's because I make a little more than is required for Social Security. So I'm serving already at a deficit. I'm sure the lady knows of what she speaks. For what purpose does Representative Holly rise? Does he weigh? For what purpose does Representative Petri rise? He waves? No. He's waving. Thank you, Madam Speaker. Parliamentary inquiry. State your inquiry. Madam Speaker, is it not true that if someone who has employed hundreds of people in my career, that as a leader, whenever an organization in the private sector has to cut the wages of its employees, it is crucial in terms of morale for your team, the people that work for you, that we partake in those same cuts. That is fundamental. I'm sure the gentleman knows of what he speaks. For what purpose does Representative Dukes in room 341 rise? He waves. He waves. For what purpose does Representative Hugley rise? Parliamentary inquiry. Madam Speaker, is it not true if we are to lead by example, we need to do that by following the rules of this house and not a refer to individuals by name and our excitement about making our point? As the lady absolutely states. Further inquiry. State your inquiry. Is it not further true that each and every one of us must make the decision that's before us, but we are at a disadvantage because some of us know what the budget looks like and most of us don't. The chair would say that there are very few who knows what the budget looks like right now, including the chair of appropriations because it's not quite through, but I, the chair feels quite confident that the reduction will be reflected in the budget as we have voted numerous times in the past on reductions and they in fact were then subsequently reflected in the budget. For what purpose does Representative Cannon rise? Parliamentary inquiry. State your inquiry. Madam Speaker, is it not true that any member who does not wish to have their entire salary could easily give that to another member or the general public? That is true. Thank you. And lastly, for what purpose does Representative Davis rise? Parliamentary inquiry. State your inquiry. Is it not true that the subcommittee of COVID located additional funding in the budget so that we would not have to make critical cuts? And further inquiry. State your inquiry. Is it not true that we found over 500 million and corporate welfare and loopholes that can be used in is there a chance that you would use that as part of your funding? Sure. The lady knows that of what she speaks. For what purpose does the minority leader rise? Madam Speaker, do I make a motion? State your motion. I move that we lay Senate Bill 416 on the table. And the gentleman's motion that the House will lay Senate Bill 416 on the table. All those in favor will vote aye. All those opposed will vote nay. And the clerk will unlock the machine. The House will suspend. The House will suspend. The clerk's office is having a difficult time hearing your vote if conversations could be taken to the anti-room or outside the chamber after you vote. Continue. Dempsey, Dickey, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner. Clinton, Gravelie, Herrell, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M. Jasperus, Jones J. Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G. Newton, Nick's Oliver, Parrish, Parsons, Petrie, Perkel, Reaves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith Fee, Smirie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Baysmore, Turner Now, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Fairheart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holley, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin McClain, McLaren, McCloud, Meeks Mitchell, Moore B, Moore C, Morris M, Nelson, Ben, Paris, Prince, Pullen, Robachaud, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley Teague, Yes, Bonner, No, Buckner, Yes, Urchette, Calwell, Campbell, No, Trell, Dickerson, Yes, Yes, Campbell, No, Yes, Gordon, Yes, Green, Goat, No, Jones V, Jones T, Yes, Kirby, Lot, No, Mathis, No, Yes, Mom to Hunt, No, Park, Yes, no, Rogers, Singleton, No, Stole, Yes, Williams R, No, Beverly, Cannon, Cantrell, Cooper, Davis, Dubnik, Dunnoho, Frazier, Fry, Holly, Hutchinson, Jones J, Jones T, Jones V, Kendrick, Lopez Romero, Lot, No, McCloud, Smirie, Williams M, F. Have all members voted and checked the board, raise your hand if you've got a change. Is there a microphone in the gallery? Check the board to see if they may have already been recorded. Is there a microphone in the gallery? The clerk will lock the machine. Is there an objection to the previous question being ordered? Is there an objection to the previous question being ordered? Alexander, Anelo, Far, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnik, Eftration, England, Irwin Fleming, Fry,\n\nGaines Gardner Glanton Graveli Harrell Hatchett Hawkins Hitchens Holcomb Holmes Houston Hudley Jackson M. Jasper's Jones J Kelly Kendrick Knight Lehood Lurickia Lomston Martin Matthew McCall Morris G. Newton Nix Oliver Parish Parsons Peachtree Perkle Powell Reeves Rhodes Rich Ridley Rutledge Skoggins Setsler Silcox Smith L Smith R Smith V Smirrey Stevens R Tankersley Tanner Tarvin Taylor Thomas E Tramble Washburn Watson Welch Workhizer Weed Hour Williams A Williamson Yerda Allen Beesmore Bernal Cannon Carter Clark D Clark J Cook Davis Douglas Dreyer Dunhu Earhart Evans Frazier Gilligan Gertler Hanson Hill Hogan Holland Holly Hopson Howard Hutchinson Jackson D Jones S Jones T Jones V Coush Kennard Lopez Romero Marin McLean McLean McLean Meeks Mitchell Moore B Moore C Morris M Nelson when Paris Prince Pullen Robo Show Saints Scofield Scott Shannon Sharper Smith M Thomas A.M Turner Wolensky Wilkerson Williams M.F Williams N Wilson Beasley Teague Bonner Buckner Yes Birchett No Yes I get it I get it I get it I get it Beasley Teague Beasley Bonner Bonner Yes Bonner No Birchett Birchett Yes Carl Well Carl Well Yes Campbell Yes Carl Carl Well Yes Carl Well Dickerson Doops No Doops No Doops No Campbell Game Yes Gillier Yes Gillier No Gordon Gordon No Green Green Yes Goat Yes Jones J.B Jones J.B No Kirby Kirby Yes Lot Yes Mathis Mathis Metz Metz No Mopthong Mopthong Yes Park Yes Park No Pro-it No Pro-it Yes Rogers Yes Singleton Stovol Yes Stovol No Williams R No Williams R Yes Benton Yes Benton Cantrell Carpenter Carson Drenner Dunahue Evans Frazier Fry Gilligan Hawkins Holland Holly Jackson M Jones J Jones T Jones V Kelly McCall Meeks Morris M When When Paris Parsons Rich Ridley Smith M Smirie Wolenski Have all members voted and does the board reflect your vote? Yes Mr. Smith Yes He is Got it He is going Hi Yes I live in a chamber At table Did you vote? Yes Revolved Did you vote for your vote? Yes I am sure it was Yes Yes Yes Yes Yes Yes Yes Yes I'm sorry. Sharfer should have been a yes. I'm not here. I'm not here. I'm not here. One of them. Have all members voted and it is the board reflected accurately. If so, the clerk will lock the machine. On the passage of the bill, the A's were 106th and A's were 51. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 28. Senate Bill 28. Senate Bill 28. Senate Bill 28. The second half statler of the 52nd albers, 56. Harvest of the 15th. We title an act to amend Article 24, Title 33. The official voted Georgia and it is a related agenda for visions regarding insurance generally. So it is a prohibit, certain insurers are imposing a co-payment, co-insurance or office visit charge. This bill I refer to the committee on insurance. That committee recommends that this bill do pass. Chair recognizes representative Matthew Act to present the bill. Thank you, Mr. Speaker and members of the House. I bring to you today Senate Bill 28. It simply codifies verbatim. The rule from the insurance commissioner that co-pays shall be reasonable in relation to the covered benefits to which they apply. That rules 120-2-44-0.04 if you want to look that up. The codification of this rule as law gives it further support to promigate that rule. What does reasonable really mean? It is identified by the commissioner and of course would very under circumstances. For example, if it was a $1,000 co-pay in hospital, of course the co-pay would be a little higher as compared to office visit. This passed through the Senate unanimously passed through the House Insurance Committee and I'm asking for your favorable consideration. I do not think you have any questions. Thank you, Mr. Speaker and I'll yield the well. Ladies, yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 28 will vote aye. Those opposed will vote no and the clerk will unlock the machines and call the roll. Alexander Anelovitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickey, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holmes, Holmes, Houston, Hughley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, Lehud, Larickia, Lomston, Martin, Matthew, Macaw, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Watson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClellan, McLaren, McLeod, Meeks, Mitchell, Mora B, Morris C, Morris M, Nelson, Quinn, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Steven's, Stevenson, Thomas AM, Turner, Wollensky, Wilkerson, Williams MF, Williams N, Wilson, Beasley T, Yes, Bonner, Yes, Fuckner, Yes, Furchette, Carl Will, Camel, Yes, Cantrell, Dickerson, Dukes. Yes. Dukes. Yes. Dukes. Gamble. Yeah. Yes. Gileared. Yes. Gileared. Yes. Gordon. Yes. Gordon. Yes. Crane. You're free. Goat. Goat. Jones, JB. Jones, JB. Curse. Curse. Yes. Lot. Yes. Lot. Mathis. Yes. Metch. Yes. Metch. Yes. Mopthahan. Yes. Mopthahan. Yes. Park. Yes. Park. Yes. Crue it. Yes. Crue. Yes. Rogers. Yes. Rogers. Yes. Singleton. Yes. Singleton. Yes. Stovall. Yes. Stovall. Williams R. Yes. Williams R. Yes. Alexander. Yes. Alexander. Paysmore. Paysmore. Benton. Pint. Blackman. Yes. Yes. Cannon. Carpenter. Park. Park. Park. Park. Park. Clark H. Park. Yes. Drenner. Dukes. Duse. Yes. Abstration. Yes. Abstration. Frazier. Green. Hugley. Hugley. Kelly. Kelly. Kendrick. Kelly. Kendrick. Kendrick. Kendrick. Kendrick. chicken. Lot. Lot. Lot. More B. More A. More S. G. Yes. Poros. Parish. Perkle. Roads. Yeah. Rutledge. Silcox. Thomas AM. Thomas E. Williams A. The Thomas E. Williams A. Thomas E. Williams A. Thomas E. Williams A. Members will like look at the board and make sure that it is correct. The board will lock the machines on the passage of Senate Bill 28. The eyes are 145. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to Senate Bill 477. The Senate Bill 477 by Senator Walker, the 20th Kennedy, the 18th Gooch, the 51st, Miller, the 49th and others to be entitled to amend Code Section 1764. The official go to Georgia annotated relating the authorization of posting cash bonds generally, furnishing a receipt to persons posting bond and recordation of receipt of bond on dock at the spill ever referred to the committee. On juvenile justice, that committee recommends that this bill do pass. It recognizes Chairman Rich to present the bill. Thank you, Mr. Speaker, ladies and gentlemen of the House. I bring to you Senate Bill 477 this afternoon. This bill revises the code relating to the investigation of family violence cases to better protect victims and their children while preserving the integrity of the investigation. It requires the arresting officer to consider whether the injuries that he or she observes are of an offensive or defensive nature when deciding which if either person to charge. It also clarifies that the predominant aggressor rather than the primary is the one who poses an ongoing threat to public safety. The current Code Section does use the word primary aggressor and there has been confusion around the meaning of that word which is accidentally led to the victim being arrested on occasion or sometimes maybe the victim and the primary aggressor. This bill protects children because when both parents are arrested, obviously the children are traumatized and they don't have a parent at home with them. Significantly this bill is supported by prosecutors, law enforcement and family violence advocates. It has bipartisan support and has passed unanimously in each committee where it has been heard. It's supported by many public interest groups including the coalition against domestic violence and the Georgia Commission on Family Violence, the prosecuting attorneys counsel and the YWCA of Greater Atlanta. So at this time I will yield for any questions. You do not have any questions. Thank you. I appreciate your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 477 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Alexander Anullowicz, Barr, Barton, Belton, Bennett, Bentley, Benton, Beverly, Black, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corvette, Dempsey, Dickie, Dollar, Drenner, Dubnick, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasperus, Jones J, Kelly, Kendrick, Knight, Lehoud, Larickia, Lomston, Martin, Matthew, McCall, Morris, Newton, Nick's, Oliver, Parish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Campbell, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, More B, More C, More S, M, Nelson, Hwynne, Paris, Prince, Pullin, Robo Show, St, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams, M, F, Williams N, Wilson, Beasley T, Yes, Fondre, Yes, Fondre, Rechut, Calwell, Campbell, Cantrell, Dickerson, Duke's, Yes, Campbell, Gillier, Gordon, Green, Goat, Jones J, B, Kirby, Yes, Flock, Mathis, Yes, Mets, Yes, Mophtahan, Yes, Park,\n\nYes. Through it. Yes. Through. Yes. Rogers. Yes. Rogers. Yes. Singleton. Yes. Stovall. Yes. Williams R. Yes. Beverly. Verchette. Verchette. Yes. For now. Yes. For now. Yes. For now. Yes. For now. Yes. For now. Canon. Carpenter. Clark H. Dollar. Estration. Estration. Frasier. Frasier. Gaines. Gamel. Gamel. Gillier. Gillier. Grain. Grain. Henson. Yes. Hitchens. Hitchens. Hitchens. Housemen. Housemen. Larickia. Yes. Larickia. Yes. Law. Yes. Makes. Yes. Makes. Purple. Yes. Roads. Yes. Rutledge. Yes. Setsler. Shana. Shana. Silk ox. Smith M. Smith V. Smirrey. Thomas E. Williams A. Members will look at the board and make sure it's correct. Representative Gaines. Chairman Beverly. Any others? Any others? Representative Wilkerson. Final call. Last call. Setsler. Chairman Parsons. All right. Last call. Senator Walker. Senator Walker. The 20th. The 18th. The 51st. The 49th. The 29th. The 29th. The 29th. The 29th. The 29th. The 29th. The 13th. The 31st floor of the iterative ruling, the codes for federal agreements and citizen lawyer the consistent integrity of the Pinefia County Council, in届 Thank you, Mr. Speaker, fellow members. We bring before you Senate Bill 446, as it relates to unclaimed cash bonds. Currently, cash bonds have become forfeit. They must be held for as long as eight years, and this would reduce the time for these cash bonds to be held to two years after disposition or after dead, docketed. This is all this bill does. Be happy to try to answer any questions if there are any, Mr. Speaker. You do have a question to you. Yes, sir. You'll recognize the chairman flimming to your left for a question. Thank you, Mr. Speaker. Is it true to the gentleman in the well that this bill passed unanimously out of the committee and has the support and clerks that are involved in the session? Yes, sir. The gentleman knows what he speaks. Thank you so much. I do not see any other questions. Sir, I would ask for favourable consideration of this body and I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none of the report of the committee. As agreed to, shall this bill now pass all those in favour of the passage of the bill will vote aye. Those opposed to vote no and the clerk will unlock the machines and call the roll. Alexander, on all of its bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Mickey, Dollar, Drenner, Dubnic, Efstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holkham, Holmes, Austin, Hughley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutland's, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson, Hwynne, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Stevens M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Bonner, Yes, Buckner, Yes, Perchette, Calwell, Yes, Campbell, Yes, Dickerson, Yes, Doos, Yes, Gamble, Yes, Gillier, Yes, Gordon, Yes, Green, Yes, Gullet, Yes, Jones J, B, Yes, Kirby, Yes, Yes, Mathis, Yes, Metz, Yes, Mom to Han, Yes, Park, Yes, Yes, Rogers, Singleton, Stowe, Yes, Williams R, Yes, Yes, Ma, Yes, Baysmore, Yes, Bode, Yes, Bode, Yes, Perchette, Perchette, Pernow, Burns, Yes, Burt, Cannon, Cannon, Carson, Chokus, Clark H, Clark J, F, Strachan, Yes, Airhart, Frazier, Gaines, Graveli, Hitchens, Jones T, LaRickia, More, C, Nix, Paris, Perkel, Powell, Prince, Rhodes, Ridley, Rogers, Rutledge, Silcox, Smith M, Watson, Weed Hour, Wilkerson, Williamson. Members will look at the board and make sure it's accurate. Members, please look at the board. Representative Lopez Romero. Representative Cannon. Any others? The clerk will lock the machine on the passage of Senate Bill 446. The eyes are 137. Senator Nayser, 4 of this bill, having received the requisite constitutional majority is therefore passed. The clerk will read the caption to Senate Bill 337. Senate Bill 337 by Senator Thompson, the 14th Robertson, the 29th. The 30th Guch, the 51st, the 49th and others to be titled, act to amend Part 3 of Article 3 of Chapter 11 of Title 16. The official code of Georgia annotator relating it, invasion of privacy so it's to include falsely created videographic or still images of other persons within the prohibition against the transmission of photography or videos. This bill had been referred to the Committee on Judiciary and Nancevel. That committee recommends that this bill do pass. Chair recognizes Chairman F. Strachan to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I present to you Senate Bill 337. This legislation was brought because of advancements and technology have created something that is known as deepfakes. What those are, where computers through computer use, persons face is put on another person's body. So Senator Thompson brought this bill because in nude or pornographic pictures, people's faces are being put on it and then it's transmitted as if it's actually that person. Similar to the statute that we passed several years ago that prohibits disclosure of or spreading pictures since the material like this, this would just add deepfakes to classification. In committee, there was no expressed opposition to my knowledge and one of the members of the minority party said that this actually had been done to her, that her face as a state representative of a public official had been put on a nude body and that that picture had been shared and distributed. So good piece of legislation would ask for your favorable consideration, happy to answer any questions. I do not see any questions. Oh, you'll do well. Thank you. As you'll do well, is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of Senate Bill 337? Will vote aye. Those opposed will vote no. And the clerk will unlock the machines and call the roll. Alexander Haneloets, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce Burns, Carpenter, Carson, Chokus, Clark, Collins, Cooper, Corbett, Dempsey, Dickey, Dollar, Drenner, Dubnick, Abstration, England, Irwin Fleming, Frye, Gaines, Gardiner, Glanton, Graveli, Harold, Hatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, LaRickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Bayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hilton, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennard, Lopez Romero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, Moore B, Moore C, Morris M, Nelson, when, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, Turner, Wollensky, Williams M, F, Williams N, Wilson, Beasley T, Bonner, Fuckner, Yes, Verchette, Yes, Calwell, Yes, Campbell, Yes, Cantrell, Dickerson, Dukes, Dukes, Yes, Campbell, Yes, Gillard, Yes, Gordon, Yes, Green, Yes, Gollett, Yes, Jones J, B, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Metz, Yes, Momp-to-Hon, Yes, Park, Yes, Pruitt, Yes, Rogers, Singleton, Yes, Stovall, Yes, Williams R, Yes, Far, Baysmore, Beasley T, Beverly, Chokus, Clark H, Corbett, Davis, Dempsey, Dollar, Douglas, Frazier, Houston, Hutchinson, Jones J, Jones T, Jones V, Rhodes, Ridley, Rutledge, Scott, Silcox, Wilkerson, Yerda, Members will check the board to make sure that it is correct. The clerk will lock the machine on the passage of Senate Bill 337, the eyes are 142, the nasors 0. This bill having received the requisite constitutional majority is therefore passed. All right, here's what we're going to do. Listen up now, we're going to take a five minute break. Five minutes, we have not had a stretch break or bathroom break, but we're going to come back promptly and do take up a few other items. I don't plan on keeping you here too late tonight, but we have some business that we need to get done and hopefully we can get that done. If I get your cooperation to back in here in five minutes, that we can maybe have you out in about 30 or 45 minutes. We'll be in recess for five minutes. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you the way I feel the way I feel the way I feel The Chair recognizes the chair of the House Health and Human Services Committee, Chairman Cooper, for a motion. Thank you, Mr. Speaker. I move that the House agree to the Senate's substitute to House Bill 1114. Chairman Cooper has moved that this House agree to the Senate's substitute to House Bill 1114. Clerk will read the caption. House Bill 1114 to be entitled an act to amend Article 7 chapter 4, Title 49, the fiscal to Georgia and Antidio relating to medical assistance generally shows to provide for Medicaid coverage for lactation care and services in postpartum care. Chair recognizes Chairman Cooper to explain her motion. Thank you, Mr. Speaker. The Senate added that this would become effective upon appropriations. That's the only change they made. And I would like to thank all of our House members for your 161 vote when it left this chamber previously for looking and taking care of the needs and beginning to take care of the needs of our most vulnerable mothers who are at risk of losing their lives postpartum and for expanding lactation care to our Medicaid mothers. I would ask for your favorable vote for the substitute to House Bill 1114. Thank you. On the ladies' motion, at the House agreed in the Senate's substitute to House Bill 1114, all those in favor of the motion will vote aye. Those opposed will vote no and the clerk will unlock the machine and call the roll. Alexander Aneloid's bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Cody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Hulkum, Holmes, Houston, Hugley, Jackson M. Jasperus, Jones J. Kelly, Kendrick, Knight, Lehoud, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smirrey, Stevens R, Tancersley, Tanner, Tarvan, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill, Hogan, Holland, Holley, Thompson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McLean, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, Wen, Paris, Prince, Pullin, RoboShow, Sinks, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Bonner, Yes, Buckner, Yes, Burchette, Carlwell, Campbell, Cantrell, Dickerson, Duke's, Yes, Gamel, Yes, Gileared, Yes, Gordon, Yes, Green, Yes, Gullet, Yes, Jones, Baby, Yes, Kirby, Yes, Lot, Yes, Mathis, Yes, Meets, Yes, Mom Tahan, Yes, Mark, Yes, Prood, Rogers, Singleton, Stovall, Yes, Williams R, Yes, Beesley T, Blackman, Corbett, Dempsey, Dollar, Evans, Gaines, Graveli, Henson, Hitchens, Jones V, Kelly, More C, Newton, Perkel, Prueit, Ridley, Rogers, Setsler, Singleton, St. Yes, Yes, Members, while you're looking at the board to be sure it's correct, we had a couple of parliamentary inquiries, what purpose does Representative LeHood rise? He waves, what purpose does Representative Abel Mabel Thomas rise? Parliamentary inquiry. State your inquiry. Is it not true that this bill is a bill that all members need to be a part of based upon this problem of challenge that we solve in the state of Georgia we like to thank so many members for their support, Sharon Cooper, Renita Hall, Shannon Kellan, Larshon, Valencia Carolyn Hugley, and so many of them that I don't have the name to say. If the lady so states. Further parliamentary inquiry. State your inquiry. Is it not further true that all we want now is for the funding to be increased around that line item and we are grateful that this body put 19.7 million in and we'd like to when our referees go to fight for the budget that they fight for maternal mortality. Is that not true? I think they are fighting for maternal mortality. Thank you so much, Mr. Speaker. All right, all members of the examin' the board to make sure it's correct. Clerk will lock the machine on the lady's motion. The eyes are 144. The nasors zero in this house has agreed to the Senate substitute to House Bill 1114. Chair recognizes Chairman Cooper for a motion. Thank you, Mr. Speaker. I move that the House agree to the Senate substitute to House Bill 987. Chairman Cooper has moved that this House agree to the Senate substitute to House Bill 987. The clerk will read the caption. House Bill 987 to be entitled to amend Title 31 of the EFJ to Georgia annotated relating to health so it's to provide additional measures for the protection of elderly persons. Chair recognizes Chairman Cooper to explain her motion. Thank you, Mr. Speaker. The Senate made several changes to the bill. The first one would be we had put in that new employees in order to cut down on their losing so many employees so quickly that within seven days they had to have four hours of education on the basic facts about Alzheimer's. The Senate moved that to 30 days. The Senate also on staffing ratios made some changes. In the memory care units, they went for it. It's 12 during the daytime. It was 12 at night when he left his chamber. They put it to 15 at night. There has been some mention in the press that the bill was slightly weakened over there, but I would tell this chamber that there's a little caveat in this bill that says when they are inspected and held to state standards. It really, the staffing ratios are important, but they have to meet the needs of their patients. And if the needs of their patients are not met, it doesn't matter if they're even meeting the staffing ratios. They will be held accountable. The other thing it did to where they could average on a monthly basis. It is true that in nursing homes and in assisted living, you do have elderly residents. And that you may have 12 in a memory unit one day. And the next day you may have 10 or you could have had two new people and had 12 or 13. So they are able to have an average of meeting staffing ratios. However, that does mean if you're going to meet an average, that you're going to have to have a lot of days that were over the staffing ratio to make it come out all right. So there is a safety net in that. The other changes is that the Senate added a great deal of information of things that we have learned from this pandemic. And they have added in to prevent future problems with pandemics. And to be better prepared, they have added some caveats on an information on correct cleaning procedures, on having seven days of protective equipment available to meet the needs of their patients. They are available to meet the needs of their residents depending on how large they are in letting families know if they have people of that are infected. Those are the changes. I would ask this body to vote yes to the Senate substitute. I would ask this body to be a member of the Senate. I would ask this body to be a member of the Senate substitute. Because we are going to be a leader in this country on staffing ratios and taking care of our elderly and assisted living facilities. And also in meeting future problems and being prepared for pandemics in these facilities and it covers nursing homes in that part also. Thank you, Mr. Speaker. I yield. I will yield for questions if there are any. I have a question if you care to yield. Yes, sir. Chair recognizes representative LaHood to your left for a question. Is my friend in the well yield. I will yield. Is it not true that in your just over 30,000 residents residing in assisted living communities in personal care homes. They deserve to aid with grace and dignity. That is so true representing. And is it further not true that you work extensively for months with stakeholders across the spectrum on this bill to ensure a balanced policy with the outcome and that Georgia is going to be a great place, a better place to grow over the cost of this bill. That is true, but I've had a lot of help from my friend that is asking those questions right now and I am so appreciative for that. Thank you very much. Thank you to the members. I yield. Well, Mr. Speaker and ask for a favorable vote. Thank you. On the ladies' motion that this House agreed to the city substitute House bill 987. All those in favor will vote aye. Those opposed will vote no and the clerk will unlock the machines and call the roll. Alexander and all of us bar Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackmond, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper. Corbett, Dempsey, Dickie, Dollar. Drenner, Dubnic, Abstration, England, Irwin, Fleming, Frye, Gaines, Gardner, Glanton, Grabley, Herald, Hatchet, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LeHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yurda, Allen, Baysmore, Bernard, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Duna Hoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin,\n\nMcClan, McClaurin, McCloud, Meeks, Mitchell, Morby, Morse, Morris M. Nelson, when Paris, Prince, Pullen, Robachot, St. Scofield, Scott, Shannon, Sharper, Smith M., Thomas A.M., Turner, Wollensky, Wilkerson, Williams M.F., Williams N., Wilson, Beasley Tee, B.C.T., Bonner, Buckner, Yes, Richette, Calwell, Camille, Yes, Cantrell, Dickerson, Duke's, Yes, Galeard, Yes, Gordon, Yes, Yes, Jones, J.B., Yes, Kirby, Yes, Mathis, Yes, Metz, Yes, Mab Tahan, Yes, Park, Yes, Prood, Yes, Rogers, Singleton, Yes, Stovall, Yes, Williams R, Yes, Carpenter, Yes, Turner, Dollar, Gamble, Jackson D, Jones T, Ridley, Rogers, Workhizer, Williamson, Turner's will look at the board and make sure it's accurate. Clerk will lock the machines on the ladies' motion at the House agreed to the Senate substitute to Houseville 987, the eyes are 140, the nays are zero and this House has agreed to the Senate substitute. Chair recognizes Chairman Newton for a motion. Thank you, Mr. Speaker. I move that this House agreed to the Senate substitute for Houseville 789. Chair, Mr. Chairman Newton has moved that this House agreed to the Senate substitute Houseville 789, the clerk will read the caption. Houseville 789, to be entitled an act to amend 20C of Title 33, the Fisher go to Georgia annotated relating an accurate provider directories. Chair recognizes Chairman Newton to explain his motion. Thank you, Mr. Speaker. This House has made important progress in surprise medical billing and protecting Georgians from those. This current bill 789 just adds to the current hospital disclosure about in-network status of hospitals to tell them about the physician's specialties that are hospital based, that are a source of surprise medical bills that we're trying to correct. The Senate simply changed one item in that. Some hospitals don't have an emergency room or don't have an operating room. An example would be Shepherd's Spinal Hospital. It's an important hospital. They didn't want to have to have a red X show an absence of an in-network provider when they don't even offer the service. The Senate changed that to a green not applicable or an NA. Hope this House will continue to make progress for Georgia families on surprise medical bills, spending thousands of dollars a year for health insurance. This simply lets them know what's included in their plan and what's not. We'd be glad to yield for any questions if there are any. You do not appear to have any questions. Thank you, Mr. Speaker. I yield the vote. On the gentleman's motion that this House agreed to the Senate substitute to hospital 789, all those in favor of the motion will vote I. Those opposed will vote no and the clerk will unlock the machines. The Senate is now in favor of the motion. The Senate is now in favor of the motion. Alexander Aneloets, Bar, Barton, Belt and Bennett, Bentley, Benton, Beverly, Blackman, Bodie, Bruce, Burns, Carpenter, Carson, Chocus, Clark H. Cole, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Eftration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Grabley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petri, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Bayesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahue, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kenner, Lopez Romero, Marin, McLean, McClaurron, MacLeod, Meeks Mitchell, Moore B, Moore C, Morris M, Nelson, when Paris, Prince, Pauline, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Wollensky, Wilkerson, Williams M, F, Williams N, Wilson, Beasley T, Yes, Bonner, Yes, Buckner, Barchett, Calwell, Campbell, Yes, Cantrell, Dickerson, Duke's, Yes, Campbell, Gillier, Gordon, Yes, Green, Yes, Jones J, Yes, Kirby, Yes, Yes, Mathis, Meets, Yes, Mop Tahan, Park, Yes, Yes, Rogers, Singleton, Yes, Williams R, Yes, Bode, Dollar, Dubnic, Dune, Gamble, Holly, Thompson, Jones T, Jones V, Mathis, Ridley, Yes, Robo Show, Members will look at the board and make sure it is consistent with your intended vote. McClaurron will lock the machine on the gentleman's motion that this House agreed to the Senate substitute to House Bill 789, the I's are 140, the Nays are zero, and this House has agreed to the Senate substitute to House Bill 789. The chair recognizes representative Gaines for a motion. Thank you, Mr. Speaker. I move that the House disagree to the Senate substitute to House Bill 1094. The clerk will read the caption. House Bill 1094 to be entitled back to a man article on the chapter 20 and title 45 of the EF to the Georgia annotated relating the general provisions regarding personnel administration. Chair recognizes representative Gaines to explain his motion. Thank you, Mr. Speaker. And March the House passed 164 to 1, ensuring paid parental leave for all state employees including over $146,000 state employees. Again, 164 to 1, this is a priority of the House. And so I hope that by us disagreeing the Senate will consider receding from its position and let's get this done for our state employees including educators and teachers across this state. On the gentleman's motion that this House disagree to the Senate substitute to House Bill 1094, is there any objection? Do you object? Yes. Do you object? Mr. Speaker, we don't have a copy of this in our note books or in our folders. They are on the table outside. We'll take a couple of minutes for you to go get it and look at it. Thank you. While I could have your attention please, while everybody is getting a copy of the document, I think I had to do this yesterday. I'm going to do it again today. All members while they are in session on the floor in the gallery or in 341 unless you are speaking are required to wear a mask. It's kind of late in the afternoon. They kind of start falling off people's faces. I notice it around here. But please be mindful of that. Be mindful of it tomorrow. While you're getting that copy, let me kind of give you some guidance for tomorrow. There will be copies placed in the morning of all of the matters that we will be taking up on the tables outside the chamber and outside the gallery and outside 341. So those will be available for you to get earlier and be reading them before we get to them. I guess we will continue to explain what the words are. What's the object to what? Okay, as everyone now have a copy of the document, you are not agreeing. You are disagreeing which will send it back to the Senate for further action. So the chair will restate the question on the gentleman's motion at the House disagree to the Senate substitute House Bill 1094. Is there any objection? You object? Yes, Mr. Figuire, I object. If we are going to cut our pay, the whip encouraged me. I say goes for 11 instead of 10, Mr. Speaker. I think that issue has already been handled, hasn't it? This is dealing with paid parental leave. Yes, Mr. Speaker, but the Senate has taken the lead in cutting it by 11% and I feel compelled based on what I heard from the whip that we need to sacrifice. We need to sacrifice big. So I would like to go ahead and take the 11% pay cut. So I do object. Well, why didn't you bring that up when we were debating the pay cut? I had a chance to think about it and the whip's wife. Well, I want to ruin you out of order. And because I think the time to have been heard on that was when we were taking up the pay cut measure earlier. What purpose does Chairman Knight rise? Parliamentary inquiries. State your inquiry. I just heard the gentleman's motion to object to this. That would mean that this body would not be taking up the bill that would give the leave to our state workers. Is that correct? That's correct. That would be the effect of his motion. Thank you, Mr. Speaker. I just want to make sure we got that crystal clear. Do you still object? I want to be fair here. We're going to put it on the board if you still object. And I'm not going to wait all night for you to make your mind up. All right. I will remove my objections. I'm sorry. I will remove my objection, Mr. Speaker. Thank you very much. So is I'll ask one more time. Is there any objection? The chair hears none. The House, this House has disagreed to the Senate substitute to House Bill 1094. All right. We've got for supplemental first readers. Senate Bill 508. I set out a strictly with 17th Anniston. The 24th to be titled an act to amend an act creating a state court of Rockdale County. Senate Bill 518 by Senator Strickland of the 17th and Jones of the 10th to be entitled an act to authorize the assessment and collection of a technology fee by the Magistrate Court of Henry County. The Antireg governmental coordination Senate Bill 527 by Senator Harborson of the 15th to be titled an act to authorize the governing authority, the unified government of Cousetta Chattahoochi County to love in excise, tax, pursuit, subsection B of Code Section 481351. The Antireg governmental coordination Senate Bill 531 by Senator Orok of the 36th, Jordan of the 6th and Tate of the 38th to be entitled an act to provide for a new homestead exemption from the city of Atlanta at the Lorient taxes. The Antireg governmental coordination. And 7th Senate Bill 533 by Senator Kennedy 18th, be titled an act to amend an act providing a new charter for the city of Fort Valley. The Antireg governmental coordination. The Antireg governmental coordination. We have a supplemental local calendar, third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. House Bill 922 by Substitute by Representative Carpenter IV, Whitfield County. Is there any objection to the previous question being ordered on the supplemental local calendar? The chair here is none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none, the report of the committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Alexander Anullowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman, Bowdie, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey, Dickie, Dollar, Drenner, Dubnic, Efstration, England, Irwin, Fleming, Fry, Gaines, Gardner, Glanton, Graveli, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes, Hauston, Hugley, Jackson M, Jasper's, Jones J, Kelly, Kendrick, Knight, LaHood, Larickia, Lomston, Martin, Matthew, McCall, Morris G, Newton, Nick's, Oliver, Parrish, Parsons, Petrie, Perkel, Powell, Reeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stephens R, Tankersley, Tanner, Tarvin, Taylor, Thomas E, Tramble, Washburn, Watson, Welch, Workhizer, Weed Hour, Williams A, Williamson, Yerda, Allen, Beesmore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler, Hanson, Hill, Hogan, Holland, Holly, Hopson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez Romero, Marin, McClain, McLaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson, Wynn, Paris, Prince, Pullen, Robo Show, Saints, Scofield, Scott, Shannon, Sharper, Smith M, Thomas A, M, Turner, Walensky, Wilkerson, Williams M, F, Williams N, Wilson, Beesley T, Yes, Fawner, Buckner, Birchette, Calwell, Kamble, Cantrell, Dickerson, Duke's, Gamble, Gilliard, Gord, Yes, Green, Yes, Gullet, Yes, Jones J, Kirby, Yes, Lot, Yes, Mathis, Meets, Yes, Mopthahan, Park, Yes, Prue, Yes, Rogers, Singleton, Stovall, Williams R, Yes, Alan, Corbett, Henson, Holland, Jones J, Jones T, Jones V, Charlomston, Paris, Rich, Ridley, Risgoggins, Silcox, Smith M, Smyrie, Washburn, Wash. Who, someone to try and to be recognized? What purpose is representative Carter rise? Parliamentary inquiry. I think it's a, it's a not true. There are two local calendars on the table.\n\nhas Brookhaven. If there are additional local bills that we're voting on, we do not have it. Is that not true? Okay. The one that has Brookhaven is owned for in a green disagree, which we will not take up until tomorrow. The Whitfield County is on the supplemental calendar, and that's what you're voting on now. That helped you out. Yes, sir. Please correct my vote. It's a yes. All right. Members will please look at the board. Clerk will lock the machine on the supplemental local calendar, the eyes are 134, the nasors 0. This bill having received the requisite constitutional majority is therefore passed. Please help me wish a happy birthday today. I know he was here a short time ago. I'm not sure if he still is to representative or chairman Jesse Petrie. Chairman Petrie. We have, if you've signed up for an announcement, we have a couple of announcements. Chair recognizes chairman Beverly for an announcement. Thank you, Speaker. The Georgia House Democratic Caucus will have a meeting tomorrow 830 AM on Zoom, 830 AM tomorrow morning. Georgia House Democratic Caucus. Thank you. Chair recognizes chairman Hatchett for an announcement. Thank you, Mr. Speaker. The majority caucus for your planning purposes will be meeting tomorrow at lunch break, and we will have lunch. We're going to be meeting in the in the Floyd room in the Twin Towers at our lunch break tomorrow. Chair recognizes chairman Fleming for an announcement. Thank you, Mr. Speaker. Due to the lateness of the hour, the House judiciary committee scheduled upon the adjournment will not meet tonight. It will be counsel. Thank you. Okay, Senate Bill 321 will be postponed to the next legislative day. Senate Bill 318 will be postponed to the next legislative day. Senate Bill 340 will be postponed to the next legislative day. So 489 will be postponed to the next legislative day. Senate Bill 410 will be postponed to the next legislative day. Chair recognizes the majority leader of the House for a motion. Mr. Speaker, thank you. Mr. Speaker, I move that this House stand adjourned until 10 a.m. Thursday, June 25th, 25th. Chair recognizes the majority leader of the House for a motion. Mr. Speaker, thank you. Mr. Speaker, I move that this House stand adjourned until 10 a.m. Thursday, June 25th, 2020. The majority leader has moved that this House be adjourned until 10 a.m. on Thursday, June 25th. All those in favor of the motion will say aye. Those opposed will say no. I believe the eyes have it. This House will be adjourned until Thursday at 10 a.m.",
  "updated_at": "2026-02-13T12:25:17.270419+00:00"
}