{
  "video_id": "7Fysv8lhZXs",
  "url": "https://www.youtube.com/watch?v=7Fysv8lhZXs",
  "title": "Lawmakers Day 30 03/11/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 30,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 30 03/11/25 session:\n\n**Overview:**\nThe Georgia House of Representatives passed the FY 2026 budget (HB 68), which includes an additional $500 million in education spending and $250 million more for the state's prison system. The session also featured recognitions, including celebrating a member's last radiation treatment and honoring the 50th anniversary of the Shepherd Center.\n\n**Key Actions:**\n**HB 68:** Fiscal year 2026 budget, passed 171-4. Includes $500 million more in education spending and $250 million more for the prison system.\n**HB 287:** Updated DNR fishing and hunting license regulations, passed unanimously.\n**HR 97 and HR 98:** Regulate sale and leasing of state property and non-exclusive easements, passed unanimously.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Member celebrated last radiation treatment for cancer.\n- House recognized 50th anniversary of Shepherd Center, which treats brain and spinal cord injuries.\n- Senate recognized Georgia lineworkers and named an interchange after a slain Roswell police officer.\n\n**Votes:**\n- HB 68 (budget): Passed 171-4.\n- HB 287, HR 97, HR 98: Passed unanimously.\n\n**Attendance:** Quorum present, no issues noted.\n\n**Adjournment:** Session ended for the day, with no floor activities planned for the next day. Both chambers to return on Thursday.",
  "transcript": "This is also very much an education budget. The house version of the HB68 includes an additional\nhalf a billion dollars in education spending\nfor the FY 20 over the FY 215 original budget.\nYou know, let that wash over you for a minute.\nHalf a billion dollars more in education.\nThe House passed HB 68, the fiscal year 2026 budget\nin their version education and the state's prison system\nare the big winners.\nNow it's the Senate's turn to insert their budget priorities.\nGood evening and welcome to lawmakers on day 30\nof the legislative session.\nI'm Donald Aurean Atlanta.\nTen more days for the Georgia General Assembly.\nAnd with the House passing the budget,\nthe legislature chooses and crosses a major hurdle.\nThe Department of Behavioral Health\nand Developmental Disabilities is one of the agencies\ngetting a boost in the House funding package.\nI sat down with DBHDD Commissioner Kevin Tanner\ndiscuss the needs of his agency, including what keeps him up at night and how he's able\nto see his staff create miracles.\nAlso in the studio, two legislators dedicated to helping those in need will talk about\nlegislation and more.\nOne of them had staff in Barrow County near Appalachia High School during the shootings\nlast September and will tell us how they helped before during and after the tragedy.\nWe began with a report on what took place at the Capitol today with correspondent Sarah\ncallus. Donna it was a late start for the house today but by early afternoon they\nhad fulfilled their most important duty. The house took up the only bill they\nare constitutionally required to pass each session. The budget for the\nupcoming fiscal year. The budget is smaller than the amended budget for the\ncurrent fiscal year because it does not include as many one-time surplus\ninvestments. Things are tight. Many of you have asked for funding for your\ncommunities or asked us to support programs and initiatives within state agencies. I wish\nwe could address them all or go further than we did, but we can't. The needs are great\nand there are many worthy causes competing for the same limited resources.\nThe budget, or HB68, applies to the fiscal year that starts in July and includes $250\nmillion more funding for the state's prison system from last year.\nto the funding and the corrections FY26 budget\nis an annualization of the needs we recognized\nin the amended budget, including funding to hire more\nthan 700 correctional officers to lower staffing ratios\nand improve bed capacity so that the department\ncan implement life, safety, and security projects.\nThis budget also recognizes that salary enhancements\nare working to attract and retain staff\nthe prison system and it includes additional salary increases to keep our\nfoot on the gas and adds more money to the governor's recommendation for\neducation. This is also very much an education budget. The House version of\nHB68 includes an additional half a billion dollars in education spending for\nthe FY-20 over the FY-20 with five original budgets.\nYou all let that wash over you for a minute.\nHalf a billion dollars more in education.\nIncluding a new program to address student mental health.\nThe addition comes after a deadly shooting\nat Appalachia High School last fall.\nIt has become abundantly clear that school safety\nand student mental health go hand in hand.\nThat's why I'm excited to announce a new program created\nin the House budget in the Department of Education\ncalled Student Support Services.\nThis $62 million program is an umbrella of services,\nif you will, that's designed to cover the needs\nof the whole child.\nIt's a collection of ideas and long time requests\nmany of you are likely familiar with that support\nour students in ways that the QBE formula can't.\nthis need program provides $20 million in mental health grant funding for\nmiddle schools and high schools. The budget passed 171 to 4 and was immediately\ntransmitted to the Senate. Also today, the House celebrated an important\nmilestone for one member. Today is the day that the Lord has made and I will\nrejoice and be glad in it because I'm getting ready to ring the bell ring\nthe bell, ring the bell. My last radiation day. My last radiation. Thank you. Thank you.\nNow I could not have done it without all of you. Thank you so very much Mr. Speaker, all\nof you. I love you from the death of my heart. Thank you.\nAnd recognize the Shepard Center's 50th anniversary. The Shepard Center treats brain and spinal\ncourt injuries. The cause is\npersonal to House members as\nspeaker the House chief of\nstaff Terry England is\nrecovering from a spinal\ncourt injury with the help of\nthe Shepherd Center. The Senate\nstarted their session with a\nresolution recognizing today as\nGeorgia lineman day at the\nCapitol, as the state continues\nto recover from damage done by\nHurricane Helene, the men who\nstring and repair power lines\nreceived the special recognition.\nThese guys and ladies really are\nthe backbone of our energy\ninfrastructure. They braid the storms, the flooding, dangerous temperature, long nights to ensure\nthat our homes are lit, that we're kept safe and warm in those most darkest of hours.\nThey also remembered slaying Roswell Police Officer, Jeremy Labonti, who was killed last month\nwhile responding to a suspicious person call at a shopping center. An interchange at state route\n400 and Holcomb Bridge Road in Roswell was named after Labonti in Memoriam,\nand the family was presented with a flag today that was flown over the capital.\nFor everyone who has ever served as a first responder or in the military,\nplease join me in suiting this family. God bless you. Thank you.\nThe Senate then got down to business as they quickly passed two house resolutions and a bill.\nHB 287 dealt with updating DNR fishing and hunting license regulations.\nDNR has purchased right at 20 wheelchairs that's on tracks. So any person is paralyzed\nin state of Georgia does not have to have does not have to buy a hunting of fishing license\nand also anyone that's outside of the state can also get hunting and fishing license for free.\nHouse resolution 97 and 98 regulate the sale and leasing of state property and non-exclusive\neasements in dozens of counties throughout the state. All the legislation was passed unanimously.\nThey then stood in recess until the House sent over the budget, assigned it to the\nthe Appropriations Committee and gabbled out for the day.\nNo floor activities are planned for tomorrow as committee work will be the top priority.\nBoth chambers will be back in session on Thursday.\nThat's my Capitol report, Donna.\nThanks, Sarah.\nWe're going to spend the show focusing on some of Georgia's most vulnerable citizens and\nthe state agency working to make a difference in their lives.\nThe Georgia Department of Behavioral Health and Developmental Disabilities, DBHDD.\nI sat down with the man who heads DBHDD, Commissioner Kevin Tanner.\nWe talked about a range of topics from ways to boost a workforce that shrank during the\npandemic to how the agency is looking to add more beds for people in crisis.\nBut we began with the agency's role in forensic services.\nDBHDD receives court orders to determine if a person is competent to stand trial or can\naccept criminal responsibility under an insanity defense.\nUnder the code, we're responsible for the restoration work and what that means is if someone's\nbeen charged with a crime and their defense attorney or their family or the prosecutor brings\nto the judge and says, you know, I think that my client may have not be competent.\nThey may not be able to help me participate in their criminal defense because of a mental\nillness.\nThe judge can sign an order that would require our agency to have a licensed clinical psychologist\nto PhD level psychologist do an evaluation.\nIf after doing that evaluation is determined that the person is indeed not competent, then\nthe psychologist will make a determination on whether they believe the person is restorable.\nIf they believe the person is restorable, they're saying in their professional medical\nopinion that the person could be with treatment restored to\ncompetency and then typically what happens that reports given to\nthe judge the court and then the judge will typically issue\nanother order that says your order to go to the state to DBHDD\nour agency for to be restored to competency and once that\nhappens they go on a wait list and we bring them to one of our\nhospitals and when that happens you also don't have enough\nbeds for all of that for everybody who may need that help. Talk about that a little bit.\nYeah, that's one people often ask me what keeps me up at night in this role and that's definitely\nit and it's because we have almost 800 individuals in jail today waiting on a state hospital bed\nand it takes on average over a year now for a mail to come into the state hospital system once\nwe receive the order. Now they could have been in jail for some time waiting on the evaluation\nand then sometime waiting on the order,\nbut once we received it, it's taking a year or more.\nWe only have an entire state of Georgia.\nWe only have 641 forensic beds.\nNow, 60% roughly of those beds\nhave people who have been ordered to us\nnot guilty by reason of insanity.\nAnd what that is, that's different than not being competent.\nThat's someone who's been charged with a crime.\nIt's often a serious crime,\nand the court has made the determination.\nAnd this person's not guilty because they have such a severe illness, such a severe mental\nillness, they don't know the difference between right and wrong.\nAnd they're ordered by the court to come to us.\nThe average length of stay for that population is six years.\nWe have people who've been with us for 20 plus years at the state hospital.\nSo I only have about 300 beds in the entire state for restoration services, and I have\n800 people waiting on one of those beds.\nI want to talk a little bit about your making crisis\nstabilization and diagnostic center.\nThat's a project that I'm extremely excited about.\nIt's really getting a lot of national attention.\nSo we are also responsible for the intellectual\ndevelopmental disability population.\nAnd we run the now comp waiver services\nthrough the Medicaid waiver program.\nBut we have certain individuals who\nare what we call hard to place.\nThey end up being stuck in an emergency room.\nThey may have co-occurring IDD behavioral health illness,\nthey may have a behavioral issue,\nthey may have a physical element,\nbut for whatever reason,\nthey end up finding themselves in an emergency room.\nWe have a challenging time,\nsometimes finding a provider that will take the individual.\nSo we have, I've challenged our team and our staff\nand with the support of the General Assembly\nand the governor, we've identified some long-term solutions.\nOne of those is the facility that you just mentioned,\nAnd it will be a 16-bed, inpatient,\ncross-estabilization facility for the IDD population.\nIt will have physical health, mental health,\ndoctors who are experts in treating an individual with IDD.\nIt'll also have things like OB-GYN, dermatology.\nWhatever service is the individual may need,\nthey'll come there.\nSo they're stuck in an emergency room.\nWe'll bring them to this facility.\nThey'll be stabilized.\nand then they'll be able to step down\ninto a community-based service.\nThe other thing I'm really excited about at this facility,\nthough, is going to have a very robust outpatient component.\nAnd we're contracting with Mercer Medical School.\nAnd Mercer Medical School is going to run the outpatient\ncomponent.\nAnd why that's exciting is they're\ngoing to bring their docs who are in training\nthrough this outpatient center.\nThey're going to train those doctors.\nSo as they go out and rule parts, especially of the state,\nThey're going to know how to take care of sometimes\nthis challenging population to care for medically.\nSo it's a game changer for our system.\nAnd that's fully funded in the budget.\nAnd that should open toward the end of May of this year.\nIt's under construction now.\nThe other thing that we identified\nis we're going to have to have good places\nto step those individuals down into community settings.\nSo we've opened two pilot homes over in the Augusta area.\nThere are four beds each.\nAnd we have reduced the number of people in a hospital\nabout over 33% in the last year.\nWe're also in the process of doing two additional homes\nin Macon, and the other thing that is exciting\nis we sent up a proposal to CMS,\nwhich is the Federal Medicaid Agency,\nand they've approved three types of placements\nthat we haven't had before,\nthat's more intense for the hard-to-place individual,\nand we're in the process of building out that network.\nSo my prediction is, in the next two years,\nby the end of the next two years,\nwe'll have no one stuck in an emergency room waiting on a bed.\nWe're going to have a system in place\nto take care of that population.\nQuite a large workforce, but I know that there are some vacancies\nyou'd like to see filled by qualified people.\nWe operate five state hospitals.\nAnd during COVID, we lost over 1,200 employees\nto that left the workforce and went somewhere else for higher pay.\nAgain, thanks to the governor and the general assembly\nand some targeted pay increases\nand some across the board, state employee pay increases.\nWe've been able to start, turn the tide on that.\nWe've brought back a lot of individuals and started,\nwe also have a department within our agency\nthat is laser focused on recruitment and retention.\nThe O-Carter does a tremendous job\nleading that effort for us and it's making a difference.\nWe also have a large number of partnerships\nthat we have forged with universities and technical schools\nto help turn out folks.\nI'm going to be having dinner with one\nof our university presidents here in a couple of weeks.\nAnd we're working closely with them\nto try to create a PhD-level psychology program\nfor someone who's actually working in the field today.\nThe only way I have 50 people that work for me who's\ninterested in getting a PhD to have a master level\npsychology degree, their master level psychologist.\nBut in order for them to be able to do the evaluations\nwe talked about, to be able to test\nto find an expert in court,\nthey have to be a PhD level lesson psychologist.\nI have a 35% vacancy rate in that area.\nI have 50 people who would love to fill those roles.\nBut in order to get that education in Georgia,\nthey would have to quit their job and go to school full time.\nSo it's been done in some other areas around the state.\nIt's been done in the law enforcement space\nwith the Georgia Law Enforcement Command College.\nIt's been done with public administration\nand some other areas.\nSo we're having some serious conversations\nas an agency about how can we partner\nwith the university system to create cohorts\nin a pathway to help with the workforce.\nAnd I'm gonna be going to one of the medical schools soon\nto talk to their medical students\nabout number one, consider a field as a psychiatrist.\nConsider going into that.\nNumber two, consider the public sector.\nConsider coming to work for us, consider the state.\nI tell young people all the time that,\nI've got a staff of over 4,500 employees\nand a large budget and a lot of stress,\nand sometimes it can be challenging and frustrating,\nand because some of the problems are frustrating.\nBut all I have to do is pick a date\nand go to one of our hospitals, spend time with our staff,\nour nurses, our doctors, and our patients\nand to see the miracles that are being performed\nwithin the walls of our hospital every day,\nwhere they take an individual who is extremely sick,\nthat has a severe illness,\nthat may be in a place where they're very difficult\nto even just handle,\nbut get them to a place where they're,\nand I'm thinking about one in particular,\nwhere the lady had been in that case,\nhad been only unit by herself\nbecause of how challenging she was.\nAnd when I was there, she was out in the courtyard,\nreading a poem she had wrote about her recovery and her journey and she had\nhope because she was had found the right medication regimen. She had found\nthe right people to help her to be with her to walk with her and for the first\ntime probably in a long time she had hope restored to her. So if I can get\nyoung people to be able to see that side of what we do every day they get up\nand go to work every day making having miracles I think we'll be able to turn\nand the tide are staffing.\nYeah, my final question was going to be,\nwhat, you know, you came in in 2022,\nso in this period of time, you look back on all you've accomplished,\nit sounds like you just told me that answer,\nlike the things that make you feel really good\nabout what has happened since you've been\ncommissioner of this department.\nYeah, you know, when Governor Camp reached out to me\nand asked me about taking this role,\nI wasn't seeking the job,\nI wasn't looking for a job, but I called a person that I have great respect for and asked\nthem what they thought, and they said, you know, Kevin, only a few opportunities will\never come along in your life where you can truly make a difference.\nAnd when they come along, you have to take them.\nAnd so I took this role because I felt like that we needed to make a difference.\nAnd what I have found is we have a dedicated group of men and women across Georgia who\nor D.B.H.D., who are now filling and powered to be creative and to create change in the\nsystem, and their performance miracles every day.\nThe budget passed by the House today calls for more money for D.B.H.D., including to\nextend forensic services and to add a jail diversion program and outreach services for those\nwith severe mental illness.\nI want to thank Commissioner Tanner for talking to me.\nWell, coming up, more on behavioral and mental health\nlegislation from two house members\nwho are passionate about those issues.\nThey've dedicated their lives to helping others\nthrough life's challenges.\nThis is Lawmakers on GBB.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capitol during the session and year-round,\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen.\nI don't fear anyone.\nThis was a woman.\nPeople wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it.\nBy acknowledging our own worth.\nOh, please.\nDon't continue.\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nMUSIC\nUnderstanding the past gives a sense of the future\nThis is the first time that anyone has seen this in 2000 years\nThis is amazing\nPompeii is a battle against time\nYou think I'm joking, but look at this.\nIt really happened.\nDon't let anybody tell you who you are.\nHistory teaches us to honor the past.\nWhen you look back, they're like, wow, that was pretty special.\nThis is something that's actually altering the course of history.\nYou're charged with keeping these stories alive.\nWelcome back to Lawmakers, I'm Donna Lowry. We're going to continue the conversation\nabout the needs of Georgians covered under DBHDD. Joining me is Republican Representative\nKatie Dempsey of Rome. She chairs the Human Resources Subcommittee of Appropriations.\nShe also serves on the Georgia Behavioral Health Coordinating Council. Also here is Democratic\nRepresentative Shelley Hutchinson of Snellville.\nHer committees include Public and Community Health\nand Judiciary Juvenile.\nShe is a social worker and owns the Social Empowerment Center,\nwhich, among other things, provides mental health services\nfor adults, children, and families.\nWelcome to both of you, to all lawmakers.\nThank you.\nSo I want to start with your reactions to some of the things\nthat the Commissioner Tanner talked about.\nAnything that you want to bring out,\na little bit more about what that he talked about.\nYou know, I think the IDD work is so important that's happening and making.\nI was there for the groundbreaking, but I was also a part of the appropriations effort\nto add that.\nIt is the one and only in our nation that will be exactly like that.\nPeople with developmental disabilities and who have complex mental health issues too,\nit's a very hard population to care for.\nThey need very special care.\nYeah, he said that it's getting a lot of national attention, so I'm glad to hear that.\nWhat about for you?\nWell, I think the thing that I thought of most is the workforce.\nMental health is not an industry that the state is going to make money off of.\nSo we don't have the type of money we can pour into like a private entity like Hyundai\nor Rivian or something like that.\nSo we have to find the money to pay highly skilled people for a highly skilled population.\nIt's just, it's not always there as much as we want it to be, but it's so important because by not treating some of these illnesses, we see crime rates go up, we see divorce rates go up, we see children in foster care more often.\nSo it's something we have to do and we have to find the resources to do it and fortunately we did do some good work in the budget.\nAnd making it the job attractive in terms of paying them what they need. He said he lost a lot.\nthe private sector, that's true.\nThat is true.\nI know the other thing is the budget did,\nthere was money in the budget for that,\nfor a D.B.H.D., that's very much needed.\nThere is, but it's also, this is the first budget\nthat I can remember where so much money was spread throughout.\nPreviously, you've seen a lot of money in the D.B.H.D.B.H.D budget,\nbut actually, now it's an education to deal with many of the factors\nthat are going on there in our K through 12 schools.\nIt's in our jails and corrections.\nIt's in law enforcement, as well as D-B-H-D-D,\nand health, full-time, regular health\nthat we don't always think of as mental health,\nbecause that integration of services,\nthat's parity, and that's what we're all working toward.\nWe're gonna talk about your parity bill in a minute,\nso we're gonna talk a little bit about that.\nRepresentative Hutchison, I want you to tell us\nabout the Social Empowerment Center that you have,\nand then I want you to tell how your staff\nhelped at Appalachia High School during the crisis.\nSo I started the Social Empowerment Center 23 years ago.\nIt was just for me and a friend to do the work\nthat we loved in the community.\nBut 23 years later, we have a little over 100 employees.\nWe work in mostly Northeast Georgia.\nWe start in Gwinnett County.\nWe kind of spread out from Athens to banks\nto all the way back through Barrow and Hall\nand back to Gwinnett County.\nThat's kind of our region.\nAnd we've been integrated in that community for over 20 years.\nSo one of the things we do in Barrow County\nis we staff the schools there for mental health services.\nAnd that's where Appalachia is.\nYes, that's where Appalachia is.\nThe day of the shooting, we had staff,\nour staff travels to all the high schools in Barrow County.\nWe were addressing another emergency at Barrow Linder High School,\nwhich is close by, when the shooting happened.\nOur employees were locked in all of the schools in Barrow County\nbecause there was a threat throughout.\nThey were barricaded in their offices all day.\nAnd really, the kids' mental health is paramount.\nBut as the owner of the business,\nI have to think about my employees\nwho were barricaded in their offices all day.\nThey needed triage themselves.\nAnd of course, we do everything we can\nfor our employees and for our clients.\nBut we saw 80 families that day, the first day.\nthat was a Thursday and by the end of the weekend,\nwe saw almost 300.\nWow.\nAnd I think we had, in one week,\nwe probably had 300 new referrals for cases\nfor kids that witnessed some of the most horrific things\nthat I've heard as a supervisor or as a therapist.\nAnd those numbers have gone up.\nBecause what we're finding is we have kids\nthat maybe weren't in Barrow County,\nmaybe in High Room, Georgia.\nThey have a genuine, all the years I've worked with teenagers,\nI've heard every excuse why a child doesn't want to go to school.\nBut this was a really genuine fear from a lot of children\naround the state and the world really,\nthat they are, their fear of going to school\nis getting more severe and more real to them.\nBecause now you have neighbors who've experienced these things.\nSo we've been busy.\nI'm glad you were there and I hear that people are recognizing\nyour work, so I appreciate that.\nYes, we thank Barrow County Schools for recognizing the work that we did there.\nThat's good.\nI want to get to the bill we talked about a little bit earlier and that's HB612 and that's\nadding the behavioral health coordinating council adding to it.\nYou're already on it.\nWhat would you like added?\nI am and I think I've been on it for quite some time since it's inception but we have\nincrementally added different voices to that group and it is a great, it's a great sounding\nboard with the commissioner as well to have agency heads as well as advocates and consumers\non there. We added the insurance commissioner and that is going to be a step toward really\nensuring the parity that we are challenged with. Back in 22, we did pass the parity act\nand to understand that mental health is treated equally with physical health, that there\nThere are no different deductibles or copays or time limits to when you can seek services.\nThat is so important.\nSo there will also be a parity compliance panel added through this measure.\nAnd that's going to be a great way for us to continue to monitor that, to collect data,\nand to make sure that Georgians are actually receiving the best care.\nYeah.\nAnd that bill passed.\nYou had another one that passed out of the house, and that's 677.\nIt is.\nThat involves placement procedures for children discharged from a hospital or a psychiatric\nresidential facility.\nTell us about that.\nRight.\nWe're having a growing problem, not only in Georgia, but across the nation, particularly\nyoung, young people that are not in defects care necessarily, but they are in crisis.\nAnd after three to five days of crisis care, when it's time to leave the hospital, when\nthey are not medically needing services, someone has to be there.\nto pick them up, to take them home, to take them to where they should be, and to go into\nthe next steps of care. Well, at that discharge, often a parent or the guardian or the custodian\nis not willing to do it anymore. These are some of our hardest children. They are at the\nend of their rope. The parent is not giving up on the child necessarily, but cannot take\nthem back into a home environment where, perhaps, it'd be\ndangerous for the rest of the family members.\nSo we're trying to find a better way to deal with that.\nWell, you're feeling good about both of those in the\nSenate.\nI do.\nOK, then.\nWell, we'll keep up with that.\nWe'll hold home.\nYeah, thank you both for being here today.\nI know we've run out of time.\nThere's so much to talk with you both about.\nBut that does it today for lawmakers.\nWe'll return on Thursday when the Chambers\nGavilan for day 31.\nTomorrow is a committee day for the General Assembly.\nAnd on Thursday, among our topics, the AJC's best dress lawmakers of 2025 have a good night.\n",
  "updated_at": "2026-02-12T01:31:48.709282+00:00"
}