{
  "video_id": "7JZ7O7UMrG0",
  "url": "https://youtu.be/7JZ7O7UMrG0",
  "title": "Georgia House - Day 4 (2026-11-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-11-08",
  "duration_minutes": 28,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session began with the morning roll call and a prayer led by Pastor Steven Bird. No substantive legislation was discussed, but the transcript includes a personal anecdote about the pastor's experience attending a New Orleans Saints football game.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Pastor Steven Bird, invited by Representative Charles Blackman, delivered the opening prayer and shared a story about attending a New Orleans Saints game and trying to get the attention of quarterback Drew Brees.\n- The pastor contrasted his inability to get Brees' attention with God's willingness to always respond to and support his followers.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe transcript does not include information on when the session adjourned or the date of the next scheduled session.",
  "transcript": "You\nThe hour for convening having arrived, all members will please take their seats, all members\nof the Georgia House of Representatives will report to the chamber and take their seats\nUse the clerical ring the bell.\nYou\n.\n.\n.\n.\nAll right, we're about to have the morning roll call, we're about to have the morning\nroll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nWe have all members voted, have all members voted.\nIf so, the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nGood morning.\nHope everybody had a beautiful weekend.\nfor a productive week, hope.\nWe will begin our day-to-day with Scripture reading and prayer by the chaplain after which\nwe will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 146 House District,\nthe chairman of the House Ways and Means Committee,\nchairman Charles Blackman, chairman Blackman.\nThank you, Mr. Speaker.\nGood morning.\nIt is a honor to introduce my pastor today.\nPastor Stephen Mark Bird.\nHe is a pastor at Central Baptist Church\nin Warner Robbins, Georgia.\nHe's originally from Southern Louisiana\nand we were able to lure him away.\nand a tremendous blessing to our family, to our church,\nand to our whole community.\nSo without further ado, I'm excited to present to you\ntoday Pastor Steven Bird.\nWell, good morning.\nIt is an honor and a privilege to be here with you today.\nAnd I'm just so thankful for the opportunity.\nFirst of all, I am thankful to the speaker\nfor his gracious invitation to be a part of today.\nI'm also thankful for Saul Blackman\nand for your words, your remarks here,\nfor all your help in navigating today,\nbut even more than that,\nsimply for who he is and what he means to my family.\nI don't know of a more good and godly man.\nHe's a faithful servant, does a great job,\ntaking care of the people of our district,\nand brother, I'm just proud to call you my friend\nmy brother appreciate you very much. And to all of you, I do want to extend a very warm greeting\nfrom the people of Central Baptist Church in Warner Robbins, Georgia. Some of them knew that I\nwould be coming here today to speak to you and they asked that I would express to you their deepest\nappreciation for who you are and for all that you do for our great state. And I say it that way\nintentionally. As you heard, Shawl just shared just a moment ago, I'm originally from Louisiana,\nabout 14 and a half years ago I got a phone call from first Baptist Church of\nMabelton, Georgia in Cobb County and I came to be their pastor for six and a\nhalf years. They are wonderful people and then I got the call to go back to\nLouisiana but I want you to know as soon as I got back I realized the error of my\nways. I needed a very quickly repent and ask the Lord to return us back to the\nPromised Land here at Georgia and he was gracious to do that and I have been\nthe pastor at Central Baptist Church for the past five years and I mean that this is our adopted\nhome. We love this state, the people of this state and my children are bulldog fans now here in\nthis state and we just asked the Lord to leave us here that this would be our forever home. But\nhaving said all that, I still do have a little Louisiana in me and it actually gets worse than that.\nI was actually born and raised in New Orleans, Louisiana.\nI was born a mile from the Superdome, and that all is still in me.\nI love the people there, love the culture, love the food, the music, and you could probably\nsee where this is going.\nI also love the New Orleans Saints.\nI know.\nI know.\nThere's one.\nThere's one.\nI knew that was a dangerous statement to make here in these distinguished chambers in\ndowntown Atlanta.\nBut I figured after yesterday that it would be safe to do so.\nBut I think we would all agree that it is a fun rivalry.\nEvery time I get to be a part of that to go see it, I don't get to do that too often\non Sunday mornings, because while I'm preaching, but when they have that on a special night,\nwe always go, I wanted to tell you a quick story about that.\nA couple of years ago, they played on a Thursday, and I think it was Thanksgiving night, actually.\nAnd I went, I was invited from a dear friend from the church in Mabelton.\nWhen the stadium was built, he purchased seats, got the season tickets, all that, that\naffords him and he invited myself and my wife to come and to be a part of that.\nAnd it was, it was wonderful.\nIf you've ever done that, whereas seats are, there's actually a very nice restaurant behind\nwhere his season seats are.\nSo we got to get our seats, go eat.\nAnd it was just wonderful food, wonderful time of fellowship.\nAnd I didn't know what he had in store for me, he didn't tell me everything, but some\nof you might know what I'm talking about.\nYou sit in this restaurant and the back wall of it is actually plexiglass and it extends\ndown this long hallway there and I'm eating this wonderful meal and I almost choke on my\nmeal because all of a sudden I see my New Orleans Saints come walk down this hallway.\nAnd I had watched every game, you know, since I was a child.\nThis was a big deal.\nI didn't even speak to the folks at my table.\nI just got up and like just navigated to the Plexiglas.\nAnd I just stood there.\nIt was like a kid in a candy store.\nAnd I just watching these monstrous men come walking by.\nAnd I mean, it was just incredible.\nIt was almost too good to be true.\nIt was a great thrill to say the least.\nBut the best was still yet to come.\nBecause as I watched all of these Saints players walk by, they all process by.\nAnd then at the end of that, and this is absolutely amazing.\nThe best football player that has ever graced the grid iron, you know, I'm supposed to laugh\nat that, but I appreciate it.\nThe best football player ever drew breeze comes walking by, right?\nAnd so this is my moment.\nThis is my moment.\nAnd so I'm so excited.\nI can hear like a soundtrack playing behind, you know, I just, this is, it's amazing.\nSo he's walking up.\nI'm trying to get his attention.\nAnd then what I didn't realize in all this\nwas that my wife was actually videotaping me.\nSo it's a little embarrassing now,\nbut this actually is the record.\nSo right as he got to me, I just not even realizing\nit subconsciously put my hand up to the window like this.\nAnd I tried to get his attention.\nEverything I could do, I knocked right there on that glass,\ntrying to get his attention.\nAnd do you know what happened in that moment?\nabsolutely nothing. He did not flinch. He did not turn. He did not give me any time of\nday. He did not look at me at all. So obviously my heart was a little broken about that.\nBut after reflection, I think we all realize why. I mean, that's just the way it works.\nI mean, he's a celebrity, great athlete, all that stuff. We have this neutral relationship.\nHe doesn't know me. He doesn't owe me anything. Not a look, not a listen, not anything,\nwe get that. That's not surprising. But I share all of that to say this now to you.\nHere is the most surprising truth in the history of the world. That the greatest\nbeing, the greatest person to ever exist, our great God, He actually does the\nexact opposite for you and for me. That when we come to Him, He always stops. He\nalways pauses. He always inclines to us and he always meets us there. And that's\namazing in and of itself. What is even more amazing is that this is not a\nneutral relationship. I think we all understand that all of us have fallen\nshort of his glory. We've all rebelled. We've all sent against him. But in his\ngoodness, he doesn't give us what we deserve. What does he do? He gives us grace\nand mercy. He actually gives us himself through his son. And so it's absolutely\namazing to think about that and then it just continues because what we know is\nwhen we seek him he promises that as his children he continues to meet us\nthere whenever we're in need whatever that issue is whatever the situation he\ncontinues to come to us he continues to meet to us when we seek his face there's\na great passage that I want to share with you most of you will be familiar with\nthis is a very well-known couple of verses here in scripture it comes from the\nGospel of Matthew, Matthew chapter 7, verses 7 and 8, it says this, ask and it will be given\nto you seek and you will find knock and it will be open to you. For everyone who asks receives\nand the one who seeks finds and to the one who knocks, it will be opened. And then here is the rest\nof that paragraph there in scripture, it says this, or which one of you, if his son asks him for\nbread, will give him a stone, or if he asks for a fish, will give him a serpent. If you then\nwho are evil, know how to give good gifts to your children, how much more will your father\nwho is in heaven give good things to those who ask him, amen?\nSo I know you might be asking, why are you sharing that with me?\nHere's why.\nThis is my thoughts towards you here this morning.\nI cannot imagine the burden that you carry, the decisions that you have to make, all that\ntakes place in these chambers day in and day out.\nI can't imagine what you carry as our leaders.\nBut I do know this.\nI know our God and I know His promises.\nAnd I know He tells us that if we will see Him\nthat we'll find Him and that He will provide everything\nthat we need as we make those decisions,\nas you make those decisions, as you help to lead this state.\nAnd so I just wanted to share all that with you\nas an encouraging word.\nI want you to know God is with you.\nAnd the number two, I want you to know\nthat the people of this state we appreciate you\nand we are praying for you.\nand we are praying that as you seek him,\nhe will give you everything that you need\nand we can trust in that.\nAs a matter of fact, that's what I wanna pray over you now.\nLet me invite us all to stand, please,\nand let me just pray over us.\nFather, I thank you this morning that you are a good\nand gracious God that you love us and know us\nand that you have made away through your Son\nso that we can know and love you.\nAnd Lord, I am also thankful for the men and women\nin this room.\nI am thankful for their heart to serve\nand for their tireless efforts on our behalf,\nstrengthen them with wisdom and grace\nfor the burdens they carry.\nMay they manage their teams and projects\nwith diligence and care.\nKeep their hearts pure and their eyes\nturn toward your face as they work\nin the best interest of the people of this great state.\nAnd we ask all of this for our good,\nand as always for your glory,\nand all of it in the precious name of Jesus.\nAmen.\nAmen.\nYou know, join me in the pledge.\nof the United States of America, and to the Republic for which it stands, on Eurasian\nmedia visible with liberty and justice for all.\nThank you so much.\nGood job, Trill.\nGood job.\nThank you.\nThank you very much, thank you very much, thank you very much, I'm good, I'm good, I got you behind me, hold it and get with my back.\nChair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nChairman Hogan, the chair.\nMr. Speaker. I'm sorry I'd cut you off before the furthermore. As government\nexpands liberty contracts, Ronald Reagan. Excellent, excellent words. Chairman Hogan,\nthe chair of the Committee on Information and Audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nis there any objection to the confirmation of the journal, the chair here's\nnone and the journal is confirmed, the clerk will read the resolution\nestablishing the order of business for the day. Mr. Burns on the 59th moves\nfollowed me establishes the order of business during the first part of the\nperiod unanimous consensus introduction of bills and resolutions, second\nreading of bills and resolutions, morning orders. Is there any objection to the\nadoption of the resolution, establishing the order of business for the day.\nThe chair here's none and the resolution is adopted.\nThere are no first readers today.\nSecond reading of bills and resolutions, a clerk will read.\nHouse Bill 6EX by represent Blumson of the 12th, the bill to create the\nChateau Good County Public Facilities Authority, House Resolution 3EX by represent\nthe second lot of the 120 second LaReccia of the 169th Resolution Redifying Governor Brian P. Kim's Executive Orders,\n3 second readers.\nThere are no reports of standing committees.\nWe're going on now to morning orders.\nChair is going to ask all members of the House to please be seated and give respect to the members in the well.\nChair will allocate three minutes each to the morning orders today.\nChair recognizes for a morning order, Chairman Dickey,\nChairman Heath Clark, Chairman Blackman, and Representative\nNoelle Williams.\nThank you, Mr. Speaker.\nI'd like for us to stand and honor a good friend of mine\nand a friend of many in this chamber,\nformer State Senator Ross Towson from Perry,\nwho passed away this weekend.\nHe served in the Senate from 2002 to 2015,\nas chairman of the Senate Natural Resources Committee.\nHe resigned from the Senate prioring\na diagnosis of Alzheimer's.\nHe was born in Perry in 1956,\nthe youngest of four children.\nHis grandfather, JD Chanin, served in this body\nin the early part of last century.\nRoss graduated from Westfield Schools in Perry\nwith a quite an athlete in many sports\nand went on to Athens to the University of Georgia\nwhere I first got to know Ross,\nvery closely as the fraternity brother.\nHe returned to Perry to the family business\nand then owned as a financial advisor.\nHe served many, many positions locally\nin civic and business,\nand a member of the Perry Methodist Church.\nBut most importantly, he survived by his wife, Sally,\nwho has been so devoted, looking after him\nthese last five years in his three children,\nson, trip, and twin daughters,\nAshley and Kelly.\nSo if you would pause and thank you for all the stalls\nin his family.\nWhat a great, great public service for all the stalls.\nThank you, Mr. Speaker.\nChair recognizes for a morning order, Chairman Hitchens, Representative Al Williams,\nRepresentative Deloche.\nThank you, Ms. Speaker.\nThank you, Ms. Speaker.\nThose of you that are listening arise today along with my two\ncolleagues who are Vietnam veterans.\nAnd this morning, the Asident General made mention\nthe great sacrifice from that era.\nIt was not a great time for those of us that came home.\nAs the General said this morning, there were no parades.\nAnd while coming through a Harriet and National Airport\nin Chicago in my uniform, that was\nbefore security, I was accosted by a guy who had some real vulgar things to say to me.\nWell, I wasn't the age I am now, I only have two minutes of fighting me now, but I had\nquite a few then, and he got all of them.\nJust want to let you know that three of us are honored to absurd our country in that era.\nWe appreciate it.\nWe just wanted to share with you because it took us a while to get some honor, but as an\nan old Army man, and Representative Loach is an old Army man.\nWe felt it uncomfortable with us to at least let\na Marine be with us.\nThank you, girl Hitchens, for your service.\nThank you, Sergeant Deloach.\nThank you, to you, for your support.\nThank you Mr. Speaker, ladies and gentlemen I rise this morning to say congratulations\nto team USA Women's Basketball team\nfor winning the gold medal in Women's Basketball.\nAnd also to congratulate our very own\nAlicia Gray from Sandersville, Georgia\nfor being an Olympian.\nWhen Alicia was in high school,\nshe won a state championship.\nWhen she was in college at South Carolina,\nshe won a national championship.\nAnd now we're so proud that she is\nan Olympian gold medalist for the United States of America\nfrom Sandersville, Georgia.\nAgain, congratulations, Alicia.\nThank you, Ms. Speaker.\nI yield the will.\nChair recognizes representative Bernal for a morning order.\nThank you, Mr. Speaker.\nI rise today in honor of my mother Mary, Alma Hammond,\nwho made her transition a year ago today\nto be with the Lord.\nWe miss her and are thankful for the love that she gave us.\nWould you please join me in a moment of silence.\nThank you, Mr. Speaker.\nThank you.\nThere are no privileged resolutions.\nWe do have an announcement.\nWe have an announcement.\nChair recognizes Chairman Ron Stevens for an announcement.\nThank you, Mr. Speaker.\nMembers, today we have the city of Bryan County, the county of Bryan County, the City of\nRichmond Hill.\nThis is long, so I'll read it out.\nSavannah Harbor Interstate 16 corridor joint development authority which is\nChatham Bryan Bullock and Effingham counties has a joint meeting today to show\nyou about Georgia's regional mega site and between 1130 and 130 Chick-fil-A\nsandwiches will be served thank you\nroom to 16. Chair recognizes Chairman Darlene Taylor for an announcement.\nThank you, Mr. Speaker. The Congressional Reapportionment Committee will meet today at 1 p.m. and room 406. Thank you.\nChair recognizes Chairman Hauston for an announcement.\nThank you, Mr. Speaker.\nThe House appropriations economic development subcommittee will to meet today at 2.30 and room 341 of the Capitol.\nThank you and hope to see you there.\nChair recognizes Chairman Chokus for an announcement.\nThank you Mr. Speaker the Small Business Development Committee will be meeting\ntomorrow morning at 9 a.m. tomorrow morning at 9 a.m. in room 506 in the CLOB Small\nBusiness Development. Thank you. That completes our announcements. We have no\nbirthday is to celebrate today. The chair recognizes the majority leader of the\nHouse for a motion. Thank you, Ms. Speaker. Ms. Speaker, I move to this House stand adjourned\nuntil 1.30 p.m. tomorrow, Tuesday, November the 9th, 2021, 1.30 p.m. The majority leader\nhas moved that this House be adjourned until Tuesday, November 9th at 1.30 p.m. All those\nThose in favor of the motion will say aye.\nThose opposed will say no.\nThe ayes have it.\nThis house will stand adjourned until tomorrow at 1.30 p.m.\nYou\n",
  "updated_at": "2026-02-12T12:53:10.642832+00:00"
}