{
  "video_id": "7lTVwCOow6M",
  "url": "https://www.youtube.com/watch?v=7lTVwCOow6M",
  "title": "Georgia Rules Meeting 2026 - Day 8 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": null,
  "duration_minutes": 13,
  "summary": "Here is a structured summary of the Georgia Rules Meeting 2026 - Day 8 AM Session:\n\n**Overview:**\nThis session focused on a resolution (HR 1-008) to reorganize and streamline the regional water planning committees in Georgia. The changes aim to make the committees more efficient and responsive to emerging water management challenges.\n\n**Key Actions:**\n**HR 1-008**: Reduces the number of governor, lieutenant governor, and speaker appointees to the regional water planning councils; increases council member term lengths from 3 to 6 years; requires representation from key water use sectors.\n\n**Bills Introduced (First Reading):** None detected\n\n**Notable Moments:**\n- Opening prayer by Dean Green\n- Moment of silence to remember former Rules Committee Secretary Mandy Ballinger\n- Presentation by Rep. Smith on the rationale and details of HR 1-008\n\n**Votes:** No recorded votes\n\n**Attendance:** Quorum present to conduct business\n\n**Adjournment:** Not specified, but the session appears to be ongoing.",
  "transcript": "Good morning everybody, good to see y'all this morning, we'll come back in a few minutes\nMorning, everybody. Good to see you all this morning. We'll call our first room's meeting\nto order. And as we begin, I'd like to recognize Dean Green to open up with order for you.\nThank you, Mr. Chairman. Let us pray. Lord our God, we come into your presence and ask\nto help us. Help us in every part of our daily lives, even when we do not understand. Be with us\nthrough your spirit, guide and lead us with your hand. Let your will be done in all things,\nO Lord, as we pray. Help us through your word. Bless us and protect us, guide us and direct us\nduring our deliberations in this ruse committee. And Father, we ask you to bless our governor,\nour speaker and our chairman and the members of this\nrules committee for we make the decisions that go forward\nfor the people. Bless us now, God is in direct us in\nall things in the holy name we pray. Amen.\nThank you, Dean. Next I'd like to\nrecognize Speaker Proteum for a moment.\nThank you, Mr. Chairman. I just wanted to take a moment to\nRemember, Rule Secretary Mandy Ballinger, this is the first rules meeting that she has\nnot been both sitting up here or sitting out there in a very many years and she was, I\nthink she would most want to be remembered for, as being a mother to Henry, a wife to\nLee, a daughter, very devoted to her mother before she passed, and her father who is still\nliving.\nAnd then after all of that, she was a state representative and a real servant to the\npeople in Cherokee County, and so if we could just take a moment, a quiet moment, to remember\nor a many-balance or a moment of silence.\nThank you, members.\nThank you, Pro-Team.\nWell, since this is our first meeting of the year,\nwe've got a couple of little housekeeping comments\nI'd like to make.\nFirst of all, we want to recognize our Secretary\nof the Committee, Trade Kelly, right here.\nhere. I'm glad to have you with us and part of this committee. And also for you, all\nthe members and everybody get to know our intern this year with us, Davis Camusso sitting\nright over here. Davis, glad to have him working with us up there. So feel free to stop\nby and see him. He'd be glad to help you with whatever we need to do. Now, let's go ahead\nand begin our deliberations this morning. And we're going to call on Representative\nChairman Smith to make a presentation to us this morning.\nGood morning.\nThank you, Mr. Chairman and members of the Rules Committee.\nGood morning again.\nI bring to you today a bill called House Resolution 1-008.\nAnd the background on this and why we're having to do this at this point in time, it goes\nto the history of the State of Georgia and how we've dealt with our water and environmental\nchallenges through the years.\nWe've had extreme problems in the late 90s, all the way up until about ten years ago,\nwhen things kind of had been smooth, but we only had Hurricane Helene to remind us of\nthe changes that are again starting to come our way.\nOne of the fears is maybe followed by a drought, there's some predictions there.\nThe group that handles this, the background for the committees who don't know, in 2004,\nthe General Assembly created what is known as a comprehensive statewide water management\nplan.\nThe first thing that happened there was the greater metropolitan land area under the arc\nof the ARC was created via a legislative bill and its roles to address the concerns of\nthat area for the rest of the state. We had never done any in-depth study as how to\nmake our state work together as the challenges would come our way. And so there was a lot\nof, as only you can do in the general assembly, there was a committee to study that, then\nAnd there was a committee to study what we were told about that, and then there was another\ncommittee to study another thing until finally in 2008, we passed the first resolution.\nAnd that resolution is guiding a template, a playbook for our regional committees.\nAs it was a new process, there was a lot of concerns, so a lot of people were assigned\nto these regional committees.\nAnd as long as we had challenges in front of us,\nthe members who are assigned to those committees met\nand they had their forums.\nBut as we've had some quieter times recently,\nmost of our regional water planning districts\nare having difficulty getting a forum.\nAnd so the regional water planning committee\nwill have a council and one of their charges\nis to periodically revise the management plan to reflect,\nreflect new knowledge and insights.\nWell, the insights we've gotten and I'll read\nwhat this resolution is, the intent of the resolution.\nSo this amendment is to reduce the number of governor\nappointees from 13 to seven.\nKeep in mind all these people have to be at the meeting\nto have a quorum.\nReduce the number of lieutenant government's\nof six to three, reduced in numbers,\nspeaker of house appointments from six to three,\nremove alternate council members,\nincrease the length of appointments from three years\nto six years, require each council\nto have at least one representative\nfrom each of the water wastewater demand,\nforecast sectors, municipal, industrial, agriculture,\nand energy, those are obviously your consumers\nof our natural resources.\nAnd so that's what this bill does,\nIt's a resolution enabling this to happen.\nI'll stand for any questions.\nMr. Chair.\nOkay, thank you.\nWe have a couple of questions.\nVery hugely.\nThank you, Mr. Chair.\nI'm good morning, Madam Chair.\nGood morning.\nA quick question.\nWould you help me understand why we're going\nfrom three years to six years on their term?\nI understand reducing the number,\nbut it talked to me about the term change.\nAnd so for this to work and the numbers to serve\nall the committee had to be recommended\nto your speaker or governor.\nAnd what was happening, it was a loop.\nBy the time they got enough names to make the appointments,\nit was three years rough and they're having to make new appointments.\nSo the intention in the beginning was good,\nbut the function is not what it needs to be.\nThe other thing to know is these are not closed meetings at all.\nThey're open to the public and people interested in our region.\nShe wants to serve, need to make it effort to get their names before the ones who do the\nappointment.\nSo it's not meant to be exclusive.\nIt's meant to be functional.\nWe know that Hurricane Helene, some of the forecasts out there are droughts.\nIf we can't give our regions the tools they need in a timely manner, they're not going\nbe able to do what we've asked them to do. So it's not intended at all to exclude.\nThat's why I noted explaining I ran a business. I had a lot of employees at one point, but\nthen all of a sudden things shifted and I had to readjust quickly to be an effective\nbusiness leader top school. At the beginning I had about 40 kids in one classroom and I don't\nknow that they learned anything because you have too many to be effective. So the other\nthing to keep in mind is that it's in a resolution form, these regional water\nplans, except Fort Lanna, and we get to visit it every year. So if this is not\nworking, we're just trying to put it back on the right track to be efficient and\nto be able to help the citizens of the state of Georgia. No one knows a few\nwho were here back in the 1990s on we experienced horrible\nchallenging water problems and we didn't get our act\ntogether now thanks to the efforts of what we've done\nthrough the years we are the most recognized state in\nour nation for being able to address the concerns but yeah\nwe got to make some adjustments to continue to help\nour citizens have another question\nDr. Newton, Chairman Newton.\nThank you, Ms. Chairman.\nThank you for the bill.\nIs this mostly a structural setup for this council to allow\nit to run more efficiently and be able to get it?\nOr does it actually get into the real specific plan as well?\nAre there interbasin transfers allowed?\nThings like that that some rural areas have been more concerned about\nwith a metropolitan area that may have water needs.\nInterbasin transfers, at least over in my east area,\nIs a concern, are we approving a plan or just to make the structure a workable structure?\nWe are making the structure work.\nAny change to a plan would have to come through the legislative process as a bill.\nAnd so this is really giving the people who are serving our citizens something that works.\nSo they can, the best way to explain it, there are some parts of the state who are still\nable to do it.\nmeeting with other regions especially along the coast because they are facing more immediate\nproblems and they're doing what they were charged to do which is meeting, coming up with\nideas addressing the problems but they have no legislative power. It is building an\nand a free to call for the regents of our state.\nOkay, don't see any other questions.\nThank you, ma'am.\nThank you, Mr. Chairman, members of the committee.\nOkay.\nLet's set a calendar for January the 29th,\nlegislative day nine, under modified structure.\nHouse resolution 1008, is there a move in a second?\nis there any opposition it's on okay that will be our calendar for the next\nlegislative day the ninth let me make a couple of announcements before we break\nup first of all today every day that we're here is a special day but today is a\nvery special day because it's the birthday of Speaker Proteam J. and Jones\nI'd like to put on if it's all right right now. I don't want you to. Yes, sir. I've got your name by several and you and I going to be discussing those as we go through the process. Thank you.\nAnd along that line, I want to thank you for being here this morning.\nChairman Hatchett, thank you. I know you're up to your ears and numbers back there and everything, but we thank you.\nEach one of you members on this committee, this is a special committee.\nYou asked to be on this committee and the speaker put you on here.\nMs. Lewis is taking role every day and we're keeping up with that and we expect all our members to show up and be here.\nPlease make every effort that you can to attend all the members this important all the meetings\nThis important that you be here and if you have any issues or questions or problem as Lewis is in the office and Leo is there and certainly I am too\nSo thank you for that\nOur next rules meeting will be Monday at nine o'clock. We'll meet here\nIn this room Monday at nine o'clock any other comments or questions are announced for anybody\nif not, will adjourn to me. Thank you very much.\n",
  "updated_at": "2026-02-12T01:25:13.724906+00:00"
}