{
  "video_id": "7mq_mSGSQXI",
  "url": "https://www.youtube.com/watch?v=7mq_mSGSQXI",
  "title": "Rules PM Meeting for day 35 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 68,
  "summary": "Here is a summary of the Georgia Rules PM Meeting for day 35 of the 2025 Session session:\n\n**Overview**:\nThis meeting focused on discussing and potentially taking action on Senate Bill 69, which aims to regulate the growing third-party litigation funding (TPLF) industry in Georgia. The bill was recently passed unanimously by the state Senate and is now being considered by this Rules subcommittee.\n\n**Key Actions**:\n**SB 69**: Bill to regulate third-party litigation funding in Georgia, including requirements for registration, prohibited practices, and penalties for violations.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- The subcommittee chair, Rep. Rob Belverin, provided an overview of the plan for the meeting, including hearing from the Senate sponsor and reviewing a substitute version of the bill.\n- Sen. Kim, the Senate sponsor, presented the bill in detail, highlighting how it aims to protect consumers and address foreign influence in the judicial system through TPLF.\n- The subcommittee discussed specific provisions of the substitute bill, including limits on returns for litigation funders and registration requirements.\n\n**Votes**: No votes taken, as this was a discussion and presentation of the bill.\n\n**Attendance**: Quorum present, with the subcommittee chair and Senate sponsor in attendance.\n\n**Adjournment**: The meeting adjourned, with no date provided for the next session.",
  "transcript": "Hi ladies and gentlemen, I appreciate everybody's patience while I was trying to hobble up here.\nThis is the subcommittee of rules on lawsuit reform.\nI'm Rob Belverin and I'm chairing the subcommittee and we are here today to hear Senate Bill 69.\nSo sort of the plan is to, I've got some folks who have signed up who want to speak in favor.\nAnd of course, the Senate's sponsor of Pro Tem is here.\nI was going to let him present the bill.\nWe also have a substitute, which I've handed out\nto the members of the subcommittee.\nAnd I can, after the Pro Tem presents,\nI will kind of go through there and just try to highlight\nwith the specific changes in the substitute\nare from the bill as it passed the Senate.\nAnd then we'll hear some testimony\nand then we'll discuss the bill and try and take action.\nSo, Senator Kim, if you want to go ahead and present to us, please sir.\nSir?\nYes, sir.\nAll right.\nThank you, Mr. Chairman.\nGood afternoon, members of the committee.\nI appreciate the opportunity to present to you Senate Bill 69, which comes to you with\nsignificant support from the Senate.\nIn fact, I think it was unanimous, I remember correctly, coming off the Senate floor.\nSo it's a good bill for your consideration.\nYou know, last week we passed an historic tort reform that addressed a variety of topics\nthat address some unfairness in our legal system.\nand today I bring you the second portion of Governor Kemp's\ntort reform legislation, which is focused only on one issue\nthat has been increasingly problematic, or not only Georgia,\nbut for our nation, and that is third party litigation funding,\nTPLF. For those of you that are aware, third party funding\nlitigation refers to a contingency arrangement between a\nnon-party financier and a party or a potential party\nto a lawsuit in exchange for a property interest in the judgment of a case that has an expectation\nof a return. It is because it is within a contingency arrangement, it means that the financier may\nnot realize a return or even a recruitment of the funds that are provided. TPLF largely applies\nonly in funding arrangements with a plaintiff as you would expect. It's important to note that TPLF\nis not a small industry and it is growing annually. In 2023, analysts reported that the US\ncommercial litigation finance industry managed an estimated 15.2 billion dollars in assets\nwith over 2.7 billion committed just in 2023.\nHowever, despite the massive scope of the industry in Georgia TPLF is subject only to the contractual terms between the private parties.\nAnd there are no consumer protections in the arrangement in place for the plaintiffs entering into those arrangements.\nCases brought by Georgia citizens who alleged being wronged by TPLF funders have resulted\nonly in the courts recognizing that the current laws applying usury limits or lender regulations\nsimply don't apply in TPLF arrangements because these are not a loan.\nThis results in a gap for what is essentially the same conduct as regulated lender entities,\nbut the returns on the TPLF investments are contingent on the outcome of the claim and\nAnd that's the critical element that distinguishes these arrangements from what we all know and think of as a loan and thus doesn't fall under any of the current regulatory structure that we have.\nThird party funding litigation is basically unregulated gambling on our judicial system.\nThere are no protections in place for the plaintiffs that enter into these types of arrangements.\ncases in Georgia where consumers complain about their treatment show that there are no\nprotections and there are no standards for these arrangements and the courts are looking\nto the legislature to give some guidance.\nWe have clear evidence of foreign involvement which is yet another concern of why this\nneeds to be addressed.\nForeign involvement in our nation's judicial system and it's getting to the point that\nthe U.S. Department of Justice is highlighting that foreign entities are funding litigation\nto influence American domestic and foreign policy.\nOur Department of Justice is advising American lawyers and law firms to register as foreign\nagents when litigation is funded by these foreign entities.\nWe have an obligation to give litigants and our judges the tools and guidance they need\nto uphold the integrity of our judicial system.\nI know that we can often get bogged down in lawyer bills as we call them around these\nhulls, but this is really a consumer protection measure, and it also combats the growing foreign\ninfluence in the judiciary.\nThat's a chairman if I could, I'll just briefly kind of run through by grouped sections.\nSection 7-10-1, which starts on line 28, and by the way for the record, I'm looking at\nL.C. 49, 2, 1, 6, 0, E.C.\nIs that the appropriate Mr. Chairman?\nYes, sir?\nYes, sir.\nThis is line 29, which is the beginning portion\nSection 2, Elineated is Section 2.\nOkay, I'll try to stay away from,\nI'll just go by headings and stay away from line numbers\nbecause I'm not gonna get that specific\nunless you want me to.\nBasically, the first four or five pages\nreally deal with definitions that begin on page 2\nand go all the way to page 5\nuntil we get to Section 7-10-2.\nThat section requires litigation financiers that they must be registered and you'll see\nin that provision or that portion rather that talks about what's required for the registration\nprocess and how that is to occur.\nThe next section, which is 7-10-3, says that litigation financier may not do certain things\nso it gives the prohibitions against what someone that's in this business may do or not do.\nI'll highlight one thing, Mr. Chairman, which is in its under 7-10-3A subparagraph 4,\nwhich is line 192, and if you're following along in LC 2160.\nThat's in 239 on the sub.\nOkay.\nThere's an important provision here that in essence it says that the contract for receive or recover whether directly or indirectly any amount greater than an amount equal to the share of proceeds collectively recovered by the plaintiff.\nThis is in the those items that are provisions and in essence says that the litigation funder is not going to get and should not get more than the actual plaintiffs get net net after the arrangement.\narrangement. The next section is 7-10-4 that says in essence that a litigation\nfunder is jointly liable for sanctions. That's a short provision. It's only about\na half a page. That's 10-5 in the sub. The banking\nfinance added a section to the sub that would provide for denials of applications\nto be registered and then what the process is to appeal that so the section you're talking of is 10-5 and sub.\nOkay. And the next section 10, excuse me, 7-10-5 on mine, but I guess it would be 6 on yours.\nJust basically says, you know, the terms of an agreement of this nature should be in writing.\nAnd specifically goes forth and sets out what those terms or at least some of those terms must be.\nthat's about two and a half pages and that gets us on over to 7-10-6 in my\nversion I guess would be 7 in the sub and this addresses circumstances where\ncertain provisions would not apply to some arrangements where there may be\nfunding being provided but specifically fall outside of the definitions that are set forth here.\nAnd then pretty much finally Mr. Chairman the last section talks about the penalties at 7-10-8 or\nwith these 7-10-9 I guess in this that sets forth the penalty provisions in the event that if this\nIf this becomes law, what would happen if there is a violation of what we are saying in this bill would be the rules of the road for litigation financiers as they deal with plaintiffs in that arena.\nThat's a high level Mr. Chairman, but that is in essence what the bill addresses.\nAgain, fundamentally it is number one, a consumer protection measure or\npayments because right now those that enter into agreements with third party litigation\nfunders in the event that there is a dispute and unfortunately there are cases in which\nthere have been substantial disputes and some pretty egregious,\negregious behavior on behalf of third party litigation financiers that have\ntake an advantage of plaintiffs and those people find themselves in a situation without\nmuch remedy and virtually no regulation or oversight by the government because it doesn't\nfall under banking and it also doesn't fall under the securities laws that we have.\nSo with that, Mr. Chairman, I understand, as you alluded to, that there is a sub.\nI saw it literally just a few minutes before this hearing, I'm not complaining about that,\nthe cause of that if I would rely upon you.\nI think you kindly agreed to perhaps\npoint out for the committee the changes\nfrom what we pass to what is the sub for consideration today.\nAbsolutely, Senator Bigline.\nAnd just for the committee's benefit, subcommittee's benefit.\nSo the substitute basically preserves\nthat first section, 7-10-1, that goes into page five\nof the sub, then 7-10-2 does have a few changes in it.\nThat starts at line 111 on page 5, and I think runs, I think on page 8 maybe, yeah runs\nto page 8, on page 6 there is a change there in line 132.\nThe percentage that sort of determines, you know, sort of a disclosure requirement with\nrespect to the ownership of the entity that's applying to be a litigation\nfinancier or the person. The threshold was 5% and the original bill, it's now\nbeen changed to 10%. I believe the Department of Banking and Finance said that\nis a more customary percentage with respect to triggering at the\ndisclosure of the beneficial owner requirement and so that's been changed to\n10% there on line 132. On lines 158 through 163 of the sub, that is the prohibition against\nforeign adversaries participating in litigation financing. They've changed that language there\nto try to make it clear that all the phrases that were in that section, foreign person,\nand Principal Sovereign World Fund apply not to any foreign person, but just one that's\naffiliated or from one of the foreign adversaries.\nSo we're trying to clarify this doesn't absolutely prohibit foreign involvement, it just prohibits\ninvolvement by foreign adversaries as they've been determined by that federal regulation\nthat's referenced there.\nThen 7-10-3, which starts on page 8, that's a brand new section, Department of Banking\nasked to put that in. If you look through that, you'll see it basically provides when they\ncan deny a registration to someone who's applying to be a litigation financier. And, you\nknow, if they don't meet requirements in the chapter, there's a prohibition there against\nsomeone who's got a felony conviction in the last 10 years who's involved in the financier,\nand then they define what constitutes a conviction. Then going on to page 9, they address the\nprocess if you are denied, there's a notice that goes out to the applicant and they have\na right to appeal it and then the proceedings from their honor handled basically under the\nadministrative procedure act. So that entire section there is brand new. Then 7-10-4 was\nthe old 7-10-3 on the bill as it came from the Senate. Their 1 or 2 changes there on\nlines, 232 and 233 of the substitute, there's a prohibition there in line 2 about paying\ncommissions, referral fees, rebates, and that sort of thing.\nAnd this just makes it clear that they can do that with their own employees.\nThey're just not supposed to give any sort of kick back in order to get work.\nAnd there's also the same exception was placed for Mines 234 to 238, that's about accepting\ncommissions or for all fees and so forth, they excluded employee agents or affiliates\nof the litigation financier.\nThe rest of that section I think was the same, I believe, on 7-10-5, I'm on page 12 now,\nThat was 7-10-4, and the Senate bill came from the Senate, and this provides for joint\nseveral liability for the litigation financier, for any order or imposing or assessing cost\nor sanctions against the suit, a consumer, arising from the proceeding for which the\nfinancier has provided the financier.\nThis just sets a threshold of 25,000 or more in funding, and then provides that they would\nbe jointly a severably liable, and toward the end of that paragraph in 278 to 211 says\nthat where the financiers write a prepayment is a fixed amount set by contract, then their\nliability for the joint sever liability they have would not exceed whatever their right\nof repayment is, less whatever has already been extended.\nThen I think we go through a couple of pages on the form of the litigation financing\nagreement, the required disclosures and provisions that are not changed, the exemptions are not\nchanged. I think the next change is on page 17, line 409, that section is new and that was\nrequested by the banking department so they can basically use their current sort of registration\nsystem and software to do this registration on as well. So that goes that whole\nsection 7-10-10 is new and then section 3 is unchanged, section 4 the effective\ndate did change. They're basically saying here or we're changing it so that the\nwhole registration requirement and all of those prohibitions that are\nassociated with it, don't become effective into January 1 of 2026.\nThat's because obviously it's going to take the banking part a little while to get all\nthis set up, be prepared, get the word out there, and get that platform running.\nSection 3, which is the section that just provides litigation financing agreements are now\ndiscoverable, this is amendment to the Civil Practice Act, that becomes effective upon\napproval by the governor or becoming law that is approval and applies to\nProceedings commenced on and after the effective date of the act or contracts entered into honor after the effective date\nSo the discoverability would would have a would apply sooner, but the rest of it won't take effect until January one of 26\nSenator Kennedy, do you care to comment on any of those changes or?\nNo, Mr. Chairman, I think I followed most of them.\nThere are a number of them, but they're largely housekeeping and they're ones that the banking\ndepartment requested just to sort of give them the required regulatory structure.\nAnd then there are a few substance ones like adding the $25,000 threshold and allowing payment\nto employees of a litigation financier, as opposed to kickbacks and that kind of thing.\nSo any questions for the senator?\nI think I had Chairman Newton.\nThank you, Mr. Chairman.\nThank you for your work on this.\nIf you could help me at last section 3 for lines 445 in our sub, but there are sections\nabout litigation financing and the fact that it's discoverable but it can't be used as evidence\nbut it is admissible. Could you help a non attorney understand those two A and B sections of\nthat? I know some some that will apply to things that are 25,000 or more. It looks like and then\nI'm just trying to understand how could you try to explain it to a non attorney?\nSir, do you have the sub with you up there?\nYes, sir.\nOK.\nAnd to be sure, Mr. Lyme, 445, I'm talking about on the sub.\nMr. Chairman, to be sure, I'm looking at 492382 ECS.\nIs that right?\nOK.\nSo Chairman Newton, I'll let me look at that and try to.\nAnd some of this is new for me.\nBut the beginning of line 445, in essence,\nThis is the, we talked, and I talked in my comments about the value of disclosure and\ntransparency, that in essence, I think this is the essence of that, that a party may\nobtain discovery of the existence of a litigation financing agreement as it's defined within this\ncode section, which would be relevant to or subject to a particular pending action.\nis added after the however is new language and I would only assume that that is the purpose\nof that is to have it be non-applicable to arrangements at a threshold of $25,000 or less.\nAnd then the B portion of that which is lines 450 to 453 says information concerning the\nlitigation financing agreement is not by reason of disclosure, admissible and evidence\ntrial and again that makes sense just because the standard for that which is\ndiscoverable by the parties through the discovery process is very broad and\nintended to be very broad and then when you get to a hearing or a trial setting\nthat is one of the gatekeeping functions of the judge just to narrow that down to\nthat which the judge determines is relevant and admissible meaning that it's\nappropriate for the jury to hear it or receive it as a piece of evidence and I\nthink this just reaffirms that that notion that's baked into the normal evidentiary process.\nIs that that explains it? Okay, yes sir. I understand now that there's one section that's\npurposely very broad in discovery. There's much more limitations on what's admissible to\nyou. Exactly, yes sir. And I should mention too, I missed the last two lines on that page,\nto $25,000 per vision that I guess you can obtain it from another party, but you can't\ngo get it from the non-party unless it's $25,000 or less, you'd have to be $25,000 or more\nfor you to be able to use discovery, third party discovery to obtain it from the fancier.\nThat is, I believe, new in this substitute also.\nAll right, let's see, Representative Evans, I believe you next.\nThank you, Mr. Chairman.\nMr. Protein, I really appreciate what you and the governor are trying to do here as far\nas consumer protection. Very, very much agree with the goal.\nThank you.\nMy question is about, it starts on line 366 of the sub, but I think it would be line 303\nof perhaps the version you're more familiar with, even though I don't think that section\nchanged. But it's the part where we're saying what provisions this chapter does not apply\nto, and it's got a section about a non-profit entity, and then the third sort of exception\nis a regulated lender.\nAnd when I first saw this, I thought, well, what about Aunt Sally?\nThat lends money to her niece or nephew because they're going through hard time and needs\nhelp to pay for whatever they need to pay for attorneys or whatever.\nSo my first question was going to be, are we, do we really mean to haul Aunt Sally's family\nloan into this situation?\nI don't think we do, this is a long, this is a long-winded question, but I want to try\nto work through it with you, because I think we have the same goal.\nWhen I flip over to the definitions of litigation, financier, and particularly litigation financing\nagreement, that's telling us what's in here, and because the only things that are in here\nhave to be alone that's contingent on the outcome.\nAnd none of the things that are we're trying to exclude\nin section starting online 366 are those things.\nSo I'm worried about us being contradictory.\nI'm worried about us, I'm probably not saying this very\nclear, I'm trying to work through to my head.\nWe don't normally say this is what this bill applies to.\nAnd then let me tell you these things that it doesn't apply to\nthat are already excluded because they don't meet the\ndefinition.\nSo I'm just wondering, do we really need lines 366 to line 388?\nbecause everything in those lines are not things,\nare not loans that are contingent on the outcome.\nAnd we've already said this is about things\nthat are contingent on the outcome.\nSo can we just make it easy and make sure\nthat we don't haul Aunt Sally and the court\nis really my question.\nThank you for the question.\nAnd I appreciate it.\nAnd I appreciate your effort to work through this\nto make sure we get to the right landing spot for this,\nbecause as you said, and I appreciate your comments\nthat you agree with the policy that we're trying to meet here.\nI think because this is new, because this\nunique because we're talking about an animal out there that is a a type of\nvehicle that is not recognized or regulated and because we are getting into this\narea for the first time I do think it's prudent to talk about what this is not\nand I think that's why we do need section 7-10-7 identifying what this\ndoesn't apply to. For example, you're coming about the Aunt Sally loan. That shouldn't apply at\nall because it's a loan. And third party funding litigation is not a loan. A loan has the concept\nthat there is a repayment required. Third party funding litigation doesn't have a repayment\nof the underlying indebtedness. It is an obligation to turn over funds pursuant to\nto other contingent occurrences such as, or specifically, the litigation maturing into\na verdict that produces a recovery.\nAnd so that's one of the ways, again, that I think we distinguish this and want to make\nthis, makes this a little bit odd.\nWe're trying to, trying to address that.\nSo I do think there's value representative and utility in talking about what this is\nnot I think if we're going to address this and we've tried to say this is what\nthis business is let's avoid unnecessary litigation and squabbling and\nfighting over who's in the pool and who's out of the pool by where we can think\nof those circumstances identify these are specifically out and I think it just\nadds clarity to what we're trying to do\nOkay, along those lines then in the sub online, 384, where we are trying to exclude a regulated\nlender that does not receive, would you be opposed to striking the word regulated so\nthat also an unregulated lender, the aunt Sally example, that this exclusion also applies\nto her because otherwise if we've a court's going to say well you told me what it was\nand you told me what it wasn't and you told me that a regulated lender it wasn't but you\ndidn't tell me that an unregulated lender it wasn't and so I'm worried that the court\nwill believe us and I don't think you mean to including it Sally.\nSo if you struck regulated, then you are broadening the definition of what is not included.\nIs that the objective?\nIs that?\nYes.\nAnd if Aunt Sally has a litigation funding contract that's contingent on the outcome,\nshe's going to be included because of the definitions.\nSo we're not bringing any, but we're not excluding anybody.\nI think you mean to exclude and we are excluding people that I think you mean to exclude if\nIf we were to strike the word regulated, I think you gave me the line for the original\nbill.\nYeah, it's on the original bill.\nIt would be line 321.\nYeah, I believe that section was not changed.\nWe're that particular paragraph.\nMy concern is, and I know so many eyes have been on this far more than mine, obviously\nprincipally the governor's office, and I don't, in your aunt Sally example, I don't think\nthat's, I think that's clearly outside because it's alone, so it's not included.\nMy concern is, I'm not sure of the import of how much this would broaden it to just\nright regulated from the document and so for that reason I would not want to do\nthat without understanding or appreciating the potential ramifications of that\nin the moment. Well and perhaps there's a way to make another exclusion but\nwell let me just make sure I am clear we don't and you're not intending to wrap\nAunt Sally's loan to her niece or nephew into something like this into this\nbill. No because as I said at the beginning you're what you're describing is a\nlearned and that doesn't fall under the definition of a third party funding\nfinancier anyway. So she's I think by common sense by the definitions of the\nbill and by the other explanatory language she's not included already so I\ndon't think there's a legitimate concern with her being wrapped into this.\nWell let me try to figure out then to I want to maybe I agree with you. Why do we\nhave three lines 384 to 388? Why do we exclude a regulated lender that does not\nreceive in consideration for loaning money to any person or right to receive\na payment and so on and so forth. That's alone, too, right? Why do we exclude\nthem and their loan from a regulated lender but we're not going to exclude a\nloan from Aunt Sally. I'm just concerned how the court's going to read this\nbecause if you're going to, if you say we don't need to exclude Aunt Sally\nbecause that's a loan and these are not about loans, to me, the\nexclusion we're trying to make in 384 is also a loan so the court's going to say\nwe excluded that one but you didn't exclude hers. Well, I think it's a\nbeginning point if we try to identify everything will go and exclude this bill\nwill be a thousand pages because we could come up with every possible\npermutation of things that are excluded I think the drafters the original\ndrafters of the bill and those that have looked at it from the banking\ndepartment to other folks to the our executive branch thought for any\ncircumstance in which there might be some argument that let's go in and\nclarified but again back to your Aunt Sally example that's clearly not\nincluded. I would agree if we didn't have this exclusion section but I appreciate\nyou talking through it with me. Sure. That just my whole concern is that we've\nsaid what it is and then we've tried to say what it's not and I think we could\nhave we could create problems for ourselves. That's my concern but I appreciate\nyour answer. My last question Mr. Chairman is about section three. I think it's\nthe last section where we are making things discoverable and I just want to\nunderstand what why are we making these agreements discoverable. I don't\nthink as I don't think a plaintiff would be able to discover how a\ndefendant is paying their bills and so I'm wondering why does the defendant get\nto get to discover how a plaintiff is paying hers. Sure. First of all it's\nabout fundamental transparency, as you know, as a practitioner, one of the questions we\nask all the time in Vordire is anyone that has an interest in the lawsuit, or the outcome\nof the lawsuit, clearly a third party funding financier does. It may be even something that\nthe court will ask, as you know, in federal courts, sometimes they will actually ask the\nquestions of identify anyone that has an interest in the lawsuit. It would be extremely unfair\nand calamitous if we wound up with an owner of a third party funding litigation company\nthat sat as a juror on a case and nobody knew that his payday depended upon the verdict that he\nmight help render. I agree with you I agree with you so it is the parties that we're trying to get\nto not necessarily terms. No I think it's everything. Why are the terms relevant? Why are they not?\nIf you're going to identify not only the parties, I think the terms of the document ought to be.\nI really would say the question is, why does there seem to be some fear in this?\nAnd I don't mean to express any fear. I'm just trying to make sure we're being fair,\nbecause I know that you wouldn't get to discover how a defendant is paying their bills.\nI agree with you, we get to know who the insurance company is, because we get to exclude those people from the jury,\nand I agree with you 100%.\nIf somebody's got an interest in the outcome,\njust like we do for our dire on plaintiff's lawyers,\nif they have a contingency fee agreement,\nbut we don't do it if they are getting paid by the hour.\nIf their money depends on the outcome of the trial,\nthe jury does need to know the people,\nbecause we need to make sure they're not one and the same\nor they're not related.\nI agree with you, but I'm having a hard time\nunderstanding why my concern is harassment.\nMy concern is hauling all these people in here\nand asking people for discovery on how they're paying their bills\nand how they done this with that.\nThat's my fear. My fear is not, I don't have any problem with the fairness you're trying to create, and I agree with you on that, but I'm trying to understand why the terms are relevant.\nYeah, the terms are relevant. I think two things. One, I don't see this getting into some sort of harassment territory.\nYou're going to get the document that shows the terms what could be or would be harassing about that. Nothing. I don't think.\nNumber one, number two, and I think, representative, I think it's driven by addressing the fundamental\nproblem we've got of the corrosive nature of this type of business with these undiscovered\ndocuments and unidentified parties in our justice system.\nAnd what we have now are large hedge funds from foreign adversaries that are involving\nthemselves in our civil litigation funding, excuse me, our civil litigation system that\ncan then create an imbalance because they are gambling on the results.\nI mean, traditionally our system is the parties go in, they are the ones that have something\nat stake.\nThe plaintiff has been wrong and wants to be compensated and should be if there's liability\nand damages.\nThe defendant takes their position.\nYou're now injecting someone else into the system that nobody knows who they are.\nknows what the terms of their document are. Nobody knows how motivated they are. And it's\ninjected into our system and it's not good. And again, I would turn the question. I\nwould think the real question is why try to keep this secret and why be secretive about\nit. There's simply no reason to. If in fact, this is all fair and above board.\nListen, we are in agreement on if I'm really really not trying to disagree with you. I'm\ntrying to understand why.\nBecause a plaintiff is not gonna get to know,\nhey Mr. Defendant, how did you afford to have that,\nwhatever, that briefcase, how would you afford to be here\nand not be working all day?\nHow do you afford to have, you know,\n30 of your senior executives sitting in the front row\nof trial instead of working back home?\nHow do you afford that?\nNo one asked those questions,\nand I don't know why we're gonna ask them to the plaintiffs.\nAnd I appreciate and I understand why we need to know\nabout the parties, but I haven't heard the terms,\nand maybe we disagree, but I haven't even heard of a reason.\nYeah, and I think the short answer is in the traditional case,\nthe jury's not asked a render decision\nto financially reward the defendants.\nIt's the plaintiff's, not the other way around.\nOK.\nWell, I've gathered my best.\nI'm trying to have a question.\nAnd I thought the Chair might mention something,\nwas the ladies concern about the exceptions,\nmore the fact that enlisting exceptions\nthat might arguably be beyond the scope\nof the definition could imply broader applicability\nof the definition.\nI wonder if rather than striking regulated,\nalthough that might be a solution,\nif we could add language just to make it clear\nthat the listing of specific exceptions\nis not meant to broaden the applicability\ndefinitions beyond their terms. That's just, that's just something I throw out and we'll\nthink about. Maybe so, Mr. Chairman, I guess I'm, and I appreciate the intellectual energy\nthat the representative is putting into this to make sure we think about things so we don't\nwind up litigating or it produces a lot of unnecessary litigation because some ambiguity.\nI just, I fundamentally, I see the utility in, here's what this is, this is what it does.\nAnd here's a few things to be clear that it does not touch.\nMy assumption is the simple reason is there were some things that certain actors will concern\nmight be covered and this is just to give them comfort that it's not intended to cover.\nYes, sir.\nBut it does, I think the ladies concern is a reasonable one, although I don't know if we necessarily\nget there.\nAlso one if there's maybe a way short of deleting the word regulated if that's a concern that we might still be able to address a concern\nI was just\nPositing that possibility\nAll right, I believe\nWhip Park was the next\nPerson who's light was flashing\nThank you, Mr. Chairman\nMr. Pro Tem want to bring your attention to lines 389 to 392 on the substitute\nlines 326 to 329 and the original version of the bill as it passed the Senate.\nMy question is, certainly with the substitute, we had a $25,000 materiality provision\nwith the original version of the bill, there's also due process for those who are registering as litigation financiers.\nWith respect to, again, lines 39 to 392, it says any violation, however minor,\nwould result in the underlying litigation financing\nagreement to be void and unenforceable.\nShould there be a materiality threshold\nor an opportunity to cure?\nBecause if those provisions are not otherwise in there,\nwhere this would be an automatic penalty,\ndoes that not raise due process concerns?\nMr. Representative, maybe my version is different.\nYou said any violation of this chapter, however minor,\nthe words, however minor, is not in the version\nI'm looking at that you just added so maybe I don't have a current version so the words\nhowever minor is not in there so you added that when you just read that okay but the bill\ndoes read as however minor because there is no reality no it does not read however excuse\nme however minor that's not in that language is not in here so so any the word any right\nany violation of this chapter, right?\nOkay.\nAgain, are there any process concerns related\nto not having an opportunity to cure the agreement\nor would you be open to again some sort of threshold?\nYou know, I think given the penalty structure\nthat's baked into the bill that I think is fair\nand balanced, if we're going to have\ngood consumer protection measure in this bill that's driving this, and I think it needs\nto have enough teeth so that third-party litigation funders don't take advantage of plaintiffs\nthat are in a position of needing the funds at the time. They're already in a situation\nthat they may be injured, they may be out of work. They're not in the best, typically\nthe best phase of their life that maybe that they have otherwise enjoyed. And I do think\nto give it to give it teeth to this and make sure that there's a penalty mechanism that\nmakes sense that will truly get their attention and not be overly cumbersome on everybody\ninvolved.\nI think this simple straightforward answer is or approach ought to be that if you violate\nthis then you're not going to be able to stand on this document and reap all the benefits\nthat you thought you were.\nI understand the importance of having teeth.\nI think it's more a constitutional due process concern\nthat may exist with the bill without having an opportunity\nto cure an existing contract.\nI don't think what you're describing representative\nis a constitutional issue.\nNothing about what you have described as your concerns.\nAnd you may just be thinking or seeing something here\nthat I'm not seeing.\nBut nothing about this rises to the level\nof a constitutional concern in my mind.\nI've not heard anyone else express that along the way\nthat this path that this bill has taken.\nAnd I would also say to see the language\nas begins in line 390.\nAny violation of this chapter is pretty common language\nwe see in the code for other provisions.\nAnd I'm not aware of any constitutionality,\ntalent, or concerns with that general verbiage.\nSo, a follow-up if I may then, you know, Section 3 allows these sorts of contracts, including\nterms, to otherwise be discoverable in ongoing litigation, certainly if this is enacted this\nyear.\nDuring that discovery phase, if they find an aspect of the financing, the litigation financing\nagreement that does not meet the requirements of this legislation, without automatically\nmake that litigation financing agreement board and enforceable, because certainly I've\nI've seen other aspects of state bills that have this any violation, but not so much that it's automatically void and enforceable.\nThat's the part I'm struggling with.\nOkay, if I understood your question correctly, you're talking about arrangements with their contracts or whatever they may be that don't fall under the provisions of this bill.\nSo if they don't fall under this bill, then this provision that you're speaking of lines\n392-392 would not attach and apply to those type documents, contracts, or materials.\nI don't think that's getting out my question, but I'm sorry, maybe I'm just, could you\nrestate the question?\nI'm happy to try to answer it.\nI just must have misunderstood.\nSo again, my understanding of the application of this is that if there's any sort of\nviolation. In my own words, however minor, the litigation financing agreement automatically\nwould become void and unenforceable. If we are then allowing these sorts of contracts\nto be discoverable per section 3, does that provide the defendant's attorney an opportunity\nto make null and void the underlying litigation financing agreement that a plaintive may have\nentered into?\nI would not think a third party can render a contract between two other people void, but they could make that an issue in all his gays.\nThat's what I'm struggling with. I don't see how the defendant has standing to even make that argument or assert the position that a contract to which they are not a party is impaired or ought to be, ought to be voided.\nthen who would then then how would this this then otherwise be enforced it's\nenforced because if in fact the plaintiff who's the consumer who's the\ncontracting party with the third-party litigation funder if this contract\nviolates public policy violates George Law they have the right to say what\nam I this contract is void they are the contracting party the plaintiff is\nThank you.\nThank you.\nThank you.\nI believe that chair Lee Miller.\nThank you, Mr. Chairman.\nThank you, Mr. Senator Pro Tem.\nSpeaker Pro Tem, Senator President of the Senate.\nGo President.\nVice President.\nI do just, and thank you for the bill.\nI do appreciate any effort to protect consumers\nand have traditionally been concerned\nwith sort of the disparity between consumers working people and banks and lending institutions, et cetera.\nSo I do thank you for the thought that went into this.\nAnd this is more a question of curiosity than criticism and all really,\nbut for a person who is not as familiar as lending industry,\nguard rails, rules, regulations. Would you say that the the limits that are being\nimposed on third-party lenders here are similar to any other place in our code\nwhere we impose restrictions on lenders? I'm sorry any other place in our code\nyou know say traditional banks or anything like that is this sort of\nmodelled on something that we already see? I don't know that I would say it's\nIt's necessarily modeled on something we see in the code, because as I said earlier, it's\nnot a one.\nSo this type, this device, if you will, doesn't check those boxes so that you within\nexpect to see some other model that dealt with this.\nIt's not a security.\nThat was the other thought we had.\nWell, maybe this should be in the securities code.\nShould it, is this kind of a security, well, it's not that either.\nI would tell you that there are some third-party funding litigation bills that are getting passed\naround the country.\nI think there's one from Montana that has passed last year or year before last, but that's\nnot really what you're asking.\nYou're about, I think you're asking me, is this found elsewhere in the code?\nI don't know, quite frankly, the governor's office who did the human's work on drafting\nthis might have an answer for that, but I think the real answer is probably not because\nwe're dealing with an animal that, and quite frankly, we as legislators are here to address\nthis because it is totally unregulated, totally unaddressed and law, and that's where we're\nseeing arguably why we're seeing maybe some abuses out there and why we need to consumer\nprotection measure.\nSure, and I support that.\nI will, though, say that, you know, in my experience, you know, sometimes planets just simply cannot afford to finance litigation, to finance medical expenses when they're in pain, and unfortunately can't get traditional loans.\nI am not opposed to regulating this industry, obviously.\nI am just wanting to make sure that we are making it fair to consumers and not keeping\nconsumers from something that might be valuable to them.\nOne of the things I was curious about was the section that was added in the sub-dealing\nwith directors, officers, et cetera, of the entity who have taken a first offender plea.\nAnd I was curious about whether that, what's the rationale for that?\nSo why would we say that they cannot, if so facto, because they took a first offender\nplea within the last 10 years, not be able to engage in this kind of business, assuming\nthey cross every other T dot every other I behave exactly the way that you\nwant them to behave under this bill. Why would where are we cutting out that\nclass of folks from engaging in this business? Can you point me to where that is?\nAnd is that fair? That's that's new. I'm not sure that was necessarily\nSenator Kennedy's innovation. I think I can answer that question. I believe\nthat came from the banking department and that is I think fairly common in the\nbanking regulatory space like for directors and officers of a bank. If they have any kind\nof family conviction, even if it was a first of interplay, that generally can be a disqualification\nfrom serving as a director or getting a bank charge. So I think they were just modeling\non existing regulatory or statutes that set up some regulatory framework that they're\nfamiliar with so they can administer. That's what I was trying to figure out. Thank you, Mr.\nThat's a good question. Thank you. Thank you.\nChairman Newton, thank you.\nJust a quick question, thank you.\nYou kind of answered it. I was going back to the regulated lender in the fact that we did get information\ndisinformed somewhat by the banking department as well since this is a type of loan.\nI'm just curious to regulated lenders. I'm sure have certain written document requirements.\nI'm assuming unregulated lenders would not have the same level of documentation.\nAnd therefore, I guess maybe the banking input was in this, regulators, the only one\nwhere you required to have written documents, it could be, would you, that certainly\nmakes sense.\nI'm assuming that.\nUnregulated lender, we don't have a lot of control over, I guess.\nAll right.\nThank you, sir.\nMr. Nevins.\nJust to follow up on Chairman Newton's point, if that's true, then perhaps one way that\nWe can make sure that we don't disrupt Aunt Sally and have her called in for a deposition\non her unwritten loan agreement is that we limit Section 3 to written discovery.\nIs, I'm sorry?\nIs that we limit Section 3 the discovery part to written discovery?\nI just take Chairman Newton's point.\nYeah.\nI wouldn't agree with that because we're back to the point.\nI think we all agree.\nI don't think anybody says Aunt Sally's learn is subject to this, and it's not.\nI agree, which is why I don't know why you don't want to say it.\nThat's my confusion.\nI agree.\nThe definition of these agreements, and an agreement doesn't have to be in writing.\nThe definition of agreement doesn't include Aunt Sally.\nBut when you go to another section of the bill and you start saying who it's not,\nand you won't allow us to put in the word, or you don't agree, we could still try,\nfutile, but you don't bless a change to make sure that we don't\nalso exclude Aunt Sally, I don't understand that because if these people that got excluded\ngot excluded because they were afraid they were going to be included, I don't know why\nwe're so scared about making sure that we exclude Aunt Sally. That's my point.\nAnd I get that. I think the difference in my mind from these type folks that are referenced\nin here in the specifically excluded category, unlike the Aunt Sally circumstance, because\nit's a loan it's out already and so the how is line 384 not alone because well it says\nI regulated lender but it may be a lender that's engaging in third-party finance\nlitigation in which it's not a loan and if it's not a loan perhaps you're into\nthe great area where this might be subject to it it says a regulated lender that\ndoes not receive in consideration for loaning money to any person it's trying\nit's excluding a particular type of loan from a regulated lender. I'm just\ntrying to make sure we also exclude loans from an unregulated lender and I\ndon't understand the hostility to it. Well the other concern if we're gonna if\nwe're gonna exclude Aunt Sally then are we going to open up the possibility of\nindividuals that want to get into this business in a way that skirts the\nregulations they may not be a family but it's an individual that wants to\nskirt the regulations and again I think the clarity is here and it may just\nconceptual but as a beginning point Aunt Sally is making alone and they're\nexcluded. Just like the just like the regulated lender that we're excluding in\nline 384 is making alone. And again we can have a thousand page bill if you\nwant and think of every possible scenario. I definitely don't want a thousand\nI just would like an intellectual honesty and considering him and that's that's all\nWell, I think\nWe have an impassal in that issue, but I think the ladies made a point. I think the the senator has responded with this perspective as well\nThat's in my mind that's something we're still thinking about so\nGood Miller\nThank you, mr. Chairman one other thing just as I'm trying to process\nprocess, what I really like about this bill, and I just want to make sure we don't have\nany unintended consequences. The section in the sub that allows for the litigation\nfinancier to be jointly and severally liable for any award or sanctions for frivolous litigation\nthat might be imposed against the, I guess, the plaintiff's lawyer or the plaintiff's.\nSo that's lines 272 to 281 of the sub.\nYes, Mr. Chairman.\nWith the point made in the bill that the litigation\nfinanceer is not permitted to participate in the litigation,\nnot permitted to attempt to influence resolution of the case,\nand really has no function, which I think the bar rules\nprobably would prohibit this anyway.\nBut what would be the rationale for making a litigation\nfinancier who's doing a good job, who's following all the rules,\nwho's being fair, and some attorney does something in court\nthat the litigation financier had no say in,\nand they get hit with a sanction that the litigation\nthe financial is now on the hook for that.\nI mean, shouldn't, I guess I'm just trying to,\nis that designed just to keep people\nout of the business of doing this,\nwhich I'm not sure what is what we're trying to do?\nWe just want to regulate it.\nWhat is the fairness of that,\nassuming that the litigation financial is otherwise\nabiding by the regulations that are addressed in this bill?\nSure, I think number one, you've set up a hypothetical\nit's probably not going to be realistic or no way to determine did the third party litigation\nfinancier were they totally excluded did they never involve themselves did they not participate\nin the decisions did they not bring pressure and so I don't know how you get to the bottom of that\nother than making it clear that they are subject to being jointly in several in global number one\nNumber two, I think some of the concept may be\nthe desire for the exception, but if you're not engaging\nin litigation financing, you're not subject to the act anyway.\nNo, the problem is the way it's defined it would.\nThat's the challenge.\nBut it seems like a total, you're seeing an entity\nthat doesn't engage in litigation financing, ultimately.\nAnd I go to, I'd have to go to definition of litigation finance.\nA litigation financier means that any person engaged in a form created or established with\nthe purpose of engaging any kind of business.\nHave you ever seen in agreement itself what you want produced that allows the third\nparty financier to make decisions about litigation?\nIn litigation, not that I've been involved with, but in litigation that has gone on in other\nstates between consumers and funders that has existed. Yes. What states would\nthose be? I could get you copies of those cases. That's not a problem. Thank you. Thank you, Mr. Chairman.\nThank you. Chairman, is Chairman in? Just a quick follow up on that.\nYes, sorry. I mentioned about the discovery of an insurance policy for a professional of some sort.\nI do know that we all face this. There's a consent to settle clause that you may or\nor may not have in your policy, which is discoverable\nand shared with the plaintiff.\nAnd there are times, if the insurance company\ncan settle without the consent of the provider,\nthat's in that documentation.\nAnd the plaintiff's not gonna learn that, correct?\nAnd then by the same token, if you looked at that policy,\nif you were representing the plaintiff\nand it said it did not have that consent\nto settle agreement for the insurer,\nthen you'd know that the only person\nhad to go to was the provider themselves. Is that right? So that's the kind of thing\nyou'd like to find out in the reverse when it comes to the prosecution. Exactly, yes.\nOkay, thank you. Yes. All right, thank you. Thank you for your testimony today.\nIs it Rachelle Mortimer?\nGood afternoon.\nThank you, is this, can you hear me okay?\nOkay.\nThank you, Chairman Leverett.\nThank you to the members of the subcommittee for giving me the opportunity to present\nbefore you today.\nI'm here to support SB 69 and I won't take up too much of the committee's time.\nI just wanted to highlight a few of the provisions that we think will be really helpful in this\nbill.\nSo first, just to take a step back on some of the history of TPLF, I represent the U.S.\nof commerce, our Institute for Legal Reform, and we have been looking at this issue for\nover a decade, studying the transition that the litigation financing has gone through.\nSo the industry actually started over in Australia and slowly migrated into other countries.\nBut an interesting fact about litigation financing that some researchers have found is that\na lot of the litigation financing market right now is actually located in the United States.\nSo some estimates are that about 50% of the market is in the United States now.\nSo the reason that the Institute for Legal Reform has concerns about this type of funding\nis as people have mentioned before me, so I won't go too deep into it, or some of these\ncontrol aspects, conflicts of interest, concerns about how this litigation financing can affect\nto the course of litigation, what suits are brought,\nhow long they take, settlement, et cetera.\nSo I think some of the provisions in SB 69\nthat will be really helpful, especially\non the consumer protection side,\nare that elimination of control over any of the litigation\nbecause there are instances that we've seen\nof litigation finances trying to insert themselves\ninto litigation to take control.\nAnd I think one important part of that is that this bill\nactually make sure that the claimant themselves is aware of the litigation financing and is\naware of their right to control their litigation and that the funder has no ability to take\nthat sort of control away.\nAnother concern that ILR has that I wanted to point out that this bill addresses is some\nof the foreign investment in litigation financing so this is a concern that we raised several\nyears ago, and we have through investigations in the last several years come to see several\nexamples of this being a problem in the United States. There has been investigations\nor concerns expressed by the U.S. Department of Justice as to certain types of this sort\nof foreign investment and litigation financing. Two foreign or sorry litigation financiers\nthat we know of have investments from sovereign wealth funds that are undisclosed, and we have\nseen cases where a Chinese funder is funding litigation in the United States, particularly\nin the patent space, and that was not just closed except for an investigation that was\nundertaken, that revealed that funding, but at the moment we have no way to know if there\nare other sorts of these types of funding in the litigation.\nconcern that was expressed by DOJ was that these types of litigation, this foreign litigation\nfunding could be used to, you know, compete essentially with the United States businesses.\nSo litigation obviously takes up a lot of resources and time for a business.\nSo if you're a competing business in a foreign country, if you invest in litigation against\nthat competing business, it might make it harder for them to invest in research and development,\nand hiring employees, things like that that would give you a competitive advantage.\nSo, again, I really appreciate the committee's work on this and I would just say that we\nwould like to support SB 69 and I'll stand ready for any questions.\nAll right, thank you.\nI don't see that you have any questions.\nThank you very much.\nThank you very much.\nPhil Goldberg.\nGood afternoon, sir.\npodium Mike's on when you're ready.\nGreat.\nThank you chairman members of the committee for having me today.\nMy name is Phil Goldberg.\nI'm a partner of the law firm of the show Cardi and Bacon in our Washington DC office.\nAnd I spoke this summer with the National Conference of State legislators about\nmitigation financing, and because of the impact it's having on our civil justice system.\nAnd I was asked to testify today by Jordan's for lawsuit reform, which as many people here\nknow, focus is on ensuring a fair balance and efficient legal climate for all Georgia\ncitizens.\nThe basic premise, and I think we heard the speaker before me talk about this, is that this\nThis is new. This is completely new. This did not exist 15, 20 years ago in the United States.\nWhen I went to law school, I didn't know when I took all the torch classes and all of that.\nThey never talked about litigation financing being the driver of a lot of mass-tort litigation.\nBut that's what's been happening over the past few years.\nIt's as a professor at Einstein, it's one of the leading academics on this,\nhas said it changes every aspect of civil litigation,\nwhich cases are brought, how long they're pursued,\nwhen they are settled, all without transparency.\nThey're operating in the shadows.\nAnd so this legislation will change that in common sense ways\nthat are focused on protecting the courts.\nAnd importantly, the parties, both the plaintiffs\nand the defendants.\nThere's a little bit of a misnomer here\nabout the litigation financing.\nIt's litigation investing.\nThese are hedge funds, institutional investors\nand others who have figured out how\nto take advantage of the access to justice that our courts rightfully give people to bring\nlawsuits and try to see recompense from being harmed. Today, as we heard, it's a $15\nbillion industry in the United States estimates are that I'll get the $31 billion by 2028.\nIn the mass dorspace, you regularly see $50 million loans to law firms. Some have been reported\nto be $200 to $300 million. But there's no legal structure for all this new investment,\nand for all of this new impact on litigation,\nthere's no structure, there's no regulations\nthat protect the integrity of the litigation process\nfrom including things like basic disclosures.\nSo this legislation, I hope people appreciate,\nis not about stopping TPLF.\nIt's about protecting the courts and the parties\nfrom the TPLF abuses.\nAnd it's maintaining access to justice\nfor both the plaintiffs and the defendants.\nAt sometimes, as the speaker reformer alluded to,\nthe plaintiffs doesn't even know their case\nsubject to one of these agreements. The defendants don't know who they're settling with, who they're\nlitigating with. The courts are supposed to be about allowing these defendants and these\nplaintiffs to come together, they've got to dispute, they're trying to go to the courts to get\na peaceful resolution of it, and they need to be able to do that without that someone saying\nlooking at this solely as an investment mechanism. In the mass tort space, which is about two-thirds\nof where the litigation funding is going, what they do is they do portfolio funding. They\nunderwrite entire litigations.\nIt's been called the Vendorization of Mass Tours.\nWhen I was on a panel last year on this,\nthe funder actually was saying that Chido\nwas a good thing that they're basically in partnership\nwith their law firms, that that was one of her selling points.\nSo this is very different than I think some of the things\nthat we've been hearing today and some of the concerns.\nThese are different sets of concerns.\nOne of the things they do is they increase,\nthey drive a lot of the TV advertising you see.\nIt's $6.8 billion in advertising from 2017 to 2021.\nReport came out a couple of weeks ago.\nThen in 2024, there are $2.5 billion in lawsuit advertising,\nup 32% from 2020.\nAnd I'm sure you all hear, see it every day as we do.\nTheir goal is to make litigation too big to fail,\nto try to get 25,000 plaintiffs, 50,000 plaintiffs to sign up.\nThat's a completely new thing that's never happened.\nBut this mass of losses doesn't mean\nthere's truth to any of the claims.\nBecause what I'm trying to do is\nthey're trying to litigate the mass, not litigate the merits.\nAnd so you have the Federal Rules Advisory Committee saying\nthat there's widespread agreement among lawyers and judges\nthat up to a third or a half of all of these claims\ndon't have merit.\nThat the plaintiff can't show they use the product\nthat they are suing over.\nThat they can't show they have disease\nif they're claim that they have.\nAnd because there's no vetting of these claims,\nbecause no lawyers can go through all of these,\nand they often don't even know the plaintiffs,\ndon't even know who their lawyers are.\nAnd so the judges are frustrated,\nbecause they'll say to the lawyers,\nwork up these 20 cases for a bellweather,\nand we'll see what happens.\nAnd regularly a third to a half,\njust get dismissed voluntarily, just dismissed out of hand,\nbecause there's nothing there.\nAt the end of the day, you can't settle,\nyou can't try 25,000 cases.\nSo you end up where litigation admittedly has had no merit.\nThere's one case from a few years ago over a medication\nwhere it resulted in a $775 million settlement,\neven though all the bell-weather cases ended up in defense wins.\nBut it was too big to fail, and the court said,\nwe got to get rid of these cases.\nSo these are funding elucrative lawsuits.\nThey're not funding good lawsuits.\nAnd so I know my time is short,\nand I just want to make a couple of final points.\nWithout the basic disclosures, we are seeing,\nand there are stories that we've seen,\nCisco was one where the funder,\nthat Cisco came to an agreement with the plaintiffs,\nwith the defendants, the funder that gave the law firm\nand Cisco money, came in and said, nope, not good enough.\nWe want this litigation to be a baseline\nfor future litigations.\nWe're not accepting that settlement,\nand they actually had to come in\nand try to step in in Cisco's place.\nSo if we litigate the case,\nIt's just like, we're out.\nWe want to be out of this, we want to sell these cases.\nAnd the opinions from that case\ntalk about how the lawyers were really doing the funders\nbidding, not their clients bidding.\nWhen you're in the mass tort space, where the funder\nis driving the litigation, and the plaintiffs don't even\nknow who they are, who the lawyers are,\nwho do you think the lawyers will be paying attention to,\nand who's interested they're going to be focusing on.\nAnd so we see the conflicts of interest\nlike that, the ulterior motives, and then some of the privileged issues that were alluded\nto earlier in terms of the private information of the plantas medical records and the confidential\ninformation of the defendants are being turned over to the funders, because the funders\nwant to see this in part of estimating the cost and the investment.\nSo this legislation helps solve a lot of those problems, brings TPLF out of the shadows,\nThe reputable companies that are heard earlier value the idea of being part of a regulated industry.\nRequires disclosure upon requests of the parties, prohibits funders from the controlling the litigation,\nmakes so the funder can't get more to the judgment than the plaintiff, and then bars the sovereign wealth funds.\nYes, so yeah, so I just my finally just this allows people to sue when they are injured by someone's malfeasance, but it protects the system from this outside of you, so thank you very much.\nThank you for your testimony, appreciate it.\nI don't see any questions, so I'm going to go ahead and close the receipt of testimony.\nLadies and gentlemen, I know I am known for these marathon sessions without a break, but I'm going to take a break now\nThanks, you can thank Chairman Newton because he was kind enough to give me this water earlier\nSo I'll let's talk about a 10 to 15 minute break and then we'll reconvene to discuss the bill\n",
  "updated_at": "2026-02-12T17:43:22.34595+00:00"
}