{
  "video_id": "7P9ckRE61nY",
  "url": "https://youtu.be/7P9ckRE61nY",
  "title": "Georgia House - Day 8 (2026-01-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 8,
  "video_date": "2026-01-30",
  "duration_minutes": 62,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session featured a prayer by Reverend Scott Herndt, who discussed the role of national conscience and accountability to God in shaping the country's values and actions.\n\n## Key Actions\nNo bills were passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Herndt's sermon emphasized the importance of a \"national conscience\" rooted in accountability to God, as reflected in the Declaration of Independence and the Pledge of Allegiance.\n- Herndt contrasted accountability to God versus accountability to self, urging legislators to prioritize their duty to a higher power.\n- The session included the morning scripture reading, prayer, and Pledge of Allegiance.\n\n## Votes\nNo recorded votes were taken.\n\n## Attendance\nA quorum of members was present, as all members reported to the floor and voted to signify their attendance.\n\n## Adjournment\nThe transcript does not include information about the session's adjournment or the date of the next scheduled meeting.",
  "transcript": "The hour of convening having arrived, all members of the House will please report to the\nfloor of the House and take seats.\nAll members of the Georgia House of Representatives will report to the floor of the House and\nand take seats, Mr. Clerk, would you ring the bell, please.\nAll members, we report to the floor of the house\nWe're going to have the morning roll call, all members present, will please vote green\nto signify their presence in the chamber and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines doorkeepers will please close the doors and keep them closed good\nmorning. Welcome to Legislative Day 8. We're clicking right along here for now anyway.\nWe will begin our day with Scripture reading and prayer by the chaplain after which we\nwill pledge allegiance to the flag of our country. Our chaplain this morning will be introduced\nby the gentleman from the 27th House District, Chairman Lee Hawkins, Chairman Hawkins.\nThank you, Mr. Speaker.\nYou know, there are God put special folks on this earth and there are artists that can\npaint a portrait and you swear that the eyes are following you when you move around the\nroom and you put pastors on this earth when they preach you swear that they're speaking\ndirectly to you. Why have the privilege of having one of those pastors is my\npastor? You know you get attached to folks and I've always gotten attached to\nthe previous pastors and I've got attached to this one very much so I think\neveryone that goes in that church leaves after his sermon feeling a little bit\nbetter and a little bit more uplifted with his messages. My Reverend is Scott\nheard. He grew up in Decatur, Georgia. He attended Avondale High School,\ngraduate from Young Harris College, and then went on to the\nChandler School of theology at Emory University. While doing his\nseminary, he was the youth pastor in our church, the Gainesville First\nUnited Methodist Church. That was 82 to 85. We had the opportunity to have him\ncome back as our senior passion. We took that opportunity two and a half years ago and\nit's been a great time having him there. Scott is married to Sandy. They have three\nchildren, three girls, Allison, Carolyn and Sarah and I'm proud to introduce my\nPastor Reverend Scott Herndt.\nI've got to live up to that.\nWow.\nOkay.\nSpeaker Austin, Chairman, and Friend, Lee Hawkins, and distinguished members of this body\nand guest.\nThank you for this high honor.\nI look out across this and what I think of is a three-month church council meeting.\nAnd Lord, y'all do need prayer every morning, don't you?\nI understand you had a Baptist preacher a couple days ago.\nWe Methodist, right?\nWe Methodist never liked to follow Baptist, so here we go.\nEvery now and then my wife Sandy will say to me, you know that no matter how loud you\nyell at that TV, the people on the screen can't hear you. Now come on, come on, y'all yell\nat the TV, you know you do. You're yelling at President Trump or you're yelling at Adam\nSchiff, you're yelling at a Democrat, you're yelling at a Republican, you're yelling at\nSean Hannity or you're yelling at Don Lemon, maybe you prefer to yell at your radio.\nI don't know.\nThere's a lot to yell at on the radio too, isn't there?\nIt seems today we all have opinions and we don't always have, whether we have the facts\nor not and having facts, that's another story.\nBut it seems like we have a division today along the lines of halves and have nots, rich,\nunder-resourced capitalism, socialism, big government, big business, Republican Democrats.\nWell, I'm a preacher.\nSo I want all for today in my 35 minutes that I have.\nAll right, here we go.\nBecause I got a few things to say, now I'm just teasing.\nAs a pastor, I don't offer just another framework this morning.\nYears ago, I heard a preacher talk about a national conscience, a national conscience.\nAnd that's always stuck with me.\nI mean, you know that conscience is that thing within you that it helps you determine\nwhat's right and wrong.\nThere are things that we don't have to teach each other.\nWe don't have to teach our kids.\nWe can't even explain it.\nWe just know that some things are right and some things are wrong here, right?\nAnd so this preacher talked about a national conference conscience, and I got to think\nabout that.\nThere are certain things that we all, as a nation, agree are completely unacceptable.\nI mean, we would never stone a single woman who became pregnant.\nWe would never do that.\nI mean, we are just abhorred by that but that happens in some countries.\nAnd there's some things that other countries do that really bother us and they don't think\nanything of it.\nYou ever been to a beach in a foreign country?\nThere's some things that you just can't unsee after that.\nI'm sorry I put that image in your head for the rest of the day right there in my band.\nSo what, here's the question, and I just want to kind of disinmoist live.\nI want to kind of peel back the layers.\nWhat forms a national conscience?\nAnd I think when you peel back all of the layers that we'll find what informs our national\nconscience is the second sentence in the Declaration of Independence.\nWe hold these truths to be self-evident, that all men are created equal, that they are\nendowed by their creator with certain inalienable rights that among them are life, liberty, and\nthe pursuit of happiness.\nnational consciousness and this is this is an opinion it's it's history was\nshaped by sense of each person having a profound understanding of being\naccountable to God I mean you think back it I mean isn't our isn't it wasn't\nour national conscience that helped us forge the way through the anti-slavery\nmovement. It wasn't a national conscience that really drew us together, and we forged\nour way through the civil rights movement. When it really came back to it, it was because\nof our national conscience and a sense of being accountable to God. In the 1950s, words\nFrom Abraham Lincoln's Gettysburg address,\nwe're kind of picked up and they were placed\nin our pledge of allegiance, one nation under God.\nAnd in 1956, Congress passed a joint resolution,\njust take that in for a minute.\nCongress passed a joint resolution\nthat in God we trust\nshould be printed on our coins, that wasn't that long ago.\nBut it feels like it's a million years ago, doesn't it?\nThat it's from our personal accountability to God that that's where we get our ought,\nought, and our ought not.\nBut when we see ourselves then as under God, we understand that God is the source of all\nof our prosperity, not our hard work, not us, as well as the ones that we are accountable\nto is God.\nSo that's what informed originally our national conscience.\nSo I want to add a couple of other choices this morning too, conservative, aggressive,\nDemocrat, Republican, big-government, small-government, rich, under-resourced.\nAnd it's this, accountability to God or accountability to self.\nGod we trust. Or in we we trust. Can you imagine if we put first and foremost\nevery morning as we came in this room? Yes, no doubt. You are accountable to your\nconstituents. But before that, you're accountable to God. And this is the\npromise from our Heavenly Father, 2 Chronicles 714, if my people who are\ncalled by my name, will humble themselves and pray and seek my face and turn\nfrom their wicked ways, then I will hear from heaven. That promise I'll hear\nfrom heaven and we'll forgive their sin and we'll heal their land. Let's pray. Gracious\nGod it all belongs to you. It all comes from you and it still belongs to you. We thank\nyou for the honor of this authority that you have bestowed upon each of these sisters\nand brothers in this sacred space and may we look first to you and seek you that you\nmight hear from heaven and forgive us and heal our land and heal our country and we pray\nthis in the strong name of Jesus Christ. Amen.\nto the flag of the United States of America and to the Republic for which it stands.\nOne nation, under God, indivisible with liberty and justice for all.\nDoorkeepers will please unlock the doors.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour committee on information and audits\nhas read the journal of the previous legislative day\nand found it to be correct.\nChairman Hogan, the chair of the committee\non information and audits reports\nthat the journal of the previous legislative day\nhas been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none of the journal is confirmed.\nThe clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, on a 59 minute follow me, establishes the order of business in the first part of the period unanimous consent.\nIntroduction bills and resolutions.\nFirst reading and reference of house bills and resolutions.\nSecond reading of bills and resolutions.\nReports of standing committees.\nThird reading and passage of uncontested local bills and resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair hears none and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 742, members of Tramble, the 22nd clerk of the 98th, signaled in the 71st.\nHe'll be entitled to an act to amend chapter 5, a title 45, the fiscal to Georgia annotated\nrelating the vacation of office.\nof our mental affairs.\nHouse bill 839 by reps of Jones to 25th.\nWork highs are the 157th parts and the 101st.\nA little of the third, Holly the 111th and others.\nThere'll be title and act to men chapter 8.\nIt title 34 of the fish, but a Georgia annotated\nrelating to employment security.\nIndustry and labor.\nHouse bill 840 by reps of weed hour.\nThe 119th gains on them 17th.\nKelly the 16th Saints to the 180th.\nJones to the 47th.\nThere'll be title and act to men part 1A\nof Article 7 of Chapter 3, Title 20,\nthe fiscal to Georgia and its area relating\nto non-public, secondary, educational institutions.\nHigher education.\nHouse bill 841 by Rosa Skoggins,\nthe 14th gamble of the 15th, Kelly the 16th,\nbuilding Title NAC to MenonAC to provide a homestead exemption\nfrom certain Bartow County ad ballorum taxis.\nIntergovernmental coordination.\nHouse bill 842 by Rosa,\nthe Williams, the 145th Jackson,\nthe 128th Matheson, the 144th,\nprobably the 67th follow 32nd and others.\nBill B. Toddlenak to amend chapter one\nof tunnel 31 of the fish go to Georgia annotated\nrelaying the general provisions regarding health.\nInsurance.\nHospital 843 by Rosa Douglas the 78th\ntribal 130 second fry the 118th offense 27th\nwith one ski that 79th and others.\nBill B. Toddlenak to amend part 15\nof article 60 chapter two of tunnel 20\nof the fish go to Georgia annotated\nrelaying the miscellaneous provisions\nunder the Quality Basic Education Act.\nEducation House bill 844 by the rest of governor of the 19 9 of the 130th year to the 150 second\nThey're hard of the 36th and math this to the 144th\nBuilding title and act to men article one of chapter 5 of title 48\nIf you go to Jordan annotated relating general provisions regarding ad ballerium taxation to property\nWays and means House bill 845 by the rest of Glanton the 75th Knicks the 69th Stovall the 74th built in the 112\nthe building title and act to men subpar to part six,\nparticle six of chapter two, a total 20\nthat fish go to Georgia annotated,\nrelating the conditions of employment.\nThat's 845.\nEducation.\nHouse relate 46 by reps of corporate of the 174th,\nHarold 106, Carson 46, Kelly of the 16th\nand Williamson of the 115th.\nThey'll be title and act to men, title 4080,\nfish go to Georgia annotated relating to revenue and taxation.\nWays and means House bill 847, I wrote a quarter to the\n174th will call 33rd Dickey, the 140th through to the\n149th, you'll hear it alone for 60 second. He'll be\ntaught an act of men chapter 23, a title to the fish go to\nGeorgia annotated relating to hemp farming.\nAgriculture and consumer affairs, hospital 848, I\nRepresentative Blackman in the 146 Williams in the 145th\nlumps into the 12th, Taylor the 173rd,\nShannon the 84th and others.\nHilbert Todd and Acto Men are at 4,\nchapter five, a title 50.\nThe official go to Georgia annotated\nrelating to disposition of surplus property.\nGovernmental affairs.\nHouse Bill 849 by reps of Doug Wilson 78,\nTramble 130 second Hawkins the 27th.\nHowell the 32nd, howell the 124th and others.\nHilbert Todd and Acto Men chapter eight,\nTitle 31 of the fiscal to Georgia annotated relating the care and protection of indigent and elderly patients.\nHealth and human services.\nHouse Bill 850 by Russette Ridley, the six-herald of 106th.\nJasper is the 11th Tarvan, and the second gravely, the 67th and others.\nThe bill be titled act to amend chapter 8 to Title 40 in the fiscal to Georgia annotated relating sales in use taxes.\nWays and Means. House Bill 851 by reps out of Reeves of 34th and Ella was the 42nd sets of the 35th.\nWilliams, the $37, the $45, and others.\nWilmington, an act to amend the act, creating a state court of Cobb County.\nIntergovernmental coordination.\nHouse Bill 852 by reps of Glanton, 75th.\nWilmington, an act to amend.\nCode section 6, 3, 21 of the physical to Georgia,\nannotated relating to lands acquired,\nOwen, Leeson, control.\nGovernmental affairs.\nHouse Resolution 874 by reps of Tramble,\na hundred thirty-second Clark in the 98th.\na resolution proposing an amendment to the Constitution, the State of Georgia,\nso as to provide for the suspension of the salary of certain suspended public officials.\nJudiciary.\nThat completes first readers.\nSecond reading of Bills and Resolutions, a clerk or read.\nHouse Bill 824 by Representative Allen of the 40th, the bill will lead into special license\nplace, providing certain beneficial projects, House Bill 825 by Representative England,\n116th, Gaines of the 117th, Kirby of the 114th, and Bill to Women in Act, providing\nauthority for the members of the Board of Education of Barrow County, House Bill 826,\nby Representative Watson of the 172nd, Taylor of the 173rd, and Bill to Women in Act, providing\na new charter for the City of Migs in Thomas County, House Bill 827, by Representative\nStevens of the 164th, a bill relating to general provisions relative to the GOL-2nd\nGeorgia World Congress Center Authority,\nHouse Bill to 828 by Rep. Stephens of the 164th,\nthe bill relating to a handicap persons.\nHouse Bill 829 by Rep. Stephens of the 164th,\nand Harold the 106th,\na bill relating to assessment of tangible property,\nHouse Bill 830 by Rep. Stephenson of the 31st,\nthe bill relating to eligible large retirement systems,\nauthorized to invest in certain alternative investments,\nHouse Bill 831 by Rep. House of the 100th and 70th,\na bill to authorize the assessment and collection\nof a technology fee by the Prebate Court of Cook County,\nHouse Bill 832 by Representative Carpenter of the 4th,\npercol of the 150th body of the 62nd.\nNot this of the 78th, but still comes to the 52nd\nto build relating to general provision\napplicable to counties, municipal corporations,\nand other governmental entities.\nHouse Bill 833 by Representative Stevens of the 164th,\nthe bill relating to the waters of the state,\nports, and watercraft.\nHouse Bill 834 by Representative Jasper's of the 11th,\nthe Washington of the 172nd,\npercol of the 155th,\nhoused in the 170th England of the 116th,\nand others of bill relating to definitions\nregarding revenue boards.\nHouse Bill 835 by revs the turner of the 21st,\ncalled by the 20th Singleton of the 71st,\npulling of the 131st,\nbill relating to advalorant taxation of property.\nHouse Bill 836 by revs of Carpenter of the 4th,\nparallel to 106,\nPowell of the 32nd, 518th Williams of the 148th,\na bill relating to alcoholic beverages.\nHouse Bill 837,\nby revs of Martin of the 49th,\nJones of the 47th,\nJones of the 25th,\nSilkhacks of the 52nd,\nStevens of the 164th,\na bill relating to development authorities.\nHouse Bill 838 by Reps and Hitchens of the 161st lot of the 122nd Chaspers of the 11th gravely of the 6th, 7th of the 12th,\nbill relating to privileged communications between law enforcement officers and peer counselors of the Office of Public Safety Officer Support.\nHouse Resolution 875 by Reps and Kendrick of the 93rd Bended of the 94th Mitchell of the 88th, Beverly of the 143rd,\nMorin of the 96th and others, Resolution creating the House Study Committee on Financing Options for cannabis-based businesses.\nHouse Resolution 876 by Rev. Tendrick of the 93rd, Mitchell of the 88th, by the way of the 143rd\nBennett of the 94th, Marin of the 96th and others.\nA resolution urging the United States Congress to enact legislation removing candidates\nfrom the Federal Control Substances Act, exempting certain activities related to marijuana\nfacilitating the full spectrum of private banking services for cannabis related businesses\nand encouraging scientific research as related to Canada's products.\nHouse Resolution 962 by Rev. Stevens of the 164th, the resolution proposes the amendment\nto the Constitution, so as to authorize the General Assembly to provide by General Law\nfor local referendid to authorize assessment of residential homesteaded property owned\nby individuals of certain ages at 20% of its fair market value regarding local school\ndistrict taxes for educational purposes through second readers.\nReports of standing committees, the clerk will read.\nRepresentative Jan Tancas, the 160th District Chairman of the Committee on Intergovernmental\nCoordination Locals submitted the following report.\nWe'll speak to your committee on Intergovernmental Coordination Locals, set on a consideration\nto following bills of the House.\nWe'll just struck to meet a report the same back to the House with the following recommendations.\nHouse Bill 706, do pass, House Bill 753, do pass, House Bill 802, do pass, House Bill\nWe are about to go on to the local calendar.\nWe are about to take up the local calendar, third reading and passage of uncontested\nlocal bills. If there is no objection, we will vote on the local calendar as a\nwhole with a recorded vote. Hearing no objection, it is so ordered the clerk will\nread the local calendar. House Bill 706 by\nRep. Weed Hour of the 119th of\nConey County. House Bill 753 by\nRep. Next to 69th City of Franklin. House Bill 802 by\nof the Green Zone, 51st, Calhoun County,\nHouse Bill 817,\nand Fleming of the 121st, Columbia County.\nIs there any objection to the previous question\nbeing ordered on the local calendar?\nThe chair here is none, the previous question is ordered.\nIs there any objection to agreeing to the report of the committee which was favorable to the passage of the bills?\nThe chair here is none the report of the committee has agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines on the passage of the bills on the local calendar the eyes are one\n161 the nasor zero these bills\nhaving received the requisite\nconstitutional majority are\ntherefore passed. We are going\non now to morning orders.\nMorning orders.\nChair feels a little, a little\ngenerous today. So we're going\nto go with a minute and a half.\ncome on show me some love for that okay and then we're not going to just turn\nthe mic off we're gonna execute people in the whale if you stay longer chair\nrecognizes for a morning order chairman Ron Stevens\nThank you Mr. Speaker, ladies and gentlemen of the House today, Savannah Day.\nSavannah's capital since 1733, Savannah has served cornerstone of our state.\nSavannah is known for the beautiful architecture, the rich history, the global cuisine, the\neconomic impact, not only for our state and our country but also for the world.\nThe host of City of the South welcomes more than 14 million people, remember we've only\ngot 11 in the entire state and 14 million last year in the home of the fastest growing\nport on the planet earth.\nWe're thankful for the investments made in our community like Gulf Stream, the film industry\nwhich is now doing Ozark in Savannah and we know we'll continue the Savannah with the\ncoastal region and flourish with all kinds of opportunity. We want to thank\neveryone who traveled 250 miles to celebrate a savannah day here under the\ngold dome and I hope that you'll join us tonight between five and seven at the\nfreight depot. I would like to recognize the mayor and council if they are here\nfor the city of savannah. Would you stand? Okay well they're over at the\nPlease come tonight. Thank you very much.\nChair recognizes the chair of the majority caucus, Chairman Hatchett, for a morning order.\nThank you, Mr. Speaker. I'll be joined by Chairman Pruitt and Representative Mathis.\nYou know, it's Savannah Day and they have a little celebration in Savannah on a certain day. I think it's March the 17th\nBut there's another city you go by on the way to Savannah\nIt's called Dublin and we've been having a St. Patrick's Festival\nThis will be the 55th year and it's run by a totally volunteer\norganization and we're pleased to welcome today to that group this run in this\nfestival this year to the St. Patrick's Committee, Dublin R and St. Patrick's\nCommittee. Thank y'all for being here.\nChair recognizes Chairman Cantrell for a morning order. Thank you Mr. Speaker as\nrequested from the speaker, I bring to you a report from our movie last night that 100%\nof our attendance remained for the end of the movie all the way through the credits.\nAnd I want to give our members a great hand for 100% by partisan support for that.\nAnd during that time, we noticed a very familiar name on that credits that belongs to\nto the famous last name that belongs to probably the best,\nthe most important person in this chamber.\nSo, not named Ow Williams or anybody else.\nThe speaker's daughter, Elizabeth Rauston,\nworked on that movie that we saw last night.\nAnd so, we want to congratulate the speaker\non this daughter's great success.\nThank you, Mr. Speaker.\nChair recognizes Representative Bentley, Representative Prince, Representative Dean Smiley, Representative\nHoward, and Representative Stovall for a morning order.\nWell thank you Mr. Speaker and good morning colleagues.\nToday is a great day because we are celebrating Fort Valley State University, Savannah State\nUniversity and all vending state university alumni are there here at the state\nCapitol and colleagues I encourage you to please stand and welcome those alumni\nassociations to their state Capitol. Thank you and we got Tyrone pool in the house\neverybody in a fail player from graduate of Fort Valley State University. Thank\nThank you, Mr. Speaker, and thank you, members of the House.\nRepresentative Bentley, I wish you were in a better mood today.\nI know you're kind of down.\nChair recognizes Representative Mary Francis Williams for a morning order.\nThank you, Mr. Speaker.\nYou know, this house cranked out a pretty darn good budget last year.\nAnd then the next thing you know, there's a $200 million whole in the budget, and the\npublic is being asked to bite the bullet.\nI was elected to be the eyes and ears of the people back home.\nGames are being played with this budget,\nand I don't think this house has to play these games,\nbecause it's Georgians that are going to lose,\nand that's just not right.\nAnd we all know it.\nThank you, Mr. Speaker.\nChair recognizes representative McCloud\nfor a morning order.\nI want to reflect on the budget as well. We cannot allow a budget that disguises itself\nas a necessary tightening of the belt, but in actual fact, it will present more challenges\nto the livelihood of many of our employers, otherwise known as the state of Georgia's\npeople or our constituents. In this budget, we offer educators a small pay increase that\nallows them to barely live comfortably while reducing the little money they will have\nfor retirement. In this budget, we demonstrate that the healthcare is only for the healthy\nBecause we are decreasing funding to behavioral health and developmental disabilities by $24 million.\nIn this budget, we are allowing private prison owners to line their pockets with increased\nfunding of $2.5 million while taking out almost $44 million out of the budget for state-run\nfacilities.\nIn this budget, we are prioritizing the prosecution of people over the public defense attorneys\nto protect them.\nIn this budget, we will be contributing to the mass incarceration by decreasing budgets\nto the departments that provide resources for employment and rehabilitation by almost\n$57 million.\nAt this time, when the United States of America leads in-\nLadies' time has expired.\nI will continue.\nI'm sorry?\nTomorrow.\nThank you.\nThat's what I thought you said.\nI just heard it clarified.\nChair recognizes Chairman Heath Clark for a morning order.\nThank you, Mr. Speaker, colleagues.\nIt's hard to believe I've been here for this is my sixth session.\nhere in the Gold Dome. In the middle of my second session, my wife and I, we\nwelcomed our fourth child into this world. And today is his birthday. He's\nfour years old. Joshua Garrison Clark, we call him Lil G. Happy birthday. He's\nwatching back home. Love you buddy. I'll see you soon.\nChair recognizes Chairman Tankersley for a morning order.\nGood morning colleagues.\nI wanted to be sure that you know today is Keep Georgia Beautiful Foundations Day at\nthe Capitol.\nThis foundation was created in 1978 by executive order of Governor Busby and that's the division\nof Keep America beautiful with 70 local affiliates.\nThese affiliates reach more than 80% of Georgia's population with litter prevention, waste reduction,\nrecycling and beautification projects including the Great American Cleanup that a lot of us\ntake part in and the bring one for the Chipper program around Christmas.\nMore than 93,000 volunteers do participate in this foundation and affiliate programs throughout\nour state. So I would highly recommend that you go down today. They're in the rotunda beginning\ntoday at 2 p.m. and thank the keep George a beautiful affiliate and thank them for the\ntremendous job that they do in keeping our state clean and beautiful and desirable for businesses\nand industries to locate in. Thank you. Chair recognizes Chairman Jasper's for a morning\norder. Thank you, Mr. Speaker and colleagues. On your desk is a top 10 issues. It's put\nout by the Georgia partnership for excellence in education. Well, when I got it a couple\nof days ago, I said, well, I'll probably never read all this. So I suggest you just pick\none. In the matter of time that you have, just pick one of the subjects that they look\nThis is their 16th edition of really looking at education issues very carefully\nAnd I think you'd like it and look one come talk to me, but that's very good. Thank you\nChair recognizes representative Hutchinson for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday I want to introduce you to 11-year-old London.\nLondon is one of George's over 2,000 children available for adoption today.\nis an ambitious and funny girl who likes to run, swim, ride her bike, and play with her\ndolls and toys.\nShe also enjoys playing Candy Land, listening to gospel, R&B, and classical music at 11.\nAnd watching animated, action, and family movies and shows on Disney, Nick, and PBS.\nSo help me welcome London, and she is available for adoption.\nThank you, Mr. Speaker.\nThank you.\nThank you, sir.\nThe flag was signed through by the Acting General in Washington.(Applause.)\nPeace be with you all\nChair recognizes Chairman Timothy Barr to introduce the Doctor of the Day.\nGood morning, colleagues.\nToday I have the privilege of introducing Dr. DeLal.\nHe is board certified by the American Board of Orthopedic Surgery, Dr. DeLal's Practices\northopedic Atlantic includes general orthopedics, sports medicine, shoulder injuries, which\nI'm glad they switched that from shoulder surgery, because that's hard to say, and fracture\ncare.\nDr. DeLal is very active in our community and serves as a team physician for Duluth\nand Central Gune at High Schools, co-director of the BB&T Atlanta Open Professional Tennis\nTournament, sideline physician for the Chick-fil-A, Peach Bowl and Chick-fil-A kickoff\ngame. Dr. DeLal also serves as the hand surgeon for the Atlanta Gladiators\nprofessional hockey team and he is currently the president elect for the\nGeorgia Orthopedhe Society but more importantly he is a family man and my\nfriend and thank you so much for coming sir. Thank you. Thank you so much\nSpeaker Ralston and Representative Tim Barr for this opportunity. It is my\nmy utmost joy to serve as doctor of the day.\nToday, I understand this is your fourth legislative day\nthis week, so I know it's a long week.\nAnd so I'll just leave you with this.\nPlease remember that health is wealth, okay?\nI know that you guys are sacrificing a lot of time\nto take care of us Georgians and to promote\nnot only the quality, but also the accessibility\nof healthcare in Georgia.\nbut you can't keep working if you're ill.\nSo please stay hydrated and wash your hands.\nAll right, take care.\nThank you so much.\nPlease be seated.\nChair wants to recognize on the floor of the House a former member of this body, former\nstate representative Tom Taylor.\nor could read the caption to House Resolution 900.\nHouse Resolution 900 by Reptile of Stevens, 164th Gilear, 162nd Gorton, 163rd, and Peachtree\nof the 166th.\nThe resolution, inviting the Savannah Children's Choir to be designated as junior ambassadors\nof Georgia to the People's Republic of China and for other purposes.\nChair recognizes the chair of the Economic Development and Tourism Committee, Chairman\nRon Stevens, for an invite resolution.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House, today we're honored to have the Savannah Children's\nThey were supposed to leave here and go to China for course, of course.\nThere are 100 members from K-12 public school, private school, home scholarship,\nand they are premiered choir with us today.\nAnd today we have the students Reese Stingback, Tory Cummings,\nJamar Campbell, Emily Salzer, and if you would, would you make welcome Melinda\nBradley? I knew I'd spell that right and say it right. Who's the principal in\nthe coordinator? Would you make welcome to Savannah Children's Choir?\nThank you Chairman Stevens, Mr. Speaker and the members of the Savannah\ndelegation for inviting us to the Capitol today. While we had planned on\ntraveling to China.\nIt looks like those plans are on indefinite hold.\nHowever, we've come up with an alternate plan\nof visiting Speaker Ralston's house\nin Blue Ridge for 10 days.\nAll 50 of us.\nWe don't eat much.\nWith me today, as introduced, we're\nEmily Jamari Torrey-Rese, but the other 50 members\nof Premiere are up in the gallery.\nAnd they will be singing a concert.\nThose are your representatives in China and they will be singing a concert on the steps\nat noon inside.\nHope you can join us.\nThank you.\nThank you very much.\nJust a quick picture.\nI'm getting this.\nI'm trying to put it on there.\nOh, that doesn't matter.\nIt's a bit fast and very difficult.\nVery very.\nAll right.\nEveryone, what's your performance?\nA&M-1, T-4-E.\nAll right, 1, 4, 4, 4, 1, T-3.\nSounds great, baby.\nAnd this speaker is for very good.\nClerk will read the caption to House Resolution 947.\nHouse Resolution 947, my representative is Mithiyaq, the 73rd, 930th bonnet of the 72nd\nSilcox of the 52nd, reads the 34th and others, a resolution recognizing a long steady friendship\nbetween Georgia and Japan as shown by the 46th anniversary of the Office of the State\nof Georgia in Japan and for other purposes.\nChair recognizes a representative, Matthew Eck, for an invite resolution.\nThank you, Mr. Speaker and good morning, Catholics.\nToday, I have the extreme honor of introducing you to his majesty, the emperor of Japan.\nHe's the 126th direct family line in Japan.\nBut furthermore, Georgia in Japan enjoys $12.1 billion of import export trade.\nThere are 650 Japanese companies within our state and over 40,000 employees.\nSo this morning I'd like to honor you, Emperor, and thank you so much for being here.\nThank you very much for your information.\nI'm a Consul General.\nIt is an honor for me to be here today.\nI would like to express my sincere gratitude\nto Speaker Winston, Alarztom,\nalong with the representatives Knight Smire,\na member of the Georgia, Japan caucus,\nand all other members of the Georgia House\nof the representatives.\nOver the decade, our bond have made\nboth of our nations more successful.\nWe are fortunate to have pushed not only on Elias,\nbut a friendship.\nThank you again for the honor,\nand thank you for your excellence\nfor your continued support.\nI look forward to many more years of prosperity\nand friendship between Japan and Georgia.\nThank you very much.\nThank you very much.\nThank you very much.\nThank you.\nThank you.\nYou\nYou\nWe're going to read the caption to a group of privileged resolutions.\nRecognizing Commending United States Senator Johnny Isaacson.\nCommending and graduating Cory Chappell, honoring the life and memory of\nSarah Lynn V. Gordon. Recognizing February 7th through 14th 2020 is\ncongenital heart defect, awareness week at the state capitol.\nCommending Jay Alvin Wilbax, CEO and superintendent of Gwyneth County Public Schools.\nCommending together Georgia and recognizing January 29, 2020 is together Georgia\nDay at the State Capitol, commending that Dr. Mack O'Bohen, Horizon Foundation,\ncommending the leadership Putnam Class of 2020, recognizing February 11, 2020 is\nDixlessia Day at the State Capitol, urging schools, local education agencies,\nand the state agency to address the profound educational impact of dyslexia.\nRecognizing February 4, 2020 is Community Health Center's Day in commending the Georgia Primary Care Association.\nCommending Clark at Blaney University in recognizing February 18, 2020 is Clark at Blaney University Day at the State Capitol.\nRecognizing commending the University of Georgia chapter of Blue Key National Honor Society.\nCommending the leave of voters of Georgia on the occasion of its 100th anniversary.\nRecognizing commending Willis Bivens and for other purposes that completes the reading of the privilege resolution.\nIs there any objection to adopting the privilege resolution? The chair here is not in the resolutions are adopted.\nOkay, we're going on now to announcements if you have signed up for an announcement.\nMake your way to the front of the chamber.\nChair recognizes the Chair of the Majority Caucus Chairman Hatchett for an announcement.\nThank you Mr. Speaker.\nThe House Majority Caucus will meet today at noon in room 403, the Capitol.\nHouse Majority Caucus at noon in room 403.\nThank you.\nto recognize his chairman, David Knight, for an announcement.\nThank you, Mr. Speaker.\nIn light of the recognition of the Consulate General\nfrom Japan, I want to remind you that today,\nJanuary 30th, we will begin our lunch\nwith a job creator series,\nwhich features a discussion\nof the Georgia's many Japanese companies. Our first feature is YKK, a great company\nthat manufactures many different types of fascinating products, but you're probably\nbest known for their zippers. Please come by for the members, again members only, room\n216 in the capital at noon, and grab lunch, and hear from the first Japanese company\nto establish itself in Georgia, a great company and a great beginning to the\nrelationship between Japan and Georgia. Thank you.\nYou\nChair recognizes Chairman Sam Watson for an announcement.\nMr. Speaker, subcommittee of preparations to general government be meeting in the CLOB today at 2 o'clock, room 415. Thank you.\nThank you, Mr. Speaker.\nThe Georgia Work and Families Legislative Caucus will meet in room 307 and CLOB, and our\nlunch and presentation will be done by GBPI to talk about the budget.\nThank you, Ms. Speaker.\nChair recognizes Chairman Ballinger for an announcement.\nThank you, Mr. Speaker.\nYour committee for juvenile justice will be meeting this afternoon at 1.\nThank you so much.\nChair recognizes Chairman Corbett for an announcement.\nThank you, Mr. Speaker.\n8 a.m. in the morning, the Motor Vehicles Committee\nwill meet in room 515 in the CLOB.\nThank you.\nThat completes our announcements.\nIf you have a page here,\nyou better come up here to the roster\nimmediately upon adjournment.\nWe're not gonna go looking for you.\nChair recognizes the majority leader of the house\nfor a motion.\nMr. Speaker, I move that this house stand adjourned until 9.30 a.m. Friday, January\nto 20.31, 2020.\nOkay, that's 9.30 tomorrow.\n9.30 a.m., yes sir.\nThe majority leader has moved that this house be adjourned until Friday, January 31 at 9.30\na.m., all those in favor of the motion must say aye, those opposed will say no.\nThe eyes have it and this house will be adjourned until Friday, January 31 at 9.30 a.m.\nYou\n",
  "updated_at": "2026-02-12T16:00:37.044019+00:00"
}