{
  "video_id": "7yOI3Y5gMNU",
  "url": "https://www.youtube.com/watch?v=7yOI3Y5gMNU",
  "title": "Lawmakers Day 28 2025",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 24,
  "summary": "Overview:\nThe Georgia legislature had a busy 28th day session, with a number of notable bills being passed or introduced. The session was marked by a bipartisan approach on some school safety measures, while more partisan debates emerged around a proposed income tax cut and a bill seeking to limit local firearm regulations.\n\nKey Actions:\n**SB 17**: Mandates mobile alert panic systems for schools and requires mapping of school properties to aid emergency response.\n**SB 61**: Adds new charges that students could be prosecuted for in superior court, including terroristic threats.\n**SB 179**: Requires sharing of student disciplinary history when transferring schools and holds parents legally responsible for not disclosing suspensions.\n**SB 163**: Rescinds local city and county laws over guns and weapons, entrusting regulation exclusively to the state.\n**HB 111**: Reduces the state's flat income tax rate from 5.39% to 5.19%.\n**HB 112**: Provides a one-time tax rebate of $250 for single taxpayers and $500 for married couples.\n**HB 657**: Annexes 45 small parcels of land into the newly formed city of Mulberry.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this session.\n\nNotable Moments:\n- Senator Colton Moore's impassioned speech advocating for his bill SB 163 to rescind local firearm regulations.\n- Debate between Republicans and Democrats over the merits of the income tax cut bill HB 111.\n\nVotes:\n- SB 17, SB 179 passed unanimously.\n- SB 61 passed 33-22 along party lines.\n- SB 163 passed 33-23 along party lines. \n- HB 111 passed 110-60, mostly along party lines.\n- HB 112 passed unanimously.\n- HB 657 passed 98-76, mostly along party lines.\n\nAttendance:\nThe session maintained a quorum throughout the proceedings.\n\nAdjournment:\nThe legislature adjourned for the day. The next session date was not specified.",
  "transcript": "You are looking at a live view from under the gold dome where this house is working hard\non the 28th day of the legislative session.\nGood evening and welcome to our special crossover day edition of lawmakers.\nWe have a great line of guests tonight for live interviews.\nThey include Lieutenant Governor Bert Jones, Democratic Minority Whip Representative Sam\nPark, and Republican Senator Sam Dullazal.\nBut first, let's get an update on the day so far from Capitol Correspondent Sarah Callis.\nHi, Donna.\nCross every day kicked off with Governor Camp signing his first piece of legislation this\nsession.\nWhen the mad dash to pass legislation started up for the day, with the Senate passing three\nbills related to school safety.\nSB 17, also known as Ricky and Alyssa's Law, named after two victims in high school\nshootings, would mandate mobile alert panic systems for schools to alert local responders\nto emergencies.\nThe other part of this bill is a school mapping piece, and very simply all it does is require\nthat every school property in the state be mapped so that data is provided when an incident happens\nin real time. Our folks and friends in the public safety community know where to go to find the\nassailant, where to go save lives, where to evacuate people. The bill passed unanimously.\nSenate Bill 61 would add new charges that a student could be prosecuted for in superior court\nincluding terroristic threats.\nI think it's important to point out at this point as well that the bill preserves the existing\nauthority for a DA at any time before indictment after investigation and for cause to decline the\nprosecution and superior court and bring the case to juvenile court for those between the ages\nof 13 and 17. Democrats were less enthusiastic about this bill as it passed 33 to 22 along\nparty lines. And Senate Bill 179 requires the sharing of a student's disciplinary history\nwhen transferring schools and holds parents legally responsible for not disclosing a current suspension.\nIt will require from sixth grade to twelfth grade students would be required to take a minimum\nof one year class or training on suicide awareness and prevention. Also youth-based violence prevention\nand either being recognized as a student\nis potentially going to harm themselves or someone else.\nIt passed 54 to one.\nSenator Colton Moore offered up his first bill, SB 163.\nThe bill would rescind all local city and county laws\nover guns and other weapons,\nand entrust the power of regulation exclusively to the state.\nWhen citizens in northwest Georgia go to a place like Savannah,\nAnd there is a mayor there who has put in ordinances\nthat violate their Second Amendment rights,\nmy piece of legislation simply says\nthat those citizens, just like your citizens,\nhave a right of tort to sue those governments\nfor violating those rights.\nThe often ostracized Republican took his time\nanswering questions from the podium.\nMr. President, I just want to make sure\nI've had one opportunity in five years to present a bill here.\nIf there's any more questions.\nI will be happy to answer.\nYou just want to feel some questions, don't you?\nI want to make sure this thing passes.\nAnd in this case, it was enough, as the bill was passed 33 to 23 along party lines.\nIn the House, members contemplated an income tax cut for Georgians.\nHouse bill 111 would change the flat income tax from 5.39% to 5.19%.\nRepublicans say the surplus allows the state to put more money in the pockets of taxpayers.\nWhile other states are raising taxes on their citizens, and while we're facing sky-high\nprices and can least afford it, we are doing the opposite here in Georgia. We have a\nsurplus budget, and we are able to put money back into our taxpayers.\nBut some Democrats say the tax cut disproportionately benefits the wealthy.\nThe top 20 percent of earners will receive nearly 80 percent of the total tax savings\nwith millionaires receiving thousands of dollars and benefits annually.\nMeanwhile the bottom 60 percent of Georgians, those earning middle class or lower incomes,\nwill see less than $6 a month in savings.\nThe bill passed 110 to 60, mostly along party lines.\nalso unanimously passed HB 112, a one-time tax rebate of $250 for single taxpayers and\n$500 for married couples.\nAnd, Gwyneth Delegation members debated HB 657, which would annex more land for the\nnewly formed city of Mulberry.\nThis bill is about annexing 45 small parcels into Mulberry.\nAll of these parcels are in my district.\nSome Democrats say the issue should have been dealt with on the local level.\nThis process works, it has works, and it recognizes that while bills must come through\nthe legislature, we respect our local governments and will not force things down their throat.\nThe bill passed 98 to 76, an a mostly party line vote.\nThat's my capital report.\nLater this show, I'll speak with House Minority Whitsam Park and Senator Greg Dullesall.\nDonna, back to you.\nOver a turn to Sarah later for some interviews, but first I want to introduce our guests\nin the studio who will offer analysis of the legislative action.\nFirst, someone who has spent several across over days in the Georgia House, former State\nRepresentative Terry Anula Witts from Smyrna, she was first elected in a special election\nof 2017.\nAlso, here is someone else who understands state politics.\nMartha Zoller is a columnist and author, host of the Martha Zoller Show on WDUN Radio.\nran for the U.S. House of Representatives in the ninth congressional district. And I want\nto thank you both for being here. Thank you, great to be here.\nSo let's get started. We're at the 28 days. 28 days so far. I can't believe it. So what\nare your overall thoughts about how it's been? This has been a very different kickoff to\nthe biennial. So you know, the legislature has two years in the biennial. This is the\nfirst year of the two year period, which is good. Something that doesn't cross over tonight\nand something that doesn't pass by Sinai Dai,\nyou have a whole other year, it's okay.\nBut there's the biggest difference\nlooking at this from a house perspective\nis how much faster things are going.\nYou know, the 23 session,\nwhen the next, the first panel,\nwe had a brand new speaker,\nwe had lost Speaker Ralston,\nwe were really as a house coming out of a collective trauma\nand Speaker Burns, you know,\nhe needed to get up and running,\nget his office up and running,\nwe had a lot of new members,\nalmost one-third of the house was brand new.\nSo you have a, you know, you lose institutional knowledge,\nyou have a lot of people who don't even know\nwhere the bathrooms are.\nAnd so it was a much slower start this year.\nI was almost surprised at how quickly things got moving\nin the, you know, in the, in the house.\nIn the Senate, I was less surprised,\nbut the house, things really got off to a quick start.\nAll right, Martha, your take.\nI think the point that you made is a good one\nabout John Burns because he now knows\nwhere he is and what he's doing.\nAnd of course, at the beginning of the session, he had Terry England as his chief of staff.\nOf course, Terry had the terrible accident is doing much better and Chris Riley stepped\ninto that place.\nBut there's an opportunity for him to really get things done.\nI think it's the leadership of the governor, really.\nI think this state of the state was the most direct about what he said his goals were.\nAs far as tort reform, as far as tax reform, that kind of thing.\nAnd I think I've seen the Senate and the House working a lot more towards that because\nhe used political capital in a different way than he'd ever used it where he said, this\nis what I want.\nAnd if I don't get this during the session, I will call a special session.\nSo I think the House and the Senate have been hyper focused on getting these few things\ndone.\nWe definitely had the governor involved from the very beginning.\nYes.\nOkay.\nSo we'll get back to you guys in a moment.\nnow to the Capitol, where Lieutenant Governor\nBert Jones is standing by.\nWe're going to head to the Capitol now.\nWhere Lieutenant Governor Bert Jones is standing by.\nI know it's a busy night for you as President of the Senate,\nso thank you for being with us, Lieutenant Governor.\nDonna, it's good to be with you.\nI appreciate you doing this show tonight.\nAnd, yeah, it's been a long day, but we're almost done.\nAnd we've got some good things on today.\nWell, let's talk about that.\nThe day started with good news for you\nwith the passage of three school safety bills\nthat you've championed after what happened\nat Appalachia High School in September\nthat sold in the death of four people.\nSo, understand, you had a conversation\nwith a juvenile court judge, a sheriff, a superintendent,\nall to get their views on schools\nand how to keep them safe.\nSo, tell us about that that helped push this legislation.\nYeah, this is something I was actually talking about, you know, two years ago before we had\nthe tragedy at Appalachian High School talking about that, we had some soft spots with\nour school systems, and we needed to be for security at both from a personnel standpoint\nas well as from securing buildings as well, so what we did today is not only did we sign\nthe budget that had 50 additional million dollars that we had put into the governor's\nbudget today.\nBut we also had some measures put in place that would help pay for resource officers and\nhelp locals pay for security measures that could, that would automatic lock systems and\nautomatic, you know, 911 calls and things of that nature that we got, that we got finished\ntoday and that's been a prior to your mind for the last couple of years and obviously\nwhat happened at Appalachian really amplified that that need to do it at the state level.\nYes well I want to talk about the more contentious of the school safety bills and\namong other things it adds terrorist acts to the list of offenses by Juvenile's 13th\n17 years old can you they can now be tried as adults so Democrats opposed it saying it\ncriminalizes youth, what's your take on that?\nWell, I mean, you don't have to look any further than the\nthe young man that committed the crimes at Appalachia. I believe he\nwas 14, 15 years old and and and you know he he committed four\nmurders that day that that that he he seemingly was\ncompetent and and what he was doing knew exactly what he was\ndoing and I think a person that get to that age bracket then they are well aware of the\nconsequences of their actions and so trying them as an adult is something that I was\nforward definitely.\nWell the two other bills that dealt with school safety received overwhelming support.\nOne of them, Ricky and Alyssa's Law, will require mobile panic alarm systems in schools.\nCan you talk about that a little bit?\nRight.\nWell, it just goes back to just trying to do what we can to help secure facilities best we can.\nDuring the Appalachian, they had resource offices.\nThey had emergency checkpoints and also 911 call centers.\nAnd because of all those things that they had in place,\nUnfortunately, we had four deaths,\nbut the response time on those from the time,\nthe first shot was fired to the time\nthat they had that young man in handcuffs\nwas literally a minute and 20 seconds.\nAnd they had a lot of these procedures\nthat we're talking about now in place.\nAnd even with all those procedures that had in place,\nthere was still an opportunity for somebody\nto commit a violent crime.\nSo we want to beef up the security best way we can,\nbut we also believe that it's up to the locals\nto determine what is in the best highs and best use\nat their school systems to determine their security measures.\nSo anyways, so I say all that to say\nthat we're putting all these resources in place,\nbut we're also leaving a lot up to the locals\nto determine which ones they'd like to do and not do.\nAnd I'm sure the school systems appreciate that.\nMy last question is how long do you think\nthe Senate will go tonight?\nI don't know.\nWe had some bills that went longer than I was expecting\nas far as the debate is concerned.\nAnd we have about 34 bills available in the calendar\non the calendar for the night.\nand it would just depend on how quick the bills go,\nwhether or not we get to all of them or not.\nOkay, well, we'll be watching.\nI wanna thank you so much for joining us\non lawmakers tonight.\nHave a good evening.\nDonna, always good to be with you.\nThank you for having me.\nAll right, Terry, your thoughts.\nSo there is not a person in that building\nwho doesn't wanna make sure that our schools\nare as safe as they possibly can be.\nWhat I'm gonna be curious in hearing,\nespecially as this bill is discussed,\nand debated in House Committee,\nare the practicalities of actually implementing this.\nYou know, I think about my daughter's high school,\nwhich is a very large high school in Cobb County,\nthey have the panic alarm system.\nIt's worked, it's been tested, they do drills,\nthey've had false alarms, but everything\nhas worked the way it's supposed to.\nBut the other reality is they've got a couple\nof dozen doors on this campus.\nHow do you enforce this?\nHow do you actually implement this?\nHow do you make sure the districts have what they need?\nIt's great if they have the money to buy the alarm systems.\nThey also need to be able to do the things they need to do\nto get their infrastructure,\nto get there, like just the practicalities.\nGo please.\nA lot for the schools to try to figure out.\nOkay, thanks.\nWe're going to go back to Sarah.\nShe is standing by at the Capitol\nwith Senator Greg Dullesall.\nSarah?\nPretty seen the Senate pass dozens of bills today.\nWhat other bills are you hoping will pass?\nWe have bills coming up for health care.\nWe have bills coming up for our military veterans.\nWe have bills coming up for literacy.\nI think we're gonna be here pretty late tonight.\nthe house is working hard as well.\nThey've passed tax cuts or deal with sports betting right now.\nSo it's an exciting day already here at the Capitol.\nAnd so last week the Senate announced efforts\nto investigate former gubernatorial candidate\nCCC Abrams in the New Georgia Project.\nSo you'd be part of that committee.\nCan you talk to me a little bit about that?\nYeah, we were very surprised to hear on the heels\nof the largest ever fine from the Georgia Ethics Commission.\nConversations coming out of DC,\npotentially some other involvement with CCC Abrams.\nSo we want to know what happened\nwith Georgia's campaign's finance laws\nin the 2022 election,\n24 election,\nand the appropriation of $3 million\nof dark money into Georgia's elections.\nWe got a lot of questions from his Abrams.\nThank you, and is there anything else\nthat you're watching?\nAre you feeling so far about how tonight's going?\nYou know, this is a fun day.\nI love the fast moving pace of today.\nI've got a bill on the floor in about five minutes\nto help doctors and optometrist prescribe medicine\nto those in need.\nSo we deal with a broad swath of things here\nin the Senate and certainly excited to see what the surprises\nwill be before the end of the night.\nWell, thank you so much,\nand we'll have to keep an eye on that bill, Donna.\nThanks, Sarah, we'll be back to you in a moment.\nSo that was an interesting conversation.\nSports betting, he said they're talking about it right\nnow in the Senate.\nYes, and I think what's interesting about that\nis that I don't know, 10 years we've been talking\nabout sports betting, I think that is it going to happen?\nIs it not?\nI think probably it has the best chance this year.\nHowever, it's looked all day like it's never going to make\nsea daylight, so we just don't know what's going to happen\nuntil they get to these final bills.\nIt would be interesting to know what's going on right now\nthere. What are you thinking?\nIt will. I know it's made it onto the rules calendar.\nThe house is a little different from the senate.\nThe senate has one rules calendar.\nWhat you see is what you get first thing in the morning.\nThey had the rules meeting yesterday.\nThe house will have rules meeting in the morning.\nThey'll have one at lunch time.\nThey might have one at dinner time.\nSometimes they have them at nine, 10 o'clock at night.\nSo that this is why now sports betting was not on the calendar this morning.\nWe woke up a lot of things happened and now it is on the calendar.\nI hope it passes.\nI've been a longtime supporter of sports betting every year.\nI was in the house.\nThe Atlanta Braves were in my district.\nAtlanta was in my district for a while.\nThey're practice facility.\nI've always been a supporter of it.\nIt is happening anyway.\nIt's happening.\nYou know, these people are using VPNs.\nIt's working.\nWe might as well collect revenues.\nAddiction is going to happen regardless.\nIt is a tragedy, but it is something that does happen.\nbut now we'd have some funds to actually address it.\nWell, and getting it to the voters to decide,\nI mean, I've been a slip personality\nabout this issue over the years,\nbut I will say that what we have right now\nwith the lottery and people are playing games online\non the lottery right now, it's not sports betting,\nbut you're already doing legal, virtual gambling\nin Georgia, it sounds like it could be the next step.\nYeah, and that's been the big argument\nthat that's, it's already happening,\nwhy not bring in money into Georgia?\nExactly, it's happening,\nand these are very regulated industries.\nYou look at co-AMS,\nthe coin operated in news machines\nthat are legal in Georgia,\nhave been legal in Georgia for a while,\nthey're probably one of the most regulated\nof all of Georgia's regulated industries.\nSo these things are happening.\nYou know, we have the all-star game,\nyeah, coming back to Georgia,\nthis spring, sports betting,\nI don't, you know,\nthere's two parts to this, right, too.\nYou have to approve sports betting,\nthen you have to have the constitution.\nand the voters will ultimately be able to decide on this.\nSo we won't have this in place for the all-star game\nif it passes, and I hope it does.\nBut the World Cup is coming next year.\nThis is an opportunity.\nWe have numbers on the revenue that we lose in Georgia.\nEvery time there's a major sporting event\nbecause other states are getting this revenue\nor nobody's getting this revenue.\nIt's regulated, this will go to the lottery,\nit's going to be overseen, it's going to be more money\nfor pre-K, more money for hope.\nI think hope is probably the most popular thing\nthat the state has ever done.\nAnd it's good.\nI think it's a good thing.\nYeah, we've seen a lot of bills, but this is the one\nthat everybody is like, will we, or won't we?\nWill we see it or not?\nI think what's interesting, too, is that it doesn't seem\nto be the kind of social, conservative movements.\nSome things have been introduced with riffs,\nsome things have been introduced on other things.\nI spoke today at the March for Life,\nthat Georgia Life Alliance sponsored,\nand one of the things we talked about,\nthere wasn't a lot going on under the gold dome this year\non that.\nThis gambling could be where all the energy goes.\nOK, well, wait and see, he talked about a lot of other bills\nthat passed in the Senate today.\nAnd the Senate has, actually, I have the list here.\nThere is quite a few.\nYou saw that the Lieutenant Governor said\nthere were quite a few still left to go through.\nThis is going to be a busy night.\nAnything in particular that you're looking at?\nSports betting is a big one that I'm looking at.\nBecause again, I think that it is long overdue.\noverdue. This is something that we need to do for Georgia. The other issues that I'm looking\nat, you know, some of them we're going to see in the next 12 days, right, between now\nand signing die. The thing, a lot of the issues addressing transgender youth, youth sports,\nthings like that. We're going to have a lot more debate about that as those move through\nthe House. There, I don't think the House has passed out anything nearly as controversial\nas, you know, I don't think the Senate can expect nearly anything as controversial, but\nI know that the things that I am looking for tonight, you know, really the big one is\nsports betting.\nI think if it can cross this hurdle, if it can get through the house, which is never\ndone before, it's made it through the Senate, hasn't made it through the house, I think\nthat is going to be an issue to watch.\nYeah.\nWell, and the really big things have kind of gotten through.\nYou've gotten tort reform through one side.\nYou've got the tax cuts through one side.\nIt's going to be really interesting to see how all of this plays out because the kind\nbig initiative. Certainly we got the final budget which still will have its past one house\nwon't we'll get through the other but there's a lot of work to do but it does seem less\ncontroversial. Everyone I talked to you today as I was going through the Capitol was like\nit's so quiet today it's so quiet yeah it was a very different energy today than what you normally\nhave and I think that goes back to what I said initially were the governor and the speaker\nand the lieutenant governor had a lot of control over this agenda this time.\nYeah.\nThere is.\nAnd I think in terms of the energy of the Capitol, there's a lot of waiting for the\nother shooter fall.\nYou know, I was there on Tuesday of this week when several of – several of pretty\ncontentious bills were being debated on the Senate floor.\nThere were a lot of activists there.\nIt was pride day at the Capitol.\nAnd there was a contrast between the energy and the mood there today and how it was earlier\nthis week.\nBut I think as things ramp up, especially as the House is discussing some of these more\ncontroversial measures, we're going to see a lot more people.\nOkay.\nWell, we're going to hit back to the Capitol where Sarah Callis has House Minority Whip\nSam Park.\nThank you, Donna.\nRepresentative Park, we saw the Democrats\nat a press conference about an hour ago,\ntalking about some priorities for working families\nyou're hoping to get through.\nCan you hit some of the highlights?\nAbsolutely.\nGeorgia Democrats, we remain focused on focusing\non lowering costs for Georgia families,\non expanding access to health care, to education,\nand of course, ensuring safety for all of our communities,\ncertainly from gun violence.\nUnfortunately, from the Republican Party, from Republicans, we are seeing a lot of really\nextreme divisive cultural issues that do nothing but continue to divide people.\nAnd so you spoke on the House floor earlier today against proposed tax that for Georgians,\ncan you explain that to me?\nAbsolutely.\nSo there are two bills, one 11 and one 12.\nGeorgia Democrats, we all supported House Bill 112 because that provided tax rebate that\nwas fair that provided $250, $375, $500 back into all Georgians' pockets, $111, that's a\ntax cut for the rich. The way in which it was structured, $500 million would go to the\ntop 20% of earners while the average Georgian making around $50,000 to $60,000 received $6\na month.\nWell, thank you so much for being here, Donna. So much, Sarah. We don't have a lot of time,\nBut I want to get some final thoughts from each one of you, so I'll start with you, Martha.\nWell, quickly, I'm watching John Kennedy's bills on absenteeism in schools, as well as\nchanging the way we do superintendents, which is a maddubnic bill.\nSo those are the two ones that I'm watching closely.\nOkay.\nWhat about you?\nI'm disappointed that with all the talk that we've had about school safety, whether it relates\nto the alarm system, whether it relates to sports, I'm disappointed we haven't had more\ntalk about meaningful, common sense gun reforms.\nand it looks like we're not going to have that today.\nI don't think that that's happening this session.\nAnd we did see the Senator Colton Moore\nhad his bill that dealt with the Brady Law\nwhich will eliminate everything dealing with Brady.\nYeah, and I actually saw him with a little bit of a sense of humor\nwhich is not something you usually see from him.\nSo maybe we're seeing a turning tide.\nYeah, we'll have to see. That was all in the Senate.\nAny thoughts on that from you?\nI don't think that something that the vast majority of voters in Georgia would really\nembrace.\nOkay.\nWell, and we get to see what's going to happen in the House and the Senate with each\nof these bills.\nLast year, some of the bills passed in one chamber and never made it anywhere in the\nHouse.\nAnd sometimes they get substituted later.\nSo I'll be popping some popcorn.\nSo yeah.\nWe'll do that.\nAnd then this stripping begins.\nThat's it.\nWell, yeah.\nTaking the bills out.\nThank you both for being here today.\nThank you.\nAppreciate that.\nThat does it for lawmakers tonight.\nWhen each chamber will start looking at legislation passed on the other side, that's when we begin to see which bills will actually become laws.\nHave a good...\n",
  "updated_at": "2026-02-12T18:19:38.679191+00:00"
}