{
  "video_id": "84hY111b-0I",
  "url": "https://www.youtube.com/watch?v=84hY111b-0I",
  "title": "Rules Meeting for Day 32 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 32,
  "video_date": null,
  "duration_minutes": 22,
  "summary": "Here is a summary of the Georgia Rules Meeting for Day 32 of the 2025 Session:\n\n**Overview:** The session included discussions on several bills, including ones related to military families, healthcare worker licensing, autoimmune disease awareness, judicial circuit expansions, Medicaid compliance, and wages for individuals with disabilities. There was some procedural discussion as well.\n\n**Key Actions:**\n- **SB 109:** Legislation to address insurance coverage issues for families of National Guard members killed in accidents\n- **SB 191:** Bill to streamline healthcare worker licensing and credentialing processes\n- **HR 463:** Resolution to designate March as Autoimmune Disease Awareness Month in Georgia\n- **SB 145:** Bill to add a 6th judge to the Augustus Judicial Circuit \n- **SB 276:** Agency bill to bring Georgia into compliance with federal Medicaid requirements\n- **SB 55:** \"Dignity of Pay Act\" to prohibit paying individuals with disabilities less than minimum wage\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Discussion of concerns over a proposed \"America First\" license plate\n- Procedural discussion around scheduling of a committee meeting at 6am\n\n**Votes:** No recorded votes mentioned.\n\n**Attendance:** Quorum present to conduct business.\n\n**Adjournment:** The transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "Good morning everybody good morning if you if you would please come in members take\nyour seats and we'll get started we were waiting a couple of minutes there was\nsome committee meetings going on that I think they're if dismiss of those\nmembers can join us now but we'll we'll go ahead and start them will ask\nJim Weaves, the opening for your order, prayer, please.\nThank you.\nThank you.\nLet us pray.\nA father guy would thank you for the gift of this day of the award.\nWe would just pray that you bless each one of us and give us the wisdom and sermon that you would have us use in matters for us.\nPlease bless our families.\nThose that are serving the capital fund and all these things we ask you pray in Christ now.\nThank you, sir.\nOkay.\nOkay, let's start.\nWe'll hear from our Senator Prins.\nSenator, come on up.\nYes, sir.\nThank you, Mr. Chairman and members of the committee.\nIt is my pleasure to bring before you today,\nSenate Bill 109.\nSenate Bill 109 grew out of the tragedy\nof one of my constituents in Columbus, Georgia\nthat had a son, a member of the National Guard,\nwho was killed in an automobile accident,\nand he had been covered by a particularly insurance,\nand that insurance refused to pay.\nHe contacted the office.\nI turned contacted Commissioner King's office,\nand we worked together to come up with this piece\nof legislation, hopefully this will never happen\nto another member of our armed services again.\nThis helps military families,\nand the prayer for this will allow that to happen again.\nOkay, thank you, Senator Harbson.\nI don't see any questions for you.\nThank you, sir.\nThank you, sir.\nYes, sir, Senator Centric.\nMorning, Chairman, committee.\nI'm here to present Senate Bill 191,\nwhich is the identical language of House Bill 569,\ncarried by a freshman representative, Jud Howard.\nIt passed the House on March 4th, 170 A's\nis zero nays. It is an identical language bill for the Department of Labor\nhaving to take any questions. Okay, don't see any questions. Thank you, sir.\nThank you, sir.\nThank you.\nThank you, Mr. Chairman. I always like to give up date on our finance committee.\nWe passed out 12 house ways and means bills last week. Should pass out six possibly seven\ntomorrow. So we've got a bunch of them, but we're working through them over there.\nMy Senate bill 162, this has been about a year in progress.\nWe've used the medical students as the guinea pigs,\nbut in the meantime, the composite medical board\nhas procured new software that's used\nand proven in other states.\nSo we got licensing and credentialing.\nIt's taken about seven months,\nsometimes longer to get somebody in the system and working.\nWe think with the licensing part,\nwe can have that done with a couple of weeks\nthe Georgia Hospital Association is supportive of using this same system to\ncredential people. So we will be able to have people working in two weeks instead\nof many months in our health care system. It's going to be a great thing for our\nstate. And I also will help us get people from out of state who you tell them\nwell I want to hire you but you can't come here for seven months they're less\nlikely to come. Additionally there was added under this bill at the request\nthe composite medical board, some language that had gone through chair Cooper's committee\nwhere they were trying to regulate off-level use of ketamine, that part's not mine but\nI do support it.\nOkay, you've got a question for it, Prokteam.\nI just had a question, Senator, which healthcare workers would this pertain to?\nWell, this is only the composite medical board, so it will be the physician, so I know there's\na separate, I'm not part of that, we kind of split it up, there's separate going on\nwith the Secretary of State with nursing, so it would be the physicians, the PAs, the\nAA's and the Advanced Practice and Nurses Protocol agreements.\nSo, would apply to nurse practitioners?\nIt would apply to nurse practitioners.\nThank you.\nOkay.\nI don't see any other questions.\nThank you, sir.\nThank you.\nYes, ma'am.\nGood morning, Mr. Chairman and rules of members of the rules committee.\nI'm Sylvia Wafer Baker.\nGood morning, Mr. Chairman and members of the rules committee.\nI'm Sylvia Waffer Baker.\nThis is House Resolution Bill 463.\nThe proposed resolution seeks to designate March as Autoimmune Disease Awareness Month\nin Georgia.\nAutoimmune disease has impact thousands of Georgians disproportionately affecting women\nand people of color, yet awareness remains low.\nEstablishing this month of recognition will help raise public awareness,\nencourage early detection and diagnosis and support research\nand policy initiatives aimed at improving patient outcomes.\nRecognizing autoimmune disease awareness month demonstrates\nGeorgia's commitment to help equity and highlights the state's dedication\nto supporting residents facing these chronic,\noften invisible illnesses.\nThank you, and I welcome any questions.\nOkay, thank you, ma'am.\nI don't see any questions.\nSenator Burns.\nThank you, Mr. Chairman, committee.\nI bring you, Senate Bill 145.\nThis is the Augustus Judicial Circuit\nto add a six judge.\nI want to thank Representative Newton\nfor his support in the House\nand his identical bill that he sponsored.\nand I look forward to your favor, consideration.\nOkay, you have a question,\nif you can, how long does it keep going?\nYes, sir, not pertaining to the bill,\nbut to my good friend, the senator\nwith all of your pedigree.\nOh, my.\nI'm in trouble.\nI've noticed that we have a meeting\nin Senate public safety tomorrow morning\non the speed zone camera bill.\nIs that a threat?\nIt's 6 a.m.\n6 a.m.\nYes.\nNot of my making is there any chance\nwith all of your influence\nYou can get them to meet at a normal time impossible now that is Senator Robertson and I take no responsibility for the sketch\nBut I look forward to seeing you at 6 a.m. 6 a.m.\nThat's pretty early\nOkay, don't see the other questions. Thank you. Thank you, Mr. Chairman\nOkay, come on\nThank you, Mr. Chairman, thank you, committee members.\nI appreciate you here in Senate Bill 276 today.\nThat's LLC number 520780, Senate Bill 276 as an agency bill brings Georgia into compliance\nwith federal requirements.\nThe U.S. consolidated appropriations act of 2022 requires states to have laws in effect\nthat bar-level third-party payers from refusing medical,\nrefusing payment to Medicaid for a service based solely\non the fact that prior authorization was not issued first.\nMedicaid is the payer of last resort\nand only pays for covered services\nif there's no other liable parties.\nThis could be a commercial insurance plan,\na lawsuit settlement, or a workers compensation settlement.\nThe bill would help uphold the integrity of the Medicaid\nprogram increase revenue to the program. As payment by primary sources are unavailable\nto be denied based on a requirement for prior authorization. Mr. Chairman, I'll take\nany questions. Okay, Senator. No seeing any questions. Thank you, sir. Thank you. Senator\nThank you, Mr. Chairman and members of the committee.\nThis is Senate Bill 55, LC55-0416, and it's named a Dignity of Pay Act.\nThis bill is about stopping certain employers, which is community rehab program, from paying\npeople with physical and mental disability less than the federal minimum wage.\nand one of these agencies actually pays a little 22 cents an hour to follow up on the question by Madam Peruvian.\nI had no parents that reached out to me about this bill. So, thank you.\nI hope you know, don't see any questions. Thank you, Senator.\nThank you, sir.\nGo ahead.\nNo, no questions.\nGood morning.\nSB 291 is on page one, halfway down.\nThis is the last bill under modified open rule.\nThere's a special seed license plate.\nGot a beautiful picture of the American flag\nthat'll be displayed on people's car tags\nwith two words across the bottom.\nIt says America first.\nOkay.\nDo you have a question?\nIt's a move.\nThank you, Mr. Chairman.\nI do have some concerns as we have\none of the only Jewish legislators in our caucus who has expressed extreme\ndistress over the affiliation of America first by anti-war and Nazi\nsympathetic organizations in World War II. Have you had an opportunity to speak\nI have not spoken to her this session at all, no, ma'am.\nWell, that is a concern of mine and hers, and I certainly would respectfully request that you speak to her about this particular conversation with her.\nThank you.\nwith part. Thank you, Mr. Chairman. Senator Gooch, I know you've introduced this a few times\nor came and requested this bill a few times last year. What organization would these proceeds\ngo to? We'll go into the general treasury of the state of Georgia.\nOkay. Leader Heagley, did you have a question? Okay. Okay. Don't see any other questions.\nWhat do you mean, Chairman Jansker says?\nThank you, Mr. Leder.\nAppreciate you bringing this bill,\nbecause I just want to put a good word in on this,\nis that this is one of the few bills\nI see many positive comments,\nso I'm normally going to get negative comments\nto enter the gauge.\nBut this is one that, last and split,\nthat I've gotten many positive comments\nand appreciate you working on this.\nSure.\nThank you.\nOkay.\nThank you, Senator.\nThank you.\nYou guys have a good day.\nYes, sir.\nThank you.\nMr. Chairman, members of the committee, page two, halfway down is SB 121, and it has to\ndo with limits of liability carried by someone who is convicted of DUI.\nOur current Georgia limits are 25, 50, 25, which is 25,000 per person by the injury, 50,000\nper accident, and 25,000 for property damage.\nThose limits have not been raised in 14 years from that standpoint.\nWhat this bill does is on the first defense for someone convicted of DUI, and by the way\nDUIs are up 43% since 2019, it would have to increase their limits to 50, 150.\nIf they have a second offense and their license are reinstated, those limits would go to 100,\n300, 100, 100.\nAnd they have to carry those limits for three years.\nFlorida in 2007 passed legislation for DUI and their first\noffense is 100, 350 on the first go.\nAnd so this is kind of a middle ground.\nBut what's happening today is that our cars are worth so much\nmore than it really are today.\n25,000 just does not get it done.\nAnd the medical is also there.\nAnd this is just a simply a bill for those people who are\nconvicted of DUI.\nIt will require them to raise their limits.\nOK.\nThank you, Senator.\nDon't see any questions.\nWhoops, I'm sorry, excuse me, proteam has a question, excuse me.\nI have a quick question, thank you for your bill.\nWould this also apply if you were driving under the influence of drugs?\nI believe both drugs and alcohol are going to be addressed the same way, as I understand\nthe drug side, especially with some of the marijuana issues, you just have to show that\nyou have it in your body, it does not matter about the level of how much is in there.\nOkay.\nWe have one more question. Chairman Hawkins, did you have a question?\nThank you, Chairman. I think this is a good bill. We heard it at the insurance, but I hope\nthe senator will come back again next year and raise that 50 to 125,000 right now.\nI wouldn't cover a pick and fence. So I think we'll look forward to more work on this\none from you. Thank you. Thank you. Thank you, sir. I don't see you more questions.\nthank you. Senator? Good to have you with us.\nI'd be with Mr. Chairman and the committee members.\nI'm very important to Senate Bill 88. Just as a fourth judge to the Douglas Judicial Circuit,\nDouglas County ranked number two on the list for a new judge and it's in the budget and\nask for your favorable consideration. Okay, you don't see any questions. Thank you, sir.\nMr. Chair, members of the committee, bring before you, Senate Bill 51, near the top of\nthe second page, relates to the qualification-based selection of architects and engineers.\nSimply take the time-tested process in which architects and engineers are hired by the\nfederal government and by all state agencies in the plaza to city and county governments.\nThank you, I don't see any questions.\nSenator Cowson.\nThank you, Mr. Chairman.\nI bring with us today on page 2, Senate Bill 98.\nThis is an agency bill for the Department of Community Health and Aging Services Division.\nWhen we revised the guardianship codes a few years ago, we provided that a county guardian\nwould be the guardian of last resort if a person that was a minor or an incapacitated adult\nneeded a guardian and it wasn't a family member or a close friend of some sort to serve\nin that role.\nThe county would appoint the county guardian.\nWe omitted to put in a county conservator, conservator handles the assets of an incapacitated\npersonal and minor versus the major lifetime decision.\nSo when you have an elderly person with dementia\nand they have assets that need to be maintained\nand preserved in their expenses paid,\nwe didn't designate the county guardian,\ndo that role, this designates a county conservator\nwhere the guardian applies in the code\njust so we can be clear there'll be somebody\nto protect our aging population.\nOkay, thank you Senator, don't see any questions.\nThank you for them.\nSenator Walker.\nGood morning, Mr. Chairman and House colleagues.\nGood to see you all this morning.\nI've spoken to Senate Bill 35 once before, Mr. Chairman,\nbut it simply gives Georgia homeowners more time\nto get notification if their homeowners insurance\nis being non-renewed.\nCurrently they're required to give 30 days notice of a non-renewal. This would change that for the insurance companies to have to give 60 days notice.\nOkay, don't see any questions.\nThank you sir.\nYes sir, Senator.\nMr. Chairman, committee, I have Senate Bill 110, this is basically the free range bill\nthat basically addresses and changes the definition of the lack to allow for more personal responsibility\nof parents to manage their kids.\nAnd I'll chill.\nOkay.\nNo questions.\nThank you, sir.\nThank you.\nOkay.\nAny members of the committee have a request?\nDon't see any. Okay. Let's set a calendar for today. This will be under modified structure.\nSenate Bill 6. I have moved in second. Is any opposition? It's on. Senate Bill 35.\nmove the second in the opposition it's on Senate bill 55 in the opposition it's\non Senate bill 88 move the second in the opposition it's on Senate bill one\nThe second in the opposition, it's on, Senate Bill 145.\nSecond in the opposition, it's on, Senate Bill 276.\nSecond in the opposition, it's on.\nOkay, that sets our calendar for today.\nI want to thank you all for being here today.\nI'd like to you to join me at 4.30 this afternoon in this room at 4.30 for a\nrules committee meeting. Thank you. We're adjourned.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T17:53:04.108647+00:00"
}