{
  "video_id": "8jgUK_hglEs",
  "url": "https://www.youtube.com/watch?v=8jgUK_hglEs",
  "title": "Georgia Rules Meeting 2026 - Day 10 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": null,
  "duration_minutes": 38,
  "summary": "Here is a structured markdown summary of the Georgia Rules Meeting 2026 - Day 10 AM Session:\n\n## Overview\nThe session focused on discussion and consideration of several bills, including HB 350, HB 522, and HB 676. There was some debate around the merits and rationale for the bills, particularly HB 522 which dealt with COVID-19 vaccination status and organ transplant decisions.\n\n## Key Actions\n**HB 350**: Bill dealing with pre- and post-exposure medication for HIV, with limitations on pharmacist protocol and physician involvement.\n**HB 522**: Bill prohibiting the use of COVID-19 vaccination status as the sole factor in denying a patient placement on an organ transplant list.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n## Notable Moments\n- Discussion around HB 522 and whether it appropriately balances medical professionals' expertise versus political factors around COVID-19 vaccination.\n- Acknowledgment that HB 350 was carried over from the previous year's session.\n\n## Votes\nNo recorded votes were taken during this session.\n\n## Attendance\nA quorum was present, though some members were delayed due to inclement weather.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified.",
  "transcript": "good morning everybody good morning come on in and have a seat and we'll get\nstarted we're running a few minutes late this morning on purpose are several\nthings going on and I think some were still stuck in the snow or something so\nwe've given a few minutes to get here but good to have you all with us this\nmorning we'll go ahead and open up our meeting and ask Sherman Jasper's if he\nwould to open us with a word of prayer. Okay, thank you, Mr. Chairman.\nIt's all good with a Lord of Prayer. Heavenly Father, thank you for letting us\nbe together today and hopefully it'd be very hard to do your will, your guidance\nevery day, or please put your arms around the family in Glenette County, the\nloss of this law enforcement officer over the weekend. The tragedy that's for\nthat community, please just guard them with your care. Please look after us and\nkeep us safe and our first responders and EMCs and a great job they did this\nweekend, but thank you. Thank you, Chairman. Okay, we're going to go ahead and hear from\nour folks that want to present a bill to us today. So, just come on up and talk to us.\nThank you, Mr. Chairman. Great to be here. This bill is the very last one on your sheet,\nit bill 195. It's kept over from last year. Some people liked it so much. They\nattached a bunch of other stuff to it and it didn't ever make it through the\nprocess. So this brings it back with a chairman's position permission to the\noriginal bill. It deals with pre and post medication for HIV. We have one of\nthe highest rates of that, particularly in the metro area here in Georgia. It\nIt limits it per the chairman's suggestion\nto pharmacist protocol with only 10 pharmacists\nwith a physician so that it doesn't bring it out of state\npeople, they have to be a in-state physician and everything.\nBottom line is it will improve the quality of health\nand from what we've seen with other states\nit will save us tens of millions of dollars.\nThe medicines about $26 the cost of treating HIV\nis about $420,000 into a million dollars.\nAnd seeing my chairman come in from ways and means,\nI do want to mention too, that I passed out 31 house ways\nand means bills last year the most of any chairman.\nI'm apparently way too easy in that committee\nfrom what I hear.\nAnyway, entertaining questions, Mr. Chairman.\nThank you.\nWe do have a question.\nSecretary, thank you.\nThank you, Mr. Chairman.\nChairman Hussler, thank you for being here with us.\nYou mentioned that last year we had needed\nto put a few bills on this legislation\nthat they're off now?\nThey're off now.\nI'm assuming all of them made it out of the Senate last year.\nI don't think they made it out of the house,\nbut I'm not sure that the one in particular\nnever got out of the house committee to my understanding.\nAnd I didn't add to that the department,\nsince we didn't get it out last year,\nthe Department of Public Health did do an emergency order\nfor the post-medicine to go ahead\nand let that be available.\nAnd there was some urgency to it at that time.\nChairman, a ways of means has a question for you.\nI was just going to thank him for all those bills.\nI know they, Mr. Chairman, we worked very well together.\nI just wondered how many of those passed out in the form in which they left the house.\nProbably about as many as ours past year committee in the same form,\nbut I think some of them were substantially the same.\nThank you, Senator.\nAny other questions?\nThank you, sir.\nChairman Gallagher.\nThank you, Chairman and members of the committee.\nBring forth two bills.\nFirst one is House Bill 140.\nIt's the second one on the sheet.\nThis bill addresses a practice referred to as taxation by citation by placing reasonable\nlimits on percentage local government's general fund may be derived from ticket fines and\nfees.\nAt the request of GMA, this bill was amended to provide a four-year implementation runway, allowing governments time to plan and adjust the revenue structures.\nAnd additionally, as part of that compromise, the cap in this version is set to 15% rather than 10%, which was in last year's bill.\nThis approach balances transparency and fairness for citizens with practical flexibility for local governments and reflects collaborative work with our stakeholders.\nOkay. Don't see any questions on that. What's your other one?\nThe second one is House Bill 522. This is a bill that addresses a narrow, very important\nissue access to life-saving organ transplants. It provides that the COVID-19 vaccination status\nmay not be used as a sole determining factor to deny a patient placement on an organ transplant\nlist. If this bill becomes law of medical professionals, we'll still retain full authority\nto evaluate overall suitability, risk, and clinical outcomes, and I think it's important\nto call out this past in 2024, past out of the house in 2024, and ask for your favourable\nconsideration.\nOkay.\nMr. Evans, you have a question for us, okay, go ahead.\nThank you, Mr. Chairman.\nChairman Gullett, thank you for both of your bills, but with respect to HB522, are there\nany medical organizations that have come out in support of HB522?\nI don't know, not that I'm aware of.\nThank you.\nThank you.\nI have another question, Mr. McMillan.\nThank you, Mr. Chairman.\nHello, Mr. Chairman.\nTo kind of piggyback on what my colleague just asked you, is there some specific medical\nor scientific data that you are relying on that will contradict what medical professionals\nthink are suitable, unsuitable as it relates to organ transplants?\nSo a number of vaccinations, we have a number of vaccinations.\nA number of vaccinations aren't always included in this.\nThis is something as COVID has evolved, COVID continues.\nJust because you get the vaccination doesn't mean\nyou're not susceptible to COVID similar to the flu now.\nAnd this is not all medical professionals require this,\nbut some do and is solely determining,\nlike that's the sole determining factor.\nYou be every other criteria of expected good outcome\nbut because maybe you have a religious reason\nfor not getting the COVID vaccination,\nyou can't get the vaccine in some facilities.\nAnd this just makes it to where that's not the sole\ndetermining factor.\nJust a follow-up question.\nSo I guess what I'm trying to understand is,\nwhy are we trying to supplant the well-educated,\nwell-researched positions of medical professionals\nabout who should receive an organ transplant\nand who shouldn't and what those requirements should be?\nIf this is, if no medical organizations have asked the state\nto enact this kind of legislation,\nwhat is the basis for it?\nI think the basis is that COVID,\nthe COVID vaccination became a political thing.\nPeople didn't get that vaccination.\nA lady came and testified in my committee,\nor in Chairman Hawkins' committee.\nShe was 41 years old, had a renal kidney failure,\nmet every other criteria.\nAnd there's a hospital here in Georgia\nthat wouldn't put her on the list.\nThe next hospital down the street did,\nbut it caused a lot of strife.\nShe had seven kids, one was three months old at the time.\nThis just balances that for COVID vaccination\nisn't the sole determining factor.\nAnd I think that's, it's not really a true value\nin determining whether someone's gonna be successful\nby your vaccination status of getting a transplant.\nBut is there any other qualification other than COVID\nOr, you know, I guess what I'm trying to understand\nis if medical professionals make determinations\nand draw lines in the sand about who is appropriate\nfor a transplant and who is not in your right,\nthis has become political and I think that's why\nI'm questioning you here.\nIs this, this does not appear to be based in medicine,\nit does not appear to be supported by medical experts\nor research.\nAnd so this body has in the past attempted to interfere\nwith the decisions that trained medical professionals make.\nAnd I guess my question is to you,\nwhy isn't this political?\nWell, I think that trained medical professionals\nare called practice medicine,\njust like you practice law, not all of them agree.\nNot all of them agree that that's the best practice.\nSome of them hold to it, some of them don't.\nSo this just levels the playing field for people\nwho've decided not to get the COVID vaccination for\nwhatever their reasons are and allows them to get a kidney transplant if they're\nsuitable in every other way. Okay, you've got a couple other questions.\nChair Cooper has a question. Thank you, Mr. Chairman. I have a question. It\nreally gets down to it. It's not the sole factor. There are many, many factors that\ndetermine whether a patient can have a transplant or not. Whether they drink, how\nlong they drink, whether they smoke on the second transfer. It just says this\ncannot be the sole determined because there were some places across the country that had\na knee jerk response to COVID and just gave a blanket thing if you didn't have the vaccine\nyou couldn't work the hospital or you couldn't do this and it prevents it when people need\na life-stating treatment like a transplant.\nThank you for that.\nOkay.\nChair Martin, is that your button?\nYes, sir.\nI think the chair lady covered my thing, but I'm just a regular guy here, and I'm trying to follow that last line of questioning.\nDoes this do anything to supplant any the Hartzscher's judgment? I don't read it, it does.\nNot at all.\nIs it not, in fact, just as the gentleman stated,\nyou cannot use this as the sole practice\nif you meet all the other criteria.\nThat's correct.\nBut you can still consider it in combination\nwith other comorbidities or co-health issues.\nExactly, yes.\nThank you.\nThank you.\nOkay, no other questions.\nThank you so much.\nJim Bonner.\nA good morning, Mr. Chairman, members of the committee.\nI've got two veteran-related bills to present.\nThis morning, the first is House Bill 110.\nIt's at the very top of your sheet.\nThis is a piece of legislation we worked on for the last couple of years.\nIt provides a state-level civil penalty for members of the title-pont industry that do,\nthat would do business with service members.\nCurrently, that protection is offered under federal law and the Military Lending Act,\nbut this simply adds a state-level protection\nfor our service members.\nOkay, I don't see any questions.\nWhat's the other one?\nThe next one is House Bill 985\nthat's towards the bottom of your sheet.\nThis is a piece of legislation brought\nto us by the Department of Veteran Services.\nThis does two things.\nIt provides a little clarity to a bill\nthat we passed last year that related\nto our state veteran cemeteries.\nAnd it also adds one additional category\nof folks that are eligible to be buried in those cemeteries.\nAnd this is a, members of the lay ocean community,\nthe mung community, specifically those fighters\nthat fought alongside U.S. personnel and Vietnam.\nOkay, no questions.\nThanks, sorry.\nThank you.\nWe have to end you.\nThank you, Chairman.\nThank you, members.\nIf you would look on the back of your blue sheet\nsecond from the top House Resolution 251. It proposes an amendment to change the Constitution\nthat would ensure all probate judges are elected in nonpartisan elections. It also includes\na plan for this change to be approved or rejected by the citizens of Georgia. This resolution\nwas brought to us and supported by the Council of probate court judges, the Council of Magistrate\nCourt Judges, the Judicial Court of Georgia, and former Georgia Governor's Nathan Dill and Roy\nbarns who have co-authored a letter of support and I've attached it for your review.\nThank you.\nOkay.\nI don't see any questions.\nThank you.\nAbsolutely.\nGood morning, Mr. Chairman.\nI have two bills in front of the committee today.\nI'll start with HB676.\nThis bill provides a fine for leans that are placed on properties frivolously.\nThis bill provides a fine for leans that are placed on properties frivolously because it's very specific on what it requires you to file a lean on a property and if doing so.\nAnd without those rules in place, there would be a penalty.\nOkay, go up to any questions, what's your next one?\nThanks, sir.\nNext is HB-946.\nThis bill allows opens up options in order to hunt feral hogs, including locating them\nwith a drone.\nThis bill came from a constituent that reached out to me, had a feral hog problem on their\nproperty.\nThat's becoming worse and worse in the state of Georgia.\nI reached out to DNR for clarification on if they could use drones at which point we\nwere told they were not, and DNR asked and supported me right in this bill and carrying\nit with the hopes of diminishing the pharaoh hog population.\nYou got a question for me.\nThank you, Mr. Chairman.\nRepresentative Clifton, is this being done in other states?\nThat's a great question.\nI'm not sure.\nThis was all on my help with DNRs reaching out.\nI didn't look to any other states to determine how they do and don't do things.\nI know there are other states that allow other ways of killing hogs, and based on the\nquick conversation with DR, that's not something they were ready to do, move forward with.\nSo I'm not aware of what other states have done here.\nIf you could find out, I'd like to see a video of this.\nNow, just to be clear, we're not killing hogs with drones.\nWe're just using them to fly around, see where they are, come back.\nThese drones will not be armed, they will have no way of killing hogs.\nI'll be honest with you, since we're joking, I did ask DNR to consider a limited amount\nof permits with this, that was denied and so we're going to stick with this right now\nand maybe in the future we'll look at that.\nYou got a drone expert behind you, he's making it a lot in you.\nOkay, speaking of experts, we got another question from Chairman Powell.\nThank you.\nSorry, you tell them, are you telling us that DNR says that you can't use a drone to locate\na pack of ferrule hogs?\nThat's correct. Currently, you cannot use a drone to locate any wildlife with the intentions\nof hunting them. This relinquishes that to feral hogs only so that you will be able to\nuse Fire Emblem to look at your property. I also want to add this is just private property.\nThis would not be state property or a federal property. This is under private use for private\nproperty.\nAnd I guess if that's so, then they probably wouldn't allow us to use others to get rid of some\nof these new research near populations if we've got certain courses.\nAs of right now, that is not in this bill to work on any deer.\nThis is specifically to Farrahawks.\nOkay, thank you.\nChairman Martin.\nWhen you all speak, use your mic,\nhold it up close, everybody here, please.\nChairman Martin.\nI just want to be clear.\nSo what you're saying is there are no Farrahawks hurt\nduring the filming of these videos.\nThat is correct, sir.\nNo ferrohoves will be hurt in the location of these.\nI can't say what will happen afterwards.\nOkay, yeah, I think they exhausted all the questions.\nThank you, sir.\nThank you, Mr. Chairman.\nNow we have a drone expert, Chairman.\nTodd Jones.\nThank you, Mr. Chairman, members of the committee.\nSir, I have two bills.\nThe first one is House Bill 987,\nthe fourth from the bottom on the first page.\nAnd we've seen a transition of our workforce 15 years ago, one in six Georgians were independent contractors in some way,\nnot necessarily full-time, but also as side hustles.\nToday, that number has increased to one in four are doing it primarily as gig or as side hustles.\nThis bill allows for effectively voluntary benefits to follow them and\nthem to be able to voluntarily take money out of the pay that they're due to go into a dedicated account that would allow them to pay for health,\non employment insurance, 401K, et cetera.\nIt's a great way to support the more modern workforce.\nOkay, don't see any question.\nWhat you had another one.\nThank you, sir.\nThe next bill is House Bill 991.\nThat's the third from the bottom of the first page.\nThis is essentially a allowing for healthcare gig workers\nto be able to participate vis-a-vis a platform\nwhere they can pick up one or two shifts a month.\nAnd this would allow them to maintain their classification\nAs 1099s typically these are nurses PT's OTs. They already are W2s at another hospital\nBut they're picking up a shift or two during the month and this would allow them to maintain the classification as a 1099\nOkay, don't see any questions. Thank you, sir\nThank you, miss chairman. I have house bill 295 three down from the top\nThis allows property owners to seek relief in counties or cities where the local government\ndoesn't enforce local ordinances in state law.\nOkay, good job, no questions, thank you.\nI'm sorry, excuse me, there is a question, I didn't see, excuse me, 38, represent Evans\nThank you, Mr. Chairman.\nRepresentative Gaines, I'm looking online, 94.\nAnd it says the owner, right before that line, 93.\nIn an action brought pursuant to this paragraph, the owner shall not be liable to the local government for attorney's fees or costs.\nAnd then it goes on to say that a prevailing owner shall be awarded attorney's fees and costs.\nany other place in state law where we forbid a judge from exercising\ndiscretion to root out frivolous lawsuits that may be brought by homeowners\nagainst our cities.\nSure. So in on lines 118 through line 122, it does say if an owner files one\ntime and is unsuccessful and they file again, so therefore, you know, possibly a\nfrivolous situation. Then in that case, the property owners actually responsible\nfor the attorney's fees, and that's something we work with ACCG and GMA, and that was actually\nadded in committee last week.\nBut you acknowledge that a frivolous lawsuit can be the first in time as well.\nWhy would we forbid a judge from exercising discretion?\nThis body spent a lot of time trying to root out frivolous lawsuits.\nWhy would we tie a judge's hands in line, 93 and 94, when we acknowledge on the next\npage that could very well happen, if it can happen the second time, it can happen the\nfirst time. I'm just wondering the policy consideration behind time is\nhand sure when someone first files a complain it goes through the local\ngovernment and so the local government if they award you know if they say they\nhave failed to hold the law then you know that's a process that's set out by\naccounting commissioner city council it is a process that's already in place\nnow at least if the local government says no we you know we're doing things the\nright way then it would go to a judge and hopefully make the decision in that\ncase but it's my belief that you're not going to see frivolous lawsuits what's\nactually happened in places across the country Arizona past something very\nsimilar where local governments as soon as this past began to try to clean up\nsome of the inaction they've seen from local governments so they don't get hit\nin the pocketbook which is what we're trying to do here and make sure local\ngovernments enforce the law. Could I have one other question Mr. Chairman\nRepresentative Gaines, it seems that we've picked and chose, we're picking and choosing,\nnot sure the right grammar there, some English teacher will correct me, but we're going\nto provide this right of action for owners in certain situations for homelessness and\na few other things that we've cherry-picked.\nHow did we determine which things we were so concerned that cities were enforcing and\nwhich things they weren't, because certainly there's many crimes, there's many violations\nof code that can happen on any given day, and it's usually an issue of resources as to\nhow a local government spends their time.\nSo number one, how did we pick and choose which things we were going to second-guess them\non?\nAnd then my second question is, why do we think that we know best what a city and county\nshould be spending their limited resources on, especially when this body has put forth\nlegislation, I guess we're going to debate pretty soon, that risks even more of\nof those limited funds that some of our cities and counties have.\nSo the way we came up with the issues in Blond's 42 through 48 or through 53.\nOne is issues related to homelessness and I think you've seen in places across the\nstate, you know, I live in Athens, you've certainly seen Atlanta, we've seen local governments\nthat have frankly not addressed the issue which is inhumane to the individuals who are\nhomeless.\nIt's also a major problem for business owners and property owners in those communities\nout here at all the time, and Athens of whether it's, you know, they come to their business\nand downtown Athens and someone is defecated on their right in front of their business\nor whether, you know, their business is obstructed.\nAnd so those are the, that's how we came up with those list of issues.\nAnother recent example was right before COVID-APD said they simply weren't going to respond\nto a certain level of shoplifting in Atlanta.\nAnd so those are some of the examples there and then certainly legal immigration is something that we want to make sure we continue\nTo put a strong stand in Georgia that we're not going to allow local governments to flaunt the law and not enforce\nWhat we pass with House bill 1105 two years ago into the second question?\nWhat was the second question?\nWhy are we going to\nSecond guess the cities and counties when they are deciding how to allocate\nlimited resources especially when this body has put forth measures that are\ngoing to even further strap those cities and counties so we're essentially\nsaying how much money we think they should have or not have because we're\nproposing legislation to change that but then at the same time telling them how\nwe think they should spend the limited resources that they already have and\nthen I guess your answer there spurred me to ask how are we going to know when\nthe city and county is not enforcing a policy versus when there are repeat\ndefenders. So on the first question is it's my belief that it is a state\ngovernment our job is if local governments are not doing their job and\nnot enforcing the law that we do have a responsibility to play to make\nsure local governments enforce the law. So that's my belief on that issue you\nmay have a difference of opinion. On the second issue what was your question?\nYou mentioned the example of homelessness and business owners complaining\nthat people are luttering or they may defecate in front of a business and\nthings like that.\nCertainly we're all aware of situations where that happens\nand authorities come out and they make an arrest\nor they otherwise clear the area\nand there are offenders that come back.\nAnd so how do you propose that this legislation\nwould help in this process to decide\nwhen a city and county is not enforcing\nversus when there are repeat offenders?\nIt's certainly we wouldn't want to strip,\nstake in local government of funding\nbecause there are repeat offenders.\nI just want to make sure we've got something that we worked through over the last couple\nof years as we worked on this bill.\nAnd lines 30 through 32 define, you know, this is not just one one off incident or repeat\noffender.\nThis is where there's a systematic or organized operation with local government saying\nwe're simply not going to enforce the law.\nIt also has exclusions at the end of the legislation that if it's, you know, discretion\nlike on a case by case basis for, you know,\nand then also decisions of other elected individuals\nin the county that are not,\nthat the County Commissioner of City Council\ndon't have, you know, control over.\nSo I think we've done a good job\nof making sure this only applies in situations\nwhere local government truly is saying\nthey're just not gonna enforce the law.\nSo there has to be a state of policy.\nThere has to be a state of policy\nor a repeated practice or pattern of not following the law.\nWhat determines a repeated pattern\nor practice of not following the law?\nWhen that's, again, Lawns, Lawns 30 through 32,\nthat's what we work through legislative council\nand through GMA and ACCG and others\nto try to really ensure that we specifically got\nto the point because of what the issue is,\nif you just said a written policy,\nsome local governments are putting this in written form,\nbut they're very actively not enforcing the law.\nAnd so that's my belief is we've got that written\nin a way that ensures that if a local government\nis saying we're just not going to enforce it.\nThat captures that.\nAnd again, in these situations,\nif a property owner files a complaint,\nand the local government says,\nno, we're doing things the right way it goes to a judge,\nand ultimately the judge would make that decision.\nFor me, if it's a broad term,\nand I'm really afraid that it gobbles up repeat offenders\nand not just non-enforcement,\nbut I appreciate the answer, thank you.\nThank you.\nSenator Miller, head to the question point.\nThank you, Mr. Chairman.\nThank you, Mr. Chairman, for your bill.\nI do have a question.\nIn your research that seems like it might have been years long,\ndid you encounter the phenomenon or the problem\nwhere municipalities will bus or ship homeless individuals\nin large scale from their jurisdiction\ninto jurisdictions like Atlanta?\nThat's my first question.\nAnd does your bill anticipate a jurisdiction like Atlanta\nbeing able to sue any jurisdiction\nthat buses their homeless up here.\nSo yes, that's actually something that we have seen.\nAnd Athens, that's something I've certainly seen.\nAnd we actually passed a bill a couple of years ago\nthat makes that illegal for a local government to do that.\nAnd it also does provide relief for local governments.\nAnd so my hope is that local governments\nwill actually enforce the law.\nWe passed a couple of years ago there as well.\nAnd hold others accountable\nthat buss their homeless folks to other communities.\nMy second question, this is,\nI just have one more, Mr. Chairman.\nMy second question is, how much does the state allocate\nin its budget for resources to cities like Atlanta\nto combat homelessness?\nAs you know, homelessness is not just a criminal issue,\nit's an issue of jobs, it's an issue of veterans,\nit's an issue of mental health, it's an issue\nof overburdened social services.\nSo how much has the state committed\nShe's helping local jurisdictions combat homelessness specifically.\nNo, I agree with you.\nIt's very complicated issue.\nAnd certainly, middle health is a big part of that,\nwhich is we passed landmark mental health legislation a couple of years ago.\nI know in the budget this year, specifically, the governor's put $50 million\nspecific for this purpose.\nAnd certainly that's something that I look forward to helping implement across the state.\nCombating homelessness?\nThat's in the governor's budget proposal is $50 million.\nOK, we've got some questions going on.\nI'd be encouraging you to speak with the author offline,\nso we can go ahead and get some of the others to.\nThat's all the questions we have for you.\nThank you.\nThere's a camera.\nGood morning, Mr. Chairman, thank you.\nMy bill is HB 350, which is number four on page one.\nThis bill allows for the placement of newborn safety\ndevices, it places like police departments and fire departments, the bill also has language\nin it that provides for alarms that will sound, that will alert the fire department and police\ndepartment that a newborn is in it. There's also another system where people twice a day\nhave to inspect the birth, the newborn safety devices. Once a child is placed in one of\nSo they are taken by emulates to a medical facility.\nOnce they're checked out, they are within six hours required, the hospital is required\nto do a surrender to the child to human services replacement.\nOkay, I don't see any questions.\nThank you, Mr. Chairman.\nDo you have any more, Roger?\nThank you, Chairman and committees, on the top of your blue sheet on the back page,\nHouse Bill 1015, the state oversees a self-insurance guarantee workers comp fund for those who choose to self-insure and this is the backup system so that-\nWait a minute, what number is that?\nHouse Bill 1015?\n1010.\n1010.\n1015.\nThat's what I said.\nYeah, I was having trouble finding that one.\nSo the state has a self-insurance guarantee trust fund and this is a backup to make sure\nthat if a business becomes bankrupt, that there are funds available, no taxpayers' money,\nit's those same companies fund that trust fund and we're just raising a limit that hadn't\nbeen raised in decades so that it's adequately funded.\nOkay, I don't see any questions.\nThanks, sir.\nThank you.\nSenator Clark.\nThank you, Mr. Chair.\nI am presenting House Bill 960, which is number six from the bottom.\nand this bill would bring a 12th Superior Court judge\nto the Winnett Judicial Circuit.\nCurrently we have 11, we have a need for 14.2,\nand we are asking for one additional,\nand so that is the bill.\nThank you.\nOkay, thank you, ma'am.\nI don't see any questions.\nSenator Williams.\nThank you, Mr. Chairman, members of the committee.\nI have Senate Bill 29, which is on the back page.\nSuck it up.\nThis has to do with DNA collections.\nJust on the front page of today's AJC,\na lumpkin county murder has been solved after 24 years\nbecause of DNA.\nThis is another tool in the toolbox for law enforcement,\nprosecution and defense.\nnot only can it prove innocence, it can prove guilt.\nAnd this is done with just a simple swab\nin the inside of the cheek.\nOkay.\nNo seeing any questions, thank you.\nThank you very much.\nA favorable consideration.\nThank you.\nLast year, I mean, the living has a request.\nThank you, Mr. Chairman.\nI have House Bill 999,\nwhich passed favorably out of the Judiciary Committee,\nit would allow magistrate courts to assess\nor collect other fees if authorized\nby a local act of the General Assembly.\nIt also corrects some repeal or language\nin House Bill 426 from last year,\nwhich dealt with both nonpartisan elections\nand both probate magistrate court,\nprobate court, the conversion of the courts.\nYou\nThat is a bill that would remove a sunset on the Universal Access Fund, which is crucial\nthe provision of telecommunications, telephone service in rural Georgia.\nIt would also allow tier two telephone companies, that's basically much smaller telephone\ncompanies that haven't opted into the fund to opt in if they do so by August, I think\nit was August 1st, August 31st of this year.\na very, very crucial bill that is vital to the continued accessibility and affordability\nof telephone service in rural Georgia.\nOkay.\nAny questions on that?\nChairman Green.\nThank you, Mr. Chairman.\nLadies and gentlemen, House Bill 659, which is number seven on your sheet there.\nAdresse is the critical workforce in access to care needs related to optometry in our state.\nThe bill expands eligibility or loan repayment and financial assistant programs to include\noptometrist placing them alongside our other health care professionals who serve Georgia\ncommunities and they often carry educational debt.\nWe found that we stated this in the House Rural Development Committee, which it came out\nof the idea that the rural areas are suffering greatly from the lack of optometrist.\nWe just do not have that.\nAnd we send our optometrist in the state of Georgia to Memphis Tennessee and Birmingham,\nAlabama.\nWe hope we're going to fix that problem pretty soon.\nAny questions from Chairman Green, Dean Green?\nDon't see any questions.\nChairman Powell, Matthew Light there for me.\nOkay.\nThank you, Mr. Chairman.\nI bring to the Committee House Bill 903.\nIt looks on the face of it's a very simple bill, but it has some repercussions as to\nthe authority of the legislature.\nThis will put all the executive agencies under the Administrator Procedures Act, which\nbasically when these departments pass rules and regs it has the effect of law\nand such that they'll be scrutinized by the legislature. It creates for a\ncreates that we shouldn't be delegating our authority. If they pass these and\nthere's a code section that deals with the process so if a department passes a rule\nor a reg they process it would submit it then to the Secretary of State. They\nthe cabinet said the leg council, leg council then recommends which committees\nboth in the House and the Senate needs to go to those chairman look at it\nand then it bears an objection they take it to their committee members to\nvoice an objection to it put it on hold until those committees can debate it and\nlook at it. Okay don't see any questions any other members of the committee\nI guess. Okay. Let's set a calendar for today. Monday, February 2nd. This is the 10th legislative\nday under modified structured House Bill 557. Have a move in a second. Is there any objection?\nIt's on. House Bill 6, 5, 9. Moved and seconded. Any objections? It's on. House\nBill 9, 60. Have a move and second. Any objections? It's on. Okay. Now to get us on\nschedule. Let's go ahead and set a calendar for tomorrow as well. This will be\nfatusity. House Bill 350. Have a move and a second in the objection. It's on\nfatusity. House Bill 946. Moved and second in the objections. It's on. House\nbill 999 moved and seconded any objections it's on okay that will set our\ncalendar for Monday and for Tuesday and we will meet in the morning at 9 o'clock\nappreciate y'all being here and we want to try to be mindful of the time and get\nus out of here so we can get to the floor by 10 so the speaker won't fuss at us\nso thank y'all for being here\n",
  "updated_at": "2026-02-12T01:24:33.89867+00:00"
}