{
  "video_id": "8moE4jquGIg",
  "url": "https://www.youtube.com/watch?v=8moE4jquGIg",
  "title": "Senate PM meeting 2 for Day 28 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 59,
  "summary": "Here is a summary of the key points from the Georgia Senate PM meeting 2 for Day 28 of the 2025 Session:\n\n**Overview**\nThe debate centered around SB 82, a bill aimed at preventing discrimination against businesses based on their political beliefs. However, there were significant concerns raised about the bill's language and potential unintended consequences, particularly regarding the provisions related to fines and lawsuits against banks.\n\n**Key Actions**\n- No bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\n- No new bills were introduced.\n\n**Notable Moments**\n- There was extensive discussion about the potential issues with SB 82, including concerns about the $50,000 minimum fine for unintentional violations and the risk of opening the door to frivolous lawsuits against banks.\n- An amendment (Amendment #3) was proposed to address these concerns by having the Attorney General handle enforcement rather than allowing private lawsuits.\n\n**Votes**\n- No recorded votes were taken.\n\n**Attendance**\n- No quorum issues were noted.\n\n**Adjournment**\n- The session was adjourned. The next session date was not specified.",
  "transcript": "Banks have their own risk management policies and things that they follow, their own internal policies.\nThey've got state law, they have to follow. They've got state regs, state banking regs.\nThey've got federal regs that they have to follow. They've got bank secrecy acts that they have to\nfollow. They have to follow SER, suspicious activity reports. And they have to make judgment calls\nall the time on these kind of accounts.\nThe problem is, one of the problems is,\npassage of this bill puts banks in a horrible position.\nBecause as the bankers have said,\nnine times out of 10 when they choose to either not bank somebody\nor sever a relationship with a client,\nthey can't talk about under federal regulations\nwhy they made the decision that they made.\nSo this puts them in a horrible position of not being able\nto explain the decision that was made,\nbut yet leaves them fully exposed to being sued about it.\nIf you look at the need of the bill,\nand it gets over to the portion involving lines 98 through 103,\nand talks about essential providers.\nAnd by the way, if you're wondering why this part\nof the bill or the bill talks about entities and utility carriers and broadband providers\nand your water service people and all these people that they off of the bill says they\ndon't have a problem with it, they're not engaged in it and there's not been any discussion\nof it.\nWell, it kind of makes you wonder why they're in here.\nBut it answers the question of why the banks are so concerned about the language and\nhere's why.\nThis was glossed over by the author\nwhen he talked about the fines that could be $50,000.\nNo, if you read a close reading of the bill,\nthe damages that a plaintiff can obtain against a bank\nor has actual damages or $50,000, whichever is greater,\nnot whichever is less, whichever is greater.\nSo what does that mean where the rubber meets a road?\nAnd that means that a bank who engaged accidentally and unintentionally, because that's the unintentional portion,\nand made a mistake in doing something that is construed as having violated this portion,\none incident, because if you look at how the definitions are run,\none violation of any aspect of this bill is a minimum $50,000 fine.\nNow, how would you like to go to work every day and run your business knowing that an\nunintentional, technical, minor violation of a law is a $50,000 fine.\nAnd each time it's done, it's 50 more, 50 more, 50 more.\nNow, if you look down to the intentional provisions, well, it's a lot more.\nAnd philosophically, I don't have so much of a problem with that, making it the distinction,\nbut it's $150,000 for an intentional violation.\nBut you don't need to go beyond the $50,000 unintentional violation portion of this to realize\nwhy this is a really bad bill.\nIt may be a good idea and the kind of conduct that the Senator from the 19th has talked\nabout trying to prohibit, listen.\nI agree with that.\nI agree that no company, let's talk about banks,\nbecause that's what this is about,\nshould be engaged in the kind of behavior\nthat he's given a few instances of.\nBut the question is, how do we fashion a remedy here?\nWhat do we say to the banks?\nWell, what's the normal thing that we do\nwhen you have a statute and you want to incentivize\nthe ability of someone to sue if you're gonna give them that?\nWell, they get their attorneys fees.\nWell, that's in here too.\nThey get attorneys fees.\nThere's also a provision that says\nthat they can get injunctive relief\nto stop the bank from doing those things.\nBut folks, when you're talking about a $50,000 minimal fine\nof something that small, that amount, of course,\nthat's why the banks are deeply concerned.\nYou know, we talked about the problems of social credit score, where does that come from?\nHow does one define it?\nIt's defined in the bill, but it doesn't say who at the time defines it.\nWell, let me tell you the answer when I ask the author of the bill will tell me how that's\nresolved.\nWell, it would be resolved litigation, litigation, litigation.\nThe lawyers are going to fight over that.\nor not? Did the company have a social credit score? Did they keep records? Well, if they\ndidn't keep records, maybe they knew that they were doing something wrong, and that's why\nthere's no records on the social credit score. So we're going to deconstruct it and just\nimpose, what do you impose? You impose your after-late-latent judgment and assumptions\nabout things that happened, again, just more problems, you know, lines 59 through 61, supposedly\nwould give us some guidance, but I would encourage you to read those lines and you'll realize\njust as others that have that you really don't know how this would work other than, of course,\nour Georgia-based businesses and our banks rather are concerned about a $50,000 minimum\nfine for one instance of an unintentional act.\nThat's not reasonable.\nSo let's talk about amendment number three, which is what I have proposed.\nWhat it does is it takes out the private cause of action so that it's not, let's call it,\nwhat it would be, plaintiffs, lawyers, bananza to go sue banks all the time knowing they're\ngoing to get their attorney's fees and they're going to get $50,000 for any and every time\nthere's a minor violation, it says no, wait a minute.\nLet's handle this the way this is usually handled.\nWhich is you have the attorney general do it.\nIf you look at line 9 on amendment number 3, it says in an action brought pursuant to\nthis code section for a violation and I'm paraphrasing here, notwithstanding paragraph\n3, the attorney general shall seek to recover $10,000 in civil penalties for the first violation,\n$50,000 for the second and $250,000 for the third and subsequent violation.\nBut the Attorney General may also bring the action without providing notice to the party he's going after.\nAnd may also refer the violator to the Department of Banking and Finance for further investigation.\nThat's the kind of mechanism we need that doesn't send a shockwave throughout our community banks of being worried\nof yet this being another\ntort lawsuit bananza giving\nlawyers a chance to go make a\nbunch of money on minor\nviolations because that's how\nthis is structured.\nAnd here's the other reason that\nI pose the bill the way it's\nwritten. Again, the idea of\nmaking sure that our businesses\nought not be discriminated against based on their political beliefs and the other things\nset forth in the bill.\nI agree with.\nI told the author of the bill that very thing in the committee hearing.\nBut it's the mechanism that he's used of an elephant gun to go after an unintentional\nviolation in a way that clearly is not fair or appropriate.\nAnd I think maybe we'll have someone else come up that will speak from a banking perspective\nthat will tell you, and this is also the reason I oppose the measure, not the measure\nof I oppose the way the bill is written, because it is drafted in a way that really hurts\nand could hurt and will hurt conservative businesses, and it's for this reason.\nFor those conservative businesses that want to have a relationship with a new bank, maybe\nbecause for whatever reason, banks are going to be more concerned and less likely to bank\nsomeone knowing that they're going to be subject to a lawsuit if they need to\nsever the relationship for legitimate banking reasons, but they can't defend\nthemselves and talk about those legitimate banking reasons because of the\nfederal regulations. So it's going to have the opposite effect. Again, I'm going to\nclose here. I know it's late, but you know, when we've got this many amendments\nfloating around trying to figure out what this is about and correct it.\nThat lets us know, this measure needs a lot of work.\nBut I would tell you that if you think you want to vote for this bill at a minimum, vote\nfor the third amendment, I will speak to the others, I'm supportive, but I'll leave\nthat to those, the authors of those amendments that have already spoken, but this measure does\nnot address what it's supposed to be trying to fix, and with that Mr. President, I yield\nthe well.\nAll right, Senators yielded well, and now the Senate, we're going down the amendment\nlist here, and the author of the amendment 3B is the Senate from the 19th, the Senate\nfrom the 19th, you want to speak to your amendment, you just want to wait till you close.\nAll right.\nGood.\nfrom the 14th, what purpose do you rise?\nSay it's your inquiry.\nThere we go, parliament inquiry.\nIs it not true the minority party finally understands\nwhat it's like for the majority party during floor debate?\nIs that not true, Mr. President?\nDo you know what now, I'm sorry?\nThat the minority party finally understands\nwhat the majority party feels like\nduring the average floor debate, Mr. President.\nOh, yeah, yeah, yeah, yeah.\nSenator, what do you speak?\nAll right, Senator from the author of the amendment.\nNumber four, Senator from the 31st.\nWould you like to speak to your amendment?\nthe floor's yours, be brief, brother be brief, let's get home with this.\nSo just very briefly, it's the president alluded to, thank you Mr. President for the great\nreminder, the one group of folks that has not been talked about are credit unions.\nI don't know if the author knows, but there are 77 chartered credit unions in Georgia and\nwhere I come from, credit unions, or usually the ones that are setting up, for example\nme, my kids bank accounts at a young age, and at $1 billion, there's only eight covered.\nI think the other thing just as a reminder is that whether you're a Daniel defense or\nyour Glock or those organizations, I'm not aware of a credit union that banks them.\nAnd if that's factually not true, I'm sure somebody will talk about it or let me know.\nThe other thing, too, going back to the original intent of why debanking this highly political\nis because of the work that Senator, U.S. Senator Tim Scott is doing in Washington leading\non this effort, my friend Tim, because of what we saw under Operation Chokepoint 2.0\nunder the Biden administration.\nHe and Senator Kramer introduced a bill that has 39 endorsers from the Republican Conference\nin the US Senate, and I believe there's a bill also introduced in the US House from a\ncongressman from Kentucky whose threshold is $50 billion.\nThe fair access to banking at the Senator Kramer is doing is based on the President Trump's\nfair access rule. So as we talk about $100 billion here, $200 billion there, $1 billion,\nI advocate and ask that this body adopt $10 billion because what's going to happen,\nthrough all this confusion that the senator from the 19th, no offense you've created,\nThe 10 billion number may be what gets passed in the law because our leaders in Washington\ndon't get much right, but I will give Senator Scott credit for leading on this effort.\nThe 10 billion is the right number and we don't harm those hardworking credit unions that\nare in our blue collar communities setting up these smaller accounts helping our families.\n10 billion is also, I know there is an NRA letter on the desk about this bill.\nThe NRA also endorsed $10 billion with the federal bill, so don't be misled by that.\nAnd so I just ask you, friends, adopt amendment four unless you adopt one of the other ones\nand in my amendment will probably be gone, but don't be fooled by the politics going\non.\nThank you, Mr. President.\nAll right.\nThank you, Senator.\nSenators yielded well.\nNow move to amendment number five.\nSenator from the 50th.\nSenator from the 50th.\nWould you like you wave?\nOkay.\nSenator from 50th waves.\nAnd that is all the amendments for right now.\nSenator from 27th, what purpose do you rise?\nMr. President, I move the previous question.\nSenator's move for the previous question.\nIs there objection?\nAll right.\nNow, it's time for the Center for the 19th,\nclosed debate.\nThank you so much for all the debate.\nI do want to respond to a few things.\nThe comments about secrecy,\nthe comments about the Patriot Act,\nthe comments about banks can't tell you things.\nWell, guess what?\nThat all deals with money laundering.\nTurns out money laundering is not protected\nin the US Constitution.\nAs far as I know, don't go in anybody.\nSocial credit score either.\nThat does not apply.\nBut let's proceed and just pretend that it did.\nIf it did, lines 82 through 87 say, hey, bank,\nif you can't tell them why you canceled their account\nfor these reasons protected by federal law,\nthen you are fine.\nYou are okay.\nThere's a way to not get sued on this.\nThey said it's become the debanking bill\ninstead of the deutilizing bill.\nThat's probably true.\nThe way to stay protected?\nDon't cancel somebody's account\nbecause they're using something\nthat's further protected by their constitutional rights.\nThose are comment about this as an attack on banks.\nIt's not an attack on banks.\nIt's a protection of constitutional rights.\nThose are comment about why are other utilities in here?\nIf it's just about banks,\nthey're not complaining, begs the question,\nwhy they're in here?\nBecause guess what?\nThe things were debating on this floor right now.\nWe did not think we would be debating 10, 5, 1 year ago.\nWe need to go ahead and protect those industries now and protect individuals who are exercising\ntheir constitutional rights if they could potentially lose those vital resources that keep\ntheir homes, their families, and their businesses operating.\nThe comments about this can be a $50,000 fine for an unintentional act.\nRemember that $50,000 is a maximum that is reduced by the amount that somebody came out\nof pocket because they got debanked in anyway.\nThey got moved.\nMarty Daniel told you for him that was a million dollars.\nAnd the reason why we can't simply set aside and let this matter go to the Attorney General's\noffice is because of the testimony of someone who already has a business in Georgia that\nthey did that and it did not work.\nThere's folks who are for this bill.\nYou already heard the NRA, the National Shooting Sports Foundation's for it.\nTurning point something is for it.\nThe Georgia Chambers against it.\nBut they say it's because it would create confusion.\nYou know what's confusing?\nWhat's confusing is being a company that's your power, your water, or God forbid, your\nbanking gets canceled because you were doing something that was already otherwise legal.\nThat's what's confusing.\nWhen we vote on this bill today, I'm going to ask you to support Amendment 1A.\nAmendment 1A.\nI know this is going to be a Christmas tree for you, so get at your pencils. There's a lot of amendments.\nI would ask you support Amendment 1A. If Amendment 1A passes, I would ask you support Amendment 1.\nIf Amendment 1 passes, I believe Amendment 2 fails because it now amends something that's no longer there, but we'll see.\nIf I'm on a amendment 3, there's a amendment 3a.\nIt says the attorney general should have a right in this.\nThey should have a place in this.\nBut if they don't take their step,\nyou should still be able to go higher your own lawyer\nto take that step.\nIf a amendment 3a passes, I will ask you to vote favorably\nfor a amendment 3.\nI ask you to vote favorably for a amendment 3a.\nIf a amendment 3a passes, I ask you vote favorably\nfor a amendment 3.\nAsk you let all the other amendments die,\nand then that you vote favorably on the bill.\nbecause I know this will get confusing.\nI will make points of order on how I think the bill should go,\nand if you wish to vote with me,\nI would really be thankful if you did.\nSo thank you so much for your time today.\nThank you for hearing me on what I think is an important issue\nfor not just affecting, not just protecting now\nand Georgia businesses now,\nbut protecting Georgia businesses and Georgia families\nand their constitutional rights in the future.\nMr. President, I yield the will.\nAll right, Senators Yeilden, and the Senate has now closed the\ndebate.\nSo we will take up the amendments at this point in time.\nWe'll start with amendment one A. Amendment one A. Is there\nobject?\nThere is objection.\nAmendment one A is authored by the senator from the 50th.\nWe have objection from the senator from the 46.\nSo we'll go ahead and take up amendment one A. All those in\nfavor of amendment one A. We'll vote yay, all opposed.\nSo the amendment will vote nay.\nSecretary-in-law of the machine.\nOn the adoption of amendment 1A, the Yays are 32 and the Nays are 22, so amendment 1A has\nbeen adopted.\nNow, with amendment 1A being adopted, it pretty much nullifies amendment 1, 2, 4, and 5.\nis amended. Yeah, I'm sorry. Okay, I'm sorry. We need to take up one. I apologize. So amendment\none is there obviously and then amendment one will be attached to amendment one A objection.\nAll right. So all those in favor of amendment one will vote yay. All opposed will vote\nNay, 16 and a lot of machine.\nAll in the adoption of amendment one as amended the yeas of 49 and the nasa 7 and this amendment\nhas prevailed all right so now we're at the posture where with amendment one as amended\namendment two four and five are new so now we'll take up amendments three a well what\nwhat we have left is 3A, B, and amendment 3.\nSo now we're on the amendment 3A.\nSenator from the 19th, we'll go for a picture.\nThank you, Mr. President.\nDue to a drafting error, I'd like to withdraw amendment 3A\nas long as I'm assured that the vote will now be on 3B.\nIt is, okay.\nAnd I would urge favorable consideration.\nThis is objection to Senator from the 19th.\nAll right, without objection, we'll withdraw.\nDo you object?\nWe do have objection.\nAll right, now we're on to 3B, 3B from the senator from the 19th, is there objection 3B?\nThere is objection 3B. All those in favor of member at 3B will vote ye, all opposed.\nNice. Sector, you're a lot of machine.\nThank you.\nThank you.\nHow are you doing?\nAre you doing...\nOn the adoption of Amendment 3B, the A's are 33 and the A's are 22 and Amendment 3B has\nbeen adopted.\nNow on to last amendment amendment number three authored by the pro-tem\nIs there objection amendment number three as amended?\nNo objection\nQuestion is on the adoption of the committee substitute as amended is there objection to the adoption of the committee substitute as amended\nhearing none the committee's substitute as amended is adopted is there\nobjection to agrees to the Florida committee which is favorable to the\npasses of the bill chair here's none for the committee has agreed to\nquestion is on the passes of the bill by substitute all those in favor of the\nbill of O.K.A. opposed nay secretary will unlock the machine\nAll the passes of the bill, the A's are 13, the NA's are 43 and this bill has not received\nreducing constitutional majority to pass so it fails all right moving on recognize\nwas mr secretary read senate bill 291 senate bill 291 by senator group to\nthe 51st and others will spend time on active men code section 40 s shoot-86.1 of\nthe fish got a Georgia annotated way to special license plates promoting or supporting\ncertain where the agencies funds are nonprofit corporations and qualified motor vehicles\nor drivers with proceeds deposited into the general fund says to establish an America\nfirst specialty license plate to provide for conditions for the production of such license\nplates to arrive for discontinuing the manufacturer of such license plates and certain instances\nto arrive for this position of funds to the general fund to arrive for related matters\nto arrive for effective date to repeal public looking laws and further purposes.\nMr. President, the Senate Committee on Public Safety recommends that this bill do pass by substitute, respect this submitted, Senator Albert's chairman.\nMr. President, the Senate Committee on Public Safety, hours of falling substitute to Senate Bill 291,\na bill between 10 and 9 to men, code section 40, that's true, there's 86.1 of the official going to Georgia annotated.\nI would like to specialize in this place, providing your sporting certain where the agencies, ones are going to provide corporations,\nqualified motor vehicles or drivers with proceeds deposited into the general fund,\nsays to establish an American first specialty license plate and for other purposes.\nMr. President, that completes the order.\nBring in as the majority leader, speak to the bill.\nThank you, Mr. President.\nSenators, I'm going to bring another book to the chamber next week to present to the senator from the 19th.\nIt's called the art of the deal.\nSo I'll be bringing that to you next week.\nIt's not signed yet, but maybe we'll get it to you.\nSenators this bill was a simple bill, we've seen it here before, we saw it last year.\nIt creates two license plates this year, not one, but two.\nThe first one is an image of the American flag.\nIf you're a patriot and you love America, you're going to want to vote for this bill.\nAnd the second portion of the bill is language that you saw earlier this year from the senator from the 56th.\nIt is a organ donor license plate.\nSo my voting yes for this bill, you get to purchase either a license plate with the American\nflag or a license plate with organ donors.\nSo Mr. President, I'm happy to take questions all year of the will.\nI have one question, Senator.\nBreak it down, Senator, from the 14th.\nDoes the Senator yield?\nThanks, Mr. President.\nI will for you.\nSenator, last year you had a similar piece of legislation to this one, although you've\nWe've added some stuff this year.\nI wanted to work with you in the off season\nabout maybe amending this legislation to make it better.\nIf I were to offer a friendly amendment today\nto improve this legislation,\ndo you think you would be open to hearing it this year?\nYou know, we've just been through hours and hours\nof debate on other things with lots of amendments.\nLet's just get through this even\nand we'll take this bill on over to the house\nand we'll continue to perfect it\nas we get through the fact that we're doing it.\nNot the answer I was hoping for.\nI'm still gonna try to appreciate your spirit\nand your love for your country.\nThank you, Mr. Senator.\nYes, sir, thank you.\nAll right, we have a couple amendments.\nSecretary, read the amendments.\nMr. President, Senator McLean of 14th\nand others offer the following amendment one\nto amend the Senate Committee Substue\nto Senate Bill 291 by replacing America online 19\nwith Donald Trump and online four.\nMr. President, Senator McLean of 14th\noffers the following amendment one A\nto amend amendment one to the Senate Committee Substue\nto Senate Bill 291 by adding J\nbetween Donald and Trump on line three.\nMr. President, I can please the order.\nAll right, recognize Senator from the 14th,\nspeak to his amendment.\nHey everybody, I certainly don't wanna take\nany more of your time today.\nThis is a very simple amendment.\nIt just replaces the word America in the legislation\nwith the words Donald Trump.\nNow, when I drafted that amendment,\nI forgot, unfortunately, that the way that the license plate, probably a lot of the voters\nwill want it to look, is to have a J in between Donald and Trump.\nSo I would ask your unanimous support of amendment 1A to add J between Donald and Trump.\nAnd I would ask your support for amendment 1 to put Donald Trump the bill.\nI'm very grateful to the two centers back here, the Rules Chairman and the Senate from\nthe 27th for joining me on this amendment.\nWe have very different reasons for signing the amendment, but the unity in our purpose\nis this, that we think the bill should reflect its true purpose as clearly as possible.\nAnd so in that spirit of bipartisan compromise, let's put the issue before the body that's\nreally at stake and let's vote on the true intent of the bill.\nAre you going to have any questions or are you going to well, Ms. President?\nYou do have one question, Senator from Fidget first.\nI will, if we were to pass this amendment,\nwould you consider this amendment a beautiful amendment?\nWell, it is probably that there's,\nmany people are saying it's the best amendment,\nand I will say that even though I don't support\nthe underlying legislation, I know other senators might,\nthat's really the beauty of bipartisan compromises\nto agree where you can, Senator.\nBut this is your amendment, correct?\nIt is my amendment, and like I said,\ntwo roads diverged in the wood, and I chose no.\nSee, there is, there is.\nWell, I appreciate your spirit of cooperation\nand bipartisanship for our country.\nThank you, Senator.\nIf there are no other questions, Mr. President,\nI'll yield the well.\nYeah, there's no other questions.\nHe's coming around, yo.\nHe's coming around.\nHe couldn't even speak his name last year.\nNow he's offering amendments for him.\nAll right.\nSenator, you won't close the debate, you won't.\nYeah, okay, all right.\nNow, I know some of you Democrats out there are confused\nright now, you're wondering which way are we gonna vote\non this important piece of legislation.\nBut let me just clear this up.\nAmerica first is not about a person\nand it's not about an entity or an organization.\nIt is about our country, it is about the love\nour country. It's about those 11 million people in Georgia that have a choice. When they\ngo to buy their tag, do they want a standard tag, do they want a veteran's tag, do they\nwant an organ donor tag, or do they want an American first tag with our beautiful American\nflag on it. So you decide how you want to vote on this. I'm going to vote no on the amendment\nbecause I want to make this about America first, not some other person or another organization\nfirst. You have the well. All right, let's go. Let's get rolling here. It is, we're going\nto take up a amendment. Question is on amendment number 1a, amendment number 1a, which is just\na correction for amendment number 1, but amendment number 1a, is there objection of amendment\nnumber 1a? There is objection. All right. All those in favor of amendment number 1a will\nYeah, I'll pose nay secretary on that machine.\nSo\na\nsit\nfor\nState\nyou and\nSenator, Senator.\nAll the adoption of amendment 1A, the A's are 34 and the A's are 22, so this amendment\nis adopted.\nAll right.\nQuestion is on amendment 1, authored by the MAGA man himself from the 14th.\nAs amended, is there objection?\nThere is objection.\nAll right, on the adoption of the amendment,\nthose in favor of one is amended.\nWe'll vote ye, those opposed nay.\nSecretary, I'm not in the machine.\nWe're going to have Senator from the 56.\nPaul, I'm going to your inquire, Mr. President.\nIt isn't true.\nIt's important we vote no to keep America first and make sure we get an important\nOregon donation license plate for the state of Georgia to save lives.\nThe senator, the senator is wise beyond his years.\nSenator from the 31st, what Parliamentary inquiring?\nStatue of inquiring.\nIs it not true that Vice President JD Vance would approve of the senator from the 14th amendment?\nSenator knows what he speaks.\nRecognize Senator from the 53rd, what?\nParliamentary inquiring.\nStatue of inquiring.\nIsn't it true as Donald Trump's floor leader I'll be voting no on this amendment because I believe in America first, not in all powerful key.\nSenator, Senator has that right.\nAll the adoption amendment one as amended, the A's are 24 and the A's are 32 and so this\namendment has failed.\nAll right.\nOn to the underlying bill.\nQuestion is on the adoption of the committee substitute.\nIs there objection to the adoption of the committee substitute?\nHearing none, the committee substitute is adopted.\nIs there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill?\nChair, here's none, the Board of Committee has agreed to.\nIs there objection to the main question be in order?\nChair, here's none, the main question is ordered.\nThe question is on the passes of the bill by substitute.\nAll those in favor will vote, yay, all opposed, nay, secretary, on the machine.\nSenator from the 47th, what purpose do you rise?\nMr. President, is it not true that everybody should have a really great sign to share?\nSo we can make America great again.\nThere you go, Mr. President.\nSenators, nose-wee-speeds.\nRick and I, Senator, it's 27 of the Webberbs, you rise.\nParliamentary inquiry.\nSecretary inquiry.\nMr. President, you said the senator from the 14th\nwouldn't say his name last year, but suddenly has found his rebirth.\nIsn't it true that a lot of members of our party wouldn't even say his name last year,\nbut suddenly seem to be big fans of President.\nSenator has, has a strong opinion of himself.\nReagan has sent in from the 26th, wave it, I'm sorry.\nAll the passes of the bill, the A's are 33, the A's are 23.\n33 this bill have received the requisite constitution was already there for pass by substitute\nAll right moving on Senate bill 293 secretary read the caption\nSenate bill 293 by senator Anderson and 24th and others to build swing title neck to mend code section 4-2-85.1\nThe fishcutter Georgia annotated related to license plates are certain veterans first to increase the number of free license plates\nIssue to certain veterans to ride for later matters to appear conflicting laws and further purposes\nMr. President, Senate Committee on Public Safety recommends that this bill do pass respectfully\nsome minutes on our Albert's Chairman that completes your order, Mr. President.\nMr. President, I bring you a Senate bill 93, 293.\nThis is a simple bill, but a good bill.\nThis is for the people that put their lives on the line for us to live in a free country.\nOur veterans.\nThis bill, all it is, right now they can currently get one tag free.\nThis one makes it the way they can get up to four tags free.\nI ask you to vote green, thank you.\nYou're the well.\nAll right, does any other center would speak for against the manager?\nChair here's none.\nIs there objection of previous question being ordered?\nChair here's none, previous question is ordered.\nIs there objection to the green to the border committee,\nwhich is favor to the passes of the bill?\nChair here's none, for the committee is green to.\nIs there objection of the main question being ordered?\nChair here's none, main question is ordered.\nQuestion is, all those in favor of the bill,\nwithout yay, I'll oppose nay.\nSecretary, I'm not the machine.\nOne, two, three, four.\nOne, two, three, four.\nYou\nOn the passes of the bill, the A's are 56 and A's are 0.\nThis bill, Hammer, Z, Rickson, Constitutional Majorities,\nthey're 4-pads.\nWe have a very special guest here, right here.\nLook at him, come and bring him up here, bring him up.\nThis is our fine commissioner of agriculture.\nThe thriller from Osello, right here.\nThis is a commissioner, Tyler Harper here.\nGive him a round of applause.\nWell good afternoon it's good to see y'all I know y'all are working hard so and I know y'all have\nonly got to a very few bills in the last four or five hours so I'm gonna be very brief thank you\nfor what you do God bless you keep plowing we look forward to continuing to work with you God bless\nyou y'all have a great day thank you always good to have the commissioner here with us he's the\na dear friend. He and I got elected together in this body several years ago. You\nstill look young. I don't, I don't look so young. All right, Senate Bill 27, Secretary\nReed captioned. Senate Bill 27 by Senator Alverson 56 and others built\nbetween Title IX to amend Article 7, chapter 5 of the Title 16 of the fish going to\nGeorgia annotated, really two stalking. So to provide for the offense of doxing, to\nwrite for penalties, write for a protective order, to write for a civil action, to\nto write for a venue, to write for definitions,\nto write for statutory construction,\nto write for a late matter,\nto appeal conflicting laws and further purposes.\nMr. President, the Senate Committee on Judiciary recommends\nthat this bill do pass by substitute,\nrespectfully submitted, Senator Strickland-Cherman.\nMr. President, the Senate Committee on Judiciary\noffers the long substitute to Senate Bill 27,\na bill between Title IX to amend,\nArticle 3, Chapter 11, Title 16,\nthe official bill to judge annotated,\nrelated to invasion of privacy,\nso that's provided for the offenses of doxing\nand aggravated doxing, to write for penalties,\nto write for definitions, to write for construction,\nto write for a short title, to write for a related matter,\nto write for an effective date and applicability,\nto appeal to convicting laws and further purposes,\nMs. President, that completes the order.\nAll right, recognize Chairman and Public Safety,\nSenator from 56.\nThank you, Mr. President.\nSenators, I stand before you with Senate Bill 27,\nthe Georgia Anti-Doxing Act.\nDoxing is a contemporary and pernicious form of harassment,\ninvolving publicizing private information\nof individuals on the internet, usually with malicious intent.\nIt's a gross violation of your privacy,\nresulting in emotional distress,\nreputational damage, and in many cases physical harm.\nWith the increase of digitization in our of our lives,\nwe need to address this issue head on\nas it becomes more urgent and necessary.\nI want to thank the Senator from the 39\nwho worked on this bill for several years\nhas been a big part of it, as well as the senator from the 42nd Distinguished Chair\nof the Judiciary Committee for helping us perfect this language.\nThe bill is going to combat doxing and create a criminal act for those that commit this\nheinous act.\nThis legislation recognizes the punishment should fit the crime, but also assures that\nwe do not infringe on free speech, which specifically outlines 72 to 77.\nThis bill takes a step in the right direction towards securing the digital safety of all\nGeorgia citizens, and sends a clear message that Georgia will not tolerate online harassment\nis committed to protecting the privacy of our citizens.\nIt also acknowledges the changing landscape of our digital age and takes robust steps\nto protect and uphold privacy of our fellow citizens.\nIn conclusion, this is a comprehensive, balanced, and necessary piece of legislation to address\nthe pressing issue to our citizens.\nIt's a practical solution to a modern day problem.\nI'd ask for your favourable consideration if you don't have questions I will yield the well.\nYes, Mr. President.\nThank you.\nWe're going to ask Senator from 39th.\nLet's speak to the bill.\nThank you, Mr. President.\nSo I rise today in support of SB27 because no one, whether a public servant, private citizen or business owner,\nto live in fear that their personal information will be weaponized against them.\nAs you heard, really, truly what sets doxing apart from existing cyber stalking laws\nis the methodical collection of personal data and the calculated decision on what information\nto release on which platform and through which means.\nOnce this sensitive information infiltrates public domains, it becomes nearly impossible\nto retract it, and it leaves victims vulnerable and exposed.\nWorking with defense attorneys, prosecuting attorneys, this legislation strikes that\ndelicate balance of safeguarding freedom of speech while acknowledging the seriousness\nof the crime and increases its offenses upon subsequent convictions.\nThis bill is one of those rare ones that has support from across the spectrum, including\nthe anti-definition league and front line.\nI urge you to vote yes in support of it,\nand I yield the vote.\nDoes any other Senator wish to speak for against the measure?\nChair, here's none.\nIs there objection, pre-disquestion be in order?\nChair, here's none.\nPre-disquestion is in order.\nQuestions on the adoption of the committee?\nSubstitute.\nIs there objection to the adoption of the committee?\nSubstitute.\nHearing none, the committee, substitute is adopted.\nIs there objection to green to the board of committee\nwhich is favorable to the passes of the bill.\nChair, here's none, board of committee has agreed to.\nIs there a Jackson main question being ordered?\nChair, here's none, main question is ordered.\nQuestions on the passes of the bill,\nby substitute all those in favor of vote,\nyay all opposed, nay, secretary, unlock the machine.\nYou\nare one this bill having to see the rest of the Constitution of Missouri is\ntherefore passed by substitute. All right we got one more bill we've got to do and\nthen we're going to break for dinner and so secretary read the capture in\nSenate bill 82. Senate bill 82 by senator Dixon the 45th and others built\nto me tell an act to men article 31 on chapter 2 title 20 of the\nofficial going to Georgia annotated the Charter Schools Act of 1998 says to\nenact the local charter school authorization to support act of 2025 to arrive\nfor the local boards of education to reconsider the denial of local charter school petitions to require the office of charter school compliance to prepare guidelines for local boards of education for the evaluation of charter school petitions to provide reporting to provide for legislative findings and intent to write for an effective date to appeal to the laws and for other purposes.\nMr. President, the senate committee on education and youth recommends that this bill do pass by substitute respect was submitted, Senator Hickman, Chairman.\nMr. President, Senate Committee on Education and Youth,\noffers the following substitutes, Senate Bill 82.\nI build to maintain an act to amend Title 20,\nthe official college of Georgia annotated,\nrelated to education.\nSo as to enact the local charter school authorization,\nit's Board Act of 2025 to provide for the State Charter\nSchools Commission to establish a program\nfor the purposes of promoting and supporting,\nwe approve of new local charter school petitions\nby local boards of education to provide incentive grants\nto local boards of education that approve\nnew local charter school petitions\nand for other purposes, Mr. President,\nthat completes the order.\nI recognize the senator from the 45th.\nThank you, Mr. President. Senate Bill 82, colleagues, has to do with access to charter schools across our state.\nCurrently, there's 96 charter schools throughout the state of Georgia.\nand with about 65,000 students that attend.\nAnd what Senate Bill 82 does is it addresses\nthe state charter school access issue\nby incentivizing local districts\nto approve more charter schools.\nAnd it also holds districts accountable\nfor repeatedly denying high quality charter school petitions.\nThis bill is needed because there are currently\n21,000 students on charter school waiting lists\nthroughout Georgia, yet districts, local districts,\nare not approving charter school petitions.\nIn the past five years, only one charter school\nhas been approved locally in the state of Georgia.\nDuring that same time, the State Charter School Board\nhas approved over 30 charter schools,\nwhich most of those were initially denied\nby the local districts.\nAnd what this bill does, as far as incentives,\nthere's two financial incentives for local school districts.\nIn section three, the district who acquire additional capital outlay entitlement credits\nin the years that they approve a charter school.\nIn section five, this allows districts earned $250,000 per year for a period of three years\nfor every year that a new charter school has approved in their district.\nAs far as accountability, that would be in section four.\nAnd for districts that enroll 10 to 60,000 students, if the district denies two charter\nschool petitions within that year and they are laterally approved by the state.\nThe district would be no longer eligible for it to renew its flexibility contract with\na state board of education.\nAnd for districts that have over 60,000 students, it would be three denials before that\nwould happen.\nMr. President, be happy to answer any questions.\nYou have no questions, Senator.\nThank you, Mr. President.\nI yield well.\nof the 38th, do you like speak to the measure?\nThank you, Mr. President.\nColleagues, I rise today in support of Senate Bill 82.\nMany folks would be surprised to learn that a Democrat, in fact,\nwas the president who started charter schools\nin the United States.\nPresident Clinton is the president\nwho signed the charter schools law\nto make it allowable in the United States.\nOne thing that I wanted to share,\nI was actually going to offer a friendly amendment\nto this bill because I was receiving calls about fairness.\nAnd I was able to check with the State Charter Schools Commission\nand confirm that in fact the same petition\nthat is given to a local district\nis given to the State Charter Schools Commission\nand that is the decision,\nthat is what they will base their decision upon\nto determine if they will approve that charter school.\nCurrently there are over 20,000 kids.\nMany of home look like me\nthat are on waiting list for charter schools.\nSo that tells us that there is an issue in terms of the level\nof the amount of approvals that are occurring across the state.\nAnd so I believe that this bill strikes the right balance.\nIt gives some incentives to our local districts\nto approve charter schools.\nI am not only a former charter school principal,\nbut I'm also a dad of a former charter school student.\nMy son graduated from a local charter school.\nHe was actually a zoned for a very good local high school,\nbut that school was not working out for him.\nAnd my son, as a result of attending that charter school,\ngot a full-ride scholarship and is now getting ready\nto graduate from Tennessee State University.\nSo I strongly support Senate Bill 82\nand encourage my colleagues to join me.\nThank you, Mr. President.\nI yield the well.\nAll right, sounds like we've got a school choice cast.\nRecognize Senator for the 35th.\nAll right, come on, school board members, come on, school board members, let's go back.\nColleagues, I rise as a former school board member in support of SB 82.\nI am a supporter of real school choice.\nSo I want to commend my colleagues in this chamber for talking about choice when it comes\nto public schools because the reality is that 90% of children in Georgia attend public\nschools.\nSo if you want to provide families with real options, if you want to provide families\nwith innovative programming for their students, then we should be focused on doing that in\nour public schools, which is why I am in support of a bill like this. I want to remind you\nthough that the vast majority of parents want to see innovation in their schools, but\nthey also support their neighborhood schools. This strikes a good balance. I'm not a fan\nof using a stick, using some of the penalties that are in this bill, but at the same time\nI do appreciate the incentives that are in this bill.\nAnd I also like the fact that we are informing parents\nabout what each school system is doing\naround school choice, providing parents\nwith that type of information at their hands,\nat their fingertips, is something that parents desire.\nAt the same time, there's a reason\nwe have to provide school districts within incentives.\nAs my colleague from 26 always reminds us,\nIt's all about the money.\nAnd some districts are not approving charter schools\nbecause of the money, the cost.\nSo I like to remind my colleagues that we have to update\nthe QBE formula, a formula that is 40 years old.\nIt relates to this very issue.\nWe haven't touched it in our school districts,\nwhether you're in rural Georgia or Metro, Atlanta,\nschool districts are feeling it.\nSo if we really want to continue this conversation\naround school choice in our schools,\ncolleagues, let's talk about the money.\nWith that, Mr. President, I yield the well.\nSenators yielding.\nThe New Year's Senate would speak for against a measure.\nChair, here's none.\nAnyone object to the previous question being ordered?\nChair, here's none.\nPrevious question is ordered.\nQuestions on the doubt should be substitute.\nIs there objection to the doubt should be\nSubstitute. Hearing none, the committee's substitute is adopted. Is there objection to\nagreeing to the Board of Committee, which is favorable to the passes of the bill?\nChair here's none, the Board of Committee is agreed to. Is there objection to the main\nquestion being ordered? Chair here's none, the main question is ordered.\nQuestion is on the passes of the bill by substitute. All those are favourable.\nYeah, you all opposed, Nate, Secretary, and a lot of the machine.\nYou\nOn the passes of the bill, the a's are 44, the a's are 9, this bill hasn't received\nThe requisite constitutional majority is therefore passed by substitute.\nRecognize as a majority leader for motion.\nMr. President, I move that the Senate table the remaining bills and\nresolutions on the rules calendar.\nSenator's move is their objection.\nThe out of objection, they're tabled.\nYou better not.\nThe rules on the table, okay.\nrecognize the protein for announcement.\nThank you, Mr. President.\nWe're about to break for dinner.\nJust want to let you know.\nWe've got some good country cooking vegetables\nand all that kind of stuff to sustain us through the evening.\nIt's going to be down in the under the stairwell.\nThe secretary's annexed that way, but it's fried chicken\nand lots of good vegetables.\nSo ready for round two.\nHope you enjoy it.\nThank you.\nAll right.\nWe should, we should move faster.\nWe should move faster.\nWe're going to stand at ease.\nHave dinner.\nand we should be rolling pretty well at we come back from dinner probably come\nback around 7, 15 or so, something like that and something. All right, all right.\nStand at ease.\nCenter from the six.\nCome to the roster.\n",
  "updated_at": "2026-02-12T18:18:11.4951+00:00"
}