{
  "video_id": "8PB7mZygfEc",
  "url": "https://www.youtube.com/watch?v=8PB7mZygfEc",
  "title": "Sen  Parent Press Conference on CDC | 9-2-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 44,
  "summary": "Here is a summary of the key points from the Georgia Senate Parent Press Conference on the CDC on 9-2-2025:\n\n**Overview**: The press conference addressed the systemic attacks and dismantling of the Centers for Disease Control and Prevention (CDC) by the government. Several state representatives and former CDC officials spoke about the threats, harassment, and challenges faced by public health workers at the CDC.\n\n**Key Actions**: No specific bills or legislative actions were mentioned.\n\n**Bills Introduced (First Reading)**: None detected.\n\n**Notable Moments**:\n- Rep. Omari Crawford paid tribute to Officer David Rose, a Cobb County police officer who was killed while responding to a shooting near the CDC.\n- Several speakers, including Rep. Saira Draper, Dr. Deb Hauri, and Dr. Dan Jernigan, discussed the attacks, misinformation, and politically-motivated rhetoric directed at CDC employees, which they said was undermining the agency's ability to respond to health crises.\n- The speakers emphasized the importance of supporting and protecting the CDC's public health work, which impacts every Georgian and American.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The press conference concluded, but no specific adjournment time or next session date was given.",
  "transcript": "Good afternoon everybody and welcome. My name is Saira Draper and I'm the state\nrepresentative for House District 90 in Atlanta and to Cab County. We are here\ntoday to address the systemic attacks and dismantling of public health by our\nown government. I along with the other elected officials you will hear from\ntoday represent areas near and where the CDC is located. We have many\nconstituents who are directly impacted by what has been happening at the centers for\ndisease control and prevention.\nAnd yes, we are fighting for those constituents, but do not be confused, because this is not\njust a cab county issue, this is not just an Atlanta issue, this is not just a federal\nworker issue.\nThe work of the CDC impacts every Georgian, every American, and indeed it has worldwide\nimplications because such is the work of public health. Many people may not realize what\npublic health is because when it is working you do not see it. You do not notice the\nListeria outbreak that was stopped before the cold cuts left the processing facility. You\ndo not see the influenza or avian flu event that was prevented because of good vaccination\npolicies. And Ebola seems like a far off disease because CDC workers put themselves in harm's\nway to stop the spread before it reaches our borders. Where doctors in an office or hospital\nare focused on the care of the single patient, public health officials work to improve health\nof entire populations. And so when you mess with the CDC, you mess with all of us. We\nWe just left an eye-opening roundtable discussion with a number of former CDC employees.\nIt really laid bare the attack that these public servants have been under.\nFrom the erasure of data to the dismantling of effective health programs to dodging literal\nbullets, the folks at the CDC have endured the unthinkable.\nAnd why?\nWhy do they put up with it?\nBecause they are deeply committed to the mission of saving lives.\nMany of these people have worked for decades in the sector, across many presidential\nadministrations, never allowing politics to interfere, always looking to the silent\nscience to guide the policy.\nSo let me give you an overview of what you will be hearing today.\nFirst you will hear from Representative Omari Crawford, who will kick us off with a\nvery important tribute.\nNext you will hear from Dr. Deb Hauri and Dr. Dan Jernigan, who resigned from the CDC\nlast week after the controversial ouster of CDC director Maneras.\nThen you will hear for Senator Elena Parent on the impact of the administration's rhetoric\non public health.\nNext you will hear from Representative Mary Margaret Oliver who will speak on the shooting\nat the CDC and the legislature's refusal to pass meaningful gun safety legislation.\nAnd finally you will hear from rep Moni Barnes from her perspective as a scientist.\nI will close us out with a call to support from our state leaders and open up the floors\nto questions from the press.\nSo without any further ado, representative Umari Crawford.\nGood afternoon.\nI'm Umari Crawford, the state rep out of Georgia's 89th house district, home to the Centers\nfor Disease and Prevention, better known as the CDC, our nation's leading public health\nagency and one of the most important agencies in our world. Before we begin this critical\nconversation, I think it's very appropriate and necessary that we take a minute to\nacknowledge the legacy of the Cad County officer who tragically lost his life on August 8th.\nOfficer David Rose ran towards danger on that day after her reports of gunfire near\nthe CDC, and in the line of duty, he made the ultimate sacrifice to protect others.\nHe lived by the principles that he spoke about at his police academy graduation, and that\nis protecting the vulnerable, standing for justice, and running towards danger when others\nmay run away.\nAfter that tragic incident, the legislatures that you see here today knew that we had\nto respond.\nIt was not a matter of if, but it was a matter of when.\nBecause as my friend representative Draper says\nthat when an event like this happens,\nit not only impacts the people in the community,\nbut it impacts everyone globally.\nAnd so I asked that we take a moment of silence\nto honor officer Rose, who was an American hero.\nIf you would, please take a moment of silence.\nOffice of roles die protecting another group of heroes, some of them that you see standing with me.\nThese men and women work tirelessly around the clock to ensure that we are saved.\nOur public health care workers make sure that we are protected from diseases and illnesses\nand they make it their life mission to ensure our safety. And while there are tools of danger,\nmay be different from those in law enforcement and make no mistake about it, that CDC employees\nalso risk their lives on a daily basis to make sure that we are safe, and it is important that we\nstand up with them. In today's climate of misinformation, conspiracy theories and politically\nmotivated rhetoric, our CDC heroes are under attack. Let me be clear that the baseless\nvilification of CDC professionals is dangerous and it undermines not only their health,\nbut it compromises our nation's ability to respond to each and every health crisis that may occur.\nWords have consequences. Let me repeat that. Words have consequences. And the recent violent incident\nat the CDC was not an isolated act. It was direct result of inflammatory, irresponsible language\nfrom some of our own leaders. This cannot continue, and if those leaders will not speak up in\ndefense of science, data, and public health, then we will. The continued support of the CDC\nis not optional. It is essential. Without the CDC programs that serve millions of Americans,\nespecially those in rural areas, those with disabilities,\nand low-income families are put at risk.\nAnd the ripple effect of weakening the CDC\nare their attempt at weakening the CDC.\nIt's massive as it impacts every corner of our country.\nEach hero working in public health puts themselves\non the front line every day, and we're very grateful for you.\nyou all face threats and expose yourselves to dangers\nthat many laypeople cannot even imagine.\nWe just had a very critical conversation in listening\nto what CDC employees do on a daily basis.\nIt's not only heroic, it's honorable,\nand we need to protect you.\nYou all have the education, the training,\nand the experience that we depend upon\nand so we have to trust your work\nand we must protect you so that you can do your work\nwithout fear or harassment.\nWe should never tolerate the harassment of our heroes,\nand we never would, and in the other industry,\nour heroes would never be the victim of abuse.\nIn any other industry,\nheroes would never be villainized\nin a way that our public health workers are,\nand so we cannot tolerate it here.\nOur public health professionals need our help,\nand the voices of some of those\nwho support you, like us standing here,\nneeds to be louder than the ill-advised,\nill-informed, the inexperienced, and untrained people\nwho are saying things that do not match facts.\nI am going to stand amongst you\nand I thank you for all of the work that you do.\nThank you for your courage, thank you for your sacrifice,\nand thank you for your service to your communities\nand to our globe.\nThank you.\nWell, good afternoon. I'm Dr. Deb Howery, and as of a couple weeks ago, I wouldn't have\nthought I would be here today, and so I don't have prepared remarks, but a few things\nI just wanted to share. First, I've worked across several administrations and was actually\nasked to be the transition lead for CDC because of my work across administrations. What\nWhat this means is that I was welcoming the Trump Administration and Secretary Kennedy\nto really see how we could help our priorities at CDC and those of the department align.\nUnder the prior Trump Administration, we advanced things like vaccines and overdoses.\nSo I was optimistic, I'm a mom, I'm a life, I'm a doctor, I'm a scientist, I work here\nat Grady, I care about saving lives as do all the people behind me that are former CDC\npeople.\nWhen I look at how right now decisions about vaccines are being made based on opinion and\nnot data or science, that concerns me.\nWhen I see how our non-communicable diseases like chronic disease and the work we've done\non overdose are being defunded and moved, I'm worried we're not going to be prepared\nfor those health threats as well.\nAnd when I think about the substantial talent that is being lost, the brain drain right\nhere in Atlanta and to our state, and the funding that is being lost to our state and local\nhealth departments and communities, I'm concerned.\nI love CDC, I love the work that I was doing, but being asked to take documents down that\nwere scientific, I could not do.\nAnd after seeing the politicization of work that shouldn't be politicized, it's about\nsaving lives and making a difference. Myself and several my colleagues knew that\nenough was enough and together our voices were stronger so we were happy to\ntalk with y'all afterwards but know that CDC is in our blood. You all matter to\nus and we are here because now is the time to look at how we can work together\nwork as Republicans and Democrats to make a difference in our community right\nhere in Atlanta and Georgia. Thank you.\nThanks very much. My name is Dan Jernigan. I'm the former director of the National\nCenter for Emerging and Zoonotic Infectious Diseases at CDC. I've been at CDC for 31\nyears. I've worked for part of that time with CDC at the Washington State Health Department.\nI've been working through multiple different agencies\nthrough many years, different presidents,\nRepublicans, Democrats, and have been able to get the work\nof public health done throughout all of that time.\nBut we find ourselves now with the difficulty in doing that\nbecause of the current secretary.\nWe know that the agencies, as we've been hearing,\nis under attack.\nI was actually in one of the buildings\nwhen the bullets started flying.\nSome of the buildings were the bullets hit.\nWe were on the phone with folks in other parts of the CDC\nwho were telling us that the building is shaking.\nWhat's going on?\nWe were able to see the fire department pull out\nfrom the fire station right next to CDC,\ntrying to get people to turn around so that they didn't drive\ninto the firing of that shooter.\nThat was a physical attack, and we mourned for Officer Rose.\nand the work that he did to help protect us,\nbut that physical attack, I did not get physically attacked,\nbut the agency itself has been attacked with rhetoric\nand with the kinds of information that's being put out there\nthat really does not lead us to better public health.\nIn public health over 31 years,\nwe realize CDC is not perfect.\nIt is continually being revised.\nIt is continually asking questions\nabout how to do things better,\ntrying to address whether or not the status quo needs\nto be changed, it can do that.\nIt changes all the time.\nIt can look to innovations.\nBut right now, however, I was in a situation\nwhere I could not stay any longer,\nbecause the current secretary and the immediate offices\nof the secretary, we're not following\nthe existing executive order on transparency\nand gold standard science.\nWe need to make sure that when they say,\nWe need to be transparent that we understand\nhow the studies are being done that will be released\nin the next couple of weeks.\nWhen they say gold standard science,\ndo we know that they are following objective approaches\nto looking at the data and coming up\nwith the answers regardless of what you want them to show?\nAnd then finally, when Dr. Menora's was released\nfrom her job, it really indicated that her ability\nto use science as the driver for public health policy making\nand for her ability to have independence\nwith the advisory committee for immunization practices\nwhere vaccine decisions are made.\nBoth of those things looks like we would not be able\nto do that any longer.\nWe would not have a director that could do that.\nAnd that was the final straw for me,\nfor Dr. Howard and Dr. Descalakis.\nSo what's at risk right now?\nI think you could almost see this as death by 1,000 cuts.\nWe're cutting staff, we're cutting resources,\nwe're undercutting science and that's leading\nto the undermining of trust.\nAnd so for us right now, we need to do everything we can\nto work with the current administration as we can,\nbut also to get folks out there and ask that science\nbe put first, ideology put second,\nand that we can get back to protecting Americans here.\nThanks.\nThank you so much, Dr. Tari, and Jernigan.\nWe respect your many, many years of service to all of us through your positions at the\nCDC and appreciate you being with us today, as well as everyone else who has worked at\nand cares about the Centers for Disease Control and Prevention who are here with us today.\nMy name is Senator Elena Parent and I represent the 44th Senate District, which does include\nthe headquarters of the Centers for Disease Control and Prevention.\nWhat happened on August 8th at the CDC was not just a tragedy.\nIt was a wake-up call.\nThe death of Officer David Rose and the terror inflicted upon CDC staff and all the surrounding\nneighborhoods were the direct result of a climate that has grown increasingly hostile\ntowards public health workers. According to multiple press reports, the shooter believed\nthat the COVID vaccine had made him ill. He blamed the CDC and acted on that belief with deadly\nviolence. But this wasn't an isolated incident. It was the culmination of years of inflammatory\nrhetoric, misinformation, and political attacks on science itself. We have seen federal leaders\ndelay their response, downplay the threat, and in some cases actively fuel it. Health\nSecretary Robert F. Kennedy Jr. has repeatedly spread false claims about mRNA vaccines,\neven terminating contracts for their development just days before the shooting.\nHis statements, since becoming Secretary and for many years before it, have undermined\ntrust in science and emboldened those who view public health professionals not as protectors,\nas enemies. In the wake of the shooting, President Trump has not made any public remarks about\nthe shooting or about the shooter's motivating beliefs. A striking omission from someone\nwho claims to be tough on crime and supportive of law enforcement.\nThis omission gives tacit approval to the shooter's views.\nMake no mistake.\nWe cannot build vaccine policy on suspicion, misinformation, or politics, as this administration\nis clearly doing.\nOur policies must be grounded in science, transparency, and the collective expertise\nof people who have dedicated their lives to public health.\nStaff at the CDC have voiced their frustration and fear.\nThey've watched their budget slashed, their expertise dismissed,\nand now their safety compromised.\nThe shooter fired hundreds of rounds into six CDC buildings.\nThat level of violence does not happen in a vacuum.\nIt happens in a culture that is being fueled\nby this administration directly,\nthis president directly,\nwhere public servants are vilified\nand the truth is treated as optional.\nTo all of those at the CDC who feel abandoned\nor ignored in this moment. We want you to know that we hear you. We see you. We\nappreciate you. And we, those of you who have been elected to this General\nAssembly, will use our voices to amplify your voices. We must name this for\nwhat it is, a systemic attack on public health. And we must respond not with silence, not\nwith spin, but with solidarity for those employees who have dedicated their lives to saving\nours, truth and action. Because if we don't lift our voices to protect the people who\nprotect us, we all pay the price. Thank you very much.\nThank you, everyone, for being here today. I'm Mary Margaret Oliver, State Representative\nHouse District 84, and in my long career, both the House and the Senate, I've represented\nthe CDC community continuously.\nI live about 200 yards off the Henry Campus.\nI have had an opportunity to work on gun violence prevention\nlegislation in this building from both sides of the aisle,\nfrom the House and the Senate.\nAnd I want to give you just a very brief history\nof why gun violence prevention legislation is today the most\npartisan issue that I have dealt with in a long political career.\nThat was not always true, and that's my real message this morning.\nWe have in the past had obvious victories and progress with bipartisan gun violence prevention\nlegislation that somehow today has come to a stop.\nI was the sponsor of legislation to ban assault weapons for several years.\nThat bill was never allowed a hearing in this building.\nAnd the reason that I brought that legislation forward in the Georgia legislative role was\nas you know in 1994, in a bipartisan effort, Congress banned assault weapons.\nAnd based on a political compromise of that day, they banned them for 10 years thinking\nthey would revisit the issue in 2004. When 2004 came, there was no compromise. The\npartisanship around gun violence prevention had taken over and grown and the\nassault weapon banned federally was walked away from. Here's the question I want\nyou to ask, how many children would be alive today if the assault weapon ban had\nremained in effect legally? Think about the patterns of school violence, shootings,\nand murders, and what was the weapon used and ask that question to your neighbors,\nto the folks that you go to the soccer games with, and to all of those of you in\nyour families and communities that care about gun violence prevention.\nEarlier in my career, there was a legitimate bipartisan discussion, Senators and House\nmembers on a variety of issues.\nWe weren't successful in passing a lot of that, but we did have civil and specific conversations\nabout gun storage, about liability, and about opportunities in hearings where law enforcement\nwould come forward and talk about the need for gun violence prevention.\nI call upon the Senate leader, Bert Jones, the House leader, Speaker John Burns, to\nreconvene a bank partisan hearing and discussion\nabout bipartisan need for gun violence prevention.\nWe are at a point where we know our constituents\ncare about this issue, and we are at a point\nwhere an honest discussion is more needed now\nthan it ever has been.\nThank you very much.\nGood afternoon, everyone. My name is Representative Imani Barnes. I represent House District 86,\nwhich is in Tucker and actually encompasses some parts of Emory University. I proudly\nstand here as a scientist and with a career in public health and a doctoral candidate\nin public health. Public health and science is my passion and I draft a lot of my policy\nof using public health methods and data and science. Too often public health is invisible\nuntil something goes wrong, as my colleague also said,\ndoctors and nurses, we understand what they do,\nthey treat individuals, but public health,\npublic health protects populations,\nand that's something we can't physically touch\nas doctors and nurses, but we know makes a difference.\nIt's the reason we have safe drinking water.\nIt's why smoking rates are down.\nIt's the reason we have systems in place to trace outbreaks,\ndeliver vaccines, and respond to hurricanes,\nand reduce maternal mortality and mental health.\nPublic health is the quiet shield that surrounds all of us\nwhen it's working, and most people never even notice it,\nagain, as my colleague said.\nBut when it breaks down, the consequences are devastating.\nSo what happens without public health?\nWe've already begun to see those consequences.\nCuts to the CDC and the NIH.\nJust don't weaken the federal government.\nThey destabilize local clinics and research centers\nand mental health clinics.\nEmergency response teams across Georgia become depleted.\nAs was said earlier, about $0.80 of every dollar\nin CDC's domestic budget goes directly to state\nand local institutions.\nI happen to be an employee of one of the local institutions\nwho was also affected by the shooting.\nAs we're discussing CDC, the community,\nthe other local institutions were also affected\nwho had to go to work the next day\nand be in that scared and silent environment\nafter just having a terrorist attack on something\nthat we also do.\nThis funding supports disease prevention, emergency response,\nand other things that I've already stated.\nWhen it's slashed, the consequences are predictable.\nWe know what happens when we don't have public health.\nMore illnesses, more preventable deaths.\nAnd if we want to entice others who don't believe in this\nscience, it eventually affects our economy.\nThese are important services that impact real families living\nin the state of Georgia every single day.\nRight now, there's mRNA research that's leading\nto vaccine technology.\nAnd it's already saved millions of lives.\nAnd it has the potential to prevent cancer.\nBut progress like that does not happen\nwithout sustained investment in our public health systems.\nYou can't isolate public health from the rest of the society.\nIt touches everything, it touches our school,\nit touches our jobs, it touches our justice system,\nour safety, our sense of safety.\nAnd let room remind you of something\nthat we may all be aware of, public health achievements\nthat have been in history.\nThey're a eradication of smallpox.\nWe got measles coming back in Texas,\nand we're not very well educated\nbecause we can't be with the current administration.\nThe eradication of smallpox was a CDC-led effort.\nAnd without that, can you imagine what our nation would be like?\nCan you imagine if the funds dried up then\nin politics overshadowed science then?\nTo dismantle public health is to destabilize\nthe very fabric of our society.\nIt's not a privilege to have public health.\nIt's a lifeline.\nWe owe it to our communities, our researchers,\nour scientists, our responders,\nand we owe it to Officer David Rose\nwho fought for us in the event that we had a terrorist attack.\nNot just because it's a crisis,\nbut we need to fight for public health every single day.\nAnd thank you for your time.\nIn February, I stood here on these steps with many of these same folks behind me, and\nit was in the thick of the doge cuts to the CDC. Thousands of jobs were being slashed\nindiscriminately without any seeming regard for the repercussions to public health.\nAnd at that time, we begged state leaders in Georgia to do something.\nTo speak up for Georgians, to protect their work and their livelihoods, and to fight for\nthe science that would keep us healthier and safer.\nAnd we were met with silence and with shrugged shoulders.\nOn August 8th, Governor Kemp rightly praised Officer Rose for his heroism during the\nattack on the CDC campus. But he said nothing about the terror endured by CDC staff, the\nchildren and the caregivers at the onsite childcare center, or the ripple of fear felt\nacross nearby institutions. And that silence matters. Perhaps he is following the signals\nof President Trump, who also has said nothing publicly about the shooting of a federal agency.\nAnd while Secretary Kennedy acknowledged the shooting, his concern was seemingly short\nlived, because he forced out CDC director Minaras for saying the obvious that anti-vaccine\nrhetoric contributed to the shooting.\nhealth in this country has never been more under threat.\nSo we, again, call on Governor Kemp to take action, not only on behalf of his constituents\nwhose livelihoods are threatened, but on behalf of all Georgians whose health is at stake.\nGovernor Kemp, we are calling on you to publicly support the CDC.\nNot just as a federal agency, but as a cornerstone of Georgia's identity and global leadership.\nExpress empathy for the staff who have been terrorized, dismissed, and demoralized.\nStand with the scientists, the epidemiologists, the data analysts, and the community of health\nworkers who have dedicated their lives to protecting ours.\nrecommendation we have is that you protect Georgians by establishing state-based\npublic health strategies. For example, since decisions about vaccine access are\nnow being politicized, Georgia can develop a state-based vaccine access\nstrategy, purchasing vaccines directly and authorizing state-run clinics to\noffer off-label vaccinations under physician guidance. This would ensure\naccess for vulnerable populations, especially those excluded by\nand politicized federal guidelines.\nGovernor Kemp,\nwe call on you to build or join multi-state coalitions\nto defend science and share resources,\npartnering with other states to issue joint statements,\ncoordinate legal strategies,\nand amplify evidence-based public health messaging.\nAnd finally, we ask you, Governor Kemp,\nto reaffirm a commitment to transparency\nand public trust, communicating clearly,\nand consistently about public health interventions\ngrounded in science, not politics.\nAnd I'll say one more thing.\nThere have been many campaigns launched\nfor statewide office in the last few months.\nIf you are a candidate running for statewide office in 2026\nand you are not fighting for the CDC\nand by direct extension, the public health,\nyou have no business being entrusted\na position of leadership. Stand up, speak out today. Public health is not just about responding\nto crisis. It is about preventing them. It is about surveillance, science, and service,\nmeasuring threats, understanding their causes, and implementing interventions that protect\nentire populations. And when it works, it saves lives quietly, efficiently, and cost effectively.\nWe cannot afford to lose this capacity. We cannot afford to lose the CDC, and we cannot afford\nto lose the moral clarity that comes from standing up for science, for safety, and for the people of\nGeorgia. If there's any questions from the press, we will take them at this time.\nThat's a great question because over and over again, we have said that this is not a political\nissue. It shouldn't be a political issue. But, you know, I'll refer you back to February\nwhen we held a press conference during the legislative session. And while there were\na lot of people here in the audience, probably both Democrats and Republicans, none of my\nRepublican colleagues on the other side of the aisle were here.\nAnd so unfortunately, I think people take a lot of their direction from the top.\nAnd the Trump administration has politicized what shouldn't be a political issue.\nAnd look, the reality is, if you're a politician in Georgia, it is scary to go up against Trump,\nright?\nThere are repercussions for people who go up against Trump.\nAnd so people might be weighing the consequences of standing up and doing what's right.\nAnd here's the thing, with this issue, it's black and white.\nWe are either protecting the people of Georgia or we're forwarding our political ambitions.\nAnd if that's what my colleagues are doing, they're making the wrong choice and shouldn't\nbe in leadership.\nYeah, and first I want to say I'm sorry for the loss of your friend\nWe did and we took notes and what I would say okay so I appreciate that you\nknow happy to have a discussion later but Dan and I are going to just try to\nanswer your question and what I would what I would say is may I listen to you I\nhope you'll listen to me and what I would just say is we have a vaccine safety\nreview that we do can I can I finish and what I would just say is we look at\nevery death, we do have investigations that happen and when we saw that there were issues\nlike even recently with the Chukaganya virus, we quickly acted and worked with FDA to change\nit.\nDan, do you want to add anything to that?\nThere are multiple different vaccine systems that we used to monitor safety at CDC and those\nsystems have been in place for a while.\nMany of that data is actually public data.\nSo happy to follow up with you on how better we can do to how better CDC can do to make\nthat are more available to folks.\nThanks.\nThanks.\nWe have another question.\nSo why was the CV saved soon?\nWhy was the CV saved?\nWe're going to wait out.\nWe're going to let them ask for a question.\nLook, when it comes to outsider points of view,\nI don't think that's the issue.\nBut the science is the science, whether you believe it\nor not.\nAnd the science is truth, whether you believe it or not.\nSo to the extent, so what I will just say\nas a transition lead in the chief medical officer.\nI did read RFK Junior's books.\nI was also willing to brief him on measles, vaccines,\nH5N1, but I never did.\nI was never asked.\nThank you.\nNext question.\nI think we're already feeling it, you know, when we've had over 2,000 people impacted by\na reduction in force, that impacts our labor, our spending, and the economic development\nin this city, certainly I think we're going to see even more of a ripple effect as budget\ncuts impact the state and local health departments.\nI think that's when we'll see it even broader across Georgia, but we're feeling it now.\nThe people behind me, many of them, lost their jobs, so we're already feeling this.\nAnd I think that's what's important is understanding that people here are trying to save lives.\nThey dedicated themselves to this.\nThey are career public servants.\nYeah, I think it's a CDC isn't alone in public health.\nMost public health is done at the state public health\ndepartments and at local health departments.\nAnd much of that is supported with federal funds.\nUpwards of 90% of community disease departments in state\nhealth departments are funded with federal funds.\nAnd so as there are cuts to CDC, there\nwill be cuts then to the state health department and services\nlike monitoring foodborne illness, vector control,\nthings like that that you may not even know is happening\naround you, you'll start to see that that's not happening\nin the increase in cases of disease\nthat are associated with that.\nYou know, 50% of the budget comes,\nthat's pharmaceutical.\nAll right.\nOkay, next question.\nCan you repeat the question we couldn't hear?\nDo you mean with the department or with the community?\nby HHS, I say because at CDC we deployed people to Texas,\nworked very closely with the State Health Department\nwho was a wonderful partner.\nSame thing with many of the surrounding states,\nwe did provide vaccines and other therapeutics\nas well as on the ground, technical assistance.\nMyself and the measles team were not asked\nto brief the secretary, we did offer.\nWe did, we were asked for updates\nand we provide data regularly on measles\nand we publish it on our website too.\nIt's very open and transparent to the public,\nboth on vaccinated, unvaccinated cases\nand where it spreads across the nation.\nThe vast majority of cases come from outside the US,\nbut then are spread among populations\nthat are not vaccinated.\nSo the new director is an acting director, so my hope is that the president does determine\na new, you know, permanent director because what is really neat is permanent scientific\nleadership.\nThe deputy secretary who's the acting director has an operations background and so that's\nimportant, but he needs a strong scientific and medical bench around him, and that is\ncurrently lacking given many of the departures.\nDr. Minar is the first non-physician, but she was a PhD scientist.\nThis would be the first non-physician or non-scientist to be leading an agency, and I do think\nit's important when that new bug or pathogen happens, or when there's an outbreak to know\nWhat to do on spur of the moment when you do get that call from the White House\nThe CDC has a long history of looking at the science methodically going through it, identifying\nwhere the biases are and then coming up with recommendations that are science-driven.\nThe staff will continue to do that.\nAt this point, there's a lot that still is up on the website that you can trust.\nMy concern is that anything coming out after a couple of weeks from now that if it is placed\non the CDC website with regard to vaccine safety, I'm not so sure if we can trust that information.\nMy request to the secretary is to get back to science driven development of policy, looking\nat the data.\nWe can do that.\nWe can look at all sides of information and come up with the best path forward and we would\nasked that he would do that, just as we've done in the past.\nYeah, I think there's a what we're seeing is that there's a lot of uncertainty out there\nright now and that's leading to people having indecision so they're not choosing to get vaccinated\nwhereby it would have been very simple for them to do that previously. I'm concerned about\nthat because I think without those vaccines people will be getting respiratory illnesses,\nespecially those that are at higher risk. So we want people to take those vaccines. We hope\nthat they will be available. I was referring to some statements that the Secretary has made about\nrevelations of new scientific findings that will come out in the next couple weeks.\nI think that was some of the comments I made previously about transparency and gold standard science it's not that I know that something is coming out. I don't know what's coming out.\nThey can, but most scientists will usually have a protocol, they'll publish that protocol,\nyou'll know exactly how they're doing their analysis to provide data that you can then\nre-analyze.\nI'm not sure what will happen here.\nThis is not the way that we do science at CDC.\nAll right, thank you very much, we're going to stop this now, but thank you very much\nfor your time and we appreciate your attention to this matter.\nI'm sorry, I'm so sorry.\nMy brain turned up because I was...\n",
  "updated_at": "2026-02-12T18:43:35.238836+00:00"
}