{
  "video_id": "8rYjsz4MJvE",
  "url": "https://www.youtube.com/watch?v=8rYjsz4MJvE",
  "title": "10-11-23 Joint Study Committee on Dual Enrollment for Highly Skilled Talent at Younger Ages",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 26,
  "summary": "Here is a structured markdown summary of the Georgia 10-11-23 Joint Study Committee on Dual Enrollment for Highly Skilled Talent at Younger Ages session:\n\n## Overview\nThe committee discussed several recommendations to simplify, educate, and invest in dual enrollment programs for highly skilled students at younger ages. Key focuses were defining \"high-demand careers\", improving information accessibility, streamlining articulation agreements, and providing more funding for instructors and counselors.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- The committee discussed the need to clearly define \"high-demand careers\" in statute, and potentially consolidate multiple lists into one.\n- There was emphasis on improving accessibility of information about dual enrollment, CTAE courses, and accelerated career pathways for parents and students.\n- The committee recommended streamlining and encouraging more articulation agreements between school systems, technical colleges, and universities for strategic two-plus-two arrangements.\n- The committee discussed removing the sunset provision on Senate Bill 86 to provide continuity and clarity for the dual enrollment program.\n- The importance of data-driven decision making and broad stakeholder collaboration was stressed in the \"educate\" section.\n\n## Votes\nNone detected\n\n## Attendance\nQuorum was present, with multiple committee members participating.\n\n## Adjournment\nNo specific adjournment time noted, but the session was limited to 30 minutes.",
  "transcript": "the joint study committee on dual enrollment for highly skilled talent at younger ages based off\nas Senate resolution 175. Got my chairman Matt Dubnik here. And we've got multiple members on\nline. We got Dr. Art recesso here with this line line and Derek DeBrowie at it. Thank you.\nSo glad everyone's here. We are going to get a little out of order on the agenda and keep in mind\nwe've only got 30 minutes in this room. So we're actually going to do public comment first and then\nwe're going to go over the report. When we go over the report for committee members, if you'll\njust go straight to page 18, that's where our findings are. And so we will go through those\nfindings. If you have any additions or subtractions, we'll do that and actually Chairman Dupnick,\ndo you want to kind of cover that process and what that'll look like?\nLike Mr. Chairman, so members of the committee will treat this like we are in session,\nAnd so we will, I will walk through this with Chairman Brass, we will review this and at the appropriate time, I will entertain a motion.\nAnd should that motion be that this do pass, then we, at that time, we would discuss any changes as he said anything that needs to come out amendments, etc.\nSo just procedurally for what it's worth, that's how we'll tackle this today.\nand we'll kind of walk air by through that as we get to it.\nSo first, let's kick off with our public comments.\nDid we have anybody sign up Mercedes?\nAll right, is there anybody online, public, from the public?\nOkay, good, we'll jump right into the report.\nAll right, again, let's go to page 18 on your report.\nAnd we'll give you all the cliff note version because that's how I got through college essentially what we've come up with in this report and what we've learned through this process through these four study committees that we've done.\nAnd there's really three things that we feel like we need to tackle.\nAnd they are, simplify, educate, and invest.\nAnd so when you dig into the simplify, we'll start there.\nAnd y'all can all read, so I'm not going to read, but I'll just kind of hit the highlights.\nWe kind of determined that there's really no clear definition\nin statute for high demand career.\nIt is mentioned in statute on multiple occasions,\nbut again, we never actually define it anywhere.\nSo that is one of the first recommendations\nis that we need to clearly define high demand career.\nWe need to add that in the statute.\nAnd I'll add to one thing that's not in this report\nbut that was discussed was when we're talking about\nsimplifying and we're talking about, you know,\nhigh demand careers and defining it,\nwe did determine that there's two lists out there.\nAnd we think in order to simplify,\nit would be good to go down to one list.\nAnd so I think, in my humble opinion,\nthat would be a good little sub bullet point\nunder a clearly defined Honda Bay and career.\nNext, we've got the next bullet point\nyou got ensure information regarding dual enrollment,\nCTAE courses and accelerated career pathways\nis more accessible to parents and students.\nAgain, I think that one's pretty self-explanatory\nif anyone from the committee wants to touch on that more\nor add more to it.\ncertainly make those, we can take those suggestions now, or when we get to the appropriate time for the amendment, you can certainly do it there.\nSo is there anybody wants to comment on that?\nAll right, next we need to streamline and encourage more articulation agreements between our local school systems, the technical college system of Georgia and the university system of Georgia.\nThis would create strategically designed two plus two arrangements in high demand career fields.\nAgain, we discussed this really in our last study committee.\nYou know, we found that a lot of these arrangements were done more locally.\nthey're doing and regionally and I think it would be in the best interest of our of our students\nand our future workforce if if there was a little more uniformity across our state and\nis there anybody else wants to comment on that saying none we'll move on and last but point\nThe artificial remnants on the program by removing the sunset provision in Senate Bill 86.\nQuick refresher, of course, we did have a three year sunset on Senate Bill 86.\nAnd as a student, as a parent, as a counselor, it is difficult to recommend this path if there's no clarity that this path is going to be available in three years.\nthink that one's pretty self-explanatory.\nAll right, Mr. Chairman, you want to cover educate?\nAbsolutely.\nSo I think, again, I'm a chairman brass.\nWe don't need to read every word here.\nAnd I do want to just kind of echo his last point.\nI think when it comes to a time frame, we want continuity\nand we want this to exist.\nI will actually pull a line from above.\nwhen we talk about educating,\nI think this is about promotion,\nboth to parents and students.\nNo parents and students,\nsome are gonna, I believe, see action\nby getting to the parents, some better to the students,\nbut they're both gonna talk at home,\nbut I also think, and it talks about,\ndown in here, high school counselors,\nbut I love what we put in here, middle school counselors.\nWe heard it when we went, you can't just start\nwhen they're 18 or 16 or, you know,\nwe have to go back earlier and earlier.\nAnd so I really think the crux of the message here\nabout educating is to get the word out.\nI'm a marketer by trade,\nso I'm a little partial to talking about education\nand I really think that that's marketing.\nBut if we come down here to the bottom\nand look at these bullet points,\nI don't think it can be stressed enough\nthat there has to be a way centered around data\nfor us to define high demand careers.\nIt's one thing of Chairman Brass and I get together\nat right, and are shooting marbles\nand trying to figure out which way the wind's blowing today,\nbut this needs to be based on data\nthat can be quantified, that we contract\nand we can monitor, and it's not at the whim's\nright of any elected official or board\nwith no disrespect to any of those people,\nbut I think that needs to stand on its own.\nWe already talked about getting the word out\nand I think really these other bullet points\nkind of illustrate what I was talking about.\nI am a data junkie,\nso the more that we have good data,\nwe can make good decisions,\nbut as the old saying goes, garbage in, garbage out.\nSo I think it's gonna be incumbent\nand I know I stress this before\nI'll stress it again and be on my soapbox and I'll shut up after this.\nThis is going to take everybody.\nThis is going to take anything from the governor's office and all the entities that fall under\nhis purview to the legislature and what we can do to TCSG, to USG, to student finance,\nthe independence.\nIf we're all not at the table working to make this better, we're just going to be back\nhere in a few more years with a few more gray hairs having another study committee talking\nabout the same thing, back in Mr. Amin.\nAnybody want to comment or discuss that online? Okay.\nAll right. And so our third and final little section here on page 19 is invest.\nAnd so part of that was we discussed more funding for technical college system of Georgia instructors.\nWe discussed provide more funding for high school counselor positions.\nWe discussed conducting and we've got on here an annual return.\nI would like to see that change to an ongoing return.\nA lot of times when you're conducting investment analysis,\nyou really may not get a good analysis over one year.\nSo I don't know that we need to lock ourselves\ninto an annual return.\nSo we could just kind of change that at the appropriate time\nto ongoing return on investment analysis\nto ensure that existing CTAE programs of study\nare aligned with workforce needs,\ninformed by labor market demand,\nlink to occupations that are middle school, middle to high wage and vertically aligned to post\nsecondary programs, and to determine where high demand high school high wage CTAE programs are\noffered across all recognized local education agencies. And then third, understand student access,\nparticipation in completion data by student groups to determine potential inequities.\nAnd again, I think that kind of sum all that up and basically the legislature needs to determine who needs to evaluate our list and then come up with a way to either add or remove programs as needed.\nSo that is not in there, but we might put that in there for a point of clarity.\nAll right.\nIs there any discussion?\nDid we, does he might feel like we missed anything or would like to see something added?\nI think now would be a good time to discuss that.\nAnd then we can discuss further as we get into the, the motion for the actual report.\nAnybody online?\nYeah, just a quick question. I don't know if there was a DOE rep that was there they could\ntalk about if they've looked at the recommendations anything they can do\nbefore legislative action something that just would be more policy from DOE instead of\nin the regulations state law.\nI would need more clarification from the question.\nI guess if you've had time, I'm not sure if you have had enough time to look at the similar recommendations.\nAre there areas where DOE could would consider enacting some of these recommendations.\nYou know that wouldn't require state action official legal action. It'd be more DOE policy\nSo we have a look at the recommendations\nI'm\nAgain, not sure exactly where\nDOE would be able to make adjustments on the on our end\nBut I mean again, I'd have to I think that would have to be a deeper discussion around what specifically\nfolks would be looking for for DOE to make me just, for all of the recommendations that\nare provided.\nWe took about defining high demand careers.\nThat doesn't happen on our end.\nI mean, we are, like I said, providing information and, you know, use this to systems on like\nyou accelerated career diplomas as a matter of fact our state board already adjusted our board rules\nto change the name from option B to accelerated career diploma and that happened this past year.\nSo we had already begun taking steps there. The educating the systems and counselors on the\nimportance of dual enrollment and the accelerated career pathways. We've already gone down that\nLastly, we have a dual enrollment coordinator that, again, works with our school counselors\nand provides them some of this information.\nYou know, similarly, we will, you know, continue to make adjustments and share this information\nwith middle school counselors as well.\nWe, you know, I've already been doing that, but we will, you know, improve our efforts in that area.\nOutside of that, I think that, you know, the other areas here, most of it, like, you know, providing more funding, I mean, we don't have, we don't have the capacity to do that.\nSo, like I said, I've looked at it and finally came out yesterday, but I think, you know, just offhand, I share some of the efforts that we've done.\nobviously we will continue to look at the the study committee report you know now that it's\nout and once it's finalized as you know we do with all of them and on iron we'll redo what we can.\nNow I think you've done a good job in the past I'm trying to get the information out sometimes\nif you get it out it's not always hurt or accepted broadly I didn't know if there were other ways\nof getting the message out or making sure, you know, like start from the top, like superintendents\nor boards. If you guys are active with GSSA or George School Board Association to try to get\nhelp to get their support to get it through the ranks of all the schools, I'm going to make sure\neverybody buys into it. Absolutely, and we just should information with, with, uh,\nand coordinate with all of our various education partners with this G.S.S.A. or G.S.B.A.\nSo we certainly, like I said, share that information through both their conferences\nand through their various mediums including our recess. So, you know, we will continue to do that\nas well. Absolutely. Great. Thank you. Well, and I'll add two\nrepresent towns and this this report doesn't lock the legislature into really anything. We're only\nmaking recommendations and we're not even necessarily recommending the legislature specifically,\nalthough I did say it in the last comment I made, but we aren't necessarily locking the legislature\ninto anything. We're just saying we're recommending these changes take place. We're not necessarily\nwe're recommending how they take place.\nYou know, a lot of times, as you know, we just, sometimes it's just getting, getting all\nthe players of the three-legged stool together and working out a solution.\nAnd you know, we've got representatives from each on this, on this committee.\nAnd I'm confident that, that we're all going to be able to sit down and figure something\nout, moving forward.\nWhether it be legislatively or not through rules and regs, there's multiple ways to skin\na cat, if you will, and we're going to keep the idea here is to build a, build on a West\nHardier, great program and keep it sustainable and whether that's, whether we need to do that\nlegislatively or not, you know, we can, we'll figure that out.\nSo, but great question.\nThank you.\nGreat question.\nAny other questions from anyone online\nor all two of you here with us?\nYou're a gold star for being here.\nYeah, that's right.\nOkay.\nAll right, well, I guess if there's nothing else\nto add at this time, we can certainly discuss things.\nShould we have a motion to move this report out of this committee?\nAnd again, there would be time after that motion to discuss any changes or additions.\nSo seeing no other discussion, I see representative towns and you've already hit the hot mic button.\nSo I'll recognize you.\nNo, I'd like to make that motion for the committee to go with the recommendations.\nAll right, so we have a motion that this how do we officially say it the findings and recommend recommendations do pass is there a second?\nSecond.\nAll right, we have a motion in a second. So now would be the time for any further discussion.\nMiss Taylor.\nOkay, got it.\nSo if we have any amendments or changes that are needed,\nChairman Brass, do you have some already?\nWell, I'm a chairman.\nI mean, as a chairman, I can't make an amendment,\nbut since we're discussing it,\nI'd love to add a little language if someone will do it for me.\nBut up under that first bullet point,\nor really wherever is appropriate,\nI would like some clarifying language\nto where we're gonna recommend\nthat we take the high demand career list\nfrom two lists down to one.\nSo, if anybody wants another brownie point.\nWhat would you specifically say that language would be\nand where would we insert it just to be clear?\nI think after bullet point one,\nSo I inserted a second bullet under the first set of recommendations and it says create\na singular high demand career list that is regularly maintained to reflect workforce\nneeds. That's captures exactly what I was thinking. So would anyone like to make a motion\nto amend with the, well, again, we won't call it the brass amendment, but we have some\nlanguage to insert. Anyone like to move that that be adopted?\nThis is Scott Steiner. I'd make that motion to adopt that language.\nThank you, Scott. Do we have a second?\nDon't I'll speak at once now. Second.\nAny further discussion on amendment number one?\nAll right, you give to that, Mr. Chairman. Yes, sir. All right. Well, then we won't take a vote. I also say then we'll call that for a vote.\nAll those in favor of men number one, please say aye. Aye. Aye. Aye.\nOkay, I'll do any opposed. Same side. All right. Motion carries amendment one is adopted.\nMr. Chairman, you have some other items. Well, actually, I've got a question for Bayley. So that\nlast little tidbit, I said, well, you know, we need to kind of determine who should evaluate list\nand update it. Is that kind of captured in that final bullet point under three?\nThree three you mean? Three three yes correct. On page 19 the very last bullet point.\nWould you say that's captured there or would we need some? Would this be more clarifying language?\nI feel like it's captured, but if you want clarity, we can add something. I also,\nbased on what you said earlier, I changed it from conduct and\nconduct an annual return on investment analysis to conduct an ongoing return.\nOkay, I'll be fine with that.\nThat ledge counts back here too.\nWell, I mean, it's a report just in case you wanted it.\nThank you.\nThat's exactly what we wanted to hear.\nNo, that's fine. I don't even know that we need a motion on that.\nOkay.\nSenator parent, did you have a comment or question? I see you're unmuted.\nOh, no, I did not. I just unmuted to vote. Yeah, sorry about that.\nNo, I'm good job, Mr. Chairman and Mr. Chairman.\nExcellent. And you wanted to make sure that you were heard today and that we got all your input at it.\nThank you so much. I just want to say I'm shocked that you don't have. I know, right? That's\nI figured that's exactly what I'm feeling great to have a speaking engagement, you know,\nthat I'm holding on to. I appreciate you. All right. Anything else?\nDoes anyone else online have anything else they would like to add before we proceed forward?\nAll right, anyone in the room? Hearing none, we have a motion and a second that the findings\nand recommendations do pass as amended once. Is there any further discussion? Hearing none.\nAll in favor of this passing as amended say aye.\nAye.\nAye.\nAye.\nAye.\nAny opposed same sign?\nLet's chairman that motion do pass does carry.\nAll right.\nWell, good deal.\nWell, good work everyone.\nIt's been a pleasure working with each and every one of you.\nAppreciate your attention and and good hard work on this.\nIt's we appreciate all the speakers that have come forward everyone through public comment or whether they were only agenda.\nWe certainly appreciate it. Thank you to Albany for opening up your doors for us.\nJust doing great work down there. Scott, you guys, you guys are doing a great job.\nThank you to noon in CEC mark. Thank you for opening your doors to us.\nAnd then, of course, the people's health.\nAnd just been, again, been a pleasure.\nBayroom, thank you for all your hard work on this.\nThis is a great report.\nAnd, you know, I think it's very easy to read\nfor people like me, so that's good.\nAnd again, all our staff, thank you so much\nfor all your hard work, Mr. Chairman.\nBeen an honor and a pleasure working with you, as always.\nAnd again, we'll look forward to seeing each and every one\nof you look forward to working with you\non moving this plan forward and these recommendations\nand seeing them through.\nAnd just looking forward to provide an opportunity\nfor these kids to walk into the workforce prepared\nand ready and making good money.\nSo with that, we'll call this meeting adjourn.\nAnd see my hand raised.\nOh, I'm sorry.\nI did not where you got Madam later.\nThank you, Mr. Chairman.\nI just wanted to give a thanks\nfor a late arriving presentation from the cab county.\nThey really appreciate the ability to come\nand present before the committee.\nAnd we have so many talented young people in the cab\nacross the state so they really did appreciate the opportunity to present their\nschool as well. So thank you very much.\nAbsolutely well said thank you for that. Okay, everyone have a great day.\nmaking a jar.\n",
  "updated_at": "2026-02-12T10:53:01.907529+00:00"
}