{
  "video_id": "8VyoojVUnig",
  "url": "https://www.youtube.com/watch?v=8VyoojVUnig",
  "title": "11/30/23  Senate Committee on Reapportionment & Redistricting",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 101,
  "summary": "Here is a structured markdown summary of the Georgia 11/30/23 Senate Committee on Reapportionment & Redistricting session:\n\n**Overview:** The session focused on the minority leader presenting the Democratic proposal for redrawing the Senate's legislative map in accordance with the federal court order and the Voting Rights Act. There was debate and discussion around public comments and the process for the new map.\n\n**Key Actions:**\n- **SB 4:** Proposed Democratic map for Senate redistricting\n\n**Bills Introduced (First Reading):** None mentioned\n\n**Notable Moments:**\n- Minority leader presented the Democratic proposal, arguing it complies with the court order and Voting Rights Act, unlike the Republican proposal\n- Debate over whether to allow public comments on the new map or just rely on yesterday's comments\n- Committee members discussed the timeline of map releases and when the public had opportunity to comment\n\n**Votes:** No recorded votes mentioned\n\n**Attendance:** Quorum present, committee members debating the process\n\n**Adjournment:** Not specified, likely continuing to next session",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nAnd it's reapportionment and redistricting committee meeting.\nThis morning, we are going to hear from the minority leader and she will be presenting\nher plan.\nAfter that, we will be taking action on a map for the public.\nThank you all for being here.\nyou to everyone who came yesterday and offered your input. We're not having public comments\ntoday, but if you if you haven't had an opportunity to speak, you can still submit your comments\nonline. We review those constantly and I've even as soon as early as this morning, I was\nchecking those comments. So I appreciate everyone who's taken the time to do that, taken\nthe time to have your voice heard, and we will continue to\nlog those comments today as well. As we do, all of our Senate\ncommittee meetings will open up with a word of prayer. So I\nwould like to ask, um, leader Gooch, would you be willing to\nopen a separate word of prayer? What number? Number 10, good\nhit. Our heavily followed, we come to you this morning, God,\nwe asked for your guidance, we asked for your wisdom. Lord,\nas we seek what's best for the citizens of Georgia.\nGod, we ask for your blessings around our state\nand around our nation and our world.\nGod, as we look for peace throughout our people,\nthe lands.\nBe with us as we travel through the day\nas we go home to our families.\nAnd your holy name we pray, amen.\nThank you.\nSo, leader, yes.\nLeader, is there a reason why we're not having public comments?\nWe had public comment yesterday and passed around the sheet\nduring the meeting to allow anyone the opportunity\nto sign up.\nBut if people are here today, that we're here yesterday,\nare they allowed to give public comments?\nEveryone who signed up yesterday, let's give a opportunity.\nBut you're saying there's no public comments today?\nYes.\nAnd yesterday I said that the public comment was closed,\nThe public comment portion for yesterday's meeting so today's meeting is a new meeting a new day new maps\nAnd I'm asking about public comments today for this meeting\nYeah, so yesterday we received public comment and we closed public comment today\nWe've taken the time to hear the minority leaders\nand her plan will have discussion amongst the committee\nand anyone who hasn't had the opportunity can submit\ntheir comment on the public portal.\nSo, Madam Chair, we have...\nI still understand.\n...Basini.\nIt's a...\nI'm sorry.\nIs that my understanding that we have two processes\nthat we have following?\nno no ma'am there's not two processes well yesterday you had public comment\nyou closed the public comment for yesterday and today is a new day with the\nnew map and so we should follow the same process and it's for the people to\nhave a voice for the members of the committee to ask questions at the\nappropriate time so that there's you're not cutting off debate of the\ncommittee members, you're just not having another public hearing today.\nThe committee members will be given ample time to ask questions and make comments, but\nit's not a public hearing for the public input.\nThat portion of the process was done yesterday.\nToday's meeting is to follow the agenda that is here before us, and then members will\nbe given plenty of time to discuss either map and have plenty of time for questions and\nanswers.\nright. But we didn't have questions because we didn't give in\nfor yesterday though. So is it like part two is for committee\nmembers because we didn't come in yesterday. We had no time to\ndive on yesterday. Are you as member of this committee? I\nam. You'll be given plenty of chances for questions. Okay,\nhow about if how many people who were not here yesterday?\nNeed would like to stop to make public comment. I don't have\nthe Weepbook Committee.\nYou spoke yesterday.\nI'm not on today's map.\nSo we reserved our testimony for today's map\nuntil we think today's case.\nSo after the minority leader presents her map,\nwe will open up public comment for anyone\nwho didn't have the opportunity to speak yesterday.\nSo this real quick, you had three people raise their hand?\nWell, there was one.\nYeah, one who wasn't here, who didn't speak yesterday.\nSo it's still a different process.\nYou can pick and choose who can speak.\nYou didn't do that yesterday.\nYou didn't pick and choose the people in the public that\nwould speak.\nBut today, you get to pick and choose.\nAnd today, you get to ask the committee to ask questions.\nBut yesterday, the committee didn't get to ask questions,\nbecause we will prepare to ask questions.\nYeah, yeah.\nMadam Leader, yesterday you were given the opportunity\nto present your map and you chose to do that today.\nYesterday we heard from everyone who signed up\nto present their map, to present their public comment\nyesterday.\nToday I'm allowing anyone who wasn't able to present yesterday\nwho wasn't here to make their public comment\nand we'll be happy to take those public comments then.\nMadam Chair, people that made public comment yesterday\ncommented on a different bill today, it's a new bill and they should have the\nopportunity to comment on the new bill. Okay, thank you. Members of the\npublic yesterday from commenting on the map that's being presented today.\nMadam Chair, you released your map on Monday. On Monday, when was this map\nreleased. I believe it was Tuesday. It was posted Tuesday.\nSo members of the public had the opportunity to comment on both maps as they were both\npublicly available prior to yesterday. That's correct. That's correct. Okay.\nI think Madam Chair, some of the comments that were made by the public yesterday in fact\naddressed the map of the Democrats because it had been previously released and was in\nin the public for at least maybe two days.\nOkay, so at this point in time,\nI think it's appropriate for the minority leader\nto present your mail.\nThank you Madam Chair.\nAnd good morning everyone.\nI'm Senator Gloria Butler.\nI'm the minority leader of the Georgia Senate Democrats.\nToday we are here to discuss the Democratic proposal\nfor redrawing the Senate's legislative map\nin accordance with the federal court order,\nand more importantly, in accordance with the Voting Rights Act.\nThe Democratic caucus recognizes\nthat fair maps are crucial to ensuring\nthat every vote in Georgia counts equally,\nand that no voter in Georgia is subject to discrimination\nin the election process.\nTherefore, we have not taken the federal court's order lightly.\nLast month, Judge Jones issued a 516-page order,\nwhich found that the 2021 map proposed and passed\nby Senate Republicans violated the Voting Rights Act\nand discriminated against white voters.\nSpecifically, the court identified Senate District 10,\n16, 17, 25, 28, 30, 34, 35, 43, and 44, as the areas in which the map violated the Voting\nRights Act.\nTo remedy this violation, the court ordered that the Senate enact a map that includes\ntwo additional majority black districts, specifically in the area identified by the court.\nto be clear. The Court's order contained two directives. First, that two new\nmajority black districts be created. And second, that the new majority black\ndistricts be created in the vote dilution area that the Court identified as\nnot providing black voters with an equal opportunity to elect the\ncandidates of their choice.\nThe Republican proposal for a new Senate map\ndoes not follow the court's directive.\nIn truth, the map proposed by Republicans\nfails to comply with the Voting Rights Act\nand continues to dilute the voting power of black voters\nin South Metro, Atlanta.\nIn many ways, the Republican proposal\nis a hoax.\nIn the Pacific area where the court found voting rights\nviolation, the majority's proposal\nmoved nearly as many black residents\nout of existing majority districts, black districts,\nas it moves into majority black districts.\nThis means that a net of only approximately 3,000\nblack voters in the vote dilution area\nidentified by the court were moved into majority black districts.\nRepublicans try to cover up their social smoking mirrors.\nThey attempt to obscure what has been done in this map\nby reassigning the district numbers of multiple existing\nincumbents, but you can't obscure the truth.\nThe Republican Proposes dilute black voting power just like the 2021 Republican map did.\nThe Republican Proposes does little, if anything, to improve black voter's ability to elect\ncandidates of their choice.\nGiven this, the Democratic caucus presents an alternative map that it believes should\nbe adopted instead because it actually complies with the Voting Rights Act, and specifically\ncomplies with the Federal Court's order.\nI will begin by describing how our proposal complies with the Federal Court's order,\nand expands Black voters' opportunity to elect candidates of their choice as ordered\nby the Court.\nNow, to start, the Democratic map does exactly what the court\norders demand.\nIt draws two additional majority black districts\nin the vote dilution area, where the courts\nspecifically found violations of the Voting Rights Act.\nIn our proposal, the 16th and 17th districts,\na new majority black districts, and all\nof the proposed changes in our map\nare made in the area identified by the court.\nIn that area, our proposal brings almost 150,000\nblack residents that currently live\nin non-majority black districts\nand to majority black districts.\nOur proposal does not move any black voters\nout of majority black districts\nand two non-majorative black districts.\nAdditionally, by focusing only the area identified by the court,\nthe Democratic proposal leads 46 Senate districts, exactly the same,\nand only modified the boundaries of 10 Senate districts.\nThat is, the 10th Senate districts identified by the court.\nby comparison, the Republican proposal\nmodifies the boundaries of 15 Senate districts.\nOf the 15, only eight of them were identified\nby the court as diluting black voting power.\nFurther, the Democratic proposal does not\npair any incumbents.\nIt also does not unnecessarily change district numbers\nwhere district boundaries have not dramatically changed.\nKeeping the same district numbers as the 2021 maps\nwill decrease voter confusion in the 2024 election cycle\nand increase voter confidence.\nAdditionally, there will be little to no voter confusion\nin the 46th district that have not been changed.\nThe first district that the court specified, District 10, this existing majority black district\nmaintains is the cab and henry core and adds a portion of Rockdale County that is becoming\nincreasingly diverse and was previously in the 17th District.\ndistrict has a black gap of 63 percent. District 16, this district becomes a new\nmajority black district to comply with section 2 of the VRA and the\njudges order. It retains this Northwest Fayette Corps and adds sections of\nNortheast Fayette County that were previously packed into District 34. The\nThe district also includes portions of South Fulton County from the PAC District 35 and\nNortheast Calveter County from the crack district 28 along the I-85 quarter, including all\nparts of the cities of Union City, Fairburn, and Noonan.\nCompared to the old District 16, it removes non-section two areas of fae, spawning pike\nand Lamar counties.\nThe district has a blackwap of 52%.\nDistrict 17, from 2011 to 2021, District 17 existed in parts of Henry Newton and Rockdale\ncounties.\nof the district's population was in Henry County.\nDuring that period, Henry County's white population decreased\nby 19% and the black population increased by 60%.\nThe prior district had become a 42% black opportunity\ndistrict that was overpopulated.\nIt was possible to create a new majority black just\nfrom within the core of the existing district.\nInstead, during the 2021 redistricting,\nthe state cracked black voters in the 17th district,\nmoving 19,000 black residents in Henry County\ninto the 25th, where they did not have an opportunity\nto elect a candidate of their choice.\nrural counties that are not communities of interests with Henry, including parts of\nWalton County and all of Morgan County were jerrymanded in to achieve population.\nI'll plan news voters in southwest Henry County out of the packed\nchinch district into our own district. This proposed 17 districts includes voters in the\ncities of Stockbridge, Macdonough, Hampton, and Locust Grove along the I-75 corridor.\nIt also adds a sizable black population in Butts County further along the I-75 corridor.\nThe newly created district is compact and has a 51% black gap.\nDistrict 25, from 2011 to 2021, District 25 was a mostly rural district southwest of\nthat Lana suburbs.\nIt was not a black majority district or opportunity\ndistrict.\nIn the 2021 redistricting, the state\njared mandated the 25th district to take black voters\nfrom the old proposed 17th district\nto prevent those voters from having the opportunity\nto elect the candidate of their choice.\nWe cure this district in a configuration, more\nlike its original configuration and respect in communities of interests.\nAll of Baldwin, Jones, Putnam, Jasper, and Morgan counties are contained in the district.\nMostly rural portions of Alton and Newton County are also included to achieve population.\nA small portion of Macon Bibb County is included in the existing district, while we would\nBut not include this portion if we were redrawing our districts.\nThis part was left unchanged due to the judge's mandate to only focus on affected areas.\nThe black gap is 27%.\nDistrict 28, the existing 28 district is 25% black and not an influence district.\nStanford Black Population in Central Caluity County, South\nFulton County, and Southwest Douglas County were cracked\nand placed into this district.\nThose black populations were removed into New District\n16 and 35 to satisfy the court's order.\nThis district picks up portions of Fayette and Spaldon\nCounty and all of Pike and Lamar Counties.\nThat came from the old district 16,\nbut a not section to areas.\nThis district loses herd county\nand part of Northwest Cowheeda County\nto district 30 because of population shifts.\nThese parts are not section to areas.\nThe final district 28 includes most of the southern part\nof Cowheeda and Fayette counties.\nmost of Spalding County except for the parts of the city\nof Griffin and all of Pike and the Mar Counties.\nThe Black Vap of the District is 14%.\nDistrict 30, the existing District 30 is not a section\nto district and included all of Carroll County\nand Hurd County and portions of Douglas and Pauling County.\nBlack voters in Northwest Douglas County and South East\nPaulton County had their ability to select the candidate\nof their choice impacted by being cracked into existence\nDistrict 30.\nThese voters were moved out of District 30\ninto New District 35 due to population loss\nfrom the Section 2.\nFrom the Section 2 mandated changes,\nDistrict 30 added all of Hurd County and the North West\nportion of Cal Wheeler County, the Blackvap is 16%.\nDistrict 34, our plan maintains the Clayton County Corps\nof this district.\nMost of Clayton County, west of Tower Boulevard,\nis included in this district, including\nportions of the south part of the county\nthat were previously in District 44.\nWe removed the portion of Fayette County from this district.\nThat area was packed in and formed the core\nof the new VRA complaint district 16,\ncompliant district 16.\nTo achieve population and help as many areas as possible\nin the affected area of the map,\ncomply with the judge's order.\nWe also added portions of the city of Griffin\nand Northwest Paulton County\nthat are plurality, plurality, black.\nThis district remains a majority, a majority black district.\nDistrict 35, existing district 35 includes parts\nof Southfoot and County,\nand the eastern half of Douglass County.\npreviously black voters were packed into this district.\nNeighboring areas with substantial black populations\nlike Weston Douglas County, South Paulton County,\nNortheastern County to County,\nand North Weston Fayette County\nwere cracked into non-VIA compliant districts.\nHeavily black portions of South Fulton\nalong the 85 quarter were removed to create part of the new\ncore of District 16.\nAll of Douglas County was consolidated into this district.\nThey were previously in either 28 or 30.\nPortions of South Paulton County that were previously in\nDistrict 30 were added to achieve population deviation.\nThe new district has a black gap of 55%.\nDistrict 43.\nThe existing district 43 contained a portion of Southeast\nto care, all of Rockdale, and a portion of Newton County.\nA substantial black population in Newton County was cracked\nand placed into existing district 17\nto prevent these voters from being able\nto pick the candidate of their choice.\nWe place the majority of these Newton County voters\nback into District 43, where they can exercise\ntheir voting rights.\nThe district retains half of Rockdale County\nand east of I-20 due to population deviation\nand moves elsewhere to comply with the court order,\nthe other half of Rockdale County was moved into District 10, another section to District.\nThe new District is 61% light valve. District 44. This District retains its existing\ncore in the Cab County. The proud configurations of Clayton County more centrally. This District\nincluded most of the right east side of the county.\nClayton is now split more along Tara Boulevard\nand this district has most of the county\nthat is east of Tara Boulevard,\nincluding the cities of Forest Park and Mauro.\nThe district is more compact.\nIt no longer goes all the way to the bottom\nof Clayton County's southern Panhandle area.\nthe new district is 67% Black Val.\nAs you all can see, the Democratic proposal creates two\nmajority Black districts only in the vote dilution area\nidentified by the federal court.\nUnder our proposal, more than 100,000 Black voting age\nresidents in the vote dilution districts\nwould now be able to exercise their Constitution of Right\nto vote in a new district 16 and 17\nor by being added to existing districts like 10,\n34, 35, 43, and 44.\nIn the Republican proposal, a net of fewer than 4,000\nlike voting age residents in the vote dilution districts\nwould achieve new status\nbecause the new districts were created primarily from areas\nthat were largely already in majority black districts.\nOh, in the case of substantial population\nin Douglas and Newton County were previously\nin majority black districts, but were cracked\ninto non-voting rights act compliant districts.\nThe Republican proposal achieves additional majority black\ndistricts by packing and reconfiguring\nnon-affected areas elsewhere on the map.\nIf the Republican plan passes,\nthe fellow records finding of Dixon French,\nDixon,\nDixon French, I spent,\nsent it on the areas around Henry County\nand Griffin in Spalding County,\nNorthwest Fayette County,\nCenter Newton County and Weston Douglas County would still apply. That would mean that tens of\nthousands of black voters in those areas were still not equal opportunity to still not have equal\nopportunity to elect the candidates of their choice. As we did in 2021, Senate Democrats again\npleaded with Republicans to pass a map that complies with the voting rights act and does\nnot discriminate against bike voters. We believe that passing the Republican map would only\nlead to more litigation and waste taxpayer dollars. Georgians deserve fair maps and it is our duty\nto create fair maps that reflect the diversity of Georgia and comply with federal law.\nMadam Chair, that concludes my presentation and if you will give us the opportunity to\nask and ask the questions, we will comply with that.\nThank you.\nYeah, so we'll open up now if anyone has any questions for the majority later about the\nmap she's presented.\nThe whip and the chair are here to help supply answers to question as well.\nSure.\nAlthough the whip is the member of this committee.\nMadam, later I was trying to follow along as you were reading that testimony, but I didn't\nsure I have it accurate. What are the two additional black majority districts in South Atlanta\nthat were required by the judges order? What are the two districts? 16 and 17. 16 and 17.\nThat's correct. If you don't mind me, if you'll look at the blown up, we were supposed to\nhave a map that you have at Senator Couser in your packet. You'll have to flip to the non-state\nwide plan to the Metro Atlanta plan to be able to see it at all.\nSo your new districts are numbered 16 and 17 in this packet that we've been presented.\nHow did you in creating this map take into account the different experts that it testified\nin that court proceeding. My understanding is the Democratic Party and the plaintiffs\nin that case had a fellow named Bill Cooper and one named Bill Esselstein or something\nlike that. They had two competing kind of proposals. How did you account for their different\napproaches that the plaintiffs' own experts had in that case challenging the original\nout. So we are not parties to that litigation and I'm not sure that any any of us know and have gone\nto that minute detail about exactly what maps the plaintiffs submitted. We are offering this\nproposal. Well it's important because that's what the judge based his decision on and the chairman's\nplan very closely followed the plaintiffs expert Blake Esselstein's proposal. Actually\nSenator R is much more closely mirrors the plans submitted by the plaintiffs because\nI thought you weren't familiar with that a second ago.\nWell I'm vaguely familiar I'm not familiar with the exact differences between Cooper and\nEswellstein but I am familiar with the fact that the plaintiffs maps create two new majority\nminority districts in the area directly mandated by the court which is the affected area of\nof the 10 districts and this proposal does the same\nand it makes no changes outside of the court's affected area.\nYesterday's map makes dramatic changes outside of it\nand barely any changes providing black voters\nany new opportunities in the affected area.\nSo in that sense, our map is far more similar\nto the various plaintiffs' maps.\nShould I question you or the sponsor of this bill?\nI'm serving as her attorney for this particular hearing.\nAll right, well then, I will.\nAnd I'm the second signer.\nI'm the second signer.\nMay I continue?\nI will follow up and whichever one of you\nhas the wants to give me the legal answer or the political answer,\nI'll take either one.\nDid you use political data when drawing this map?\nNo, I mean, there's always a byproduct\nin looking at maps with data, but no.\nI mean, the maps are drawn to represent the courts mandate\nwithin the affected area.\nAnd the mandate is two new majority minority districts\nwithin the affected area.\nSo it's just pure happenstance that the Democratic map\nhappens to create two new democratic districts,\ngiving a partisan advantage, whereas the chairman's map\nleft it exactly the same as the current political split\nin the state center.\nAnd look at that at all, just by the look of the draw, you ended up making a partisan advantage map.\nHave you, Senator, run the partisan data on this map?\nI haven't, but it's something contained in the deal.\nIt is? I don't think so.\nI'm looking at it.\nI'm not aware that that was.\nAnd I hand out that was, isn't all the committee members, folders?\nThat's not a, that's not a provided by us.\nAnd it says we're judging this on two things.\nNumber one, do we add majority black districts\nboth plans do comply with the judge's order?\nNumber two, it judges on, does it affect partisan balance?\nThe Democratic plan does affect the partisan balance\nby adding two Democratic seats.\nAnd the chairman's plan did not.\nI know you may not have prepared this,\nbut this allegedly independent group\nthat claims to be nonpartisan shows\nthat your map gives a partisan advantage\nas well as the two new black seats.\nWell, what I think is interesting is that,\nyou know, I'm looking at this,\nand as the leader said, we did not provide it.\nBut what I'm noticing is that the group that provided it\nis giving very high marks to this proposal\nunder both VRA grounds and under traditional\nredistricting principles grounds.\nThat's what I'm noticing in their handout.\nYeah, well, I wasn't a math major,\nBut the one that says the Senate plan here that the chairman\nis presented, gives 33 Republican districts in the new plan,\nand there was 33 in the old plan.\nAnd it gives 23 Democratic districts in the new plan,\nand 23 in the old, whereas the Democratic proposal\ncreates 31 Republican districts and 25 Democratic districts.\nBut somehow, the math is not taken into account\ndeciding whether it affects partisan changes. So which of the districts changed to draw the\nnew majority black just 16 and 17? No, each of the 10 districts found to be illegal by the court,\neach of them changed and the leader pretty exhaustively walked through it, happy to provide all\nof you with that printout because obviously it's very lengthy and so maybe you know it's hard to\nfollow along the whole thing when you're just when you're speaking so certainly\nhappy to give you the specifics of exactly what was changed but every one of\nthe ten districts which are the affected area as decreed by the district\ncourt has been changed to bring them into compliance with the voting rights\nactually we don't have a list of those we do we do we do well certainly I mean we\nall know what they are there let's ask and I'm not as savvy in reading this\na bill that's you know 85 pages thick to know which of the 10 districts we're\ntalking about. All right so if you're looking at your your map center\ncows are your blow up of the affected area right which is the South\nMetro Atlanta area. Okay. Specifically the court identified Senate\ndistricts 10, 16, 17, 25, 28, 30, 34, 35, 43, and 44, as the area in which are currently\nenacted districts violate the Voting Rights Act.\nAnd are those the 10 districts that changed under the Democratic plan?\nYes, sir.\nGood.\nAnd no other districts changed.\nSo, under the proposal yesterday, 80% of the new black voters come from areas outside the\naffected area, which is irrelevant to the court's analysis, whereas in ours, 100% come\nfrom the affected area and zero other Georgians are impacted.\nAnd importantly, here's where you can really get into the nitty gritty.\nThere are two things that are really important.\nNumber one, under federal court precedent, under the precedent called gingles, whether\nor not it's pretty, there's a clear and not constitutional analysis on whether or not\nyou need to create a majority minority district.\nAnd there are factors that are followed.\nwhere that, where one can be created,\nit needs to be created.\nAnd that's why he limited it to the affected area,\nbecause you don't just create them anywhere.\nYou're required to create them in certain areas\nwhere the population is sizeable enough,\nthere's racially polarized voting,\nand a few other things like that.\nAre you disappointed then that your district now\nis a majority black district?\nCertainly not.\nGood.\nI mean, I, I do, I'll say this.\nI'm not bothered.\nwhat in one of the 10 that the judge identified?\nIt was not one of the, right.\nSo essentially you cannot, where a majority minority district\nhas to be created, you can't satisfy it\nby moving around people in other areas\nwhere no voter discrimination was found.\nYou have not cured where the court said voter discrimination\nis found and the process is not equally open\nto black voters.\nThat was simply not found in the area\nof the map outside the 10 districts.\nSo in our map, yeah, in our map, for example,\n100,000 new black voters will be in the position\nto equally and fully participate in the political process,\nwhich is exactly what the court found is not happening,\nunder our enacted districts, 100,000.\nBasically, the only way the proposal from yesterday\ntries to create anything is by just shuffling people around.\nSo people that are in this-\nThat is in other words, redistricting.\nYeah, but you didn't let me finish.\nSo when you just simply move people around,\nall you're doing is trying to obfuscate the fact\nthat very, very, very few new voters\nhave been provided with any new opportunity.\nThere's 3,000, 3,000.\nAnd you know how big our districts are.\nSo it simply just doesn't comply.\nThank you.\nMadam Leader, earlier you referred to a pact and crack in your testimony, what is your\ndefinition of pact?\nWhen you take photos of the same race and put them all in one place.\npacking. I'm sure you know that Senator. Okay. And do you agree at least that the\nchair's proposal does create two new majority black districts in the area\nthat the judge identified? No. No. No. It does not. Okay.\nI'm part of this analysis that took place where the court actually did mention various districts\nthat were in violation of the VRA and two of those I think were 16 and 34 but I don't\nthink they had any changes to them at all and yet the court has said because he actually\nlisted various districts that had those issues,\nthose legal issues.\nSo Madam Leute, can you tell us possibly why you,\nin the previous map that we had,\nwe see two particular districts that had no changes at all,\neven though they're specifically mentioned\nwithin the courts order as far as seven issues\nwith the voting rights act.\nI'm sorry.\nWhat was that a question to make?\nNo, it's a map leader.\nOkay.\nYeah.\nOn district 16 and 34, the fact that they had no changes at all, even though they were\nmentioned specifically within the VRA or within the judge's order of having issues with\nthe VRA.\nAny reason why you think that may have actually taken place.\nin the previous map that we saw yesterday.\nTo Mr. Rita, it does, however,\ncreate a legal problem.\nYou're highlighting another legal problem\nin yesterday's map.\nAnyone out?\nWhat number are you for?\nfor, yes, I'm not recognized.\nYes.\nOkay.\nThank you.\nSorry.\nFor whoever wants to answer this, this co-sponsored the bill.\nWe did receive this chart, and I just want to follow up with Chairman Hatchett's question.\nWe heard numerous public comment yesterday that this does comply with the mandate and\nI'm sorry that the Chairman Eccles map complies with the mandate.\nThis identifies that it complies with the mandate.\nYour position just to clarify is that this does not comply with the mandate.\nAlso, we heard from the plaintiff's attorney yesterday.\nIt was not on.\nSorry.\nYeah, apologies.\nDo I need to repeat that?\nAre we good?\nYeah, so the answer was yes.\nSo no, yeah.\nThe remedy section of the complaint states specifically there should be two majority\nblack districts created.\nIt does, in the affected area.\nAnd do you believe that Chairman Eccles mapped at that?\nSo this particular thing you're referencing,\nI think it was stated very clearly that they were simply\ndoing a numerical analysis and not a legal analysis\nin terms of compliance as in are there\ntwo new majority black districts.\nHowever, that is not at all the inquiry that\nis required to be conducted a simple mathematical equation\nwhen you're talking about the Voting Rights Act.\nAnd that is why Judge Jones said create\ntwo majority black districts in the affected area.\nThe affected area are the 10 districts\nthat we previously stated.\nAnd as it stands, yesterday's proposal\nprovides a varied poultry, 3,000 black voters,\nnew black voters, the opportunity\nto participate equally in the political process.\nIt's actually nine districts that are mentioned\nin the order in its district slash areas.\nAnd then he does recognize district 10, 16, 17, 25, 28,\n30, 34, 35, and 44 as the district slash areas.\nI think the key in that section of the order,\nwhich if you have it, I can tell you what page it's on.\nIt's down in my office.\nIt's on page 513.\nI can get it from my office, but if you want me to look\nat you in a minute.\nThe key there is that it mentions district-slash areas.\nI think you're limiting that to districts and not recognizing that the order actually\nstates that the new black districts should come from these nine district-slash areas.\nI think that's potentially a point of contention between the two of you.\nCan I respond to that?\nSure, absolutely.\nSo the areas would be South Metro, which are Henry, Spalding, Northwest Fayette, Central\nand Western Douglas.\nYeah, the areas that were,\nI don't know how much of those\nare captured in the districts that I just read,\nbut those districts listed.\nAll of them.\nCorrect.\nSo they're kind of one in the same thing, would you agree?\nRight.\nSo in the Chairman's map,\nthe two new Black Majority Districts\nare derived from seven of the nine identified areas.\nSo I think that perhaps her contention,\nI'm going to ask her this later,\nwould be that the seven of the nine\ndoes capture the spirit of what was stated.\nI do want to focus.\nCan I respond to that?\nYou please, yeah.\nSo the problem is that when the disenfranchised voters\nare down in Henry County, for example,\nyou can't take voters who aren't disenfranchised\ninto cabin Fulton counties and use them to try to say,\nnow they're, because they weren't disenfranchised,\nyou still have to enfranchise and allow\nthe voters in the vote delusion area to participate fully.\nAnd those are the ones down south.\nYou can't like take these districts north\noutside of the area where the court found the illegal maps and say oh yeah\neverything's great I mean that's just not it doesn't satisfy the VRA or the\ncourt's order as it relates to district 16 is that one of your new a majority\nblack districts in your map yes if you look at that's correct yeah can we can we\ntalk about that for a second what and you're my where the communities of\ninterest that connect, I guess, South Fulton, Cawita, and Fayette.\nI'm sorry, South Fulton, Fayette, and Newton.\nSo before I go back and reread what leader Butler already\nread about those districts, which I can certainly do.\nThat'd be great.\nOK, I'm going to reread that.\nI don't need to reread it.\nMaybe you could just highlight in your own words\nwhat those communities of interest are.\nAll right.\nDistrict 16.\nThis district becomes a new majority-black district\nto comply with Section 2 of the VRA and the Judges Order.\nIt retains its Northwest Fayette Corps\nand add sections of Northeast Fayette County\nthat were previously packed into District 34.\nThe district also includes portions of South Fulton County\nfrom the Pack District 35 and Northeast Calvita County\nfrom the Crack District 28 along the I-85 corridor,\nincluding all or parts of the cities\nof Union City, Fairburn, and Nunean.\ncompared to the old district 16,\nit removed non-section two areas\nof Fayette, Spalding Pike, and Lamar Counties.\n17.\nThat's helpful for, let's just stay on 16 if that's okay.\nSure.\nYeah, I will note for 17, it is worth repeating this\nbecause it really is critical to the court's analysis\nand it's the area where there's the largest,\nso again, piggybacking on what I was saying earlier,\nyou're required to create a majority minority district\nwhen certain factors are meant.\nThe single largest, there's large growth\nin the minority population in Henry County, right?\nIf you look at a map and you turn on\nfor ethnic and racial background, you will see.\nThere's like a glaring huge block of individuals\nright there.\nAnd so it is worth repeating that it says,\nThe prior district, right before we enacted,\nright, these ones, had become a 42%\nblack opportunity district and was overpopulated.\nIt was possible to create a new majority black district\njust from within the core of that district.\nAnd that is because between 2011 and 2021,\nHenry County's white population decreased by 19%\nand the black population increased by 60%.\nAnd that's where, you know, we were saying during,\nwhen we enacted these maps in the Florida Bay,\nwe said, look, y'all,\nGeorge's population grew by almost a million,\nnot quite the vast majority of that growth,\nin fact, all of that growth was among voters of color.\nAnd black, the black population increased by five\nto 600,000 people.\nAnd a lot of them are in this area.\nAnd they need to be able to have a voice in the process.\nOkay.\nJust coming back to 16, I think that you referenced earlier\nwhen Senator Kauser asked a couple questions that no,\nyou guys didn't use any political data and that you were even\nunaware of what the partisan shifts may be with this new map.\nYou just referenced the turning out of maps and looking at\nracial data.\nDid you solely use racial data in drawing the 16th?\nYes.\nOkay, so there's no other data used to draw the 16th?\nWell, no, you mean you have to use,\nYou got to look at like the block files\nand you got to look at all of the things\nthat go into making a map.\nSo other than establishing the balance districts\nwithin the threshold,\nI think your increase was the sole fact.\nYou got to talk about what we've done\nis follow the court's order and the Voting Rights Act,\nwhich is to create two new majority minority districts\nwithin the identified vote delusion area.\nthat's all we did. That's what we did. And to this extent that demography is\ndestiny, I would push back on that a little bit. I don't know what the partisan\ndata is. I don't have it in front of me. Okay, I just want to clarify, because I think I heard you say yes to the answer that it was solely racial,\nit was solely race that you relied on to draw the 16th. No, no, look, you have to use all kinds of different factors and race can be one of them.\nAnd it is because we were ordered to draw to new majority minority districts as it relates to 16\nthem. What were the other factors that were used? Let's go back to it again.\nSo it became it became one of our new majority black districts to comply with section two and the judge's order.\nBut it followed other\ntraditional redistricting principles and this map follows other traditional\nredistricting principles much better than yesterday's map in the sense of\ncommunities of interest, core of\nprior districts and the like. So this\ndistrict retains its Northwest Fayette Core\nand add sections of Northeast Fayette County\nthat were previously packed into District 34. I recognize the geographical lines of the\ndistrict. That's not my question. Okay. My question is specifically what other\ndata was used to draw this district other than race. When I first asked you, did\nyou solely use race? You said yes. Now you're saying that other factors were\nused and I'm wondering what those are. What other data do you always use? Do I\nmean you've got to look at the precinct lines. You've got to look at\npopulation. You've got to look at. I got that. Yeah. You got to look at, I'm\nYou're interrupting my turn to that.\nI mean, you've got to look at the population.\nYou've got to look at geographic, important geographic\nboundaries such as county lines, city lines, et cetera.\nOK.\nMy last question on 16.\nI see how we to now is split.\nIt was not split previously.\nOn the map was this split done primarily\nto add black voters to the 16th.\nSo you follow the communities of interest,\nthe core of the prior districts, compactness.\nAll of that has been followed.\nOkay, thank you.\nThank you.\nThank you.\nSo, what are we probably going to do now?\nThat's one thing.\nSorry.\nI'm sorry, I'm sorry.\nTo follow up on something you said earlier\nabout complying with the judge's order and I believe,\nhe also said the judge said these are,\nthese districts are legally drawn\nyour position was you needed to change each one of those districts based on the\ntouches orders. That right? The judge found that yeah that in the 10 voter area\nI mean 10 district area that all those that those 10 districts were drawn\nillegally and that y'all needed to in response to the judges orders you\nunderstand is that you need to redraw each one of those. That there should be a\na two new majority minority districts\nwithin the 10 district area.\nBut I guess the question that I'm asking is,\nyou were saying those are illegal districts,\nthose are individual legal districts,\nand that y'all needed to redraw each one of those districts\nbased on the judges' order.\nWell, once you follow all the, you know,\nredistricting principles,\nand create the two new majority minority districts,\nyou are, first of all, you, yes,\nYou don't want to leave illegal districts, ones that have been packed and cracked.\nSo once you account for all of that, you've changed each one of those 10.\nWhat's your definition of packed and cracked?\nPacked is when you try to put a very significant numbers of certain communities in a small number\nof districts.\nyour interpretation of the judge's orders was that all of those districts you\nlisted were illegally drawn and each one of those districts individually needed\nto be redrawn. Well I believe I just answered that one. Well I haven't I haven't\ngotten you to answer that specifically but the question is is it your position\nand the position in considering how you read how this map was drawn that the\njudge said each one of these districts needs to be redrawn. He drew he said\nthese 10 districts are a problem and that's the affected area but I can't read\nhis mind exactly right so I don't know and I don't have the opinion in front\nof me I forgot to bring it from office so I probably need a reference it but my\nmemory would be that he said these 10 districts are illegal that's the\naffected area to new majority minority districts need to be drawn in the\neffected area. In the effected area. Yeah. Thank you. Yeah.\nSenator, I'm Anna Vitarte. Thank you, Chairwoman. I had just quick couple questions.\nAnd I direct us at the minority leader or someone in the Democratic Caucus. Can someone articulate\nbased on data or I guess methodology why Rockdale County was split in half.\nRockdale. So we're talking about 43 and 10.\nThe 10. This existing majority black district maintains its DeCab and Henry\nCounty Corps which again is one of the you know traditional redistricting\nprinciples and adds a portion of Rockdale County that is becoming increasingly\ndiverse and had it previously been been cracked into the 17th district. So I\nknow two of my colleagues to my left basically border Rockdale County in\nterms of the county you know the makeup just you know demographics everything\nin the Rockdale County, I mean, doesn't make sense\nto split Rockdale County in half.\nWell, where you need to draw the majority minority districts,\nit depends on where the population is sizable enough\nand can be shares commonalities with other communities\nand can be outvoted for lack of a better term right now\nby the majority, right?\nSo when you, if you start to look at the demographics,\nyou see where those communities are,\nand that's where you're required\nto create majority minority districts.\nSo based on that, and kind of going back,\nI guess, to the methodology that you cited earlier about,\ntaken from the North and trying to satisfy the South,\nwhat in terms of community interests, similarities\nexist between South to Cab, and I'm saying this\nas somebody who used to be a resident of DeCab County,\nto someone who literally lives\non the Henry County Butts County line.\nRight, so I think we stated, the leader stated in her presentation that there's a significant\nblack population there and that part of us.\nSo I understand that, but what else in the community in South of Cab and Southeast Henry\nwould be similar?\nSo was it based, it was drawn strictly based on race?\nNo, as I already went over, no district is drawn strictly based on race.\nwhich you just said. No idea. Based on South of Cab and it is a factor and as you are certainly aware\nit's an important factor and in fact it's the factor that has forced us into a special redistricting\nsession so it's certainly relevant. Could you articulate what are the other factors in South of\nCab and Southeast Henry County that we're used to draw that part of district 10? Well we're\nrequired to create a new majority minority district in that area where the\nGingles factors have been proven in court. So you don't have specific data\nyou could share with the committee at this point? I can re-read you the other\nreasons why. I've already heard everything you read, probably from your attorneys.\nSo, all right, thank you.\nDo you want to visit him?\nNo.\nI'll say no.\nOkay.\nWhat are you nine?\n11.\nHe had asked first, and then after him,\nno good.\nThat's fine.\nNo, no.\nNo, no.\nCall on.\nOkay.\nWe'll hear.\nI, President.\nYou're welcome.\nThank you very much.\nYes, sir.\nYes, sir.\nOne of the things that occurred to me, and I just want\nI put this out for consideration, is that I believe yesterday the Alpha-Fi Alpha fraternity\ngroup, a primary player in the lawsuit in the first place, a Senator of the Committee\nstating that it is their belief that this has drawn by the Republican maps, it violates\nthe Voting Rights Act. This is a plaintiff comment as stated by the to the committee and I believe\nthat's that's going to carry some weight. And in that light as it relates to violating\nthe Voting Rights Act and causing confusion, don't you think that this is going to be more\nmoney, more confusion and it's going to cause people to hesitate about going to the polls\nthat's going to cause a lot of things\nthat perhaps shouldn't occur when we're looking forward\nto the 2024 election.\nI'm just putting it out there for your consideration\nand to the chair and to comment for my leader and chairs.\nWell, I just believe that that's the big elephant\nin the room, they're saying that this violates the voting\nright there, clearly, and it does not comply with the judge's order punctuation period.\nIf that's not the case, maybe I'm reading this wrong, but I believe that is a great\nfood for thought. Thank you. Thank you. Senator Kennedy.\nThank you, Madam Chair. Madam Leader, my question is in drawing the maps that you all\ncame to ultimately be what is presented to us today.\nThat's a very dynamic process.\nI'd know about that from two years ago,\nand you know about it from many years of working with maps.\nI know that not many years have worked with maps.\nOK, all right.\nSorry if I was giving you more credit in that area\nthan I should have.\nI just know you've been here a long time.\nIt served for a very long time.\nNot an expert at growing maps.\nOK.\nI do recall last time, two years ago, you were very active in expressing your opinions\nand the opinions of your party about the maps that we offered, and I think we can agree\non that.\nThat's my vote.\nYes, ma'am.\nMy question is, in all the work that went into formulating ultimately what we see as\nthe bill that you've provided and that you're presenting today, did you make any efforts\nto draw a map that you thought complied with the court's order, but maintain the same\npartisan numbers that we have now of 33-23.\nWe don't have partisan data, Mr. Pertem.\nOkay, so now you're telling Madam Lee, do you have anything to say?\nI'm happy to be here for you, but I don't know why you said that Senator, that doesn't\naddress my question.\nMy question is, were efforts made to draw a map that you thought complied with the courts\norder, but maintaining the same Republican Democratic numbers that we have currently?\nNot if you've got to produce two new majority black districts, we can't maintain the same\nnumbers.\nWell, you can.\nWhoever runs can win.\nIt's too much to add to what numbers we have.\nof majority minority.\nSo your position is and was in the process\nthat in complying with the court's order,\nyou were required to come up with a map\nthat added two Democrats.\nIs that what you're telling us?\nNo, sir.\nNo, two of you are at a black district.\nOkay.\nSo I guess back to Senator Counselor's question earlier\nthat really wasn't answered,\nit just happened to be that the map shell came up with.\nchanged the partisan numbers correct no it's a work of art it's not happens\nstands as he said let me ask it this way senator parent you're saying no as\nif you're seemingly unaware of the rd numbers of the maps is being of the\nmap being presented can can either of you tell me or tell this committee what\nyou understand the republican democratic split to be under this map is\nproposed. I actually I don't have it in front of me. I don't think we have it in\nfront of us. I mean are if you're saying that a Republican cannot win a\nmajority minority district. No that's no that's no that's not what I'm saying\nit's very simple and very straightforward. Oh you mean what are the actual\nvoter analyses in terms of like which election are you talking about? Are\nyou talking about governor last time or are you talking about okay what are\nyou talking about? We don't have to get into that level it's a very simple and\nstraightforward question of what is your opinion,\nMadam Leader or Senator Parent,\nof what is the Republican Democratic split of the map\nthat you're presenting?\nWhat is the anticipated district count\nfor Republicans versus Democrats?\nSo what we're dealing with is a court order\nthat said create two majority minority districts\nin the affected area.\nAnd that's what we did and that's all we did.\nAnd the court didn't look at partisanship,\nThat isn't part of this as you're well aware the Supreme Court said partisan\ngerrymandering was fine and racial gerrymandering isn't. I understand. That's what\nthis order is based on and that's this map that you have. Senator, thank you for\nthat. Can you answer my question though? Because you have, you completely, wait a minute,\nhold on a minute. You've completely dodged my question. Which is, do you have an\nopinion of whether or not or what the numbers are in the map that you're\npresenting? As I've stated several times, we do not have that. I don't have that\nin front of me, and I'm asking, I guess what I'm asking you is what's the relevance to\nthe court's order?\nWell, because Senator Perry, you'll certainly remember that two years ago, when we did\nour redistricting process, you, other members of your party, were very critical of the maps\nthat we presented and said that they were partisan.\nThey were two partisan.\nThey were partisan gerrymandered.\nThey were gerrymandered in a way to maintain certain majorities.\nSo that was clearly a part of the narrative.\nAnd so the question now is Senator Chausser, Chairman Chausser, pointed out, it just seems\nto be that the map, y'all have presented, gives you, gives your party, a two-seat advantage\nover the current maps.\nWell, the independent group that has provided the flyers that are in here does.\nI think an independent analysis of the RD political number, which suggests those numbers\nare right, perhaps.\nI haven't studied them either, I'm relying on what's in the file.\nAnd so the very thing that y'all have criticized us through the process of making it and using\npartisan objectives seems to be exactly where we've landed with the maps.\nIt seems to be exactly where we've landed with the maps that you have presented, but you\ndon't want to talk about partisanship.\nBut clearly it just happens to be that's where you luckily landed, but it is striking that\nWe come to this committee and we have very knowledgeable\nand experienced and seasoned senators that want to suggest\nyou don't even know what the RD numbers are\nof the map that's presented.\nSo if there was criticism,\nthat there was a partisan gerrymander,\nwhich there was and there was from Fair Districts\nand a whole bunch of groups.\nAnd they think that this map in front of us\nis fairer to the voters of Georgia\nbecause it undoes a partial and racial gerrymandering.\nThat means that we're not gerrymandering.\nWell, you've just conflated two issues.\nYou've jumped from political gerrymandering\nto talking about racial gerrymandering.\nAnd my question is just about the political I think.\nSo if we've undone a partisan gerrymandering,\nthen we've not gerrymandered.\nAnd let me just read to you, Mr. Protem,\nthe Princeton gerrymandering project\nis out with their analysis of yesterday's map.\nand they said, it is a blooming carnation of gerrymandering\nwith oblong pedal-shaped districts radiating out\nfrom Atlanta.\nSo if ours isn't drawn like that,\nit's because it's not a gerrymander.\nOkay.\nI mean, would you not acknowledge\nthat Georgia is a purple state?\nAnd you think we should maintain a 2333?\nIs that your position?\nMy question to you is whether or not you will acknowledge\nthat you have drawn this map in a way\nthat provides a political advantage.\nAnd if you can't acknowledge that,\nif you don't recognize the numbers\nthat seemingly the independent folks acknowledge,\nit's kind of hard to have a conversation and go forward.\nOkay, well we can have that conversation.\nIt may.\nAnd it's because it undoes the partisan gerrymander\npartially that y'all have put in place starting in 2010.\nWhich is what you just said a few moments ago\nthat the court recognized in fact can happen, right?\nThat was your legal opinion that you were providing us.\nThe Supreme Court, which is why we're here on the Voting Rights Act, is different, a\ndifferent inquiry than partisan gerrymandering.\nSo is the objective of the map that you provided one for partisan purposes or one for purely\nracial purposes?\nWe are here under the Voting Rights Act, Section 2, and that's the only thing that concerns\nus today.\nThe only thing in front of Judge Jones, and Judge Jones said, these 10 districts are\nlegal. Section of enacted maps\nviolates Section 2 of the Voting Rights Act as to the following area slash\ndistricts enacted Senate districts 10 16 17 25 28 30 34 35 43 and 44 and he\nsaid draw to majority minority districts within the affected area. And\nthat's what this map does in keeping with aside from that traditional\nredistricting principles, and certainly traditional redistricting principles as to the non-affected\nareas of the map instead of ripping things apart and destroying communities of interest,\nand it makes no changes to 46 districts, which doesn't change the middle.\nOkay, thank you.\nAny other questions?\nOkay, thank you. At this, at this time, we'll move to the public comments from the people\nwho signed up just a few moments ago. So first up is Cindy Battles and then on deck is\nMs. Shale Sanchez. Yes, so so yesterday we had a five minute time limit per speaker.\nSo we'll acknowledge that same time limit today.\nThank you, I am pretty sure I can do that in five minutes.\nThank you very much for the opportunity to speak, obviously with the House and the Senate\nmeeting at the same time yesterday, even as talented as I am, being in two places at one\ntime is a little bit difficult.\nI do want to kind of talk a little bit about that process, about the fact that there's been\nsuch limited time for public comment.\ntalked about when the maps were released. I don't know what kind of attempts have been\nmade to reach out to the public, but I would like to say that pursuant to Judge Jones's\norder, it feels like getting that public comment and making those efforts is important.\nAs we've mentioned before on October 26th, the legislature was instructed to redraw its\nmaps and to comply with Section 2 of the Voting Rights Act. Judge Jones will ultimately\ndecide whether the legislature has complied with this order.\nBut providing so little time for public comments and not reaching out to the community's most\ndirectly impacted by Judge Jones's orders continues the previous practices that contributed\nto the illegality I can spell and speak, I promise, of the previous maps.\nThese proposed maps continue to deny voters of color and equal opportunity to participate\nand the political process specifically\nbecause of the dismantling of districts\nthat elect the candidates of choice of voters of colors,\nsuch as what is proposed for Senate District 6,\nwhich is Senator Estevez's district,\nand what was previously Senate District 42,\nSenator Parent's District.\nThe proposed map also does not appear to comply\nwith Judge Jones's order,\nbecause Judge Jones has held that black voters\nresiding in 10 Senate districts in the Southern Atlanta\nMetro did not have an equal opportunity to elect candidates of choice in violation of\nsection 2 of the Voting Rights Act. Thus, he ordered that the legislature draw two additional\nmajority blacks in its districts from that cluster of 10 districts. However, most of the\nblack voters in the purportedly new majority black districts appear to have been moved\nfrom outside those 10 districts. And many of those voters already resided in majority\nBlack districts. Other districts that were racially\ngerrymandered under the originally enacted plan, included Senate\ndistricts 1, 2, 4, 17, and 56, remain racially gerrymandered in the proposed plan.\nIn Chatham County, which is split three ways, SD2 remains packed, diluting the voters,\nthe votes of voters of colors in SD1 and 4. The original SD17 is now essentially the new SD\n42 and remains unlawfully cracked. This district is among the districts that\nJudge Jones stated was in violation of Section 2 of the Voting Rights Act and\nremains virtually unchanged. Additionally Senate District 56 remains unlawfully\ncracked. Just because some of the things that we've heard here today I want to\npoint out that the court order does not state that the legislature should only\ncomply with the order and that in the Voting Rights Act if it maintains a part\nas an advantage. Partisan advantage does not supersede the Voting Rights Act or federal\nlaw. You cannot discriminate against black voters to retain partisan advantage. Even\nif the Supreme Court allows you to do so, sir, it is not okay. It is not okay. And we've\nhad this conversation when we talked about the Democrats trying to do the same thing\nto retain power when Section 2 of the Voting Rights Act still gave Republicans the right\nto go before the Department of Justice and say,\nhey, this is a partisan gerrymandering.\nIt's not OK.\nI implore you to please, as you move forward,\nconsider the voters, consider what the voters want,\nand draw maps that reflect that.\nThank you.\nThank you.\nNext, we have Michelle Sanchez, and on deck\nis Yolanda Pickstock.\nHello.\nThank you so much for the opportunity to speak.\nMy name is Michelle Sanchez and I've been a community organizer\nin Georgia for eight years focusing on Latine\nand black communities.\nToday I speak on behalf of Casa and Casa in Action,\nrepresenting our members in DeCab,\nFulton, Clayton and Henry counties.\nWe find it very concerning that despite Judge Jones's ruling\nthat the current map violates the Voting Rights Act\nby diluting black voting power,\nthe new maps fall short of creating new majority black districts.\nThe judge identified 10 districts with vote delusion.\nWhile this map technically adds two majority black districts\nas ordered, it removes two districts with over 40% minorities\nand diminishes black voter power in other districts.\nThis map fails to honor the spirit of the court order.\nInstead of providing two additional districts\nwhere black voters can elect their candidates,\nit protects every incumbent and denies\nblack voters any additional representation.\nIt's very unfortunate that the already struggling Georgia voters\nare having to spend their hard earned tax dollars\non this special session that would not have been necessary\nhad Georgia Republicans done the right thing the first time\nthe maps were drawn.\nYou have a chance now to do the right thing.\nAnd in no better time considering\nso many people are questioning the power of their votes.\nBy failing to follow the judge's order\nof enfranchising a block of black voter, black Georgians,\nand instead opting for an numerical loophole,\nthis body impairs itself to failing to comply with the ruling\nand fails the people of Georgia.\nDo the right thing here, people.\nIt's not that hard.\nThank you.\nNext, we have Yolanda Pickstock,\nand then after Yolanda will be our final speaker,\nJanet Grant.\nGood morning.\nYolanda Pickstock, legislative director for Georgia's standup.\nWe commend those who have presented the maps\ndiscussed today.\nThis map does comply with the judges' order\nby adding two additional black majority districts,\nSenate districts, 16 and 17.\nand it does not increase competitive districts.\nGeorgia stand up, which is part of the redistricting alliance,\nbelieves elections should be determined by voters\nand not politicians who draw maps.\nWe support independent redistricting commissions,\nwhich are more transparent and impartial.\nIndependent redistricting commissions,\nestablished standards for those who can serve on commissions\nand criteria, which must be followed\nwhen drawing district maps.\nAs communities in Georgia,\nwe would like the state to move towards\nmore inclusive redistricting processes\nby creating independent district in commissions.\nSpecifically, FAAIT and Spalding areas were ignored\nby the maps presented yesterday.\nAs coalition groups, we have worked to set the administrative\nrecord via local redistricting resolutions,\nwhich the county of Clayton has passed.\nwe thank you for the opportunity to speak.\nThank you.\nAnd our final speaker is Janet Grant.\nGood morning, chair Eccles and members of the committee.\nMy name is Janet Grant and I'm co-chair of Fair Districts\nGeorgia.\nI appreciate the opportunity to testify today.\nI was over in the house testifying\nwhen while you were meeting yesterday\nand pleased to be able to speak on the Democratic Caucus\nmap.\nAs a reminder, Fair Districts Georgia\nis a nonpartisan grassroots citizen organization\nsolely focused on abdicating for fair redistricting\nand redistricting reform.\nWe believe that the maps enacted during this session\nshould comply with the court's order\nwhile excluding any unrelated unnecessary changes\nfor partisan gain in keeping with our long held priority\nof opposing mid-cycle redistricting by both parties.\nYou do have in front of you, I've heard several of you have been looking at it.\nYou have in front of you our scorecard for the Democratic House map and you also have\nthe scorecard that can reference yesterday for Chair Eccles map.\nOn the Democratic House Caucus map are simple two-part pass-fail tests.\nIn this case, we find that the map does meet the first criteria of the court order with\ntwo new black majority districts.\nalso meets the second test in that it clearly passes with no unnecessary changes purely\nto gain partisan advantage. You've now discussed two Senate maps. The difference that we're\nconcerned about is the unnecessary disruption of voters in Chair Eccles map, which impacts\n15 districts moving 14.4% of the statewide population. While the Democratic caucus map\ndemonstrates that the court order can be met without broad disruption and potentially\nvote delusion of the chair's map. The Democratic caucus map is more surgically\nprecise impacting just 10 districts and 8.4% of the population. This puts the\nchair's map should it pass at risk as we've heard from others for being struck\ndown by judge Jones in which case a special master would draw a map for the\ncourt which may or may not result in less attention to incumbent protection. We\nstrongly encourage you to revisit the map and take control and pass a map that\nfully reflects the growing diversity of Georgia and does not have the risk of\nbeing overturned by the court. Thanks for the opportunity to present today.\nThank you. So that concludes the public hearing portion of the meeting.\nMadam leader at this point if I think the times appropriate to entertain a motion if you would like to have motion on your map\nThank you, madam chair. I\nMove that\nSenate be a one EX\nExcuse me\nWait, no, we haven't.\nWhere did I get that?\nSo we got a motion in a second for EX.\nOr that was a joke.\nMove.\nI'm not going to make you a motion.\nOh, so about this.\nOK, I apologize.\nLet's make my motion.\nNo, I'm not going to make you a motion.\nI'm looking at the wrong bell for EX.\nFor EX?\nYeah.\nSo we have a motion.\nSecond, Madam Chair, but we also speak to the motion.\nOkay.\nDiscussion?\nYes.\nI do second that motion.\nI did want to have a brief discussion on Madam Chair.\nThank you.\nObviously, we supported this particular 4EX.\nBut I do want to just talk about,\nbecause I could say this now or when you take up 1EX later,\nthat we have taken up basically in three hours this committee.\nThis committee. Eight days worth of testimony in the court. They had 20 witnesses live.\nThey had 20 witnesses through deposition. The court made a 516 page findings.\nAnd we have basically taken that within this committee and condensed it down to three hours worth of testimony, if you want to call it that, to make a decision on these maps, which is a gigantic decision, quite frankly.\nBecause, of course, it does involve the Voting Rights Act.\nAnd I've heard comments about we're here because left-wing groups have brought us to this point.\nIt's not true.\nWhat has brought us to this point is, unfortunately, the sad sword history of voting in Georgia.\nAnd its decision from Georgia to continually suppress and oppress the rights of one particular group African Americans.\nAnd that sad sort of history cannot be refuted because even the defense's own experts stipulate\nit to that particular history.\nSo we know it exists, and that's what actually brings us here.\nToday, and of course, now the perfunctory remark will be what part of that sad history\ncame through because Democrats were in control.\nOf course, that remark misses the point that life is not static.\ncan change, parties change. In fact, those who know history realize that parties were initially\nfrowned upon in the United States. Many thought that one of the reasons that George Washington\nrun for his third term was because of proliferation of political parties. So parties change. But\nyou know what, that analysis about what party was in control, what party was not in control,\nmisses the point that the court points out, misses the point that the reason why we had\nthe vote and rights act, the point is about not who's been in control, the point is about\nwho's been discriminated against.\nAnd so no matter who was after, no matter who was Democrats or Republicans or any other\ngroup, the constant group that was discriminated against stopped whether through written law\nor through informal law, or remember defensive experts are stipulated to all of this that\nI'm saying is African-Americans.\nThat's why we're here.\nIt's not about whether to get too extra seats on a Democratic side or a Republican side.\nIn fact, the court even addressed that because if you remember, the offenses expert tried\nto make the point and said, we have racial polarized voting in Georgia because African-Americans\nmay vote more Democratic.\nOf course, that's not the issue.\nThe issue is who has been discriminated against?\nWhy do you have racialized polarized voting?\nAnd can that particular group of hundreds of years of discrimination elect the persons\nof their choice?\nAnd according to that order, following a conservative Supreme Court, mind you, said no,\nthat these lines that were drawn violated the Voting Rights Act, following and using the\nrationale used by a conservative Supreme Court.\nAnd understand that many of the metrics used in that case in Alabama, whether it was racial\npost-vised voting or some of the factors that the conservative Supreme Court looked at,\nGeorgia actually fell as we fall below that.\nOur racial polarized voting is actually more extensive\nthan in Alabama.\nMany of the factors that they looked at in the Alabama case,\nGeorgia falls below that.\nWhen we start talking about some of the factors to look at,\nwhether it's pole closing, what there's\ndifferent types of laws that have been enacted,\nthis court found that Georgia actually\nfalls below Alabama.\nWe're heading in the wrong direction.\nAnd we realize that these potential map that might be going forward is not going to pass\nConstitution of mustard and we're going to have someone who knows nothing about a lot\nof us drawing these particular maps.\nIt was asked about what metrics were used in determining about 4EX and I would say that\nI find that a very interesting comment because two redistricted cycles now still don't\nknow the metrics that have been used by the majority party that were most likely.\nBe going forward.\nDon't know the socioeconomic factors that have been used.\nDon't know the racial polarization that have been used.\nThese are things that were brought up before.\nNow all that was came out in testimony in the court case.\nBut what metrics were used?\nBut no one says what metrics were used on the opposite side.\nWhat are the socioeconomic factors?\nWhy is it that African Americans are below on so many numbers that the court took\ninto consideration.\nWhat metrics were used as far as racially polarized voting?\nWhat metrics were used when you find that,\nas far as if you have a, in a general election,\nAfrican-American and white candidate,\nthat African-American normalment can't get over 10%\nof that white vote?\nWhat metrics were used?\nIt isn't about one or two extra seats here.\nAnd there was a question about acknowledgement.\nA knowledge about two extra seats.\nuntil we get ready to acknowledge the history\nand present history of voting in this state\nand the design to stop.\nOne group, doesn't matter about who,\nI don't care about the party, but one group,\nAfrican Americans from ex-Sus and the right to vote,\nwe will continue to go through these\nridiculouses process over and over and over.\nThat's the acknowledgement we need to be making.\nis who has been discriminated against.\nLet's acknowledge that and then find out how to go forward\nto make sure that group has the opportunity\nto let the candidates of their choice.\nBut I do support SB4EX and I do second that motion.\nThank you.\nWhat number are you?\nTwo.\nYes, sir.\nThank you, Madame Chair, just to comment.\nI represent District 33.\nBasically, all y'all know me in here.\nI'm not a black and white guy.\nBut I have to look at the data when it comes to District 33.\nThe black vote in age before we started this process\nwas over 40%.\nNow it's down to 32%.\nWhen you get below 37%, a group of voters are not\neffective at election that candid it\nor get in their politics formulated in positive manner.\nwant to go and that's quite a drop from 40% to 32%.\nThat's a significant drop.\nAnd you have to wonder since that district 33 is\nminority opportunity district wise that happened in how\ncan I explain that to the people in my district.\nWhat does it mean?\nI might not get reelected.\nThat's one of the things it means.\nIt means in the morning, when it comes to roll call,\nI won't be able to call out the Senator\nfrom the 31st name or call out to y'all.\nSenator from the 46 may not be around.\nI won't be around so he can laugh at my corny jokes.\nSenator from the 51st, we've worked hard\ntraveling around the state, trying to formulate\ndevelopmental authorities and take on some tough issues.\nBut basically, what does it mean that the people in my district\nprobably be disenfranchised. But I just want to make that comment and I support the Democratic bill.\nThank you. Thank you. Any more discussion about SB 4EX?\nThat's your bill. Okay, so we have had a motion, we have had a second, we've had discussion,\nSo I think it is time to vote.\nLet me read off LC 472579 is the LC number\nthat you, for your bill, is that correct?\nOkay, so the motion is for do pass,\nfor Senate Bill 4EX of the LC number that I just read.\nAll of those in favor, raise your hand.\nDid you get those?\nThank you.\nAnd all of those opposed, raise your hand.\nThank you.\nSo the motion fails.\nI think it is the appropriate time I make a motion we do pass Senate bill 1EX LC number 47258 for we have a motion is there a second we have a second is there any discussion\nI've listened to the debate and the impassioned comments of many members of this committee and I can't\nOverstate my affection and respect for the Dean of the Senate, for the minority whip,\nthe minority leader, and I can't put myself in your shoes.\nThe whip just made a great argument about historical discrimination, voter suppression.\nThere were times in our state's history where the Democratic Party would not allow African\nAmericans to vote in their primaries.\nThat is obviously changed.\nFor the better.\nThere was a reputed history in the south of discrimination against black voters, which\nis why we have the Voting Rights Act in Section 2, which brings us here today.\nAnd I think we're selling ourselves short not to acknowledge and recognize the progress\nthat we have made as a state in working together in stopping the past practices of discrimination.\nAnd now we come here today and the echoes of these arguments resonate still in this room\nand our behavior has changed and it's modified.\nAnd we are following the law.\nAnd I voted for the 2021 plan believing and having been advised by legal counsel that\nit was nondiscriminatory.\nMost of the opposition to it was partisan opposition.\nAnd like they say, you can't take politics out of politics.\nThat's understandable.\nWe all have thick skin and we can take that.\nJones, who is a personal friend of mine, sees this otherwise, and he believes that to\ncomply with Section 2, we can create to additional African-American majority districts.\nIf he thought we could create 3, 4, 5, 6 more, he would have put that in the order.\nBut he said, based essentially on the demographics of Georgia where you have a 31 percent African-American\npopulation, we ought to be able to create two more. And he showed us the areas with high\nAfrican-American concentration of population in the South Metro Atlanta area where we can\ndo it. Well, the chairman has done it. She has created the maximum amount of majority\nminority districts that Judge Jones believes is possible in the areas where he thinks is\npossible. So we are doing our very best to comply. The only difference between\nthese two plans, they're both creating those districts in the area required or\nsuggested by the judge, is that the Democratic plan has partisan advantages\nwhere they add to Democratic seats and the chairman's plan does not. So let's\nLet's stop the debate about the racial components because both plans comply with what the judge\nrequested and it's the maximum amount of African American participation.\nAny suggestions of voter suppression are simply inaccurate.\nThe voting data shows we had the highest African American turnout ever in the history of\nthis state after these maps were passed.\nAnd we had the high voter turnout.\nNobody's votes are being suppressed.\nSome people aren't electing the candidates.\nThey won't.\nA lot of Republicans weren't happy that we have two\nRepublican United States senators, but we do.\nAnd we all work together and live together.\nAnd there's always the next election\nwhere you can go advocate and fight.\nbut there has been no proof of any voters\nnot being allowed to vote or their votes not being counted.\nThe issue here was, can African-American voters\nelect the candidate of their choice?\nAnd because of our racially polarized voting,\nthat leaks into racial majorities and minorities\nin different districts.\nWhat I hope for, as a Republican, is the day\nThat as a Republican party, we can persuade African-American voters that we are their candidate\nchoice, regardless of our race.\nAnd it's more of a political discussion, and I don't want us to lose sight of the fact\nthat we have made tremendous advances in this state on the treatment of minorities, not\njust African-American minorities, but all minorities.\nIn the state Senate itself, we have 18 non-white members right now.\nThat's over a third of the 56 Senators, and we're about to have very likely two more\nand less weekend persuade voters of color to elect Republicans, and we'll see that we\ncan do that.\nAnd I just, I want the public to recognize that that's our split right now, you know,\nas we have eight, we have a third of the Senate, our minorities, and it's going to increase.\nAnd it is an inclusive state that we have for everybody.\nWe always said that Atlanta and Georgia were too busy to hate.\nAnd I like to see that our state government continues to operate the same way.\nI think the chairman's plan equally addresses those concerns of racial discrimination\nwithout changing any partisan advantage that the current system has, and I soundly endorse\nit.\nThank you.\nAny more discussion?\nOkay.\nOkay, then, at this point, well, I guess it's time to vote on LC 472584.\nThat is Senate Bill 1EX.\nAll of those in favor of the motion do pass.\nRaise your hand.\nI'm sorry, I'm not there.\nAll of those opposed to the motion do the same, raise your hand.\nThank you.\nThe motion passed.\nThat concludes our meetings on the Senate redistricting maps.\nI'll entertain a motion to dismiss to adjourn.\nmove to have a second. I don't need it. Okay meeting is adjourned we've made\nthe motion we've second we're out.\n",
  "updated_at": "2026-02-12T01:47:57.87609+00:00"
}