{
  "video_id": "9AQHkPyfzjg",
  "url": "https://youtu.be/9AQHkPyfzjg?t=760",
  "title": "Georgia House - Day 26 (2026-03-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 26,
  "video_date": "2026-03-03",
  "duration_minutes": 142,
  "summary": "Overview:\nThe Georgia House session on 2026-03-03 (Day 26) covered the introduction of several notable bills, including HB 416, HB413, and SB 420. The session featured a scripture reading and prayer by Rep. Sharon Cooper's colleague and friend, Mac Jackson, as well as some discussion around the importance of walking with God and blessing others.\n\nKey Actions:\n**HB 416**: [Bill description not provided]\n**HB413**: [Bill description not provided] \n**SB 420**: [Bill description not provided]\n\nBills Introduced (First Reading):\n- HB 416\n- HB413\n- SB 420\n\nNotable Moments:\n- Rep. Sharon Cooper introduced her friend and colleague, Mac Jackson, to deliver the opening scripture reading and prayer after the scheduled pastor could not attend.\n- Mac Jackson's sermon focused on the story of Joseph from the Bible, emphasizing the importance of walking with God and blessing others, even in difficult circumstances.\n\nVotes:\nNo recorded votes mentioned.\n\nAttendance:\nA quorum was present, as all members voted to signify their presence at the start of the session.\n\nAdjournment:\nThe transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "Good morning. All members will please come to the floor. All members come to the floor please. Good morning. Good morning. Good morning. The hour for convening having arrived. Our convening having arrived. All members will please take their seats. Mr. Clerk, will you ring the bell? Yes. Good morning. Good morning. Good morning. Good morning. Good morning. I believe rules committee, most of y'all are here. I believe all most of the rule committees are here. So all members of you, please come to the floor and take your seats. We're going to have the morning row call. All members present. Will please vote green to signify their presence and the chamber. Mr. Clerk, will you unlock the machines? Have all members voted. Mr. Clerk, will you lock the machine? Well, good Monday morning to you. Hope y'all know how to good weekend board. The weather was really pretty. I feel like March, so I had a little wind down my way. I can still be home flying my kite on this Monday. Still like to do that. Doorkeepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning is obviously no stranger to this house, but he'll be better and further introduced by the lady from the 45th House District, representing Sharon Cooper, representing Dick Cooper. Thank you, Mr. Speaker. Good morning, everyone. It's truly an honor to introduce Mac Jackson this morning. And I say that not just as what we say always when we're introducing the pastor of the day, that it's an honor, but that it's truly an honor for me to introduce Mac, who is a colleague and a friend. When I first came to this body, I was told that it was sort of like a fraternity or sorority. They'll get to know everybody on both sides of the aisle, and that you could travel anywhere in the state. And if you needed help, you could call your colleague, and they would help you. Well, as the years pass, that never happened to me, and I got to know everybody on both sides of the aisle, as colleagues and many of my friends like Mac is to me. But I served on the Rural Caucus Committee for several years, and we toured all over this state, and we went to tiny little towns. I found out what love bugs were, and met a Georgia when my windshield was covered with them, and when you got out, they tried to attack you, those little things that are so irritating. And I learned what it really meant to be a friend, and someone like a sorority or fraternity member, to have that person step forward and help you. I had car trouble, remember it, Mac. And as always, after the meeting, I had stayed and talked with the people that had come from those communities to be at the committee, because I didn't have any real reason to head back home. I don't farm or have another job that I had to go to. And so it was pretty late, and there weren't many of us left. And the car trouble, I found the car trouble. And Mac came to my rescue, and I will be forever grateful for that, because it was a tiny little town in Georgia, and it was late in the evening. And I don't know what I would have done if I'd been there, and had him Mac hadn't helped me. Well, he's come to my rescue again today. Unfortunately, the pastor that I had invited is having an emergency route canal right now. And so he couldn't be here. And once again, Mac has come to my rescue. He is truly a friend, a great colleague, and a very honorable member of this body. And I thank you again, Mac, and I give to you, Mac Jackson, to do our opening. Thank you, Mr. Mayor. Well, good morning. Thank you, Mr. Speaker, chair-related Cooper for this opportunity. When I got the call from Jacob this morning, I thought Jacob was going to do something. I could just hear me this accident now. But chair-related Cooper did a great job, and I thank you for the honor to be able to stand here. Now, as she said, I'm not her pastor, but she is invited to come to our church, we're in little Tunnel, Georgia, right now, of how we're 15 south, if you ever come in that way. We're right there in Tunnel, Georgia. But it's an honor to be here, and a speaker, to speak to my colleagues today. Now, I didn't bring my Bible, so I just have to go with what I know. Usually, when I do that, it takes me about an hour and 15 minutes to finish a sermon, when I just go off the top of my head. But as you know, I, Joseph in the Bible is one of my favorite stories, the story of Joseph, and you know, Joseph had a dysfunctional family. His family, because of the dream that God had put in his heart, his family eventually sold him into the house of Potiphar. And I'll pick it up in Genesis 39, and it says, and Joseph was brought down to Egypt, and Potiphar in opposite of Pharaoh, Captain of the Guard, and Egyptian brought him at the hands of the Islamites. So Joseph was in captivity, but he was in Potiphar's house. But the Bible says, and the Lord was with Joseph. So it doesn't matter what situation you find yourself in, all that matters is that God is with you. And the Bible says in his master's soul that the Lord was with him, and that the Lord made all that he did the prosper in his hand. You know, people can actually see when you're walking with God. You don't have to put a sign on the back, you don't have to put a t-shirt on. If you're walking with the Lord, there's something about the anointing of the Holy Spirit that will cause people to see when the Lord is with you. And that's what happened to Joseph, his master's soul, that the Lord was with him. And not only was the Lord with him, but he made things to prosper in his hand. And then in verse 4 says, and Joseph found grace in his sight, and he served him, and he made him overseer of his house, and all that he had, he put into his hands. He saw so much grace on Joseph until he turned everything over to Joseph in his house, and everything that he had. And it says, and it came to pass from the time that he made him overseer in his house, and all that he had, that the Lord bless the Egyptian's house, but Joseph's seat. You see, when you do it the way God tells you to do it, God will bless others for your seat. You know, sometimes I just ask God the bless my neighbor. I ask God the bless the congregation that I church. I ask God the bless the state of Georgia to bless these United States of America, because if he can bless the Egyptian's house for Joseph's sake, then it would be who was to think about somebody else sometime. To think about others, Jesus said, when you do it to the least of these my brother, you're done it unto me. So it would be who was to have asked God to bless others sometime. Think about yourself all the time, but ask God to bless somebody else, because it says he blessed the Egyptian's house for Joseph's sake, and the blessing of the Lord was upon all that he had in the house and in the field. Now think about this, before Joseph got their potterfuss corn wasn't grown, but because of the blessing of the Lord, potterfuss corn started growing. His cows started moving, if you will. He started happening around potterfuss house, because Joseph had a heart for God, and Joseph wouldn't get angry. He wouldn't get upset with people just because they did wrong to him. Instead, he did what Jesus said in Matthew chapter 5, verse 44, he said, love your enemies. Bless them that curse you. Do good to them that hate you and pray for them, which despitefully use you and persecute you. Joseph stayed true to what God required of him. And I believe in life, and we'll just do it the way God says to do it, and stop trying to be our own God, and stop trying to play Holy Ghost Junior, and do it the way God says to do it, because God knows what he's doing. He created us in his image and his likeness, and he knows exactly how we're supposed to live in the earth. All I want to him say is well done, thy good and faithful servant. So Joseph stayed true to what God required of him. He never lost sight of his purpose, and the destiny that God had planned for him, even when Mrs. Potterfuss lied on him. Even when Mr. Potterfuss put him in prison, I don't believe that Mr. Potterfuss believed Mrs. Potterfuss. I think he just had to do something because his wife made that accusation. I believe his mother told him not to marry her anyway. He knew her. His mother had warned them. Don't marry that woman. But because he was married to her, because she made that accusation, he had to do something to save face if you will. But in Genesis, I'm going to hurry on. I told you it takes me about an hour and 15 minutes to preach this. But in Genesis chapter 50, when his brothers came to him, after he had been elevated to prime minister of Egypt, and when his brothers thought that he would punish them for all the evil that they had done unto him, he asked a very important question in verse 19. He said, fear not for him, I in the place of God. You see in Romans 12 and 19, Paul told us, he said, dearly beloved, of vengeance not yourselves, but rather give place unto wrath. For it is written, vengeance is mine. I will repay, say it the Lord. Now, I want you to notice, he didn't say revenge, but he said vengeance. There's a big difference in revenge and vengeance, if you will. Vengeance means that God will bring justice in his time and in his own way. It means what Paul said in Romans 8 and 28, and we know that all things work together for good to them that love God, to them who are called according to his purpose. So Joseph told his brothers, you thought evil against me, but God needed unto good to bring the past as it is this day to say much people alive. So Joseph knew his destiny, he knew his purpose, so you couldn't make him come down to a level that God didn't require him. And he said this when he had his two sons in Genesis 41 and 51, and Joseph called the name of the first born Manasseh. For the God has made me forget all my toll and all my father's house, and in verse 52, the name of the second he called Epirin. For God has caused me to be fruitful in the land of my affliction. My brothers and my sister, if you just hold on to God's unchanging hand, he'll bring destiny to pass in your life. He'll cause purpose to come to pass in your life, but you gotta be mindful to do it God's way. If he tells you to love those that hate you, you gotta love him. You gotta pray for those who despitefully use you. And I know that's hard on you, but you gotta do it. My brothers and my sisters, if you wanna do it God's way, let's pray. Heavenly Father, we just thank you for this day. We thank you because this is a day that you have made, and we will rejoice and be glad in it. When we think about our brother, Terry England Lord, we ask for your blessing upon him and upon his family. Bring him through to a speedy recovery Father, and Lord, we ask you to bless the speak of this house. Speak of John Burns, because we know that it takes your wisdom to lead in the state Father. And because of your wisdom Father, we have faith in you that you will bring purpose and destiny to pass in all of our lives for it's in Jesus' name that we pray. And everyone said, amen. Shall we pledge allegiance to the flag? I pledge allegiance to the flag of the United States of America and to the Republic of which it stands, what nation and God is indivisible with liberty and justice for all. Strong, man. Brother Matt, if I can say it that way, you bless us all with your friendship and you bless this house and this state by your service to the people and your district and to all of our state. Thank you for who you are. Thank you for being a friend. You bless us again. Doorkeepers, you can unlock the doors, open the doors. Members, you can join Matt at his desk or you can join him in the south-eity room if you'd like to take a photo with him. We just again appreciate him being here and doing what he does every day for us. Thank you, sir. Thank you. Thank you.\n\nOur doctor of the day has brought us today by Representative Engel Willis of the fifty-fifth. They started Dorsey, Norwood. So if you need to see the physician, Dr. Norwood is down in the aid station. Be glad to see you administer to your needs, whatever they may be. The chair of the Committee on Information and Audits, Chairman Hilton has recognized Chairman Hilton. Good morning, Mr. Speaker. Your Committee on Information and Audits has read the journal the previous legislative day. We found it to be good. Awesome. Chairman Hilton, the chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct, is there any objection to dispense with your reading of the journal? Hearing none, the reading of the journal is dispense with, is any objection to the confirmation of the journal? Hearing none, the journal is confirmed. Mr. Clerk, will you read the resolution and establish in the order of business for the day? Reptile of the frustration of the 104th moves following me establishes the order of business in the first part of the period unanimous consent. Introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to adoption of the resolution establishing the order of business for the day, hearing none, the resolution is adopted? Thanks members, if you'll take it down on that, opt-tay for two, and continue to have your discussions, we will have our first reading. Mr. Clerk, will you read, first read the bills and resolutions. Mr. Clerk, will you read? House bill 682 by reps. I'm Mitchell the 88th Bill B. Toddl and Act to amend Article 2, chapter 10 and title 17 of the fiscal to Georgia annotated relating to death penalty. Judiciary non-civil. House bill 683 by reps. I'm Gullitt of the 19th Bill B. Toddl and Act to amend Code Section 824 of the fiscal to Georgia annotated relating to certain residential fire sprinkler requirements. The government affairs. House bill 684 by reps. I'm Taylor the 92nd, hewthly the 141st Alexander the 66 Williamson 68th, Holly the 116th Bill B. Toddl and Act to amend chapter 10 and title 43, the fiscal to Georgia annotated relating to wild partners and cosmologists. Who regulated industry. House bill 685 by reps. I'm Gammal the 15th, the Skoggins the 14th, Bill B. Toddl and Act to provide for the creation of one or more community improvement districts in Marto County. Andrew, governmental coordination. House bill 686 by reps. I'm Gullitt of the 29th and the Williams, the 148th Bill B. Toddl and Act to amend title 50, the fiscal to Georgia annotated relating to state government. Higher education. House bill 687 by reps and a Crawford of the 89th, Oliver the 84th, well it's the 55th Draper, the 90th fry, the 120 second. Bill B. Toddl and Act to amend article 2, chapter 7 and title 44 of the fiscal to Georgia annotated relating to security deposits. And judiciary. House bill 688 by reps and a Crawford of the 89th, Holcomb of the 101st, Oliver the 84th and Westbrook of the 163rd. Bill B. Toddl and Act to amend code section 5, 3, 10 of the fiscal to Georgia annotated relating to manner for service and process. Judiciary. House bill 690 by reps and a newton of the 127th, the 50th, Cooper the 45th, Stevens the 164th and Hawkins the 27th. Bill B. Toddl and Act to amend chapter 64, title 33 of the fiscal to Georgia annotated relating to regulation and licensure pharmacy benefit managers. Insurance. House bill 692 by reps and a newton of the 127th and Hawkins the 27th. Bill B. Toddl and Act to amend article 3, chapter 26 and title 43 of the fiscal to Georgia annotated relating to mandatory reporting requirements for nurses. Halt. House bill 693 by reps and a carper to the 4th of Bill B. Toddl and Act to amend code section 23, 411 of the fiscal to Georgia annotated relating to definition, relative to tuition, equalization grants. Higher education. House bill 694 by reps and a newton of the 83rd, limit of the 98th, Wilkerson of the 38th. Bill B. Toddl and Act to amend article 14 to chapter 2 and title 20 of the fiscal to Georgia annotated relating to elementary and secondary education grants. Education. House bill 695 by reps and a newton of the 17th, reach to the 140th, bell of the 75th. Barry the 56th, fluoronoid, 74th and others. Bill B. Toddl and Act to amend part 3, chapter 3, title 20 of the fiscal to Georgia annotated relating to Georgia and student finance authority. Higher education. House bill 696 by reps and a newton of the 17th, Smith of the 18th, Barry the 56th. Neil the 79th, fri, 120th and others. Bill B. Toddl and Act to amend chapter 2, title 20 of the fiscal to Georgia annotated relating to elementary and secondary education. Education. House of resolution 449 by reps and a newton of the 18th, Gunner of the 8th, Kelly the 16th, Reeves of the 99th and Roberts of the 52nd. The resolution creating a house study committee on modernization of the traffic violations bureau. Motor vehicles house resolution 450 by reps and a wheat hour, 121st, martin of the 49th Williams, 168th, Williams, 148th. Hugely the 141st and others of resolution proposing an amendment to the Constitution, the state of Georgia, so it's authorized the general assembly. Higher education, senate bill 88 by senator beard and a 30th and James 28th, Bill B. Toddl and act to amend code section 1562 of the fiscal to Georgia annotated relating the number of judges in superior courts. Judiciary. Senate bill 145 by senator burns the 23rd Jones, the 22nd Anderson, the 24th, Bill B. Toddl and act to amend code section 1562, the fiscal to Georgia annotated relating the number of judges in superior courts. Judiciary. Senate bill 152 by senator doll Zell, the 27th Kennedy, the 18th Gucci, the 51st Roberts, the 29th brass, the 6th and others, the Bill B. Toddl and act to amend article 2 chapter 2b, a title 20 of the official code of Georgia annotated the Georgia Promise Scholarship Act. Education, Senate bill 153 by senator hatchet of the 50th Kennedy, 18 Jones of the 22nd, cows of the 46th, parent of the 44th and others, the Bill B. Toddl and act to amend the official code of Georgia annotated so it survives modernized correct errors or emissions in. Code revision, Senate bill 238 by senator Anderson, the 43rd of Bill B. Toddl and act to amend the act creating the Board of Commissioners for Rockdale County. Change for governmental coordination. Complete first readers. Second reading the bills and resolutions, the clerk will read. House Bill 657 by represent of Hagen and the 156th, the 13th, Cameron of the 1st, the 137th, the 55th and others, the Bill relating to health. House Bill 658 by represent of Hulcombe the 101st, here to believe the 141st, Miller of the 62nd, Owl, the 50th Draper of the 90th and others, the Bill relating to insurance, House Bill 659 by represent of green of the 154th, Taylor of the 173rd, Hawkins of the 27th, Jaspers of the 11th, Hagen of the 156th, a Bill relating to medical professionals for rural assistance. House Bill 660 by represent of Cox of the 28th, Jaspers of the 11th, Rice of the 139th, Skoggins of the 14th, McDonald of the 26th, a Bill relating to employees and insurance and benefit plans, public assistance, general provisions relative to state government, House Bill 661 by represent of the 120th, Hagen of the 81st, Barrett of the 24th, Relive the 22nd, Chastain of the 7th and others, the Bill relating to elections of primaries, House Bill 662 by represent of the 169th and 4th of the 170th, the Bill relating to eligibility to receive tax credits. House Bill 663 by represent McCallum of the 30th and Powell of the 33rd, a Bill relating to powers and duties of board and natural resources, destination of commissioner and director of the board's agent, and power and duties of the director. House Bill 664 by represent of the 50th, Reaves of the 99th, Panich of the 51st, Hilton of the 48th, the Bill relating to property owners associations, House Bill 665 by represent of McCallum of the 30th, Cooper of the 45th, Taylor of the 100th and 7th, St. of the 30th, and the 104th, a Bill relating to general provisions of the Department of Public Health, County of the boards of health, administration of enforcement, House Bill 666 by represent of the 178th, Neil of the 79th, Lever of the 123rd Smith of the 18th thorny of the 174th, Bill relating to number of judges of superior courts. House Bill 667 by represent Anderson of the 10th, or one of the 32nd, Gamble of the 15th, Skoggins of the 14th, Bonner of the 173rd, and others, a Bill relating to commercial drivers licenses. House Bill 668 by represent of Thomas of the 21st, C. Bob of the 34th, Washburn of the 144th, McCallum of the 30th, Dempsey of the 13th, and others, a Bill relating to crimes and offenses, rights of persons with disabilities, uniform rules of the road. House Bill 169 by represent of the meek, so 178, per shed of the 176, Hagan of the 156th, Corporate of the 174th, a Bill relating to capital outlay funds on the Equality Basic Education Act. House Bill 670 by represent of Clark of the 108th, Hugh Glee of the 111st, Carter of the 93rd, Evans of the 57th, Holcomb of the 101st, a Bill relating to buildings and housing, Commerce and Trade, Labor and Industrial Relations, law enforcement officers, agencies, public officers and employees, state government, House Bill 671, by represent of the rise of the 139th, Lemming of the 114th, McDonnell of the 26th, Kelly of the 16th, Smith of the 18th, and others, a Bill relating to general provisions as pertaining to torts. House Bill 672 by represent of the 58th, Bayes of the 69th, Bill of the 62nd, Bennett of the 94th, a Bill relating to the Department of Public Health. House Bill 673 by represent of the 98th, a Bill relating to procedure for sentencing and imposition of punishment, House Bill 679, by represent of Sanchez of the 42nd, Friday of the 122nd, Commision of the 39th, Bill of the 75th, Taylor of the 92nd, a Bill relating to illegal and void contracts, House Bill 680, by represent of Sanchez of the 42nd, Trana of the 80th, Al of the 50th, Clark of the 108th, Scofield of 63rd, and others, a Bill relating to labor and industrial relations, House Bill 681 by represent of Clark of the 100th, Canada of the 58th, Turner of the 85th, Barnes of the 86th, the Bill relating to name changes, House Bill 689 by represent of Carpenter of the 4th, Campbell of the 35th, Pilton of the 48th, four guys were the 157th, five of the 120th, second, and others, a Bill relating to housing trust fund for the homeless, House Bill 691 by represent of Carpenter of the 118th, Smith of the 70th, Camp of the 135th, New of the 40th, Bonner of the 73rd, a Bill relating to emergency management. House Resolution 426 by represent of Scofield of 63rd, Jackson of the 68th, Davis of the 87th, Canada of the 58th, Bernal of the 77th and others, a resolution urging the General Assembly to support the creation of a Black Maternal Health Caucus, House Resolution 427 by represent, four guys are the 157th, Meeks of the 178th, Resolution honoring the life of Dr. Esco Hall Jr. Dedicating a road in his memory, House Resolution 428 by represent of the rest of the 140th, newly of the 141st, by represent of the 137th, Smith of the 138th, Rice of the 139th, Resolution creating the House Study Committee on the Affordability and Accessibility to Georgia's Legitimation Process, House Resolution 429 by represent of the 49th, Parsons of the 44th, Drener of the 85th, Pro of the 118th, Camp of the 170th, second, Resolution creating the House Study Committee on funding for next generation 911, House Resolution 448 by represent of Jones of the 60th, Resolution recognizing women's golf week in the state of Georgia. Senate Bill 42 by Senator Hatch of the 50th, Eccles of the 49th, Carp Hatch of the 32nd, Payne of the 54th, Strickland of the 42nd, others, a bill relating to penalties for violating Code Section 1669 through 16612, Senate Bill 69 by Senator Kennedy of the 18th, due to the 55th, Robertson of the 29th, and the March 31st Hatch of the 50th and others, a bill relating to banking and finance and deposition to discovery under the Georgia Civil Practice Act, Senate Bill 101 by Senator Robertson of the 29th, Hatch of the 50th, Payne of the 54th, Williams of the 25th, still the 48th and others, but Resolute, a bill relating to control of hazardous conditions, preventable disease and metabolic disorders, Senate Bill 131 by Senator Hodges of the 3rd, Watson of the 1st, still the 48th, Dixon of the 45th, Goodman of the 8th, and others, a bill relating to the Georgia Board of Health Care Workforce. Senate Bill 141 by Senator Hatch of the 50th, Hatch of the 50th, Hatch of the 52nd, Albers of the 56th, Kennedy of the 18th, and Andrew Murt of the 31st, and others, a bill relating to revenue and taxation through 2nd readers. Senate Bill 131 by Senator Robertson of the 25th, and others, a bill relating to the U.S. Department of Justice, and others, a bill relating to the U.S. Department of Justice, members, if I can have your attention, please, members, if I can have your attention, please, we have several guests this morning that will be joining us for some special recognition in a few minutes. The first members, I have your attention, please. We have a very special guest from Congress. The lady that represents the 14th district. We take the district here in Georgia, the Rep. Marjorie Taylor Green. We're so proud to have her and congratulations on her chairing the House Committee on Oversight and Accountability. We appreciate you being here with us today. Come back anytime. You're always welcome. And thanks for, thank you for representing Georgia. We appreciate you so much. You ready, Mr. Clerk? Reports of standing committees, the clerk will read. President Williams, the 148th District Chairman of the Committee on Banks and Banking submitted the following report. Mr. Speaker, your committee on banks and banking has had under its consideration the following bills of the House has instructed me to report the same back to the House and following recommendations. House will 159 do pass by committee substitute. House will 439 do pass by committee substitute respectfully submitted. Reps and Williams, the 148th District Chairman. Representative Carpenter, the fourth district chairman of the Committee on Creative Arts and Entertainment submitted the final report. Mr. Speaker, your committee on creative arts and entertainment has had under its consideration following bill of the House's destructive meeting report the same back to the House and following recommendation. House will 566 do pass by committee substitute respectfully submitted. Reps and Carpenter, the fourth district chairman. Reps and Carpenter, the 82nd District Chairman of the Committee on State Planning and Community Affairs submitted the following report. Mr. Speaker, your committee on state planning and community affairs has had under its consideration the following bill of the House has instructed me to report the same back to the House and following recommendation. House will 689 do pass respectfully submitted. Reps and Carpenter, the 82nd District. Chairman. That completes the reading of the report's standing committees. Thank you. Thank you. Okay, members, we're moving on to morning orders. You'll have a maximum of two minutes, a max of two minutes. Representative Davis, Representative McQueen and some other friends. Welcome to come down to the, come down front, friends, come on down and join her. She has a very special morning order. We have some distinguished guests in the gallery today. Yes, they had. They're easy to spot. They look good in that rear. I can tell them that much. Okay, ladies recognized. Thank you, Mr. Chair. Sorry, Mr. Speaker. Sorry, sorry. I'm just very excited. All right, so Mr. Speaker and a steam colleague, I rise today with great pride to welcome my beloved sororers of Delta Sigma Theta sorority incorporated to the Georgia State Capitol for Delta days at the Capitol. Yes, sororors. Stand and show yourselves. Since our founding in 1913, Delta women have been on the front lines of social action. Just two months after our inception, our founders boldly participated in the women's suffrage march in Washington, B.C. Ensuring that black women's voices were included in the fight for the right to vote. That legacy of advocacy continues today, especially here in Georgia. Delta women across this state have been instrumental in mobilizing voters advocating for maternal health protections and fighting for education. Equity, ensuring that policies uplift and empower the communities we serve. Their dedication to service, scholarship and social action makes a lasting impact on Georgia and beyond. As such, we have a resolution commending Delta Sigma Theta sorority incorporated for its 112 years of service and recognizing March 3rd, 2025. As Delta days at the state Capitol and for other purposes, whereas Delta Sigma Theta sorority incorporated the public service organization founded on January 13th, 1913 by 22 visionary collegiate women at Howard University in Washington, B.C. And it's an honor to welcome these dynamic women to the people's house. Thank you, Mr. Speaker. I yield the well-welcome sororors. Always enjoy Delta Day. Thank you all for being here. I know y'all come often. We appreciate you. One quick one. Give the lady your attention, please. Oh, we leave. I would like to acknowledge some deltos that we have working here at the state Capitol, our doorkeeper, Lexine Walsh. All right. And out of the hallway, we have Nelly Miles and Natalie Knight. And we also have Deed Redoots. And one of our administrative assistants, we have Josephine Lamar. Thank you. And lent alumni chapter president Roslyn Hopper. Welcome. Thank you. Thank you. You dealt with her everywhere. Thank you all for being here. Welcome to the people's house. Thank you for being here. We appreciate y'all. We're representing Crawford. Representative Crawford. Representative Crawford. It's recognized for a morning order. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Friends, today I rise to present to you an incredible group of students from House District 89. I'm going to argue that this is probably the best high school in the state. My high school, my alma mater, Southwestern Camp High School. Please welcome these incredible students to the people's house. Thank you, Mr. Speaker. I yield the well and someone left their phone in the well. I will keep it right here so you can receive it. Is that your word, Representative Holly? Yes, it is. It's coming up behind you. Recognize for a morning order. Good morning. Give the lady in the well, you're attention, please. Good morning, colleagues. It is our esteemed pleasure to welcome a state championship softball team in the house today. They are from CCA. Y'all stand up, girls. This is only the second time in the school's 55 years of existence that they've ever won a state championship in softball. I am so proud of them. Standing behind them is Coach Koran. He actually is 34 years old. He's been at CCA nine years and he has brought the second baseball team championship and the school's second softball championship. We're keeping him. You can't have him. He's great. And then beside of him is our head of school miss Sally Bryant. We have a resolution. I think I'm going to ask Whitbridge to read it for us. Oh, you're going to have me read it. Okay. Thank you for being here. You all. Congratulations to the citizens Christian Academy girls softball team for winning the 2024 GIAA class A state softball championship ship and other purposes. Whereas citizens, Christian, Christian Academy girls softball team has established and maintained a proud tradition of excellence with equal emphasis on character and academics and whereas junior Gracie Giddens named the 2024 Class A. Class A player of the year and class A all state and district six all region honors and achieved an exemplary point five thirty batting average. That's crazy. Whereas freshman, Emma Gordley, both earning class A state state and district six A region honors finished a season with an exceptional batting average point at 0.539539541. And now therefore be a result by the House of Representatives that members of this body congratulate the citizens Christian Academy girls on their state championship. Thank you, Mr. Speaker. Please give them a round of applause. Congratulations. That's quite the accomplishment. We also have to our left. We have the Douglas Colpy County Chamber ambassadors. You all stand up. These are our leaders in our community. Thank y'all for being here today. They'll be in capital one two three. If you want to go see them. Thank you so much, Mr. Speaker. I yield the well. Thank you. Good group from South Georgia here. Thank y'all for making the effort to be here. Douglas and Coffee County are important part of our state. They're a lot going on down there. Appreciate it members. Members, if I can have your attention again, we're going to take a pause from morning orders. You know, we have some great leadership for Georgians here at this house. I'm appreciative of every day of the leadership of this house over the years and what it means to the great Georgians making a better Georgia. Now we have another Georgian who's making a difference for this country. And that distinguished person is here with us today. She's come home to Georgia from Washington to address this morning. A member of the president's cabinet, Kelly Loffer has been was confirmed last month as the 28th administrator of the US small business administration. Pretty important to Georgia. No doubt about that. I think all aware of it. Let's do it again because it's important. She is an entrepreneur and executive of philanthropist and former US senator from my great state of Georgia who is dedicated with three decades during her career to grow in businesses and advancing economic opportunity for all. There's no doubt. No doubt that she will continue to champion these policies in this new role. She cares about her neighbor as Mac talked about this morning. Ms. Loffer, congratulations. Kelly, if I may. On your appointment to serve our nation, our newest administrative of the SBA and welcome home to the people's house right here in Georgia. Come talk to us for a moment.\n\nThank you. Well, good morning. esteemed members of the Georgia State House, I am truly honored to join you as President Trump's Administrator of the US Small Business Administration following my confirmation and swearing in less than two weeks ago. I'm so grateful to Speaker Burns for allowing me the opportunity to be here with all of you today and for the support of so many of you following my confirmation. I'm so grateful that Governor Camp offered me the opportunity to enter public service in 2019. Thank you all for your outstanding work during this session as you fight to improve the lives of all Georgians and to drive our state's economy forward. It's so exciting to be here in my home state and to offer an update on what's going on in Washington as I work alongside President Trump to help implement his America First Agenda. Now, we've got a big responsibility to tax payers. We have a lot to do. We're off to a fast start. So let me give you a quick update on small businesses. Today there are over 1.2 million small businesses in our great state across Georgia. They make up 99% of all of our businesses and they create two out of every three new jobs across our country. It's clear why they're called the backbone of the American economy. Now y'all may know I moved to Georgia in 2002 to work for a startup company and I spent nearly two decades helping grow that into a Fortune 500 company worth $100 billion that today employs 15,000 people. And that's just one example of the power of pro-growth policies that help power the opportunity for millions of Georgians. Now I suspect that our state is so successful because so many of you have been small businessmen and women yourselves. Not only are you public leaders and public servants but you've walked in the shoes of our entrepreneurs from agriculture to technology and you understand what it is to be a risk taker, a job creator, an innovator, and a taxpayer. So let's be real though, small businesses have had a tough four years from record inflation to unprecedented regulatory overreach. So I really applaud your efforts to undo that pain from cutting taxes to eliminating red tape and advancing toward reform. Your work is clearing away burdens that these small businesses face that crush opportunity and growth. And so you're laying the groundwork for future economic opportunity that will help us thrive and make no mistake, we have an unprecedented opportunity right now at this time. It is to revive the American dream and that starts on Main Streets from Bainbridge to Blair'sville. That's the spirit I have taken with me to Washington DC as the only cabinet level position advocating for small businesses and that's the source of my day one priorities at the SBA. And each priority is really focused on restoring our founding mission for the SBA which is to empower small businesses and to grow our economy. That means supporting President Trump's America first agenda, eliminating wasteful spending cracking down on fraud, cutting red tape, responding to disasters and restoring accountability. And I'm so proud to work with Doge to root out waste, fraud and abuse to implement President Trump's executive actions to eliminate divisive GEI, gender ideology and the Green New Deal. Consistent with President Trump's workforce optimization, we've mandated that SBA employees return to work in office full time. We know that small businesses show up and get it done every day and we will honor their jobs by doing ours. Importantly, America must end our reliance on foreign supply chains from countries like China and that's why I'm getting to work on Made in America. The vast majority of our manufacturers in America are small businesses. They need our support but we cannot be there for them if our programs don't work. That's why we're cracking down on fraud. Nearly 200 billion of pandemic era fraud remains that the last administration failed to prosecute. We're going to hold criminals accountable. We're also banning illegal aliens and hostile foreign nations from benefiting from SBA programs and only American citizens will have the benefit of our services. I've also announced that we are moving SBA offices out of sanctuary cities and into those that comply with federal law. We're also unique in utilizing a role that we have at the SBA to work across all agencies to eliminate regulation and cut red tape to put America first. Finally, we're ending all voter registration programs within the SBA, reversing the previous administration's order that turned our federal officials into voting activists. Finally, but not least, I want to highlight SBA's important role in disaster assistance. Our agency is on the front lines and I saw firsthand the devastation after the hurricanes last year. We have been there for Georgians for the last 159 days and September 25th with 27 field centers and 108 staff here in Georgia. We've dispersed almost $100 million to thousands of Georgians. We also have three year round full time offices in this state and dozens more across the country. As I conclude, I can assure you that Georgia is well represented in the Trump administration. In fact, the A secretary Doug Collins and I recently had the opportunity to co-host round tables for our nation's governors at the White House. I'm so energized by this important work and I'm confident that with President Trump's leadership, this administration is delivering a golden era of opportunity for Georgia across our main streets and all across America. Thank you so much for the honor of being with you today with the help of great state legislatures like this one. I have no doubt we will make Main Street great again. Thank you and God bless you. We appreciate your work and your right. This body is focused on disaster relief and what we can do and we appreciate your efforts. I absolutely agree that small businesses are the lifeblood not only Georgia but of this country. Here's the perfect pick to be in this position and we look forward to witnessing your work and seeing the difference you're going to make because you are a different maker. Thanks for being with us this morning. Members, if you will come to the chamber, take your seats. We have another very important. This is an invite resolution coming up, Mr. Chairman. We have some important guests with us. I want to thank the members. If you will come to the floor and give Chairman hatch at your attention, you know he hasn't passed a budget yet. Members, we are about to read House resolution 415, 415, not quite yet, Mr. Clerk. Members, if you have conversations, you need to take them out to the back of the chamber or to the any rooms. We have a quiet and historic event that's occurring in Georgia. And this House needs to properly recognize and honor this great Georgia company. Okay, members, we have some guests that are leaving to South Any Room right now, so we'll give them just a moment. Doorky for the South Any Room. Would you please allow our guests to exit? Thank you. Mr. Clerk, will you read the resolution? House resolution 415, Mr. Clerk, will you read the resolution? House resolution 415, by the represent of Hatchet of the 150th Burns, the 159 Jones of the 47th, but you believe the 141st, perchette of the 176th and others, a resolution recognizing and commending Delta Airlines on its Centennial anniversary and for other purposes. Whereas on March 2nd, 2025, Delta Airlines will celebrate 100 years of operation becoming the first United States airline to reach the Centenarian milestone. And whereas Delta Airlines was founded on March 2nd, 1925, as Huff and Delaund dusters the world's first aerial crop dusting company. And whereas operating as Delta Air Service, the airline first passenger flights took off four years later and Delta established Atlanta as its headquarters in 1941. And whereas today Delta maintains a team of 100,000 people who deliver a world-class customer experience on over 4,000 daily flights with Atlanta's Hartfield Jackson International Airport serving as Delta's largest hub. And whereas over the years Delta has grown alongside the state of Georgia and employs 36,000 Georgians while connecting the cities of Albany, Augusta, Atlanta, Brunswick, Columbus, Savannah, and Val Dosta to destinations around the world. And whereas Delta's world-class connectivity strengthens Georgia's position as the top state for business and contributes to the state's economic vitality. And whereas with over 900 peak day departures to more than 200 global destinations, Delta connects thousands of people around the globe to and through Atlanta daily. And whereas Delta continues to build on its longstanding commitment to Georgia, maintaining dedicated partnerships with the state's education pipeline from K-12 schools to the University System of Georgia and the technical college system of Georgia to produce the next generation of aviation professionals within the state. Now therefore be it resolved by the House of Representatives that the members of this body recognizing, recognize, and commend Delta Airlines upon the grand occasion of its Centennial anniversary and celebrate its century of excellence, innovation, and service. Chairman Hatchett has recognized to speak to the resolution and introduce some guests. Chairman Hatchett. Thank you Mr. Speaker, colleagues. It is truly Delta Day today. How about that? No, it is a great honor to recognize such an important part of this state. And that is Delta Airlines and congratulate them on their 100th anniversary. For those of you who don't know, you heard that they employ 36,000 Georgians. They are the largest private employer in our state. You may not know, I spent a little time there. I spent six years in various roles with Delta. And one of the greatest stories that always like to tell people is that I'd go home and remember Lawrence County has about 50,000 residents. And I'd always get, hey, do you know so inside? And I'd go, do you know that Delta has more employees than we have in this whole county? So it was always fun. I got some other stories, but I'm not going to bore everybody with those. But I want to recognize, I will recognize the CEO, I want to recognize the others that are here. Peter Carter, raise your hand. I want to recognize you, David Jeffman, Katie Childers, Berger Lexanian, and a very special guest, Harold Bevis. I've known Harold. Harold I don't know if you know this, but I've known Harold for 35 years. I'm here because Harold didn't hire me to work in his department. But I got reacquainted with him when I came back. But Harold was employed with Delta Airlines for 55 years. That's huge. Let's give Harold a hand. Now I'll turn the mic over to Mr. Ed Bash in the CEO of Delta Airlines. Well, thank you, Matt, and Mr. Speaker, thank you for this great honor. And thank you to all the members of the Georgia House of Representatives for having us here today. And on behalf of the 100,000 Delta employees around the world, including, by the way, I think you're going to need to update the resolution until we have 37,000 employees who live and work here in the state of Georgia and call it home. It's a real honor to be with you today. 2025 is indeed a very special honor for Delta as we mark our Centennial anniversary. And we are excited. I think you all should be very excited that we are the first U.S. airline to hit that milestone. Quite a good Georgia company leading away as always. Can you imagine 100 years ago yesterday when this company was started in Macon as a small crop dusting company has turned into one of the world's largest airlines with the largest customer base of over 200 million, I believe personally, and I know many of you do, the very best airline in the world. And we're proud to call Georgia home. Georgia's strong, pro-business climate created by the leadership in this room. And all of you that work across with us, a state, is one of the key reasons why Delta has thrived since making our headquarters here in 1941. And we wouldn't be here without all of your support for everyone that you do for Delta. And I also know that many of you are loyal Delta customers as well as representing us. So thank you for making us your airline of choice. As you heard in the resolution, I'm sure you're pleased to know that we've fully restored our flying back to pre-pandemic levels, including service to all of Georgia's regional airports, including Albany, Augusta, Brunswick, Columbus, Savannah, and Valdosta. And this summer, we expect to operate our largest ever summer season out of Hart's Field Jackson. Earlier this year, Delta was named North America's most on-time airline by Serium for the fourth year in a row. The top US airline by the Wall Street Journal, making it seven out of the last eight years as the top US airline. And number 11 on the world's most admired list of all companies, not airlines, all companies in the world, number 11. Now, these achievements do not happen by chance. They come as a result of the great work of tens of thousands of Delta employees, as well as thousands of partners that we have that we work through our communities in the US and abroad. And this centennial is our opportunity to look back at our great legacy and recognize the help that so many have given us. So as we approach our first year as a centenarian, we're going to use this moment to fuel our climb and ensure that we keep climbing for all of you. Thank you. It's a great day to be here with all of you. Thank you for all that you do to make this possible for Delta Airlines. Thank you. Thank you. Thank you for all that you do to make this possible for Delta Airlines. Thank you. Thank you. Thank you for your attention. I'll be a little bit nervous. And thanks to you and your team at Delta and individually, you've been recognized as a trustee of this great state of Georgia. Congratulations on that great honor for you personally. And we have any number of iconic names that are associated with Georgia. And I think when you see those names around the world, what's the next thing that pops into your head, Georgia? When you see Delta, what do you think people around the world think of? This great state of Georgia, we are very, very proud that this is Delta's home. We appreciate of what you'll do for our state, all the great partnerships. We appreciate you all being here today. Thanks for the welcome. Another hundred years. Congratulations. Thanks. Harold, maybe you and I'll be around for them. What do you think? Thank you, members. Thank you. Thank you. Thank you. Thank you, members. We'll move back to our morning orders. I want to remind you you have up to two minutes. Representative Hilton, Reeves Cooper and Silcox. A great group of members here. Thank you, Mr. Speaker. What a wonderful day down here at the Capitol. We've got a lot of women here today. That means we're going to run this place efficiently. I know that. For these Canadian move. That is one day because we've got the Red Bull goose and tender and the six children. to women lead right. Thank you ladies. Representative Gamble and Representative Bonder recognized for a morning order. Give the gentleman your attention, please. They're going to talk about an important friend of ours. General recognized. Yes, good morning colleagues. Today is Taiwan Office of economics and cultural office in Atlanta. It's their day at the state capital and in in Room 230 from one to three PM Director General Elliott Wong will be there hosting this event for all members We have a Taiwan caucus that I want to encourage you to join because Taiwan is the US's eighth largest trading partner And in the US the US is Taiwan's second largest trading partner with an estimated 128 billion worth of trade Taiwan was Georgia's 15th largest import and 17th largest export market in 2023 and one last thing I'll close with this when Hurricane Helene hit our our state The Taiwan government donated 200,000 dollars towards the hurricane Helene Relief here in our state and we are very grateful for that. So please stop by and visit our friends from Taiwan this afternoon from one to three and capital room 230. Thank you Chair recognizes representatives Reese and representative Jackson for a morning order Chair recognizes representative Stinson for a morning order Chair recognizes represented a bant Smith and the Columbus delegation for a morning order Thank you Madam Speaker Glad to have other members of the Columbus delegation. We were tickled to have a third grade class from St. Mark's school in Columbus Georgia today. I'm St. Luke. Excuse me. St. Mark St. Luke's school. Just seeing if they're paying attention We were glad to have them. They went in the gallery for just a few minutes and You don't have to stand up and welcome them But we just want to acknowledge them their downstairs and we're going to visit with them a little while at lunchtime So thank you all very much for being a courteous to them. Thank you, Madam Speaker Chair recognizes representative Reese and representative Jackson for a morning order Good morning, Madam Speaker. I thought the boss the voice sounded a little bit softer. I was I was out of the room when the switch happened, but thank you, Madam Speaker Yes, please this morning we are here to acknowledge Jack and Jill of America As everyone recognize we've had a very very busy morning, but you may have seen hundreds of young kids in pink and blue and black suits walking throughout the chambers and throughout this building And rest assured they represent some of the brightest Children that we have right here in the state of Georgia Jack and Jill has over 100 members here today and they also have the national president with us here today Miss Darleem McGee, Whittington We have 271 chapters nationwide and over 50,000 families that engage in Jack and Jill So if you will, please join me and give and Jack and Jill of America a round of applause for their presidents with Presence with us here today at the state Capitol You Chair recognizes representative Stinson from morning order Good morning and thank you, Madam Chair Today is a beautiful day the state of Georgia. We have all the beautiful ladies and pink here today as we recognize Rain over Cancer Rain over Cancer. You will please stand Rain over Cancer is a non-procure organization working to Beat cancer and we thank Rain and her team of folks that are working so hard to bring awareness to breast cancer and all the other cancers That are that are that it's this so I want to hear from representative Derek Jackson right quick Thank you, Rain. Thank you, and we have to continue to fight this cancer all forms of cancer. Thank you for being down here And with that we we get oh And with that I want everybody to know next Monday is my last day of radiation Next Monday next Monday my last day of radiation. Yes Thank you. Thank you, Rain. Thank you You We're onto the rules calendar the chair recognizes Representative gains what in just a moment clerk will read the caption to House bill 296 House bill 296 House bill 296 by rep. of gains to be entitled and act to amend article 2 chapter 5 of a title 40 of the fish Dakota, Georgia annotated relating the issuance\n\nInspiration and renewal of driver's licenses shows provide the presentation of a driver's license in a certain electronic Orman satisfies the requirements to possess the driver's license this bill ever further committee Motor vehicles that committee recommends that this bill do pass by committee substitute Chair recognizes vice chair gains to present the bill Thank you madam speaker House bill 296 will as a business or consumer friendly bill for Georgians We already have over 420,000 Georgians who use a digital driver's license What this bill does is if pulled over by a law enforcement officer it would allow Georgians to present their digital driver's license It's a very simple process to get a digital ID You put in your information that Department of Driver Services can quickly verify that and you have it on your iPhone Android TSA already allows digital driver's license when going through the TSA security line the technology is already there on this But we are going to allow two years for law enforcement to have all of its equipment ready to scan these I will make an important note that drivers would not have to physically hand over their phones so that Law enforcement officer wouldn't have to take it back to their vehicle It'd be tapped to touch technology like if you go to the Store and you buy something and you use your Apple wallet to tap to touch on your phone now It would be a very similar technology where they can verify your information with your digital driver's license We passed this bill very similar 168 to one last year represent Clay Park will Carried it at that time and managed to get happy answer any questions There are questions the chair recognizes representative cannon for a question Thank you madam chair Do you use I do just a question about line 26 if I'm looking at the correct LC number it says it for For voting you would have to have a physical form of your driver's license I didn't hear you speak to that part of the bill. Can you adjust that sure? That's not a change in current law or how the process currently works There you'll notice throughout the builders a couple different whether it's hunting and fishing license or on At the voting booth those agencies are not quite ready And that's why that's included. Okay, do you further you know? Sure? Why would you say that our state's not ready to do digital ID for voting? poll workers don't have the technology to verify the digital digital driver's license Whereas law enforcement does have that technology Do you further you? Sure, what is that technology that that department doesn't have and how much would it cost to get it to them? I don't have that information, but I can tell you law enforcement officers when they're they're able to Verify those digital driver's license with a scanda for tap to touch technology whereas poll workers Yeah, I wouldn't have that technology yet Chair recognizes chairman Corbett for a question Thank you matter speaker. Does the gentleman you I do is it not true that this bill includes privacy safe guards to ensure officers can only access the information Necessary for verification. Yes, sir It is not true that this bill should be known as the Clay Perkel British bill of 2024 that that is true There are no more questions. Thank you, Madam Speaker. Are you the well? Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any question any objection to adopting the committee substitute the chair here's none the committee substitute is adopted? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here's none the report of the committee has agreed to shall this bill now pass all in favor of the passage of the bill Although yes all those opposed will vote no in the clerk will unlock the machine Have all members voted For what purpose does representative Campbell rise Thank you madam speaker is it not parliamentary inquiry? stature inquiry Is it not true that online one of six of this bill it requires law enforcement officers to acquire equipment capable of verifying a license issued in an electronic format and we could Have included such a line for voting if we had chosen to do so Sure the lady knows of what she speaks have all members voted If so the clerk will lock the machine on the passage of the bill the a's for 154 the nays of 17 the bill having received the requisite constitutional majority is therefore passed Clerk will read the caption to house bill 358 house bill 358 House bill 358 by rep. Smith of 138th and others to be entitled an act to amend code section 2 1 7 the fiscal to Georgia and Tater relating and prohibiting the acquisition of possessory interest in certain land by foreign persons and entities This bill I'm for the committee on judiciary that committee recommends the dis bill do pass Chair recognizes representative Smith to present the bill Thank you madam speaker House bill 358 is a definition only this bill came through the rules of judiciary committee Thanks to the chairman and the committee members it lines 10 through 12 strictly a definition of military installation We've had legislation passes body in the past and this is just for clarification on some that legislation So with you without any questions might I speak about it past for your favorable consideration? You have a question. Yes, ma'am chair recognizes representative owl for question To your left. Thank you madam speaker in the back You'll back here Yes, yes ma'am Two questions First I understand that this is an extension of a bill we passed last year, which was SB 420 correct precludes What determined to be agents of hostile foreign governments from buying certain types of property with this extension of the definitions have you actually tabulated or mapped the number and the locations of the new facilities that would be included in these definitions? No, ma'am. I don't I could get that but I don't have it with me The reason I ask is because if you are precluding 10 mile radius from each of these new facilities which in my reading could include a storage facility housing a filing cabinet for a Coast Guard personnel that seems to include a lot more land That question The second question will the gentleman further yield yes ma'am. Thank you The second question regards the original legislation to which this is Extending Which is do you agree that state agencies are not equipped to identify who would be an agent of a foreign government And therefore the Downside effects of this original legislation and extending its effect Could pose discriminatory effect on Individuals seeking to buy property from certain areas of the world I think state agencies are probably well equipped to identify who these body and people are Will the gentleman further yield yes ma'am from one I was a state agency resource to investigate who is an agent of a foreign Government You're going to repeat that I couldn't understand you. I was saying how is a state agency equipped to investigate who is an agent of a foreign government I think they'd have the capabilities of using any means to make that out of the identification All right. Thank you so much. I will be ready. No one this bill. Thank you Thank you, Matt. I'll speak out you all the well and ask your favor consideration The gentleman is yielded the well Is there any objection to the previous question being ordered the chair here's none the previous questions ordered? Is there any objection to agreeing to the report of the committee which Was favorable to the passage of the bill the chair here's none the report of the committee's agreed to show this bill now pass All in favor of the passage of the bill will vote yes all those opposed will vote no in the clerk will unlock the machine You Have all members voted If so the clerk will lock the machine on the passage of the bill the a's were 120 the nays were 50 the bill having received the requisite constitutional majority is therefore passed Clerk will read the caption to house bill 89 House bill 89 House bill 89 by ropes and a Cooper the 45th to be entitled next to men chapter 2 a total 31 of the physical to Georgia annotated relating to the department Public health so as a require health care providers health care facilities and pharmacies To provide the maternal mortality review committee with psychiatric or other clinical records is bill ember from Birds the committee on public and community health that committee recommends a disbile do pass by committee substitute Okay The chair recognizes chairman Cooper to present the bill Thank you madam chairman Members of the house I bring to you today the substitute to house bill 89 Across our state in working to improve uh our standing and prevent maternal mortality cases in our state We are establishing regional parental uh care centers and what the bill does is sets up a committee that will look at these centers Will set parameters for how they function in order to make them more cohesive and we will Establishing hopefully more of them across our state it also It specifies who will do autopsies when there is a maternal death because there was some question of whether it should where it should be the body should be sent And it is also we have had a problem When my mother has died After a delivery that getting psychiatric information about them People and physicians and hospitals have been very reluctant to give us that information and it is essential To knowing The cause and what happened to him and seeing if they're psychiatric disorder or how what they were betraying for Was any cause that is how the bill does and if there are no questions Madam speaker i will yield the well There are no questions and the lady has yielded the well the chair recognizes Representative canon to speak to the bill Thank you madam speaker here to speak in support of this measure Why did you just really address what we know is that we have to do things differently here in Georgia as it relates to maternal mortality Many folks remember last legislative session We spent a number of our days here sharing statistics and sharing stories of people who had passed away and also sharing ideas Many of these ideas here really talk to the social determinants of health Not just if the issue was a pregnancy related death or a pregnancy associated death But really gets to the social determinants of health. I'm really happy that we have included transportation as an issue You'll heard me speak to this just a few weeks ago We had to get somebody in uber to alabama from Clayton County in order to get some health care resources that she need She needed at that time because of her Extinuating circumstances with her pregnancy and in real time I think what we're learning with the maternal mortality crisis is we cannot continue to ignore that it is happening Disproportionately to black women We have to in fact lean in and say that it's not only black women But it's rural women and it has to do with transportation and so I'm just super grateful that this bill is moving forward I would ask for your support And I'd also ask that everybody lean into the department of public health Annual review that happens we passed a lot of years ago that said that they can't be any more than two or three years behind on their data And so they have been publishing these reports We typically get one on our desk every year And we've created a bit lead to make it easier for the public to access that information as well that report is at bit.ly slash mm report g a and bit.ly slash g a maternal mortality I didn't want to speak to you really kind of awkward moment that happened in George's history with the maternal mortality review committee Which was that there were a number of individuals who were serving on that committee from more house school of medicine You know who even started the committee doctors of public health from Grady hospital And they were all disbanded at one time this year Meaning that there were no members who were serving on that maternal mortality review committee And so we did ask for an amendment to say that ultimately that the mmrc if we were opening up the code to talk about the mmrc Why don't we include something that says that the mmrc could never be bare that the mmrc should always have members on it Regardless of the circumstance and unfortunately that amendment was not included here But I do think that because we're talking about the maternal mortality review committee We have to continue to pour in resources like this paranatal Regional commission that's being started and so we hope that for those members who are Currently disbanded from the maternal mortality review committee that they will possibly be put onto this committee because They didn't they were actually found to not have done anything wrong They couldn't find anybody who actually did anything wrong And so hopefully they will be Appointed to this new commission and even if not we're hopeful that those who have applied to be reinstated or to become new members of the mmrc Will able to be put on that committee. Thank you Madam Speaker. I yield the well The lady has yielded the well for what purpose does chairman Cooper rise? I wanted to ask the gentle lady as she would respond to a question The lady has yielded the well Lady waves is there an objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection to adopt in the committee substitute the chair here's none the committee substitute is adopted Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair Here's none the report of the committee has agreed to Shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock the machine The Purpose to his representative McQueen rise Parliamentary include state's ring quarry is it not true that without a full picture of the medical and mental health challenges faced by Black mothers and rule Georgia our state cannot craft effective policies to reduce Mental mortality and that this piece of legislation is a necessary step in closing this dangerous information gap Sure the lady knows what she speaks for what purpose does representative Osteen rise Parliamentary inquiry state your inquiry Madam speaker is it not true that house bill 89 builds upon Georgia's ongoing efforts to address maternal mortality by enhancing data access Improving perinatal care oversight and ensuring a more comprehensive approach to preventing maternal deaths To the lady knows of which she speaks and what for purpose does chairman Cooper rise? Thank you Madam chairman Is it not true? We already have a new maternal mortality Group meeting they met last week and they are functioning and everybody that has been appointed to them and they represent people from all areas and specialties related to mortality deaths and is it not true That the reason we had to have a new committee is that when you are dealing with this type of death It is imperative that Information about the death is not shared with anyone Except members of that committee and unfortunately someone did They would not own up to what they had let out about the committee and unfortunately No one would tell anyone what had happened So it was felt by the governor and the commissioner of public health that we started over again With a new committee for fresh eyes on this problem and it is functioning and working Thank you very much sure the lady has the information of which she speaks have all members voted If so the clerk will lock the machine on the passage of the bill the a's were 168 the nays were seven The bill having received the requisite constitutional majority is therefore passed Thank you madam pro-tum Mr. Clerk will you read a caption to house bill 186 186 House 186 by represent of Ridley the 22nd to be entitled back to men code section 485c One of the physical to Georgia annotated relating an alternative ad valorem taxation of motor vehicles and title ad valorem tax fee This bill happened for the committee and ways of means that committee recommends a dis bill do pass Representative Jordan Ridley is recognized to present the bill representative Ridley Thank you mr. Speaker Today I stand to present house bill 186 It's only 20 lines long all we're doing is eliminating the death tax on automobiles to help people in a time of morning When they just lost a loved one their immediate family doesn't have to pay a tax on inheriting that automobile and with that I'll yield for questions Gentlemen has no questions. Thank you mr. Speaker. I hope for your favorable consideration Gentlemen as yielded the will is there an objection to the previous question being ordered Here he none the previous questions ordered is there an objection to agreeing to the report of the committee Which was favorable to the passage of the bill Here he none the report the committee is agreed to shout this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed will vote no and mr. Clerk will you unlock the machine You Have all members voted For what purposes represent Sharper rise Keyways Have all members voted all members voted if so mr. Clerk were you locked the machine On the passage of house bill 186 the yeas are 171 the nays are zero This bill here to see the requisite constitutional majority is therefore passed Mr. Clerk were you read the caption to house bill 290 House will 290 by represent of Carson the 46 and others to be titled back to men chapter 171 Top 4080 the fish go to Georgia and it's Eddie relaying the general provisions of revenue and taxation so it's revised the term Internal revenue code and internal revenue code of 1986 This bill that my birth committee on ways of means that committee recommends that this bill do pass The gentleman from the 46 representing John Carson has recognized to present the bill ripthane Carson Thank you mr. Chairman House members that bring to you our annual internal revenue code update house bill 290 all this really does is make sure that we're That our title 48 in regard to income taxation is in sync and as much as possible with internal revenue code In effect for 2024 it has a very minimal impact of a Potential revenue lost to us of about seven hundred thousand dollars for 2026 and that really has to do with There was two changes made at the federal level one in regard to VETT or VSO or veteran service organization Equal tax treatment acts these are 501 c19s in regard to the grants that they received and the second is in regard to The federal disaster relief act, but the disasters covered in that really don't affect Georgia one was in regard to wildfires And we haven't had once since 2017 and then the other is in regard to the East Palestine East Palestine Train Debrilment in Ohio so neither one of those would affect Georgia very minimal impact a number of accountants Are awaiting this update so we can start filing our taxes and with that mr. Speaker I'll yield for a question that if there's no questions I'll yield the will have a question to your live Represented Kelly is recognized for a question. Thank you for speaker with the gentleman yield. Yes, sir Chairman of course isn't it true by that aligning our state tax code with the federal tax code We're simplifying compliance calls and the times necessary for compliance for both the individuals and businesses across our state Absolutely absolutely representative gentleman knows what he speaks with that mr. Speaker I want to ask for the bodies favorable consideration and I will yield the well gentleman's yielded the well Is there any objection to the previous question being ordered period none the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill Here in another report the committee is agreed to shall this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed we'll vote no and mr. Clerk will you unlock the machine? Have all members voted All members voted if so mr Mr. Clerk were you locked the machine on the passage of house bill 290290 the yeas are 176 the nays are zero This bill has received the requisite constitutional majority is therefore passed mr. Clerk Well, you read the caption to house bill 327 327 House will 327 by representative lebert or the 123rd and others to be entitled and act to amend chapter 1 and title 7 of the Efficient go to Georgia annotated relating the financial institutions To amend chapter 6 be a total 10 of the official code of Georgia annotated relating the Georgia power attorney into amend Code section 59127 of the Efficient go to Georgia annotated relating to concurring jurisdiction with superior courts This bill haven't for the committee on judiciary that committee recommends a disbilled do pass by committee substitute Chairman lebert is recognized to present the bill chairman lebert Thank mr. Speaker ladies and gentlemen House bill 327 is basically the the sort of semi-annual or every few years The fiduciary law section of the state bar submits a rewrite built us that is primarily just clean up And and sort of changes due to sort of practice issues that have been located or determined by different practitioners This is it's high-voltage stuff ladies and gentlemen. It's just like the internal revenue code revision before you me This is the the section of the bar that deals with wills and trusts and probate and and testates exception So it's largely just administrative provisions kind of cleaning up Conforming sections of the trust code to similar provisions in the banking code for example So again really high-voltage stuff and I'm glad to stand to answer any questions you may have about any in the provisions of the bill Gentlemen has no questions Thank you mr. Speaker ladies and gentlemen. I would appreciate your affirmative vote for our hospital 327 Gentlemen as you are the well is there any objection to the previous question being ordered Here in none of the previous questions ordered is an objection to adopting the committee substitute Here in none the committee substitute is adopted is there any objection to agreeing to the report of the committee Which was favorable to the passage of the bill here in none the report the committee has agreed to Shout this bill now pass all in favor of the passage the bill will vote yes all those opposed will vote no and mr. Clerk will you unlock the machine You Shepherd Have all members voted all members voted If so mr. Clerk will you lock the machine On the passage of house bill 327 the yeas are 176 the nays are zero this bill haven't received the requisite constitutional majority is therefore passed Hey members also good news It's Monday. It's a great day to be a Georgian News flash On a witch camera. We're looking at which camera we're utilizing But today our own beloved chief of staff former member of this body Terry England stood up three times with no pain Thanks to a group of wonderful staff members at shepherds Thank you to you members. Thank you to Cindy, but thanks to the good lord. He's on the road back It's a great day to be a Georgian. It's a great day to be a friend of Terry England. I know y'all agree with me Thank you members mr. Clerk will you read the caption to house bill 413 413 House Before 1 3 by representative Jenkins 136 than others to be entitled and act to amend chapter 1 and title 2 of the fish go to Georgia and attend every lane in general provisions regarding agriculture So it's a prohibit local ordinances a prohibit the operation of mobile sawmills on agriculture lands this bill ever further the committee on agriculture and consumer affairs That committee recommends that this bill do pass For representative David Jenkins is recognized to present the bill mr. Speaker ladies and gentlemen Today I rise to present house bill 413 a measure that upholds the rights of our farmers and landowners While promoting economic development and opportunity in Georgia's agricultural industry This legislation ensures that mobile sawmills can continue to operate on agricultural land without unnecessary local restrictions as stifle innovation and productivity Georgia has long been a state that values and supports agriculture forestry and rural economic development mobile sawmills provide a valuable service by allowing landowners to process timber efficiently on site reducing Caused increasing sustainability and supporting local economies House bill 413 protects the rights of those who work the land by prohibiting local governments from enacting ordinances that ban the operation of mobile sawmills on agricultural property This bill is not about removing oversight\n\nabout ensuring that common sense agricultural practices are not hindered by unnecessary regulations. Landowners should have the freedom to manage and utilize their timber resources without interference and negatively impacts their livelihood. This legislation also promotes sustainability. Much of the wood that's processed in these mobile mills would either wind up in a landfill or be burned or otherwise go to waste. By allowing mobile saw mills to operate freely, we empower farmers, encourage responsible land management and create new opportunities for small businesses and rural communities. Colleagues House Bill 413 is a simple yet important measure to support Georgia's agricultural industry on responsible land use. It respects property rights, promotes economic growth, and reinforces our state's long standing commitment to agriculture. I urge each of you to vote in favor of this bill and ensure that our farmers and landowners can continue to thrive without unnecessary interference. With that, I ask yield for questions. Gentlemen, has a couple of questions to your left right down front? Will Park has recognized four questions. Thank you, Mr. Speaker. Does the gentleman yield? I do. So, you know, I'm always a little guarded with respect to undermining local control. So if you could help clarify a few things, I'd be greatly appreciated. Are there currently any local jurisdiction cities or counties that have passed and ordinance that prohibits these mobile saw mills? So, first off, this bill in no way affects local control. The Georgia Constitution empowers local governments to enact zoning and this doesn't affect that at all. I refer to line 35 and 36. Basically says this coach section shall not prohibit or empower, in pair, the power of any local government to adopt or enforce any zoning ordinance or make any other zoning decision. What that means is, basically, our local governments can decide where we farm. They control agricultural zoning. But if they say that we can farm, then we can farm. The state does prevent local governments from dictating agricultural practices on animal husbandry, crop rotation and other things. But they can decide where we farm. Were you yielded from one more question? Sure. Could you help clarify and appreciate the conversation and the education? Yes. Could you help clarify where ACCG and GMA are in the bill? Are they neutral? Were they supportive of the program? I would say neutral. I informed ACCG. I did not talk to GMA about, actually, I did talk to GMA as well and they didn't provide any input. Thank you so much. Jim, I'd further yield. I do. Let's see, Jeremy, it lends me a thought the scenario to your right is recognize for a question. Thank you. First of all, Jim and yield. I always would yield yield yield. So first of all, is it not true that we're seeing in the news now and understanding that far as fires are now becoming more of a problem in the whole eastern part of the United States? Is it further not true giving these owners this opportunity to have this practice? We in fact are preventing far as fires as well as other good husbandry. Thank you. We absolutely are. We're removing rubbish and creating something that people can buy and use and making products out of it. To your left representative, Jasmine Clark has recognized for a question. Thank you, Mr. Speaker, to the gentleman yield. I do. So I think this is a follow-up to Mr. Whip's question. In particular, I would love to know where this idea came from. Was there an instance where someone tried to prohibit a mobile saw mill from operating on private property? There have been instances where people have tried or local governments have tried to prohibit these from operating on private property. And I'll just tell you where I came from, I grew up on a small farm. I have a small farm now. My family's land was right on the outskirts of Peachtree City and what I found so often is that although the community thrives on the green space as we create and the clean air that we help them breathe, sometimes they don't understand our business practices and it becomes hard to do business in places like that. So I think that's kind of what we may have seen with that. Again, this just clarifies it as an agricultural practice. So if they decide that there will be farms there and again they have the power to do that with their local zoning, then that farmer can farm. And does it give my further yield? Yes. So if this is happening now and you're saying that they cannot, we are going to preempt them from saying you can have mobile sawmills but they can do zoning. Is there any concern that then these local municipalities will just say, well then you cannot have farmland here? So they do control agricultural zoning. I would say, you know, and that's a legal question about zoning. Once you have zoning, changing your zoning usually requires the property owner to be involved in that or at least be able to dispute it. So if someone has agriculturally zoned property that they're farming, you know, that's a process to take that zoning away from someone that's using it. I will say that in the metro area, they tend to be very stingy with that zoning because it is quite permissive. It allows farm activity to occur and typically affects setbacks and heights of buildings and a lot of other things that they grant. So it's typically a very they're not very permissive by granting it. All right, so there's a general mediocre one final really good. We have several questions now. Sorry, this is very quick. So if the, if this bill basically says you cannot stop some from using a saw mobile sawmill and you've said basically even if they do have the ability to pre-zoning, it's very unlikely that they would stop someone from having an agricultural zoning. Does this, is this not a preemption bill? I don't follow how that would be a preemption bill. If they, if they, if the state of Georgia doesn't allow local municipalities to to dictate agricultural practices and we convey zoning to local governments, we've changed nothing. We've just clarified what that's an agricultural practice and they can zone and we can, we can dig, dig or clarify our state law on what an agricultural practice is. All right, thank you so much. Thank you for the questions. The gentleman yielded Chairman Tarvan to your right in the back. That's a question. Go ahead. Jim Maniel. You may have answered this, but some of these mobile sawmills may be able to be pulled behind trucks even. They work off a bandsaw system, I believe that's correct. That's correct, and that's what this applies to. The bill actually specifies trailer mounted and that's essentially an effort to address scale. Commercial sawmills have, you know, they have equipment to unload and offload and handle the waste and such as that and this basically addresses scale. Follow up, follow up question. Wouldn't this be true that a small to medium-sized farm in the cases of the hurricanes and winds we've had would enable them to clean up their land, get started back quicker than having to haul and back and forth the sawmill and make it more profitable for the farm in landowner. It absolutely would. Thanks, sir. Gentlemen, you for another question. I'll yield for one. Representative Joe Campbell's had his wrecked his button pushed to your right. Representative Campbell. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Is it not true that HB413 protects Georgia's farmers in landowners by ensuring they can use mobile sawmills on their property without unnecessary local restrictions? You got it. That's it. Thank you, sir. Thank you. And with that, Mr. Speaker, I yield the well. The gentleman's yielded the well. Is there any objection to the previous question being ordered? Here, he none of the previous questions ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here, he none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? I have all members voted for what purposes represent a train, Ross. Parliamentary inquiry? This is State's inquiry. Thank you, Mr. Speaker. Is it not true that this past weekend we had 137 wildfires burning across 2400 acres? I'm sure the gentleman knows of what he speaks and I think this bill has an effort to take away some of that fuel. For what purposes represent the huddlestone rise? Parliamentary inquiry, sir. State's inquiry. Mr. Speaker, is it not true that HB413 upholds George's long-standing commitment to supporting agriculture? I'm sure the gentleman believes that and he knows it to be true for what purposes represent a park, can I not rise? Parliamentary inquiry. State's inquiry. Is it not true that mobile sawmills release carbon that stored in trees back to the atmosphere? You and people live with that lumber too and certainly I think part of the question, a lot of things that some questions don't I think are grandfathered in if it's existing use. What purposes represent Jordan Ridley rise? Parliamentary inquiry. State's inquiry. Mr. Speaker, is it not true that this bill simply prevents local governments from enacting unnecessary bans on mobile sawmills while still allowing for reasonable oversight and safety regulations? I think the gentleman's correct. He knows what he speaks. I think all members have voted. All members have voted so if you will Mr. Clerk, will you lock the machine? All the passage of House Bill 413, the yeas are 162. The nays are 13. This bill, Henry C. The Rick with the Constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 416, 416? House Bill 416, I represent an administration of the 104th and others to be titled NAC2MEND, chapter 88 in title 36, the fiscal to Georgia annotated relating enterprise zones as soon as revised. The class of retailer from which fees may be collected, this bill haven't referred to the committee on governmental affairs, that committee recommends that this bill do pass by committee substitute. Chairman, administration, excuse me, leader, administration is recognized to present the bill. Mr. Leader. Here, ladies and gentlemen of the House, I bring to you today House Bill 416. Several years ago, I carried a bill to create what are called enterprise zones, specifically with an eye toward downtown Atlanta there around what was the Georgia dome and is now Mercedes-Benz Stadium. This legislation was utilized to actually create an enterprise zone that's an area with chronic undevelopment for 20 plus years and a commitment for a $400 million investment. Unfortunately, after the bill was passed and signed into law, there was a delay due to local politics, the local council had to approve the project to move forward. House Bill 416, this before you today, is an effort to resolve these issues to ensure that we stick to the original timeline that was proposed when the General Assembly passed the original bill. And also, this bill closes a loophole that could allow businesses that do not operate within the enterprise zone from utilizing that classification. With the World Cup to begin in June 2026 with a real focus on a need to make sure that our capital city reflects just how great we all know it to be. I'd ask for your favorable consideration of HB 416. I'm happy to answer any questions. Gentlemen, has there questions? You'll do well. Gentlemen, as you were to the well, is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Shall this bill now pass all in favor to the passage of the bill? We'll vote yes. All those opposed will vote no Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 416416, the yeas are 172, the nays are zero. This bill, Henry C. The requisite constitutional majority is there for past. Mr. Clerk, will you read the caption to House Bill 378? House Bill 378 by Representative Montenegro of the 17th and others to be entitled, and act to amend our three chapter seven, the title 15 in the fiscal to George Anitett, relating to practice and procedure relative to the state courts of counties, so it's to provide for the online publishing of terms of state court. Ms. Bill, I refer to the committee on judiciary. That committee recommends that this bill do pass. Representative Montahan is recognized to present the bill. Representative Montahan. Thank you, Mr. Speaker and members of the House. Today I rise to present House Bill 378, a simple piece of legislation designed to enhance transparency, accessibility, and efficiency in our state courts across Georgia. Currently, the terms of court, those timelines that dictate when cases must be filed, tried, and resolved are often difficult for attorneys, defendants, and victims, and the public to find, in some jurisdiction, these terms are inconsistently posted, requiring individuals to call the courts office or appear in person just to obtain some very basic information. And this lack of accessibility can lead to misdebt lines and unnecessary confusion for all parties involved in the legal proceeding. House Bill 378 fixes this by requiring each state court court to publish and maintain the terms of court on a publicly accessible website. This is a common sense pro-transparency reform that ensures court schedules are easy to find eliminating unnecessary barriers to legal proceedings. Will that, Mr. Speaker, out here for a couple of questions if they're or any? Gentlemen, has a couple of questions here, yield? Reptile you home to your right, as recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Isn't it true that different counties have a term of court varies per county? And it's important for practicing attorneys like myself to know the term of court to follow crucial pleadings within the term of court? Yeah, that's absolutely great. The next slide, the legislation, aims to resolve. Thank you for the bill. I will give you one more more, Mr. Speaker. Reptile, can you move into your left? Is recognize for a question? Thank you, Mr. Speaker, yield. Does every county's clerk of court have a website in Georgia? Yeah, I mean, honestly, I would imagine they do. Not every county has a state court. So I guess if they want to have one, they would have one. So if they don't have one, are they going to create one? How does this bill impact them if they don't have one? Yeah, they would need to publish it. So the underlying language here says that they've got to post on a website. So they don't have one. They must be producing this information for the public and for practicing attorneys, but All right. Thank you. You're welcome. Gentlemen, has no further questions? Thank you, Mr. Speaker, are you the way? Gentlemen, is yielded the well? Is there any objection to the previous question being ordered? Hearing none of the previous questions ordered, is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none of the report, the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will, but nowhere, Mr. Clerk, where you unlock the machine. That's it, isn't it? All members voted if, Mr. Clerk, where you lock the machine. All the passage of House Bill 378, the yeas are 162, the nays are 11. This bill, haven't received the requisite constitutional majority, is therefore passed. Okay, members, we're getting ready to, as y'all see, we do have a supplemental calendar today. We're going to take a break and then come back. I'm sure all of you noticed what's on your desk. Is it on your desk, Mr. Chairman, the minted budget is on your desk. We'll take it up as soon as we come get back so we can have some of that outstanding budget for ourities to get out and help the Georgians. So we'll take it up as soon as we get back. If you have a page today, I'll meet you down front with your page as soon as we recess here, so we can take some page photos. We're going to recess until 130. But before we do that, don't leave. We have a couple announcements. Then we're going to have some privileged resolutions, representatives. Treyon needs to give us some information. That's important to us. Leader of the station, while he's coming, why don't you go ahead and for the sake of expedite the process, Deputy Treyon, if you'll stand down just from over. Leader of the station. Thank you, Mr. Speaker. There'll be a committee chairman's lunch in room 403 upon the break. Thank you. Thank you, sir. Deputy Treyon. Thank you, Mr. Speaker. Here at the CAV delegation, we have a meeting in room 502 upon adjournment. Again, that's room 502, the CAV delegation, and lunch is provided. Thank you, Mr. Speaker. Thank you, Representative Treyon. Mr. Clerk, will you read the capture to a group of privileged resolutions? Honoring the life in the curry of Maurey Burns, and recognize March 8th of 2025, is infant emergency awareness to a commending in the Macdonough High School Navy Junior Reserve Officer's training core, Wal-Hawk Battalion, recognizing historical significance of the 1911 Rand McNally, Map of Dawson County, commending Jack and Jill of America, recognizing historical significance of the 1911 Rand McNally map of White County, Georgia, recognizing commending La Shania Turner, commending a Laurie out to Wattsi III. Recognizing the historical significance of the 1911 Rand McNally map of Lumpkin County, Georgia, expressing support for families affected by premature worse. Congratulations to the Tomes County High School football team for winning the 2024 GHSA Class A Division I, state football championship, and commending the Miss Georgia Peeps Scholarship pageant and congratulating the 2024 Georgia Peach Queens, and for other purposes, that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? Here in none, the resolutions are adopted. Okay, here's our posture again. We're going to be in recess until 1.30 pm, 1.30 pm, then we'll take up the supplemental calendar that you'll have on your desk. Top of that list will be taken up the amended budget. So we have a little work to do this afternoon. I look forward to seeing you all back here at 1.30. Again, if you have a page, join me down front. This house will be in recess until 1.30 pm. Thank you members.",
  "updated_at": "2026-02-13T03:21:45.749617+00:00"
}