{
  "video_id": "9Bv01jEHgog",
  "url": "https://www.youtube.com/watch?v=9Bv01jEHgog",
  "title": "Joint Appropriations Special Session AM - January 20, 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 176,
  "summary": "Overview:\n- This was a Georgia Joint Appropriations Special Session on January 20, 2026. The session focused on the state budget and appropriations process, with Governor Brian Kemp providing remarks.\n\nKey Actions:\n- No specific bills were passed or referred to during this session.\n\nBills Introduced (First Reading):\n- No new bills were introduced.\n\nNotable Moments:\n- Governor Brian Kemp addressed the Joint Appropriations Committee in person, highlighting his administration's economic development efforts and the importance of responsible budgeting.\n- There was some lighthearted banter between the committee members about seating arrangements.\n- The session began with an opening prayer by Chairman Gerald Green on his 44th Joint Appropriations Hearing.\n\nVotes:\n- No recorded votes took place.\n\nAttendance:\n- The transcript indicates a \"full house\" for the Joint Appropriations Committee meeting.\n\nAdjournment:\n- The transcript does not explicitly state when the session adjourned or the date of the next session.",
  "transcript": "Jason Ridley. Does anybody sit next to you?\nMr. Leaders, there's a seat one seat down here.\nSomebody like to sit here.\nChairman Meeks.\nI feel like a Baptist preacher if there's a seat next to you,\nslide over so somebody can get.\nChairman Tillery, I've never seen this room this full.\nWell, I almost called you Senator Hatchett, they all come for you, Mr. Chairman.\nI don't know about that.\nGood morning.\nI think we need to try that again.\nGood morning.\nHey, everybody's awake.\nAll right.\nWell, thank you all for being here.\nThe Lord blessed us.\nHe brought snow this weekend.\nHe's going to bring snow coming up.\nSo we fit us in the middle.\nSo thank you.\nWith that, I would like to invite Chairman Gerald Green, Dean Green, on his birthday and his\nForty-fourth Joint Appropriations Hearing to Open Us in Prayer.\nThank you, Mr. Leader, our great appropriations, Chair.\nLet us pray, Almighty God, as we come before you today.\nWe come with humble hearts and grateful spirits as we gather in this place of public service.\nWe thank you for the opportunity to serve the people of the great state of Georgia, and\nfor the trust they have placed in us.\nAnd as we begin these appropriation meetings, we ask for your wisdom, your guidance, and\nyour discernment.\nGrant us clarity of mind and purity of purposes as we consider the resources entrusted to our\ncare. Help us to listen carefully, deliberate, thoughtfully, and act responsible. Always mindful\nthat every decision we make affects the lives of our citizens. Bless our governor and the\nmembers of the Georgia General Assembly and all who serve in leadership capacities in\nour state. Grant them courage, integrity, and spirit of cooperation. And may our discussions\nto be marked by mutual respect,\ncivility, and a shared commitment to the common good.\nGuide us to the wise stewards of the public trust.\nDo act with fairness and compassion\nand to seek solutions that strengthen our communities,\nprotect the vulnerable, and promote opportunity for all.\nWe ask your blessings upon the state of Georgia,\nupon its people, and upon the work we begin here today.\nMay I actions honor you and serve the best interests\nof those we represent.\nAnd we ask all of this in the name of our Lord and Savior,\nthe Lord Jesus Christ.\nAmen.\nThank you, Dean Green.\nAll right.\nWe got a full house.\nSo keep it to a little rumble, please.\nWell, as you know, last year we didn't get to have these because of Mother Nature.\nBut luckily we are this year.\nIt's going to be a long three days, they're packed.\nThere may be times when we don't allow you to ask your question because we need to move on.\nAnd I'll go ahead and apologize for that in advance.\nBut we got a lot to hear from a lot of people, a lot of very important people in the next\nthree days.\nSenator Tillery, anything?\nWell, first of all, welcome again to the joint hearings.\nAs Chairman Hatchett said, last year we did miss these because of snow.\nThose of you who aren't involved in the leadership appropriations may not know this.\nWe alternate years.\nThe House plans one year, the Senate plans the subsequent year.\nIn this year, the House planned the meetings.\nThank you, Chairman Hatchett, Christine Dave,\nfor what the work y'all've already put into this.\nAlso remember, though, that this is not,\nfor those watching online,\nthis is not the only budget hearing that takes place.\nBudget hearings will continue throughout the entire session\nuntil we finally end on April 2nd.\nWe will be negotiating the budget,\nnegotiating with agencies all the way to the end.\nSo please don't think we're spending $40 billion\nof your state taxpayer dollars\nwith just a five minute conversation.\nThat is absolutely not the case.\nCommittee hearings will happen afterwards.\nThe House will break up into their own committees.\nThe Senate will do their own.\nThis is not just a five minute decision made.\nI'm honored.\nThis is my seventh year sitting here chairing the budget.\nIt is hard to believe that seven years have gone by that fast.\nWe are in a much different position\nthan we were the first time.\nIt was chairing the budget.\nThat was the middle of COVID, 2020.\nwhen we were taking 15% out.\nBut the one thing that has not changed\nis that every single dollar we spend\ncomes from somebody in our state's pocket.\nAnd I want us to keep that at the forefront\nwhen you're gonna hear a lot of good ideas\non how money should be spent.\nBut remember that you have to take it\nout of a taxpayer's pocket to spend it in the first place.\nSo hope we'll keep that at the forefront\nwhen we're going through these things over the next few days.\nChairman Hatchett, thanks again for the preparation.\nYou've done to get us here.\nThank you chairman tiller present protein walker if I was a senator I'd be getting\nup and letting somebody have let them have your seat let you have their seat I\nmean I'm just trying to prompt one of these good senators thank you for being\nhere I tried but we are awaiting our special guest so present for there is a\nchair on the left side over here if you want to yeah you have to sit by\nrepresentative Dunahoo but but there is one over here on the left yes sir\nYou\nYou\nYou\nYou\nColleagues, it's my honor today to introduce someone to you that really needs no introduction,\nbut it's my first time to introduce him to the joint appropriations hearing in person\nand not from Davos, ladies and gentlemen.\nthe 83rd Governor of the State of Georgia, the Honourable Brian Kemp.\nGovernor, floor is yours. I believe your mic is ready to go.\nAll right. Well, thank you so much, Chairman Hatchett. I appreciate the kind words,\nchairman Tillery, members of the House and Senate Appropriations Committee.\nI am honored to be here with you in person this year to present my final two budget recommendations.\nI also just want to take a moment as we start and thank you for allowing me to address\nyou virtually in previous years while Marty and I have been on economic development trips\nand bring more jobs and investment to our state.\nAs you know last year we were in Germany at this time and met with some great leaders,\nsome companies that you all know, all of whom either already operate in Georgia or looking\nthat potential investments.\nThat includes Mayor's, who's one of our largest clients\nat our port, largest SIP and company in the world\nin terms of a marketing presence.\nAnd as we continue to grow and reach capacity\nat the Georgia Ports Authority,\nconversations like that mean greater business\nand job growth for our state.\nIn fact, port activity now supports over 650,000 full\nfull and part-time dobs across the Pete State, a 7% jump over just the last fiscal year,\nwhich is pretty incredible.\nIn 2024, Chairman Hatchett mentioned that we were in Davos, and I remember that trip well,\nthe first one, especially because people were giving me a hard time for going over there,\nespecially some of my friends on our side of the aisle, and now we know President Trump's\ngoing over there.\nthey're going to give him as hard a time as they did me. But we did have a great trip. In\n2024, we met with GF casting, which then announced a few months later a project in August\nto promise in 350 new jobs in a $184 million investment. The prior year, in our first trip\nto Davos, we met with executives from Hyundai, LG, SK Group, and others. And I don't have\nto tell you how big an impact there are various expansions and announcements have had on our\nstate and our hard work in people. Those trips had real impact on the communities and the people\nthat we serve just like the budgets that you work on in past. So again, I just really want to\nthank you all for your partnership over the years and for sharing a strong commitment to responsible\nstrategic and measured approaches to the annual budget and also just thank you for indulging\nme and letting present virtually it was worthwhile all those trips were but I am glad to be\nhere in person with you all this morning. These annual budgets requires discipline and respect\nfor the people that sent us here because every dollar we allocate is a dollar they earned\nnot the government.\nAs I said in my final state of the state address last week,\nrefusing to grow government, budgeting conservatively,\nand paying off debt aren't flashy,\nbut they are the right thing to do by our constituents.\nGeorgia voters have again and again rewarded those who\nhold spending in check by returning them to the gold done.\nSo it is not only right to be conservative in our approach.\nIt's not only the best thing for our state\nand it's fiscal standing.\nIt's also quite honestly just good politics\nand the results I think speak for themselves.\nOur approach is maintained\ntoward us triple a credit rating,\nsaving tax payers and future generations,\nmillions of dollars in interest.\nOn top of this, it has allowed us to use cash\nto finance projects throughout the state instead of debt,\nsaving tax payers and future appropriators\nwho will sit in your seats $3.3 billion in interest payments over the next 20 years.\nIt has allowed us to store up strategic reserves for the next economic downturn, ensuring\nyou all or future legislators won't be forced to cut critical services for Georgia's\nwin not if the next economic crisis hits.\nAnd it's enabled us to put more toward education, health care and mental health resources than\never before in our state's history. We've also been able to make historic investments in\ninfrastructure across Georgia, again because of our strategic and restrained budget approach.\nThat careful planning has allowed us to return money and reduce the tax burden on Georgia's\nat a time when prices skyrocketed to 40-year highs. All told, we've now saved them $9.7 billion\nthrough tax rebates, reductions, suspensions of the gas tax, and other measures, and that is with you all's help.\nAnd again, with your help, we'll increase that amount even more.\nAll of these historic measures did not happen by chance, or they happened by choice.\nWe choose to live within our means, resist pressure to grow government, and use one-time funds for generational projects\nthrough a once in a lifetime opportunity our revenue level gave us policies that\ngrow the economy instead of government are also why we've seen sustained job\ncreation, private investment and rising wages in Georgia. This year I'm asking\nyou to double down on that winning approach yet again further accelerating the\nlargest income tax cut in our state's history by 20 basis points. With this\nThis third acceleration we will deliver on the promise we made in 2022 to bring the\ntax rate under 5 percent and we'll do it three full years ahead of schedule.\nAs you all know this will save hard work in Georgia's another $770 million every year.\nAnd I again want to thank you all for your work in the past and ask for your partnership\nagain this year in record time as value partners that you are.\nI'm also asking for your support in returning a fourth,\none-time tax rebate to families as they continue\nto face affordability challenges\nand the lingering high prices that came\nwith 40-year high inflation.\nThis will give a little over of a billion dollars\nback to hard work in Georgia's for groceries,\nhelp with the rent or car payment,\nthe ability to pay a little more on a credit card\nor help with other needs.\nWith these latest measures added to those\nfrom years prior, your hard work will now have given a total of $7.5 billion in targeted\none-time relief to the people of our state, and over $3.8 billion in permanent tax relief.\nThese tax measures are not in conflict with fiscal discipline, they're a product of\nit.\nThat's a pretty good record for any legislator or governor if you ask me.\nWith that same discipline approach, the budgets before you continue to prioritize investments\nthat strengthen Georgia's economic foundation.\nWe are focused on building and maintaining the infrastructure necessary to support continued\ngrowth and growth transportation and workforce development.\nGeorgia's roads, bridges, ports, rail connections, and airports are not just assets.\nThey are economic tools.\nWhen they function efficiently, they reduce costs for both drivers and employees and employers,\nshorten commutes and improve the quality of life for families in our state.\nBut to meet current demands and prepare for future growth, we need to make strategic investments\nin that system.\nTherefore, my amended budget includes more than $2.3 billion to further expand and improve\ncritical freight and commuter quarters.\nadditional support for local government for road maintenance and address\ncritical bridge repairs across the state. These investments bring the total\nadditional transportation investment during my administration to more than\n$4.7 billion. That not not only benefits commuters and businesses it all it\nalso keeps Georgians around the state working. The only reason we're able to\nto make such transformational investments\nis because the unique position that we're in with our reserves.\nThat has allowed us to fund major projects\nwith one-time surplus funds rather than long-term debt.\nNot only does that give us flexibility and out-ear budgets,\nit also ensures today's infrastructure improvements\ndo not become tomorrow's financial burden.\nIn addition to transportation,\nthese budgets continue targeted investments in water,\nsewer and energy infrastructure to support growing communities across the state and attracting\nnew employers.\nThese budgets include $33 million for the Georgia Environmental Finance Authority's Water\nand Sewer Funding Program for local governments, as well as $35 million to establish a new\nnatural gas infrastructure financing program.\nThis is a first of the kind in Georgia.\nThis program will help communities build infrastructure needed to support and expand key industries,\nincluding our critical timber sector.\nWe all know how devastating Hurricane Helene was to this industry.\nAnd now that damage was amplified by the closure of multiple paper mills in South East and\nSouthwest Georgia.\nThat's why this past year I convened a forestry task force to bring together state agencies,\nacademic institutions and industry leaders to help us tackle this issue.\nMy budget's fund items recommended by this task force so that we can further support this\nmajor industry in our state as it continues to recover.\nWe will invest $660,000 into the Georgia grown wood program that the General Assembly\nsupported last year.\nThis will support economic development and media campaigns to market Georgia as a premier\ndestination for forest product manufacturing. This budget also includes $2.6 million to\nconstruct a mass timber county unit facility for the Georgia Forestry Commission in Morgan\nCounty. We have seen the private sector begin to embrace mass timber construction even\nhere in Atlanta and this will be a first of its kind construction for a state agency.\nI can't think of a better agency to lead the way than the forestry commission which serves\nprotects our forest lands every day. Just since the last time I presented budget\nrecommendations to you, the great team of the Georgia Forestry Commission has\nfought or helped contain over 4,000 wildfires. That is a 64% increase over the\nfive-year average, and yet of the 37.7 million acres in our state, those fires\njust burned 26,000 acres. That's a testimony to how dedicated\nto men and women who work for the Forestry Commission are and I want to\ncommend them for all the young men's work they've done during this current\nfire season. That success is also a testament to your impact through previous\nbudgets. We knew following the devastation from Hurricane Helene with the\nunprecedented amounts of timber now on the ground this fire season was\nwould be difficult.\nThat's why you helped us prepare by putting over $1.7 million\ntoward replacing forestry vehicles and firefighting equipment\nin the FY2026 budget.\nAnd over $4.7 million in the amended 25 budget\nfor a new fire suppression helicopter.\nGiven how effective the Forestry Commission has been,\nyou can see just how impressive the return on the investment\nhas also been.\nAnd I want to, again, thank you all for your partnership\nin securing those funds for the Forestry Commission.\nFinally, my budget includes nearly $11 million\nto establish the Georgia Forestry Innovation Initiative,\nbuilding on the research underway\nthrough the ReWood Program at Georgia Tech's Renewable\nByproducts Institute.\nThese funds will be used to engineer, design, and test\nnew technologies to support the expansion\nof our timber industry partners into new markets,\nlike automotive and pharmaceutical manufacturing.\nThis partnership will be a textbook example of how\nthe research in our USG laboratories\nis directly supporting Georgia businesses.\nI'm also proud to report that demand\nfor higher education opportunities in Georgia\nis higher than ever.\nThat's why my fiscal year 2027 budget includes more\nthan $253 million to meet enrollment growth\nboth across our university and technical college systems.\nBut we also know too many students either don't attend\nor fail to complete college because they can't afford it.\nWhile others finish with debt that weighs them down\nliterally for decades.\nThe fiscal year 2027 budget includes an additional $58 million\nto fully fund hope scholarships and grants\nat the 100% factor rate.\nWe return the program to, again, with you all's help.\nYou'll be glad to know that because of that good work,\nlast year, hope programs helped nearly\na quarter million students attend post-secondary institutions.\nI also want to thank you again for your partnership\nin eliminating the special institution fee for students\nin 2022, further reducing the cost of higher education\nour state and keeping college within reach for hard work and families. Last week as you\nremember I announced yet again yet another and perhaps more historic measure we will work\non together to make college more affordable and accessible to Georgia students. My amended\nbudget includes a $325 million dollar endowment to expand the dream scholarship. The first\nneeds based aid program of its kind and Georgia history. This investment has a goal of leveraging\nan additional $1.2 billion in private funding to create in the coming years a permanent sustainable\nsource of need based aid for thousands of future Georgia students. This structure matters a great\ndeal when it comes to our budgets because using one-time funds for an endowment rather than creating\na recurring obligation expands access while also maintaining long-term stability.\nThe return on that investment will be higher college completion rates, a more skilled\nworkforce and reduce student debt which will benefit the entire state's economy.\nWith your help over the years we have also invested $100 million in capital maintenance projects,\nso our higher ed schools are worthy of the students that attend them.\nThe amended budget provides another $88 million for MRR needs across our USG and TCSG\ncampuses.\nThese investments help meet outstanding infrastructure needs without having to raise\ntuition.\nWe're also giving an additional $3 million to the technical college system for a new college\nand career academy.\nThis year we're also focusing on connecting and graduating students with job creators.\nwithout a good job, there's not much return on even a quality education.\nThat is why my budget invests $14 million in cutting-edge, in a cutting-edge career navigator\napplication that will help students and job creators find available positions and provide\na clearer pathway for economic mobility.\nJust like the cost-cutting measures and tax rate reductions we pass, the investments\nThis we made in education, workforce, and economic development will help hard work in\nGeorgia's with affordability because the best way to fight through high prices is to\nhave a good job with good wages and good benefits.\nThese are investments that will pay dividends not just for years, but I believe for generations.\nAs we continue to build on Georgia's fiscal and workforce infrastructure, we're also\nprotecting the foundations of our financial stability. Together we have\ninvested more than $4.1 billion in the last three fiscal years in capital\nconstruction and maintenance needs by using surplus funds rather than new debt.\nAs I said earlier that decision will save future generations billions in\ninterest payments while also saving them on deferred maintenance costs. As a\nAs a result, our debt ratio is the lowest it's been since we first began issuing bonds\nover a half a century ago.\nIn addition to this historic accomplishment, you've also helped us eliminate the outstanding\nunfunded liability for state retiree health benefits, reducing it from over 2.1 billion\nto zero.\nThanks to those efforts, we will save more than $240 million annually in health costs\nbeginning this upcoming fiscal year.\nWe're using those savings to invest in additional $200 million into the Teacher State Health\nBenefit Plan to keep them on solid financial footing.\nEven while making these unprecedented investments, we have kept our rainy day fun full and preserved\nundecidinated reserves so we can properly respond to whatever unknown challenging challenges\nthe future brings.\nI'll close by reiterating what we've all accomplished and more was done by choice, not by chance.\nAs I pass this recommendation on the U.M. confident that we can build, continue to build on this\ngreat partnership that has served our state and its people so well.\nalso would be remiss if I didn't mention the greatest first lady in the country is with\nus this morning Marty Kemp.\nIt has been an honor for us to serve this great state and it's also been an honor to serve\nwith you all, and I know that the work of your committees affects every agency, every community,\nand every family in our state. Like Georgia families budgeting around their kitchen tables,\nwe have a we have to plan based on what we actually earned today, not what we hope to earn tomorrow.\nTogether we'll continue the good work we began years ago, lowering the tax burden on hard work\nGeorgia's strategically invested in our state's future and keep\nin Georgia the best state to live, work, and raise a family.\nI wish you all your best and your work will look forward to working with you,\nand I hope you have a great rest of the day and budget hearings.\nThank you. God bless you.\nGovernor, thank you and First Lady Marty Kemp for the service you've given this state\nfor the past seven years and a little while longer, you're not done yet, but it does not\ngo lost on me that you wore that green tie today, thank you.\nall right well I guess we get down to business now thank you and first up is\nDr. Robert Bushman our State Economist. Good morning everyone thanks for all of\ny'all being here packed room well as you heard I'm Bob Bushman State\neconomist here to talk to you today about Georgia's economic and revenue outlook.\nThank you Chairman Hatchett and Chairman Tillery for inviting me to speak today.\nIt's good to be back after getting sort of snowed out last year.\nI didn't see any snow, but I think some people up in North Georgia might have.\nGeorgia might have. My presentation today will follow this rough outline, hopefully with\ntime for Q&A at the end. First, a state revenue update and a review of structural and economic\ncontributors to recent revenue trends. Second, a review of U.S. and Georgia macroeconomic\nperformance measures. Third, the outlook and the risks and finally a look at the revenue forecast.\nI'll start with a recap of fiscal 2025 performance compared to 24 as well as a year-to-date\nfiscal 26 results. As you can see, fiscal 25 personal income tax collections grew by 1.3 percent\ndespite tax rate cuts from a top rate of 5.75 in the first half of fiscal 24 to 5.19 flat rate\neffective the second half for the full second half of fiscal 25. For the first half of the current\nfiscal year personal income tax collections are up 2.6%. Even though tax rates are 3.7% lower\nthan a year earlier.\nCorporate income taxes were down 9.9% in fiscal 25\nand 4.4% year to date this year.\nSomewhat larger declines than can be explained solely\nby rate cuts.\nSales tax gains have slowed in part due to declining inflation\nwhile gains in motor fuels in fiscal 25 and year to date this year\nare mostly explained by the shorter suspension of\nmotifuels taxes in fiscal 25 than the year before,\nand no suspension so far this year.\nWithout the suspensions, the gains would have been marginal,\n1% or less.\nPeople are just burning less gas.\nOne item that stands out in the year, date numbers is the 93%\ngain in insurance premium taxes.\nmost of the reported gain is the result of an extraordinary refund paid in\nSeptember 2024 so adjusting for that however you'd still see a 15% gain\nyear-to-date in insurance premium taxes and a 14% gain in fiscal 2025. Stronger\ninsurance premium tax revenue growth is due in large part to high\ninflation in insurance premiums, particularly in fiscal 2025. Total taxes in the\nyear-to-date comparison are up 3.3% and improvement over fiscal 2025 growth,\nbut total general funds revenues grew more slowly, only 1.6% mostly due to 28\npercent lower interest earnings as interest rates came down and about two\nbillion dollars of undezonated surplus balances were drawn down for one-time\nitems. For a quick review of longer-term revenue trends, this graph shows tax\nrevenues by major tax types since physical 2020, starting at the base with\npersonal and corporate income taxes, followed by sales, motor fuels, TABT, etc.\nOver five years state revenues have grown cumulatively by $9 billion or\nabout 36%. But it's important to note that 94% of that growth, about 8.4 billion, came\nin just two years, physical 2021 and 22. The state's three largest revenue sources,\npersonal and corporate income taxes and sales taxes, grew by 8.1 billion over the five\nyears, accounting for 90% of total growth. Other taxes, performances varied, especially\nthe motor fuels tax, given the suspensions over the last four years, and as the figure\nmakes clear, total tax revenues have been essentially flat since 2022. In spite of motor\nfuel tax suspensions and substantial income tax cuts, the first of which took effect starting\nin the second half of physical 24 and the second a year later.\nTaking a closer look at the main driver of income tax performance, this graph shows what's\nbeen happening with Georgia and U.S. personal income since the first quarter of 2020 just\nbefore a pandemic job losses hit wage income.\nThese data are seasonally adjusted, adjusted for inflation and indexed to 100 in the first\nperiod so you can see cumulative growth over time.\nFirst the solid lines show total personal income, including from employment, from dividends,\ninterest and rents, and from transfer payments, Georgia and Orange and the nation in blue.\nThe dotted lines show only the wage and salary component of total personal income.\nThose are the lines you should focus on wage and salary income.\nwage and salary income is up 8.6% cumulatively over the entire period, while Georgia is\nup 12%.\nWith most of the outperformance coming in calendar year 2022, growth continued through\nthe first half of calendar year 25, the latest state data available, but Georgia underperformed\nslightly on wage and salary income over the last four quarters, though it did beat\nU.S. growth in total personal income, 3.1% to 2.6%.\nWage and salary income is really the main driver of personal income tax revenue growth\nover the medium to longer term, so let's take a deeper dive into that, our biggest revenue\nsource.\nThis graph shows both withholding and total net collections on an annual basis since 2015.\nTaxes on wage and salary income are collected generally through withholding.\nAnd historically, withholding collections have been approximately equal to total income\ntax collections on average each year.\nThat change starting in fiscal 2021, and dramatically so in the following two years.\nFor fiscal 2022, the gap between the orange and blue lines represents an extra 3.9 billion\nof net collections over and above withholding.\nmore about two-thirds of the $5.9 billion gain in total income tax collections from fiscal\n2020 to 2022. These nonwithholding payments come primarily from estimated and final tax\npayments, less refunds, and except for refunds are generally related to income earned from\na business from self-employment or from investments, including capital gains income. A big part\nPart of the $3.9 billion positive gap in fiscal 2022 was tax on capital gains.\nI'll show you my estimates of that on the next slide.\nThe gap has mostly disappeared again more recently, though part of the reason is the implementation\nof entity level filing by business pass-throughs.\nBetween one and $1.5 billion of tax payments from pass-through entities shifted from personal\nto corporate income tax in fiscal 2023 and 2024.\nFinally, withholding collections have benefited from continuing wage and salary income growth,\nthough that has leveled out in the last two years in part due to tax cuts.\nSo far this year withholding collections are up 0.4% year to year, while the total again\nis up 2.6 percent, so the gap is widening a little bit again.\nI've shown most of you all this before, so I'll try and be quick on this.\nThe table shows capital gains data reported from two sources, an optimized Department of\nrevenue administrative tax return data covering E filers and IRS tabulations of returns that\nwere filed from a Georgia address, so excluding non-residents and anyone who moved out of the\nstate by the time they filed their federal return. From these data, we calculate the amount\nof tax that would be owed on these gains, assuming the top statutory rate for that year.\nyear 2021 was a great year for gains, as you can see, producing an estimated $3.1 billion\nin tax that would have generally been seen as revenue for the state in fiscal 2022.\nThat fell nearly in half in tax year 2022, and again by a quarter in 2023, mostly impacting\nand fiscal 23 and 24 respectively.\nThe graph below the table shows the distribution\nof those gains realized across returns\nwith less than $100,000 in reported gains\nto those reporting more than 25 million in capital gains.\nAs you can see, that top group reporting very large gains\nis also quite volatile, but you can also\nsee that tax year 2022 was a big year for capital gains\nall sizes and that the biggest reversal in tax years 2022 and 23 was in the\nlargest gains category which fell by 84% over the two years. We don't know yet\nhow much we've reported in tax year 2024. It'll take a little while to get\nthat and a long time to get 20.25.\nIncome growth contributes to state revenue growth in another way through the sales tax,\nsustained growth of ordinary personal income, income from a job or a business or from dividends,\ninterest and pensions is the main driver of sales tax revenue growth over the long term.\none-time transfer payments or investment windfalls are less likely to affect taxable consumption\nnear term in aggregate sense.\nNominal personal income growth in Georgia, excluding transfer payments, averaged about\n6.1 percent per year over the last five and a quarter years, while sales tax revenue\ngrew by 8.7 percent per year on average from fiscal 2020 to 25.\nSo what explains the faster growth of sales taxes than income?\nPart of it was initially was spending the pandemic assistance payments, but that effect\npretty much dissipated a couple of years ago.\nThe other big factor has been the mix of consumption spending, beginning with the pandemic consumption\nshifted from services to goods, goods in red, services in green in this graph.\nThe data are for the U.S. because state-level consumption spending data only comes out\nannually with quite a lag.\nBut the picture has been much the same in Georgia through the latest state data available.\nAs you know, goods are generally taxed in Georgia while most services are not.\nSo the shift boosted sales tax revenue growth for the first two to three years after COVID\nhit.\nThe shift back toward services since 2022 has been a drag on sales tax revenue growth in\nfiscal 23 through 25.\nBut the mix of goods and services consumed has returned to the pre-pandemic mix.\nSo that drag on sales tax collections should be over.\nAnd as you can see from the blue line on the graph, personal income less transfer payments,\nincomes have not kept up with prices.\nThis is the affordability issue in a picture.\nSo to summarize the main contributors to trends in the largest revenue sources, nominal\nwage and salary income growth has slowed but continues to support withholding collections\ndespite the tax rate cuts.\nFirst half, fiscal 2025 saw 36 basis points\nor 6.3% lower tax rates, then year earlier,\nwhile withholding fell by 3.6%,\nimplying year-to-year wage income growth of around 2.9%.\nFirst half of fiscal 26 saw an additional 20 basis point\nfor 3.7% lower tax rate, while withholding grew by 0.4%\nimplying year-to-year wage income growth of nearly 4.3%.\nThe boost to sales tax revenues from spending\nof excess pandemic savings and the consumption shift\nfrom services to goods is over.\nThe inflation boost to sales tax revenue persists\nbut a lower rate, year-to-date fiscal 2026 sales tax growth of 2.1% is lower than inflation\nof 2.8% year-to-year suggesting slower real spending on taxable goods.\nNow, let's look at a few other broad measures of current economic conditions and performance\nover the last year to set up for the 26-27 outlook.\nFirst up, unemployment, national unemployment rose to 4.5 percent in November and then\nback to 4.4 in December from 4.1 a year earlier, while Georgia, I mean, while, has been out\nperforming on this measure for almost six years now, we're at 3.5% as of November, so we're\ndown a tenth of a point in the last year and we're six tenths below the national reading\nfor December. Low unemployment is good for consumer confidence, obviously, supporting\ntaxable consumption and puts upward pressure on wages contributing to taxable income growth.\nSince February 2020, Georgia non-farm employment has grown by 6.7% cumulatively versus 4.7 nationally\nthrough November.\nBut for both the state and the nation job growth stalled in 2025, Georgia gaining about\n3,200 jobs over the year, well, at least through November, or about 0.1%.\nThe U.S., meanwhile gained 584,000 through December, or about 0.4%.\nMost of the weakness has come in recent months, the U.S. lost 117,000 jobs in three months\nthrough November before gaining 50 back in preliminary December estimates.\nGeorgia is estimated to have lost about 7,000 jobs in September through November.\nEmployment leads to growing output from businesses, which brings us to the broadest measure of\neconomic performance GDP or more specifically real GDP adjusted for inflation.\nThe headline result is that Georgia and US real GDP, shown here indexed to 104, the first\nquarter of 2020, have both grown by 14.8 percent on a cumulative basis from the start of\nthis very short pandemic recession.\noutperformed the nation through the end of 2022, lagged briefly in the first quarter\nof 2023 as roughly tracked national growth since then. Both George and the nation took\nanother dip in the first quarter of 2025, but both have rebounded since.\nto inflation. I've probably seen this before, so I'll try not to spend too much time on\nit. This graph shows the inflation surge that prompted the Fed to raise rates a couple\nof years ago, 11 times in 17 months. Headline inflation peaked at 9% year-to-year in June\nof 2022, far above Fed targets, but came back down to 2.4% by September 2024. Unfortunately,\nthe decline stalled there until inflation began rising again last June. Both headline and\ncourse CPI inflation rose to just over 3% year to year in September, the last reading\nbefore the government shut down. Reports for November and December were a little bit lower,\nBut there are also gaps in the survey data, so we'll wait and see how January looks.\nThe green line shows inflation in goods prices, which kicked off the inflation rise in 2021,\nand peaked at 12.5% year-over-year in February of 2022 before falling dramatically and spending\nall of 2024 in negative territory, falling prices.\nThis turned positive again since last April reaching 1.5% year-to-year in August and September.\nThe grocery component of that reached 2.7% year-to-year inflation in September and ended\nthe year at 2.4% year-to-year.\nServices inflation, which accelerated while goods inflation was easing peaks three years\nago and has declined since reaching 3.6% in September and 3.3% last month.\nMonetary tightening that brought inflation down from 9% to 2.4% in two and a quarter of\nyears ended in September 2024 and the resulting disinflation has stopped as well.\nSo here's a picture of the Fed policy rate over the last decade, the target Fed funds\nrate up or in lower bounds.\nA year ago, we had seen the long pause of the top come to an end with three rate cuts\nas inflation eased, but that was followed by another nine-month pause because with unemployment\nstill low and disinflation-stalled, forecasters worried about tariff-induced rise in inflation.\nTariff effects on prices take time to work through to consumer prices, especially when\nanticipation of large tariff hikes led to a surge of imports to build inventories before\nthe tariffs took effect. With the tariffs filing in place studies from the St. Louis\nFed, Moody's, and others have estimated that tariffs added as much as 0.7 percentage\npoints to U.S. inflation by late last year. In other words, if not for the tariff hikes\nlast year, December's inflation reading likely would have been close to the Fed's 2% target\ninstead of 2.7%. Nevertheless, with the labor market softening, the FOMC soft fit to\ncut Fed funds three more times a quarter point each in the last three meetings of last year.\nSince the December meeting, the consensus among Fed Watchers has been for another pause.\nAs of this morning, Fed Fund's futures markets are predicting the next rate cut won't come\nuntil the first meeting under a new Fed Chair in June, with a second cut likely later in\nthe year probably December.\nThat would bring us to a target range of 3 to 3.25%.\nSo at the December meeting, the FOMC decided to pause so-called quantitative tightening,\nreducing the Fed balance sheet holdings of longer-term treasury and mortgage securities.\nInstead, the Fed plans to purchase $40 billion per month of short-term treasury's\nT-bills in what they label reserve management instead of quantitative easing.\nPersonally, as an economist, I worry that's a distinction without a difference.\nand that those smaller than the quantitative easing of the last cycle, this policy together\nwith further rate cuts and new tariff threats will keep inflation at elevated levels for\na while longer.\nNow to some other indicators of where we may be headed, first with a few positives.\nThis graph shows the Fed's so-called financial soundness indicator for banks.\nBanks tier one capital as a percent of risk-weighted assets.\nAs you can see, bank capital ratios are quite strong.\nBanks have been building their capital relative to assets since the disaster of the Great\nRecession and have continued to do so since the pandemic.\nConsumer financial health is also strong.\nHousehold debt service burdens shown here in blue have risen from pandemic lows when\nmany households pay down debts with their stimulus checks, but remain at levels last\nseen in the late 1990s.\nhousehold debt as a percent of GDP in red here has also been declining since the Great\nRecession and resumed its decline after the pandemic bringing this measure back to 1999\nlevels. Consumer loan delinquency rates for both credit cards and mortgages also remain\nhistorically low as due delinquency rates for business loans. So the consumer is still\nand good shape financially, and banks are an excellent shape.\nGood conditions for avoiding the financial crisis should the economy weaken again.\nCan I stop you there and ask the question first?\nYes, please.\nHelp me understand this.\nIf I'm reading those lines correctly, you've got household debt,\npercentage of income increasing.\nYou've got household debt as a percentage of GDP decreasing.\nThe blue line is principal and interest payments on debt, okay, so so they're adding in the interest and that's why it's so much higher\nSo I'm trying to look at the side here is it saying are you saying that 12% of someone of the average family's income is going to pay the\nInterest in the debt right now or is it the 75% which percent matches me that service burden is the left scale\nThat is a percent of\nSo the GDP is the right scale so the GDP and the denominator is not personal income\nbut GDP. So the GDP increasing is what's causing the percentage of household\ndebts of a client as it relates to GDP. Oh yeah that helps yeah certainly the\naverage family. But the deserves burden has also gone up because interest rates\nhave risen. Right. So while we're seeing that red line go down in the microcosm of\na family they're feeling it still. Oh yeah yeah yeah yeah yeah. But still at\nThat historically low levels, oh no, as it relates to 2020, maybe?\nNo, I didn't want to make the graph go back to 40 years ago, but it's basically 1990s levels.\nSo what would be the average percent of household debt and interest that you normally see around\n20% of their home income, because you said if we go back to 1990s, I'm just looking\nout the edge over here where the red line is at 14 or 15%. If we went back to you're saying\nit's historically low even though it's at 11 and a half, 12% now, what would it be if we\npulled that back and looked over the past 40 years? It would still look low. So the 1990s\nwere basically, most of the 90s were probably closer to the late teens there in the graph.\nThere were a few years where it was down closer to 11% like we are now.\nAnd in some of this was anecdotal, I'm not sensing that families are feeling that.\nI sense that they're feeling that they're actually under more pressure right now.\nI didn't know if the data is showing opposite or the data agrees with the family.\nIt's less so dead burdens than prices on everything being high.\nI'm not putting it on their credit card yet.\nWe'll see that soon.\nYeah, I mean credit card is included in that household debt number.\nIt's just not the only thing included there.\nThis may get a little more toward the affordability question.\nThis graph, the first thing that, on my list of things to worry about, is shows interest rate\non mortgages, 30-year mortgages, and auto loans, 60-month auto loans.\nSo as you can see these, they rose quickly in 2022 as the Fed tightened and peaked late\n2023, come down a little bit but are still at levels comparable to 2007 and so still relatively\nhigh. Certainly higher than many of us grew accustomed to in the last decade and\nthe half prior to 2022. High interest rates on mortgages and other consumer\nloans are restraining demand. In the case of mortgages, locking homeowners with\n3% and 4% mortgages into their current homes. These rates are unlikely to be\ncoming down much for the time being.\nIn fact, longer-term treasury rates have been rising lately.\nAs I noted before, job growth has slowed\nand since September turned negative.\nIn fact, the rate of new hiring by businesses\nor total hires as a percent of existing employees.\nOver the last 18 months has been at the lowest level\nsince 2013, reluctance by businesses to hire suggests fewer opportunities to change jobs\nfor better pay, and that those between jobs will remain unemployed or entering the workforce\nwill remain unemployed for longer dragging on consumer confidence.\nConsumers also still feel squeezed by inflation.\nhave not really kept up for the average worker, so consumer sentiment is weak. The University\nof Michigan consumer sentiment index shown here is sitting at levels typically associated\nwith recessions. Anything that pushes inflation higher again is likely to make matters worse\nfor the average consumer.\nWell, I lost my notes for this page.\nOh, you're there.\nOther issues include business confidence with the conference boards, CO survey finding\nthat most COs are expecting higher inflation and a slowing economy, also known as stagflation.\n64% are expecting that.\nOn the jobs front again, we still don't have a good idea what impact AI will have on employment.\nSome observers suggest that that's been a factor in the job slowdown in the last year.\nBut like most economists, I think in the long run, the impact will be higher productivity\noverall and thus rising incomes.\nBut there will be some pain in some job classifications for a while.\nWe also see rising political instability in the world and also here at home.\nAnd finally, we still face risks from trade due to high tariffs, increasing pass-through\nof tariff costs to consumers, and just in the last few days, new tariff threats.\nSince last January, the net effect of all of the tariff impositions by executive order\nAnd the negotiated rollbacks of some of them\nhas been an increase in the US average effective tariff rate\non imports coming into the country from 2.4% to 18%\nas of October.\nThe bulk of the cost of these tariffs\nfall on US consumers and businesses,\ndepending on how much cost businesses are willing to absorb\nto avoid losing sales over the short term.\nMoody's estimates that as of August, 29% of the cost\nof these tariffs have been passed on to consumers, 53% have been absorbed by US businesses\nharming their profits and only 18% was being absorbed by foreign producers again to avoid losing\nsales over the short term. The hit to profitability for US businesses has been blamed for record\nbusiness bankruptcies through three quarters of 2025. As time passes, businesses\nboth domestic and foreign have to pass more of the cost onto consumers to\nremain profitable, so we'll see continuing upward pressure on consumer\nprices. As time passes, I'm sorry, we also face risk of retaliatory trade\npolicies or in some cases just to refusal by foreign merchants and consumers to\nby or stock US goods.\nLarge exporting states like Georgia are the ones harmed\nthe most by that.\nRemember we're the 12th largest export state\nwith exports representing 6.1% of state GDP.\nTrade volume through Georgia ports has grown 8.5% per year\nsince 2003 and reached $250 billion in value in 2024.\nWe don't have 2025 data for George exports or port activity,\nbut through November, total U.S. trade is down 5.6%\nfrom the same months in 2024,\nwith imports down 4.9% and exports falling 7.3%.\nSo exports are falling faster than imports.\nSo, summarize the outlook and put it in the context of revenues.\nWe have a slow down, no recession yet, but slow real GP growth, slow job growth, continued\nhigher inflation because of tariffs and monetary easing, modest nominal income growth, keeping\nPersonal income tax collections, flat, even after rate cuts,\nslow real income growth, so weak consumer sentiment,\nand slower sales tax growth.\nBusiness costs rising, bankruptcies at record levels,\nsuggesting slower profit growth, and lower corporate\nincome tax collections after the rate cuts.\nWe also have lower short-term interest rates\nsmaller projected balances and undecidated surpluses so interest earnings will continue\nto decline for the state.\nAll of which brings us to the revenue budget, which is conservative as it should be, but\nnot overly so.\nWe're projecting a 1.2 percent decline in general fund revenues for the amended fiscal year.\nBut that puts General Fund revenues 2.2 percent above the original fiscal 2025 budget and\nalready reflects the 20 basis point rate cut the governor has proposed bringing and corporate\nincome tax rates down to 4.99 percent starting this year.\nThat rate cut has only a part year effect on the 26 revenue number taking about 40 basis\npoints off of the growth rate for the full year. The reason it's so small this year is that\nby the time it's enacted and begins reducing withholding an estimated tax payments only a month or\ntwo will be left in the fiscal year. So the effect gets mostly pushed into fiscal 2027,\nkeeping budgeted general fund revenue growth at a negative 0.4 percent for next year.\nNormal growth should resume after that as long-run projections reported in the back of the\nbudget book show physical 2028 is expected to see about 4 percent general fund revenue growth.\nAnd with that, I will welcome any questions.\nI think it would have been a little bit long though.\nYou got a couple of Dr. Blussman.\nFirst one we'll go, Representative Ridley.\nThank you.\nIn the book, I've got different glasses, I can't see right now, thank you, it's 393.\nIt talks about job growth in 2025 and through the first four months of 2025, 2026, it says\nthe strongest was healthcare, social assistance, it's followed by a local government.\nWhat would your thoughts be on that?\nIf jobs are starting to follow in manufacturing and other jobs like that, but they're\nto produce a more subsidized job.\nWhat's your opinion on economic outlook for jobs?\nI'm not sure I follow the question you did.\nWell, I'm asking that in the job growth in the book right here,\nit's talking about this year that the most job growth\nwas in healthcare, social assistance, and local government.\nYeah.\nWhy we lost jobs in manufacturing and other ones.\nUsually when you say that, what's your thoughts on when\nDo you start seeing more subsidized, low government jobs or government subsidized jobs increasing?\nWell, the important point there is the contrast with manufacturing and jobs like that.\nThe decline in manufacturing jobs is not unique to Georgia, it's been a national trend over the last year.\nI mean, I would, like I said, consumer spending particularly for, you know, middle and lower\nincome households have been slow, so, you know, other than, you know, wealthier households\ncontinuing to purchase that's going to be a drag on producing goods.\nTeraf's trade policies have impacted manufacturing.\nLike I said, exports year to date through November are down 7.3%, so manufacturers are not\nwinning.\nOkay.\nThank you.\nSenator Lucas, is that to you, this got your book good?\nLet me ask you, of course, what is your projection of federal funds that we know\nI'm to get that we won't get this company? The division directors within\nOPB have looked very closely at that and addressed in the budget. Any\nyou know, critical needs that are likely not to be funded by the federal government\nand deciding where we need to backfill, that would be a better question for the different\nagency heads as they come through and talk about their budgets.\nWell, the reason I ask that question, if we don't get to money, we're going to have to\nmake it up. And that comes from the amount of money that we have in our reserve.\nWell, no, no, no. The critical spending needs where the funds from the federal\ngovernment are expected to disappear have been addressed in the budget. I just\ncan't point you to specific items because, frankly, I'm not an expenditure\nside guy. The division directors within OPB and the agency has themselves\nbe the ones that would be able to answer those questions. It's not in our general fund\nrevenues, the transfers from the federal government, but general fund revenues have been budgeted\nto backfill where the needs were considered critical by the different agencies and the\nthe governor's office in LPB.\nAll right, y'all got to mash your buttons\nor not mash your buttons.\nSo y'all are trying to fake me, you know,\nrepresent a fraud.\nMay I see my time to Senator Payne?\nThank you, Representative.\nI swear I am on this committee.\nThank you for being with us, Mr. Bruce\nAnd we've had a lot of discussions for many years\nabout the notion of lowering the income tax,\neliminating it possibly.\nAnd these discussions, as I'm sure,\nyour well aware, have ratcheted up over the course\nof the last year as all of us search for ways\nto make life more affordable for families that feel pinched.\nI recall that in a prior position,\nyou had publicly shared your views\nthat that would not be a good idea,\nthat it was an unrealistic talking point\nthat would almost certainly lead to a massive increase\nin the state sales tax.\nMy question for you is would that still be your view?\nAnd if it's not that you could explain to us\na little bit more why your views would have changed\nas we grapple with this issue?\nWell, I have no position on the recommendations\nof the committee.\nIf you're asking me as an economist, I think what the governor has been doing in lowering\nincome tax rates slowly over time as we were able to evaluate how much of our surplus\nwere structural surpluses is the better way to go.\nIf you can identify different tax preferences, large tax preferences, tax credits that may\nor may not be working, you all recently received another batch of tax incentive evaluations.\nSo as you all look at those and decide maybe this one should be cut back or that one should\nbe cut back or this one eliminated, using the revenue gains from that once it's done\nto continue to lower rates, I think would be a wonderful thing, reduces the, well, that's\nreally the supply side approach to tax cuts is a broader base, lower marginal rates,\nsame revenue.\nThank you.\nPresident, President Walker, Zitchie.\nThank you, Ms. Chairman.\nDr. Bushman, you talked about our low unemployment rate\nreally historic low.\nAnd I think you said 3.5% and the nation is 4.4% something\nlike that.\nSo we're doing really good there.\nI have read though that our workforce participation rate continues to decline, especially with\nyoung men.\nDo you have any data on that and any thoughts as to why that might be the case?\nI did look at that quickly when I was thinking about what to put in here and what to not\nput in here, but I don't recall any specifics about the labor force participation rate.\nI don't know that the labor force overall has not been growing all that quickly.\nSo that's, you know, lack of labor force growth is going to make it difficult to add jobs\nin the economy.\nBut unemployment is still low, so people who are already here and in the labor force\nSir, you know, all but three and a half percent of them are doing pretty well.\nWould you send me whatever data you have on the labor force participation?\nYeah, yeah.\nMr. Chairman, can I ask one more question?\nSir.\nGoing back to your slide on the FY26 withholding, I think it was.\nyou said withholding was up 4% no point 4 okay thank you I forget now yeah\nthe slide said point 4 and I thank you said 4% I just wondered which was yeah\nit's point 4 so it's flat more or less flat on the F526 withholding\nWe do have at least one more question.\nSorry.\nChairman Carpenter.\nThank you, Chairman.\nSo real quick, because you're painting a picture and I need an explanation.\nSo you're saying the bank's balance sheets are great.\nConsumer balance sheets are great.\nUnemployment is low.\nBut yet, consumer sentiment is down to the lowest since the 60s.\nWhat is, can we attribute that to social media?\nWhat's driving that sentiment when all other factors\nare pointing to things are in pretty good shape\nif everybody would just take a deep breath?\nWell, I suppose that social media is at least partly\nto blame for, you know, people just generally being\nuncomfortable about the direction of the country.\nfor me either side, but I think the real problem is that incomes for\nmotion-Americans have not really kept up with inflation over the recent years,\nhave not really caught back to higher prices.\nSo would it be fair to say if inflation, if we can get our hands around inflation\nand continue to drive it down,\nthen things should be on the up for folks,\nfor opportunity, for investment, et cetera.\nAll else the same.\nAll else the same.\nYeah.\nAll right, thank you, Dr. Wiesman.\nThank you.\nWe're going to move on to Commissioner of Economic Development,\nPat Wilson.\nDo you want that picture right away or do you want to call for it?\nAll right, if you're leaving, please hurry up and leave so we can get going.\nWe're already 15 minutes behind and turn the volume down a little bit, please.\nThank you for being here today and not in Davos well, thank you for allowing us to be here today and not in Davos. It's cold over there.\nPeople might throw things at you today, but be careful.\nA little closer than usual.\nAll right, four years.\nChairman Hatchett, Chairman Tillery, members of the Appropriations Committee, and Dean Green,\nHappy Birthday.\nY'all, thank you for today, thank you for your time, thank you for what you do for the\npeople of Georgia in creating a budget that is conservative,\nthat has the ideals of the people of Georgia,\nand really the focus that we need in order\nto continue to be successful.\nAnd I want to start by talking a little bit\nabout last year.\nAnd I know we just heard from our good friend, the economist.\nAnd it seems to be the most predicted recession\nin the history of the United States,\nbut if you look at the numbers,\nand anecdotally, the things that we see\non the ground across the state of Georgia,\nwe are in a very healthy state.\nWe've got a healthy economy.\nWe have some amazing things going on,\nand what is fantastic about what we're doing\nand what we're seeing is that it's happening\nin every corner of the state.\nWe'll touch on a few numbers from last year first.\nTourism, an amazing year in tourism.\n82 billion dollar impact for the tourism industry\nhas on the economy of the state of Georgia.\n174 million visitors came to the state last year.\nTrade for the fourth year in a row,\ngiven all the global headwinds and everything\nwe see geopolitically, for the fourth year in a row,\nwe broke our record on exports out of the state of Georgia.\n$53.1 billion in exports coming out of Georgia.\nOur global commerce team, 23,000 new jobs\nthat we announced last year,\nthat we broke our record in investment,\n$26.3 billion of a new investment to the state.\nOur centers of innovation work with 441 small businesses\nlast year.\nThat's another record for businesses served, film.\nAnd while the industry, I'm sure we've all heard,\nthe industry is down overall nationwide.\nWe had the most successful series,\nwrap in Georgia last year, and that was Stranger Things.\nAnd y'all may have seen it is literally everywhere.\nThey hired 3,700 Georgians last year\nfor 890 days of filming with a payroll,\njust of local Georgia crew,\na payroll of $298 million.\nAnd y'all know payroll is not something\nthat necessarily goes right into the bank.\nThat's somebody's little league fees,\nthat's your mortgage, that's your car payment.\nThat is all over the state of Georgia.\nAnd then finally, our Georgia Council for the Arts,\nwe administered 363 grants last year.\nBut what I love the most is it went to 151 different counties.\nThat is a statewide impact.\nand that's something that we're very proud of.\nBut what I want to take a quick look back on,\nand I love following Governor Kemp this morning,\nthe his administration, when we walk out\nof his administration, we're gonna say\nthat the previous decade in the state of Georgia\nwas the most successful, most prosperous decade\nin the history of the state when it comes to job growth,\neconomic diversity, growing our manufacturing base,\nand the numbers prove it.\nBut what's amazing, and in his state of the state,\nhe talked about this, this is just our department.\nThis is not count organic growth that has happened\nin the state.\nWe've announced 219,000 new jobs in the state of Georgia\nin his seven years.\n118 billion dollars of new investment in his seven years.\nyears. And what is amazing about that is 64% of those jobs went to the state outside of\nMetro Atlanta. 74% of the investment was outside of Metro Atlanta. That's pretty amazing.\nAnd that's just what we touched. That does not count, again, all the organic growth that's\nhappening right here in the state. And so while we can say thanks, it really is everybody\nthis room, you guys have been a part of that story. And I've had the benefit of now working for\nthree governors. I have worked with multiple speakers and General Assembly members. It's a\npartnership and it's a partnership that this state has benefited from because we've made the\nstate of Georgia the best place in the nation to do business together. You guys have supported\ngreat public policy. You've budgeted fiscally well, you've managed us through\ncrisis and I've lived through the recession and then the and then COVID we've\nwatched all that happen and this partnership between the General Assembly and\nthe governor's office has really made Georgia the success story that is today.\nSo this is just a way to say thank you to you guys for being great partners and\nwe look forward to where we're going to go in the future.\nSo onto the governor's amended budget, the new budget, the big budget is not, there's\nnothing really for us to talk about there because it is exactly the same as last year.\nBut the amended budget is exciting because the governor made an ad to our marketing for\nthe first time in a very long time.\nAnd so if you look in section 429 under our departmental administration, the governor\nadded $3 million to promote Georgia tourism, update agency marketing materials, and enhance\nbusiness recruitment efforts.\nSo as many of you know, this is an unprecedented opportunity year for us to make an impression\non people coming to the state of Georgia.\nThe General Assembly and the Governor have worked to support the FIFA World Cup, which\nis coming to Georgia this summer.\nAnd this addition to our budget is a way that we can maximize that effort and make sure\nnumber one that people who come to Georgia want to come back.\nThat we show them the diversity, the amazing assets that this state has, that we bring\nthe 158 other counties into Atlanta\nto help them market themselves so that when people\nhave a great time here, they wanna come back\nand they wanna spend money.\nAnd so the money for in the amended budget will go toward\nwhat I think is an amazing idea from our friends\nof the Georgia World Congress Center\nto create an activation at the World Congress Center\nwhere we will basically create a trade show\nto highlight the state of Georgia.\nSo if you have a captive audience,\nand it is July in Georgia, and it is hot,\nand people need a break, they need air conditioning,\nthey need a water, or a beer, or something,\nwe're gonna create a space for them\nin the World Congress Center,\nso that they can come and stop,\nand know why we've got you captive,\nLet me show you a little bit about our state parks.\nLet me show you a little bit about Providence Canyon.\nHave you seen Smith Goldwoods?\nLet me show you a little bit about the Golden Isles.\nHave you seen Tubing in Delanaga?\nThere's so many amazing things in this state\nthat we can highlight, and we want you to come back\nand experience it after you've had a great time\nwatching a match at Mercedes-Benz Stadium.\nAnd so this is a little bit,\nThis is a trade show concept that we're talking about\nputting on in the World Congress Center.\nAnd Kevin and the team are going to give the state,\ngive us the space free of charge,\nbecause nobody can be in it.\nIt's inside the security perimeter.\nOnly people who are there for the match can participate.\nAnd then we will invite communities to set up a booth,\nto have an activation, Georgia businesses to come\nand participate if you're ASW and you want to have a cocktail\nor if you're a Georgia beer company from Valdasin,\nyou want to put a beer stand there.\nWe're trying to figure out ways\nthat we can highlight the great assets of the state of Georgia.\nPut them right here, make it easy for people to experience\nand do that in a way where all the counties\ncan participate if they want to.\nAnd so the only buy-in from the counties\nis what you want to put in that space.\nAnd so we're excited about that opportunity\nThis money will allow us to do that in support of the counties.\nThe other things that we are expecting that we would spend that on our website upgrades,\nwe have got to do a better job of marketing our assets and our communities on our website,\nmake it easy to find, easy to search, so that all of the things that we are doing here\nare also findable on the website, and then finally business recruitment.\nadvantage of this year and looking at who are the companies that are going to be\ncoming and participating in the World Cup, how can we grab them, how can we get\ntheir attention, and how can we focus on sewing Georgia, continuing to sell\nGeorgia. And so just a little context there on this ad in the budget. We went\nback and looked at previous years' budgets. So 2008 was the first year when I\nI worked for Sonny Perdue that I presented a budget to the General Assembly with him and\nwe worked on getting that budget passed.\nAt the department in 2008 that year, our budget was $38 million.\nOur marketing budget was a large percentage of that.\nIt was $17.9 million in 2008.\n2026 our department budget is 32 million dollars and our marketing budget is 8 million dollars and so if you look at the the difference there\nWe've gone through a recession. We've gone through COVID. There were cuts. There were needy cuts the mark the dot the the office is overall the department is smaller\nWe have fewer people\nBut I'd still think it's the best bang for your buck and stay government\nAnd so this $3 million will allow us to really come back and do some things in this unprecedented\nyear to really highlight the state and grab folks and bring them back to Georgia.\nThere's a second ad in our budget that I wanted to point out too.\nIn the under-tourism, the governor added $110,000 that goes to the Georgia Humanities to really\nfocus on the America 250th anniversary. And so this is an amazing year. I vaguely\nremember 1976, mainly remember it from my grandfather, my great-grandfather\ngiving me silver dollars with the commemorative backing. But this is an\namazing opportunity for us to share what America means. And us is one of the\n13 original colonies capturing to us that are coming to to to events celebrating the 250th.\nAnd so one of the things that we have the governor did and we partnered with is working with\nGeorgia Humanities and the Georgia Historical Society to really highlight the 250th. And Todd\nGross has done an amazing job with the Historical Society. The Mary Warn is our executive director\nof the Georgia Humanities. She married you a year in now, a little over a year in.\nHumanities does a terrific job of selling who we are as Georgians, capturing that and\ngiving it back to whether it's students or whether it's everyday Georgians to highlight\nwhat makes us unique about being a Georgian. And so we're all the three entities are on the\nGeorgia America 250 commission that was put together by the governor and we are working\ntogether to focus on pushing out all the content that your communities are doing to highlight\nthe 250th and we're very excited about that that $110,000 I think will be very impactful\nto help us do that and so with that chairman that's really all I have in my budget and\nhappy to take any questions. Thank you, Commissioner Wilson. We got a great\nstory to tell in the state, a great story to celebrate about our country this\nyear. Chairman Meeks. Thank you, Mr. Chairman. Commissioner, thank you for being\nhere today and the great work the department has done all across our state and\ncontinue work that we will do over the coming years. With a 3 million in the\namended budget is I think you answered it but would that specifically go to the\npromotion of broker? Not all of it but yeah part of that will and so chairman\nwhat we envision is you know that that money in several different\ntranches one is ad campaigns drive time drive time locations I mean we have to\nspend it this year and so we have to really push it out but you know this is\nnot because it's not an every year ad it is something that we need to be\nimpactful quick and so yes a lot of it will go toward that but not all of it\nthank you sir and mr. Chairman one additional question and thank you for the\ncomment you made about what y'all were working toward to bring communities\nfrom around our state to Atlanta to interact those that were here for the\ngames, as you know, over the past several meetings that we've had, we've expressed\ninterest in making sure that all of Georgia benefits from the World Cup games being\nhere.\nAnd you briefly mentioned America 250 and humanities being brought in to kind of be a part\nof that.\nAre there any other specific plans that have been made at least at this point as we begin\nthe 250th celebration?\nMary, do you want to talk a little bit about it?\nThank you so much.\nSo I will highlight a couple of the programs that we are working on.\nIt is our 50-50 year at Georgie Manny's, which is very exciting.\nSo as we approach the 250th anniversary, we're uniquely positioned to roll out programming\nacross the state.\nSo the first thing we're focusing on is America 250 grants.\nWe've gotten state funding for most of the time that we've been in existence and we're\nWe're very agile pushing that money out to local communities.\nWe are also starting this year, a new America 250 legacy program called The Georgia Circuit,\nwhich is a speaker's bureau where communities, local libraries, museums can have speakers,\nhistorians, artists, etc. come to their communities.\nAnd another big initiative we have is a museum on Main Street, which specifically addresses\nrural and small communities, and we bring a national level exhibit that is grounded in\nthe American Revolution to those communities.\nAnd we also have 15,000 students every year participate in National History Day, Georgia.\nAnd this year, the focus is revolution, reaction, and reform in history.\nSo we're really excited to get young students interested in this moment in time.\nThank you, ma'am.\nAnd thank you, Commissioner, and the great work that you're doing as we continue to bring\nsome great, uh, great events to our state. Thank you, Chair.\nSo there's five lights blinking and I will request everyone. Don't tell a story,\nask a question. And if the respondent can answer the question quickly,\nChairman Hubsteadler. Thank you. And thank you Commissioner Wilson for your work around the\nstate, particularly in my district. As you probably know, last April, I'd\nordered a study on the data center exemption, which the audits had UGA\ndo. And it shows this year that we're going to give out about 625 million\nwith potentially a lot of local property tax revenue, but very little\nstate revenue. But my question is, I'm hearing that they're also getting the\nmanufacturing credit and the high-tech computer equipment credit. My\nquestion is, are you aware of this or what extent that would be?\nChairman, I'm not aware of that and I think, you know, our friends at the Department of Revenue could probably answer it better.\nWe generally do not work data center projects because they are coming to Georgia.\nWe kind of send them to the utilities.\nThank you.\nRepresentative Heagley.\nWasn't it was Don Zella?\nSorry.\nI know it's gonna be Buckner.\nSorry.\nI'm trying to figure out who's called on apologize.\nWell, first of all, I want to say hooray for a family marketing Georgia having a background\nin marketing.\nI know how much we need that and I get so tired of being in the Columbus market hearing\nabout Robert Jones golf courses.\nBut I do have a little beef.\nI did hope that there will be some marketing done\nother than the great work that's being done\nby the Georgia Historical Society about America 250.\nAmerica 250 is this year.\nIt's not something we should have been planning\nthree years ago when it was first brought up.\nAnd I'm just hoping that we'll do a better job\nbecause South Carolina is doing a much better job\nthan Georgia on the celebrations of America 250.\nWell, that's what this $110,000 is going to go toward.\nAnd we'll make use of some of the other funding\nthat we get out of the amended budget for that as well.\nBut thank you for that.\nIt's very important.\nAnd we're 100% behind that effort\nand we'll definitely be picking things up this year.\nVery quickly.\nSenator Harbson.\nThank you, Mr. Chairman.\nMr. Wilson, for your input.\nI was wondering to thank, first of all,\nI just like to say the marketing budget seemed to be really low because of the job you have to do all of the greater\ntraction across the state of Georgia, especially in Columbus, Georgia, the longest urban rapids spring\nawful house and the mommy and the house and things like that. So I just wanted to make you for doing that particular work and the\nstrange to things that success is great.\nBut I wanted to say one thing, the $298 million\nis that a level of figure we get in compared to other years?\nIs that going down, coming up in a mask embedded\nin the context of, I'm saying some people have moved off\nshore way from Georgia.\nCan you expand on that?\nOn the film industry?\nSo that 298 million was specific to Stranger Things.\nAnd so that is just, and so that is a record\nfor any show that is filmed in the state of Georgia.\nBut that show wrapped, and so now we'll move on\nto the next show.\nBut if you look at film spending overall,\nour hot point was $4.4 billion, which was in 2023.\nAnd so this year, I believe we're at $2.4 billion.\nSo there was a significant drop.\nBut I think what you're seeing is a reset in the industry.\nAnd it's not that they're going back to California.\nThey're not going to New York.\nIt's that it's cheaper to film in Canada and the UK\nbecause of the teamsters contract that really\nhas raised the cost of filming in the United States,\nbut really specifically in Georgia.\nAnd so we are going to see a reset\nwhere Georgia becomes, I think, the hub of shows,\nand we'll see more and more shows like stranger things\nthat come, and the impact of a show is massive.\nYou know, we still see people going all over the state to, you know, to experience\nstranger things, going to Rome to, you know, the Vecna's house.\nYou know, there's a lot of stuff lingering impact from shows.\nAnd so, while it's down, it's still significantly more than it's been, you know, for years and\nyears.\nWell, thank you very much.\nI certainly would invite you to come down and shoot those rapids.\nI've done it.\nIt's fantastic.\nYeah.\nI understand your answer to Senator Hubsteader that you do not support incentives for data centers\nacross Georgia.\nNo, it's just that we don't work the projects and so I don't know what they're leveraging\nto come to Georgia.\ndo you support a moratorium on granting data senate permits given the tension around\nissues? Well, you know, we are a, we are not a policy making agency and so we just live\nwithin the rules that the governor and general assembly set and so, you know, as long as\nit's a community wants them and as long as, as long as they want to be in Georgia, then\nand it's hard for us to say no.\nRepresentative Synez, thank you Mr. Truman.\nCan we share a appreciate knowing the innovative ways\nwe're spending tourism dollars now?\nDoes the department have any figures on where we rank\nin terms of total tourism dollars\namong our other neighbors, states and the South?\nAnd what the second part of that would be,\nwhat investment we get back from those dollars?\nSure, we can pull that for you.\nIt's really a hard, it's hard to compare apples to apples\nwhen it comes to tourism.\nAnd we have community spending at a level\nthat is different than many of our states,\nlike Savannah's a great example.\nColumbus is a great example.\nSome of the shining stars in tourism,\nthey spend a huge amount of money too.\nAnd so we were able to leverage that together\nand we worked together.\nAnd that's kind of what we were trying to do here,\nis leverage our communities as well,\nand we work together.\nSo many times when you look at just state spending\nand tourism, the number of what's low,\nbut if you look at us with our partners,\nit is very comparable to many of our surrounding states.\nOkay guys, we gotta try to stay on schedule.\nCommissioner, thanks.\nI don't know, I wanna make sure I understood two things.\ndid you say how many what was our tourism number 140 million the number of\nfolks who visited 74 million people and that we do cat in the folks coming\nthrough heart store that number right yes that's about a hundred million\nof those right 117 around the state we got about 70 60 other million yeah\ndepending on you know yes rough yeah and then the three million you talked\nabout for transportation we got it in admin would there be a problem or not\ntransportation. Sorry, that's the next guy. Tourism. Would there be a problem with\nthat admin money moving to tourism since it's for tourism? Well, it's not all\nfor tourism and keeping it admin gives us flexibility to do website\nutilization and also as the governor put in their business recruitment too.\nSo it wouldn't go to tourism. All three men. It's not all three million is\nfor tourism but the majority is for tourism but you know there are things like\nand as Chairman Biggs mentioned are there things that will live on one of the\nthings that will is revamping the website and continuing to make that website\nbetter. Those things work for all divisions and so that's why I've\nbeen in administrative administration gives us more flexibility on where\nthat can go and how we can use it. We can give you a very detailed breakdown\ndown with some of the things we're looking at, Chairman.\nThanks.\nThank you.\nOn the other side of the question.\nThank you, Commissioner.\nThank you, Commissioner.\nCommissioner McMurray, DOT.\nSee, I just don't think I envision a world where we give another remark to the rest of the world.\nWhat does that thing mean?\nAll right, we've got to keep moving, folks.\nTurn to Rumble now, please.\nCommission McMurray.\nYes, sir.\nThank you, Mr. Chairman.\nThank you for this opportunity to present the amended FY 26 and 27 budget recommendations\non behalf of G.Dott.\nCertainly want to acknowledge our board state transportation board chairman Jamie Bosel\nfrom the 10th Congressional Districts here, came all the way from Athens, Georgia this\nmorning.\nThank you.\nAs I was preparing for this presentation, a quote came to mind, one of my favorite quotes\nabout leadership, and it says of leadership, one must first acknowledge his or her reality.\nSo with that, I want to share some realities as it relates to transportation in the budget.\nYou've heard from the governor, the economist, and Pat Wilson now about some of the great\neconomic successes of the state in sort of where we are.\nI want to pull that together as it relates to transportation and talk about some of those\nrealities.\nIn fact, Pat should have used this slide.\nI stole it right off his website showing the great economic success we've had.\nHow does that relate to transportation?\nWell, every economic success of a new business relies on the transportation network.\nAnd this slide does not even include Hyundai or Vivian and some of the other advanced manufacturing\nthat's going on across this entire state like Pat talked about how much work, how much\nnew work is being created outside of Atlanta.\nWell, listen, every one of those businesses relies on a road, a rail, an airport, a seaport\nor a now inland port as well, or they may cross multiple modes, so you can see that economic\ndevelopment and transportation are joined at the hip.\nAnother reality we must acknowledge is Georgia's growing.\nIn fact, Georgia Chambers predicts about 2.5 million more people by the year 2050, and\nto give you some perspective of that who's been to Houston metro area.\nThat's the equivalent of dropping Houston, Texas metro area into the state of Georgia in\nthe next 24 years.\nIn that population growth is going to happen all across the state, but very specifically\nin sort of the northeast metro, sort of the 4575-75 corridor, when more population becomes\nmore demands on our transportation system.\nAnother reality we need to acknowledge.\nThe business growth, especially with manufacturing and ag business growth, and you talked about\nthe governor, talked about the investment in our timber industry, which is critical to\nthis state, becomes freight growth because we all like to buy stuff, have it on our doorstep\nin the morning, and best I can check, we all like to eat well too, and I'm cognizant\nof the hours it relates to eating.\nThis chart shows 2015 to 2050, the left side shows the increased and tonnage of freight\nthat's moved on roads and railways and Georgia.\nThe simple math is freight tonnish almost doubles\nfrom 2015 to 2050.\nI say I'll call that having double vision.\nIf you see a truck today by 2050,\nthere'll be two trucks there.\nThe chart on the right gives you the cost of congestion\nbecause of without significant investment in our roadways\nand that number of more than doubles.\nAnd it's broken down by agribusiness,\ndistribution, and manufacturing.\nSo you can see the inputs of not investing\nhas a negative impact on the bottom line.\nAnd again, these charts were developed\nbefore Hyundai and Rivian were even done or underway.\nSo our planning director is working to update\nour freight charts and we'll get more information,\nbut you can see the significance.\nLet me share another reality with you.\nAnd this is a little bit deep.\nI understand the economists you've already had\nof full day of economy and economic inputs,\nbut this one really tells to tell.\nThis is the national highway construction cost index.\nThe red line is the 50 states actual bid prices\nover the last few years, starting in 2020,\ngoing through calendar year 2024.\nAnd that's indexed to other things,\nsuch as CPI, which is the green line.\nWe all talk about CPI as an indicator, right?\nWe all understand CPI, but I think you can see\nthe red line is outpacing CPI.\nThe employment cost index is the yellow dash lines\nsort of to the bottom there.\nAnd again, the last one is the blue line,\nwhich is the producer price index,\nwhich is really indicator,\nshow and cover industries like manufacturing, mining\nand agriculture, and it's always a good leading indicator.\nSo the national reality is here\nthat the cost of construction is,\nthe increased cost is outpaced all those things.\nSo it's sort of an interesting thing.\nI've showed this slide many times,\nand the trend has, this data goes through 2024.\nThe trend is ticking down just a little bit,\nbut it's not coming down fast at all.\nNow this is national information.\nLet me drive this home closer to us here in Georgia\nand show you from 2021 to FY 2025,\nwhat the cost to do in business have become.\nYou can see that resurfacing a two-lane road\nhas increased by 51% and that's now about 251,000 miles\nfor a two lane road.\nThis number is for just one lane.\nYou can see that urban widening and widening\nof a road in a rural area from a two lane to a four lane\nhas almost double, both 90% to 99% cost increase\nover those four physical years.\nReplacing our bridges, 93% cost increase\nfor the bridge projects.\nAnd I want you to remember that data point\nbecause I'm gonna come back to it in a minute.\nAnd the bottom table really just shows you\nwhat some of the commodities are\nthat make the bigger projects\nand what those cost increases are.\nAsphalt up about 60% aggregate gravel if you will,\n62% gargrel, metal, 35%\nand the beans necessary to do a bridge\nis about 45% increase.\nSo that's the reality that we've faced here in Georgia.\nAnd now we've taken our state budget\nfor the last, back to 2020, and indexed it to that national highway construction cost\nindex line to see how is Georgia keeping pace with these increase cost and the difference\ntells the story, right?\nWe all know that.\nWe've all experienced in our personal life.\nAnd the reality are that the cost are outpaced in the revenues.\nAnd that's at the state level, and guess what?\nAt the federal level too.\nIn fact, with the federal continuing resolution budgets that we have, there is absolutely\nWe know we increase in federal budget for the last two years and looks like we're headed\nto another continuing resolution for transportation.\nHopefully this week or next week about Congress, but we expect that investment to be flat.\nNow what does all this really mean?\nIt means as we plan projects, projects get delayed because unlike Washington, we do have to\nlive in physical constraint.\nAnd so our state transportation improvement plan, which is our four-year physically constrained\nprogram are so impacted. When costs go up, you basically deliver a project that's physically\nconstraint, you have to move a project to the next year. And when you move it into the\nnext year, like the graphic shows, it pushes another project out and another project gets\ncascaded into another year. So, projects gets cascaded into the future. And we never\nlike having to tell any of you that your project has now been moved out, because I'm pretty\nsure that in each of your districts, that's the number one project. And I've got to\nfill in that your number one project is probably more important than your\ncolleague in another district's number one project. At least that's what\nyou'll tell me, okay? So we understand the pain of that when that happens, but\nthat's the reality we have. But listen, I'm here to give you some good news. The\nreality of what Governor Kim has done in the leadership of this committee and\nand our other subcommittees on appropriations.\nOver the last two years has made a big\nand marked difference for Georgia.\nIn fact, to make Georgia's last better.\nAnd I want to acknowledge that reality\nwith you and show you what that looks like.\nSo we went back to the same National Highway\nConstruction Cost Index, the blue line,\nto show you what the inflationary reality has been.\nBut when we go back to amend it 24 and amend it 25,\nwith a 1.5 billion additional state general funds\ntwenty four in the additional billion dollars in the minute twenty five. You can see what\nthat's done. That's right sized us to get ahead of that inflation area impact. Now that\ndoesn't mean we go back and we solved all our problems but it means that we are now\ngaining ground instead of continuing to lose ground and that really has been important\nfor us to move projects ahead. So let me remind you how we views those dollars. Going\nback to amended 24 and 25, a big investment in airport aid at 98 million dollars, about\nhalf of that is to do a replacement airport in Griffin, that we would have lost federal\naviation administration money if we did not have the money in that budget year and then\nto address airports all around the state. The 250 million each year in local roads administration\nhas been huge. I have had no city or county complain whatsoever about getting that additional\nmoney. That you have either. Freight program, $500 million in each year. I'm\ngonna take a little bit deeper dive into freight in a minute. Capital\nconstruction, $593 million in the minute, 24. Again, because projects cost more\nand we were in physical constraint, we were pushing projects out. In fact, we\nwere able to advance 44 projects. Bring them ahead. 25 projects we were brought\nahead because there was not funding for it. And we created and started 19 other\nprojects that we would not have the money to start on that you know that need\nto be done without it. Basically those 25 projects we were able to advance we\nbrought them up 40 project years. So if a project moved up two years we called\nthat two project years. So those 25 projects advanced 40 project years. In just\nthe inflationary cost range by accelerating those projects save 75 million to\n300 million because we could do them now and not later with inflation where\ninflation as cost. Capital maintenance, again, I showed you that maintenance cost,\nrepaving had increased by about 51 percent. Again, $50 million to help drive toward getting\nthat better. And last but not least, let me just say thank you again for last year for\nthe Hurricane Debbie and Hurricane Helene funding. That $200 million was vital that we could\nagain, contract and use our crews to clean up from that devastating storms.\nJust a note, a footnote this is we've got less than $50 million reimbursement from FEMA\nso far.\nSo we'll keep you posted on as those reimbursements come in.\nNow let me show you how we put that money to work because that is tremendous investment\nthat you've chose to make and amend it 24 and 25.\nWe can see that 100% of our capital maintenance money has been expense.\nThis means this money has been paid out to contractors and vendors.\nconstruction and we're about 69 percent of that money going out the door for work being\ndone.\nAnd then the last two are amended 24 and 25 for freight.\nI remind you that we did not have a state freight program until a couple years ago and\nwe certainly appreciate both the House and Senate Transportation Committees for bringing\nthat forward and you passing that.\nAnd so we created a new program that we stood up and we have advanced 24 projects for\nthat $500 million in each year.\nNow you can see that expenditure is a little slow, but that's because we didn't even have\nthat program and we started projects and moving projects forward that otherwise we would\nnot have.\nAnd let me show you where the big three are that consume about $725 million of those\ndollars.\nOne is the wide 916.\nBy the way, these next three projects all would be under contract this calendar year,\nso we're very excited.\nIt's about $516, $520 million from 24 and 25 funds to widen 31 miles of I-16 up to the\nHyundai Meta Plant.\nWe know there's 23% trucks on that.\nThat's a high number by the way, 23% trucks on their states are very high number and we\nknow that widening I-16 will reduce delay by about 56%.\nWe're going to do this very innovative, we're going to let the contractors bid as far as\nthe money will go.\nInstead of telling them to build A to B, we're going to say here's how much money can\nand you build C to D to E and we'll bid that this summer.\nAgain, I-95, widening I-95 in Savannah\nfrom I-16 to South Carolina.\nSouth Carolina is widening to eight lanes right now.\nWe will take 95 to eight lanes as well.\nThat's about $74, $75 million investment,\nagain, bids this year.\nAnd lastly, state route 96,\nwhich will complete the last nine miles\nof a 25 mile corridor that goes from I-75\nover to I-16 there in Houston and Twix County.\nWe plan to bid this project in June\nand we'll complete that four-lane crossing south of making.\nThere's not a lot of east-west freight corridor connectivity\nsouth of making and this project does that.\nSo that will consume the remaining amount\nof those prior year appropriations\nand we're very excited to get that out.\nBut building on amended 24 and building on amended 25,\nI am so grateful and thankful for the governor\nmaking a recommendation of a historic $2.3 billion\nof state general fund strategic investment in our budget.\nSo let's take a look about what those items are.\nThe first is $100 million to address rural bridge projects\nthat support agribusiness in the timber industry\nacross our state.\nThese funds will be used to address those rural bridges\nthat are ready to be bid, but we didn't have the money.\nRemember that 91% or 93% cost increase in bridges\nover the last five years.\nSo we are working on bridges that they're stacking up,\nif you will, that we would not be able to advance\notherwise without this $100 million.\nNow give you a data point.\nThe average bridge cross is about $6.8 million.\nSo some smaller rural bridges or less,\nbut the average is about $6.8 million.\nNext, let's move over to state route 316,\nthat 40-some odd mile corridor from Gwinnett County,\nI-85 all the way to Athens, Georgia,\nUniversity Parkway.\nTraffic on that varies anywhere from about 30,000\nto up to 108,000 vehicles per day,\nwith about 12% trucks.\nNow, the thing about 316 that you all know\nis there's a lot of crashes.\nIn fact, about 1,300 crashes per year.\nIn fact, six of the intersections on state route 316\nare in our top 50 highest crash locations in the state\nand three more crack at the top 100.\nThat's not the list you want to be on.\nThe other thing we see is when the crashes happen,\nare very severe. In fact, four intersections have higher crash severity than anywhere else\nin the state, and one of them is almost double their severity index, which is not a good\nthing. Listen, if you've driven 316 lately, you can see that we have 18 intersections being\nconverted to either interchanges overpasses or a better access point along the way, but\nthis $200 million to Governor put in the budget is absolutely vital for us to be able to\nto work toward addressing the remaining 13 intersections\nthat need to be addressed to complete that corridor.\nSo we're very excited and thankful that this corridor\nultimately can be converted to very similar\nto like an interstator or freeway top experience\nto get you back and forth from Atlanta\nto Athens along the University of Parkway.\nNext, again, for GMA and ACCG, a home run,\nanother $250 million, which basically is\ndouble the local maintenance improvement grant money.\nAgain, we have been using this.\nThe cities and counties have been using this primarily\nfor resurfacing because of that data point I told you.\nThey're able to basically continue to resurface\ntheir programs across the state for cities and counties.\nThe other thing we've been committed to\nis get these dollars out quickly.\nSo we do this through electronic application process\nand the cities and counties since our list,\nwe get the money out very quickly.\nWe want to make sure that these dollars\nbe in deployed across the state. Next is a big project. Has anybody ever experienced\nexpress lanes on ICME 5 South and Henry County going the wrong way for you? Yes, okay.\nAll right, we'll move to the next slide. No, I'm just kidding. No, I'm just kidding.\nYeah. Chair McCarpner, I wonder how can you be wrong every time? Because I flipped the\ncoin and I'm not very lucky. But listen, post-panned different traffic patterns really change.\nIn the middle of the day, there's no longer a trough where traffic patterns dip down\nand pick back up in the afternoon.\nThey build in the morning, they just keep building all through the day, really change things\naround.\nListen, almost 200,000 vehicles per day, 20 to 25 percent trucks, you know it, you see\nit.\nEverybody experiences his corridor.\nThis segment of I-75, in fact, rate at the 12th most congested freight bottleneck in\nthe nation.\nAnother list we don't want to be on, you know it, you experience.\nSo currently, like I say, how can you be wrong half the time?\nWell, 45 to 50% of the time, you can't get the traffic\nin the direction it needs to go.\nSo what our plan is, is we take, instead of two lanes\nreversible, you'll have two lanes in both directions\nalong that corridor in Clayton and Henry County.\nSo there's always going in the right direction for you.\nWe know by doing that, that 70% more people can utilize\nthe lanes or 70% more people can travel through that\nin corridor, whether you're using the lanes or not,\nbecause it becomes less congested.\nMr. Commissioner.\nYes, sir, Mr. Chairman.\nHow far south are you going with that?\nI'm assuming Dublin would be a good answer.\nOh, great.\nAll the way to making would be nice.\nDo we know how far south we can take it?\nSo yeah, thank you for that question.\nLet me tell you what this money does,\nbecause that is an important aspect of what we can do.\nIs this money is a big number.\nThis would be real candid.\nIt's a big number.\nThis money's going to basically help us design it,\ndo the permitting, we have to buy property,\nand goes toward construction.\nSo we will be working with SIRTA, the toll authority,\nthis is in payments to SIRTA,\nso we'll work with the toll authority\nto figure out how do we optimize these dollars,\nbecause you will need more dollars than this\nto actually build the entire project.\nAnd what we want to do is make it go as far south as we can\nand we'll look at limits on both the north and the south side,\nBut this dollars gives us the ability to basically leverage these dollars to go further.\nAnd that's what our intent is to do.\nWe know we know where traffic stops down at Bill Gardner Parkway on 155 coming in.\nAnd we know that you're stuck getting going south as well.\nBut these dollars are absolutely critical.\nI'd say it's the minimum amount too that's necessary to give us confidence that we can advance this project.\nSo let me get into the budget now.\nAnd I know it's, I'm trying to get you way back on schedule.\nWe're going to jump into the actual budget now that I just want to hit those again.\nI thank Big Thanks for Governor for the State General Funds to do some amazing things for Georgia.\nHere's just the overall look at Amendit 26.\nSo Amendit's book page 39.\nBasically, it's a true up-and-ex size tax.\nIt calls the 26 Amendits based on the 25 actual collections.\nSo it was collected in 25's, appropriate at 26.\nthat's been trued up, $71.7 million,\nand you can see the $2.3 billion in state general funds\nI've talked about.\nI always like to show this slide.\nThis shows where the money goes.\nWhere is this money being investment?\nWell, obviously the payments to SIRTA\nis the express lane project that I just talked about\nat Louver 1.8 and all the end payments to SIRTA.\nCapital projects, again, 34% routine maintenance,\n11%, and then you see general operations\nabout 6% on down the line.\nBut I just want to show you where that money goes.\nLet's jump into the budget itself.\nIf you look at page 361, you'll see\nthere are major changes in the budget.\nLet me say this too.\nLet me say a thank you for the governor\nputting in the $2,000 one-time pace supplement\nto our employees.\nWe had a lot of dedicated employees working\nin the wee hours of Saturday night into Sunday morning\nso that you could be here today.\nWe clear all that snow out just amazingly.\nThanks for the sun.\nI would appreciate that.\nYou can see that our bond debt's going down a little bit,\nwhich is good.\nI just want to highlight the capital construction.\nThat shows the $200 million for $316 added\ninto capital construction, plus about $37 million of X size.\nSo we took the X size, that additional X size,\nand the mended, put it into capital construction.\nState general, excuse me, in capital maintenance,\nyou can see $100 million for the bridge replacements\nthat I talked about, shown up there in capital maintenance\nas well.\nOn the next slide, I'll just jump into these,\nhighlight a few things, which is on page 362,\nthe L-MIG increase, about $7 million again,\nadd it to L-MIG because of the increase in exercise\nto our budget.\nYou can see the $250 million of local roads\nand administration that I talked about.\nAnd then really important is routine maintenance.\nAgain, the men and women out in G.DOT\ntaking care of our roadways and road size\nand our contractors that we do.\nWe add at $21 million to that,\nto again deal with increased cost\nand maintenance contracting and just increased material cost.\nAnd also that has about 4.3 million of the state\none time funding for employees of $2,000 supplement in there.\nSo you can see what that increase is.\nAnd of course lastly, as the big one is the 1.796 million\nand additional funding for the payments to serve\nfor the 75 South Express lane.\nLet me jump into 2027 very quickly.\nThis is tab-tabilized on page 41, it's basically the excise as the estimate of where collections\nare forecast to go at 2.6 billion.\nTransportation trust fees, trust fund fees are based on 25 actual appropriations, so\nthat's getting rectified, so what was appropriate at last year being brought into the mended\nbudget, which added 15.5 million.\ntransit trust fund fees, those are those rideshare car service fees, at $3.8 million ad based\non collections and FY25. The reduction in state general funds or a combination of the\nseveral things, but part of that is a little bit of reduction in diesel locomotive excise\ntax, but it recommends a total increase of $148.2 million to the base budget for a grand\ntotal of $2.946 billion. Again, this slide shows where is the money being used. Very similar.\nObviously, the payments to SIRD will not go down because the 75 South Express lanes are not in\nthere, but you can see 53 percent of the budget is in the capital programs. 20 percent's in maintenance,\n10.5 percent's in general obligations and 10 percent's L-mig, but just showing you where the money's\ngoing. Very quickly, if you turn over to page 363, I'm just going to highlight two things. Capital\nconstruction. The increased X size, we put 112 million into, excuse me, increased 112\nmillion and X size was 98.7 million to the capital construction program and then 14.5 for\nadditional cost increases as well. And then at the very bottom, you can see the rail.\nI can show you that again, a little bit of the diesel tax on locomotive diesel reduced.\nNow all the negatives on this chart are mainly due to the reduction in state health benefit\nrate changes, so I'm not going through all that.\nIf you see a deduction, that's usually where it's tied to.\nAnd all those deductions were put back in the capital construction.\nOn the next slide, just again, Elmig got the increase there to be 10% of exercise collection.\nIf you go to page 366, you can see routine maintenance, again, $33.5 million at it for\nthe increase cost just trying to take care of doing the business and I just want to highlight\ntraffic management 4.4 million dollar increase that's dealing with increase cost that we have\nhad last year or in the current budget year there was a 2.3 million dollar decrease for the\nstate health benefit plan but also we've experienced our contracting for our TMC when you call\nfive one one those are all contracting employees and so that has gone up as\nwell as our ITS it's a camera signs technology just like your cell phone bill\nand cable bill keeps going up our costs go up on those things too we lose a lot\nof technology to keep people moving so in conclusion I just want to thank the\ngovernor for his budget proposal that absolutely moves Georgia forward for us\nto remain our number one state to do business as transportation so\nvitally imported to our business of Georgia. I really appreciate your support of\nthe State General Fund over the last two budget years. I wanted to demonstrate\nwhere those dollars are being used and that the dollars are absolutely being\nused that are making lives better for all Georgians no matter where they live.\nThis is across all of Georgia and I just want to pledge to you is that through\nthis budget you can count on G.Dot to get it done. So with that I'll be glad to\nentertain any questions or comments and oh the last thing is to quote I love\nthis quote because you you make this possible. The future is not something we\nenter, the future is something we create. So thank you for giving us the ability\nto create the future that all Georgians want. Thank you so much.\nThe longer you talk, the more light it started blinking.\nChairman Ron Stevens, is that you? Okay, Mr. Chairman's askers.\nWe're sharing Mr. Chairman. If I may, I'd like to take a moment members to recognize\nCommissioner on what we know that he does a great job every day, especially this upcoming weekend with the storm coming in\nOf how good a job he does\nHe has been selected chairman of ash toe, which is the American Association of state highway transportation officials\nFor this upcoming year and besides that just been a great honor. He'll be looking at the state\nResponse to the federal budget that's coming down and Russell. We just want to thank you for what you've done for George and in that recognition\nThank you, Mr. Chair.\nThanks, sir.\nChairman Hickman.\nThank you, Mr. Commissioner.\nGreat report.\nI appreciate your enthusiasm.\nBut we're a big fan of peach bass when we're going the right way.\nSo, with the new lanes, will they also have the peach bass going with it?\nwith and is that a big revenue generation or should a big\nrevenue generation for our state of peach bad?\nSo yes, you will continue to be able to use peach passes as\nwe deploy this project and the revenue will be something\nthat we actually model and look at is how do we work to\nfinance the project.\nSo that is you try to let those revenues offset your cost.\nAnd so we try to use the less public dollars as possible\nfor those lanes.\nSo but this was in the budget of sort of the bare minimum\nto help us offset the cost which will be much higher than\nthe 1.796 billion. Yes sir. Chairman Hockins.\nI've got two quick questions. One, you know, we were told as the price of oil went up, price\nof asphalt went up. Now that price of oil is coming down, are we going to see slower\nincreases in asphalt? I think petroleum products drive asphalt. We actually have seen\nprocess come down some but not probably at the rate that we might have thought but then\nyou look at the other components the aggregate which is 60 about 60% increase laborers increased\nall these other components so we have seen that we have seen that come down in fact some\nof my FY 24 numbers were higher than my FY 25 numbers so we have seen a small retreat\nbut we haven't seen it go back to 2020 year numbers.\nAnd number two, Hall County is proud of you and there's a Hall County son.\nThe question is, how soon are you getting the signs up on 985 to get out of the left-hand lane?\nMr. Chairman, I moved even further north into Hall County and I have observed your same headaches.\nWe'll try to work on that.\nThank you.\nI just need to remind everybody that we have to take members questions of the committee\nchairman LaHoodett.\nThank you, Mr. Chairman.\nCommission appreciate the great report on how thorough it was and informative.\nI've got a question about related to the federal government shutdown and where there\nwere some concerns raised at some recent board meetings about potential laps in funding.\nHow do you handle that?\nYeah, thank you.\nSo, interestingly enough, at the federal level, the federal gas tax allows money to continue\nto flow.\nThe challenge is, though, they're only appropriate on a continual resolution.\nYou get one daily pro-rata share of your money, and so it's hard to run a business to develop\nprojects.\nIf you get one three sixty-fifth of your funding when you only get a month or two weeks\ncontinue in resolution, so the good news is the money keeps flowing so we can pay contractors\nand vendors for what they've done. The challenge becomes is how do we advance another federal\nproject when there's not the guarantee that you're going to get that federal money to reimburse\nthem. So that's the balancing act we have. The federal government lets you do an IOU with\nthem. And we take advantage of that so we can try to keep projects moving because we don't\nwant to slow things down. But at some point we have to, the IOU as we pay it forward with\nour state funds and then as soon as there's quote real federal money we reimburs\nourselves. So we can't get ahead of our skis and we don't want to put ourselves\nin jeopardy by fronting the federal budget too far. So that's always the\nperil we're in at this time of year and we watch it closely. Matter of fact I've\ngot a meeting this afternoon to talk about that very thing is what this next\nmonth and the next month look like for letting with federal projects. Hopefully\nthey'll get a continuing resolution passed for the entire budget year this\nweek or next before the end of the month, which gives us certainty.\nI appreciate you being prepared for that and one more quick question related to the express\nlane.\nI was a beneficiary this morning driving on from out Austin, hitting the Northbound express\nlane.\nIt worked great.\nSo I think that's been a tremendous success.\nHow would you compare the original peach pass on I-75, the funding that that required to\nthe funding for this expansion and any key differences\nbetween the two products.\nYeah, so it was originally funded through GDOT\nand there was a small bond sold for that project\nway back then through the total authority.\nAnd when that's been how long it's been in existence,\nbut that was probably a couple hundred million dollar\nproject back then, there may be 500 million I'm guessing.\nBut now obviously with this cost increase\nthat we've seen in our last five years historic,\nbasically double in processing,\nso it's a lot more than it was back then.\nBut in then again, when that was put in place,\ntraffic patterns where everybody went into Atlanta\nin the morning and out in the afternoon,\nand we didn't have this thing in the middle of the day\nthat we were all experiencing now,\nwhich is not gonna go away.\nThank you.\nWe'll be right back.\nThank you, Mr. Chairman.\nI wanna also reiterate what Chairman Jasper said.\nIt is just a pleasure to serve with such a gentleman like yourself.\nI'm always worried that DC is going to scoop you up and take you out.\nSo I hope that that never comes.\nBut my question is, you and I have had conversations about this.\nI'm very happy about the Governor's proposal to put in the extra lanes there coming through\nHenry County.\nIn 4 a.m., there's not a bunch of traffic, but what there is a lot of at 4 a.m.\nis semis parked along the medium.\nAnd I know you've talked about some solutions for that.\nDo we have any plans to maybe put in some more\nrest areas for that?\nBecause to me, it just seems like a recipe for disaster\nwhen you got 60, I mean, literally 60, 100 trucks parked\nalong the medium in and out of exits.\nAnd they're sleeping there because they\nhave nowhere to park. Thank you for that. That's a recognition of all the freight\ntunnish just being moved through Georgia and culminates right here in\nMetro Atlanta. So we are working at our rest areas, visitor centers and\nwaste stations to increase parking in the land that we own. So we have projects\nunderway. I think at every visitor center, rest area and waste station is in\ndesign at this point and will continue to build, did those and build those as we\nWe're using a combination of state and federal funding to try to address that.\nAnd it's still going to be hard to address that need as we continue to grow.\nA private sector needs to help solve that issue for sure.\nBut we've got to try to make it safe.\nAnd as like I said, there's stacked up.\nAnd the later the night or the earlier in the morning, the freight volumes,\nlike I said, were 20 to 25 percent on I-75.\nBut at 4am, they're probably about 80 to 90 percent on 75.\nWhat are y'all doing at 4 a.m. on the interest anyway?\nRepresentative Glaze, last question.\nEarly bird.\nThank you so much, Commissioner.\nI'm at 85, exit 61.\nYou're now making sure that we can get through there and the soccer headquarters is accessible.\nWe appreciate you.\nThe question is, are there any state or local projects that have been put on hold or\nstop because of the infrastructure grant.\nSo in Georgia, in the US, a federal infrastructure grant,\nthe answer is yes, the stitch project\nover the downtown connector was one of those grants\nthat got held up.\nThere's a belt line project that has moved forward.\nIt got held up a little bit, but it's moving forward.\nBut those are the two, excuse me, there's a third one.\nThere's also a trail in South Fulton Trail there.\nI think that is, got, did not meet the requirement\nof the federal government.\nThose are all federal decisions\nwere not involved in those.\nWould there be any kind of back-filling then\nfor those projects, or would they be looked at\nfrom the state level?\nWe probably don't have a budget program\nthat sort of fits those, but there are some other federal\nbudget programs that could be that you could use\nother fund sources for.\nWe can talk offline about some of those, yeah.\nOkay, thank you.\nThank you commissioner thank you I gave you some propaganda please look at it's\nvery helpful a lot of helpful information to hear about how the money gets spent\nand our transparency thank you mr. Chairman next up is Commissioner Raive\nCulture and Tyler Harper\nYou\nAll right, y'all, let's try to get this done and get the Commissioner Harper to see\nhow short he can make his presentation so we can get lunch.\nAll right.\nWell, thank you, Mr. Chairman.\nI appreciate the levity and definitely appreciate the fact that we still have the opportunity\nto have those particular jokes.\nI apologize I didn't bring my stool today.\nIt is still on the Senate floor.\nI no longer have it anymore.\nBut hopefully what I lack in stature, Mr. Chairman,\nover the last couple of years,\nwe've been able to make up for our efforts together\nto ensure that our number one industry\ncontinues to be successful.\nAnd that's what we're here to talk about today.\nBut to Chairman Tiller, he said that we didn't budget\nfor our stool.\nAmen. I appreciate that actually. So Chairman Hatchett, Chairman Tillery, members of the\nAppropriations Committee, members of the General Assembly, it is an honor to be here today\nto talk about what we have going on at the Department of Agriculture and our budget request\nand things that are happening in our number one industry. As many of you know, the state\nof agriculture across the country is in pretty tough times right now. So it's critical\nthat we have agency and an agency that can continue to help through those difficult times.\nAnd that's the role that we have at the Department of Agriculture and Insuring that our agricultural\nindustry is successful every single day and I realize that I'm the last one before lunch\nbut how appropriate to talk about agriculture than right before lunch.\nAnd that's what we're here to do today.\nSo just a brief overview, as all they all know, agriculture is our number one industry.\nI don't have to tell you that.\nFor the number one state and a number of different commodities, we do phenomenally well.\nWe grow almost 200 commodities in our state.\nBut in addition to being the number one industry at the department, we do a lot of other things,\nlike we weigh the lottery balls.\nMost people don't know that we do that.\nWe inspect gas pumps and structural pest control companies and entities.\nThere's a lot that we do as an agency that ties back to the success of our number one industry.\nAs I said, our number and industry can't be successful if the agency that oversees it\nisn't successful as well and working together over the last couple of years we've been able\nto work toward that goal and continue to allow our agency to have the resources it needs\nto be successful.\nWe have a little over about 570 employees in the Department of Agriculture over 22 different\ndivisions and programs whenever you talk about the number of programs that number gets\nsignificantly larger. We have over 70 different licenses that we issue as an agency to the tune of over 88,000 licensed entities.\nOur funding split is about 80-20 between federal and state dollars. And in addition to the four program areas, we have at the Department of Agriculture of Marketing Administration, Consumer Protection, and now the Rural Center.\nThere are 23 different other entities\nthat flow through the department of agriculture.\nSo there's a lot of pass-through funding\nthat goes through us to other entities through our budget.\nAnd so we have about 23 attached agencies\nat the department of agriculture.\nTalking about one of those four program areas,\nworking with y'all last year, the role center was moved\nfrom the university system of Georgia\nto the department of agriculture.\nThat was official on July 1st.\nThat really didn't become officially official\nand fully integrated under the department\nuntil January 1st.\nThere's a lot that goes into that with employee movements\non calendar years versus fiscal years.\nBut all of the role center is now completely integrated\nin the department of agriculture.\nIt was a smooth transition between us\nand the university system of Georgia.\nMany of you know we have a new executive director there now\nnamed Charlie Five Ash, who has hit the ground running.\nwith the other employees at the rural center in ensuring that we're doing the job that\nwe are tasked to do. That is working in rural communities across our state on things like\nhealth care and education and workforce and how working with the ag sector in those communities\nwe can ensure that that particular community can be successful because if we don't have\nquality access to health care education and workforce the number one industry in those\nrural communities can't be successful which is agriculture and that's what we believe\nthe rural center does every single day, and we're going to continue to move forward with\nthat mission.\nThere, just to give you another point, the rural center is now completely housed in\ndepartment-provided facilities at our lab in Tifton, Georgia.\nWe were able to move some space around there with the federal state and provide some lab\nspace for them.\nSomething I know that is on the top of mind of a lot of people.\nThe governor talked about Hurricane Helene this morning in his comments.\nI want to briefly give you an update there really quick.\nThe Georgia Development Authority, as many of you know, falls one of those entities that\nfalls under the Department of Agriculture.\nThanks to your help, we were able to secure significant funding to ensure that our farmers\nand farm families were able to get on their feet.\nAs of the end of this month, we will completely close out the GDA loan program.\nWe will have issued 488 loans for a total of 164,583,723 dollars that are going to farm\nfamilies significantly impacted.\n$15 million of that was funds that GDA brought to the table from safety 21, from the previous\nhurricane, and we were able to add to the $150 million pot you gave us.\nForestry obviously has the 135 million.\nI know director Sabo is gonna speak more directly to that\nand his presentation to you on Thursday\nas to where the status of that is.\nIt is a partnership between GDA,\nthe Development Authority and Georgia Forestry Commission\nand they've taken the lead on that\nand I will let him discuss that.\nIn regards to the block grant,\nas many of you know, we announced in October\nthat Georgia will be receiving over $531 million\nin block grant funds to help farmers, producers,\nRanchers and Timberland owners across our state\ncontinue to recover from Hurricane Helene.\nWe are in final review with USDA.\nMatter of fact, I talked to the Secretary's office this morning,\nand they gave me confidence that it is moving\nthrough the OGC review process quickly.\nBut as soon as they give us the green light,\nwe will be rolling fast.\nI feel very optimistic that we are very close to that.\nBut at the department, we have already set up everything\nwe need to get rolling.\nWe already have the application ready to go.\nWe have a website that's already live,\nfarmrecovery.com.\nThat's what this is a snapshot from.\nWe have already put together FAQs that's already public\nfor farmers, for every single commodity that is covered\nby the block grant.\nSo you can go ahead and have the documentation you need\nprepared ready to go once that application period opens.\nThis is significantly different than Hurricane Michael.\nWe couldn't use that plan because this process\nwas significantly different.\nIt was different in many, many ways.\nIt was in some cases the inverse\nof the way the process worked with Hurricane Michael\nand how that block grant worked.\nBut we are covering more commodities, more producers\nthan any other state that has a block grant.\nI've been told that directly by USDA\nand I think that is something that we as a state\nshould be proud of.\nWe are covering more people, more producers,\nmore commodities than anybody else\nthrough our block grant program.\nBut we have got everything ready to go.\nOur banking structures in place, and we have hired a retired USDA\nFSA employee who is running the program for us,\nand we have hired a number of other retired USDA employees\nwho are very familiar with USDA programs and programming.\nThey are experts in this field, which is why we brought them\non board, and they will be the ones that will help us execute\nthis block grant and get this funding out to our producers\nas quickly as possible.\nIf you want to find out more, obviously farmrecovery.com\nis the website, and that's where we're encouraging folks\nto go.\nAs many of you know, we also have the Farmland Conservation\nCouncil an update on that really quick.\nThis time last year was when all of the council members\nwere appointed by the various entities\nthat were appointing those particular positions.\nThat had to be done before we could really go to work.\nOnce that council was put in place,\nwe hit the ground running.\nWorking with the council to get rules and regulations set up those or went through the entire\n60-day process like it has to go through at the end of September.\nThat was completed.\nWe began working on the application.\nThe application is now with the council.\nThey are supposed to be getting that comment back to us on their review comments on the\napplication.\nOnce the council approves the application, that application will go live to begin protecting\nfarmland in the great state of Georgia.\nAnd we look forward to doing that and appreciate our partnership in doing that as well.\nAs y'all know, we've been dealing with a lot of high-path even influenza over the last\ncouple of years.\nJust this week, last week, we had our, what we consider the fourth detection of a commercial\npoultry flock in our state.\nAnd it was in Walker County.\nOur team immediately went to work.\nWe activated our emergency operation center, the Department of Agriculture immediately.\nless than 12 hours, we had the site completely locked down in every farm and the quarantine zone\ncompletely quarantined, to ensure that the virus would not spread any further than where\nit was.\nY'all know poultry is in Georgia, it's our number one ad commodity, over a third of Georgia\nagriculture's poultry.\nWe're the number one poultry state in the nation, so it is significant issue for us that\nwe face every single day.\nAnd I want to say thank you to the members of the General Assembly.\nThis year you appropriated $450,000 to the department to help us get the resources we need to be as best prepared as possible.\nBut to kind of put it in perspective, in fiscal year 25, HPA, I cost the department of agriculture over $300,000 to respond.\nA lot of that was due to our significant hands on response in those particular cases.\nBecause not every poultry integrator and every company that we work with has the same resources and tools to respond to those particular events.\nThankfully for us, the last two responses, those integrators and those companies have additional resources they've been able to bring to the table, so it's not cost the department as much to respond, but still at the height of this response in Walker County as an example, we had over 70 people deployed in response stage P.A.I.\nThat includes department employees as well as private employees and others, so it is a huge, huge response.\nThere's a lot that goes into this.\nBut in Georgia, we've done a really good job.\n200 million birds affected nationwide,\nonly 500,000 in our state.\nI think that goes to show the work that we've done as an agency,\nthe work that industry has done in bio-security,\nto help ensure that we keep this out of the state of Georgia.\nWe still got a lot of work to do, but it's not going away.\nJust in the last 30 days, 29 states,\n67 flocks over 1.84 million birds have been impacted\nby HPAI in the last 30 days alone.\nWe know this is going to be a continued effort\nthat we've got to work on together,\nand we appreciate our work in doing that\nand appreciate your help in helping us ensure\nthat we're able to respond as quickly as possible.\nI'm going to briefly mention this.\nThe yellowlegged hornet is something\nwe're still dealing with just to put it in perspective.\nThis is a dashboard we have at the Department of Agriculture.\nWe've done 92,500 inspections looking for this thing\nover the last two and a half years.\nIt is a threat to our honeybee, as you know.\nBut this takes resources away from other things\nthat our staff normally does on a day-to-day basis.\nNow we have the cotton jassad.\nWe also have the spotted lantern flower.\nThose are other things that have come to fruition\nin the last two years that the department\nhas a responsibility to respond to\nto protect our agricultural and our industry\nand our food security in our state.\nSome of this, we get offset funding\nfrom the federal government in response,\nbut it doesn't cover our entire cost.\nSo especially when you talk about taking employees\noff of their normal day-to-day job\nto respond to these incidences,\nit increases our workload as an agency.\nAnd it's definitely something we continue to respond to.\nBriefly on the hemp program,\nI know this is something we've been working on\nover the last couple of years.\nThis is a snapshot of our dashboard\nthat we have on our hemp program too,\nthat we have at the Department of Agriculture,\nwhich since we really have been locking down\non ensuring that this is taken care of,\nour team has done over 1,100 inspections.\nWe found over 1,200 violations.\nThose violations range in a lot of different ways,\nbut to give you an idea,\nthe number one violation we find is lack of certificate\nof analysis, we find lack of warning labels,\nand we also find that they're still trying to sell stuff\nthat looks like food or candy,\nwhich is something we're taking a hard stance against.\nJust to put it in perspective, we've done those over 1100 inspections with five people\nThey've been really hitting the ground run and hard. We have two license coordinators\nThanks to your help that are working on getting those 8,000 license\nIssued that's brought in over two million dollars in revenue to the state now we know where these entities are and we can regulate them of\nThose 1200 violations 54 of them have been referred to our law enforcement division for criminal investigation\ninvestigation. Actually 81 of them have been referred for criminal investigation.\n27 of those have been related to under 21 issues where we have done undercover\nstings and found issues across the state and we have been locking people up and\ntaking people to jail for doing things that they shouldn't be doing. We've been\ndoing that in conjunction with local law enforcement, other 50, the other 54\nor different other criminal investigations ranging from selling things that\nthey shouldn't be selling and calling it him. We've been doing a lot of that\nwork. We get about a little over a million dollars to operate our hemp program and like I said,\nit brings in a little over two million dollars in revenue to the state. Obviously, we're working\nwith the resources that we have, but appreciate your help as we continue working together to keep\nthis out of the hands of folks that don't need it and allow it to be a successful program at the same\ntime. The Gate Trust Fund or the Georgia Ag Trust Fund, we primarily use this and I'll brief over\nover this really fast.\nWe have center, every year we're required to send a report\nto this OPB, the House and Senate budget offices\non the funding and how we allocate that funding\nthrough the trust fund.\nThat report is available to anybody that wants a copy.\nIf you would like a copy, I think we have a few with us.\nIf you would like a copy, please see Catherine Russell\non our policy team.\nShe can make sure you get a copy of this report.\nI would encourage you to get it.\nIt is a, I think it's a great report.\nI think it really details out the work we've been doing\nthe farmers markets and the work we've been doing elsewhere across the state but just to put it\nin perspective our farmers market bring in over a billion dollars a year and produce sales in the\nstate of Georgia, a billion dollars a year. That is a lot of activity and so our farmers markets\nare important to our state and we use this funding in addition to the other funding that you have\nhelped us with to help upkeep our markets but it's not a lot of money here it's only a couple\na million a year. And that doesn't go very far when you're talking about significant amounts\nof issues and maintenance that are required to help us upkeep our markets. Alright, moving\ninto the budget. The governor's budget is, I'm just going to be very brief here. He provided\nus some significant investments and we're very appreciative of the governor and our work\ntogether and ensuring that our agency continues to be successful. Some of this I'll mention\nin just a second, but these are some things that we ask for, and the governor helped provide\nsome of that funding for us.\nAn inspection software for food safety, a million dollars when it comes to our employee retention\nprograms, but also some shortfalls that we have, I'll talk about that in just a second,\nsome cost of living adjustments, among and including the $2,000 supplement that he mentioned\nin his state of the state, we are appreciative of that.\nI'm gonna really get into more of this in just a second,\nbut the governor included a lot of the funding\nthat we have asked for,\nbut we really appreciate our work with him\nto ensure that our employees and our agency\nhas the resources it needs to do its job.\nObviously, he up the Georgia Grown Wood program\nthat we've been proud to partner\nwith the Georgia Forestry Commission on\nas a direct partnership through the department\nand the commission, and obviously we're working\nto through that to promote Georgia Grown Wood,\nand find ways to recruit companies to our state\nto help us continue to allow our forestry sector\nto be successful.\nIt's taken some significant hits in the last year,\nsignificant hits.\nAnd we've got to work together to ensure forestry is successful\nand we're proud to be part of that partnership\nand continue to work with the Forestry Commission\nand others to promote our forestry sector\nand what we're doing.\nThis is the governor's FY25 budget recommendations.\nAgain, additional funding for software\nthat we asked for some adjustments related to colas\nand other things where we found where we had some shortfalls\nand in addition to that, making some adjustments\nin the budget related to other things\nthat were put in the budget last year.\nObviously, the center's budget continues to be the same.\nOur capital projects in the budget, the governor included,\nwere vehicle replacement funding for the lab at the farmer's market as well as the final\nrecommissioning funding that we need for our Tifton laboratory in Tifton.\nWe would appreciate your help in keeping that funding from the governor in the budget,\nbut in addition to keeping that funding in the budget, we do have some additional needs.\nI will start obviously with the vehicle funding that the governor included.\nAs I have mentioned to y'all every year, at the Department of Agriculture we have significant\nturnover when it comes to our vehicles. We are just trying to catch up. When I\nwalked in the door, the department, we had an over three and a half million dollar\nneed and vehicles alone. We all have helped us whittle that down. But our agency\njust like any other state agency that utilizes vehicles, we have a constant\nyearly need for that. We would appreciate your help in funding that and our\nwork together to help us continue to fund that need year in and year out. In\nin many cases, this is our employee's office,\nis that vehicle.\nBecause that is how they do the job\nthat we ask them to do every single day.\nIn addition to that, the new lab\nthat we have talked about last year,\nmany of you know we had the food safety\nand dairy lab was in the ag building across the street.\nTimes are different now.\nThanks to your help last year,\nyou included funding for design for a new lab\nto go at the farmers market and forest park\nhere in Atlanta to help us meet our demand currently and also look toward the future.\nThe lab space here on Capitol Hill just was not meeting that need.\nWe were having to send samples out of state to be taken care of because we didn't have\nthe space to do them here.\nAnd you can imagine if we ever had an outbreak or a huge concern, that timing is of the essence.\nAnd it's critical that we have the resources in our labs to be able to do the job.\nWe have a lab footprint in Tifton.\nI would love to take you all there if you're ever interested\nand show you what we do in Tifton.\nIn Tifton has space to serve as a backup to the lab here\nin Atlanta.\nThe lab in Atlanta mainly houses our food and dairy\ndivisions.\nThe lab in Tifton houses things like fuels\nand metrology, seed feed fertilizer, those things.\nOur Tifton lab can serve as a backup.\nUnfortunately, Atlanta in its current capacity cannot.\nWe are currently using space at Georgia Tech\nto the tune of over $1.1 million a year in rent,\nso it is costing us significantly as an agency.\nSo we would appreciate your help in helping us build\nthe lab and the space that we need to operate as an agency.\nOur estimates are 34 million.\nI've been working with just Vic, or we have as an agency,\nfor construction.\nI understand that they are not complete\nwith their finalization right now.\nBut in our conversation, they have led me to believe\nthat our number based on the need\nthat we have shared with them is the number\nto continue to pursue.\nAnd so we're asking for, in addition to the governor's\n25 million, we would appreciate the additional nine\nto complete the construction amount needed\nfor our farmer's market lab.\nAnd we would be happy to dig into that if needed\nis to exactly what all of that covers.\nIn response to operational needs that we have,\nthe governor funded about two and a half million\nof our three point, a little over $3.8 million ask.\nThat's everything from computers to software needs\nthat we have as an agency.\nA lot of those software needs are critical for us.\nWe're trying to define new ways to enhance\nour inspection systems to be more efficient\nand more effective as an agency.\nSo that funding is critical.\nSo we look forward to working with you\nto hopefully obtaining the additional amounts\nof that funding we need,\nespecially for our software program.\nIn addition to that, as an agency,\nwe have completely been significantly impacted.\nDuring the last year, the Biden administration,\nwe saw a $1.1 million cut in federal funding\nto our agency.\nThat is a significant hit to us.\nAnd it is caused significant issues,\nobviously, for our budget.\nAnd because those programs still have to continue,\nWe got to find ways to fund those.\nSo we're asking for your assistance\nin helping us address those issues\nand continue on to find ways to help fund the needs we have.\nWe also are asking for funding to help cover\nthe shortfall of the coal as in the pay raises\nthat the General Assembly provided our agency.\nThat was not enough funding to cover our entire agency\nand cover the need that we have as an agency.\nWe are still trying to find and sure\nthat those employees are covered.\nIn same way when it comes to federal funding,\nWhenever we do pay raises, I have employees that are funded 50% state, 50% federal.\nWe still cover those employees pay raise, but and work with the feds to hopefully get\na reimbursement increase so we can cover that portion of their salary.\nUnfortunately in my three years, I have asked every year, we continue to ask every year,\nwe have yet to get the reimbursement from the feds to cover that portion of the pay raise.\nSo we are covering that internally in our own budget and finding ways to do that.\nAnd so it makes it difficult for us as an agency, as operational costs continue to increase.\nAnd as you try to find those ways to cover those costs for those employees that deserve\nthat funding, it puts a strain on your budget.\nSo that's why we're asking for this operational funding increase to give us the resources\nwe need to provide our agency, the tools it needs to do, the job that we are asked to do\nevery single day, and help us take care of our people and our employees and with your\nhelp we can do just that. Finally I'll hit on this really quick to put it in\nperspective. Since I walked in the door in 2023 we have seen a 33% increase in\nlicensed entities in our state 33% and that same time period we have increased\nour employment by around 12%. It was about 500 when I walked in the door we're\nabout 570 now we still have about 80 or so vacancies. Even though we've\nincreased employee count by about 12% employee workload has increased by almost 14% because\nof the number of entities that we have to oversee regulate and inspect. So just because we've\nincreased the amount of people that we have on our payroll doesn't necessarily mean\nthat we have gotten more efficient. We have actually increased the workload on our people\nand I think it's important for us to work together to continue to address that. In that\nThat same time period, just in the last 12 months, we have declined a license application\nfor 22 meat processing facilities in our state because we don't have the staffing necessary\nto provide the individuals needed for those entities to operate.\nThat means that's 22 businesses that aren't operating, that aren't employing Georgians,\nthat aren't paying taxes, that aren't providing access to farmers and producers to get their\nproduct to market.\nAs an agency, we have a responsibility that we're providing that access for our farmers\nand producers every single day in protecting this food supply and everything that we do\nas an agency.\nAnd so we have a lot of work to do in our work together to ensure that we're providing\nthat resourcefulness to our state.\nWe continue to see an increase in violations, matter of fact over a 30% increase in violations\nin food safety.\nWe have seen a 45% increase in violations in our companion animal division, and I want\nto thank our companion animal team and our law enforcement team that have worked together\nto address animal abuse in our state in significant ways.\nAnd I will point out one thing because it's a typo.\nBut we did 15,000 inspections on 113,000 pumps last year in our fuel and measures division.\nSo it takes us almost two years to inspect the gas pumps in this state because we have\nalmost 200,000 in the state of Georgia and as y'all know as you travel this\nstate, there are new gas stations going up every single day. That means more\nresources that we have to deploy to ensure that our agency is successful. So\nworking together, working with you, we can ensure that our number one industry is\nsuccessful. We can ensure that agriculture continues to be top of mind. We can\nensure that the businesses and entities that are regulated by us at the\nDepartment of Agriculture are able to do their job every single day and\nproviding the food, fiber and shelter we rely on and I appreciate our work\ntogether in doing just that and I look forward to our conversations over the\nnext 90 days or so. 40 days 40s at 40 nights and 90 or 90 days and 40 nights or\n90 nights and 40 days whatever it is as we work together to do just that so\nthank y'all for giving me an opportunity to give you a brief update and\nan overview on the department, our funding, and our needs as an agency to continue to do\nthe job that we've been asked to do every single day.\nThank you.\nThank you, Mr. Harper.\nTwo questions.\nChair Lady Taylor.\nOkay.\nChairman Meeks.\nThank you, Mr. Chair.\nThank you, Mr. Chairman.\nAnd, Mr. Commissioner, thank you for the great work that you were doing and your department\nand employees are certainly no lack of work to be done in our agriculture industry and\nchallenges that we have ahead so thank you for what you were doing. Two quick\nquestions, one on your employment retention within the Consumer Protection\nDivision. What kind of turnover rate do you have within that division?\nMr. Chairman, I will tell you I will get you an exact number because I will\nrather give you an exact number than tell you where we are but I will say\nthis, though, that said we had about 120 or 30 vacancies when I walked in the door.\nWe have lost a number of employees, we have gained employees, and in that time period in\nthe three years I've been commissioner, we've whittled that down to about 75 or 80.\nSo we're making progress, we're making headway, we're going the right way because of your\nhelp in giving us significant pay raise and salary increases for our employees and helping\nus ensure that we're paying the people the boots on the ground. So we're heading in the right direction,\nbut unfortunately we're not getting there quick enough to keep up with the workload that our\nagency has and any continued efforts to help us ensure that we're able to do that would be\nappreciative, but we can get you an exact number on that. Thank you, Commissioner. And lastly,\nwith the lab down at the land of farmers market, we hope that that's going to be a mass timber\nproject built out of timber produced here in Georgia. And then lastly, would the\nreimbursement from the Feds understanding that pay raises is one thing, but\nwould the other agreements that we have working with the Feds are reimbursements\ncoming in a timely manner to the department? Some of those reimbursements actually\nto your point, Mr. Chairman, some of those reimbursements we've actually\ncompletely lost as I mentioned just a second ago in some in our food safety and\nour meat inspection program. Some of those have been delayed, but for the most\npart, we have been able to get, I believe, most of the funding that we, that I have not\nspoken to directly in the presentation today, we're able to, we've been able to receive\nthat particular funding, but we get funding from a variety of sources, EPA, FDA, USDA, so\nthere's a lot of different areas and agencies that we deal with as an agency in the federal\nfunding that we receive, but other than the specific areas I pointed out, meet inspection\nand food safety where we have lost funding or not been getting reimbursed as appropriately.\nThe funding has been coming to our agency in a timely manner.\nObviously, this shutdown affected us a little bit, but we were able to overcome that.\nBut we're in a, when it comes to those other areas, we have been getting the funding as\nrequired, but we still have some shortfalls in a number of other areas.\nWell, thank you, Commissioner.\nI look forward to working with you to address the many issues we have, including the short\nfall that we have and being able to issue license for people to do business the number\none state in the country.\nThank you, Mr. Chairman.\nRepresentative Buckner.\nThank you, Mr. Chairman.\nThank you for all that you did for agriculture and Georgia.\nOn page 393 of our budget, there is a report that Georgia Economic Report and it mentions\na couple of times.\nRepresentative, you hold the mic to your mouth.\nIt talks about non-farm payrolls in Georgia,\nbut there's no mention of farm payrolls anywhere\nthat I can find in that Georgia economic report.\nWhat's the picture of farm payrolls in Georgia?\nRepresentative Buckner, I would have\nto get that information back to you.\nObviously, this Friday is the agricultural forecast, which\nthe University of Georgia will be rolling out\na lot of that economics.\nI will tell you, there are about 40,000 farms in the state\nGeorgia average farm size of about 250 acres across our state about 95% of our\nfarms in Georgia are family-owned operations. I think that's something for us as a\nstate to be proud of but when it comes to specific payroll and how much is\nof own farm payroll. I don't have that off the top of my head but we can work on\ngetting that number to you. Yes ma'am. Chairman Eccles. Last question. You\nYou're going to ask.\nIt's my head.\nIt's all.\nOh.\nIt was you.\nMike.\nIt was you.\nMike.\nOkay.\nSorry.\nThank you.\nI thank you.\nProbably, but on behalf of the people of Walker County, thank you.\nAnd your staff for what you did up there last week.\nIt gave a lot of producers and agricultural people their confidence that you address situation.\nYou handled it right.\nAnd I just want to tell you thank you, public.\nRepresentative Cameron, I appreciate that.\nthat our team is still up there working on going.\nThey'll be working through this cold weather.\nWe're obviously watching the winter weather\nthat's happening later this week.\nSo keep our employees and others in your prayers\nand your thoughts because they're out there braving that\nto address this issue.\nBut thank you for your comments.\nAll right, last question.\nThank you, Commissioner Harper.\nSo we're gonna come back, we're gonna have lunch.\nWe're gonna come back at one hotel.\nWe're going to come back 15 minutes after what the agenda says, we're going to come back at 1.30, 1.30, so everything will be put back 15 minutes here for just one second.\n",
  "updated_at": "2026-02-12T01:26:33.798079+00:00"
}