{
  "video_id": "9FVRC2Pei1w",
  "url": "https://www.youtube.com/watch?v=9FVRC2Pei1w",
  "title": "Rules PM Meeting for Day 39 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 15,
  "summary": "Here is a structured markdown summary of the Georgia Rules PM Meeting for Day 39 of the 2025 Session:\n\n## Overview\nThe meeting focused on a substitute for Senate Bill 59 regarding municipal sovereign immunity, as well as a discussion around Senate Bill 185 which would prohibit the Georgia Department of Corrections from using state funding for transgender surgeries for inmates. There was significant debate and opposition expressed around the necessity and prioritization of the transgender surgery bill.\n\n## Key Actions\n**SB 59**: Substitute bill providing liability limits for municipal governments\n\n## Bills Introduced (First Reading)\nNone detected\n\n## Notable Moments\n- Debate around the necessity and prioritization of SB 185 to prohibit transgender surgeries for inmates, with concerns raised about the bill addressing a non-existent problem while larger issues like healthcare access and teacher/prison staff shortages go unaddressed.\n- Questions around whether any transgender surgeries have actually been performed on inmates in Georgia's prisons.\n\n## Votes\nNo recorded votes detected.\n\n## Attendance\nQuorum was present, though specific attendance numbers were not provided.\n\n## Adjournment\nThe meeting adjourned, but a specific time was not noted. The next session date was also not provided.",
  "transcript": "Good afternoon. Hope everybody had a nice lunch. I'm going to go to the meeting to order.\nSenator Weiss, I'm going to come up.\nThank you, Mr. Chairman. Members of the committee, I bring to you a substitute to Senate Bill 59,\nBetter known to this body as the sovereign immunity municipal sovereign immunity act\nIt was language that came out of house bill 531. We're just putting it in Senate bill 59 and just providing some liability limits for municipal governments\nI'm glad to take any questions if there are any\nOkay, don't see any questions. All right. Thank you. Thank you. Mr. Chairman members of the committee\nChairman Anderson\nThank you Mr. Chairman. I'm asking for House resolution 885. It's not on the blue sheet. It's on the wall over here\nBut I understand it isn't eligible\nHouse resolution 885 asked for a study committee looking at the elections procedures in the state of Georgia\nOkay, thanks sir. Thank you\nYes, sir. It's got which guy thank mr. Chairman members of the committee. I was asked to present Senate bill 185\nWe have the author of the legislation here, so I'm going to yield to him if that's okay with you. Okay. Yes, sir.\nThank you chair committee\nSenate bill 185 is a bill that requires the Georgia Department of Corrections to create a policy that would prohibit\nThe Department of Corrections to use state funding to fund transgender\nSurgery to any person being held in the Georgia Department of Corrections\nOkay, got a question quick part\nThank you, mr. Chairman Senator Roberts and is this really a priority for this body?\nWell, based on I did a and I think that's for the body to determine. I think that's why we have the process we have but\nDo in a study committee this past summer on the Georgia Department of Corrections and taking a deep dive into the health care costs\nBelieve me. There's many other areas will attempt to go to as we go through the process to try to make sure our funding and the\nThe Georgia Department of Corrections has spent more efficiently, not only in health care,\nbut in operations and other areas, I think that have led to the issues that we currently\nhave in the Georgia Department of Corrections.\nAre you saying that the provision of gender, firm, and care when medically necessary is\ncausing our budget to explode with respect to public safety in our prisons?\nWell, I'll try to narrow down my answer.\nI said, it's one of the many areas where we have the issues and I was approached and asked\nto do this from a policy standpoint.\nAnd I figure we need to address every issue\nwithin the Georgia Department of Corrections\nas we do in other departments throughout the state\nto make sure that we're using taxpayers dollars\nin the way that they want us to use those dollars\njust unfortunate.\nThank you.\nThank you, sir.\nThank you, Mr. Chairman, to the Chairman and the well.\nAs a result of the study committee on the health costs, or I guess it wasn't just the health costs, the study committee did the study committee report out or find the amount of money spent on the health care procedures that are in line 68 through 72 of the bill.\nAnd I don't have the bill in front of me, ma'am, but I believe are you talking about the therapies and other things that are currently being done?\nYeah, how much money has been spent in this year or any summary of years that you all looked at on the procedures that this bill would prohibit?\nNo, ma'am. I don't have a specific cost what we did is with the RFP process and with the healthcare providers that currently address the RFP and the funding process related to all healthcare issues.\nand discussing different ways and one of the issues when this subject matter came up was not\nthe issue in particular but the fact that there was no policy existing that would allow them to\nopt out from doing these types of procedures with taxpayer dollars. Do we have any idea if these\nprocedures are even occurring? What we have right now is I think I was giving the information that\nwe currently have five individuals being housed in the Georgia Department of Corrections that\nthat are currently requesting these procedures.\nHave any been performed?\nAny of the procedures ever been performed\nthat the state's paid for?\nNo, ma'am, I believe that what currently the state\nis challenging their responsibility\nfor providing these procedures.\nAnd then one last question, I know you said\nyou don't have the bill in front of you,\nso I'll read the line.\nI've been provided.\nYou can go back to your plan.\nOn line 15, the definition of the term state inmate,\nit says any inmate in the custody of the department\nand for whom the department shall be responsible\nfor the payment of medical care.\nAnd I was wondering, are there state inmates\nin the custody of the department\nfor whom the department is not responsible\nfor the payment of medical care?\nI think there's some ambiguity to a certain degree\nthat once an individual is sentenced,\nthey may be currently being housed in a county jail\nor other type of detention system\nuntil they're able to be transferred\ninto the prison proper.\nAnd I believe that's who they're addressing right then.\nbecause I know there's a, we as the state pay a daily fee\nto the county jail or detaining officer\nuntil that individual can be transferred in.\nSo my understanding was that would be applicable\nto those individuals.\nSo the state wouldn't be responsible for the care\nof folks that are in county care.\nThey're not responsible until they come in.\nI think it's a billing issue as to if something is\nit would be up to the local sheriff or whomever\nto build back to the Department of Corrections\nif they wanted to claim expenses were used for health care\nthat should have been the responsibility of the state.\nThank you.\nYes, ma'am, thank you.\nGood afternoon, Miller.\nThank you, Mr. Chairman.\nGood afternoon, Senator.\nGood afternoon.\nTo my friend.\nSo maybe you can help me out with this,\nbecause I'm getting a lot of constituent calls\nabout the cost of health care, the unavailability of health\ncare, our high maternal mortality rate, our shortage of teachers, the fact that rent is\nunaffordable, the fact that families can't afford to buy home, homes, the fact that\nchildcare is an accessible, the fact that pre-K hasn't been expanded, and we are sitting\nhere spending our time talking about sex change operations in prisons.\nWhen you can you tell those working families in Georgia, those parents, those teachers,\npolice officer shortages, prison guard shortages, why it is that we would spend our precious\ntime down here charged with fixing big problems for all Georgians across the state while we're\nwasting time talking about a problem that doesn't exist.\nWell, ma'am, I think we agree that the problem does exist with the fact that we currently\nhave five individuals that have reached out and the Department of Corrections has reached\nout and explained that they do not have a policy.\nAnd I think it's the statement that you made at the beginning is a very clear and honest\nbipartisan statement because I think we all get those calls and I agree with the constituents\nto give me those calls, whether it's related to this body not putting enough money in to\nto offer a fair enough salary to bring in\nthe Department of Corrections employees that we need\nin order to make our prisons more safe.\nI think that is a problem.\nAnd all the other things that you mentioned,\nI do believe those are problems.\nAnd there's 180 of us on one side and 56 of us\non the other side and we are all tasked\nand put ourselves up to attempt to solve those problems.\nBut I think we all being reasonable men and women\nunderstand that we have to even know\nif one bite at a time and that's what we're attempting\nto do here.\nAnd I hope we're able to do it all together.\nbut I do agree with you, I get those same calls.\nI appreciate that.\nThank you.\nSenator.\nAnd you mentioned five.\nAnd would these five include five folks\nwho are trying to get a sex change operation in prison,\nor are these five folks who just want hormone therapy?\nLike, do they just want a pill to take?\nLike, who are these five that were?\nThe individuals, the cases are given.\nI was not given the names of the individuals\nfor obvious reasons.\nbut they were wanting, once they had been incarcerated\nin the Georgia Department of Corrections,\nthey had chosen to enter into the process of transition.\nOkay, and so that could include just medication,\nit doesn't necessarily include\nlike a full-blown sex change operation.\nIs that what you're telling me,\nor you don't know the actual data?\nI'm a law enforcement public safety professional,\nI'm certainly not a healthcare professional.\nAnd so I would be, I would not be,\nThey would not be fair for me to attempt to describe what the multiple types of transitioning\nthat could be being asked for.\nThat's fair.\nFinal question, Mr. Chairman.\nIn comparison to the five questionable folks who we don't really know that much about,\nhave you considered the number of, let's say, children who we tried to, hungry children\nwho we tried to feed over the summer, the number of children who are without health care,\nthe number of families who are struggling to buy eggs and milk, have you, the number of\nwomen who die trying to have babies in this country, the number of babies who die in the\nprocess of childbirth, all of which we are at the top of the heap on, have you considered\nthose numbers in comparison to the ambiguous five?\nSince the age of 22, in my entering in law enforcement, I considered those numbers each\nevery day because each and every day on my job I encountered the individuals that you're\ntalking about. Those that live in poverty, single moms who do not receive proper health care\nand everything else and I certainly hope that all of my colleagues in the Senate and all of my\ncolleagues in the House take it as serious as I do and I hope we continue marching forward to\nsolve all those problems. Thank you. Okay, leader Heagley you had a question.\nThank you, Mr. Chairman, I wanted to ask regarding the five that you mentioned, have there\nbeen any lawsuits or any lawsuits outstanding or what has happened specifically to bring\nus to this point other than the study because you know the study had a multitude of concerns\nregarding the corrections department.\nYes, ma'am, I think there have been court challenges, I have sat down and met with one\njurist pertaining to it but there's a lot of things they cannot discuss openly because of the fact that it is a case and\nThose an individual I think you may recall several months back. I think it was an individual that attempted to or\ndid try to\nDeliver an explosive device\nInto the judicial system. I believe to the best of our recollection and the reason being because that individual was involved in a case\nagainst the Georgia Department of Corrections,\nto obtain this very incident.\nSo that is probably the most I know\nabout any of the single individuals,\nand I believe the last individual has only recently\nbecome a part of the population\nin the Georgia Department of Corrections.\nThank you, sir.\nI don't see any more questions.\nThank you, Mr. Chairman.\nThank you, committee.\nChairman Clark, need you have a request?\nOkay, okay.\nAll right, thank you.\nOkay, any members of the committee are going to call on Chairman Jasper if you would to explain Senate Resolution 8 and Senate Resolution 231.\nThank you, Mr. Chairman. Senate Resolution 8 is our Transportation Committee substitute to Senate Resolution 8.\nFirst off, I've got to thank Abbey Day from the House Budget Research in Josh and Abbey\nfrom G. helping us work these through.\nThere are 21 road naming resolutions within SR-8, 19 from the House and two from the Senate.\nYou know, if you take time, it's interesting to look and see what all these great Georgians\nhave done and made an impact on Georgia if you have time to do that.\nand 231 is a little bit different.\nIt's a very tragic year for law enforcement\nand this is our substitute to this.\nAnd we took this bill and put five public safety people\nwho have fallen in our state.\nWe put these together, they'll be presented differently\nthan we normally do.\nThe individuals will be represented by the county\nwhen they're from, they can be very moving,\nvery good moment for us to honor the lives\nof these gentlemen.\nAny questions?\nThank you, sir.\nOkay.\nI'm going to ask you to join me in list\nat a supplemental calendar for today,\nunder modified structure,\nSenate Bill 20.\nHave a move in a second.\nHe's in the opposition.\nHave an objection.\nand all those in favor say aye, oh, he withdraws you, thanks sir, we misspoke, okay, he's\njust getting ready, there you go, okay, see it bill 132, moved and seconded any opposition,\nIs that a real objection?\nOkay, we have an objection.\nAll those in favor say aye.\nAll opposed, no.\nAye, I was carried.\nSenate bill 185.\nMoved and seconded, any opposition?\nHave an objection.\nAll those in favor say aye.\nIs that objection?\nI'll ask for that vote again. All those in favor of I, 25 say I. All opposed, no.\nThe eyes have it. Senate bill 244. Moved in a second at any objections.\nhave an objection. All those in favor say aye. All opposed, no. I ask, here.\nSenate bill 259. Moved in second, any objections? It's on Senate bill 291. Moved and\nseconded, any objections? Have an objection. All those in favor say aye. All opposed\nno. It carries. Senate Resolution 8 moved and seconded, any objections? It's\non. Senate Resolution 231 moved and seconded, any opposition? It's on. Okay, that\nsets are a supplementary calendar for today. Thank you very much, we dismiss.\n",
  "updated_at": "2026-02-12T17:16:18.82392+00:00"
}