{
  "video_id": "9wf8Eo3VE-A",
  "url": "https://www.youtube.com/watch?v=9wf8Eo3VE-A",
  "title": "Sen. H Jones Dem Caucus Press Conference on Torte Reform  | 02/20/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "## Overview\nThis press conference by Georgia State Senate Democratic Caucus Leader H. Jones focuses on the introduction of SB 223, the \"Pro-People Pro-Business Act,\" which aims to reform tort liability laws in the state. The bill seeks to balance the interests of protecting public safety and shielding businesses from frivolous lawsuits.\n\n## Key Actions\n**SB 223**: The \"Pro-People Pro-Business Act\" that introduces several provisions to reform premises liability laws, including:\n- Establishing an affirmative defense for businesses located in high-crime areas\n- Creating a rebuttable presumption against liability if businesses have taken safety measures like proper lighting and security\n\n## Bills Introduced (First Reading)\n- SB 223: The \"Pro-People Pro-Business Act\" on tort reform\n\n## Notable Moments\n- Sen. Jones emphasizes the bill's goal of protecting legitimate claims while cutting off frivolous lawsuits against businesses\n- He criticizes the Republican approach, arguing they are attempting to restrict access to the courthouse for legitimate cases rather than just frivolous ones\n\n## Votes\nNo votes were mentioned in the transcript.\n\n## Attendance\nNo quorum or attendance details were provided.\n\n## Adjournment\nThe press conference ended without any mention of adjournment or the next session date.",
  "transcript": "So I want to thank everybody for coming out today.\nToday the Georgia State Senate Democrats have submitted a true tort reform bill.\nThe Pro-People Pro-Business Act, which brings together the important and related interests\nin protecting people as they look to buy their groceries or be entertained and protect\nbusiness from frivolous lawsuits.\nIt is reflected in it now with this SB223.\nThis bill does not close the courthouse doors or place unnecessary impediments to people\nfor receiving compensation for legitimate claims.\nIt ensures that businesses are protected\nfrom frivolous lawsuits.\nSpecifically, how does it do that?\nIt does in a few ways.\nOne of the critiques of the CVS case was,\nit appeared, although not accurate,\nthat if your business was in a place of high crime,\nthat alone would allow you to be sued.\nOur bill actually clarifies that\nand says this is affirmative defense to any claim,\njust because you're in a high crime area\nthat would not allow a person to see you.\nSo, although the case did not say that,\nour bill clarifies, if your business,\nif the only reason to be sued is that you're in a high crime area,\nthat would not be a reason under SB223\nthat can sustain a lawsuit.\nAnother issue that was brought up was\nthat what if a business owner had never had a problem before?\nHow did you deal with that?\nWe've made that also an affirmative defense.\nSo if a business owner's never had an issue before,\nThat is affirmative defense that he can actually claim against a potential litigation.\nWhat this does is really start cutting off frivolous litigation, not legitimate litigation\nbut frivolous litigation by establishing an affirmative defense.\nIt goes further though.\nOne of the things these cases talk about is a lot of times you'll see where lighting is\nnot good, where there's no security, and we realize that most businesses they actually\nwant to provide those things to keep their customers safe, to keep the people safe.\nBut if they do that, how do you kind of get a reward to some extent?\nAnd what we've done is, we've created a rebuttable presumption that if a business has\ncreated has this proper lighting, if a business does have security, if a business does have\nproper camera system, there is then a rebuttable presumption against liability.\nThat is very strong and it can only be overcome by clear and convincing evidence.\nSo what we've done here is we've actually married the interests together.\nWe want people to be safe.\nSo we give an incentive for business actually to make people safe.\nIf they do that, then the only way to actually be to file that lawsuit is having a rebuttable\npresumption against liability.\nIt can be overcome, but it has to be by clearing convincing evidence.\nThe significance of that is, you have when you start talking about frivolous lawsuits,\na frivolous lawsuit would not get through that type of evidentiary standard.\nBut a legitimate lawsuit would be able to get through that evidentiary standard.\nthe courthouse is not cut off. For a person who's trying to bring something\nfrivolous, they would not be able to show clear and convincing. But somebody\nwho has a legitimate actual claim, they will be able to still get to the\ncourthouse. Also, we said, if there's a possibility just because you're in a\nhigh-crime neighborhood, we want you to have an affirmative defense. That by\nitself will not bring liability to you. I think we've done the perfect\nmarriage here to make sure people are safe. And at the same time, also to help\nbusinesses continue to thrive or actually growing those particular areas. And\nAnd that's what we call the Pro People Pro Business Act.\nIt actually brings the two interests together,\nwhich are not mutually exclusive.\nBusinesses, we won't then to thrive,\nbut we also want to make sure people are safe.\nAnd we brought those two interests together\nin this particular bill.\nAnd with that, I don't answer any questions.\nThe bill has all kinds of issues.\nI don't think there's a lot of things to do, I don't know.\nWhat is it about the promises by Bill, the aspect of it\nthat he has decided to do a little bit on that?\nAll of it is connected, make no mistake.\nIt promises liability is connected with the cost and damage or anchoring damages.\nEverything is connected because it all goes to the courthouse.\nWhen we really look at our constituents and people that we represent,\nwe realize that a lot of our constituents, they're going to places like grocery stores.\nThey're going to places that sometimes those parking lots may not be as safe.\nAnd we realize that sometimes those businesses are having to pull out\nbecause of higher insurance rates.\nSo what we said was, we know you want to keep people safe.\nBut you're concerned if you do that, can a frivolous claim actually be brought against you?\nAnd this bill actually says it will be almost impossible for a frivolous claim to be brought against you.\nIf you do the things that we all want you to do to help keep your customer safe,\nyou will actually get a strong benefit, a legal benefit for doing that.\nAnd that's what we say.\nWe think this is the perfect marriage between the two interests.\nThey were never mutually exclusive.\nWe want businesses to actually have lower rates, but we also want people to be safe.\nLet's find out how to make those two things happen.\nWe think SB 223 has done that.\nThis here deals with the premises liability aspect for a third party wrong to a conduct.\nSo we've actually done a criminal action.\nSo this is not goes into that particular part.\nWe wanted to narrow this down because this is one area that we heard our biggest concerns\nin that particular bill.\nAnd we thought this was an area that a lot of people are very concerned about.\nThe other thing we got to remember is, when we talk about\npremises like Billion III party run to a conduct, which\nis interesting is the bill that Republicans are basically\npresented for, is trying to answer something which was\nlegitimate cases.\nThey're not addressing frivolous cases.\nThey're actually trying to cut people off from the\ncourthouse on legitimate cases.\nWhen we talk about the CVS case, that means it was the\nactual case where somebody was injured, the person was\nshot.\nWhen you talk about the Six Flags case, that's the actual\ncase where somebody was actually beating to a coma.\nSo these were real cases that happened.\nThese were not frivolous cases.\nAnd that's what I found interesting\nabout how the Republicans have approached this.\nThey did not try to cut frivolous cases off.\nThey're actually trying to cut legitimate cases off\nfrom the courthouse.\nWhat our bill does says is no.\nWe won't let legitimate cases go forward.\nBut if you have a frivolous case,\nit's going to be very difficult\nfor you to get over these evidentiary hurdles\nand that's how it should be.\nWith that, thank you guys so much.\nThank you.\n",
  "updated_at": "2026-02-12T19:02:55.178075+00:00"
}