{
  "video_id": "9ZnC1qp8jsY",
  "url": "https://youtu.be/9ZnC1qp8jsY",
  "title": "Georgia House - Day 28 (2026-03-15)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 28,
  "video_date": "2026-03-15",
  "duration_minutes": 185,
  "summary": "Here is a summary of the Georgia House session on 2026-03-15:\n\n**Overview:** The session featured the passage of several bills, including HB 918 to increase the rural hospital tax credit, and the introduction of new legislation. Notable moments included procedural debates and representatives acknowledging their own political campaigns.\n\n**Key Actions:**\n- **HB 918**: Increases the rural hospital tax credit from $60 million to $75 million, effective January 1, 2023.\n- **HB 997**: Extends the sales tax exemption for computer equipment purchases by high-tech companies, with a 10% payback requirement.\n\n**Bills Introduced (First Reading):**\n- None noted in the transcript.\n\n**Notable Moments:**\n- Rep. Mallow questioned whether expanding Medicaid would better support rural hospitals than the tax credit increase.\n- Rep. McLaureen acknowledged he was also running for state senate, like some previous speakers.\n\n**Votes:**\n- HB 918 passed with a vote of 164-1.\n- HB 997 passed with no noted opposition.\n\n**Attendance:** No specific quorum notes.\n\n**Adjournment:** The transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "This house will come back to order. House will come back to order. Mr. Clark, you want to ring the bell? You You You You You You At Clark will read the caption to a group of privileged resolutions. Clark will read honoring the life and memory of John Franklin Porter honoring the life and memory of John Allen McPhale honoring the life and memory of Edward Herald Stone recognizing the Association of Georgia General Aviation Airports as an industry association for the General Aviation Airports and State of Georgia and his corporate affiliates recognizing and commending 2021-2022 social circle boys varsity basketball team and an outstanding season. Reaffirming friendship and cooperation between the Federal Republic of Germany and the State of Georgia. Commending Morgan Kennedy, Miss Cobb County's outstanding team 2022. Recognizing the Edith Sigmunder chapter of the Pi Kappa Alpha fraternity recognizing commending the Eden missionary Baptist Church on the occasion of its 150th anniversary recognizing and celebrating March 25th 2022 is the 211st anniversary of Greek Independence Day. Recognizing commending the American Hellenistic Education of Progressive Association on the occasion of its 100th birthday. Recognizing commending David Panton recognizing September of 2022 is African immigrant heritage month recognizing and commending Dr. Willie Howell. Commending Dominique Wooder, Vannecker High School's Teacher of the Year. Recognizing March 22nd as World Water Day and commending Ryan Beltrane. Recognizing March 24th 2022 is HPV Cancer Awareness Day in Georgia honoring the 62nd anniversary of the Mass. It inorganized by the Atlanta student movement in March 15th 1960. Recognizing Miller County Liberal on the occasion of its 125th anniversary and in commending its current owner George Terry Tool. Congratulations commending Billy W. Rowland and for other purposes that completes the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? Chair here's none in the resolutions are adopted. We're going back to the rules calendar. We're going back to the rules calendar. Clerk will read the caption to House Bill 1041. House Bill 1041 by Representative Perkel of the 150th and others to be entitled an act to amend Code Section 487 29.2 of the Fish Quotid, Georgia Antitai related tax credits for contributions to rural hospital organizations. So it's an increase the aggregate limit for tax credits. This bill ever for the committee on ways and means that committee recommends the disbill do pass by committee substitute. Chair recognizes chairman Perkel to present the bill. Thank you Mr. Speaker colleagues. A measure that we passed a few years ago that has absolutely provided the ability for some rural hospitals to stay open. Is the bill that we're looking at today Hp 1041 raises the rural hospital tax credit from 60 to 75 million and makes the effective date for this change January 1, 2023. That's the bill Mr. Speaker. I ask for a green vote. Chair recognizes chairman Setslor to speak to the bill. Ladies and gentlemen, the House I want to speak in support of this bill and it's a good proposition that allows our rural hospitals to get resources from their communities. I would say though this body acted very boldly last year on hospital 290 that recognize the patient's fundamental right to have someone at bedside to help advocate for them and make decisions. I think consistent with our strong support of rural hospitals, nonprofit and for-profit hospitals around the country or around the state rather, we cannot take our off the ball that low this last year that since we've debated and passed this proposition Hp 290 from this House, it has continued. It has continued that the ability for a family member to stand at bedside, see, understand what's happening to their family member and advocate for them, personally to their rights under federal law, see my misregulation and continues to be an issue in the state. And as we pass this bill and I urge you support this bill, we need to double down and re-state our efforts in our desire as a House representative, as a Senate, and with the executive branch. That patients have a fundamental right to have an advocate at their bedside to advocate for them and that we have not forgotten and we were urging ultimate support of Hp 290 before then this biennium. Without Mr. Speaker, I yield the wrong. Is there any objection to the previous question being ordered? The chair here is none, the previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none, the committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none, the report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does representative Mallow rise? Parliament, rank where you? State your inquiry. Mr. Speaker, is it not true that the best credit we could give to rural hospital and rural Georgia is to expand Medicaid in this state? I think that's probably up for debate representative, but I know you're sincere in believing that. What purpose does representative McLaureen rise? Parliamentary increment of speaker. State your inquiry. Mr. Speaker, isn't it not true that just like two of the last speakers I'm also running for state sentence, so I just wanted to chime in too. Is that primary tomorrow? Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1041. The eyes are 164. The days are one. This bill having received the requisite constitutional majority. Clerk will read the caption to House Bill 1291. House Bill 1291 by revenue. Smith of the 133rd to be entitled an act to amend Code Section 4883, the fiscal and Georgia anti-Aruleian exemptions from sales and use taxes, so as to revise the spending threshold and extend the sunset dates for sales tax exemption for the sale or release of computer equipment. This bill ever referred to the Committee on Ways and Means that Committee recommends the disbilled due pass by Committee substitute. Chair recognizes, Chairman Vance or Representative Vance Smith to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, bring to you House Bill 1291. This is a continuation of an exemption that we paid for years on the books. Some of the high-tech companies that come in and we've redefined the definition of high-tech. It's the hardware that's being used. It's not the software that's there. And we'd like to still stay competitive with our other states. This got a still got a $15 million dollar threshold and we'd ask to extend that sunset to 2028. Anybody has any questions? Be glad to answer them. If not, I certainly appreciate your vote. Thank you. What purpose does, do you have a question, Representative, or Chairman Carpenter? Yes, do you yield for a question? Representative, you yield for a question. Yes, sir. Chair recognizes Chairman Carpenter. Do you ride for a question? Does the gentleman yield? Yes, sir. Is it not true that this bill also includes a 10% payback that we haven't seen on this issue in the past? It will. 10% of the first 15 million. They have to spend 15 million per year. So it will be 10% of that will be taxed. Come back to the tax payback. I appreciate you adding that in. Thank you. Yes, sir. Thank you. Thank you, Mr. Speaker. And I'll yield the well and ask you a favour consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass all those in favour of the passage of the bill will vote aye? Those opposed will vote no in the clerk will unlock the machine. You have all members voted? Have all members voted? No. If so, the clerk will lock the machine on the passage of House Bill 1291. The eyes are 150. The nays are 17. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Resolution 686. House Resolution 686 by Watson and 170 second and others of resolution proposing an amended constitution so to provide for a reduction in the rate of the ad valorem tax assessment of timber at sailor harvest. This resolution have been further the committee on ways and means that committee recommends that this resolution be adopted by committee substitute. Chair recognizes Chairman Watson to present the resolution. Thank you, Mr. Speaker. Members of the committee, I do bring before you HR 686. Georgia is the number one forestry state in the nation, but we're also one of the highest tax to when it comes to the forestry industry. And basically what we're doing here is providing for the people of Georgia to decide to lower and reduce the ad valorem tax rate of timber when it's harvested. Currently, when timber is harvested, it's taxed at a 100% rate. We are requesting the people of Georgia to allow us to tax them at the 40% rate, which is the same rate that we tax all other property within the state of Georgia. So this is about providing some fairness to the forestry industry. You know, forestry producers and landowners don't get to decide how much they receive for their products, their price takers, not price setters. And of course, with inflation right now, this is greatly needed for many of our landowners to be able to take this money that they're able to save and reinvest it into their land to plant more trees to keep our environment safe and to keep Georgia the number one forestry state in the nation. But also along with this, there will be a cost to the state of about $12 million. Currently, the impact is about 20 million, but this is very similar to the Forest Land Protection Act. And so that's what the bill does, Mr. Speaker, and I'll be glad to take any questions. Do you yield for questions? Yes, sir, I do. Chair recognizes Representative Jasmine Clark to your left for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. You just gave us some figures about how much it's going to cost the state. Is there a fiscal note available so that we can see that analysis? It's $12 million. Thank you. Mr. Speaker, if there are no other questions, I'll yield the weld and I would just greatly appreciate everyone's support on this. It's greatly needed for our forestry industry. Thank you. Gentlemen, as yielded the weld, we have other members that wish to be heard. Chair recognizes Representative Al Williams to speak to the resolution. Thank you, Mr. Speaker. I rise for a number of reasons, but one of them is I usually defer on strictly urban issues to those who understand it better, but I rise on this one because this is an issue I do understand. I've borne, raised, and still live in timber area. The handout that you'll find on your desk happens to be a neighbor of mine, Matilda Rouse. I did not ask her for this testimonial. It was done through the forestry. There's Rouse as a retired principal who happens to be one of my neighbors and the gentleman standing behind beside her as a retired full bird kernel from the Air Force, Warren, who played football. I was a trainer when he was playing football, and I got drafted to come and star, but that's another story for another day. But in Georgia, particularly in Liberty County, it is vitally important because many minority landowners own small plots of land. And taxes are extremely important. If you read what Miss Rouse has to say, one of the most important features that I want to bring to your attention is what is known as air's property. You don't hear hear that a lot in the city, but as you've heard me say before, at one time Liberty County had the highest percentage of African-American freeholders in Georgia. Much of this land was under Article 15 by William Coste Sherman when he granted the land from the high water line 30 miles in for former slaves in the 40 acres and two mues to work the acreage. That's where the 40 acres and a mue came from, the name. I often say that unfortunately, the surveyor had one eye and the mue will have three legs. But what's happened in ensuring time is that people died in test tape without a wheel. And that left the land as air's property, with everybody having equal access to it. And some of the families were quite large, so you're in with a lot of people owning. Usually, my experience has been in Southeast Georgia, that there's only one or two people in a family who ends up paying the taxes and is quite a struggle. They have to pay these taxes. And the only time you hear from the air's owners, New York, California, Chicago, Philadelphia, is when it comes, they want to sell a portion of it. And they come home and see what a quagmire it is. But as Ms. Riles said, when you're a small landowner, when you harvest the timber, and when you harvest it, when you want to replant it, there's so little money. What this bill would do, it will just tax people that own timber land at the same rate you're taxed as a homeowner. I have a Lorm tax purposes. About $12 million is what I heard the chairman state, but the value to small landowners is just innumerable. To save a piece of land that has been in your property in your family a long time. I have some property in my family. This entering is fourth and fifth generation of ownership. And it becomes very difficult because many times when land was left, Uncle James would walk a while and say, this is your acre. Walk another while and say, this is your acre. And when a real survey comes along 30 years ago, your acre runs right through the back door. So there's a lot of confusion, but let's reduce the cost on everyday landowners. Now will it benefit some large landowners? Of course it will, but it would be good for all of Georgia. It helps us all. I ask for your consideration and your yes vote on House resolution 686. It's good legislation helps a lot of people. Thank you Mr. Speaker if there are questions. I'll leave the well. There are no questions. Chair recognizes representative Buckner to speak to the resolution. Thank you Mr. Speaker. And I would ask that if you haven't had a chance to look at your handout that's on the desk, this just points out that we generally, if we're growing trees in Georgia, get three crops at best. And so when it's the only crop in Georgia that when you harvest it, you have to pay a tax on your harvest. So it's kind of like a severance tax because you're severance seeing the trees from the land and it's the only severance tax in Georgia. And so this severance tax, and I use that in quotation marks, it's not really a severance tax, it is a tax on the trees that are cut is based on as the other two speakers have said 100%. Other taxes in Georgia are generally calculated on 40%. So if you look at the sheet on your desk, you'll see that it would be quite a savings when a person sells their timber to pay the 40% and we ran some numbers in no matter how small or how large that savings of paying the tax based on 40% works out to be enough to pay for seedlings for replanting. So it makes it a great opportunity for our tree farmers in the state of Georgia to harvest, replant, and keep going and making this number one for forestry in Georgia. I urge you strongly urge your support of this bill, it's a long time coming and it's a fairness bill and it will really help our tree farmers in the state of Georgia. With that, Mr. Speaker, I'll yield the well and I ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair here's not the previous question is ordered, is there any objection to adopting the committee substitute? The chair here's not the committee substitute is adopted, is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here's not the report of the committee, is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. Mr. Speaker, I'd like to vote rule 133 on this. Gentlemen, has that right? And the journal will so reflect what purpose does representative Wade rise? I need to do the same thing. Gentlemen, has that right? And the journal will so reflect, have all members voted? Have all members voted? If so, the clerk will lock the machine on the adoption of House Resolution 686. The eyes are 166. The nasors zero. This resolution having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 733. House Bill 733, Member of the President of Smith of the 18th to be entitled and act to amend Code Section 3363 of the official code of Georgia and Tate relating to definitions regarding guaranteed asset protection waivers. So as the revise the definition of a guaranteed asset protection waiver, this bill haven't referred to the committee on insurance. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Tyler Paul Smith to present the bill. Thank you, Miss Speaker. Members, this is about I bring to you today House Bill 733, which seeks to make improvements to the guaranteed asset protection waiver model legislation in Georgia. Just so you know, gap is acronym for guaranteed asset protection and it can actually get you out of a deep financial bind. If your vehicle may be stolen or totaled, why you still owe payments on your car loan beyond the actual value of the car ups, aka your upside down or underwater on it. Current law contains a statutory frame work for offering gap waivers in Georgia. This bill retains that framework and would additionally allow a gap waiver to provide a credit toward the purchase of a replacement vehicle. The bill also allows a gap waiver to be offered without an additional charge. And Miss Speaker, that's the gist of the bill. I'll yield for any questions. You do not appear to have any questions. Thank you, Miss Speaker. As you all is favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee?\n\nIt was favorable to the passage of the bill. The chair here is none the report of the committee is agree to. Shall this bill now pass all those in favor of the passage of the bill will vote I. Those opposed will vote no and the clerk will unlock the machines. Yep. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 733, the eyes are 166. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 202. House Bill 202 by verse 1 of Fitches, the 161st and others to be entitled to an act of 10 Article 10 of Chapter 21, the title 15 in the Fitch go to George Antietta relating the Georgia Drivers Education Commission. So it's increased the additional penalty for violation. The traffic laws are ordinances under Josh was law. This bill emphere of the Committee on Motor Vehicles, that committee recommends the dispelled do pass by committee substitute. Chair recognizes Chairman Hitchens to present the bill. Thank you very much, Mr. Speaker. I rise today on behalf of House Bill 202, better known as Joshua's Law. I presented this bill two years ago and it passed here 150 to 9, but folks on the other side of this building didn't get it through, so I'm back again today. I didn't do it last year because they had a problem over it to go to his office highway safety with a federal audit and they asked what they're going to do and what that was on going. In 2005, Josh was law was really created with a search charge of 5% on all traffic citations in Georgia to establish funding to support drivers' education programs throughout the state. And a great recession that 5% was reduced to 1.5% with the other 3.5% going into the general fund. The 1.5% creates about 2.5 million dollars a year. And I have to apologize here when I was in the Motor Vehicles Committee. I said that that money was still going into the general fund and that's not the case. I asked the governor's office highway safety to research it and what they found out was about three years ago that money was diverted and it's no longer a search charge. So what we're asking today is to go from 1.5% to another 1.5% as I explained later these are sold after positions and we don't have nearly enough money in there to satisfy that need. This bill also reflects the 2020 constitutional amendment that was championed by our friend Jay Powell that mandates that the fees stay in a trust fund and be used only for the purpose that they are collected. The scholarships are awarded on the three tier priority system. The first priority is given to grant scholarship applications when a child or dependent of a public safety professional or member of the United States military is killed in a line of duty. The second priority is given to scholarship applicants who can demonstrate a need based on family income. The financial need eligibility is based on 120% and 125% of the free and lose price school eligibility. For a family of three the gross household income would be about 49,000 or under 1,000 per month gross. The third priority is for all other applicants. There's such a demand that no other applicants are ever considered for this grant. The one addition that I made this year is that this legislation adds consideration for those 18 to 21 to have left the foster or protective custody of defects. The program is for children from 15 to 17 and the reason I added that is I know a little bit about the program and when you turn 18 years old in foster care you get released and if you don't have some means or some job you're kind of left on your own. If you don't have a driver's license you don't have the ability to get a job. So this would assist foster care and children under de facto protection and obtaining a driver's license and therefore help them get a job. Each month the program runs out of money because the man for the scholarships is so high and student applications are not and the third year is never reached. Program is open to all public schools, technical colleges, universities and other state-owned driver education programs and privately owned commercial for private driving schools and non-profit organizations and private schools. The program consists of 36 hours, 30 hours in a classroom and 6 hours on the road. That's essentially what happens if you don't take this program you're supposed to do 30 hours online and 6 hours behind the wheel typically with your parents. Now some parents all they have to do is sign an affidavit, some parents do give them the training, other parents don't. So in conclusion what I'd like to say is the sunset on this is June 30th this year. This bill doesn't pass the 17 years that this has been in effect and all the research shows that the children to go through this have higher scores on their tests when they get their driver's license. They have less violations, moving violations, they have less accidents, they have less injuries and less fatalities. So it's been a great program. I hate to see it fall by the wayside because of not putting in the 1.5% search arch. If there are no questions I'll yield and ask for your favourable consideration. Do you yield for questions? I do. Chair recognizes Chairman Dempsey to your right for a question. Thank you Chairman Hitchens. I just want to tell you that I know Joshua's family, his mother is a constituent that lives very close to me and I texted her, she's watching us, she's so proud of what you are doing but this is a very strong life saving measure for children and especially to extend this opportunity to foster children as they age out. Thank you for your work on this. Thank you. I wouldn't much of a question. You'd rather have that. Oh I would rather have it certainly. And Katie and I have discussed this before I've talked to some of the family members and they certainly are advocating for this. Chair recognizes representative Prince to your left for a question. That's a gentleman you. He'll. Is it true that this bill will cost any traffic find by any citizen an additional 1.5%? That's correct. Thank you. But that's 2% less than it was in effect for about 14 years. You have no further questions. I yield will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. What purpose does representative mom to hand rise? Mr. Speaker, pursuant to House row number 133. I'd ask to be recuse from this gentleman. House that ride in the journal will so reflect. What purpose does representative McLaren rise? Parliamentary agree. You really are training up to be in the Senate, aren't you? Today is a crash course. Yes, sir. Parliamentary agree. Thank you, Mr. Speaker. Is it not true that despite the noble purpose of this bill or the bill, yeah, it would fall into the category of what I call sort of the normal grind of increasing the scope of penalties, punishment under criminal justice system, and that notwithstanding the history on the amount of this fine, putting the incidence of who's paying for this on the people who get traffic tickets in our municipal courts is not the way to fund government. Is that not true, Mr. Speaker? I'm sure the gentleman believes that to be true. What purpose does representative prince rise pursuant to House row 133 acts to be excused from this vote? Gentlemen has that ride in the journal will so reflect. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 202. The eyes are 139. The nays are 27. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House resolution 842. House resolution 842 by representative Cantrell of the 22nd and others proposing an amendment to the Constitution so to restrict the ability of the general assembly to increase the salary of state senators and representatives and to establish a salary for state senators and representatives equal to 60% of the median household income in Georgia. This resolution have been referred to the Committee on Budget and Fiscal Affairs oversight. That committee recommends that this resolution be adopted by rules committee substitute. Chair recognizes representative Cantrell to present the bill. Resolution. Colleagues, I bring to you a very simple constitutional amendment today. It's a bipartisan effort with three democratic sponsors and three Republican sponsors. I believe that we're elected to represent the best interest of our constituents. They've elected us to make hard choices on their behalf and I normally don't support advocating that responsibility and putting it back on the voters. However, today we're looking at an issue that represents a conflict of interest for all of us. If we were to want to vote ourselves a pay adjustment, we would all need to use rule 133 or the chairman Mike Chokas rule and excuse ourselves from the vote. This constitutional amendment protects us from having to recuse ourselves. The last time the general assembly had the courage to adjust their salary was all the way back in the 1990s with the exception of a small cola in the 2000s, one time cola adjustment. Let me be clear. We are not voting to give ourselves a pay adjustment. If this amendment passes, the general assembly will no longer have the ability to give ourselves a pay adjustment in the future. This amendment would allow Georgians to vote to remove the general assembly's ability to give ourselves a pay adjustment and would set our pay at 60% of the median household income in Georgia. It would also protect the general assembly from ever becoming a full-time job and would sure that we remain a citizen legislature. You may wonder why 60%. The National Conference of State Legislators, Legislatures, rated Georgia's legislators as ones that typically work the equivalent of at least two-thirds of a full-time job. Given this information, I chose a number slightly lower than that amount that is kind of an industry standard for determining what is a part-time position. Does this general assembly continue to enact policies that make life better for Georgians? The result would be that the median income in our state would rise, which would result in the compensation of general assembly members rising proportionally in the same way. As Georgians do better, the general assembly would do better. Additionally, we would never have to address this issue again. The question on the ballot reads this way. Now the Constitution of Georgia be amended to restrict the ability of the general assembly to increase the salary of state senators and representatives and establish a standard salary for such individuals equal to 60% of the median household income of Georgia. And that is the Constitutional Amendment House Resolution 842. Mr. Speaker, I'm happy to yield for questions if there are any. You do have a question if you care to yield. I'll be happy to yield. Chair recognizes representative Dukes, to your left for a question. Thank you, Mr. Speaker. Would the gentleman yield? Certainly. Yes. I ask you at your seat. I'm sorry? I will ask you at your seat. Oh, okay. You have another question, too, if you care to yield. Yes. Mr. Speaker, I'll yield for one more. Mr. Speaker, I recognize chairman Dukes, to your left for a question. Thank you, Mr. Speaker. Would the gentleman yield? Certainly. You mentioned that we would no longer have the ability to control our own pay, and I certainly understand that. But would this body have the authority or the power to make a change to that 60% number? Certainly. It would take a constitutional amendment in order to do so. Thank you. Be the same level of acceptance as what we're doing here today. You have one more question you might want to take. I'll take it, Mr. Speaker. Chair recognizes the chairman of the Committee on Information and Audits. Chairman Hogan. Yes, sir, I did. What is 60% of the media income? Currently, median income is about $58,000 in Georgia, so it would be around $35,000. Thank you. With that, Mr. Speaker, I'll yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to withdrawing the Committee's substitute? The chair here is none. The Committee's substitute is withdrawn. Is there any objection to adopting the substitute offered by the Committee on Rules? The chair here is none. The Rules Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the adoption of the resolution? The chair here is none. The report of the Committee is agreed to. Now this resolution now be adopted, all those in favor of the adoption of the resolution will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Thank you. All members voted. Have all members voted. If so, the clerk will lock the machines. On the adoption of House Resolution 842, the eyes are 136. The nays are 33. This resolution having received. The requisite constitutional majority is therefore adopted. Clerk will read the caption to House Resolution 820. House Resolution 820 by Representative England of the 116th. A resolution honoring the life of Mr. James Elbaus and dedicating the intersection of his memory. This will have referred to the committee on this resolution having been referred to the committee on transportation. That committee recommends that this resolution be adopted by committee substitute. Chair recognizes the chairman of the Transportation Committee. Chairman Jasper's to present the resolution. To have a little quiet. Thank you, Mr. Speaker. Members, will you rise with me as we honor 19 Georgians who are being honored with the naming of a road or bridge after them? Special want to thank our analyst Abbey Day who works on this tirelessly and makes it very easy for all of us. This resolution as you notice is named Sartes off with Chairman Terry England who named the intersection of Barrow County after Mr. James Boss who settled in Barrow County in 1866, cultivated over 600 acres of farmland was considered the largest farmer in the area. It has many descendants still living there including his great-great-grandson, Chairman England and his family. Other than this resolution, Representative Rhonda Burnell, for naming part of State Route 139 for Gold Star Fathers. For the acknowledgement of their loss of suffered when they lose children, it serves to this great country. Representative Rhonda Burnell for naming part of State Route 54 for the Arnold Fountain Professional Club that engages members who strive to promote professionalism and civic pride and elevate major issues in the field of education. Representative Sheila Jones for naming State Route 70 for the Reverend Joseph Jones who served this country in the United States Navy and served as a minister to the Norwood Tabernacle Baptist Church. Chairman West Control for naming portion of State Route 372 for Mr. Roger William Cavendor. He served as the country with the United States Army during World War II, storming the beaches of Normandy and fought the battle of the bulge. Chairman Penny Hauston, recognizing Mr. Charlie D. Rogers, served as country in the United States naming during World War II and lived as a commitment to protecting the people and ideas of the United States. Chairman Penny Hauston for recognizing Lieutenant Hugh Moore, a native Nashville who served as the United States Army pilot and flew to loose eight missions over Germany during World War II and went missing an action over intimate territory on July 28, 1942. Representative Rebecca Mitchell for naming the intersection on State Route 78 for Specialist Etienne J. Murphy tragically lost his life certain with the United States Army in Syria while conducting combat operations. Chairman Eddie Lumpsen for naming the intersection of US 27 and State Route 1 for Judge Larry Salman who earned a reputation as a clear thinker, hard worker in whose decisions were governed by the rules of honesty and fair play. Representative Brad Thomas for naming the intersection on 575, interstate 575, and X 11 for officer Joseph W. Berson who served as community in Holly Springs as a police officer and was tragically killed during the routine traffic stop. Culcus Secretary Bruce Williamson for naming the bridge on State Route 11 for Sergeant Terry Savage served as nation flying reconnaissance missions in the Vietnam War, which remember the United States Army, was killed in the aircraft accident. Representative Beth Camp for naming the bridge on State Route 109 for Rex J. Yurkes who is devoted to preserving the environment and the passion about conservation efforts on behalf of Pike County residents. His contribution contributions were instrumental to numerous organizations such as the Lions Club and Calamist Association. Chairman Lee Hawkins for naming this portion of State Route 53 for Bobby Sue Hooney while in route from one shift to another was killed while assisting a motor stuck in a ditch after tornado. It's a little the roadway with debris. Chairman Mike Chugas naming the portion of State Route 26 for Sheriff Horace Irving Snyder, serving as Sheriff of Marion County for 27 and a half years, the longest tenure any sheriff in that county's history. Representative Rebecca Mitchell, named the intersection on State Route 8 for Specialist Adam Herald served as the country in the United States Army 82nd Airborne, where it's recognized as an expert marksmanship badge and a reputation as a soldier willing to mentor and support others. Chairman Eddie Lumpson for naming the intersection on State Route 48 for Mr. Bobby Lee Cook, known as the Dean of Criminal Defense Loggers who will long remember for his advocacy the people all walks of life and his commitment to legal profession through his mentorship of other attorneys. Chairman Alan Powell for naming a bridge on State Route 51 for Mr. Fred Pullman, Pullman committed his life to Franklin County, Georgia. He served as the EMT for the Royston Amulet Service, and served as the Justice of the Peace and became Deputy Sheriff in 79, position he held for more than two decades. Chairman Terry England for naming the portion of State Route 211, for Secious Milner, served 18 years as the nation's armed services, six of which were in World War II, returned to civilian life and ran successful farm raising black angus and serving in his church. In Chairman Bill Hitchens, by naming the portion of State Route 144 for Sheriff Clinton Rush, served as the State Trooper and served 28 years before being elected as Sheriff of Tattoo County and serving that post for 20 years, ensuring integrity, dedication to sound principles of law enforcement. Mr. Speaker, if we can, his members take a moment of silence to recognize these 19 Georgians. Thank you, Mr. Speaker. Thank you members. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. All those opposed will vote no and the clerk will unlock the machines. What purpose does Representative Wolenski rise? Parliamentary inquiry. State your inquiry. Thank you, Mr. Speaker. It's not true that this year one of my goals was to remove a name from a road for making Flaker an anti-Semitic comments, but I did learn that is a committee rule that we do not remove names here in Georgia from roads. Thank you. If the gentleman so states, I think he's correct on that. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of or the adoption of House Resolution 820. The eyes are 173. The nays are zero. This resolution having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Resolution 822. House Resolution 822 by Representative Stevens, the 164th and others. A resolution stating Georgia's opposition to the shark fin trade. This resolution I have been referred to the Committee on Game Fishing Parks. That committee recommends that this resolution be adopted by a committee substitute. Chair recognizes Chairman Stevens to present the resolution. Thank you, Mr. Speaker, ladies and gentlemen of the House. HR 822 is a very simple proposition that asks Georgia to show its opposition to the practice of shark finning. Those of you that don't know, some of these countries do this routinely and it's a matter of catching a shark, cutting the fins off and then throwing the live fish back into the ocean essentially to die. This does not prohibit those legal fishers that keep the fins and then consume the meat or sell the meat or whatever. That's a different altogether. If you will, the Saltwater Recreation Fishing and Georgia, especially down where our lives, about a $344 million operation for Saltwater Fishing. It's 3,800 jobs associated with it. Mr. Speaker, I ask that we pass unanimously support HR 822 and I'll yield the wealth. There's no questions. You have a question if you care to yield. Yes, sir. Chair recognizes Representative Hutchinson. Do you arrive for a question?\n\nThank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. I just want to make sure I understand. So if I'm catching a shark and I keep, and I take off the fin, but keep the carcass, that's okay. Sure. Okay. Thank you, Mr. Speaker. I yield a well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution, the chair here is none. The report of the committee has agreed to. Shall this resolution now be adopted? All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the adoption of the resolution, the eyes are 171. The nays are zero. This resolution having received the requisite constitutional majority is therefore adopted. Clerk will read the captioned House resolution 593. House resolution 593 by reps and a pogan of 178th and 79th. And others, a resolution compensating Mr. Dennis Arnold Perry. This resolution haven't been referred to the committee on appropriations. That committee recommends that this resolution be adopted by committee substitute. Chair recognizes Chairman Hogan to present the resolution. Thank you, Madam Chair and members of the House. I'll bring you before you today House resolution 593 seeking compensation for Dennis Arnold Perry. Mr. Perry was wrongfully convicted for murders of herel and thymus Wayne and spent more than 20 years wrongfully incarcerated in prison. The DNA and other evidence now has proven his innocence. The GBI felt him to be innocent. Superior Court of Green County also found him to be innocent. And the DNA found him to be innocent. The resolution seeks to compensate Mr. Perry for his wrongfully imprisonment for $1,230,000. Whereas, dear his imprisonment, Dennis Arnold Perry was divorced from his wife, lost his home, both of his parents and his stepfather, and still maintained an exemplary record as a prisoner, serving as a mentor and example for other inmates. So that's the bill and I appreciate your vote in favor of Mr. Perry. And I yield a well if there are no questions. There are no questions. Thank you. The gentleman is yielded the well. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? Chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The Chair here is none. The report of the committee has agreed to shall this resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will unlock the machine on the adoption of the resolution. The A's were 157 and the A's were 6. The resolution haven't received the requisite constitutional majority is therefore adopted. Clerk will read the caption to House resolution 626. House resolution 626. House resolution 626 by Representative Colcom of the 81st and others. A resolution compensating Carrie Robinson. This resolution I'm in for the committee on appropriations. That committee recommends that this resolution be adopted by committee substitute. Chair recognizes Representative Holcomb to present the resolution. Thank you Madam Speaker. It's my honor to present to you House resolution 626 on behalf of Carrie Robinson. Carrie Robinson was convicted of a crime that he did not commit. He was convicted of a brutal sexual assault based on the testimony of an incentivized informant and based on faulty testimony about DNA by the Georgia Bureau investigation during his trial. This was brought to me last fall and I want to tell you briefly about that. When it was brought to me, I was initially skeptical. As many of you know, I've spent most of the last seven years working to address or help improve our state's policies and the response to sexual assault. And so to be asked to work on a case where somebody had been convicted, it was something that I hadn't gone through before. And my immediate reaction was not terribly positive to be very candid with you. But I said I'll listen, I'll hear you, and I said I need to do my homework. So I got the transcripts, I called the prosecutor, I talked to the defense attorney, and there's no doubt in my mind, which is why I'm standing here before you today, that Mr. Robinson spent 18 years of his life in prison for a crime that he did not commit. And the details of that are very simple. At his trial, and I love the GBI, and I think that they typically do great work. But in this case, they got it wrong because at his trial, the expert witness said with respect to testifying about the DNA evidence, he said, I can't do the math, but it's a very, very low probability that it was anyone other than Kerry Robinson. So based on that representation, that was the corroborating evidence, Mr. Robinson was convicted. He was never identified by the victim, and in fact, I've spent time with Mr. Robinson and his family, and at the claims advisory board hearing, his sister Miranda told me that after Kerry had been indicted, they were at the supermarket, and they ran into the victim. His sister knew the victim, his mother knew the victim. They had a conversation, Kerry did not know the victim, and he was only told about it afterwards. The victim did not know who he was and never identified him. So this is a case that is terribly heartbreaking. 18 years of his life gone. We can never truly compensate for that, but we can do something. And one thing that I forgot to say, but it's important for y'all to know, is when the math was actually done correctly, Mr. Robinson is African-American, when the math actually was done correctly, it's 1800 times more probable that a random person on the street committed the crime than he did. So he was released. He's now doing very well today, and I have to tell you, getting to know him has been one of the most inspiring things I've ever been able to experience, because he doesn't have any anger in his heart. He always knew that he was innocent, and now that he is free, he just has a really amazing sense of gratitude. And so I hope that with that, we can be supportive of this resolution. Some might say, well, who should pay this price? The prosecutions are made on behalf of the state. The name of the case is always state V. It's the Department of Corrections and state dollars that put people into prison. So I will submit to you, it has to be state dollars that help compensate. I'd be happy to answer any questions if there are any. You have a question. The chair recognizes Chairman Sets for a question. Jim and you? Yes. I asked this question. Some folks that are skeptical about these things, but in this case, as you said, I think very articulately, the state had a duty to this person that the state did not perform in that true. Yes. So, if there's members here that are generally skeptical about these kinds of things, this case in particular is one in which the state had a duty that did not perform. So this might be even seen as more a better candidate for compensation, perhaps, than even others in that true. Yes. Thank you. There are no more questions. Okay. Thank you. For what purpose does Representative Gravley rise? Probably not adequate. State your inquiry. It's not true that if this is one of our own family members or a loved one in our community, someone whose life had been taken away, that we would vote our conscience on this measure. As the gentleman so states, is there any objection to the previous question being ordered? Chair, here's none of the previous questions ordered. Is there any objection to adopting the Committee substitute? The Chair, here's none of the Committee substitute is adopted. Is there an objection to agreeing to the report of the committee, which was favorable to the adoption of the resolution? The Chair, here's none of the report of the committee. Is it agreed to? Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machine. All members voted. cutest have all members voted. If so, the clerk will lock the machine on the adoption of the resolution the yeas were 157 and a's were six. The resolution having received the requisite constitution majority is therefore adopted. Clerk will read the caption to HR 732. HR 732. House resolution 732 by the Senate of 49th. Proposing a member to the constitution so it's a change to date by which temporary loans for counties, municipalities and other political subdivisions are payable from the end of the calendar year to the end of the county's municipalities or other political subdivisions fiscal year. This bill ever referred to the committee on governmental affairs that committee recommends that this resolution be adopted by a committee substitute. Chair recognizes Chairman Martin to present the resolution. Thank you Madam Speaker. Ladies and gentlemen, I have an item today is constitutional amendment that we need to pass to help our local municipalities. Primarily our school boards and some of our cities in the metro area but it could affect each and every one of us. This is to allow governments that have tax anticipation notes. That's a note that a school board would do while they're waiting on their tax revenue to come in their avalorum tax because they're primarily funded by avalorum tax. We all know tax digest get behind because of protests related to assessments and when this happens the tax anticipation notes are currently required to be paid back by July by December 31st of that calendar year. We have in many cases in the local area here particularly APS the Atlanta public school system in Fulton County that have tax digest that would normally come out in September October and they would have time to collect their taxes. But in cases when the tax digest is late their tax anticipation notes are due on December 31st they may not receive their tax revenue until January of the next year. So what this amendment does before the voters is simply ask that those loans be paid back in full within 12 months. It doesn't increase the borrowing power in fact it is very clear that they have to pay back if they have any unpaid notes. They can't take another one so it does not increase the borrowing power. It simply allows our school boards and cities to make use of what is already allowed in the Constitution and pay back the loans over 12 months. Matter speaker this is a friendly amendment that will assist our local governments when they need it and I ask the House's consideration on this amendment it does take 120 votes I hope we can all get behind this if there are technical questions I would stand for them. There are no questions. I yield the well-nast everyone's favourable consideration on HR 732. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to adopting the committee substitute chair here's none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the adoption of the resolution the chair here's none the report of the committee has agreed to. Shall this resolution now be adopted all in favour of the adoption of the resolution will vote yes all those opposed will vote no in the clerk will unlock the machine. For what purpose does representative Smari rise. He waves. Have all members voted. If so the clerk will lock the machine on the adoption of the resolution the a's were 165 the nays were three the resolution having received the requisite constitutional majority is therefore adopted. We're moving on to the next supplemental calendar. Clerk will read the caption to House bill 824 House bill 824 House bill 824 House bill 824 of our members of the can't trail over 20 second to be a title of an act to amend chapter 6 in title 47 the official go to Georgia and tell you relating the Georgia legislative retirement system. So increased the retirement allowance. This bill I'm referring to committee on retirement that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman can trail to present the bill. Thank you Madam Speaker colleagues will bring to you House bill 824 this bill is designed to address the fact that we have overfunded the legislative retirement system for over 20 years in the current system there's a disparity between our contribution which is tied to a percentage of our salary and our benefit which is fixed in other words our contribution continues to go up but our benefit remains the same this bill would convert us to a fixed contribution with a fixed benefit. This has no cost to the taxpayers of the state the legislative retirement system is funded by our money it's our it's it's comes out of your income there's no state dollars involved no taxpayer money involved in any way that the employer is our state may not contributed to this since before 2000 we currently overfund the legislative retirement system at around 128% if we adopt this bill today LRS will continue to be overfunded but only at around 123% so it's a modest proposal that ensures long term success of the LRS while at the same time providing for more equitable formula and return to retirees and with that Madam Speaker I'll yield for questions if there are any you have a question chair recognizes representative Bruce for a question we have a gentleman yield yes sir the you say we've overfunded it are you going to give that money back to the people that paid it that's the idea behind this bill representative Bruce is to give some of that money back in a more in a fairer way than how it's being distributed currently. gentleman you sure how would it be refunded when the checks going out it's not going to be refunded that way but it will be given back in a more equitable way to those who've paid into the system thank you for your question chair recognizes chairman Carson for question. gentleman yield certainly I want to thank you for bringing this forward is it not true that this measure does not cost the state any funds whatsoever that is accurate it doesn't cost the state a penny and to follow up to my colleagues from Fulton County is it not true that this basically seeks parity whereas previously we were contributing a percentage by getting a fixed amount we're looking more or less for parity here and if we did nothing if we did not adopt this measure then the amount of overfunding in the LRS system would continue to increase is that not true that is true the number of our contribution would go way up next year but the benefit would would have remained the same and is it not further to the gentleman further you yes and is not further to that once we adopt this the program will still be well over funded still not cost the state anything that is correct it's a very modest proposal a big step in the right direction but there's still a lot more left to be done with that madam chair I'll yield the well the gentleman has yielded the well is there an objection of the previous question being ordered the chair here's none the previous question is ordered am of objection to adopting the committee suffered chair horse now another commission is adopted is her Governor有 actually to agree to the report of the committee which is favorable to the passage of the bill the chairatre that the report He's agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? For what purpose does Representative McDonnell rise? He waves. For what purpose does Representative Holly rise? A real question. Sorry. First I want to rule 133. I request the existence vote. Gentlemen has that ability. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The a's were 151. The a's were 17. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption House Bill 918. House Bill 918. House Bill 918. Members of Chocus, 138. Others to be entitled to amend Title 31 of the fiscal day. Georgia and the health service to provide for the establishment of the Georgia rare disease advisory council. This bill ever referred to the committee on health and human services. That committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Chocus to present the bill. Thank you Madam Speaker. Ladies and gentlemen, I bring before you tonight or this afternoon HB 918. This measure simply creates the Georgia rare disease advisory council. A rare disease is defined as a disease that affects fewer than 200,000 people in the United States. There are more than 7,000 known rare diseases affecting approximately 25 to 30 million Americans. Have a Witcher children. A state-based advisory council composed of qualified professionals and persons living with rare diseases and their caregivers could educate medical professionals, government agencies, legislators and the public about the rare diseases and is an important public health issue and encourage research into the development of new ways to diagnose rare diseases. Madam Speaker, if there are no questions, I ask for everyone's favourable consideration to this issue. There are no questions. Thank you Madam Speaker. The gentleman is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to the adoption of the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favourable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favour of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? So the clerk will lock the machine. On the passage of the bill, the yeas were 168. The nays were one. The bill having received the requisite constitutional majority.\n\nis therefore passed. Clerk will read the caption, House Bill 1483, House Bill 1483. House Bill 1483. I'm going to represent a Barton of the Fifth to be entitled to an act to amend Article 1 of Chapter 10A of Title 43 of the Efficient Go to Georgia Antony relating to licensing provisions regarding professional counselors, social workers, and marriage, and family therapists. So is to provide for licensure by endorsement in social work. This bill ever referred to the Committee on Health and Human Services. That committee recommends that this bill do pass. Chair recognizes Representative Barton to present the bill. Thank you, Madam Speaker. I'm presenting the House Bill 1483. The purpose of this bill is to encourage more people into the field of social workers, by reducing clinical, supervised hours to become a licensed clinical social worker, and add restressant positivity to other states that have the same or more stringent requirements. This brings us more in line to surrounding states so we can be more competitive. With this changes, his in hopes increase the workforce in the mental health profession. It also encourages the board to review their rules and regs during the remainder of this year to help the streamline their process and seek input on ways to help increase the workforce. Madam Speaker, if I have any questions. You do have questions. The Chair recognizes Representative Earhart for a question. Thank you, with the gentleman in the oven. Yes, ma'am. Isn't not true that this in fact is not your first bill, but the first bill of your legislative career was the bill that you presented last week. Is it not further true that when your seatmate questioned you as to whether or not that was indeed your first bill, you may or may not have intentionally or intentionally led her to believe that it was not I surmised with the intention that you would avoid the attention that often comes with your first bill. I was totally with my words with you. That is correct. Isn't that also true? That your seatmate wishes to give you a belated congratulations on your first bill last week. Thank you very much. Chair recognizes Representative Gilligan for a question. Thank you, Madam Speaker. Does the gentleman knew? Yes, ma'am. Thank you. So as I'm reading this bill and understanding, what we're actually doing is cutting regulation, therefore cutting red tape. Am I reading this correct? That is the way I read it too. Yes, ma'am. Well, thank you for bringing the bill. Thank you. Chair recognizes Representative Weedauer for a question. Does the gentleman yield? Yes, sir. Is it not true that the deception that Representative Earhart discussed a minute ago gives me pause when considering how you presented this bill to the body? No, sir. I'll take that consideration. I'll take that consideration. Madam Speaker, I yield the bill. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 173 of the nays were zero. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 9998. House Bill 997. I'd like to welcome the Watson and the 170 second and others to be entitled to enact to amend part one of Article 2, Chapter 5, of the Title 40, 80, the fiscal day, the Georgia annotator relating to property tax exemptions, so as to provide for statewide exemptions, from all ad-belorum taxes, for timber equipment, and timber products held by timber producers. As Bill haven't referred to the committee, ways and means that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Watson to present the resolution for the bill. Thank you, Mr. Speaker. I do bring before you, HB997. This is another forestry bill allowing us to request the people of Georgia to exempt the ad-belorum taxes of a forestry equipment. Currently, some of the equipment is taxed. Some of it is not. We're not real sure. But this is an industry that has been really impacted with inflation and the high cost of fuel, a shortage of truck drivers, and just a lot of their input costs continue to go up, but yet they're still getting the same paid, the same amount for what they do. This equipment sits in the woods, it never touches the road. A lot of times, we don't even know it's there, and it depreciates really fast. So the value decreases on it really fast. And so that's why we're doing this. And I would just greatly appreciate your support. And I'll take any questions, Mr. Speaker. If there is a question, if you care to yield. I'll yield. Chair recognizes Representative Washburn to your left for a question, just a moment, Representative. All right. I can hardly hear the gentleman, and he's only a few feet from me. Thank you, Mr. Speaker. General Mays proceed. Thank you, Mr. Speaker, for the gentleman here. Yes, sir. Is it not true that growing trees in Georgia is the same as growing any other crop? It is, yes, sir. And is it not true further that this is just a very fair bill to equalize and level the playing field with other agricultural equipment? That is, you are correct. I farm here in the state of Georgia, and I do not pay abnormal my equipment. Thank you. Yes, sir. Mr. Speaker, if there are no other questions, I'll yield. You do have one more if you care to yield. I'll take one more. Chair recognizes Representative Lorricia to your right for a question. Thank you, Mr. Speaker. Gentlemen, you. Yes. Is it not true that in agriculture we have the number one industry that at $80 billion forestry is right at $39 billion of that? That's great. Thank you. All right. Thank you. Great. I would appreciate everybody's support on this. This is great for our forestry industry and great for the loggers within that industry and all of the people in the industry. And thank you, Mr. Speaker, and I yield the will. Gentlemen, yields the will, but we have another member that wished to be heard. Chair recognizes Representative Al Williams to speak to the bill. Thank you, Mr. Speaker. I know you all realize how I hate to come to this will. But this bill is so important. It really should have come jointly with HR 686 because a lot is true of both of them. But I rise in support of it simply because one relative sticks out in my mind, named James Smith, in 1966. He was elected at the first African American Justice of the Peace in South Georgia when Justice of the Peace has had a big role. Well, he was also in the logging business. And when you went into the logging business, you could go into the logging business for $110,000. There were a lot of minority loggers, particularly in South Georgia. A forward tractor, a pulley, for the pair of tongs on it, was literally all you needed. And you were in business. In today's market, and I have a friend of mine who called me about this bill, young minority logger, third generation, his father left him his operation, his skitter cost around $350,000. The tires, if he outfitted his skitter with tires, it would cost more than it cost my uncle to go into business. It's about $10,000. That taxes on the skitter, about $22,000 to $24,000. The taxes alone. It has taken a lot of small producers out of the business, much like it took a lot of small farmers, the cost of equipment. Many of you in here, if you and I know a lot of folk have done their genealogy search. Many of those logs processed in South Georgia was where your people came from and migrated to North Georgia. Many folk went to college because their uncle, their father, or somebody, was in the logging business and could afford to help them go to school. It's an expensive business now, but there's still some small operators hanging on. You can't begin to imagine how important it is to a small producer to have a bill like this passed. The numbers are astronomical. We'll never go back through the way it was, but we can certainly help stop the decline of small producers from this business. This is a good bill, HB997, truly returned some money to people who work hard in Georgia, because those of you that are not familiar with the logging business, trust me. It's still hard work. It used to be harder. You've never heard of somebody being bare caught. I know you hadn't heard that. But that was when a man worked so hard in the middle of the summer until his body was drained of sodium and cramps attacked him all over. All over, and to see somebody with 15 or 20 cramps simultaneously is quite a sight. This new equipment helped move the bear out of the woods. This is a good bill for small producers. And I urge you to support this bill, to put them on parity with many other industries, or primarily agriculture business. They cost so much money to get in and stand. I urge your support for this bill. But that must speak out at least well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. What purpose does representative Wade rise? Parliamentary inquiry. Statue of inquiry. Is it not true that at this hour the clerk of this house has gotten his second win, that we should all do the same? I have asked him to ring the bill for a long, long time, a long time. Okay? Whether people get their bills passed or not. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 997. The eyes are 171. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 1425. House Bill 1425, I will work high as a 1507th. The other is being titled an act to amend Article 9 of Chapter 12 of Title 16. The official go to Georgia and Tate relating to access to medical cannabis. This is to authorize the governor to issue initial Class 1 and Class 2 production licenses for limited period of time. This bill ever referred to the Committee on Judiciary, that committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman War Ciser to present the bill. Thank you, Miss Speaker. In my eight years of presenting bills, I have never spent more than 60 seconds in the well that changes today. First, I have to thank some folks. The first person is not even here and I am sure he is watching unless he is at a high dollar golf tournament. That is Alan Peake who started this process years ago. After that, when he left, Michael Gravley said he would take up the mantle and move this process forward. This year, we saw a couple other people put a lot of effort into this and that is Chairman Powell and Chair Lady Sharon Cooper. As we are going through this process, trying to figure out what to do. The speaker is often does on the big measures. We got us all together. I will just pause here for a second and talk about something that corporations spend tens of thousands of dollars coming up with a logo. Some kind of cute phrase to fit their organization and then they try to meet that. The opposite happened in this house once this speaker took charge and that is the house leads. I can just name you a few in the past few years. When it came to adoption, the house led. When it came to rape kit elimination of the backlogs, the house led. When it came to mental health parity this year, the house led. Now it is our time to lead a medical marijuana. I wish I could say we are in a good spot but we are not. We have had patients now number 20,000. We have 20,000 families waiting for us to do something. If we do nothing, we are in a bad position. If we do something, it is not so great either. But I think we have got something that will move the process forward. I am going to run through that and again I want to thank the staff for the work that we have done. I want to thank the staff for the work that we have done. This is not my bill. This is all of theirs. This legislation is aimed at resetting the medical marijuana license process to improve transparency and the professionalism of these operations. This issue is too important to get it wrong. We are going to have a legal commission to immediately counsel the current RFP. There are no licenses. I guess we have literally created a time machine. We are going to direct the commission to immediately take steps to procure or obtain. No later than August 1st of this year, low THC oil and amounts necessary to meet the needs of the patients in this registry. We are going to have a legal commission to get it going while we fix these other things. It will direct the commission to immediately take steps to provide for dispensing low THC oil to patients no later than August 15th. It will direct the commission to issue a new RFP after the above items are complete but no later than December 31st of this year. We are going to require the RFP to be done differently. First of all, it will be managed by DOAS because this is something they are used to doing. The scoring will be evaluated by the third party, the independent third party. Then we are going to provide the RFP to state purchasing laws and open record laws which still protects trade sickers and IP intellectual property. As the previous RFP is going to provide for class 1, 2, class 1 licenses and 4, class 2 licenses. The other one we don't have to keep addressing this as the medical cards keep growing. We are going to go ahead and say that as the registry increases by every 50,000 patients, we are going to allow an additional class 1 license and additional class 2 license. There is going to be transparency throughout the process. It is going to require monthly updates to the Medical Cannabis Commission oversight committee. Then we are going to revise, since we are now behind schedule, revised dates for minority and women participation in the program. It is going to provide increasing immunity for the commission and the designated universities for the transport. In the year or so ago, Representative Walinsky added also a relative colliders to eligible conditions. The House passed that, the Senate removed it, we are going to put it back in. It reduces the distance from 3,000 to 2,000 feet for a license to be operational from a school church or synagogue. The additional legislative findings, Mr. Speaker, that is the bill now. I will stand for any questions. Do you yield for questions? Yes, sir. Chair recognizes the minority leader, leader Beverly to your left for a question. Does gentleman yield? Absolutely. I have a point of clarification. During the interim before the class 1 and class 2 licenses go out for RFP, there is an interim quantity of medical marijuana that needs to be produced. Is that going to be sole source or is it going to be someone who has already been on that to provide the interim amount of medical marijuana for the patients who need it? For the old that the commission is going to be allowed to get, it will not be source from any of the current license holders since there are none. So they will have to procure them for meter other sources or governments. Thank you. Thank you. Do you further yield? Yes, sir. Chair recognizes the dean of this House, Dean Smirie to your left for a question. Yes, sir. I mean, actually something. In terms of the license here is not existing now. Well, they have to reapply, but they won't have to pay again. Explain that process. That's a great question. Thank you. Appreciate you bringing that up. And unfortunately, we've got a couple of licenses, licensee holders that have not been signed that have invested a lot of money. So they will in fact be treated like everyone else and have to reapply, but in the bill, we have exempted them from paying any fees because there is a hefty application fee. Anybody who's already paid that fee will be exempt from paying that fee, but to the first part of your question. So yes, they will have to reapply like everyone else. The gentleman for you. Absolutely. And in the class one and the class two, the way we have the last time, you know, delineate this time, you said that was 12. No, it's still two class one and four class two. Okay, so the number will stay the same. That is correct. So I think I thought that we will change the number and up in it, the eligibility or the requirements for the license, but the license will not until we add until the license, the medical card holders reach 50,000. Will we not add to that again? And one last question. Yeah. Under the auspices of the university system, UGA and Fort Valley State, they will authorize a license here under the statute as well. They will continue to proceed in their in terms of their application. They won't have to reapply. That is correct. Thank you. Before the yield. Yes, sir. Chair recognizes representative Gilear to your left for a question. Will the gentleman yield? Yes. Thank you for this bill. You mentioned about minority and women participation. Can you further elaborate on that? Yes. In the previous RFP, we had stipulations for that and that will continue in the new RFP. So what we did after there's been some period of seeing how they've operated. And I understand the licensees that were supposedly awarded, they had that already in there. And they were, their scores were elevated for having that. So what this study will do, it's going to look back and see if there is not adequate minority or women participation, we will grant a license in addition without reaching the 50,000 threshold so that we do meet those qualifications. Does the gentleman further yield? Yes. Which department would this actually go through, would it be agriculture? DOS. Okay. So the gentleman further yield, one more question. When we did House Bill 213 of the hemp industry, there was probably a concern about minority participation. And so I thank you for this bill as a good bill and just encourage that we further follow up on holding that to be true. Thank you. Thank you. Do you further yield? I'll take one more because I know there's some other speakers who want to speak to this. I recognize his representative, Duke, to your left for a question. What did you do in the EO, please? Yes. Your, is it not true that we are continuing the same process except rather than it being handled by the commission that it is now being handled by DOS? Well, the commission is still involved but the scoring and application after the commission releases the RFP, that's when DOS and a third party score steps in but the commission is still in place. With the gentleman further yield. Yes. It is much as it was as much confusion around the mechanism of selection. Was any thought given to a different process? Well, there's been thoughts about every phase of this. But I'll tell you this. I know the commission's taking a lot of hits. That commission is made up of some very intellectual, very successful people. Part of that process, that ownership goes on the legislature for not having the guard rails in place and I think we've done that in this bill. Mr. Speaker, at this point I'm going to yield the well and let those other speak to this bill. Thank you. Okay, we have other members that wish to speak to the bill. Chair recognizes Chairman Setslor to speak to the bill. Ladies and gentlemen, House I rise today. I'd like to start by thanking the speaker. The speaker's dial back in a process that I think was spiraling out of control. I think the proposal that had been brought that would have expanded the number of producers to more than 20. Was kind of a rental way train and I appreciate what the speaker's done to dial this back. It's limited to the number of providers that was initially proposed. And I think I just want to make that statement here that what we have before us is better than what had been proposed. I'd like to thank the speaker for that. Having said that, I want us to understand what we're doing here and what we're doing is in this bill moving forward, moving it step forward in the process that I think is dramatically different than what this body acted on seven years ago when we passed the Haley's hope act in 2015. The question was, there was going to provide small quantities of low THC oil to address kids with acute medical conditions and focus on their conditions specifically. I think many of us came together then and passed the bill that we can feel good about because small quantities.\n\nThe low THC offer acute conditions is something I think we can all be very proud of. But let me say without any uncertainty in my mind, I think I want to make this clear for Georgians, I want to make this clear for this body. What is before us today? We're a part of it. This is a process. The fact that we're in the face of a protest where 22 providers came in to provide oil-based THC to Georgians, the fight here is one of making money on producing this. Now I'm a supporter of the free enterprise system and I believe with the free enterprise delivery system is an efficient, appropriate way to deliver services. But make no mistake about it, friends. What we have before us, not specifically in this bill, but in this movement towards expansion of legalized marijuana and THC in this state is something we need to be very cautious about. Again, I appreciate the constraints that leadership has put on this bill before us. I think it's a better bill than what was being proposed. But I want to say to Georgians and I want to say to this body, we need to be very, very careful. The monetization of THC, whether it's an oil-based form or the expectation of the future of it being a smoked form, is what's happening behind the scenes and what's happening below the radar screen. I want to caution us, this body, if we're going to be wise, needs to continue to put constraints on the use of low THC also could be used for specifically medicinal purposes at low concentrations for specific acute conditions. I'll close by saying a couple years ago in the Judiciary Non-Cilmocommada, we had a bill that came through, purported as a low THC bill, that would have allowed for, again, it was called a low THC oil bill, but it would have allowed for up to 20 ounces of 60 to 80 percent pure THC honey oil to be used at a street value of more than $30,000 in that quantity. That's what that could be bought for street value. That was what was being proposed to our Judiciary Committee as low THC oil. Because there is a movement behind the scenes and it's very soon going to be out in the open that's going to be monetizing this process to push for full on what you would call medical slash recreational marijuana and making Georgia recreational state. That's coming. The money behind this that's protesting the ZRFPs is driving this. It's a nationwide movement and it is coming to Georgia and they see this process as just a step in that direction. To build the infrastructure, to build the providers, to expand the providers so that we can have full on what they originally called medical marijuana, which was any doctor who believes the legalization of marijuana can write a script to let folks have marijuana and then behind that full on legalization. So friends, let's not be fooled by this. I think the speaker is in the leadership has done a great job of constraining the bill that's before us and I commend the House for that. Make no mistake about it. We are taking steps towards setting up the financial infrastructure to create a lobby and a financial set of interest that will drive through recreational marijuana in this state and for that we all need to be very, very, very concerned and vote cautiously as we vote on this proposition today. Thank you. Chair recognizes Chairman Allen Powell to speak to the bill. Thank you Mr. Speaker and the ladies and gentlemen of the House. After I listen to that last speech, I'm not sure if he is furritor again it. I will certainly tell you the same thing I've always said and said it back prior to the legislation three years ago that anything that's good or less grown natural has got to be better for something better than some drug made in some factory folks. Now where are we at today? I thought Chairman Burkis had a pretty good job explaining the bill and I'll get into some other parts of how this came to be. But I want to talk about what this is really about and it's really about those children and those sick individuals. Y'all remember all of y'all who were here three years ago? Y'all remember the balcony is being full of children that suffered from seizures, from illnesses. This is what this legislation is about and why is it here today? Because the absolute worst, the absolute most terrible part of government bureaucracy is what transpired over the last three years. The cannabis commission was established, the governor made his appointments and speaker made his and the light governor made his and you know I'm not sure what happened in between but at best of my knowledge it was absolutely disgraceful. Desk is graceful to the people of this state. When we got started into this issue back in November the U.R. regulated industry committee had hearings during the reapportionment and we just casually asked the director from the cannabis commission to come over and testify so we might get a little information about what was taken so long. Let me tell you something. If you've never been insulted you need to sit in the chairmanship position and assemble your committee and ask a state bureaucrat questions. That was the worst I've ever seen. You ask him what was their process I can't tell you. We're in a loud to talk about it because it was hidden and embedded in the legislation it said we can't discuss nor disclose or there was no open sunshine into the process. We asked a number of questions. Finally I gave up and I said well can you ask one question can you tell me if you're used any third party consultants can't answer that question. What colors of sky I can't answer the question folks and this is where they were and that prompted that prompted a level of investigation and that came on behalf of the committee. A lot of y'all that know me I'm not very much about asking questions and not getting answers. Yes me. But also this represented an insult to this house the people's house that was a run the we were the front runner on this issue about medical cannabis oil to help these sick people in our state. We started work on the committee and we looked into it and we started realizing what a complicated situation because of the legal community. Under the terms of the law of three years ago it said that there would be six licensees to class one hundred thousand square foot four class to fifty thousand and we're not talking about chunk change that was involved in it we're talking about a hundred thousand dollars license applications for one and fifty thousand for the other. We're talking about consultants out there who put together these intricate sets of blueprints and plans that would be submitted per the instructions of the cannabis commission. There was about minority participation or about the security or about the financial well-being or about where they were going to be located and you name it and it was there. Again, best I can tell you an insult to the people of this state. They've dragged on for three years. So when we started looking at it we found out that cannabis commission had done through going through some kind of a process to evaluate the applications. There were sixty nine applications and they went through this application process and as God is my witness I don't think I've ever seen anything as terrible as what we found out and how we found out wasn't from the commission and it wasn't from the people the six that were tentatively approved it was from the sixteen plus that either filed a protest or the others who just walked away because they threw the hands up at it. Folks we don't do business like that in the state of Georgia. We don't but this process if you can imagine this they divvied up the contracts and the requirements into sections and they gave each one of the six commissioners a little section and they said you judge this and put an numerical value on it. They didn't look at the rest of it and then they tossed it and they added it up. I smell a rat the wood pile folks because something told me that this thing was destined for hand-picked folks but that's how it was. So you had six companies, six of the companies that had been tentatively approved. You had sixteen of the companies that in the original legislation they had grounds to file a protest and we had sixteen that filed a protest in pending legislation since they were the only ones that we were told that would have legal standing. The D-16s would be filing legal litigation based on the failure of due process of the application evaluation process. Now I'm not a lawyer but that sounds pretty rich to me folks. You know, sounded pretty fair because they didn't just get that from the attorneys representing the protesters. I got this, the committee got this information from litigant attorneys that had nothing to do with it. They said that yes it would. And we realized at that point that what we were looking at was that that process if once litigation was filed it'd be filed in Fulton County it would come up at some point down the road, go through the court of appeal. So we were told that we could be looking at three and a half four or five, six years to be embroiled in litigation. The same as a lot of other states that went through this, strange enough. So we came up with an idea, well let's short circuit the idea, let's just give the protesters licenses. That's the only way that we knew to do it because the six that had been intimately chosen, we didn't want to get into their rights so that we give them reason for litigation. So you know we did a lot of things, we opened it up, we did away with these secrecy calls, we opened it up so the sunshine could peek in. So then folks back there in that glass ten room and then folks you see on TV that's been reporting all of this that they might get involved and start asking questions to fair it out what was really going on. This is the direction that we went on 1400. My colleague Ms Cooper put in a bell that had somewhat of a different approach to it. Her approach was to let the Medical Association to judge a half control of compliance and the list and all of that of the actual folks who were filing to get the medical cards. And hers even when as far as to add six more, something I disagreed with, but you know, you had three different chairmen in this house, we all had a different approach. Chairman Workhouse, he put in one that said the governor could pick one or have a diamond number of the six to go in and get it started because this has been dragging on way too long. So then you had the wisdom of the Speaker's office. They called it in, they looked at it, they are the attorneys, I'm not an attorney, I actually worked for, oh I'm sorry, I'm not an attorney, I rely on attorneys. But the Speaker's office drafted this document in front of you. And what this document does as I was so aptly told by one of my friends in there, this name will make anybody happy. Well, it hadn't, but it's almost humorous to me that the folks out there that had been petitioning that they were pretty full of themselves because they were tentatively approved. They didn't even talk to us, but I guess they wanted to talk now. But this document that you see in front of you that was crafted as a substitute that came out of the Speaker's office, it does away with the RFP. It starts back to scratch. Now, as I said, I'm not a lawyer and I don't know if this is going to produce litigation or not. But I know that this is probably the fairest thing to do. It would be the fairest thing to do because those six, those six, they're going to have to reapply. The 16 that filed a protest, they're going to have a chance to be re-evaluated. The other 40 something are going to be re-evaluated. And then somewhere out there, maybe that guy that, maybe the folks that played Eucalylia in the committee forest, they might even put in an application to people from wherever they're from. Because this opens a process back up. The most important ladies in gentlemen, what it does, it moves this process out from a bunch of appointed folks and it moves it into the hands of the professionals at the Department of Administrative Services. And they will hire third party consultants to evaluate any and all and they've got a time limit to get on move and they'll have to issue new RFP before the end of the year. That's ladies and gentlemen is what this does. I applaud the Speaker's office. I had a lot of y'all out there that asked me what my thoughts was. I said, by all means vote for this. Let's get it on across. We've got enough, we've got a little bit of time because we're going to have to deal that crowd across the hall and if they can file up something they're going to do their best to do it. So maybe if we get it on over there we can get moving. So ladies and gentlemen, I would ask for your support for this substitute and let's move on and let's see if we can get this system repaired in an order for the people that are deserving it. Mr. Speaker, I'll yield the well. Chair recognizes representative gravely to speak to the bill. Tough act to follow. Thank you, Mr. Speaker. I want to very quickly talk about, we've talked a lot about bureaucracy. We've talked a lot about fines and fees and applications appear and I want to take you back to a moment in 2014 where those of you who said in this house and this issue was being debated from this floor by then representative Alan Peake. Many of you really had a battle over whether or not this was appropriate. This was a controversial issue. This was an issue that we had multiple caucus meetings over. The hallways were filled, news articles were being ran on a measure that Georgia had passed in 1979. First time we were one of the original states and it didn't start in 2013 and 2014. It started in 1979 and 1980. It was started by a woman by the name of Mona Taff who was advocating on her husband or for her husband because he had cancer and she found out that he had gotten relief from this. She came up here, his name was Harris Taff and the irony is that we said and worried about this issue in 2014. But let me tell you what happens in just 10 short years. We have not become a recreational state. We have not implemented medical smoking or anything like that. Matter of fact, we have a very strict law. You can't even advertise with the color green in our law. There are no edibles in our law. You can't even have a standalone education center in our laws. For anyone that would want a patient seeking this who has been recommended by their physician who is warning education on this particular subject, you can't even have a standalone education center. Ladies and gentlemen, in 2014, we struggled and this was a brave and courageous vote by a lot of you. But today, we stand here in this same chamber, everyone in agreement, how do we get this to the children? How do we get this to my constituents? Because over the last 10 years, we have realized that there are constituents in just about every one of your districts that needs this. This it did start out with some children and their parents that came to the balcony. They came to the rotunda. But friends, I'm going to tell you, this affects young and old. Look at our diagnosis that we have in our law. Children don't get Parkinson's disease. How many people suffer from MS? Cicols, Celenemia, Ulcerative Collitis. There's a lot of people in this state that benefit, will benefit. So I want to make sure that we understand this process does not change the minority aspect. The inclusion of minority companies does not change that. Matter of fact, it puts an onus on Fort Valley state to go ahead and get moving. It puts the onus to let's get this moving forward now. Now the previous speakers were correct. The voting or the application process was tainted. Should they have hired a third party? Yes. Should that have been taken care of already? Yes. This time it will be. And those 69 companies that went through the application process will not be charged again. They will go through. They will be voted and it will be a clean voting process. It will be a clean grading process. But folks, I want to leave you with this. 20,000 peer reviewed medical journals have been written on the efficacy of this substance. 20,000. Our Medical Association of Georgia has created its own internal review committee because the doctors in the Medical Association realized that more and more and more of their patients were finding relief. We're finding positive effects from this. And the doctors wanted to know more. They want to be able to have that ability to sit down with their patient and discuss this. Openly and freely. Friends, I'll tell you last night we had a town hall meeting. Myself, representative Mom to hand, representative Gullet. We very blessed have representative Irwin, our chairwoman, Rich come out to us. And at the end of that, a gentleman running for county commission in my district, 47 years old, stopped me at the end of that. It was a totally different subject that the town hall meeting was being presented on. And he said, I want to thank you for your work on this. Because in 2005, I was diagnosed with leukemia. And I went out to Colorado and I would stay for five days. And it was a, it wasn't confirmed anything. It was just an opportunity that a doctor had told me about. He said, but today I'm alive and well. And I attribute that to those treatments that I took with medical cannabis in Colorado in 2005 and 6, long before we were discussing it in present day here in our state. Ladies and gentlemen, there are families in this state that needed this 10 years ago, 15 years ago. And now all of us are trying to figure out a way to move it forward. I would, I thank the speaker and I want to, I want to credit the speaker with this. From day one, the speaker has been with us. From day one, the speaker has helped lead the charge. From day one, he has set. And just like everybody else that was involved in this issue in the beginning, he has racked his mind, his brain, and trying to figure out a solution. Mr. Speaker, I thank you for that. So this bill moves it forward in a clean process. To be able to get this, it's got dates that are implemented. It looks at the open records problems that the previous bill apparently had. Although I do not believe that was a legislative intent, it apparently had some. I would ask for your favorable consideration on this measure so that we can do something in this state 10 years later to get these folks the medicine that they need. Mr. Speaker, thank you. I yield the well. So I'm going to yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. What purpose does Chairman Houston rise? The state jury inquiry. Mr. Speaker, is it not true that my heart goes out to these children and I'm far the bill? But after I voted for the last bill, is it not true that online 24 regarding legislators can own 5% of this? No more than 5%. I didn't realize that was in the bill before. Is it not true that somebody explained that to me? Well, the fellow sentence to your right there might take a shot at it. I'll wave. He waves. I'm not going to give you a high five on that one. Is it not true that I think that this is some way of a great opportunity that we can get this cleared up that legislators is big business that we vote known and legislators should not have 5% of it. Thank you. Chair recognizes Chairman Carpenter or what purpose do you rise? Parliamentary inquiry. State your inquiry. Is it not true? There's a lot of talk about how tight the language is on this bill but it does not. But Pills in comparison to how tight the supply this always for the consumers of Georgia. I would agree with that. What purpose does Dean Smiley rise? He waves. What purpose does representative McCloud rise? Parliamentary inquiry. State your inquiry. Is it not true that I was born in the island of Jamaica? If the lady so states and as such we have been accustomed to making sure that medical marijuana has always been in good use. I'll take the lady's word for it. What purpose does representative Erica Thomas rise? Is it not true that I don't want to go? What purpose do you rise? Parliamentary inquiry. State your inquiry. Is it not true that I don't want to go after representing McCloud statement? But I do have a question. My parliamentary inquiry is just to ask a question and make a comment. And that is saying that in this bill it would be getting rid of the last six licenses and giving out six new licenses that would make a independent consultant to be able to make the decision to the board whether or not they believe that the six new licenses should be given out. Well, I think they'd be making a recommendation based on some established criteria. Further inquiry. State your inquiry. Is it not also true that with line 76 through 81 it does state which is my question in the committee was it does state that this would still be able to have the six licenses would have the privacy and the exemptions that they were able to keep before. There are not six licenses now. The licenses have not been issued other than to the Fort Valley State as the license. That's the only license that's been issued. The six that were the successful bidders did not have not been awarded a license. Thank you. What purpose do we're just going to do one or two more of these and then we're going to lock it down. What purpose does chairman Setsler rise? Parliamentary commissioner. State your inquiry. Isn't it true that if there's skeptics in this whole process this bill actually puts more integrity in the process and brings this whole process back to where the original intent of the lecture was which is a limited circumstance to provide low T. I was certainly the intent. A purpose is representative gravely rise. I want to jankery state your inquiry. Is it not true that had the commission been able to hire a third party consultant at the original application process that we would not have had to go through the extent of protest that we did currently or that we are going through currently. The chair feels like the gentleman is accurate in that statement. Other inquiry police state your inquiry that these consulting firms that DOAS would work with have graded other applications in other states that they are attuned with what these companies need to do from a security standpoint, a harvesting standpoint that these companies sole purpose are to grade applications in this manner across other states to make sure that these states are getting good companies to make medicine. That's my understanding. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 1425, the eyes are 169. The nays are five. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 1390. House Bill 1390, by Representative Nullowicz, the 42nd and others to be entitled to men chapter 5 of Title 34 of the fiscal to George Antenned relating to sex discrimination.\n\nDiscrimination and employment. So it's to provide for a right of action against the county or city employer for retaliation. This bill ever referred to the committee on industry and labor that committee recommends a disbilled do pass. By committee substitute. Chair recognizes representative and relevance to present the bill. Good afternoon everyone and thank you Mr. Speaker. I rise before you right now to present House bill 1390. This is a bipartisan bill and it is truly the result of a tremendous amount of collaboration. By partisan collaboration here in this chamber and in the committee process. This bill is pretty straightforward. It gives city county and consolidated government employees a right of action against their employer. If they are retaliated against in their workplace after they make a claim of a report sexual harassment. This bill has the full support of ACCG and GMA. This bill passed the House Judiciary Committee unanimously and I hope to have your favorable support this afternoon. But before we do that I want to take a moment to again thank everyone involved with all of the work that went into getting this bill here today. I want to especially mention one woman in particular. This bill I think is going to help a lot of people in the state of Georgia but I want to take a moment to mention Captain Tony Gilevani in the Lawrenceville Police Department. She is not able to speak for herself. She was not able to come and attend these hearings but she is someone who has experienced this kind of retaliation and she is in my heart today as I present this bill to you. Again I ask for your favorable consideration. Thank you. Do you yield for a question? I do, yes. Chair recognizes representative McLeod to your left for a question. Does the gentle lady yield? Yes I do. I'm personally of no Tonya myself. In fact she called me as a whistleblower. So thank you for bringing this bill. I appreciate it. Thank you. Do you further yield? Yes sir. Chair recognizes representative Cannon to your left for a question. Thank you Mr. Speaker. Do you yield? Yes I do. Thank you so much for this bill. I wanted to bring to light that these conversations have been happening as whisper campaigns over the years and as many women and LGBTQ elected officials we've seen these issues happen in state government. But today I wanted to ask how does this impact those who might be pregnant or experiencing pregnancy? That's a good question. This bill is actually specific to sexual harassment. There is another piece of legislation that I have been working on with the same group of stakeholders and I am very optimistic and confident that work on that bill that actually does include pregnancy protections will continue throughout the summer and that I'll be able to introduce that during the upcoming legislative session. Do you further yield? Yes sir I yield. Chair recognizes representative Maynard to your right for a question. Thank you Mr. Speaker. Does this bill is it retroactive in any way? Unfortunately I don't think it's retroactive but I appreciate that question. Thank you. No further questions. Thank you everyone. Lady is yielded the well. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 1390. The eyes are 172 the nasor zero. The bill having received the requisite constitutional majority is therefore passed. What purpose does Chairman Collins rise to make a motion? State your motion. I ask that House Bill 1387 be recommitted to rules. Chairman Collins has moved that House Bill 1387 be recommitted to the rules committee. Clerk will read the caption. House Bill 1387, my room. Collins at the 68th and others being titled an act to amend title 40 the fish voted Georgia and tentative relating motor vehicles traffic so that it provide for the suspension of a motor vehicle registration upon a failure to pay a civil monetary penalty. On the gentleman's motion that House Bill 1387 be recommitted to rules as their objection. Chair hears none and it is so ordered. Clerk will read the caption to House Bill 830. House Bill 830 by resident of Irwin in the 28th to be entitled an act to amend Article 116 to title 15 in the fiscal to Georgia and tentative relating the general provisions regarding sheriffs. So is the repeal provisions limiting sheriffs to one additional salary for serving as the sheriff of multiple courts. Ms. Believer referred to the committee on public safety and homeland security that committee recommends this bill do pass by committee substitute. Chair recognizes representative Irwin to present the bill. Great thank you Mr. Speaker and colleagues I bring before you House Bill 830 it updates our general law. Concerning the minimum salaries of our sheriffs. Sheriffs minimum salaries are determined by four different categories first year counties population years of service for your sheriff. State mandated colas state mandated supplements for serving one court in addition to superior court. House Bill 836 to authorize minimum salary supplements for serving two courts. So if you read the bill you'll see we changed from giving us supplement for one court above superior court to two courts above. That supplement amount is per sheriff would be $4,630 per sheriff over the course of the year. So the supplement I'd like to point out that we currently pay our courts of courts to work all they get a supplement the same supplement in law for all four courts. If they have four courts that includes the state court then they get a supplement for four courts in their county and. You know pretty simple bill there trying to support our sheriffs I did a little bit of a deep dive into looking what we require of our sheriffs. And I pulled out a manual for them that we have for them here which is the office of the sheriff in Georgia it's the handbook for Georgia sheriffs. It's 140 pages long. So what I want to point out to you is that there is quite a bit that our sheriffs do for this state of Georgia every single day. And last time I checked our sheriffs don't go off the clock on Saturday afternoon or after five o'clock. There were can seven days a week 24 hours a day and they're trying to assist our communities on a regular basis you could imagine which many of us go home to our. Families a lot of times our families are concerned about our our sheriffs or their families are as they leave you could imagine to not only help with a situation that has occurred but the fact that they put their lives on the line. So Mr. Speaker what I'd like to do is ask for favorable consideration of House bill eight thirty and I'll yield for questions. Chair recognizes representative same to your right for a question. Does the gentleman yield out of is it not true that there's been Georgia sheriffs and those deputies who've been injured or lost their lives while protecting courts in the state in recent years and this bill looks to fairly compensate them like the author said like the superior court clerk. There there has been and you're correct there thank you. Chair recognizes representative cannon to your left for a question. Thank you Mr. Speaker do you yield yes ma'am I just wanted to understand on line 15 and of course because sheriffs are of the county it says that the county will be responsible for these funds. So can you speak to some of the counties that you have spoken to and how they plan to come up with this three hundred and eighty five dollars and ninety cents. The some of my counties one of the counties that I spoken to is the one that I live in there and obviously we dictate how sheriffs are paid in the state but the counties fund those salaries they also can provide a local. Supplement on top of that and many sheriffs receive even more above the minimum salary here but that my county is going to absorb it through the county budget that they have just like they would if there was increased fuel cost. And a further question do you deal so you spoke to the county that you represent my question is if you spoke to any other counties perhaps Fulton County the state's largest county. I did not and one further question if you further yield I do and so the issue is that you're saying that there are already individuals who might be eligible for this and so this is why we're looking for this solution I'm assuming. So how many people do you think that this would impact in your county or in Fulton County it's only one person in every county and we currently have a hundred and fifty nine sheriffs over the state the total state impact of this I believe if I can see the numbers somewhere near 736 thousand dollars spread out over 159 counties with those sheriffs. Do you yield for another question yes sir chair recognizes representative lot to your right for a question. There's a gentleman yield yes ma'am is it not true that if the sheriff does not cover those courts that they have to outsource that the coverage that is true and that would that be a cost to the counties to thank you thank you ma'am with that no further questions thank you Mr. Speaker will yield the well and ask for your favorable consideration for our shares. Is there any objection to the previous question being ordered? The chair here is none the previous question is ordered is there any objection to adopting the committee substitute the chair here's unden the committee substitute is adopted is Are any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair years none the report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no. And the clerk will unlock the machines. What purpose is representative McLaren rise? Make a motion, Mr. Speaker. I'm not going to recognize you to come up here and have a chat with me. We'd love to. All members voted. Have all members voted. If so, the clerk will lock the machines on the passage of House Bill 830. The eyes are 170. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1068. House Bill 1068, representative Levard of the 33rd to be entitled to amend Article 2, Chapter 21 and Title 50, the Fish Go to Georgia Antietta, relating to state torqued claims. Those revised provisions regarding service process. This bill then referred to the Committee on Judiciary that committee recommends that this bill do pass by rules committee substitute. Chair recognizes representative Levard to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House, I would ask your favorable support this evening for House Bill 1068. This bill proposes a very practical solution to a very practical problem. If you have a claim against the state that you try to take to court, you have to notify the state of the pendency of that case in two different ways. You have to deliver personally delivered to the chief executive officer of the agency affected a copy of the complaint and also have to deliver a copy to the risk management director of the Department of Administrative Services. Of course, those two people are very busy and they're not always in their office. So sometimes these cases go a while without being properly served or delivered. To address that problem, these agencies and DOAS have designated people who will be in the office to receive process. Problem is there's no foundation for that in the law. The law doesn't really allow that. Well, House Bill 1068 would expressly make that part of the statute so that these agencies could do that. You would also require them to be present at least three days out of the week so they could receive the papers when they are brought to those offices. And it would require they post on their websites the name and identity of the person to be served. And finally, it also, and it confirms they need to be in the office three days a week and I already addressed that. So it's a very simple solution to what is a very practical kind of problem. Some speaker, you know the well for any questions. You have no questions? Thank you, Mr. Speaker. Ladies and gentlemen, ask your favourable consideration of House Bill 1068. Now you'll the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to withdrawing the committee substitute? The chair here is none. The committee substitute is withdrawn. Is there any objection to adopting the substitute offered by the committee on rules? The chair here is none. The rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1068. The eyes are 166. The nays are two. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative McAllara rise? To make a motion. Make a motion. Whereas the clerk of the house has ably demonstrated his commitment to the letter of rule 139.3 concerning the length of time machines must stay open. I move that the rules of the house be temporarily suspended for the rest of the legislative day to allow for the machine to be unlocked only for a period of 30 seconds, Mr. Speaker. All right. The gentleman has made a motion. What purpose does representative Williamson rise? Probably a minute inquiry. State your inquiry. Mr. Speaker, is it not true that 1963 song done by the safaris with the famous solo of wipe out that drum solo that our clerk is right up there with a momentous. So I'll further second the gentleman's motion. Second the motion. What purpose does representative singleton rise? Probably a minute inquiry. State your inquiry. Is it not true that while I do appreciate the House following its own rules, I support Representative McLaren's decision and I think 30 seconds will be great. And I just glad we're following our rules. I'm expecting I think that's amazing. If you so. All those in favor of the. McLaren motion to suspend the rules. We'll vote aye those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the gentleman's motion, the eyes are 130. The days are 37. The motion having received a 2 thirds vote is thereby carried. The clerk will read the caption to House Bill 1335. What purpose does representative Mary Francis Williams rise? Parlimatory inquiry. State your inquiry. Does this mean we only have 30 seconds to run to our desk from anywhere on the floor? Or the bathroom, excuse me, ladies room? Well the converse of that is while we're voting, you need to stay close by. We got a big calendar. Yes, sir. The answer is yes. I will give that. The motion was adopted. Clerk will read the caption to House Bill 1335. House Bill 1335, I'm sorry, 135th and others being tied to a men's chapter 4, title 1 of fiscal to Georgia annotated related holidays and observances. So it's to provide for public safety week. This bill, everyone, referred to the committee on rules that committee recommends this bill do pass by committee substitute. Chair recognizes the dean of this house, Dean Smiley, to present the bill. Mr. Speaker, ladies and gentlemen, House Bill 1335 was a bill that would declare public safety week in Georgia during the week of September the 11th. That was a bill sponsored by the Columbus delegation, our City Council and mayor assess the past. Subsequently, a substitute was added in Chairman Smith and the rules committee. It was originally carried by the floor leader, a Lauren McDonald, and also representative Miriam Parish had a bill as well. And what this bill does, the current in the state requires 12 holidays by stature and 10 federal holidays and two of floating holidays that the governor can set and observes of either Robert E. Lee, Confederal Memorial or Jefferson Davis, a birthday. What this bill does, it updates a provision that requires the state to recognize all federal holidays and Congress has adopted a holiday schedule that requires June 10th to be a holiday. What we're doing is following the recognizes of the federal holidays of January 1, 2022. If you see in the bill that says January 1, 1984, and that was the year we passed the Martin Luther King State holiday bill because Congress had also adopted it as a federal holiday. And we followed suit and created as a state holiday. And the only person that was here when we did that was Rob's and Green and myself. And we created that. So the state holidays that will be recognized in 2022 be New Year's Day, a Martin Luther King during the holiday, President's Day, Memorial Day, June 10th, Independence Day, Labor Day, Columbus Day, Veterans Day, Thanksgiving Day, and Christmas Day. And then we'll have two floating state holidays. So Miss Speaker, that's the essence of this bill, creating a state holiday and required a state to go from 12 to 13. And that's all it does. No questions, Miss Speaker? You have a couple of questions. If you yield. Yes, sir. I'll yield. Chair recognizes representative Wolenski to your left for a question. Thank you, Speaker. Does the Dean yield? Yes. Dean, I just wanted to let you know that it's been when the honors of my life to serve with you. And you asked the first question in my first bill. So I'm going to return the favor and ask you, how do you feel? I feel good, sir. Thank you. You know what, Jane Brown's. I feel good. And it's almost dinner time. And she's sharing these with Tee because not him. Miss Speaker, I think it's dinner time. And she would say. Representative Stacy Evans will handle that. Okay. I'll leave it. Do you further yield? Yes, sir. One moment, Miss Speaker. You recognize this representative, McDonald's, to your left for a question. Does the Dean yield? Yes, I was at a true honor for me to work with you on this bill. I've been doing you a long time. I remember when you when you first was born. I remember that. Do you? This is going to further yield. Yes, sir. It's a true honor 47 years ago, and I was six years old running around chaotic on this floor that I got to sit in your lap. Well, I don't know about a lap dancing. But, yeah, you might have said to your next to me. But, uh, but I want to say this to you that your father done good. And I remember, sir, with your father, who was a very noble gentleman and he raised a great son. So thank you for that question. Is that it, Mr. Speaker? You have others if you care to yield. I think it's dinner time, Mr. Speaker. It's getting off the close. All right. I yield the will to speak and appreciate your consideration of how it will 1335. The gentleman, the stingress gentleman has yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the Committee Substitute? The chair here is none. The Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none the report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose is representative Paris rise? Parliamentary inquiry. Chair in inquiry. Isn't it not true that after three years of working on this bill, I am so happy to see it finally pass. Thank you. Thank you, everyone. I have all members voted. What purpose is representative Cannon rise? Parliamentary inquiry. Is it not true that I am concerned about the versions of the bills that we have here? I am trying to get an understanding of what LC number we are working with, which substitute as much as I might be in support of this measure, I am concerned that I can't get a clear answer from any of the sponsors. And it clearly only lists public safety week. Is it not true? Well, let's find out. What purpose does Chairman Dean Smirie rise? The speaker is not true that online. 19 through 22 states that the government has authorization to update the number of holidays that the state must observe and it will go from 12 to 13. It will create another additional holiday. Is that not correct? That is correct. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1335. The eyes are 152. The knees are two. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 972.\n\nIn the hospital, 972 by the resident of Belton of 112 to be entitled to amend Article 10A, in Title 43, the fiscal to Georgia and in the state of relating licensing provisions regarding professional counselors, social workers and marriage and family counselors. So it's to change certain definitions to provide for additional member to the Georgia composite board of professional counselors, social workers and marriage, family therapists, this bill I'm referring to the committee on regulated industries that committee recommends this bill do pass by committee substitute. Chair recognizes Chairman Belton to present the bill. Thank you Mr. Speaker and the spirit of House Bill 1013, the excellent work that speakers down the governor's well of making mental health more accessible to Georgia. To present House Bill 972 with a cleanup from a 1985 law, by cleaning up this statute, we're able to immediately bring 1700 more counselors in Georgia. We've talked to the psychologist, hospitals, the faith community, the preachers, the university, DHS, other state departments. A lot of people done a lot of work to make this bill possible and I'll ask for your favorable consideration. I yield the questions. You have no questions. I yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute to chair here is none? The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 972. The eyes are 165. The eyes are 1. This bill having received the requisite constitutional majority is therefore passed. Chair recognizes the chairman of the House Rules Committee for an announcement. Thank you, Mr. Speaker. House Rules Committee will meet at 6 o'clock. Chair recognizes representative Jasmine Clark for an announcement. Just an announcement. Thank you, Mr. Speaker. Please join us on Wednesday, March 16th. So that's tomorrow for an Asian Justice Riley one year after the Atlanta Asian shooting. Tomorrow at the railroad freight depot from 11.30 a.m. to 2 p.m. Thank you. Chair recognizes chairman Mitchell for an announcement. The Democratic Caucus will meet in 502 in the CLOB upon this break. 502 there will be of dinner served as well. Thank you, Mr. Speaker. I've been asked to announce, now this is the most important announcement you'll hear. In room 216 there will be hamburgers for members and staff of the House. Maybe the General Assembly. I don't know. I don't know if the Senate is getting any food or not. But 216 will have hamburgers for dinner. And with that, you heard the announcement about the rules committee meeting at 6. We will be in recess for dinner until 7.15. Thank you.",
  "updated_at": "2026-02-13T11:10:50.832406+00:00"
}