{
  "video_id": "__j1Tuf4wKU",
  "url": "https://youtu.be/__j1Tuf4wKU?t=1038",
  "title": "Georgia House - Day 40 (2026-04-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": "2026-04-04",
  "duration_minutes": 227,
  "summary": "## Georgia House - Day 40 PM Session Part 2 (April 4, 2026)\n\n### Overview\nLate evening session completing the final day (Sine Die) of the 2026 Georgia legislative session.\n\n### Key Actions\n- Final passage of remaining conference committee reports\n- Last-minute amendments and bill reconciliations\n- Closing speeches and recognitions\n- Sine Die adjournment proceedings\n\n### Sine Die Traditions\n- Final recognitions of departing members\n- Thank you speeches to staff and leadership\n- Ceremonial closing of the session\n\n### Session Characteristics\n- Extended session pushing toward midnight deadline\n- Historic legislation finalized\n- 2026 session officially concluded\n\n### Notes\n- Marks end of 40-day legislative session\n- Members return to districts until next session",
  "transcript": "Clerk will ring the bell.\nNow is the time for all members to come to the chamber.\nAll members, take your seats.\nMembers, take your seats.\nAll members, take your seats.\nFor what purpose does Leader of Stration rise?\nMake a motion.\nState your motion.\nThank you, Madam Speaker Pro Tem.\nI move that this House reconsider its action\non Senate Bill 234, 235, and 236.\nOn the gentleman's motion,\nthat the House reconsider its action in giving reconsideration to Senate Bill 234, Senate Bill 235, and Senate Bill 236.\nAll those in favor will vote.\nWe're going to pause just a moment while the clerk's office gets them all up on the screen.\nOkay, on the gentleman's motion that the House reconsider its action in failing to give Senate Bill 234-235 and 336 a requisite majority, all those in favor of reconsideration will vote yes, all those opposed will vote no, and the clerk will unlock the machines.\nOkay, here we go.\nHave all members voted?\nHe's voted one here.\nYeah.\nHave all members voted?\nIf so, the clerk will lock the machine on the gentleman's motion.\nThe yays were 135, the nays were zero, the motion carries, and the house is reconsidered its action.\nNow that the bills have been reconsidered, we're going to-\nWe're going to take final action on Senate Bill 234 Senate Bill 235 and Senate Bill 336.\nSo all three bills relate to homestead exemptions, and as you'll recall, they require a two thirds roll call vote for passage.\nThird reading and passage of these bills.\nIf there is no objection, we will vote on this local calendar, the three bills as a whole with a recorded vote.\nHearing none, it is so ordered.\nClerk will read.\nClerk will read the caption to the three bells.\nSenate bill number 234 by Senator Payne in the 54th.\nThe bride of the homestead exemption from City of Dalton independent school district, Admiral Armtax.\nThe Senate bill number 235 by Senator Payne in the 54th.\nThe Natal Nack to provide a homestead exemption from Whitfield County school district, Admiral Armtax's Senate bill 336 by Senator more of the 53rd.\nWe tell an act to provide a homestead exemption from Dade County School District out of Lorm, Texas for educational purposes.\nIs there an objection to the previous question being ordered on this local calendar?\nThe chair here is none of the previous question is ordered for what purpose does the leader of Strasian rise?\nDo you have a question?\nDo you waive?\nI'll waive.\nHe waives.\nIs there an objection to agreeing the report of the committee which is favorable to the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to.\nShall these bills now pass?\nAll those in favor of the passage of the bills on the local calendar will vote yes.\nAll those opposed will vote no and the clerk will unlock the machines.\nHave all members voted?\nIf all members voted, if so, the clerk will lock the machines.\nOn the passage of the bills, on the local calendar, the eyes are 147, the maize are two.\nThe bills having received the requisite constitutional majority are therefore passed.\nWe're moving on to the second to the local supplemental calendar.\nThe one bill on the local calendar relates to a homestead exemption requires a recorded two thirds roll call vote for passage third reading and passage of\nUncontest of this uncontested local bill if there's no objection we will vote on this local calendar with a recorded vote hearing none it's so\nOrder the clerk will read this local calendar.\nSenate bill 330 by Senator Estabés of the 35th City of Atlanta.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair here is none the previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nThe chair here is none the report of the committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill on the local calendar will vote yes.\nAll those opposed will vote no, and the clerk will unlock the machines.\nThank you.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the past of the bill of the local calendar.\nThe eyes are 150, the nays are seven.\nThe bill having received the requisite Constitution of Majority is therefore passed.\nplease.\nChair recognizes representative Clark from motion.\nI agree to the Senate's substitute as amended by the House, House Bill 54.\nRepresentative Clark moves that the House agree to the Senate's substitute as amended\nby the House.\nClerk will read the caption.\nCouncil 54 to be entitled back to a men's title, 1631 and 43.\nThe fish go to Georgia annotated relating to crimes and offenses, health and professions,\na business respectively, so to authorize advanced practice, registered nurses, and\nphysician assistance order, home health care services.\nChair recognizes Representative Clark to explain the Senate substitute and the House amendment.\nThank you, Madam Speaker.\nHouse bill 54, as passed in the House, it allowed PAs to sign home health services.\nAnd this, the Senate included allowing APRNs, which I totally support.\nA few reasons one, during COVID, it was allowed for three years by executive order.\nAnd it really expanded health care, how to speed up the home health services,\nwhen those who needed it, and also where the last state to allow it.\nSo I fully support it.\nIt's going to really help rule Georgia and just help health care in general.\nWe're glad to take any questions.\nThere are no questions.\nThank you, and I ask for your favorable consideration of House Bill 54.\nThank you.\nIs there any objection to the adoption of the House amendment?\nThe chair here is none of the House amendment is adopted on the gentleman's motion that the House agree to the Senate substitute.\nHouse bill 54, all those in favor will vote yes.\nAll those opposed will vote no and the clerk will unlock the machine.\nHave all members voted?\nhave all members voted.\nIf so, the clerk will lock the machines on the gentleman's motion.\nThe yeas are 157, the nays are zero, and the house is agreed to the Senate substitute as amended by the house.\nChair recognizes Representative Clark for a motion.\nHouse bill 23, I agree to the Senate's substitute as amended by the House.\nRepresentative.\nRepresentative Clark moves at the House agreed to the substitute to House Bill 513 is amended by the House.\nClark will read the caption.\nLet's correct that.\nDo we have the wrong one up there?\nI don't know which one we're doing.\nLet's pause for a moment.\nLet's do it, do over here.\nThe chair recognizes representative Clark for a motion.\nHouse bill 253 agreed to Senate substitute as amended by the House.\nRepresentative Clark moves that the House agree to the Senate substitute as amended by the House to clerk or read the correct caption.\nHouse bill number 253 to be entitled to amend chapter 11 of Title 15 in Article 19 of Chapter 9 of Title 19.\nIf this goes to George Antenna, really, in the juvenile code and general business relative to child custody.\nChair recognizes Representative Clark to explain the Senate substitute and the House amendment.\nThank you, Madam Speaker.\nHouse Bill 233, as we passed, unanimously had to stop in the sitting kids out of state to these reunification camps.\nAnd the House amendment.\nGentlemen, we'll suspend.\nPlease proceed.\nI've attached the language from House Bill 350.\nIt made it two rules.\nDidn't have enough time to get out on crossover.\nHas a special place in my heart.\nBack in, I think it was 2018.\nIt helps rescue babies.\nNewborn babies, well women are say being sex-traffited\nor going through, they fight their lives on danger\nand they need to get the baby to safety.\nAnd it expanded it to fire station,\npolice stations, hospitals, and all that.\nWell, what this allows is a baby box\nto where they can place the baby in it.\nAnd then the alone will go off.\nAnd the newborn baby is placed in the box\nand then the baby is transported to a medical facility.\nAnd after the baby checks out,\nthe fat comes within six hours\nand takes hold the baby also.\nThe primary alarm has to be checked once a month.\nTwice a day, the box has to be physically checked\nto make sure the baby is not in the box.\nOn top of it, they already have the alarm and all that.\nAnd I'll say, you might have seen it was in front page\nin the news and Tennessee.\nThey allow the same thing, and they'd rescue the baby.\nBut an amazing program, and it would allow the same thing here.\nAnd seven baby just being left, say, on the ground,\nyou know, at a police station, and the mom goes,\nso it just allows the box, the technology's there,\nmultiple states allow it, and we'd love to have your support.\nI'll take any questions on this.\nYou have a question.\nChair recognizes Representative Cannon for a question.\nThank you, Madam Speaker.\nDo you?\nAre you?\nI want to first thank you for this subject.\nIt's something very near and dear to my heart,\nas well as a labor doula.\nBut I do have some questions for you after discussing with some national organizations\nabout the different ways to do this same type of program.\nMy first question is online 66.\nIt says provided that the newborn child is no more than 30 days old.\nHas you considered making that up to 60 days old, which is typical around the country?\nI know, I remember carrying the bill from back when I carried the bill while we had the 30 days.\nA lot of times past 30 days has to do with law and kind of child abandonment or something like that.\nAnd I remember it last.\nWhen I carried in 2018, we had that 30 days because this is that time where usually if a woman is in fear for a life, sex trafficking, she has the baby and she needs to get a baby to safety.\nAnd there's something fun when I remember is why we have that 30 days.\nBut I mean, I'm open if you wanted to keep something down the road and change it to 60 days.\nBut I mean, I think 30 days is enough time to where the mother has a child, and she can\ndrop it off at one of these locations.\nBut thank you for your question.\nThank you, G.\nFurther Hill?\nOh, you have one more.\nOkay.\nAnd so, the way that this is written, there's an opportunity for someone to surrender a\nnew born at multiple locations, not just at a fire station, but there's other locations.\nSome would consider it to be best practice that those surrenders happened at a hospital,\nspecifically at an ER, which is what most of the national, or most of the states do.\nAnd so there's no need for the ambulance service.\nSo my question is, why are we including multiple different agencies creating multiple places\nof possible liability instead of just keeping it with that hospital?\nWhereas here it says medical facility, what's a medical facility versus a hospital?\nI'll say, I mean, I passed, and again, I'm gonna pull up my bill, but it expanded to the locations that's being allowed.\nAnd we've had the data, I mean, I've not seen anything negative come from these different places of letting the baby be dropped off there.\nMore places, and these places have to be a 24-7 facility, and since the bill that I passed years ago.\nhelp rescue babies and all that. So I felt very comfortable with the language in there\nand that it's going to protect babies and keep them safe. Thank you.\nChair recognizes Chairman Cooper for a question.\nThank you, Madam Chair.\nWell, gentlemen, heo.\nYes, ma'am.\nOkay.\nIsn't it true that sometimes usually at hospitals and at the fire station all the person\nwhen they're leaving the child actually comes in contact\nwith either the fireman or the nurse or someone.\nAnd many of these mothers do not want to be identified.\nAnd so what the boxes do is give them a chance\nto put the baby in a safe place instead\nof leaving them in the woods to the elements,\ngives them a chance to live and to be safe.\nBut the mother doesn't have to identify themselves.\nIs that not true?\nIt is definitely true.\nThank you.\nChair recognizes leader of frustration for a question.\nMadam Speaker, brought to you, is gentleman yield for you?\nSir, is it not true that this legislation,\nwhich allows for the protection of babies\nfor them to be put into care in a controlled environment,\nas legislation was worked on by representative Cameron,\nvery hard, was considered here in this house.\nAnd it's just simply part of your bill here at this late stage of session.\nExactly.\nRight in line with my bill and just protecting the babies, protecting the mothers.\nAnd yeah, thank you so much.\nThank you for bringing this bill.\nThank you.\nWith that, I yield the well and ask you a favorable consideration of House Bill 233.\nThank you.\nThe gentleman is yielded the well.\nIs there any objection to the adoption of the House of Mement?\nThe chair here is none of the House of Mement is adopted.\nOn the gentleman's motion, the House agreed to the Senate substitute to House bill 253.\nAll those in favor will vote yes, all those opposed will vote no, and the clerk will unlock the machines.\nThe\nhead all members voted.\nFor what purpose does representative Cameron rise?\nPardon me in the choir state your inquiry isn't treatment of speaker that\nDuring the process of this bill a baby was surrendered at a box just over the border for me in Tennessee and\nThe it was successful in a fire hall and the baby went through\nThe hospital and into foster care\nSuccessfully the gentleman knows of which he speaks what purpose does representative Clark rise\nIs it not true that I had a question for the speaker and if he doesn't mind do it on\nparliamentary inquiry, I'm really curious.\nI had a town hall and this issue of Ethan's law came up and there were some family law\npeople that were concerned about this outlawing the ability to have families reunite in any\ntype of way. And so I just wanted to get clarification on that. Is that not true Madam Speaker?\nI'm sure the lady knows of which she speaks and I encourage her to speak with the original author about that.\nHave all members voted? If so, the clerk will lock the machine. On the gentleman's motion, the yeas were 146.\nThe nays were 15 and the house has agreed to the Senate substitute to house bill 253.\nMembers, we have a special guest to the come and join us here in the house, Emily asks Mr.\nDoorkeeper, would you uh, Mr. Senator, the governor of the great state of Georgia, the\nHonorable Brian P. Kemp awaits entrance to the chamber.\nMr. Doorkeeper, please admit, the governor of the great state of Georgia,\nGovernor Brian P. Kemp, can give him and admit us into this Georgia House of Representatives.\nWelcome, Governor Kemp.\n.\n.\n.\n.\nMembers and guests, if you'll, give me your attention please.\nwe're certainly blessed here in our state to have a first family. Now I want to\nrecognize, I know you're going to do it again, at least one of them, but I want to\nrecognize the best third daughter in the state, Amy Porter Camp. Amy Porter, thank\nfor being here and the first lady for our state blessed us earlier with her\npresence in this chamber. First Lady Marty Camp, you're appreciated in so many\ndifferent ways by this house and by the people of this state. Thank you for being so\nprerative and so many issues that imported the Georgians and thank you for supporting\nour governor.\nLet's give a wonderful round of applause to that first lady.\nA gentleman that certainly needs though introduction in these parts, he's led this state through\nthick and thin, and he's done an outstanding job of bringing good, old-fashioned, common\nsense back to the job.\nHe said it's a pretty good predecessor, and I'll say that as well who excise those same\ngreat qualities.\nHe certainly has done the same.\nWe've got a little bit of work for you, Governor.\nWe've been sending you some bills.\nWe hope you'll keep that pin sharp, and at least sign the bills that came out of the\nHouse. It's my great honor, y'all. I know it is y'all's will to have the governor of\nthis state in this house chamber, the people's house, a people's governor, the 83rd governor\nof the great state of Georgia.\nGovernor Brian P. Kemp.\nOh, man.\nThank y'all.\nThank y'all so much.\nHappy signing, everybody.\nThank you so much.\nI was just thinking when the speaker was talking about keeping\nthe pins, sharpening the pins up,\nI was thinking to myself, they're sharp,\nor it's just a matter of which color we're going to use.\nJust kidding, just kidding.\nSpeaker Burns, thank you so much for having me.\nSpeaker, pro-timp Jones, majority leader,\neffustration,\nand our leader,\nleader, Hugley, members of the people's house.\nI, like you all, are honored to have our great First Lady,\nMarty Kent with us, and Amy Porter.\nThank y'all for welcoming them so much this evening.\nWe are very thankful that you have yet again delivered\na historic session for the people of our state.\nSince you gavled the session in just 81 days ago,\nyou have secured another one-time tax refund\nfor Georgia families fighting through the high prices\nthey've experienced over the last four years.\nYou passed a second tax cut acceleration,\nwhich will further help hard work in Georgia and job creators\nand save them at least another $725 million a year.\nI know we are all proud of the work\nand the much needed relief for those that have been devastated by Hurricane Helene.\nYou also supported legislation to strengthen our workforce\nand not only to keep us the number one state for business\nbut also make us the top state for talent.\nAnd together, we have achieved something\nno other General Assembly has done in over a generation,\nand that has passed meaningful toward reform.\nNow, I know you all know that fight was hard\nand the debates were fierce,\nbut it's my belief at the end of the day\nwe have a common sense, comprehensive piece of legislation\nthat will keep our state moving in the right direction.\nAnd while tort reform may have been controversial, and some people may have been for it, and others\nmay have been against it.\nOne thing we can all agree on is nobody wanted a special session.\nI also want to thank you for your work on getting the FY 2026 budget pass.\nChairman Hatchett, thank you for your leadership, and I know it's a lot of hard work this year,\nespecially.\nIncluded in that budget there's strategic investments that make our state stronger and further develop our infrastructure\nThrough those investments the state is doing what we can to keep people working in all parts of our state no matter your zip code\nAnd they're doing this while returning taxpayer dollars to where they belong to our people\nI appreciate the strong support in the back of the chamber.\nOther states are raised in taxes on their citizens just to make ends meet.\nThink about California, New York, and Maryland, just to name a few.\nnot here in Georgia.\nHere in the best state for business and opportunity,\nwe budget conservatively.\nAnd that's why we're able to make historic investments\nwithout increasing debt,\nand are able to give Georgians a third tax rebate,\nand cut taxes while we're at it.\nThankfully, much like years passed throughout my second term,\nthe partnership and thoughtful coordination\nbetween the House, the Senate, and my office\nbenefited the people of our state and put George on a path to continue prosperity and\nopportunity. My hope is that we continue that successful streak which will benefit hard\nwork in Georgia's most of all. And as this seventh session during my time in office\ndraws to a close, I want to thank you all for your contributions and your hard work.\nI'm already the girls and I are grateful for your service to our fellow Georgians.\nThank you all, have a great rest of the night, and God bless you.\nGoing or keeping in first family all the\nof Wilka, many time in the People's house,\nthen guarantee it.\nAll right, House, the House will come to order.\nHouse will come to order.\nMembers, please take your seats.\nAre we going to move on to a little bit more business for the people?\nChairman Lohood is recognized for a motion to give the gentleman in the well your attention, please.\nChairman Lohood.\nThank you, Mr. Speaker.\nI move to agree to the Senate sub as amended by the Senate of House Bill 513.\nIs that the motion?\nMr. Clerk, will you read the caption?\nHouse will 513 be tauted back to amend Article 2, Chapter 70 and tauted on 36.\nThe fish go to Georgia and tainted related service delivery so as to revise provisions related to county share of funding for jointly funded county wide services.\nOkay, members, give the member in the will of your attention.\nThe chairman of the hood is recognized to explain the Senate's substitute.\nThank you, Mr. Speaker and members.\nThis is House Bill 513, a sub that the Senate sent back to us, and what they did was just\nto add further clarification to help cities and\ncounties avoid conflict and keep their citizens safe as they negotiate their service delivery strategy.\nMr. Speaker, I ask for favorable consideration and I'll yield the well.\nThe gentleman had no questions as he yielded the well.\nThe gentleman's motion to the House agreed to the Senate substitute to House Bill 513.\nAll those in favorables vote yes.\nAll those opposed, we'll vote no in, Mr. Clerk, were you in lock the machines?\nhave all members voted.\nAll members voted.\nAll members voted if so, Mr. Clerk, will you lock the machine?\nOn the gentleman's motion, the yeas are 163, the nays are two, and the House has agreed to the Senate's substitute of House Bill 513.\nMr. Speaker, I move that this house agreed to the Senate sub to House Bill 645.\nMr. Clerk, will you read the caption?\nHouse Bill 645 to be entitled to amend Article 1 of Chapter 7 of Title 31.\nI believe this goes to George annotated, relating to regulations of hospitals and related institutions.\nMr. Speaker, we sent House Bill 645 to the Senate a few weeks ago, and they amended it to provide even more alignment with today's CDC guidelines.\nAnd I asked his house to agree, and Mr. Speaker, if there's any questions, no questions, I'll yield the well.\nThe lady, Representative Park, Kenan's has a question, the lady's.\nThank you, Mr. Speaker, do you?\nYes, ma'am.\nOut of which part of the CDC does the information and testing related to COVID-19 and\ninfluenza vaccines arise?\nCan you explain your question again?\nAsk it again?\nYes, there's multiple departments within the CDC.\nAnd so out of which department do this COVID-19 testing\nand influence the vaccines arise?\nIt's the department that gives recommendations\nto loan-crum care facilities.\nThank you.\nGentlemen, has no further questions.\nHe's here to the well.\nOn the gentleman's motion to the House agree\nto the Senate of men, but to House Bill 645.\nAll those in favor of vote, yes, all those opposed will vote no, Mr. Clerk, will you unlock the machines?\nHave all members voted.\nWe have all members voted.\nIf so, Mr. Clerk, will you lock the machine on the Germans' motion?\nThe yeas are 166, the nasa zero, and the house has agreed to the Senate amendment to House\nBill 645.\nMr. Speaker, I'll be asking the House for an agreeable on House Bill T33, that was amended in the Senate.\nMr. Clerk, will you read a caption?\nHouse no. 233 to be entitled.\nNAC to amend Article 3, Chapter 3,\nTitle 50, the Fisher go to George Annotated,\nrelating to other state symbols.\nSo to designate Brunswick stew,\nis the official state stew.\nMr. Speaker, I'd like to agree with the Senate's House Bill 233.\nThe gentleman moves that the House agreed to the Senate's substitute to House Bill 233.\nThe gentleman's recognized to explain the Senate's substitute.\nThank you, Mr. Speaker.\nSection 1, this is the original Brunzick's two bill.\nIt is added ingredients to the Brunzick's two.\nIn the extra ingredients include, it makes the 4th Friday, November, National Sugarcane\nsyrup day, or syrup day in Georgia.\nSection 2 is the original Brunswick-Stu bill making official states of Georgia.\nWe have some great Stu downstairs tonight.\nI call it the North Georgia Stu, and they're definitely welcome down there and help us\nout down in Brunswick.\nSection 3 is cornbread, it's designated as official bread of Georgia, and Section 4, who\nwas added also by the Senate.\nWell, basically, it's the four-country concerns\nsuch as China.\nAnd this closes the gap of the third-party seller\nwith the state agency for goods or services,\nincluded but not limited to contract procurement\nor purchase of computers, printers,\nand other types of video conference services\nin connection with the office environment.\nThis was approved unanimously by a partisan effort\nin the Economic Development Committee in the Senate.\nAlso proved by partisan effort in the Senate as a body where I think we had one no vote as it is with the standing bill as it's red now.\nSo again, thank you for your favorite consideration.\nMr. Speaker, I'll be glad to answer any questions about the Brunswick's to House Bill to 33.\nGentlemen, has a couple of questions.\nYes, sir.\nWe'll excuse me.\nLeader Hewgley has recognized for a question.\nGive the leader your attention, police.\nShe has a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nYes, ma'am.\nI understand about these ingredients\nand the stew you got, but this last thing you put on here\nabout these beets for goods and services.\nYes, ma'am.\nHelp me understand how that goes with it.\nThis is basically same title code.\nThis also helps close a loophole\nwhere third party vendor possibly could have gotten a contract\nfrom a foreign adversary.\nWould you agree it might be the same cold\nbut a different subject matters?\nThe way we looked at it in the Senate approached it\nand we approached Let's Council,\nit seemed to all fit together, ma'am.\nJune, I'm gonna take another question.\nRepresentative Sanchez.\nYes, sir.\nI'm gonna ask for a question.\nThank you, Mr. Speaker.\nI would like to invoke rule 111 to ask for the\ngermainness of this amendment.\nI don't know how cornbread and it's brought to us to have to do with foreign adversaries.\nSo have we have a question on the\ngermane this on the last section\nhe discussed and I'm the chair is\ngoing to rule us in this for two\nreasons. Number one, learned\ncouncil, legislative council who\nrely on has advised that it is\ngermane. It's in the right place\nbecause it's in the right code\nsession so chair is ruling that it\nis germane. Gentlemen has new\nfurther questions. Thank you, Mrs.\nMr. Speaker, and I ask for your favorable consideration.\nThank you.\nAll in the gentleman's motion that the House\nagreed to the Senate's substitute to House Bill 233.\nAll those in favor will vote yes, those opposed.\nWe'll vote no.\nAnd Mr. Clerk, will you unlock the machines?\nhave all members voted.\nAll members voted, if so.\nIf so, Mr. Clerk, where you lock the machine, all the gentleman's motion,\nthe yeas are a one-thirty, the nays are a fifty-one of the house as agreed to the Senate's substitute to House Bill 233.\nYeah, just right down there, they're making the motion, they do, but they're all in help and they're all in public health.\nAnd then I'll read them in that order and we'll just get them.\nThat's cool.\nWe have a whole slew of afternoon orders, I'm going to break them up and recognize a couple\nof people to bring an afternoon order now, you have a couple of minutes max for your afternoon\norder. Representative Townsend. Are you ready for an afternoon order? Give the\ngentleman your attention please. This has an afternoon order. Representative\nTownsend's recognized for an afternoon order. Thank you Speaker Burns. I want to\nthank a couple young men here. They traveled from Georgia College. Mr. JT. Marsh\nand Harrison Edwards for doing a great job.\nJT was just elected to office with the National Republicans.\nAnd so we're proud of him, both our college students\nhave helped out and met him through the Ken Vance.\nWe're really proud of those young men\nbelieving in the political process\nand learning about both sides of the issue.\nSo again, JT Harrison, thanks for being at the Capitol\nand you're the future of Georgia.\nThank you very much, Mr. Speaker.\nRepresentative Rees and members of the Gwinnett delegation, Gwinnett delegation, if you'll\ncome down for it.\nThank you Speaker Burns.\nYou know what's the spin?\nGive them a minute to get down.\nYeah, when that delegation, happy bunch, you got one more coming over here, Representative\nDescora, yeah, gentleman's recognized.\nSpeaker Burns members of the House I have two resolutions from our\nGwinnett delegation. The first is Oligar University of India. They have an\nAlumni Association in Atlanta. They're having a picnic tomorrow in Gwinnett\nCounty to wrap up Ramadhan. We have a resolution honoring them. They do\ninterfaith medical missions along with Mercy University and a lot of good\ncultural things around Georgia. So join us in commending Oligar University\nthe alumni of Atlanta.\nAnd then secondly, we have a resolution\nfor the Pain Corley House in Duluth.\nThis is a historic preservation that was done\nby five business women, Judy Burrell, Jane Wilson,\nMargie Ross, Emma Devers, and Annette Summer Hour.\nIt's been a wedding venue for years.\nIt's now under ownership of Jen and Alex Kim.\nAndy Kim works with them and they are doing a great job.\nThere's a florist that is sprung out of that house,\nbut it is a perfect example of business women\ndoing historic preservation and doing great business\nin Georgia.\nSo let's commend the Pain Corley House in Gwinnett County\nas well.\nWoo!\nThank you.\nThank you.\nI yield the well.\nThank you.\nYou got some friends with you, too, don't you?\nRepresentative Derek Jackson and some friends.\nGentlemen, hold on just for a minute.\nLet's get some folks up here and kind of clear out for you.\nMembers, if you're standing in front of the podium there, you need to move.\nY'all want to split up on each side?\nYes.\nRepresentative Jackson.\nThank you, Mr. Speaker.\nColleagues, I know earlier we recognized Dr. King,\nbut we wanted to come up again because we want to give\na moment of silence.\nDr. King was not just one who lived his life long.\nHe was assassinated.\nAnd so we would like to do a moment of silence,\nbecause Dr. King made it profound.\nThank you, Mr. Speaker.\nDr. King made a profound contribution to the Civil Rights Movement from 1955 to 1968,\nadvocating for racial equality, justice, and for the right to vote through non-violent\nprotest.\nHis leadership in events like the Montgomery bus boycott,\nthe March on Washington,\nhelped lead to significant legislative victories,\nsuch as the Civil Rights Act of 1964,\nand the Voting Rights Act of 1965,\nwhich dismantled institutional segregation\nand secure voting rights for all,\nincluding African-Americans.\nToday, his work continues to serve as a foundation\nfor defending the rights he fought so hard to secure\nin the face of current challenges,\nincluding attacks on voting rights and civil liberties.\nAnd so we want to offer up this moment of silence.\nSome of us, myself, and representative,\nI'm gonna say Teddy.\nTeddy Reese, we are members of the same fraternity\nthat Dr. King was, and that's Alpha Phi Alpha\nfraternity incorporated.\nSo just a moment of silence on our late beloved brother.\nThank you, Mr. Speaker.\nThank you, Representative Jackson.\nRepresentative Matthew Eck.\nI don't think he's on the floor that you need to hold up or can you go ahead and\nDo you need to hold up or can you go ahead?\nThe lady's recognized what she thinks is, there he is.\nGive the lady your attention please.\nI didn't mind the answer.\nRepresentative Matthews.\nThank you, Mr. Speaker.\nChairman Bonner and I this evening would like to honor somebody from Fayetteville who was\na constituent of mine but a long time resident of Fayetteville.\nWell, we're honoring Miss Nancy Nell Spier's Tarlano for other purposes as well.\nShe was born May 1937.\nHer parents Herald and Gertrude Spier's Nancy was born and had to wear glasses as a baby.\nSo this helped her shape her studious personality.\nShe graduated from Julian Catholic High School in Dayton, Ohio, and was recognized for her\nscholastic abilities, becoming the second female to graduate with a Bachelor of Science\nDegree from their prestigious chemistry department.\nWhereas, well at the University of Dayton, she was selected by her mentors to be one of\nthe two students in the cutting edge development research\ndepartment with rare earth metals, a groundbreaking process\nof which you can imagine back then how important that was.\nShe met her husband, John, also at Dayton University,\nand he earned his Bachelor of Science in Physics\nbefore attending the Ohio State University.\nNancy was one, she was one of the first stay-at-home moms\nin 1960.\nAnd she helped form chemical abstract services,\nwhich was an applied chemistry degree,\nnomenclature and chemistry.\nWhereas she was raising her daughter's Maryland and Sharon,\nShe contributed to those chemical compounds,\nand later her third daughter is our own Karen Pope,\none of our great lobbyists here at the house.\nSo whereas she later served as a chemistry and math teacher\nat Lake Braddock Secondary School in Berk, Virginia,\nand she was hardly regarded in participating\nin sports activity before retiring with her education.\nSo, where is, now we resolve at the House of Representatives that the members of this\nbody honor Miss Nancy Nell Spires-Turlano for her pioneering achievements in science\nand education, her unwavering dedication to her family and her enduring legacy of excellence\nas well as extended their best wishes to her continued health and happiness.\nThank you, House, we appreciate it.\nThanks, Judge.\nThe ladies, you're the well.\nThis lady's a little quiet, so y'all need to quieten down.\nThe next,\nwe'll represent Betty Stenson's recognized\nfor an afternoon order, please.\nGive the lady your attention.\nThank you, Mr. Speaker.\nLadies and gentlemen of the House,\nI ask that you please rise and with me,\nas I honor their beautiful life and legacy\nof mother Lula Mae Raleigh, she's on the screen.\nMother Lula Mae Raleigh was 94 years young\nwhen God called her home to glory November 23rd, 2024.\nMother Raleigh was a mother to 12 children\nand many, many adopted children\nwith yours truly being one of them.\nShe was the true love of my life,\nand I will forever cherish the many, many moments\nand times that we shared together,\nriding with me up and down House District 150.\nAnd she was a songbird of Butler, Georgia, Taylor County.\nShe would often go to all of the churches\nthroughout Taylor and several surrounding counties.\nAnd Mr. Speaker, she was famous for her song.\nDon't let the devil ride.\nBecause if you let him ride, he'll want to drive.\nAnd another song that everyone loved to hear her sing was\nJust a little prayer is good to say.\nJust a little prayer will help you long your way.\nJust a little prayer will give you peace of mind.\nIt's mighty good to say a prayer sometime.\nMiss Lula Mae Riley, you're forever bein' our hearts\nand our minds and I love you forever.\nJust a little prayer is always good to say.\nThank you, Mr. Speaker and thank you, colleagues,\nfor joining me and honor the beautiful life\nof mother Lula Mae Riley, the songbird of Taylor County.\nThank you.\nGreat lady.\nTwo beautiful ladies, members, if you remain standing.\nThank you, Representative Stetson.\nRepresentative Hagen has recognized for\nmembers of a public servant in her district.\nGive lady your attention, please.\nThank you, Mr. Speaker.\nI wanted to get up this evening and pay tribute\nto the Mayor Pro Tem of the city of Idleia, Mr. John Raymond\nTurner, who passed away this Wednesday.\nMr. Turner was a faithful public servant for four decades\nin Idleia and Tooms County.\nAnd his lost leaves avoid in the community\nthat will not be easily filled.\nI met him when I was the chair of the Tooms County Republican Party,\nand he was the chair of the Tooms County Democrat Party,\nand we spent hours and hours together at the Elections Office\nwatching them open absentee ballots.\nAnd immediately I recognized that this was a man\nof conviction, quiet strength, and kindness\nthat I will not forget.\nHe survived by his sweet wife, Ms. Lilly, their son Keith,\nand their extended family.\nAnd I just ask you off, you please join me\nin a moment of silence and remember it's\nof Mr. Turner.\nThank you, colleagues.\nMr. Speaker.\nA good man.\nExcuse me.\nA good man.\nRepresentative Tranna, you're on the floor.\nHere he is.\nIf y'all remain standing.\nRepresentative Tranna's recognized for remembrance.\nThank you, Mr. Speaker.\nMr. Nicodemus, who lived in Dunwoody for over 40 years,\nwas a very well-respected community leader.\nHe died this week at the age of 91.\nAnd so we can take a minute for a moment of silence.\nThank you, Mr. Speaker.\nThank you, Representative Tran.\nWe're gonna take a break.\nWell, she's not here, so we gotta do, okay.\nSo let's do this.\nHow about Representative Chaz Cannon?\nMake somebody happy.\nRepresentative Cannon is recognized for announcement.\nThank you, Mr. Speaker.\nWe appreciate everyone participating\nin the Sportsman's Caucus Raffle.\nWe raised a record amount of money for the caucus.\nI want to announce the results of the drawing.\nUnfortunately, the Senate won the first prize,\nbut our own Rick Jasper's won the second prize.\nSo thank you to Rick Jasper's.\nThank you, Mr. Speaker.\nI appreciate it.\nI didn't win, buddy.\nRepresentative Hilton recognized for an announcement.\nExcuse me for an afternoon order.\nI apologize, my bad.\nThank you, Mr. Speaker.\nSome people say on Wednesday I jinxed us,\nbut tonight I feel confident\nbecause the Braves have an instrumentable 3-0 lead\nand the top of the fifth that are on their way\nto their first win of the season.\nJoin me in cheering on the Atlanta Braves\nas they bring home the first home win.\nThank you, Miss Speaker.\nIf they don't win tonight, you're at big trouble.\nIs the, yes.\nRepresentative Kendrick here recognize ladies and gentlemen\nmembers of the house. I think you're like this one. We don't end this one on a happy note.\nThank you, Mr. Speaker, and good evening colleagues. If you celebrate a wedding anniversary\ndoing the special session, join me as I congratulate our minority leader on 44 years of being\nmarried to her sweetheart from Columbus, Georgia. She cut a spending anywhere else, but she\nHe is spending her anniversary here with us.\nSo please help me celebrate our minority leader,\nCarolyn Huley, on our 44th wedding anniversary.\nThank you, Mr. Speaker.\nThat Isaiah Huley is a fine, fine man.\nHe made a good choice to, he did, he did.\nI said he did, happy anniversary.\nWe have one more afternoon order, Representative Roberts.\nIf you know what's good for you, better do this one.\nI believe Roberts is recognized from all people.\nThank you, Mr. Speaker.\nI promise to be very brief.\nMy aunt is turning 80, and we are celebrating her birthday\ntomorrow in Rocky Bay, Georgia.\nAnd my mom turned 78 on Wednesday, and I just\nwanted to wish them both a very, very happy birthday.\nThank you.\nMembers, we have a little procedural situation we'll take care of here.\nWe have a number of bills that need to be first read and assigned to committee.\nWhat I'm going to ask you to do is allow us to wave those rules as we would normally\ndo instead of reading each one individually.\nI just remember making a motion, I'm going to allow the clerk to read them all and make one motion and assign them to committee.\nDoes that make sense?\nMembers, we have a total of 13 bills that will be assigned to committee and we will\nsuspend the rules as normal, but we'll just read them individually as a group and then assign them.\nSo Mr. Clerk, will you read a caption to a group of bills and then we will assign them to committee individually, starting with the first one.\nA number of House resolutions by Representative Kelly, a resolution recognizing May 2025 as foster parent appreciation month.\nI'm sorry, unnumbered House Bill by Representative Saints of the 180th to be a title of an act to amend Article 1 of Chapter 1, Title 40 relating to General\nof business regarding identification, regulation of motor vehicles and traffic.\nMotor vehicles.\nUnnumbered house bill by Repsland of Hagen in the 156th, to be entitled to amend Article 6 of Chapter 4.\nTitle 26 of the Fiscal to Georgia, annotated relating to pharmacies.\nDale.\nUnnumbered house bill by Repsland of Franklin in the 160th, to be entitled to amend Chapter 6 of Title 47 of the Fiscal to Georgia.\nGeorgia annotated relating the Georgia Legislative Retirement System.\nRetirement?\nA numbered house bill by resident of Cannon of 58th to be entitled to amend titles 31-33-34-37-45-48-49 of the fiscal to Georgia annotated relating the health insurance, labor and industrial relations.\nPublic and community health.\nA number at House Bill by representative Campbell with 35th being titled back to a mench chapter one entitled 2080 the fish go to George annotated relaying the general provisions relative to the general assembly rules\nA number at House resolution by representative Willis the 55th creating the House study committee on risks associated with hair straightening products\nRegulated industries. Unnumbered house bill by Representative Willis to the 55th to be entitled back to a men title 33 the fish go to George and Tated relating to insurance.\nInsurance. Unnumbered house bill by Representative Willis to the 55th to be entitled back to a men chapter 24 title 33 of the fish go to George and Tated relating to insurance generally.\ninsurance. Unnumbered house bill by\nreps that have lumped into the 83rd to be entitled back to amend Article 1 of\nChapter 2A in Title 31 of the Fitchco to Georgia annotated relating the\nDepartment of Public Health generally. Public and Community Health. Unnumbered\nhouse bill by reps that have lumped into the 83rd to be titled back to\namend titles 3334 and 48 of the Fitchco to Georgia annotated relating to\ninsurance, labor, and industrial relations.\nWays and means.\nUnnumbered house bill by reps that have lumped into the 83rd\nof being titled an act to amend title 31,\nthe fish go to Georgia annotated, related to health.\nHealth.\nMembers, all of those bills have been read and assigned to committee, they'll be up on the website.\nmembers welcome a former member of this house, back to the\nBack to the house, my friend Doug Stoner, who's now serving Georgia on Georgia Department of Transportation Board.\nFrom the house member Doug Stoner.\nLet's see.\nOkay, members, we can take a break in a few minutes.\nQuite a few minutes.\nAll right, now we're going to take up our, let's see, this looks like a,\nIt's like a motion on House Bill 360 okay members we have some folks who\nwant to hear what's going on folks on the wall you everyone needs to be\nquite we have let's say it's a long time to midnight the bewitching hour is\nnot even close and we have a lot of work to get done a lot of hard work to\nbeen put in and we're going to finish it up.\nLeader, illustration is recognized for a motion.\nThank you, Mr. Speaker.\nI move that this House agreed to House Bill 360 as amended in the Senate.\nMr. Clerk, will you read the caption?\nHouse Bill 360 be tile and act to amend Article 2 of Chapter 7 of Title 4080.\nIf I should go to Georgia, I am going to tell you really an income tax imposition rate,\ncomputation, exemptions, and credits.\nConversations need to exit to the any room.\nMembers, I know we have a lot of guests in here, but we will conduct the business of this house.\nThank you Mr. Speaker, the Senate amendment is really limited.\nIt only operates in three specific areas.\nThe first is that for historic tax credits where participants are already in the queue to\nreceive them. Originally the bill passed in the house allowed those folks in line for\n27, 28 and 29 to be available to come to the front of the line, not replace anyone.\nNow it's just limited to 27 and 28, so 2029 is out. The second thing is previously this\napplied only to a limited area, 10 mile radius, which would include the city of Atlanta.\nThat part is also out now, so it would have statewide applicability.\nAnd third, for tax credits utilized for 2027 and 28, first, the certificate of occupancy\nmust be by July 1st of 26, not the end of the year.\nAnd it would be 90% or 90 cents on the dollar for tax credits utilized in 27 and 85 cents\nIt's on the dollar for tax credits utilized, wind in line for the 28.\nMr. Speaker, I'm happy to answer any questions.\nThe gentleman has no questions.\nI yield the vote.\nThe only gentleman's motion to the House agree to the Senate amendment to House Bill 360.\nWhat purpose is represented, Carson Rice?\nMr. Speaker, pursuant to rule 133, ask me the excuse from this vote.\nThe gentleman has that right, and the record will so reflect all those in favor of this amendment to House Bill 360 will vote yes, those opposed will vote no, and Mr. Clerk, where you unlock the machines.\nHave all members voted?\nAll members voted.\nvoted here\nI have all members voted if so, Mr.\nthe clerk where you lock the machine.\nAll the Germans motion, the Yays are 158, the Nays are 5,\nand the House has agreed to the Senate amendment to House Bill 360.\nOkay members, there are a number of you are involved with this next piece of\nbusiness. We have an uncontested house resolutions calendar. We're going to ask\nthe clerk to read a supplemental rules calendar number two that includes all\nof our study committees and what I want to ask you to do. There's no third\nread an adoption of uncontested house resolutions. If there is no objection, we will vote on the\nuncontested house resolution calendar as a whole with a recorded vote. Here in none it is\nawarded. Okay, you may want to listen up. Mr. Clerk, will you read the uncontested resolution\ncalendar? House resolution number 40, creating by Representative Douglas in the 78th, creating\nHouse Study Committee on Reinsurance for Essential Industries, House Resolution Number 72 by\nRepresentative Hawkins of the 27th, Creating the House Study Committee on Cancer, Care, Access,\nHouse Resolution Number 304 by Representative Owl of the 50th, Creating the House Study Committee\non the Costs and Effects of Smoking, House Resolution Number 429 by Representative Martin of the\n49th, Creating the House Study Committee on Funding for Next Generation 911, House Resolution\nNumber 557 by Representative Kendrick of the 95th, creating the House Study Committee on Georgia's Investment Funds.\nHouse Resolution Number 558 by Representative Corbin of the 174th Creating House Study Committee on the State Board of Registration of Use Motor Vehicle Dealers and Use Motor Vehicle Parts Dealers.\nHouse Resolution Number 611 by Representative Dempsey, the 13th, creating the House Study Committee on Abandoned Child Placement Following Hospital Discharge.\nHouse Resolution No. 7-11 by Representative Erwin of the 32nd Creating House Study Committee on Student Attendance and Pre-K through 12 Education.\nHouse Resolution No. 7-53 by Representative Donna Tucci of the 105th Creating the House Study Committee on Improving Access to Internal Medicine in rural areas.\nHouse Resolution No. 847 by Representative Taylor of the 173rd Creating the House Study Committee on Evaluating Funds for Public Health.\nHouse resolution number 885, I represent of Anderson in the 10th.\nCreating the House Study Committee on Election Procedures.\nAnd House resolution number 887 by Representative Blackman of the 146th.\nCreating the House Study Committee on Reducing and Prioritizing Mandates for Public School Administration.\nAll right.\nIs there any objection to the previous question being ordered on the uncontested resolution calendar?\nHere in none, the previous question is ordered.\nIs there any objection to adopting the substitutes offered by the committee on rules on the uncontested resolution calendar?\nHere in none, the rules, calendar, substitute substitutes are adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the adoption of the resolutions, hearing none the report of the committee's agreed\nto?\nShall these resolutions now be adopted, all those in favor of the adoption of the resolutions\non the uncontested resolution calendar will vote yes, all those opposed will vote no\nNo, and Mr. Clerk will you unlock the machines.\nGo on away from nervous.\nHave all members voted?\nHave all members voted if so, Mr. Clerk, will you lock the machines?\nOnly adoption of the resolutions on the uncontested resolution calendar, the yeas are 166, the\nThe Mays are zero, these resolutions haven't received a requisite constitutional majority or therefore adopted.\nMr. Clerk, will you read a caption to Senate?\nSenate Bill 148.\nMr. Clerk, redecaption, Senate Bill 148.\nSenate Bill 148 by Senator Hatch in the 50th, to be entitled an act to amend Article 11 of Chapter 2 of Title 20.\nThe official go to Georgia and Senator relating to public school property and facility so as to provide for an outdoor learning space flag private program.\nThis bill I refer to the Committee on Education and Committee recommends that this bill do pass by Rules Committee Substitute.\nThe representative HONG is recognized to present the bill.\nThank you, Mr. Speaker.\nSB 148 has several components, I'll go pretty quick.\nSection 2 will establish a pilot program for the development and study of outdoor learning spaces on elementary and secondary school property.\nSection one was Representative Chas Cannon's bill, HB 451,\nwhich gave authority to local board of education\nto provide instructions in hunting safety\nfor grade six through 12.\nThat was passed out of the floor.\nSection three is Chairman Hawkins, HB 629,\nwhich was passed out of committee.\nAnd that will, that requires at least one functional automated external defibrillator\non site at K through 12 schools.\nAnd then the last section is HB 127 of Representative Brent Cox's bill,\nwhich was passed out of the House floor.\nAnd that will allow teachers from using their sick leave\nand it extends it from three to five days\nof their sick leave for personal and professional reasons.\nI'll take any questions, Mr. Speaker.\nThere's a couple.\nNo, there's one.\nThen we do have a couple of speakers.\nI'm gonna recognize representing Jasmine Clark.\nMembers, tone it down just a little bit, represent the clerk.\nThank you, Mr. Speaker, just a generality yield.\nI do.\nThank you for the bill.\nI'm just curious, what LC number are you?\nIt's LC-61-0264-S.\nIs this in our folders or was it put on our desk?\nIt should be on your desk.\nI didn't I don't think some of the other rows check and see if that bill is on\nyour desk you have it no it's not in here there's some of you over here on my\nright have the bill some of them having on the front rows that represent\nHolland do you have it back that far this I have it I have LC 33 something in\nour folders, I don't have any, because I was trying to follow along and I wasn't seeing it.\nI think what happened, the committee's subs are being passed out now.\nThe uncontested resolutions kind of slowed things down a little bit.\non getting information passed out, so we'll pause as anyone that needs a copy needs to let us know you need a copy.\nThank you, Mr. Speaker.\nCouple copies.\nThere's some copies down front.\nDo I step down?\nDo I step down?\n.\n.\n.\nI would like to thank you all for your time.\nThank you all for your time.\nThank you all for your time.\nAll right, folks, you can clear that scenario and we'll allow the lady to come back to the\nWell, suspend just for a moment.\nRep thing, huh, let's kind of get a little bit of order in here.\nIn fact, let's get a lot of order in here.\nOkay, members.\nAll right, members, let's take your seats.\nWe continue to have legislations that is very important to some Georgians.\nIs everyone now have a copy?\nOkay, Rimsley Hall, ladies recognized.\nYou have no further questions.\nThank you, Mr. Speaker.\nI'll take one more question.\nYou have no further questions.\nOh, my God.\nUnless I come up with one, I don't have one right now.\nThen I ask for your favorable consideration.\nI yield the well.\nWe do have a couple of speakers.\nI'm gonna allow you three to five minutes.\nThree sounds really good to me.\nWe're going to start with a teacher representing McQueen.\nThis recognized speech of the bill.\nGive the lady your attention, please.\nThank you, Mr. Speaker.\nI rise today in strong support, or this evening,\nin strong support of the House Substitute to Senate Bill 148,\na thoughtful and forward-looking piece of legislation\nthat takes meaningful steps to support student health\nin rich classroom experiences\nand give educators a little more of the flexibility\nand respect they deserve.\nThis substitute does three important things,\nand every one of them moves us closer to a healthier,\nmore supportive and more effective school environment.\nFirst, this bill creates a pilot program\nfor outdoor learning.\nThis is more than a nice idea.\nIt's backed by research.\nOutdoor learning has been shown to improve student focus,\nmental health, physical activity,\nand engagement, especially for younger learners and students who don't thrive in traditional\nsettings. In the wake of the pandemic, we learn just how valuable fresh air and flexible\nenvironments can be. This pilot gives Georgia a chance to explore outdoor learning as\na practical, scalable tool, not just a trend. We're not mandating, we're learning, we're\npiloting a program, evaluating outcomes and giving districts the ability to innovate\nin ways that support both academic achievement and student well-being.\nSecond, this bill makes a smart change to our AED requirements.\nCurrently, Georgia Law requires a licensed physician to be part of an automated external\ndefibrillator AED program.\nThis substitute removes that requirement, aligning us with best practices in other states.\nWhy? Because AEDs are designed to be used by lay persons in emergencies. They're accessible,\nautomated, and intuitive. By removing unnecessary retake, we make it easier for schools,\nathletic programs, and community spaces to expand life-saving access without waiting on paperwork\nor costly oversight. Third, and I want to speak directly to my fellow educators and school leaders\nhere. This bill increases from 3 to 5, the number of accumulated sick leave days that teachers\nand school staff can take each year for personal or professional reasons, what teachers normally\ncall personal days. This is small on paper, but it's big and practice. Huge. Our teachers\nare juggling more than ever, overcrowded classrooms, emotional strains, second jobs, and family\nresponsibilities, giving them two additional days to take care of themselves, their families,\nor their professional growth is not just about time, it's about trust. It says, we see you,\nwe value you, we know you need space to be your best. It says we want to retain great teachers,\nnot just recruit them.\nSo what do we have here in SB 148?\nA pilot that supports students mental and physical health,\na common sense health policy that could save lives,\na practical change that tells teachers their time matters to.\nThese are smart, modest, bipartisan changes\nthat collectively make a meaningful difference.\nI commend the House Education Committee\nfor their work on this substitute,\nand I urge my colleagues to vote yes\nfor student well-being, for educator dignity, and for a future of thoughtful innovation in Georgia schools.\nThank you, and I yield the well.\nLadies, yield the well.\nRep. Ramon, three to five, please.\nLadies, recognize.\nThank you, Mr. Speaker.\nColleagues, I rise in support of Senate Bill 148.\nThere are incredible sections in this bill, but I wanted to focus\nparticularly on section three, which deals with defibrillators,\nwhich I will not have a prop today.\nSo I want to talk about why defibrillators in schools\nare so important, because this is a life-saving measure.\nAnd I want to just go through some statistics with you all\nabout what this can actually do.\nSo it's hard to think about a child having a cardiac emergency.\nBut the reality of the situation\nis that sudden cardiac arrests\nactually strike 7,000 children and teenagers every single year.\nAnd while sudden cardiac death among student athletes\nhas prompted a drive to equip athletic facilities with AEDs,\nresearch has found that sudden cardiac arrest\noccurs more often with school-aged non-athletes.\nSo you would think, oh, it's just athletes,\nbut in reality, and just put on the field\nor with sports or whatever,\nBut the reality is that it's actually the non-athletic kids.\nThe other reason this is so important\nis because about 70% of students\nsurvive sudden cardiac arrests, which\nis more than seven times the overall survival rate\nfor school-aged children.\nAnd that's specifically because a child's survival rate\nis estimated to decrease by 10% every passing minute\nuntil a shock from a defibrillator is applied.\nThe reality in situation is that time is crucial\nduring these emergencies.\nAnd when it comes to a child, sometimes waiting for an ambulance,\nwaiting for the emergency medical personnel to get there,\ntakes way too long.\nNot only that, but we're also talking about the teachers\nthat work in those buildings, right?\nSo in addition to saving students' lives,\nwe're also talking about staff that work there,\nadmin, teachers, you name it.\nThe reality is that out of hospital,\nsudden cardiac arrests is a leading cause\nof death in the United States to the point\nthat it claims the lives of approximately 356,000 people\nper year.\nThat's awful.\nAnd so today, I mean, I know this is a great bill.\nIt's a Christmas tree bill.\nIt's got some requirements in here.\nBut the reality of this situation\nis this actually one of my favorite types of legislation,\nbecause it literally will and can save lives.\nAnd I'm incredibly grateful to the authors\nfor bringing this forward and making sure\nthat we are doing all that we can\nto keep our kids safe and healthy.\nThank you, Mr. Speaker, I yield the one.\nThe lady has yielded the well leader illustration.\nLeader illustration is recognized as big to the bill.\nI just want to commend the legislators that worked on the language that ultimately is reflected here in SB 148 bills that are providing this comprehensive piece of legislation underscoring our commitment to enhance educational experiences and ensure the well-being of our students.\nAnd I want to thank Representative Cox and many members in the chamber who made contributions to this terrific bill.\nMs. Speaker, I'd ask the body's favorable consideration.\nI yield the will.\nThe gentleman's yield is well, is there any objection to the previous question being ordered?\nHere he none the previous question is ordered, is there any objection with drawing to withdrawing\nthe committee's substitute?\nHere he none the committee's substitute is withdrawn, is there any objection to adopting\nin the substitute offered by the committee on rules.\nHearing none, the Rules Committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to, shall.\nThis bill now pass all in favor of the passage of the bill.\nWe'll vote yes.\nAll those opposed will vote no.\nAnd Mr. Clerk, will you unlock the machine?\nAll members voted.\nAll members voted, all members voted.\nAll members voted this so, Mr. Clerk, will you lock the machine?\nOn the past, just sent a bill 148, the yeas, 165, the nasa zero.\nThe bill hasn't received a requisite constitutional majority.\nIs there for past?\nChairman Powell is recognized for a motion.\nThank you, Mr. Speaker, I ask the House agree to the Senate's substitute as amended by the House.\nMr. Clerk, will you read the caption?\nHouse Bill 651 to be entitled, an act to amend Article 2, Chapter 14 and Title 40 that\nto go to Georgia and tentative related speech detection devices, social revised provisions relative to the use of automated traffic enforcement, safety devices, and schools others.\nChairman Powell is recognized to explain this substitute and the House amendment, Chairman Powell.\nThank you, Mr. Speaker, and ladies and gentlemen, you got before you a couple of documents.\nI want you to look at the first document I'd like you to look at is the Senate\nstuff to house to house bill 651. You know back several weeks ago we were\ntrying to share this problem on these school zone cameras that seemed to have\nbeen getting so far out of hand over the last several years. It became quite\nFranklin will be very blunt they became a got you to they had ceased being a\npublic safety to and it was a revenue generator and most people's opinions\nfor those local jurisdictions we sent a good bill over to the Senate and I\nguess I need to tell you a little bit about the process we sent two bills\nover. 651, they did a thorough cleanup of this whole actions. Representative Washburn\nsent over one that basically banned them. There have been a lot of things that transpired\nthe public safety committee in the Senate wouldn't hear the bills. It cost, there was\nsome blood on the floor over there from that. And then these things got amended. Representative\nThe Washburnsville, they basically did a long time extension to do all of them three years,\nwhich doesn't cure the problem.\nThey took House Bill 651, and I'm just going to go through the changes that they made,\nand then I will go through the changes we put back in.\nIn section one, they took out the speed indicators.\nYou may remember that I talked about the flashing signs with those speed indicators like\nradar so that people would know how fast it would drive and that would slow them down.\nThey took that out.\nIn section 2, well the good thing they left in section 2 was a 10 mile variance that we\nnow have that that's treated the same way as radar with a 10 mile variance.\nIn section 3, section 3 they added language that dealt with the violations\nand complaints to the Department of Public Safety and GDOT, especially on intentional violations.\nIn Section 4, this was a hearing process for those governments.\nSection 5 was the appeal process.\nSection 6 was the opt-out by the officials if they were violating, but also they changed\nthe time.\nIf you remember, when this bill left the house, it was two hours in the morning, an hour\nbefore an hour after school took in, an hour before an hour after it let out an afternoon.\nAnd what the Senate did was that they did it from one o'clock, from an hour before until\nan hour after, and the local governments could run these all through the day.\nIf they wanted to opt out of any time, they had to opt out.\nNow, we'll get back to that, the changes that we made in the amendment in just a second.\nOne of the things they did was they dropped the fine, where we had dropped it from the\nextra 25, we dropped it to 125, they had dropped the fine, total fine to $75, with a 5%\ncharge and that would dump suspecting their idea, that was to mail out the notice on these.\nSo that's a $75 fine and a $3.75 cents, 5% surcharge for sending out the notices.\nWhere we had taken out the Department of Revenue Lean, they put the lean back in.\nThose were a lot of the changes that they made and took it out.\nNow what I'm proposing, and I want to thank a few folks, I want to thank the Speaker's\nOffice for mediating this, quite frankly, the Lieutenant Governor was adamant that they\nwanted to be able to run school cameras from before school until afternoon at the behest\nthat the local officials what they thought was needed.\nIf you'll look on the first amendment\nthat starts on line 14,\nwhat we have done is that we have said\nthat they will put those speed indicators back on these signs.\nSo what you'll see, we've gone back to their original language\nwith the flashing signs,\nbut they'll have those radar indicators\nthat says how fast you're running.\nSo that's in there,\nthey agreed to that tentatively. Then we get into the hours. That starts on\nlines 22 to 41. It defines only on the school day. That's not weekends and\nthat's not any other time. And it's kind of the way this is construed. It's kind\nof difficult to read. But what we have done is we have said that the cities will\nhave to opt in. If they don't pass an ordinance by a resolution of the city\nCouncil to opt into the extended day, then it would be from the two hours in the morning\nand the two hours in the afternoon. If they want to carry through those other hours, they've\ngot to stand up and look at their citizens in passing ordinance to say we want to do this\nthroughout the day. If you look on lines 42 through 47, this deals with the four lanes\nthat they had taken out. And that's quite simple that if they're going to run, if it's\ngoing to be allowed to run these devices on a four lane, it has to be where there's a crosswalk.\nNo more of this stuff like up at Tallula Falls where you got a four lane running out in the\nmiddle of nowhere and they just, you know, there's no crosswalk. So on a four lane, there's got to be\na crosswalk before these things would be eligible. You get on line 48 to 53. This is the notice of\nof a citation. They did leave that in. And the citation just says,\nfailure to pay this, fail this, this final contested liability in\ncourt shall result in the inability to renew your motor vehicle\nregistration. You go down to the next line. And since they had\nput it back into the department of revenue for lean. And what we\nhave said in here that they'll send out a second notice to\nnotify the public in bold letters,\nfailure to pay this final contest liability in court\nwithin 30 days,\nshow results in the inability\nto renew your motor vehicle registration.\nLine 67 through 76 is the language we changed\nand their version,\nthey had all the money going to the local police.\nThey could do that for whatever their purposes.\nWe have put the language back in that any of that money needs to go to school safety\nwithin that district and to be used for school safety purposes.\nThose are the changes.\nThis is the amendment.\nI would tell you that it is not the best thing that we were hoping for, but I will tell\nyou that when we leave here an hour or two, if we don't pass something that it remains\nthe same.\nIt's still just a wide open. Go at it. This is a I think with those flashing speed\nindicators I think with the 10 with the 10 mile an hour variance. I think that\nwith all the proper due diligence of notice I think that this is going to be a\nworkable solution and then when we come back if things are still not that way\nthen we'll be able to deal with it again but I continue to tell you that this\nThis is a path to putting this back as a tool for school safety.\nMr. Speaker, I'll be glad to answer any questions, if that wasn't clear enough.\nThat was pretty clear.\nAs mud as they say, no, that was good.\nYou did a nice job of informing the members.\nAnd if they'll get a little bit quiet, there's a couple of questions that the questions they want to ask.\nI'll recognize some members for some questions,\nbut I want you to be able to hear them.\nGentlemen, you need to vote for a question.\nYes, sir.\nRipley Bayes more is recognized for a question\nto your left.\nThank you, Mr. Speaker.\nYes, ma'am.\nDoes the chairman yield?\nYes, ma'am. Thank you.\nOn page 2, line 25.\nAre you on the amendment?\nIs this AM 390495?\nYes, that's the amendment.\nYes, right.\nLine 25.\nShould it actually say of 10 miles per hour over the posted,\nsays, posted the speed limit?\nWhat we have done is that we have synchronized all\nthis language for the ten mile an hour variance. So if it's opposed to 20\nmiles and that means 30 miles. Where it says over posted law should it say over\nthe posted? Ma'am, I didn't write it. That's legislative counsel and they\ncertainly write different than we do. Okay. It's put an error that needs to be\nI don't think it's an air legislative council wrote this language.\nI know it was poignant.\nThank you.\nGentlemen, do you owe for another question?\nI certainly will.\nTo your left, Representative Niel?\nDo you recognize for a question?\nDoes it, gentlemen, do you?\nGentlemen, do you?\nYes, ma'am.\n9-48, 353, 48.\nI know it.\n9-48, 353, so one major issue that my citizens had, one, was the issue of the tags,\nmotor vehicles being the inability to renew your motor vehicle registration.\nThe second issue we were having is the fact that we have so many erroneous tickets being issued that there is actually no recourse, you can't hear me, okay?\nThe issue what I'm having is what 49 to 53 been put back in is the fact that it feels like we're going back to creating and sitting in the same problem we were trying to alleviate because by the time you get the ticket, whether it's erroneous or not,\ntime and hit your vehicle registration.\nWhen you try to call those numbers,\nyou have no recourse in the courts.\nYou're still forced to just pay your ticket\nand a lot of people in my communities,\nthey just have to pay all the tickets,\nwhether they get a recourse or not,\njust because they need their car.\nSo that's what we're trying to fix.\nI think they asked you a question.\nThe gentleman asked that.\nYes, go ahead.\nAs I understand, this was the language.\nIt was in the first bill that has been changed in lines,\nBut it says a failure to pay, this is that first one you're talking about on those lines,\nthat's the notice that you get when there's been a violation.\nThis says failure to pay this fine or contest the liability in court shall result in the\ninability to renew your motor vehicle rent.\nThat is the notice that you have received the citation.\nThen below that is the next notice that if you have not paid the citation and then before\nwhere it started over to the revenue department,\nthat's the next site, that's the next notice,\nbut you'll notice it will don't play.\nRight, well, if it's erroneous,\nyou don't have a right a way to cure it\nbecause you don't get the option\nof having the court process\nbecause of the way it's just simply structured.\nAnd I feel like, is it not,\nhave we bremedied that?\nI feel like we have not bremedied that problem.\nAnd this is what was hammered out with these folks when you look at the other language\nin there, that this is the notices on that.\nI mean, when you had it, and I remember when we brought this bill before, but I brought\nthis bill before, that people who contested once they called the court if there was something\nthat was not right like the hours or the speed, then they contested it most of the times\nthey were dismissed. Okay, thank you.\nOkay, members.\nWe still have some work to do. The other chamber\ndoesn't have any work to do.\nWe're working for the people of Georgia. You can go home if you want to.\nBut I'm going to stay here and ask the members of this chamber to take care of the people's\nbusiness.\nWe were all elected by the people of this state.\nto come to this place and take care of issues that sometimes we disagree on and those that\nwe agree on, but always with what's in those folks' hearts as what's best for Georgians.\nAnd I trust that for each and every member in this body.\nNow, if you're on this floor and you're not a member, you need to tone it down because\nthis house has some work to do.\nAnd hopefully we can agree on the work we have left if we don't, that's what this house\ndoes.\nBut we're going to move forward.\nSo members, give the gentleman into well your attention.\nIf the folks asking questions to understand the proposition before respect they deserve.\nThe other side can adjourn and go about their business, but this house is going to tend\nto the people's business because this is what?\nThe people's house.\nThe city of Bennett is recognized for a question.\nThank you, Mr. Chairman, with a gentleman of yield.\nYes, ma'am.\nI just need clarification.\nThank you for your thorough explanation.\nIt was kind of challenging to read and listen at the same time.\nIsn't that true that this bill started out being about cameras and school zones?\nIs that now removed?\nAnd school safety, yes, ma'am.\nSo the cameras have been removed online 24 where it says using photographically and photographically has been stricken, recorded images.\nWhat other kind of recorded images will there be?\nThey have not been removed.\nThey have not been removed.\nThey have not been removed.\nOkay, thank you, sir.\nYes, ma'am.\nRepresentative Petrie, Chairman Petrie to your left has recognized for a question.\nThank you Mr. Speaker just Mr. Chairman do you yield yes sir Chairman\nI just want to make sure I'm clear obviously this measure is not what we\nwanted and have worked for for several years I appreciate the great work you've\ndone but am I correct in on line 78 so all these funds are only now to be used\nfor school safety purposes within schools is that correct sir that is correct\nthank you Mr. Chairman for all your efforts thank you\nChairman Dickey is recognized for a question.\nDoes Jim and you like Chairman Petry I appreciate your work and I know it's I'm all for compromised\nwith our friends across the way but isn't it true that this bill really doesn't solve\nour problem with these coozone cameras and I think they're in all of my counties, all\nfive of my counties and this is one of the number one issues I hear and this bill\njust does not change things in my opinion but I appreciate your work on it\nI appreciate that Mr. Washington's work on this but I intend to vote against\nthis amendment I just think it does not do the job it needs to be doing and\nthank you though for the way it worked well I thank you and as I said there's a\na lot of things in here that will tell these bad to being a tool instead of the\ngatchy tool that's been used and it's all we've got. Now I might this may be a\nfitting time to say this and I want to tell the people in this house how proud I am\nI want to tell the members of this house how proud I am that you're still sitting in here and I understand that the Senate has already signed a dad.\nI want to thank Legg Council, I want to thank Haley and the governor in the Speaker's Office.\nI want to thank the Speaker, Chris Riley, and all those folks who intermediated a compromise\nwith the Senate.\nA lot of y'all have heard by opinion over the years about the Senate and how I think so much\nthat you told us ahead it right when they had a unicameral body of the legislature.\nBut we're here doing the people's business as the speaker had said.\nThis was a solution.\nIt wasn't a perfect solution by any means.\nBut it moved us forward to take the get you out of public safety only in regard to these\nschools.\nNow, if this house votes in favor of this, which I certainly hope you will, it'll probably\nhave no meaning since the Senate's already took off. But I want you to know how proud\nI am of everyone in here for standing by to pass something even when there's a hollasuit\nacross the hall.\nGeneral Yeofer, one or two more, I certainly will. A gentleman has spent a lot of time\nworking on this proposition, recognizing representative Washburn for question.\nGive the gentleman your attention, please.\nThank you, Mr. Baker, there's a chairman here.\nI certainly will.\nMr. Chairman, is it not true that you have devoted many hours of time and energy along with\nThe speaker staff to try to come up with a bill that would rain in and correct many of\nthe abuses that have occurred with the school's own cameras across the state.\nIs that not true?\nThe gentleman is correct and I thank you for that.\nAnother question, will you yield for another question?\nCertainly will.\nIs it not true that this has been a joint effort along with me with another bill to try to\ndo something to correct these abuses in the state?\ncertainly has and as I had said earlier, I appreciate you because of the position you've\nbeen in in the Macon-Bibb County area where this has probably been one of the most prevalent\nabuses in the world.\nSo I thank you for your motivation to get involved into this.\nThank you, Mr. Chairman.\nThank you.\nGentlemen, you are for another question.\nBe glad to.\nRepresentative Evans to your left.\nRepresentative Stacey Evans, recognize for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield over here?\nYes, ma'am.\nSince the Senate has decided to go home\nand you just mentioned, since we're amending what they did,\nI guess it says.\nAnd I know you've worked on this so hard\nas have so many others, and this is a problem.\nI mean, is there any interest in at least taking\nwhat they did so that we could have final passage\nof something?\nNo ma'am.\nI thought I'd ask.\nI do not think that the substitute that they passed\nhas my good friend from Ford Valley had said that this isn't getting it far enough,\nbut this gets it far enough to correct a lot of the misuses.\nBut this did nothing.\nThis did nothing except make it that much worse.\nUnderstood, I'm just afraid we're going to end up doing nothing too, and I hate it.\nBut thank you for your work.\nThank you, Mr. Speaker.\nI think that everybody knows the posture.\nI can tell you that I'd almost say this\nas the first time in 30 some of my years\nthat I tried to pass a bill\nwhen it wasn't anybody to receive it.\nSo I felt like that's another historic move,\nbut I do wanna thank every member of this house\nfor staying in your seats to vote on this\nso that when the press asks questions, it wasn't us.\nWe found a solution, ladies and gentlemen.\nMr. Speaker, I would appreciate the members\nvote on this last issue and I'll step aside.\nGentlemen, as yielded the well, members before I go through the remainder of this bill,\nhere's going to be our posture.\nWe have privileged, privileged resolutions that import it to the members of this house.\nWe're going to take them up for a few minutes.\nWe're going to figure out exactly what we can do, but I think there's some bills that have come across,\nI guess they'll continue working to stay up and get them over here to us and we'll be able to take final action on.\nSo we're going to ask you to stay patient, stay with us as we move through this bill,\nAnd then we'll finish our night up and we'll adjourn to this thing and go sign a die and\ncome back for next year.\nSo with that, is there any objection to the adoption of the House Amendment?\nHere in the House Amendment is adopted.\nOn the gentleman's motion that the House agreed to the Senate's substitute to House Bill\n6.51 as amended by the House.\nAll those in favor will vote yes.\nThose opposed will vote no.\nAnd Mr. Clerk, will you unlock the machines?\nShould\nFor what purpose is representing Neil Ross?\nThe rule 133.\nThe lady has that right and the record will so reflect.\nall members voted. All members voted this so, Mr. Clerk, were you locked the machine?\nAll in the gentleman's motion, the yeas are 140, the nays are 29 and the house has agreed\nto the Senate's substitute to House Bill 651 as amended by the House.\nSo members, if I can have your attention, let's see if I can convey this information.\nWe have it on the authority of legislative council.\nAnd anything we pass, the remainder of this evening will be in the Senate for action\non day one of the session in 2026.\nMy opinion is, we continue to pass legislation that's imported to Georgia's impactful for\nto Georgia's and let's do our work and I think that's what we should do. I hope you'll\nagree with me. We're going to conclude with some thank yous a little bit but I'll go ahead\nlet you know this. You know, it appears that the Senate has checked all their\npriorities, all of their political priorities and decided to end their\nnight early to set a finish in their work on behalf of the people that we\nrepresent. Of course, they're free to do as they please, but this chamber puts policy\nover politics, and they're still plenty of good, common sense policy left on this house\nas a agenda.\nAnd we're going to take it up, and we're going to continue to work for the people of Georgia\njust a little bit longer.\nI'm going to ask you to stand at ease for about 15 minutes.\nLet us make sure we get a few pieces of information back\nfrom the clerk of the Senate, the Secretary of the Senate.\nAnd then we'll move on with the business of this house\nfor the good of the people of Georgia.\nThank you members.\nThis house will stand at ease until 10 minutes, until 10.\nand\nyou\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nI'm going to give you a quick look at the\nthe\nview\nof the\nview\nof the\nview\nof the\nview\nof the\nview\nof the\nview\nof the\n.\n.\n.\n.\nMr. Clerk, how about ring the bill?\nOkay members I'm going to give you some names we have some further actions\nthat we can complete tonight and the House is able to do just that by our rules\nso I'm going to make sure that Rep. Gaines is in the room if you'll come down\nfront we'll get to it in a minute you're fine where you are representative Todd\nJones representing Mary Margaret Oliver representing McCullum representing\nAnderson and Representative Seaball and Representative New.\nMembers, we have some important privileged resolutions that I want the members to pay attention to.\nMr. Clerk, will you read the caption to a group of privileged resolutions?\nRecognizing an honoring life and legacy of Joe Rubin Green, honoring life and memory of\nJanelle Jaros Green, honoring life and memory of the very Reverend Father George\nShakuri Makluth, honoring the culture architects and sound innovators of\nBankhead, honoring Algebra Blessed, honoring TI for his contribution to Bankhead\nAtlanta Global Culture, honoring the longstanding partnership between the\nprovince of Quebec and the state of Georgia. Recognizing April 5th, 2025, is\nrun Atlanta 5K Day, recognizing the rich kids for their cultural\ncontributions to Bankhead in 404 Day, recognizing commending Kendall Ray Johnson,\nhonoring Nancy Nell Spires, Tarlano, commending Cheryl Peebo, honoring King B on\nthe deck records, recognizing commending Dr. Darlene William Roberts, recognizing commending\ntolls temple and writing.\nThis is 2025, part of the Community Business Award recipient, recognizing commending\nthe 2020 award honors recipient, Marquita Levent Wright Davis, recognizing commending\nCarl Stokes upon his retirement as chairman of the Rayben County Republican Party, recognizing\nCommending the 2025 Board of Governors Award recipient,\nrecognizing and commending the 2025 awards\nhonor recipient, Mimi Wheat,\ncommending Shire Harris South Pauling High School's\n2025 teacher of the year,\nrecognizing commending,\nJericho Richardson,\ncommending Stephanie Ratcliffe,\nShatuga County High School's 2025 Star Teacher,\nrecognizing and commending the 2025 awards\nhonor recipient, Stephanie Dean,\nCommending Jaila Rich, Tuga County High School's\n2025 Star Student, commending Laura Bryant,\nTriann High School's 2025 Star Teacher,\ncommending Jesse Blanketship,\nTriann High School's 2025 Star Student,\nrecognizing commending the 2025\npart of the community Young Heart Award recipient,\nSierra McKnight,\nrecognizing commending the 2025 Awards\non a recipient, Lin Green,\ncommending Sarah Grace Avernathy,\nMaudell High School's 2025 Star Student Commending Room,\nRoy Mitchell, Kusa High School's 2025 Star Teacher,\nrecognizing and commanding the 2025 Awards\non a recipient for Virginia Barrow Harmon,\nCommending Victoria Payne, Kusa High School's\n2025 Star Student Commending, Rachel Jones,\nMaudell High School's 2025 Star Teacher,\nrecognizing and commanding the National Newspaper\nPublishers Association, recognizing commanding Jackie Trim on the grand occasion of his retirement.\nRecognizing and commending Gloria Doverley upon the grand occasion of her retirement.\nRecognizing commanding the Savannah Tribune.\nRecognizing commending Craig Coffey.\nRecognizing and commending the 2025 awards honor recipient Dave Eroberson,\nhonoring the life and memory of Dickson Frederick Parker.\nCommending Kimberly Seale's honors in recognizing April 11th, 2025, his Earth Day, honoring\nthe life, leadership, and legacy of Gail Hirshung Evans that recognized her for extraordinary\ncontributions to journalism, civic life, and mentorship in Georgia, and for other\nthe purposes that completes the reading of the privilege resolutions.\nit's\nAre you doing bill?\nIs there any objection to adopting the privileged resolutions?\nvery none, the resolutions are adopted.\nOkay, members, we're going to take up some final actions.\nAll right, we still have some things to do, so let's pay attention.\nRepresentative Mary Margaret Oliver is recognized for a motion.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate substitute the committee with a floor amendment.\nThis has been on your desk for over an hour or two.\nIt does not have an LC number, but it is marked on your desk 399 slash SCSFA.\nAnd I'm happy very briefly to explain the amendment and the changes that the Senate made.\nLady, we're going to have to clerk and read the caption.\nHouse bill number 399 to be entitled and act to amend Article 1 of Chapter 7, Title 44.\nContinue, Mr. Clerk.\nHouse bill number 399 to be titled and act to amend Article 1 of Chapter 7, Title 44.\nThe fish go to George Anantetti relating to landlords and tenants in general.\nRepresentative Oliver has recognized to explain the Senate's substitute.\nThank you, Mr. Speaker.\nI rise to agree to the Senate's substitute to House Bill 399.\nThis is final action by the House.\nDoes not require any further action by the Senate.\nThe Senate Committee passed 399, which relates, as you remember, to creating an opportunity for some accountability for the hedge funds and out-of-state investors who are purchasing large groups of single-family homes, particularly around the Atlanta and other cities of Georgia.\nThey are purchasing 40% of the homes in my district, 65% in Paul and County and it's changing the economy.\nThis is a bill that's supported by both property owners and tenants and family seeking opportunities to buy a single family home.\nAs to your favourable consideration, the floor amendment was an opportunity to specifically define the way Georgia real estate brokers are entitled\nunder the current law to provide property management services with specific family structures.\nThat was the purpose of the floor amendment that was agreed upon.\nThank you, Mr. Speaker.\nI ask for a favorable consideration for final action of House Bill 399.\nThe lady is here to the well.\nQuestions?\nYou don't have any questions.\nThe lady is here to the well.\nAll the ladies' motion that the House agree to the Senate's substitute to House Bill 399, all those in favor, will vote yes, those opposed, will vote no, and Mr. Clerk, will you unlock the machines?\nhave all members voted, all members voted, if so, Mr. Clerk, will you lock the machines?\nOn the ladies' motion, the yeas are 159, the nays are five, and the House has agreed to the Senate's substitute to House Bill 299.\nFor what purpose is chairman Tarvin rise?\nI'm in Parliament, you're inquiring?\nState you inquires, sir.\nMr. Speaker, is it not true that we're still on video online at this time?\nThank you, Mr. Speaker.\nThank you, but we're online at this time.\nIs that not true, Mr. Speaker?\nThank you, Mr. Chairman, you're exactly right.\nSo members, we're going to pause for a minute.\nAnd we're going to bring some more to this chaos we have.\nthree or four others and we're going to tend to it could take five minutes a good\ntake 55 minutes your choice. You got it.\nAll right, all you members get in your seats, all members take seats.\nAll members, if you have a seat on the floor of the house, you need to sit in it right\nNow, if you don't, you need to go to the any room or out the front door.\nAll members take your seats, please.\nWe have a couple of these final actions that will complete the work of this house on several\nimportant issues.\nIf there are members on the floor that have company, take your company outside.\nMembers take your seats.\nThank you members.\nReptile the gains is recognized for a motion.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate amendment to House Bill 296.\nMr. Clerk, will you read the caption?\non number 296 to be entitled to men, Article 2, chapter 5 of Title 40 for the fish go to Georgia\nand Tate relating the issuance, expiration and renewal of driver's licenses.\nRepresentative Gaines has recognized to explain his motion.\nThank you Mr. Speaker. The underlying bill did not change at all,\nrelated to mobile driver's licenses that this body overwhelmingly approved,\nSenate had a floor amendment that incorporated House Bill 66, which Chairman Ron Stevens\ncarried out over 170 votes in this chamber.\nThis simply adds to the special modified rental vehicles, which the current motor coach,\nTABT code.\nIt doesn't change the amount of paid, but it does allow payment over one year period\nMs. Speaker, and I'll yield the well.\nGentlemen, is he over to the well?\nOn the gentleman's motion that the House agreed to the Senate\namendment to House Bill 296.\nAll those in favor will vote yes, all those opposed.\nWe'll vote no, and Mr. Clerk, will you unlock the machines?\nhave all members voted all members voted if everyone's in their seats we can\nvote and get out of here I think that's the good old common sense way to do it\ngetting your seats unless vote up or down have all members now voted this so\nMr. Clerk, will you lock the machines?\nAll in the gentleman's motion, the yeas are 163, the nays are three.\nAnd the House has agreed to the Senate of the Amendment to House Bill 296.\nChairman Todd Jones is recognized for a motion.\nMr. Speaker, thank you very much, members of the House.\nI move that the House agrees to the Senate's substitute of House Bill 652.\nMr. Clerk, were you ready to capture him?\nHouse No. 652 to be entitled back to a men article 1 of chapter 9 of Title 48 in the physical to George annotated related to motor fuel tax.\nSo to provide for an exception for collection of motor fuel tax relative to electricity delivered by certain electric vehicle charging stations.\nThe gentleman will explain his motion, this is how important the work we have left to do is that this is clear demonstration of it.\nThe gentleman is recognized to explain his motion.\nThank you, Mr. Speaker.\nThis house voted overwhelmingly to support House Bill 652.\nThe Senate made a small change in concert with the Commission of Agriculture.\nAnd then also with our transportation, Chairman Rick Jasper's and myself,\nwe effectively move the effective date of the EV charging, taxation and inspection from January 1, 2026 to January 1, 2027.\nThat is simply the substitute that the Senate added on.\nI would appreciate your favorable consideration to the agree.\nThank you so much, I yield the well.\nThe gentleman has no questions, and he's yielded the well.\nAll in the gentleman's motion that the House agreed\nto the Senate's substitute to House Bill 652.\nAll those in favor will vote yes.\nAll those opposed will vote no.\nAnd Mr. Clerk, will you unlock the machines?\nHave all members voted?\nAll members voted as so, Mr. Clerk, were you like the machines?\nAll in the gentleman's motion, the A's are 163, the A's are 0.\nAnd the House has agreed to the Senate's substitute to House Bill 652.\nRepresenting McCullum is recognized for a motion.\nThank you, Mr. Speaker.\nMove that the House agreed to the Senate substitute to HB 422.\nMr. Clerk, will you read the caption?\nHouse no 422 to be entitled back to a man chapter 18 in Title 45 of the fiscal day.\nGeorgia annotated relating employees, insurance and benefit plans.\nSo it's required that the state employees health benefit insurance plan include high deductible health plans.\nRepresentative Cullum is recognized to explain the Senate substitute.\nThis bill was passed out of the house.\nThis is a high deductible plan that actually gives the state authority to take out pre-tax\nbenefits for high deductible.\nThe only changes the Department of SHBP has to change online 22 before January the 28th\nto implement the two plans.\nAnd then also the other change was on,\nor before January of 2026,\nthe Department asked to change that date\nbefore they implement the plan.\nI'd appreciate it if you'd vote yes on this bill.\nI stand for any questions, Mr. Speaker.\nGentlemen, has no questions.\nAre you the well?\nGentlemen's here to the well on the Germans' motion\nthat the House agreed to the Senate's substitute\nto House Bill 422.\nAll those in favor of the vote yes,\nAll those opposed?\nOpposed?\nWe'll vote no in Mr. Clerk, where you unlock the machines.\nHave all members voted?\nAll members voted?\nIf so, Mr. Clerk, where you lock the machines?\nAll of the gentleman's motion, the yeas are a 163, the nays or zero in the house has\nAs agreed to the Senate's substitute to House Bill 422, Representative Anderson is recognized\nfor a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that we agree to the Senate amendment to the House amendment to the Senate\nsubstitute of House Bill 155.\nYou go have to explain that one.\nI can't.\nThe clerk will read the caption.\nHouse bill number 155 to be entitled to an act to amend Article 7 of chapter 36 and\ntitle 36 of the fiscal code of Georgia annotated relating the procedure for resolving annexation\ndisputes.\nRepresentative Anderson has recognized to explain the Senate amendment.\nThank you Mr. Speaker.\nWe passed House Bill.\nWe have passed an amended version of the Senate Substitute of House Bill 155 out of this chamber on Wednesday.\nThe Senate then added an amendment today to the bill.\nThis is, this would, the revised version of this bill will allow the six North Fulton Cities by local resolution to opt out of the Fulton County Development Authority jurisdiction to offer property tax incentives and supported by the six cities and neutral to the county.\nAnd Mr. Speaker, I ask for your favourable consideration.\nI yield well.\nMr. gentlemen, Scott has a question from Rebsley Sam Park,\nif he would yield.\nRebsley Park has a question.\nThank you, Mr. Speaker.\nChairman Anderson, is it not true that this Senate amendment\nincludes language that was explicitly taken out by the House\nbefore with respect to Fulton County?\nIt's my understanding that this includes the language\nthat came from the House that was originally in Senate Bill\n151.\nThank you.\nI yield the well.\nGentlemen, has no further questions.\nOn the gentleman's motion that the House agreed to the Senate, a member to the House,\na member to the Senate substitute, to House Bill 155, that was a mouthful.\nAll those in favourable vote, yes, those opposed will vote no, and Mr. Clerk, will you unlock\nthe machines?\nAll members voted for what purpose is represented Roberts rise Parliamentary inquiry stage inquiry isn't it true that HP 155 is a cleanup bill\nI've been trying to bring for three years and we're finally getting through this time.\nThank you.\nWell, I'm glad we stayed open to get it done.\nThank you.\nThank you.\nHave all members voted.\nIt is so, Mr. Clerk, where you lot the machines.\nAll the generals most of the A's are 117 and days are 49 and the House has agreed to\nthe Senate amendment, to the House amendment, to the Senate substitute of House Bill 155.\nTwo more guys, representative C-Buy is recognized for a motion.\nThank you, Mr. Speaker.\nI make a motion to agree to the Senate's substitute to House Bill 352.\nMr. Clerk, will you read the caption?\nHouse Bill number 352 to be entitled to amend code section 494-159.4.\nDr. Fitzgoda, George Annotated, we're relating the coverage for continuous glucose monitors.\nThe representative C-Ball is recognized to explain the Senate's substitute.\nThank you, Mr. Speaker.\nThis bill requires Medicaid.\nThis bill requires Medicaid to provide continuous glucose monitoring for\nnew mothers diagnosed with gestational diabetes, it was unanimously passed.\nAnd the Senate added back the requirement listed online, 21 requiring at least one daily administration of insulin.\nThat is the amendment and I ask for your favorable consideration.\nThe gentleman has no questions.\nThank you, I yield the well.\nyielded the will on the gentleman's motion that the House agreed to the Senate\nsubstitute to House Bill 352.\nAll those in favor will vote yes.\nThose opposed will vote no. And Mr. Clerk, will you unlock the machines?\nhave all members voted all members voted this so Mr. Clerk will you lock the\nmachines all the gentleman's motion the yeas are 163 the nays are two and the\nThe House has agreed to the Senate substitute to House Bill 352.\nHere's the one you've been looking for.\nRepresentative New has recognized for a motion.\nGive the lady your attention, please.\nI move.\nI move that the House agrees to the Senate's substitution for HP 516.\nMr. Clerk, will you read the caption?\nHouse Bill number 516 to be entitled back to amendment code section 50, 141 of the physical to George annotated relating to meetings open to the public limitation on action that contest agency action recording notice of time in place.\nRepresentative new is recognized to explain the Senate's substitute the overview of House Bill 516 it passed the House.\nIt allows county and regional library boards and community service boards to conduct meetings through teleconferencing.\nThe new provisions made where meetings must be held at physical locations with at least 50% of the board members physically present.\nMust provide one more methods for public viewing of the meeting and public commentary allowed without being physically present.\nIn addition to the bill, was the Attorney General can approve private activity bonds to fund construction or renovation of state charter school buildings.\nThat is the bill I ask for your favorable consideration.\nIf there's no questions, I yield the well.\nThe committee has a couple of questions.\nAll right.\nWe'll let you yield.\nI yield.\nRepresentative Evans to your left has recognized for a question.\nThank you, Mr. Speaker, does the lady yield?\nI will.\nI have a question about section one,\nthe part about the Attorney General approving bonds.\nCould you tell me who handles this process right now\nand why are we having the Attorney General do it now?\nOkay, so it doesn't take it away from anyone else.\nIt's an elected authority or a board of charter of schools\nand then we're just giving another option\nfor charter schools to be able to be built or renovated.\nDo you know the reason why we picked the attorney general?\nBecause this was within his scope to do.\nWe yield for one more?\nI will.\nWas the process for having these bonds approved before?\nIs there some sort of backlog?\nIs there some sort of reason why we needed to add another person?\nI do believe there is a backlog.\nThat's what I was, as I understand it, yes.\nCould you tell me from where that comes from?\nFrom the Cherokee County Schools system.\nThank you.\nThank you.\nI appreciate the question.\nThe lady you are for a couple more questions.\nOne more question, sir.\nChairman Irwin, do your ride is recognized for a question.\nGreat.\nThank you, Mr. Speaker.\nDoes lady you?\nI will.\nIs it not true this process allows charter schools\nto access funding for their buildings while ensuring\npublic input in compliance with legal requirements?\nYes, sir, it sure does.\nThank you for this bill.\nThank you for the question.\nI will yield the well, sir.\nThank you for your considerable consideration.\nLadies, you are the well.\nAll in the ladies' motion that the House agree\nto the Senate's substitute, the House bill 516,\nAll those in favor, we'll vote yes.\nAll those opposed, we'll vote no.\nMr. Clerk, will you unlock the machines?\nI've all members voted.\nhave all members voted if so, Mr. Clerk, will you lock the machines?\nAll in the ladies' motion, the yeas are 94, the nays for 71 in the house has agreed to the Senate's substitute to House Bill 516.\nThank you members for what purpose is a chairman of appropriations rise now we\npassed your bill today. Mr. Speaker I need to make an inquiry a what\nMissed my role in an honor of our former colleague and friend\nMr. Speaking I'm\nAnd that's an honor to share in Beasley team\nI do miss my friend Cheryl Beasley Teg she was a good one\nShe was a good one.\nMr. Leader, we're not quite ready for that final motion, but I'm going to recognize\nleader for a motion.\nMiss Speaker, I move that all bills and resolutions on the general calendar be recommitted\nto the committees from Wednesday came.\nno objection is so ordered this house is made up of gentlemen and ladies\nAnd there are a lot of people help us get our work done. So let's take just a minute and\nGive them a thank you before we are adjourned for the day\nThe speaker's office staff our interns is this year Hanna Cretan Wally Stover Bethany Jones. Thank you for your service\nA lady that's come back to this house, you're up a year, the session staff that sits\nout front and makes things go smoothly. Kim Aiken, thank you, Kim.\nReviewing a lot of bills, a lot of hard work this year's externs, Katherine Brennan,\nChris Mendelssohn, Morgan,\nFold, and Alex Rowe.\nThank you for your work.\nApplause\nFolks, and I'm very close to and\nreally appreciate their work as our security detail.\nAlex Craley, the Josh Zanufka,\nHeath Buffington, and my buddy, Damascus Chambers.\nAnd one gentleman we got to celebrate with last week, the office staff in Speaker's Office.\nChief of Staff, Terry England.\nGet well brother, we love you.\nYou're doing great.\ninterim chief of staff, Chris Raleigh.\nThe indespecable Keith Williams and Haley Gallow.\nThe lady that enables me to do what I do, Kayla Green, communications at the house.\nthe ladies and a gentleman that makes the house,\nSpeaker's office work, Sheena Wright,\nAshley Newton, and Jacob Shield.\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nof what you two do every day and we appreciate y'all.\nDoorkyper extraordinaire and Postal Clerk.\nCory Murphy and all the Doorkypers.\nAll the Doorkypers.\nHouse photographers.\nColleen Massey and Ben Massey.\nAnd some folks who make the pages experience here, unforgettable, our house page ladies.\nAnd all of our pages that have been here this year doing the hard work to make this place\nrun.\nThank you all.\nLet's give the page ladies, the page desk.\nAnother indispensable person, Angela Holland, come out of that\nany room, Angela Holland.\nYou're the best, and thanks for what you're doing, providing all of your\nall of your freshness and taking care of us.\nHouse offices, House budget and research office,\nDirector Christine Murdoch, and entire House budget\nand research office.\nHouse media services director and House messenger.\nThe one and only, Bentley, Betsy Theroux,\nand the entire.\nAnd all of our media people, our house ladies, lady of assistance, thank you for what\nyou do, not just during the session, but year round.\nTemporary session staff, hey, it takes a lot of good folks to make this thing work.\ninterns. Everyone has been a part of this session. All right, let's get to the\nmoney folks. Fiscal office and staff, fiscal officer, Amy Bottles. Thank you, Amy.\nIIT department and staff director, Clint Smith, deputy director, David\nUnderwood. Thank you guys for what y'all do. Office of legislative counsel, y'all\nbeen working them over time lately. Let's let him cancel Betsy Howardton,\nthe Legislative and Congressional Reapportment Office staff, Director Gina Wright, thank you Gina.\nHuman Resources Office, Director Donald Cronin, Alyssa Martin, our house intern director.\nThank you to another special group of folks, the GBI, the Georgia State Patrol, our Capitol Police.\nI told him to be careful what he says.\nWell let me tell you this, I thought we would make it to 1201 because tomorrow\nApril the 5th is this lovely ladies birthday. Happy birthday.\nThank you, Dale.\nLet's hear it, my friend. Turned extra on.\nHappy Birthday to you happy birthday to you happy birthday to you happy\nThanks to every member of this house, you're a special people doing special work.\nThank you.\nLook forward to seeing you over the interim and certainly back in January.\nDon't we have some pages that our pages come down,\nbeen with us all day.\nLet's celebrate our pages.\nOh wow what a great group.\nWe've got a great group, thank you young people.\nThe majority leader of this house is recognized for a motion.\nMr. Speaker, I move that this house stand adjourned.\nSunny die.\nAll in the motion, bring up this house, thank you, John.\nSunny die.\nAh.\nI don't know what you're talking about, I don't know what you're talking about, I don't know what you're talking about.\n",
  "updated_at": "2026-02-11T21:09:10.800432+00:00"
}