{
  "video_id": "__j1N4edCNA",
  "url": "https://youtu.be/__j1N4edCNA?t=733",
  "title": "Georgia House - Day 9 (2026-01-25)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-01-25",
  "duration_minutes": 58,
  "summary": "Here is a summary of the Georgia House session on 2026-01-25:\n\n**Overview**\nThe Georgia House debated and passed a substitute version of House Bill 30, which defines anti-Semitism for the purpose of addressing hate crimes and discrimination targeting Jewish people in the state. This bill has been a priority for the legislature for several years.\n\n**Key Actions**\n- **HB 30**: Defines anti-Semitism for the purpose of addressing hate crimes and discrimination targeting Jewish people in Georgia.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Debate over the bill's definition of anti-Semitism and concerns that it could infringe on free speech and criticism of the Israeli government.\n- Representatives Carson, Silcox, Evans, and Holley engaged in a back-and-forth discussion on the bill's specifics and intent.\n- Supporters argued the bill is necessary to address a rise in anti-Semitic incidents across the state.\n\n**Votes**\nThe House voted to agree to the Senate substitute on HB 30. The final vote outcome was not provided in the transcript.\n\n**Attendance**\nThe speaker noted that all members should take their seats, indicating a quorum was present.\n\n**Adjournment**\nThe transcript does not include information on when the session adjourned or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nOkay, members of the House, members will take this seat, Mr. Clerk, if you'll ring the bell.\nMembers will please take your seats.\nWe stood in the recess, my favorite part of the school day was recess.\nWhat about yours, my naughty little Beverly?\nI know it was Representative Williams's favorite part of the day recess.\nNo doubt about that.\nAll members, please take your seats.\nWe have a little unfinished business.\nWe will attend to now and then we will have afternoon orders after we conclude this\nthis time, I will recognize Chairman Carson's for a motion.\nMr. Speaker, I move we agreed to the Senate substitute on House Bill 30.\nMr. Clerk, will you read the caption to HB House Bill 30?\nHouse Bill 30 by the Reps.\nof Carson, the 46th administration of the 104th\npanel to the 51st and others, to be entitled\nback to amend chapter 1 and title 50.\nThe fish go to Georgia, annotated really\nin the general provisions relative to state government,\nso as a revive for the definition of anti-semitism.\nChairman Carson, you're recognized\nto explain the Senate's substitute to House Bill 30.\nWell folks, sometimes I didn't know if we were going to get here or not.\nBut what this bill does is very, very similar to what we pass in 2022.\nWe pass this bill in 2023.\nAnd since that time, we've passed in this bill.\nWe've seen an unbelievably increase in anti-Semitic acts.\nWe've seen more leaflets in Dunwoody, Brookhaven, really\nall over our state.\nWe've seen neo-Nazi demonstrations in my county and Cobb\nCounty, also in Macon.\nAnd folks, I hope you will just stand with me one more time\nand say this activity has got to stop.\nWhat this bill does is provide a definition\nfor anti-semitism such that when analyzing the intent\nbehind illegal discriminatory acts that target Jewish people,\nwhether it involves a hate crime or their illegal discrimination,\nand there is an allegation that the action was\nmotivated by anti-Jewish sentiment,\nthe relevant authorities consider, as revutable evidence,\nthe world's most accepted definition of anti-semitism.\nMany of you know I've been working on this bill for three years and I can\nthank so many different people, Mr. Speaker, the American Jewish Committee, Atlanta\nIsrael Coalition, Israel, American Council, Hillells of Georgia, Hadassah, many of you\nare in the gallery. And thank you so much for being here, folks. It's time to get\nthis done. I think the speaker said it very well, right, just before session,\nwhereas the speaker said certain things rise above politics. It is time to get\nthis done. It is time to stand up to the anti-Semitic acts. And again, people can\nsay whatever they want. You can see that in the bill that first amendment rights\nof free speech are already are still protected. Folks, I want you to join with\nme and show the nation who we are as Georgians and stand up to this anti-Semitic behavior\nonce and for all.\nAnd on behalf of my friends in the Jewish community, I ask you to support House Bill 30 substitute\nfrom the Senate.\nAnd for what I hope is the last time on the anti-Semitism bill, I will soon yield a\nwell.\nMr. Speaker, we've debated this thoroughly, but I am happy to take a question or two on\nthis measure.\nThank you for your work and you do have a question or two.\nYes, sir.\nI'll take a question.\nI, to your, just straight in front of you, Chair Lady Silcox is recognized for a question.\nDoes the gentleman yield?\nYes, to my friend.\nIsn't it true that especially in light of the attacks, the horrific attacks of October\n7, 2023, that Jewish groups all across the state of Georgia have been crying out for\nthis legislation like never before?\nThat is absolutely true to my friend and my co-sponsor for this bill.\nAnd many of those people that are crying out for it for that are here in the gallery\nand in elsewhere and especially in your area of the state.\nSo thank you for your support.\nThank you for this legislation.\nGentlemen, you'll for another question.\nYes, sir.\nI will.\nTo your left, Representative Becky Evans is recognized for a question.\nRepresentative Evans.\nMr. General Maniel.\nYes, ma'am.\nTo my friend.\nYes.\nThank you.\nIsn't it true that this definition of anti-Semitism that we are passing today is not codified\ninto our law, but it refers to the IRA definition that's listed separately.\nSo the definition is not codified in the law, is that true?\nWell, it's referred to, just like we do with other definitions with regard to federal\nhealthcare programs, with regard to the National Insurance Commissioners with regard to the\nAmerican Forestry Association, there's many times that we in our state code refer to\na definition, but we don't subjugate our legislative authority.\nWe tie that definition to a certain date, just like we've done here.\nThank you.\nDoes the gentleman further you?\nYes, to my friend.\nThank you.\nSo, isn't it also true that this definition includes examples?\nI think believe there are 15, 11 examples of anti-semitism.\nYes, ma'am.\nThose 11 examples are part of the IRA definition.\nThat's true.\nIsn't it true that seven of the 11 examples refer to criticisms of Israel?\nIf the general, if the general lady so states, but again, this protects free speech and it\nis not, no one can be arrested and no one has ever been arrested.\nThat's one thing that has been stated in this capital.\nNo one has ever been arrested for speaking ill of Israel.\nIt's when that is combined with violence or discrimination.\nYes, thank you. I just have one final for this young one. You're for one more to my friend. Yes, I would\nIsn't it true that many of us are concerned that the charge of anti-Semitism\nWill be leveled against folks who speak out against the human rights abuses of Israel especially students and professors on college campuses\nTo my friend. I think we've talked about this numerous times\nI hear what you're saying, but again, if you read the legislation, the First Amendment\nis protected in regard to saying whatever you want, no matter how vile against the state\nof Israel or its government or its people, it's when that is combined with acts of violence\nor discrimination.\nThank you.\nGentlemen, are you here for another question?\nYes, sir, Mr. Speaker.\nSee, the gentleman from the 116th Representative Holley is recognized for a question to your left.\nThank you, Mr. Speaker.\nDoes the gentleman you?\nTo my friend, yes.\nSo, I was curious.\nIf the IRA, do you agree that the IRA definition holds that the criticism of the state of Israel is also a...\nIt is also not allowed.\nYou know, we're getting so many questions about this.\nI would refer many of you to lines 29 through 34,\nwhich specifically state that nothing in this bill\nshould be construed to in French upon the First Amendment,\nincluding our freedom of speech.\nDo you further you?\nYes sir.\nBut if the Ira definition itself, as you, this is your bill, and you place this in here,\nand if the Ira definition itself literally says that it literally conflates the criticism\nof the political government of Israel with anti-Semitism, now I can grant it, you may\nnot necessarily want to say that on the microphone, but literally because you put this definition\nany here, and this bill does support that, then this would not also literally stop average\ncitizens from exercising their first minute right to speak about the 30,000 Palestinian\ncivilians that are literally been killed in a genocide committed by the state of Israel.\nWould this not stop them from being able to speak about that?\nThis would not stop.\nAnd what I would further say to opponents, my friends that are opponents on this bill.\nPlease identify one person who has been arrested because of a similar statute in another state\nor by the federal government's executive orders.\nPlease name me.\nOne person has been arrested or charged with anti-Semitism just based on speech.\nIt does not exist.\nIt was said on the Senate floor. There's 33 states that have passed this is actually about\n37 states that have it either by executive order or and ten of those 37 by statute\nPeople are not arrested for their speech. They're arrested for their discrimination and violence\nMy last question if you further you to my friend\nIs it not true that we are silencing voters and interfaith groups who have made countless phone calls to the\nrepresentatives, demanding a ceasefire, and an end to the $3.8 billion of funding to\nIsrael's occupation force, when those funds would be better spent to support Georgia\nteachers, Georgia hospitals, and the unhoused here in our state.\nThat is not true.\nWhat I will tell you is true is that Georgia stands with our friends in the Jewish community.\nI wish it did for Palestinians as well.\nThank you.\nJim, when you have a question,\nyou can state that during this time of question and answer.\nThat's what I'll expect you to do from now on.\nRepresentative Panage is recognized for a question.\nDoes the gentleman yield?\nTo my friend, I absolutely do.\nThank you.\nIs it not true that since October 7th,\nthere has been a 360% increase in crimes\nor anti-Semitic incidents against the Jewish community.\nI believe that is correct, yes.\nIs it not, is the gentleman further yielded?\nYes, ma'am.\nIs it not true that the Jewish population in the United States\nonly makes up about 2% of the population,\nbut it has about 60% of all hate crimes targeting them.\nI, that is true, I believe it's a little bit over 60%.\nDoes it genuinely yield for one final question?\nYes.\nIsn't it true?\nIs it not true that this bill does not get applied\nuntil there's an unlawful act or a crime,\nan unlawful discrimination or a crime?\nThat is absolutely correct.\nGeneral lady knows what she speaks as usual.\nWill a gentleman yield for one more question, maybe?\nYes, sir, Mr. Speaker, I will.\nOne question.\nRight down in front of you, Majority Leader,\nifstration is recognized for a question.\nThank you, Mr. Speakers, the gentleman you'll\nto my leader, yes sir.\nMr. Chairman, isn't it true that has to the question\nthat was asked previously concern about the definition here\nthat this definition was actually incorporated\ninto a federal executive order as is referenced\nhere in this bill?\nThat is absolutely correct.\nIt was referenced to the executive order data December 11th, 2019.\nMembers, you can see that in the Senate's substitute lines 21 through 22, yes sir.\nIs it not also true that as to the gentleman's question about\nfree speech that that's clearly addressed in the lines that you specifically read from?\nThere's nothing to infring upon free exercise of speech as enshrined in our constitution\nin this bill. That is absolutely correct and just as a reminder that's lines 29 through 34.\nI don't want to read it for the members but that's correct.\nMr. Chairman, isn't it true just as this House led in the passage of\nHeycrumbs and passed the anti-Semitism measure last legislative session by\npassing this today. We are clearly standing in support with the Jewish community\nand acknowledging that an attack on a group because of their religion is an\nattack on law and order and should be defined in Georgia law.\nAbsolutely, and I would go a bit further. Once that group is attacked, it is\nis effectively an attack on all Georgians.\nThank you, Mr. Chairman.\nThank you.\nMr. Speaker, I'm sure there are other people\nthat wish to speak to this,\nbut on behalf of the Jewish community\nand all my friends in their community,\nyou were not forgotten, you were protected.\nMr. Speaker, I yield the well.\nJim, I yield the well, and I'm sure\nThat you would like this to be thoroughly vetted, and as you know, it has already been\nthoroughly vetted, so we will not be having other speakers on the bill.\nThat's our rules when it comes to agrees and disagrees.\nAt this time, we'll let everyone show exactly how they feel about this bill, about HB30.\nAll those in favor of House Bill, the Substitute, the House Bill 30, the Senate Substitute,\nThe old vote yes, those opposed will vote no and the clerk will unlock the machines.\nhave do we do allow a parliamentary inquiry for what purpose does\nthe representing park can arise a parliamentary inquiry\nstate your inquiry is it not true that the more house chapter of the\nAmerican association of university professors\nopposes this measure I'm sure if the lady says states I'm not for me\nwith that and further inquiry state your inquiry is it not true that\nat Morehouse College stands on a proud tradition\nof combating racism and anti-symmetism.\nI'm sure the lady has on information.\nMorehouse has not transmitted that information to me,\nbut I appreciate the lady's question.\nFor what purpose is representative Martin Ries?\nPortal mentoring inquiry.\nState your inquiry.\nMr. Speaker, isn't it true that in addition\nto the lines on 29 and 30 that we adhere in this state\nto the Constitution of the United States\nand an article six paragraph to known as the supremacy clause.\nAny law we pass in this state cannot stand superior\nto the US Constitution, which guarantees free speech\nto every American on any issue as long as the Constitution\nstand isn't that true.\nthe supremacy clause is higher than state law in Georgia.\nMr. Chairman, I know you chair higher education.\nI'm sure you've read that constitution several times.\nSo I'm sure your opinion is correct.\nThank you for stating that.\nGentlemen, from the 168th House District,\nRepresentative L. Williams is recognized.\nIt's not recognized, I'm sorry.\nDo you have, for what purpose do you rise?\nBut I wanted to make sure I recognize who you,\nwhom you are too, as well.\nWhat do you rise to speak of parliamentary inquiry stated inquiry? Is it not true that I have\nhorror violence on either side in the current conflict? Violence against innocence in children?\nIs that not so? I'm sure the gentleman has lived by that his life. Is that not further\ntrue that I'm supporting this measure because having seen both sides of the\nquestion, having also gone to jail with many of my Jewish friends doing the civil\nrights movement, I've known most of them to protect human rights throughout this\ncountry and I continue to stand with them is that not true? I can attest that is\ntrue. You have been a hero. Thank you for your service to your community and\nyour beliefs. For what purpose does Ripley-Rumon rise? A few parliamentary\ninquiries if I may. We'll see that goes. Let's hear the first one. Thank you\nMr. Speaker. My first parliamentary inquiry refers to the fact that is it not\ntrue that this bill is different than the one that we passed last year that\nthat address some of the free speech concerns\nthat were presented to the spotty last year.\nRepeat that.\nIs it not true that this version of the bill\nthat we are voting on today is different\nthan the one that we voted on last year?\nThat's true.\nThis is a substitute and the gentleman explained it.\nAnd is it further or not true that in this substitute,\nit does not actually include the definition in the bill itself\ninstead it references a website.\nI don't think that's exactly correct, but I'm sure that's the way the lady has read\nthe bill and that's her understanding of the bill.\nFinal primary inquiry is, is it not true that part of the reason that we made the amendments\nthat we did is to address the concerns about the examples on that website as it pertains\nto the definition?\nI'm sure there was an effort because as we all know we passed this bill last year and\nThere was a big effort to perfect it.\nSome people thought, and certainly everyone in this house\nhad an opportunity to vote.\nThey're conscious on this bill,\nas they're going to have that opportunity in just a moment.\nBecause I've just about had my last\nproler meeting inquiry.\nLet's see, we'll take a couple more.\nWhat purpose is representing the COX rise?\nMr. Speaker, a parliamentary inquiry?\nStature inquiry.\nIs it not true that after session last year\nthat my dear friend Rabbi Silverman in Cobb County\nand their synagogue was hit with anti-Semitic threats\nand aggression over in Cobb County.\nI did see that in the news, yes I did.\nI think that is true as the gentleman states.\nFather inquiry.\nState you inquiry.\nIs it also not true that today in the state of Georgia,\nwe can make a stand for the people of Israel\nthe Jewish community by letting them know that they're safe here, they can go to school,\nthat they can live their lives and celebrate all that life gives them without the fear\nof being harmed by what we're trying to pass this day.\nI thank the gentleman believes everything he just said and we're going to give everyone\nthat opportunity right now.\nWe'll take two more polar-minute inquiries then we're going to be finished\nFor what purposes represent Campbell rise\nThank you, mr. Chairman polar mentoring query, please stage inquiry\nIsn't not true\nThat as a body we wish for prevailing peace\nAround the globe and in the Middle East I\nI'm sure the lady believes, as she speaks.\nAnd is it not true that in the spirit of unity, the reading of the actual definition of\nanti-Semitism would have been a respected action that this body could have taken and could\nstill take?\nI think the action before this body is on your desk, if you put your vote on the board\nWe'll see what you believe and what the member Mr. Chairman\nOne last probably inquiry\nRepresenting Montahan. Thank you. Have something out here\nLike you miss speaker parliamentary inquiry. State you inquiry\nMr. Speaker, isn't it true that the late\nDr. Martin Luther King Jr. once spoke on anti-Semitism and he said that\nanti-Semitism, the hatred of the Jewish people has been and remains to be a\nbrought on the soul of mankind. I'm sure the gentleman believes that quote and\nstands by that quote and lives by that quote.\nhave all members now cast your ballots. I think you have all members voted. If so, Mr.\nClerk, will you lock the machines?\nOh, the gentleman's motion. The yeas are 129. The nays are five. The House of\nagreed to the Senate's substitute to House Bill 30.\nCongratulations.\nI'm going to take this opportunity to remind every one of us that we have an obligation\nput a vote on the board when we call a question. Mr. Clerk, will you read the House rule that addresses\nany issue? Rule 133 when the question is put every member within the chamber shall vote unless\nthe member is immediately and particularly interested therein or unless the member is excused by the House.\nIt's my sincere hope that the members of this house will be thoroughly informed on every\nmatter that comes before us and then be willing to take a stand and vote their conscious\nand their district on whatever issue it becomes for this house.\nIt's in the rules.\nWe need to live by the rules of this house.\nThank you, Mr. Clerk.\nWe'll move on to afternoon orders at this time, and we'll recognize, let's see, we also\nhave a time. We're in pretty good shape. We could stay here to dark, but let's\ndon't do that. So I'm going to hold y'all the three minutes. We're about halfway\nto sunset. We're going to hold you to three minutes and it will be in force.\nRepresentative Bennett and Representative Cummins have pretty neat afternoon\norder. The ladies are recognized. Thank you, Mr. Speaker.\nWe have some folks leaving upstairs I think it may be appropriate to give that give them a chance to exit the gallery.\nmembers will come back to order give your attention to the ladies that are about to enter\nthe well for the second time. Representative Bennett and Representative Cummings are recognized for an\nafternoon order. Good afternoon. I'm representative baseball has been out sick this week. So we are here to\ntalk about an important event that she is having on Monday January the 29th district 69 high school\ncheck-in day. In recent years the Georgia State Legislature has been moving toward improving\naccess to mental health resources in our state says representative Baysmore.\nLegislations such as the Mental Health Parity Act establishes committees to study the mental\nhealth crisis faced by our state and to give recommendations to the legislature on how\nwe can address this crisis.\nSo as we continue to address mental health issues, we cannot ignore one of the most valuable\nsegments of our citizens which is our youth.\nSo often, our youth do not receive the assistance or support that they need to navigate the emotional\ntraumas that they face each and every day.\nSo on Monday, January the 29th, Representative Baysmore will have attending at the Capitol\nstudents from Bannocker High School and Fayette County High School, and they will advance\nand learn about legislation, how legislation is passed, and NAMI will be here also along\nwith Dr. Sherry Blake, an expert in clinical psychology to address our youth.\nThank you, Mr. Speaker, and please stop by to say hi to the kids.\nThank you.\nWe feel the way out.\nWe hope Representative baseball continues to improve.\nLarry Jackson.\nRepresentative Jackson is recognized for and afternoon order.\nRepresentative.\nThank you, Mr. Speaker.\nColleagues.\nThank you, Mr. Speaker.\nColleagues, I rise for a moment of silence.\nI rise for a moment of silence because we're not trying to politicize an event that has hurt so many\nGeorge's, so many George's. This maternal health crisis is real. 169 women in Georgia die.\n776 infants died to die in Georgia.\nYes maternal health deals with women, yes deals with children, yes this has nothing to do\nwith Republican Democrat. We were all affected directly and indirectly. And the women in Georgia\nare asking us to do something because 169 of them died. Yes, we are passionate, Mr. Speaker.\nbecause this impacts all families in Georgia.\nYes, we're passionate about women's health, women's rights.\nYes, because our citizens are asking us\nin urban suburban and rural Georgia to do something\nbecause they lost a loved one.\nAnd since the beginning of this session,\nWe rise and gave a moment of silence because someone died.\nIt's not a political issue.\nIt's not a white, black issue.\nSomeone died 169 women, 776 infants.\nSo let us remember in a moment of silence\nsilence of those families that are impacted in this crisis of maternal health in Georgia.\nThank you, Mr. Speaker.\nwell.\nThank you Mr. Speaker, so this is my 10th year as a member of the House, it's the honor\nof my life to serve in this body.\nI think my most meaningful moment is each day when the chaplain of the day asks us to stand\ntogether in unity.\nAnd when we stand all is one together at this house, it doesn't matter your political party,\nit doesn't matter what issue you maybe were debating arguing about ahead of time.\nWe all stand together and we all act together as one.\nNow you know the issue of maternal mortality is something that obviously we all care deeply\nabout. We've heard members of both political parties talk about it. I served on a study\ncommittee several years ago working on it. Chair Lady Cooper has worked tirelessly on\nthis issue. But we also recognize that we're a house family. And when there's a death\nin our families, when there's a tragedy that occurs in our legislative districts, we\ncome to here, we come here to this well with a speaker's permission and we tell the membership\nabout it, and maybe it's involving someone you've never met, you've never heard of.\nBut you stand in respect, the entire house stands out of a show of respect to communicate\nthe fact that we are a house family, and that we are willing to stand together to express\ncondolences when it's deserved.\nAnd as circumstance, where that, that unity that we all, I think, can take pride in because\nis it transcends your political party,\nit has nothing to do with what part of the state you're from\nor standing together?\nIf that process is eroded and that process is changed,\nI think that really hurts this institution.\nI think if you've got something that you want to debate,\nyou feel passionately about your issue, great.\nYou all certainly know I feel that way about certain issues,\nbut I will never abuse the rules of the house\nand your trust with you standing in unison\nas we call for a moment of silence, request,\nthat you express condolences,\nbecause I'm trying to get a score politically to do it.\nAnd so I would ask respectfully for there to be decorum.\nI want to thank the minority leader,\nbecause he and I have spoken about this before,\nand he is a gentleman and I think understands\nand appreciates the importance of this within the house.\nBut my perspective is that we can all recognize\nwhat we have and what we do here as special.\nthat should be protected, that should be respected,\nand we can govern ourselves accordingly,\nso that this isn't an issue for this house,\nand you can tell I'm emotional over this,\nso this isn't an issue for this house at all going forward.\nThank you.\nI yield the well.\nThat is out of order.\nHere's my comment.\nSome many issues that we debate,\nWhen we address in this house rise above politics, we have to put our emotions to the side.\nThis is an issue we can all all work together on to continue to make a difference, make\nmore of a difference than we've made up until this point.\nThis still work to be done.\nWe all know that.\nI want to ask the members if you will.\nthis attention, this political attention to solving health solve the problem with a conversation\nthat addresses issues and not partisan back and forth.\nThis House has a reputation on leading on issues as it has done, not just for a reputation.\nIt is factual.\nWe've led on many issues, especially health care for Georgians over the years.\nWe will continue to do that if we do what we've been doing in the last few minutes.\nWe won't make progress.\nAnd Georgians will suffer.\nGeorgians will suffer.\nSo let's do the right thing.\nLet's put the politics in the back seat and let's work on the issue that's important to\nall Georgians, all Georgians.\nSeveral of those issues we would be addressing this session.\nSo I ask you to do just that and hope you'll work with me.\nIf you have a question on my statement on the two previous statements,\nmy office is open, come see me.\nBut we're going to refrain from this back and forth.\nWe're going to talk about policy and talk about solutions based on the facts.\nThank you.\nWhip first shit is recognized for an afternoon order.\nThank you, Mr. Speaker.\nLadies and gentlemen, today on Suicide Prevention Day,\nI wanna talk about a topic that is both sensitive\nand crucial.\nEvery life is valuable and each one of us\nplay a role in creating a supportive community.\nGroups like the American Society for Suicide Prevention\nand its Georgia chapter do great work on this front.\nThat's why I'm honored to be carrying House Resolution 831 to commend their efforts.\nBut we must always remember that every one of us plays a part there.\nMany people silently struggle with their mental health, and it's essential for us to foster\nan environment where they feel safe to speak up.\nLet's break the stigma surrounding mental health and the mental health issues and encourage\nopen conversation.\nListen to those around you with empathy, as sometimes a simple conversation can make\na world of difference.\nReach out to friends, family, and even acquaintances.\nLet them know you care.\nSmall gestures can have a significant impact on someone's well-being.\nEducate yourself about the warning signs of distress and mental health struggles, awareness\nis powerful, a powerful tool in preventing suicide.\nIf you notice someone exhibiting signs of distress, don't hesitate to offer your support\nand guide them through professional health.\nRemember, it's okay not to have all the answers.\nEncourage individuals to seek help from mental health professionals who are trained to provide\nsupport that's needed.\nTogether, we can create a community where mental health is prioritized.\nNo one feels alone in their struggles.\nAnd in my conclusion here, let's be compassionate,\nunderstanding and proactive in addressing mental health\nchallenges.\nBy working together and including groups\nlike the American Foundation for Suicide Prevention\nwho was here earlier today, we can make significant impacts\npreventing suicide and promoting the well-being\nof all Jordan's around us.\nThank you, Mr. Speaker.\nI yield well.\nWell said, very important issue.\nChairman LeHood is recognized for and after-norded, Mr. Chairman, give him just a minute.\nChairman LeHood.\nThank you, Mr. Speaker.\nAnd members, as chairman of the House Government Affairs Committee, I'd like to draw your attention\nto this flyer that was on your desk this morning. It may still be there and this is to announce\nthe Georgia Municipal Association's annual legislative networking and capital connections\nbreakfast at the Atlanta Hilton. And there will be a shuttle Monday morning to get you there\nfrom the capital. It starts at I believe 630. Breakfast will be at 7 and we'd like to see all of you\nthere. Our speaker will be one of the featured speakers along with the governor and lieutenant\ngovernor and there will be lots of mayor city councilman from all over the state. So hope\nyou'll join us. Thank you.\nThanks Mr. Chairman. That's a great event. Good folks from all over Georgia. No doubt.\nChairman Mac Jackson recognized for an afternoon order.\nAnd friends.\nhim a speaker. Ladies and gentlemen, on Wednesday, January 17th, around 6.15 p.m., we had a\ntwo-a-long fire at the landmark. Now I want to thank each and every one of you for calling\nyour concern, your kindness toward us that were affected at the landmark. This is the\nthe landmark caucus standing here.\nChevin Stevens is out.\nHe's a member of the landmark caucus too.\nBut the speaker even called and told me,\nif I needed a place to stay, I could come over to his place\nand stay.\nDidn't call me.\nDidn't call me.\nDidn't call me.\nDidn't call me.\nDidn't call me.\nBut several people called.\nSeveral you were concerned.\nIt was a serious fire.\nand Representative McDonald has helped me\nto get the fire department,\nthey'll be down here on Thursday of next week\nso that we can thank them for job well done.\nI've learned that in this house, you build relationships.\nAnd I've got a friend that says,\nin life, everything moves at the speed of relationships.\nAnd Representative Al William called me yesterday,\nI was at a funeral,\nand he had found me another apartment to live in.\nBut building relationships is so important.\nRepresentative Chairman Green has always been there\nto give me advice.\nMy good friend, Representative Hewglick,\nhas always been there while we've been at the landmark.\nBut we are a caucus, and Chairman Green wants to say something.\nYou know, it was a devastating thing to come back\nfrom a dinner and see your apartments on fire\nand that you couldn't do anything about it.\nand thank you to the Atlanta Fire Department.\nAnd thank you to Penny Hausten,\nwho let me stay at her apartment in another bedroom.\nAnd thank you, I had a shirt the next day and a tie,\nand so I will get those back to the individual.\nBut thank you all so much.\nY'all are a loving and caring family.\nGod bless everyone of you, and thank you.\nWe're glad you guys are all okay representing Heagley. I do have a pull out\ncow. I found it just known you were part of the caucus. We would have been\nfine. We have that completes our afternoon orders. We have one announcement.\nChairman Carpenter has an announcement. Thank you, Mr. Bigger. We have a\nhave a subcommittee of the house regulated industries on lottery and gaming, meeting\nin 406 upon adjournment.\nOn adjournment, that won't be long.\nLet me give you guys a couple of reports.\nOne of them is that Scotty Long is home from the hospital, doing a little better, getting\nbetter.\nGet well soon Scotty, we miss you man, we really do.\nThe other important announcement today is that our very own Carrie Vic has a birthday\nday, Carrie. She has a crown. We may go get it before we adjourn. Get a photo here.\nGood photo up with you, Carrie. That concludes our work of the day, the majority\nleader. Now listen closely to this motion. Majority leaders recognize for a\nmotion. Thank you Mr. Speaker. I move that this House stand adjourned until 9 a.m.\non Friday, January 26th, 2024. On the motion of the majority leader that this\nHouse stands adjourned until 9 a.m. Friday, January the 26th, 2024. All those in\nIn favor, we'll respond by saying aye.\nAll those opposed will say no.\nNo.\nIt's getting closer to the eyes.\nClearly haven't, though.\nWe are adjourned.\nThank you for your attention and patience.\n",
  "updated_at": "2026-02-12T16:23:54.401145+00:00"
}