{
  "video_id": "_CLFrrkqg84",
  "url": "https://youtu.be/_CLFrrkqg84",
  "title": "Georgia House - Day 3 (2026-01-13)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": "2026-01-13",
  "duration_minutes": 45,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on unity, with the Speaker and a guest chaplain emphasizing the importance of bipartisanship and working together despite divisions. There were no significant legislative actions detected.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading) \nNone detected.\n\n## Notable Moments\n- The Speaker spoke about the need for unity and bipartisanship, saying \"if I can do that, we can be unified.\"\n- The guest chaplain, Pastor Christian Norman, gave a sermon on the importance of unity, citing Psalm 133 and the words of Abraham Lincoln and Jesus Christ.\n\n## Votes\nNone detected.\n\n## Attendance\nThe Speaker noted that some members had not voted during the initial roll call and would need to check in with the clerk's office. A quorum appeared to be present.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session would be held.",
  "transcript": "All members of the House will please report to the floor and take your seats.\nAll members, please report to the floor and take your seats, Mr. Clark, ring the bell.\nAll members will report to the floor of the house.\nAll right, we're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nhave all members voted, have all members voted, have all members voted, have all\nmembers now voted. Alright we're gonna have to go on. You can come\nsee the clerk's office sometime there in the morning and check in with your\nattendants. Clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed. Well good morning.\nI talked to Monday a little bit about unity and I talked about working\ntogether and bipartisanship. And I want y'all to know, I really meant that. And I've proved\ntoday how much I mean it.\nIt hurts, it hurts, but I'm doing it for the greater good.\nDon't get, don't get a representative Reeve stirred up, he'll do a cheer back there.\nSo if I can do that, we can be unified.\nWe will begin our day with scripture reading and prayer by the chaplain, after which we\nwill pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 22nd House District\nRepresentative Wes Cantrell, Representative Cantrell.\nThank you, Mr. Speaker.\nColleagues, good morning to you.\nOur chaplain today is Pastor Christian Norman.\nPastor Norman is the associate pastor at the first Baptist Church of Woodstock, where I've\nhad the privilege of serving as the young adult pastor for the past 14 years.\nHe's one of my bosses, but when you see how big he is in a minute, you'll understand\nthat I'll pretty much do anything he tells me to do regardless of whether he's my boss\nor not.\nPastor Norman was an outstanding football player in high school and received a full-ride scholarship\nto play football at Michigan State University.\nHe excelled while there, culminating in being\nthe team captain, his senior season, honorable mention,\nall conference and projected to be picked,\nand NFL draft somewhere between rounds four and six.\nSince moving to Georgia, Pastor Norman's favorite football\nmemory has become Michigan State's triple over time victory\nover UGA in 2012, which apparently had an outstanding\ngame in.\nThe trajectory, though, of Pastor Norman's life,\nwas changed forever when he suffered a serious injury\nin the Capital One Bowl playing against Alabama\nat the end of his sophomore season.\nAnd God used that injury to draw him into a relationship\nwith himself in a commitment to live for Christ\nfor the rest of his life, and really the opportunity\nto live up to the name that his parents gave him, Christian.\nAfter graduating from Michigan State University, Pastor Norman decided to forego the NFL draft\nand instead attended the Moody Theological Seminary where he earned a Master's in Divinity\nDegree.\nHe was Associate Pastor to Church in Detroit, Michigan for several years before moving\nto Woodstock last year to serve as our Associate Pastor.\nHe's married to Kayla, who was an outstanding athlete herself, having played basketball\nUniversity of Florida. They have two children, Sophia and Christian J. Norman, the second who was\nborn just a few days before Christmas a month or so ago and they affectionately refer to him as\nDuce. So join with me and let's welcome Pastor Christian Norman.\nGood morning, but thank you all so much for giving me this incredible opportunity to\nshare with you the truth of God's Word and what He's put on my heart. I don't think\nit's lost on anyone that we do live in incredibly divisive times. Just a few\na day's ago in my office, I was talking with a woman. She's a grandmother, probably in\nher late 60s, early 70s. And right now, her sons aren't talking to her because she\nvotes differently, so much so that they may not let her see her grandkids. So what's\nhappening today is not just out in the ether. What's happening today is touching people\nwhere it hits the hardest and that's at home.\nSo when my friend and colleague Wes came to me and said,\nhey, would you consider speaking at the state capital,\nI wondered, what would be a timely message?\nWhat would be a relevant word for the times in which we live?\nAnd he immediately said, without hesitation, unity.\nSo when he said that to me, I started to ask the Lord,\nwell, what's a good place in God's word\nThat talks about unity clearly.\nAnd immediately the Lord brought to my mind\nPsalm chapter 133 is one of my favorite songs,\nand it says this,\nbehold how good and pleasant it is\nwhen brothers dwell in unity.\nIt is like the precious oil on the head,\nrunning down on the beard, on the beard of Aaron,\nrunning down on the collar of his roads.\nIt is like the dew of Herman,\nwhich falls on the mountains of Zion.\nfor there the Lord has commanded the blessing,\nnamely, life, forevermore.\nThis is a short song.\nAnd like I said before, it's one of my favorite songs,\nbecause as a pastor, you have to deal with a lot of conflict.\nAnd when there's individuals or people,\ngroups in the church that art arts,\nI often think to myself how good and pleasant it would be\nif we could dwell in unity.\nBut why does the psalmist say this?\nWhen he talks about how good it is to dole and unity,\nhe draws a comparison between unity and the oil\nthat runs down the beard of Aaron\nwho would be the third highest ranking official\nin the nation of Israel.\nAnd he also compares it to the do that descends from\nMount Hermann onto the regions of Zion or Jerusalem.\nSo when he describes the goodness and the pleasantness\nof dwelling in unity.\nWhat he has in mind is the kind of unity\nthat sets a person apart.\nWhen oil was placed on the head of Aaron,\nit was to consecrate him\nas a high-ranking official in the nation of Israel.\nNot only that, but he also has in mind\nthe kind of unity that produces flourishing wine.\nBecause when do descend it from on herment,\nit would provide the moisture that was necessary\nfor plant life in a hot and dry region of the world.\nSo in brothers,\ndare I say when a nation dwells in unity,\nit can set that nation apart.\nDare I say that when a nation dwells in unity,\nit produces flourishing for the people that live in it.\nBut this morning can I also suggest that the converse is true,\nthat it's not good and it's not pleasant\nwhen brothers dwell in disunity,\nthat it's not like the oil that runs down the beard of Aaron,\nthat it's not like the do that descends from on Herman.\nTherefore, it does not lead to setting a nation apart,\nand it does not lead to the people flourishing in it.\nThere was a great leader that existed a while ago,\nI'm sure all of you are familiar with him,\nhis name is Abraham Lincoln.\nWhen he accepted his ascended nomination\nin the state of Illinois, he gave a speech on June 16th, 1858,\nand he said that a house divided cannot stand.\nWell, that great leader borrowed that line from the greatest\nleader that the world has ever seen,\nand he lived over 2,000 years ago.\nAnd he's the greatest leader that the world has ever seen,\nnot because he bludgeoned his opponents,\nnot because he overthrew political systems\nby sheer force.\nHe's the greatest leader that the world has ever seen\nbecause he came to serve.\nAnd in his service,\nhe lived a life that we couldn't live.\nHe died to death that we should have died,\nbut he was raised from the grave three days later\nand is now exalted to the right hand of the throne of God.\nAnd by faith in his name, by faith in his name,\ndo we have restoration?\nIt's about faith in His name\nthat we have peace with God and watch this.\nWe also have peace with one another.\nIf you hear me say anything on this Wednesday morning,\nhear me say this, Jesus came so that people could be made\nright with God and so that people could be made\nright with one another.\nNow, what can you do with that?\nWell, there's two ways that I love for you guys\nto apply this both personally and publicly.\nPersonally, this is my encouragement to you.\nIf you have conflict in your life,\nmaybe it's with a spouse,\nmaybe your marriage has been on the rocks,\nmaybe it's with your children,\nmaybe it's with a colleague that sits in this very room.\nI don't know, wherever there's conflict in your life,\nwould you consider surrendering to the authority of Jesus?\nBecause when you surrender to the authority of Jesus, you all of a sudden have a reason and motivation to get right with other people.\nI know that when I surrendered in my life to Christ almost ten years ago,\nwhen I experienced God's forgiveness, when I experienced God's peace,\nI was motivated to make phone calls to people that I knew I had offended.\nI was motivated to tell somebody, I'm sorry, that our relationship was broken.\nI was motivated to be reconciled, because if I had been reconciled, who in my to withhold\nreconciliation from somebody else?\nSo if that's you, I'd ask you to consider surrendering your life to Jesus.\nAnd then publicly, I recognize that personal piety can't translate into public policy,\nbut I would say this, learn from the life of Christ.\nAs you all represent your constituents, be an advocate for peace, I'd encourage you\npractically to assume the best in one another.\nI'd encourage you all practically to recognize that we have more in common than we have\nnot in common. I'd encourage you all to recognize the need to be reasonable and gentle in your\napproach, even with those with whom you disagree. And I would encourage you all to recognize\nthat with leadership comes the burden of setting an example. In Psalm 133, I don't think it's\na mistake that the author described unity in such a way that it always descended.\nIt was like the oil that poured down the head of Aaron.\nIt was like the dude that came down from Mount Hermann.\nSo maybe just maybe the author is suggesting that if unity is going to be possible, it\nmust start from the top.\nAmen.\nLet's pray.\nFather, we thank You for Your grace.\nAnd, Lord, God, we thank You that we do have the possibility of unity.\nWhen You sent Your Son, You sent the Prince of Peace.\nLord, You made a way not only for people to be reconciled to You, but also so that people could be reconciled to one another.\nSo God, I pray that by your grace,\nand through the power of your spirit,\nthe people in this room will live, reconcile lives.\nPersonally, you've got to pray for peace and relationships.\nYou've got to pray for things like patience, kindness,\nforgiveness, and long suffering.\nBut God, I do also pray for this nation.\nAnd Lord, God, I do pray for this great state of Georgia.\nYou've got to pray that the people in this state\nAnd my fellow countrymen at large would be unified.\nThis is a troubling time.\nIt times it feels like that's not even possible,\nbut there is nothing too hard for you.\nSo God be gracious to us.\nForgive us where we fall short.\nAnd by all means help us to walk in unity.\nIn Jesus' name we pray, amen.\nA pledge allegiance to the flag of the United States of America and to the Republic which\nit stands, a nation under God, indivisible, in liberty and justice for all.\nOur keepers will unlock the doors.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and\nAudits.\nMr. Speaker, your committee on information audits has read the journal of the previous legislative\nday and found it to be correct.\nChairman Hogan, the chair of the committee on information and audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nthe chair here's none in the journal is confirmed.\nI think I have one more thing.\nI thought you probably did.\nAs you remember, Speaker Murphy, he was quite an individual.\nHe had his light moments, but then he enjoyed himself quite a bit.\nAnd back in 1999, and I might get in trouble for this, but I've cleared some of this with\nyour staff, but I'm not going to identify him.\nErica Murphy recognized Representative Ann Mueller and she stood up to speak and her\nmicrophone was turned off and she said Mr. Speaker would you turn me on?\nAnd he said 30 years ago I would have tried.\nOh man.\nI couldn't have made it through the day without hearing that one, Mr. Chairman.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 59th, whose filing be establishes the order of business in the first part\nof the period, unanimous consensus, introduction of bills and resolutions, first reading\nand reference of house bills and resolutions, second reading of bills and resolutions, morning\norders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day the chair hears none and the resolution is adopted.\nFirst reading of bills and resolutions the clerk will read.\nHouse Bill 23, Barbara Ripson of Oliver the 82nd, Drenner the 85th, men in the 94th, Evans\nthe 83rd Lopez of the 86, Bill the title back to amend chapter 36, a title 36, the Fisher\ngo to Georgia and it's a really an annexation of territory.\nAll the fires.\nHouse bill 24 by reps and eval over.\nAll over the 82nd Evans in the 83rd Lopez in the 86th.\nThe bill be titled back to a men article seven\nof chapter 36 and title 36.\nThe fish go to Georgia and it's ended relating to procedure\nfor resolving annexation disputes.\nGovernmental affairs.\nHouse bill 32 by reps and build them 112.\nNext to the 69th Hawkins of the 27th green in the 150 first\nTaylor of the 173rd and others.\nThe bill be titled back to men.\nPart nine of article six of chapter two,\na total 20 of the fish go to Georgia and it's ended\nrelating the grants for educational programs.\nEducation.\nHospital 33 by Representative Belton, 112th,\nHitchens of the 161st, Hawkins of the 27th,\nBurkle of the 155th, housed into the 170th,\nand others of Bill B. Tonanak,\nto amend Article 2, Chapter 7 of Title 48,\nthe physical of Georgia, annotated,\nrelating the imposition rate computation exemptions\nfrom state income tax.\nWays and means.\nHospital 34 by Representative Belton of the 112th,\nHawkins of the 27th, corporate of the 174th,\nIn addition, Sonno 61st Blackman 146th and others,\nthere'll be Todd on Act to amend chapter 43\nand Toddle 43, the official go to Georgia annotated,\nrelating to speech, language path policies.\nRegulated industries.\nHouse Bill 62, by represent of Gulliver the 19th,\nApollo the 32nd, mob town of 17th Williams,\nthe 145th and Gamble of the 15th,\nthere'll be Todd on Act to amend chapter 2\nand Toddle 21 of the official go to Georgia annotated,\nrelating to primaries and elections generally.\nSpecial Committee on Election Integrity.\nHouse Bill 63 by Representative Blackman on the 146th Corp.\nof the 174th Smython, 33rd, Ridley of the 6th Williams\ninto the 115th and others.\nIt will be titled an act to amend chapter 5c.\nIt's title 48 of the Fisherhood of Georgia Annotated related\nto alternative ad valorem tax on motor vehicles.\nWays and Maines.\nHouse Bill 64 by Representative Gaines, 117th and Weed Hour,\n119th, it will be titled an act to amend chapter 2.\nIt's title 21 of the Fisherhood of Georgia Annotated related\nand primaries and elections generally.\nSpecial Committee on Election Integrity.\nHouse Bill 65 by Rips of Gaines on on 17th,\nwe now are the 119th prior of the 118th,\nit will be titled act to men chapter 2 of Title 21\nof the fiscal to Georgia and Tater relating primaries\nand elections generally.\nSpecial Committee on Election Integrity.\nHouse Bill 66 by Rips of Oliver,\nthe 82nd, the 3rd, the 85th,\nin the 94th Evans at the 83rd, Lopez at the 86th.\nThey'll be tunneled act to Menarchal 3, chapter 82\nat Title 36, the fish put a Georgia annotated relating\nto revenue bonds.\nGod, mental affairs.\nHouse Bill 67, my reps, and at Martin of the 49th England\nof the 160th, 9th of the 130th,\nSmirrey 135th, three is the 34th and others.\nThey'll be tunneled act to Menarchal 1,\nchapter 16 in Title 50.\nThe fish put a Georgia annotated relating\nthe general provisions relative to public property.\nHigher education.\nHouse Bill 68 by Rebs of Clark with a hundred forty-seven upon other seventy-second.\nBuilding a hundred and twelve black men with a hundred forty-six,\nfiring a hundred thirty-fifth and others.\nBill Nittada, an act of man-code section of forty-three, fourteen, fifteen.\nThe fiscal to Georgia annotated relating the certain military certifications.\nRegulated industries.\nThat completes First Readers.\nSecond reading of bills and resolutions the clerk will read House bill 43 by\nrepresentative Cantrell is 22nd Jones the 47th next of the 69th Martin of the 49th\nMontana with the 17th and others of ability to form and contents of\napplication for registration heavy vehicle tax and satisfactory proof of\ninsurance House bill 44 by representative Cantrell the 22nd green of the\n151st bar of the 103rd park eyes or the 157th gamble of the 15th and others\na bill relating to general provisions relative to state government House Bill 56 by Reps\nand Control of the 22nd, a bill relating to number of judges of superior courts House\nBill 59 by Reps and Control of the 22nd clerk of the 147th Richard the 97th win of the\n89th both of the 80th and others a bill relating to elections and primaries House Bill 60 by\nReps and Control of the 22nd Carpenter of the 4th Jasper's of the 11th clerk of the\n147th Fleming of the 121st and others a bill relating to education House Bill 61 by\nHouse Resolution 4-2-2-6.\nAuthorized Swintfield County to exercise all rate development and other powers under\nthe redevelopment powers law.\nHouse Resolution 4-2-2-2.\nResolution proposing amendment to the Constitution, so it is to provide that the members of the\nSenate should serve four years terms of office.\nHouse Resolution 11.\nResolution 12-2.\nResolution 12-2-2-2.\nResolution 12-2.\nResolution 14-2.\nResolution 14-2.\nResolution creating the house study committee on innovative ways to maximize global talent in Georgia through second readers\nAll right, we're going on now to morning orders\nHouse will come to order\nThe house will come to order we have a number of members who have\nsigned up for morning orders today\nSo that we can stay within the rule\nChair is going to ask that members limit their remarks to not more than one minute each.\nChair recognizes Representative Al Williams for a morning order.\nThank you, Mr. Speaker.\n56 years ago this April, I marched across the Edmund Pettis Bridge with John Lewis.\nThis morning, I stand to introduce a resolution to place a statue of him and statutory hall in\nthe United States Congress.\nThis is a moving and personal moment for me, but let me thank the speaker for his assistant,\nboth the majority and minority leader, the dean, and the past president of Georgia, like\nCaucus representative Bennett.\nonly the road we tried, bitter the chastening rod. Felt in the day when hope unborn had died,\nyet with a steady beat, have not our weary feet come to the place for which our father's\nside. This will be available for signatures and I hope it's 100% in the cloak's office.\nThank you, Miss Speaker.\ntheir recognizes Chairman Martin for a morning order.\nLadies and gentlemen, I rise today\nand ask your prayer that I can get through this.\nWe all lose friends and community leaders\nand none are more important than the other.\nThat said, I stand today to recognize and honor my friend, Tim Buster, not because of\nhis passing, but instead because of how he lived.\nIn just 52 years, Tim accomplished much.\nHe was the middle child of seven out of Miami, went to Eastern Kentucky University,\nrushed for 3,640 yards, was a 10th round draft pick by Los Angeles.\nHe was known as the bus driver running in front of Jerome Batis at Pittsburgh.\nfor Emmett Smith. He was an NFL unsung hero in 1996 and 97. He was a coach at\nMilton and Fellowship and he founded the Milton Steelers for kids in North\nFulton County that had no other way to get involved in sports. He led\nspeaking was a husband and a father. Mr. Speaker I say the light just give me one\nmore minute. Tim Lester was one of the best people in the world. His loss is\nheartbreaking. In a world where people are experiencing so much angst, Tim was an ever-present\npositive force, a man of good. He looked for and saw good in everyone, and more than that,\nhe left good behind him wherever he went. While he is now walking with God, the good he instilled\nin so many, using God's grace is with us. Coach Leicester, you will be missed, yet your\nYour impact has felt today and will be long felt in the future.\nYou made a difference.\nLet each of us strive to bring people together and make that same difference for our community,\nour state and our nation.\nThank you, Mr. Speaker.\nChair recognizes representative Mitchell for a morning order.\nThank you. I think there was a slide. Oh, there we go. So I just have one minute to show\nthis to you, but I wanted to do a science morning order for you all. I know we see a lot\nof information and we have a lot of questions from constituents about the implications of\nthe new strain of coronavirus that's here and that's been detected in one case in Georgia.\nThis is data from the UK from a modeling group who looked there to ask how fast does\nthis spread within the country, and is it more transmissible from individual to individual\nthan previous strains?\nOn the left, you can see that it took six weeks to go from one health district in the\nUK to all of the health, almost all of the health districts in the UK, which there are\n199.\nOn the right, what you're looking at is how many people get infected, given the conditions\nin the UK from a person who has older strains of coronavirus or one who has new strains\nof coronavirus. On the bottom, you can see that that number is around one with the system\nthat the UK had in place in November and December for older strains of coronavirus. So on\naverage, they were under control with intervention. However, the newer strains are on the Y-axis,\nand you can see that that number averages about 1.5. So despite the dramatic intervention\nthat was in place in the UK that was still able to transmit and the epidemic was able\nto rise. So we just need to be aware there is real data behind the public information\ncoming to people and we can find that data and understand it as well. I'm happy to have\na conversation with that.\nLadies, time has expired. Thank you. Chair recognizes Chairman Workhizer for a morning\norder? I can miss Speaker today's version of why we do things the way we do\nstarts with a press conference that the speaker had with the media before\nsession started not the recent one but last year and standing in front of a\nlarge group of media I don't know what the question was but I remember what\nthe answer was and he started pointing at members of the media and he said I\nI wish that every one of you could stand where I stand every day.\nAnd look out and see a white, a black, a young, an old, rural suburban.\nI don't know if you know this or not, but we're actually pretty unique in the way we sit.\nAnd that gives him, and his reasoning to the meaty was the perspective it gives him,\nAnd it should give us, and we heard about unity this morning.\nSo I guess my challenge with that is get to know your neighbor, and especially those\nwho vote differently from you.\nMy time is up.\nI appreciate it.\nThank you, Speaker.\nChair recognizes the minority leader of the House, leader Beverly, for a morning order.\nThank you, Mr. Speaker.\nI don't want to bury the headline.\nI want to talk about friendship today, but before I do that, I thought about a morning\norder that would address the happenings of last week at the nation's capital.\nAnd I thought about when the insurrection started, if there were a group of Black Lives\nMatter folk, who did the insurrection, what that would look like, but that didn't happen,\nso my mind continued at Rome.\nI thought about where we are right now, and Mr. the coronavirus, Mr. Speaker, I tried\nto go to sleep last night so I read the rest of the rule book and I got to rule 175 that\ntalks about how leader burns and I and you should confer about what we should do in electronic\nvoting as we move forward in emergency.\nAnd I was really about to wind it down in an image of my friend, William Bowdie popped\nup.\nWilliam Bowdie is a very dear friend of mine.\nIf y'all don't know, we ran against each other for leader and I prevailed on Monday.\nHe lost his grandmother, his second grandmother in two weeks, and so I'd like for y'all\nto rise for just a second to honor Miss Lula, who passed on Monday.\nWilliam Bowdie spoke to me for 30 minutes about what I was struggling with right after\nhe found out that his grandmother passed, and that's the measure of a man.\nSo, Mr. Speaker, I'd give honor to William Bowdie, my dear friend, and honor his grandmother\nand his family.\nPlease keep him in your prayers.\nLet me speak on you to well.\nChair recognizes representative Bernal for a morning order.\nGood morning, Mr. Speaker.\nThis morning, representatives Marie Metz, Sheila Johnson,\nCamilla Hobson, and I are here this morning\nto celebrate the 108th Founders' Day\nof our beloved sorority, Delta Sigma Theta Sorority,\nIncorporated.\nOur sorority was founded in 1913 by 22 phenomenal\ntrendsetters who saw no limit to their vision\nfor sisterhood scholarship and service.\nDelta's founders stepped out on faith\nto march with the surfer jets and took a stand\nfor social justice as their first public act.\nMore than 107 years later, we pride ourselves\nby following the footsteps of our founders,\nand remain in the forefront of action\nas a voice for those in need.\nThank you, Mr. Speaker, I yield the will.\nChair recognizes representative drier\nfor a morning order.\nThank you, Mr. Speaker.\nSeven days ago, white nationalist attempted\na violent coup against the United States,\nand five people lost their lives,\nincluding two members of law enforcement.\nTwo bombs were deactivated at the headquarters\nof the RNC and DNC.\nA gallows was erected in front of the Capitol\nand the Confederate flag and white nationalist flags\nflew inside the Capitol Rotunda.\nBut despite this trees and our democracy held,\nthese actions were precipitated by thousands upon thousands\nof lies about our election system.\nmost by the current president but aided and abetted by accomplices across the country\nin our government and some right here in Georgia. To ensure we merge stronger, we need a\nfull public accounting of everyone that contribute to this by acts or words. The calls for unity\nshould happen but they can only happen if there is the truth and the truth is exposed\nand those responsible are held accountability,\nbecause we cannot have reconciliation without truth.\nI urge my colleagues to join this call\nfor a full accounting and our democracy\nwill continue to hold.\nThank you, Mr. Speaker.\nChair recognizes representative Scott\nfor a morning order.\nThank you, Mr. Speaker.\nI rise to bring attention to the fact that hundreds of thousands of Georgia out of work\ndue to no fault of their own, and we can't even put our finger on the exact number of\nthem because of lots of data mismanagement and unreturned requests.\nThe data presented on the label website is misleading, and we all know that the language\nto matters in statistics.\nThere are four types of claims.\nValid, invalid, claims that have received at least one\npayment, claims where a payment has been requested.\nThe press releases on the website this month only\nspeak to initial claims, though instead\nof the numerous other categories that\ntruly matter like unpaid claims, claims and appeals\nare denied claims.\nThis is very troubling, so a group of legislators\nformed the task force over the summer,\nand we could not believe that it is the new year,\nand we still don't have clear data.\nIn the last six months of all,\nmy office has sent 100 constituent claims forward\nto the Department of Labor,\nand I have no record of resolution to show\nfor the legislative inquiry.\nThis is not-\nLadies' time has expired.\nOkay, that completes our morning.\nI'm sorry, one more.\nChair recognizes representative Lewis Ward\nfor a morning order.\nThank you, Mr. Speaker.\ncolleagues, myself and my colleague,\nRepresentative Demetrius Douglas,\nbring sad news to you this morning about the untimely death\nof a community leader, husband, dad,\nservant of God, and our spiritual father.\nThis Monday, 51-year-old Spencer T. O. Niel,\nwho is a senior pastor of Global Impact Christian Ministries,\nlocated in Stockbridge, Georgia, unexpectedly\ntransitioned from labor to reward.\nIt's unfortunate, but it's true that we never know\nwhether our actions or our words will be the last ones.\nOn Monday, we all also gathered here\nat the House of Representatives to celebrate the beginning\nof a new legislative session.\nAnd also one that day, the Lord reminded us\nthat in order to live in his house,\nwe must be pure and hot, thoughts, and deeds.\nPast the spends's global impact will continue\nto be transformative, and we will miss\nby everyone who knew him.\nLet's pause for a moment of silence.\nThank you, I yell a well.\nThat completes morning orders. The clerk will now read the caption to a group of privilege\nresolutions honoring the life and memory of Pastor Spencer T. O'Neill honoring the life\nand memory of Thomas Raymond coach Montgomery honoring the life and memory of Heather Holloway\nRecognizing commending, Dana Chastain for receiving the 2019 Stetson F Bennett clerk of the\nyear award, honoring the life and memory of Reverend Dr. Glenn L. Etheridge.\nRecognizing and commending Jim Galloway upon the grand occasion of his retirement and\nfor all the purposes that completes the reading of the privilege resolutions.\nIs there any objection to the adoption, to adopting the privileged resolutions?\nThe chair here is done and the resolutions are adopted.\nBefore we complete our work, if I could have your attention please, if I could have your\nattention please, first of all tomorrow is Thursday.\nWhat do we do on Thursday?\nBless you.\nYou will get a memo later today with complete details, 7 a.m. to 11 a.m. testing here in\nthis building.\nSecondly, we are social distancing, which I know is inconvenient and uncomfortable for\nmany.\nBut again, I told you all Monday that my priority is to make sure the members of this body\nand staff and others that have to be here, that their health is protected.\nAnd so we have to social distance, which means that we have limited seating on the floor,\nand then we have to seat in the gallery and we have to seat in 341.\nYou have, according to the seating chart and a signed seat, we have a chart.\nThat chart is linked up to the clerk's office.\nNow what does that mean?\nThat means when you rip the your name tag off your seat to find somewhere you like better,\nyou're not going to be able to vote and we're not going to reconnect you.\nSo if you have done that, and I don't understand, there's multiple\ninstances of that happening, then you might want to just slip back in here\nvery discreetly after we all leave.\nAnd kind of put it on there where nobody will see so that you will be a\nfull voting member of the Georgia House of Representatives.\nWe have no birthdays today.\nThe chair recognizes the majority leader of the house for a motion.\nI'm sorry, we have an announcement.\nWe have an announcement.\nChair recognizes Chairman Hatchett for an announcement.\nThank you, Mr. Speaker.\nThe majority caucus will meet today at noon in the Floyd room at twin towers.\nNoon, Floyd Room, lunch will be served, and we do have a guest coming to give us several updates.\nThank you.\nChair recognizes.\nChair recognizes Chairman Billy Mitchell for an announcement.\nThe minority caucus will indeed have a meeting today.\nIt will be via Zoom.\nWe will start in about 30 minutes.\nThank you.\nMr. Speaker.\nI'm not.\nChairman Clark will read the caption to a group of privileged resolutions.\nRecognizing January 13th, 2021 is Korean American Day in Georgia and for other purposes.\nIs there any objection to the adoption of the resolutions that Chair here's none in\nand the resolutions are adopted.\nNow the chair recognizes the majority leader\nof the house for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this house stand adjourned\nuntil 10 a.m. Thursday, January the 14th, 2021.\nMajority leader has moved that this house be adjourned\nuntil 10 o'clock a.m. on Thursday, January 14th,\n2021, all those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes clearly have it and this house will be adjourned\nuntil 10 o'clock a.m. Thursday, January 14th.\n",
  "updated_at": "2026-02-12T16:47:41.514123+00:00"
}