{
  "video_id": "_CqOPRQ4y-8",
  "url": "https://www.youtube.com/watch?v=_CqOPRQ4y-8",
  "title": "The Senate Stands Adjourned Sine Die! | 2023 Legislative Session Recap",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 2,
  "summary": "# Georgia The Senate Stands Adjourned Sine Die! | 2023 Legislative Session Recap\n\n## Overview\nThis session appears to have been a brief, procedural session primarily focused on adjourning the legislature sine die (for the year). Some discussion around legislation, possibly SB 2, is mentioned but details are limited.\n\n## Key Actions\n**SB 2**: Some discussion of this bill, possibly related to elections, but details are unclear.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced based on the provided transcript.\n\n## Notable Moments\n- The Senate President recognized a Senator from the 19th district.\n- There was some parliamentary procedure discussion.\n- The Senate Majority Leader moved to adjourn the session sine die.\n\n## Votes\n- The final vote to adjourn sine die passed with an \"eyes have it\" voice vote.\n\n## Attendance\nNo explicit discussion of quorum or attendance.\n\n## Adjournment\nThe Senate adjourned sine die, with no mention of the next scheduled session date.",
  "transcript": "Special thanks for watching unit 1.\nthat\nSenator, from the 19s, what are your...\nParliamentary agreement, Mr. President.\nWhat's your state you're requiring?\nBingo.\nand of SB 2 and 2 we did their early reign of honor of election for us.\nAnd of SB 2 and 2 we did their early reign of honor of election for us.\nAnd of SB 2 and 2 we did their early reign of honor of election for us.\nWelcome!\nCross as a brother now we have our ability for those trophies.\nsix-point of language related to\nI move that the Senate stand to\nStand to adjourn, sunny die.\nThe majority leader has moved all those in favor.\nSeek to five by saying, I, all those opposed.\nThe eyes clearly have it, we're adjourned.\nMusic\n",
  "updated_at": "2026-02-12T20:33:48.518983+00:00"
}