{
  "video_id": "_v4ewO5oSWU",
  "url": "https://www.youtube.com/watch?v=_v4ewO5oSWU",
  "title": "Sen. Halpern's Response to President Trump's Joint Address to Congress | 3-4-2025",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "# Georgia Sen. Halpern's Response to President Trump's Joint Address to Congress | 3-4-2025\n\n## Overview\nSenator Sonia Halpern of Georgia's 39th Senate District delivered a critical response to President Trump's joint address to Congress, highlighting the negative impacts of the Trump administration's policies on Georgia families and businesses.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Sen. Halpern expressed concern over President Trump's campaign promises being broken, resulting in economic consequences for her constituents.\n- She criticized the Trump administration's policies, including layoffs at the CDC, tariffs hurting Georgia farmers, and cuts to research funding.\n- Sen. Halpern called on Congress to provide a check and balance on the President and his \"co-president\" Elon Musk, and to focus on reducing costs for American families, protecting jobs, and growing the economy.\n- She pledged to continue working at the state level to improve education, healthcare, and wages for Georgia families.\n\n## Votes\nNone detected.\n\n## Attendance\nQuorum maintained.\n\n## Adjournment\nNo specific adjournment time provided. Next session date not mentioned.",
  "transcript": "Good evening. My name is Sonia Halpern. I'm a Georgia State Senator for our\nState's 39th Senate District. The Atlanta District I represent is one of the\nmost socio-economically diverse districts in the state of Georgia and I'm so\nglad we got to hear from the president tonight. It's important for Congress and\nthe American people to hear directly from President Trump. President Trump won\nthe 2024 presidential election, and many cite his campaign promise to lower costs for American\nfamilies as the reason for his victory. Fast forward to today, that campaign promise has been\nbroken, and unfortunately that means many of my constituents will feel or are already feeling\nthe economic consequences of the Trump administration's agenda. We just listen to President Trump talk\nabout making America great again, but great for whom, for his billionaire buddies, because\nhis plans so far have been disastrous for Georgians. Already 1,300 CDC employees in Georgia\nhave been laid off. Already, Trump's tariffs on Canada, Mexico, and China will raise the\nprice on everyday essentials like monthly utilities, groceries, and gas. Already, Georgia\nfarmers are panicking as Trump is levying tariffs against any produce they export. You heard\nthat right? He said, and I quote, to the great farmers of the United States, get ready to\nbe making a lot of agricultural product to be sold inside the United States.\nwill go on external product on April 2nd. Have fun. Have fun. There's nothing fun or\nfunny about penalizing Georgia peanut or peach or blueberry farmers who sell some other\nproduce to other countries. It's only been a month and a half and already the stock market\nhas plunged and the Atlanta Fed is now projecting negative GDP growth for first quarter. Enough\nalready. Mr. President, there is a single mom here in Georgia with two children who was\njust laid off from the CDC in spite of sterling performance reviews. Without her job, how\nwill she make a monthly rental or mortgage payment? How will she feed her family? How will\nher family's health care needs be met? Trump and Musk have stopped or slashed over $100\ndollars in research funding in Georgia. This funding goes to universities, hospitals,\nand nonprofits in our state. There are researchers at Emory working on a cure for Alzheimer's\ndisease and cures for cancer. People are studying whooping cough in children at the University\nof Georgia and lung cancer at Morehouse School of Medicine. Hope for a cure has now been classified\nas waste. This is bad for our country period. It makes us weak and sick and exhausted.\nOne would hope that the U.S. Congress would stand up for Americans and do their job to provide\na critical check-in balance on Trump and his co-president, Elon Musk, the richest man\non Earth. Instead, the U.S. House just passed a budget to gut health care and make it harder\nfor people to put food on the table.\nThanks to Trump and Musk's reckless agenda,\nthat means gutting health care for 2 million Georgians.\nIn Georgia, 65% of Medicaid recipients are children.\nHalf of all childbirths are covered by Medicaid\nand three-quarters of seniors in nursing homes\nrely on Medicaid enough already.\nI am all for reducing wasteful spending.\nBut the way to do that is with a scalpel, not a machete,\nor a chainsaw, as Elon must jokingly wield it on stage\nrecently after threatening to cut the benefits\nfor our farmers, our seniors, children, and veterans.\nThese are people's lives and livelihoods,\nand the uncertainty hurts Georgia families.\nAmerica's health and well-being is in jeopardy.\nWe don't want planes falling out of the sky.\nWe don't want bird flu ravaging the country\nbecause must took his chainsaw to the CDC.\nAnd we certainly don't want grandma\ngetting kicked out of her nursing home.\nEnough already.\nTonight Trump proclaimed a dawning of a golden age.\nTell that to the 21,000 Georgians\nthat have filed for unemployment since Trump took office.\nI am calling on my party, who are my colleagues and friends\nto stop being distracted by the politics of division.\nNow is the time to stay focused.\nNow is the time to do everything in our power\nto bring down the cost for American families,\nprotect their jobs, and grow our economy.\nAs Georgians, a people would so much to offer\nin a history of setting powerful examples\nfor the rest of the country, we deserve better.\nAt the state level, I will keep working hard\nto pass legislation that will improve our education system,\nbring down the cost of health care,\nand protect livable wages.\nI care deeply about making sure that working hard\ncan ensure a better life for Georgia families\nand for families across our country.\nAnd that hard work will be rewarded,\nnot discarded on the altar of Doge's destruction.\nI am hopeful that amidst the chaos in Washington,\nour state leaders will join me in saying enough already.\nWe must work together to find solutions\nto the real and pressing challenges\nthat families face each and every day.\nThank you.\n",
  "updated_at": "2026-02-12T18:59:59.496867+00:00"
}