{
  "video_id": "a_ny6tHfbgg",
  "url": "https://www.youtube.com/watch?v=a_ny6tHfbgg",
  "title": "Rules Meeting for Day 33 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 33,
  "video_date": null,
  "duration_minutes": 20,
  "summary": "Overview:\nThe Georgia Rules Committee meeting discussed several notable bills, including ones related to development authorities, administrative burden reduction, property tax rates, gas pipeline infrastructure, healthcare workforce information, and adopted children's birth certificates. There was also discussion of a foster child grant scholarship program and an adult high school diploma program.\n\nKey Actions:\n**SB 100**: Allows adopted children to access their original birth certificates when they turn 18 years old.\n**SB 252**: Allows municipalities with populations over 300,000 (i.e. Atlanta) to transfer or convey property that has not been abandoned for public use.\n\nBills Introduced (First Reading):\nNo new bills were introduced during this meeting.\n\nNotable Moments:\n- Senator Robertson expressed excitement about becoming a grandfather and the bill's impact on his adopted daughter's ability to access her original birth certificate.\n- There was some discussion around the healthcare workforce information bill (SB 131) and concerns about potential identification of individuals in smaller counties.\n\nVotes:\nNo recorded votes were mentioned in the transcript.\n\nAttendance:\nThe transcript does not provide any information about quorum or attendance.\n\nAdjournment:\nThe transcript does not mention when the meeting was adjourned or the date of the next session.",
  "transcript": "Good morning, everybody.\nGood morning.\nIf you would, please come in and have a seat.\nAnd we'll begin our meeting this morning.\nGoing to ask Chairman Stevens to open us up with a word of prayer this morning.\nmost kind and gracious Heavenly Father thank you for this day as we go through\nthese heavy issues, point us the direction as we take our steps, point us in those\ndirections as well. Give us the wisdom, show us the way, all these things we ask\ncame in. Thank you, sir. Okay, let's hear from my senator.\nSenator, come on back to the beat.\nIs this one okay? Thank you for hearing this. It's Senate Bill 151. It started out as a joint\ndevelopment authority bill. It has since changed and I want to thank Madam\nof Pro Tem Jones for her hard work on working with the mayors and getting this done.\nWhen I first moved to Fulton County 32 years ago, there were only two cities and\nthe rest was unincorporated.\nNow there is no more unincorporated.\nWe have six cities.\nThis bill simply allows each city to create their own development authority.\nAnd the Fulton Development Authority would not be able to do business if these cities create their own\ndevelopment authority and pass it in ordinance.\nSimply what that bill does and, again, I want to thank Madam Pro Tem.\nfor her hard work on this committee sub and working with the mayor's in North\nFolk. I'll take any questions. Thank you, sir. Senator, I don't see any\nquestions. All right. Thank you. Yes, sir. Thank you, Mr. Chairman. Good\nmorning. Good morning, committee members. This morning I bring to you Senate Bill\n96, LC number 6, 0, 0, 1, 4, 0, ECS. It's a pretty straightforward bill. It's a\nIt's a good government bill, it's clean up bill, what it does that reduces the administrative burden on state agencies by reducing the number of boards that have grown in active or perform duplicative roles that also restructure a couple of boards for efficiency.\nI would be happy to answer any questions.\nOkay. Thank you, sir. I don't see any questions. Thank you.\nSenator Watson.\nChairman members of the committee I bring before you send it bill 44 at the bottom of page one\nThis is a deal with the milled rates as our property tax digest is going up\nThis is allowing our local school systems to lower the floor that we require them to say it at 14 meals down to 10 meals\nIf they see that they need to it's more of a financial management bill for our local school systems\nOkay, no seeing any questions. All right. Thank you. Appreciate your support\nMr. Chairman, members of the committee, this is LC-492342S.\nIt is Senate Bill 13.\nMr. Chairman, what this bill does is, GIFA allows GIFA to include that for gas.\nIn my district down there, as you know, I got a massive territory, and some of my counties\nare completely out of gas and they need to be funded or increased the\nside of the pipeline and basically it's allowed to have a tool in the shed to\nbe able to increase your pipelines. Yes sir have a question. Thank you\nMr. Chairman. Thank you Senator for bringing the bill. Isn't it true that this\nis a loan and not a grant so the folks that are utilizing the gas will be\npaying for the infrastructure. Absolutely sir. Thank you. Thank you for bringing\nbill. Absolutely. Okay, don't see any other questions. Thank you. Thank you, Chairman. Thank you, sir.\nSenator Hodges. Thank you, Mr. Chairman. I appreciate the opportunity to be here. I have\nSenate Bill 131. It's midway of the second page LC 550520S. Basically what it does is it\nestablishes a health care website statewide to provide better health care\ninformation to Georgia health care planners and consumers will have a\nstatewide website list of healthier providers listed by age language\nproficiency gender location of practice and license type also will have the\nmonth and year of their birth, city, county, and zip, but we'll have no personal\ninformation. This is just for planning purposes and for a consumer\npurposes. Okay, Senator, don't see any questions. Thank you, sir.\nThank you, sir. Appreciate it.\nSenator Robertson.\nWell, I'm sorry. Wait a minute. There is a question. I'm sorry. Chair Martin has\na question. Yes, sir. In the center, and there's this high-assist in\ncommittee, but I do think it's important. Some of the information while the\ncenters in tennis is it not true not to have personal information some of the\ncounties are small and using age and several of the classifications might\nactually provide for personal identifying information that's my pause with\nthe bill in certain areas when you cut it by gender by age my specialty it is\ngoing to say it was this doctor and that is the pause I have with the bill isn't\nThat's what we're talking about, it's been funding.\nRepresentative, Mr. Chairman, that could be the case if it is not the intent and to get\nthe information that the Georgia Board of Health Care workforce needs, they have to get\nthe same information from all the counties whether the county is a big county or a small\ncounty.\nAnd again, what they're trying to do is be able planners need to look at our state and\nsay we have a deficit of a certain type of health care provider in a particular area\nso that we don't have health care deserts.\nThat's the aim of this.\nJim and Hawkins, do you have a question?\nYeah, this question did come up in committee\nand my opinion is that patients do look for age\nin their providers and I know my wife likes to go\nto a female physician.\nSo this helps the consumers, the patients,\nselect the provider that they really want it.\nThanks, good bill. Thank you. Thank you, Mr. Chairman.\nThank you, sir. Don't, don't see any other questions.\nThank you, Mr. Chairman. I appreciate it.\nSenator Robinson, come on.\nThank you, Mr. Chairman. I'm here on SB 100.\nSB 100 is a very simple piece of legislation.\nI found out yesterday afternoon around four o'clock.\nI have five grand dollars. I found out yesterday around four o'clock\nfour o'clock that I'm getting my first grandson September 5th and I'm excited about it.\nThank you. But what that means is in 18 years my grandson's going to be able to go to the health\ndepartment and ask for his birth certificate and they're going to give it to him for $40.\nI have a daughter who was born six years ago. My wife cut her medical core. Her name is Andy.\nIn 12 years, when Andy goes to the health department to get her birth certificate, her original birth certificate, she's going to have to hire an attorney.\nShe and thousand of other adopted children in Georgia have to hire an attorney, and they have to get a quarter of her from Superior Court.\nIt's been thousands of dollars in order to get their original birth certificate.\nWhat I want to do is I want to put my daughter on the same plane, the same equal level with my grandson, and that's exactly what this bill would do.\nIt would allow adopted children to be able to go when they're 18 years old as adults and get a copy of their original birth certificate\nAnd it's just that simple, Mr. Chair\nOkay, don't see any questions. Thank you. Thank you, sir. God bless that. Yeah, Senator Brass\nMorning, Mr. Chair, my members of the committee bring you SB 85 on page two third from the top\nSimply a foster kid grant scholarship program\nJust putting some eligibility requirements and kind of tightening up there and then again on page three\nTop of the page SB193 and\nThis is a adult high school diploma program for ages 21 through 40 where the\nThird parties that are running this program most of the payments they receive are on the back end\nAnd as the people graduate, that's where they receive a bulk of their mind.\nOkay, Senator, I don't see any questions on either of those.\nThank you.\nAll right.\nThank you, Mr. Chairman.\nYes, ma'am.\nGood morning, Mr. Chairman and committee.\nI bring to you SB 252.\nDecades ago, we put into code that any municipality with a population greater than 300,000 cannot transfer or convey property unless it's been abandoned for public use.\nThis bill would allow Atlanta, the sole city with 300,000 population or more, to be able to actually provide a piece of property to their school system as every other city and school system can do currently.\nThere's a piece of property next to an elementary school.\nIt will be a landswap with no land loss for the city of Atlanta.\nAnd we've outlined that these swaps in the future\ncan only be for educational purposes by the school system.\nOkay, no saying questions.\nThank you very much.\nSenator Hickman.\nThank you, Mr. Chairman and committee.\nWe're looking at Senate Bill 149, LC 492116.\nSenate Bill 149 will allow for newly qualified\nfor your college institution systems\nto participate in the TEG program.\nThe college university must be accredited\nby the Southern Association of Colleges\nand Schools Commission on Colleges\nas a level six institution.\nThis bill actually passed the Senate last year,\npassed its house last year,\nand the governor's office made a few modifications to it,\nand we have adhered to the governor's suggestion\non the modification, so we would appreciate that.\nThey will support this year.\nThank you.\nOkay, no questions.\nThank you, sir.\nThank you all, sir.\nSince we thank this chairman, members of the committee.\nOn page three, Senate Bill 260,\nthis is Central State Hospital Redevelopment Authority.\nThis is taking a nine member board down to four members\nthree which would be voting members and it's also putting all of the Central\nState Hospital campus under the Department of Community Affairs. What the\ncampus consists of is about 2,000 acres and over 100 vacant buildings that were\nleft after Central State Hospital was closed down and lost 15,000 jobs and\nthis is trying to redevelop this property to create jobs, get the\nBuildings and property on the tax roads in ballin county. I ask for your favorable consideration\nOkay, don't see any questions. Thank you, sir. Thank you\nThank mr. Chairman members of the committee. The first bill I want to discuss is on page two\nThis is Senate bill 153\nEvery year as y'all are aware the official code of Georgia gets updated and\nand technically cleaned up, whether it's a grammatical error or just very spacing.\nSo this is just the official code of Georgia annual cleanup bill.\nThe second bill is Senate Bill 154.\nWhat this bill allows is for Georgia to continue to move forward if and when the U.S. Department\nof Education is disbanded.\nI know timing is everything and I'm told the president may be signing an executive order\nright now to disband the U.S. Department of Education.\nSo this would be very timely if it were to get on the day.\nBut what it does is just in the Georgia code,\nthe US Department of Education is referenced at least 25 times.\nAnd the biggest impact it has is on licensing.\nIf you're a dentist, optometrist, psychologist,\npolice officer, in order to be recognized as graduating\nfrom a university that's accredited,\nit has to be an unincredited list by the US Department\nof Education.\nSo what this says is where it references the U.S. Department\nEducation, it just puts a comma and says,\nor it's successor.\nRight now we don't know what that successor will be.\nIt may end up being the state or another federal agency.\nBut if this bill passes, then if the president\ndoes sign the executive order and it goes into effect,\nGeorgia will continue to be able to license professionals\nin the state to move forward.\nSo I would ask for that.\nAnd then the last bill is on page three.\nThis is Senate Bill 141.\nThis is a Department of Revenue bill.\nAnd what it does is it makes two tweaks to our statute\nthat will raise the grade that Georgia gets\nfrom a B minus to an A and potentially an A plus.\nOkay, no questions.\nThank you.\nThank you, Mr. Chairman.\nSenator Kamona.\nMorning, Mr. Chairman, committee.\nTwo bills on here, Senate bill 17, Ricky and Alyssa's Law.\nThis bill, part of it you've seen before, the new part we've added, Ricky Espinol's name to this bill, who's killed at Appalachia, has two components,\nmobile panic alert system, and a mapping requirement for school systems in Georgia, and then separately, it's sent in bill 110, which is our free range bill that we presented last time.\nOkay.\nDon't see any questions on these.\nSenator Anderson.\nSenator Anderson.\nThank you, Mr. Chairman.\nIt's such honor to be in your presence today.\nWe feel the same way.\nYes, sir.\nOn the third page, Senate Bill 293 is\nhaving our veterans.\nWe're going to expand a free\ncar tags to two instead of one okay do you have a question for you here lady\nSmith thank you senator I was before one of your committees yesterday on the\nSenate side and I believe they've amended this bill to a house bill on the Senate\nside so do you know anything about that I'm in conversation with chairman\nBut I mean, this is the best for you all.\nTodd me, I didn't understand.\nI think it's a best bill on the other bill too.\nOkay, you don't see any other questions.\nThank you sir.\nThank you sir.\nSo you're just asking.\nThanks Chair and members of the committee, a top of page two under modified structure\nSenate Bill 51, relates to qualification-based elections of architects and engineers, takes the process we use in our university and state procurement system and applies it to cities and counties.\nI'll add to that question.\nOkay.\nI don't see any questions.\nThank you, sir.\nSenator Walker.\nThank you, Mr. Chairman. Good morning committee on page two right in the middle Senate bill 125\nIt would allow\nFor engineers and training to take their professional engineering exam\nAnytime after they complete their coursework their academic work instead of having to wait to the end of their\nbuild experience\nHave this will improve the pass fell rate\nOkay, you don't see any questions. Thank you.\nOkay, we appreciate it.\nThank you, Mr. Chairman. I'm asking for Senate Bill 68. It's second from the bottom on page three and what Senate Bill 68 does is makes revisions reasonable revisions to the Civil Practice Act, the Evidentiary Code, and premises liability.\nOkay.\nYou have a question.\nThank you Mr. Chairman, to the whip.\nMy understanding is that the bill came over to us from the Senate obviously was not engrossed\nand I was wondering what was the wisdom to make it structured on our side when they didn't\nrestrict it on their side.\nWell the wisdom of the chair of the committee is put it in a structured format.\nNot a revenue bill, just curious why.\nSo we've had about 13 or 15 hours of debate on this bill and we've heard from folks\nall over the state and I feel like that most questions have been asked and so we want\nto go ahead and try to deal with this and move that out so that's the reason for that.\nThank you, Mr. Chairman.\nAnd I also believe that the representative asking the question has had a thorough vetting\nof the bill and I believe there will be an opportunity to do that on the floor.\nDid you have another question?\nJust to respond I appreciate that I did.\nI was put on the subcommittee but there were a lot of people that didn't and\nit would have been nice to at least been able to offer amendments to propose for the floor\nbut when it's structured we can't even do that.\nAnd I just wanted to make the point that I didn't understand given it's not a revenue bill\nBill why were so afraid of amendments but thank you for the answer.\nThank you, thank you.\nAny other members of the committee?\nThe desk will bill.\nOkay.\nKevin Hawkins, did you need to answer?\nI'd like to ask SB five.\nSB.\nBill that reduces prior operation for providers who have a good clean track record.\nAlso known as the gold card bill we had last year.\nOkay. Any questions? No questions.\nChairman Lynch, would you like to put my name by Senate Bill 110?\nOkay. If these bills have already been asked for, there's no need to\nput our name by them unless you'll just feel urged to do so.\nOkay. Here we are. Let's\ndo a little housekeeping before we set the calendar.\nDo I hear a move to recommit Senate Bill 151 back to Intergovernmental Coordination Committee?\nHave a move and second. Is there any opposition?\nOkay, it's sent back to committee.\nOkay, now we'll set a calendar for today.\nUnder a structured Senate Bill 68.\nHave a move in a second. Any opposition?\nThere is opposition. All those in favor say aye.\nThose opposed say no. The eyes have it. Yes, I'm\nUnder modified structure Senate bill 153 have moved and second is there any opposition\nIt's on\nAlso under modified structure Senate bill 252\nMove and second it is in opposition. It's on\nThank you very much. We're adjourned\nYou\n",
  "updated_at": "2026-02-12T17:50:15.143791+00:00"
}