{
  "video_id": "aa1CEC30gIg",
  "url": "https://www.youtube.com/watch?v=aa1CEC30gIg",
  "title": "Senate PM Meeting for Day 33 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 33,
  "video_date": null,
  "duration_minutes": 115,
  "summary": "Here is a structured markdown summary of the Georgia Senate PM Meeting for Day 33 of the 2025 Session:\n\n# Georgia Senate PM Meeting - Day 33 (2025 Session)\n\n## Overview\nThe Senate session featured extended debate and discussion on House Bill 55, which would add a new judgeship to the Alapaha Judicial Circuit. Senators engaged in a lively back-and-forth, showcasing their legislative expertise and knowledge of Georgia history and trivia.\n\n## Key Actions\n**HB 55**: Bill to add a new judgeship to the Alapaha Judicial Circuit, passed by substitute.\n\n## Bills Introduced (First Reading)\n- HB 111\n- HB 1302 \n- HB 161\n- HB 111 (again)\n- HB 112\n- HB 1437\n\n## Notable Moments\n- Senators engaged in an entertaining exchange about the origins of the Alapaha River and blueberries.\n- Senators discussed historical references like the \"lean ox festival\" and Elvis leaving the building.\n- The Rules Committee Chairman was praised for his South Georgia roots and participation in local festivals.\n\n## Votes\n- HB 55 passed by a vote of 51-1.\n\n## Attendance\nA quorum was present, though some Senators briefly stepped away during the debate.\n\n## Adjournment\nThe session was adjourned. The next session will be held on a future date.",
  "transcript": "you you you you you we are starting on the rules calendar house bill 55 secretary read the caption has will 55 by representative four to one seven eighth and others bill's being done on act to men code section 15-6-2 the OCGA will enter a number of judges this period of course says to product for additional judges this period of course of the lapahadj official circuit try for the appointment in terms of such additional judge by the government why for later matters for effective days to be able to look at laws and for other purposes mr. president secondary and jasher recommends this bill do pass by substitute of the submitted senator strickland chairman mr. president and jasher over following substitute to house bill 55 bill to be in time of night to men code second 15-6-2 of the official church annotated away to the number of judges be recourse this brought up a additional judge and for other purposes mr. president that completes the order recognize the blueberry farmer from lands county Georgia right here they don't get any more agriculture agdon the senator from the eight mr. president i got to put on my C&I glasses here this this bill hb 55 is the same as the exact same bills we passed out of this chamber unanimously and it adds a judgeship to the alapahol judicial circuit the last time that we added a judge was in 1979 in 1979 was the year that George owned my mind became the state song it was the year that the happy meal was introduced it was the year that the sonny walkman was introduced it was the year that marta was opened zeal miller was the president of the state senate at this time a young man by the name of Larry bird was the ap college basketball player of the year in China they activated their first automatic traffic lights and Beijing Paul coverdale the coverdale buildings named after was the senate minority leader there were only five republicans in the state senate the senator from the 26 was serving his third he was better we young lad serving his third term in the state legislation and down in buts county mr. bill and miss Martha Jones welcome to new baby boy into the world who would go on to be the lieutenant governor of this state and our presiding officer in this chamber been a long time since we've added a new judge yet we're ranked the number one need in the state of Georgia and I just asked for your favorable consideration to help my friends in the alapahol judicial circuit get another judge yet with that mr. president I'll yield the well for questions or I'll keep talking until we get more senators in the chamber to vote whatever you think I need to do probably do need to stall a little bit senator we can I know you can do that recognize senator 23rd now you miss president senator yield I yield from my great name was a wonderful presentation which you spell alapahol well I will tell you this senator and course you know I say this all the time senator you know you are a full bright scholar I was as the senator from the eighth is only a half bright scholar what even a half bright senator but I will a lot of all I will tell you this senator it has no dubious has no I do know how to spell dubious it is the D U B Y W if the senator yield for one more question I would be glad to would you give me the lineage of alapahol so alapahol is named after the alapahol river it is a 220 mile river that runs through South Georgia and it it flows into the the swanning that flows into depending on what side of the aisle here from it could either be the Gulf of Mexico or the Gulf of America right but that is what the alapahol river is and the circuit is named after the alapahol river in this got barren county Lanier County lower it is you don't have to do that much we good thank you miss president thank you senator thank you thank you I'm going to send from thirty-third more question thank you miss president with the center of the yield I'll be glad to yield to my friend from the thirty-third the bundle of joy you were when you were born were you born in a blueberry patch let's see I was actually born senator just a few months apart in tiff general hospital with our in the same hospital has our esteemed rules chairman who has South Georgia roots himself and it can be proven because he rode the he rode the mule in the in the lean ox festival which is a very few people are done that that's something to be proud of senator the lean ox festival the lean ox festival by times are pretty rough down to South Georgia that ox is gotten lean it's the lean ox festival that is funny hey senator from 27th has a question thank you miss president chairman yield I do to my great friend yes sir chairman seems like a number of centers have left the building can you tell us the origin of the famous phrase that Elvis has left the building oh well the origin is actually there is a gentleman I lower like I'll I'll I was his first name and anyway they were trying to get some but he worked for Colonel Parker and they you know they would get the Elvis fans are pretty rowdy fans right and they try to chase after him and everything else and so Alcovorkian was his name I'll I'll I'll something anyway he's one that famously used to say ladies and gentlemen Elvis has left the building thank you mr. chairman we're gonna send for the six thank you mr. president does the senator yield the senator yields and I'm not waiting for the translation is it not true that I rode a actual horse it was not a mule nor a hessie is that not true the center in the lean ox parade the senator knows of what he speaks would you further yield I would be glad to you so it is my understanding there's an alapahol blueberry is it also named after the lapahol river it is named after the lapahol river I'm impressed and that you know that there is an alapahol lapahol blueberry is the rabidah variety of blueberry and it was developed at the University of Georgia and we actually have some of those varieties at the farm well is it not true when you're born at tip general you get a orientation on blueberries is that not true it is true senator and I assumed that's why you knew that fact exactly one last question if you yield I do yield senator so where's the where's the lapahol river what's it named after what's it named after yes what is the earliest the earliest I guess translations of the word lapahol comes from the Hernando de Soto expedition that that came through our part of Georgia and it was a variation of a Native American word that we got alapahol from it's amazing I walk away for five minutes I come right back y'all still talking I'm freaking out senator from the 31st Mr. President speaking of berries as for you and as consent to excuse the senator for the 45th for business inside the capital objection center from the 45th is excuse all right last one center from 33rd you are again okay all right no more questions thank you Mr. President I urge your favorable consideration and appreciate it thank you all does any other senator which speak for against the manager chair here's on is there objections to the previous question being oradowed chair here's nine previous question is ordered question is only adoption of sufficient geters of objection of customs command is substituted hearing none he subscript is adopted is there object to a green to the poor community which is flour to the past the bill chair she goes down the board meeting in green to there director to the main question being ordered chair he's done man questions order questions on the past another bill my substitute all those in favor of the built, but yeah, all opposed to the name, Secretary of Law and the Machine. All in the past of the bill, the Yays are 51 and the Nays are 1. This bill haven't received a requisite constitutional majority. It's therefore passed by substitute. What, hey, what, what'd you do to add? Your looks do get you in trouble, you know? All right, Secretary Reed, House bill 111. House bill 111, my representative, the one hundred third and others, the bill's been turned on act to amend Article 2, chapter 7, Title 48, the Fish Grader Georgia, and it's able to lead to the imposition, rate, computation, exemptions, and credits relative to income taxes, so as to reduce the rate of tax, to rise related matters, rise in effective rate and applicability to a vehicle-voking laws, and further purposes. Mr. President, the Senkian, the Finance recommends that this bill do pass. Mr. Wokeley's Minister, and the Huff-Statler Chairman, Mr. President, of a fiscal note has been attached, and I complete the order. I recognize the Senator from the 50th. Thank you, Mr. President. Rise today to bring for you House bill 111, 111 on behalf of Governor Kent. This bill is going to accelerate the tax cut for Georgia's individual income tax. The origin of this tax cut acceleration goes back to the 2022 legislative session, when the General Assembly passed, and the Governor signed into law, HB1437, to provide for the largest income tax in our state's history. This original bill planned to initiate a flat tax beginning at 5.49% for tax year 2024, from 5.75 in 2023, and then allowed for an annual step down in our income tax rate to an eventual 4.99% by the year of 2029. However, thanks to conservative budgeting and your support last year, we accelerated this rate from 5.49% to 5.39% for tax year 2024. This year's proposal will further accelerate the rate by which the rate by an additional 20 basis points to bring the rate from 5.39% to 5.19% effective July 1, 2025, for tax year 2025. This acceleration in the reduction will save taxpayers $869 million. Overall, this additional 20 basis point reduction will be part of a 56 basis point total reduction in individual income taxes since the Governor signed HB1437 after the 22 legislative session. In other words, we started at 5.75% back in 2022, and now we're looking to get down to 5.19% in just a three-year time frame. So while other states are raising taxes on their citizens at a time when they're facing sky high prices and can least afford it, we are doing the opposite here in Georgia. We're putting money back in the hands of Georgians which this bill, HB111 does, I ask for your favorable consideration with that Mr. President, I yield the well. Does any of the Senator would speak for against the measure? I recognize Senator further than 44. Thank you Mr. President. I rise to draw a little bit more of attention to the actual numbers that are contained within this bill. The problem with this legislation colleagues is that this bill is a tax cut for the rich. So today, I want to stand up for hard-working Georgians in talking about this bill. People who are working two and three jobs, who cannot get ahead. Folks who are trying to save to buy a home. People who are working more than 40 hours a week, who struggle to afford rent, childcare, people working more than full time, who do not get healthcare from any of their employers, people who are working really hard and spend a much higher percentage of their income on basic necessities, like groceries, gas, and rent, then do the upper echelons of our income brackets. This bill does almost nothing for those folks. I want you to look at the chart that I put on your desk that looks a little something like this. I want to find it. I want to run through the numbers of who's going to benefit from this tax cut for the rich. For the bottom 20% of Georgian earners, they will receive $10. The second 20%, the average tax cut is $32. For the middle 20%, the middle 20%, the middle class, the average tax cut is $70. For the fourth 20%, they will get $156. And the top 1% will get an average tax cut of $3,000 or more. These are folks that make $2 million a year. They make $2 million a year, and all of this tax cut is going to them. That is a finger in the eye of everyone who struggles to afford gas, eggs, and rent. I want you to look at the chart that I put on your desk. Put another way. This legislation will cost $748 million. Only 33% of it will go to 80% of Georgians. 67% of it will go to the top 20%. But it is a tax cut for the rich. It delivers outsides benefits to Georgians already at the top of the income ladder who earn the highest incomes. So no, we should not be passing this bill. We should stop telling lies about hard work in Georgians because we don't care about them obviously. If we are spending $748 million and only 30% is going to 80% of Georgians. I want to talk about what we should be doing instead. For a number of years, I have been the author in the Senate of the Georgia Work Credit legislation. This is a widely regarded conservative approach to helping families afford necessities and incentivizing work. I believe it was originally proposed by Republicans in Washington and we have a federal earn income tax credit. This state level proposal, which I just referred to as the Georgia Work Credit, can also be called a Georgia state earned income tax credit for our state taxes. Almost every single state has one. We do not. We do not. If we actually cared about incentivizing work, keeping people out of poverty, encouraging them to climb the economic ladder through spending more time earning money, then that's what we would be doing. That's what we would be doing. The benefits of the work credit are very well studied because, as I already mentioned, almost every single state has one. We know a lot about it. It has benefits that redound to across generations. EITC expansions lead to increased employment rates. In fact, it is widely credited at the federal level as the reason why employment rose among single mothers with children in the 1990s. Kids and families that receive it do better in school, have better educational outcomes, and make more money themselves as adults than families that don't get it. Which, if you're following along here, also means that those kids will eventually pay more into our state's income tax coffers than those who do not get a work credit and stay at the poverty line. This is a measure that would make so much sense if we cared about actually helping hardworking Georgians. I just had to get up here and call this out for the gimmick that it is because this, my colleagues, is nothing but a tax cut for the rich, dressed up in some pretty language. And you can be sure that the 80% of Georgians who are getting almost no benefit from this do not support it. And maybe the people that make 2 million a year and are getting 3,000 say, hey, that's cool. But you know what, when you make 2 million a year, you're probably not that worried about the 3,000. Let's be honest. But it's just a bad bill. It's a finger in the eye of the working class. And it shows what the priorities of the Georgia General Assembly truly are. And honestly, that's for the folks at the top, the elites who don't need this. And for the working class, let's actually stand for hardworking Georgians and vote no on this tax handout for those making 2 million dollars or more annually. Thank you, Mr. President. I yield the well. I recognize the senator from the 19th. Did you have a question there? You won't speak. Do you want me to give you a moment? Get your notes together. Thank you, Mr. President. I have to bring my iPad down here because you have to search through the code to connect all these sections. Appreciate the senator from the 44th and the paper that she laid on each of our desks. Let's walk through that for one second. If you look at it, you would think that the bottom 20% of Georgians earn an average income of 14,000. The bottom 20% of taxpayers rather earn 14,400 or less. However, those numbers are not exactly accurate. What you would find out if you went to the Georgia Code section that's referenced in House Bill 111, you'd see it will refer you to Code Section 48727. That helps you compute your taxable income. What you would see if you look through that on 4777A1B1 is that if you're a married couple filing a joint return, the first $24,000 of income you have, let's exclude. Therefore, the average income of 14,400, why would they be receiving such little amount in this chart? Well, if they're married, their entire income is excluded anyway. Heck, almost all of the second tiers 20% would be excluded as well. If you're single, then the amount of income that's excluded is less. It's $12,000, which would still take out almost all of those in the first 20% column. And it would greatly reduce the income owed by those in the second column. Go over to the third, the big column at the end, the top 1%, actually, if you take, there's a printout that comes annually, it's an annual statistical report that comes from the Department of Revenue. And it tells you that in Georgia, those with an AGI and average gross income of over $1 million, the number of returns that are filed is 14,867 income tax returns. Pales in comparison to the number of returns in almost every other category, those under 1 million. It then tells you though that their total tax liability is $2.1 billion. $2.1 billion of the roughly $16 billion paid is paid by those who make over $1 million. That's 0.03% of the returns in Georgia pay $2 billion of the $16 billion that we raise. And if you live in with that column, be so high, well, it's so high because they're paying 1 eighth of all the state income tax. So let's break that down even further. Of those over 1 million, the total number I told you of returns filed will be 14,867. They pay $2.1 billion in income tax total. That means if all of them are equal and we know that they're not, their average income tax paid would be $141,252 per individual. The average income tax they pay then is more than the first three, four, sorry, more than the first 20% or 80% of the entire taxpayers in Georgia earn. Why would that column be so high because they're carrying the weight of 1 eighth of the entire income tax total? Statistics can be a funny thing. My dad told me there are three types of lies. You've probably heard that once before and you can fill in the other words. But when you take percentages and turn them into real numbers as this graph does, it creates a skew every single time. If we wanted to be more fair about it, we'd say that the average person in Georgia who earns over $100 million in income will their average tax bill in Georgia is $141,252. If we wanted to be fair about it, we'd say $1,252,252.\n\nThat's the way we'd present it. We wouldn't float it as a bar graph where the first 40% of people aren't paying any taxes anyway. Mr. President, thank you for your time and I'm happy to yield the wealth. Senators Eulid, recognize Senators from 36. Thank you Mr. President and colleagues. Come before you in opposition to House Bill 111, I voted against it in committee. And I want to, I know the presenter of the bill today said that we had the largest tax cut in our history and $869 million of taxes that wouldn't be collected was the number that he used. Things are not all hunky door here in Georgia might come as a surprise to some of us, but hard work in Georgia's face challenge upon challenge upon challenge. And we're asked to believe that cutting our revenue is a grand solution for our economy. When you cut revenue, what goes along with it is you cut services. We are failing to fund services at this very moment for citizens across our state who merit support, who work our many three jobs a day, three jobs going to three different jobs every day of the week. And these challenges loom very large for our Georgians, for middle class families, for hard work in Georgia's as we're also fond of saying. But House Bill 111 is just another favor extended to provide the super rich and the corporations and the top brass with tax relief while hard working Georgians continue to scuffle to keep their heads above water. Let's look at the fiscal note. Let's look at corporate income tax by year. The corporations will get a $54.9 million tax cut in 2025. It's up to $110 million tax cut in 2026. $113 million in 2027. $120 million in 2028. All the way out. Let's see. It gets up to $133 million and that's per year. By the time we get to 2030 according to the fiscal note from our state auditor. And yet it's up in the air as to whether we can come up with $2.5 million increase in funding for non-medicated home and community-based services in this budget. That's an open question. We're struggling with whether we can fund that. Those are our seniors. The services that get cut are that are inadequately funded. Health, education, housing, people with disabilities, veterans, seniors, children, as was lifted up by our pastor this morning. Children with Down Syndrome. We have a day this week recognizing that population and embracing the inclusion of that population and the promotion and the success and the bright futures for that population that are people with Down Syndrome that are in families all across the state. But we're not funding it adequately. Those are cheap where you put your dollars and they've said that over and over. That where you put your dollars, what your budget looks like shows what you really care about. You know, a budget is a moral statement. Housing. We are at a housing crisis. But the Georgia housing vouchers for chronically hummus and mentally ill and homeless people. Don't know if we're going to be able to fund that hard to find the money, hard to find the money. But we could give corporate tax break of $55 million with this bill for the first year. The comp waivers for people with intellectual disabilities that need supportive community-based services. Don't know if we're going to be able to put much in for them. Times are kind of tight with our budget. We got to watch every dollar. Pinch every penny. How about the veterans? How about funding our correction system at a robust way that it needs. So it's not a hellhole, which is what it is referred to by those with family members behind those bars and those who work behind those bars. Our state retirees, good people, our state retirees. So we pause a minute and think about the plight of our state retirees. I've seen state retirees who have to use duct tape on their car to hold a fender on because they just don't have the money to put that car in the shop and get it tended to. And it's aged out a long time ago. What would happen to anybody who didn't get a cost of living for 10 to 12 years, the last 10 to 12 years, or got a bonus at the end of the year, 500. And these are people that work their entire lives for the state of Georgia. And we're promised a cost of living, a 3% cost of living. And we can't find the money to fund that, but we can cut the corporate tax and they'll be carrying out $133 million a year. But we can't fund the cost of living for our state retirees. Go home and tell your people that. We have high funding needs. We are in the bottom, bottom, bottom of maternal mortality and infant mortality. These are real live Georgians that die because of underfunding the services that are needed to have healthy mothers and healthy babies. But we can just rejoice that we can put $133 million in the pockets of the corporations. And brag on it and say, take this home and tell everybody what we did. Well, you know, there's another looming, large reality, Medicaid expansion, fill in the coverage gap. But you know what's said about it? It just costs too much. It just costs too much. But we don't mind. We're freehanding. Wouldn't we give a corporate tax cut to the super rich? We're freehanded with that. We don't talk about the cost to the state of that. All of this, all of this, largest, when it comes to the highest income, strata of income folks in our state and the huge corporations. We're glad hand and, but I don't tell you what we put popped up in a bill the other day when we were in committee. It said, we're going to fund and this is laudable. We're going to fund children and come out of foster care to have scholarships. Parents for higher education. But they put a little clause in there. If any information is misstated and the application for this money, it'll be a misdemeanor on these naughty foster kids. A misdemeanor. Folks, we've got it backwards and I'm going to say one more thing and you'll be glad I'm going to miscede them. That's a promise, not an empty promise. I'm going to go get back in my seat. That's right. A clause, a clause from the chairman of rules. But let's think about this just briefly. It's kind of painful to think about. But you know what's going on up in Washington? Laying people off. What was the figure of the other day between 70 and 80,000 veterans? 70 and 80,000 veterans laid off. Shutting down the Department of Education. And stop sending all this money to the states. These greedy states that have been expecting federal money to help us on funding education, moving our state forward. The federal budget plays an integral part. The dollars that come from the feds to the state of Georgia are integral to our budget. And yet we're going to stand here and pass bills that reward corporations and the highest earners, the folks of the highest incomes in this state. We're going to do that when we don't know how the hell we're going to pass a budget, pardon my French, that is sound when they finish doing all that damage that they're going to do up in Washington. That they're doing right now as we speak here. And don't close your eyes to it, it is the reality. So the special session will be in, is a special session, figuring out what to do about the holes in our budget from what's being cut in Washington right now. So this I think is the worst time in the world to propose a bill like this when they got a dumpster fire going over in Washington. Lay it off people by drugs, CDC, people we know all across our state being put out of a job. And we are proud that we are going to cut $869 million out of our state revenues. Come on, come on. You know better and we'll all live with the reality, the bitter reality that is ahead. Thank you. I'll be right back. Bring it on, Senator, from the second. Thank you, Mr. President. My colleague, the Senator from the 19 came with his iPad. I figured I'd come with mine and I would have my notes so that I could refer back to them as we talk about HB 111. Now like many of you, everybody's got constituents that don't have enough. And I remember, Ms. President, talking to my mother and grandmother when I was a little boy growing up, I didn't know what poverty looked like, but I would hear my mother say she was robbing Peter to pay Paul as she hoped that John didn't ask for his money back. And on HB 111, that's exactly what's going to happen. Folks are going to be robbing Peter to pay Paul to hope John didn't ask for his money back. Because in HB 111, it proposes a gradual reduction of the income tax rate over several years for low income folks, for poor folks, for average everyday working folks, for paycheck to pay check people, the immediate tax burden remains unchanged for those folks. So many individuals who live in poverty may not see the relief of the gradual decrease because they're living paycheck to paycheck. And I don't know if you've ever heard of it, but my grandmother's always tell me that you can't get blood out of a turn up. And sometimes you may try to make those ends meet, but if you don't have enough, you just don't have enough. And that's what it is. This bit I'm talking about any increases in tax credits or low income earned income tax credits for low income earners because we see happening at the federal level folks don't have enough money just to even pay for childcare. And so poor folks told that you getting all these credits and you are to pull yourself up by your bootstraps. Well, Mr. President, I just challenged my colleagues what happens if you don't have a pair of boots? That's the opportunity for folks who are struggling if the benefit is topsy-turvy. So this delays the rate deduction. Why does it delay the proposed mechanism delays, the rate reductions based on state revenue conditions that may have some uncertainty? And so while it sounds good, everything starts off sounding good until you get down to the brass tax of the bill where it says, but in case things honest, though they may seem here's some mechanisms where the rates won't be triggered. If the governor's revenue estimate doesn't increase by 3%, or if it doesn't have this. And so we know that we have a potential for a new governor coming in. So we'll hamstring that governor with revenue estimates. Don't know who it might be. It could be somebody in this chamber. But if the economic conditions support the time the reduction, the reductions could be postponed and definitely leaving poor folks without the relief that was promised and anticipated. That's how we do things in a general assembly. It's never as directed as we want to see. We want to add some additional conditions to it. But colleagues, what about the folks that we brought here to do business in our state that we put up the money to move the dirt, to get them ready to bill, and guess what? They told us, oh, we're not going to bill now. We're going to take those jobs. We won't do it now. But when will you do it? I don't know. We'll get to it when we can. There's no clawback. We can't get our money back. We can't get our investment back. But we're telling folks that don't have enough living paycheck to paycheck. You know what? That rate decrease for the same corporate entities is going to be good because the corporate tax rate will be tied to this tax rate. So we can also give them handouts and economic development. But then they don't have to bill what they said they're going to bill. But for poor folks, we got thoughts and prayers. We don't know how the tax cuts in this bill will be applied at the expense of folks serving in public service. We don't know how the next administration will want to cut DCA, public health, many of the things that poor folks rely on, education, health care, social services. But guess what? We've been addressed those issues. We've come up with a plan that's going to exacerbate them. And so we can do a lot of things in this chamber, colleagues. But what we could do is be serious about what we said. And I don't care how you slice it or how you dice it. And some may say, well, I don't agree with anything that he said. I'm not saying it's lying, but I don't want to believe that he's saying the truth. But I also know that in this room, colleagues, we sometimes don't want to tell it like it is and be straight up and down about it. Because if we were serious about it, we wouldn't have to delay it. You got a $14 billion surplus. You could do it right now if we were serious about it. That's all this is. It's a smoke in mirrors, just to say we tried to do something. So I don't know if y'all play a game called Spades, but it's a car game. And I learned how to play this game. And I watched my uncles and the object is to set your opponent. And you try to bend your hands, see what your opponent bids. And then you might go up a little bit, but the object is to set your opponent. And I just want you to know, we shouldn't be setting the citizens in the state of Georgia with how we're bidding on this budget. Because when we have the budget, we have a magical surplus. Yeah, after a year, then we say we're going lower the income tax rate. But then I look at what we're doing in economic development. We always got money for a company's looking to calm and do business in this state. But then they don't hold up their end of the deal, but they got the corporate tax cut. They got the investment. When do we get our money back? But if I'm talking about working for poor folks in this state trying to help some of the folks that are in my district who need opportunity, I don't know, we have no money for a child. Okay, we have no money for this. We have thoughts in prayers. Well, I'm going to tell you like Fanny, Lou Hamster, sometimes folks are getting sick and tired of being sick and tired. And rent a sky high. We have no other avenue to fund affordable housing in this state. Those are coming in, buying it up, left and right. Folks can't even afford to find a place to live. So what happens when we lower the rate so much, folks don't have enough money to do it? Well, you could raise the minimum wage in this state and move it from 5, 15 to actually something that folks could actually use. But we don't want to do that. We could pay our state law enforcement agencies a little bit more money than we pay on them because every other state paying more money than us. We don't do that. But we're going lower the tax rate. That's good enough. So we're making pennies on a dollar. They ain't going to see no tax decrease. You got to have enough money to know that you're going to get a rebate or you're going to see some significant. And I promise you that folks make $30,000. That $10 they don't get. They don't even know that that $10 is there because the problem is something else is new coming out that they have to pay for. So all I'm trying to say colleagues, folks who are already disproportionately affected by the increases in necessities, a decrease doesn't mean meaningful relief. This is nothing more than conjecture because you just set the next administration to have to deal with the effects of this bill. That's all it is. And so if you want to leave to say, oh, we did this great amazing thing. Look at how we cut taxes and how we did this at the same time. We talked about opportunities to raise revenue and we have been able to do that and figure that out. But we always find a way to do one thing and say another. So I'm as president as I get ready to close. This bill aims to reduce some income tax rates. But the structure in my opinion doesn't really help poor folks, poor individuals, poor families, the gradual nature of this reduction lacks what I would consider to be the immediate benefits that folks are looking for, the immediate relief because we're relying on state revenue conditions. And if things go crazy in Washington, I don't know what we're going to do. We can't throw the baby out with the bath water. And so while we have to prepare for the worst, I think that's where our state should be making plans and preparations because I heard that FEMA might be canceled. And I live down I-16 and on the coast and we've had two hurricanes back to back. We've also had historic flooding. So what do you do when there's going to be no federal help? No federal government helps to come down and help you with the storms. The state should handle that. What do you do? What do you do as a Department of Education's cashier and you living in urban or rural community and you rely on Title I money? What do you do? But guess what? We're going to gamble with it. But then I got some colleagues who say they don't like the gamble. But you're gambling on it with this bill. So these potential cuts to essential services, again, leave the folks in my district and lower income communities without any immediate relief. We haven't done anything to help them lower their light bills, their water bills, their gas bills, their internet bills, their rent bill. We haven't helped them do anything. We haven't even helped them lower the cost of childcare. So what really have we done? And if we were serious about it, we would have passed the bill that wouldn't make businesses pre-pay sales tax. If we were serious about it, I'd rather trust the businesses of my district and invest that money than park it with the state so that you can set the revenue estimate because you already got the money anyway. Yet again, we do one thing and say another. So Mr. President, I'd be a no on this bill today because it doesn't help working folks, it doesn't help poor folks, it only helps the folks that already got enough. And I don't know if you've ever had to rob Peter to pay Paul and hope that John doesn't ask for his money back. But I know my constituents do and I've been there before myself. And Mr. President, I've had bills on the auto-draft for Olympics at one point in time in my life where I didn't know how things would finally get paid. And we still got citizens doing the same thing right now. So I would just ask your colleagues to vote no until you come up with something meaningful. If folks can grab something tangible, don't make it all hypothetical. Do something that's worth something. And with that, Mr. President, I yield a will. Senator Gilded, bring it on to the center from 37. Mr. President, this presentation, Jim, is sitting and I rise today on how to bill 111. Because I want to challenge something that was said today. I don't know if the working folks that we care about are listening to this debate here at 2.20 in the afternoon because they're out working. But I'll tell you for those who are dialed in and they're caring about this usually, the challenge. I want to call out something that was said earlier from one of our colleagues, the class warfare. It was a vote here. That class warfare is nonsense. When you look at this chart shared by the center from the 44th, you look at these people who are supposed top 1% and top 1% to loaded language folks like to talk about in our politics. But you know those taxpayers are. Those taxpayers disproportionately are LLCs and S corporations who file taxes as individuals. These are just high net worth individuals. These are companies LLCs or S corporations who file as a pastoral organization and they are taxed as an individual. There aren't that many people at this level as individuals. The large proportion of these entities are small businesses that employ 20, 30, 40 people in our communities. And those businesses do care about a tax cut. What's proposed in HB111 is not nonsense. It's a 3.7% cut in our income tax. Now a 3.7% cut in our state income tax is not that much. But what it is, it's part of the wise step by step approach. This general assembly is taken to step down income taxes to make our state competitive. Mr. President, a 3.7% cut in our state income tax matters to small businesses. You take a small business that employs 40 or 50 people. You cut $3,000 in the state income tax that they have due to the state. That's kept in their pocket. What does that pay for? That's not a pittance. $3,000 is what it costs for high-speed internet for a company to maintain internet and their headquarters. If they're a heavy equipment company that sends out great equipment or they've got technicians that spend time in the field, $3,000 a year pays for their internet. This is real. These are real dollars. Not only is it real. Not only are these quote high net worth individuals not largely individuals but small businesses. These are meaningful cuts, Mr. President. I won't belabor the point. But in a state that has a $14 billion surplus, a state that's provided progressive, thoughtful step by step tax cuts as we have. In a state that's given a record pay raises to teachers and law enforcement. This is a picture of the wisdom that you see in Georgia. You've got high-tax states like California that have record debt. They cannot tax enough to fund their spending problems. This, Mr. President, is an example of the steady step by step approach. We're not listening to folks that want to slash the income tax in one year. But we're working on it. A 3.7% cut in this bill is a wise, thoughtful step. And you better believe it matters to small businesses with 30 or 40 people who file their income taxes individuals. And with that, Mr. President, this class warfare, the minority party is trying to invoke is deceptive. If you're watching this, these quote unquote high tax payers are largely not exclusively spent largely small businesses who file taxes individuals and they can use the tax relief this bill gives them. And with that, Mr. President, everybody in this chamber should be proud of this steady step by step approach to ease and tax burdens while managing our budgets and managing our state treasury well. With that, Mr. President, yield the vote. Senator from the 20th year, you had a question, I guess. Rick and I, Senator Fonda. Thank you, Mr. President. I asked for unanimous consent. Please excuse the Senator from the 18th. Five, Jackson. Senator from the 18th. Excuse. Floor is yours. Senator from the 14th. Thank you, Mr. President. It is hard to see into the future. None of us own a crystal ball. But I can tell you that I have been blessed only in this one narrow moment. Normally, I'm caught in the fog like a saw. But in this one moment, I had this spark of clarity about the future of the Republican Party. And what I saw, I saw, Senator, that the arc of the Republican Party is long, but it bends toward the Senator from the 53rd. And let me explain what I mean by that. The Senator from the 53rd has mentioned before that we were colleagues in the House and used to, more or less, shoot spitballs from the back of the bus proverbially, being rebellious, voting no on a lot of bills that House leadership wanted. And we have seen over the years that House leadership's opposition to certain bills has, let's say, softened. As the arc of the Republican Party has bent toward the county parties in northwest Georgia, House leadership has seen fit to pass bills like constitutional carry and, you know, jack up penalties on people who would dare want reasonable guns since legislation, you name it. But here's why I bring up the arc of the Republican Party today, because the arc of the Republican Party on income tax issues and taxation generally bends toward the destruction of government altogether. There is a reason why we have 55 to one votes in this chamber with some regularity, because one of y'all has already figured out where this play is going to end, where this train is headed, the terminal station, and that station is the abolition of government. Now, people who are libertarian and say they want to reduce the size of government, they use words like bathtub, they might say, all while the only legitimate purpose is to protect private property or blah, blah, blah, they list off a couple of Adam Smith statements from a book. But let's be very clear. Reducing the income tax today is not how you're going to put it in your mail. Many of you are already saying on the record we should be eliminating the state income tax. Some very powerful people in this room have committed to try to do that. So the drop of point 1.2, whatever percent is really not the game, it is not some sort of fiscally conservative, calibrated calculation to try to arrive at a reasonable equilibrium point. We have not done a sophisticated cost benefit analysis to assess the mood of the Ted Turner's...\n\nthe world to decide will they domicile in Georgia, will they domicile in a place like Florida? That is not the careful consideration that has led us to tick down the rate today. No, I invite you to join me in this spark of vision and inspiration, to see beyond the fog into the future of your party and recognize that the only thing more annoying to you in the next four years than having one center from the 53rd who you kick out of the caucus is, whoop, number two, or maybe number three or four. And all of a sudden the folks who are moderate and steady-handed who lead the establishment Republican party to great success on top reform and a variety of other issues, now suddenly their ranks are dwindling and the number of chairmanship's going to different corners of the state starts to increase and will all of a sudden wear a much less stable party establishment than we used to be. So no, this has nothing to do with point one's and point two's. Point one's and point two's are harmless and marginal. Mr. President, it is hard for us to look into the future. But I ask that each of you think about how this vote relates to your voters, fundamental distrust in government, fundamental lack of belief that government does anything for citizens, and I invoke the image just a few short days ago of Fox News on TV in one room while a benefits manual sits on a kitchen table in an adjacent room. And you're all too happy to ignore that cognitive dissonance today because I would dare say some of you lack faith in your own voter's ability to connect the dots that decrease in government revenue, decreases services. We are counting on voters not to think about that and we're thinking, well, they'll just see that we're cutting taxes and boy, that's easy to say, and it's popular. And many of you will retire before the rubber meets the road and government gets to the size that the Senator from the 53rd wants it to be. But let's just keep smiling and ordering snacks and drinks on the train that leads to Northwest Georgia. Thank you, Mr. President. I'll yield for any questions. Yeah, no questions, Senator. Thank you, Mr. President. I yield the will. I'm going to ask Senator from the 52 seconds, excuse me. Thank you, Mr. President. As the Senate sponsor of this income tax bill originally, a few years ago, I wanted to address the history of it a little bit and I will be brief. But at that time, the standard deduction per family was $7,100. Now it's $24,000 taking care of the people at the bottom. The child exemption went up to $4,000, taking care of the people at the bottom. The $500 credit you're going to see, that means that as this now, a family of four making $32,000 pays no state income taxes in Georgia. For the next 10,000 of income up to $42,000, you're going to hear a bill that will wipe that out with a $500 credit. So basically, you're in the $40,000 or not paying any taxes in Georgia. Then you put some childcare credits in there for those two children. And you're more up to $55,000, $60,000 in this state that you pay zero income taxes on. So the point is you can pick out some people and say, this year they're getting more in tax reduction because they pay a lot more in taxes. But this was front loaded for the low income people when this was started and took care of them first. The structure of it got them from not too many years ago, $8,000,000 your paying state income tax is to wear now this year, that family of four will be anywhere from $45,000 to $60,000 that they're paying no state income tax with what we've done here. So I think we've worked hard to increase raises to make sure we've got an emergency fund balance. And yes, we've got some tax cuts in there. But again, the structure of this multi-year bill was first taking care of those people at the low income level. And Mr. President, I yield well. Does any of the Senator wish to speak for against the measure? Chair, I reckon that's Senator for the 14th. Thank you, Mr. President. Motion to table the bill. All right. Senator from the 14th has made a motion to table. That's what I figured. Objection from the Senator and the Feature Purse. All those in favor of the motion will vote yay, all opposed nay, Secretary and the motion table. The years of 21 and the nays are 30. And that was a pretty good move, Senator. You all those got them. Senator from the 50s, you ready to close debate? Thank you, Mr. President. I'm reminded of a Ronald Reagan quote that says, if you're explaining you're losing, I'm assuming that a lot of those that got up here and explained today are probably going to vote no, and they've got to take that back to their constituents and explain why. But if you look at the state of our economy in Georgia and you compare it to what we've seen in Washington, if you look at what we're doing in Georgia, lowering taxes and lowering spending compared to what they're doing in Washington, I want to be on this side. I want to support this bill and I'm going to just address a couple things. Number one, I heard that this is only for the largest companies in the super rich. Well, this legislation reduces taxes for all businesses. Georgia has 1.2 million small businesses which makes up 99.7% of all businesses in this state. Number two, I heard that this will not help individuals. This will only help the largest corporations. Well, in FY 2025, we collected $16 billion from individual taxpayers. We only collected $3.6 billion in corporate tax. So this is going to help individual taxpayers way more than it's going to help the corporate tax. I heard that this will only impact the top earners. And I want to thank my colleague from the 50 second that's clearly stated with this, with the rebates that we're doing and with the rebates we're about to pass hopefully, with the center from the 49th bill. You won't pay a dime in state income tax unless you make over $40,000 a year. But I want to make something clear. 100% of the overall tax savings go to 100% of tax payers. An individual with $100,000 salary pays more taxes than an individual who makes $50,000. But a 20 basis point reduction will reduce the tax percentage of each individual equally. So a reduction in taxes helps everyone, period. It also spurs further job creation, which helps those very people who some of my colleagues have highlighted today. That's a good thing. It's important that we continue to budget conservatively so that we can continue to provide opportunities like this tax cut, like the rebate that we're going to vote on here very soon. But we need to provide these for Georgians as well as uphold our fiscal responsibility of managing Georgia tax payers. And that's what we're doing. If you look at the proposed budget, it's $3 billion less than the amended budget that we just passed. And this right here will put $869 million back into the citizens of Georgia's pocket. So Mr. President, I don't know what your politics are like back home, but I know mine, and this is a good bill. And I want to thank the governor for his leadership not just for this, but what he's done over the last few years to continue to lower this. I'd love to see when we could get to 0% and we're on our way with this without Mr. President. I'll yield the well. Is there objection to agreeing to the report committee, which is favor to the past of the bill? Chair here is none. Board of committee is agreed to is the objection to the main question being ordered. Chair here is none. Main question is ordered. Questions on the passes of the bill. All those in favor of the bill. Yeah, all opposed. Now Secretary, I'm not in the machine. Senator from the third vote, purpose, your eyes. Senator, parliamentarian choir. Mr. State, you're inquiring. And in true, I welcome my Republican colleagues on the train to Northwest Georgia so we can celebrate the Liberty, the Senator from the 14th likes to brag about. Senator is proud of where he's from. On the pages of the bill, the a's are 30 and the days are 23. This bill hammered the directs at constitutional majority is there for a pass. Senator from the 46, what purpose your eyes. No, bring it down. Move to reconsider, please, Mr. President. Senator from the 46, he's approached real quick. Automation. I would draw motion. I appreciate that. Moving on, Secretary read HB112. House Bill 112 by Representative McDonnell, the 26th and others, the bill to internal act to amend chapter 7 title 40. The Fishercode of Georgia annotated with to income tax is specified for a one time tax credit for individual taxpayers who filed income tax returns for the 2023 and 2024 taxable years. Shrider for definitions, rider for later matters, shrider for an effective date to repeal conflicting laws and for other purposes. Mr. President, the Senate Committee on Finance recommends that this bill do pass. There's roughly some minutes in our half-stitler chairman. Mr. President, fiscal note has been attached and that completes the order. restoration do. Thank you, Mr. President. I'm going to show you a little bit simpler than all three of those. I've read it several times. I've tried to memorize the talking points. It's a short three-pager with 60-some odd lines. On its face, HB112 is probably the simplest bill we passed all year. Or I've carried all year. I would, however, consider it the most serious bill I've brought to you. What it does simply gives folks in your district who have worked hard, pay their taxes a rebate of $250 for individual filers, $375 for heads of household, or $500 for those married and filing jointly. In alto, Georgia, these credits go a long way with basic necessities. This isn't a new concept. I applaud you guys for passing the HB 1302 in 2022 session. HB112 will put approximately $1.2 billion back into the hands of the folks who need it most. I appreciate Governor Kent's commitment to fiscal responsibility, and I would appreciate your favorable support. Again, let me remind you to put your finger on the green button. Not your finger in the face of those hardworking Georgians who've worked hard for this money and paid their taxes. Mr. President, I yield the will. Senator, is yielded? Does any other Senator wish to speak for against measure? Chair, here's none. Senator, from the 14th, what privacy rise? You want to speak? Go ahead. It's a lower George. Thank you, Mr. President. From both the Democratic and Republican seats on the train that heads to Northwest Georgia, the part of the trip that we're going through, you can see out the window, and you can see that people do need a lot of help right now. You will see that some of your colleagues will vote against a permanent reduction in the income tax rate, a deconstruction of the income tax in Georgia. We will be voting against that, but some of us will be voting for immediate tax relief. Because look, $250, $300 matters a lot, and it matters more than $30. Voters know that, and look, I wouldn't choose to send the money back that way. If I were the Governor, I would do everything that Senator from the 36 said and make our state government stronger. But if there is a bill to send some of that money back, some of us will send that money back for immediate tax relief. But we do not need to be making structural changes that cripple our ability to respond to social ills for the rest of time. So, want to put that on the record. Thank you for the opportunity, Mr. President. Senator Gia, does he have the Senate which speak for against measure? Chair, is there objection to previous question being ordered? Chair, is there any previous question is ordered? Is there objection to agreeing to the Board of Committee which is favourable to the past of the bill? Chair, is there any previous committee agreed to? Is there objection to the main question being ordered? Chair, is there any questions or ordered questions on the past of the bill? All in favour say, yeah. Vote, yeah, all opposed, no, Secretary, unlawed them, sheen. Thank you. I want the passes of the bill. Please are 52 in the nays, are 0 this bill having received, registered constitutional majority is therefore passed. Section agreed, HB 161. House bill 161 by Representative Crow, the 118th and others, the bill to mean 10, an act to amend Article 1 of Chapter 3, Title 35, the OCGA, will lead to journal provisions relative to the Georgia Bureau investigation to write authority to speak as a Lertronic communication records and for other purposes, Mr. President, the Senate Committee on Judiciary recommends the bill to be passed by substitute respect the submitted Senate Restriction Chamber. Mr. President, the Senate Committee on Judiciary offers to the lawyer, the Office of The Lawing and Substitute, the House bill 161, built to mean 10 and an act to amend Article 138, Title 35, the OCGA, will lead to General Provisions. to the Georgia Bureau of Investigation to write for authority to issue spinets electronic communication records and for other purposes, Mr. President, that completes the order. We're going to ask Senator from CityPoor. Thank you, Mr. President and colleagues. House Bill 161 is an agency bill for the Georgia Bureau of Investigation. Throughout 2023 and 24, and now 25, the GBI has conducted multiple investigations into swatting and other cyber-enabled events. In fact, several of us in this chamber right now, the Senate from the 45th, the 32nd, the 41st, myself, as well as the President's body are just some of the many who have been swatted by nefarious actors. In this new bill, we're going to enhance the GBI's ability to go after these bad actors. Currently they can use administrative subpoenas to successfully combat other types of cyber-enabled crimes, including crimes against children and disturbing sexual exploitation. This simply just expands that for domestic terrorism. The bill is rather straightforward. It will help us to go after these bad actors to make sure we can do that and put them behind bars where they belong. It does not expand the GBI's authority or original jurisdiction, just simply gives them extra tools to go after those committing these defarious acts. After our questions, I will yield the well and ask for your favorable consideration. Thank you, Mr. President. Does any other Senator which speak for against the measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Questions on the adoption of the Committee's substitute? Is there an objection to the adoption of the Committee's substitute? Hearing none of the Committee's substitute is adopted. Is there objection to agreeing to the Board of the Committee, which is favor to the past of the bill? Chair, here's none. The Board of the Committee's agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the past of the bill? By substitute, all those in favor vote. Yeah, all opposed. No, he's sitting on the machine. All in the past, the bill, the yeas are 48 and the nays are four. This bill haven't received a rickston constitutional majority. Is therefore passed by substitute. Six A.R. House Bill 406. House Bill 406 by Representative Lever of the 123rd, Bill Tumintet and Actio Manch, Chapter 23, Title 47, the official go to Georgia and Ante, related to the Georgia Judicial Retirement System to increase the retirement age of the Superior Court Judges for a staking office on or after July 1, 2026, to write an effective date to provide for later matters to repeal the flaking laws and for other purposes. Mr. President, the Senate Committee on Judiciary recommends that this bill do pass, or effectively submitted, Senator Strickland Chairman, that completes the order, Mr. President. I recognize the Senator from 50s. The superstar athlete from Habershan County, they could name show up for the kickball game yesterday. Let us down. You let us down. I didn't know you needed me, Mr. President. I thought with you there, we could have carried the day, but I'll be there next year. I rise today to bring you House Bill 406. Some of you may remember last year we had a long discussion and several bills went back and forth between us and the House about judicial compensation and pay. We've got three bills right now that have passed the House that will be debating this is number one. What this bill does is it's going to raise the age that a Superior Court judge can retire from 60 to 65. It brings it in parity with the appellate judges. That's pretty much all it does and I'm happy to answer any questions. Thank you, Mr. President. I yield the bill. Is there any other Senator? We speak for against the bill. Chair, here's none. Is there objection, previous question being ordered? Chair, here's none, previous question is ordered. Is there objection to agree, and so the Board of Committee, which is favorable to the passes of the bill? Chair, here's none, the Board of Committee is agreed to. Is there objection to the main question being ordered? Chair, here's none. The main question is ordered. Questions on passes of the bill, all those in favor vote. Yeah, all opposed, nay. Secretary, I'm not in the machine. You have to be in the machine. All the passes of the bill, the age are 53, the age are zero. This bill haven't seen Ricks. It concedes the majority. Is there four pass? Secretary Reed, House Bill 423. House Bill 423 by Representative Wade and the Ninth and others. The remains have an act to amend Article 12, Chapter 3, Title 38, and Part 4 of Article 2, Chapter 5, Title 46, the official code of Georgia annotated, with the emergency communications authority and emergency telephone number 911 system, respectively. So that's a variety for next-generation 911 systems and services. So that's a variety for definition, it's a variety for the duties and responsibilities of the Georgia Emergency Communications Authority, as relevant to next-generation 911 systems and services to add members to the Board of Directors of such authority to acquire all new 911 systems, conform to wireless enhanced 911 service or NG 911 service standards to revise the role of the executive director of the authority to run for later matters for repeal of the working laws and for other purposes. Mr. President, the Senate Committee on Public Safety recommends that this bill do pass respectfully submitted, Senator Albers-Chairman. That completes the order, Mr. President. We're going to ask Senator for a third of the poll.\n\nThank you, Mr. President and colleagues. I come before you again for House Bill 423 discussing next generation 911. Next gen 911 is going to be critical for our first responders. If you think about the four legs of the stool, we have police, fire, EMS and 911. Our current E9111 system is woefully out of date. The technology behind it is lagging behind, as well as the connectivity on phone lines is literally going away from our legacy telephone companies. Moving this to next generation, as most other states have already done, will allow us to significantly upgrade the availability of 911 operations, the ability in order to have business continuity between multiple 911 centers and really bring us into the 21st century. The bill is very straightforward. It establishes next gen 911 code. It adds two appointments to the current board that already exists. One who is a member of the Georgia Technology Authority, who is a matter expert on cybersecurity, as well as another member who is a subject matter expert in GIS, which is geographical information systems. These are critical appointments and setting the foundation up for what will be the future. This does not mandate anyone in the state adhere to this, but a laser foundation so each one of those local municipalities can join this network. Again, we are woefully behind other areas. The country, this is a chance for us to catch up and will ultimately save people's lives. If there are no questions, I will yield the well. Thank you. Does any other senator wish to speak for against the measure? Chair, here's on. Is there objections to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there objection to agreeing to the 40 committee? Chair, here's none. All those in favor vote, yay, all opposed, nay. Secretary, on the machine. On the passage of the bill, the A's are 53. Nays are zero. This bill, hammered, seed, rex, constitution, majority, is there for pass? Secretary, in house bill 584. House bill 584, by representative P3, the 166 and others, bill 209 to amend, Title 2631 and 37, the OCA will do food drugs and cosmetics health and mental health respectively, so as to reassign licensing and oversight, I have drug abuse treatment and education programs, narcotic treatment programs, community living arrangements, and adult residential mental health programs for the Department of Community Health and the Department of Behavioral Health and Developmental Disabilities to arrive for a related matter, spread for an effective date to appeal to the King of Laws and for other purposes. Mr. President, the Senate command, Health and Human Services recommends that this bill do pass by committee, substitute respectfully submitted, Senator Watson, Chairman. Mr. President, the Senate command and Health and Human Services offers to following substitute to House bill 584, Bill Tumin, Title 9, Title 2631 and 37, the official code of Georgia annotated will do food drugs and cosmetics health and mental health respectively, so as to reassign licensing and oversight of drug abuse treatment and education programs and for other purposes, Mr. President, that completes the order. I love the Senator again. Habersham? Proud of Habersham County? It must be a Habersham County Day or something. All right, come on up here, Senator. We want to hear you one more time. Thank you, Mr. President. I rise to bring you House Bill 584. This bill is two department bills, actually it's the Department of Community Health and the Department of Behavioral Health and Developmental Disabilities. What this does is it reassigns licensing and oversight of drug abuse treatment and educational programs, narcotic treatment programs, community living arrangements, and adult residential mental health programs from the Department of Community Health to the Department of Behavioral Health and Developmental Disabilities. Essentially, the way that it functions now is these would have to report to the Department of Community Health and get referred to the Department of Behavioral Health and Developmental Disabilities. This cuts out the middle man, streamlines government, makes us more efficient, and with that, Mr. President, I'm happy to yield for any questions or just ask for your favorable consideration. Senator from 19th, you have a question. You have no question, Senator. Thank you, Mr. President. I yield the will. Does any of the Senator wish to speak for against the measure? Is there objections to the previous question being ordered? Chair, here's none. Questions only adopted in the Community Sub-Sute? Is there objection to the adoption of the Community Sub-Sute? Hearing none, the Community Sub-Sute is adopted. Is there objection to agreeing to the report of the committee, which is favorable to the passes of the bill? Chair, here's none. The report of the committee is agreed to. Is there objections to the main question being ordered? Chair has done the main question. Is ordered. Questions on the passes of the bill by substitute? All those in favor vote? Yeah, I'll pose, nay, secretary, and lot of motion. On the passes of the bill, the yays are 52 in the nays are zero. This bill is not the time to receive the requisite constitution. The bill is there for pass. Secretary, 614. House bill 614, by the represent of Jones, the 47th, and others, bill is being said to amend, co-section 25-10-2. The fiscal year of Georgia annotated, will it to prohibited fireworks, activities, and application of noise ordinances, thus to authorize local governments to prohibit the use of the recognition of consumer fireworks and proximity to certain facilities, housing equires, to arrive for a special event permits, to arrive for definitions, to arrive for later matters, to be able to look at laws and for other purposes. Mr. President, the Senate Committee on State and the local government operations general recommends that this bill do pass by substitute, respectfully submit its Senate, Dixon Chairman. Mr. President, the Senate Committee on State and the local government operations general offers to allow in substitute to House bill 614, the bill is being telling nine to amend, co-section 25-10-2, the fiscal year of Georgia annotated, will it to prohibit the fireworks, activities, and application of noise ordinances, and for other purposes. Mr. President, I can please the order. I recognize Senator in the 21st. P. L. B. Thank you, Mr. President. Senators, I bring before YhB614. I want to give you a little background of why we want to do this. Horse farms are particularly being negatively affected by suburban and economic encroachment. The loud, sudden noise near horse farms are dangerous to the people that own and ride horses into the horses themselves. There's also a fire threat for fireworks since many horses are housed in wooden barns with bails of hay. So what this simply does, it allows a city or county to adopt a local ordinance to prohibit fireworks up to 200 yards of a facility housing equines in a confined area. There are 17 other property uses that have distance restrictions for fireworks, including gas stations, parks, water treatment facilities, nursing homes, jails, and public properties. This just adds one more to the list. But furthermore, this is the only property used that requires the passage of a local ordinance before it can take effect. It will not affect most of Georgia. It's really just for like an area like my district, Milton. So this one way, small way to support and protect this important area of agriculture, the equine industry. I ask for your favorable consideration. Mr. President, there's no questions. I yield the well. You do have one question, Senator. I can send it for the 29. Senator you. Yes. Senator, is this a plot of all horses or just race horses? No, this is for the horse country that I live in Milton. And I know that the senator from the six that he's got some equine farms in his area that in these fireworks, you know, really scare these horses and are a problem. So we want to get this taken care of. You've changed my mind, Senator. Thank you. Thank you. I yield the well, Mr. President. Does any of the senator wish to speak for against the measure? Is there objections to previous question being ordered? Chair, here's the previous question is ordered. Question is only adoption of the committee. Substitute is there objection to the adoption of the committee? Substitute. Here you done. It can be substitute is adopted. Is there objections to the main question being ordered? Chair, here's none. Main question is ordered. All those in favor of the bill will vote. Yeah, I'll pose. Nice. Thanks, Chair. And a lot of machines. On the pass of the bill, the A's are 15. The A's are one. This bill haven't received the requisite constitution majority. Is therefore passed by substitute. Secretary H. R 42 House resolution 42 by Representative Gamble of 15th and others resolution ratifying Governor Brank P. Camp's executive order numbers 10-1-2-10-8-24-1 and 10-15-24-1. Is this pending the collection of motor fuel and diesel fuel taxes and for other purposes? Mr. President, this thank you, the committee, and finance recommends that this resolution do pass for just five minutes in a half-stateler chairman. That can be seen under the bill. Mr. President. Brand-in is served from 49. Thank you, Mr. President. I bring before you H. R 42 on behalf of Governor Camp to ratify the Governor's temporary suspension of collection of motor fuel and diesel fuel taxes in response to the three executive orders in October of 2024 declaring a state of emergency for Hurricane Helene. The suspension occurred from when the General Assembly was not in session, so we must pass this resolution to ratify his executive order. It saved George's $92 million, just like previous resolutions. This one simply ratifies his suspension. During that time, he was in consultation with General Assembly's leadership along with Lieutenant Governor and Speaker of the House and collective efforts to conservatively manage our state's budget. And it's allowed us the opportunity to help lessen the burden of a horrific natural disaster. I would ask for your favorable support of H. R 42. I yield the well, Mr. President. Senator from the board that you didn't know. Okay. Seniors yielded. Does any of the Seniors wish to speak before against the measure? Chair here's none. Is there objections to the briefs question to be in order? Chair here's none. Previous questions is ordered. Is there objection to agreeing to the report committee, which is favorable to the past of the bill? Is there objection to any question being ordered? Chair here's none. Any questions? The order, the question is only the domes of the resolution. All those who pay the resolution will vote yay. Pay us knee. Secretary Long the machine. The resolution. All in the adoption resolution. The yays are 53 and the nays are 1. The resolution having received the requisite constitutional responsibilities therefore adopted. The motion is adopted. Reganise, Senator from the 18th. Thank you, Mr. President. Presented to a Senate rule. I don't want to say a senator. I'm sorry. I jumped ahead of you. The following message was received from the House to Mr. Riley. The clerk thereof, Mr. President, the House is passed by substitute by the requisite constitutional majority. The following bill, the Senate Senate bill 68 by Senator Kennedy the 18th and others, the bill between Title 9 and 9, Title 9, 1340 and 51. I should go to Georgia annotated. I will do civil practice, contracts, motor vehicles and tours respectively. So I suggest to write for sub-and-sive and confidential revision and further purposes. Mr. President, I completely order. Now, pro-tam, I recognize pro-tam for a motion. Thank you, Mr. President. Presented to a Senate rule 7-1.10b, Zimbravo. I will, I give notice that on the next legislative day, I intend to move that the Senate consider House action on Senate bill 68. Secretary Reed. Senate bill 68 by Senator Kennedy the 18th and others, the bill is being 10 and 9 to men, Title 9, 1340 and 51. I should go to Georgia annotated. I will let you civil practice, contracts, motor vehicles and tours respectively. So I suggest to write for sub-and-sive and confidential revision and provisions regarding civil practice, evidentiary matters, damages and liability and toward actions. So I for limitations, I will go to the dependent suffering testimony to write for timing, evansors and discovery to write for dismissals of civil actions to write for definitions, write for a later matter, write for an effective date and applicability to a book on blifking laws and further purposes. Mr. President, I completely order. Thank you, Senator for the. We're going to send it from the 52nd. Thank you, Mr. President. Pursuant to Senate rule 7-1-10b. I give notice on the next legislative day, I intend to move that the Senate consider House action on Senate bill 77. Secretary Reed can't you. Senate bill 77 by Senator Hustler of the 52nd and others, the bill is being 10 and 9 to divide a home set exemption from city of cars, full independent school district, out of the volume taxes for educational purposes, an amount equal to the amount of which the current year assessed value of a home set exceeds the adjusted base year assessed value of such homestead to write for definitions, however, terms and conditions of the exemption and for other purposes. Mr. President, I please do order. I believe you need to make a second motion. Thank you, Mr. President. Pursuant to Senate rule 7-1-10b. I give notice on the next legislative day, I intend to move that the Senate consider House action on Senate bill 83. Secretary Reed can't you. Senate bill 83 by Senator Hustler of the 52nd and others, the bill is being 10 and 9 to divide a home set exemption from our city of cars, full independent school district, out of the volume taxes for educational purposes, an amount equal to the amount by which the current year assessed value of a home set exceeds the adjusted base year assessed value of such homestead to write for definitions, to specify the terms and conditions of the exemption and for other purposes. Mr. President, I please do order. Senator from 26, you want to be recognized? Parliamentary Chair-Chair, I must say. State inquiring. A few minutes ago, the son to back here said he was giving notice according to the rules, I would assume to bring up a bill. Am I correct? Yes, Senator. I had a few minutes ago, the son to say that he was going to bring up another bill and put it on the general calendar, which was Senate bill 68. He was serving notice for it, yes, sir. So, I just wanted to know. I could object and we just go through a series of- I'll tell you what- No, not- So, it's the end of the day, once you come up here and we'll get it figured out, and then- Before we adjourn, we'll make sure we haven't figured out for you. Mr. President, I've already figured it out. I'm not going to object, but I just want to make notice on these various things that the senators are doing. I now understand what you're coming from, Senator. Senator from the 14th. Parliamentary agreement, Mr. President. State your inquiry. Mr. President, all I was going to ask is, don't you think it'd be better if the governor waited until Monday to hit the media environment, then sit a Latin-Tororform pass on a Friday? Oh, Senator, you know nobody in this room pays attention to what's going on in the media. Thank you, Mr. President. I recognize the majority leader for motion. It's a great day to be a senator. I move that the Senate stand adjourned until 10 a.m. on Friday, March 21st. The Senator has moved secretary-heavy announcements. Senator from the 9th, you have a you want to announcement to make? Thank you, Mr. President. If you are a member of the Georgia legislative black caucus, we are taking a group picture down on the steps. Please, on the south steps, please head over there right now. Let's just get it done. If we can get assembled and we can get it done quick and everybody can be on their way. Thank you, Mr. President. Thank you. Thank you, Mr. President. Thank you, Mr. President. Thank you, Mr. President. Members of the Senate, subcommittee chairs, please meet with me in 30 minutes. We're going to meet at the Senate budget office. Others who want to join, I guess you can too. Senator from the 40s, you have an announcement. Secretary, read the announcements. Mr. President, the rules committee will meet upon adjournment in room 450 in the capital. At 4 p.m. the judiciary committee will meet in room 307 and CLOB. The insurance and labor committee meeting has been cancelled. At 5 p.m. the regular industries and utilities committee will meet in room 450 in the capital. At 5 p.m. the regular industries and utilities committee will meet in room 507 and CLOB. Any other announcements? The majority leader has moved. All those in favour of the...",
  "updated_at": "2026-02-13T14:13:17.736842+00:00"
}