{
  "video_id": "Ac2XbPOYRJk",
  "url": "https://youtu.be/Ac2XbPOYRJk?t=1494",
  "title": "Georgia House - Day 1 (2026-11-03)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": "2026-11-03",
  "duration_minutes": 70,
  "summary": "Here is a structured markdown summary of the Georgia House session:\n\n### Overview\nThe Georgia House of Representatives held a special session on November 3, 2021, focused on redistricting the state's legislative and congressional districts following the 2020 census. The session featured a prayer by Rep. Mack Jackson and the introduction of a resolution.\n\n### Key Actions\n**HR 2**: Resolution related to redistricting the state's legislative and congressional districts\n\n### Bills Introduced (First Reading)\nNone mentioned\n\n### Notable Moments\n- Rep. Mack Jackson gave the opening prayer, reflecting on the challenges of the past year and calling for wisdom and kindness among the representatives.\n- The Speaker of the House introduced Rep. Jackson and praised his character.\n\n### Votes\nNo recorded votes mentioned.\n\n### Attendance\nQuorum was present, with the doors locked to maintain order.\n\n### Adjournment\nThe transcript does not indicate when the session was adjourned. The next session date is not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIf so, the clerk will lock the machines.\nDoes anybody feel like I do that it's a great day to live in Atlanta and in the state of Georgia today?\nAnd that one just a little barely won't win last night, that was a beat down.\nIt made it even better.\nSo pursuant to the Constitution of the State of Georgia Article 3 Section 2 paragraph\n2, the General Assembly shall apportion the Senate and House District such districts\nshall be composed of contiguous territory.\nThe apportionment of the Senate and of the House of Representatives shall be changed by the\nGeneral Assembly is necessary after each United States decennial census.\nThis duty in the Georgia Constitution is parallel to that provided for by the 14th Amendment\nto the Constitution of the United States.\nSection two with respect to the United States House of Representatives, and I hereby declare\nthis special session of the Georgia House of Representatives in 2021 open for business.\nClerk will now read a proclamation from the governor calling for a special session.\nWhereas Georgia Constitution Article 5, Section 2 paragraph 7 grants the governor the powers\nto convene a special session of the General Assembly, stating in there by limiting its\npurposes. And whereas the regular session of the 2021 General Assembly adjourned\nSinidai on the morning of April 1st, 2021, and whereas the governor has determined\nthat certain purposes warrant the convocation of a special session. And therefore, by virtue\nof the power and authority conferred upon me by the Constitution of Georgia, I, Brian\nPeacamp, Governor of the State of Georgia, do hereby convene the General Assembly of this\nstate and special session on Wednesday, November 3rd, 2021 for the purposes and only those\npurposes specified as follows.\nFor enacting, revising, repealing, or mending general law for the division of the state\nand of appropriate districts, from which members of the Georgia State Senate shall be elected,\nthe division of the state and to appropriate districts from which members of the Georgia\nstate House of Representatives shall be elected, and the division of the state into appropriate\ndistricts from which members of the House of Representatives to the United States Congress\nshall be elected.\nNumber two.\nTo consider a mending code section 4812 for taxable years, beginning on or after January\n1, 2021, based on the amendments to the United States Internal Revenue Code of 1986 as amended\nthat passed honor before January 1st, 2021 in honor before March 11th, 2021.\nNumber three, for enacting revising, repealing, or amending local laws which the General Assembly\ndeems necessary to avoid unreasonable hardship or to avoid undue impairment, the public functions\nof consideration and enactment thereof are postponed.\nNumber four, to ratify the provisions of executive orders dated May 10, 2021, May 14, 2021,\nMay 21, 2021, and May 28, 2021.\nThe official records of the Office of the Governor's suspending the collection of voter\nfuel and diesel fuel taxes pursuant to Code Section 45, 12, 22 for the purposes of\nand ensuring that the supply of petroleum products\nof the state of Georgia during the state of emergency\npetroleum shortage declared by executive order,\nfive, 10, 21, 0, 2, number five.\nFor the Senate to consider and confirm,\nvarious appointments made by the governor\nsince the adjournment of the regular session\nof the General Assembly on April 1st, 2021.\nGiven under my hand, the great seal of the state of Georgia\nat the City of Atlanta on this 23rd day of September 2021,\nBrian Peacamp, Governor.\nDoorkeepers will please close the doors\nand keep them closed.\nRepresentative Kirby, can I deputize you over there?\nThank you very much.\nWe will begin our day today with Scripture reading and prayer by the chaplain after which\nwe will pledge allegiance to the flag of our country.\nI have the distinct honor and personal privilege of introducing the chaplain today, a member\nof this body since 2009, a friend, not just to the chair, but to all of us in here, but\nhe has been a particular friend of mine, a gentle and humble man who speaks, may speak softly,\nBut he knows where off he speaks.\nI've come to really respect and love Mack Jackson, and I so enjoy hearing his messages.\nI know that you will be blessed by it today, and I know that what a great day to hear from\nour colleague, Representative Mack Jackson, from the 128th House District.\nJackson. Good morning. Thank you, Ms. Speaker, for that introduction. It's always an honor\nand a privilege to be able to represent God and the Word of God. And I want to thank\nyou for giving me this honor, Ms. Speaker, to open up this special session on this day.\nI would have started out by with a joke that I heard.\nI heard a joke about a revenue agent from back in the days\nwhen moonshine was being made.\nNow, Dean Smiror asked me to pray for him.\nI asked him to pray for me.\nSo the agent not gonna farm was door one day\nand proceeded to tell him who he was\nand why he was there that day.\nHe told the farmer that he need to walk over his property.\nThe farmer told the agent,\nDon't go down in that pasture down by the big oak tree.\nThe agent took out his badge.\nAnd he explained to the farmer that that badge gave him\nthe authority to go any part of his property\nthat he desired to do.\nThis badge gives me complete authority.\nSo the agent immediately walked down by the big oak tree.\nWell, the biggest bull that he'd ever seen\nstarted running toward him.\nThe farmer heard the agent yelling for help.\nThe farmer walked over to the fence and yelled to the agent,\nshow him your badge.\nIn the book of Isaiah, chapter 40, verse 28 through 31,\nwe find these words,\nhas thou not known?\nHas thou not heard\nthat the everlasting God, the Lord,\nthe creator of the ends of the earth,\nFaints not, neither is weary.\nThere is no searching of his understanding.\nHe gives power to the faint and to them\nthat have no might, he increases strength.\nEven the youth shall faint and be weary\nand the young men shall utterly fall.\nBut they that wait upon the Lord shall renew their strength.\nThey shall mount up with wings as eagles.\nThey shall run and not be weary.\nThey shall walk and not faint.\nAn eagle is a unique creature.\nHe soars high where no other bird flies.\nHe has incredible vision.\nHe can see things from about three miles away.\nHe'll stand on a mountain and he'll char the storm.\nBut instead of running from a storm,\nthe eagle will prepare for a storm.\nHe'll lock his wings in place and wait on the storm.\nAnd when the storm comes, he'll brace himself.\nAnd the wind from the storm will push him higher and higher.\nHis wings will lock in place, and he'll fly above the storm,\nand look down on it until it's over, and he'll fly on home.\nWe've been through a storm in this last year.\nSome didn't make it, but those of us who didn't make it\nshould have more love in our hearts, more kindness in our hearts,\nmore timidness in our hearts, because if it had not been for the Lord who was on our side,\nwhere would we be? Let us pray. Father, you're the God of all grace. And today we're thankful\nfor your mercy and your grace. Leading God us through this special session,\nGive us the wisdom to do the business of the people of this great state.\nBless the governor, bless our speaker, bless the lieutenant governor.\nBless each member in this body that love and kindness be visible in our\ndaily interactions with each other.\nLet everything we do bring glory to your kingdom.\nAs Jesus said, not our will, but let your will be done.\nFor thine is the kingdom and the power and the glory forever and ever in Jesus' name we pray, amen.\nLet's have the pledge of allegiance.\nDoorkeepers will unlock the doors.\nYou\nYou\nYou\nHouse will remain at order.\nHouse will be at order.\nclerk will read a resolution. House of Resolution 1EX, the resolution will notify the Senate\nthat the House of Representatives has convened. Chair recognizes the majority leader of the\nHouse to speak to House Resolution 1EX.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nAs is our custom when we prepare to do business on our most important issues, whether it be\nthe session or whether it be a special session, we'll notify the Senate.\nNow, I'm a little concerned this morning as we notify the Senate, I think when Max Fried\nturn the lights out on the Astros and the bottom of the first you may have also\nturned them out over in the Senate. I'm not sure they're back on but we're going\nto take a chance that that has occurred and they're ready to do business\nso we're going to let the Senate know that we're here we're ready out the\ncarry out the business of this session and we're ready to transact\ntransact business on this side of the Capitol the House is ready thank you\nMr. Speaker not asked for the the approval of this resolution thank you is there\nfor any objection to the adoption of the resolution.\nAny objection, Chair, here's none in the resolution, is adopted.\nThe clerk will read the resolution, establishing the order of business for the day.\nMr. Burns, if you know anything, this file would be established as the order of business\nor in the first part of the period unanimous concerns,\ninstruction of bills and resolutions,\nfirst reading and reference of house bills and resolutions,\nmorning orders.\nIs there any objection to the adoption\nof the resolution establishing the order of business for the day the chair\nhere's none and the resolution is adopted. Clerk will read the caption to\nHouse Resolution 2EX. House resolution 2EX by Representative Burns,\nhonor 59th and others, a resolution relative to meetings in the\ngeneral assembly and for other purposes. Chair recognizes the\ngentleman from the 150th House District the majority leader later burns to\nspeak to the resolution. Again thank you Miss Speaker. Colleagues if you\nwill follow me clerk can you put the resolution up on the board? That\nbe possible.\nHow about the embrace?\nI want to tell you what, we've been waiting for a while, I've been a raised fan for\nOr, quite sometimes, almost as long as you, since you're a\nlittle bit older than I am, but that was awesome, wasn't it?\nGreat bunch of guys that did a great job.\nAnd I know I'm proud of them.\nAnd proud for America's team.\nHere we go.\nWell, as we have prepared for this special session,\nwe're all certainly want to maintain the order of our lives.\nAnd I hope this resolution will help us do just that.\nFor those of you that don't see about like I do,\nI'm going to go through the resolution\nwith you line by line.\nAnd certainly I think that'll make it a little bit easier.\nWe'll start with line 336 on this scheduling resolution.\nBoth chambers in session through Friday from today,\nWednesday 11, 3 through 11, 5.\nThen both chambers are out of session on 11, 6,\non 11, 7, Saturday, and Sunday, this weekend.\nWe will reconvene on Monday 11 on the 8th of November.\nLines 7 through 11.\nThrough the remainder of the special session,\nBoth chambers of the General Assembly are adjourned\non each Saturday and Sunday.\nUnless we decide otherwise\nwith a subsequent scheduling resolution.\nLines 12 through 18.\nBoth chambers are responsible for their own adjournment\nand convening schedule within the schedule of this resolution.\nresolution. Each chamber can decide what their schedule is for a Monday through Friday\ndoing the special session, but there's no doubt it's clear that they will not be in on\nthe weekend unless we pass another scheduling resolution. Part two of the resolution is\nthe simple language we always adopt in our resolutions of scheduling is the standard\nemergency procedures and that is standard language that we utilize each year we've used\nover the years. On Monday, this coming Monday, which will be day four of the special session,\nthe governor is hosting a Veterans Day Memorial celebration in the Rotunda at 10 a.m. So our\nstandard time, of course, is to come in at 10, but we will back up our starting time to\n11 a.m. Is that not correct with speaker? That is correct. So that is the\nresolution of how we will conduct our business from here until we complete this\nmost important work that we're assigned to do by the governor's call and I\nwould certainly I hope you we'll certainly we'll be able to pull that up now\nbut that that is what we're going to do and how we'll conduct our business and\nNow, I would ask of your favorable consideration on HR2EX, our\nadjournment schedule and resolution.\nAny questions, Mr. Speaker?\nI had one just to clarify, we will adopt our own adjournment\nresolution for Thursday, November 11, is I understand.\nSo we will not be doing any business-owned veterans day.\nYes, sir, and thank you for reminding me.\nI forgot to mention that.\nWe'll allow us to certainly be in our home communities\nif we so desire to celebrate one of the most important days\nin our country.\nAnd certainly, I certainly do appreciate you\nreminding me of that.\nI did miss it, but that certainly will be the case.\nThank you, Mr. Baker.\nI see no further questions.\nWell, I ask for your favorable consideration.\nThank you all very much.\nI look forward to working with you.\nIs there any objection to the adoption of House Resolution 2EX?\nAny objection?\nChair, here's none in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 1EX by Representative Rich the 97 to be taught on act to provide for the composition and number of state house districts\nLegislative and congressional reapportionment House Bill number 2EX\nOr representative rich of the 97th to be taught on act to provide for the composition and number of congressional districts\nLegislative and congressional reapportionment that completes first readers\nWhile we're waiting, as we all too frequently have to do on the Senate to take up very controversial\nmatters like notifying the governor that we're in session, I'm sure that's provoking\nsome speeches over there by people, but we're going to go on with our business and go\non to morning orders.\nWe only have one morning order today, and given the nature of the morning order, I am\nnot going to limit the time.\nChair recognizes for a morning order, representatives Bentley, representative Al Williams, representative\nof the Dean of the House, Dean Smirey, representative Hinkley and Chairman Allen Powell for a morning\nThank you Mr. Speaker, colleagues, I stand this morning along with other members of the\nHouse of Representatives that served with Uncle,\nRepresentative Lynn Moore-James.\nHe always be representative Lynn Moore-James\nfrom rural Georgia, who served in this chamber for 20 years.\nHe was well loved here at the state capital\ntoo, and especially in his home community\nof Macon County, Monizuma.\nAnd we're so very grateful to his lovely wife, Miss Faye\nJames who stood by him and took really good care of him as a state representative and\nas at home doing his time of illness.\nThis is a very emotional time for me and I'm so very grateful to have all of your love\nand support to help me make it through this time as we all know that I laid my husband\nto rest one day after my twelfth wedding anniversary and then to now be standing here talking\nabout home-going services celebration of life for representative Ledmore James.\nAnd before I become too very emotional, I'm going to yield the remainder part of my time\nto represent it if our williams. Thank you.\nBlessed in the sight of the Lord is the death of one of His saints,\nand truly your scent has gone home to be with the Lord.\nI heard Scotty tell someone as I was coming in the chamber that this was a family,\nAnd this was, then, more James' his family, then more of God.\nHe loved his faith, loved his family, and he loved this house.\nIt was seldom that I left here on Fridays, and I didn't call him and review the activities\nfor the week.\nHe was not just a colleague, he was my dear friend, seldom did a month fast that I did not\nalong with my wife, drive to Montesuma.\nMonday a week ago, I went after coming from another funeral in Philadelphia and he couldn't\ntalk to me, but we talked a long time. He looked at me and I looked at him and I rubbed his\nhead. And I thanked God for having a man like Lynn Moore James in my life. But I said\nthis morning, I've never met a woman who was a better wife than Fay James. She took care\nof Linmo, but sometimes he really reminded me some months ago. She took care of Linmo\na long time before he got sick. I used to miss her by wife because Linmo would sit down\neven have to take his shoes off, y'all. And when she took them off, she rubbed his feet.\nI hadn't, I got 43 years in and I hadn't quite got there yet.\nBut when we lay him to rest in the red clay of Macon County on Friday,\nSaturday, Saturday at one. No pleas that a gentle giant walked among us. If you\ndidn't like Len Mo James, you just didn't like people. I thank God for what he\nmet to me, and asked for strength, if they asked me to preside on Saturday. And as of\nthis moment, I don't know if I can.\nI just want to take this moment to say that Lynn Moore Jane was a dear friend. I knew\nproud to come into the General Assembly. He was just a great spirited guy. We're just blessed\nthat he came our way. We're going to miss him. I remember Al calling me and the day before he passed,\nI called his wife, Fay, and we had a great conversation and Elle texted me the next morning that a giant\npantry has fallen in the state of Georgia. They're a little more James. So we thank you for this time\nAmen, this is a wonderful tribute to a wonderful gentleman.\nThat a great, great friend.\nThank you.\nAnd at this time, we'll ask everyone for bow your heads for a moment of silent, please.\nJesus' name, amen.\nThank you.\nThank you.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nAll right, we're going to move forward.\nYou know, apparently everybody over there that's running for some higher office is weighing\nin on the adjournment resolution or notifying the governor that we have convened.\nClerk will read the caption to Senate Resolution 3EX, Senate Resolution 3EX to notify the governor\nthat the General Assembly has convened.\nSenate Resolution 3EX notifies the Governor of Georgia\nthat the General Assembly has convened.\nIs there any objection to the adoption of the resolution?\nThe Chair here's none.\nThe resolution is adopted.\nThe chair appoints the following members\nto the Committee of Notification.\nChairman Ballinger from the 23rd,\nRepresentative Bird from the 20th,\nRepresentative Camp from the 131st,\nRepresentative Ayerhart from the 36th,\nRepresentative Hagen from the 156,\nRepresentative Lot from the 122nd,\nand Chairman Rich from the 97th.\nY'all get to go down and tell the governor that we're in session.\nOkay, we've got a birthday today.\nWhat a way to celebrate your birthday, but opening day of special session, right?\nRepresentative Michael Smith.\nLet me wish you happy birthday greetings to Representative Michael Smith and Representative\nBurnow.\nYou haven't let me tell him today is not her birthday.\nIt was yesterday and her present was the Braves winning the World Series.\nI'm assuming that by when we get here tomorrow that we will have a lot of committee chairs\nAnnouncing Meetings Chair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move to this House stand adjourned until 10 a.m. Thursday, November 4th.\nThe majority leader has moved that this House stand adjourned until Thursday, November 4th,\n10 o'clock a.m. All those in favor of the motion will say aye. Those opposed will say no.\nThe eyes clearly have it. This house will be adjourned until Thursday at 10 a.m.\n",
  "updated_at": "2026-02-12T12:57:15.291346+00:00"
}