{
  "video_id": "AF6hy5gyg6U",
  "url": "https://www.youtube.com/watch?v=AF6hy5gyg6U",
  "title": "Lawmakers Day 36 03/27/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 36,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 36 03/27/25 session:\n\n**Overview:** The session was marked by several notable actions, including passing bills to allow terminally ill patients access to experimental treatments, create a scholarship grant program for youth in foster care, and codify access to in vitro fertilization. There was also debate over a bill to criminalize artificial intelligence videos designed to interfere with elections, and a partisan resolution to investigate alleged illegal campaign contributions by the New Georgia Project.\n\n**Key Actions:**\n- **SB 72:** Allows terminally ill patients to access experimental treatments\n- **SB 85:** Creates a scholarship grant program for Georgia youth in foster care\n- **SB 233:** Adds individuals with first-hand experience with addiction to the Behavioral Health Reform and Innovation Commission\n- **SB 9:** Criminalizes artificial intelligence videos designed to interfere with elections (passed 152-12)\n- **SB 69:** Sets regulations around third parties financing lawsuits (passed 98-69)\n- **SB 105:** Allows veterinarians to give pet health advice\n- **HB 428:** Codifies access to in vitro fertilization\n\n**Bills Introduced (First Reading):**\n- HB 106, HB 310, HB 423, HB 60\n\n**Notable Moments:**\n- Visit from the House Speaker's chief of staff, Terry England, who was recovering from a farming accident\n- Debate over SB 9, with arguments that ensuring election integrity is the \"most important thing\" lawmakers can do for constituents\n\n**Votes:**\n- SB 9 passed 152-12\n- SB 69 passed 98-69\n- SB 105 passed unanimously\n- HB 428 and an amendment to raise the governor's salary to $250,000 passed 45-10\n\n**Attendance:** Quorum present\n\n**Adjournment:** Session adjourned, next session scheduled for the following day.",
  "transcript": "Mayer of our capital city, they just approved the raise, makes $237,000 or $36,000 a year.\nBut the governor of the entire state only makes $175.\nThat doesn't make good sense.\nSo this simply sets the governor of salary at $250,000, which I believe is most appropriate.\nBut then it falls in line with our constitutional officers and the speaker of the house.\nSo whether it be our lieutenant governor, the speaker of the house, the attorney general,\nthe insurance commissioner, all those folks that are statewide elected, although I did\nnot bring the PSC involved, would then be 80% of the governor's salary.\nThe proposed pay raise for Governor Brian Campwood may cam one of the highest paid governors\nin the country.\nGood evening.\nIt's day 36 of the Georgia legislative session.\nWelcome to lawmakers.\nI'm Donna Lowry in Atlanta.\nMore details about the raises coming up in our Capitol report.\nIf you've ever called 911 in Georgia and became frustrated by being put on hold, getting\ntransferred to another jurisdiction or waiting a long time during an emergency, help is on\nthe way.\nOn the show, we'll learn how Georgia will spend more than $5 million dollars to overhaul\nthe 911 system.\nIt's part of a nationwide effort.\nAlso, education takes up more than half of the state's budget, and there are dozens\nof bills to help improve academic outcomes.\nWe'll hear from some of the sponsors this evening.\nBut as always, Sarah Callis reports on the action at the Capitol today.\nHi, Donna.\nthe capital, both chambers stayed busy as the countdown until\nSinidai is on.\nIn the house, a surprise visit from the speaker's chief of staff,\nTerry England.\nEngland was injured in a farming accident earlier this session and has been\nrecovering at the Shepherd Center.\nMembers then unanimously passed Senate Bill 72, which would allow terminally ill patients\nto access experimental treatments.\nThey also approved SB-85, which would create a scholarship grant program for Georgia youth\nand foster care.\nThese young individuals often find themselves at a disadvantage.\nHowever, this bill gives us a chance to change that narrative.\nAfter a lunch break, the house took up SB 233,\nwhich would add individuals with first-hand experience\nwith addiction to the Behavioral Health Reform\nand Innovation Commission.\nThe additions to the commission is set forth in 233,\nor recognizing the very strong contributions,\nnecessary contributions from the addiction community\nacross Georgia. This has always been a mental health and addiction commission effort, and\nthe addition of additional addiction related professionals and addiction related family\nmembers are strong. Members also debated Senate Bill 9, which would criminalize artificial\nintelligence videos designed to interfere with elections.\nI would argue with you, the most important thing we can do for our constituencies is to\nensure that when they go into that box, when they are saying to themselves, I'm going\nto cast the ballot for this individual\nor for this referendum.\nThe most important thing we can do for them\nis make sure that we have given them accurate information.\nWe cannot live in a world where our constituents\n10.7 million Georgians, almost six million voters\nare asking themselves, what I just saw,\nis it real or is it not real?\nAt that point, the integrity of the election,\nno matter if you fall on paper ballots\nor machine ballot is gone.\nThey passed 152 to 12.\nThe other tort reform bill also made it to the floor today.\nSB 69 would set regulations around third parties financing lawsuits, such as banning foreign\nentities from being litigation financiers.\nCurrently, there are no provisions whatsoever that outline regulations on litigation financing.\nNo earner could will you find it.\nSo what this bill seeks to do is put some guardrails and regulation on the industry.\nThe bill passed 98 to 69.\nThe House unanimously approved SB 105, which would allow veterinarians to give tell advice\nto pet owners.\nThe Senate took up HB 428, which would codify into law access to in vitro fertilization.\nThe bill was crafted after the Alabama Supreme Court ruled that frozen embryos created\nwith IVF should be treated as children and banned the procedure until a similar bill\nwas passed there.\nSenator Josh McLaren said that not only did he support the bill, but he also had a personal\nconnection to it.\nI myself am a donor-conceived person.\nThe technology was new around the time that this happened for me in the late 80s.\nBut it's been a long journey and it's a really important realization for all of us to have\nwhen talking about this issue that many of our families are affected by this are uplifted\nby this.\n86 would give pay raises to state judges, including state Supreme Court justices.\nBut an amendment offered by Senator John Elbers added pay increases for all of the state's\nexecutive officers, including Governor Brian Camp, raising his pay to $250,000.\nThe mayor of our capital city, which represents about a half a million people, makes $236,000.\nThe governor who represents 11 million people makes $61,000 less.\nThink about that for just a moment.\nThat is just not right.\nWe shouldn't have people be paid so far out of balance, even though knowing that in the\nprivate marketplace without a doubt, they would get paid multiples more.\nI think it's the right sub-nice balance and gets us on the right path tying it to a percentage\nin the future.\nand pushback the amendment was passed, as well as the bill, 45 to 10. It now returns to the house for final passage.\nHouse Bill 307 would increase resources at schools to diagnose and help students with dyslexia.\nThe bill would also remove the three queuing systems as the primary instruction for teaching reading.\nWe learned that one in five people, children, experienced some form of dyslexia. We didn't know that in the past,\nBut this mandate that we also have, not only is the child identified, not proficient\nin reading, but it also has displayed.\nThis also mandates that there be an inhibition program set in place to help that child get\nproficient.\nIn Senate Resolution 292, would form a Republican-led Senate Investigative Committee to look into the\nNew Georgia Project's illegal campaign contributions to its former founding member, Stacey Abrams,\nher 2018 gubernatorial campaign.\nWhat this bill is going to do is let us investigate these type of activities and see\nwhat type of amendments or changes or new campaign finance laws or ethics laws we might\nneed to kind of create more transparency and prohibit this illegal use of dark money\nin our campaigns.\nDemocrats say the investigation is unnecessary and more political theater.\nIn Washington, D.C., they spend a lot of time investigating political opponents while wasting\ntaxpayer dollars without providing any benefit to the American people.\nBut for those politicians in D.C., it does get them headlines, it does get them media coverage.\nThis bill is no different.\nThe resolution was passed 33 to 21 along party lines.\nThe House and Senate will convene tomorrow when the House is expected to vote on a bill\nthat would crack down on fentanyl trafficking and give final approval to protections for\nIDF.\nThat's my Capitol report.\nDonna?\nDonna?\nThanks, Sarah.\nCell phones, the Internet, the other technology, all of turn Georgia's 911 system into a\nbit of a dinosaur.\nNew legislation spearheaded by the National Highway Traffic Safety Administration would\nmodernize the system.\nNext generation 911 reaches police, fire, and emergency medical assistance from any phone\nin any location, allows voice, photos, videos, and text messages, helps manage call overload,\nnatural disasters, and transfer of 911 calls based on caller location.\nIn the legislature, Republican representative Will Wade of Dawsonville moved the bill in\nthe house, and Republican senator John Albers led the bill through the Senate.\nI spoke to both of them earlier today about the need\nfor Georgia to upgrade its 911 system.\nOver the summer, the House had a study committee\nand I believe some senators were involved as well\nregarding the state's 911 system.\nAnd quite frankly, it's like a lot of parts of life.\nTechnology enhancements, the utilization\nand how people are living and moving and communicating\nhas changed over the last few years.\nAnd the 911 system is just, it's old\nand it's outlived, it's useful life.\nSo it was time for us, as state leaders,\nto look around and say, okay,\nwhat solutions can we come up with?\nAnd next gen 911 is what demands,\nthe 21st century need to be met with.\nSo we're excited that the house was able to introduce this,\nJima and Jika, who are state agencies\nthat help emergency management across the state.\nThey were engaged in the process,\nkind of helping make the detailed case while we need this.\nAnd so I was happy to introduce the legislation\nand get its chevrore through the house\nand give it over to the great hands of center albers\nwho could take care of it in the Senate.\nAnd as a state, we've had different municipalities\ndo some of this on their own,\nbut the lack of a statewide network\nto connect together all these 911 centers\nhas put it as a little bit of a disadvantage.\nSo this great piece of legislation\nthat Representative Wade sponsored\nand I'm happy to help in the Senate\nis gonna allow us as state to bring\nthat entire foundation in place\nthat everyone can leverage at\nbecause people are at their most vulnerable moments\nwhen they call 911\nand we can't have that be an outage or a delay\nand they also need to use newer technology,\ntext, send pictures, videos,\nall the ways we communicate in this day and age.\nI think some people have done what I've done.\nI saw an accident and then when I called in,\nthey told me I called the wrong place\nand here I am thinking I'm helping somebody,\nbut it took a while.\nThat's, this would prevent that, right?\nThat's correct.\nAnd so what will happen is this will allow local communities,\nThink about Georgia 400, I commuted every day.\nIf I'm in an accident or I see an accident\nor I'm sitting in traffic,\nI may not exactly know which county I'm in,\nI might be in for sight or Fulton or you just don't know\nand you see an accident you call 911,\nwe wanna make sure that as soon as they get that call,\nthey can geolocate your cell phone where you are\nto make sure they're getting you to the right quickest\nagency, whether it be police, fire, EMT, et cetera,\nthey will be able to serve you and know exactly\nwhere you are.\nJust like the private industry is able to deliver you\nyour uber eats or your supper or your meal at your office,\nthey're going to know exactly where you're calling from\nand it's very important.\nAnd look, I'm sure the Senator heard dozens of folks\ncalled me and said, look, I've been on 9-1-1\nand had the hold.\nFolks, if you're in an emergency,\nthat's like pouring gasoline on a fire.\nAnd sometimes that's literally what's happening.\nAnd people are sitting and waiting.\nWe can't allow that to continue.\nThis legislation will help our communities to adopt next gen 911.\nWe're funding $5.75 million in the first year of its implementation.\nSo those early adopters can get engaged and it's going to help a lot of\nGeorgia's all across our state.\nHow long will it take to get it fully operating?\nIt'll take about five years for the entire platform to be set up,\nbut it will happen iteratively.\nWhat's important is we've had 911 systems that have gone down,\npower outages, network outages,\nand the phone companies are getting rid of their legacy\ntechnology, so this has to be done,\nbut also gives that continuity that we need so badly.\nWe're now, if you're calling here in Atlanta,\nand for some reason there's a problem in that facility,\nthey can dynamically be picking up at other places\nin order to get the response to be right away.\nAdd that with artificial intelligence tools,\nwhich can pick up every call on the first ring\nor absorb that information.\nThis way when you're getting 200 calls,\nwe don't have to sew down the dispatch process\ntheir first responders, they'll a little bit of handle\nthat all in the back end smoothly.\nIt also helps transition those calls that are not\nemergencies to make sure they're getting the right\nplaces without stopping what really needs to be a\ntrue emergency response.\nWhat are the terms of the workforce?\nI'm sorry.\nNo, no, I'm just going to say one of the things I'm\nhopeful for is, you know, the state has spent\non a large amount of funds on expanding our\nmental health and crisis line.\n988 is a tool that I think many Georgians are still\nnot aware of.\nI believe that we'll have an opportunity\nfor those 911 centers to transfer to 988\nuntil people start realizing 988 is also a tool\nwhen it's not typically the same type of emergency.\nSo that I think is another component\nthat's gonna be added along that five-year plan.\nAbsolutely.\nWhat can you tell me about the workforce\nin terms will it mean any changes\nin terms of dispatchers, other people are involved?\nThey will actually get some new\nmore beneficial tools than they have today.\nAs we talked about texting, pictures, videos, what's going on, imagine that real-time\ninformation coming in dispatch that they can relay to law enforcement officers or to\nfirefighters.\nSo they're going to have some new and enhanced tools.\nOur 9-1-1 dispatchers who are really just a critical part of our first responder network\nare very excited about this.\nIn fact, they have led the way along with Georgia Emergency Management and Georgia Emergency\nCommunications to get this done.\nreally mean a lot when we have a natural disaster like a storm like Helene\nthat kind of thing. Yeah we we had dozens of folks testify to had we had\nnext gen non one prior to Hurricane Helene the response times for some of\nthe most difficult situations would have been able to be addressed much more\nquickly and honestly just being able to restore peace of mind more quickly\nhelps temper those frustrations and tragic situation so it's going to be\ngreat. Look, I think 9-1-1 centers across the state still have open spots.\nThere's a, you know, they've got plenty of job opportunities. So I think this is\ngoing to be exciting for the 21st century graduate who wants to be utilizing\nthat technology and speaks AI the way maybe you and I may not have that\ncapability yet. We're working on it, but I think it's going to be a detractive\njob for the next iteration of workers too. This is what teamwork's all about when\nyou see things that tend to get backlogged in other states or other areas of\ngovernment here in the state of Georgia or a team we're getting things done to serve\nour citizens.\nWell done sir.\nThank you.\nThank you.\nThank you.\nThis is it.\nHB423 is on its way to the governor's desk.\nDuring our conversation I also asked Senator Albers who chairs the Senate's Public Safety\nCommittee about a couple of his bills including SB27, which would criminalize doxing.\nBut first I asked about a bill that would help ensure emergency organ transport vehicles\nhave the same abilities as ambulance services.\nHis interest in promoting organ transplants is personal.\nHe donated a kidney to his son in 2021.\nCentipil 58 allows for life-saving organs\nwhen they're being transported.\nFrom one medical facility to another,\nyou usually look similar to like a fire chief's car\nor a small ambulance,\nthat sometimes they have to ride emergency\nbecause there's a sensitive time to get that organ.\nSometimes there's actually a medical team\nthat is with that organ as well.\nSo in the times they need to be driving for emergency\nwith a lighten sirens, it allows those\nwho are certified to do so and have the proper equipment\nto do that.\nIt's very important because not everybody\nwas a fortune as I was with my son.\nWe were in operating rooms right next to each other.\nSo this makes sure, no matter where that organ's getting to,\nit's gonna get their timely,\nwe're gonna save people's lives.\nLet's talk about SB27 really quick,\ndealing with doxing.\nTell us about it.\nSo doxing is basically online stocking,\nbut it goes so much further.\nWith the tools we have today,\nwhether it be social media\nor any other electronic communications,\npeople are sharing people's specific location at times\nin order to do harm.\nSome of it is traditional stocking\nthat has made people very fearful and uncomfortable,\nbut sometimes it's literally led to bodily harm\nand even death.\nSo this is an important issue that we modernize our law\nto keep up with the technology that's around this.\nMany of us were swatted a year and a half ago.\nI was swatted twice as was many folks in this building,\nbut it's not just about us.\nThis is the ex-spouse in a bad marriage\nwhere someone's acting poorly.\nThis is a young girl who's a teenager in school\nwho's got somebody aggressive doing something terrible.\nSo this is to protect people.\nThat's what we're all about here first and foremost\nis working together to make sure our citizens are safe.\nThe bill criminalizing doxing has passed on the Senate and in a House committee, so we\ncan expect it on the House floor soon.\nThe legislation dealing with transporting organs has moved through both chambers and\nis awaiting the governor's signature.\nI want to thank Chairman Albers and Representative Wade for our conversation.\nWell, coming up, legislative efforts to improve outcomes for school children and to help\nGeorgia's looking to become first-time homeowners.\nTwo house Democrats join us to talk about bills they feel\npassionate about as the session winds down.\nYou're watching Lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots organization dedicated\nto preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the State Capitol during the session and year round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen, I don't fear anyone.\nThis is a woman, people wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it.\nBy acknowledging our own worth.\nHelp please.\nDo continue.\nThis is the first time that anyone has seen this in 2000 years.\nThat's amazing.\nOh, I'm excited now.\nPompeii is a battle against time.\nYou think I'm joking?\nBut look at this.\nIt really happened.\nDon't let anybody tell you who you are.\nYour love is like fire.\nHistory teaches us to honor the past.\nWhen you look back, they're like, wow, that was pretty special.\nThis is something that's actually altering the course of history.\nYou're charged with keeping these stories alive.\nWelcome back to Lawmakers. I'm Gunna Lowry. Our next guest will discuss legislation they've\ncrafted on a variety of issues. Joining us is Democratic Representative Imani Barnes\nof Tucker. Her committees include higher education and public and community health. And Democratic\nrepresentative Bill Olaia of Atlanta.\nHe's on the education, governmental affairs,\nand information and audit committees.\nThey stay busy.\nWelcome to lawmakers to both of you.\nYou both have education bills, so we'll start with that\nand then we'll get into some other things.\nAnd let's start begin with your healthy start act.\nHB60, you've come on the show before to talk about this.\nYou want to make sure all children have access\nto school breakfast and school lunch.\nYou've pushed it for quite a few years.\nTell us where things stand.\nThis will be the third year that I've pushed\nto Healthy Start Act.\nFortunately, all three years, we got the money in the budget.\nThe Healthy Start Act is the law that would codify\nfeeding our children free school breakfast\nand free school lunch.\nSo explain that, so people don't understand.\nThe budget is one thing, actually having a law\nthat requires this to happen on a regular basis is another thing.\nThat's another thing.\nSo we can fight for a budget line item\nthat will get the money in a budget\nthat will do the same thing as my bill, my legislation.\nThe legislation would codify, would make it law.\nSo each year we don't have to fight for a budget line item.\nOkay, all right.\nSo let's talk about your education bill,\nRepresentative Olai, you've also had the education bill\ncalled the Educational Opportunity Act\nfocusing on students living in poverty.\nTell us what that's all about.\nYeah, so Georgia Educational Opportunity Act\nwould, for the first time in 40 plus years\nof our state's funding formula existence,\nit would provide additional resources\nto support children living on poverty.\nWe know that poverty is the greatest barrier\nstanding in the way of our young people\nand educational outcomes and future success\nthat we want for them.\nAnd this provides additional resources and tools\nfor school leaders and educators\nto meet the unique needs of today's children.\nAnd we know that the Quality Basic Education Act\nor the Funding Formula has not been changed\nas you said in 40 years.\nSo how are you feeling about this?\nI know you didn't get it through at this point,\nbut you're still keeping hope alive in this.\nWell, you got it, you got to keep at it.\nAnd we had, we had some great conversations.\nTo buy partisan bill, really appreciate\nthe support of my colleague Tyler Paul Smith.\nI wanna say we had the first bipartisan,\nor probably the only bipartisan press conference\njust to bring some attention in the awareness around\nthe need to invest more fully in our public schools\nand get the resources into the hands\nof our educators doing so much with so very little\nso that we can help our young people thrive\nand be successful.\nSo the bill is still alive for next year.\nSo we'll wait and see what happens.\nI know you'll keep fighting with it.\nOkay, we're gonna switch gears again to another,\nanother of your education bills,\nHB106 to bring back driver's education\nas an elective.\nIs there a personal reason behind this?\nI have a young teenager that's getting ready\nto get on the roads.\nI had a feeling that there was something that didn't fit.\nYeah, and so tell me how things are going\nin terms of this bill.\nPretty much.\nWhen I was in high school, I took driver's ed,\nI feel like it makes me a better driver on the road.\nAnd we all know we've had a lot of teen deaths\non the highway in the past few years.\nAnd just putting drivers at back into the high school\ngives more children who can't afford\nthose personal driver ed services the opportunity\nto be taught how to safely drive on our Georgia roads.\nYeah, I think a lot of people feel the same way,\nbut right now you have to pay for it.\nThat's right.\nAnd that's another one you're gonna keep alive.\nWe're gonna keep that one alive too.\nYeah, okay, let's switch to another one\nsticking with education.\nLet's talk about your student teacher promotion act bill.\nTell us about it.\nYeah, so.\nSo, 310, I think.\nHB310, so currently college students\nwho are on a path to earning their teacher certification\nand stepping into classrooms go through a practicum.\nAnd so it's in classroom experience and work\nthat allows them to build confidence and skills\nthat are necessary for their preparation\nto stepping into that profession.\nAnd they're dropping out of the program\nbecause they're not being compensated.\nThis is a 40-hour, a week, a minimum of 500 hours,\na semester, and they're not being paid.\nAnd inflationary pressures are affecting us all,\nincluding students who have to pay for tuition,\nwho have to pay for gas tune from school,\nwho are paying for groceries,\nand this would bring us in line with other states\nwho currently compensate student teachers\nfor their working classrooms.\nAnd let's face it, we need teachers.\nWe're really losing our teachers.\nSo this is one way of keeping them.\nSo there's a fiscal note involved.\nSo is that part of the problem?\nSo no fiscal note as of yet.\nOkay.\nBut it would give student teachers up to $1,500\nupon completion of their student teaching portion.\nThat's likely to make a difference, okay?\nThis is right.\nWe're gonna switch to something else,\nold school too, I'm calling it that old school.\nThe back to school tax-free holiday\nthat are used to allow you to have at least a weekend\nsometimes to buy clothing and school supplies and no taxes.\nI'm trying to bring back to school tax,\nfree weekend back.\nIt's called Back to School Relief Act.\nit would make school supplies, shoes, computers,\nthings our children need to go back to school,\ntax-free.\nWe just passed a gun tax-free piece of legislation\nand my bill for tax-free school weekend\ndid not get a hearing, so.\nBut in October, I think we're still waiting\nto see what's happening with the gun bill.\nIt may have passed in both of them.\nYeah, that's another one you'll be fighting.\nYeah, we're trying to help parents with the inflation\nand trying to get our kids back to school.\nFood is expensive.\nSchool supplies are expensive.\nLaptops that children need.\nSo just bringing that back.\nWe have one on the Senate side.\nNabila, Islam is carrying the Senate back to school.\nTax-free and I'm carrying the house.\nSo hopefully we get some attention on that as well.\nOK, we'll keep up with that one.\nWhile we're talking about education,\nI know you want to talk a little bit about what's\nWhat's happening at the federal level\nwith the Department of Education?\nWhere are your thoughts?\nIt's dismantling it, I should say.\nIt's unfortunate and disappointing.\nWe know that the state pulls in billions of dollars\nto support Title I schools, to support meals programs,\nto support children with disabilities.\nAnd so in the absence of this agency,\nwe're talking about hundreds of layoffs\nwho is going to be managing and administering\nthese vital programs to our schools and our communities.\nAnd, you know, I had a friend liking it\nto smash in a fly with a hammer.\nProbably not gonna get the fly\nand you're gonna cause a lot of damage in the process.\nAnd that's what's happening.\nI run a workforce development youth focus nonprofit\nnext generation men and women.\nWe operate exclusively out of Title I high schools\nand it's hard.\nA lot of that fear and uncertainty makes it difficult\nplan, it makes it difficult to keep morale up, to do the difficult work, the hard work\nthat many educators and community partners such as my own is doing.\nAnd so we could potentially be back for a special session to figure out what's the extent\nof the cuts, what are we going to be left needing to cover in terms of funding to make\nmake sure that those vital programs are ongoing.\nYeah, and not just for the Department of Education,\nbut some other federal programs.\nOh, definitely.\nSo we'll see what happens with that.\nI want to get into real quick that you have two programs\nthat will deal with, you want mobile units.\nYou have your in-path bill that you've talked about before.\nBut another mobile unit for postpartum women,\ntalk about those, we have maybe a minute, less than a minute.\nThe Healthy Mother's Act, the Healthy Mother's Act\nwould provide mobile maternity units\nin our maternity deserts in the state of Georgia.\nSo though maternity deserts do not have OB-GYNs\nin the vicinity, no hospitals,\nand no obstetrician care in the vicinity.\nAnd so we would provide mobile units to these areas,\nwhich will also mitigate some of the other diseases\nthat come along with being pregnant.\nYou got high blood pressure, you could have diabetes.\nAnd so, sending mobile units to our role\nand our districts without maternity care\nis of the utmost importance\nbecause we are number five on maternal mortality.\nImpath, real quick, what was that before?\nThe Georgia Impath Act is for mental health,\nputting mental health,\naddressing our mental health issues.\nWe'll have to have you come back to that.\nAll right, all right, thank you so much.\nThank you both for being here.\nI appreciate that.\nThat does it for lawmakers today.\nWe won't have a show tomorrow, but the legislature will meet for day 37, so look for a capital\nreport from Sarah Callis tomorrow at the end of the PBS NewsHour.\nHave a good evening.\n",
  "updated_at": "2026-02-12T01:30:49.854314+00:00"
}