{
  "video_id": "AF6hy5gyg6U",
  "url": "https://www.youtube.com/watch?v=AF6hy5gyg6U",
  "title": "Lawmakers Day 36 03/27/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 36,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 36 03/27/25 session:\n\n**Overview:** The session was marked by several notable actions, including passing bills to allow terminally ill patients access to experimental treatments, create a scholarship grant program for youth in foster care, and codify access to in vitro fertilization. There was also debate over a bill to criminalize artificial intelligence videos designed to interfere with elections, and a partisan resolution to investigate alleged illegal campaign contributions by the New Georgia Project.\n\n**Key Actions:**\n- **SB 72:** Allows terminally ill patients to access experimental treatments\n- **SB 85:** Creates a scholarship grant program for Georgia youth in foster care\n- **SB 233:** Adds individuals with first-hand experience with addiction to the Behavioral Health Reform and Innovation Commission\n- **SB 9:** Criminalizes artificial intelligence videos designed to interfere with elections (passed 152-12)\n- **SB 69:** Sets regulations around third parties financing lawsuits (passed 98-69)\n- **SB 105:** Allows veterinarians to give pet health advice\n- **HB 428:** Codifies access to in vitro fertilization\n\n**Bills Introduced (First Reading):**\n- HB 106, HB 310, HB 423, HB 60\n\n**Notable Moments:**\n- Visit from the House Speaker's chief of staff, Terry England, who was recovering from a farming accident\n- Debate over SB 9, with arguments that ensuring election integrity is the \"most important thing\" lawmakers can do for constituents\n\n**Votes:**\n- SB 9 passed 152-12\n- SB 69 passed 98-69\n- SB 105 passed unanimously\n- HB 428 and an amendment to raise the governor's salary to $250,000 passed 45-10\n\n**Attendance:** Quorum present\n\n**Adjournment:** Session adjourned, next session scheduled for the following day.",
  "updated_at": "2026-02-12T01:30:49.854314+00:00"
}