{
  "video_id": "Agb3ePiwo2M",
  "url": "https://youtu.be/Agb3ePiwo2M",
  "title": "Georgia House - Day 11 (2026-11-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 11,
  "video_date": "2026-11-17",
  "duration_minutes": 44,
  "summary": "Overview:\nThe Georgia House session on 2026-11-17 was a routine day with no significant legislative actions. The speaker introduced the House chaplain, Rep. Terry England, who delivered an inspirational speech highlighting the importance of seeking wisdom from God and using one's intelligence to serve others.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Rep. Terry England, the House Appropriations Committee chair, delivered the opening prayer and gave a speech emphasizing the need to seek divine wisdom and use one's intelligence to help others.\n- The speaker praised Rep. England's friendship and character.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nA quorum was present, with members signing in electronically.\n\nAdjournment:\nThe session adjourned, with the next meeting date unspecified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nThey are convening having arrived, all members of the House will please take their seats\nAll members of the House will report to the floor and take your seats.\nMr. Clark, would you ring the bell?\nAll members, but please come to the floor and take your seats.\nWe are going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nThe clerk will unlock the machines.\nhave all members voted have all members voted\nIt's amazing what those cards will do when you put them in, right?\nHave our members now voted if so, the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nWell, good morning.\nanother beautiful day here today and we're getting closer to the end. I'm trying\nto look around see if we have a chaplain. I'm supposed to laugh on that. I do have\nthe honor of introducing our chaplain of the day needs no introduction to\nthis body. Y'all know him as the chairman of the House Appropriations Committee, and I\nknow him as one of the best friends I have in the world, Terry England. Chairman England\nis a man of integrity. I don't know anybody that's got a kinder, more gentle spirit than\nAnd he does, and who walks close with our Lord each and every day, and it's reflected\nin his life in all areas.\nHe and I have laughed together.\nWe've been to the mountain top together, into the valley together, mountain top and we're\nfun, isn't it?\nYeah.\nThought so.\nWe buried friends together, and so I cherish the relationship that I have with him, and\nI know that you're going to be in for a real treat today.\nIt is my honor, my personal privilege to introduce to you at this time, Deacon Terry England\nof the Auburn 1st Baptist Church in Auburn, Georgia.\nWell, you heard him say I was bad, just...\nIt was a little boy in church this past Sunday, our preacher loved him dearly, and he\ngets a little long-winded sometimes, and he said in conclusion, a little boy looked at\nhis daddy and said, daddy, what does it in conclusion mean, and his daddy said with\nhim, absolutely nothing.\nBut good morning, everybody.\nThank you Mr. Speaker for those kind words and I can't put into words what your friendship\nhas meant to me and absolutely we have been on the mountain tops and we've been in the\nvalleys and all of those times that we've been on the mountain tops and we've been in\nthe valleys the thing that I know that you've known and the thing that I've known while\nwe were there is that the spirit was with us and walking with us and if you\nknow in the Psalms it talks about yeah you know I walked through the valley of\nthe shadow of death it says he's walking the person you are walking through the\nvalley of the shadow of death it doesn't say the Lord is carrying you but it says\nhe's walking there with you so that's something I'll always important to\nremember. You know I've I wanted to do this for quite some time and I've told\nMiss Kathy and told Miss Leisha before her that if we ever wind up that that\na preacher couldn't couldn't be here or whatever to to let me know and I'd been\nglad to kind of pinch yet for a day so speaker mentioned I'm a\ndeacon in our church small little church and Auburn George Auburn first\nBaptist. When I was ordained, there were four things that we were told that we\nshould be expected to do. One, be ready to preach the Word. Two, always be\nready to pray. Three, always, always be ready to lead someone to Christ. And four,\nalways be ready to take up an offering. So I'm going to ask the ushers if they will\ncome forward we'll take up a little offering but I don't know exactly what I'm\ntalking about there so several years ago when I ran for office in 2004 and\nduring that election cycle I had a gentleman that worked for us at our feed\nstore Mr. George and George was he was just a hoot but just a godly man and\nAnd just a pleasure to be around, always smiling and always had you back.\nAnd we joked, and a lot of ways we called him the chef, because he drove the fork lift a lot.\nWell, usually in it, and inadvertently, he would stick a fork from the fork lift in a bag of feed.\nSo we called him the chef, because he was always checking, see if stuff was done.\nBut George relayed to me one day in the middle of the campaign, a dream he had.\nNow, when someone tells you about a dream that they had\nthat involves God, you probably need to listen.\nAnd George relayed to me that day.\nHe came straight to me that morning.\nHe'd always get there early.\nAnd I'd always get there early.\nHe came straight to me in office that morning.\nHe said, Terry, had a dream last night.\nAnd you need to look at James 313.\nI said, okay.\nNow, I understand James is my favorite book of the Bible.\nSome of you may have heard me refer to the book of James\nas a cliff note to the Bible,\nbecause it kind of covers all the bases in five chapters.\nAnd so I'm like, okay, the tongue that I got to look\nand see exactly what 313 is.\nSo in the King James version,\nwho is wise man and in dude with knowledge among you?\nLet him show out of a good conversation\nhis works with meat-ness of wisdom.\nDropping on down to verse 17,\nBut the wisdom that is from above is first pure,\nthen peaceable, gentle, and easy to be entreated,\nfull of mercy and good fruits,\nwithout partiality and without hypocrisy.\nAnd summing up in 18, and the fruit of righteousness\nis sown in peace of them that make peace.\nSo, read that, when I first read it in the King James,\nI'm kinda like, well, was,\nGeorge kinda couldn't meet when he said that\nbecause you know, you read it in that old English.\nSo you pull up a couple of different versions\nand you kind of start realizing what it's saying\nand what it does.\nAnd I think you all understand what it's saying\nis seek wisdom from God, seek wisdom from the one above\nbecause that is the best wisdom.\nThe earthly wisdom we have carries nothing for us\nbut hurt and heartache.\nBut the wisdom from God is the wisdom\nthat carries us through every day.\nDown in my office, there's a big whiteboard.\nMany of you have been in there\nand you've seen James 313 up there\nin that little right hand corner.\nIt's been up there the entire time\nthat whiteboard has been there.\nJust kinds of daily reminder to me\nthat when in those times that I think I'm super smart\nor really did something great,\nyou know, I look up there and I see that and realize,\nWell, I was just an instrument.\nI was God's tool in doing that.\nIt wasn't me.\nIt was nothing about me that enabled me to do what I have done.\nAnd that's with all of us in this room.\nWe may think we're super smart.\nAnd many of you in this room are incredibly smart.\nMost of you in this room are incredibly smart.\nAll of you in this room, I better make sure I get that right.\nAll of you in this room are very smart.\nBut, you know, the good Lord gives us that intelligence\nand expects us to use it in ways that help others.\nAnd I think, truly, we've got an aisle\nand we talk about other sides, different sides of the aisle,\nbut I tell people at home, I tell people\nwherever where I go, that while we may all\nhave different ideologies, and we may have different\npriorities, that people come here with the heart of service,\nthat each of us are in this room to help people.\nAnd we deal with a budget every year,\na big budget every year.\nBut the thing that we always try to remember\nand Martha reminds me and I remind Martha\nand our subcommittee chairs that there's a person\nat the end of every one of those dollars.\nAnd that person's the customer.\nAnd they're expecting their state to look out for them.\nYou know, James goes on and talks a lot more and talks some about the tongue and how mighty\nthe tongue is as a as a rudder can direct a ship, a mighty ship, a little bit of rudder\ncan can move that ship through the waters.\nSo can our tongue be incredibly hurtful or incredibly helpful and that's what he reminds\nit's sobbing James is to use it to be helpful so you know we do a home we still do a traditional\nhomecoming at our church every year it's usually a lot of part of September and our church\nhas been in our community for over 130 years and we're small church and a small group of folks\nand we always have a good eating you know it's we look for eat we're bad just we look for\nreasons to eat. So, you know,\nEaster morning we have a breakfast and then Easter,\nsometimes we'll have a lunch and homecoming day we'll have a breakfast\nand a lunch and, you know,\nso homecoming this past year, we always have some folks that are\nguests that come to be with us, that family members have been part of\nthe church through the years and everything, so\nthe little lady came this year and\nlives in her community and she had on one of those, I call them\ncalm sack dresses, you know folks used to make them out of flower sacks and\neverything got two little pockets on the side and everything and this lady got\nin there that morning for breakfast and she was she had a good breakfast but\nwe kind of got to watching and she started kind of stuffing sausage biscuits\nin her pockets. Well get on in the service the preacher he's just he's he's\npreaching the word and and folks being moved well she got hold of the spirit and\nAnd come running down front at the invitation and she said,\nI want to be baptized right now preacher.\nI want to be baptized right now.\nI want my sins washed away.\nI want to be baptized right now preacher said,\nI hold on a minute.\nWe'll get to turn the spick it on and baptism will pull\nand get it full.\nAnd so run up there and she comes down in the water.\nAnd he dunks down in the water and all of a sudden\nthose biscuits come floating up out of our pockets\nup on top of the water.\nAnd one of my fellow deacons in the back of the church says,\nDunker again, preacher or sins are coming up in chunks.\nBut you know, the great part, the great part of baptism,\nand in whichever method you do.\nAnd I know, you know, the method to sprinkle and some\nusers court bottle and we always don't.\nNow, when we had the drought in 2007, we went to sprinkling the methods you went to use\na damp cloth around home because it got so dry.\nBut there's nothing that that water actually does.\nIts symbolism, but what the symbolism is, is the death of Christ and His resurrection,\nwhere He died for our sins.\nYes, it's symbolic, but it's our public profession of faith at that point when we do that, that we've accepted that we've accepted that cleansing spirit that Jesus Christ put into our lives.\nEvery day, as I start my day, and I hope many of you do, and I know many of you do because you told me, we always need to ask for that wisdom from above, along with knowledge, discernment, understanding, and grace and mercy.\nYou know, God never moves.\nWe stray away from Him and going different directions.\nOur lives get busy.\nWe've got ball games to go to and soccer matches and all those things and we stray away from\nthe Lord.\nBut I want to tell you something, the Lord will come to you.\nI said He never moved, but yet He'll come to you.\nabout that for just a little bit. He's everywhere. He's all seen. He's all\nknown. He can meet us where we are. One of my favorite songs heard it last night\ninspiration quartet when God dips his love into my heart. And if you let him\nhe'll do it. He'll do it to the point that it's overflowing. That fountain of\ngrace is something that we all need. As we wind down this special session, I\nhope that you all turn to that grace and that mercy that he provides that he\ngives so easily that he wants to give to you. As we go home next week and we're\nwith our families and for Thanksgiving, we all need to take time to be\nthankful for those gathered around us because as we look around our\ntables. There's probably going to be one that was there last year that what isn't with us this year.\nBut we need to be thankful for the time we have with those individuals and be thankful for the\ntime we have with the ones that are around the table this year. So if y'all will join me for a word of\nprayer. I was kind and gracious Heavenly Father when we come to you thanking you for this day.\nWhen we thank you for the strength that you give us, when we thank you for the mercy and grace\nthat you bestow upon us. Lord, most of all, we thank you for sending your Son to dial\non that cross for our sins that we may be free. Lord, as we're here today, if there's one\namong us who are hearing this that doesn't know you, Lord, I pray that before this day is out,\nthat they would open their heart, mind, and soul that you would enter in and that they would come\nto know you and come to know that love that only you can provide. Lord, we just love you and just\njust thank you for giving us this opportunity to be here to represent those folks back home\nour families our friends our neighbors those folks that you have placed us here in a position\nof trust to do the things that you would have us to do and all we just pray that everything\nthat we do here and everything that we say here would be things that would be pleasing\nunto you. Words that would be pleasing unto you and actions that would be pleasing unto you.\nOr be with us as we go through this day, be with our speaker, be with our governor,\nour lieutenant governor, all of our leaders across this nation, our president and many others,\nand our men and women fighting abroad to keep us free and those protect us here at home.\nBut we just love you. We thank you for all that you do and all that you've done\nAnd I love that you show us for all these things in Christ name we pray amen\ny'all would join me in the pledge\nI love you brother.\nChair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct.\nAnd furthermore, Mr. Speaker, we seldom repent for having eaten too little.\nThomas Jefferson you've been reading a lot of Jefferson lately haven't you he's my hero all right\nchairman hogan the chair of the committee on information and audits reports that the journal the\nprevious legislative day has been read and found to be correct is there any objection to the\nconfirmation of the journal the chair here's none in the journal is confirmed the clerical read\nThe resolution, establishing the order of business for the day, is there any objection\nto the adoption of the resolution establishing the order of business for the day?\nthe chair here's none in the resolution is adopted.\nSecond reading of bills and resolutions,\nthe clerk will read.\nHouse bill 11EX,\nI represent Anderson of the 10th and Irwin of the 28th,\nthe bill to authorize the city of Cornelia\nto exercise all week development,\nother powers under the redevelopment powers law,\nthree second readers.\nThere are no reports of standing committees today, so we're about to go on to morning orders.\ngoing on the morning orders.\nThank you very much.\nHurry along to the Greek Chairman England, Mr. Chairman, everybody's willing to come down\nand see you this morning.\nKelly, it's not long to January.\nD\nOkay. I think we're about to get through the line here. We're going on now to\nmorning orders. Going to morning orders. The chair will ask all the members of\nthis body to take your seats and give respect to the members in the well. The\nChair recognizes for a morning order the chief deputy\nwhip of the majority caucus representative\nLeveritt.\nThank you, Mr. Speaker.\nLadies and gentlemen, House, I rise briefly this morning\nto say a few words in memory of my mother and also to say\na couple of words about you.\nFlorence Kemp Leveritt was born down in Lawrence County\nback in 1930 on February 4th.\nAnd I don't know if they make everybody in Lawrence County\nthis way, Matt, but to say that she was outspoken\nwas quite an understatement.\nI don't know if you got to read the obituary\nthat my sister, Cheryl Williams, drew,\nbut we should all be blessed with such a good obituary\ndressman as my sister, because she nailed it.\nAs she said, if you didn't want to know my mother's opinion,\nyou'd better not ask it.\nAnd even if you didn't ask, you might get it anyway.\nUndeluted and unfiltered.\nThat's the way she was.\nShe passed away on Saturday and had been in declining health.\nShe lost me, we lost me that about 25 years ago,\nand she missed him dearly.\nBut she was a wonderful lady.\nIt was very active all of her life until dementia\ntook some of that from her.\nBut I wanna talk a little bit about all of you.\nI'm sorry I could not be here Monday for obvious reasons and I hate that Camma Clary was here\nand I hate not having been here for his devotional.\nBut as soon as the speaker made mention that Mom had passed, my cell phone almost was\nknocked out of commission by all the texts that I've got and the texts that I have received.\nSo I just wanted to say thank you to all of you, I'm sad that I have lost one of the most\nimportant members of my family and I will miss her dearly. But I'm so thankful for the\nfamily I have and all of you and just want to express my appreciation to all of you.\nThank you, Mr. Speaker. I yield well. Chair recognizes Representative Cameron for\na morning order. Thank you, Mr. Speaker.\nI rise today to remember, a great member of the Rossville Georgia community, who passed\naway suddenly yesterday, Carthell Rodgers.\nMr. Rodgers was a member of the Walker County School Board, having been recently appointed\nto fill vacancy.\nHe also was director of the Recreation Center at Rossville, Georgia, but his most important\nrole was the years and years he invested in the lives of people and the young people\nof Rossville, Georgia, helping provide recreational programs for young people disadvantaged and\npromoting their growth into adulthood. He was, uh, got to run our parade this year in\nRalsifull. He was doing something all the time to help other people. He was a great neighbor\nand a great friend to all of us. He leaves a big hole in her heart, so it will never be filled.\nSo I'd like to, uh, ask for a moment of silence in his honor.\nThank you, Mr. Speaker. I yield the well.\nWell, Chair recognizes Representative Jasmine Clark for a morning order.\nGood morning, colleagues.\nIt is with a heavy heart that we bring news of the passing of Alexander Morales.\nAlexandra Morales was a teacher at Benefil Elementary in Lawrenceville, where she served\nas a teacher since 2019.\nAlong with being a beloved member of the faculty, Ms. Morales was the epitome of inclusion\nand a beacon of representation as a bilingual teacher that truly connected with many students\nin which English was not their first language.\nIn October of this year, she took a scheduled leave and unfortunately did not return.\nAfter being reported missing by her family, her story came to a tragic end when her body\nwas found.\nThe tragic death of Miss Morales leaves a big gaping hole in the heart of the Benefield\nElementary family along with all that loved her.\nToday we offer condolences to those touched by this tragedy and ask that you take a moment\nof silence in her honor.\nThank you, Mr. Speaker.\nChair recognizes the dean of this house, Dean Smirie, and representative Duke's for\na morning order.\nGood morning, thank you, Mrs. Speaker.\nRepresentative Smire and myself come forth today,\nbecause 110 years ago, on the campus of Howard University\nin Thurgood Hall, a group of young men,\na great love, Oscar J. Cooper, Frank Coleman,\nalong with the faculty advisor,\nstarted with many feel is the greatest organization\nknown to the history of the world.\nThat being the Omega-Sythe opportunity, we would like for you to join us in celebrating\nand acknowledging this moment.\nThank you, Mrs. Speaker.\nChair recognizes Chairman Mayfeeck for a morning order.\nThank you, Mr. Speaker, and good morning, everybody.\nToday, what a perfect day to get this book, Chairman England.\nI don't see you now, but anyways, everybody should have gotten this book on their desk\nin their offices, representative Clint Crow, David Knight,\nSusan Holmes, and Beth Campani gifted each of you\ndefying the odds.\nOur pastor, Benny Tate, wrote that in many of you\nhave heard him here in the chamber.\nIt's an inspirational book of Dr. Tate's personal testimony\nof how God guided him through a number of obstacles,\nproviding him the strength he needed.\nDr. Tate serves as the pastor at Rock Springs Church\nin Melner, Georgia, and he and his congregation\npray for us daily.\nThank you, and I hope you enjoy the book.\nThank you, Mr. Speaker.\nChair recognizes representative Hugley\nfor a morning order.\nThank you, Mr. Speaker. We'd like for all of those who are members of\nPanellinic organizations to stand with us at this time. If you are a member of\na Panellinic organization, please stand. Today, as been noted, an organization\ncelebrates and a Founder's Day, the Omega-Sy-5 fraternity Incorporated.\nNovember of the 17th, 1911, this organization was founded on the principles of\nmanhood, scholarship, perseverance, and uplift. There are many famous men and great\nmen that belong to Omega. You've seen two of them this morning, but I want to\ngive a shout out to another great man of Omega. His name is Isaiah Hucley. So 110\nyears later, these men believe that friendship is essential to the soul.\nCongratulations to all the men of Omega today.\nChair recognizes representative Wynn for a morning order.\nThank you, Mr. Speaker. Today, Georgia and communities across our country\nwe will celebrate and highlight the important roles\nthat education support professionals play\nin our public schools.\nThese are the people who drive our children to school\nand serve our kids breakfast and lunch.\nESP professionals are also administrative support staff,\ncustodians, peer reform professionals,\nschool safety officers,\nand other non-teaching education members\nin our public schools.\nESP Day is part of National Education Week, starting from November 15th to November 19th,\nwhich celebrates excellence in public schools.\nAnd we know now more than ever, especially under the COVID-19 pandemic, that these education\nprofessionals are essential to the well-being of our Georgia children.\nSo today, from the Georgia General Assembly, I'd like to thank ESP Professional Support\nstaff and acknowledge their expertise and their hard work in keeping our children safe,\ngreeting them from the first moment they walk into the classroom and getting them home safely\nat the end of the day. Thank you, Mr. Speaker.\nThank you Mr. Speaker, we have stood so many times during morning orders during the special\nsession to honor members of our community who have passed into eternity including\nslain police officers. Did you know that it is more likely for a firefighter or law enforcement\npersonnel to die by suicide than it is in the line of duty? It takes a psychological toll\non our first responders, the work that they do every day. As a matter of fact, with all\nof our first responders, there is an exponential likelihood that they will experience PTSD and\nother forms of psychological injury while doing their important work. I think many of us\nare aware of the work ahead of us to improve mental health and behavioral health outcomes.\nThere's a lot of heavy lifting we need to do as a body because there's so many of these\nissues, mental and behavioral health that affects so many of our Georgia citizens. Now look\nforward in this upcoming session for us working together to move the needle in some significant\nand meaningful ways.\nIf you'd like to be a part of the mental health caucus,\nplease see me or Chairman Todd Jones.\nThank you.\nThe clerk will read the caption to a group\nof privileged resolutions.\nReconising and celebrating the long life of Doyle Akins, honoring the life and memory\nof Deborah McGee McCrary.\nCelebrating the sixth annual Women's Entrepreneurship Day, recognising Commending Mayor Joe Lockwood,\nRecognizing commending, John Quincy Terry on his outstanding service to his community,\nrecognizing and commending Mayor Mike Bodker.\nRecognizing November 21st, November 2021 is Native American Heritage Month.\nRecognizing commending Mayor Pro Tem, Tammy Pierce, on our outstanding public service.\nRecognizing and commending Mayor Jim Trott on his outstanding public service.\nrecognizing commanding Kenya and Torrance Crombley.\nRecognizing November 7th, 2021 is retired,\neducators day and for other purposes\nthat completes the reading of the privilege resolutions.\nIs there any objection to adopting the\nprivilege resolutions the chair\nhere's none in the resolutions are\nadopted we have some announcements\nto listen up for the announcements\nthe chair recognizes chairman\nCorbett for an announcement.\nThank you, miss speaker one o'clock today in the CLOB room 406 the rule development council will be meeting\nWe have two speakers lined up so everybody try to be there on time. Thank you\nChair recognizes chairman dollar for an announcement\nThank you speaker\nMembers, leaders from the Taiwan office in Atlanta have lunch for us today down in Senate\nMaz from 1130 to 1.\nPlease come by and say hi.\nThanks.\nChair recognizes the distinguished chairman of the Minority Caucus, Representative Mitchell\nfor an announcement.\nThank you, Mr. Speaker.\nof the Democratic Caucus, we will meet tomorrow morning at 8.30 a.m. breakfast will be served.\nThank you so much, Mr. Speaker.\nChair recognizes Chairman Hawkins for an announcement.\nThank you, Mr. Speaker.\nThe Budget and Fiscal Affairs Oversight Committee will be meeting today at 1.30 and room 3.41s.\nCat 3.41.\nThank you.\nrecognize as chairman Newton for an announcement.\nThank you, Mr. Speaker.\nJust an update on a lot of us have had COVID-19 vaccines.\nWe come together from all over Georgia,\nand then we go back to our families.\nWe're going to be doing that over the next few days,\nand then we'll do it over the holidays,\nand then come back in January.\nI think boosters are a critical way to make sure\nthat the vaccines work.\nThey're offered downstairs today.\nThey have all three Johnson and Johnson, Moderna or Pfizer.\nor Pfizer, there's no waiting.\nYou can come right in pretty quickly.\nYou can go in and get your booster\nand therefore help protect your family\nand help protect us when we come back in January.\nSo I hope you'll take advantage of one of our local FQHCs\nwho's put this on for us.\nThank you, Mr. Speaker.\nChair recognizes Chairman Darlene Taylor\nfor an announcement.\nThank you, Mr. Speaker.\nThe House legislative and congressional reapportionment\ncommittee will meet today in room 406 at 3 p.m. Thank you. Chair recognizes\nrepresentative Oliver for an announcement. Thank you, Mr. Speaker. The Marthock\ncommittee will meet today at 1 p.m. in room 506 in CLOB. Thank you. That completes\nour announcement and takes care of the business to come before the body. The\nChair recognizes the majority leader of this house for a motion.\nThank you, Mr. Speaker.\nThe Speaker, I move that this house stand adjourned until 10 a.m.\n10 a.m. Thursday, November the 18th, 2021.\nThe majority leader has moved that this house be adjourned until Thursday, November 18 at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it.\nThis house will be adjourned until Thursday at 10 a.m.\n",
  "updated_at": "2026-02-12T12:40:10.773755+00:00"
}