{
  "video_id": "ahqzlH7Z0xQ",
  "url": "https://youtu.be/ahqzlH7Z0xQ?t=1188",
  "title": "Georgia House - Day 2 (2026-11-30)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-11-30",
  "duration_minutes": 64,
  "summary": "Overview:\nThis Georgia House session on November 30, 2026 featured a routine opening with prayer, Pledge of Allegiance, and quorum call. The session did not appear to include any substantive legislative actions, with the bulk of the time focused on administrative matters and special recognitions.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- The session opened with a prayer delivered by Reverend Farge Dickey, who had a personal connection to one of the House members. \n- The House recognized the Georgia Building Authority's work on a capital building painting project over the summer, which allowed the building to remain open to the public during renovations.\n- A special video presentation was shown highlighting the painting project.\n\nVotes: None detected.\n\nAttendance: A quorum was established through the morning roll call vote.\n\nAdjournment: The transcript does not indicate when the session adjourned. The next session date was also not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nGood morning.\nAll members take seats, all members, please take your seats.\nAll members, please take your seats.\nAll members, please take your seats.\nThe hour for convening having arrived.\nAll members, please take your seats.\nMs. Clerk, how about ring that bell?\nYou got it, Mr. Clerk. You didn't lose a thing in that interim. You can ring that bell.\nWe're going to have the morning row call. All members present will please vote green\nto signify their presence in the chamber and the clerk will unlock the machines.\nall members voted, all members voted, I got you, take your time, I think all members\nMembers have now voted, we're not quite.\nAll members voted.\nIf so, if so, I think all of y'all are voted, Mr. Clerk, you can lock the machines.\nDoorkeepers, please close the doors and keep them closed.\nAs is our custom, we will begin our day with Scripture reading, but I'll give you a little\nprelude to our pastor today. So the pastor grew up in a little town in Middle\nGeorgia. He grew up with one of our members. That little town is called Micella\nGeorgia. The Dickey Boys from Micella Georgia's, Micella Georgia. So we're a\nForrest and and and out distinct was chairman Robert knew each other growing up and\nThey're rejoined here today\nAnd so we're we're going to be I think it'll be a good homecoming for the two of you as y'all\nHear of what each other have been doing the last few years\nOur chaplain this morning will be introduced by the gentleman from the one hundred and thirty-second house district chairman Brian Prince chairman Prince\nThank you, Mr. Speaker.\nI should have left Robert Dickey to introduce him, but they're a good deal.\nGood morning.\nIt is good.\nIt is my honor to introduce my brother and my friend.\nHe's a graduate of the Fort Valley State University and a member of one of the greatest\nfraternities in all the land, Calpa, Alpha Sa.\nThe Reverend Farge Dickey serves as a senior pastor of St. Paul's AME Church in Macon, Georgia.\nHe is married to the former Lydia Flower and they have three sons.\nColleagues, it has been said that those who require a long introduction probably don't\ndeserve one.\nAnd those that deserve a long introduction probably don't require one.\nTherefore, sit back and observe what happens when a child of God looks into the Word of\nGod and sees the Son of God and then shares the glory of God with the people of God.\nGod.\nHear ye, Him.\nGood morning, everyone.\nIt is a wonderful day for us, amen, to be thankful that we are alive and to be amongst\nthe living and not amongst the dead.\nFor that we ought to be able to put our hands together and just thank God for an opportunity\nto be alive.\nI believe it meant to speak of burns and others, speaker prints, as well as a person that\nI had an opportunity who was made an investment in his family and to my life growing up as\na young child in New Zealand, Georgia, and that is representative Robert Dickie.\nGod as I also realize the persons that are part of the districts that represent\nthe men, my part of the state of Georgia, brother James Beverly and sister\nMiriam Paris. And we just thank God for their efforts as well. But as I bid\nyou greetings, amen this morning, I just say good morning to this beloved\nassembly. And as we begin the challenges of our day to constitute the\nvalues that form our great state. It is in prayer and with humility that I'll offer some powerful\nwords today that I believe will accommodate the conscience of decision that you will make today.\nThat's a profound statement attributed to the prophet Isaiah from scripture and it's attributed to\nhim as being the one who wrote it or had the idea but it was divinely inspired by God\nGod, as he declares a moment of redemption and reconciliation to a nation that was fragmented\nfrom the very source of its stability.\nBrothers and sisters, this declaration did not require a schematic of sorts, but it was\na God-given ability to do what's right.\nAnd if done morally, ethically, and with integrity, we pray that the hearts of every constituent\nrepresent or the substratum for everything we do in this mission of this special\nsession. From the scripture is Isaiah chapter 1 verse number 18 and listen as it\nsuggests that as a result of apparent differences amongst the nation, particularly\nleaders, particularly leaders in this case, the dare should be a moment of what\nis known as reasoning. The scripture says, come now and let us reason together say at\nthe Lord, though your sins are as scarlet, scarlet, they shall be as white as snow. Though they\nbe red like crimson, they shall be as wool. As a faith leader and life coach, I believe\nthat reasoning with faith for the best possible outcomes is what makes every moment spent\nin prayer or in legislation.\nIt makes it gratifying to the soul of every servant.\nI declare your reasoning today,\nassembly, that the mighty hand of God,\nthat it guides you with wisdom,\njustice, and moderation.\nLet us pray as we stand.\nO our God, our helping age has passed.\nour hope for years to come, our shelter from the stormy blast and our eternal home.\nLord bless every leader that's represented in this assembly today and cause their\nhearts to overflow with love and joy for each other and the tasks at hand.\nLord you never said that life would be easy and with wisdom even the decisions can be\ndifficult. Teach us how to serve others better than ourselves. Let us trust each\nother to see the good that we can do to better our state, our nation, and our\nworld. We can make a difference today that would make the great state of\nGeorgia the benchmark of how to get things done the right way for the\nbetterment of the societies in which we live. Bless them now with express grace\nplace to make the better world, the better place in general and Georgia in particular.\nGive them divine providence over every thought, word, and deed.\nGod we declare in some of the great words a man of Martin Luther King, Jr. is that the\nultimate measure of a person is not where they are in times of comfort and convenience,\nthe measure you can measure them in times a man of stress and discomfort and difficulty.\nSo God, we thank you for this day and this session and we declare and believe it will\nbe one for the record books, one where people came together and made decisions that's for\nthe betterment of the entire state of Georgia in Jesus' name we pray.\nLet us all say amen.\nAmen.\nPeace be upon you.\nThank you.\nIt's due to the flag of the United States of America.\nAnd to the republic.\nThank you.\nThank you.\nThank you.\nSome photos.\nIt's good job.\nPastor Dickey, thank you for those words.\nI'm inspired.\nI can assure you and I know you've inspired people all across the state thank you members\nWe're not going to unlock the doors just yet. We're not going a lot of doors just yet. We're\nWe're gonna take care of a little\nPhotographic business right here with Ben and then we're going to have a special treat\nSo if members will remain at your seats just for a moment,\nwe're going to do something special.\nThat was three handsome guys, what am I talking about?\nSo here's our posture right now.\nMembers please take your seats.\nLet me give you a little introduction before you have the opportunity to view a really\nneat video, pretty cool, that's impacted this historic place that we're so\nhonored to serve in. As you all know, you've been here over the course of this\npast summer, there's a lot of work that went on here in the capital. And to\nmight as may sometimes, a lot of very difficult work that the contractors kept,\nmembers who were here on taking care of issues, took care of the public. This\npublic building was never closed. Never closed. Our own Georgia building\nauthority moved forward with a capital painting project. I'm going to tell you a\nlittle bit about it, but first I want to let you know it's an overall painting\nproject that was intended and has been a part of the overall preservation of this historic\nbuilding. It's almost as old as you are, but not quite. No, you can't. I want to introduce\nsome folks who were responsible for the work that took place here. They're up in the gallery\nand when I call your name, I'll ask you to stand if you will.\nThe deputy director and chief of staff, Gerald Pilgrim.\nWe all know Gerald, Gerald Stan.\nHold your plows, hold your plows,\ncause there's several of them.\nHe's the executive director,\nbut I'm gonna tell you this staff is awesome\nand they all work very, very hard.\nSo I wanna acknowledge all of them at one time.\nGryffton Pasley, deputy executive director, Gryffin, thank you.\nDanny Swan, director of maintenance and construction.\nDanny, Jeff McDowell, Director of Maintenance and Construction, great work, guys, and\nDaniel Powell, Director of Special Projects.\nAll right, now we can give these guys some applause because they work for us.\nSome work, as many of these members have seen y'all's\npersistence in working with these contractors to make\nsure every detail was tended to.\nThank you so much.\nYou all went above and beyond.\nWe appreciate it.\nNow, let me tell you our contractors work.\nCliff Harris, Cliff, you understand Cliff is a general\ncontract with Rayland construction, great job, great crew\nyou had here, and Kurt Dowling is with Denise Dowling and Associates.\nThey were the painting contractor, so Kurt, thank you, great work.\nIt looks great.\nThank you all.\nLet's give them a hand.\nAppreciate y'all coming in this morning as well, thank you.\nI'm going to give you four or five bullets on the highlights of the project, then we're\ngoing to view a quick time lapse video of the project.\nThis was pretty awesome, and this day in time, y'all.\nThis entire project was completed in just six months.\nSo this beautiful capital would be ready for the special session.\nWe did not know what's coming, but for the Christmas season, so it's so important,\nAnd it is beautiful with the decorations of Christmas tree and the point setters.\nOver 70,000 man hours involved, which is the equivalent to 800, 8,750 days.\nNow y'all all saw this, and I knew it was awesome, but I didn't know how awesome.\nTotal scaffolding brought in weighed over 180,000 pounds that was standing up for the neighbor\nthe workmen to do their jobs. Rotunda scaffolding alone exceeded 160 feet and had 21 flights\nof stairs. I'm sure all of you came in here and went up those stairs to get your exercise.\nNow this was something that I think this project Gerald has to get it right and do it right\nbecause maybe we'd not done it exactly right over the years but they removed over 20 layers\nof paint from the walls and ceilings to get it back to where it should, where it looked\nlike it would be, or something we can be proud of, will have certainly be good for years\nto come. 320,000 square feet of mesh installed. 40,500 gallons of plaster were used on the\nproject. 5,150 gallons of paint were also used.\nThat's a lot of paint.\nThat's a lot of paint strokes and a lot of spray on y'all, isn't it?\nSafety was the focus of the project.\nWith no accidents, injuries reported from either employees, contractors are most importantly\nthe public as they continue to access this building.\nAnd as I said, and I'm just confirmed by that bullet, more importantly, the capital\nremain open during the entire project.\nReady?\nY'all take a look.\nI'm amazed that the pains they took to protect this beautiful structure, marble and everything\nis here doing this entire process was pretty awesome and took a lot of time.\nYou\nYou\nAwesome job, that's six months and a lot\nto work and a lot of inputs compressed into 120 seconds.\nSo thanks for putting that together,\ntogether Gerald and you guys keeping that in place.\nThank you for your work, it looks great.\nI think we can all agree with that.\nIt looks great and it will sustain itself\nfor many years to come as we bring our friends\nand our visitors and our families\ninto this great beautiful capital of the state of Georgia.\nSo thank you again, we appreciate you guys.\nSo with that, doorkeepers, you may unlock\ndoors. If you would like to greet the chaplain, you can greet him in the\nany room and when I would encourage you to do just that. We will move on with\nthe our business of the day. I want to introduce the doctor of the day, the\ndoctor of the day resides and represents the representative, Esther Pennick's\ndistrict, Dr. Deborah Martin. She will be pleased if you come down and visit with\nher at the medical station on the second floor. If you don't need to visit her for medical\nreasons, go by and say hi to her and thank her for being here for us.\nChair now recognizes Chairman Tarvan, the chair of the Committee on Information and\nAudits, Chairman Tarvan.\nMr. Speaker, your Committee on Information and Audits has read the journals from the\nPrevious Legislative Day and found it to be correct.\nChairman Tarvan, the chair of the committee on information and audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nChair here is none.\nThe reading of the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nChair here is none and the journal is confirmed.\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative Strachan of 104th Moose following me establishes the order of business during\nthe first part of the period unanimous consensus.\nSecond reading of bills and resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfar the day. Chair, here's none and the resolution is adopted. Clerk will.\nWe have no first readers today. Second reading of bills and resolutions, the clerk will\nWe will read House Bill 1-E-X by Representative Everett of the 123rd Bill to provide for the composition and number of the state house districts.\nHouse Bill 2-E-X by Representative Persinger of the 119th Games of the 120th Association of the 104th Bill to a Men in Act providing authority for the members of the Board of Education of Barrow County.\nHouse Bill 3-E-X by Representative Stevens of the 164th Jackson of the 165th Westbrook of the 163rd Hitchens of the 161st Bill to a Men in Act to provide for the creation of one or more community improvement districts in Chatham County.\nwhich means no stability therein.\nHouse Bill 4EX by Reptile Galliard of the 160 seconds,\nStevens of the 164th,\na bell to amend and act creating a new charter\nfor the city of Garden City.\nHouse Resolution 3EX by Reptile Gamble,\nthe 15th weight of the 9th McDonald of the 26th.\nHalling of the 103rd Resolution,\nratifying Governor Brian P. Kemp's executive orders,\nsuspending the collection of matter-fuel\nand diesel fuel taxes.\nHouse Resolution 4EX by Reptile Cox\nwith the 28th,\nPantisture of the 51st,\nAbstration of the 104th,\nResolution condemning Hamas Terrorism, House Resolution 5EX by Representative Cox of the 28th.\nResolution condemning Hamas Terrorism expressing our support for the Jewish people through second readers.\nReports of standing committees, the clerk will read.\nRepresentative Shaw Blackwood in the 146th District Chairman of the Committee on Ways and\nMeads submitted the following report with Speaker.\nYour Committee on Ways and Meads is at a consideration following resolution of the House.\nto meet the report same back to the House's following recommendation, House Resolution 3-EX-DUPAS,\nrespectfully submitted, Representative Shaw Blackman in the 146th District, Chairman.\nThat completes the reading of the Reports of Standing Committees.\nThank you, Mr. Clerk.\nMembers, if members will please take your seats.\nMembers please take seats.\nWe have a very special important morning order.\nMembers, we have special guests in our gallery and they will be recognized.\nI would ask you to take your seats and give your respect\nto the gentle lady that will be in the well.\nChair recognizes Representative Terry Nillowicz\nfor a morning order representative.\nMay Chairman Knight join you as well.\nHe may absolutely.\nWe have quite a lot in common, including the fact that we are the co-chairs of the Georgia\nJapan caucus here in the House and the Georgia General Assembly.\nAnd Chairman Knight and myself, we're very honored this morning to, and we're honored right\nnow, to join with all of you in the House to welcome a very special guest to the gallery.\nAnd that is Deputy Consul General of the Nation of Japan, Memoru Fukunaga, who we have been\nable.\nI'm going to ask him to stand.\nAnd if we could all recognize him.\nFor the past several years, Deputy Consul General Fukunaga has been a dedicated and\nthoughtful and committed diplomat and friend\nto the state of Georgia on behalf of the nation of Japan.\nAnd today, it was artisting to honor, to recognize him\nas an honorary Georgia citizen.\nHe is departing Georgia soon to actually go to the embassy,\nthe Japanese embassy in Beijing, in China.\nAnd I know that his skills with diplomacy and friend\nShoring will be very valued there in Japan on behalf of China.\nAnd again, we are so happy to give him the honor of being an\nhonorary Georgia citizen, as special thanks to everything he has\ndone for this 50-year-long friendship between Georgia and\nJapan.\nThank you.\nI echo that, and thank you for your hard work.\nI know over the last three years you've put in, we have\nreally strengthened our Georgia and Japan caucus.\nAnd a lot of that goes to your hard work.\nAnd we really appreciate that and look for continued success\nand our relationship with Japan.\nAnd thank you again for your hard work.\nWe really, really appreciate you and we'll miss you.\nThank you, with that we yield.\nThanks to both of you, honorary citizen, that's pretty cool.\nThank you for your service, thank you for your presence in Georgia, thank you for the\nrelationship our countries have and safe travels as you move around this world, fulfilling\nyour obligations to your country.\nThank you so much.\nWe appreciate you very, very, very much.\nAnd I may add, members of this House, a former member of the House, Tom Taylor, German\nTom Taylor.\nTom is been very instrumental in building these relationships.\nWe appreciate you, Tom, as well.\nIt's good to have you back in the House.\nWe're going to we're going on to privilege resolutions and and then we're going to do some afternoon\norders and then some announcements so let you know the run of run of the order today.\nSo the clerk will read the caption to a group of privileged resolutions, Mr. Clerk.\nHonoring the life and memory of Dr. Linny Lewis-Darden Jr.\nHonoring the life and memory of Denise Lynetta Love.\nCongratulations on the city of McDonald's Georgia upon its bicentennial,\nrecognizing commending, David D to J, D to La,\nRecognizing and commending Melanie Hammett on a outstanding public service is the mayor of Pined Lake and\nCommending the Association of Nigerian Physicians in the Americas and Nigerian Physicians Advocacy Group and for other purposes\nI can please the reading the privilege resolutions\nIs there any objection to adopting the privilege resolutions?\nChair here's none and the resolutions are adopted\nWe're going to move on to afternoon orders in the morning, and we have three afternoon\nmorning orders.\nWe'll start with Chairman Wiedauer.\nHe has some pretty awesome information he's going to bring to us.\nSo you're ready, Representative Weedauer, and Representative\nMatthew Gamble has also recognized to join Representative Weed\nauer for a really important announcement here.\nGood morning, colleagues, am I ready?\nYou're ready.\nAll right, all right.\nWe all, I want to, one analogy I used down here a lot is I used\nfor George basketball, and I say all the time that it was great going on the court, but\nit's always more fun bringing people on the court, right?\nSo I think about that when I think about the Georgia Civics program and the youth assembly\nthat happens a lot of times in this very chamber with middle school and high school students.\nMatthew and I both have been very supportive of the program.\nWe try to get a little more exposure for them when we can, but this week, I also got\nto introduce a Madam Speaker, Weed Hour, who my daughter became the next speaker, the\n80th speaker of the House for the Georgia Youth Assembly.\nBut it's a great program if you guys want to know anything more about it.\nRepresentative Gamble and myself would love to talk to you all about it.\nBut thank you.\nThank you.\nShe obviously gets her a skill set from her mother, there's no doubt about that.\nCongratulations, Representative Weed Hour.\nI know you're very, very proud of her.\nAnd share with her if she can come and assist the speaker\nany time she'd like to be more than glad to have her.\nYou're the same, we're a great, great program.\nRepresentative Kennedy has recognized for\na afternoon morning order representative.\nThank you, Mr. Speaker.\nAs you know, on November 19th,\nWe lost First Lady Rosalind Carter, but also on that same day,\nwe lost another important voice and influence\nin the person of Bishop Carlton Pearson,\nyou see his image on the screen.\nYeah, Bishop Pearson found his home in Tulsa, Oklahoma,\nwhere he went to Oral Roberts University.\nHe started his church higher dimension,\nwhich is one of the first mega black churches\nin the country, thousands and thousands worship there.\nEvery week, he also launched the Azusa Conference,\nwhich was a very high octane conference\nin the 80s and 90s that highlighted\nPentecostal preaching and music.\nIt was also the launching pad for now several\nnational and international ministries\nthat found their launch at the Azusa Conference,\nincluding TD Jakes, Joyce Meyer, Miles Monroe,\nmusicians like Donnie McClurklin, Gary Oliver, Carmen.\nBishop Pearson also had a strong footprint\nin connection in Georgia.\nThere's several Atlanta Metro pastors\nthat consider him to be their spiritual father\nand mentor, D.E. Park, Jim Swilly, David Alexander, John Scott.\nI didn't have a personal relationship with Bishop Pearson,\nbut he strongly influenced my spiritual walk\nwith his teachings and his writings.\nSo his funeral is today and tomorrow in Tulsa.\nLet's take a moment to honor him in this house.\nBishop Pearson, Rest in Power, Rest in Peace,\nyou change the world.\nThank you.\nThank you, Representative.\nMy prayers go out to his family.\nRepresentative Al Williams, he has some friends representing Frazier and representative\nHigley are going to join representative weeps.\nNow y'all listen up, this is something we should all pay attention to and I hope that\nwe will all participate in.\nIt's a great ceremony that he's responsible for and these ladies are responsible for making\nsure occurs each year so listen up. Thank you Mr. Speaker. Before I proceed I certainly\nwon't extend my condolences to the Pearson family. I knew Bishop Pearson we share\nthe table for the trumpet awards in 2008. That blesses memory. We're here to\nremind each of you that the annual E.C. Tillman Memorial Prayer\nour complication.\nWe'll again this year be on the south,\nin the south wing of the capital at two o'clock\non January the 7th.\nSome of you are regular participants.\nI wanted those of you that have not had the opportunity\nto come yet to know that no, we don't take up a collection.\nSo you certainly can come.\nWe thank the speaker who will certainly be there this year,\nand it's always special with this year.\nWe will certainly memorialize our former colleague,\nTish Nagisi, and this will be at two o'clock.\nAnd so please come and enjoy this moment.\nAnd the reason we don't pass a plate\nis because these two representatives,\nrepresentative Hewgley and representative Frazier,\nWe finance it ourselves and we do take love offerings, but we, some of y'all know what\nthose are, but look, we look forward to seeing you.\nIt's a great day of celebration and fellowship, and it's the last time for the session starts\nwhen no blood is let.\nSo you all can come and feel safe.\nBless you.\nThank you, Mr. Speaker.\nAre you well?\nI heard the rumor that you may sing this year, is that accurate?\nI'm under contract. I can't sing in this. You meet my price.\nLove offering. That's what you're talking about.\nY'all, I will encourage you to come. It's a great ceremony that's always\nreally meaningful on the message that's presented.\nThat completes our morning afternoon, afternoon morning orders.\nNow we do have some announcements, we do have some announcements.\nRepresentative Cameron, are you ready?\nRepresentative Cameron has a special announcement as well.\nAnd so we'll recognize Representative Cameron.\nThank you, Mr. Speaker. Good morning, colleagues.\nI was asked to make this announcement this morning.\nPlease join the Governor, First Lady, and First Family\nfor the Capitol Christmas Tree lighting\non Monday, December 4, 2023 at 11 a.m.\nin the North Wing of the Capitol.\nThe tree was donated anonymously from someone\nin Lafayette, Georgia, which is my district,\nthe Queen City, which is home of the honey\nbefest of every year.\nSo please join us Monday for this beautiful Christmas tree\nfrom Walker County, Georgia.\nThank you very much.\nThank you, Miss Speaker, I yield the well.\nIt's a beautiful treat.\nDid you cut it down?\nYeah, I used to think that I saw it.\nCome on now.\nIt is beautiful, thanks, and let your folks up there\nknow that we appreciate it.\nAnd so this beauty of this capital.\nChairman Richard Smith has recognized\nfar an announcement.\nYeah, it's time to get started.\nCommittee on Rules will meet tomorrow morning at 815.\nWe will start promptly at 815 in room 341.\nSee you there.\nWhat time do you say 815?\n815.\nOkay.\nI'm glad your time changed.\nChairman Williamson is recognized for an announcement.\nThank you, Mr. Speaker.\nThe majority caucus will have a breakfast tomorrow morning.\nIt's not an official caucus meeting.\nThe majority caucus will have breakfast.\nIt's 7.45 a.m. in 403.\njoin us if you'd like to.\nCouple more announcements.\nWe'll barchette.\nGentlemen from Waycross has an announcement.\nThank you, Mr. Bigger.\nThe Special Study Committee on Access\nto Freshwater for Hunting Fishing\nwill have a meeting upon a German 11 o'clock\nor 11 o'clock at room 132.\nSo 132, thank you.\nThank you, Mr. Bigger.\nThank you with Perchette, Chairman Dickey has an announcement, Chairman Dickey.\nThank you, Mr. Speaker, members of the Agriculture and Consumer Affairs Committee.\nWe have a meeting in 4.3 at 12 o'clock, we have lunch, and then several speakers after\nlunch.\nSo up in 4.3, Agriculture Committee, hope you'll be there, thank you.\nwhat's for lunch he ignored that just like at home I get ignored chairman\nlever it is recognized for an announcement thank you mr. Speaker redistricting\narea portionment will meet in the CLOB 506 removing up one floor for the rest of\nour meetings at one o'clock today that's a reapportionment in CLOB 506 at one\nThat completes our announcements. Now I have a question. It's not an announcement.\nHad two members I know of that joined yesterday, out on Mitchell Street, how many people\ngave blood yesterday. Raise your hands. New one, one, two, four, five. That's not good enough.\nWe will have another opportunity in the near future, so it's an important deal. I mean,\nif I can do it, you can do it. Next time we have that opportunity, we need to give blood.\nNo more announcement.\nThat concludes our business for this day.\nThe majority leader of this house has recognized for a motion.\nThank you, Mr. Speaker.\nI move that this house stand in recess until 6 o'clock PM today and then stand adjourned\nuntil 9 a.m. on Friday, December 1st, 2023.\nOn the motion of the majority leader that this house stands in recess until 6 p.m.\ntoday at which time will be adjourned until Friday, December 1, 2023 at 9 a.m. All those in\nfavor will say aye. All those opposed will say no. It's very clear up here. The eyes\nhave it we are in recess to be adjourned at 6 p.m. today. Thank you for being here.\n",
  "updated_at": "2026-02-12T12:31:29.401267+00:00"
}