{
  "video_id": "ajF2YMaLBHQ",
  "url": "https://www.youtube.com/watch?v=ajF2YMaLBHQ",
  "title": "Georgia Senate 2026 - Day 5 AM Session 1",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": null,
  "duration_minutes": 51,
  "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 5 AM Session 1 transcript:\n\n**Overview**\nThe session featured the introduction of several new bills, including SB 170. There was a brief discussion and unanimous consent to excuse certain senators, as well as the opening prayer and pledge of allegiance.\n\n**Key Actions**\n**SB 170**: No details provided on this bill.\n\n**Bills Introduced (First Reading)**\n- SB 401: Amend Part 14 of Article 6 of Chapter 2 of Title 20 related to other educational programs under the Quality Basic Education.\n- SB 402: Amend Chapter 5 of Title 49.\n- SB 403: Amend Article 5 of Chapter 12. \n- SB 404: Amend Article 1 of Chapter 9 in Title 9.\n- SB 405: Amend Code Section 15-10-2.\n- SB 406: Amend Title 4-3.\n- SB 407: Provide for a homestead exemption from Cherokee County School District ad valorem taxes.\n- SB 408: Amend an unspecified section.\n- SB 409: Unspecified subject relating to insurance and labor.\n- SB 410: Amend Part 1 of Article 1 of an unspecified section.\n- SR 579: Honor the life of Sergeant Major Transportation.\n\n**Notable Moments**\n- The Senate President welcomed a group of young girls who accompanied a senator.\n- There was a brief discussion about dispensing with the reading of the journal, which was ultimately done by unanimous consent.\n- Announcements were made about upcoming opportunities for new committee chairmanships.\n- A new senator led the chamber in the pledge of allegiance and introduction of the pastor of the day.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nThe Senate President recognized and excused several senators who were absent.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session will take place.",
  "transcript": "Good morning everyone. Good morning. The time for convening has arrived. The Senate will come to order.\nAt this time of last, all unauthorized personnel to exit the chamber.\nExcept for those three beautiful little girls right there that came with Senator\nfrom the 50th right there. Senator, is that your daughter's right there?\nHey girls.\nHey awesome.\nI recognize Senator from the 6th.\nSenator, you alright back there?\nJust checking in.\nYour favorite lap dog here.\nMr. President.\nMr. President, the Senate met pursuant to a German at 10 am today.\ntoday was called to order by the president. Senator Brass of the six reported that the\njournal the previous legislative day had been read and found to be correct. By unanimous\nconsent, the reading of the journal was dispensed with, but not today. The journal was confirmed.\nThe following Senate legislation was introduced. Read the first time and refer to committee.\nBill 399 by Senators Harbin of the 16th.\nAlvers of the 56, Hatchet of the 50th.\nBirds of the 23rd and Anivatori of the 31st and others.\nYou know what?\nThis thing's been read and found to be correct.\nI believe we dispense with the reading of the journal.\nAll right.\nIs objections to dispensing of the reading of the journal?\nChair here is none.\nThe reading of the journal is dispensed with.\nIs there objection to the confirmation of the journal?\nChair here is none.\nThe journal is confirmed.\nThere will be open applications or interviews\nfor new rules, chairments in the very near future.\nAs you can see, it's not a high bar.\nSo, but we do love our senator from the six.\nAll Senators who have bills and resolutions introduced, please bring them to the Secretary's\nDistricts at this time, first reading, and references the Senate Bill and resolutions.\nSenate Bill 401 by Senator Williams of the 25th and other, will be entitled to an act to amend Part 14 of Article 6 of Chapter 2 of Title 20 of the Official Court of Georgia Annotated.\nRelained to other educational programs under the Quality Basic Education.\nSenator Bill 402 by Sen. Tillery of the 19th and others about to be entitled to an act to amend chapter 5 of Title 49 of the official court of Georgia.\nSenator Bill 403 by Sen. Kurt Patrick of the 32nd and others about to be entitled to an act to amend Article 5 of Chapter 12.\nI send a bill 404 by Senator Settler of the 37th and others and bill to be entitled to an act to amend Article 1 of Chapter 9 in Title 9\nSenate bill 405 by Senator Settler of the 37th and bill to be entitled to an act to amend Code Section 15-10-2 of the Official Code of Georgia Energy\nSenate bill 406 by Senators Brass of the 6th and others bill to be entitled to an act to amend Title 4-3\nSenate bill 407 by Senators Dickerson, the 21st and others, bill to be entitled to an act to provide for a homestead exemption from Cherokee County School District\nat Valarim taxes for senator bill 408 by senator's orok of the 36 and others\nabout to be entitled an act to a man's\nby senator's walk\nOh senator bill 409 by senator's walker the third of the 20th insurance and labor\nsenator bill 410 by senator's brass of the 6th and others about to be entitled an act to amend part 1 of article 1\nthe\nresolution five seventy nine\nby centers and a target of the\n31st and others resolution\nhonoring the life of Sergeant\nMajor Transportation.\nThank you, Mr. President.\nThat could be the order.\nSector.\nIt is now time for the morning roll call.\nCall any motion to excuse recognize center from the 41st.\nThank you, Mr. President.\nI ask for unanimous consent to excuse the following senators the senator from the 33rd,\nthe 10th, the 14th, the 2nd, and the 28th, and the 43rd.\n33, 10, 14, 2, and who?\n28, and 43.\nOkay, without objects and senators from the 33rd, the 10th, the 14th, the 2nd, the 28th, and the 43rd will be at SKUs.\n43rd is here.\nAll right, duly noted.\nGlad to have y'all. Any other motions at SKUs?\nhere's a secretary we'll call the roll senator seek to fight your presence by\nvoting the a switch secretary on likes unlock the machine\nYou\nYou\nIt is now time for our morning devotion, all senators, please take your seats.\nDoorkeepers, secure the chambers at this time.\nWe have one of our new members, one of our new senators who will be leading us in the\npledge and also has the pastor of the day but he also has his lovely wife\nKering here today is here by give Kering Dickson a round of applause very nice to\nhave her here today and as y'all all move it it takes strong spouses to put up\nwith elected officials and so but great to have you here and wish y'all the best\nYes, recognize the senator from the 21st, the leaders in our pledge.\nThank you, Mr. President.\nIf you would please stand and join me with the legislative flag, please.\nA pledge of allegiance to the flag of the United States of America and to the Republic for which it stands.\nOne nation, under God, in indivisible with liberty and justice for all.\nand now to our Georgia State flag.\nI pledge allegiance to the Georgia flag\nand to the principles of whose it stands.\nWhere is the justice of our nation in the courage?\nSir, thank you, good morning.\nIt's my distinct honor to introduce our pastor today,\nDr. Reverend Kinney-Aud.\nDr. Aud to seize him, pastor, leader in executive coach\nwith more than 20 years of experience,\nhelping individuals and organizations clarify vision, develop strong leadership,\nand allow them purpose with impact. He currently serves as a lead pastor,\nCanton First Methodist Church in Canton, Georgia, where he leads a thriving congregation,\ndeeply committed to discipleship, community engagement, and mission-driven ministry.\nBefore entering full-time ministry, Dr. Wright served our nation with 10 years in the United\nof State's Air Force, in 14 years with Delta Airlines, experiences that shaped his collaborative\nleadership style across both public and private sectors. He's a professional certified\ncoach and endorsed life coach with the Global Methodist Church and a certified law enforcement\nchaplain. Academically, he holds a Doctor of Ministry from Asbury Theological Cemetery,\na Master of Divinity from Candler's School of Theology and a Bachelor's degree from Embry\nReal Aeronautical University.\nDr. Ott lives in Walsh, Georgia with his wife, Kathy,\nand remains deeply committed to strengthening churches,\nleaders, and communities across our state.\nPlease join me in welcoming our pastor of the day,\nDr. Reverend Kinney-Eye.\nGood morning.\nMembers of the Senate, thank you for this privilege\nof being here today, and I want to say thank you\nespecially to Senator Jason Dickerson\nfor the invitation.\nAnd I want to say thank you to all of you for what you do.\nI know what you do is a hard job.\nAnd we appreciate that you work on behalf of us\nwho live here in the state of Georgia.\nAs you all well know, there is real weight\nthat comes with being a public servant.\nThe decisions made in this chamber help shape lives,\nand they help form our communities,\nand they determine the future of our state.\nAnd with that responsibility comes complexity\nand pressure and moments when the right path, as you know, is not always immediately clear.\nBecause this type of responsibility carries weight, it also requires resolve and experience,\nbut more important than that, at least in my opinion, I believe it requires wisdom.\nThe Scriptures speak directly to this in a way that serves us well.\nJames 1 and 5 promises us that if any of us, like wisdom, let them ask God who gives\ngenerously to all without reproach and it will be given to them. One of the wisest\npeople I ever met was my paternal grandfather. We called him Papa Watt. His name\nwas William Robert Ott and he embodied this promise more than anybody that I've\never met. Papa did not have the opportunity to finish high school because of\ncircumstances in his life. He was a truck driver, he was not a public servant,\nand he never claimed to have all the answers.\nBut where I grew up, he was the steady wisdom\nthat people who knew him trusted.\nOne of the things that Papa taught me\nand something that I have never forgotten\nwas that wisdom is not about having all the answers.\nIt's about knowing when and where to go find those answers.\nAnd as I've grown and as I've watched other leaders\ncarry this real weight of responsibility,\nI can affirm that pop always right.\nWisdom is not having all the answers,\nbut knowing when and where to go find them.\nAnd James 1, 5 affirms that for us.\nIt begins with a very freeing assumption that I think\nthat we should all embrace if any of us lack wisdom.\nNot as a criticism, but as a reality.\nBecause there are times when we just have to struggle\nto find the right answer.\nLeadership often places people in situations\nwhere experience and expertise\nand good intentions alone are just not enough.\nWisdom is more than information, it's discernment.\nThe ability to see clearly\nto weigh competing positions into act with integrity\nwhen outcomes are uncertain.\nJames invites leaders to ask God for this wisdom,\ntrusting God's character who gives generously\nwithout reproach.\nThis reminds us that God does not shame us\nor look down on us when we are uncertain about things\nor when we are indecisive.\nIn fact, God welcomes that honest dependence.\nFor Christians, that wisdom is not abstract\ntowards an ethereal.\nWe believe God's wisdom is made present\nthrough the Holy Spirit, that presence in our life,\nGod in our conscience, sharpening our discernment,\nand studying our hearts when we're under that pressure.\nThe Holy Spirit does not de-force decisions upon us, but it clarifies matters most when voices\nare loud and that weight of responsibility is heavy.\nSo in a culture that often rewards certainty and punishes hesitation, this scripture offers\na very different vision of leadership.\nOne where humility is strength, and asking for wisdom is actually an act of courage.\nAnd so my hope today is not that I would tell you what decisions to make, that's certainly\nnot my position, but that you might be encouraged about how to carry that responsibility that's\nbeen entrusted to you.\nWith humility, with openness, and with willingness to seek wisdom beyond yourselves for the sake\nof those people that you serve.\nWould you please pray with me.\nof wisdom and mercy we give thanks for these men and women who carry the responsibility\nof public service.\nI pray, O Lord, that you grant wisdom generously without reproach and that you would let your\nHoly Spirit guide their hearts and their minds with clarity, humility and discernment.\nWhere decisions are complex, I pray, O Lord, that you would bring clarity.\nWhere that pressure is heavy, I pray that you would give them peace and steadiness.\nAnd where there is disagreement that you would bring respect and peace.\nGod may all serve in this place, do so with integrity, compassion, and care for the common\ngood.\nWe trust in your presence and guide us in Jesus' name we pray.\nAmen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIt is always a pleasure to have the\nand to introduce the good man who came here to volunteer his time for us today as\nour senator from the 41st. Thank you. Thank you, Mr. President. Good morning\ncolleagues. It's my honor here to present to you all. I'm reintroduced for some\nDr. Steven Holbrooke. He is an EMS doc who does emergency medicine. What's\nreally a meaningful to my community in particular was that he helped open up\na pill-and-dell hospital that serves a lot of my constituents\nin the Cab County, make sure that EMS works.\nAnd most fondly to my heart, he has served as the medical\ndirector for EMS programs, both at Emory and now at Georgia Tech\nfor students, which is where I learned all of my EMT skills.\nI worked at Emory EMS, and so really grateful for him\ncontinuing that work to expand opportunities for students\nearly on to get engaged with emergency medicine\nand grateful for all he does to save the lives of Georgians.\nWith that, I will turn it over to Dr. Holbrooke.\nAll right.\nThank you.\nIt's good to be back here again.\nAppreciate all the work that you guys do.\nDo remember the EMS and the emergency room folks\nbecause all of us end up using them at some point in time.\nReally do appreciate all the work you do.\nThank you very much.\nHave a good day.\nAll right.\nGood job, Doc.\nThank you.\nAppreciate it.\nAre there any missed concerns?\nDoes any Senator wish rise on the point of personal privilege?\nRecognize the Senator from 17th for the point of personal privilege.\nThank you very much Mr. President, colleagues I rise today to recognize two persons, both\nare relatives, one Mrs. Emily Stenson, who is the mother of Reverend Dr. Michael Stenson,\nWe probably remember a couple years ago, he was our chaplain of the day.\nShe was a graduate of Spellman College, a member of Africa, Africa, Africa,\nfraternity, a sorority incorporated.\nShe was an educator here in the City of Atlanta for over 30 years.\nAnd a member of Warren United Methodist Church.\nThe second one is also a family member, Miss Brenda Hambrich Shaw,\nis a relative and also a constituent down in Stockbridge.\nShe was a graduate of Fort Valley State University,\nand she was an educator there in Hinder County\nfor over 30 years.\nMrs. Nesson celebration of life will be today,\nand Mrs. Shaw in here in Atlanta,\nand Mrs. Shaw on tomorrow.\nBut today I joined with other judges\nand remembering them and celebrating their wonderful life\nand all that they did for their community\nand certainly for the children of the state of Georgia.\nThank you very much, Mr. President, I yield the will.\nThank you, Senator.\nOur condolences go out to the family.\nWe're gonna send it from the 44th\nfor a point of personal privilege.\nThank you, Mr. President.\nI just wanted to call everyone's attention to the Georgia Partnership for Excellence\nin Education's annual top 10 issues to watch in education that is on your desks.\nThey really do tremendous work, very detailed policy base helping us formulate excellent\npolicy around public education and moving our schools forward, ensuring that everyone\nhas, every Georgian has the opportunity to thrive from early childhood ed all the way\nthrough secondary.\nIn particular this year, they've highlighted issue five is the student attendance issues\nthat we've really been grappling with, particularly ever since the pandemic.\nAnd another big topic in this one that I wholeheartedly agree with is the need to use data\nto drive more of our decision-making than we have\nhistorically done.\nAnd this, they believe, the partnership believes\nthat this is particularly important in light\nof Governor Kim's announcement yesterday\nof the $325 million that we are wanting\nto move into needs-based higher-ed funding.\nSo in light of that announcement,\nIt is a great time to, across the board,\ntry to consider this session moving policy forward\nin concert with where the data shows investment is needed\nto achieve the results that we want to achieve.\nSo please take a look at it.\nThank you so much, Mr. President.\nI yield the well.\nThank you, Senator.\nWe're gonna have Senator from 34th.\naffordance.\nCommitted in the\npromoting excellence and fostering unity.\nToday, we proudly honor that vision rooted in\nenduring principles of scholarship, service,\nsisterhood, and finer womanhood.\nAs we celebrate our 106 year of service and sisterhood,\nand unite in our global day of service,\nwe pause to reflect on just how far we've come.\nWe stand firm in the legacy built by those who pave the way.\nWe are caring for the promise to advocate for change, uplift communities,\nand strengthen the families across the globe.\nToday, I just want to say, happy Founder's Day to the women of Zayda Phi Beta Sorority Incorporated.\nThank you.\nAll right, thank you Senator.\nRecognize the senator from the 38th, 4-pointed person privilege.\nYeah, figure this mic out, huh?\nIt's new.\nLike so many of you, so many Georgians and folks in here,\nI'm heartbroken over the killing of Renee.\nWe're getting Renee Nicole good.\nMy thoughts are with her family and her children.\nThis is a loss of life that did not have to happen,\nbut what happened to Renee has sent shock waves\nthroughout our country and even here in our state\nand has actually driven people further and further apart.\nI want to make it clear.\nI strongly disagree with the policies\nthat led to the loss of Renee's life.\nBut just because I disagree with those policies,\ndoesn't mean I have to hate the people who voted for them.\nThat's why I'm standing here today to ask you, my colleagues,\nto take up the mantle of bipartisanship\nso we can move past situations like these.\nAs we start this new session, this week has shown us\nthat we can come together and be above\nthe partisan politics that has so entrenched our nation\nand our state in the past.\nWe're in a heavy moment for our state and our country.\nPeople are angry, fearful, and hurting.\nIn times like this, we have a choice.\nWe can add to detention, or we can lead with calm,\ncompassion, and purpose.\nGeorgians aren't asking us for us to fight each other.\nThey're asking for us to focus on what matters\nmatters most.\nAffordability, healthcare access, housing costs,\nthe literacy crisis, take your pick.\nAs we start this session, I'm calling on all of us\nto set a new tone that reflects the best of Georgia,\nsteady, thoughtful, and committed leadership\nto healing and not dividing.\nSo in the spirit of bipartisanship colleagues,\nI'm asking that we stand for a moment of silence\nin honor of Renee's life and to honor her family\nat this time.\nSenators ask for one stand and\nrecognize moment of silence.\nThank you colleagues.\nThank you Mr. President.\nI yield a well.\nThanks Senator.\nBring it out of the center from the 50th.\nWe're appointed personal privilege.\nThank you, Mr. President.\nI rise today just simply to acknowledge three of my favorite constituents that I brought\nwith me today, Halley, Hazel, and Heidi.\nTheir younger sister Hope is still at home.\nHer birthday is on Monday, but we decided to let them have an excuse absence from school\ntoday and come down and help me work.\nIf y'all see them, please say hello.\nHalle, Hazel, and Heidi, can y'all wait for us?\nHey, hey, hey, hey.\nI yield the will.\nYes, good looking bunch of kids, good looking bunch of little ladies right there.\nYou go have a hard time in about 10 years, Senator.\nOh, times are coming. You won't look so young.\nRecognize sir from 35th.\nThank you. Thank you, Mr. President. Also, thank you to new colleagues and those that have\nof a press my button for me so well, two days in a row.\nI figured this time, and I figured this time,\nI'll be excited to take you up on that.\nSo I come here to just express deep sincere gratitude\nfor this body.\nDeep sincere gratitude for elected officials.\nI'm a follower of Jesus who has a deep regard for authority\nfor government, and I know that we live in a world that defines that in so many different\nways.\nI believe in our systems, I believe in our institutions, but I also come here with an\napproach about loving God and loving people for real.\nAnd the idea of defining our, well, challenging our definition of who our neighbor is.\nAnd the moment I step in this chamber, every single one of you helped me to expand my\ndefinition of who my neighbor is.\nI come here representing the grandparents in South Fulton, the children in Southwest Atlanta,\nthe business owners in Northwest Atlanta.\nMy patients at Invinings in Cobb County and those in Smurna, Smurna, Georgia.\nAnd when you welcome me the way that you have, you welcome all of them.\nAnd so I thank you for not only expanding my view of who my neighbor is, but I pray\nthat I can do my best part to help expand yours.\nSo I look forward to not just a session that we can get through, but having the most\nfruitful, fruitful session that we've ever had.\nGeorgia has an opportunity to continue leading,\nnot just in our business, but also in our tone.\nAnd I'm again deeply thankful for all of you.\nI yield the will.\nWell, well, well.\nThat was good, that was nice, Senator.\nThat's very kind, Senator, it's very good, and we enjoy having you as a new member here\nin this body.\nYou're going to be a good member for this body, but we're still going to haze you when\nyou come bring your first bill into the whale.\nSo it's so good to have you, though, Senator, Senator, he's a good man.\nAll right, any more points of personal privilege?\nYou have a consent calendar of privilege resolutions as any senator wishes to remove the resolution from the consent calendar.\nHis objection is option of the resolution of the consent calendar.\nChair here is done and the resolution on the consent calendar is adopted.\nadopted. Are there any motions that would draw or commit? It is now time to reconsider\nthe confirmation of the appointments to the judicial qualifications commission. I recognize\nthe senator from the 31st and majority later. Mr. President, I ask unanimous consent\nthat one roll call vote. Senator, I'm sorry. He's got to read the resolution. I'm sorry.\nI apologize.\nSo, Mr. President, the Senate Committee on Assignments has had under consideration the following\nappointment, Mr. Judicial Qualifications Commission, the Honorable Alison T.\nBurleson appointed by the Supreme Court, Mr. Andrew J. Welch III appointed by the President\nof the Senate, the Honorable Brian Amorickman appointed by the Supreme Court, and has instructed\nme to report the same back to the Senate with the following recommended that the appointments\nbe confirmed as submitted respectfully submitted, the Honorable Bert Jones Chairman.\nThank you, Mr. President.\nThank you, please be ordered.\nThank you, Mr. President, I ask unanimous consent that one roll call vote\nsuffice for the confirmation of the appointments to the Judicial Qualifications Commission.\nHere's the objections to the motion.\nSenator from 50 fields of jax, would you just general with speak of your objection?\nCome on down.\nWith all due respect, Mr. President, I come simply to state that it would be the\nthe process of confirming these names.\nI have no problem with not one of them on here.\nI have a problem with rubber stamping as we are so to do.\nIt would be good for me if I get a resume or really\nget some understanding as to who we are putting on these boards.\nAnd as I understand it, we basically are allowing these persons to serve\nbefore they even, we get to do it, to get to confirm them.\nIt would be very fruitful for me personally as a senator to really understand\nwhat we are confirming rather than in the rubber stamp.\nThat's the simple jest of it.\nIf I can have some resumes, if I can have some more information,\nif I can even quote unquote do a very terrible thing called\ndiversify these boards, it would really be in the best interest of Georgia\nso that people can know what we're voting on and what we're confirming.\nAnd with that, Mr. Presiding Officer, I yield the well.\nI simply say that I'm concerned about the process\nto rub us down without really knowing what we're doing.\nThank you.\nSo the motion was the majority of leaders asking\nfor unanimous consent that one roll call vote be suffice\nfor the confirmation of appointments\nof the Digital Qualification Commission.\nYes, sir, Senator from 55th.\nMr. President, I remove my objection.\nThank you.\nAll right, thank you, Senator.\nThank you, Mr. President, I move that the appointment to the Judicial Qualifications Commission\nbe confirmed as submitted.\nThe majority leader has moved that the appointments to the Judicial Qualifications Commission confirmed\nis submitted. Does any other senator wish to speak to the motion? Is the objection to\nthe motion? We'll put it on the board. Okay, so we are going to vote as a body on this\nand we're going to put it on the board so without objection we'll move, all that we'll move.\nSo all those in favor of the majority of leaders' motion will vote yeh, all those opposed\nnay, Secretary of Law and Machine.\nYou\nOn the passage of the most of the yeas are 46 and the nays are 2 and this motion passes.\nThank you Mr. President, good morning, pursuant to senate rule 7-1.1b.\nI give notice that on the next legislative day, I intend to move the senate to consider\nHouse action on senate bill 9.\nWe're going to Secretary read the caption.\nSenate Bill 9, by senators,\nAlbers of the 56th and others,\na bill to be entitled and act to amend\npart one of Article 3 of Chapter 12\nof the Title 16 of the Official Code of Georgia Annotated\nrelating to general provisions relative to obscenity\nand related offenses so as to repeal\nand replace Code Section 16, 12, 80,\nrelating to obscene material distribution and penalty\nto amend Article 1 of Chapter 10 of Title 17\nof the Official Code of Georgia Annotated\nto proceed your foresensing in imposition of punishment, so as to provide foresensing of defendants who utilize artificial intelligence in the commission of certain crimes to provide for related matters to repeal conflicting laws and for other purposes.\nThank you, Mr. President, thank you, please, you order.\nThank you Mr. President, Mr. President, pursuant to the Senate bill, Senate rule 7-1.10b.\nI give notice that on the next legislative day, I intend to move that the Senate consider\nhouse action on SB 170.\nAll right Secretary, read the caption.\nSet a bill 170 by Senator Jackson of the 41st and others.\nA bill to be entitled an act to amend chapter 12 of Title 50 of the official code of Georgia annotated relating to commissions and other agencies who has to create the Georgia interagency council for the homeless to provide for the purpose membership and duties of such council to provide for reporting of activities to provide for compensation to provide for legislative fighting to provide for related matters to repeal conflicting laws and for other purposes.\nMr. President, that can be seen or.\nThank you, Senator for the notice.\nAll right, right now is the majority leader for a motion.\nMr. President, I move the Senate stand adjourned pursuant to 8th or 998 until 10 a.m. on Monday, January 26th.\nAll right, the majority leader has moved the Senate stand adjourned until after budget week.\nSecretary, read the announcement.\nMr. President, there are no announcements.\nNo announcements.\nSenator, from the 19th,\ndo you have something?\nCome on, it's budget week next week, so.\nThank you, Mr. President.\nJust reminder, we'll start Tuesday morning 10 a.m.\nwith budget hearings.\nIf you haven't got your budget book yet,\nyou can pick it up at the Senate Budget Office\nthe COLB and look forward to seeing all of you guys\nTuesday morning.\nThank you, Miss President.\nThank you, Chairman.\nAll right, any other announcements?\nAll right.\nThe majority leader has moved.\nAll those in favor of the motion are signified by saying aye.\nAll those opposed, no.\nThe ayes clearly have it.\nYou'll have a good weekend.\nLet's see.\n",
  "updated_at": "2026-02-12T01:26:48.651322+00:00"
}