{
  "video_id": "ajF2YMaLBHQ",
  "url": "https://www.youtube.com/watch?v=ajF2YMaLBHQ",
  "title": "Georgia Senate 2026 - Day 5 AM Session 1",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": null,
  "duration_minutes": 51,
  "summary": "Here is a structured markdown summary of the Georgia Senate 2026 - Day 5 AM Session 1 transcript:\n\n**Overview**\nThe session featured the introduction of several new bills, including SB 170. There was a brief discussion and unanimous consent to excuse certain senators, as well as the opening prayer and pledge of allegiance.\n\n**Key Actions**\n**SB 170**: No details provided on this bill.\n\n**Bills Introduced (First Reading)**\n- SB 401: Amend Part 14 of Article 6 of Chapter 2 of Title 20 related to other educational programs under the Quality Basic Education.\n- SB 402: Amend Chapter 5 of Title 49.\n- SB 403: Amend Article 5 of Chapter 12. \n- SB 404: Amend Article 1 of Chapter 9 in Title 9.\n- SB 405: Amend Code Section 15-10-2.\n- SB 406: Amend Title 4-3.\n- SB 407: Provide for a homestead exemption from Cherokee County School District ad valorem taxes.\n- SB 408: Amend an unspecified section.\n- SB 409: Unspecified subject relating to insurance and labor.\n- SB 410: Amend Part 1 of Article 1 of an unspecified section.\n- SR 579: Honor the life of Sergeant Major Transportation.\n\n**Notable Moments**\n- The Senate President welcomed a group of young girls who accompanied a senator.\n- There was a brief discussion about dispensing with the reading of the journal, which was ultimately done by unanimous consent.\n- Announcements were made about upcoming opportunities for new committee chairmanships.\n- A new senator led the chamber in the pledge of allegiance and introduction of the pastor of the day.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nThe Senate President recognized and excused several senators who were absent.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or when the next session will take place.",
  "updated_at": "2026-02-12T01:26:48.651322+00:00"
}