{
  "video_id": "AMEx4n14qp0",
  "url": "https://youtu.be/AMEx4n14qp0",
  "title": "Georgia House - Day 4 (2026-01-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": "2026-01-14",
  "duration_minutes": 146,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n# Georgia House - Day 4 (2026-01-14) Session Summary\n\n## Overview\nThis session featured the introduction of HB426 and a discussion of the importance of community leaders and their impact on local communities.\n\n## Key Actions\n**HB426**: No description provided\n\n## Bills Introduced (First Reading)\n- HB426\n\n## Notable Moments\n- Chaplain Max Kailer provided an inspirational message about the 24 words that changed the course of a company during the Great Depression.\n- Representative Rick Jasper provided a warm introduction of Chaplain Kailer, highlighting his service to the community.\n- The Speaker asked members to keep Representative Bentley in their prayers, as she was facing some tough days ahead.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nThe Speaker noted some issues with the morning roll call process and asked members to check in directly with the Clerk to resolve the problem.\n\n## Adjournment\nThe transcript does not indicate when the session was adjourned or when the next session will take place.",
  "transcript": "All members will report to the chamber to the gallery and to 341. All members will please report to the House to work the clerk will ring the bell. All members will report to their assigned seat. We're about to have the morning roll call. All right, we're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? Have all members now voted? All right, have all members now voted? Well, I tell you what do we're going to do over the yesterday. You come down here and check in with the clerk. I mean, this is taking a little bit too long every morning and I'm not sure what the problem is, but we'll figure it out. The clerk will lock the machines. The doorkeepers will please close the doors and keep them closed before we get good morning, first of all. What a beautiful day out there, huh? We've got a busy morning and so I want to give you a little announcement so you can begin planning. We have a large number of members that have signed up for morning orders and so I'm going to ask you if you think that can wait until the next legislative day, that would be in order because the chair is going to strictly enforce a one minute time limit on those who do give their morning orders today. So if you want to contemplate the time and the timeliness of your morning order, this would be a good time after you listen to the message. Listen to the message first. We will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 11th House District Representative Rick Jasper's representative Jasper's and let me before I turn the podium over to you. I want to ask all of you to keep representative Bentley in your prayers. She has got some tough, tough days ahead and so I'm getting reports several times a day and the one I got this morning was really heartbreaking. So keep her in your prayers. Representative Jasper's. Thank you, Mr. Speaker. I always look forward to this part of the day. The uniqueness of our state shines through. My friend is our pastor of the day. He was the pastor for 39 years in the announcement Methodist Church World. It max, you've seen a lot. He has two kids. He's got son Max Edward is a lieutenant colonel in the U.S. Army who will soon take command of filled artillery at Fort Stewart. What an honor. And the lovely Mary Gray, a special needs daughter with Down syndrome, is the community's child and a friend to everyone. His wife, Natalie Lue is from Vienna. I said it right. And so teacher for 35 years, they've been married for 43. Congratulations Max. In almost every community, you have a Max. You know, the one person, man or woman that has his hand in everything. Writing for the newspaper, board member of numerous boards, chairman of this and that, including the credit union. But he's one person that you can talk to with incompetence about the issues you may be having or the having in the community. You know, Max is currently the president of our rotary club in the Pickens County that distributed over 35,000 or 36,000, I better say. There's that right ahead. The mills during the COVID. And we're a rural county, which is quite a thing. But I have to say mostly that Max is a bulldog fan. Well, the other drives a red and black Dodge Ram. But most importantly, he's a St. Louis Cardinals fan too. You know, you like them, he's your friend of his. But people like Max or the glue that hold their communities together and they make us all better. Pastor Kailer, I look forward to your message, my friend. Thank you, Representative Jasper's, my friend for such a kind and exaggerated introduction. But I'm honored to be here with you. And I have great respect for the work you do for the state, for yourselves, for your families. So thank you for putting yourself in that public window for service to make our community a world and yourselves even better. Mr. Speaker, thank you, sir, for the invitation. I am again just honored to be here. This morning as we begin, as usual with the devotion, we'll start with a prayer. But this prayer is the words to a hymn that's familiar to us. And maybe it will just through the power of the Holy Spirit, touch us and inspire us for the day. Let's pray. God of the ages, whose almighty hand leads forth in beauty all the story band. Your love divine has led us in the past. And in this free land with you, O God, our lot is cast. Be our ruler, guardian guy, and stay. Your word, our law, your past, our chosen way, fill our lives with your love and grace divine and increase your love and true religion in our hearts in the living for all our days. And everybody said, Amen. I want to share with you this morning some thoughts about 24 words that changed the course of a company, changed the course of a civic group, and today inspires 1.2 million people around the world. The story begins in 1932. Unemployment was at 24.5% with 13 million Americans out of work. Some traveled as hobos looking for work and shanny towns sprung up all around the country because people needed a place to live or congregate. The revenue act raised taxes from 25% to 65% for the top earners. The Douglas McArthur had United States Army regulars with bayonets drawn. This burst about 43,000 demonstrators and 17,000 war war-won veterans who had count out on the Capitol on them demanding early cash pay for their service. Sound familiar? Unemployment marches hard times. Many companies went bankrupt and others were on the brink and one was club aluminum in Chicago. They owed $400,000 more than their total assets and were barely afloat when an executive from the dual tea company was asked if he would revive the company. Although he was in line for the president's presidency of the dual tea itself, he took the challenge with an 80% pay cut and put $6,100 of his own money into the company for operating capital. And did you have made that kind of commitment in 1932? But Herbert Taylor was no ordinary fly by the seat of your pants, pots, and pans hustler. Following graduation from Northwestern, he was in France working for the YMCA, the Young Men's Christian Association. And when World War I started, he enlisted in the Navy and after the war, he went back to the YMCA for a time. He ended up in Chicago in 1924 with a dual tea company and in short time he was in the executive ranks. As with each of us, Taylor's experiences had shaped his life for the good, but how was he going to rescue club aluminum? Did he have quality? Reduced the employees? Raised prices? No he writes, we must develop character, dependability, and service-mindedness of our people as they progress through the company. So Taylor went to work, developing a simple measuring stick. He did not want to tell his employees what to do. Did he hear that? He didn't want to give them a personnel guide. This is how you do it. But rather, he wanted to provide them a process that would make it possible for them to find out whether their proposed plans, policies, statements, or actions were right or wrong. So he went to work on the project with little progress until he started praying. Taylor wrote down his inspiration and he spent up to 60 days applying it in his office. He observed, I never realized before how far off I was in my decision making and the falseness of our advertising. As club aluminum president, he called his board of departments heads together and asked them if there was anything in the measuring stick that was contrary to their faith, ideas, or doctrines. They replied, no. And they said, we feel that these principles are applied to our plans, policies, statements, advertising, and employee behavior. They would be positive results. So by 1937, club aluminum indebtedness was paid off during the next 15 years and the firm had distributed more than a million dollars in dividends to stockholders and net worth climb to more than two million dollars. You see, it was ethics, a way of living that proved successful in one of the toughest businesses in the community has ever known. The measuring stick was successful in the area of commerce. His measuring stick was a result of prayer and gave a system of how people were to relate to each other in an honest way. Long before Herbert Taylor, a man tall in a group of followers by the Sea of Gellie, instructed them in spiritual and ethical ways to live before God and with each other. His teachings are recorded in the Gospel of Matthew in chapter 5 through 7. Every know is the sermon on the Mount. This verse in Matthew 7, 12, and you've heard it before, says, in everything due to others as you would have them do to you, or this is the law and the prophets. In other words, when you and everything you do, you do to others as you would have them do unto you, you have fulfilled the law of God. Of course, this is the goal of rule that we know. He was teaching in hard times too. We may have the idea that in Judas' day, there wasn't any problems. You see, as you know, Palestine was under martial law governed by the Romans. There was a group of people known as the zealots. They wanted to overthrow Rome by force. They were revolutionaries. There was a group of people known as the Sadducees. Well, they were just happy just to be there as long as they got to run the temple regardless of who was running to government. Then you had the Pharisees. They that were the religious purist whose call was so large and so difficult that it was just humanly impossible to meet all of their standards. So in our times and in Judas' times, it was the heart and the actions of people that were changed. The Palestinians could not change their situations. The folks of the Great Depression had to work through the times. And today we have to work through our own hard times. I know this is only the fourth day. A lot of you do not have offices. You probably don't know what committee you're going to be on. You probably wonder where am I in the peckin' order. A lot of things going on. I noticed around the capital it doesn't look like the old capital. And we can't help but hear the news of what's going on around us and in our state. But I want to suggest to you this morning, no matter your faith or no matter your party. I want to suggest to you a way that if you would consider adding it to your tools of ethics, how you make decisions, why you make those decisions. I believe that these four 24 words would change your life. Those of us in the Rotary Club know them as the four-way test. In every meeting we close with reciting this test. And I share with you that for 39 years in the pulpit on Sunday morning, sharing with the congregation as I'm sharing with you, all you could do was pour out your heart and pray that the Holy Spirit would touch and inspire people to change their attitudes and their way of living. And still today I just want to give you an opportunity to take this four-way test that changed the company, it changed a community and it's changing the world today. So would you please stand and repeat after me? And all the things I think say or do. All the things I think say or do. Is it the truth? Is it the truth? Is it fair to all concerned? Will it build better friendships and good will? And will it be beneficial to all concerned? And now may the Lord bless and keep you, may the Lord make his space to shine upon you and be gracious unto you and may the Lord lift up his countenance upon you and give you his peace in all that you do. And everybody said, amen. Will you join me in the pledge of allegiance? I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. And the nation under God, the indivisible, with liberty and justice for all. Doorkeepers will unlock the doors. The Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits. Thank you, Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. And furthermore, the majority will call me this morning and he seems to be enjoying himself but he suggested I do this and dedicated to Representative Noel Williams. A silver haired is a crown of glory. The majority will read that somewhere because he doesn't have any silver haired. Chairman Hogan, the Chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The Chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, the number 59 move is following. It will be established as the order of business during the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The Chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House bill three by represent of Allen, the 40th Wilkerson, the 38th and all of it's the 42nd and Bruce, the 61st Bill B. Toddl and act to amend code section 12, 9, 7, and the official vote of Georgia and it's later relating to permits. Natural resources and environment. House bill 26 by represent of Kendrick and the 93rd, ben on the 94th. Scott of the 76, Hutchinson, 107th and Scofield of the 60th, Bill B. Toddl and act to amend chapter 7, title 48, the official vote of Georgia and it's later relating to income taxes. Ways and means. House bill 27 by represent of Kendrick and the 93rd, ben on the 94th, smiley on the 35th, Mitchell, the 88th Hutchinson, 107th and others, they'll be titled act to amend chapter 7, title 48, the official vote of Georgia and it's later relating to income taxes. Ways and means. House bill 29 by represent of Kendrick and the 93rd, ben on the 98th, Scott of the 76, Williams, the 68th, Hutchinson, 107th and others, Bill B. Toddl and act to amend article 4, chapter 12, the title 45, the official vote of Georgia and it's later relating to the office or planning and budget. Appropriations. House bill 50 by represent of base, more to 63rd, smiley on the 35th, Beverly, the 43rd, roba show, the 48th, Bruce, the 61st and others, they'll be titled act to amend code section 42, 86th, the official vote of Georgia and it's later relating to special license plates. Motor vehicles. House bill 54 by represent of base, more to 63rd, ben on the 94th, Davis, the 87th, roba show, the 48th, Bruce, the 61st and others, they'll be titled act to amend part two of Article 6, chapter two, a total 20th, the official vote of Georgia and it's later relating to compensation and core curriculum. Education. House bill 55 by represent of base, more to 63rd, smiley on the 135th, Beverly, the 143rd, Bruce, the 61st, Mitchell, the 88th and others, Bill B. Toddl and act to amend chapter 134, the official vote of Georgia and it's later relating to general provisions of labor and industrial relation. Industry and labor. House bill 69 by represent of Kendrick, the 93rd, the 60th, McLaren, the 51st, hudges to the 107th, Scofield, the 60th, Bill B. Toddl and act to amend Article 2, chapter 21, title 50, the official vote of Georgia and it's later relating to state toward claim. Do you do sure? House bill 70 by represent of Kendrick, the 93rd, Bruce, the 61st, Ben of the 94th, Williams, the 68th, Alan, the 40th and others, Bill B. Toddl, act to amend chapter 1, title 50, the official vote of Georgia and it's later relating to general provisions of state government. Governmental affairs. House bill 71 by represent of the Cloud, the 100th and 5th, Scott of the 76th, Bernal, the 77th, base, more of the 63rd. Davis, the 87th and others, Bill B. Toddl, act to amend, part 4 of Article 6 of chapter 2, a title 20, the official vote of Georgia and it's later relating to financing on the Quality Basic Education Act. Education. House bill 72 by represent of Hugley, the 136th, about 137th, Smiré 135th, Bill B. Toddl, act to amend, title 49 of the official vote of Georgia and it's later relating to social services. Health and human services. House bill 73 by represent of Hugley, the 136th, Smiré 135th, Buckner, the 136th, Bill B. Toddl, act to amend, Article 1 of chapter 24, title 33, the official vote of Georgia and it's later relating to general provisions regarding insurance. Insurance. House bill 74 by represent of Washburn, the 100th, 41st, Fleming, the 21st, Paul 32nd, Smith, Thumb, 33rd, Carpenter, the 4th and others, Bill B. Toddl, act to amend, Article 4, chapter 9 of the total 16, the official vote of Georgia and it's later relating to fraud and related practices. Judiciary non-seval. House bill 75 by represent of Gamble, the 15th, next to the 69th, Stevens, the 164th, tanker for the 160th and Skoggins, the 14th, Bill B. Toddl, act to amend, Article 1 of chapter 5, a title 40, the 48th, the official vote of Georgia and it's later relating to general provisions regarding ad valorem taxation. Ways and Maines. House bill 76 by represent of Carson, the 46th, Parsons, the 44th, on all the woods, the 42nd, Alan, the 40th, Dickie, the 140th, Bill B. Toddl, act to amend, Title 46, the official vote of Georgia and it's later relating to public utilities and public transportation. Energy utilities and telecommunications. House bill 77 by represent of Bruce, the 61st, Beverly, the 143rd, McLeod, the 105th, Alexander, the 66th, McLeod, the 100th and others, Bill B. Toddl, act to amend, Part 1 of Article 11 of chapter 2, Title 21, the official vote of Georgia and it's later relating to general provisions regarding preparation for and conduct of primaries and elections. Special committee on election integrity. House bill 78 by represent of Bruce, the 61st, Beverly, the 143rd, McLeod, the 105th, Alexander, the 66th, McLeod, the 100th and others, Bill B. Toddl, act to amend, Chapter 5, a title 50, the official vote of Georgia and it's later relating to department of administrative services. Governmental affairs. House bill 79 by represent of Alan, the 40th, Wilkerson, the 38th and all those 42nd and McLaren of the 51st. Bill B. Toddl, act to amend, Chapter 10 and title 25 and Chapter 60, title 36, the official vote of Georgia and it's later relating to regulation fireworks. House resolution 12 by represent of Kendrick, the 93rd, Mitchell, the 88th, Scott, the 76th Williams, the 168th, Hutchinson, the 107th and others, a resolution expressing support for the creation of reparations study committee. Appropriations. House resolution 13 by represent of Kendrick, the 93rd, the generally 85th, Scott, the 76 Williams, the 168th, Hutchinson, the 107th and others, a resolution urging the United States Congress to enact legislation. Judiciary non-sevel. House resolution by represent of Williams, the 168th, Rolston, the 7th, Burns, the 159th, Beverly, the 143rd, Smiley, the 135th and others, a resolution creating the nation.\n\nNational Statuary Hall Collection Replacement Committee. State Properties. House Bill 80, member of the Senate, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th and others to be entitled to act to be entitled to act to be entitled to act to amend and act, making and providing appropriations for the state fiscal year beginning July 1st, 2020 and ending June 30th, 2021. The Senate will be the first to be appointed to the Senate, and the Senate will be the first to be appointed to be appointed to be appointed to the Senate. House Bill 81, member of the Senate, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th and others to be titled to act to be entitled to act to be entitled to act to be entitled to act to be appointed to the Senate, making and provide appropriations for the state fiscal year beginning July 1st, 2021 and ending June 30th, 2022. House Bill 82 by Representative, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th and others to be entitled to act to make and provide appropriations for the state fiscal year beginning July 1st, 2021 and ending June 30th, 2022. Appropriations. House Bill 83 by Representative, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th. Appropriations. House Bill 84 by Representative, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th, being titled to act to make and provide appropriations for the state fiscal year beginning July 1st, 2021 and ending June 30th, 2022. Appropriations. House Bill 85 by Representative, Ross of the 7th Jones, the 47th Burns of the 159th England, the 116th, being titled to act to make and provide appropriations for the state fiscal year beginning July 1st, 2021 and ending June 30th, 2022. Appropriations. House Bill 83 by Representative Oliver, the 82nd, Drenner, the 85th, Bennett of the 94th, Evans of the 83rd and Lopez of the 86th, a bill relating to annexation of territory, House Bill 24 by Representative Oliver, the 82nd, Evans of the 83rd, Lopez of the 86th, a bill relating to the procedure for resolving annexation disputes, House Bill 32 by Representative, Belt and of the 112th, next of the 69th, Hawkins of the 27th, Green of the 111st, Taylor, 173rd and others, a bill relating to grants for educational programs, House Bill 33 by Representative, Belt and of the 112th, Hitchens of the 161st, Hawkins of the 27th, Parkle of the 102th, House Bill 170th and others, a bill relating to the imposition rate of the 27th, the Boyra, Kim, Gore, Kim,avian, 6th flame, 115th and others, build a lane check. Alternative advalorem tax on motor vehicles, house bill 64, by represent gains of 117th and we dour of 119th, the build relating to primaries and elections, house bill 65, by represent gains of 117th, per dour 119th, the 5th, 118th, the build relating to primaries and elections, house bill 66, by represent all over the 82nd, drennor of the 85th, bennett of the 94th Evans of the 83rd, the pebb of the 86th, a build relating to revenue bonds, house bill 67, by represent martin of the 49th, England of 116th, night of 130th, smeared 135th, reach of the 34th and others, a build relating to general provisions relative to public property, house bill 68, by represent of Clark of the 147th, the 72nd, built in 1112th, blackbend of the 146th, smeared 135th, and others, a build relating to certain military certifications, 3rd, and 3rd, dredors. House will come to order. The House will come to order. Although we did announce a prohibition on invite resolutions. We have a reason I think today to depart from that briefly. And I'm sure it's going to do that at this time. The clerk will read the caption to an invite resolution. Please all members take your seats. All members. Very jusqu** I f wrapper the debt to the publicama מתảng resolution 19 by Representative Ross on the 7th, the Spire 135th, a resolution recognizing commanding Jim Galloway upon the grand occasion of his retirement and for other purposes. Tomorrow, January 15 marks the final day for Jim Galloway at the Atlanta Journal Constitution. Now, I think it goes without saying that we don't honor very many members of the Fourth Estate in this body. Can we agree on that? I think the last time we honored one, it was a meteorologist. Because we took a poll and found out that most of the members watched the weather more than they listened to the news, Jim. But I think this is an important occasion and one that I wanted to pay tribute and so did Dean Smirie. Over the past four decades, no one has chronicle Georgia history with more balance, insight, and perspective than Jim Galloway. Jim has given stature to the position of being a journalist. He has not been caught up in the sensational or sorted focusing instead on the important and the consequential. He grasped in a way that few did, the constantly evolving place that we call Georgia. His integrity and brutal honesty has been reflected in his work. Now, I did not always agree with him in or like even some of his reporting. Does that surprise you? But in a free society, that is to be expected. And that's the way it should be. That's the way it should be because we have a job to do. And these men and women have a job to do. And I think that so long as we have a healthy respect for that, that will be all the better for it. I don't think the topwriter, I guess it's not a topwriter. anymore, it's a computer. We'll collect dust. I sure hope not. But this fixture of the press corps for so long will be missed here in these halls because you just don't replace a Jim Galloway. So Jim, don't go far. But do go far enough to enjoy life with Judith and the daughters and the family and know that I salute you and on behalf of the House, salute you and wish you well, my friend. Dean Smirie? Thank you, Mrs. Speaker. This is quite an honor for me today. And when I got the call from Jim that he was retiring, I immediately thought about how could we say thank you from the Georgia House of Representatives. And I soon, Speaker Austin was thinking the same thing because he asked me to sign a resolution. And in my 47 years, I don't think we've honored before news people. I think, selectively, Dick Pettis, Bill Shipp. That's my recollection. And now Jim Galloway here on the House floor and Glen Burns. And I think we did something for Ralph McGill. But I got to know Jim over some 40 years ago. And during the 80s, we really got to know each other because I was floated to Governor Joe Frank Harris. And then during the campaign of Bill Clinton in the 90s, we really had an opportunity to work together. And as you're recall in 2000, I think two or three, they started the political insider at the Atlanta Drone Constitution. And that's been Jim's mainstay. And one of the best quotes I have seen on Jim Galloway was by Johnny Isaacson, a former colleague and a friend. When he stated that he gets to the heart of the issue with curiosity of Bill Shipp and the integrity of Ralph McGill, which is in high honor to an individual and to iconic people in the news industry. And I consider Jim and iconic figure here in our General Assembly. He's been a superb writer and a reporter. And his work can be categorized, I think, as one of the top state house reporters in our nation. He has been lauded by democratic members and members of the GOP and by the speaker. Because the speaker, I read a quote one time, that Jim Galloway has framed today's politics in the context of the past. And so it's good when you can have the respect of all the individuals here and you don't agree with everything he writes, but he writes it at a very respectful manner. In a conversation I had with him in closing, he said to me one time, I am not so worried about what I do write, but what I don't write. And to me that is a very profound statement. And so Jim, I just want to say, and I said to all the new freshmen legislators, people say, well, you can't have friends in the media. That's not a true statement. There is a line of delineation, but in all due respect, you can have a relationship with members of the media. Because to me in my opinion, the media are the enablers of democracy. They create an informed and creative form, the constituency. And to me, nothing you can have than have an a better educated electorate and people that pay attention to the issues of today. So Jim Galloway has made a significant contribution in that factor. And so you're going to be surely missed. I have not agreed with you 50% of the time. This was your, but I have enjoyed your writing. You have been a tremendous asset to us. And we commend you and we thank you. So thank you very much for your career at the Atlanta Drawing Constitution. Thank you, Mr. Speaker. I'm going to do my best not to go John Bainer on you. Mr. Speaker, Dean Smirie. I am just flabbergasted, God's Mac by this honor. And members, to you. Thank you very much. I've grown old in this building. And I can't think of a better place to have done it. So thank you for that. And thank you for all the theater. And again, thank you to these two men. They have proven Mark Twain right. There is no greater gift a person can receive than the ability to attend his own funeral while he's still alive. Thank you. The House will be at ease for a few minutes before the joint session. Thank you. While we are at ease, the chair is going to ask all members to take their assigned seats. We have a couple of minutes, particularly those of you that are up front because these seats are going to be assigned a guest coming in for the state of the state. So please report to your assigned seat. Go ahead, you can give them a seat. However, are you going to complain or marry someone bus on the outside or shall I lay it on their seat, a seat of mine. Thank you. Sir Maipa. you you you you you it is members seated in the gallery will take their assigned seats only members in room 341 will do likewise and members on the floor of the house will please take your seats Madame Dorkey. Speaker, the president the president pro team the majority whip the minority leader of the Senate away entrance to the House Chamber. Madam Dorkiepper, please allow the President, the President Pro Tem, the Majority Whip, and the Majority Leader of the Georgia State Senate to enter the House Chamber. And will the messenger please escort them to their designated seats. Thank you. Thank you. Thank you. If I could have your attention please, members be seated very quickly. We will momentarily have the guest of honor come in but it's my pleasure at this time to introduce a friend and a former member of this body who now serves as great distinction as our Lieutenant Governor. Please make welcome Lieutenant Governor Jeff Duncan. Thank you very much. It's always a great opportunity to come back to this great chamber and see so many friends that are such an important part of my life and my family's life. But I was reminded, I guess, humbled. There's probably never been a Lieutenant Governor to walk down that aisle and receive so many jokes and being made fun of so much. But that just tells me that y'all love me. It's an honor to be here. Members of the General Assembly, the joint session will now come to order and I would ask that all members take your seats. Madam Dorkieper. Mr. President, his excellent only, the Honorable Brian P. Camp Governor of the State of Georgia and Distinguished Guests are way entrants to the House Chamber. Madam Dorkieper, please let his excellency Brian P. Camp Governor of the Great State of Georgia and the Distinguished Guests be admitted to the Chamber. All members, please take your seats. Mr. Clark, will you please read a resolution? House resolution 9, my represent of Burns, 159th. A resolution calling a joint session of the House of Representatives in the Senate for the purposes of hearing a message from the Governor, inviting the Justice of the Supreme Court and the Judges of the Court of Appeals to be present at the joint session and for other purposes. I'd like to take a moment to recognize some very special people here today and would you please stand when your name is called. Great friend of mine and somebody that I got to know is Speaker of the House but now get to know as a friend and a coworker, David Ralston. Also a great friend, Speaker Pro Tem Jan Jones. And from the Senate, a great friend of all of ours and a great car salesman, President Pro Tem of the Senate, butch Miller. And someone our entire family has gained great respect for and continues to be so excited about your efforts in this state around human trafficking and around foster care and so many other things. First Lady of the State of Georgia, Marty Kemp. And it's a great honor to introduce the First Lady of this Chamber, Sheree Bradburn. My wife was unable to make it today to a previous scheduled appointment and so I've got with me today and this is a proud moment. My oldest son, Parker Duncan, and I guess since the Kemp's have no girls, you're the first son of Georgia or the first son of the House. Parker Duncan, thank you.\n\nI'd like to take a moment to welcome many of you back to this great body and to this General Assembly. I also want to welcome so many of you that are here for the first time. It's hard to believe that this is my ninth General Assembly that I've been in and around. It's hard to imagine that that much time has passed. I stand here today continually reminded that honesty and integrity are the best long-term strategy for success in this building. The short-term sugar high of getting something done just for today to sacrifice tomorrow, I encourage you it's not worth it. I encourage new members and old members of this General Assembly to take to heart something that we talk about often at our house. Doing the right thing is always the right thing. It's an honor to stand here today with the opportunity to introduce our state's 83rd Governor. I got to know Governor Camp really on the campaign trail. I spent two plus years traveling around the odds, you know, times of the night and day and traveling all over the place and sometimes we'd be in the same room and sometimes we wouldn't. But we worked our way all across the state for two plus years and every time I got up from listening to Governor Camp give a speech, there were four things that were unmistakably etched in my mind as to why he wanted to be the governor. One, because of his conservative values, two, because he cared about rural Georgia, three, because he was a small business-minded individual, and four, because he was family-centered. And now in the role of Governor, I get to work with him every single day and I get to watch those four priorities become reality in virtually every single meeting that we're in. I get to watch him encourage the room when we're sitting around the table to be the one that leads the conversation on how to shrink government, how to make decisions closer to the voter, how to be fiscally conservative and prepare ourselves for rainy days. I get to hear him and encourage an entire room to care about rural Georgia on every investment this state makes, on every economic opportunity, on every education decision. I get to watch somebody who truly does look through the lens of a small business owner, somebody who cares about and understands how hard it is to create just one job and how to keep that one person gainfully employed even through a pandemic. And I've gotten to watch where his family-centered values come from. I've gotten to know the first lady. I've gotten to know his three daughters. I now know why family-centered values are important to him. I understand why he cares about education. I understand why he cares about community safety. I understand why he cares about economic opportunity for the long term. I'm proud to report that the man I met on the campaign trail is the man that I get to call the 83rd Governor of Georgia, Brian P. Kim. I'm a boy over there. Thank you all. Thank you all so much. Lieutenant Governor Duncan, Speaker Ralston, Speaker Pro Tem Jones, Members of the General Assembly, Chief Justice Melton, Chief Judge McFadden, and my fellow Georgians. In my first state of the state address, I talked about building on a sheer foundation. We applauded the leadership of Governor's Purdue and Deal who guided our state through difficult storms. I extended my gratitude to the Georgia General Assembly who helped pour the concrete with key investments in education and economic development. During that first address, which quite honestly seems like an eternity ago, I retold the famous parable of two builders, one who built a beach house and the other who picked a better lot on higher, more stable ground. The rains came, the floodwaters rose, and the house built on a sheer solid foundation, weathered the storm. And then last year, I talked about our house plans, the blueprint for a safer, stronger Georgia. Each side of the structure protected those who lived inside. Windows faced to the future, and a front door, open for all those who were looking for safety, opportunity, and a better tomorrow. One year ago, I had no idea what we would experience in 2020. What we would endure, the storms we would face. One year ago, our economy was growing at a rapid pace with unemployment the lowest in the state's history. We had full faith and confidence that our best days were still to come. When I stood at this roster on January 16, 2020, I didn't know that a deadly global pandemic was on the horizon. We didn't know that businesses would be shuttered, unemployment would skyrocket, and opportunity would slow under the weight of COVID-19. We didn't know that our prosperity in our economy would be undermined, at the same time that our health and well-being was being threatened. We didn't know all of the challenges ahead, all the impossible decisions to make, all of the struggle, pain, and grief. My family didn't know we would have to say goodbye to Harrison Deal. The love of Lucy's life, like a brother to Jared and Amy Porter, and a son that Marty and I had never had. We didn't know that political division would generate ridiculous and harmful conspiracies, lawlessness, and death. For in standing here 12 months ago, I had no idea that 2020 would present more challenges in any other year in my lifetime. There's no doubt that this virus has impacted all of us beyond what we could have ever imagined. Too many families are now missing loved ones. A heartbreaking, devastating loss that I know many Georgians are still grieving today. At this time, I'd like to observe a moment of silence to honor the life of every Georgian, and every American taken from us too soon from COVID-19. Amen. Those great Georgians may be gone, but they will never be forgotten. We will win this fight against COVID-19, and their legacies will live on for generations to come. In Georgia, our people are the foundation. Despite incredible loss and unprecedented challenges, Georgia is still standing. Our house built on a sure foundation survived the storm. This state, while battered, is not broken, a better, brighter future is right around the corner. Yes, we still have challenges ahead of ours to beat an economy to rebuild and restore. But my fellow Georgians, the state of the state is resilient, and we will endure. As you know, agriculture is Georgia's oldest and largest industry, supporting nearly 400,000 jobs and $76 billion in economic impact throughout the Pete State. While we often take these hard work in Georgians for granted, we were reminded of their importance in the wake of Hurricane Michael. With winds topping 70 miles an hour, this storm destroyed thousands of acres of pecans, cotton, and timber, leveling homes, storefronts, and structures, literally upending lives and livelihoods. When the dust settled, I traveled down the southwest to Georgia to talk with local farmers and support the state's recovery efforts. I remember many conversations while I was there. Most of them went roughly the same way. These families were facing the destruction of their livelihoods, with bills piling up and federal assistance far away. I would ask how they would move forward. Would they be able to continue feeding, clothing, and producing for our state and the world? Nearly every person said they would clear the fields, repair what they could, and start planning. As we begin a new year, a new legislative session, there are some who want to look to the past. Assign blame, settle old scores, and relive and relitigate 2020. Today, I think we should take the advice of those wise farmers. Let's clear the fields and start planning. While Jesus was a carpenter like his dad, he had some timeless wisdom on farming and life. In Matthew 13, Jesus hears a few best practices with the crowd that had gathered. A farmer went out the sow his seed, and as he was scattering the seed, some fell along the path and the birds came and ate it up. Some fell on rocky places, where it did not have much soil. It's sprang up quickly, because the soil was shallow. But when the sun came up, the plants were scorched, and they withered because they had no root. Other seed fell among the thorns, which grew up and choked the plants. Still, other seed fell on good soil, where it produced a crop, 160 or 30 times what they sowed. Whoever has ears let them hear. This parable told over 2,000 years ago is just as relevant today. A good harvest starts with good soil. Our future is a state, for decades or more, will be determined by the decisions we make in the days to come. To ensure a strong harvest in the years ahead, our top priority over the next few months must be to continue protecting both lives and livelihoods against COVID-19. From the beginning of this pandemic, I stress the need to balance those two priorities, the health and well-being of our people, and their ability to put food on the table for them and their families. In March and April of 2020, that was not easy. Many problems we confronted as a state led to long days and sleepless nights. It seems like forever ago, but in the early days of our fight against COVID-19, protecting lives was a minute by minute battle against a virus we knew little about. Our first test was in Albany in the southwest part of our state. A few super spreader events led to the first surge in virus cases and hospitalizations throughout the region. The local healthcare infrastructure was being strained to the breaking point, and community spread of the virus was rampant. In response, the state quickly deployed national guard and fixing control teams to lurk local nursing homes. Contracted with additional hospital staff to aid local frontline healthcare workers, and dispatched the state purchase mobile hospital unit to help with patient overflow. We stood up additional bed capacity and purchased critical PPE supplies and ventilators to aid in the critical care of infected Georgians. Alongside local leaders, we made every resource available and worked tirelessly to provide lifesaving medical treatment, protect the most vulnerable and flatten the curve. The local community stepped up to the plate and bought into what local and state leaders asked them to do. They wore a mask, practiced social distancing, avoided large crowds, and followed public health guidance. The community, not the government, flattened the curve and slowed the spread of COVID-19. And while every part of our state continues to see higher cases, more hospitalizations, and more details at the hands of this virus, the Dardi County community has shown what is possible when we all work together, and choose to be part of a solution instead of part of the problem. Here with us today is a gentleman who led a team of healthcare heroes through some of the worst of this virus that has been thrown at our state. During one of the darkest times in recent memory, Scott Steiner and the hard work in Georgians at Phoebe Putney Health Systems held the line. They worked with the local community partners to educate the public, so when much of the virus was unknown. They provided lifesaving treatment to thousands of their neighbors, friends, and co-workers. And like so many nurses, doctors, and healthcare professionals across the state, the Phoebe team worked long hours under extraordinary circumstances, not just because it was their job, but because they have a deep abiding passion for their work. Scott, thank you, and thank you to your team for your dedication and service to the people of our state. We are grateful. Thank you. Thank you. Thank you. Learning from Albany is we moved into the summer months. The state launched a strategic plan to address the effects of COVID-19 and its impacts on our healthcare infrastructure and communities as a whole. Thanks to the help from our federal partners, the state purchased four mobile hospital units to respond to increase hospitalizations in real time. Working with the General Assembly in Grady Memorial Hospital, we ramped up the Georgia Coordinating Center to allow for statewide coordination of hospital capacity. We brought in additional bed capacity at the Georgia World Congress Center, allowing Metro Atlanta hospitals the ability to quickly adapt to changing conditions on the ground. We kept hospitals open, accepting patients, and keeping Georgia's healthy. Like every other state across the country, the pandemic introduced the dire need for rapid, accurate, and widely available testing. An infrastructure, the Department of Public Health, literally created from scratch. But we persevered through significant supply chain challenges. We brought in the Georgia National Guard and contracted with Augusta University to boost testing, set up megacites, and drive through testing operations, and engaged hard to reach communities to help identify cases and slow the spread of the virus. As of today, there has been a staggering 5.7 million tested administered in the state of Georgia. And we all know, COVID-19 has hit our most vulnerable Georgia's the hardest, especially those residing and working in nursing homes. From the start of the pandemic, Dr. Tumey and our team recognize that nursing homes and their residents and staff would be among the toughest challenges that we faced. The state is spraying into action and was first in the nation to utilize National Guard infection control strike teams to conduct missions and facilities in nearly every community. I'll tell the Guard's 65 infection control teams conducted missions in more than 2400 facilities. Speaking of the National Guard, I'd like to pause here for a moment and recognize their truly remarkable efforts throughout this pandemic. In addition to spearheading our early testing and infection control efforts, our very own men and women in uniform also helped Atlanta area schools delivered 948,000 meals to children who were out of the classroom through the spring and summer. Guard members assisted overwhelmed food banks from Savannah to Atlanta and answered the call to help keep our community safe. At this time, I'd like to thank General Tom Cardin and every Georgia serving in the National Guard for their tireless work on behalf of our state and our nation. We are grateful. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. The state prioritized the fight against COVID-19 in two other specific areas. PPE, procurement, and additional healthcare personnel staffing. Activating the Georgia Emergency Management and Homeland Security Agency statewide network, the state secured entire warehouses of PPE from hundreds of vendors, which was immediately sent to hospitals, nursing homes, doctors offices, and other healthcare providers on the front lines. Because of their around-the-clock efforts under the leadership of former director Homer Bryson and director Chris Stallings, the state now has at least an 80-day supply of all critical PPE categories. As our hospitals and nursing homes confront the fiercest part of the pandemic, the frontline healthcare workers in these facilities have literally faced hell on Earth. They've worked under brutal conditions for multiple shifts over months now. There's no doubt that Georgia's healthcare heroes have done their job with a grit and determination that has inspired 11 million Georgians. Never has it been clear how important your job is and how vital all of you are to keep in our state healthy and prosperous. I want to thank you for sacrificing your time with loved ones. For going above and beyond the duty each and every day. God bless you all. To lend a hand to these heroes, the state has spared no expense. Through the end of 2020, Georgia allocated $250 million in CARES Act funds to augment staff at nursing homes and hospitals across the state. With an additional 70 million planned through early March. These nurses and healthcare professionals have been absolutely vital to our battle against COVID-19. Often serving as a lifeline for these facilities and patients. I want to thank them for their willingness to do so. These have been dark times for our state, for our country, and for our nation. We have overcome so much, and together we can now see the light at the end of this tunnel. Thanks to the efforts of Operation Warp Speed, we have a miracle of modern science that has quickly been administered with over 283,000 Georgians vaccinated as of yesterday. We still have a long way to go, but we are making steady progress. This is certainly good news, but our fight is far from over. This pandemic is still infecting and killing fellow Georgians and Americans. We must all continue wearing a mask, practicing social distancing, washing your hands and heating the regulations of the executive order still in place. But we also know that there are 283,000 reasons for hope and optimism. We will get through this. We will get there together. Applause It's pretty common for us to refer to 2020 and the pandemic as a fight or maybe even a battle. I know it certainly felt like one for many Georgians myself included. In any fight or battle, victory or defeat is often determined by leadership. I thank God countless times for sending Georgian or remarkable leader to see us through these challenging moments. Because it is not only through God's grace and eternal wisdom that we have, Dr. Kathleen Tumey. If I were a sighted Dr. Tumey's resident, resume, we would be here all day. Harvard trained decades of experience in epidemiology. On paper, no one would be better prepared for the job of confronting a once in a lifetime pandemic. But I will tell you, the resume does not live up to the woman all of us have seen at countless press conferences, interviews and fly round tours. Her knowledge is certainly unmatched. Her work ethic is unparalleled. And her passion for public service and public health and serving the people of our state is nothing short of a remarkable. Dr. Tumey has become a friend and someone I trust completely. God sent Georgia the right person at the right time. Doc, we are thankful for everything you have done. Thank you very much. Thanks to the partnership of both legislative chambers, the outstanding work of the best economic development team in the country led by Commissioner Pat Wilson. Georgia's economy was able to hold its own during 2020. In a year riddled with economic hardship from coast to coast, Vice President Mike Pence said it best. Georgia helped lead the way back to a prosperous American economy. And if the first half of the new fiscal year has been any indication, the Pete State is well positioned to emerge from this dark period of economic crisis stronger and more prosperous than before. For an unprecedented eight consecutive year, Georgia earned the title of number one state for business, affirming and solidifying our status as the leading competitor for jobs and investment right here in the United States and around the world. At a time in our nation's history when jobless claims have skyrocketed, our unemployment rate in Georgia sits at 5.7 percent well below the national average. And in the midst of a global pandemic, Georgia's economic development numbers have shattered record after record. Since the start of the fiscal year in 2021, our Department of Economic Development has announced the creation of more than 16,000 new jobs and more than $6 billion in new investment with more than half of those jobs going outside communities from the metro area. And I think it was, thank you. Whether it was Georgia-based wind core windows growing their operation by 100 jobs in Swainsboro, Nestle, Perina, doubling down on their investment in heartwell by 130 jobs or major brands like Papa John's and Home Depot relocating their headquarters and expanding their footprint, creating thousands of jobs in the metro area. Those numbers constitute a 40 percent increase in new jobs created and a 47 percent increase in new investments compared to the first six months of FY20. But what they represent is so much more than that. They represent decades of hard fought battles, foresight and strong conservative leadership under this gold dome. They serve as a beacon of hope to Georgians who had to worry about keeping food on the table or if their kids could build a career in their home state when the dust settles from the pandemic. They showed that rural Georgia, not just Atlanta is right for investment and opportunity. And they speak to the strength of our business community. Those hard work in Georgians who face very long odds to stay in business and keep their teams on the payroll. I face just a little criticism from all sides when we chose to safely and methodically reopen the state. For news cycle after news cycle, it seemed like the only voices given a megaphone were from those who could work from home long term and those who had the resources to shelter in place for months on end. But the voices I heard were the voices of men and women from Bambridge to Bolin Brook to Baldwin who had spent years building their business creating jobs, sewing a harvest they hoped to one day reap for themselves and their families literally days away from losing it all. I heard their fear, the uncertainty not knowing what tomorrow may hold and it was familiar to me. You see as a small business owner in the construction industry during the Great Recession, Marty and I had similar conversations together in our kitchen, living week to week, day to day, hour to hour, like many other hard work in Georgians.\n\nIt was not uncommon for the guys on the job site working for me to have more of money in their pocket than I had in my bank account. I can tell you those memories came to me often in the early days of this pandemic. The phone calls, texts, and emails I received from folks that were holding out hoping for a miracle. They weren't that different from the thoughts going through my head on more of them one night all those years ago. These hard work and Georgians were struggling not because their business was a failure or because their products or services were no longer needed. No, they faced devastation because of a virus through no fault of their own. While some disagreed with me, I know our decision to work with Dr. Tumey and her team to give these people a fighting chance, a glimmer of hope, meant everything to them. Solan, Barber Shop, Restaurant Owners, and so many more who sacrifice time and resources to implement new COVID safe protocols and their stores when we reopen. These new regulations upended their daily operations but kept many from closing stores, laying off workers, and losing businesses that sometimes had been families and communities for generations. Hundreds of thousands of waiters and waitresses, contractors, hospitality, and tourism workers, and farmers. The pandemic came for them as well. This virus took something precious away from each one of them and not all of them ended up in the spotlight. My message to these great Georgians has been the same every day since we announced our measured reopening. Your state hears you, your governor hears you, and we have your back. That decision allowed Georgia's small business community to live to fight another day. And some of our largest companies like Kia and Bridgestone to have record success. It has never been clear that we must honor their commitment to the job creators in this state. Our commitment has held true these last ten months, and communities rallying around local businesses who overhauled to adhere to public health guidance and keep customers safe. And in the work done by leaders in both legislative chambers to make it easier to stay in business in the era of COVID-19. You see in the heat of the summer when we were facing some of our toughest days in the fight with COVID when access to testing was crucial and the state struggled to meet demand for critical PPE. It was Georgia businesses, large and small, who stepped up to meet the moment. From craft breweries and albony to local mattress manufacturers in Rome to a plastics business that began in a small startup in a garage in noon and 13 years ago. Our very own pitch then to build up the state stockpile, limit the need to compete with other states and ensure our health care heroes had the resources they need to care for Georgia's most vulnerable. One of those businesses, American Nets, cut the ribbon to mark the official grand opening of their facility in Swainsburne in late 2019 with 52 jobs in their community. Their ribbon cutting heralded the return of American-made manufacturing to Swainsburne more than 20 years after many cutting so plants closed throughout the United States. And of course it meant good jobs and more opportunities were on the way to hard work and Georgians and their families. Like all of us seated here today, I'm sure no one at the team of American Nets anticipated COVID-19 pandemic and how hard it would hit our economy. But when the pandemic hit, they didn't slow down, they rolled up their sleeves and they kept chopping. These American heroes shifted their entire operation to begin producing masking gowns for frontline health care professionals. And while their products may not bear the name of a major brand, they caught the attention of people in high places, receiving FDA approval in a matter of days to sow and send life-saving garments to our frontline heroes. Steve Hawkins, the president of American Nets, joins us in the chamber today. Steve, I know at this time last year you could not have fathomed that your plant was shift to 20-hour days, bring on more staff and work harder than you thought possible to fight a virus that we knew so little about. I want to thank you for that. You and your team's commitment to that mission represents the best of the Georgia business community and reminds us all of what is possible in rural Georgia. On behalf of all Georgians, thank you, sir, and thank you and your team. God bless you. As state leaders, we knew we had to support these businesses as strongly as they were supporting Georgia. That's why I was proud to work alongside Speaker Rausten, Lieutenant Governor Duncan, in leaders in both legislative chambers last session to support the passage of a PPE tax credit. To incentivize in-state production and ensure that we aren't forced to rely on anyone but our own Georgia-made entrepreneurs for critical supplies. That piece of legislation was exactly the type of common sense business-friendly policy that we should champion here in the number one state for business. To stand alongside businesses who are working hard each and every day to provide for their employees and their communities, in leveraged state programs to support their efforts. That is why as part of my legislative agenda this session, I'm proposing a natural step to the PPE tax credit. By expanding the letter of the law to covered pharmaceutical and medical equipment manufacturers. Georgia is home to some of healthcare strongest pillars with the CDC, several major healthcare systems, and premier medical research institutions like Augustine University and Emery. And as we look to the future on the other side of COVID-19, we should focus our efforts on planning more seeds in that good soil. By spurring job creation from those industries that are critical to the healthcare industry. And building on Georgia's momentum to become a leader in all sectors of the healthcare industry. We've learned many lessons as a result of COVID-19. And one that we learned early on is one that we cannot waste time in bidding wars with other states or foreign adversaries. No one nation should hold a monopoly on life-saving medical supplies or equipment. And we should bring these critical industries and the jobs that come with them back to America and here to Georgia. Despite the challenges of 2020, I'm exceptionally proud of what we were able to accomplish while working together last year. For the first time in our state's history, the General Assembly enacted a public health state of emergency, granting my office the flexibility and the tools needed to lead our state through the COVID-19 crisis. As I've said many times, I know that decision was not made lightly and I want to thank each of you for placing that trust in me. Working alongside Chairman England, Chairman Tillery and our state budget director Kelly Far, we were able to make the difficult choices to balance our state budget when the session reconvened last June. Through diligent work, we passed a balanced budget that reflected our priorities, health care, public safety, education and economic opportunity. And while the media and the politicians in California, New York and others spent their 2020 throwing stones and glass houses, here in Georgia, I'm proud to report that unlike them, the Pete State will not be facing budget cuts this year. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. In fact, our careful planning and measured approach was rewarded in spades. When the pandemic's efforts affect on our state revenue projections looked at worst, we worked closely with Chairman England, Chairman Tillery, Speaker Rauston, Lieutenant Governor and the House and Senate Budget offices to prepare for the worst. However, thanks to the passage of the CARES Act, conservative budgeting and our measured reopening of Georgia's economy, our rainy day fund remains strong. Other states are looking at further cuts to employees and essential services. For aid, they are now forced to turn to a dysfunctional and distracted Washington, DC. But because we acted swiftly and early, the budgets my administration will propose in the coming days include no new cuts to state agencies and departments, no furloughs, no widespread layoffs to state employees. And I might add no new taxes to pay for it all. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. This sound fiscal management enabled Georgia to maintain our coveted triple aid bond rating. And we find ourselves in a position that many other states should envy. As economic experts point the Georgia's ability to weather, the economic fallout from COVID-19 is better than most. But now, as we begin a new legislative session, our state still faces headwinds due to uncertainty in the global and national markets. But it is our job to till the earth, pass budgets that put hard work in Georgia's first, and get ready for planning. Continuing to invest in soil ready to grow Georgia's economy means we have to stay laser focused on promoting development in all 159 counties, not just our capital city. This has been a top priority of mine since the campaign trail. And I know for many under this gold dome as well. We've delivered on those promises by championing pro-growth legislation for rural Georgia and establishing the rural strike team. To bring local developers elected officials and industry leaders together to bring projects of reasonable significance to communities looking to grow. But this is no time to let up. We know that we can land major investments in job creation and rural communities throughout Georgia. But we also know that will not happen if we don't invest heavily in the infrastructure and resources necessary to encourage that growth. Many of the economic, medical, and other challenges that are facing rural Georgia cannot be fixed with a top-down one-size-fits-all approach. These issues are best addressed through targeted, innovative, public-private solutions that meet the needs of specific communities, not just today, but five, ten, or 25 years down the road. That's why I've included in my budget nearly $40 million to establish a rural innovation fund to provide a readily available pool of resources that empowers rural Georgia businesses and entrepreneurs to get started, expand, and thrive. This pandemic highlighted many challenges for communities outside Metro Atlanta. But none more so than the critical need for high-speed internet access, for better health care and educational outcomes, for job opportunities, and something as simple as keeping in touch with loved ones. That's why I'm proud to announce that we're including $20 million for this fiscal year and $10 million per year moving forward to boost access to rural broadband grants. So local leaders can continue a growing and vital partnership with the private sector and quickly improve internet access for the people of rural Georgia. In a year where doctors, nurses, medical staff, public health workers, and other health care professionals have shown themselves to be the best of Georgia and the best of America. There is no question that we must direct every resource available to the expansion of health care access in Georgia, to our most vulnerable, to the families who have seen their income cut and to hard work in Georgia trying their best to make ends meet. We've made great strides toward this goal already, passing and signing over 50 health care bills in the last two years to expand access, spur innovation, and cut costs for better care. Georgia has one of the highest uninsured rates in the country, in many who are insured or struggling to pay for care. In the midst of a pandemic, that is quite honestly unacceptable. More action is needed. That is why my budget proposal for the coming fiscal year includes $76 million to implement Georgia pathways and access to make health care accessible for the first time to thousands and affordable for millions more. By scaling back dependence on failed promises of health care dot gov, giving low income Jordan's a hand up and increasing competition in the private sector to drive down cost will also make use of state resources to shore up Georgia's health care programs with $329 million for Medicaid and peach care to fund projected cost in the coming year. When it comes to meaningful innovative reforms in health care, Georgia is leading the nation. We are putting our money where it truly matters to plant the seeds that we will grow in our state for years to come. We must add important nutrients and strengthen vital life saving programs and invest our resources and keep in Georgia healthy and prosperous for generations to come. Our oldest daughter Jared is in school at the University of Georgia to become a teacher. Earlier this week she actually started her student teaching assignment. Marty, her sisters and I are so proud that she has chosen this path and her passion for educating is only strengthened my commitment to the teachers of our state. The state was proactive and aggressive in easing the overwhelming challenges that face teachers and administrators last year, including allocating $30 million to help ensure student connectivity, slicing the requirements on testing, allocating $19 million to support child care for working parents and providing over $8.3 million of PPE to schools across our state. But the daunting task of teaching Georgia's next generation in the midst of COVID-19 has been anything but easy. So many educators went to extra mile to help the children in their classroom who don't have the best home life. Or maybe it was to do whatever it took to make sure their kids had meals to last them throughout the day. In a day and age where so much is thrown at those investing in our children on the front lines, the additional burdens of remote learning, social distancing, wearing a mask, adapting to the new normal, honestly made educating overwhelming. But the great men and women running Georgia schools didn't miss a beat. From principals, teachers, custodians, bus drivers and support staff on down, their actions have inspired us all. And today I'm proud to announce that working closely with state school superintendent Richard Woods, the state will provide additional support to school system reopening efforts, equating to a one time supplement of $1,000 per teacher and other information. Richard Woods and his team have been tireless champions for our schools, teachers and students even before the pandemic. And I appreciate his friendship and his leadership. At this time, I'd like to ask all those in the chamber and those joining us via live stream to join me in thanking our educators, administrators, cafeteria workers and school staff who face COVID-19 with heart, passion and perseverance. Thank you all. Ladies and gentlemen, I believe it's the responsibility of all of those serving under this gold dome to send a clear message that we support our educators and teachers. That's why for this year's amended budget, I'm recommending $647 million to restore funding to school systems across our state. Fully fund enrollment growth and whole schools harmless for enrollment reductions with $573 million allocated to continue those efforts in next year's budget as well. Those funds mean schools will be able to prioritize our student safety. Insurance and school funds will be able to prioritize our students safety, ensure quality instruction continues and stand with our educators and teachers. In a year when other states may face no other option but the slash education dollars furlough teachers and cut back on essential student programs. Georgia's restoring funding to schools, backing our teachers and launching new initiatives to keep kids enrolled. Like many families, our three daughters have had to get used to distance earning. Having seen this firsthand as a dad, I think I speak for many parents, students and teachers when I say that having a class through a computer screen is leaving too many kids behind. Experts in education and pediatrician, I think, have been able to get a lot of money. I believe the toll on the pandemic is taking the next generation to a crisis point. These challenges are most concerning for our special needs children whose educational achievement, personal development and emotional well-being have been severely impacted by the pandemic. To prioritize assistance to these at-risk students and families, my office will be working with the Department of Education to set aside $10 million in Governors Emergency Education relief funds. To reimburse expenses, parents and guardians have incurred while providing a quality education to their loved ones during COVID-19. Pandemic or night, it is my commitment that we will make every resource available to give each and every student the opportunity to succeed. As many of you have read in the news reports over the last few months, COVID-19 has also had a negative impact on enrollment in some of our colleges and universities. The institutions hit the hardest have often been those serving minority students. With an additional $5 million, a pilot program through the University System of Georgia, we can keep 10,000 seniors and seniors with unmet obligations enrolled in college. These hard work and doggons had nearly crossed the finish line of their higher education. And I believe the least we can do is ensure that financial hardship at the hands of COVID-19 does not stand in the way of them achieving their dreams. The future well-being of our state, in any harvest we hope to enjoy in the years to come, will be determined by our shared commitment to education, to students, parents, teachers and school staff. As your 83rd Governor, that commitment will never waver. In addition to the pandemic, our country faced another crisis throughout the summer and early fall of 2020. In the tragic deaths of George Floyd and the Maude Aubrey, the entire nation witnessed injustice with our own eyes. And I was proud to support peaceful protests that drew the world's attention to these terrible acts. And those voices demanded change to protect the lives of every Georgian, regardless of race, creed or political preference. In a bipartisan way, leaders under this Gold Dome stood side by side and answered that call. Together we pass meaningful hate crimes legislation that reaffirmed George's commitment to be a welcoming state that values the life of each and every one of its citizens. I'd like to thank Speaker Rausten, Lieutenant Governor Duncan, Dean Smirie, Chairman F Strason, Senator Kauser, Senator Harold Jones and others for their work on this important issue. Often times the best of what is accomplished in this building is achieved when we put politics aside and simply do what is best. When I signed HB426 into law last year, I called a design of progress in a milestone worth applauding. But we know, thanks to the example, set for us all by titans like CT Vivian and John Lewis, that work is far from finished. On May 5, 2020, a viral video shocked the world. The horrific killing of Ahmad Arbor shook a Georgia community to its very core. We all felt anger, disbelief, and a deep sorrow, but none more than Ahmad's family and loved ones. Ahmad was a victim of a vigilante style of violence that has no place in our state. The deranged behavior that led to this tragedy was excused away because of a law that is right for abuse and enables sinister evil motives. That's why my administration plans to introduce significant reforms to our state citizens arrest statute and working with legislative leaders and members of both parties. I believe that we can take another step toward a better, safer, and more just future for our state. We can again send a clear message. Georgia is a state that protects all of its people and fights for injustice wherever it is found. Peaceful demonstrations across our state and honor of Ahmad, George Floyd, and others were made possible by dedicated men and women in law enforcement. They worked long hours to protect protesters and to ensure if anyone had a different motive involving violence that our communities and streets remain safe. Unfortunately, many of our law enforcement personnel were faced with events that turned destructive throughout the summer months of 2020. I don't believe it's ever been tougher, more dangerous, more challenging to wear law enforcement uniform, but police officers across the state have made us proud. Our state cannot prosper or reap a good harvest without safe communities, safe streets, and safe families. In a day and age where many vilify the men and women who protected our communities each and every day, my message is very clear. In Georgia, as long as I'm Governor, we back the blue. Atlanta Police Officer, Max Brewer, is an 18-year law enforcement veteran and is self-described motor man for life and serves in the Atlanta Police motorcycle unit. On Saturday, May 30, Max was on duty in the city of Atlanta on the corner of Marietta and Spring Streets, assisting in traffic flow and ensuring demonstrators were kept safe. Around 1030, that night officer Brewer was struck by a drunk maniac on an ATV and suffered serious life threatening injuries. Going in and out of consciousness and losing a significant amount of blood, officer Brewer's need was critical. The call.\n\nout for help. The closest available assistance was a Georgia National Guard unit under the leadership of Sergeant First Class, Justin Rustin. Sergeant Rustin's team responded quickly to the scene, applying a tourniquet to Officer Brewer's leg and providing life-saving medical treatment at a moment's notice. The actions of Sergeant Rustin and his fellow Georgia guardsmen literally saved Officer Brewer's life. Once stable but in critical condition, Max was transported by the Guard Unit to Grady, where health care heroes continue to save his legs and his life. These two gentlemen and countless other first responders answered the call to duty in 2020. Both Sergeant Rustin and Officer Brewer went above and beyond that call, and for that my family and our state are incredibly grateful. Officer Brewer wanted to join us today, but he still received an treatment for his injuries. Today Sergeant Rustin is in the chamber with us and I want to thank them both. Thank you, sir. As state leaders, we spend a lot of time talking about Georgia's status as the best place in the country to live, work and raise a family. We talk about it because for so many Georgians, that phrase reflects the reality of how blessed we are to live in the peach state. Georgia is rich with good soul, but is our job to weed out the evils which seek to steal that promise from all of those who call our state home. It is abundantly clear that no industry embodies that theft of innocence, childhood and opportunity more than the sinister enterprise of human trafficking. During our first days in office, we hit the ground running to crack down on traffickers, care for victims and eradicate modern-day slavery in our state. And before I go any further, let me just say this. I don't think and I know no First Lady in the country has done more to end human trafficking than our First Lady Marty Kemp and the people of Georgia, myself included, are lucky to have you. Thank you for your work. Marty and the Grace Commission have done incredible work these first two years, implementing statewide training programs so Georgians know the signs and how to report instances of human trafficking. Passing bipartisan legislation, meaningful legislation that toughens penalties on those who participate in the sale of a person's innocence for profit and working with organizations on the front lines in communities throughout Georgia to ensure survivors of human trafficking find their voice and their transition back into society. But as Marty and all of those who are fighting tooth and nail to end that industry will tell you, there is far more work to be done. On the heels of the year that so much so much division among party lines more than any in recent history, I'm asking members of the General Assembly to unite once again. Let's build on the great work done by the Grace Commission by implementing more training programs that equip Georgians to recognize and prevent instances of sex slavery. Let's make common sense reform to our laws so survivors seeking a name change to build a new life, no longer have to take out an ad in a paper that puts their safety at risk. And let's strengthen our statutes to add a civil remedy that allows victims to seek court action against their trafficker or those who knowingly aid in their trafficking. There is no shortage of issues. There is no shortage of issues on policy or politics to debate this year. But taking common sense steps to keep people safe and bringing in to modern day slavery is a goal that each of us can work together to achieve. You see there is so much more that unites us than divides us. And working together we can continue taking necessary bipartisan action to champion the voices of the vulnerable here in Georgia. Protect our children. Implement adoption reforms that make it easier to put them in a safe loving home. And ultimately secure the promise of Georgia for generations to come. As I come before you today my memories of 2020 will not just be the struggles. The many challenges I spoke about today. The countless tough decisions or the sleepless nights. Like many of you I will remember time spent with my family that otherwise would not have been possible. I will remember standing shoulder to shoulder. Well six feet apart. With the best private sector, political and civic leaders in our state to face a once in a lifetime pandemic. I will remember my travels across the state to visit Georgia companies and workers who proved innovation in hard work or the backbone of our economy and well-being as a people. I will remember the countless sacrifices and hardships faced by the people of our state and how we pulled through. How we weathered the storm. How we emerged resilient and stronger than ever. The reason you build a house with a strong foundation is not for the good times. Not for the sunny days. You do it to weather the storm when times get tough. I spent my summers working on a farm. It's hot, it's hard work, but it's also rewarding. Watching the seeds you planted grow over the days, weeks and months. Literally enjoying the fruits of your labor. I know that many in this room in those watching are worn out, tired and burdened. It's a new year, but it all feels the same. There's no doubt that this new normal isn't really normal. And frankly, it's not clear when things will return to business as usual. But my fellow Georgians, we have the opportunity and responsibility to make strategic decisions now that will impact generations to come. We have the opportunity to act and accomplish what we were sent here to do. In five years, 10 years, or 20 years, we can look back and tell our kids, our grandkids and their kids that we invested in health care, education and the safety of our communities. We upheld our sworn oath and stood up for what was right even when it was a popular. We prioritized jobs and prosperity in all parts of our state. We champion legislation to make our state a more welcoming place to live work and raise a family. We protected the lives and livelihoods of what makes Georgia great our people. It's time to put differences aside. Put 2020 in the rear view. Let's stand together as Georgians and clear the destruction caused by the storms of life. Let's clear away this conspiracy theories and the division. Let's focus on the bountiful harvest to come. Let's find that good soul together and start planning. May God bless you and may God continue to bless this great state of Georgia. Thank you very much. Thank you Governor Kemp for those great words. Thank you for your steadfast and consistent leadership through the past, the present, and the future. I'm reminded of another Bible verse that you gave to us last year, NIS-63. I'm doing a great work and I cannot come down. Thank you so much on behalf of 11 million Georgians for not coming off that wall. Thank you. Madam Doorkeeper, please escort the governor and his distinguished guest from the chamber at this time. Chair, we'd like to recognize the President, Pro Tem of the Senate for a motion. Mr. President, I move that this joint session of the Georgia General Assembly be dissolved so that the senators can get back to work and the House members can go to lunch. The President of Pro Tem has moved that this joint session be dissolved. All those in favor of the motion signify by saying aye. All opposed, no. The eyes clearly have it and this joint session is dissolved. Given the hour, given the hour, it's the chair's intention unless there is a burning need to carry all the morning orders over until the next legislative day. I don't hear a burning need. You want to do one? Well, good luck getting order. Chair recognizes Representative Drenner for a morning order. Thank you, Mr. Speaker. I'm not trying to hold everybody up for lunch, but today to me, in this time of COVID, is so important to recognize that my mother's 83rd birthday is today. Like many of you, I did not spend Easter Thanksgiving or Christmas with her. I know she has had a very hard and lonely year. I did drive back to West Virginia for a brief visit last October because her best friend, her dog buddy, died abruptly. I'm so glad that I went despite my angst associated with possibly transmitting the virus to her to give her a hug, to tell her how much she has loved was worth it. She taught me so many things growing up to believe in God to be truthful and to follow the golden rule, which is so important today more than ever. Mom, whatever God's plan is for our future, let me say this to you. Thank you. There is never a day that I am not thankful for you. Happy birthday. I'm sorry the card is late. I know that it doesn't count if you don't get it today. And here's to many more. I'd love you, Mr. Speaker. I yield the well. And thank you. Chair recognizes Chairman Dickey for a morning order. I can expect her and I'll be brief, but this really will help me when I get back home. I want to recognize a very special person today. Back in my district, a very hard working business woman that rattles the tuxeday off a community volunteer across the state, my community, a mother, a campaign volunteer, but most important my wife. And the day is my anniversary and I'm a real lucky guy to be married to her for 43 years. So thank you. Talk about kissing up right there. Chair recognizes representative Burshchett for a morning order. Thank you, Mr. Speaker. I come to you today with a heavy heart. In my district, we lost a great man. The sheriff of where can a Georgia Randy Rol pass yesterday at lunch. The sheriff epitomized what a public servant is. He spent 40 years serving the people of his district and his county. From every position, from dispatcher to sheriff, he worked his way through the ranks. Sheriff Oil was a good man and he always did what was right and he exemplified a person that understood that no matter what, it was never wrong to do what's right. And I appreciate everyone in here just recognizing that our law enforcement are a huge, huge reason that Georgia is such a great place to live. So if you would join me in just a few moments of reflection for the life of Sheriff Randy Rol. Thank you, Mr. Speaker. Chair recognizes representative Bennett for a morning order. Thank you, Mr. Speaker. Born in Oakland, California to a mother named Shyamala, a biologist and immigrant from India and to a father, Donald J. Harris, a Stanford University professor, vice president, he led comedy, D. Harris is undoubtedly one of the most famous members of my esteemed sorority. On January the 15th, our full cap of alpha sorority incorporated will recognize 113 years in our illustrious Founders Day. We have many important and well-accomplished members in our sisterhood. But today I am proud to recognize one of my own who has cracked the grass glass ceiling and that is none other than our vice president-elect, Kamala Harris. So on behalf of representative Carolyn Hugley, on behalf of representative Dashaan Kendrick and myself, we honor and recognize, want to join me in recognizing tomorrow January the 15th as our 113th Founders Day. Thank you, Mr. Speaker. Chair recognizes representative Anola Litz for a morning order. Thank you. January is cervical cancer awareness month and Thursday, January 21st, a cervical cancer awareness day at the Capitol. The event Thursday morning is going to be virtual, but it's a wonderful opportunity if you want to log in and I'm sending information on how to register for the event and how to attend the event. It's going via the Capitol Post Office to each of you. But we're going to be recognizing advocates, physicians, stakeholders who are doing what they need to do to raise awareness of cervical cancer in Georgia and then how we can fight cervical cancer in Georgia. There is a vaccine, the human papilloma virus vaccine that actually can help make cervical cancer a thing of the past as well as eight kinds of cancer that have impact both women and men. I hope you'll be able to join us on January 21st. Look for information in your mail. Thank you. Chair recognizes representative Pruitt for a morning order. We'll do all these you want to, but I would point out to you that 341 is completely empty. So just saying. Thank you, Mr. Speaker. Good afternoon. While being part of you for only four days now I felt compelled to this morning or this afternoon to share with you and honor the life of one of Georgia's and districts 149's finest citizens. This morning at the age of 47 fire chief Lee Kirkland passed after a brief battle with cancer. Chief Kirkland was a member of San Grove Baptist Church and a devotee, a patriot, father, husband, community leader and a strong father of Christ. It is great pleasure that this morning Lee heard these words well done my good and faithful servant. A moment of silence please in honor of this man. Thank you. Thank you so much. Thank you representative. That's all the requests that we had to go ahead and do your morning orders today. All other morning orders that had signed up will be carried forward to the next legislative day. The clerk will read the caption to a privileged resolution honoring the life and memory of Roger Dale Floyd of Locust Grove. That completes the reading with privilege. Is there any objection to adopting the privileged resolution? The chair here is none and the resolution is adopted. Chair recognizes the chair of the House Appropriations Committee, Chairman England for an announcement. Good afternoon everyone. I know all of you are looking forward to long weekend and we are glad to provide you with some excellent reading during your stay at home with 400-450 page novel that is available for your pickup over at the House Budget Office in the CLOB room 14. So once you come off the front bank avellators, take a left, continue going to the left at the end of the hall and it's the last room on your right. Our folks will be there to hand those out and we are taking roll to make sure that everybody gets their copy and no one else's copy and be sure to hang on to that book. Put your name on it so nobody else takes it from you. Again, Tuesday we will kick off our joint budget hearings with our colleagues from the Senate at 9 o'clock. The governor will address us that morning and we will roll forward with that. You should have already received the link for the virtual attendance and again we strongly encourage virtual attendance. There will be very limited seating in 341. Most of our presenters this year will be virtual so if you are on the committee be sure to follow the Zoom link so you will be counted present and all others are more than welcome to watch via the streaming service as well. So remember Tuesday morning, 9 o'clock running, Tuesday Wednesday and most of our part of Thursday and then our subcommittees will begin meeting Thursday afternoon and Friday as well and those will also be in a virtual format. Thank you, Miss Speaker. Let's not go tell the governor that the chairman called his budget proposal fiction. He called it a novel. That's fiction. That's it. All right, we're going to have some birthday celebrated before we come back. I want you to join with me in wishing a happy birthday on Sunday January 17 to representative Josh McLearen, happy birthday on Wednesday January 20 to chairman Gerald Green on Friday January 22 to representative John LaHood and on Saturday January 23 to the silver haired Fox from Cordial Representative Noel Williams. Chair recognizes the majority leader of the House for a motion. Mr. Speaker, this is not a fictional motion. Mr. Speaker, I moved that this House stand adjourned until 10 a.m. Tuesday January 26, 2021. The majority leader has moved that this House be adjourned until Tuesday January 26, 2021 at 10 o'clock a.m. All those in favor of the motion will say aye. Those opposed will say no. The eyes clearly have it and this House will be adjourned until Tuesday January 26 at 10 o'clock a.m.",
  "updated_at": "2026-02-13T09:52:36.647981+00:00"
}