{
  "video_id": "Aoqm2R0lJPk",
  "url": "https://www.youtube.com/watch?v=Aoqm2R0lJPk",
  "title": "1/22/2024 Senate Committee on Rules",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 17,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Rules session on 1/22/2024:\n\n**Overview:**\nThe session focused on routine procedural matters, with the committee considering and passing a resolution commending the Atlanta Public Schools system. A proposed study committee resolution on firearm storage protocols was tabled after some discussion.\n\n**Key Actions:**\n**SR 352**: Commending Atlanta Public Schools on 150 years of service - Passed unanimously\n\n**Bills Introduced (First Reading):**\nNone detected\n\n**Notable Moments:**\n- Discussion on updating data points in SR 203, the resolution to establish a study committee on firearm storage protocols\n- Debate on the purpose and scope of the proposed study committee\n\n**Votes:**\n- SR 352 - Passed unanimously\n- Motion to table SR 203 - Passed 13-4\n\n**Attendance:**\nQuorum present, no notes on specific attendance.\n\n**Adjournment:**\nNo explicit adjournment noted, but session appears to have concluded.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nWe're gonna start with it. I can't think of the word order. We're calling it order. There we go\nSee Mercedes, that's why I pay you big money. All right first on the agenda\nWell first off is how's everybody doing today?\nDoes anybody have anything they'd like to share with the general public before we get rolling any big news?\nNothing\nMan just lively crowd today\nAll right, well, let's get rolling\nIs Senator Halpern here?\nShe is not she came last week. I'm gonna go a little out of order here on the agenda\nBut the rules y'all voted on allow me to do that\nSo we're gonna do Senate resolution\nthree fifty two and this was just simply she was supposed to be here she was\nhere last Thursday and I just didn't pay attention and missed it so this is\njust commending Atlanta Public Schools on 150 years in service and that's it\nit would need it does not there's no dates on there so we're okay so there's\nthere's no changes that need to be made.\nDoes anybody have any questions\nabout the underlying resolution?\nOkay.\nSenator Rat, what's your number there?\nMake a motion.\nAll right, sure.\nGot a, to move forward.\nState your motion.\nMake a motion that 352 move forward.\nAll right, I've got a motion that Senate resolution 352,\nLC-127-0296.\nOh, this is it.\nSir, how is there anything you'd like to add?\nI've already covered it for you.\nThank you, sir.\nDo you want to?\nNothing else to add?\nDo you want to grandstand or anything?\nI don't.\nI'll just say 150 years is a very long time,\nand it's worth commending our Atlanta Public School system\nfor all they do for our students here.\nSo thank you.\nYeah, absolutely.\nIt's even 151 now.\nAll right I got a motion of do pass. I've got a second from Senator Jones of the\nsecond Senator Jones. Any further discussion? All in favor say aye. All the\nOpposed, same sign.\nAll right, motion passes, unanimous.\nOkay, we're gonna jump back up to Senate Resolution\n203, Senator Emanuel Jones of Henry County.\nFloors yours.\nThank you, Mr. Chairman and members of the committee.\nThis is the Senate State of Committee\nfirearm storage. First of all, you said this is not a gun bill. It's simply information\nthat's been obtained across various sources. One being the American Academy of Pediatrics\non the number of kids that are, and I would move the data that's on here that I be allowed\nto update it. Whereas on line four, it says 5.4 million American children, the latest\nstated from the American Academy of Pediatrics is really 4.6 million and down on line\neight school students incidents up to 80% it is much closer to 74% according to the\ndata that I have, Mr. Chairman and members of this committee.\nAnd also over on the very last page are move that the date on here, the Boschman date,\nbe changed to December 1, 2024.\nquestions? That's my job. Don't take it from me. It's all I got. All I got. Come on. Any\nquestions from the committee? All right. No questions from the committee. I can\ncovered it so well. Senator Rat. Okay, I've got a motion of due pass in a resolution\nto zero three. Assumin, did I'm sorry sir. We'll take the motion first. I would need a second if\nall right, sir and gentlemen, this is going to second that. Now, I would need an\nmotion to amend line 68 removing the number three and replacing it with the number four\nto make it December abolishing the committee on December 1st 2024. I got a motion from\nSenator Rat for that amendment, a second from Senator Jones, and...\nChairman, the rest of the question.\nSure.\nWhat was discussion?\nI was a little late to the meeting, but I apologize for missing that first discussion,\nbut I didn't fully understand the purpose of this study committee.\nIf I'm looking at lines 14 through 19, it looks like that's the meat of the study committee,\nsure if that's something that we're going to spend thousands of hours on and thousands\nof dollars of taxpayers dollars, I don't know if it warrants it or not. I'm just wondering\nif the sponsor of the bill could elaborate more on what the purpose of the study committee\nwas. I'm not real clear.\nSir, I'll allow if you'd like to further elaborate.\nThank you, Mr. Chairman, and thank you for that question.\nGeorgia Laos is a response to safe storage,\nand this is safe storage in regards\nto protecting our children, particularly small kids\nthat are in the household where firearms are present.\nAnd it's simply to see whether or not there's any changes\nthat's needed to current state law.\nThat's all that the State of Committee does.\nSo can I have your question on line 14, the current pediatrics screening protocols, can\nyou explain what that could be?\nAbsolutely.\nAgain, this is a protocol from the American Academy of Pediatrics.\nThey have a very extensive program and there is a handout that I can share with you that\nhighlights their website as well.\nthe pediatricians in their conversation with parents,\nand of course, they're the frontline folks\nwho see these kind of incidents and accidents,\nand of course, the injuries that are suffered by children\nthat have firearms in their home that have been stored\nimproperly, so they have taken upon themselves\nas part of their directive\nto have this conversation with parents.\nSo they are really on the frontline of leading this charge\nas it relates to safe storage of firearms at households,\nparticularly as my children present.\nThank you.\nThank you, Mr. Chairman.\nAll right, hang on, Senator.\nI want to get a question here\nfrom my vice chairman, Senator Gam.\nThank you, Mr. Chairman.\nLook, I was a competitive shooter\nin high school of college and very familiar\nwith what I considered safe storage\nand carrying for firearms.\nOne of the things that for me,\nI'd love to serve on your committee\nif it does happen, said, but,\nWhat do you really consider safe storage of a firearm?\nI mean, you know, give me, what is it that what you're looking for?\nUm, first of all, I am, you know, ex-military and I've been trained in the safety and, of course,\nthe care of firearms.\nThe only thing that I'm looking for is the support to work that's done by a pediatricians\nto expand on that body of work to see if there's anything the state of Georgia can do to\ncertainly enhanced the work that they are already doing, to see if there's a possibility\nof any laws that need to be changed, a tweak, to see if there's a way that we can reduce\nthose number of injuries that suffer by our children.\nOkay.\nAll right, motion of table takes precedence.\nSo I got a motion of table from center of gouge, second from center of doles all,\nall in favor.\nRaise your hand.\nOne, two, eight, nine, ten.\nI got 13, all opposed, raise, four.\nAll right, 203 is tabled.\nI think we all are in favor of safe storage of firearms and I think we all know what that's\nabout and what that means and we trigger logs and putting you gun in a safe et cetera.\nI do want to make a point that Senator Patrick is\nintroduced to be able to promote the use of farm safety\nas far as sales tax break on trigger locks and gun\nsafes and that kind of thing.\nSo I don't want the general public to think that we are not\nin favor of safe handling of firearms, especially when\ntheir children in the home, but I think it doesn't marry at a study committee to know\nwhat you need to do to safely store your firearm.\nIn our A promotes it, there are a lot of organizations that promote education and that kind of thing,\nso thank you for the point of personal privilege.\nSo hopefully the 12 people watching at home won't think that.\nOK, and thank you for your comments.\nAll right, moving on, we've got, we're actually\ngoing to hold SR-433 per the author's request.\nAnd I've got SR-443, Senator Kennedy.\nThis is the appointment of Rick Jeffries to the state election board.\nYou can do that from your seat.\nThank you, Mr. Chairman.\nGood afternoon, committee members.\nAs our chair just said, this is about the appointment of the state election board.\nThe Senate elects by majority vote, and we have this by this resolution, we're proposing\nour former colleague that many of us serve with Senator Rick Jeffries from Locust Grove.\nHe's a successful businessman.\nHe's got a long record of public service\nand community involvement.\nHe's been a city manager.\nHe's been a city commissioner or a county commissioner\nbefore he served in the Senate.\nAnd this simply would appoint Rick Jeffries\nto be appointed as a member of the state election board.\nI'm gonna move for a second.\nWell, before we get into all that, I'm gonna add\nthat is if his resume wasn't enough\nto get him on this board. His desk is in the rules is in my office, that beautiful\ndesk that makes me look important, which we all know I'm not. So all right. I got a\nmotion. Who was the motion? Senator Anderson. Motion for Senator Anderson. I got a\nsecond from center again. Any discussion. Here we go. All in favor say aye.\nAye. All opposed. Same sign. Motion passes unanimous. Thank you, Mr. Chairman.\nI thank you to the committee for that vote. Good job. Good job. All right. Well,\nWe're going to call standing rules adjourned and we're done.\nThat's it.\nThank you all.\n",
  "updated_at": "2026-02-12T19:49:20.966618+00:00"
}