{
  "video_id": "ARse0ysUJ6k",
  "url": "https://www.youtube.com/watch?v=ARse0ysUJ6k",
  "title": "6/13/23- Senate Committee on Retirement",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 36,
  "summary": "Here is a structured markdown summary of the Georgia Senate Committee on Retirement session from June 13, 2023:\n\n**Overview**\nThis session focused on reviewing Senate Bill 328, which makes several updates to the Police Officer's Annuity and Benefit (POAB) fund in Georgia. The goal is to modernize the fund and improve some member benefits, while maintaining the fund as self-funded by member dues rather than state tax dollars.\n\n**Key Actions**\n**SB 328**: Updates the POAB fund, including increasing member dues, expanding buyback options, and increasing death benefits.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Senator Albert provided an overview of the POAB fund and the key changes in SB 328.\n- Senators asked questions about the impact on membership, the actuarial study process, and potential equity with other public safety death benefits.\n- Homer Bryson, the POAB fund leader, provided context on the current membership and financial status of the fund.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nA quorum was present, with the committee chairman and several senators participating.\n\n**Adjournment**\nThe committee took no final action and did not set a date for a future session.",
  "transcript": "You\nYou\nCommittee on Retirement to Order.\nThis is Tuesday, June 13th, and Senator Harbin, how about\nI'll lead us in a word of prayer, please.\nYeah, me, thank you.\nOkay, let's pray.\nLord, we thank you for just the opportunities\nthat you give us.\nWe ask your father for wisdom and discernment\nas we deal with the business of the state of Georgia.\nAnd when we represent our citizens well\nand their best interest and those that serve us.\nThank you for your love and your faithfulness to us.\nWe want to thank you in Christ's name, amen.\nAmen.\nOkay, first we're going to hear from Senator Albert.\nWe'll let you is at Senate Bill 328 and your LC number.\n432834ER.\nAll right.\nFloor's yours, sir.\nThank you, Mr. Chair.\nI remember.\nThe committee, I appreciate the honor to present this bill in front of you.\nA little background on the POAB, which is the police officer, a new identity benefit fund.\nfund. It's one of the most successful ones not just in the state but in the\nnation. It is led by someone who is no stranger when this room is Mr.\nHomer Bryson behind me. We have a great team of people and the sole purpose of\nthis is without using state tax dollars. We repeat that without using state\ntax dollars. We have a pension fund that helps our post-certified police\nofficers in all corners of the state. It doesn't matter where you live. Each one\nof them as long as they maintain their post credentials and pay their dues can participate\nin this fund. While it looks like there's a lot of pages here, it's a lot of technical\ncleanup actually. So you'll see a lot of things struck it out with just updating and modernizing\nsome language, but the bill does do a couple of basic things. It improves some benefits\nfor members which I'll talk about. The members themselves pay a $25 a month dues, they're\ngoing to increase their own dues to $35.\nAnd the goal with all these updates\nis then for you to hopefully bless it today\nto go for an actuary study, which we believe will actually\ncome back a very favorable base in the modeling\nthat Mr. Bryson and his team have already done.\nSo you'll see under the administrative changes\nvery briefly that this is in line with the definitions\nwe use for the Post Council, which\nis police officer standard in training.\nIt changes other job titles and duties\nthe board but again just making it clean and consistent with what we do in other\nplaces. The other thing it does is it matches the service requirements for folks\nwho can buy back years of pension that didn't perform from five to seven years.\nContinuing on the cost will be calculated for them to buy back years at what the\nfull actuary cost will be. As you know Mr. Chairman and committee members we\nhave a shortage of those who are willing to serve in law enforcement over the\nlast several years especially and what this is going to do is allow those that\nhave vested in the plan for 30 years to be able to receive their pension but\nalso remain employed in the public safety arena why they get their P.O.E. pension.\nIt doesn't penalize them for coming back to work when more than ever we need\ngood experience and tenured officers to serve. The death benefits today are\nare $3,500 with restrictions that will upgrade to $5,000\nwithout restrictions.\nSimilarly, the wine of duty deaths will increase\nfrom $5,500 of restrictions to $10,000\nwithout restrictions.\nOne last change to the fund will be that if someone decides\nthat opt out of membership to the fund,\nthat they will get all their dues paid back to them\nin full that they put into the fund.\nSo again, we believe that this will be a favorable\nanalysis from the actuaries with the increase of the $10 per month.\nThis is run for our officers, by officers, and the folks engaged again and have one of\nthe best plans in the nation.\nAnd I'd ask that you would give us a favor of consideration going to the next part of\nthe process.\nAnd I would yield for any questions.\nThank you.\nDo we have any questions from any board member?\nSenator Harvey?\nI don't know.\nThank you, appreciate that.\nSenator Albus,\nquestion, the buyback was mentioned.\nSo someone can be in it as I understand it\nand they can pay back if they were not there\nfor the number of years they can buy those years back.\nCan you come and give me help?\nYeah, there's two points there.\nSo if they were not involved in the fun,\nthey can go back and buy back up to seven years,\nfive to seven years with that to pay the full actuary cost\nof what it would be at that time.\nIt's not just, you know, five years times the monthly fee.\nIt's what would have accrued during that time.\nBut then if somebody was in the system for, say, 11 years,\nand they decided they wanted to opt out,\nthey could opt out and get their dues back.\nOkay.\nWe would certainly hope they would never do that\nbecause it's a pretty good return on investment.\nOkay.\nOkay.\nThank you.\nLet's see, Chairman Tulleray.\nThank you, Mr. Chairman.\nThanks, Chairman Edwards.\nI just got a couple of questions.\nDo we know, and maybe this is something\nprocedurally that I'm out of order on.\nThe, we go for the actual oral study\nafter voting through this meeting today.\nSo that one we would know how many people are eligible now\nand how many people would be eligible in the future.\nWould that be a fair question asked now?\nIs that something that could go later on?\nIf I could bring up Mr. Bryson to give me an assist, yes.\nSure.\nAnd using round numbers and good morning, Mr. Chairman.\nHow are you?\nIn using round numbers, we've got about 14,000 active members in the fund now.\nWe're paying monthly pension to close to 8,000 individuals.\nWe're paying out $4.65 million a month in retirement pensions.\nAnd again, this does not change the eligibility into the fund.\nSo we don't see that this would make a huge change in what our membership status is.\nSo we, and then after the actual aerial study is that when we find out how many would be\ncovered by a new or, is there a, is there a report that comes later that tells us that\nI'm, I'm just wondering from a procedure standpoint.\nI'm not sure that this will change our numbers greatly.\nI think really what we're looking to do here is clean up this, this code was could put\nin place in the 50s and it's been added to and for decades and we're cleaning up and\nmodernizing the code basically, and we've changed some of the application process, sort\nof streamline that, and we're looking to simplify our death benefit.\nAnd to also streamline our by-back plan, our current by-back plan is you have to join\nand be a member for five years.\nThen you can buy back up to five years, but you have to work however long you buy back,\nit does not count towards vesting. And so what we want to do, what we've heard from our members is,\nonce they join, they would prefer to be able to buy back day one and just pay the full actuarial\ncost and then it count towards vesting. Gotcha. Can I ask one more question, Mr. Chairman?\nOne of the things that I've heard of, y'all probably got the emails too, is about some disparities\nabout maybe how we treat our state officers versus county officers and others and some\nof these plans with death benefits.\nI know that your plan is more than death benefits and I know that also your plan is self-funded\nessentially by its members and is different.\nBut one of the things I might be looking at is seeing if what the change might be if\nwe had to make that death benefit be equal across all those who are in public\nsafety. So if that's something we can look at and see if that would how that\nwould be affected by the actual numbers I'd love to see that if it doesn't work\nI completely understand because your members are funding it themselves it's not\nbeing funded with state general funds but I'm gonna be curious about that as it\nmoves forward through this session. And thank you I'd like to add to that because\nas I'm passionate as you are equally,\nevery department is different, right?\nWhether it be a state, city, county,\nor even school system for a safety resource officer,\nso each one of them have their own benefits,\nbut there is also a state benefit\nthat's separate any federal benefit,\nespecially if it's a line of duty death.\nThe question that I think we should look at a little further,\nand I'd love to speak with you offline,\nis states like Florida and Oregon and some other areas\nhave taken that a little bit further, really for the non-line of duty benefits.\nAnd the reason for that is, is the rate for someone in public safety to have heart disease\nis three and a half times greater than average person.\nAnd many of you know Lance Russo, who is really one of the leading attorneys to represent\npublic safety members throughout the state of Georgia, I'll quote his statistics that\nthe average person in their life will have a post-traumatic stress event, right?\nWe think of PTSD mostly from our combat soldiers.\nWe hope it doesn't get to the D,\nbut the average human being, all of us,\nwill have four of those throughout a lifetime,\na post-traumatic stress event.\nA combat veteran can have as many as 100.\nA public safety person experiences an average of 700\nin their lifetime.\n700.\nSo if you think about what that means to their physical body,\nto their mental capabilities, to what it impacts\nto their families, et cetera.\nThey see three bad things.\nThey have to go to the next call immediately.\nAnd it's the next day.\nIt's the next shift.\nIt's the next whatever.\nSo the things we do to help support them and serve them.\nAnd this Senate has led the way with the peer support\ngroup and all the other work we did.\nI think we still have to do more of those.\nSo thank you for your question.\nI'd love to work with you on that.\nOkay.\nSenator Harvin?\nSir, I was just understanding, as I see,\nthe summary. The options, of course, are a life settlement, a joint settlement, or a joint\nsettlement with a reduced monthly benefit. I don't see in the summary sheet that we have\nthe life insurance side of it, and I'm assuming the two, I'll give you two questions. If someone\nhas a life annuity, once they die, that annuity goes away, they're not, they're not, they're not\njoint their single life only, but there's a death benefit also that goes with that.\nI don't see the death benefit at least a number. Is that number based upon their account value?\nOr how is that determined?\nMake sure I understand your question. Are you referring to the death benefit?\nDeath benefit, yes.\nDeath benefit will either go to a spouse or in a state.\nHow is it calculated was my question?\nWell currently that's there's a lot of caveats that go with it and how long you remember how\nmuch you've received and retirement benefits. We're wanting to do away with that and just have it\nif you're if you are a member in good standing and you pass away you've got those two dollar\namounts certain. Okay okay so rather than some calculation on the account value that you're pulling\ndown it's going to be a fixed amount. That's correct. Okay. Thank you. Thank you. Is anyone\nelse wish to speak to Bill? Hearing none, what is the desire of the committee? Move due pass.\nWe have a move to pass, Senator McClaren.\nCan I clarify is that motion for an actuary to move it forward to an actuary?\nIf that is the motion, then I second that motion.\nSo we have a second.\nIn a discussion, all in favor say aye.\nSo, Carrie.\nThank you, Mr. Chairman.\nThank you, members of the committee.\nappreciate your unwavering support of all of our police officers and sheriff's baths state.\nThank you so much.\nNext we have Senate Bill 322 from Senator Walker.\nHe was not able to be here.\nDo we have someone that can present that bill?\nIf you want to present it to Ricka, but stand by just a moment.\nyou present this bill for Senator Walker since he's not here. I know you're\nexcited about this. Mr. Chairman, I am excited about this. I'm more excited to see\nall of you interrupting your summer on our behalf. So thank you for that. I am\nTerry Norris. I'm a few things. You all know me as the executive director of the\nGeorgia Sheriff's Association, but also happened to be the Secretary of\ntreasure of the Sheriff's Retirement Fund of Georgia.\nThis is a public retirement fund, of course in code.\nIt's created for the elected sheriff.\nThere are no state funds that contribute to the fund.\nPresently there are 199 retirees with an average monthly pension of $2,713.80.\nSo we're asking in this bill, Senator Walper, I should say is asking in this bill to make\nseveral increases in the current, some of the current details of the bill, prior service.\nPresently, you can buy up to eight years prior service if you've had military.\nYou can buy up to four years military and up to four years of law enforcement experience.\nThat current buyback is $37.50.\nWe're asking for that buyback to be increased to $65.\nAnd the second thing we're asking for is dues.\nThey pay the sheriffs, pay dues monthly into their fund.\nCurrent dues, all this hasn't been changed in many years.\nCurrent dues are $45 and we're asking that to be increased to $65.\nRecently, there is no collection of any fees on pre-adjudicated cases.\nYou know, in the past 10 or 12 years, this General Assembly and our governor has agreed\nand said that we should do things to help people avoid conviction.\nAnd there's been a lot of pre-adjudicated cases where they've been allowed, these defendants\nhave been allowed to do other things rather than be convicted.\nAnd that happened a lot of the fine revenues that were going into our shares retirement\nfund.\nAnd likewise, the Peace Officer and Newty and Benefit fund that you just spoke of, there\nwas a lot of fees that were lost.\nSo we're asking to do something similar to what you all did for the Peace Officer and\nNewty and Benefit fund a few years ago.\nI think there's those $5 on each case, on these pre-judicative cases, excuse me.\nIn this particular bill, we're asking for a $2 fee on each of those cases.\nOn the service of civil papers, the current fee that's collected on the service of papers\nby sheriff's offices is $1.\nWe're asking that to be increased to $5.\nWe're asking that if there's a felony conviction of a retired, excuse me, an elected sheriff,\nthen related to the performance of duties as a sheriff, that the retirement board, sheriff's\nretirement board, be allowed to consider removing those benefits from that particular person.\nThat takes place, of course, later on, does not affect any sitting sheriff.\nAnd finally, really the origination of the bill, Chairman Tillery, had to do with the\ndeath benefit.\nAnd we originally asked, excuse me, the current death benefit for the sheriff's family in\nthe case of the death of the sheriff or the retired sheriff is $15,000 and we're asking\nthat to be increased to $35,000.\nMr. Chairman, that's all I have to say about it at this point.\nAgain, we appreciate your time this morning and allowing us to interrupt your summer break\nFor the record. This is Senate bill 322\nLC number 432823\nThere's any questions from any member\nThe\nYeah, let's see\nI'm a 13\nThank you, Mr. Chairman, and good to see you.\nThanks a lot.\nI guess Senator Harbor and I were calling it a,\nit's got that reunion feel, right?\nBut it's a mild reunion feel, right?\nThere's only a couple of months, so.\nWe need to ease back into it.\nYeah, right, exactly.\nGot a question about the new $2 off of pre-trial diversion.\nSo my understanding is under statute.\nThat's a fee that the local jurisdiction imposes\nand it's a maximum of $300.\nI don't know, that subsection F is that you're\nunderstanding here.\nHonestly, I'm not familiar with that part of the\ncurrent law.\nIt's outside the realm of this particular bill, I believe.\nOK, we'll write.\nI mean, this is so often our convenience, the bills,\nor the statutes we cross reference\ndon't show up in full text in the bill,\nso we have to do a little googling.\nBut this is OCGA 15, 18, 80.\nSo I'm looking at line 76-387 of this bill.\nAnd it's referring to the fee collected there\nand subsection F says the prosecuting attorney\nshall be authorized to assess and collect\nfrom each offender who enters the program\nof fee not to exceed $300 for the administration of the program.\nAnd then it says any fee collected under the subsection\nshall be made payable to the general fund\nof the political subdivision in which the case is being prosecuted.\nSo right now the local government gets whatever that fee is\nby statute and this would be a carve out.\nI guess, so you sort of have answered my question already by saying it's outside of the realm\nof this bill, but I guess I am curious about how this works in practice.\nI mean, do we have any information about whether local jurisdictions are already maxing out\nthat fee at 300?\nDo we know if, on average, they're doing lower?\nDo we know which jurisdictions have maxed out the 300 fee?\nI guess is they're all maxing it out because I think the concept behind that 300 as I recall\nthat conversation now was to help all set, further all set the cost of running the accountability\ncourts and other costs related to that local jurisdiction after the court has imposed\nwhatever that those provisions are to pay the cost of dealing with that particular situation.\nThat's only a guess.\nIf you and I had to make a guess together a day,\nI think we'd arrive at the same guess.\nYes, sir.\nIs there a representative of counties or cities\nthat can speak to this change,\nwhere they informed about the change?\nMe, I'm just curious with what their position is\nor how they would explain the use of those funds.\nWe have not talked to them.\nAgain, we modeled this after current law\non the related to the POAB fund.\nOkay, so.\nYeah, I guess my two main concerns with this provision\nare number one, I'm always opposed to trying to fund government\non the backs of people who go through criminal legal system\nin the ways of fines and fees.\nI'm generally in no vote on that.\nAnd so any risk that this type of legislation\nwould expand that practice is going\nto be concerning to me, and the second concern\nis the local governments.\nBecause putting to the side my sort of crazy liberal\nor philosophical objection to the use of fines and fees\nin that way, if the local governments\nare trying to use those funds and fees and productive ways\nto your point, maybe for accountability courts,\nthat sort of thing, that's at least a discussion\nthat I would want to see had before we make any changes\nto the allocation of those funds.\nSo that's my hang up, but I respect the goal,\nobviously immensely, and I understand, too,\nthe price has gone up since the 1950s and 60s\nwhen we're writing some of this legislation, so.\nYes, sir.\nAppreciate it, thank you.\nThank you.\nLet's see, Senator, yes.\nAll right, thank you very much.\nJust quickly, this new code section,\ncan you kind of elaborate on this?\nIf a sheriff is convicted of a felony,\nif you can go over that with me again.\nAnd then the other thing, I know these are retirees.\nAnd the active members of an agreement\nwere raising their own membership dues from $45 to $65, $20.\nYes, ma'am.\nOh, OK.\nSo the other part, your first question, dealt with the provisions about conviction, convicted\nsheriffs who are convicted of felony offenses that are related to the operation of the office\nof sheriff.\nThat's what it, in a nutshell, that's what it is.\nSo if you, I mean, there could be multiple examples of what that might mean.\nBut it is holding the elected sheriff responsible for his or her behavior.\nAnd if they use their position as sheriff to undermine the public trust, to steal from\nthe office, to do those things that would constitute a felony, then the sheriff's retirement\nfund board could take action to eliminate the payment of all or part of those later\nretirement benefits. And now that is a general response. And it's pretty broadly written\nif you see that as well. So yes, ma'am.\nSenator Tillery. Thank you, Mr. Chairman. Three things, one sort of ingest. I thought Mr.\nVaughn might want to speak for the counties if he'd like to say anything I'll ever have.\nThat's time to pass. That's time to pass. Two things though that I would like to address\nthis comes back up again. It looks like the way it's drafted that if a conviction on the felony\nprovision that Senator Diamondport brought up earlier, if it's flipped, that then the back payments\nare made with interest to the person whose conviction was vacated. But it looks and I may be reading\nthis wrong. It looks like during the appeal process, the person has their funds back, then if the\nappeal is reinstated to the Senate, that we then go back to get those monies again, just from a\nThe practical standpoint has been my experience\nthat those funds are no longer there when you go back.\nSo that might be something that the fund wants\nto look at just practically.\nI actually chairman, they did talk about that\nand they did recognize that as they were discussing this.\nAnd honestly, if there was a way to strengthen\nthis particular provision which likely would not affect\nthe actuary if we get that moved along for an actuary study,\nthey certainly would welcome any suggestions\nways to improve that particular provision if it didn't otherwise damage or hurt\nright and progression of the bill also acknowledge the you know American\nstandard of innocence will prove in guilty I guess you're proving guilty then\nto flip I don't know how we would remedy that but I bring that up for your\nconsideration and thoughts as we move forward the last is Mr. Sherman I don't\nknow the procedure again on when we refer this out do we have to refer the bill\nout in whole or do it can we prefer the bill out with questions for the\nactuary to essentially bring back in parts. How does that work? And is there\nanyone in the room that can answer that question for me?\nOkay.\nWhen you come up and identify yourself, please.\nTerry, if you will read her Miranda writes to us.\nI have the right to remain silent.\nGood morning, I'm Carol Schwini with the Department of Audits.\nAnd with regards to your question, Chair Montellery, what we can do is we would have to submit the bill\nAs as written or as perfected if there are certain components of the bill that you want to remove that you're not interested in studying\nBut we do want to make sure that the the first actuarial investigation that comes out is the highest cost\nthat you can have because any bill that is amended later if the bill, if the cost of the bill increases, then the bill would automatically be done.\nSo we do want to make sure that if there are pieces of the bill that you are looking at costing, I would recommend that you include them in the bill.\nSo if there's revenue enhancers in the bill, if we wanted to make worst case scenario, we should strike those provisions out,\nKnowing that the report we get back from you would be the worst possible in any revenues\nwe added back.\nFor instance, like Senator McLaren's comment about the issue he had with fees for accountability\ncourts.\nWe would want to strike that provision knowing that if we added that $2 back, it simply\nmakes the feasibility and the dollar health, I'm saying that in a poor way, better for\nus.\nNow, also though I would say that if the Senate is interested in having some additional\ninformation that's outside of the words in the bill, you can submit a request to the\nState Auditor's Office and we specifically identify in what you would like the actuary\nto study specific to maybe a secondary question and they can come back with that information\nat the same time the answer follow-up.\nCan I ask a follow-up on that, Mr.\nIf the that secondary question cost more money,\nhave we killed the bill for the two-year cycle?\nYes.\nOkay. So we want to make this the highest cost possible.\nThat is correct. But the secondary question is just a secondary question\nand it's not necessarily bill specific.\nIt's just information for you all to gather information.\nAnd so if you all were wanting to pull out, for example, the $2 fee, but you wanted\nthat information, you could request the actuary study that specifically.\nSo you have that information up front as you're seeing the initial cost of the original\nactuary investigation.\nAnd Carol, what about it?\nPut you on the spot.\nIs that your recommendation on what we should do if we don't want to kill the purposes\nof not killing the bill?\nI mean, it would be helpful.\nIt's just a matter of whether or not the Senate is willing to pay for the additional costs related to the extra work of the actuary, because the cost of the actuarial investigations are cost of the legislature.\nOkay. Any other questions of the expert witness?\nI understand what that means, ma'am.\nSenator Harbin.\nThank you, sir.\nJust looking at this, of course we're looking for the actual real study.\nAnd the last comment was, is that my question would be, is that the fees that are being increased for members versus the fees that are collected?\npercentage is that currently in place, from a standpoint, is it 90, 80, 90, 10, what's\nour percentage or do we know?\nWell, currently you've got a membership cost and then you've got a fee that you're charged\nthat would be charged for $2 each.\nIs that new?\njust currently, member only, are we still getting a dollar from the court cost?\nIs that what I understand?\nThere's fines and fees that are already being collected.\nCollected. Okay. Yes, sir.\nBut percentage-wise, is it 90% coming from the members and 10% coming from fees?\nI would say there's a higher percentage coming from fees than members, but I don't know what the percentage is.\nOkay.\nThrough the courts.\nThrough the courts.\nYou don't know the number off the top of your head.\nI'm top of my head now, but actually I can pull the actuarial study and find that information out and send it to you.\nBut I understand Senator Utility, what he was saying is that if I understand we may want to amend this in committee to deal with that issue so that if it comes back, it doesn't die in this session, am I correct?\nWhat I was saying was that you want to make sure that the bill that you sent to the act\nwhere he initially is going to be the highest cost that would be incurred.\nAnd then once you get that information back, you can amend the bill so that the cost decreases\nand that bill could stay live.\nOkay.\nOkay.\nThank you.\nChairman Taylor.\nYou ready to make a motion when you're ready, Mr. Chairman?\nOkay.\nLegislative Council that you want to weigh in on the page four,\nthere's some things that Brad had picked up.\nI wanted to bring that out on the page four.\nUm, client 89, what is your number down there?\nHow I feel press a button.\nThere you go.\nI was brought to my attention in line 89 where it references the Secretary\nTreasurer under subsection A of this code section.\nShe'll fail to remit because we added subsection B in there.\nWe would want this to apply kind of these penalties and deadlines to apply to both\nA and B the new the new subsection for two dollars if we're gonna remove that\nIt would be moved at this time, but if we're gonna keep that section\nThree in the bill then we wouldn't want to add or B after\nA in line 89\nOkay\nGo kitchen. Okay. All right. Thank you\nright chairman\nThank you, Mr. Chairman. I\nwould move that\nwe send\nLC432823\nwith sections three and four\nstricken\nforward for an actuarial study and\nDefer to the expert witnesses again. I think I've struck the provisions that were additional fees, but for the member\nContributed fees that Mr. Norse is already spoken to have been accepted by the members\nYou want to repeat the motion\nHave a motion in a second the other discussion and\nAnd Mr. Chairman, I'm happy to explain why I did that if the members need to, but if\nthey understand I won't, do you understand what they could do?\nDo you need explanation, Terry?\nI would like so, but we can do it all for why, and it doesn't matter.\nYeah, I don't mind doing it on the record since it's a bill, probably.\nMr. Norris, what the striking that does is it makes the actuarial study come back at\nthe highest possible amount so that if we later add those fees back in, that it lowers\nthe actual value which keeps the bill alive. However, if we were to strike those provisions\nlater on after the actual aerial study, we will have killed the bill for the two-year cycle.\nSo it keeps it alive if there were changes that would have made about those two matters.\nI don't know if you're interested in that part.\nThank you.\nWe're the opinion that it would meet act as well standards with those in there, but we\ncertainly respect the decision of the committee.\nYeah, I haven't talked to you more about it offline.\nOkay.\nThank you.\nAny other discussion?\nAny other questions?\nIs there anyone here that wanted to speak for, I guess, this bill?\nWe ignore the discussion all in favor of the motion.\nSay aye.\nAye.\nAny opposed?\nSo carry.\nSo now to present this bill for actuary as amended.\nI have a motion on that.\nI'm moved to pass.\nI have a motion and second in your discussion.\nAll in favor say aye, so carry.\nSo that's going to be moving forward to it.\nThank you very much, thank you.\nAny other measures before this committee,\nif not, we'll stand adjourned.\nThank you.\nI love it.\nYes.\nThank you.\nI'm sorry.\n",
  "updated_at": "2026-02-12T02:58:21.189643+00:00"
}