{
  "video_id": "asOV9DW3EY0",
  "url": "https://www.youtube.com/watch?v=asOV9DW3EY0",
  "title": "Sen. Kemp Federal Education Funding Press Conference | 7-14-2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Here is a summary of the key points from the Georgia Sen. Kemp Federal Education Funding Press Conference on 7-14-2025:\n\n**Overview**:\nThis press conference addressed the Trump administration's decision to freeze $6.8 billion in federal education funding, including critical support for after-school programs, summer learning, teacher training, and services for migrant students and English language learners in Georgia. The freezing of these funds is having a significant impact on school districts and community programs across the state.\n\n**Key Actions**: \nNo bills were mentioned in the transcript.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced.\n\n**Notable Moments**:\n- Sen. Kemp and other state leaders strongly condemned the Trump administration's decision, calling it \"reckless and callous\" and stating that it is \"wreaking havoc and concern\" in Georgia.\n- Sen. Kemp emphasized that these programs are \"not radical\" but \"essential\" for students, families, and communities across the state.\n- Representatives from after-school programs like Wings for Kids and the Lilly's Foundation for Change spoke about the devastating impact the funding freeze will have on their ability to provide critical services to thousands of students.\n- A student advocate, Deishan Katron, spoke passionately about how these programs build opportunity and support for young people.\n\n**Votes**:\nNo votes were mentioned.\n\n**Attendance**:\nNo specific quorum notes were provided.\n\n**Adjournment**:\nThe press conference concluded, but no information was given about the next legislative session.",
  "transcript": "All right, good morning. We are here to say it plainly and simply. Stop playing politics with Georgia's children.\nWe call this press conference today because I and the folks standing with me are furious.\nThe by the reckless and callous decision by the Trump administration to freeze $6.8 billion in federal education funding.\nfunding. That includes critical support for after-school programs, summer learning, teacher\ntraining, migrant student services, and English language learners. Here in Georgia, that\nmeans we stand to lose nearly $100 million, including $40 million for after-school and\nsummer learning programs serving over 27,000 students. Right now, Fulton County Schools\nhas $6 million frozen.\nAtlanta Public Schools has $5 million on hold.\nThe Boys and Girls Club of Metro Atlanta\nis stuck waiting for nearly $2 million.\nAnd that's just in my Senate district alone.\nAnd why?\nBecause someone in the White House\nis reviewing the funds for signs of\nso-called radical left-wing agendas.\nLet me be crystal clear.\nThere is nothing radical about ensuring our kids\ncan read, count, and grow into productive citizens.\nHence, my very first bill which was signed into law\nfocused on improving literacy.\nOur school districts aren't pushing ideology.\nThey're focused on education and student success.\nThis kind of political theater may play well in DC,\nbut it's wreaking havoc and concern here in Georgia.\nThese programs are not radical.\nThey are essential.\nYou don't attack after school programs.\nweeks before school starts unless you've never had to worry about how your child is getting\nhome or staying safe.\nThis isn't about politics, it's about 27,000 children, and the working parents who rely\non these programs just to survive.\nThis is an education issue, it's an economic issue, and it's a moral issue.\nAfterschool programs allow parents to work, keep food on the table, and ensure their children\nare safe and supported after school.\nWithout this funding, families, especially single parents,\nwill be forced to choose between earning a paycheck\nand keeping their child safe.\nCutting these programs threatens to push our kids\ninto the School of Prison Pipeline,\nand I won't stand for it.\nSo let's talk facts.\nEvery dollar invested in after school programs\nsaves taxpayers $2.64.\nThat's three to one.\nThis isn't just the right thing to do.\nIt's fiscally responsible.\nI want to emphasize, school starts in less than a month\nhere in Georgia.\nMy own daughter begins her educational journey\non August 5th.\nBut apparently, someone in the White House\nthinks school starts after Labor Day as it does up north.\nIt doesn't.\nAnd this delay is creating panic and systems\nthat depend on consistency.\nMany teachers are actually coming back to school this week.\nThese funds were already passed by Congress\nand included in school budgets.\nThis isn't a policy review, it's sabotage.\nSo I'm calling on the Trump administration\nand the office of OMB to release these funds,\nstop playing games, and let Georgia's children learn\nand districts prepare.\nAnd I want to acknowledge that Superintendent Woods\nhas already called for the release of these funds.\nI thank him for speaking out, and now I urge our governor\nto do the same.\nStand with me, stand with superintendent woods,\nand stand with the many colleagues from the House\nand the Senate that are standing with me here today.\nThis is not a partisan issue, this is a people issue.\nGeorgia families can't wait.\nGeorgia kids shouldn't be used as political pawns,\nand the future of 27,000 children is on the line.\nAnd I promise you, we will not stop fighting\nuntil every dollar is restored,\nand every program is protected.\nThank you, and you will now hear\nfrom voices directly impacted by these actions.\nFirst, Julia Riggs, CEO of Wings for Kids After School program,\nand then Keisha Spells, who is a parent\nand Deshan Carter, Carton, Catron, I'm sorry,\nwho is a student and author.\nGood morning, I'm Julia Rugg, CEO of Wings for Kids, and I'm joined here today by\nAlbert Nick Howard, our Director of Programs. Thank you, Senator Camp, for hosting this\nevent and for inviting Wings to share our story. Wings has been serving elementary school\nage children through after-school programs for 28 years since 1996, and right here in\nAtlanta since 2012. We've been through lots of ups and downs, but this is one of the\nthe toughest ones yet.\nWhat we're dealing with isn't just a bureaucratic delay,\nit's a crushing blow to the 600-plus students\nthat we serve each and every day\non a non-dropping basis.\nFor parents, we are providing safe, structured\nafter-school programs in opportunities\nfor them to be able to work.\nFor kids, we are providing school, home work help,\nenrichment, field trips, trusting relationships\nwith mentors, and most importantly, positive social\nand emotional skills so that our kids can succeed academically\nand thrive in life.\nAnd for teachers, we support school attendance.\nI've had conversations with our principals,\nand they tell us that without wings,\ntheir school attendance drops by as much as 40%.\nWithout this funding, we're being forced to cut our services,\ncut our hours, delay our programs,\nand potentially even close our sites\nwhere we are the only after school provider\nin that community.\nRight here in Atlanta,\nfive elementary school communities\nare directly affected by this funding freeze.\nThat means hundreds of children in our city\nand families in our neighborhood.\nMothers, fathers, grandparents are now scrambling\nto figure out how to keep their children safe,\nsupported, and on track.\nAnd let me just conclude by saying that in Atlanta,\nit's the kids who are paying the price.\nIt's not Washington, it's not policymakers, it's our kids.\nThank you very much. Thank you.\nI'm sorry you all, this is very near and dear to my heart.\nMy name is Keisha Spills.\nI am the proud mother of four, a dedicated educator and the executive administrator for\nthe Lilly's Foundation for Change. As a working mom, having access to affordable\nafter-school care was essential while my children were in K-12. I need a safe\nenriching environment where they could build friendships, explore new interests\nand grow, while I served other students and families. Thankfully, organizations\nlike the Boys and Girls Club of Metro Atlanta, the YMCA, and the City of Atlanta's teen leadership\nprograms stepped in. These programs funded by state and federal grants were affordable options\nthat supported my children when I couldn't be there at the end of the school day.\nNow, as nonprofit leader, I see how critical these services are from another perspective,\nespecially for grandparents raising grandchildren on fixed incomes.\nThe families we support at the Lilly's Foundation rely on these programs because they simply\ncan't afford them otherwise.\nschool care isn't just child care. It's exposure to leadership, entrepreneurship, the arts,\nSTEM, and more. It shapes young people into global citizens and future change makers.\nCutting, funding, or delaying it for these programs doesn't just hurt families,\nit weakens communities across Georgia. Let's protect after school care. Our children and\nin our future, depend on him.\nApplause.\nGood morning.\nFirst, I wanted to extend my sincere gratitude\nto Senator Roshan Kemp and his chief of staff,\nBlake Robinson, for giving me the honor\nto speak to you today.\nMy name is Deishan Katron.\na 16-year-old junior born and raised in the city of Atlanta.\nI stand here not just as a children's book author or a youth advocate,\nbut as the product of the very programs that are now under threat.\nLet me be clear, President Donald Trump's decision to sign\noff on freezing federal funds from after school programs\nin the state of Georgia is not just disappointing.\nIt's dangerous.\nThese programs were built to build, they\nwere built to bridge the gap between struggle and stability,\nbetween vulnerability and opportunity.\nWhen you take resources away from young people,\nyou don't just close a door.\nYou open another one, a door to the streets, to crime,\nto desperation.\nYou're taking the young people that are struggling\nto live, wait out, away.\nLike I said in the beginning, I am born and raised\nin the city of Atlanta.\nI have almost been in every hood and needless to say,\nI know what goes on.\nIt's not by coincidence that after school programs\nare in our hood, they are there to make\nthe lives of the future generation better.\nas Mayor Andre Dickens say, he wants to make Atlanta the best place to raise a child.\nMeanwhile, stripping these programs of their funding will lead to a spike in crime weight\nand God knows what else.\nThis is literally backed by history and statistics.\nKids who don't have a safe, structured environment after school or even during the summer are\nmore likely to get pulled into situations that can derail their futures. I know this because\nI've lived it. I'm a proud product of the at Promise Center, the Boys and Girls Club\nof Metro Atlanta, the Salvation Army, the City of Atlanta Parks and Wrecks and the\nAtlanta Team Leader program. These programs gave me more than just a safe space to go to.\nThey gave me mentors, purpose, discipline, and most importantly, a vision for my life\nthat is beyond my circumstance.\nThey taught me how to dream and then how to work to make those dreams real.\nEvery book that I write, every child that I speak to, every young person that I mentor,\nit is rooted in those programs that have poured into me.\nI'm living proof that the after school program works,\nthat it saves lives, and that it changes futures.\nAnd after school program, by helping one person,\nmight not change the world, but it might change the world\nfor that one person.\nWell, I'm that one person.\nAnd now, I dedicate most of my time\nto reaching as many one persons as I can.\nSo I urge our state leaders, our community,\nthe Trump administration, and everyone that is listening\nunder the sound of my voice,\nto please try your best to protect our kids,\nprotect their futures,\nprotect after school programs,\nbecause those same after school programs protected me.\nMay God bless us all.\nThank you.\nWell, I truly hope that what you all see today is that these are real consequences of\nreckless decisions that continue to come out of Washington, D.C. and the Trump administration.\nAnd I just want to thank all of my colleagues for joining here today to call on the release\nof these funds, and with that, we'll take any questions that you may have.\nWe're good?\nOh.\nI know that our governor and our president have conversations about choosing a Senate candidate,\nSo they absolutely have the connection to do what's right for Georgia's children and\nhave a conversation about releasing these funds.\nWe literally start school in weeks and in many cases teachers are literally coming back\nto school this week.\nAnd so we need these funds released immediately so that we don't continue to cause chaos\nand wreak havoc in a time where we should be getting off to a great start in the school\nfor all the evolution of our relationship.\nYeah, I feel like Georgia and other states are being held hostage to a different agenda.\nIt's an agenda trying to find a problem.\nAnd if they truly cared about children, they would release these funds.\nAnd they can do whatever review they want.\nI was speaking to Julia this morning about the work that they do after school programs.\nThey get audit it all the time.\nSo those funds could literally be released today and they can still continue to do whatever\nwitch hunt they're trying to find and make sure that children and teachers are well prepared\nfor the school year.\nSo regardless of what they found in New York or DC, these funds need to be released and\nthey can continue to do their witch hunt.\nBut ultimately this is about kids and kids' futures.\nSo we should not be holding this money up for those reasons.\nWell, I would love if they actually do cut these funds that our governor should call a special\nsession so that we can make sure that we are getting these funds to our schools.\nI think this is that important if they do continue to hold these funds and hold these dollars\nhostage impact in a school year where we can do so much great things in our school settings.\nThat is something that could possibly happen that you have after school programs cut,\nyou have teacher training programs and preparation programs that are cut and you're having school\ndistricts have to dig into their funds to be able to supplant the cuts that are going\nto occur. So we don't want that to be the case. And ultimately, as I shared, if that\nis the case, then a special session should be called to ensure that money is allocated\nto replace any possible cuts that could occur.\nYes, so we have an after-school provider that can speak to how this could impact their day-to-day.\nGood morning. My name is Julia Rugg and I'm the CEO of Wings for Kids. We've run after-school\nprograms here in Atlanta, Georgia, and we've been doing that since 2012. I'll share this. We\noperate at the Title I elementary schools for all of our programs here, and we've had conversations\nthis week with our principals who have told us. First of all, when we start our program, we already\nhave a delay of usually about a week or two just because we're getting the kids situated and having\nthem stabilize their enrollment. But going beyond that, that does impact their school enrollment.\nThese are kids who need, and these are families who need someplace after school so that their\nparents can work, and if there isn't, a lot of them can't afford to be able to find\nanother place to send their children, so they just don't show up at school. And they\nhave literally told us that as much as 40% school enrollment drop that occurs, and that's\nadditional learning loss that we are seeing right off the bat from the school year. So\nthis has a huge trickle effect that's going to be impacting not just our programs, but\nthe families, the caregivers, and the working employment.\nThank you.\nAll right, we're good.\nAll right, thank you all so much.\nThank you.\nThank you.\n",
  "updated_at": "2026-02-12T18:47:31.78471+00:00"
}