{
  "video_id": "ATrduhHZZ38",
  "url": "https://www.youtube.com/watch?v=ATrduhHZZ38",
  "title": "Georgia House 2026 - Day 4 AM Session 1",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": null,
  "duration_minutes": 38,
  "summary": "Overview:\nThe session included a memorial for former House member Bill Himbrick, who had recently passed away. The speaker led the chamber in a moment of prayer for Himbrick's family. The session also featured an opening prayer and scripture reading by a guest chaplain, who spoke about the importance of servant leadership.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The Speaker announced the passing of former House member Bill Himbrick and led the chamber in a moment of prayer for his family.\n- The guest chaplain, Pastor Steven Durvin, delivered a sermon on servant leadership, drawing parallels between the roles of pastors and politicians.\n\nVotes:\nNone detected.\n\nAttendance: \nThe session began with a roll call to establish a quorum.\n\nAdjournment:\nThe transcript does not indicate when the session was adjourned. The next session date was not provided.",
  "transcript": "The hour for convening haven't arrived, all members, all members please come to the floor and take your seats, all members, go ahead and ring the bell, Mr. Clerk, if you would.\nAll members please come to the floor, take your seats, we're going to have the roll call.\nAll members present will please vote green to signify their presence in the chamber.\nMr. Clerk, will you unlock the machines?\nMembers, I need your attention.\nAll members voted.\nIt's the green button.\nDoorkyper, she's been here before.\nI think.\nAll members voted.\nMs. Clerk, will you lock the machines?\nMembers of you all stand with me.\nI have an announcement we need to make.\nMany of you, along with myself,\nserve with our dear friend,\nformer chairman Bill Himmry.\nAnd y'all know Bill has been ill for some time now.\nJust got word, Katie, thank you.\nThat Bill passed this morning.\nAs you know, it's easy to say he's in a better place, but I know Bill was ready for whatever\nthe good Lord had prepared for him, where it was here, as he inspired many of us with\nhis writings and with his life and his counsel.\nI just learned I did not know this.\nObviously, we'll keep that family in our prayer and give thanks for Bill Himbrick, but his\nsister, Orgra, and to say that right, also works in a clerks office.\nSo she's a part of this family as well.\nSo let's keep that entire family and give thanks for a life we'll lived.\nSo if you will, bow with me for a moment of prayer.\nGod, thank you for good people.\nfor those who inspire us to do better, to be our best, to treat our neighbor with kindness and\nfairness. Lord, let those life lessons inspire us all. Lord, will you know that we'll lift up that\nfamily? We know you will hold them in your hands, Lord, and give them comfort and peace, and the\nprayers that will come from these folks here in this room, as they remember a friend, a former\ncolleague. We just give you thanks for the life of Bill Humbering. Thank you members.\nAs is our custom, we will begin our day with scripture reading and prayer by our chaplain\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning,\nenjoyed meeting he and his family,\nwill be introduced by the lady from the 82nd House District,\nChair Lady Karen Matthew.\nChair Lady Matthew.\nThank you, Mr. Speaker, and thank you, colleagues.\nIt's such a pleasure to have family here today.\nWe don't always get to enjoy the families of our pastors.\nSo I'm very blessed to have Rebecca Angke and Kayla.\nShe's a fourth grader and her first time to the Capitol.\nAnd she got to see the animals down in the rotunda.\nAnd I also have a good friend of my former state senator,\nMitch Sebaugh, he lives in my district now.\nAnd I'm so blessed and honored to have you here today, Senator.\nThank you so much.\nThank you, Pastor, for coming and being with us today.\nPastor Durvin is originally from Albany.\nMy seatmate will enjoy that.\nStephen grew up in a broken home.\nWhere church attendance really wasn't a priority.\nMy community, my district, has a rich, rich history\nhistory of Christendom. And I'm so proud of that and I'm proud to have Pastor Steven with us.\nAs a teenager, he came to faith in Christ as soon as he sensed God's call to ministry.\nHe married his high school sweetheart, Rebecca. And together, God has blessed them with five children,\nCade, Cole, Cason, Carrington, and Cailer, all with a C.\nStephen has served in full-time ministry for over two decades,\nfinally leading churches to Georgia, Tennessee, and Florida.\nHe is passionate about teaching God's word in a way that connects people to Christ\nand believes the local church is God's plan A for reaching the world.\nWith a heart for sharing the gospel, making disciples, and equipping others to do the\nsame, Stephen leads with conviction, humility, and deep love for the church.\nHe holds a master in divinity from Liberty University, Baptist Theological Seminar, and\nSteven has been the pastor of Oak Hill Church in Williamson, Georgia for over eight years.\nSo please enjoy his word this morning.\nGood morning.\nAs a lifelong Georgian growing up, driving through downtown Atlanta to get to mineral bluff\nto see my grandparents, I would have never dreamed that I would have been in this building.\nSo thank you for being here.\nI know probably it's probably against some of your wills.\nSo we'll try to get through this together.\nI want to thank first speaker Burns for allowing me\nto be here, speaker protein, Jones, leader of frustration,\nleader Hugley and Chairwoman Matthew.\nI thank you so much for allowing me to be here this morning.\nIn Mark chapter 10, we read where Jesus is foretelling\nhis death.\nHe's walking with his disciples.\nAnd in the back, James and John are making plans.\nThey are working and networking to try to see where they can be.\nJesus overhears their comments as they come up and they say,\ncan we ask you a question?\nCan we sit next to you?\nThey won't honor, they won't prestige, they won't recognition.\nAnd Jesus responds in Mark 10, 45 in a most peculiar way\nwhen he says, for even the Son of Man came not to be served,\nbut to serve, and he gave his life as a ransom for many.\nThere's a lot that preachers and politicians have in common,\nand I know that probably some of the people that vote for you\nand some of the people that attend my church would agree.\nWe both speak for a living, and we hope that people will listen.\nWe shake a lot of hands and attend more meetings\nthan we care to attend.\nWe get criticized by people that have never done our job\na day in their life.\nCan I get amen?\nWe're expected to have all the answers for problems that are bigger than ourselves, but\nthe biggest thing that we have in common is not the microphones that we stand behind,\nbut rather the motivation for why we do it.\nAt some point, you and I decided that we wanted to give our lives or a portion of our lives\nto serve people, because people matter, and we know that the way up is down.\nJesus tells us if we wanted to be great in this world, that we should serve.\nleadership is measured by service. He says to give his life, Mark 10.45, Jesus' greatest act of\nservice happened without applause, without headlines, and without votes. And oftentimes for all of us,\nthe most meaningful service is unseen. It's uncelebrated. It's unappreciated. And because of the\nlate nights that I know that are coming from many of you, it also is inconvenient. The God sees\nthose late nights. He sees those tough decisions and the quiet sacrifices that you make and those that\nnever make the news. And as a Georgian, I want to tell you that I'm grateful for what you do in\nmaking our state a better place. We see that service also happens when no one is applauding.\nLeadership's not about position. It's not about our title or influence. It's about a responsibility\nto care for people and to care for people well.\nSo whether it's the pulpit or in the capital,\nleadership means asking this,\nwho am I responsible for today?\nThe goal of service is the good of others,\nnot the glory of self.\nAnd while James and John were jockeying for position\nor doing everything they can to ensure\nthat they would have a seat at the table\nwhen perhaps the best seat next to their savior,\noftentimes we find out that Jesus,\nthat we read in the Word of God at the Last Supper,\nwhen he took a towel that should have been\nwhere he was being served,\nhe lowered it and tied it around his waist\nand washed the feet of those that he sent an example for,\nthat they would serve.\nHe came as a ransom for many.\nJesus served with others in mind, not of himself.\nHe gave of himself to the very end.\nAnd when service is our goal,\nthe beautiful thing of service is that unity becomes possible\neven when we disagree, and I'm sure there's never any disagreement in this room.\nYou can disagree strongly, and oftentimes that happens both in this building and the\nbuilding that I call my church home, but you can still serve and love, honorably, when\nthe focus is on the people.\nDifferent colleagues, different convictions, but the same definition of greatness, all of\nus are called to serve. In my prayer for you, and I pray that your prayer is for me, that\nGod would give us the strength to keep serving well, especially when it's difficult. Can we\npray together? Father, I thank you for these men and women that are filling this room. Father,\nyou know every one of their needs, but there's nothing that you don't know. Father, I pray that\nyou would protect their children, their grandchildren,\ntheir marriages.\nFather, I pray that you would keep them far from evil\nand alert to sin, that they would choose you,\nthat they would know that you made them for purpose\nand on purpose.\nAnd the Father, I pray that you would walk with them\nin the days ahead, that you would give them wisdom\nas they make decisions that will impact their families\nand every family in our state.\nFather, I pray for the family of Bill Embry\nin his passing.\nI pray that Father, you would be nearer\nthan you've ever been before,\nthat they would sent you, that they would love you\nand know that they're loved by you.\nIt's in the name of Jesus, I pray.\nAmen.\nWould you join me for the Pledge of Allegiance?\nI pledge allegiance to the flag of the United States\nof America in the victory of the people\nwhich is sentenced for the nation of the power of God.\nIf it is all with liberty and the best of our all.\nPerfect.\nThank you, Brunstini.\nStay right there door keep as you may unlock the doors members you may join brother\nStephen out in the south any room and give show your appreciation thanks for\nreminding us about our responsibility thank you a strong message\nOkay members, we're going to go a little bit further.\nOur doctor of the day today is brought to us by Chairman Hilt Specialist, Chairman\nButch Parish, is Dr. Ayer.\nYou can come up and say your first name.\nSo we appreciate our physicians being here with us and our nurse.\nSo if you need their services, you all know where they are.\nSo thanks to all of our health care professionals\nand what they do for us.\nChairman Hilton, the chair,\nthe Committee on Information and Audits\nis recognized, Chairman Hilton.\nThank you.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits\nhas read the journal the previous legislative day\nand found it to be correct.\nThank you, Mr. Chairman.\nChairman Hilton, the chairman of the Committee on Information\nAudits reports that the journal of the previous literally\nday has been read and found to be correct.\nIs there any objection to dispense\nwith the reading of the journal?\nHere in none, the reading of the journal\nis dispensed with.\nIs there any objection to the confirmation of the journal?\nHere in none, the journal is confirmed before the clerk,\nWell, let's do that first clerk.\nMr. Clerk, we'll read the resolution, establishing the order of business for the day.\nMr. Clerk.\nRepresentative, the situation of the 104th Moose following be established as the order of business and\nour first part of the period unanimous concerns.\nIntroduction of bills and resolutions for us to reading a reference of house bills and resolutions.\nSecond reading of bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day hearing none of the resolutions adopted?\nAll right members you may want to take your seats or at least get quiet for a moment.\nWe're going to have an announcement that you'll be interested in from Chairman Hatchett.\nI thought that may get your attention.\nChairman Hatchett, conversation ceased for just a moment.\nChairman Hatchett has recognized, he brings some vital information.\nChairman Hatchett.\nThank you, Mr. Speaker.\nColleagues, next week, his joint budget hearings with, I think, the Senate.\nI think that's who we do those with.\nThat's next week, TZ Wednesday Thursday starts at 10 o'clock,\nTZ morning, room 341.\nMore importantly, even than that is after the state of the state,\nyour budget books are in CLOB 412.\nYou sign for them, you get one copy,\nand that's what you use next week during the hearings.\n412 after the governor's address.\nAny questions?\nI thought that was pretty clear.\nThank you, Chairman Hatchett.\nBefore we have First Readers, so we're going to move pretty rapidly.\nSo we're going to stay on schedule this morning.\nThere are some morning orders we'll get to.\nSo while you have some guests in the gallery, so we're going to move forward.\nSo Mr. Clerk, First Readers, bills and resolutions.\nMr. Clerk, will you read?\nHouse Bill 960, Bill Rebson, Clark 100, Nathepstration 104, Threves, and 99th, Park 100, and 7th, Adenia, and 100, and 10th, and others.\nBill B. Todd will be an act to amend the Code Section 1562, the Fiscal Court of Georgia, and I'm telling you the number of judges is very coarse.\nJudiciary? House Bill 961, Bill Rebson, Apollo 33rd, Evans, the 57th, Jasper, the 11th, Oliver, the 84th, Cooper, the 45th, and others.\nBill B. Todd, an act to amend chapter 20E, titled 33, the Episcopal of Georgia, annotated the Surprise Billing Consumer Protection Act.\nInsurance.\nHouse Bill 962 by reps at a mark in the 49th pair to the 24th.\nJones, the 47th, Williams, into the 112th black, into the 146th, and others.\nBill B. Todd, an act to amend code section 23, 634, the Episcopal of Georgia, annotated, relating to savings, trust accounts.\nWays and means.\nof 9.63 by reps at a martin of the 49th Anderson and flamming the hundred and 14th cars to the 46th and black men of the hundred and forty-sixth\nwill be taught an act to amend chapter five of titles 21 of the official go to Georgia annotated relating government transparency and campaign finance\nGovernmental affairs\n9.64 by reps of cannon and 170 second chastain in the 7th McDonald the 26th\nWilliams on 68th lumps into the 12th and others will be titled an act to\namend title 48 of the physical to Georgia annotated relating to revenue and\ntaxation. Ways and means well 9.65 by reps of 80 into the 81st bird of the\n20th gains to the 120th venture the 23rd and Cox the 28th will be titled an act\nto amend chapter 33, a title 31 of the Bishop go to George Annett and say relating to health records.\nJudiciary House Bill 966 by reps and Westbrook of the 163rd Jackson the 165th Gillier to\nhunt 62nd and Stevens the 164th will be taught on act to amend and act creating a new charter\nfor the city of Garden City.\nIntergovernmental coordination House Bill 967 by reps and of the Ridley the 22nd Ridley\nthe 6th, Horner, the 3rd, Flumming the 114 Chastain, and the 7th and others.\nBill B. Todd, an act to amend chapter 6A, a total of 35 of the official go to Georgia,\nannotated, relayed in a criminal Justice Coordinating Council.\nPublic Safety and Homeland Security.\nHouse Bill 968, partners under the Townsend of the 179 Stevens, 164 Williams, 148 Smith,\n18th Corp. of the 174th and others.\nwill be titled an act to amend chapter 13,\ntitle 16 of the Fisher go to\nthe relating troll substances.\nJudiciary non civil House will\nnine sixty nine by represent of\nthousand and 179th Hawkins and 27th\nGreen in 154th.\nManaged to the 51st,\nherring in the 145th and others.\nBill be titled an act to amend\npart two of Article one of chapter 18,\ntitle 45, the Fisher go to\nGeorgia and it's ended relating\nthe Georgia state employees post\nemployment health benefit fund.\nRetirement House Bill 970 by reps and have towns into the 179th Washburn 144th\n169th rice of the 139th Hagen 156th and others\nWill be taught on act to amend part 14 of Article 6 of chapter 2 title 20 of the Fisher go to Georgia annotated relating\nNo other educational programs relative to the quality basic education act\nHalt House Bill 971 by reps on towns and the 179th Jones the 25th\nDeloaded on 67 Smith in the 70th.\nHorner the third and others.\nBill B. Todd will act to amend part 14\nof Article six of chapter two.\nTitle 20.\nAnd the official go to Georgia annotated.\nRelated to other education programs\nunder the Quality Basic Education Act.\nEducation.\nThat's for the 972 by reps at the very,\nthe 56 of Lally, the 59th.\nRice to the 139th.\nHaring in the 145th, Hagan in the 156th and others.\nBill B. Todd will act to amend part three.\nof Article 6 of Chapter 2, Title 20 of the fiscal\nto joint annotated relating education programs\nunder the Quality Basic Education Act.\nEducation.\nHouseful 973, Burns 159, Jones the 47th,\nthat's Station 104th, and hatched to the 150th.\nBill B. Tonto, an act to amend the act,\nmaking and providing appropriations here,\nbeginning July 1st, 2025, and ending June 30th, 2026.\nAppropriations House Bill 974 by reps and it burns 159 Jones to the 47th\nAbstration 104th and hatchet to the 150th Bill B. Todd will act to make and provide\nappropriations for state fiscal year beginning July 1st 2026 and ending June 30th\n2027 Appropriations House Bill 975 by reps and it burns the\n150 9 Jones to the 47th Abstration 104th hatchet to the 150th Bill B. Todd\nand act to amend the act of making and providing appropriations for the state fiscal year beginning July 1st, 2025 and ending June 30th, 2026.\nAppropriations.\nHouseful 976 by Burns 159. Jones to the 47th.\nAssociation 104th and action to the 150th.\nWill be taught on act to amend the act making providing appropriations for the state fiscal year beginning July 1st, 2025 and making and ending June 30th, 2026.\nAppropriations House Bill 977 by reps of the burns 159 Jones the 47th\nAbstration 104th and action to the 155th\nBill B. Todd on act to make and provide appropriations for the state fiscal year beginning July 1st, 2026 and ending June 30th, 2027\nAppropriations House Bill 978 by reps of the burns 159 Jones the 47th Abstration 104th and hatch to the 150th\nThe bill will be titled an act to make and provide appropriations for the state fiscal year beginning July 1st, 2026, and ending June 30th, 2027.\nAppropriations.\nThat completes first readers.\nSecond reading of bills and resolutions, Mr. Clerk, will you read?\nHouse Bill 950 by Rebson Kehaneh, 81st, Dunhooth, 31st, Kelly of the 16th and Gallaudre of the 19th.\nThe bill relating to immunization of students.\nHouse Bill 951 by Rebson Clark of the 100th, Matthew Ack of the 82nd, Selcox of the 53rd.\nKelly of the 16th, Gofield of the 63rd and others, the bill relating to\nHouse Bill 952 by Rebson Franklin of the 160th, Perish of the 158th, and Perish of the 159th.\nA bill to amend and act to create a board of elections and registration for Bullock County.\nHouse Bill 953 by Rebson Franklin of the 160th, Perish of the 158th.\nBurns of the 159th, the bill to create is the City of State Spurrow Public Facilities.\nHouse Bill 954, by repsent, bill of the 75th.\nGuess there are the 121st Jones of the 25th, Sharper of the 177th, Gellier to the 160th Sankayan.\nOthers, a bill relating to issuance, expiration, renewal of licenses.\nHouse Bill 955, by repsent, still cocks to the 53rd.\nJones of the 47th, Hilton of the 48th, Evans of the 57th, Dung to achieve the 105th, and\nothers, a bill relating to holidays and observance.\nHouse Bill 956 by Representative Corbett of the 174th, Smith of the 70th.\nCanada of the 170th, second to Bill relating to Solid Waste Trust Fund.\nHouse Bill 957 by Representative Clifton of the 111st, Corbett of the 174th, person of the 119th.\nCamp of the 135th, new of the 40th and others, and Bill relating to motor vehicles, graphic House Bill 958.\nBy Representative Al of the 50th, Stevens of the 164th, Green of the 154th, Hawkins of the 27th.\nThe bill relating to taxes on tobacco and vaping products, House Bill 959 by Reps of Al the 50th Stevens of the 164th Green of the 154th Hawkins of the 27th Buckner of the 137th, a bill relating to taxes on tobacco and vaping products, House Resolution 109 by Reps of Canada of the 172nd and 4th of the 170th, a resolution honoring the life of Mr. John L. Williams with dedicating an interchange in his memory through second readers.\nThat completes reading second reading of bills and resolutions.\nWe have no standing committee reports, but ready for morning orders.\nYou all can come down representing Flanoi, representing William, representing Willis, representing\nSantos and Chair Lady Hagen.\nAbout 90 seconds, something like that.\nRepresentive, gentlemen, a hold just for a moment.\nGeneral Apollo, stand to the, just for a moment.\nWe have guessed in the gallery today that I'm ported to all of us.\nCertainly I'm ported to this representative, so please give him your change.\nPlease represent Flanoi and friend.\nThank you, Mr. Speaker.\nIf there's anyone from the Clayton County delegation, you are more than welcome to join\nus this morning, but I am excited and elated to welcome the five A State Championship\ncheerleaders from Lovejoy High School with us this morning. We are so honored to have\nthem. If you all please stand.\nWe are proud of you.\nThank you to the coaches, coaches Washington and Montgomery for all that you have done.\nContinue to keep up the good work and thank you for representing Claim County Wales.\nYou are the first cheerleading state champions from Claim County.\nAnd so we are so proud of you.\nPastor woman, Roosevelt Kirby is here with us today.\nLove joy.\nThank you so much.\nThank you for inviting them down.\nIt's great to have you here in your capital.\nWe're proud of you too.\nSo keep on playing hard and studying hard.\nI know y'all are.\nThanks for being here with us.\nGood luck to you all.\nRepetitive limb.\nThank you, Mr. Speaker.\nIt is keeping Georgia while day, and I'm not speaking on that, but on that theme,\nI am proud to welcome and celebrate the winners of our now annual State Park and\nHistoric Cites Art Contest, which Senator Halpern and I co-created and first launched last year with our\nState's Department of Natural Resources.\nWe created this initiative specifically to celebrate two things.\nOne, if you don't know, Georgia has 48 beautiful state parks and 15 historic sites.\nAnd two, we have some really talented youth.\nThis year we got nearly 250 submissions from high schoolers all over the state.\nAnd today we welcome our top 10, which sitting on the jury I have to say was not particularly\neasy to get down to.\nIf they are here, I ask them to rise.\nNot sure I see them.\nI think they're over in the Senate, but we still want to recognize them.\nAnd if you want to see that we have all the top art work featured in the South Wing starting\nat 1 p.m. today and reception, celebrating the winners at 230, go out and see our beautiful\nstate parks and historic sites.\nPut your real thanks not only to Senator Halpern but also DNR and especially Austin,\nSir and Commissioner Rabin, we congratulate all the winners and participants and I yield\nthe well.\nThank you representative.\nLiam, good job, Judge.\nI want to go see what kind of job you did, so I'll go check them out.\nThat's all good.\nWe appreciate those folks participating.\nA representative Willis.\nRepresentative Inga Willis.\nAnd a friend.\nYou got friends coming okay?\nI do.\nHi friends.\nDarshan.\nWe're representing Kendrick.\nThank you.\nAre you sure?\nGood to know if I need a friend.\nAre you sure she's your friend?\nI think she is.\nmy friend and my sister. Good morning, colleagues. 118 years ago on the campus at the Howard University,\nsomething incredible occurred. In the midst of lynching rates being in at all time high,\nan African-American attendance rates in college being in at all time low, 16 scholars, 16\nBlack women, one in particular.\nI had a photo of Etsy.\nYou didn't get it.\nEthel Hedgeman had a vision, a vision fair,\nthat Black women should be able to assemble as sisters.\nAnd the first and finest Black sisterhood on record\nwas founded, Alpha Cabo Alpha Sorority Incorporated.\nJanuary 15, 1908, on the campus of Howard University,\n118 years later, we continue to serve globally together.\nin our communities as well as in yours.\nI'd also like to recognize our Madam Leader,\nwho has received the esteemed distinction\nof Golden Soul World, which represents 50 years\nof service and sisterhood.\nAnd so on today, wish an Alpha Kappa Alpha woman\nin your life happy founders day.\nAnd please know, if it's unfamiliar to you,\neach organization in a divine nine continues to work together\nin education and health care for voting rights.\nto be on the front line of change\nfor the black community,\nfor the betterment of this world and beyond.\nThank you, Alpha Kappa Alpha,\nand thank you, sweet 16 founders.\nHave a great day.\nThank you, Representative Willis and friends.\nRepresentative Santos is recognized for a morning order.\nYou have some folks coming with you.\nCollege, join Representative Santos.\nBe the appropriate time.\nThe lady's recognized\nThank you, mr. Speaker\nWe celebrate veterans every day, but today I want to bring two very special guests that are sitting with us\nIntroducing two respected leaders of American Legion was 516\nfirst\nFred Wilcox, a retired U.S. Army Command Sergeant Major, served his country through deployments\nto Kosovo, Iraq, and Afghanistan, bringing decades of leadership and experience to our\npost.\nAnd Alton Head, a proud U.S. Army veteran, now serving as commander of post-516, representing\nthe legacy of those who answer the call during one of our nation's most challenging times.\nOn behalf of all of us, welcome to the House of Representatives.\nPlease rise to recognize them.\nThank you for your service, gentlemen.\nWe appreciate you taking time to be with us today so we can recognize you.\nThank you.\nChair Lady Hagen recognized and some friends.\nYou can bring a friend if you have one.\nYou have to pay more to get more friends, I'm not sure.\nChair Lady Hague is recognized.\nThank you, Mr. Speaker.\nToday is Georgia Flex Day at the Capitol.\nFlex stands for foundational leadership and entrepreneur experience.\nThey teach high school students valuable business skills.\nAnd then the students go on to create real businesses,\nprovide real products, and make real money.\nIt began in 2020 in Fitzgerald and was the brain child\nof Melissa Dark and her team\nat the Fitzgerald-Binhill Chamber.\nMelissa is joining us.\nMelissa, if you want to, you can stay in and let everybody see.\nI knew when I met her, I wanted to be her friend\nbecause she is so involved in her community\nand cares so much for young people.\nSix years later, they flex is a 20 site serving\n22 counties teaching high school students,\nbusiness sense.\nAnd today, 100 students and their leaders are here\nto learn about the legislative process.\nSo please help me welcome the Flex Program, Georgia Flex,\nto the House.\nThank you, Mr. Speaker.\nThat's pretty cool, Flex.\nThanks for being here, and thanks for recognizing.\nThat completes our morning orders.\nMembers, I'm going to let you, if we all will,\nfor just a few minutes, we're going to welcome the Senate.\nI think at nine, 10, excuse me, 10, 45.\nSo if you need to 10 to something for just for a minute\nbefore they're here, which you best get in your seat\nbecause they may hijack your seat.\nYou aren't careful, so it'd be a good thing\nto be in your seat.\nI also stand in these.\n",
  "updated_at": "2026-02-12T11:00:28.524081+00:00"
}