{
  "video_id": "b2MauceYMfc",
  "url": "https://www.youtube.com/watch?v=b2MauceYMfc",
  "title": "Lawmakers Day 26 03/03/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 26,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**\nThe session featured passionate debates over bills related to transgender healthcare and book banning in libraries. Lawmakers also passed the amended mid-year budget and a bill to expand the definition of military bases.\n\n**Key Actions**\n- **HB399**: Requires out-of-state landlords owning over 25 single-family homes to have an in-state broker to manage tenant complaints.\n- **SB30**: Bans all hormone therapies and puberty blocking treatments for minors with gender dysphoria.\n- **SB262**: Bipartisan bill to preserve access to preventive healthcare services at no cost, in case the Affordable Care Act's requirements are removed.\n\n**Bills Introduced (First Reading)**\nNo new bills mentioned.\n\n**Notable Moments**\n- Emotional speech opposing efforts to \"erase\" transgender people.\n- Debate over allowing children currently on puberty blockers to continue treatment.\n- Discussion of a bill to punish librarians for providing \"sexually explicit or harmful materials\" to children.\n\n**Votes**\n- **SB30 (Gender Dysphoria Treatment Ban)**: Passed 34-19 along party lines.\n- **SB262 (Preventive Care Access)**: No vote count provided.\n- **Amended 2024-25 Budget**: Passed 55-1 in the Senate.\n\n**Attendance**\nNo explicit quorum notes.\n\n**Adjournment**\nNo adjournment time or next session date provided.",
  "transcript": "Despite the constant attempts of this general assembly to erase and entire people, I want\nyou to know that trans people will not disappear.\nThey will not slink silently away so that you don't have to feel discomfort at their\nThey will not hide and fear from those who are in power.\nIn fact, there will come a day.\nWhen trans people and queer folks and formally incarcerated folks\nand all the other folks that Republicans have decided are useless,\nthere will come a day.\nThere will come a day when they will all sit in seats of power\nat this table fighting for the rights of all Georgians.\nThe Senate takes up another transgender bill.\ngender bill, this one banning hormone therapy\nand puberty blockers for children,\nand garnered the same passion to opposition\nfrom Democrats as with prior bills.\nGood evening and welcome to lawmakers on\nLegislative Day 26.\nI'm Donald Aurean Atlanta.\nIt might surprise some of you that emergency medical\nservices, including ambulances,\nare not considered essential services in Georgia.\nThat means it's sometimes difficult\nfor local municipalities to have the flexibility\nto ensure EMS availability in communities.\nThere's a bipartisan move to change that,\nand two of the lawmakers behind it joined the show.\nAlso, the U.S. Supreme Court could make a ruling this year\nthat could change access to preventive surfaces\nthrough the Affordable Care Act.\nThat means insurers would no longer take on the cost\nof things like mammograms and colon cancer screenings.\nWe'll hear from two senators who want Georgia\nto be ready if the high court changes Obamacare.\nBut first, both chambers are scrambling\nto get as many bills as possible moving.\nHere is the latest from our Capital Correspondence, Sarah Callis.\nHi, Donna.\nToday at the Capitol,\nU.S. Representative Marju Taylor Greene\nand U.S. Small Business Administrator Kelly Leckler\npaid members a visit ahead of a packed day.\nWith only two legislative days remaining until CrossHover Day,\nHouse members voted on over 20 bills, including House Bill\n89, which requires medical facilities to provide the maternal mortality review committee\nwith psychiatric records for maternal deaths and set up parianatal care centers.\nPeople and physicians and hospitals have been very reluctant to give us that information\nand it is essential to knowing the cause and what happened to them and seeing if their\npsychiatric disorder or what they were betraying for was any cause.\nthe bill passed 16827 and House bill 358 received approval despite opposition from Democrats.\nThe bill expands the definition of military base to prohibit certain foreign entities\nfrom owning land nearby.\nAfter a lunch break, the House gave final approval to the amended mid-year budget.\nIt includes an unprecedented amount of money for storm relief and cleanup.\nWorking together, the House and the Senate built upon the governor's package by including\nan additional $18 million in the governor's emergency fund to help me the state and local\nmatch of 25% of the for the degree removal. The House and Senate felt strongly about\nadding $185 million in additional relief for the farmers and timber producers for total\nand unprecedented appropriation of $285 million.\nThe amended budget also allocates funds for updates to Georgia's prison system, funding\nfor hospitals and school safety grants.\nThe bill was transmitted immediately to the Senate.\nThe House also passed HB399, which requires out-of-state landlords owning over 25 single-family\nhomes to have an in-state broker to manage tenant complaints.\nIf you're trying to develop new housing stock, you are going to be competing with these\nentities who are going to raise the prices, take it away from your opportunity.\nIt's even going to affect the governor who is trying to create workforce housing across\nGeorgia. This is a big deal.\nAnd an update on Speaker Burns' chief of staff who was injured in a farm equipment accident\nearlier this session.\nBut today our own beloved chief of staff former member of this body, Terry England, stood\nthe three times with no paying.\nBanning gender dysphoria treatment was once again\non the Senate's busy agenda today.\nSenate Bill 30 would ban all hormone therapies\nand puberty blocking treatments for minors.\nThis bill is the same bill that we passed last year,\nSenate Bill 30, and it outlaws puberty blockers for minors.\nSpecifically in gender dysphoria, where hospitals\nor physicians do this, two separate sections,\ntwo different sets of penalties if you do,\nthat's basically what it does.\nIt outlaws puberty blockers for minors\nwith gender dysphoria.\nDemocrats try to add an amendment\nto allow children currently going through the process\nto be able to continue treatments,\nbut still rejected the bill.\nI find it ironic that the party that often claims\nto stand for parents' rights,\ntheir Republican Party is insisting on telling parents\nthat they cannot make these critical medical decisions\nfor their own children.\nMany of the same politicians who claim\nthat they fight against government interference\nand health care options now want to stand in the way\nof personal, familial, and medical conversations\nwith other people's families,\nwith other people's children.\nThe amendment failed,\nbut the bill passed along party line, 34 to 19.\nSV 74 would amend a current book ban law\non school and state run libraries,\nsharing sexually explicit or harmful materials to children\nby clarifying a loophole that excluded librarians.\nNew law would punish librarians\nwho knowingly disregard the law,\nbut protect those who make a good faith effort.\nIf you look carefully in lines 25 through 29,\nthe affirmative defense guarantees the librarian,\nand thanks to the Center for his recommendations\nand committee, not only the librarian,\nbut workers in the library who might be challenged.\nThey have the same affirmative defense\nif they make a good faith attempt to identify\nand remove from access, not remove the material\nfrom the library, but simply to remove it from access\nto minors.\nDemocrats say the bill is more about controlling ideas than protecting children.\nTell the hundreds, thousands of librarians and media texts in Georgia, both Democrats\nand Republicans who are watching this dismayed, tell them that they won't be charged.\nBut I bet you won't, because it's the threat of being charged that's going to make that\nlibrarian comply with the first demand that a parent provides or makes, regardless of\nhow unreasonable that demand is.\nThe bill was passed 32 to 23.\nAnd finally, the Senate finalized the amended 2024-25 budget,\nsent over by the House, overwhelmingly passing it, 55 to 1.\nTomorrow, the House is expected to vote on a bill\nthat would prevent intellectually disabled adults\nfrom being sentenced to death.\nThat's my capital report, Donna.\nThank you, Sarah.\nBut later this year, the U.S. Supreme Court will hear a challenge to the Affordable Care\nAct or ACA.\nThe case could remove requirements for insurers to cover the full cost of preventive care.\nA bipartisan bill, I'll spill 262, is looking to preserve access to some health care services\nat no cost, actually that Senate bill 262.\nThose services include cancer screenings, medication to reduce the risk of developing diseases,\nsuch as aspirin or statins.\ndisease and diabetes screenings, and mental health and substance disorder screenings.\nThe Bill's sponsor is Democratic Senator Sonja Halperin of Atlanta, among the many Republican\nsponsors is Senator Ben Watson of Savannah.\nI spoke earlier today to both of them, beginning with Senator Watson, who is a family practice\nphysician and internist.\nI ask him why preventive care is so important.\nIt's really a quality issue because it's shown over the past two to three decades we've\nshown how if you drive quality you drive price and that what I mean by that is that about\n25 years ago we were not paying for mammograms, we weren't paying for colonoscopies, just\nthe routine things that we take for granted now.\nThere were studies shown that if we find polyps in colon, in colon that prevents colon cancers\nif we find, you know, breast cancer early, you save lives.\nSo it's all about quality of patient care.\nAnd that reduces mortality and morbidity.\nSo it saves the insurers money, it saves Medicare money.\nSo Medicare actually led the way in starting to pay\nfor mammograms, starting to pay for flexible\nsigmortaroscopies, and then colonoscopies now.\nAnd there's so many other things that we do\nfrom a screening standpoint that are paid for\nand are used prospectively.\nAnd that's the important part, is trying to prevent disease,\nrather than waiting until you have a disease,\nwhere not only does it increase your risk of dying,\nand having all the morbidities associated with that,\nbut it saves the insurance money, too.\nHow difficult is it to get patients to understand that?\nWow, I wish it were that easy.\nYou know, there's still pushback many times\nwhen it comes to just in plain mammograms.\nCertainly colonoscopies.\nWe do have colagor now, which is a DNA-based test\non stool and that is a good screen but you know if that's positive you still have to have a colonoscopy.\nA lot of these things are not necessarily fun but you know dying from colon cancer is not a good\nway to die. It's tough breast cancer is tough that we all know about. Tell me what even made you\ninterested in this? Well you know we have over the years gotten so accustomed to being able to go\nto the doctor and get certain kinds of screenings without having to pay a copay and it came to my\nattention that the Supreme Court, later this year, is going to hear a case about this\nvery provision of the ACA that casts its future existence into doubt.\nAnd I thought to myself, wait a second, here in Georgia where we already have access\nissues to health care, I want to make sure that Georgians are able to still be able to\nnot have to have any cost sharing for a whole range of services, like cancer screenings,\nhemograms and colonoscopies, vision screenings for young people, even falls for our elderly,\nall fall under the kinds of services that you do not have to pay for a visit to your\ndoctor for.\nAnd we have become accustomed to them, as you mentioned.\nOver the last, you know, dozen years plus, since the ACA has made this requirement for\nboth public and private health insurers, we've gotten accustomed to this.\nAnd I want to make sure that we can stay accustomed to it.\nThe thing about it is the ACA situation is one of those things where you've got to even\nthink forward.\nYou don't know if things are going to change at all.\nYou don't.\nAnd I think because there is so much hesitation and we just don't know what's going to happen\nat the federal level on this issue, that is exactly the reason why it's important to go\nahead and make something happen here at the state level.\nAnd we would be joining many other states that have already passed similar pieces of legislation\nthat will require insurers to still prohibits insurers from passing on any cost sharing\nto patients.\nSo we're not, you know, we're not leading the charge on this, but we would, in fact,\nbe part of quite a number of states and bills that are pushing this idea forward.\nEven the Trump administration really is arguing for the continuation of no copay on preventive\ncare services.\nAnd for everyone from the infants all the way through.\nAll the way through.\nThis would affect our youngest to our oldest Georgians.\nWhat we're doing is we're reacting a little bit of what's been said in Washington.\nAnd there's still a lot of mixed signals that are coming out, but I think that everybody\nair on the side of quality because we're driving quality when it comes to\nthis and Medicare knows better than anyone that it saves them money when it\ncomes to that that's actually an area of the budget that's been reducing over\nthe past decade and it always primary care driven by driving quality and it's\nnot just having to do with mammograms and colonoscopies it has to do with\ndoing the A1Cs when it comes to diabetes checking people's feet making sure\nthat they have good eye exams and that kind of thing.\nSo if you drive quality on multiple different segments,\nit's good care, the patience, and guess what?\nIt saves Medicare money and saves insurance money.\nSo they are driving this issue, and I think that's a good thing.\nSo I don't think you'll see anything\nthat will be done from preventive, anything I would expect\nthat we would see improvement relating to that.\nBut having said that, Senator Halpin, drop this bill.\nWe'll see where it goes.\nThis kind of bill, these kinds of issues really are not partisan issues.\nI'm really excited that on this particular bill, I am joined by a number of Republicans\nwho've also signed on and recognized the importance of Georgians being able to not let money\nbe a barrier to their health care in this case.\nYou're feeling pretty good about it.\nI am feeling optimistic, cautiously optimistic about it, and I'm hoping to get a hearing\non the bill.\nand you've got not, you don't have a lot of time.\nI don't have a whole lot of time\nbefore we get to cross over day,\nbut I think that it's an important enough issue\nto talk about, even if it doesn't make\nthis deadline of Thursday,\nI think it's an important enough issue\nthat we really need to be talking about it\nand not ignoring the fact that this could change.\nThe facts are is that if you do prevent of care,\neither mammograms, colonoscopies, diabetic footchecks,\neye checks and things like that,\nAnd then you save lives and you save morbidities associated with those disease processes.\nSo it's ever important when it comes to taking care of patients, that's so important.\nBut it also saves money for the government and for the insurers.\nWell, the bill is in the insurance and labor committee and it did not receive a hearing\ntoday in time for a vote by crossover day.\nBut the bill will remain active for the next session and I want to thank both Senator\nhelp earn and sender to Watson for those interviews.\nWell, coming up, a bipartisan push to make sure\nour ambulances and those who work on them\nare considered essential service providers.\nTwo lawmakers join us who have a bill\nto ensure emergency medical services\nare available to more Georgians.\nYou're watching Lawmakers on GPB.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capital during the session and year round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nIt's good to have everyone back together.\nGood news, indeed.\nPut your feet up a minute.\nIt's beautiful.\nWhat does that sound to you, man?\nIt's what I love doing.\nWho put these?\nIt's like it more a double-wish kid.\nAriel?\nFreshly baked biscuits, always.\nWell, this is all proving rather cosy, isn't it?\nUnderstanding the past gives a sense of the future.\nThis is the first time that anyone has seen this in 2000 years.\nHey, this is amazing.\nWell, I'm excited now.\nPompei is a battle against time.\nThis, it really happened.\nDon't let anybody tell you who you are.\nI love this life, I love you.\nHistory teaches us to honor the past.\nWhat is your feeling with all eyes wide open?\nWhen you look back, they're like, wow,\nthat was pretty special.\nThis is something that's actually altering the course\nof history.\nYou're charged with keeping these stories alive.\nI love all eyes open, yeah.\nWelcome back to Lawmakers, I'm Donna Lowry.\nIn Georgia, Centers for Emergency Medical Services receive about a million calls each year.\nThe Georgia Department of Mental Health says EMS takes care of rapid response, initial\ntreatment, and safe transport of patients to hospitals.\nEMS plays a really crucial role in the health care system, and they have a unique chance\nto make a positive difference in what happens to patients.\nNow in the Georgia, here are some workforce numbers.\nThere are more than 27,500 EMS workers.\nThat is about 258 medics for every 100,000 people.\n25% are female, 75% male.\nAnd two people joining me want to ensure EMS is a designated essential service.\nDemocratic representative, rural Roman of Duluth.\nShe serves on energy, utilities, and telecommunication, information and audits, and interstate cooperation\ncommittees and Republican Representative Gary Richardson of Evans in Columbia County\nis Vice Chair of Public and Community Health and is Secretary of Public Safety and Homeland\nSecurity. Welcome to lawmakers to both of you. I appreciate this and cooperation on this\nbill because you both had bills that mirrored each other, but yours has been kind of moved\ninto his. And so let's start with the background on these bills to begin with. And I'm going\nto start with you because you've come on to talk about this issue in the past. Why did\nyou become interested in the issue of emergency medical services and making them designated\nessential?\nYeah, so this is sort of something I like to share with people because it's important\nfor the public to understand that a lot of these bills that we come up with is direct\nsort of responses from them.\nMy husband's an EMT and we had been sitting with some of his co-workers who mentioned,\noh yeah, we're not designated as essential and I was thinking how is that possible?\nLaw enforcement is essential, fire is essential and so it was actually through them that I\nI started to learn more about this\nand it was the first bill I ever worked on as a lawmaker.\nAnd I was really excited.\nWe actually got it all the way to the Senate\nbut then sadly ran out of time as it goes.\nSo, yeah.\nBut you kept Pope alive and then you had somebody\nwho had similar interests.\nSo tell me what's your background\nand even interest in this?\nWell, I served on the County Commission\nin Columbia County for eight years\nand I was Vice Chair of the Emergency Services Committee.\nSo when I got up here, I wasn't even aware,\nreally and truly that EMS was not an essential service.\nI think if you ask 99.9% of the citizens in Georgia,\nif EMS was an essential service,\nthey would say absolutely it's essential.\nSo I got a call from back home and saying,\nhey, we need to work on that.\nWe need to make sure that we get that designation.\nAnd we in Columbia County use a private company\nand pay them a supplement for their services.\nAnd so when they were going through the pandemic\nand then the Haleen and they were having all this overtime\nand all this extra hours and all,\nBut they couldn't go and request a refund for some of the extra expenses for payroll and\nall of that stuff because they weren't considered essential.\nSo they could apply for a PPP loan, but that wasn't what they were looking for.\nThey had to be out there to serve the citizens doing these times of need and for them to have\nto take a loan to meet that payroll, it just, it didn't,\nit didn't make sense, or doesn't make sense.\nSo, that's why we wanted to.\nAnd you get to see it personally.\nI mean, I can't imagine that people were going through\nthe storm, they were working hard,\nand then yet they weren't being compensated,\nand I guess with your husband being involved, you've seen it.\nYeah, so he is, you know, a part-time EMT, full-time lawyer,\nand this was just his way of being able to serve the community.\nAnd a lot of times when we're talking about how many more\ncalls EMS takes per day as an example,\nBut what they are responding to, the kind of challenges they face in the field, the dangers\nthey are exposed to, it's just to me, it just didn't make any sense that they're not\nconsidered essential.\nAnd to be clear, the bill is narrowly tailored, right?\nIt's meant to just reduce some of that red tape, make sure they qualify for some of that\nfunding without increasing burdens on municipalities or counties.\nAnd to be able to, you know, 16 other states have already done this.\nAnd Georgia would be, hopefully, the 17th of it finally passes this time around.\nOkay, so it's HB-154.\nSo lay it out for us exactly what it is.\nWell, it just declares that EMS is a central service.\nSo that means that it's an essential service\nin terms of the people involved.\nWhat can they get out of it?\nMaybe break that down a little bit more.\nThey will be able to, if they,\nthey can get grants, federal grants.\nThey can get, you know, monies\nwhen they have to do this additional payroll\nand these additional services out there\nable to re-keep some of that funding.\nAnd I think a big thing in this bill is that it doesn't do\nanything with the zoning category.\nThat is a large topic, I think, is where the designated\nzones and who works what zone to know.\nThis bill does nothing to interfere, address that.\nSo it's just about getting the service classified as essential.\nAnd I know that that has been an issue in the past.\nBut before we go any further, I want to hear from one of the,\nof a couple of lawmakers who have EMS services in their background.\nRepublican Representative Beth Camp of Concord began working\nas a 9-1-1 operator at 17 years old.\nAnd she later became an emergency medical technician for a while.\nAnd she talked to me last year about the job\nand what she witnessed.\nThere's fatalities, sometimes they're children,\noftentimes they're violent.\nIt's just, it's a lot.\nAnd I'll be honest with you, I could shut my eyes\nand tell you all about things that happen\nalmost 30 years ago because they, they're still with me.\nYeah, PTSD, representative Dexter Sharper,\nhe is a paramedic.\nHe also talked about the middle strain\nof what he's witnessed on the job.\nAnd that's part of it also, if they were to apply for a grant to help with PTSD, if\nthey're not an essential service, they may have a harder time getting it.\nYeah, it just requires more steps, more paperwork.\nFor them, it's sort of like you're saying, oh, and I know that's not what anybody is\nspecifically saying, but in terms of paperwork, in terms of logistics, in terms of technicalities,\nyou're saying proof to us that you are essential.\nAnd it was, you know, Chairwoman Camp is 100% right.\nA lot of what she is sharing are things that my husband and his colleagues will share\nwith you that these calls don't really leave them and you kind of think about them and\nyou sort of, a lot of times you're kind of left wondering too because you never get to\nsee a lot of these outcomes.\nYeah.\nI think some of the TV shows get into them when I always think, how do they do what they\ndo?\nAnything you wanted to add?\nWell, these people that work so hard in this industry, in this business, and they come\nup, they never know what they're going to face when they get a call, when they pull\nup and that car is laid over. They don't know what's inside as they have to go in and\ntry and take care of those people as they're coming out of it. So, I absolutely consider\nthem essential and I just think it's only fair that they be classified what they are.\nOkay. The good news is tomorrow is a good day. Tell me what's going to happen.\nYeah. The hope is that it'll be on the House 4 for my understanding. Okay.\nyou know fingers crossed and but then you know you got to continue it onto the\nSenate so that'll be the next big hurt okay well we'll keep up with this and\nwe'll certainly be watching so people tune in for our capital report report tomorrow\nso let's talk about how the session has been so far with crossover day\ncoming so your thoughts on how how how things have gone anything in particular\nyou're glad past or like to see past before Thursday yeah so for us you know\nit's a it's a biannual meeting there's gonna be two sessions for this for this\nterm and the first one tends to be a little slower and then all of a sudden we all realize\nwhere we are in the session and everybody is scrambling to get their bills done so the\ndays are definitely getting a lot longer. But, you know, I'm really, really excited to\nbe voting on bills related to housing. House bill 399 was passed out of the house today\nwhich would require those who own more than 25 properties to have a direct contact which\nas somebody who has sort of these rental properties in their neighborhood, it's difficult\nbecause you don't have someone to reach out to to talk to.\nAnd on my end, we're continuing to work on issues related\nto lowering people's utility rates.\nI've been doing a lot of research\non the Consumer Utility Council,\nrecently introduced a bill on that,\nto see if we can bring that back,\nbecause it used to exist before the recession,\nand we're hoping to maybe see if there's a way\nto bring them back.\nWe've talked about that one, we'll keep an eye on that one.\nYou had a drone bill pass, talk about that.\nI did, I'm very excited about that.\nWe passed it through the house last week,\nwhich was my first bail, and that was an exciting time.\nAnd you got a little bit of teasing.\nYeah, you get a tremendous amount of teasing.\nAnd it's your first bail, yeah.\nIt is very nerve-wracking to go through that,\nbut it was an exciting time.\nAnd once the bill passes, everybody comes up\nand congratulating you.\nAnd it's just, it's a very exciting time\nin the camaraderie for everybody.\nBoth sides of the aisle come up and just congratulate.\nNow, we had a couple today that had their first pills\nand it just means a lot.\nAnd I guess that's the official stamp\nthat you're a part of the process in the team.\nPart of the family.\nPart of the family.\nAnd so now we're trying to get that, we've been assigned.\nWhat does it do?\nwhat it does is that it'll put a buffer around\nticketed events.\nSo if you're at a concert or you're at another type\nof event, just ticketed, disgated,\nit keeps a drone from coming in and disrupting\nprivacy and a nuisance.\nYou know, I know you've been in some areas before\nand all of a sudden drones start going around\nand you focus in more on the drone than what's going on\naround that you paid to go and see and be a part of.\nSo hopefully we can get it across the finish line.\nI'm excited about the next step.\nAnd we'll just see how that process goes.\nAnything quickly you'd like to see before Thursday?\nJust getting through.\nOK.\nI mean, today it was long and the bar is going to be long.\nAnd so we're just excited.\nHang in there.\nOK.\nWell, I want to thank you both for coming on the show today.\nThanks for having us.\nWe'll keep up with your bills.\nThank you for having us.\nWe appreciate it.\nYou're welcome.\nThat does it for lawmakers today.\nWe'll be back tomorrow for day 27.\nAnd that's the last legislative day\nbefore crossover day on Thursday.\nAnd as we bid you farewell,\nwe want to continue celebrating this show's\n55th anniversary.\nWe'd like to send you off with a look back\nat the day legendary singer Ray Charles performed\nat the Capitol on March 7th, 1979.\nRight.\nThat's really cool.\nDaughter\nThe phone\nThis old sweet song\nkeeps your smile\nOr Roger, is there?\nOr Roger, are they?\nAnd it's all\nCall my mom\nCome, listen to me then, spill\n",
  "updated_at": "2026-02-12T01:32:15.125117+00:00"
}