{
  "video_id": "B2zxiyUnpe8",
  "url": "https://youtu.be/B2zxiyUnpe8",
  "title": "Georgia House - Day 14 (2026-11-20)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 14,
  "video_date": "2026-11-20",
  "duration_minutes": 4,
  "summary": "# Georgia House - Day 14 (2026-11-20)\n\n## Overview\nThis session of the Georgia House of Representatives was relatively brief, focusing primarily on routine procedures and administrative matters rather than substantive legislation.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The session began with a devotion led by the Speaker, who read the 23rd Psalm.\n- The House dispensed with the roll call and had no items of business other than a second reading of bills and resolutions.\n- The House adopted several privileged resolutions, including one honoring the life and memory of Michael Langford and recognizing November 14, 2021 as African Methodist Episcopal Church 6th District Alzheimer's Awareness Purpose Sunday.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum was present, with the minority leader being the highest-ranking official present besides the Speaker.\n\n## Adjournment\nThe House adjourned until Monday, November 22 at 10 a.m.",
  "transcript": "this house will come to order. House will come to order. Now we're done. We'll begin our day with our devotion and pledge.\nFor a devotion today, I'm going to read the 23rd Psalm.\nThe Lord is my shepherd, I shall not want.\nHe makeeth me to lie down in green pastures.\nHe leadeth me beside the still waters.\nHe restoreeth my soul.\nleadeth me in the paths of righteousness for his name's sake.\nYe, though, I walk through the valley of the shadow of death, I will fear no evil, for\nthou art with me, thy rod and thy staff, they comfort me.\nThou prepares a table before me in the presence of mine enemies, thou anointest my head with\nall my cup runth over. Surely goodness and mercy shall follow me all the days of my life\nand I will dwell in the house of the Lord forever. Amen.\nIf you'll join me in the pledge, please.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands, one nation under God,\nindivisible with liberty and justice for all.\nWe are going to dispense with the roll call today.\nWe have no items of business other than a second reading\non the calendar.\nSecond reading of bills and resolutions,\nthe clerk will read.\nSenate Bill 2EX by Senator Kennedy of the 18th Council to the 46th.\nDuggan of the 30th, good to the 51st, Burke of the 11th and others.\nBill to provide for the composition a number of congressional districts, three-second readers.\nThat completes our second readers.\nThere are no reports of standing committees, no warning orders.\nThe clerk will read the caption to a group of privileged resolutions.\nHonoring the life and memory of Michael Langford, recognizing November 14, 2021 as African Methodist\nEpiscopal Church 6 District Alzheimer's Awareness Purpose Sunday and for other purposes\nthat completes the reading of the privilege resolutions.\nIs there any objection to the adoption of the privilege resolutions?\nThe chair here is none and the resolutions are adopted.\nHouse Monday in recess until 1 p.m. this afternoon, at which time we will stand adjourned until\nMonday, November 22 at 10 a.m. Let the record reflect that the highest ranking position\nhere today other than I guess the chair is the minority leader of the house.\nThose of you who have come in, thank you very much, enjoy the rest of your weekend.\nYou\n",
  "updated_at": "2026-02-12T12:34:45.683565+00:00"
}