{
  "video_id": "B8q65Iy24bQ",
  "url": "https://www.youtube.com/watch?v=B8q65Iy24bQ",
  "title": "Lawmakers Day 40 04/04/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia legislature session transcript:\n\n## Overview\nThe Georgia legislature had a busy day 40 session, with lawmakers passing key bills and finalizing the FY2026 budget. Notable moments included heated debate over diversity programs and school safety legislation.\n\n## Key Actions\n**HB 651**: Bill regulating use of speed cameras and revenue from citations\n**HB 225**: Bill eliminating speed cameras in school zones\n**HB 68**: FY2026 state budget bill, which includes increased funding for prisons, the Georgia Promise Scholarship, and mental health initiatives\n**SB 36**: Religious Freedom Restoration Act signed by Governor Kemp\n\n## Bills Introduced (First Reading)\nNo new bills mentioned in the transcript.\n\n## Notable Moments\n- Democrats strongly condemned the ban on diversity programs in HB 127, using the anniversary of MLK's assassination to criticize Republican actions.\n- Heated debate over bills dealing with speed cameras in school zones.\n\n## Votes\n- HB 68 (FY2026 budget): Passed 170-5 in the House, 54-1 in the Senate\n- Other bills passed, but specific vote counts not provided.\n\n## Attendance\nNo specific quorum details provided.\n\n## Adjournment\nThe session was expected to continue late into the night or early morning. The next session date was not mentioned.",
  "transcript": "[Music]\nThis is video of the Georgia House\nearlier today where lawmakers have been\nworking steadily since about 10 this\nmorning on and off. And the day could\nend late tonight or possibly early\ntomorrow morning. Good evening and\nwelcome to our special 1-hour 40-day\nsiny die lawmakaker show. Tonight we\nwrap up our 55th season of the show on\nGPB. Thanks for joining us. I'm Donna\nLowry in Atlanta. We are live from the\ncapital all evening for interviews with\nleaders from both sides of the aisle.\nAmong the guests, Governor Brian Kemp.\nHe'll give his view of the legislative\nsession. And in the studio, we'll have\nanalysis from Republican political\nstrategist Brian Robinson and the\ninterim head of the Georgia Democratic\nParty, Matthew Wilson. First, a look at\nSiny Dy so far today from Sarah Callas.\nHi, Donna. Lawmakers fulfilled a\npreeminent obligation on day 40, but\nthere's still much to be done in the\nfinal hours of sin die.\nThe day kicked off with a bill signing\nby Governor Brian Kemp. And today I\nsigned SB36, also known as the Religious\nRestoration or the Religious Freedom\nRestoration Act or RIFFRA, uh ensuring\nthat once again at the state level that\nGeorgians are protected, including\nGeorgians of faith. In the House,\nmembers got to work agreeing to Senate\nchanges made to House bills. They gave\nfinal approval to a bill requiring\ncolleges to disclose funds accepted from\nforeign countries of concern. Members\nalso approved fluorescent pink hunting\ngarments, infrastructure for vertaports,\nand increased indemnification funds for\nschool resource\nofficers. After lunch, the House took up\nthe only bill they are constitutionally\nrequired to pass, the fiscal year 2026\nbudget. The House and Senate compromise\non House Bill 68 includes big wins for\nthe state prison system. The Department\nof Correction receives an infusion of\n$200 million over the current\nbudget. This is $75 million more than\nthe governor's original\nrecommendations. Both the House and the\nSenate agree on staffing and safety\nincreases. However, the House went\nfurther and wanted to recognize the\nincreased costs for food and health care\nin the base budget. But ultimately, we\nrecognize that some of these\nadditions are multi-year process and can\nbe adjusted next year. And HB68 also\nfunds the Georgia Promise Scholarship,\nabout 141 million or 1% of the quality\nbasic education funds. I know many of\nyou have been receiving updates on the\nnumber of applications and\nknow that of the 10,000 applications\nstarted, 5,100 have been deemed eligible\nfor the scholarship to date and that's\nas of today. This full funding allows\nfor more than 21,000 students the\nopportunity to participate in the\nprogram. The budget also allocates $15\nmillion for school districts with a\nsignificant number of students in\npoverty and keeps funding mental health\ninitiatives for students. Funding for\nthe new student support services program\nat DOE is preserved, albeit at a\nslightly lower number. This includes\nnearly $20 million for mental health\nsupport grants for middle and high\nschools and $2.3 million to provide\nfunds for school systems that due to\ntheir size do not earn full funding for\na school social worker. Medical programs\nin rural Georgia and grants for timber\nfarmers also made the final cut of the\nbudget. The bill passed 170 to 5. The\nSenate spent over an hour during this\nmorning's points of personal privilege\nspeeches as multiple Democrats angrily\ndecrieded the banning of DEI programs in\nthe state schools and colleges with\nHB127. The legislation passed late\nWednesday night gutted original language\nincreasing teacher sick leave days.\nDemocrats used today's anniversary of\nDr. Martin Luther King's assassination\nas a reminder of the importance of\nhaving those programs. I hope this body\nwill take a different approach to\nsolving problems and settling different\ndisagreements today. A better better one\nthan what we saw on\nWednesday as Republicans in this body\ncouldn't even bring the fight to us\nproperly and cut and\nrun instead of allowing us to represent\nthose voices that we represent back home\nand stay here. If you're going to put a\nbad bill here, stay here and fight us on\nit. Even if it took all\nnight, today we should carry the sp\nspirit of Dr. King and keep his legacy\nin mind as we bear the task of making\ndecisions that will impact 11 million\npeople who live in this state. People I\nlove in a state that I love and I'm very\ndisappointed by what has been happening\nthis session and at times were unable to\ncontain their anger over the issue. Many\nof you are pretty good\npeople. I came to know most of you. You\nhave a pretty good heart. But some of\nyou are just\nracist and you need to stop it. They\nthen debated two House bills that dealt\nwith speed cameras at schools. HB 651\nwould regulate the use of cameras and\nhow revenues earned from speed camera\ncitations are used. The second bill,\nHB225, would eliminate the speed cameras\naltogether. It repeals all laws relating\nto the enforcement of speeding\nviolations in school zones through the\nuse of certain devices and prohibits\ncertain contracts for the enforcement of\nspeeding violations in school zones\nthrough the use of certain\ndevices. What it does is it sets a\nsunset on the use of these types of\ndevices here in the state of\nGeorgia. And if you are\nlooking at the legislation as\namended, if you go to line 91, it says,\n\"No contract shall be entered into or\nrenewed by local governing body or law\nenforcement agency for the enforcement\nof speeding violations in a school zone\nthrough the use of an automated traffic\nenforcement safety device on or after\nJuly 1, 2027.\"\nBoth bills were passed and sent back to\nthe House. The Senate also passed the\nFY2026 budget, agreeing to the changes\nworked out in the conference committee\n54 to1. The Constitution of the State of\nGeorgia. The Constitution of the State\nof Georgia. Also today, new Commissioner\nof Labor Barbara Rivera Holmes was sworn\nin. We expect lawmakers to work all\nnight and I'll be back talking with\nlegislators later. But for the last time\nthis session, that's my capital report.\nDonna\nand she said later and later is now\nbecause we're going to that was Sarah on\ntape. Now we're going to her go to her\nlive where Sarah has an interview with\nHouse Speaker John Burns. Sarah,\nthank you so much Donna and thank you\nSpeaker Burns for being here with us\ntonight. So a big priority for you that\ncleared both chambers was a robust\nschool safety bill. Can you talk to me a\nlittle bit about the effort behind this\nbill? Yeah, it's been uh you know our\nnumber one priority. It's uh it's what\nmakes Georgia a great place to live, but\nwe're making sure that our young people,\nour students are safe when they go to\nschool in that learning environment. We\nalso want to make sure our parents are\naware of that and they feel comfortable\nwhen they drop their kids off, they're\nsafe. But, you know, you can't learn if\nyou're not in a secure learning\nenvironment and we're taking we're very\nproud of our efforts this year. Uh\nRepresentative Persinger has worked\ndiligently to make sure we would get\nthis across the finish line. Appreciate\nour House members. certainly appreciate\nthe Senate too and as we send it on down\nto Governor Kemp and another one of your\npriorities that cleared both chambers\nwas protections for IVF or invitro\nfertilization. Can you talk to me about\nthe importance behind this issue? Sure.\nYou know, there's nothing more important\nin our lives than children. And this\ncreates an opportunity for folks who've\num may have been had challenges with um\nhaving children to create an opportunity\nto get it in and codify the legislation\nto sure that will be for them be there\nfor them in the future. And certainly we\nhave a member Leman Franklin and his\nwife Lori are now expecting a little\ngirl because IVF treatments and c\ncertainly a blessing and we want to\nensure that's the case because we\nrespect life in Georgia and the house\nhas worked very hard at this. We're very\nproud of that as well. And perhaps a\nmore controversial bill was a bill that\nwould ban transgender girls from girls\nsports and that also passed the House\nand the Senate with some collaboration.\nCan you talk to me a little bit about\nthis collaborative process between the\nHouse and the Senate on this particular\nbill? I can I think that's just it's\nit's a good piece of common sense\nlegislation the people of Georgia have\nspoken and uh we we heard from them\nduring the election in November and\ncertainly as we continue to hear from\nour constituents and people not only in\nGeorgia but across the country. uh go\nthe President Trump passed a uh uh\nexecutive order certainly respecting the\nright of of to prevent boys from\ncompeting in girls sports and we're\nwe're proud to be a part of that\nmovement and and certainly the Riley\nGains Act is um we'll level that playing\nfield. So when in Georgia we have from\nfrom elementary school through\nuniversities through our higher ed we\nhave girls competing against girls and\nboys against boys. That's the way it\nshould be. It's a level playing field.\nAll right and thank you so much Donna.\nback to you and your guests in the\nstudio. Thanks Sarah. I know we'll be\ncoming back to you later. I do want to\nintroduce our guest in the studio who\nwill offer analysis of the legislative\naction this session. First, a former\nlegislator who has spent time in the\nhouse during sin die. Former\nRepresentative Matthew Wilson. He is\ncurrently interim chair of the\nDemocratic Party of Georgia. Also here\nis Republican strategist Brian Robinson.\nHe's with Robinson Republic. He has\nserved as deputy chief staff for former\ngovernor Nathan Deal. Welcome to\nlawmakers to both of you. Got lots of\ngood things to discuss. Let's start with\nwhat speaker Burns was talking about.\nPretty successful in terms of his\npriorities. Let's start with you this\nsession, right? He mentioned IVF, school\nsafety. As soon as the Appalache\nshooting happened, which shocked\nsaddened all of us in Georgia, Speaker\nBurns was one of the first statewide\nofficials to step into that breach and\nsay, \"We've got to do something. We've\ngot to address these deep concerns that\nso many parents and children in this\nstate have. No kid should go to school\nin terror and we have the ability to\nstrengthen security to put in new\nprocesses. We saw at Appalachi that the\nemergency system, the teachers riggered,\ngot the police there quicker. We saw the\nresource officers neutralized the\nsuspect. So, we've seen those reforms\nalready work. This just furthers them\nand hopefully it's going to keep kids\nand teachers safe. The IVF is something\nobviously very special to the speaker's\nheart. This is a family man. This is\nsomebody that whenever you speak to him,\nwhether in public or in private, he's\ntalking about his wife. He's talking\nabout his grandkids. This is something\nvery personal to him. Making sure every\nGeorgia family has a chance to have\nchildren that is near and dear. And this\nis a huge uh win for him this session.\nAnd both of those were bipartisan. So,\nyou're feeling good about those two in\nparticular, the school safety and the\nIVF, too. two bills out of how many\nhundreds that that the legislature took\nup this session. Uh, Donna, and you\nknow, um, uh, th those were, you know,\nwell-intentioned efforts and certainly\nshould be applauded for, uh, uh, for the\nintent there. But, you know, my feeling\nof this session is just, uh, I've been\ncalling it the onion session because\nit's just, uh, very little of it is\nsweet. We're not talking about a Videlia\nonion. Uh, it mo most of it is just\npungent and bitter. Um the the\nRepublicans this session just focused on\nculture war issues. You talk about those\ntwo in particular. Um at the same time\nthat those bills passed, they took a\nbill that would have uh given teachers\npayraises, turned it into an anti-dei\nuh bill, took a bill that would have uh\ncreated a school uh supply tax holiday,\nturned it into a gun and ammo tax\nholiday. Um and uh of course we have to\ntalk about the RIFFA bill um which uh\nyou know is is is going to turn Georgia\ninto a place to hate back to a place to\nhate. And the thing that I'm worried\nabout you know we talked about the IVF\nbill and wanting to encourage families\nin Georgia. My husband and I are going\nthrough the adoption process right now\nand bills like this will make it harder\nfor thousands of LGBTQ families in\nGeorgia to adopt a child right here in\nthis state. Yeah. So despite that, you\nyou still feel overall your filling on\nthe session is not good. Bitter, Don,\nbitter. Bitter. When you said onions, I\nthought you were going to say it has\nlayers. It sort of had layers, right?\nYou could have peeled away a little bit\nof what happened this session. To me, it\nwas a sweet idea. Yeah. Okay. Onion. A\nsweet\nidea. Look, it's not just about cultural\nwar issues. Those do predominate in\nevery general assembly legislature in\nthe country. It is something that's part\nand parcel of American politics. But\nthis session was so much more. Georgia's\ngot a tax rate cut. They are going to\nget a tax refund. $500 if you're\nmarried, 250 if you're single, put into\nyour bank account. We got hurricane\nHelen relief for many communities in\nthis state. But\nthe tier one issue that is a huge\neconomic win for Georgia was Governor\nKent tort reform effort. It will protect\njobs. It will protect common sense in\nthis state by limiting these jackpot\njuries that are simply unaffordable and\nmake it hard to do business in Georgia.\nIf you're living, if you're in a high\ncrime area, even just in the same zip\ncode, the retailers there, the gas\nstations there that our uh residents\ndepend on. They can't afford the\ninsurance in those places. It's it it\nhurts low-income Georgians. It's not\njust something that um is a giveaway to\nthe rich. Okay. Your idea, your thoughts\non tort reform. I have a lot of ideas.\nYou spend a whole hour talking about the\ntort bill. I was You're an attorney. So,\nI was down at the capital a lot this\nsession with the trial lawyers uh on\nthis bill. And you know, um certainly\neveryone can complain that um inflation\nis too high, that our insurance rates\nare too high. that tax that uh uh tax\nrebate that pass. You know, who doesn't\nwant $500 more dollars in their pocket?\nI certainly will take it, but um that\nwas a loss, a missed opportunity to\nspend and invest uh uh billions of\ndollars into our economy. And the tort\nreform bill, the insurance commissioner\ntestified before the legislature and\nsaid, \"This will not lower insurance\nrates.\" So, what are we doing here?\nYeah, Donna, I think we saw the House\nleaders come out after the tort reform.\nObviously, one vote margin. This was not\nan easy sale in there. It took a lot of\nleg work and shoulder grease from\nGovernor Kemp and Speaker Burns to get\nit done. But we we saw leaders come out\nand say, \"We want to see insurance rates\ncome down. You told us that this would\nget us there. We are watching. We will\nhold you accountable.\" And I think\nthat's going to be a great metric to\njudge this law by. Well, we have\nGovernor Kemp available right now. So,\nwe're we're going to talk more about\nthis in a moment. We are happy to\nwelcome to the show the Georgia Governor\nBrian Kemp. Good evening, sir. and\nthanks for joining us for a few minutes.\nBusy night.\nHey, great great to be back with you.\nHappy signing die. Thank you. I want to\nstart with what you told or you plan to\ntell those in the chambers this evening.\nI guess you haven't talked to them yet.\nNo, we're fixing to go do that here in\njust a little bit when everybody gets\nback from their dinner break. I know\nthey're going to have a busy rest of the\nnight, but I'm looking forward to\ngetting in there and thanking the\nmembers of the general assembly for a\ngreat legislative session. I mean, we\nhave had some really tough issues that\nwe have worked on and debated, but I\nthink it's been done in a a really open,\ntransparent, fair way where everybody\nhad their say, and that's the way it\nshould be. Uh, obviously from my\nperspective, we've had had a great\nsession. Uh they passed a great budget\ntoday and so I'm looking forward to the\nrest of the night and also the rest of\nthe year. Okay. We've been talking about\nit here in the studio, but one of your\nbig priorities was to get tort reform\npassed. You did that. How how are you\nfeeling right now about that goal being\naccomplished when you were on the show\nlast year? You told us you were going\nfor it and and you did. Yeah.\nWell, very very excited to get that done\nas y'all were just talking about. very\nvery close vote, tough debate, very\ntough issue. People have been trying to\nget this done for, you know, really the\nlast 5 years. Uh, you know, in modern\ntimes and really over the last 20 years,\nthere hasn't been a whole lot done. So,\nit's a it's a tough issue to tackle. Uh,\nbut I think all the leaders in the\ngeneral assembly felt like we had to do\nthis. I know from my perspective I felt\nlike it was the one thing that was\nreally hurting our business environment\nhere and that other states were using\nthis against us because they have taken\naction on tort reform and so you know\nour main thing was to stabilize the\nmarketplace that was out there people\ncannot continue to live with you know 15\nto 30% premium increases every year is\nkilling small business people killing\nworking Georgians out there and uh so\ntour reform you know what we did I think\nwill help stabilize the market and we're\ngoing to continue to watch that, you\nknow, as we get out of session. All\nright. So, we've heard some people\ntalking about this. Is there a\npossibility possibility you'll want to\nsee insurance reform next year?\nWell, I know there's a lot of members of\nthe general assembly that were very\nconcerned about some of the insurance\ncompanies and, you know, wanted to take\na look at that. I kept asking people the\nwhole session, hey, bring me something.\nYou know, if you want to legislate that,\nbring me the language. I'm I'm open to\ntalking to all sides on these issues to\nstabilize costs, but also to open up\nmarkets. I mean, we got small business\npeople out there, entrepreneurs, uh, and\nothers that can't even get insurance\nbecause of the way the market was here\nand the way the the legal environment\nwas here. And so, we wanted to bring\nsome parity, transparency, and fairness\nto that issue. Now, if people want to\nlook to the insurance companies, I'm\nopen to to talking to them about how\nthey want to do that. But my message to\nthe in insurance companies is uh we we\ndid what we think was right. I think\nthey're very supportive of that. And so\nnow we're looking for them to get into\nthis marketplace and have more\ncompetition which will help stabilize\nprices. And so that's something\ncertainly I'll be looking at in the\nmonths ahead. Okay. On another issue,\ngiven that the budget relies heavily on\nfederal funding and we still don't know\nwhere things are going to fall out when\nthe state in the state when it comes to\nmoney, do you think there will be a need\nfor a special session to deal with the\nbudget at all?\nYeah, I think it's very very very\npremature to be talking about special\nsessions when we hadn't even ended this\none yet. uh in regards to what's going\non in the federal government, whether\nit's Doge, other things that uh the\nCongress is doing on ending ending COVID\nfunding. I mean, look, they have to do\nthose type things. We cannot continue to\nhave the levels of spending in this\ncountry, especially things that were\nrelated to CO that quite honestly when\nyou look at the way the state of Georgia\nhas performed, I mean, we haven't been,\nyou know, relying on those things for\nover the last two years. So, you know, I\nthink they're making the right moves to\nmake sure that they worry and get down\nour debts and our deficits, uh, which\nwill help bring down interest rates and\nnot burden our children and our\ngrandchildren in the future. And I can\nassure you that we have continued to\nbudget conservatively conservatively in\nour state uh even with this bud budget.\nBut we're also putting money back in our\ntaxpayers pockets with a another billion\ndollar tax refund that's going to send\n$500 to the average family out there\nthat's been paying taxes. We're lowering\nour corporate tax rate. we're lowering\nour uh personal tax rate to continue to\nkeep more money in Georgian's pocket so\nthat they can fight the high cost\nenvironment that we've been over the\nlast four years. And hopefully we're\ngoing to see that continue to to go down\nand have a better better days ahead uh\nfinancially. So, I'm very optimistic\nabout that, especially in the state of\nGeorgia with the economic development,\nthe jobs that we're creating here, the\namount of investments been historic over\nthe last three years. So, uh, we're\nwe're positioned as well as any state in\nthe country to weather what whatever\ngoes on in the US or the world economy.\nI know you said this this evening isn't\nover yet, but I do want to know if\nyou're already looking toward next year\nat all, like you talked last year about\ntort reform for this year. Anything for\nnext year?\nYeah, I'm not I'm not looking forward to\nuh I'm not looking forward yet to to\nnext year. I'm looking forward to next\nyear. But, uh, look, we had a big agenda\nthis year. We had a lot to get done. Uh,\nso we'll, you know, get this session\ndone with tonight, go into bill review,\nuh, and make sure that we're signing or\nor potentially vetoing bills that would\nbe bad for our citizens. And then, you\nknow, then we'll start looking on what\nwe're going to do uh, next year, but a\nlot different than we were in this\nposition uh, this time last year,\ntalking about reform and having to focus\non it in the next legislative session.\nThankfully, we got that done along with\na lot of other good things and uh we've\nhad a great legislative session. Well, I\nknow that you are going to go talk to\neach chamber uh and and thank them for\neverything and they'll be happy to hear\nfrom you, but I want to thank you for\ncoming to see us first. I appreciate you\ntalking with us, Governor.\nGreat to be back with you. Have a good\nnight. Thank you. You too.\nAll right, then. So, a lot to cover\nthere. And actually, you got us rolling,\nboth of you did, ahead of time on that.\nUh, so he he feels really good about\ntort reform. We knew we knew he did. We\ndidn't get your full opinion on tort\nreform. Did you say enough? It was\ninteresting because Donna, you asked him\nabout insurance reform next year, which\nof course the speaker uh and some house\nleaders have already uh called for. Uh,\nand it was interesting to me what what\nGovernor Kim just said because he said\nthat he would that we would talk to the\ninsurance companies and see what they\nwanted. Um, and that's exactly what we\ndid with the with this tort reform bill.\nUh, gave a you know give away uh what uh\nPresident Trump calls a multi-billion\ndollar insurance bailout um like when it\npassed in Florida um to the industry. So\nwhat we should be focusing on is the\neveryday Georgians whose insurance rates\nare too high. Uh tort reform is not the\nanswer. Insurance reform is. And you're\nfilling on insurance reform. Look, he\ndid not say the insurance company should\nbring me language to look at. He said\nlegislators should bring him language to\nlook at because he heard legislators\ntalking about does this impact the cost\nof insurance? Does it bring it down? I\nthink that is the metric by which this\nlaw will be judged. I don't know that\nwe're going to know in the next 6\nmonths, but within two years we'll know.\nWe do know that Georgia is an outlier.\nAnd this is my real problem with Matt's\nargument is we're hearing from retailers\nwith footprints across the southeast.\nAnd they're saying that the cost and\nnumber of lawsuits in Georgia is\noutpacing all the other states combined.\nAnd most of them are in Cobb, Fulton,\nGwynette, right here in the metro\nAtlanta area. That had to get stopped.\nWe heard we saw regional businesses\nsaying stay out of Georgia. Don't have a\nfootprint there. The legal liability is\ntoo high and these juries are just\npassing out jackpots. We just saw\nanother $2 billion jury verdict here\nlast week against Bayer because of a\nroundup case. Utterly ridiculous. Okay.\nSo, we we had that answered. You're\nyou're feeling on insurance reform,\nthough. Are you are you okay with\nlooking at that? Absolutely. I think we\njust heard from the governor that he's\nfine with it as well. Oh, look. Look,\nthis the rhetoric around this wasn't\nmade up. It was not a false flag. This\nis about bringing relief in insurance\ncosts to Georgians and to Georgia\nbusinesses. We want lowincome areas to\nhave drugstores and and gas stations and\ngrocerers. We want them to have all\nthat, but we and we want businesses to\ncome here knowing that they're going to\nbe treated fairly. If they're negligent,\nthey're still going to get sued. They're\nstill going to pay out a lot. So you see\nmore businesses coming in because\nGeorgia's been doing pretty good in\nterms he's been doing great but we heard\nthe governor himself right there. The\ngovernor himself just said we've seen\nbusinesses backing off because of our\nlitigation climate. This will change\nthat. Okay. Want to talk about something\nelse I asked him about and that is the\nbudget and the possibility of a special\nsession. We've heard it from people.\nWhat are your thoughts in terms of what\nwe're hearing out of Washington and some\nof the cutbacks? you know, they always\nuh have the opportunity to to call a\nspecial session, and I know the governor\nuh any governor, not just this governor,\nwould be reluctant to call one unless\nit's absolutely necessary. Of course, he\nput a special session on the table in\nhis state of the state speech uh this\nyear, but that was for tort reform uh uh\nwhich has passed. So, it'll be\nfascinating to to follow that and see um\nhow Governor Kemp navigates President\nTrump and his administration. I talked\nto a Democrat today who thinks it's\ngoing to happen. So, I don't think it\nwill. You don't tell us about that. No,\nI there's no appetite. Legislators don't\nwant to come back. This is a part-time\nlegislature. These people run\nbusinesses, uh, have families back home.\nIt's very disruptive to have to come\nback here. And look, we've got a huge\nsurplus right now. The governor's got\ndiscretionary funds that can keep the\nstate moving ahead. It's a problem they\ncan wait until next year if, and this is\nit's all theoretical, if there's massive\nfunding cuts from the federal government\ncoming to Georgia. We don't know just\nexactly yet what that looks like, but I\ndon't see a scenario where they have to\ncome back. Nobody nobody wants that.\nWhen when when when Kent made that\nthreat, you could just hear the groans\nspread through the entire uh House\nchamber. It's been a long few months and\num one of the issues we didn't discuss\nearlier that the uh that the speakers\ntalked about and that was the\ntransgender bills that we saw this year.\nYour comments on that? You know, it was\nuh you know, I I spoke about this\nearlier that the Republicans really\nfocused this session on the culture\nwars. And it was interesting to me as a\nformer member of of the Georgia House uh\nunder Speaker David Rston. Um uh that\nchamber always was the firewall really\nagainst the far right fever dream um\nthat was that's been infecting the\nRepublican party uh for so long. And I\nthink what we saw this session was uh\nunfortunately the Republican leadership\njust knocked that bulldozed that wall\nright down and just shoveled all of the\nthose horrible bills right through right\nthrough the house. There was more of a\ncollaborative um process between the two\nchambers, right? There was a lot of\nagreement on those transgender bills,\nthat's for sure, because and on a lot of\nothers, too, on many issues and and I\nthink they're going to uh they passed\nrecord numbers of bills in both chambers\nduring crossover day. So, you're seeing\na lot of reduction out of this session.\nWhen it comes to these transgender\nbills, uh Democrats made a huge\npolitical miscalculation when they\nmarched out of the House chamber against\na bill that bans taxpayerf funed\ntransgender surgeries for prisoners.\nThis is something that you you don't\nneed the poll. It's going to be 90% and\nI don't know. I think that the 10%\nprobably don't didn't understand the\nquestion that they were being asked. You\nknow, it's an overwhelming support from\nGeorgians for what they're doing here.\nWhy Democrats would choose that issue\nwhen it makes them look so extreme on\nwhat Matt called a culture war issue.\nCulture war issues are something that\ndrive votes. And Democrats told\nGeorgians, \"We don't share your values.\"\nThat's what that's what they said this\nsession on those issues. Okay. You're\npresident of the interim president of\nthe Democratic Party. Chair chair,\nplease don't promote me to anything.\nDon't give me more authority. Uh no,\nlook, the uh the the Democrats walked\nout in that in that moment. And I think\nit was more that for for that caucus, it\nwas more just about the culmination of\nof everything that has been coming down\nthe pike uh this session. one one\nhorrible bill after another after\nanother after another after another. And\nit got to a point where um uh the the\nDemocratic caucus felt like it needed to\nstand up and and uh show some solidarity\nwith this community that has been under\nattack from day one. Okay. Well, we're\nrolling right now. I hate to stop this,\nbut we need to take a break. So, coming\nup, interviews with Democratic\nleadership in both the House and the\nSenate on this special one-hour siny die\nlawmaker show. The House is back in\nsession, by the way. This is the 55th\nyear of lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots\norganization dedicated to preserving\nGeorgia agriculture. Farm Bureau\nadvocates for all Georgia farmers at the\nstate capital during the session and\nyear round. Georgia Farm Bureau, the\nvoice of Georgia farmers.\nI'm a queen. I don't fear anyone. This\nis a woman people wanted to follow. You\nare an important part of our work.\nYou're stronger than you know. Saddle my\nhorse immediately. She's a female\ntrailblazer. We did it by acknowledging\nour own worth.\nOh, please do continue.\n[Music]\nUnderstanding the past gives a sense of\nthe future.\n[Music]\nThis is the first time that anyone has\nseen this in 2,000 years.\n[Music]\nThis is amazing. Well, I'm excited now.\nPompei is a battle against time.\nYou think I'm joking, but look at this.\nIt did really happen.\nDon't let anybody tell you who you are.\nHistory teaches us to honor the past.\n[Music]\nWhen you look back, you're like, \"Wow,\nthat was pretty special.\" This is\nsomething that's actually altering the\ncourse of history. You're charged with\nkeeping these stories alive.\nThe Georgia Senate back in action for\nthe night in what could be a long\nevening, but we'll keep you up to date\non what's going to happen. Welcome back\nto Lawmakers. We're having a special\none-hour siny die show wrapping up the\n55th year of lawmakers on GPB. And\njoining me in the studio is Republican\nStrategist Brian Robinson and the chair,\nthe interim chair of the Democratic\nParty of Georgia, Matt Wilson. Thank you\nso much for being here. We're going to\nhead right now back out to Sarah where\nshe has the minority leader in the\nHouse, uh, Carolyn Hugley.\nThank you, Donna. And thank you, Leader\nHugley, for being here with us tonight.\nMy pleasure. This is your first session\nas minority leader. Can you tell me how\nit's been going and any reflections?\nIt's been a fast and furious year, but\nI'm so very proud of our House\nDemocratic Caucus. We're 80 members\nstrong and our members have had a great\ntime this year. We've worked really hard\non on really some really fabulous\nissues. But at the end of the day, we're\ndisappointed that uh a lot of the things\nthat we wanted to do were not uh looked\nat or heard this year. The session\nturned into Trump tort and everything\ntrans. Uh but our constituents wanted us\nto look at our agenda which was uh to\ncreate opportunity for Georgians to\nlive, to learn, and to earn. Thank you\nso much. And uh speaking of everything\ntrans, yesterday there was a pretty\ncoordinated demonstration by the\nDemocratic Party against SB185, which\nwould essentially ban gender affirming\ncare in prisons. Can you talk to me a\nlittle bit about that\neffort? At the end of the day, what were\nwe talking about? Five people is all\nthey could come up with, five people. Uh\nand they make this the number one\npriority. And we're we were on the 39th\nday of our session. We had not passed\nour budget. Uh we had not finished a lot\nof things as it relates to education.\nNone of the things that we worked on\ntoday uh had been done. But yet we felt\nlike that we were wasting the time, the\nvaluable time that we have here. We only\nhave 40 days here. uh and our citizens\nsent us here to tackle the real issues\nand not to work on phantom issues or\nmadeup issues as that was. If we were\ngoing to look at uh prisons, let's make\nsure the doors lock, that you can lock\nthe cells. Let's make sure that you have\nthe staff that's needed. Not talking\nabout maybe five out of all of the\npeople that we have incarcerated fall\ninto this category. And is there\nanything that you're hoping to see pass\nin the final hours of the session today?\nMy hope is that we have nothing else bad\ncome through in the last final hours. Uh\nwe've done our constitutionally mandated\nthing which is to pass a budget and\nwe're looking to get to the end of the\nsession without any other major\ndisruptions to the people of Georgia so\nthat when the legislature is out the\npeople of Georgia can be safe again.\nRight. Thank you so much leader Hugley\nand Donna. back to you in the studio.\nWe'll be back to you in just a moment.\nSo, she see um leader Hugley talked a\nlittle bit about the fact that she\ndoesn't expect much to happen. The big\nbills have actually gone through. So,\ntonight maybe a little unless there's a\nsurprise from that you guys may know\nabout her. I don't know. Right now,\nanything could happen as we say. No,\nliterally. So, we we still have four\nhours more to go. So, yes. And and they\nare they are going to be clocking\nthrough bills. You do not know what's\ngoing to get s inserted into conference\ncommittees. You don't know what powerful\nlegislator is going to be on one of\nthose conference committees who's got a\npep project that has gotten no traction\nwith their colleagues and they slip it\nin something that their a bigger bill\nthat their colleagues do want. So it's\nyou never really know the fact that you\ndon't wake up on Saturday morning and\nknow we really don't know until the\nmiddle of next week what is in some of\nthese bills. It's kind of a crazy system\nfrankly. Yeah. you're shaking your head\ncuz right now we don't know what\nnegotiations are taking place either.\nThat's right. That's right. There's a\nlot of negotiations going on uh behind\nthe scenes in between the chambers uh\nand of course with the governor's office\nas well, but um we we we already know\nwe've talked a lot about what has\nhappened and what may happen, but we\ncertainly know what hasn't and isn't\ngoing to happen um in this session.\nanother session where uh Medicaid\nexpansion was not even really on the\ntable. Um uh despite the fact, you know,\nwe know uh Georgia spent over 40, you\nknow, billion a million dollars, excuse\nme, um to ensure 6,000 people when we\ncan expand, fully expand Medicaid and\nensure close to half a million people uh\nin Georgia. That was left uh by the\nwayside. Um but we'll see. Maybe they'll\nsurprise us and pass Medicaid here in\nthe last hour. Oh, that'd be a big\nsurprise. Yeah, I I think Governor Kemp\nmade it very clear. You're asking about\nnext year. I think Governor Kemp's made\nit clear as long as he lives on West\nPaces Ferry, there will not be Medicaid\nexpansion in Georgia. Okay, we'll talk\nabout talk about more in just a moment\nbecause now we're going to head back to\nSarah at the capital with the Democratic\nSenator Josh McLaren.\nThank you, Donna and Senator McLuren. We\nappreciate you being here with us\ntonight. Absolutely. So, before we\nstart, I noticed your pin when you\nwalked over. Can you tell me a little\nbit about that? Yes, this is a big pen,\nbig bipartisan pen. It says doing it for\nAmerica and it's a picture of me and\nSenator Russ Goodman. We're both\nenthusiastically committing ourselves to\nservice service this evening. So, I\nfigured the pen would commemorate it\nwell. All right. Thank you. And so, how\nhas your session been so far? What are\nsome of the highlights for you? Look,\nthis has been a wild session. And if you\nask any legislator, there's sort of a\nbig picture and a small picture, which\nis like what are they working on? Big\npicture, this has been a really tough\nsession. There have been some really\nregressive bills. I think even members\nof the majority party have been\nsurprised by how culture war oriented\nand regressive some of the bills have\nbeen just to be very blunt. Uh and so I\nmourn actually with a lot of people uh\nwho think that there have been undue\nattacks on teachers on the trans\ncommunity um and on civil rights in\ngeneral. However, that being said, I\nhave been working on some things this\nsession that I've been personally proud\nof. Um I got a regulation on booting\npassed uh both houses, House and Senate.\nSo, it's headed to the governor's desk.\nI think that'll be the first uh\nstatewide booting regulation, that's\nbooting of cars to be very clear. I have\nto annunciate clearly uh ever in the\nstate's history. And I've also worked on\nuh funding for veterans uh and some\njudiciary bills that I'm proud of. So,\nfor me, it's been a productive session,\nbut I but you know, my thoughts are with\nthe people who feel like uh this state\nhas taken a turn for the Trump. And so,\non late Wednesday evening, you were a\nvery vocal opponent of HP127, which\nwould ban DEI programs in Georgia\nschools. Can you talk to me a little bit\nabout your stance on that? Yeah, that\nbill is absurd. It may be the worst\nlegislation that I've ever seen in\nhistory. The reason I say that is\nbecause if one professor at the\nUniversity of Georgia were to teach that\nthe Holocaust happened, the entirety of\nthe University of Georgia would be\ndefunded of all state and federal money.\nI'll say that again. If any professor\ntook as an official position that any\ngroup has ever been harmed or\nmarginalized, uh you know, that's the\nHolocaust, that's slavery, whatever, uh\nall federal funding and state funding\nwould be withheld. It is a total red\nmeat culture war bill that the majority\npassed to satisfy a base that has grown\nto hate the letters DEI for for really\nno reason. Um and so we just that kind\nof move is not what the moderate\nRepublicans who voted uh for Republican\nleadership want. This is the far-right\nbase that they're appealing to. And I\ncan tell you with certainty that the\nSenate is hoping that the House does not\npass that bill because they know how bad\nit is. And is there anything that you're\nhoping to see pass um in the final hours\nof the session today? Sure. I mean\nthere's still some good government\nbills. I mean, that's that's the\ncontradiction of being in this place is\nyou can have a bill that's really crazy\nthat people are really not proud of, but\nthen on the other hand, you can have\ngood government bills that make life a\nlittle bit easier. So, I'm I'm still\nwaiting on a judiciary bill that would\nimprove our backlog in our courts by\nmaking cases go a little bit faster. So,\nyou again, you just got to stay focused\non the little wins you can get to make\nlife a little bit better for people. Uh,\nand you got to fight where uh where you\nneed to. All right. Well, we'll have to\nwatch that bill. Thank you so much for\nbeing here with us. Thank you, Sarah.\nAppreciate it, Donna. Thanks so much,\nSarah. So, let's let's start where he\nkind of left off on in terms of the DEI\nbill. It was the the the information,\nthe language was added to a bill that\nwould have added sick days to teachers\nwho really need sick days after it\ndidn't make it for crossover day in the\nSenate. So, talk about your feelings\nabout that. I have strong feelings about\nthis, Donna. um which may come as a\nshock to you but um uh most people don't\nknow before I went to law school I\ntaught sixth grade um no I didn't math\nand science and um so uh educators have\na very special place in my heart because\nI know how hard their job is. Um, I used\nto, uh, joke that, um, nothing prepared\nme better for service in the Georgia\nHouse than being a sixth grade teacher\nbecause it's an exercise in persistence\nand getting up every day and not taking\neverything that's said to your face\npersonally. Um, so I thank those sixth\ngraders for preparing me for especially\nmiddle school. Yeah, sixth graders. But\nbut this is just another example, Donna,\nof how Republicans are not doing\nanything to address those high costs\ninflation that we were talking about\nearlier. This is just another Senator\nMcLaren said it well, another red uh uh\num red meat bill thrown out to the base\num as we go into a critical election\nyear um which we should talk about some\ncritical statewide seats on the PSC this\nyear uh which Democrats are going to\nhave a great shot at. Um and going into\neven more critical cycle uh next year. I\nexpect about this time next week we'll\nhave a whole bunch of campaign\nannouncements. Okay. Okay. anything that\nyou want to add to us. We'll we'll get\nback to that in a moment. I just want to\nhear what you have to say about the DEI\nlanguage added to the bill that dealt\nwith sick days and it's now in the\nHouse, we believe tonight they'll vote\nafter the Senate. Well, we heard the the\nchairman here and the senator talk about\nred meat and I want to point out there\nred herrings. Look, the idea that a\nUniversity of Georgia professor is going\nto threaten the university's funding\nbecause they teach that the Holocaust\nhappened is just so extraordinarily\noutrageously false. There there's no one\nwatching this right now that believes\nthat is the case. No one. Not one\nperson, not even the senator who said it\nbelieves that's the case. What this is\nabout is rooting out the left-wing\nideology that has been put into\ncurriculum from elementary, middle,\nhigh, and and colleges across the\ncountry. And now there is a backlash.\nThis all came out of COVID when parents\nfor the first time were hearing what\ntheir kids were learning through the\ncomputer. And you are seeing folks say\nenough of this ideology. We're not\nsending our kids to public school to be\nfed liberal propaganda and to be taught\nuh basically that our country is full of\nshame. We should be proud Americans and\nthat's what this is about. And I I\ndisagree with the senator as well that\nmoderate Republicans disagree with this.\nThere are things that moderate\nRepublicans disagree with the MAGA part\nof the party on. This isn't one of them,\nright? uh the the Democrats and the left\nwho control cultural institutions simply\nwent too far and people got sick of it.\nOkay, we're going to change gears a\nlittle bit here because earlier today\nwhen I talked to the governor, we talked\nabout the fact that he would be talking\nto both chambers. Let's listen to him\nright now. I believe he's in the house.\nThoughtful coordination between the\nhouse, the senate, and my office has\nbenefited the people of our state and\nput Georgia on a path to continued\nprosperity and opportunity.\nMy hope is that we continue that\nsuccessful streak which will benefit\nhardworking Georgians most of all. And\nas this seventh session during my time\nin office draws to a close, I want to\nthank you all for your contributions and\nyour hard work. Marty, the girls, and I\nare grateful for your service to our\nfellow Georgians. Thank you all. Have a\ngreat rest of the night and God bless\nyou.\nAll right, Governor Brian Kemp speaking\ntonight, siny die to the members of the\nGeorgia House. I believe he now will\nprobably go on over to the Senate, but\nwe're going to right now go back to\nSarah at the capital and she's with\nSenate Minority Whip, Senator Kim\nJackson.\nThank you, Don. Donna, and thank you,\nSenator Jackson, for being here with me\ntonight. So, can you start off by\nwalking me through some of the\nhighlights for the Democrats and for\nyourself this session? Yeah, you know,\nthis has been a long session for us.\nWe've had to fight really hard against a\nlot of really bad bills. Uh, but we also\ncontinue to fight for good things. Uh,\nwe passed a child tax credit um this\nyear that I think will help some Georgia\nfamilies. Um, we continue to work to\nmake sure that people have education\nfully funded based on the QBE. We wish\nthat we re-evaluated the QB uh scale,\nbut we're glad to fully full fully fund\nthat. Um, but it's been it's been a\ntough it's been a tough session for us.\nAnd so we saw several bills that would\nhave restricted transgender Georgians\npassed the Senate this year and you were\nvocally opposed to all them. Can you\ntalk to me a little bit about your\nstance on that issue? Yeah, so my stance\nis that all people in Georgia should be\ntreated equally and fairly that no\npopulation and particularly a minority\npopulation as small as transgendered\nfolks and trans gender children\nspecifically um should never be attacked\nand pointed out. And so I've stood\nreally firmly on that. I am a member of\nthe LGBTQ community, but more\nimportantly, I'm very much invested in\nno child feeling discriminated against,\nno child being limited in terms of being\nable to exercise their rights as\nchildren to just play and have fun. And\nare there any other reflections that you\nhave for this session as we head into\nthe final hours? Yeah, you know, I'm\nreally disappointed in my colleagues in\nthe Republican party. We had an\nopportunity to really bring good things\nto Georgians and we continue to have\npeople who are uncovered when it comes\nto Medicaid and being able to have\naccess to insurance. We continue to have\nfamilies that are just struggling to\nhave access to child care and to have it\nbe affordable. Um, our TANF dollars are\nnot where they should be in terms of\npeople who are really low income being\nable to have access to additional funds\nso that they can just simply feed their\nfamilies and care well for their\nfamilies. You know, there's just a lot\nthat was left on the table that we could\nhave done to really help Georgians to\nadvance the ball. And instead, we've\nbeen playing these games with trans\nchildren. And um now we had a DEI bill\nthat passed out of the Senate that um\nwould greatly limit what people can do.\nRIFFRA passed, a bill that we've been\nfighting against for 10 years because it\nlegalizes discrimination. And so I'm I'm\ndeeply disappointed. We had an\nopportunity to do good things and\ninstead my Republican colleagues chose\nto throw red meat. All right. Well,\nthank you so much for taking the time to\nbe here with us this evening. Have a\ngood evening, Donna. Thank you so much,\nSarah. I appreciate that. Well, earlier\nthis evening, Sarah did an interview\nwith House Majority Leader Chuck\nEstration. Here it is.\nLeader Upstation, thank you so much for\nbeing here tonight. Yeah, thank you for\nhaving me. A lot going on here at the\ncapital on Sonny D. So, plenty to talk\nabout. Absolutely. So, we've seen the\nHouse pass hundreds of bills this\nsession. Can you explain some of your\nhighlights and the bills you're most\nproud of? Sure. We've prioritized school\nsafety, ensuring that hurricane recovery\nrelief, uh tax cuts were part of uh the\ndiscussion this year. Tor reform has\nbeen a major issue. Really, I think it\ncomes down to education, public safety,\nand ensuring that Georgians are in the\nbest possible position to live, work,\nraise a family. We're um we're focused\non common sense kitchen table issues.\nand uh what are your biggest takeaways\nfrom the session this year? Yeah, I\nthink the um success that we've had in\npassing legislation that really means a\nlot to Georgian. So, um uh $2 billion in\ntax relief that's been passed. We've had\nuh school safety legislation to ensure\nthat parents are aware of uh school\ninfrastructure improvements, mental\nhealth care. Um we we've had uh you know\nthe hur hurricane Helen had a\ndevastating impact. So just my takeaway\nis issues that really matter to\nGeorgians issues we were discussing in\nJanuary at the beginning of the\nlegislative session we followed through\non and passed and there's still some\ntime left this evening. Is there\nanything else you're really hoping is\ngoing to come up? Passing the budget was\nhuge. We had to do that and that\noccurred earlier this afternoon. But\nyes, I think we're going to continue to\nsee additional issues. Um and uh and\nthere's always some surprises here and\nthere on sunny die, but I'm I'm looking\nforward to finishing strong this\nevening. Absolutely. Well, thank you so\nmuch for being here and talking with me.\nGreat. Thanks for having me.\nAll right. Thanks, Sarah. So, leader of\nStration, the last thing you talked\nabout was the budget. So, I wanted to\nget into that. So, anything you want to\ntalk about in particular with the budget\nthat stands out for you? Obviously, a\none-time issue is Hurricane Helen, but\nlet's hope it's it's one time.\nObviously, there was tremendous damage.\nwe there's something we can't afford to\ndo every year, but this was something\nthat the legislature and the governor\nreally prioritized and hopefully it's\ngoing to bring some relief to those\ncommunities in South Georgia over into\nthe Augusta area. One thing that hasn't\ngotten a lot of attention, but it's\nsignificant is the amount of investment\nthat has gone into our prison system.\nThis is something that's gotten\nbipartisan support. Our prison system\nwas in dire straits. These are some of\nthe deadliest, most dangerous prisons in\nthe entire country. Gangs are being run\nout of these prisons. They're dropping\nin cell phones. Gang uh leaders are able\nto order hits, manage a drug operation,\nall from within our state prisons.\nThey're woefully undermanned. They are\nvery dangerous. And look, it's very\ndifficult in politics to go make an\nargument to taxpayers that their dollar\nshould go to people who have committed\ncrimes. No one wants to talk about that\ntoo much, but there is a humanity\ninvolved in some of this. People who\ncommit minor crimes shouldn't be\nsentenced to a virtual death penalty.\nAnd in some cases, with the amount of\nmurders that happen within the prison\nsystem that has been the case. So, I\nthink that this is a monumental\ninvestment. I think it's going to make\nour prisons safer and hopefully make it\nsafer also for the people who work\nthere. No one wants to work in these\nplaces. The pay is terrible, that work\nis dangerous. So hopefully with higher\nsalaries, we can attract some good\npeople and we need safety in numbers. If\nyou only have a couple of guards, the\ngangs in the prison can target them at\nhome and kill them, which we've actually\nseen happen. As you you would agree that\nthis is a an issue nobody wants to talk\nabout, but it had to be dealt with this\nsession. Sure. Sure. Absolutely. And um\nit's commendable that they that they\ntook that up. Um, you know, I think most\nuh most people don't understand um how\nthe budget uh uh works um uh in the\nlegislature, but it really starts uh\nwith with the governor and and who's\nelected as governor because um as Brian\nwell knows and Donnie, you know, well\nwell know, uh the governor uh selects\nthe economist who decides what the\nfuture projections um for tax revenue\nare going to be, which determines how\nmuch money the legislature can actually\nbudget and What we've seen in successive\nadministrations is governors choosing\neconomists who are ultra conservative\nwho will uh uh have a very low budget\nprodu uh projection number knowing it's\ngoing to be over that and the governor\ngets to allocate this amount on top of\nit that does not have to run through the\nlegislature. And that's why we continue\nto have uh disinvestment uh and missed\nopportunities in investment in in\nvarious communities um uh uh that have\nbeen starved over the last several\ndecades. Okay. I want to talk about the\nDemocratic Party of Georgia right now.\nSo we've seen a transition just what\nthis week earlier that um Representative\nNikima Williams has stepped down. So you\nare interim chair at this point. Tell us\nwhat's going on there. So, the\nDemocratic Party of Georgia is really um\nevolving to meet the moment that we're\nin. Uh we had a chair when um\nCongresswoman Williams was uh serving as\na in a volunteer capacity. Obviously,\nshe's a member of Congress. Um so, she\nwas a a volunteer unpaid uh chair for\nthe state party. We are moving uh to a\nuh a system of having a paid full-time\nchair. Um kind of like a paid CEO. But\nwe also have a paid executive director\nkind of like a COO. Um and so obviously\nwith her being uh my congresswoman in uh\nin Congress, she could not uh do that\nrole and she has graciously stepped\naside so that we can accelerate this\ntransition. Uh so we will we actually\njust yesterday Donna announced that the\nelection for that will be held in 30\ndays. Um and we already have several\ncandidates that are stepping forward,\nbut that'll be a paid full-time position\ngoing forward. Is there a special\nprocess in place for choosing? I\nremember it was it a few years ago there\nwas it was kind of a public way of doing\nit. So we have a uh a state committee of\nuh a few hundred um Democrats that are\nappointed from the county level uh who\ncome together and will elect the chair.\nOkay. You alluded earlier to some\nannouncements coming up. So is there\nsomething you want to tell us? I have no\nannouncement other than other than I\nwill not be the interim chair in 30 days\nand I'm very much looking forward to\nthat. uh um uh about some elections\ncoming up. You know, it's it's a very\nexciting. It's a very exciting time and\nI do think um that this time next week\nuh is when we'll see the slew of\ncampaign announcements uh once sin die\ngles out today. It'll be interesting.\nI've heard a lot of of names being\nthrown around. We've seen a lot of names\nalready um in the in the media uh both\non both sides. um some names uh in\ncontention and then withdrawing from\ncontention um and some names we thought\nwere out of contention now saying that\nthey are in contention. So it'll be a\nfascinating uh uh rest of the year.\nYeah, everybody was waiting for this day\nto end before we hear some of the big\nannouncements. What are your thoughts on\nwhat we might hear? Well, we know of\nsome already because they had to file\npaperwork and that was it wasn't so much\nof an announcement, but a a bureaucratic\nuh demand that that they announced that\nthey're going to run with Chris Carr uh\nrunning for governor, our current\nattorney general. Uh State Senator Brian\nStrickland announcing this week through\nfiling paperwork that he's going to run\nto succeed. Carr, I think you're going\nto see numerous state senators. We're\ngoing to we're going to empty out the\nstate senate. I mean, uh, we're going to\nneed to go recruit a bunch of smart\nGeorgians to fill these these seats\nbecause so many are running for higher\noffice. You're going to see, uh, some\nrunning for the insurance commissioner.\nI know, uh, Senator Larry Walker's\ntaking a look at that. Uh, insurance\ncommissioner John King is looking at\nrunning for US Senate if Kemp doesn't\nrun. But, of course, Donna, on our side,\nKemp is the domino everyone is waiting\nfor to fall. Nothing can happen until he\ntells us what he's going to do. Polls\nshow him beating Asaf by eight points.\nHe's obviously the best horse for\nRepublicans. Asaf is the most vulnerable\nDemocrat in the US Senate in this\nelection cycle. So, everybody wants Kim\nto run. Kemp doesn't want to be in the\nUS Senate. He has been governor of\nGeorgia, the coolest job that there is.\nIt's a step down to go to the US Senate.\nSo, he would have to be strong armed\ninto that. I don't think he'll do it.\nSo, I I think you may see some of these\nstate senators looking at the lieutenant\ngovernor's race like John F. Kennedy\nwho's the pro Tim and Greg Doazol from\ncoming to maybe look at that US Senate\nrace. They've been looking at the\nlieutenant governor's race and of course\nagriculture commissioner Tyler Harper\nalso like Bert Jones our lieutenant\ngovernor very close to Trump and might\nbe looking at some other kind of office\nto run for as well. But there's going to\nbe a lot of names there'll be some\nsitting. We'll see next week people\nholding fundraisers and that will tell\nus what they're running for. What year\nwas it that you you ran for insurance\ncommissioner? right 2022 and we saw a\nlot of people leave the legislature.\nWell, we'll we're going to have to wait\nand see. I want to thank you both for\nbeing here. It was really fun and really\ngood information. So, thank you so much\nand happy 55th birthday. Thank you.\nYeah, that does it for lawmakers for\n2025 this session, the 55th season of\nthis show. Tune in to GPB for continuous\ncoverage of state politics on gpb.org.\nAnd as we bid you for farewell, we leave\nyou with some behind the scenes images\nof our crew. Have a good night.\n[Music]\nHeat. Heat.\n[Music]",
  "updated_at": "2026-02-14T14:44:02.933179+00:00"
}