{
  "video_id": "bCvS5MjZ67M",
  "url": "https://www.youtube.com/watch?v=bCvS5MjZ67M",
  "title": "1/22/2024 Senate Committee on Transportation",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 68,
  "summary": "Overview:\nThe Georgia Senate Committee on Transportation session on 1/22/2024 focused on freight and truck transportation issues in the state. Key topics included an analysis of Georgia's industry reliance on transportation networks, projections for future freight growth, and the challenges of truck parking.\n\nKey Actions:\nNo bills were passed or referred during this session.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee acknowledged an upcoming dinner event on February 12th.\n- Representative comments were made about wearing stickers to represent causes related to the committee's work.\n- Janine Miller from the Georgia Department of Transportation (GDOT) provided an overview of GDOT's freight analysis and projections.\n- The committee discussed the challenges of truck parking, noting that 94% of truck parking spaces in Georgia are at private truck stops rather than public rest areas.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nQuorum was present, as the session proceeded without noted issues.\n\nAdjournment:\nThe transcript does not explicitly state when the session was adjourned. The next session date was also not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n.\nI pray for wisdom and judgment over this body as we go through these matters before\nus today, Lord.\nI pray for our first responders and our men and women serving here at home and overseas\nto pray that you put a hedge of protection around them\nand bring them home safely.\nAnd here, in Jesus' name, amen.\nThank you, Chairman Dixon.\nBefore we get started, I do want to flag for everyone\nin February 12th.\nIf you have not received a notification\nof our committee dinner, it is tentatively,\nbut pretty firmly scheduled for the 12th at Bones.\nSo please mark your calendars for that.\nAnd we are waiting on Janine Miller to get here to walk us through the freight logistics report and there she is ladies and gentlemen\nPerfect timing. Let's welcome to the front of the room with a rousing round of applause if you will miss Janine Miller\nAre you out of breath from those stairs because they are you would not be alone if you're out of breath from the stairs\nYes, and the cold\nI'm gonna recognize uh oh no\nI just want to make sure that the Center for the 23rd heard that the dinner is going to be on February 12th.\nLast time I missed the dinner because we had an ethics committee meeting that was a few hours long, so I hope we would work that out.\nI just want to make an observation, too, that we have no greater confidence that nobody watches\nthese meetings than the public invitation to wear and win our dinner, so thank you very\nmuch.\nFair enough.\nFair enough.\nWhile we're waiting for her to present, you have a few stickers on, are you part of the\nsticker caucus today?\nWhat are you wearing over there?\nThank you, Mr. Chairman.\nto represent causes that are as germane as possible\nto the committee's business.\nBut since you're giving me a chance\nto do some shout outs,\nthere was the Georgia Speech Language Hearing Association\nat Tenon State.\nI think the rules chairman said something about them\nand reproductive freedom for all is the other cause.\nSo, go team.\nFantastic.\nThanks, Mr. Chairman.\nThank you so much.\nMs. Miller, must we listen to more of his die tribes\nor you by chance, ready to?\nThankfully, I have a very boring topic,\ngreat infrastructure.\nThank you for having me at the committee today.\nAnd this is a topic that is important for all of transportation,\nthe trucks that move along our roadways\nand the cargo that's moved by rail and ship.\nWe're going to focus today on our roads,\ntrucks on our roadways, and it's not just important\nfor transportation, but it's important\nor economic development, the community impacts for quality\nlife and ends on and on.\nSo I wanted to give an update on our recent analysis\nand studies that we've done here in the state of Georgia.\nAnd these are just, these are the main ones.\nThere's freight and truck-related data\nthat we look at in all of the studies and plans\nthat we do at G.Dot.\nBut I'm going to give you kind of an overview\non the highest level, the biggest picture analysis\nthat we've been doing.\nSo for the first time ever, we did an evaluation\nof the reliance of Georgia's key industries\non our transportation networks based on private sector data.\nSo we procured about two dozen either acquired,\nbecause as public data are procured,\nhe has his private data, two dozen sources of information,\ninformation data flows about cargo trucks, you name it, and the type of industries that\nare impacted that are using our roadways throughout the state. Never done this before,\nand this is the same data that private companies themselves both populate and use for their\noperational and strategic investment decisions. So we are working from the same batch of data\nthat private sector uses.\nAnd this is one of the most interesting outfits.\nUsually, when you see a map of George and Broadway,\nas you see the map on the right,\nand you see it in all one color, you can say black or gray or blue.\nBut here for the first time, we are able to dissect\nwhich industries use which parts of our network the most.\nFood and agriculture and manufacturing\nare the most distributed in terms of the state routes\nthat are used.\nBut of course agriculture is good in agriculture,\nusing the southern half of our state more prolifically\nthan other industries.\nAnd the eastern part and northern part of our state\nis what manufacturing industries rely upon.\nDistribution and retail is predominantly in Metro Atlanta,\nbecause that is the population center of the state of Georgia.\nSo as you layer them all together,\nyou can see that every part of our road network\nis used for our key industries.\nand these industries represent 60% or more of the cargo\nthat's moving on Georgia State routes.\nBy 2050, we took this data, we put it into our model.\nSo by 2050, the freight moving on our road network\nis going to grow significantly,\nnearly doubling in weight to 900 million tons\nand more than doubling in value to $1.6 trillion\nmoving on our roads in the next 25 years.\nYou can see that in the gray on the left,\nmost of it by truck, of course.\nAlthough rail in Georgia is very, very important.\nWe have more rail miles than any other state\nin the southeast, more freight rail miles.\nAnd we have both class one railroads\nat our ocean port in Savannah, which\nis a unique advantage for shippers,\nboth because they can reach more locations in Georgia\ncommunities and throughout the southeast\ninto and out of the port, but also it enables competition\nbetween the two carriers for those shippers\nthat are able to use either class one,\nCSX or Norfolk Southern.\nBut in either case, cargo is nearly gonna double in weight.\nThat translates into congestion costs.\nIf we do nothing, if we expand our network\nin no significant ways, our delay is going to more than double.\nthan double.\nAnd you can see broken down by the color of the bar there,\nin the base there is manufacturing.\nCongestion cost to manufacturing shippers,\ncargo owners is going to double.\nCongestion costs for distribution,\nthat's the lighter blue, is going to nearly quadruple.\nAnd then congestion costs for food and agriculture\nwill nearly double.\nand other industries also have impacts,\nbut this is the main part of our congestion costs\nand things that we are using as a decision maker\nas G.Looks at our project options in front of us\nthat are in our pipeline right now\nand what we need to develop going forward.\nSo I'm gonna reflect back to this.\nEvery one of those roadway networks\nis going to be experiencing this congestion cost doubling.\nOkay. Part of our infrastructure is when trucks are not just moving, but when they parked\ntheir parked or need to park. This commend the Senate for the study committee that was\ndone over the past year. Excellent, excellent work and the attention to this issue is critical\nfor our economy, but it's also critical for the whole Eastern seaboard in Southeast.\nGeorgia is not the only place that is having the truck parking challenge.\nIt's caused by federal regulation, federal law and regulation that require truck drivers\nto pull over and rest for 30 minutes or to get breaks in between their service hours.\nWhen the electronic logging device came into play,\nthere was no longer the ability for them\nto drive an extra mile or two.\nSo they have to pull over wherever they can get a parking space.\nAnd I don't know how many of you might have seen\ntrucks parked along the interstate ramps,\nthe exit ramps overnight.\nIt's typically when you'll see it early\nin the morning or late at night.\nWe have more truck demand than we have parking spaces\nin our state.\nIt's important to note, though, that of the parking,\ntruck parking that we have in the state of Georgia,\n6% is public spaces.\n6% of truck parking places are at our rest areas,\nway stations, or visitor center.\n94% of truck parking is at private truck stops,\nthink of ATL, the travel centers of America loves and others where there are amenities\navailable beyond what we're able to provide at our est areas.\nThe problem becomes though that when they cannot find a place to park, the driver is going\nto spend nearly an hour looking for a truck parking space or they have to cut off their\nhours of service early so that they can park somewhere that they know is safe. That is\nan impact of 10% to the supply chain and 12% equates to 12% cut to truck driver pay.\nThese are frontline workers that are moving our 70 to 80% of our economy and so we want\nto do what we can to understand where truck parking opportunities to expand truck parking\nexist. We did a study last about two years ago that is helping us locate where we can\nexpand truck parking that might be useful for drivers who are needing to rest. Of course,\nthe Atlanta is the epicenter of where unauthorized parking is occurring and that's what this map\nshows in the brighter yellow and red. But we do have unauthorized truck parking that is\non our interstate ramps inside of the roadways in other parts of the state as well as you\ncan see there, wherever it's lit up in purple or blue.\nSo we are considering what capital investments we can make, either directly at our rest areas\nor potentially through partnerships with, again, those private truck stop operators.\nAnd we need to ensure we have compliance with federal and state laws and funding availability\nand eligibility.\nThis is a focus for the department to do our part to catalyze truck parking availability\nand expand that in our state.\nOne other thing that we've done is taken a look at the coastal empire.\nThat is the four counties that are around the port of Savannah that being Brian, Bullock,\nat Chatham and Effingham County, where 75% of trips to and from the Port of\nSavannah are heading with their cargo that's imported. We do know that there's\ngoing to be expanded capacity at the at the Port of Savannah, so maybe you've\nmay have seen that, but we saw a 20% uptick in T.U. that's 20 foot equivalent\nunits of container capacity increased by 20% during the pandemic.\nSo Savannah is a port of choice for shippers and for carriers alike and we're doing our\nbest to keep up with that demand that's occurring outside the port area.\nSo we took a look at the coastal empire analyzing regional freight patterns, excuse me, industrial\ndevelopment patterns and effects of the port growth on that local area. And this is what\nwe found that congestion growth in Metro Savannah from 2020 to 30 years out by level of\nservice. That is the metric that we use, the data point that we use to indicate the level\nof congestion. So on the left is essentially, if you drive down in the Savannah area today,\nyou will see and you'll experience traffic congestion where those red dots are on the\nleft map 2020. Those are levels of service F as you can almost think about it as a grade\nthat kids have, school children have it in their classwork. So there's some congestion\noccurring today but by 2050 without significant investment you can see where level of service\nF for traffic congestion expands throughout this study area, throughout this catchment\narea for the Savannah cargo that is moving through our port.\nThat is equating to a great deal of delay and making those land areas less available to\ntruckers within a one hour drive of the port.\nIn fact, without targeted investment by 2050, roughly 40% of the available industrial\nspace will be an hour drive from the port where right now it's about 10 to 20 minutes.\nSo the darker the shade of blue on the right means those are in the hour to two hour\ndistance from the port where none of that is being experienced today.\nSo that delay that's happening as a result of that congestion is making land development\nless accessible for those shippers that are needing to move cargo quickly.\nOne thing to also note about this distance away from the port that collapses with congestion\nis it impacts our truckers, our dry truckers in the area.\nToday they can make multiple turns as they call it into and out of the port because their\ndestination of an industrial facility, whether it's manufacturing or distribution, is close.\nSo it depends on the trucker, it depends on what shift they're in, but they can make\nanywhere from 4 to 8 turns a day, that is going to be cut in half.\nSo this is another impact to truck drivers.\nWe will need more truck drivers to do these terms in future years\nunless we're able to invest in capacity improvements in the area.\nSo those capacity improvements we studied include corridor expansions,\nabout a dozen of them as you can see here.\nThis includes I-16, but it also includes 80.\nand 21 into Effingham, as well as some improvements on I-95\nand around the new metasite there in Bryan County,\nplus about a dozen intersection improvements.\nAnd these intersection improvements are much more economical\nand they help out the flow a lot.\nEven today, if we were able to build all of these improvements\ntoday, you would see improvements in flow much more quickly\nthan if you do corridor improvements\nbecause intersections are less expensive.\nTherefore, we have more money available to do more of them.\nAnd they're also quicker to construct\nbecause they require less right away and less permitting.\nWe also did a study of Troop County.\nThe reason we did this is there's some of you may have heard\nof MPOs, Metropolitan Planning Organizations\nthat are throughout Georgia, there's 16 MPOs.\nThose are federally designated areas\nthat the local governments come together\nand do a specific transportation planning\nabout a handful of them have their own money\nto improve their roadway networks.\nBut Troop County is not one of those metro areas.\nIt just does not meet the population threshold\nto get federal planning money or federal funds\nfor road improvements in that area.\nOf course, Troop County is the home of Kia\nare currently only operating auto manufacturer\nin the state of Georgia.\nthe growth that has happened there is exponential.\nIn the last time that a plan was done in Troop County\nwas 2006.\nAnd that was the year that Kia announced it would open.\nSo that as you all know, the community there\nhas transformed, has grown significantly.\nAnd we wanted to partner with the county there\nto do that study where federal resources weren't available.\nSo this is on the Alabama line.\nIt's just north of Columbus.\nIn fact, right after you might be heading down to Columbus\nand split off on I-85, I-185, sorry, you're in\nTroop County at that point, and then you pass by\nLagrange and on your way to Alabama is where you come\nto West Point, which is where the Kia plant is.\nThere's three cities in Troop County.\nLagrange, Hogan'sville, and again, West Point is where\nthe Kia plant is, but there are suppliers throughout\nthis area.\nWe wanted to identify transportation\nnetwork improvements to address the future growth and with a focus on freight and provide\nrecommendations for road and bridge infrastructure and touch on transit and multi-moldal projects\nas well. That study is underway and we'll be having, we've been having meetings with\nthe local communities and local governments there over the past nine to twelve months and\nresults will be coming out soon. And then we also took a look at State Route 365. Where\nis that that is right where 985 ends and it is also where there is a new\nnortheast inland port will be opening soon. This is a strategic location that\nwas chosen by the port of Savannah as a way to move cargo inland on rail and\nkeep trucks off of a couple hundred miles worth of roadways by moving\nthose containers on rail instead. So at the inland port is where there's an\nexchange of cargo containers that come from the port of Savannah, they will move on to\na truck at this inland port or intermodal facility.\nSo we knew that there was going to be some growth happening there, but in reality, that\nlocation was chosen strategically because there already is a lot of manufacturing and distribution\nthat is occurring in this area.\nSo it's just another piece of the puzzle that's solving the freight volumes that are increasing\nthere.\nwe are looking at adjacent roadways,\nas well as what's going on around the port,\nand analyzing existing and future conditions\nfrom 985 up north east to Belton Bridge,\nand we're gonna develop and evaluate\ntransportation improvement options.\nAnd then one last study to tell you about\nthat we've had underway for a little bit\nis in the Brazleton, Huston area.\nThat is on I-85, just outside of the,\nWell, it's just outside of the Gwyneth Barrow County line\ninto Jackson County.\nSo if you see in the purple is the area,\nit's a pretty large area and it crosses county boundaries\nas most transportation trips in Georgia,\ncross county boundaries.\nThey trucks and cars are moving from origin to destination\nregardless of what border of a county or city\nit might be crossing.\nSo that is a role that G.Dot can uniquely play\nto look at the true travel demand,\nregardless of what jurisdiction it's in.\nSo we're looking at regional connectivity,\nthe demand for North and South travel.\nThrough trips is a significant challenge in the area,\nbut there's also been an incredible amount\nof manufacturing distribution growth\nthat is happening in particularly Jackson County.\nAnd so there's a great deal of interest\nin ensuring the local communities\ncontinue to have safe access to their businesses\nneighborhoods as the industrial base grows in that area.\nSo that is it for me if you, for what I have for formal presentation, but happy to answer\nany questions, refer back to any slides if you'd like.\nThis QR code and that link will take you to the Georgia Freight Planning Analysis.\nThat is where you find about a 25 page report reflecting that statewide analysis of key industries\nand congestion costs.\nThank you.\nDirector Miller.\nThank you.\nThank you.\nSome of you may be wondering why we keep talking about this.\nChairman B. H. when he was leading the charge on transportation and study committee, I think\nit was four years ago on this topic.\nAnd there's really two reasons we were looking at this one.\nIf we look at those 2050 numbers, it's not a George that any of us would want to live\nin, right?\nWhere we're seeing two hours to get 50 miles outside the port of Savannah.\nWe're going to see gridlock traffic in Atlanta around the state.\nYou overlay that with our current situation.\nI believe, director, you had what's not in here.\nI read a report that came out from your office last week.\nI believe that, give me the timeline on this.\nBut you all put a rough number of $90 billion,\nessentially the $90 billion dollar solve on this problem.\nIs that with that same 2050 kind of time horizon?\nThat's correct, yes.\nThat's additional funding above and beyond\nthe current plan, is that correct?\nMost of it would be additional.\nthat's just the total investment over a 25 year period\nwould be 90 billion.\nAnd that 90 billion dollars worth of improvements\nwould improve freight, but it would also improve\npeople flow as well, that we don't have just trucks\non any of our remains in Georgia.\nThat's right.\nSo to put that 90 billion in perspective,\nwe will see about 2.2, 2.3 billion in the budget this year.\nThe feds will give us about 1.8.\nSo we're currently spending about $4 billion a year\nwith our existing needs.\nAnd all those existing needs fund all the other projects\nin all of our districts that may or may not have anything to do with these identified\nfreight corridors. I'm in active conversations with Chairman Jasper's in the house. I\nthink we probably have a generational opportunity to allocate existing revenue sources from\nour surplus to some of these transportation projects. Personally, I would love to see\nus do that without having to raise new revenue, without having to do, you know, line item tax\nincreases as has been done in the past.\nWe think we've got about 10 years left, at least,\nin the gas tax.\nThe gas tax has been relatively resilient.\nThat $2.2 billion number has been pretty consistent.\nBut eventually, we know that that will change.\nAnd so we have things out there that\nexist such as the marketplace facilitator tax\nthat will increase over time as the motor fuel tax decreases.\nI think those are all things we need to be actively\nthinking about this exercise and talking about this is not just so we can look at maps\nand say, hey, we're going to have congestion problems in 30 years and let's just, you\nknow, kind of realize that maybe try to build one or two more roads.\nI think that with the surpluses that we've had, we've seen states of the north, south,\nand east of us in the west for that matter do something similar with Governor Kimpton\nlast week.\nMake multi-billion dollar investments of the surplus money or ARPA money or both and as\nAs you saw on the governor's budget, he put forth about $1.5 billion in the baby budget\nfor fiscal year 24.\n600 or so, if that would go to freight, 600 or so, that will go to the existing called\nthe G.Doc program, which I think is important to note a great percentage of that, merely\nbackfill projects that we've had to spend money on with the economic development success\nin the state.\nSo when we go win a KIO or a Hyundai or a Rivian, we're spending tens of millions of dollars\naround that area to build up infrastructure.\nAnd what that means for us in our districts,\nif that doesn't happen to be in our district,\nis without an injection of capital,\nother projects are getting pushed down the list.\nSo I want to thank the governor and his team\nfor essentially allowing the plan that we have,\nthe tip to stay on track.\nAnd then lastly, there's $200 million\nthat you'll see in there for the Elma grants,\nwhich are done by formula, which is something that all of you,\nif you have not called your local county commissioners\nor city managers, let them know about that yet.\nthat is something that essentially doubles that spend for the local maintenance improvement\nprograms that we have.\nSo, I just want to kind of cast that net over this conversation as to why we're having\nthat.\nI know a couple members need to leave in a few minutes and one of those is going to be\nleader Goose.\nI'm going to let you ask the first question.\nThank you, Mr. Chairman.\nJanine, thanks for being here.\nIt's always good to get an update from you.\nDearing thanks given I drove my family out to Arkansas and as we've talked so many times\nabout trucks and truck stops and overnight parking.\nI realized when we drove through Arkansas,\nthere were truck parking lots spread throughout\ninterstate 40.\nI wonder why Arkansas has done that and we haven't.\nWhat, where's the money coming from\nand how are they doing that on interstate 40?\nGood question, I haven't been along that corridor\nbut I will definitely research it.\nThank you for flagging that.\nI think it would be good to look into that.\nI'd love to see that in Georgia.\nIndeed, we are embarking on a very special deep dive study.\nWe have business consultants and transportation consultants\nthat are going to really unpack,\nwhere is the private sector demand\nand what the state can do to support that.\nCouple things to note, we are rest areas as they exist today\nby federal law, we cannot have any commercial activity\non those rest areas.\nSo wherever we expand that would have the amenities\nthat truck drivers need and want along their journey,\nWe will have to do that in partnership with the private sector.\nFrom what I saw, these parking lots were just vacant lots that were built off the interstate.\nNo exit anywhere else.\nThey were just pull-offs, maybe a five acre flat asphalt lot, 100 trucks spots, perhaps.\nNo utilities, no water or anything, so they literally looked like they were built primarily\nfor truckers to spend the night and get their hours in.\nThank you for that.\nThat would be a stop gap measure somewhere to at least just park, but we know that just\nlike all of us, we need the human amenities to make our journey safe and comfortable.\nSo we do have engineering and analysis underway to expand our rest area parking by about 400\nspaces.\nWe don't have the funding for all of that, but we do have engineering underway for that.\nlast question if I may the pinch point that Henry County what's the status on that what can we expect to\nsee in the next two to four years. A analysis was done and I believe it's on our website that is the\ncorridor between Macon and Atlanta and it's showing that the the Henry County is indeed a pinch\npoint and we are taking a deeper analysis right now of where we should expand that capacity. The\nThe truck only, the commercial vehicle lanes that are planned are just covering about\na little over half of that distance between Macon and 285, and those are northbound only.\nBut there's clearly from what we've gathered so far, much more traffic congestion today\nand in the future than just northbound commercial vehicles lanes would accommodate.\nSo we're taking a look at the best way to phase those investments over time, where the traffic is the worst.\nThank you.\nThank you.\nChairman Beach.\nMy name is Chairman, I want to kind of piggyback on what Chairman Beach here.\nMike is not pulling up, he might pull in Senator Mellon's mic over to you, thank you.\nOkay.\nThank you, Mr. Chairman.\nI want to kind of piggyback on your comments.\nWe started studying freight logistics when Chairman Tanner was here about four or five years\nago.\nAnd I think we've done enough studying it.\nMy question to you is, do we have a project list and can we prioritize that?\nAnd have you and the Port Authority and GDOT and Economic Development Development Pat Wilson\nsat down and say, hey, this is, we've got a Hyundai plant coming here, Rivian here, we've\ngot to build infrastructure.\nIs there some joint meetings going on between all of you and some collaboration?\nI can tell you, if we don't start building roads in Savannah today, the trucks will not\nbe able to leave the gate of the port in ten years.\nThey'll be so backed up.\nSo we've got to do it.\nI know Griff Lynch and his appropriations hearing talked a little bit about partnership\nwith Rail and trying to get more product on Rail and there's talk about, I know Norfolk\nWe've got to start building now and I know we've studied a lot, but is there some project list we can look at and prioritize and get shovels in the ground and start building?\nYes, let me first answer the question about collaboration coordination amongst the agencies.\nYes, we meet on a regular basis of Georgia Ports Authority and very frequently with Pat Wilson\nand his team at the Department of Economic Development to understand where not just the big plants\nare going in but small manufacturing and distribution around the state.\nSo we're regularly looking at that and trying to get ahead and stay ahead where we can.\nAs you know, Chairman, it takes a long time to develop a project, unfortunately, with\nthe regulations that are required of us to follow from environmental permitting to public\ninvolvement, to engineering, safety design, all of it, right away acquisition, it takes\na very long time to develop projects.\nSo in terms of the projects that are for freight, and the freight program is recommended\nby the governor. Commissioner and I are working on that battery of projects that are going\nto be able to come into the program that might be in the out years that are going to benefit\nfree. That's a one time solution and we have had construction cost increases. So we know\njust the overall cost of doing business is more than it used to be. So we're working\nwith the engineering team and the permitting and right away teams to figure out how we\ncan bring the best most cost effective projects forward with those funds.\nAnd it's in terms of when it will be hard to get trucks out of the port of Savannah, we're\nnot sure.\nIt's hard to exactly project that.\nWe just know by 2050 it will look like this.\nThis may show up earlier than 2050.\nWe do have some of these coastal empire study projects in the pipeline already, particularly\nas I was referring to the intersections are going to be the quickest and easiest ones\nto get going. This has been looked at by our engineering project development team, both\nthis one of intersections and these of corridors, and we're evaluating what do we already\nhave available in the program, can bring off the shelf and get those started right away,\nand then which ones require PE and right away, and we'll take a little bit longer to develop.\nThis is the most mature of all of the freight projects, for the ones that we're going\nto want to build for truck parking, as I mentioned, to Senator Gooch, but also to address\nthese along all of these routes statewide is a lot of additional work to get it from\na concept in a model to a project list that is a concrete ready to let to bid project\nlist. That's going to take a good bit longer. But we're working on it.\nCan I have one follow up question? So let's say next year we have another huge surplus\nand the governor wants to give you $3 billion.\nAre you going to be able to get that money\nin the ground working on capital projects?\nWhether the governor gives us more money\nby next year or not, we will know a lot more.\nWe are underway right now to translate\nthese roadway networks with this congestion costs\ninto projects that's going to happen\nwhether there's more money available or not.\nThat's our duty to do that.\nOkay, thank you.\nI'm Chair and V. H. Senator Lucas.\nYes.\nA talk to the question president on the bill, of course, and all that.\nOne by the end of the bill, in the middle of the year, you'd say, twigs, a meal counter coming\nin to be a counter.\nThere's another land out there to do it.\nand knock the sun on the mud, bag of poultry to the chocolate mud.\nWouldn't that be an ideal place not only to do a port, but also a truck round beam?\nIf you had that time, you would assume that first you would have the railroads where to put the trailer on.\nIn terms of the exact location of where inland ports go, we defer to the port of Savannah,\nthe Georgia Ports Authority, because they have the line of sight into their cargo owners'\ndata and origin destinations in ways that we don't.\nSo we defer to the port's authority on planning those.\nThere is one in cordial today.\nProbably not big enough.\nThere is one in Appalachian Regional Port in northwest Georgia.\nThe inland port in Gainesville Hall County will be open soon.\nAnd then the Georgia Port Authority is also planning one over west central Georgia near\nthe Kia plant to support the cargo flows there.\nThat is what I know is planned.\nBeyond that, I'd have to defer to the Port Authority on where they believe their customers\nare best going to utilize the inland port and get the most use out of it.\nWell, the reason I asked is, it's going to take money.\nAnd we need the trouble.\nI mean, I've done, I've done a thing for a bit.\nWhen I give you money now, just then have a short break to roll this line.\nor the tractor trailer got everything back up going into the land.\nAnd so the question becomes whether or not you can take someone that often gets to the little door here.\nAnd you have an awful stuff whether or not you will be able to do an in-emport\nas well as drivers being able to along the island once they get there\nAnd it absolutely takes some of the trucks off their own\nbecause it won't send if I was straight to the map.\nWell, as you can see here, I 75 shows up on every map\nfor every industry, north of Macon,\nand then both for food and agriculture and distribution\nretail.\nI 75 all the way to Florida border is a key corridor.\nAnd there's a study done by the US Department of Agriculture\na few years back that indicated that I-75 through the whole state of Georgia is critical for\nall of the nations, food and agriculture.\nWhat an inland port does, though, it only would go to and from the port of Savannah.\nSo we've got a lot of through traffic on I-75 that an inland port wouldn't even be able\nto address.\nBut we will bring that back to the port authority.\nWe'll let them know that there's an interest there and we're going to be meeting with them\nfurther on.\nWhat else we can do here?\nAnd that's, I mean, you've got to have it.\nThey have to have a land, it's rural areas in the land.\nAnd it's right.\nThe side of it was a metro area.\nAnd then you got to know a person who is running\nto Wilkinson and to meet for the kids.\nAnd when they do the Inland Ports, they partner.\nThey, the Georgia Ports Authority partners\nwith one of the rail carriers.\nSo we got a chance to do Norfolk Southern, right?\nThey want to be, oh, they don't want to be night.\nI guess we're going to have about five more minutes here with Ms. Miller.\nSo I'm going to take two more questions.\nSenator Mel, your button was, are you, did you still have a question?\nI did.\nMr. Chairman.\nThank you, Mr. Chairman.\nAnd to Director Miller, I thank you for the graph that you provided us.\nI drive I-16 every day coming to session back and forth.\nAnd I appreciate the study that you all did.\nI've been talking about I-16 with no study because I've been driving it.\nIs there any opportunity to consider adding IE and express lane where you could use\na peach pass to get through some of the congestion a little faster where the truck traffic may\ntake up.\nThe right lane and then truck traffic then gets in the left lane and then you're stuck\nwith the trucks.\nAnd I don't know if anybody has ever rolled past them on I-16 but they shake your car\nas you ride them.\nIt makes me nervous.\nSo any opportunity to do that in small sections to eat this elephant?\nThat's a great question.\nI-16 is a focal point not just for the Coastal Empire study but for all of the freight\nplan. What is the best way to add capacity to I-16 is a corridor study is what we would\nlike to do with the additional funding that hopefully is appropriated because there are\nmany options that have been offered up. People have discussed truck only lanes. People\nhave discussed just in HOV lane for folks who have more than two or three people in a car\nto use that. People have discussed a transit lane. So there are many options in there.\nWe do know that in Atlanta, say on I-75, that reversible corridor, we'd prefer not to\ndo reversible. If we do a lane addition of any sort, we would want it to be in each direction\nbecause we know there's bidirectional flows. That's something that's important. But wherever\nwe do have our toll lanes in Metro Atlanta. We don't allow trucks in those lanes up here.\nSo if toll lanes become something that we might want to do in Savannah,\nonly if it will provide the best option and the best use of the public's dollars,\nwe would still have to determine it would trucks use the lane or not. There's a lot left to\nunderstand in that. Any opportunity to use the contra flow lanes that we have for evacuation to\nto maybe supplement that while they exist,\nthey sit dormant until we have a hurricane,\nwhich is usually from August to November,\nand other than that, they're not in use.\nThat's a great question,\nand that will be part of our analysis\nto make the best use of existing infrastructure.\nIt was the most cost-effective way to improve capacity.\nThank you, Chair and Burns, is this you, or is it?\nThank you, Mr. Chair, and a quick question.\nWe've talked a lot about roads, we've talked a lot about trucks,\nwe'll talk about rail.\nWe have to integrate our rail with our truck traffic.\nI have a current traffic in my district\nthat's three miles long in breaking communities apart.\nRail.\nRail.\nNow, we have to have a combination of rail and truck\nin order to move freight to an inlet port\nor to a final destination.\nNow, my question is, how do you integrate rail\ninto your overall transportation freight strategy?\nAnd how can we ensure that rail will have a capacity\nto accept the offload from trucks?\nGreat question.\nalong with the truck parking analysis,\nwith the private sector that I mentioned before,\nwe're also that same consultant team,\nbusiness consultants who understand private sector\nrail demand, and our transportation consultants\nare gonna team up and do a deep dive understanding\nwhere we have those blocked crossings\nor occupied crossings around the state.\nAnd what can we do about those?\nWe're gonna be explaining rail capacity.\nThat's right.\nSo what will come out of that,\nWe're not sure we do believe that a grade separation\nis the best way to keep those communities\nfrom being blocked.\nWe also know that grade separations\ncan cost anywhere from $10 million up to $50 million each\nand take a long time to develop and partner\nwith the railroads on making sure\nthat engineering works for both parties.\nSo there may be the potential to do some rail sightings,\nis what it's called, like an offshoot\nwhere the train can park and get out of the community.\nthat's going to be a really important part of the study\nbecause those are less expensive.\nBut as you know, we have the gratuities clause\nin our constitution, so we can't give state money\nto a private, give away to a private,\nit has to be a public-private partnership\nto make those happen.\nBut those would be a more cost-effective way\nof doing it, where we can find two and three miles\nthat doesn't have a public crossing.\nSo it's complex.\nThank you for teaching.\nAll right, quickly to Chairman again.\nThank you, Chairman.\nMr. Miller, I appreciate your presentation.\nOne of the things that I'm gonna pick on my colleague\nfrom down in Savannah, and I look at, okay,\nwe just heard the, you come up I-16 to 75,\nyou get to Henry County at stops.\nThe, I'm gonna implore you to keep pushing\nthose secondary routes.\nIf I was in Savannah, I wanna go to Atlanta.\nI might take Highway 17 north to,\nI-20 coming in, I-20, use some of those under,\nunderutilized routes.\nI guarantee you there's not 10 minutes difference between the time actually it may be much faster\nusing those routes but you know those are opportunities and I want to see us try to continue\nto push those I know how we 17 was back in the day the grip program said the I was there\nmoving those things forward I appreciate what you do and thanks for being here today.\nThe bridge you got to be in the care of the work.\nThank you.\nThey ain't no bridges down there, South Jordan.\nJust ask that one about Savannah.\nThey got a little bridge problem down there.\nThank you for the comment on the grip corridors.\nThose have been, I believe, a key for attracting business\nto the state of Georgia with the four lane roads\nthat is a grid network around the state.\nAnd many of these that are on this map here are grip corridors.\nAnd they provide an incredible high performance\nand important route to, throughout communities\nfor industry to the port and to Metro Atlanta.\nThank you, Director Malone, for being here today.\nI think that probably the most encouraging news\nis that we have a project list coming out\nthat's something that's been very interesting\nto members of the committee as well as the appropriators.\nThat was a question that was kind of whispered amongst\neveryone as we realized we can $1.5 billion\nappropriated around the state at least this year.\nAnd obviously we're hoping that continues as well.\nThank you for coming today and presenting this study and God speed you.\nWe have three bills that I think we can get through relatively quickly today.\nI'm going to call Josh Waller up first to talk about Senate Bill 353\nthat I'm actually carrying as the department bill.\nAll three of our bills, this is a little bit of a caveat,\nbut this is the department bill you're about to hear is sent to your redo\nof the department bill that we had last year.\nIt was veto due to something that was added.\nAnd then the second and third bills that we'll hear are also bills were recommitted to the committee.\nSo the subject matter of all three of these bills is something that we have already discussed.\nAs a committee, but certainly you're more than welcome to ask any questions that you have.\nI just wanted to kind of let you know that's why we're seeing these three this quickly.\nAnd wish that Josh welcome.\nThank you, Mr. Chairman. And thank you for carrying the bill. I'll just run through it. Section 1 was a\nRecommendation from Legislative Council just updating the way that they notify you for board elections\nObviously, you're here usually the elections are called during session more effective the email you versus no no out to you so\nSection 2 is a cleanup\nChanging request for proposals to proposal revisions at that point in the process the RFP is already taken place\nSo this was just a cleanup of terms\nSection 3 is a cleanup from when you all adopted alternative contracting methods back in\n2021, clarifies when there's restrictions on when you can do construction manager general\ncontract or procurement.\nThis just cleans that up and here was a point where there was an amendment that we've\ntightened up the language to say it can be waived once every 10 years.\nThe original version had once, there was some confusion as to what is once made as being\none time, one time ever or one time in an instance.\nSo that should hopefully make it absolutely clear that it's once every 10 years.\nSection 4 is just conforming it to changes in federal law in terms of the length of\nthese modular sexual housing units.\nSection 5 was a provision that we would work with different parties on to improve, particularly\nin the metropolitan area where you have a crash on our interstates or limited access road\nwhere you have a fatality.\nBefore that, the crash site can be resolved, you have to have someone on site to declare\nthe individual or individual's deceased.\nSometimes just like any of us,\nif you've got a major crash,\na corner will have the same challenges accessing the site.\nSo what this does is allows for the corner,\nit makes it clear the corner\nand their discretion can designate someone else author\nwho's eligible on site to perform those duties\nfor the corner so that that hopefully allows\nfor the buyer to be then moved,\nthe crash site to be resolved.\nBecause the longer you have that delay,\nthe more challenge you have of secondary crashes\nand other instances will come.\nSo section six is just to clean up to belt suspenders\nto say, look, if in the world we're transportation data\nand different data that are out there,\nmake it absolutely clear that the open records that can't be used\nto get personal data about people and their movements\non our roadway system.\nWith that, and then obviously section seven\nis just the effective language.\nThat concludes section by section.\nAny for any questions?\nChair again.\nThank you. I was curious. I've seen an inordinate amount of these. I think they call them\nflock cameras. I'm not sure what flock stands for, but the that's a company. It's a brand\nname. Okay. They all over the state on state highways, rural parts of the state, urban\nparts of the state, others. The data on those, you're telling me that they're not subject\nopen records. So the department does not operate any of those. This would only be\ndata that the state has. Who operates those and who allowed them to be\ninstalled on right away if the department doesn't operate them. So those are\ndone by a permit local law enforcement. And who's paying for them? The local\nlaw enforcement. And who's if they decide they want to. Or the local government.\nNow I would have to. And if they want to sell that data, the to say, well hey we\nsaw, you know, so and so's tag going about here at this point at this time of day was\nto prevent them from selling that data.\nI would have to, I couldn't speak to that.\nBut it's, you're allowing that on State Highway right away.\nAnd we have a process whereby with local governments we do and local law enforcement, but they\nthey have, but if they want to commercialize that and they, is any of that contemplated in\nthis bill?\nNo.\nThis isn't it.\nLet's stick with the contents of this bill.\nThanks.\nSenator McClure, is that your light?\nCopy.\nAny other questions from the committee?\nSeeing none, what's the will of the committee?\nWe have a motion to do pass from Chairman Napertate, a second from Chairman Beech.\nAny discussion?\nAll those in favor of the motion, please sign up for raising your hand.\nThe motion carries unanimously.\nThank you Josh. Next up is Senate Resolution 158, Senator Anne\nof Attarte. Let you present from there.\nYep, number nine. Thank you, Mr. Chairman. I'll be quick this past unanimously.\nLast year, last session, basically just piggybacking off of Jenny's\npresentation. This is a logistics corridor, basically to study, examine, and\nbring logistics and supply chain jobs to West Georgia.\nI think it was Chairman. Any questions?\nI will start with Chairman Burns first.\nDo you have a question, Senator Lucas?\nI see it is at 20.\nSecond.\nAt 20's involved.\nAll right, no other questions. What's the what's the pleasure of the committee?\nWe have motion to do pass from Senator McClure and\nSecond from Mr. Chairman again. All those in favor any discussion?\nGo ahead\nThe resolution doesn't mention a 16. Is that a motion to amend?\nMr. Chairman, I'm a wave just for a pointed discussion. Appreciate it. I thought the gentleman from the 31st fantastic\nAll those in favor of the motion, please signify buries in your hand.\nMotion carries unanimously.\nCongratulations, this is the center end of a talk to you.\nAnd now, the moment we've all been waiting for, House Bill 524, with freshmen, representative\nRidley-Karian, what I believe is your first bill that was spectacularly overlooked on\nsigning a die but you were here again and you all had a little fun with it last\nyear but like you said it passed out of this committee House Bill 524 just\nsays three-wheeled vehicles that are partially or fully enclosed they don't\nhave to wear a helmet currently all three-wheeled vehicles in the state\nrequire a helmet and I have photos just like last year if you remember showing\nwhat they look like if anyone has any questions can we see those photos\nI recognize Chairman Lucas for a question or sorry Senator Lucas for a question.\nThey are legal on the road and some of them do go 60-70 miles an hour.\nChairman Burns.\nOkay.\nA similar question.\nThese are licensed, insured.\nYes, sir.\nAnd they have a tag.\nThey have a track and national highway transportation meets all safety\nrates. Yes, they made all the safety requirements of any other vehicle in the\nsame way category. Thank you. Representative, when you ran for office, you go\ndoor to door. I did. And when you went door to door and talked about your\nplatform was passing the bill for three wheeled vehicles part of the\npart of your platform. That specifically wasn't, but you know, reducing\nregulations and you know, trying to help people have an easier time out there\nwas part of it. Fantastic. Any other questions from the committee?\nChair again. I'm curious. The tag that goes on this\nis a motorcycle tag or an automobile tag. Automobile tag.\nAnd the three wheeler open style vehicles I see on the road.\nAre those at the slingshots? Select slingshots type vehicle.\nI wouldn't even name a name, but they are they\nautomobiles or they motorcycles. So this is for ones that have a frame\nenclosed like your slingshot they don't have a roof those are motorcycles and\nthose would still require a helmet. Okay. Thank you. I am curious about line 37\nwhere it says to partially or fully enclose the operator what's the scenario\nwhich it would be partially enclosed. Some of them they're like jeeps the doors\ncome off so it's not fully enclosed when the doors are off. Would a slingshot\noperator they'll be able to argue that they are partially enclosed. This is actually\na serious question. Their body is partially enclosed whereas everything above their\nbody is open. Well the argument was partially enclosed and like with the frame\nthere's no frame on top of them. So like in the like I said line 37, a frame\nto partially or fully enclose. When you're not above you I think it'd be a hard\nargument to say you're partially enclosed because you're really just you're\nWe're not in close at all at that point.\nMr. Chairman.\nSenator Mello.\nI'll come to you next, Chairman.\nThank you, Mr. Chairman.\nI just have a question.\nSince we have a little small manufacturing plant coming down\nat 16, will these vehicles be manufactured or created\nsomewhere along at 16?\nSince they can ride on at 16, will we be able to make them\nor how would that work?\nYes, sir.\nThere is a company that sells them out of Savannah already.\nBut what about making them?\nWhere did they make that?\nI'm not exactly sure where they make them, but I know they sell them out of Savannah and they're very popular in the Savannah area.\nOkay.\nChair again.\nMr. Chairman, I'm not sure if my question is for the freshman representative or for our experienced council in the room, but\nI think it could be argued in the courts that, you know, okay, those sling shots or whatever have a frame that partially encloses you.\nAnd in this case, I think if we were going to clarify this, we might want to say, you know,\nthat the frame members go all the way above or around the occupant.\nBecause I could see, you know, on those slingshots, I can see those being partially enclosed.\nI mean, you need to have a frame on that lower portion. What's the difference?\nI'm not the lawyer in the room, but some of them do.\ndo and I understand when you have a roof but if you if you can take the doors off and it doesn't say\nanything about okay it has the frame has to be above the occupant as well and and that's where for\nme I'm just kind of curious okay from a legal standpoint I think what we're doing is we're saying\nthat now a slingshot can make this definition do you want to address that representative argument\nI'm going to make there as we do allow cars on the road today they don't have roofs you know\nno convertibles or top go down.\nSo in that example, the slingshot and a convertible\nwould be the same thing.\nSenator Lawrence.\nMr. Chairman, to Senator Gaines' point,\nmaybe we could drop a little note here for the judiciary\nand have a legislative history moment.\nSo with a pointed question,\nis it the author's intention whatsoever\nthat slingshots would be covered by this bill?\nNo, it's not.\nWell, great, now they know.\nSo, thanks very much.\nThank you, Councillor. Any other questions in the committee? What's the pleasure of the committee?\nWe've got a move to pass from Senator Lucas, second from Senator Malo, any discussion? All\nthose in favor please signify by raising your hand? All those opposed? This motion carries\nsix to two. Thank you, Representative. Thank you, members of the committee for your\ntime today. That completes our business and we're adjourned.\n",
  "updated_at": "2026-02-12T19:39:22.97649+00:00"
}