{
  "video_id": "BFo8DX3u00g",
  "url": "https://www.youtube.com/watch?v=BFo8DX3u00g",
  "title": "02/28/2025 Sen.Merritt Press Conference on Family, and Workforce Justice",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 7,
  "summary": "Overview:\nSenator Nikki Marrett held a press conference to introduce her \"Family and Workforce Justice\" legislative agenda for the 2025 session. The package includes several bills aimed at addressing threats to civil rights, protecting vulnerable populations, and ensuring affordable housing options.\n\nKey Actions:\n**SB 92**: \"Red flag law\" to temporarily remove firearms from those deemed a threat to themselves or others\n**SB 164**: Bans surveillance-based pricing, wage discrimination, and other unfair data-driven practices by corporations\n**SB 165**: Protects children from exploitation on social media platforms\n**SB 166**: Holds corporate landlords accountable for providing safe and high-quality housing\n**SB 167**: Prohibits discrimination in AI-based decision-making systems\n\nBills Introduced (First Reading):\n- SB 92 - \"Red flag law\"\n- SB 164 - Ban on surveillance-based pricing, wage discrimination\n- SB 165 - Protections for children on social media \n- SB 166 - Accountability for corporate landlords\n- SB 167 - Prohibiting AI-based discrimination\n\nNotable Moments:\n- Senator Marrett called for bipartisan support on the legislation, stating \"these solutions are not about red or blue\"\n- She criticized the lack of hearings so far on Democratic bills in the 2025 session\n\nVotes: \nNone detected\n\nAttendance:\nNo quorum notes provided\n\nAdjournment:\nThe press conference concluded, with no specific information on the next legislative session date.",
  "transcript": "All right. Good afternoon, everyone. My name is Senator Nikki Marrett. I represent the\nninth districts for those of you that don't know me, but I think everybody is pretty familiar\nwith district I represent is in Guinnat County, and I live in Grayson. But I am so proud to stand\nhere today with our organizers, our future leaders, and all of our organizers and advocacy groups.\nas we have officially introduced my signature bill package\nfor the 2025 session, and it is the family and workforce\njustice agenda.\nIt includes legislation that will address threats\nto our civil rights brought to us by technologies,\nprotect us in so many areas in our lives,\nand ensure that we can continue to see affordable\nand high quality housing options available for everyone.\nWe start with SB 92, which is the red flag law designed to keep guns away from people who are a threat to themselves and others.\nThrough an innovative judicial order system, we will be able to temporarily require that people deemed to be a threat,\ntemporarily surrender any firearms or ammunition in their possession.\nThe bill is currently assigned to the Judiciary Committee,\nand I've been working diligently with gun safety\nand victim advocacy groups to see that SB 92 receives a hearing.\nNo gun safety bills have received a hearing so far\nin the 25 days that we have been in session.\nThis is unacceptable, and I call on my Republican colleagues\nto join me in passing this common sense solution\nthat will protect our children.\nVictims are domestic violence, and so many more beyond that.\nSB 164 is a groundbreaking bill\nthat has received coverage in the Washington Post.\nIt bans surveillance, base pricing, and wage discrimination.\nCorporations collect data about all of us\nand are using this data to uneven the playing field.\nThey know exactly how much the charge us\nfor the same goods and different services\nthat are charging other people for different amounts.\nThey maximize their profits by determining\nwho they can systemically pay less.\nSystems like this are only as good as the data\nthat is fed into them.\nThe reality is that all economic data is,\nall economic data in Georgia is reflective\nof the centuries of race and gender-based discrimination\nthat has existed in every sector of our economy.\nWhen corporations target people\nwho are in dire economic circumstances\nand pay them less, because they know the worker will take less.\nMore often than not, the worker will be a person of color.\nWill be a woman, or will be a disabled person.\nSB 165 is a bill that will protect our youngest children\nfrom their emerging threat and exploitation\npresented by Social Media Act.\nThat's my next bill, SB 165.\nThe company's professed off creating addictions\nthat alter the brain development of our children.\nAnd it's time that we hold these companies accountable\nfor keeping minors off of their apps.\nThis is another simple solution\nwhere I'm calling for bipartisan support.\nWe have received coverage across many outlets,\nstate-wide and I have heard resounding cries from parents across the state that want this\nlegislation to be heard. The next bill is SB 166. It is my solution to whole corporate\nlandlords accountable for providing high-quality housing in our state. It closes a loophole\nwhere county governments have a much larger time enforcing health and safety codes and\nviolations in our unincorporated areas.\nThat is areas that are not within the city limits.\nAnd it's about 75% of a Gwinnett County.\nIt's time to hold landlords of chronically dangerous\nand uncared properties accountable,\nwhich will protect our renters across the state.\nThe next bill is SB 167, which is the fifth Democratic\nresponsible bill to be heard in committee on Wednesday, and just a note, not many of our democratic bills have been heard as of today, or have moved through the rules to be considered for a vote.\nThis bill takes a basic legal principle that you cannot discriminate against people on the basis that they race, sex, religion, or disability status.\nAnd it extends the concept to AI decision-making systems and algorithms.\nThis is something we have received positive feedback about,\nand we've got positive feedback about it in committee,\nand we're going to continue working on it.\nPeople have no idea how many major decisions\nabout their lives are being made by AI systems,\nloan approvals, job applications,\nemployee management decisions, health care,\nand legal access, and even more.\nWe need to hold these companies accountable\nThe design and deploy of AI programs responsible to ensure that their systems are properly\ntested to avoid bias.\nAnd we need to know when these systems are being used to make decisions that are impacting\nour livelihood.\nWith SB 167, Georgia has the opportunity to be among the first in the country to address\ndiscrimination driven by AI systems and algorithms.\nIt's time to be bold.\nIt's time to be proactive when it comes to addressing our current future challenges.\nOur ability to access good jobs, affordable housing, and to feel safe in public area.\nIt's all upon us to do that.\nAnd lastly, we have one more bill.\nWe're about to submit today into the hopper.\nI have a few signatures.\nThis bill will ban algorithmic, rent fixing, sorry, that was a hard word to say, which\nis when corporate landlords use software to collude and gouge our rental market for\nmaximum gain. The cost of housing is out of control in Georgia and this is my solution\nto address the rental side of our housing market. This is often neglected when the conversation\nrevolves around the cost of purchasing homes. The family and workforce justice agenda\nthat does not end with signing die this year.\nWhichever of these bills does not receive a hearing this year,\nwe will continue to advocate for these policies\nin our bills next year,\nbecause this change is desperately needed.\nIt's time for the Senate to take real action\nto help people in Georgia, not insurance companies,\nand it's time to make housing affordable,\nensure our rights are protected in the digital age.\nI call on my colleagues to join me in fighting\nfor this legislation, all of these pieces of legislation.\nThese solutions are not about red or blue.\nThese are solutions that are about protecting everyone.\nI want to thank you all for coming today\nto learn more about this legislation.\nAnd with that, I will take questions.\nQuestion.\nOK.\nAll right.\nGreat.\nNo questions.\nThank you all for joining me today.\nAnd thank you for listening.\nThank you very much.\n",
  "updated_at": "2026-02-12T19:00:44.307895+00:00"
}