{
  "video_id": "biLtmnJ5Bs4",
  "url": "https://youtu.be/biLtmnJ5Bs4?t=1248",
  "title": "Georgia House - Day 1 (2026-11-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": "2026-11-29",
  "duration_minutes": 77,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-11-29:\n\n## Overview\nThe session included the opening of a special session called by the Governor, with a focus on redistricting and other legislative priorities. There was a poignant moment honoring a retired Georgia Power employee who crafted the gavel used in the session.\n\n## Key Actions\n**HR 2**: Redistricting of Georgia State Senate districts\n**HR 1**: Redistricting of Georgia State House of Representatives districts\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Reverend Mac Jackson, a state representative, delivered the opening prayer and was recognized for his service to his community. \n- The Speaker honored Ronnie Just, a retired Georgia Power employee, who crafted the gavel used in the session. Ronnie's mother had recently passed away, and the Speaker led a moment of remembrance.\n\n## Votes\nAll votes were unanimous with no recorded opposition.\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session adjourned. The next session date was not provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\n.\n.\n.\n.\nYou\nYou\nYou\nYou\nYou\nYou\nLet's do it, man.\nWatch your ears, guys.\nReady to go?\nGood morning.\nAre you ready to get to work?\nWe don't get started, we'll never finish.\nBefore I give you the official script here, I want to let you know, you just heard the first\nstrike of a gavel that came from a live oak from Sweetheart Circle near the Georgia Southern\nUniversity.\nNow I was going to do this a little bit later, but since I have the microphone on, I'm\ngoing to do it now.\nA dear friend of mine, Ronnie Just, who was employee in, is retired from Georgia Power,\nis an expert woodworker, a craftsman recognized foreign-wide for his detail in his woodwork.\nNow yesterday, Ronnie presented this gavel and this strike plate, made from a fallen\nlimb on one of those beautiful live oaks down in the statesboro.\nHe's also a Georgia Southern alumnus and a good, good man on top of that.\nWhat makes it so special was that Ronnie just, his mother, is in hospice, wasn't hospice.\nRonnie chose to come and be a special friend to me and Dale and to this body and the respects\nthat he has for all of us for this Georgia house.\nHe came to this capital yesterday around lunchtime, instead of going to be with his mother\ndown and about us. While he was here and his family was with his mother and his mother\nside, his mother passed. So I will ask all of you, if you will, for the life and the lives\nof great Georgians will and we will further this conversation shortly. But if you will, remember\nthose that care so much about us and about care about this institution we serve in, you\nwill bow with me just for a moment. Amen. Thank y'all. My\ncolleagues Ronnie just is proud. He's a great son of Georgia as we all are\ngreat sons and daughters of this state. The hour for convenient having arrived\nall members will please take seats. Mr. Clerk will you please ring the bell.\nWe're going to have the morning road call so we can all weigh in and after Thanksgiving\nI'm sure we're all weighing in a little bit on the heavy side at least I am but all members\npresent will please vote green to signify their presence in this chamber.\nThe clerk will unlock the machine.\nhave all members now voted have all members voted if so the clerk will lock the machines\ngreat when technology works, isn't it? No doubt. Mr. Clark, will you read the\nproclamation from the governor calling for this special session? A proclamation\nconvening the General Assembly of Georgia and Special Session, whereas Georgia\nConstitution article five section two paragraph seven grants the governor\nthe power to convene a special session of the General Assembly, stating in thereby\neliminating its purposes.\nWhereas the regular session of the 2023 General Assembly adjourned signing die on the morning\nof March 30th at 2023, and whereas the governor has determined that certain purposes warrant\nthe convocation of a special session.\nNow therefore, by virtue of the power and authority conferred upon me by the Constitution of Georgia,\nI, Brian P. Kemp, Governor of the State of Georgia, do hereby convene the General Assembly\nof this state and special session on Wednesday, November 29, 2023, for the purposes and only\nthose purposes specified as follows.\nNumber one, for enacting revising repealing or amending general law for a, the division\nof the state into appropriate districts, from which members of the Georgia State Senate\nthat shall be elected be the division of the state into appropriate districts from which\nmembers of the Georgia State House of Representatives shall be elected and see the division of\nthe state into appropriate districts from which members of the House of Representatives\nto the United States Congress shall be elected.\nNumber two, for enacting revising repealing or remending local laws which the General\nAssembly deems necessary to avoid unreasonable hardship or to avoid undue impairment of public\nfunctions, if consideration and enactment thereof, are postponed.\nNumber three, to ratify the provisions, the Executive Order dated September 12, 2023,\nin October 6, 2023, and numbered 9, 12, 23, 01, and 10, 6, 23, 01, respectively, in\nthe official records of the Office of the Governor, suspending the collection of\nthe motor fuel and diesel fuel taxes pursuant to code section 45, 12, 22 during the state\nof emergency for inflation declared by executive order 9, 12, 23, 0, 1.\nNumber four for the Senate to consider and confirm various appointments made by the governor\nsince the adjournment of the regular session of the General Assembly on March 30, 2023.\nunder my hand and the great seal of the State of Georgia on the 26th day of\nOctober 2023 Ryan Kemp Governor the call of the governor for this special\nsession is why we're here we will move on with our business of this day thank\nyou mr. Clerk doorkeepers will you please close the doors and keep them closed as\nAs is our custom rule, begin our day with Scripture reading and prayer by our\nchaplain, after which we will pledge allegiance to the flag of our great country.\nNow it's my great honor to introduce our chaplain of the day, one of our\ncolleagues. A gentleman that's opened, I think we talked about maybe five times,\ntimes, with the opening day chaplain about five times, at least, over the years.\nOne of the things that, when I always think about Mac Jackson, you know, when you look at\nsomeone and you think about whom they are and what they're about, I always think about\nthe surprise that must have been on Mac Jackson's face.\nWhen down in Tenel, Georgia, he started his Sunday morning services and he thought he\nHe'd done something wrong on Saturday night evidently because he was a little nervous\nwhen he saw those state patrol cars and that black suburban pull up out front.\nHe thought he was getting picked up, I guess.\nBut the speaker of this house, David Rolston, had unexpectedly and a little bit of a surprise\nI would say, attended Reverend Jackson's Sunday Morning Service.\nSo Mack, I know that was something that's been on your heart and on your mind over the\nyears and certainly a great day for your congregation.\nYou know, Mac, Chairman Jackson, leads a congregation down in\ntown, he along with his wife Valerie, at St. James Christian\nFellowship, Lord's House.\nThat right?\nThat's what I thought.\nYou know, Mac, I know in his community, as I've spoken to many\nof the folks that he represents from middle Georgia,\nrespect Mac as a legislator.\nThey also respect Max as a man of God, who works extremely well and extremely often in\nall parts of his community, ensuring that he represents his congregation, represents\nhis constituents, and he represents his congregation in the Lord's house.\nNow when he puts on his other jacket, he comes to this place.\nAnd he is a friend to every one in this chamber, is respected by each member of this chamber.\nAnd I would say he's loved as a member of this family by assault.\nSo he is a man of God who serves in the Lord's house, is also a man of the people who serves\nin the people's house.\nI would tell you the first is more important,\nthe man of God who serves his people in the Lord's house.\nWith no further ado, my friend,\nman of the people, a man of God, Reverend Mac Jackson.\nThank you, Mr. Speaker.\nA good morning to everyone,\nand welcome to another special session.\nI'm just going to be sure here I was reading last night in the book of Genesis, chapter 37.\nAnd we find there that Joseph dreamed of dreams, and he told his dream to his brothers,\nbut instead of being happy for him, it says that they hated him.\nThen he dreamed another dream and still they envied him, so they conspired against him\nand put him in a pit.\nBut then Judah said, let's sell him to the Ishmaelites and make some profit off him.\nAnd as we follow the story, the Ishmaelites sold Joseph to a man named Potifer in Egypt.\nIn the Genesis chapter 39 verse 2 it says, and the Lord was with Joseph, and his master\nsaw that the Lord was with him.\nAnd the Lord blessed the Egyptians' house for Joseph's seed.\nSo Mr. Potterford had a problem in his house, and it was Mrs. Potterford.\nBut she had her eyes on Joseph.\nBut Joseph refused her several times for he said, you are his wife.\nHow then can I do this great wickedness and sin against God?\nYou see, Joseph had his mind stayed on God through all his ordeals.\nBut one day, Mrs. Potterford called Joseph alone.\nAnd Mr. Potter was off traveling, but he ran out of his coat, but she lied on him and\nMr. Potter for cast him into prison.\nBut in verse 21 of chapter 39 it says, but the Lord was with Joseph and showed him mercy\nand gave him favor.\nAnd there he met the Butler, he met the baker who both had dreams that Joseph interpreted\nfor both of them.\nAnd when Pharaoh had a dream, the chief butler remembered Joseph.\nSo Joseph interprets Pharaoh's dream and gives him a plan to save the nation of Egypt.\nPharaoh made Joseph ruler over all the land of Egypt, even his brothers had to come to\nhim to buy.\nThey had fear because of what they had done to Joseph.\nNow, can you imagine what was happening in Mr. Potterford's house when they were sitting\naround the breakfast table.\nThey were reading the Egyptian journal in Constitution.\nAnd that was Lil Joe as Prime Minister of Egypt.\nNow I don't know about you,\nbut I would have wanted to choke Mrs. Potterford\nif I had been Mr. Potterford,\nbecause now they have to honor Joseph\nas the Prime Minister of Egypt.\nSo his brothers come to him\nand in Genesis chapter 50 verse 10,\nJoseph said, fear not for M.I. in the place of God.\nThey thought that Joseph was going to try and do something back to them because of what they\nhad done to him. But Joseph realized that in order to walk with God, you can't do people like\nthey do you. He had to forgive them despite of. He says, but as for you, you thought evil against\nme, but God minute unto good. You see, if you're just hold your peace, God will take care of you,\nand God will fight your battle because I read what Paul said all things worked together\nfor the good of them who are called according to his purpose and love the Lord.\nSo if you learn to hold your peace, despite what's going on all around you,\ndespite what people say about you, you hold your peace and let the Lord fight your battles,\nThe Bible says, love your enemies.\nPray for those who, despitefully, use you.\nBecause unforgiveness is like you drinking poison\nand hoping the other fellow will die.\nIt will never happen.\nShall we pray?\nAmen.\nAmen.\nAmen.\nFather, in the name of Jesus,\nas we come together to do the work of the people's house,\nwe thank you for your guidance,\nwe thank you for your wisdom,\nWe thank you for the leading of the Holy Spirit, Father.\nHonor everything that we do here, Father.\nLet it be said by the people of the state of Georgia\nthat they honor you first of all,\nas Joseph, honor you, Lord.\nAnd be with us, Lord, and give us the wisdom that we need, Father.\nAnd we'll be sure and give you all the praise on in the glory\nfor it's in Jesus' name that we pray, amen.\nWould you join me in the pledge of allegiance?\nThe gentleman from the 128th House District has just delivered a message and we all will\ntake to heart.\nThank you, Mac.\nThank you.\nAppreciate it.\nThank you.\nCome see me, sir.\nThank you.\nDoorkeepers, you may open the doors, unlock the doors, open the doors, open the doors,\nDoorkeepers, you may open the doors, unlock the doors,\nlet the action begin.\nWe have a doctor of the day who is down in the clinic, I think at this point in time.\nOur doctor of the day resides in Representative Sheila Jones' district.\nKelly DeGraphenread is down awaiting you to come by and visit with her, and I'll\nencourage you. If you don't feel well, certainly go visit our doctor, but more\nimportantly, go by and visit our doctor and express to her your appreciation for\nher being here today.\nThe clerk will now read the resolution establishing the order of business for the day.\nRepresentative of the administration of the 104th minutes following me establishes the\norder of business to earn the first part of the period unanimous consensus, introduction\nof bills and resolutions, first reading and reference of house bills and resolutions,\norders. Is there any objection to the adoption of the resolution establishing the order of\nbusiness for the day? Chair, here's none and the resolution is adopted.\nMr. Clerk, will you read a series of resolutions?\nHouse Resolution No. 1 EX, by frustration of the 104th, to notify the Senate and the House of Representatives has convened.\nHouse Resolution No. 2 EX, a resolution or represent of frustration of the 104th relative to meetings and\nadjournments of the General Assembly and for other purposes.\nWe need to adopt our opening day resolutions, so at this time we will take up House resolution\n1EX, notifying the Senate that the House of Representatives has convened.\nThe chair now recognizes a gentleman from the 104th House District, the majority of\nthis House, Representative Estration, Representative Estration.\nThank you Mr. Speaker. So ladies and gentlemen of the House as we do every time we convene for a legislative session\nWe have a first resolution\nWhich is up on the screen for you here. It's HR one EX and this simply notifies the state Senate that the House of Representatives has\nconvened and is ready to transact business for this special session would ask for your favorable support of the resolution. Thank you\nIs there any objection to the adopting of the resolution chair here's none the resolution is adopted\nChair will now recognize the majority leader I think\nThis leader yes, sir, I think you'll need to go back here to your desk for the motion\nFor what purposes representative aestration rise make a motion state your motion mr. Speaker\nI move that the house immediately transmit house\nResolution one eX to the Senate speaker a straight or majority leader astration\nSound pretty good didn't\nSome days it sounds better than what you think so I've moved that\nthat, H, what is that, House Resolution, HR1X, be immediately transmitted to the Senate\nso we can get them busy on that side.\nIs there objection?\nHere none is ordered.\nMr. Clerk, if you'll read Resolution 2EX.\nThe House Resolution No. 2 EX by Representative Astration of the Hunter IV, relative to meetings and adjournments of the General Assembly.\nThe gentleman from the 104th Majority Leader, the House Representative Astration, is recognized to present the resolution.\nThank you Ms. Speaker. This is House Resolution 2EX, which is up for you on the screen.\nAnd this is several pages, so we'll just go through each of the pages.\nBut this is our standard adjournment resolution when we begin a new session.\nSo what you'll see here is this has us in session for today through this Friday,\nday, close a business this Friday, and then we will adjourn until Monday.\nSo we will not be in session on Saturday and Sunday.\nI understand there's a football game occurring on Saturday, just down the road in Atlanta.\nSome of us will be watching, but we will be at a session Saturday and Sunday, and we'll\nresume on Monday next week.\nThere's also just standard language,\nwhich is included in all of our German resolutions\nfor if some unforeseen or emergency situation\nwere to come about.\nWould ask for your favorable consideration.\nAnd if, while I'm up here, Mr. Speaker,\nif the clerk would just go all the way down to,\nor flip now to page two.\nThank you.\nIf you'd go down from there to line 38.\nAnd then flip to page three please.\nVery good.\nAppreciate your favorable consideration of our German resolution for this special session.\nThank you, Mr. Speaker.\nI have a question.\nWho's playing in that football game, by the way?\nthe defending two-time national champions, the Georgia Bulldogs, Go Dogs, and some other\nteam from our West.\nI'm not sure who they are, but I'm sure the dogs will take care of business, Mr. Speaker.\nI think you're right.\nI hope you're right.\nI know that team from the West is a nemesis, so good luck to the Georgia Bulldogs.\nIs there any objection to the adoption of this resolution for our adjournment so we\nWe can have an orderly session here.\nChair, here's none.\nThe resolution is adopted.\nFor what purpose does the majority leader rise?\nMake a motion.\nState your motion.\nMove that House Resolution 2EX\nbe immediately transmitted to the Senate.\nMajority leader of the illustrations\nmove that HR 2EX be immediately transmitted\nto the Senate is the objection here and none is so ordered.\nMr. Clerk, we'll now have first reading of bills and resolutions.\nThe clerk will read.\nHouse bill number one, EX, by representative lever to the 123rd of being titled and act to\nprovide for the composition and number of state house districts and to provide for a short\ntitle.\nRear portion and redistricting.\nA numbered house bill by representative person to the 119th and others to be entitled\nan act to amend the act providing authority for members of the Board of Education of Barrow\nCounty or\nIt's a number.\nIt's an intergovernment court needs to be there.\nIt's an intergovernment court.\nIt's an intergovernment court.\nEnter governmental coordination.\nUnnumbered House Bill by Reps.\nStephen Slytherin, 64th B. Toddl, an act to amend an act providing for the creation of\none or more community improvement districts in Chatham County and an H. Municipality there\nin.\nAndrew governmental coordination on numbered house bill by representative Stevens on 64th B. Todd on act to amend the act creating a new charter for the city of garden city approved April 17th 1973\nAndrew governmental coordination house resolution number three EX ratifying governor Brian Kemp's executive order numbers nine twelve twenty three oh one ten oh six twenty three oh one and eleven eight twenty three oh one\nsuspending the collection of motor fuel in diesel taxes.\nWays and means.\nHouse resolution number four, EX by reps of Cox, the 28th, condemning Hamas terrorism.\nRules.\nResolution five, EX, resolution by reps of Cox, the 28th, condemning Hamas terrorism and expressing our support for the Jewish people.\nrules. That completes First Readers.\nMy colleagues, we're going to move on to morning orders now,\nso I will ask everyone, everyone to take their seats. We have\ntwo special morning orders this morning.\nPlease take your seats.\nAll members, please come from the any room and take your seats.\nPlease.\nAll members.\nSomeone communicate with the members in any room, they need to be in the chamber now.\nThank you.\nWe have two very important morning orders this morning.\nOur state, our country in this world lost a beautiful soul.\nYou'll stand.\nAnd we want to make sure that this house, the people's house,\nhonors one of our most noble citizens, Rosalind Carter.\nthe day she travels back home to be laid to rest, then the fertile ground of South Georgia.\nMr. Clerk, we have two members that are going to speak to this resolution.\nAnd I want to ask the members if you'll stay at your seats. I know everyone would like to\njoin the members up front, but if you remain at your seats standing, I think that it will\nbe the most respectful, dignified positions we can be in as we hear these two\nmorning orders. With that, Mr. Clerk, will you read the caption to this resolution?\nUnnumbered House resolution by Representative Burns, 159th and others.\nHonoring the life and memory of Mrs. Rosalind Carter.\nChair will now recognize two of our members, Chairman Chokas, who represented the quarters\nand has represented the quarters his time here in the General Assembly.\nAnd Representative Debbie Butler, a friend of the quarters, a friend of Mrs. Carter,\nDebbie, excuse me, Representative Butler.\nIf you will come speak first and represent the Chocos, if you will join her as well.\nRepresentative Buckner, you are recognized.\nThank you, Mr. Speaker, leader Beverly and House colleagues.\nalways honor and a privilege to remember someone but to remember someone as special as Mrs. Carter.\nIt's just an awesome privilege and responsibility and I'm grateful for it.\nMrs. Carter was warm and welcoming, wise and witty and whenever I had the opportunity to be in\nher presence I felt like it was a Christmas gift. It was just I always learned something and I always\nin joy being in her presence.\nIt's impressive to me that the New York Times of all places,\nin a way, talked about in their article\nthat she journeyed from the small town of rural Georgia\nto the majesty of the White House from campaign trails\nin Iowa to New Hampshire to refugee camps in Asia\nto impoverished villages in Africa.\nAnd that did sum up a large part of her life.\nHer quest for education and adventure\nseemed to never diminish.\nAnd she carried it with her wherever she went.\nAnd even as she traveled to 122 countries\nand learned to ski when she was in her 60s\nand fished for trout in Siberia and climbed\nKelly Manjaro, those were adventures that she used to not only tell her grandchildren\nabout and to maybe brag a little bit about, but she also challenged the rest of us to\ncontinue to be continuous learners and to be adventures.\nBest known as an advocate on mental health, that began right here in our great state of\nGeorgia. As the first lady of Georgia, she was very intimately involved with, get this,\nthis super long, the governor's commission to improve services for mentally and emotionally\nhandicapped. Georgia was one of the first and we needed to do this very much to shift\nsome of our mental health, public mental health, from being too much in an institutional setting\ninto a community-based one, and she was at the root of that with many other advocates\nand health care providers.\nOne of the things that I thought was very impressive over the last few days since she\npassed away were some of the remarkable comments made by some of our own, and one of the most\namazing advocate herself and and legislator is representative Mary Margaret Oliver and\nshe her quote that I think just summed up so much of Miss Carter's was she never stepped\naway from her commitment to mental health reform and her often repeated message that stigma\nwas the biggest barrier to helping people get well.\nShe was with Mrs. Carter many times and admired how gracious she was and how committed she\nwas to every call she addressed.\nAs the first lady, she was the first one to carry a briefcase and have an office in the\nEast Wing of the White House.\nShe continued her fights for mental health and she also worked on things like the Equal\nrights amendment and pushed as a strong advocate for the appointment of women to the administration\nand to federal judgeships.\nIn the words of another one of our House members, Representative Lisa Campbell said she was a gracious\nleader determined to do everything she could to give a voice to women, to children, the\nelderly and those in need. Her deep commitment to mental health changed the world's views\nabout mental illness, paving the way for expanded care and parity, and she taught us how\nto help ourselves help others and uplift the value of caregiving.\nIn 2006, I was serving as the chair of the West Central Georgia Cancer Coalition. Columbus\nThis area didn't have a worst cancer incident rate.\nWe had a worst cancer death rate, and we were selected to put the coalition together.\nAnd as one of our outreach programs, we decided that we would use some of the teachings\nwe had gathered from going to America's to the Caregivers Center, named from Mrs. Carter.\nAnd we won a National Award for establishing the Caring for Caregivers Program in the\nrealm of cancer treatment. Little did I know when the executive director and I flew to\nNew Brunswick, New Jersey, which I had never heard of and it was 50 below up there that\nday. And I didn't have near enough clothes to be warm until I got inside the room and\nthere was Miss Carter. Former First Lady Rosalind Carter was so excited that Columbus area,\nthe West Central Georgia area, which included Sumter County and America and all of the counties\non that side of the state had won the National Award and she was there to give it to us.\nThat was a special treat, but what was more amazing to me is how she took us under\nher wing and we went around the reception and she introduced us to people there.\nLike we were her children and she was proud of us.\nI never will forget how special that was and how that showed to me great, great leadership.\nIn the words of Stan Jones, many of you know and he's worked very hard on mental health\nfor many years, he said that because of her efforts, community-based services, supportive\nhousing, peer support, school-based mental health programs have been established and because\nof all of those efforts, it is now acceptable to talk about mental illness.\nShe helped us realize we are all touched by difficult conditions in ourselves and our\nfamilies, and she has been a humane, innovative, fearless leader.\nSo as we start on the next 50 years of her great legacy, we need to realize she's done\nGeorgia proud. And she's made America great. I yield. Thank you. Chairman Chowkis, you're\nrecognized. Thank you, Mr. Speaker, and thank you, Debbie, for those kind words. This\nThis is a tribute for Rosalind Smith Carter and it's dedicated to President Jimmy Carter,\nJack Carter, Chip Carter, Chef Carter, and Amy Carter.\nMrs. Carter was a daughter, a wife, a mother, a grandmother, trusted advisor, advocate,\npeacemaker, builder of hope, an inspiration to many around the world, a child of God,\nand the glue that held her family together.\nIn her years in the White House, she was an active and trusted advisor to a husband and\npresent Jimmy Carter.\nIn the years following the White House, she co-founded the Carter Center and worked to relieve\nthe suffering of many poor and forgotten peoples around the world.\nShe did this based on her Christian teachings of service above self.\nNever seeking a claim, simply doing what was right.\nFighting disease, waging peace, building hope.\nAt the White House and later at the Carter Center, she fought to establish the fact that\nmental illness was treatable, allowing for those with mental illness to live productive\nand rewarding lives.\nShe advocated that mental illness and physical illness should be treated equally.\nAnd I am very proud of the great strides the Georgia House of Representatives has made\nin this area.\nShe also founded the Rosalind Carter Institute for Caregiving at Georgia Southwestern State\nUniversity.\nHaving recognized the contribution that caregivers give every day and the need to provide\na resource for support, advocacy, education, and training, she worked diligently on behalf\nof caregivers, both lay and professional,\nto give them the recognition they deserved.\nI am also very proud to serve as co-chair\nto the Rosalind Carter Institute for Caregiving,\nan organization that I've been involved with for over 20 years.\nMrs. Carter would say there are only four kinds\nof people in this world.\nThose who have been caregivers, those who are currently caregivers, those who will be\ncaregivers, and those who will need caregivers.\nMay her memory be eternal.\nThank you and God bless the Carter family.\nThank you, Mr. Speaker.\nto both of you for those remembrances, and we will have a moment of silence in just\nfor a second, but I want to make sure we recognize the loss of President Jimmy Carter in his\nlife, and that we all recognize and say a special prayer for him as he goes through these\ndays and the loss of a marvelous person who was his partner in every sense of that word.\nAnd I'll also just add, I can't add much of this, but as I think about the legacy we\nall seek to leave, that legacy is enhanced in bold and by how we love our families, how\nwe love our communities, and we love those around us.\nShe certainly was an example, a true positive example how we should all do just that.\nAnd I know her life strengthens me to make mine better, as I try to emulate what she\nstood for and what she practiced, not only preached, but what she practiced.\nThank you, Debbie.\nThank you, Mike, for those remarks and those remembrances that are all bound for a moment\nof silence, if you will.\nyou Lord for this wonderful person. Amen.\nThank you members for your attention for this wonderful lady.\nWe do not have any privilege resolutions, but we do have a couple of announcements as we\nmove on with the witness of this day.\nWe are now recognized as Chairman Corbett for an announcement.\nChairman Corbett.\nThank you, Mr. Speaker.\nMembers of the House, the rule caucus will be meeting\nover in the Ag Building at 12 o'clock.\nThe Georgia Veterinary Medical Association,\nwe've put on a program for,\nso everybody, welcome, come join us, thank you.\nIs that lunch, is that just listening?\nlaunch launch launch will be served 12 o'clock all right just want to make\nsure I wasn't going to get in that trouble there much better crowd when you\nhave lunch down about that representative Cox I think we'll recognize you for\nannouncement. Thank you, Mr. Speaker. The Georgia Israel Legislative Caucus\ntoday at 1230 in room 216. The Israel Consul General will be here and will be\nhaving a lunch and learn with Arab Muslims from the Middle East that will be\ndiscussing the Israel Amos War. So we'd like for any of you to be there and\nAppreciate that support. Thank you. Thank you. Chair Lady Cooper, I thank you\nhaving an announcement, don't you? An important announcement. It is sir, thank you very\nminute much. I'm probably most of you have heard that giving to charitable\ninstitutions is down across our state and across our nation. But and so I would\nencourage you to find some charity that you can support and do so in these times when\nthey are having hard financial times and the need is great.\nBut there's one that's very important because it actually means the difference and can\nmean the difference between life and death.\nAnd that means the need for blood.\nAnd I have a friend with me.\nThis is a little symbol of the blood donation group that's outside.\nThe mobile is there, they will be there until five o'clock.\nNow I would encourage every one of you to go and give blood unless you have some illness\nor some reason that you can't.\nBut I want to issue a challenge.\nThey tell me that even in these times when there's such a need that men sort of are really\nresistant to going.\nNow, I serve in this chamber, and every man in here has run for public office.\nIf you have run for public office, you are not a wimp.\nSo I would encourage the men in this chamber to go out and give blood and show that group\nthat we have a group of men that are macho and not whims.\nSo please, it's open until 5 o'clock today, they will be very kind to you and it takes\nabout 30 to 40 minutes, so please go and donate.\nThank you, and thank you, Mr. Speaker.\nI didn't know you were going to challenge our manhood.\nI can just tell you that.\nNever let you up there if I know that.\nWell, Mr. Speaker, it's really important\nbecause every person that donates is\nblood for three individuals.\nYou have a chance to save the life of three different individuals\nand we're going into the holidays\nwhen the car wrecks increase and the need is even greater.\nThank you, Mr. Speaker.\nWell, I'm going to take up the challenge if Representative Allen\nwill come hold my hand.\nThe doctor will hold my hand while I do it.\nI'm headed down since we're adjourned,\nso we're getting to that point.\nSo I encourage all of us, what a great mission\nto get blood and the lives it says.\nAnd I know many of you in here, if not,\nWe as individuals, but our families have had the need for a blood over the years.\nSo let's go down and put a little blood in the bank.\nOkay, let's do that if you can.\nRepresentative Kelly, recognize for an announcement.\nThank you, Mr. Speaker.\nAt 2 o'clock in Capitol 403, the House Bill 300 working group and energy utilities and\ntelecommunications will meet those members who are on the working grid.\nWe certainly like you there as well as any other members of the committee who have an interest.\nThank you, Mr. Speaker.\nAll right, listen up.\nYou may want to pay attention to the location of this next one.\nChairman Leveret has recognized for an announcement.\nThank you, Mr. Speaker.\nI appreciate you letting me go after the last presentation about WIMPs in the General Assembly.\nWe will have a meeting of the reapportionment and redistricting committee at one o'clock\nin room 406.\nWe're going to move to 506 the rest of the week, but today it's in 406, it will be a public\nhearing.\nWe'll approve our rules and guidelines, but then we will not actually take action on the\nproposed maps.\nWe will just hear public comment on them and I will be presenting them to the assembled\ngroup there.\nSo just want to make sure everyone's aware if you would like to come address the committee\nwould like to hear from you.\nAnd if any of you out there have any spare flight jackets,\nplease meet me down here at the later in the afternoon.\nWhat time and what room again?\nRoom 406 CLOB.\nI left that out at one o'clock over over there.\nAnd at six o'clock is the lot of time we've allowed.\nSo can many members, you know,\nbe, be, steal yourselves for along me?\nThank you, Mr. Chairman.\nWe have, that concludes our announcements.\nWe have no birthdays, no ones any older, so that's awesome.\nNo birthdays, so with that, the majority leader is recognized for a motion.\nMr. Speaker, I move that this house stand adjourned until 10 a.m.\non Thursday, November 30, 2023.\nOn the motion, excuse me.\nYou\nsurprise we're waiting on the Senate. Is that ever happened before? So, Mr.\nLeader, would you mind restating your motion? Yes, sir. I move that this house\nstand in recess until we receive notification that the Senate is in business and\nthat we notify the governor and after that is received that this house stand\nadjourned until tomorrow, Thursday, November 30, 2023 at 10 a.m.\nOn the motion of the majority leader, this House will stand in recess until we receive\nall the notifications back from the Senate when they decide to go to work and we get those\nnotifications back that we can notify the governor of the General Assembly's willingness\nto take up the business of this session.\nSo with that, we will also need to appoint from this House a committee of notification\nthat will go down to the second floor and let Governor Camp know that we're here.\nSo I'm going to appoint that committee and let you know who they are now before we adjourn\nbefore we stand and recess.\nWe're going to appoint the gentleman from the 26th,\nGovernor's Florida Lauren McDonnell,\nalmost did it, McDonnell.\nThe gentleman from the 15th,\nRepresentative Matthew Gamble,\nGovernor's Florida leader,\nthe gentleman from the 9th,\nRepresentative Will Wade,\nGovernor's Florida leader,\nthe lady from the 103rd district,\nRepresentative Suhong,\nGovernor's Florida leader,\nand the gentleman from the 133rd district,\nRepresentative Ken Vance,\nThe gentleman from the 134th District,\nChairman David Knight,\nand the lady from the 135th House District,\nChairman Beth Camp.\nThey will take care of delivering the motion\nwhen we get all of that information back from the Senate.\nSo here's our posture. We will stand in recess and then we will adjourn and\nsoon as we take care of this lagging business that we'll get from the\nSenate and then we'll be adjourned and we will come back in tomorrow November\nthe 30th at 10 a.m. 10 a.m. Okay, that's where we are. So we need to get some\nconfirmation from all of you. All those in favor will say aye. That sounded good.\nAll those opposed will say no. I'm not sure about the eyes have it. We'll adjourn\nuntil tomorrow after we stand and recess at 10 a.m. on Thursday. November the\n30th. Thank you.\nYou\n",
  "updated_at": "2026-02-12T12:33:31.130901+00:00"
}