{
  "video_id": "Bj_QpwwtU78",
  "url": "https://youtu.be/Bj_QpwwtU78",
  "title": "Georgia House - Day 19 (2026-02-18)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 19,
  "video_date": "2026-02-18",
  "duration_minutes": 106,
  "summary": "Here is a summary of the Georgia House session transcript from 2026-02-18:\n\n**Overview**\nThe session featured a prayer and scripture reading by the chaplain, followed by a humorous anecdote and a lesson on the parable of the sower. No specific legislation was discussed.\n\n**Notable Moments**\n- Pastor Bud Womack delivered the opening prayer and provided a humorous anecdote about a neighbor delivering groceries. \n- Pastor Womack then discussed the parable of the sower, emphasizing that it is the job of the \"farmer\" (pastor/legislator) to simply plant the \"seed\" (message/legislation) and let God handle the results, rather than trying to control where the seed falls.\n\n**Attendance**\nThe session began with a roll call to establish a quorum.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "The hour of convening having arrived all members will please report to their assigned seats and take their seats. All members will report to the House of Representatives, the clerk will ring the bell. All members will please take your seats. We are going to have the morning roll call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Chairman Dubnik, would you vote Chairman Chokus present please? Have all members voted? Have all members now voted? All right. We're going to lock the machines. More keepers will please close the doors and keep them closed. Well good morning. Welcome to legislative day 19. We will begin our day as we do each day with scripture reading and prayer by the chaplain. After which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 138th House District Chairman Mike Chokus. Thank you, Mr. Speaker. Well good morning, everyone. It is indeed a pleasure for me to bring back to this House Pastor Bud Womack. He is the pastor of the live point church in America, Georgia. He's been there for 22 years. He's also the chaplain for the Sumter County Sheriff's Department. I've gotten to know Pastor Bud through a number of different things that has happened in our lives. Probably this past year with the pandemic and the challenges that we've been facing, riots, defending the police, all type of things that came to mind. When you have these challenges, I felt the need to appeal to a higher authority. I called my wife. She said that was even beyond her capabilities and said for me to call Pastor Bud. Today it is my honor to bring Pastor Bud to share his message with the people's house. Thank you. Give me first say thank you to Representative Chokus and to Speaker Ralston for allowing me to be here today and thank you for what you do and the business you conduct for the great state of Georgia. I do have a couple of shout outs that I want to give. Of course my wife is here. She allowed me to be here. I've got the same kind of conduct from mine that Mike has with his. But my $2, Katelyn Keltz, my son-in-law Earl, their workers, our educators, and they're working today. Our youngest one is in class right now getting ready to be an educator. And there's two other young men that I really want to do a special shout out to and two young men that are very close to me that really bring a different perspective in life and ministry for me. And that's Nathan Mathis and Josh Masters back home there able to see this. And so a great young man and just wanted to give a little shout out to them. I'd like to start out with a little humor this morning. Because I always do most of the time in my pulpit I do. And the Bible says that laughter does good like a medicine. So everybody ought to leave here feeling really good today. It was a devoted Christian woman that always prayed every day. She prayed out loud. She would begin to shout in her house and every day when she did that the windows were open. Her next door neighbor was not as convinced that he needed to be a believer and so dogmatic about her religion or his religion as she was. And so he always fussed about her praying and shouting and having a good time with gospel music playing. One particular day this woman was in her room and she was praying and she was talking to God and she said God I need some groceries the refrigerator's bear the cupboard's bear. I need some groceries. I believe you're going to see me some groceries and she got excited and started shouting again. And the guy had about it had about all he could stand. So he went to the grocery store about two full bags of groceries come back to her house knocked on the door. She answered the door and he shoved two bags of groceries in her arms. He said there's your groceries now stop it. Well all of a sudden this woman just laid the groceries down and she started shouting and dancing and praising the Lord all over the porch. He said lady what's the matter with you? What's the matter with you? God didn't give you these groceries. I brought these groceries. Why are you shouting? She said not only did God provide me groceries he made the devil deliver them. It's got nothing to do with what I'm prepared to say this morning but I thought it was humorous. You know throughout the ministry of Jesus he dealt with people and he spoke to people on the level of parables and a parable is a story that brings life into line. It kind of deals with reality and it puts it all together. Matthew chapter 13 verses one through nine Jesus shared one of these parables and this is what it says. He says listen the farmer went out to plant some seeds as he scattered them across the field some seeds fell on a footpath. The birds came in at them. Other seeds fell on shallow soil and underline rock. The seeds sprouted quickly but the soil was shallow. The plants soon wilted under the hot sun since they didn't have deep roots. They died. Other seeds fell among thorns that grew up and choked out the tender plants and still other seeds fell on fertile soil and they produced a crop that was listening to this 3060 and even 100 times as much as had been planted. Anyone with ears to hear should listen and understand. The seed that this farmer planted found itself in four different areas, four different places of soil or places that was around the good ground. Number one was the footpath. Second one was the shallow rocky soil and then there was the briar patch and then there was the good soil that it was on. The bottom line is this any seed has the potential for growth. Any seed has a potential of growth and the fact is it's in their DNA to grow. The seed that's just what seeds do when they're planted when they're placed they grow. But where the seed is planted determines if the seed will multiply or not. You see God never said to the farmer one time create a seed. He never one time told him to make a seed or cause a seed to grow. God never said that he should prevent the seed from falling on other ground. But he did say to the farmer plant the seed, scatter the seed. We also know that the seed that this farmer put out that he scattered no matter where it fell was good seed because the seed that fell on good ground multiplied 3060 and 100 percent. We know that. Now let me show you a few things this morning if you will about the seed. Number one is this. If we're not careful we'll try to perfect something that God has already perfected. A farmer can't spend his time inspecting every seed that goes out. Can't spend his time looking at everyone making sure it's a perfect seed. His job is to simply plant the seed that he has access to. As a pastor it's not my job to determine or select who hears the message of Christ. It's my job to deliver the message I have access to. Number two is this. Don't try to determine the purpose of where the seed lands. Most people would discount the first three areas where the seed fell. The first one was the footpath. Some may think it was a waste but I don't think it was a waste because what you see is the seed that fell was used to feed birds. Listen, what you may see as waste may be what somebody else needs to survive. The other two grounds was the shallow rocky ground and a briar patch. These seeds sprouted but they died. They didn't make it. This may also look like a waste. After all it was good seed. We know that from our previous discussion. But even though it was good seed and it fell there and it died, this is a place of training and development. It wasn't a place of training and development for the seed but it was a place of training and development for those that were watching the seed, those that saw the seed. And what some may see as waste may be exactly what's needed for somebody else to see where not to go or what not to do. Here's the third thing. Do what you do and let God handle the rest. You're only responsible for what God has given you to do. We must not give more attention to what we can't change over what we can change. The farmer took extreme care of the seed that he was given. The seed that fell on the good ground, he fertilized it, he watered it, he kept the weeds out of it. Now I'm not saying that the other seed didn't have purpose or potential but what I am saying is this, it was only his responsibility for the seed that was placed under his care, the seed that he was given to take care of. You see I've met people and you've met people I know as well who only complained about what didn't produce rather than being happy and excited about what did produce. Let me sum it up like this. First Corinthians chapter 3 verse 5 and 6, Paul makes this writing, he says, who is Paul a Paulist and who is Paul? We're only God's servants to whom you believe the good news. Each of us did the work the Lord gave us. I planted the seed in your hearts, a Paulist watered it but it was God who made it grow. A friend will only harvest what we plant. We cannot plant corn and expect a harvest wheat. It's our job to do what we're called to do and if we'll do our job God will certainly do his job. So the question is this, what has God given you to plant? What is God blessed you with that you can plant so others can see it? Regardless of where it lands, just plant it. Just plant it. Would you stand with me for a word of prayer please? Father we come to you today with grateful hearts. God we're thankful that you have allowed us to be a part of this day. I am extremely thankful for the men and women that come into this chamber, come into this house day after day, session after session, meeting after meeting to try to make decisions that are great for our state. Lord today I ask you to bless them. I ask you to use them in a mighty way. God let us search our hearts. Let us search our lives gone so that when we look at it we can say Lord I'm taking care of what you've given me responsibility to take care of. I'm doing what you've called me to do. Lord I pray that our hearts be tender and our ears be softened to listen and receive the direction of you. God I pray that you would bless our governor, our lieutenant governor, our speaker of the house, every representative and every senator. God our steps today in Jesus name I pray. Amen. And amen. Do you join me for the pledge? I pledge allegiance to the flag of the United States of America to the Republic for which it stands. One nation under God, indivisible with liberty and justice for all. More keepers will unlock the doors. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Thank you Mr. Speaker. Your Committee on Information and Audits has read the journal of the previous legislative day and found it to be correct. Father more Mr. Speaker up in Blue Ridge, there were these two hillbillies that were sipping shine on the front porch when a truck went by with a load of roll sawd. I'm going to do that when I win the lottery said hillbilly won. Do what said hillbilly two, send my lawn out and get it moved. This is Chairman, you're just jealous because you're not one of those hillbillies. I'll tell you that. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none in the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, 159th, who is following the establishes the order of business, then the first part of the period unanimous, consents, introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none in the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 2 by reference, I have done who the 30th target in the second bar, the 103rd can trail of 22nd, clerk of the 147th and others, who will be titled an act of men article on chapter 3, title 12, the official go to Georgia annotated relating the journal provisions regarding parks, historic areas and memorials. Public safety and homeland security. House Bill 485, I will send it more. The 95th work, I will send it with the welcome of the 81st, Mitchell of the 88th, Canada and the 102nd and others. Bill B. Tallah, the official go to Georgia annotated, says to repeal the imposition of the death penalty. Judiciary non-simple. House Bill 486, 5 reps. And more of the 95th, the $118, the 45th, Bill B. Tallah, the act of men code section 487, 40.26, the official go to Georgia annotated relating the income tax credit for fell. Creative arts and entertainment. House Bill 487, by reps and a dryer, the 59th, Bill B. Tallah, the act of men article 3, chapter 13 and tile 48, the official go to Georgia annotated relating the tax on rooms. Ways and Maines. House Bill 8, 488, by reps and a basket of the 14th, Kelly, the 16th, levered to the 33rd, the lunch and the 12th, gambled with 15th and others. Bill B. Tallah, the act of men, the 15th, the official go to Georgia annotated relating the courts. Judiciary. House Bill 489, by reps and a more of the 95th, 1 of the 89th, Holcomb of the 81st. Bill B. Tallah, the act of men, chapter 6 and the 16th, the official go to Georgia annotated relating the sexual offenses. Judiciary non-simple. House Bill 490, by reps and a pillow of the 3rd, tarvern of the 2nd. Bill B. Tallah, the act of men, the act of creating the office commissioner, Katusa County. Intergovernmental coordination. House Bill 491, by reps and a black men, the 146, Kelly, the 16th, Taylor, the 173rd, Paula, the 32nd, hatched to the 150th and others. Bill B. Tallah, the act of men, chapter 2, the title 21 of the official go to Georgia annotated relating the elections and primaries general. Special committee on election integrity. House Bill 492, by reps and a black men, the 146, Kelly, the 16th, Taylor, the 173rd, Paula, the 32nd, hatched to the 150th. Bill B. Tallah, the act of men, chapter 2, the title 21, the official go to Georgia annotated relating the primaries and elections general. Special committee on election integrity. House Bill 493, by reps and a black men, the 146, Kelly, the 16th, Taylor, the 173rd, Paula, the 32nd, hatched to the 150th and others. Bill B. Tallah, the act of men, chapter 2, the title 21 of the official go to Georgia annotated relating the elections and primaries general. House Bill 494, by reps and a black men, the 176th, Taylor, the 174th, Watson, the 172nd, Smith, the 18th, Williams, the 148th. Bill B. Tallah, the act of men, chapter 2, the title 21 of the official go to Georgia annotated relating the elections and primaries general. Special committee on election integrity. House Bill 495, by reps and a crow, the 110th, weed hour, the 190th, Williams, the 145th, and Hitchens, the 161st. Bill B. Tallah, the act of men, the article 1 of chapter 3, the title 35, the article 2 of chapter 1 of the title 42, the official go to Georgia annotated relating the general provisions regarding the Georgia Bureau of Investigation. Public safety and homeland security. House Bill 496, by reps and a perchedal, the 176th, the 159th, Rose, the 120th, Ridley, the 6th, and Williams, the 148th. Bill B. Tallah, the act of men, Code Section 32, 628, the official go to Georgia annotated relating permits for vehicles. Transportation. House Bill 497, by reps and a pastration, the 104th, the bill be titled act of men, the official go to Georgia annotated, so as the rise, modernized, correct errors, or emissions in. Code revision. House Bill 498, by reps and a watch of the 172nd, tick the 140th, the hood of the 175th England, the 160th, and perchedal, the 150th. Bill B. Tallah, the act of men, part 1 of our, the 2 of chapter 5, the title 48th, the Georgia annotated relating to property tax exemptions. Ways and means. House Bill 499, by reps and a vevins, the 57th, McLean, the 100th, Buckner, the 137th, went of the 89th, McLean of the 105th, and others, the bill be titled act of men, chapter 4, title 34, the official go to Georgia annotated relating minimum wage law. Industry and labor. House Bill 500, by reps and a perchedal, the 176th, black one, the 146th, Dickie, the 140th, Rhodes, the 120th, and Watson, the 170th, the bill be titled act of men, Code Section 33, 1, 25th, the official go to Georgia annotated relating to Georgia Agri Business and Rural Jobs Act. Ways and means. House Bill 501, by reps and a black one, the 146th, and Roberts, the 52nd, the bill be titled act of men, chapter 2, the title 21 of the official go to Georgia annotated relating to primaries and elections generally. Special Committee on Election Integrity. House Bill 502, by reps and a Smith of the 18th, abstraction of 104th, Lopez of the 86th, August 14th, and Linsky, the 79th, bill be titled act of men, article 1 of chapter 10, and title 17, the official go to Georgia annotated relating the procedure for sentencing and infosition of punishment. Public safety and homeland security. House Bill 503, by reps and a Watson, the 170th, black one, the 146th, Corbett of the 174th, House 177th, and Stevens, the 164th, bill be titled act of men, part 1 of article 1 of chapter 8, the title 48, the official go to Georgia annotated relating to general and business regarding sales and news taxes. Ways and Means. House Bill 504, by reps and a Williamson, the 115th, the 34th, Burns of the 159th, the 193th, black one, the 146th, and others. Bill be titled act of men, code 6, and 33, 1, 25th, the official go to Georgia annotated relating to Georgia, Agri Business and Rural Jobs Act. Ways and Means. House Bill 505, by reps and a one of the 89th, Beverly, the 143rd, Gillier, the 62nd, Jackson, the 64th, and others. Bill be titled act of men, article 2, chapter 3, title 16, the official go to Georgia annotated relating to justification and excuse. Judiciary non-subal. House Bill 506, by reps and a Gamble, the 15th, Williams, the 145th, Scott, the 14th, Gallaud of the 19th, Bob DeHon of the 17th, and others. Bill be titled act of men, chapter 2, the title 21 of the official go to Georgia, annotated relating to elections and primaries generally. House Bill 507, by reps and a Williams, the 145th, Jasper, the 11th, Crow, the 110th, year to the 150th, Scott, the 14th, and others. Bill be titled act of men, chapter 2, the title 21, the official go to Georgia, annotated relating to elections and primaries generally. Special committee on election integrity. House Bill 508, by reps and a carpenter, the 4th, Gaines, the 117th, more than 95th, the 34th, and for all the 118th, Bill be titled act of men, chapter 1 and title 10, the official go to Georgia, annotated relating to elections and primaries. Creative arts and entertainment. House Bill 509, by reps and a Gamble, the 17th, Gale, the 16th, Cooper, the 43rd, wheat hour, the 119th, loves to know the 12th and others. Bill be titled act of men, article 1, chapter 30, the title 33, the official go to Georgia, annotated relating to general provisions, roll of groups, blanket, accident, and sickness insurance. House Bill 510, by reps and a Gaines, 117th, Steven, the 1164th, clock, 1147th, house to the 117th, Cooper, the 43rd, and others. Bill be titled act of men, article 2, chapter 7, the title 48, the official go to Georgia, annotated relating to the imposition, rate computation, and exemptions from income tax. Ways and means. House Bill 511, by reps and a Grieves, 34th, England, 116th, Black, 1146, Williams, and 115th, mentally 88th, and others. Bill be titled act of men, title 12, 1927, 28, 30, 140, 45, 48, and 49, and the official go to Georgia, annotated relating to conservation and natural resources. Appropriations. House Bill 512, by reps and a Gaspers, 11th, Williams, the 145th, partner, the 5th, Ridley, the 6th, and Tarvin, the 2nd, Bill be titled act of men, chapter 2, the title 21, and the official go to Georgia, annotated relating to elections and primaries, generally. Special committee on election integrity. House Bill 513, by reps and a Benton, the 31st, Bill be titled act of men, article 1, and chapter 3, the title 50, the official go to Georgia, annotated relating to state and other flags. Rules. House Bill 514, by reps and a Hutchinson, the 107th Cooper, the 43rd, Oliver, the 82nd, Beverly, the 143rd, and Dempsey, the 13th, and others. Bill be titled act of men, article 1, and chapter 24, title 33, the official go to Georgia, annotated relating to insurance generally. Insurance. House Bill 515, by reps and a Wilson, the 80th, the count, the 50th, the Allen, the 40th, and Scofield, the 60th. Bill be titled act of men, code section 33, 9, 4, the official go to Georgia, annotated relating to state and other flags, applicable to make and uses of rates. Insurance. House Bill 516, by reps and a Matthew, the 73rd, bond of the 72nd. Camp of the 131st, 9 to the 130th, grabley of the 67th, and others. Bill be titled act of men, part 3 of art, and 3 of chapter 12, the title 16, the official go to Georgia, annotated relating to sales or distribution of harmful materials. Judiciary non-subtle. House Bill 517, by reps and a Carson, the 46th, 9 to the 130th, black one, 146, Newton, the 123rd, belt and the hunt, 12th and others. Bill be titled act of men, chapter 2, a, a title 20, the official go to Georgia, annotated relating to student scholarship organizations. Education. House Bill 518, by reps and a Mitchell, the 106th, 7th, the 57th, Wilkerson, and 38th, down to the 76th, Lewis Ward, the 109th and others. Bill be titled act of men, chapter 2, a, a title 20, the official go to Georgia, annotated relating to elementary and secondary education. Education. House Bill 519, by reps and a Mitchell, the 106th, Wilkerson, and 38th, Evans, the 57th, the 76th, Maynard, the 56th and others. Bill be titled act of men, on a 4th, chapter 2, a, a title 20, the official go to Georgia, annotated relating to increased flexibility for local school systems. House Bill 520, by reps and a Singleton, the 71st, Jones, the 25th, Martin, 49th, and Dreyer, the 59th. Bill be titled act of men, on a 4th, chapter 40, a title 50, the official go to Georgia, annotated relating to general provisions regarding promotion and deployment of broadband services. Energy, utilities, and telecommunication. House Bill 521, by reps and a limb of the 99th. To be titled act of men, chapter 6A, a title 12, the official go to Georgia, annotated relating to outdoor stewardship. Banking, fishing, parks. House Bill 522, by reps and a limb of the 99th. Bill be titled act of men, on a 1th, chapter 1, and a title 7, the official go to Georgia, annotated relating to provisions applicable to the Department of Banking and Finance. Banks and banking. House Bill 523, by reps and a limb of the 99th. Bill be titled act of men, on a 3rd, a 1th, an article 24, a title 33, the official go to Georgia, annotated relating to general provisions relative to health and insurance. House Bill Committee on access to quality health care. House Bill 524, by reps and a limb of the 99th. Parking, on a 101st, remainder of the 56th and Thomas of the 65th. Bill be titled act of men, article 1, and a chapter 7, a title 44, the official go to Georgia, annotated relating to landlord and tenant general. Judiciary. House Bill 525, by reps and a limb of the 99th, remainder of the 56th and Thomas of the 65th. Bill be titled act of men, park 4, article 1, and chapter 18, and title 43, the official go to Georgia, annotated relating operation to funeral, establishments, regulated industries. House Bill 526, by reps and a limb of the 74th, gillier to the 160th, second. Well, let's give you the 79th fry of the 118th and Taylor to the 91st. Bill be titled act of men, article 4, chapter 4, a title 17, the official go to Georgia, annotated relating to arrests by private persons. Judiciary, non-civil. House Bill 527, by reps and a limb of the 74th and park with a 101st. Bill be titled act of men, article 2, chapter 7, a title 48. Judiciary, non-civil. House Bill 526, by reps and a limb of the 75th, gillier to the 160th, second. For the list of the 50th and the 50th, the official go to Georgia, annotated relating to impositionary computation, exact, weighs in means. House Bill 528, by reps of nil of 74th, gillier to the 160th, second, fry of the 118th,\n\nAct of the men, Chapter 1 of Title 51 of the fiscal to Georgia and Tate ruling the general provisions of torts Public safety and homeland security House of a 529 by resident Neil is 74th and Bodhi the 62nd Bill be titled an act of men article on Chapter 2 of Title 40 The fiscal to Georgia and Tate ruling the general provisions regarding registration and licensing of motor vehicles motor vehicles 530 by Russian 9 to 130th ticket the 140th First on 159 Bill being titled an act to amend chapter 4 title one of the fiscal to Georgia and Tate ruling the state holidays and observances State planning and community affairs House bill 531 by Russian plumbing on the 121st and Jones to the 47th and others to be titled an act to amend chapter 2 Title 21 the fiscal to Georgia and Tate ruling the elections in primaries generally special committee on election integrity House resolution 172 by resident of Smith and 133rd Parsons the 44th Resolution creating a house study committee on Georgia utility facility safety improvements Energy utilities and telecommunications House resolution 173 by reps of bloom of the 99th resolution proposing an amendment the Constitution So it's the authorize the general assembly provide by general law Game fish and parks Senate bill 52 by senator Thompson the 14th doogan to the 30th Kennedy 18th Council for the 46th and Mullis the 53rd and others There'll be a ton of an act to amend chapter 1 of title 10 of the official to Georgia and Tate relating selling and other trade practices Judiciary Senate bill 81 by senator Mullis the 53rd mille of the 49th annish and the 43rd doogan to the 30th and Walker of the 20th and others Bill being titled an act to amend code section 2437 the fish go to Georgia and Tate ruling the office of college and career transitions Higher education Senate bill 88 by senator Goodman of the 8th Jackson to the second tip is the 37th sims of the 12th and burns the 23rd mothers Will be taught on act to amend chapter 2 a titled 20 the official to Georgia and Tate were lending elementary and secondary education Education That completes first readers second reading bills and resolutions the clerk will read House bill 462 by reps of galaer to the 160 seconds teams of the 164th The bill relating to special districts or transit purposes house bill 463 by reps of galaer to the 160 second Abel relating to emergency telephone number 911 system house bill 464 by representatives goggins of the 14th gamble of the 15 Williams of the 145th by word of the 33rd and Smith of the 18th bill relating to guardian and ward House bill 465 by reps of gallant of the 19th gravely of the 67th ridley of the 6th month to hand it to 17 singleton of the 71st and others The bill relating to general provisions applicable to counties and municipal corporations house bill 466 by versus a power of the 32nd Williams of the 145th Ridley of the 6th corporate of the 774th Patriot the 166th and others the bill relating to drivers licenses and driver training mid schools House bill 467 by reps of Kendrick of the 93rd drenner of the 85th Mitchell the 88th dope has of the 86th card of the 92nd and others Abel relating to general provisions regarding specific business the occupation taxes House bill 468 by our center carpenters the 4th mom to hand at the 17th Thomas of the 21st Smith of the 18th Martin of the 49th the bill relating to emergency powers of the governor house bill 469 by reps and Stevens of the 164th and Newton of the 123rd Abel relating to imposition rate computation and exemptions from state income taxes house bill 470 by reps and washburn of the 141st Kelly of the 16th per cent of the 176th we dour the 190th frustration of the 104th Abel relating to regulation and specialized land transactions house bill 471 by reps and McCorn of the 51st Cantrell of the 22nd Councillor the 50th and Harris of the 142nd the bill relating to Brady law regulations House bill 472 by reps and Jones of the 53rd Abel relating to primaries and elections House bill 473 by reps and Jones of the 53rd and Canada of the 58th Abel relating to holidays and observances House bill 474 by reps and Cooper of the 43rd Drener of the 85th jasper of the 11th and Smith of the 70th Abel relating to regulation of control substances House bill 475 by reps and Scofield of the 60th Davis of the 87th scott of the 76th per now of the 77th McCloud of the 105th and others Abel relating to general provisions regarding the general assembly House bill 476 by reps and Washington of the 111st night and 130th Powell of the 30th second Kelly of the 16th Thomas of the 21st to build relating to professional Engineers and land surveyor house bill 477 by reps and watching the 170th second Smith of the 70th Roads of the 120th and night and 130th Abel relating to tax credit and qualified donation of real property House bill 478 by reps and riches of the 97th per cent of the 176th Pultimate the 81st Ballinger of the 23rd gravely of the 67th and others Abel relating to opinions and expert testimony House bill 479 by reps of Reeves of the 34th Hogan of the 179th Gailier of the 160 second phrasier of the 126th Delert of the 167th and others Abel relating to criminal procedure House bill 480 by reps and Washington of the 141st jams of the 47th Carpenter of the 4th more than 95th Crow of the 110th and others Abel relating to mechanics and material men leans House bill 481 by reps of Reeves of the 34th and 111st to the 42nd Belton of the 112th Kelly of the 16th with hour of the 119th and others Abel relating to imposition rate computation exemptions from state income taxes House Bill 482 by represent limit the 99th and welcome the 81st to build relating to envelope taxation of property House bill 483 by represent five of the 118th dredder of the 85th and 111st to the 42nd Alexander of the 66 more than 95th Abel relating to property owners and associations and covenants and warranties House bill 484 by represent five of the 118th welcome of the 81st Beverly of the 143rd when the 89th Alexander of the 66 and others Abel relating to holidays and disturbances House resolution 161 by represent Gailier of the 160 second Stevens of the 164th Petrie of the 166th and Mowell of the 163rd Resolution creating the House Study Committee on the Nancy Hanks passenger rail line from Savannah to Atlanta House resolution 162 by represent Mets of the 50th Smire of the 135th Stevens of the 164th Lantern of the 75th Kendrick of the 93rd and others resolution creating the House Study Committee on the history of historically black colleges and universities Resolution 163 by represent five of the 118th Beverly of the 143rd Scofield of the 60th Davis of the 87th When of the 89th and others resolution creating the House Study Committee to evaluate workplace safety and labor law enforcement in Georgia House Bill House resolution 164 by represent limit the 99th and welcome the 81st resolution proposing amendment to the Constitution so as to authorize the general assembly to provide by general law for evaluation of open space land subject to a contract for an agricultural and since of zone House resolution 165 by represent McClaurth of the 51st Scofield of the 60th Kendrick of the 102nd Mitchell of the 102nd six part of the 101st others resolution providing for an inquiry of certain matters related to the Department of Corrections Senate Bill 27 by Senator Thompson of the 14th Patrick of the 32nd Duggan of the 30th hatchet of the 50th Hubsdettler of the 52nd others The bill relating to certain military certifications the entire person to obtain certain professional licenses Senate Bill 43 by Senator brass of the 28th Melissa the 53rd Miller the 49th Alberts of the 50th takes again to the 47th another to bill relating to enumeration of unfair methods and competition unfair deceptive acts or practices and penalty that's in the bill 45 by Senator Thompson of the 14th Albers of the 56th Gute to the 51st Melissa the 53rd each of the 21st and others bill relating to general provisions of the professions and businesses Senate Bill 53 by Senator Hubsdettler the 52nd Albers of the 56th Butler the 55th segment of the 4th Kirkpatrick 32nd and others bill relating to the Georgia Technology Authority at Senate Bill 87 by Senator Rad of the 33rd Miller the 49th Butler the 55th Hillary of the 19th Harvest of the 15th and others the bill relating to tax returns and furnishing of information through 2nd readers Reports of standing committees the clerk will read I'm Greg Morris the 156th district chairman the committee on banks and banking submitted the following report and speaker your committee on banks and banking Is that on the consideration following bill of the house since the struck immediate report the same back to the house the following recommend The 06 do pass respectfully submitted Representative Greg Morris the 156th district Chairman represent Matt Dubnick the 29th district chairman the committee and education submitted the following report to speak a committee on education Set on consideration following bill of the house and his instructor me to report the same back to the house the following recommendations house bill 455 Do pass by a substitute respectfully submitted Representative Mack Dubnick the 29th district chairman Representative Darnley and Taylor on the 73rd district chairman the committee and governmental affairs submitted the following report My speaker committee on governmental affairs is in a consideration following bills of the house Mr. Dr. Media report the same back to the house the following recommendations house bill 161 new pass house bill 286 do pass by committee substitute respectfully submitted represent of Darlene Taylor on the 73rd district chairman Representative Chuck Martin on the 49th district chairman the committee and higher education submitted the following report Mr. Speaker your committee on higher education is that on consideration following bill of the house Mr. Dr. Media report same back to the house the following recommendations house bill 152 do pass by substitute respectfully submitted Representative Chuck Martin on the 49th district chairman Representative James Virginia the 176th district chairman of committee and judiciary non-civil submitted the following report Was speaking committee on judiciary non-civil So on consideration following bills and resolution of the house Mr. Dr. Media report the same back to the house the following recommendations house bill 141 do pass house Both 367 do pass also resolution 120 do pass Respectfully submitted represent of James perchannel 176th district Chairman Rep. J. Collins the 68th district chairman of committee and public safety and Homeland Security Submitted the following report. Mr. Speaker your committee on public safety and Homeland Security Is on consideration following bills of the house in the Senate as an instructor media report same back to the house the following recommendations Senate bill 60 do pass House bill 248 do pass house bill 247 do pass by committee substitute house bill 218 do pass by committee substitute respectively submitted Representative J. Collins the 68th district chairman Representative Gerald Green on the 57th district chairman of committee on state property submitted the following report Mr. Speaker committee on state properties is that on consideration The following resolutions in the house and instructor media report same back to the house the following recommendations house for resolution 142 do pass house for resolution 143 do pass by committee substitute respectfully submitted reps Gerald Green in the 151st district chairman Rep. Sean Blackman on the 146th district chairman of committee on ways and means submitted the following report Mr. Speaker committee on ways and means is that in consideration following bills in the house And instructor media report the same back to the house the following recommendations house bill 114 do pass house been 149 do pass by committee substitute house bill 292 do pass house bill 317 do pass by committee substitute house bill 374 do pass respectively submitted representative Shaw Blackman on the 146th district chairman I can please the reading of the reports of standing committees you All right, we're going on now to morning orders If you have signed up for a morning order Please be prepared and be at the front of the chamber We're going to limit morning orders to one minute each this morning Please give attention to the members in the well the chair recognizes chairman Darleen Taylor for a morning order Thank you Thank you. Thank you mr. Speaker members of the house in honor of Black history months today I bring you a new history. I'm proud to recognize Dr. Darrell Quinshaw He's a nephrologist who lives in Thomasville Dr. Quinshaw's first encounter in a doctoring occurred when he was 10 years old As a youngster in Selma, Alabama his cat spot was injured and at that direction of the local veterinarian He was able to save his precious pet Later as he grew up he knew exactly what he wanted to do He became a doctor and nephrologist because of witnessing the number of family members With hypertension and kidney disease a malady that affects many African Americans He received his medical degree from Tulane University and completed further studies at the University of Alabama And trained at Emory in nephrology He practiced at the Georgia kidney and hypertension clinic and is a member of the archibald COVID-19 task force He's also a clinical professor of medicine at Florida State University and the Philadelphia College of osteopathic medicine He has been praised as a physician's physician I am honored and proud that Dr. Quinshaw is the first African American to be named Chief of Staff at Archbishop Medical Center Congratulations to Dr. Quinshaw and our community. Thank you. I yield the well Chair recognizes chairman Dave Belton for a morning order Thank you mr. Baker two decades ago Georgia ranked 50th on the SAT That's right ladies and gentlemen. We were dead last Now for the first time ever Georgia beats the nation on the SAT we beat the nation in the ACT four years in a row And we have the 13th best AP scores in the entire nation Two decades ago Georgia graduation rate was 53 percent That's right almost half of Georgians did not graduate now our graduation rate is 84 percent a record Two decades ago Georgia was the worst eighth worst on the K-12 report card now we're 13th best That's right. We went from eighth worst to 13th best in just a few short years How do we get there? We consistently invest over 55 percent of our entire budget directly to our children We restored local controls But most of all we got out of the teacher classroom and let teachers teach I stand here today to commend our Georgia teachers especially in this year of COVID the tireless work The selfless dedication to our most valuable treasure our precious children. Thank you You Chair recognizes chairman Lynn Smith for a morning order Thank you miss speaker and members of the house This time last year as a thank you for your overwhelming support for me when my husband Charlie said we died I brought you a thank you gift of homemade cheese straws Well, I brought some for you this year as well as a repeat thank you And to take this moment to reflect on the power we have is the body that I felt so strongly that day When I saw you at the memorial service a phrase kept coming to my mind The hole is greater than the sum of all its parts were one phenomenal body when we pull for a member. Thank you You Chair recognizes Representative Nelson for a morning order Thank you, mr. Speaker good morning colleagues. I rise for a moment in black history Never be limited by other people's limited Imaginations by Dr. Maid Jimmerson the beautiful thing about this quote is the fact that it was said by the first ever African-American woman to become an astronaut many children dream about going to space when they get older But only a few will accomplish this dream again. This is your moment in black history. I yield the well Chair recognizes chairman dicky and Washburn and representative homes for a morning order Thank you, mr. Speaker and Members this morning. I just we wanted to come and recognize and congratulate I'm Monroe counties Mary persons Competition cheer team for winning the state three eight title championship this week. So Special congratulations go to coach Kyle Ward and the eight seniors who won Region for the last four years and now cap their Careers off with the state championship. So congratulations to mayor persons cheer team. Hi, Kyle Chair recognizes representative carpenter for a morning order You Ladies and gentlemen of this house on this day in black history in 1965 Andre Young was born in Compton, California Dr. Dre is considered by many as the founder of the West Coast rap scene spending years as a DJ developing his style that has inspired thousands of rappers across the world including Eminem Kendrick Lamar snook dog and to puck His 1992 album the chronic received multiple Grammys and was one of the year's best sellers Dr. Dre a man of unity brought adolescence from all races together who found common ground was his smooth lyrics and his heavy beats You can also thank dr. Dre for those fantastic headphones that you see all around the United States in the world Worth over eight hundred million dollars. Dre is an icon in the music industry This is a personal shout out to dr. Dre thanks for teaching me words that i'm unable to use in this well And thank you especially for california love. Are you the well representative carpenter We have numerous requests That you just pick out a few lines from two or three of these uh artist All right So let me welcome everybody to the wild wild west chair recognizes um Representative bonner for a morning order Thank you for letting me follow that mr. Speaker Uh This morning i rise to pay tribute to a great American Rush Hudson limbal the third was born in 1951 and cape gerardo mizuri and began his career in radio in 1967 now regardless of where you fall in the political spectrum You cannot deny the success rush achieved over the course of his career He revolutionized the dying media of radio in 1988 his radio show was syndicated and for the next three decades He dominated the airwaves and became the godfather of talk radio For three hours a day five days a week rush spoke with millions of americans Establishing himself firmly as the voice of the conservative movement He was enshrined in the radio holophane and the national association of broadcasters holophane And in 2020 he was awarded our nation's highest civilian award the presidential medal of freedom But perhaps his greatest achievement is inspiration. He provided to millions of people like me and many of you over the years Rush believed in the best of america and summed up his views in this quote We do not look out across this country and see the average american the person that makes this country work And see that person with contempt we don't think that person doesn't have what it takes We believe that person can be the best here. She wants to be if certain things are just removed from their path Like owner is taxes regulations in too much government Rest in peace el rush bow mega diddo's and god bless I think Chair recognizes representative scothield for a morning order She waves chair recognizes representative Hutchinson for a morning order Good morning colleagues Today I bring to you Michaela Macy and Bailey Michaela is 15 years old and her twin sisters macy and Bailey are 10 These are siblings who enjoy jumping on their trampoline playing on their tablets watching frozen to not frozen one but frozen to And spongebob square pants they love listening to all types of music Michaela is a talkative team while macy and Bailey are quiet and shy Michaela macy and Bailey are placed together and should remain together I chose to highlight this group because siblings remain together are extremely difficult. This is a teenager in two preteens They should stay together at all costs and the state is Very lucky to have an adoption center like we do that to kept them together this long. So let's try to keep them together In their forever home. Thank you mr. Speaker. I yield the well We are now going on to the rules calendar Going on to the rules calendar the clerk will read the caption to house bill 111 House bill 111 reps of Williamson to the 115th and others to be entitled back to a men chapter one in title seven of the fiscal to Georgia Antietta ruling the financial institutions So it's a clarifying or move Superfluous language. This bill haven't referred the committee on banks and banking that committee recommends a spill do pass Chair recognizes representative Williamson to present the bill Thank you mr. Speaker colleagues that bring before you today the annual Department of Banking and Finance House keeping bill I just want to remind you that this continues our multi-year effort to streamline and make our Georgia financial services cut more efficient thereby attracting more businesses to Georgia uh, it comes as a collaborative effort between the Department of Banking and Finance and the regulated businesses which uh Overseas which include uh, banks credit unions, installment lenders, money service businesses, money transmitters, sellout, payment instruments as well as the mortgage lenders and broker's laws that Supervisors is supported by both the Georgia Micros Association the community bikers the league of southeastern credit unions And we all know that is formally known as the Georgia credit union affiliates Mortgage bikers and the Georgia financial services association It's got several pandemic related changes to it. It allows for virtual meetings uh, that we're all very familiar with now It gives some flexibility. It's in the installment loan lending area A lenders by mutual consent with the borrowers can hit Freeze the shot clock at no cost none of penny extra cost to the borer For however many months it takes the bar to get back on their feet with a Pretty good pre-agreed terms with installment lender It also uh gives credit unions the ability to expel a member that is Act in a behavior that's detrimental to the overall goals of the credit union, but that does require two-thirds vote of the members and it does additionally um That's really the highlights it addresses some mergers uh It gives more flexibility in mergers between bints credit unions and both nationally charted binks and in state charted binks And it comes without objection from any uh no known objections be happy to answer any questions otherwise Asp if you pay for consideration i'll yield the well You do not appear to have any questions. I yield the well Is there any objection to the previous question being ordered the chair here's now in the previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill The chair here's none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of house bill one eleven Will vote aye those opposed will vote no in the clerk will unlock the machines You Have all members voted Have all members now voted if so the clerk will lock the machines On the passage of house bill one eleven the eyes are one hundred and sixty The nasor zero this bill having received the requisite constitutional majority is therefore passed Clerk will read the caption to house bill one sixty five House bill one sixty five members in a bar of the hundred and third and others to be entitled neck to amend part four of article one of chapter eight A title forty the fish go to Georgia and tell you really in the horns exhaust systems mergers and windshields This bill haven't referred to the committee on motor vehicles that committee recognizes this bill do pass chair recognizes chairman Timothy bar to present the bill Thank you sir good morning colleagues You may be familiar with this bill as we have passed it out of this house before It had complications in the senate with them adding something that wasn't great to it I'm away in this morning from the parking deck. I did notice A few violations amongst our bodies. So if we pass this law What I'm talking about is being able to put a Device holder on your front windshield So currently it is illegal to have a GPS a cell phone or perhaps as as many folks are now doing a recording device Pointing out the front of your windshield It's currently illegal this bill Would repeal that and you'd be able to put something on your front windshield as long as it did not Obstruct the driver's view We've passed this before a lot of folks are in favor of this. I appreciate your Yes, vote on this bill You do not you do have a question do you deal for a question? Yes, sir chair recognizes representative Done a who to your right for a question Does the gentleman you to my friend of course? I've got one problem with the bill I've bought four of these appliances that you put on the front of the windshield And I put my phone on it, but the windshield wiper keeps knocking it off. Is there some other thing maybe I'm missing? Yes, sir. I might explain that to you offline. Thank you, sir. Yes, sir Good move Mr. Speaker, I yield the well. Is there any objection to the previous question being ordered? The chair here's none the previous question is ordered. Is there any objection to agreeing To the report of the committee Which was favorable or the passage of the bill the chair here is none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage the bill will vote aye Those opposed will vote no in the clerk will unlock the machines You\n\nhave all members voted, have all members voted. If so, the clerk will lock the machines on the passage of House Bill 165. The eyes are 166. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 353. House Bill 353, members and gentlemen, the 25th and others to be entitled back to a amend Article 3, Chapter 6 and Title 40. The official go to George Antony relating the driving on the right side of the roadway overtaking and passing. This bill ever further commuting on motor vehicles, that committee recommends a dispelled do pass by committee substitute. Chair recognizes Chairman Todd Jones to present the bill. Thank you, Mr. Speaker. Good morning, colleagues. 353 is 25 lines, but hopefully I can provide a quick summary for you. The first part of the bill provides clarity in terms of your ability to maintain the three foot passing rule around a bike and allows you with caution and if it is safe to cross the yellow line, the second piece of that bill or the part of the language speaks to what you can do if you cannot pass safely. When we lifted directly from current statute, the sanitation law which basically provides for how you would pass the sanitation worker, so that does not create new law. It just basically provides a shift from the sanitation worker and adds it to the cyclist. So I think that's an important note there. I would like to, before I yield for questions, I'd like to thank Chairman Corbett and I'd like to thank Representative Couch for their input on this bill. So thank you. Do you yield for questions? Yes, sir. I yield for one. Chair recognizes Representative Lahood to your right for a question. Thank you. Does the gentleman yield? Yes, sir. Is it not true that this change in law maintains a three foot passing buffer? Yes, sir. Do you further yield? Yes, sir. Does this law do anything to address the dress code for cyclists? The reason I ask is I see a lot of these stretchy leotard type pants being worn and it could be distracting to some people I know. Yes, it allows everyone to wear the stretchy leotards other than Representative Ridley. Thank you. I yield the well. Thank you. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute to chair here is none? The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill who vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 353. The eyes are 164. The nays are two. This bill having received the requisite constitutional majority is therefore passed clerk will read the caption to House Bill 169. House Bill 169, my representative Corbyl, 174th and others to be titled act to amend Code Section 45147, the fiscal to Georgia and Tentative related requirements, reassurance of commercial driver licenses or instruction permits. This bill ever further committee on motor vehicles. That committee recommends that this bill do pass. Chair recognizes Chairman Corbett to present the bill. Thank you, Mr. Speaker, members of the House. I'll bring before you House Bill 169, LC392759. This bill is a department bill. It adds to requirement to receive a commercial driver's license. The person has to have completed a commercial driver training course. This is a federal requirement that as of June of 2022, if we do not adopt this, Georgia CGL license will not be recognized outside of the state. It's a federal requirement. And then the second part of the bill, all it does is change on a commercial driver's instruction permit, just basically a learner's permit. The old way you could get it for 180 days and you had the option to renew for 180 days with an additional fee. This changes it to 365 days with just one fee initially. And that's all this bill does, Mr. Speaker, and I'll answer any questions if there are any. You do not have any questions. Thank you. I appreciate your favor consideration. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 169. The eyes are 162. The nays are seven. This bill having received the requisite constitutional majority is therefore passed. What purpose does representative Maynard rise? The clerk will read the caption to House Bill 212. House Bill 212, I represent. Carpenter IV and others to be titled back to amend code section 31-39-4. The official code of Georgia annotated relating to persons authorized issue orders not to resuscitate. Just be lemme refer the committee on judiciary. That committee recommends that this bill do pass by committee substitute. Chair recognizes representative Carpenter to present the bill. Thank you, Speaker. House I come before you on House Bill 212. This is a bill of serious nature actually. I know I'm not always serious, but this is an opportunity to clear up a gray area in the law in regards to how we issue do not resuscitate orders at our hospitals across Georgia. There is some concern that the language as it reads now would that they may seek the parents written or oral consent. We're just saying that they may only. That way that there's no unclarity in the law that has some parents concerned. This came out. This was an issue out in Missouri. It's called Simon's Law. There's an instance where the doctors had placed a DNR in the folder of a child and the parents did not realize it and they did not resuscitate. So it's an issue that concerns some Georgians and it gives us helps protect children. And I'll be glad to take any questions. You did not appear to have any questions. Wow. You're the will. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? We'll vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 212. The eyes are 170. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 168. House Bill 168, by represent the Petrie, the 166 and others to be entitled to amend code section 42, 536. The official code of Georgia annotated relating to confidentiality of information supplied by inmates. Ms. Belamer, for the committee on Judiciary and Non-Civil Act committee recommends that this bill do pass. The rules committee has voted this morning to limit debate on this bill to one hour. Chair will allocate 30 minutes to each side in the chair recognizes to present the bill, Chairman Jesse Petrie. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I present to you today House Bill 168. This bill last session was House Bill 885 and passed this House and was a casualty of COVID over in the Senate, I guess you could say. It's an important measure to my community and I thank to everyone in this room's community. And I want to begin by just telling you why. Let me just begin very briefly by telling you why this bill is here before you today. Back in 2016, and I'm giving you one example of many, sadly, back in 2016 in Savannah, we had an individual by the name of Tori Scott who was parold early and released into the community and set out on a mission, sadly, to do as much casual calamity as he could in our community. He raped two young ladies at Savannah State University, one of our historically black colleges there. He raped two young ladies there, forever ruining their lives. He subsequently kidnapped a nurse in the Candler Hospital Park in Savannah, raped her, actually attempted to kill her, but she escaped. He then went on to my brother Carl Giljard up there's district to Port Wentworth and he didn't just kidnap a rape of woman there. He actually raped her with her infant child in the house and then murdered her while her husband was oversees serving his country. All of this done by a man whose sentence, which had been handed down by a jury of his peers, had been cut short. Now this discussion today is not about parold. We have a constitutional access to parole. It is not a right. It is a privilege that are granted to some. And so this isn't about that. This bill today is about how we protect our people and our community from people like Tori Scott. And so this bill speaks directly to allowing the chief law enforcement officers in our community, our DAs, expressly, as we were speaking about, allowing them to have access to what is currently surprising, I think, to all of us and to certainly all of your constituents. What is considered a state secret? How that inmate is behaving in prison and our Georgia correctional system is a state secret. It is not available to the public and I'm not saying that it should be, but it is a state secret from our district attorneys. These are district attorneys in the process of parole have a right to object to a parole. When the parole board is going to truncate a sentence handed down by the community and allow someone to be released early, that person that is most responsible for protecting the community has a right to object to that. To do that, what this bill attempts to do is to allow that district attorney to know how that inmate is behaving in prison in order to decide whether they want to object or not. Because this individual may have been sentenced five years ago, ten years ago, twenty years ago. But I'll tell you one thing that everybody commensuensically knows is how you behave today is a pretty good indicator of how you're going to behave tomorrow. And so what we have discovered is that many of these individuals that have been paroled into the community actually have been exhibiting very inappropriate behaviors while in prison. And so this bill today is expressly about providing information on that inmate's record to district attorneys, but I want to mention something very important. It only circumscries, this isn't about every individual considered for parole. Only those crimes that you see described here in this bill, and if you will look on, if you will look online, eighteen, dangerous sexual offenses against minors, that is, nineteen crimes which are the most heinous, disgusting, and despicable crimes against children you can imagine. Only those crimes and then the seven deadly sins which are described on line twenty one as serious violent felonies. Serious violent felonies are murder, rape, arm robbery, aggravated child molestation, aggravated sawdemy, aggravated sexual battery and manslaughter. So this bill only relates to information going to district attorneys. This bill only relates to inmates who have committed the most heinous crimes that I just described. And what it does is allow that district attorney if they so desire to discover how that inmate is doing in prison so that they can choose whether or not they want to object to that inmate's release. Now, we have a lot of new members here, but I think everybody knows this, but just to be clear, the parole board doesn't have to, the parole board has complete autonomy. They don't have to consider that objection in any way, shape or form. This is about whether that person that we entrust to protect our communities has a right to at least make them aware of their concerns. All right. There's an important piece I want to mention. At the end of this bill, if you look at lines forty seven to fifty, I added a provision here to make it very clear that what we seek to do is exactly what I've explained to you. Today, if this information is declassified by the commissioner of corrections and provided to a DA, it has to be declassified today if it is given because it is a state secret. There is no provision that would criminalize sharing that information more broadly. And so what I've done in this bill is made it clear that to share this information or to make it public would be a misdemeanor crime. So again, I hope that everyone can see that they go here is to see that district attorneys have this information. This information is not being shared to you and I or to anyone out in the public, but to those district attorneys. In order that we can protect people like the four women and countless others related to those four women that I began by describing what they have been through. That's our duty to protect people from individuals like that. Now, it will remind everyone here that if you get a chance, look up Department of Justice Statistics. Our citizen right with violent criminals is very poor, folks. 72% of violent felons will re-offend with a violent crime within five years. That's National Department of Justice Statistics. So folks, listen, we want everybody to have access to parole, but let's make sure that we're letting those out that aren't going to be a threat to the people of this state. Mr. Speaker, I think I've explained it as well as I can. Glad to stand for any questions that members may have. You have a question if you care to you. Yes, sir. I yield, Mr. Speaker. Chair recognizes the minority leader of the House leader Beverly to your left for a question. Mr. Chairman, you. Yes, sir. I do. I draw your attention to line 36. It says, any record provided for under the sub-Haircraft shall be held in confidence. What is a DA able to do with this information? Say again, sir. What is the DA able to do with this information? To review it in order to discover if they choose to object to the parole of that particular inmate. Great. For the gentleman further, yes. Is there any provision in here that gives the defendant potentially who's up for the role that offense counsel is saying right to the information? Yes, sir. So the answer to that is a little complicated. So let me answer it that way if you don't mind. So whenever there's an incident in prison, whenever there's a disciplinary action, the inmate is immediately provided with a written record of that incident. So that information is always to your question, yes, provided to the inmate. However, to be very clear, the precise information we are providing to the DA would not be the same precise information compiled that would be provided to the inmate. That is correct. But again, if I might add, that is because this is not, this is, this bill is only about parole. This bill is not about the judicial process in the broader context. This is about whether this information, this individual who's already been adjudicated and sentenced, whether this individual should have the benefit, the clemency, the amnesty of parole. So just a different process. Just to be clear, if a defendant or a gentleman and ladies up for parole, they don't disclose this information to the person who's defending them. So they don't disclose the information to the defense counsel. How would the defense counsel actually get this information that the DA has? Because it seems like you're setting up a situation where there's information asymmetry that could lead to a problem in a honest defense of a person who's up for parole. Okay. And Mr. Leader, so my answer to that would be as follows. So first of all, you speak to the defense. This is an individual who's already been defended and sentenced. He's now seeking clemency, a little different process. But to your point, that individual, whatever infractions, whatever behaviors he's had in prison, have all been provided to him in writing that he can provide. First of all, he knows it anyway, but he can provide that information to anyone who seeks to defend his access to parole. This particular bill is expressly about the district attorney, okay, in that jurisdiction that synestists individual having access to that information. Because they don't know how that individual is behaved, unlike the inmate himself. They don't know. The community in which these heinous crimes occurred doesn't know how he's behaved in prison. And what I'm seeking is to have one individual, that one individual who's duty is to protect the people, to at least know how he's behaved in prison. But thank you for the questioning, Mr. Leader. Do you further you? No, I do. I do. I recognize as the chairman from which the bill came, chairman Berchett up in the gallery in the middle. Thank you to my friend and the well, do you? Yes, sir, Mr. Chairman, I yield. So as I understand the bill, what the information that we're seeking to give the district attorney is information regarding the behavior of these inmates as they're locked up, is that correct? Yes, sir, that is correct. Does the gentleman further yield? Yes, sir, I yield. Wouldn't an inmate know what his behavior is while he's locked up? Yes, sir, as I was just describing to the leader here, I think that is correct, sir. Thank you. Do you further you? Yes, Mr. Speaker, I will yield. I recognize as representative Holcomb to your left for a question. Thank you, Mr. Speaker, just gentlemen yield. Yes, sir, I yield. I'm trying to figure this out because I don't know this area. I'm a former prosecutor, so I certainly appreciate and agree with you in terms of pursuing justice for victims. But can you describe for us with more color the types of information that this would produce? You mentioned disciplinary records and things like that. Can you just really get into granular level detail of what information might be provided under this? Because as you mentioned, it's nothing to do with the underlying crime. It's only with the behavior in the correctional system. Yes, sir. Thank you, sir. Representative, very good question. So you're correct. The district attorney already knows what crime occurred and what they've sent it some for. What they seek to understand, what are district attorneys who very much support this measure. What they seek to understand is how is that individual behaving in prison most recently? And so here's the things that you discover as I've become somewhat of an expert in these matters since I've been up here. And here's what you discover. There's all kinds of sexually inappropriate behavior that goes on in prison. There are all kinds of offenses that occur in prison. And all kinds of things that occur that would be inappropriate outside of prison, but they happen in prison. And if individuals are operating that way in prison, pretty good indicator that they may be a risk to the broader society. So I don't know if I can speak more specifically than that, but it's about behavior. It's about how that individual is. I use the term behaving. They're disciplinary record, et cetera. And again, this is as the DA chooses to seek it. Your county district attorney may not be interested in gathering this information. But if the DA in Chatham County chooses to discover how Tory Scott is behaving in prison before he's released early again, they would have the ability to discover how he's behaved recently before he's released. Thank you. Thank you for asking a follow-up. Yes, sir. My friend. So if somebody commits, you mentioned sexual violence, if somebody commits a sexual violent act, they could still be charged a crime for that in the correction system, right? So we're not talking about that. We're just talking about something lesser that would be documented in some form. That's that. Yes, sir. And I'm trying not to be ugly here before everybody, but let me give you an example. We had another gentleman that was where the file was disclosed. We know a gentleman by the name of Fabian Wright in Chatham County who had multiple forced sexual acts in prison that he was not charged with a crime. You find things such as, again, you find things such as inmates who routinely masturbate in public. You find all of these things in that correctional record having now worked on this so long. And that might be pertinent to understand how, when an individual is in prison for a say, a dangerous violent sexual offense, it might be interesting to know that to a district attorney. I'm trying to say it the best way I can. It's a very good question. But in that particular case, Fabian Wright was released early and immediately we had an attempted rate, a rate again at Savannah State University. So just if you're interested. So I can go on all day with these cases. And but that is, I hope that answers your question representative. It is a good question and I thank you for it. Thank you. Do you further you? Yes, sir. I want to answer all questions. Yes, sir. Thank you. Well, maybe not all speaker. I would yield for one more, Mr. Speaker. You can answer them all. Let's see. You've got. Looks like about 12 or 13 members. Chair recognizes the vice chair of the majority caucus representative gravely to your right for a question. Is it genuine? Yes, sir. Is it not true that this measure has received a wide support from both Republican DAs across the state as well as Democrat elected DAs across the state? Yes, sir. My friend, that is absolutely correct. In fact, my understanding is your DA is supportive of this measure as I understand it. Well, to that point, that's a good point. I have, is it not true? It's a German for the yield. Yes, sir. Is it not true that I represent a portion of Douglas County with several other colleagues here in the chamber and she is the first female elected Democrat DA in Douglas County as a newly elected DA? Wouldn't this information be very important for her to know if she didn't prosecute these individuals, but these individuals would be returning back to their community, her community, and this information pertinent for her to know. Absolutely, sir. In fact, my good friend, you raised a great point that hasn't been raised yet as we have new individuals in these roles as district attorneys who may not have sentenced this individual. As they look back on that history, this may be very helpful to them to see how that individual's behaving today. And I appreciate very much you bringing up the bipartisan support we are getting from district attorneys across the state on this measure. Thank you, sir. Very good point. One final question I'll yield. Is it not true that my DA called me and asked if I would support this bill? Yes, sir. That is my understanding as you made me aware. Mr. Speaker, I think I've done my best to answer any of all questions and I yield the well. The gentleman has yielded the well. We have one member.\n\nWe had signed up to speak on the measure. Chair recognizes Representative McLauren to speak to the bill. Thank you, Mr. Speaker, very much. I wanna start by saying I actually really appreciate everybody's time today to talk about issues concerning people who are incarcerated because for a lot of our time that we spend in this chamber, those issues are out of sight out of mind. And it's easy to understand why. I mean, if I talk about out of sight out of mind when it comes to single-family homes and apartments separated by trees in my own community, right? So let alone how out of sight out of mind it is for us when we think about what people go through when they're incarcerated in this state, especially during a year like we've just had and what it means to be under the absolute control of the Department of Corrections for every aspect of your life. I wanna speak very briefly to the concerns that you've heard raised by a couple colleagues on the floor. This is not, as the chairman said, a normal criminal process. It's not, you don't have the same rights that you would ordinarily have. That's exactly right. You don't have a right to parole. So this is a privilege granted by the state and the information that DA's or the parole board has access to, that's all discretionary with the state. So it's not like the Constitution, we violate anything like that if we don't give defense to any information. But let me tell you about what we heard about in committee. We heard testimony that somebody's file set in it that they were gang raped or what happened was they were gang raped while they were in custody. But the information reported to Parton's and Paroles was that they were in a gang because the word gang appeared. So again, with respect, the comments made about shouldn't a person know what happens to them? They absolutely do know what happens to them. But that doesn't mean that information is accurately conveyed to Partons and Paroles. But that's actually not even why I'm up here. Why I'm up here today is to speak to a department of corrections that is in disarray. The Georgia Department of Corrections is in disarray. What we haven't talked about this morning in discussing this bill is why Partons and Paroles already has all the information we're talking about. Partons and Paroles has access to every file for every person in DOC custody. That's the testimony we got from Partons and Paroles in committee. But there's no statutory authority for Partons and Paroles board to have access to every single file. And I'm not just talking about serious violent felonies. I'm not just talking about dangerous sexual offenses, which they knew term added in this bill because it's previously was only seven deadlies. They're shared with Partons and Paroles. The reason they have access to every file is because the commissioner of corrections is saying, or excuse me, Partons and Paroles testified, that the commissioner of corrections has declassified, pursuant to this code section that already exists, declassified all of the inmate files in DOC possession so that Partons and Paroles can have access. But if all files are declassified, that means none of them are state secrets anymore. Which means we wouldn't even need the bill. We never got an answer to this. We were just getting into this discussion and y'all know how it goes. Move do pass. Right, now we're here. We'll clean it up later. We'll figure it out, but now we're here. What this bill purports to do is say that for serious violent felonies, dangerous sexual offenses, the DA will be one of the people carved out that will get access to these state secrets that are still apparently state secrets. Partons and Paroles will have them too, but again, if you look at OCGA 42-943, which is the authority for the Partons and Paroles board, that's not in this bill. There's a specific statutory basis for them to have access to serious violent felony records, but not dangerous sexual offenses. You set up the situation where if you don't declassify the files and under the fictional world of this bill where the files are not declassified, where there's still state secrets, you might subject DAs to criminal liability for sending dangerous sexual offense information to Partons and Paroles because there's no statutory basis in the code for Partons and Paroles to have access to information. But again, that's not what we're hearing. The fictional world of the bill is not actually the true world, the true world is the commissioner has declassified every single file, and yet, strangely, I grew with the chairman, they're not available to the public. They're state secrets that have been declassified that none of us have access to. The DAs should have access to them, we should all have access to them at their declassified. Are you confused yet? Because I am. What I'm trying to tell you is that the department of corrections is not following any systemic policy on this issue. They are not following statutory authority. Are they declassifying files? Are they not declassifying files? Will DAs be subject criminal prosecution? Will they not? No, none of this matters to the DOC because there's not substantial enough oversight for any of us really to care, sadly, whether they're following statutes or not. So what do they probably do? Send a zip file PDFs to Partons and Paroles called a day and they don't worry about whether that's compliant. That's what's happening. When we don't exercise meaningful oversight over the DOC, you get the year 2020. You get record numbers of homicides, suicides, riots. Riots at one facility that in some cases are as many as the number of riots in entire other state prison systems. You get rampant spread of COVID with bad mass policies. You get under staffing that causes just walking down the hallway to be unsafe. It's one thing to punish somebody and it's another thing to take away their human rights. And this bill is one tiny appearance of a bandaid. It's not even a real bandaid because the legal effect is still in question. But it exists within a larger, broader context of failures by the DOC and frankly by us who are supposed to exercise oversight over this department which has hundreds of thousands of Georgia's in custody. And if we don't pay attention and if we just go through the motions and we pass bills like this that purport to do something that probably ends up really having the legal effect but just papers over or systematic statutory violations, then we're abdicating our duty. Thank you, Mr. Speaker, you'll be well. Is there any objection to the previous question being ordered? The chair here's none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill, the chair here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Ms Annoying. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 168. The eyes are 99. The nays are 66 this bill. Having received the requisite constitutional majority is therefore passed. Clerk will read the caption to a group of privileged resolutions. Honoring the Life and Memory of Walter Milton Green. Honoring the Life and Memory of Jerome Andrew Golden. Honoring the Life and Memory of George Edward McKibbin. Honoring the Life and Memory of Samuel Clyburn and Jr. Recognizing the 47th anniversary of the Council of General of Japan in Atlanta. Recognizing Commending and LaFigure. Recognizing Commending Veronica Higgs Co. Commending and congratulating Maggie Jane Butler. Recognizing Commending Helen Butler. Recognizing February 23rd, 2021 as World's Spade Day. Recognizing and congratulating Pastor Rex King upon the grand occasion of his retirement. Recognizing March 4th, 2021 as Be The Match Day. For other purposes, secondly, it's the reading of the privilege resolution. Is there any objection to adopting the privilege resolutions? The chair here is none and the resolutions are adopted. What purpose does Chairman Cooper rise? Is it on? Mr. Speaker, I rise to make a motion. State your motion. I would ask that we move House Bill 377 from Public Safety and Homeland Security to Health and Human Services. And both chairs are in agreement. Clerk will read the caption. House Bill 377, I represent Schoelfield the 60th and others to be entitled to an Act to Men Article 2, Chapter 4, Title 17. The fiscal to Georgia annotated really no arrest by law enforcement officers generally. On the ladies' motion, that House Bill 377 be moved from the Public Safety and Homeland Security Committee to Health and Human Services. Is there objection? Is there objection to chair here is none and it is so ordered? We're going on now to announcements. If you have signed up for an announcement, please make your way to the front of the chamber. Chair recognizes the chair of the majority caucus, Chairman Hatchett, for an announcement. Thank you, Mr. Speaker. Majority caucus will meet in room 341 upon adjournment, a brief meeting and 341 upon adjournment. Thank you. Chair recognizes the chair of the juvenile justice committee, Chairman Ballinger, for an announcement. Thank you, Mr. Speaker. Your juvenile justice committee will meet today at 1 o'clock in room 403 here at the cap. Thank you so much. Chair recognizes representative McClain for an announcement. Thank you, Mr. Speaker. George the working families of the legislative caucus will meet upon adjournment and pick up your lunches in room 307. Thank you. Chair recognizes representative Reeves for an announcement. Thank you, Mr. Speaker. The Reeves subcommittee of Judiciary Non-Sivil will meet approximately five minutes after the majority caucus. Is finished meeting and we will be meeting in room 132. So that will be at approximately 1235 issues. So thank you. Chair recognizes Chairman Jay Collins for an announcement. Thank you, Mr. Speaker. The public safety and Homeland Security Committee, subcommittee A will be meeting at 1245-506 CLOB. That's 1245-506 CLOB. Chair recognizes Chairman Allen Powell for an announcement. Thank you, Mr. Speaker. The regulated industry's committee will be meeting at 2 o'clock in 606. Very short meeting. We've got a bill that we've got to do some repair on it to send it back to rules. Chair recognizes Chairman Jasper's for an announcement. Thank you, Mr. Speaker. Transportation members, we have a joint meeting with the Senate. Today at 2 p.m. at 5 o'clock. Chair recognizes Representative Rick Williams for an announcement. Thank you, Mr. Speaker. Right after the caucus meeting, regulated industries, alcohol and tobacco subcommittee will meet in room 606 CLOB. Thank you, Mr. Speaker. Chair recognizes Representative Ayer Hart for an announcement. Shortly after our caucus meeting, the Regulatory Subcommittee will be meeting at 1.30 CLOB 415. See you there. We will not be back until Monday in the chamber as a whole. I know that a lot of committees are meeting this afternoon, maybe even tomorrow. But I hope you'll join with me in wishing a happy birthday to the Chair of the Industry and Labor Committee, Chairman Bill Workhizer. That's actually tomorrow. Friday, he's having his birthday on Friday. And on Sunday. Help me wish happy birthday to Representative Victor Anderson. Chair recognizes Chairman Petri for an announcement. Committee we will have at 2 o'clock, a meeting of the human relations and aging committee 2 o'clock today. Thank you. That completes our announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move that this House stand adjourned until 10 a.m. Monday, February 22, 2021. The majority leader has moved that this House be adjourned until Monday, February 22, which is also the birth there of the first President of the United States, George Washington. Nobody keeps up with that anymore, though. All in favor of the gentleman's motion will vote say aye. Those opposed will say no. The eyes have it this House will be adjourned until Monday at 10 a.m.",
  "updated_at": "2026-02-13T10:02:38.89012+00:00"
}