{
  "video_id": "BKttYmrdcU8",
  "url": "https://youtu.be/BKttYmrdcU8?t=998",
  "title": "Georgia House - Day 24 (2026-02-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 24,
  "video_date": "2026-02-27",
  "duration_minutes": 275,
  "summary": "Here is a structured summary of the Georgia House session from 2026-02-27:\n\n**Overview**\nThe session featured a moving invocation from Chaplain Joseph Kim, who spoke about the sacrifices of Georgia service members killed in action and the importance of serving the greater good with courage and compassion. The House also took up several pieces of legislation.\n\n**Key Actions**\n**HB 267**: Bill to expand insurance coverage for mental health services\n**HB 193**: Bill to increase funding for school safety initiatives\n**HB 329**: Bill to reform the state's criminal justice system\n**HB 428**: Bill to provide tax credits for small businesses\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Chaplain Joseph Kim gave a powerful invocation reflecting on the loss of Georgia service members and the need for public servants to lead with sacrifice, compassion, and a commitment to justice.\n- The House recognized the families of the fallen service members that Chaplain Kim mentioned in his remarks.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe House maintained a quorum, with leadership calling all members to the floor.\n\n**Adjournment**\nThe House adjourned for the day. The next session is scheduled for 2026-02-28.",
  "transcript": "Members, I'm going to ask all members to come to the floor. So rules is still meeting, but what we'll do is we will delay attendance, but we'll go ahead and get our day started. So all members, please come to the floor. The hour of convening having arrived, all members, please come to the floor. The hour of convening having arrived, all members, please come to the floor and take your seats. Mr. Clerk, will you ring the bell? Thank you. Thank you. Thank you. Members, will please take your seats. Members, please take your seats. Doors keepers, if you'll go ahead and lock the doors, close the doors and lock the doors, we'll go ahead and have our chaplain. Doors keepers, please close the doors and keep them closed. We'll let the rules committee in in just a few minutes. Members, please take your seats. All members, please take your seats. All right, doors keepers, close those doors and keep them closed. As is our custom, we will begin our day with scripture reading and prayer by our chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from down in Valdosta, the 170th House District, way down in South Georgia. Chairman John Leroy, Chairman Leroy, do you recognize to introduce our chaplain? Thank you, Mr. Speaker, and thank you, members of the House. Today I want to introduce our chaplain, Captain Joseph Kim. He's stationed at Moody Air Force Base and first joined the service in 2017. Offers connected with Chaplain Kim about a year ago. The reason we connected was after the tower 22 incident attack in Jordan occurred. Seeing three Georgia base soldiers, Chaplain Kim reached out to me just to connect, make sure that we were on the same page, knew what was going on over there and knew the impact to our servicemen and women over there. I really appreciated him reaching out. It was just really made it more real. It's someone not being in the service or closely connected, but it just made me appreciate even more the sacrifice that our servicemen and women make. He was nearby, the side of the attack. He was there within hours to comfort the soldiers there and to be with the bodies as they came back. I appreciate him doing that and coming to share with us today. The day he called me, I wrote down the name of his family too. And ever since then, a sticky note on my laptop computer has sat there with the name of his wife Lauren, his oldest daughter Claire, Juda and Lily. So it's for my to pray for them and keep them in my prayers. So I'm so glad to have him here today and so please welcome Captain Chaplin, Joseph Kim. Thank you so much for that generous introduction and your on the waverings support for our community, our service men and women and their families. Mr. Speaker, distinguished members of the Georgia House of Representative and all who gather here, I am deeply honored to stand before you today. This morning in this historic legislative chamber, this very chamber where President Jimmy Carter addressed the state as a governor, a man whose life exemplifies selfless service from his years in public office to his tireless work with humanity, habitat for humanity. And we stand in the heart of Atlanta, a city where Reverend Dr. Martin Luther King Jr. led the civil rights movement, whose legacy continues to inspire us to serve the greater good with courage and compassion. So it is truly, truly humbling to share a message of hope and encouragement with you as your Chaplin of the day. I love you so much. Lauren, tell the kids, I love them. I love you too, but I love you so much Lauren, tell the kids I love them. That was the text that I sent my wife right before I flew to Tower 22. I'll remove outposts in Jordan from my on-disclosed location in the midst of my deployment on January 28, 2024. And on that day, our brave brother and sisters in arms, all Georgia natives, or killed in action by your UAV attack, drone attack. At the base that was under attack, I was unsure of what to expect. All I knew was that I was called for such a time as this. I was deployed to Jordan for this very moment. We did many things for the airmen, countless counseling sessions, religious services, or our events. But among all those, I knew this was the moment that I would remember rest of my life. To honor the fallen heroes, to comfort and care for the wounded. Our brave men and women in uniform who are likely scared, confused, or worried. Like the airmen that I met there, whose quarters were nearer the blast site. He was so shaken that he couldn't sleep there anymore. He spent the night on a couch at the workstation. That night I escorted the bodies of our fallen heroes. And a few days later, back at Tower 22, we gathered together again for a memorial service, paying our respects to the empty boots, helmets, and rifles, symbols of their sacrifice. The first surgeon began the rule call. And he called out the names and they responded. Hear Sarge. Hear Sarge. Hear Sarge. And then he called Sargean Rivers. Silence. He called again. Sargean William Rivers. Again, nothing. Finally he called Sargean William Jerome Rivers. Again, silence. Silence in the formation was so thick with unspoken grief. The first surgeon then called out the names of the other fallen heroes, specialist Kennedy Sanders and specialist Brianna Muffet. Close friends, soldiers, and airmen began to weep. We realized that they were no longer there with us. But in the midst of sadness, loss, and despair, we remember who they were. Their strength, their courage, their smile, and their deep love for our country. Our resolve was strengthened as we honor them and ensure their sacrifice will be remembered. And it's being remembered today, a year later in their beloved states capital. In John 1513, Jesus tells us greater love has no one than this to lay down one's life for one's friends. The freedoms and blessings we enjoy in our great nation are a direct result of the sacrifices made by these brave men and women. They lay down their lives out of deep love and devotion to our country and their friends. Like more than 36,000 service members were killed in the Korean War, often called the Forgotten War. Getting in a land they didn't know for a people they never met. They gave their lives to defend freedom from communist enemies. Fifty years forward, a sixteen year old boy came to America to learn English so that he could share the message of the good news with more people in the world. He graduated from high school, college, and seminary, served youth and college students in local communities of faith and became a citizen of this great nation and was called to serve as a chaplain in the United States Air Force, ministering to the man and woman who served. That's me. It's because of their sacrifices laying down their lives I am here today. You will never know how much positive impact and differences that your sacrifices will make to the people perhaps in 10, 20, 50 or 100 years later. As you continue to serve our community, our state, our nation representing we the people by listening to their needs, especially the challenging circumstances faced by military families and by legislating laws.\n\nthat protect our children and promote justice with all humility and compassion. I challenge you to live a life with the same attitude exemplified by Christ, a life of sacrifice, giving, serving, and loving others. Thank you for your service and thank you for your support for our military. Would you pray with me? Let us pray. Gracious and loving God, we thank you for the men and women who serve our nation, especially those who made the ultimate sacrifices. We lift up these representatives, these public servants who have dedicated themselves to serving the people of Georgia. Grant them wisdom as they make decisions that impact so many lives. Give them strength to uphold justice and compassion as they address the needs of their constituents. Particular, the challenges faced by our military families. May their service be marked by humility, integrity, and a deep love for their fellow citizens. Bless them and their families. And may we all be inspired by the example of selfless service as shown by your son. We pray in your holy name. Amen. Thank you. Would you please join me? I really pledge you to do a flag of the United States America. And to the republic, which stands one nation, unnoticed, indivisible, liberty, and justice for all. I'm also here. Thanks for that. Remember it. I will take it. Yes. Thank you. Thank you. Thank you. Thank you, brother Kim. Thanks for that remembrance of some brave heroes from Georgia. Members, you may join brother Kim and his family, Chaplain Kim in the South Any Room door keep us when you may unlock the doors. Have a photo with with our Chaplain and his family. Members, if there is no objection, we will dispense with a roll call today. Here in no objection. So done. So ordered there, Mr. Clerk. I have just. Members, we'll get your attention as we recognize. Let me do this first and thank. Representative Esther Panich for bringing us the our doctor of the day, doctor Matthew. Keeley. Keeley appreciate doctor Keeley being here. And appreciate representative Panich inviting him. There she is right there. I was looking for you. Thank you. Chairman Hilton, you're ready, sir. Chair, Chairman Hilton has recognized. Thank you, Mr. Speaker, for you. I am always ready. Your committee on information on it has read the journal of the previous legislative day and found it to be correct. Chairman Hilton, the chair of the committee on information and all its reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with a reading of the journal? Hearing none, the reading of the journal is dispensed with. Is any objection to the confirmation of the journal? Hearing none, the journal is confirmed. It's clear, will you read the resolution establishing the order of business for the day? Reptent of station 104th Moose filing be established as the order of business during the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is any objection to the adoption of the resolution establishing the order of business for the day? Hearing none, the resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House bill 619, I represent a green in the 154th Bill, will be Todd and Act to men and act providing a new charter for the city of Donald's Bill. And for a governmental coordination. House bill 620 by resident, the handy end of the 80 first, Clark of the 100th, Campbell of 171st, Martinez of the 113st, the 99th and others, Bill, will be Todd and Act to men. Chapter 4, Todd I, the official go to Georgia, annotated, relating to holidays and observances. Special rules. House bill 621 by resident, Baker, the 64th, Henderson of the 113th, Cummings of the 39th, Glazed the 67th and complain to the 100th and others, Bill, will be Todd and Act to men, article on the chapter 3, a title 35, the official go to Georgia, annotated, relating the general provisions regarding the Georgia Bureau of Investigation. Public safety and homeland security. House bill 622 by resident, a quarter of the 174th, Bill, will be Todd and Act to men, act providing a new charter for the city of Hoboke. Andrew, government, coordination. House bill 623 by resident, a Smith of the 18th, Huddleston of the 72nd, Howard of the 71st, Bill, will be Todd and Act to authorize the assessment and collection of a technology fee. Andrew, government, coordination. House bill 624 by resident, a Smith of the 18th, Huddleston of the 72nd, Howard of the 71st, Bill, be Todd and Act to authorize the assessment and collection of a technology fee. House bill 626 by resident, a quarter of the 21st, Bill, be Todd and Act to amend, code section 175, 71 of the official go to Georgia, and the general provisions regarding the assessment and collection of a technology fee. House bill 626 by resident, a quarter of the 21st, Bill, be Todd and Act to amend, code section 175, 71 of the official go to Georgia, and the general provisions regarding, out an act to amend, code section 175, 71 of the official go to Georgia, and the general provisions regarding the preservation of a defense. Judiciary non-civil. House bill 627 by resident, a person here with 119th Canada, and the 170nd Hiddleston of the 61st, Smith of the 18th, lumps into the 12th and others, Bill, be Todd and Act to amend, Todd, a 15 of the official go to Georgia, and the general provisions relating the courts. Judiciary non-civil. House bill 628 by resident of camp, the 135th Crow, the 118th, lumps into the 12th, and weed hour of the 121st. Bill, be Todd and Act to amend, article 2, chapter 7, the total 48. The official go to Georgia, and it's related to the impositionary computation, exemptions, and credits for income taxes. Wave and means. House bill 629 by resident of Hawkins, the 27th, Cooper, the 45th, new, the 127th, Green, the 154th, Mithiac of the 82nd. Bill, be Todd and Act to amend, part 3, and 16, chapter 2, and title 20 of the official go to Georgia, and it's related to health. Health. House bill 630 by resident of weed hour, the 121st, Ridley the 6th, Cooper, the 174th, Prince, the 132nd, Reeves, the 99th, and others. Bill, be Todd and Act to amend, chapter 47, the total 43 of the official go to Georgia, and it's related to used motor vehicles and used motor vehicle parts dealers. Regulated industries. House bill 631 by resident of McQueen, the 61st, herring of the 145th, glazed the 67th, buried, this 56th, and Hullaliye the 59th, and Bill, be Todd and Act to amend, code section 222, 212, with the official go to Georgia, and it's related to salary schedules for professionals. Education. House bill 632 by resident of bond of the 73rd, Jenkins, the 136th, Blackburn and the 146th, Holcomb, the 101st, Williams, 168th, and others. Bill, be Todd and Act to amend, chapter 12, the total 43, the official go to Georgia, and it's related to disabled veterans and blind persons. Regulated industries. House bill 633 by resident of base, more of the 69th, the glazed the 59th, herring of the 52nd, and Oliver the 84th. Bill, be Todd and Act to amend, chapter 2, the total 21 of the official go to Georgia, and it's related to elections and primaries generally. Is this 33th? Governmental affairs. House bill 634 by resident of baritone, 24,179, Jones to the 25th. Chasros, the 11th, Jones to the 47th and others. Bill, be Todd and Act to amend, article 33, chapter 2, total 20 of the official go to Georgia, and it's related to the Georgia special needs scholarship act. Education. House bill 635 by resident of wheat hour, the 121st, fri, the 122nd, leaves the 99th person here, the 119th Franklin, the 160th and others. Bill, be Todd and Act to amend, chapter 41, the total 43, the official go to Georgia, and it's related to residential, commercial, general contractors. Regulated industries. House bill 636 by rep, set a McQueen to the 61st, bell of the 75th. Barry, the 56th. Canada, the 58th and Willis to the 55th. Bill, be Todd and Act to amend, chapter 6, the total 16 of the official go to Georgia, and it's related to sexual offenses. Judiciary non-civil. House bill 637 by rep, set a coming to the 39th, Cooper, the 45th, Wilkerson, the 38th, Smith, and 41st. Campbell, the 35th. Bill, be Todd and Act to amend, and act to amend, and act creating the board of commissioners for Cobb County, Georgia. Andrew, governmental coordination. House bill 638 by rep, set a come to the 53rd, Holland to the 54th, Lolli, 59th, Evans to the 57th. Jones to the 60th and others. Bill, be Todd and Act to amend, article 2, chapter 9, and the total 32, and the official go to Georgia, and it's related to margar. Urban affairs. House bill 639 by rep, set a weed hour, 120 first, half-stration to the 104th. Cox to the 28th, gains to the 120th, Jasper to the 11th and others. Bill, be Todd and Act to amend, chapter 11 to the total 15, and the official go to Georgia, and it's related to the juvenile code. Judiciary juvenile. House bill 640 by rep, set a martin, 49, Jones to the 47, Jones to the 25th, Iowa to the 50th, Hilton to the 48th. Bill, be Todd and Act to amend, and act to amend, consolidate, create, revise, and supersede. Andrew, governmental coordination. House bill 641 by rep, set a limb of the 98th, meet the act of the 82nd, work eyes to the 157th. Drenner of the 85th, Lepton of the 83rd, and others. Bill, be Todd and Act to amend, chapter 3, a total 46, the official go to Georgia, and it's related to electric services. Energy utilities and telecommunications. House bill 642 by rep, set a limb of the 98th, carpenter of the 4th, Iowa to the 50th. Bill, be Todd and Act to amend, part 3 of Article 16, chapter 2, a total 20, Lephysico to Georgia, and it's related to student health. Education. House bill 643 by rep, set a tiles to the 179th, Hilton to the 48th, ballot, and 147th, Rice to the 139th, Dubnik to the 29th, and others. Bill, be Todd and Act to amend, Article 27, chapter 2, a total 20, Lephysico to Georgia, and it's related to alloydering, or disrupting schools. Education. House bill 644 by rep, set a tiles to the 179th, Stevens, 164th, Buckner, the 137th, Taylor, the 173rd, Apollo, the 33rd, and others. Bill, be Todd and Act to amend, Code section 12, 2, 2, with the official go to Georgia, annotated, relating the environmental protection division. Natural resources and environment. House bill 645 by rep, set a limb of the hood, and the 175th, Cooper, the 45th, Carper to the 4th, Corber to the 174th, and Williams, 148th. Bill, be Todd and Act to amend, Article 1, chapter 7, and a total 31 of the official go to Georgia, and it's related to regulation of hospitals and related institutions. Human relations and aging. House bill 646 by rep, set a stance into the 150th, way to the 9th, Jackson, 128th, Reese, the 140th, Haring, and the 145th. Bill, be Todd and Act to amend, chapter 16, Title 45, and the official go to Georgia, annotated, relating the coroners. Public safety and homeland security. House bill 647 by rep, set a stance into the 2G, the 100th, 5th, frustration to the 104th, and McCollum of the 30th. Bill, be Todd and Act to amend, and act to incorporate the city of Mulberry. Intra-Government of coordination, general. House bill 648 by rep, set a scope fetal, 60th, burnt, burn out of the 77th, Miller of the 62nd, and Jackson of the 68th. Bill, be Todd and Act to amend, and act providing a homestead exemption from the city of College Park, ad valorem taxes. Intra-Government of coordination. House bill 653 by rep, set a ribly, the 22nd, bombed, to Hanna, the 17th, Horn of the 3rd, Camp of the 135th, Roman of the 97th, and others. Bill, be Todd and Act to amend, Title 46, the official go to Georgia, annotated, relating to public utilities and public transportation. Agriculture and consumer affairs. So, spend just for a minute, Mr. Clinton. It's a great day to be in Georgia just no doubt about that, and I'm new y'all are celebrating that. Thank you, members, proceed, Mr. Clerk. House bill 654 by rep, set a Campbell of 35th, aisle of the 50th, Wilkerson of the 38th, Clark of the 100th, Westbrook of the 163rd. Bill, be Todd and Act to amend, Article 1 of chapter 24, Title 33, the official go to Georgia, annotated, relating to general provisions regarding insurance. Insurance. House bill 655 by rep, set a rib, Hilton of the 48th, per chat of the 176th, Clark of the 100th, Carper of the 4th, Saints of the 180th, and others, of billed, to be in title, Act to amend, Article 2, Chapter 7, and Title 48, the official go to Georgia, annotated, relating to imposition, rate, computation, exceptions, and credits for income taxes. Whoays and means? House bill 656 by rep, set a Saints of the 180th, and Stevens, the 164th, of bill, and being title, Act to amend, Chapter 71, and Title 36, the official go to Georgia, annotated, relating to development, impact fees. House bill 753, and government affairs. House resolution 392 by rep, and a corporate of the 174th, Paul of 33rd, Weed Hour, the 21st, Ridley of the 6th, Smith of the 138th, resolution, creating the Joint Senate Committee, on the State Board of Registration, to use motor vehicle dealers. Regulated industries. House resolution 393 by rep, on the scope field of 63rd, Davis, the 87th, Scott of the 76th, Jackson, the 68th, Drenner, the 85th, and others. Resolution urging the General Assembly, to enact a workplace, safety, and heat protection act. Industry and labor. House resolution 394 by rep, set a Campbell 35th, Hugoly, the 141st Barnes, 86th, Trian of the 80th, Samson of the 153rd, and others, all of us. Special rules. House for rule. House resolution 395 by rep, sent a cannon of the 58th miller, the 62nd, Clark of the 108th, Baysmore of the 69th, Paris, the 142nd, resolution designating the month of May, as maternal mental health awareness month. Public and community health. House resolution 396 by rep, sent a Campbell 35th, The 141st milliliters, the 62nd, glazed the 67th, Howard the 129th and others, resolution proposing an amendment to the Constitution so as to authorize the General Assembly to provide by law. Appropriations. House resolution 397 by Gretzend of Cooper, the 45th, Silcox, the 53rd, Newton on 27th. Howell the 50th Hawkins, the 27th, resolution creating House Study Committee on Health Care, Health Care Quality and Reporting. Health. House resolution 398 by Gretzend of Ridley, the 22nd, Mopton, the 17th, Horn of the 3rd, Camp of the 135th and Roman of the 97th, resolution proposing a amendment to the Constitution, State of Georgia so as to rename the Georgia Public Service Commission. Energy, utilities and telecommunications. House resolution 399 by Gretzend of Santos, the 117th, Holley, the 116th, Clark, the 100th, Hawkins, the 27th, Cameron of the 1st and others, the resolution creating House Study Committee on one-way street markings. Transportation. House resolution 400 by Gretzend of Hefner, the 130th, Douglas the 78th, Glazed the 67th, Gamble the 15th and Way to the 9th. Resolution proposing a amendment to the Constitution, the State of Georgia so as to authorize the General Assembly. Ways and means. Senate Bill 40 by Senator just hatched the 50th, Goode to the 51st, and in the Vartee of the 31st, and Robertson the 29th, Bill V. Todd, an act of a men article 14, chapter 1, a title 10, and the official go to Georgia and Tate relating the secondary metal recyclers. Gregio, lighted industries. Senate Bill 79 by Senator Goodman, the 8th, Strickland, the 42nd, Kennedy, the 18th, Tillery the 19th, Goode to the 51st and others. Bill V. Todd, an act of a men, a title 16, the official go to Georgia and Tate relating the crimes and offenses. Judiciary non-subtle. Senate Bill 123 by Senator Kennedy, the 18th, Hickman of the 4th, hatched the 50th, Goode to the 51st, Robertson the 29th and others. Bill V. Todd, an act of men, subpar to part 1 of article 16, chapter 2, a title 20 relating the compulsory attendance. Education. Senate Bill 130 by Senator Hodges, the 3rd, still the 48th, Watson, the 1st, Krapatric, and the 32nd, Hickman of the 4th. Bill V. Todd, an act of men, a title 31, the official go to Georgia and Tate relating the health. Health. That completes First Readers. Second reading the bills and resolutions, the clerk will read. House Bill 593 by Representative Green of the 154th, the bill to provide the future elections to the officer private judge of Baker County. Shall be nonpartisan elections. House Bill 594 by Representative Green of the 154th, the bill to amend an act created a board of commissioners of Baker County, House Bill 595. The bill to amend an act providing a home state exemption from early counties, school district, and the floor taxes. House Bill 596 by Representative Canada, 170 second, the bill to authorize the assessment and collection of a technology fee by the State Court of Colquitt County. House Bill 597 by Representative Donald Chichy of the 105th McCallum of the 30th, Scofield of the 63rd, C-Ball of the 34th Scott of the 76. A bill relating to imposition rate, computation exemptions, and credits relative to income taxes. House Bill 598 by Representative Robert to the 52nd Miller of the 60th, the Kendrick of the 95th, Scofield of the 63rd, Evans of the 57th and others. A bill relating to persons and their rights. House Bill 599 by Representative Donald Chichy of the 105th Blackburn of the 146th, or one of the 32nd, airheart of the 36th, or the 53rd, a bill relating to retirement, allowances, disability benefits, and spouses benefits. House Bill 600 by Representative Jackson of the 68th, and a claim to the 109th, Holly of the 116th Sanchez of the 42nd, Alexander of the 66th and others. A bill relating to labor and industrial relations. House Bill 601 by Representative Jackson of the 68th, out of the 50th Mitchell of the 88th Draper of the 90th Sanchez of the 42nd, a bill relating to dangerous instrumentalities and practices, employment training of peace officers, organization administrative relative to emergency management. House Bill 602 by Representative Fleming of the 114th, Barrett of the 24th, Scott of the 14th, Carpenter of the 4th, Kelly of the 16th and others. A bill relating to General Prophisions Relative to Education. House Bill 603 by Representative Irwin of the 32nd, and Bill to authorize the assessment and collection of a technology fee by the ProBake Board of Banks County. House Bill 604 by Representative Jackson of the 11th, Cox of the 28th, Tarvon of the 2nd, Powell of the 33rd, Relative of the 22nd, a bill relating to elections and primaries. House Bill 605 by Representative Lim of the 98th, Roberts of the 52nd, Lepton of the 83rd, a bill relating to General Prophisions related to the Department of Public Health. House Bill 606 by Representative Lim of the 98th, Lepton of the 83rd, a bill relating to Ferris of the, Fair Access to Insurance Requirements. House Bill 607 by Representative Lim of the 98th, Lepton of the 83rd, a bill relating to the Department of Public Health. House Bill 608 by Representative Reese of the 140th, Hugh Glee of the 141st, Price of the 139th, Buckner of the 137th, Smith of the 138. A bill to amend and act creating the Muscogee County School District. House Bill 609 by Representative Reese of the 140th, Hugh Glee of the 141st, Price of the 139th, Buckner of the 137th, Smith of the 138th. A bill relating to redevelopment, Powers of the 610th, by Representative Reese of the 140th. Hugh Glee of the 141st, Price of the 139th, Buckner of the 137th, Smith of the 138th. 1338, the bill relating to redevelopment powers House Bill 611 by reps and 1110, the 12th, itch ends of the 161st Carpenter of the 4th, Anderson of the 10th, the Lodge of the 167th. A bill relating to control of water pollution and surface water use. House Bill 613 by reps and submit the 18th Jones of the 25th, where kinds of the 157th, itch ends of the 161st, Evans of the 57th and others, a bill relating to the Department of Administrative Services. House Bill 614 by reps and Jones of the 47th, Thomas of the 21st, Martin of the 49th, the bill relating to prohibited fireworks. Activities and application of noise ordinances. House Bill 615 by reps and P3 of the 160, Stevens of the 160, fourth, Gallio of the 160 second, Hitchens of the 160 first, Jackson of the 160, fifth, the bill to amend and act creating the Chatham County Recreation Authority. House Bill 616 by reps and remodeled the 97th, Friday of the 120 second, Hall of the 160th, the Barrier of the 56th, a bill relating to income taxes. House Bill 617 by reps and remodeled the 97th, Ridley of the 22nd, the 12th, the 13th, the 13th, the 13th, the 135th, and others. A bill relating to public utilities and public transportation. House Bill 618 by reps and a Campbell of the 171st, a bill relating to property. House Bill 649 by reps and the bened of the 94th, Oliver of the 84th, to believe the 141st, Jones of the 25th, a bill relating to general provisions relative to insurance. House Bill 650 by reps and a bill of the 75th, Gallio of the 160 second, Paris of the 140 second, Jones of the 60th, Westbrook of the 160, third, and others. A bill relating to courts, professions, and businesses, property, and public employees, and officers. House Bill 651 by reps and pal, the 33rd corporate of the 174th, are one of the 30 second, per shed of the 176 waves and the 112th and others. A bill relating to speed detection devices. House Bill 652 by reps and Jones of the 25th, Jasper of the 11th, Smith of the 138th, welcome the 101st Hilton of the 48. A bill relating to motor fuel tax. House of resolution 367 by reps and the 102nd, Tarvan of the 2nd, hugely with the 141st reefs of the 99th, Williams of the 168th, the resolution proposing an amendment to the consultation, just to provide the members of the General Assembly elected in 2028, and thereafter shall serve four year turns of office. House resolution 368 by reps and a sands of the 180th, work items of the 157th, statements of the 164th, Ballinger of the 23rd Townsend of the 179th, a resolution creating the Joint Study Committee on intoxicating cannabinoids and consumable hemp products. Senate Bill 13 by Senator Summers of the 13th, tellery of the 19th, the average of the 56th, counter to the 46th, Robertson of the 29th and others. A bill relating to the Georgia Environmental Finance Authority has Senate Bill 28 by Senator Dullesall of the 27th, Kennedy of the 18th, goods of the 51st, Annabarthe 31st, Robertson of the 29th and others, the bill relating to the General Assembly Health and State Government. Senate Bill 72 by Senator Brass of the 6th, Kirkpatrick of the 32nd, Dullesall of the 27th, Strikland of the 42nd, Walker of the 20th, and others, a bill relating to terminally ill patients right, to try investigational drugs, biological products and devices. Senate Bill 125 by Senator Walker of the 30th, the 20th, the sets of the 37th, Kennedy of the 18th, Strikland of the 42nd, Brass of the 6th and others, a bill relating to professional engineers and land surveyors, through second readers. The bill is on the right. Reports of standing committees, Mr. Clerk, will you read? President Matatcha, the 150th District Chairman of the Committee on Appropriations submitted the following report. And to speak, your committee on appropriations, Senator, it's consideration following bills and resolution in the House, and instruct the meeting reports, saying back to the House of the following recommendations, House of Resolution 29, do pass by committee substitute, House of Resolution 130, do pass House bill 579, do pass by committee substitute. Respectfully submitted, Representative Matatcha, the 150th District Chairman. Representative Chuck Martin, the 49th District Chairman of the Committee on Higher Education submitted the following report. We just speak to your committee on higher education, as that under its consideration, following bills of the House, instruct committee reports, saying back to the House, with the following recommendations, House Bill 5060, pass by committee substitute, House Bill 385, do pass by committee substitute. Respectfully submitted, Representative Chuck Martin, the 49th District Chairman. Representative Beth Campel, the 135th District Chairman of the Committee on Intergovernmental Court Nation, local submitted the following report. Mr. Speaker, your committee on Intergovernmental Court Nation,\n\nThe House and the Senate is a struck-to-midi report, same back to the House of Filing Recommendations. House Bill 411, due pass by substitute. House Bill 538, due pass. House Bill 553, due pass. House Bill 568, due pass. House Bill 591, due pass. House Bill 592, due pass. Senate Bill 137, due pass. Respectfully submitted, Representative Beth Camp, the 135th District Chairman. Representative Sharon Cooper, the 45th District Chairman of the Committee on Public and Community Health submitted the following report. Ms. Speaker, your committee on public and community health has that done in her its consideration. The following builds the House and instruct them to report same back to the House and the following recommendations. House Bill 291, due pass by committee substitute. House Bill 471, due pass by committee substitute. House Bill 506, due pass. House Bill 584, due pass. Respectfully submitted, Representative Sharon Cooper, the 45th District Chairman. Representative Clint Crow, the 118th District Chairman of Committee on Public Safety and Homeland Security submitted the following report. Ms. Speaker, your committee on public safety and Homeland Security has had it under its consideration. Following builds the House and instruct them to report same back to the House and following recommendation. House Bill 238, due pass by committee substitute. House Bill 518, due pass by committee substitute. House Bill 549, due pass. Respectfully submitted, Representative Clint Crow, the 118th District Chairman. Representative Hagen and the 156th District Chairman of Committee on rural development submitted the following report. The speaker, your committee on rural development has had it under its consideration. Following build the House and instruct them to report same back to the House and following recommendation. House Bill 262, due pass by substitute. Respectfully submitted, Representative Hagen and the 156th District Chairman. Representative Mike Chokus, the 151st District Chairman of Committee on Small Business Development submitted the following report. To speak to your committee on small business development, as had under its consideration. Following build the House and instruct them to report same back to the House and following recommendations. House Bill 250, due pass by committee substitute. Respectfully submitted, Representative Mike Chokus, the 111st District Chairman. I completes the reading of the report's standing committees. Okay members, you may want to get closer to your desk or closer than you are now because we do have a local calendar. We have a local calendar. We now have the third reading and passage of the uncontested local bills. If there is no objection, we will move on the local calendar as a whole with a recorded vote. Here he none in this order. Mr. Clerk, will you read the local calendar? House Bill 411, by substitute by reps that are one of the 32nd Banks County, House Bill 538 by reps. I have Chokus, the 151st Schlige County, House Bill 553 by reps. I have stints into the 150th Taylor County, House Bill 568 by reps. I have Skoggins, the 14th City of You Will Harley. House Bill 591 by reps. I have Gunner, the 8th City of Cleveland, House Bill 592 by reps. I have Gunner, the 8th City of Cleveland, Senate Bill 137 by Senator Dixon, the 45th City of Mulberry. Is there any objection to the previous question being ordered on the local calendar? Here he none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Here in the report of the committee is agreed to. These bills now pass. All those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machines on the pasture of the bills on the local calendar? Will the yeas or 169s, the nays or zero, these bills haven't received your requisite constitutional majority or therefore passed? Members, we have a lot of friends in the gallery. We want to give each and every one of you a chance to recognize them and thank them for being here. We have a whole slew of morning orders again today and I will remind y'all what those lights mean. And when you're in the well making your comments, you get a little warning, then you get a cut off. So I hope everyone will respect their neighbor and not take over one minute on your morning order. We're going to begin our morning orders by recognizing Chairman Yerda. Representative Bill Yerder from Downsville, Vestraway is recognized for a morning order. Give the gentleman the well your attention please. Thank you, Mr. Speaker. Today is Georgia Municipal Court Clerks Day at the Capitol. Founded in 2006, the organization has composed a dedicated municipal court clerks all over the state. Members of the Georgia Municipal Court Clerks Council are court professionals who embody a profound commitment to the ethical and effective management of our Georgia judicial system. They're with us today and I believe they're up here to my left and let's give a warm welcome to the Capitol. Thank y'all for being here and I will appreciate that and thanks for keeping our cities on the move. Keep everything in order. Representative Liam, you're recognized for a morning order. I think you have friends coming with you by yourself. We're up there. Loved in your next. Loan deck. We're up there. Thank you, Mr. Speaker. I am pleased to welcome back the Hopkins Elementary School from Gwinnett County Public Schools here today. They're already standing so wave there in the red. Hopkins excels in many things. I've talked them about them at this well before but among other things in just the last year alone, the robotics team has won a slew of awards including at the state robotics competition at UGA, best showcase, and third overall. And Hopkins was also recognized as county winner in implementing the Georgia Department of Education's Evidence-based Positive Behavioral Interventions and Supports Program. So let's give them a hand and welcome them back to the Capitol. Thank you, Mr. Speaker. Thank you, Ms. Lim. Way to go Hopkins. Boy, all strong. Good to have you back again. Keep up a good work. Reps even loved and is recognized for a morning order. Give the letter to your attention, please. Let me get my stuff fixed there. Hi, I come to you today. Thank you, Mr. Speaker. I come to you today to honor another author from my district today. Mike Coleman, a long time Georgia resident, has been honored as recipient of the 2024 Georgia Author of the Year Award for his memoir, The Way From Me To Us. A writer for nearly 45 years, he received awards for news reporting and writing in the non-profit and technology sectors. His work extends beyond memoir having authored an Aquarium for Georgia, a commemorative book on the construction of the Georgia Aquarium. Please welcome Mike Coleman and his partner Ted today as we celebrate the his achievement. Thank you, Mr. Speaker. I yield you got some great talented people in your district doing great. Represented you for now. You're recognized for morning order representing the Stinson, your own deck, and then reps any baker you're right behind her. Reps any burnout. Thank you, Mr. Speaker. Today is DJ Day in the in the in the capital. DJs play a very important role in making sure if a record becomes a hit or not. DJs are the ones that could cut a record. They bring people together and us responsible for shaping the culture. I want to thank D. Heel for always thinking about those in the radio industry. Would you all please stand up the DJs that are here? Thank you, Mr. Speaker. Welcome to our DJs. Our disc jockeys appreciate y'all bringing great entertainment to us. Represented you Stinson and friends. Good morning. Good morning. Bringing her support staff. Good morning. Good morning. Oh, Fort Valley. Okay. Good morning. Good morning. Good morning. Thank you, Mr. Speaker. Today is a great day in the state of Georgia because we're so blessed to have in the gallery. Alumni of D for Valley State University. D. All been in state university and D is a Valley State University. Thank you. Welcome to your state capital. Thank you. Thank you, Mr. Speaker. A lot of these. Let me tell you, you do a lot better job than I do of that. I can guarantee you. Thank y'all for being here. It's a special day. Thanks for being in the house because this is the people's house. Repsented baker. There she is. And some friends. Recognized from Morning Order. Ladies recognized. Thank you, Mr. Speaker. Today is Douglas County Day at the Capitol. And we are honored to have visiting officials and leaders from Douglas County, including members of the Board of Commissioners, the Chamber of Commerce, and other distinguished community representatives joining us in the gallery. So with all of our Douglas County officials, please stand and colleagues. Please join me in welcoming and thanking them for their dedicated service to our community. Thank you, Mr. Speaker. Thank you, Representative. Thank you. Good to have Douglas County here. We appreciate you. Which I'll do a great place to live, work, and raise a family. Representative, Representative Dr. Owl is recognized for a Morning Order. And friends. Good morning. I rise to recognize our friends from communities in schools at Lanta for joining us today at the People's House. Can you please stand and be recognized? Hi, guys. Communities in schools. Community in schools helps Metro Atlanta students facing some of the steepest barriers to achieve academic success and graduate. I particularly appreciate their advocacy for Gun Violence Prevention, which is a huge priority for young people all over the state. Thank you for your commitment to our students. And thank you to our students for helping us with our work. Welcome to your state Capitol. And we are pleased to present you with House Resolution 413. Thank you, guys. Thank you. Representative, I'd like to thank you, and friends, the gentleman's bringing some friends with him. Give the gentleman and the ladies and the way you're attention, please. Come on, friends. This is a good morning order. The gentleman's recognized. Thank you, Mr. Speaker. Today is African Day of the Capitol. All right, all right. We'd like to welcome members of our community, the African Diaspora, especially those who are being recognized with resolutions. I'll call their names because we have a short time. Dr. Fermi Ashwini from Alpha Redder. Mr. Cardi, I declare president of the Capitol. Mr. Cardi, I declare president of the Alliance of Nigerians of Organization of Georgia. Nancy Araqba, a founder of strategic solutions, global, and global leadership. Mr. Adafee Johnson, a professional clinical research principle focus in advancement treatments, and also chairman of the One Voice Africa. And finally, I also like to recognize Mr. Tashome Gabbara, Lassie, who is the Ethiopian Airlines Traffic and Sales Manager. So those of you that fly the world, Ethiopian Airlines is one airline to take care of. We appreciate you, and African Day. Thank you, Mr. Speaker. I yield the well. Good day. We appreciate that announcement. Well, here's a little more. Go ahead. We just want to say a big thank you to our original advisory council members who are always here and presently and in spirit. We thank you for your contributions. Thank you, Mr. Speaker. Absolutely. Thank you all for everything. Appreciate you being here today. Representative Jasper, chairman Jasper's recognized for a morning announcement. And friends, he has a couple. Yes, sir. I had the search, didn't I? You did. Well, thank you members. We're recognizing today is the Georgia Airports Association Day. You know, there's 95 general aviation, aviation airports and seven others. And they're essential to our economic power within the state. You know, they serve our states in many ways. But these folks who are here today provide leadership to these airports across our state. And we appreciate them. You know, they create an unbelievable impact financially in their state. You know, we're talking about the big hearts filled down to the medium to the small one. 74 billion dollars of economic impact. And a payroll while shocked. I read this of 20 billion dollars. You know, they're they are vital to our state. Large, medium and small. We salute their dedication to making sure that aviation transportation is safe. And that's why we recognize them today. And if they're in the up there, I think the moon between the house and the Senate. Well, they are right there. Please, let's welcome them and thank you for being here today. Yes. Appreciate y'all's work. Thank you all for being here today. Aviation and is a real plus for our state. And we appreciate it. Everyone that is contributing that in a positive way. Thank you for that. Good to have y'all. Chairman Chokus. Recognize your morning order. Thank you, Mr. Speaker. I have with me the AP government and the student government from Southland Academy. They're up in the gallery and they're accompanied by William Wux, who's a head of the dean of the students and Paddy Webb, who's head of the school. Ethan Beck is also there, the president of the student government. Stand up guys. And I just want to say one more thing. 24% of the students for the last four years have gone to the University of Georgia. So they're really strong bulldogs. And then also they've implemented over a year ago, Bell to Bell, no sell. So we're real proud of our student government or our AP government classes at Southland. Go writers. Thank you. Thank you, Mr. Speaker. Thank you, Reverend Chokus. Good to have y'all. Thank y'all for making the long trip up. Hope you have a good day here and safe travels when you head back home. But appreciate everything you're doing. The charity Dimsy is recognized. Literally, your group will be next. And she has friends. The charity Dimsy has friends. She got lots of friends. They're growing, aren't they? Thank you, Mr. Speaker. Good morning. Today we have a distinguished group joining us in the gallery. Representatives of Georgia's Community Service Boards. We recognize today as we celebrate Community Service Boards Day at the state Capitol. There are 22 service boards that serve a vital role in our state's public safety net, providing essential behavioral health and developmental disability services to those most in need. They work tirelessly to support individuals with serious mental illness, intellectual and developmental disabilities and addictive diseases, especially those who have no insurance or limited means to pay for care. Each CSB is governed by a dedicated board of directors, volunteers who are appointed by local county authorities, ensuring that services are tailored to meet each of our unique communities. Through their commitment and expertise, they have built a strong reputation for delivering high quality, cost-effective care that improves the life of thousands across our state. Please join me in welcoming each of these groups that do so much to help us every day. Thank you, Mr. Speaker. Thank you, Representative. Welcome to the CSBs. We appreciate what y'all do for our people and all over this state. Thanks for being here this morning. Little Higley and the Columbus delegation. Columbus delegation led by Little Higley right here. Y'all give the lady your attention in the well, please. Thank you, Mr. Speaker. Ladies and gentlemen of the House. We are honored today to have a group of students from Jordan High School in Columbus, Georgia. You might pronounce it Jordan, but in Columbus, we pronounce it Jordan. And so we're happy to have them and their teachers with us. These are ninth graders and they're excited to be at the cabins to learn about what we do. So you all stand and let us greet you this morning. Jordan. Jordan High School, good to have y'all. Thanks to making the trip over from Columbus. We're glad to have you. Hope you all have a good day here. Representative Richardson is recognized for a morning order. And gentlemen from down in Columbia and Big Duffy County, you got, you buy yourself. You got some folks up there. Well, we all working that friend thing all the time. No doubt. Gentlemen's recognized. Thank you, Mr. Speaker. I'd like to welcome Columbia County youth leadership to the people's house this morning. A group of 26 fine young high school students. And I don't think they're in the gallery right now. I think they had an appointment over the the deal lost center, but I did want to welcome them and thank them for coming up and participating. Thank you. Thank you, sir. Welcome to the Capitol. They're around here someplace. I'm sure. Representative Bell is recognized for a morning order. Representative Eric Bell. He's got a support team with him too. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Today is the fifth annual Black Mill Education Appreciation Day, recognizing the positive impact and influence of Black Mill educators, teachers and fathers in the state of Georgia. This event was started by Georgia Educators Jason B. Allen, his students and the Spalding Griffin Board of Education, Chairman, Centel Arb Brown, and former Representative Felicia Stovall. This day is designed, this day is designed to celebrate the involvement and impact of Black Mill educators, communities and fathers in their schools. One of these events are sponsored by the National Parenting Union. We also acknowledge it under the contributions of the following Black Mill educators in our schools and communities for the state of Georgia and the honorees of this year's celebration. The group is in the gallery and can they stand and be recognized for the amazing educators and fathers they are and we give them a round of applause and support for the educational system here and what they do for the state of Georgia. Thank you. Thank you, Representative. Appreciate those contributions. Makes it all. Thank you. Take a little along. You're good. You're good. There was those guys behind you holding you in the well. I know what it was going on. Good job. That completes our morning orders. I don't think we missed anyone. We're ready to move on to the rules calendar. We'll move on to the rules calendar. Mr. Clerk, were you read the caption to House Bill 143? 143. House Bill 143, my name is Dickie, the 134th and others to be entitled back to men chapter 5 and title 12. The official go to Georgia and Tate relating to water resources so as revised provisions regarding water measuring devices for farm use of surface and groundwater. Let's bill them for the committee on natural resources environment. That committee recommends this bill do pass by committee substitute. Ready, Mr. Chairman? Chairman Dickie is recognized to present the bill. Distinguished members this morning I bring you 8-speed 143, high agricultural water meeting legislation and it's the part of the BLEPD and I just want to thank them results of a year-long engagement and conversations with farmers and everyone involved. I really want to call out Chairman Smith for her work many, many years ago, 10 years or more and Chairman McCall for putting in place and others in this room. Our water measuring program for Georgia farmers in that area. But EPD has done a great job listening to the needs and also trying to protect our valuable water resources. Directed to Jeff Cown and watershed protection chief Anna Tuzinski and Margie Ruttmore for listening to farmers and helping craft this legislation. Keep in mind all along is spent to make modifications in the suspension area so we can increase irrigation opportunities for farmers. But it's also important that the state maintains a program that clearly and accurately measures the amount of water we use in that area. So the intent of this legislation is to provide a more efficient management of our water meter installation process. It gives the state flexibility. It gives farmers flexibility and removes some requirements for farmers to install some of these meter infrastructures on wells and lakes that do not need the meter at this point. It ensures the state also is following the requirement for the Habitat Conservation Plan to HCP that requires EPD to have robust compliance program. So this legislation will not require additional state funding. Actually it will save the state millions of dollars as well as save farmers estimated 9.3 million dollars. We just must continue to maintain and improve our data and collections for our valuable water resources for our farmers. And that's what this bill does Mr. Speaker and I'd love to take some questions if they're any. Gentlemen seems to have no questions but we do have someone signed up to speak on the bill but you have no questions sir. Thank you Mr. Speaker. Gentlemen as you order the bill we have one speaker we're going to hold you to a maximum of 10 minutes so we'll recognize Chair Lady Smith to speak to House Bill 143 the ladies recognized. Thank you Mr. Speaker and members of the committee. I think the whole state of Georgia now is trying to figure out how to use our resources efficiently. If we live in an urban part and there's rural right nearest maybe there's a huge industry coming in that might consume more water than they think they should. I just want to take a moment here to tell you that the agriculture community has been leading the way for all of us in Georgia to know our resources to measure our resources and to use it effectively and properly. When I was first made Chair of the House Natural Resource and Environment Committee it was 2005. We tried to find these permits that the farmers had and to those of you who aren't born then it was all on paper paper and so we had no idea what we had. We had no idea who overestimated or underestimated. We had no way to control it. Add to that the fact that Florida and Alabama were suing the state of Georgia which stopped so much growth and study of the resources around the state. Reluctantly our farmers in these impacted areas agreed to the first level of measuring the water resources. They were afraid that it would take away something they needed but the wisdom and the knowledge they got for taking that first step has now made them the leaders of the state of Georgia. They know what water they're using they know when they get the rain they know how to be efficient and so I think from them being the harvesters the first ones out to do this it will be also a resource for all of us to know our resources how we need to use them and what's best for the citizens of Georgia and to end this not only is what's happening here so important but it's the state of Georgia now that is an example for the rest of the nation on how to measure and use our water efficiently. I cannot thank all the leaders who gone before me they're so numerous some are now deceased but I thank them for their wisdom but the wisest one of all was Ben Franklin and he said you know you don't know the worth of water until the well runs dry well this is making sure the well never runs dry thank you miss speaker you the well the ladies you are the well it is an objection to the previous question being ordered hearing none the previous question is ordered is any objection to adopting the committee substitute hearing none the committee substitute is adopted is any objection to to agree to the report of the committee which was favorable to the passage of the bill hearing none the report of the committee is agreed to shall this bill now pass all those\n\nThe favor of the pass to the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine? Have all members voted Fort purposes ripped into your to rise Parliamentary inquiry stay jingorian misspoke speakers that not true that this bill one house bill one forty three provides a common sense solution to improve water Management without imposing unnecessary burdens on our farmers I'm sure the former mayor knows of what he speaks because he has a lot of farming down there where he's from a lot of farming If all members voted if so Mr. Clerk will you lock the machine? All in the past of house bill one forty three the yeas are one hundred sixty five the days are zero The bill haven't received the requisite constitutional majority is therefore passed Mr. Clerk will you will you read a caption to house bill one thirteen one one three House of one thirteen by represent a MacDonald twenty six to be in Todd and act to amend Title 50 the fiscal to Georgia annotated relating to state government so it's ribbit the state or its agencies From purchasing good from certain foreign countries or related entities This bill I refer to the committee on governmental affairs that committee recommends a dispel do pass Thank you, Mr. Clerk Rift and glory MacDonald is recognized to present the bill rift and MacDonald Thank you, miss speaker Ladies and gentlemen the house I stand for you with house bill one thirteen critical piece of legislation that's been brought to you by its administrative Piece of legislation from the governor's office aimed at increasing the security of state purchasing process Ensuring the protection of our state's infrastructure and the citizens from a growing cybersecurity threats House bill one thirteen directs the Georgia Technology Authority GTA our state's designated cybersecurity exports experts to establish and maintain an updated list of companies and Products that are produced are sold by entities like link to our foreign adversaries as defined by the United States through the Secretary of Commerce The purpose of this list is simple to protect Georgia state agencies Businesses and citizens from security rest that come with foreign made technology that poses potential threats It will prohibit state agencies from purchasing or contracting with these entities determined to be a security risk The list is created by GTA and was served as a valuable tool for the Department of Administrative Services DOS and other state agencies This list will help guide purchasing decisions to ensure that we're not Interferately introducing cybersecurity vulnerabilities into our state systems Why the tech the GTA because GTA already works closely with federal authorities receive critical information about which companies products and Technologies are flagged a security risk on a national level for example certain technologies like drones and Wi-Fi routers have already been flagged by the federal government due to cybersecurity risk Through H.B. 113 we empower GTA to establish this list and make it publicly available This ensures transparency and encourages all Georgia's to be vigilant in protecting themselves Their families and their businesses for from potential cybersecurity threats Additionally, the bill clarifies the role of DOS and enforcement if a company or product is found to be of concern A fine of $250,000 or triple the entire purchase value if greater will be imposed on foreign companies third-party vendors or resellers selling such goods to the state or our state agencies I want to emphasize that we've removed any specific country names from this bill and have adopted the federal definition of foreign adversaries This allows us to remain flexible and proactive as global cybersecurity Landscape continues to evolve this also protects Georgia from litigation several other states or facing relating to state setting foreign policy by naming specific countries Let me be clear H.B. 113 does not have any retroactive component It will only apply moving forward ensuring that as we make future purchase decisions We're going to do so at a high level of security in mind and closing H.B. 113 is about ensuring a safer more secure Georgia It's about taking steps now to protect potential cybersecurity threats that can compromise our state's infrastructure our citizens and our businesses Urge your support of this measure. How you'll find questions, Mr. Speaker? You have a couple of questions. Is the general will yield to your left and back representative Wilkerson has recognized for a question Thank you, Mr. Speaker. Does the gentleman yield? You don't yield. I just have a clarifying question. You mentioned goods, but you also talk about cyber security So if a app was banned by Congress With that applied as something here like could we find a company if they continue to use that app even though an executive order was signed Actually, I'm gonna clarify that tick-tock for example has been banned by Congress But then the president came back and did an executive order that says hold off Does with that kind of app cause problems for people that do business in Georgia? Well, this is going to be determined by GTA and it's going to only be effective for our Georgia purchasing We're not really dealing with apps. It's going to be purchasing certain products through DOS Okay, thank you, sir. Thank you General yield representative Jasmine Clark to your left has a question. Ladies recognized. Thank you, Mrs. Speaker. Does the gentleman yield? Yes So as you know many times The products that we use different parts come from different places and some of those parts are manufactured in Other places and they're not made in the United States like there are not manufacturers that make them in the United States will this bill put Company or will this bill make it to where it's difficult for us to purchase things that Might have one small piece that comes from one of these countries? GTA will be working with DOS any type of components that are made by our foreign adversaries GTA will will use the federal list they will compile comprise this list and they work with DOS to determine if that whether it's a Component part is something that's a cybersecurity risk to Georgia Georgia citizens And does the gentleman further yield yes, so I know you said it's not retroactive But I know that many of us all got brand new laptops that comes from a company that is headquartered and one of these Countries I do believe that is considered an adversary or adversarial company. Is there any concern about the access that is already had? When we like literally just distributed this out to of course it's all Assembly yes, man. There's always concern and that's why we're moving forward with this vital piece of legislation That we'll be looking at that. We're not here though out you know all the laptops that we purchase Currently have but we are monitoring that through our GTA and DOS are working together We are going to be moving forward with our purchases working off a list given by our federal government for our future purchases Thank you gentleman yield to the chairman of the committee which has came Yes, okay, we're here from questions from representative Anderson the gentleman's recognized. Thank you Does the gentleman you yes? Is it not true that the passage of this bill helps this body and the state legislature to perform one of our critical tasks And that is to protect the security of the state of Georgia and its citizens You know what you speak mr. Mr. Chairman. Thank you. It's a good bill mr. Speaker and no other further questions. I yield a well You had a cold, but I will let you yield the well. We'll accept that Thank you sir for the presentation is there an objection to the previous question being ordered Here in under previous question is ordered is there an objection to agreeing to the report of the committee Which was favorable to the passage of the bill Here in under the board of committee is agreed to shout this bill now pass all in favor of the passage of the bill We'll vote yes all those opposed we'll vote no and mr. Clerk will you unlock the machine You Have all members voted for what purposes represent the Thomas rise Parliometry inquiry mr. Speaker stay chain is it not true that this bill will strengthen our local economy by making sure that products are made here domestically Yes, sir, and we need to do that. There you go USA. Thanks for the inquiry for what purposes represent you gamble rise Parliamentary inquiry mr. State inquiry sir. Is it not true that House Bill 113 reinforces Georgia's commitment to safeguarding Its infrastructure and citizens from potential cyber security threats. I'm sure the gentleman has stated it and knows of what he speaks We'll take one last inquiry for what purposes represent the Vermont rise Parliamentary inquiry stay chain quarry. Thank you mr. Speaker. Is it not true that considering the fact the international Fair since it sometimes changed on a dime It's really important that if we are going to do bills like this it is way more all encompassing than to try to You know, um sing along one or two instances that could leave us to even more risk in the future I'm sure the lady believes in those of what she speaks Have all members voted all members voted this so mr. Clerk will you lock the machine? On the passage of House Bill 113 the yeas are 148 the nays are 17 this bill emissary the requisite the constitutional majority is therefore passed Mr. Clerk will you read the caption? The house bill 428 428 house will 428 by reps and a franklin to the 160th and others to be titled an active men chapter one and title 31 of the fish go to Georgia and Tady relating the general provisions regarding Health so it's to codify the right to in vitro fertilization for individuals is bill em For the committee on health Committee recommends that this bill do pass Members this bill is on our supplemental Calendar if you're looking for it if you're looking for it's on it It's the last bill on our supplemental calendar House bill 428 Representative Lehman Franklin from Bullock Bryan Counties and the city of Stakesboro is recognized to present the bill Thank You mr. Speaker So I want to tell you a little bit about what this bill does Well Agenda about suspend just for a moment You Members this may be one of the most important bills bills we consider During this session so I want you to give the gentleman in the well your attention please I'm gonna tell you what this bill does but before I do that I want to tell you what this bill does not do And what this bill does not do is change anything that is not currently being done in Georgia In the guards to in vitro fertilization if you want to if you want to do IVF in Georgia right now You can have it you can do it in the process is there what this bill does do though is it codifies that language Into law so that safeguards that ability and protects it for Georgians and for all of Georgia in the future to be able to do that process in the future That's what it does and that's all that it does So If you have Concerns about the issues surrounding this or you have ideas about it or you don't know where you stand You don't have to worry about this because this bill doesn't go near it It doesn't go anywhere to touch it all it does is codify and put it in the law so you can all Rest easy and vote yes on this bill and feel good about it So you might say well why do we need to do this? What's the importance of it? And I want to tell you a story my own personal story of why it's important and why we need to do it and why we need to take it up in this session so My wife and I we got married later in life and She was doing her own thing, you know, she was working as busy life and she was living up here in Afro-Reta actually I was Working as a missionary in South America and then later on in in southern Europe and Life was just going by Well, we met fell in love and got married and we didn't consider That there may be even an issue of us not having children or that being a problem We just assumed that that would be the case and we both wanted children We both wanted a family and so of course we started to try to have children We got married about 10 years ago and we were unable to do it We tried everything we weren't concerned at first, but then a growing concern became apparent that we were having there was issues So we started to try IVF and we did that multiple times we did the hormone therapy that came with it we even actually We tried adoption at one point and we came along all the way down to the end of that to the last two weeks of adopting And had the attorney the contract all that stuff that goes with it The process that went with it and that fell apart two weeks before we were able to adopt so you can say that This experience for us has been a very emotional one. It's been the highs and lows has been a very emotional Experience throughout this time, but I'm here to tell you today that We did it we did IVF one of the time and it worked and now my wife is pregnant with a little girl and we're we're ecstatic about it Thank you You But I want to add to the point that that story does not end there It's really neat to see that when we when we end up doing this legislation That I went around to get signatures in this body and went talking to people and I found overwhelming support for this bill In fact, I didn't have one day that went by that we didn't have two or three people that would come up to me and thank me for doing the bill Think uh, uh, you know, and then tell their own personal stories about it And it became a whole blessing in itself just to have that experience So it's amazing to see and I and I would bet or I would challenge anybody in this room that no one here in this room Um has not been either directly influenced or affected by IVF or indirectly affected by IVF Everyone that I've come in contact with has had their own personal experience And so I know that we just clapped and cheered for my wife, but I do want to take the time To just introduce her properly to the body and the floor if you don't mind standing up We're gonna do it one more time I think But I want to introduce both to you My wife and my child that's about to be born. There's two So it's a great moment is for sure a great moment um And I just want to end with this if I can if I may That uh, well first of all, I just want to say this to I do not want to let this out The courage in the perseverance and the strength of character that she's demonstrated during this time is unbelievable They eight years that she's lived through to do this. I just have to point that out and it's amazing. I'm so proud of her But colleagues, I want to say to this to you This is a bill that we all should get behind. It's the all that all it's a bill that we all should support And I want to ask you to I want to invite you and I want to encourage you to come along with this journey with us To be able to vote green on this bill with us to push this through to vote yes on this to secure this the For Georgia and for all of Georgian so that they can have the same situation or experience that we've had So with that mr. Speaker if there's not any questions I yield the well gentleman. You have a couple of questions and then there's some speakers on the bill If you're to take a uh, how about two questions. Yes, sir. No problem to your left representative in trade Kelly has a question You're welcome with the gentleman yield ideal Representative Franklin. Thank you for bringing this legislation And isn't it true that by supporting this legislation will also be supporting pro family values that we all hold Dearest Georgians by continuing to allow individuals to get medically proven Processes through to help them grow their families and I'm extremely grateful for that opportunity in Georgia For three-pillar me luck to me joe l rigs and rowing little is that not true in this true I appreciate you saying that and absolutely. Thank you Representative Teddy Reese in the back to your left. Oh in the back. Yes, the gentleman's recognized Thank you mr. Speaker does the gentleman you now you? Isn't it true that as the father of eight-year-old little girl and the husband of a wife who Who we had our own complications with trying to bring a beautiful Child into this world your presence carrying this bill for me Demonstrates fathers like myself who really care About women in their ability to provide children for the family and that we are part of this fight with them We suffer with them we cry with them and we stand with them doing times of joy moment sir I thank you for that now. Thank you for support sir. Thank you And gentleman has no further questions without you the well Thanks to the Franklin family Appreciate both of you We have several speakers. I'm gonna recognize um we have Representative cannon part can't of them are recognized you first. I saw her a moment ago. Maybe So we'll skip man. We'll re we'll recognize represent represent page Speak home Okay Rept. Can you come after a rep's in page? Ladies you'll have just three ladies that will speak three members you have up to seven minutes on the bill Seven minutes In each for each one of you not total. Thank. I won't take that long No, we're up to seven minutes that you will have representative panace Thank you mr. Speaker Today I rise with enthusiasm to support hb 428 This bill will codify the right to IVF treatment so that more Georgians have the opportunity to become parents and expand their families Since last year when a ruling of the Alabama Supreme Court essentially closed down IVF for that state We had leaders from this house who immediately created legislation to protect IVF for Georgians In a bipartisan fashion last year our former colleague Terry and allowats and the gentleman from the 48th each introduced legislation This year I'm grateful for the leadership that the author and the speaker have provided to move this necessary bill forward I'm honored he invited me to work with him on this bill and that my input was incorporated Like the author this is personal to me too My daughter who is 25 years old developed a tumor Causing her to lose one ovary and one philopian tube last year while we were in session While the tumor was benign. Thank God Genetics has given her an elevated risk of cancer Because she is not yet ready to start a family She will need to take advantage of fertility preservation that accompanies IVF And I'm hopeful that the state won't stand between me and my future grandchildren In Judaism it is God's first blessing to the world And we see it as the very first commandment to be fruitful and multiply After the flood God repeated this commandment after Genesis to Noah And God blessed Noah and his sons and he said to them Be fruitful and multiply and fill the earth and God I don't want to you know say no Every family deserves the opportunity to bring new life into this world when they are ready I urge your favorable vote on this bill because it is literally for the children Thank you mr. Speaker I yield the well Thank you, Representative pennies. Thank you for your work on the bill and we certainly Continue to say a prayer for your daughter and we know that'll work out fine Ripley park canon is recognized to speak to the bill the lady has up to seven minutes Thank you mr. Speaker. Thank you members today I rise and support of this bill I wanted to just speak about the impact that in vitro fertilization procedures Have on the LGBTQ community and I want to thank those who are here today to stand in support of the LGBTQ community You see as we decide to Grow our families many times it's important that we have access to either intra-uterine insemination or to in vitro fertilization and that really depends on the way in which we're family making So I'm going to give you some information on this that maybe if you weren't a doula or you didn't have to go through these procedures You might not know so ultimately if there is somebody who wants to have a biological connection to their child and Are of the same sex both female then one of those individuals would be able to use their egg and to just state it or They would be able to actually have an egg fertilized and then implanted in them and that would create that biological connection and then say that person wanted to have still that biological connection on their side They could have a family member Donate sperm and so you would have the non-gestational partner and then the gestational partner both biologically connected or of course you could just have that person who's just stating With somebody else's egg and with somebody else's sperm So this piece of legislation. I'm in support of it because it's really just the tip of this conversation It really just starts There are states that have a more codified more defined right to IVF I do think that the lines um 22 and 23 could be a little bit more specific about the preservation for future use I think that we really just need to make sure that we can understand whether or not if we have a person hood law Which essentially we do and there are measures out here that could possibly move on that We're trying to understand would it be legal for somebody to discard the embryos that are not used And so I'm hopeful that as we work on this bill We can continue to make it bipartisan and to add the parts of it that are necessary Additionally, we could mirror more closely the federal Right to protect IVF care of which there are other legislative measures this legislative session That actually do that and hopefully for I guess legislators in this room This is a moment for us to come together and to see families in real time as they try to family make in many different ways I personally have been in the delivery room with families who got through IVF and Ultimately um in talking with one of my clients about this piece of legislation what she wants people to understand is How intense the process really is um There is so many there's so many tests that you have to go through many times you have to inject yourself with hormones for a long period of time Even before you get to the process of you know the eggs and um, you know as you get through that pregnancy You get to labor and delivery a lot of times folks actually are Recommended to induce early Because they want to ensure that the baby is able to be delivered before the placenta starts to detach Which a lot of times um in IVF situations the body is being Pushed into doing something and so as it gets closer towards 37 weeks or 38 weeks They then to kind of push towards labor and delivery so I would urge you to vote yes. Thank you mr. Speaker. I yield the well Ladies you're the well. Thank you for your comments chair lady still Cox His recognize speak to the bill you have up to seven minutes Thank you mr. Speaker I too rise today to thank Representative Franklin and his family for being here and for bringing this bill I think it is critical that legally we protect this right in Georgia and as a part of our law I will say that I've had many colleagues That I practice law with that delayed having children um, they wanted to become partners before they had a had an extended family And so I think this is an important measure for many professional women in Georgia um, I also want to thank dr. Andy Toledo and Dr. Dorothy Mitchell who are pioneers in our state and outstanding positions That it really paved the way for IVF and Georgia Um again, I thank you so much for your support and consideration of this bill. I think it will bring Comfort and assurance to many people who are unable to have children naturally, but um still want to have a family So thank you so much. I yield the well mr. Speaker The The lady has yielded the well. We have no further speakers on House bill 428 is there an objection to the previous question being ordered Here he none the previous question is ordered Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill Here he none the report the committee has agreed to Shall this bill now pass all in favor of the passage of the bill will vote yes All those opposed will vote no and mr. Clerk will you unlock the machine You Kind of all members voted for what purposes represent the representative hilton rise Parliamentary inquiry state jingworn mr. Speaker is it not true this body last year past house resolution 1719 and by passing this legislation we are once again reaffirming this body's commitment To making Georgia the best place to live work and raise a family by ensuring access To IVF health care options here in Georgia Thank the gentleman knows of what he speaks because I believe he sponsored that resolution. Thank you mr. Yes, sir. Thank you for your word for what purposes reps any forward rise Parliamentary inquiry state jingworn Is it not true that 13 and a half percent of the women in the United States suffer with infertility And without science and more specifically IVF Women like me would not have the opportunity to have children like my daughter who will be 17 this week I know the lady those of what she speaks since she's a wonderful mother and a great representative as well too Good\n\nfor what purposes represent his sleep all rise. Parliamentary inquiry. State inquiry. Is it not true that for many families in Georgia like Franklin and my friends, Brent and Corla Brown, IVF is the only path to parenthood? I'm sure the gentleman knows what he speaks and I could tell you I agree with you. For what purposes represent the Donna Tuturize? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that by passing HB428 we are reinforcing Georgia's commitment to policies that promote strong, stable families and the well-being of future generations? And this also provided me with two of my children. Well bless you. Thank you for being a great mother and a great representative as well. So thank you for the question. I'm sure the lady absolutely knows of what she speaks. All right, let's see what we're going to do with it. Mr. Clerk, will you lock the machine? On the passage of House Bill 428, the Yees are 172, the Nays are 0. This bill having received a requisite constitutional majority is therefore passed. Thank you, House. Thank you. Congratulations and many, many ways to the Franklin family and to all of y'all who have enjoyed the benefit of creating your family. Thank you, members again. Mr. Clerk, will you read the caption to House Bill 267? House Bill 267 by represent a bond of the 73rd and others to be a talent act to amend various titles to the EFG to Georgia annotated. So to provide for the separate restroom and changing areas for males and females in schools to provide for sleeping arrangements on school trips to be made according to sex. This bill I'm referring to the committee on education. That committee recommends that this bill do pass by rules committee substitute. Thank you, members. Representative Bonner, chairman Bonner has recognized to present House Bill 267, chairman Bonner. Thank you, Mr. Speaker, colleagues. I certainly hope we can continue that bipartisan support from the last bill. Thank you, Mr. Speaker. Today I rise to present House Bill 267, the Riley Gaines Act. Equal opportunity and fairness are the cornerstones of athletic competition. We divide our sports by divisions, age brackets and weight classes for a reason. College sports are for college athletes, professional sports are for pro athletes, and female sports should be for female athletes. The whole reason sex-based sports categories exist is to ensure fairness and competition by accounting for physiological differences which enables sports to reward genuine merit and excellence. Female athletes deserve fair competition, and that means the chance to maintain women's divisions distinct from men's categories. House Bill 267 is a common sense bill that recognizes the biological differences between male and female. Men generally have higher cardiovascular capacity, greater bone density, and more muscle mass. These advantages are undeniable. Allowing biological males to compete against biological females creates significant harm and undermines the intent and success of Title IX established in the 1970s. Prior to Title IX, only one in 27 girls played sports. Today, that number is two out of every five. Studies prove that girls involved in athletics tend to do better in school, have more confidence, attend college at a higher rate, and land higher paying jobs than their peers. We owe it to our daughters and granddaughters to protect their ability to compete on a level playing field and achieve success. House Bill 267 provides that opportunity by protecting female spaces, athletic teams, and removing ambiguity in our legal code. In part two of the bill, it requires separate restrooms and changing areas during athletic events for males and females. In the event a student is not comfortable in one or the other, there must be a reasonable accommodation made to include use of a single occupancy facility. Exceptions are made for custodial maintenance, inspections, emergencies, parents with a minor child, and authorized coaches and athletic trainers. These requirements also apply to overnight trips associated with athletic events. Enforcement is also covered in this section for our K-12 portion Enforcement is through the Professional Standards Commission, and then additional protections include a cause of action against the school or the post-secondary institution in the event of harm. The second area of protection is athletic events, found in part three. The bill requires a designation of teams and events to be male, female, or co-ed, and prohibits biological male participation in female sports, taking any female roster spots or scholarships. It does not prohibit, however, males practicing or training with female teams. The third area of protection is found in the remainder of the bill, where we address updates to various code sections that reference gender and replaces that word with the word sex. This will ensure clarity and state code and allow a more detailed and accurate collection of data across state agencies. These common sense measures seek to codify in part what has been in place by rule within the Georgia High School Association since 2022, and the Board of Regents resolution to the NCAA in 2024. That, Mr. Speaker, is the context of the bill, and I would stand ready to answer any questions that you may be, and I know there are some other folks that want to speak to the bill. There are, you have some questions you say you will yield? Yes, sir. So we'll recognize Reps. Any Berry for a question, Reps. Any Berry is to your left. Thank you, Mr. Speaker. Mr. General, I do. I wanted to direct your attention to the line 97 of the substitute. I understand that the original intention was just to flat out fine of $1,000, but now it says that such non-compliant individuals shall be subject to sanctions as determined by the Federal Standards Commission. That language is concerning to me, it leads open a question of teacher certifications. Is there an assurance that folks teachers that already have a lot in their plate, if they make mistake, if they forget to do the process and follow the laws, is there an assurance that they will not lose certificate because of this law? So thank you for the question, and I also want to thank the Education Committee, and in fact the Professional Standards Commission for the input. We eliminated the fine portion of that code simply because the PSC does not currently levy fines. So what we've done, we have not changed one bit. What the PSC does, we simply made folks put this under there them for regulations. So nothing changes about what the PSC currently does. Thank you, Speaker. Mr. Chairman, do you want to ask a question? I will. Representative Rice to your left. Further round. Now you get Representative Rice recognized. Thank you, Mr. Speaker. Does it, gentlemen, yield? I do. Is it not true that House Bill 265-7 provides clarity and consistency in school policies to ensure student privacy and safety? Absolutely. Thank you for the question. I think we're very specific in the language, and again we are simply codifying what's already been in rule for some time. Representative Hefner to your left. How's the question? Ladies recognized. Mr. gentleman, yield. To my friend, I do. Yes, sir. Is it not true that according to the standing research of the Human Genome, which is an international project successfully determined the sequence of approximately three billion base pair samples of human DNA? Their study also confirmed that biological sex is determined by chromosomal and genetic factors encoded in the DNA, which is established at conception and remains unchanged throughout life. Is that not true? I am unfamiliar with that particular study. I will say that the definitions that we have in here are based on reproductive biology, and that does provide clarity. I know that there are some genetic anomalies that exist, and so the definitions that we have are based on biology and science. Does the gentleman further yield? I do. Is it also not true that those genetic markers are tied to biological sex and do not change? For forensic DNA identification is the foundational evidentiary standard for ancestry tests, crime investigations, and remains recovery with a 99.99 degree of accuracy. If you are asking me the question, are we born male or female, I would say yes. Absolutely. And one more time, sir. Please. Finally, is it not true that according to the science of this research, genetic variations influence physical characteristics such as muscle mass, fat determination, physical structure, and the capacity to train and compete? I would agree. Thank you very much, sir. Thank you. Gentlemen, you go for a couple more. I will for the judgment card to your left is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? I do. Is it not true that intersex people actually do exist and that there are people that have both a uterus and testis? Thank you for the question. You are correct, and those individuals are covered under the Americans with Disabilities Act that does exist in this legislation. So, nothing changes about the protections that they have. So, does the gentleman further yield? I do. Could you expound on how an individual that has both a uterus and testis or a person who might have xy chromosomes but actually presents with a vagina and a uterus and breast? Or a person who might have xx chromosomes but actually present with testis and a penis? Do you explain to me where they fit? What sport do they get to play? Do they get to play with girls or do they get to play with boys? So, I think we can both agree that that is a very rare occurrence. Correct. So, that is where we thought. Well, I think we both can agree that it is rare. How rare it is but it is a very rare occurrence. Ultimately, there would be a decision made based on medical evidence, medical data. The birth certificate that is issued as well as the forms of schools require. At some point a decision can be made by the school as to what sex that individual is. And again, they have all of the current protections that they have under the Americans with Disabilities Act that does not change. So, nothing for them changes in this legislation. Mr. German, you have just one final question. I will. So, we are birth certificates on there. It puts whether we are male or female. But oftentimes genetic disorders such as the ones that I just described earlier do not manifest until a person goes through puberty. So, it is very possible that the sex on their birth certificate, it is very possible for you to find out that in fact, when you turn 13 or 14 or 15 and you never have a menstrual cycle, or when a male does not, his testes does not drop per usual and his voice does not change. It is very possible to find out then. So, then that means you would have years upon years of quote data that says that you are 1 sex when you don't find out until you are a teenager that in fact, that is not true. How would those people be able to compete in sports? So, I would refer you in, it appears in two sections. I will refer you to lines 265. It talks about, above that, talks about the birth certificate issue. But then it establishes the fact that this says this subsection shall not prohibit reliance on medical records or other standard school medical procedures for sex verification. So, it does allow for something in addition to a birth certificate if that manifests itself at a later date. Thank you for answering the questions. Thank you. A couple more questions. Representative Erwin to your right. Is Rick and I was for a question. Thank you, Mr. Speaker. Does the chairman yield? I do. Is it not true this bill protects fairness and girls athletics by ensuring that competition ranks based on biological distinctions? Absolutely. Thank you for the question. That is all that we are seeking is a very common sense solution so that males play against males, females against females. Thank you for working so well with the committee on your bill. Thank you, Mr. Chairman. One more question, Mr. Speaker. Representative Hong to your right is Rick and I was for a question. Thank you, Mr. Chairman. Do you yield? I do. Title IX was enacted over 50 years ago and female. I have, females have participated in athletics significantly which is a good thing. Does this bill impact women in the protection afforded under Title IX? Thank you for the question. I would submit that it strengthens that protection under the original intent of Title IX to allow women to participate in sports and greater measures and get those protections so that they can succeed. Thank you, Mr. Speaker. I know there are others that want to speak to the bill so that this time I will yield the well. Chairman, is yielded the well? Okay, members. Here is our postion and the wisdom of the Rules Committee and its share. We have adopted Rule 33.3. We will limit the debate time to one hour. I am going to allocate 30 minutes for those in favor and 30 minutes for those opposed. So the speakers will take up to 30 minutes or you can agree to delegate that time out to other members who want to speak. There are several members that want to speak their opposed and several that want to speak their in favor. So I will let you all manage your own time. Then we will have time for a minority report. We do have a minority report. It will be up to 20 minutes and then of course the chairman's time will be up to 20 minutes. So we will get started on the one hour piece and that will be those opposed. I recognize Representative Ann Allen Westbrook to speak to the bill. Representative Westbrook. Thank you, Mr. Speaker. Good afternoon, Mr. Speaker and colleagues. I rise today in opposition to House Bill 267 because this bill has absolutely nothing to do with girls and women and fairness for us in sports. And it has everything to do with using us as political props to score political points. Many years before I became an elected leader, I was a girl who played a lot of sports. I competed on some sort of team from the time I tried out for basketball in the sixth grade on a whim because my friend was doing it through my senior year of college. So I know the value of sports for all our youth and I particularly know the value of sports for girls and women. And I have been listening for weeks now to men talking endlessly, loudly in the well, in the press, in committee, about girls and sports and women. Men telling girls and women that you all have helped fully diagnose the problem for us and now you're going to swoop in and fix it. With all due respect, girls and women don't need men speaking for us. We do that for ourselves. Which brings me to this bill, which again has nothing to do with the issues standing in the way of fairness for us in sports. If it did, it would address real issues not made up ones. HB267 covers a broad population of athletes from kindergarteners who play for fun and recreation and social development to elite athletes who play for titles and endorsements and money. HB267 broad brushes all of these athletes in one bill. For the youngest children covered by this bill, the real issues would include under investment in girls programming and lack of institutional support. There are house and senate bills that have been filed this session to address those issues. But y'all weren't interested in those bills. You didn't speak up for those bills on the well, did you? You didn't move those bills in committee. The elite level support for women sports would include supporting the fight for pay equity. We could be asking ourselves, for example, why the U.S. Women's National Team, which has been globally dominant and women's soccer for decades. Thank you, Title IX. Winning Olympic gold, winning World Cups, selling out stadiums, selling merchandise, making money for their sport, still had to file an EEOC complaint and then a lawsuit to be paid equally. For doing the same work as the U.S. Men's National Team, same work except they won more. We could be talking about why an elite athlete, like Brittany Griner, had to supplement her WNBA salary, playing in a country with an authoritarian government with a horrific record on human rights and ended up in a Russian jail for almost a year. Why did Brittany Griner have to take that kind of risk? Because being an elite professional athlete as a woman in this country doesn't even bring basic financial security. And at all levels of competition, if we truly cared about girls and women's sports, we would be talking about the right of girls and women to be free from harassment and abuse. The NCAA has said that harassment is a far more prevalent issue for female collegiate athletes than the issue at the center of this bill. Their studies have found that female athletes are subjected to online harassment at three times the rate of male athletes and this poses significant risks to their well-being and their mental health. Some of those threats of harassment include threats of violence. Caitlin Clark, I hope we all know who Caitlin Clark is, because they're big women sports fans, so hopefully you get that. Caitlin Clark had to seek a restraining order against a stalker reselling. If this body truly cared about the physical safety of girls and sports, we wouldn't need an out of state Instagram influencer to be the namesake of our bill. The bill could be named for Jane Doe of Effingham County, Georgia. We do not know her real name because as a sexual abuse survivor, her identity is protected, but she was a Georgia girl and an athlete, and she changed sports for the better. Jane Doe experienced sexual abuse by a trusted adult, her USA Gymnastics coach. Jane Doe's family sued USA Gymnastics, and Jane got justice through the civil justice system. This Georgia family all took on a gala at the sports world. Reporters at the Indianapolis Star became aware of Jane Doe's case in Effingham County, Georgia. Because Indianapolis, where USA Gymnastics is based, had been rife with rumors of systemic sexual abuse within the organization. Until Jane and her family, until their courage, no athlete, had been courageous enough to take on USA Gymnastics. The reporters began doing what good reporters do, filing open records requests, building their story. And as their stories published, accounts of abuse from other gymnasts began pouring in. Jane's courage was contagious, and it spurred a reckoning within USA Gymnastics that brought down Larry Nasser, a serial predator with more than 150 victims, ranging from club level athletes to Olympians. And that led to a culture change within sports that actually made sports safer and more fair for girls. And that started in Georgia with a Georgia family. So my question, where are we all then? Where are your bills, your study committees, your booming voices in the well because you care so much about fairness for women and girls in sports. And I'm aware that many in this chamber don't want to be reminded that sexual abuse goes right to the very top in this country. But it is a fact. The president of the United States has been civilly adjudicated and found libel for sexual abuse. And I understand not wanting to be reminded of that because it is certainly shameful. But sadly, the majority party and the folks behind this bill did not speak up for women and girls then did not think sexual abuse was just qualifying for leadership and supported a sexual abuser anyway. And because we work closely here and we do get to know each other, I recognize that choice for what it is, a calculated political one. This bill is also a calculated political choice. We all know that there is nothing going on in sports in Georgia requiring us to do this. But it pulls well with primary voters. And the base has to have it's read me, right? If y'all want to punch down, vulnerable Georgians, say it with your chest. Do your own dirty work, but don't pretend you're doing it for women and girls. I ask you to join me in voting no on HB 267 and Mr. Speaker, I yield the well. The lady has yielded the will. Representative Park Cannon is recognized to speak to the bill. Thank you, Mr. Speaker. Thank you, members. I rise today in opposition of this measure. And I'm here to be very clear on how this measure impacts the LGBTQIA 2-plus community. So I'm going to start with the terminology of the people impacted by this. Because a lot of times folks will just get through the acronym real quick. And I'm going to slow it down today. L for lesbians. G for gay people. B for those who are bisexual. Q for queer individuals like myself. I for intersex individuals. A for asexual. P for polyamorous and pansexual. 2 for two spirit. And T for what we're talking about today. Transgender individuals. When you look at this set of alphabet. Some of it is sexual orientation. Some of it is gender identity. But none of it is sex. And today we're debating how we define sex in the state code. And I argue that we are misguided in how we are doing that. I'm here to humanize the transgender community for you. I want you to know that they're not weird. This bill is weird. That we have an obsession with these individuals. I have staff. And have had staff for the past nine years down here at the Capitol who are transgender. And they serve you equally. Let's talk about the bathroom and locker use policies. Guess what with this bill? Lesbians can still use the bathroom with you. Transgender boys can still be in the girls room. That means people who were assigned female at birth will now have to come back to the bathroom with women. Despite already having testosterone. Possibly more muscles. Why are you defeating the point that you are arguing? There's some lines in here that make the case for separate but equal. That's where we are by mandating access to a single occupancy restroom for someone who is transgender. Like water fountains in the 60s. Has anyone ever taught preschool here? Diaboring and toileting are not always by sex. Not even by gender. It's by time and space in between tantrums and tears. If we pass this, are we next going to give grants to preschools to fix their bathrooms? When what they really need is help with curriculum that works and better pay? There's a line in here that removes a reasonable accommodation access for bathroom use of the gender of the person has transitioned to, which par for the course. We have sponsored a pregnancy reasonable accommodations law for six years in a row now. The federal government has even ruled on it with no movement. We can't get any bills because again, it's women that we don't give reasonable accommodations to. This bill talks about overnight field trips making sex-specific sleeping quarters with acute little carve out for if-\n\nYou're in the same family. Again, this will do the opposite of what you are trying to do. Trans boys will be back with cis girls. Let's talk about how line 164 negates the idea of sex being a way to determine sports by saying that schools must use the terms of gender to name their sports as for men or boys or women or girls. Again, that's not sex, that's gender. If it was sex, you would say they would have to be male sports or female sports. Let's talk about this section that literally removes same sex parenthood from the court. That's lines 340 and 349, in which it describes a father as a male. How do you think that lesbians get a birth certificate for their child? One of those women is on the line as the father. I'm concerned, truly and deeply concerned about how it seems as though, because we have no transgender elected officials in this capital, that is as if transgender elected officials don't exist. What would we do for a transgender elected official in this building? Would they have a separate but comparable or separate but equal bathroom? I want to speak directly. This bill is not about fairness. It's not about equality. It's about discrimination. It's plain and simple the way that you have written it. But we will not be silent and we will not be erased. I want to speak directly to the transgender community. I am proud of you and you are honorable Georgians. Because you know what you are? You are veterans? You are parents? You are educators? And you are so much more. You have faced so much yet you continue to rise. Your strength has made us better. You are heroes in every sense of the word. The pain being caused by this bill does not define you. Your unbreakable spirit will define you. And I want to be very, very clear. This is not common sense policy. In fact, eight days ago, Montana's court ruled against the bill that they proposed and passed that is just like this. Nine days ago, February 18, 2025. So this is going to be in the courts. I want to speak directly to frontline. Stay out of transgender people's lives. You do not understand the lives in which they lead. And you are up here misleading elected officials who don't know the difference between sex and gender. To the high school sports association, how dare you continue to make it like this? Well, if there's someone trans, yeah, the school just, they just call. They just call us. And we just give them the rule. We just tell them what to do with it. How dare you not have policies and procedures? How dare you not be open to records? How dare you not have a list or numbers of the individuals been impacted by this? Because push-ups don't equal first place. If a person is more flexible than you, that does not mean they can run faster than you. I want to bring up the item that I put on your desk's plate today. It was not approved to go on the board up there. These are the cases right here that are impacted by this bill. One of them is Bostock versus Clayton County. Clayton County. That was a county worker, a stonestone from here, who sued the state of Georgia and won for transgender discrimination. I want to thank the list of organizations that continue to grow and stand up on this issue. I want you to know that we requested and put in so many different amendments. I have a document full of the different amendments that we hoped that you would take up. And all of a sudden, we have a small sub with a few of those changes. As I leave this well today, wearing my trans flag around my neck, I want to thank Monica Helms. She is the creator of this trans flag. And she is a Georgian. She's amongst your age. And she's served in the military. The reason that she made this flag, these colors, pink, and blue for the genders that are always recognized and white for the in-between individuals who are never recognized. I would recommend that you each watch the movie Everybody that has information about intersex individuals and how this measure will directly impact them, especially because there is a Georgian who is in this, who has been here for years begging for intersex policies to be put into law and has been ignored. May I stand for questions, Mr. Speaker? Yes, ma'am, you can stand for questions. I say no questions. Thank you. I yield well. The lady is yielded well. Representative Lutton is recognized as speak to the bill. Representative Lutton. Thank you, Mr. Speaker. HP 267 does contain a level of concern, but it's fear underneath that mask. It is religious judgment wrapped in the cloak of fairness. It claims to level the playing field of sports, but doesn't mention obstacles to fairness like doping or inequitable access to sports facilities and opportunity. It doesn't address threats to female athletes like the recently uncovered abuse of female gymnasts at the hands of their male trainers. Nothing to say about that. But God forbid we look past transgender athletes. I use God intentionally here because make no mistake, this bill does not originate from student athletes. It does not originate from sporting organizations. It does not originate from medical professionals asking for guidance. This bill has been spoon fed to its supporters by Christian nationalists who are bent on turning Georgia into a theocracy of their design. Now I spent more than 20 years of my life as a dedicated and devoted evangelical Christian. I went to a Christian college. I led a praise and worship team. I was the nerd who was waking up at 6.30 in the morning to read the Bible and study the word of God and pray before classes. That was me. So I am not unfamiliar with the fears and the judgments that can crowd the Christian faith. Therefore I can imagine some of the thinking that leads to a bill like HB267, Michael something like this, as good and faithful people. We cannot and should not tolerate these sinners living among us. We must not let them go unmalested. We are the arbiters of the fair and the good. They are sinners, they are not. I would have been there too once upon a time. That would have been the logic that I shared with you. Fairness is a natural ingrained desire. They have done tests on primates, on monkeys, monkeys get the concept of fairness. However, humans have evolved the frontal lobe to try to apply some logic and different standards to situations. This bill stokes the natural desire for fairness and melds it with the theocratic ideals of the Christian right. Because this bill is actually two bills. There's a sports bill part, the bathroom part, and something called the Georgia Fundamental Definitions Act. The definitions acts, erases the progress that we have made in Georgia code, changes the word gender back to sex all over the place, from language about fishing licenses to treatments for obesity, to jury lists, to dental plans. This bill reaches into our code and yanks out any roots of respect that may have been growing there for people who do not meet our moral or gender expectations. So my objection to this bill is twofold. One, if fairness and protection of women are the serious goals of this legislation, I think there are more impactful ways to address these issues. I'm going to quote Erica Sullivan, who is an Olympic silver medalist in a 1,500 meter swim. She won her award in Tokyo. She was one of over 300 NCAA team USA and Olympic swimmers who signed an open letter in support of transgender and non-binary swimmers. She said, many of those who oppose transgender athletes claim to be protecting women's sports. As a woman in sports, I can tell you that I know what the real threats to women's sports are. Sexual abuse and harassment, unequal pay and resources, and a lack of women in leadership. Transgender girls and women are nowhere on that list. So perhaps if fairness is what we're aiming for, we can expect bills in the future, equalizing women's pay, protecting them against sexual assault from their trainers and coaches. OK. My second objection to HV267 is the latent religiosity that's baked into its premise. The authors of this bill don't think of it as big a tree. They think of it as righteousness. The old me understands that. I get it. However, this bill does not imagine a life for transgender people beyond their religious judgment, a home or a school or a team where that person is simply accepted and embraced. This bill makes sense if you believe that transgender people don't have the right to exist, that they are first and only a threat and a sin to be blotted out. As I pointed out in committee, I don't think HV267 meets the biblical standard of loving your neighbor as yourself. I bring it back to this because this legislation is brought to us by those seeking to, and I quote, raise a biblical standard in Georgia. Here's another biblical standard for you. The last shall be first, and the first shall be last. Now is that fair? Thank you, Mr. Speaker. I yield the well. Representative, as you are the well, to represent a mighty barn that's recognized to speak to the bill. Representative Barnes. Representative Barnes, you have up to five minutes left on the timing. Ladies recognized. Thank you, Mr. Speaker. I won't even be that long. Many of you know me here, and I just identify as me, and I am still able to work across the aisle and work across with my Democrats and my Republicans, and I don't tell you what my sexuality is, but I appreciate being able to work cohesively with everyone in here. So I want to say I stand before you today in strong opposition of HB267. Is it a piece of legislation that seeks to impose rigid, outdated definitions of sex, restrict personal freedoms, and exclude transgender individuals from their own rights? This bill is not necessary. It is harmful, and it goes against scientific consensus. And many of you know that I am a scientist. So I'm not going to come up here with my feelings. I'm just going to state facts. It is harmful, and it goes against scientific consensus, established civil rights, and the principles of equality that we as Americans hold dear. Many of you do not know. I'm also an athlete. I have had the opportunity to gain my education on being an athlete. As an athlete, I know firsthand the power of sports to transform lives. I was fortunate enough to earn my degree on a full soccer scholarship that shaped my future and gave me the tools to succeed both on and off the field. Sports taught me discipline, teamwork, the teamwork that I'm able to use in here, and perseverance, but most importantly, it taught me fairness. We should inspire, not exclude, supporters of this bill claim that it is fair about fairness in athletes, but data, the data in facts, does not support that argument. Over 20 states allow transgender athletes to compete, and nobody's won. No transgender has won. No transgender has beat anybody in anything. And so what are we even up here for? It's 20 years since the Olympics let transgender compete, and not one single trans athlete has won, one single medal. What are we in here fighting for, guys? House bill 267 is not about fairness or privacy or protection. It's about discrimination disguised as policy. It ignores science. It targets vulnerable students. It's wasting our taxpayer money. This fight is wasting the money. It undermines civil rights. We should be focusing on real educational challenges, like feeding our children, not passing laws that foster division and exclusion. I respect your thoughts and your beliefs on this issue, but let's focus on the facts. There's not not our feelings. Thank you, Mr. Speaker, are you the will? The lady has yielded the will. That concludes those members speaking and opposed to the bill, and we have, we'll recognize though they're speaking in favor of the bill, they have up to 30 minutes to be divided amongst the members. As they come to the will, first we'll recognize Representative Earhart to speak to the bill, Representative Jenny Earhart. Thank you, Mr. Speaker. Members. No doubt this is a heated topic. I certainly have been reflecting on some things that my colleagues have mentioned this morning, and I just like to mention a few of them. One being the comment that, you know, the audacity of men to get up here and speak for women. And by no means am I trying to take the podium away or the Michael ever away from a woman, but to say that they can't speak for us, I think is that best is ingenuous. Given that every man in this room likely knows and loves a woman in his life, they all had mothers, many of them have daughters, sisters, nieces. Certainly when they see an issue that can affect those that they love, they have a right to stand up and they should stand up and be heard. But for some reason you believe that men speaking on this issue is somehow not credentialed enough. Then let me stand on the gap and speak for the women that I know and love. In regards to my colleague on the other side that referenced this bill as weird, I found that assertion particularly comical. Given that the weirdest thing I've seen in the past 10 years is six foot one Lea Thomas standing on a podium next to Riley Gaines after having robbed her from an NCAA division one freestyle championship medal. And to my other colleagues assertion that we are trying to blot out trans women, let me reassure you, no that's not what we're trying to do. We're just trying to keep biological males from slight tackling our daughters on the soccer field. A while back, a popular feminist magazine published a list of some of the most damaging societal lies that have been told to women in the past 50 years or more. See if you recognize any of them. Number one, women are not good at science or math. Now this damaging myth led to a serious gender gap when it comes to women who choose careers in science and technology. How about this lie? Rape is your fault. In the past all too often, women were told that if bad things like assault or harassment happened to them, they must have done something wrong. Maybe it was their choice of clothing or the number of drinks they consumed. Here's another lie. You can't be a good mother and have a successful career. One or the other is going to suffer. And when it does, that'll probably be your fault, ladies. The irony of that lie is it's in direct contradiction to another lie that society has told women, which is you can have it all and do it all. And if you can't, you're doing something wrong. Members, aren't you tired and weary of societal lies? Aren't you sick of falsehoods that hurt women? Many of them are rooted in sexism and misogyny, unfortunately. Lies that hold women back, that put artificial roadblocks in the way of them reaching their God-given potential. My friends, please listen, the fact defying fictional message that a girl should be willing to compete physically against biological males and sports is perhaps the most delusional societal lie I have ever heard. You see, if you subscribe to this lie, then what chance do our girls have? The average teenage male, whether he has undergone puberty blockers or not, will be taller, heavier, and faster than your daughter. He will have greater muscle strength, speed, power, and endurance. Statistically, in competitive sports, he will outperform your daughter by at least 30%. Have you prepared your daughters and granddaughters for this reality? I have three daughters and three granddaughters. My daughters were raised on the soccer field. They were very competitive. You see as a young mom, I believed what I was told that sports were good for kids, especially girls. It teaches them discipline and teamwork, all the good things. I thought if I gave them all the right messaging, they would have a chance. Hard work, keep your head in the game, take care of your body, support your teammates. If you get knocked down, get up, and keep going. I believed as my girls believed that if they did the right things they could succeed, and even if they didn't, even if they lost as all athletes do at some time, it wouldn't be because the playing field wasn't level. It wouldn't be because the cards were stacked against them. At no time when I was raising my daughters, and I suspect many of you as well, did it ever occur to me to prepare them that they might be on a competitive sports field with someone who they had no realistic likelihood of beating? Folks, this girl is not about excluding trans women. It's about excluding a male biological advantage when competing against biological women. I stand today in support of this bill. I hope that in defense of girls' sports, for our daughters, our loved ones, the women that we love, that you will vote favorably for this bill. Mr. Speaker, I yield the well. The lady is yielded the well. The chair recognizes representative Donna Tucci to speak to the bill. Madam Speaker, members of the House, I rise today in support of House Bill 267, legislation that upholds fairness, safety, and privacy in our state's educational institutions. The Riley Gaines Act ensures that school restroom, locker room, and overnight accommodation policies respect the biological distinctions between male and female students. This bill is not about exclusion. It is about protecting the rights and privacy of all students. For generations, schools have maintained sex-specific spaces to promote safety, dignity, and fairness. HB267 ensures that these policies remain clear and consistent, giving parents and students confidence in the safeguards provided by their schools. Furthermore, this bill aligns with the principles of fairness in athletics. We recognize the importance of competitive integrity, ensuring that student athletes have a level playing field where biological differences do not undermine opportunities for fair competition. Madam Speaker, HB267 is about common sense and protecting student rights. It is a responsible, reasonable measure to ensure that our educational institutions continue to provide safe, fair environments for all students. I urge my colleagues to support this bill and uphold the standards it served Georgia's students best. Thank you, Madam Speaker. I yield the well. The lady is yielded the well. The chair recognizes representative Cox to speak to the bill. Today, I speak in support of the Riley Gaines Act. And I want to thank the representative from the 73rd for the hard work that was put into this bill. I've heard a few comments here about being a male, not being able to speak on this event and on this bill. But as a biological male that is mentioned in the bill, I find the need to speak from a biological male perspective. One individual spoke here and said that women and girls need better pay and less bullying. I agree as a biological male that that's a true statement. If you allow me or my sons or my grandsons to participate in biological girl sports, they will in fact take funding away that will pad their pocket in not the biological women that so rightfully deserve that pay. It was mentioned as well as a Judeo Christian on what God's perspective is. I will tell you this. That's not my responsibility to decide the heart and soul of each person in this room. I'll leave that job to God Almighty. Now, my grandmother, she participated in high school basketball in the 1920s. If not for her doing that feat in going to a place where sports was not necessarily aggressively attacked by women in those days, because remember in 1900 was the first time that women competed in the Olympics. There was roughly 22 women that competed in Paris France at that time. It just paved the path for women's sports moving forward. It motivated my own grandmother. I would even say if not for her doing that, which led to my mother all the way down to where I am today, I very well might not even be at this very place. Because it was sports where my mother and father actually met and led to a future marriage and well here I am. When going through this, this allowed for 1972 to occur, which was Title IX. Before Title IX, 300,000 women were participating in high school sports. Currently today, it's over 3.4 million. So I continue to fight for girl sports. We'll do it. I have coached and support the separation between the boys and the girls. I support this bill and ask for your favorable consideration of this bill. I yield the well. The chair recognizes representative Wade to speak to the bill. Thank you, Madam Speaker and colleagues. I rise in support of this bill. I appreciate Chairman Bonner and his leadership in carrying this, going through the committee process, thoughtfully listening to all of this. I feel that this is a very good and healthy bill. I feel obliged to speak to you as many have spoken before, but I want to say it from this perspective. Every single person that is born has inextricable value. I believe that every one of them have a purpose. I have served on a local school board for 15 years, almost 16 in my home community. I watched people miss out on opportunities that other school systems had. When I was going through school, we didn't have boys soccer or girls soccer. At that time, it was a financial hardship for my community. I know that there were young girls in our community that wanted to play soccer and there were young boys that wanted to play soccer. That wasn't my sport. I then had an opportunity to be in a leadership position to try to expand, not just our academic opportunities for our school system, increasing the number of AP courses. I was in school at the time when I was in the school board. I was in the 90s and 96% when I came to this body. I believe in a athlete and athlete. I played sports. My wife played sports. I'm not going to pretend that I was the number one player on the team. My distinction was I had the highest GPA. The joke was some of my friends was I was on the team. So we could compete regionally to have a higher GPA with some of the teams we played. I was a competitor and I played pretty well my junior and senior year in basketball and track. My wife was a track star and she also was a softball player. My mother was born in 1947 and she had limited access to sports for two reasons. One, her father served as a chief master sergeant in United States Air Force and traveled and she had the experience of living in 13 different schools for her life. Sometimes there were opportunities. Sometimes there were not. My mother has three grandsons and my daughter, her only granddaughter.\n\nWisdom as a career educator, a mother and a grandmother, has made me passionate about this issue because she said, my generation fought so that one day my future granddaughter would not have opportunity to manage for her. Whatever sport that she wants to pursue. Now, my daughter is 11. My son is eight. He'll be nine in May. He reminds me every day. That I'm almost nine. But the start difference between my two children, my son is in the 88% tall of height, 50% tall of weight for his age group. My daughter is in the 5% tall of height, and 3% tall in weight for her age group. My son is two and a half years younger, and his bone density is far bigger. Literally, the width of his wrist is almost a quarter inch thicker than his sister who's two and a half years older. It's about the physicality differences. It's about the biological differences. This bill is to ensure that a young woman who is playing whatever sport that she faces does not have to face a young man like me in the same field, court, whatnot. The bill also, and I want to remind you, this acknowledges, and our committee and education was very, I think, helpful in this effort with the chairman who brought this bill, to note that co-ed sports exist. I got to that stage in life as a young man before having children where I two played co-ed softball, and there were many on the team that were former collegiate softball players that were women that we recruited to be on our team because they were better, but it was a co-ed setting where men and women competed together, and it was the same playing field on both sides, both in the field and off. This is a very important piece of legislation because it protects the opportunities for women going forward. It's just that simple. It is not, in my view, something to be anti-anyone. It is to acknowledge that young women, young girls, like my daughter, should have an opportunity to compete in whatever she wants to pursue, because I can tell you, my wife who has her doctorate is the smartest one in our household. She is a person that is brilliant. She will not be limited by somebody telling her that she cannot, because I assure you she can. Every single woman needs to hear that from all of us elected men and women in this body, and I will continue to speak truth to that effort, and I appreciate your consideration and favorable vote, because this will help young women all across Georgia. Thank you. I yield the well. Gentlemen, is yielded the well. The chair recognizes Representative Thomas to speak to the bill. Thank you, Madam Speaker. I rise today to speak out and support this bill. It was just a couple nights ago. It was Valentine's. It was actually two days later, my little girl. I got home late, and she stayed up, and fortunately she fell asleep, and she had this little card, and it had daddy on it from her. And I opened it up and opened it up into a big heart. And I, it said, the reasons why I love my dad, we snuggle together at night. Every night I put her to bed, or I get the opportunity to put her bed, late next to her five minutes, we talk about her day, we call it snuggle time. It said, he's funny to me. And the probably one that I thought was best, as he said, he's cool because he works at the Capitol. And she sacrifices so much for me to be here. So I have every right to stand up here and speak out and support her. She, you know, if I've been down here, this is kind of my fifth go around, and I've never come up to the well and spoke about, really a partisan bill until today, because I felt like this was so important. I believe in fair playing fields. And I've talked with you a lot across many different aspects of what we have to deal with policy making. But I just, I believe that we should set fair playing fields for all of our people. That's our job. I find it ironic that I listen to the opponents of this bill and the progressive left. They're fine with quoting or misquoting science. When it comes to certain issues, such as global warming or other issues that they talk about, but they seem to turn a blind eye to the simple fact that there is genetic differences between boys and girls, and that's an, that's inalienable. Then it is not changeable. You cannot change it. No chemical, no home, no hormone. No surgery is ever going to change your genetic makeup ever. There's been a lot of people that have talked about that. I'm not going to go into detail about it, but I also talk about progressive left. In this conversation, we always have about safe spaces. My daughter deserves a safe space. She deserves it. She deserves a safe place to compete amongst her peers. She deserves safe place to go to change and gets ready to go for her sporting events and after sporting events, she deserves that. I've listened to a lot of things today and I have to tell you all, the one thing I've learned five years of being down here and I've got a lot to learn still. But when it comes to stuff like this, look out y'all straw man season has arrived. Because we're going to sit and have conversations about, what this bill is about. This bill is about boys playing in girls' sports. Unfair situations. That's what this bill is about. So you can sit and make up all this. You can say that somehow a boy playing in girls' sports, like it's on the minority report, actually do you read those things. That somehow that's going to change hate crimes. A boy playing in girls' sports is going to change a hate crime. Give me a break y'all, straw man. So that being said, my daughter, every girl in this state deserves the right to be able to play on a level playing field. And with that I ask for your favorable consideration. Let's bill Madam Speaker, I yield the well. Gentlemen, as yielded the well, the chair recognizes Chairman Hagen to speak to the bill. Thank you Madam Speaker. Colleagues, I'm here to speak in favor of this measure that addresses fairness and safety in women's sports. Before I get to my prepared notes, I did want to echo some of the things that a previous speaker said about the notion that men speaking on this issue is somehow wrong. As the mother of two men, two young men, I find that highly offensive to think that they should not speak up and defend the daughters, or granddaughters that I hope that they will have one day. It is the right thing for a man to do to take up for his children and grandchildren. And yes, women should be speaking up for this issue too, which we are. But I just want to make it very clear that I support men on either side of this issue, speaking to this issue. All right, so fairness and safety in women's sports is what we're talking about here, fairness. There are biological differences between males and females. It exists. It can absolutely influence athletic performance, and it does. Studies have shown that even after a male receives hormone therapy, advantages in muscle mass and strength are retained over their female counterparts in many circumstances. In fact, a national institute for health, center for biotechnology, information, publication, concluded that for men who have transitioned, even with testosterone suppression, quote, the data show that strength, lean body mass, muscle size, and bone density are only trivially affected. So when a female has worked in her sport, often for many, many years, it is not fair to her for a male to compete and negate that hard work. So let's move on to safety. When it comes to sports, safety is paramount. And we know this by looking at the anordinate amount of safety gear that children and adults wear when they are competing in their various sports. We know this because of the regulations that are put in place. I mean, you cannot even put your hands on a quarterback anymore without having a penalty call because it's for safety. So to act like safety in women's sports is not an issue. It's just simply not being honest. There have been documented instances where female athletes have sustained serious injuries competing against males. It is indisputable. You can look it up. So do I care about males who identify themselves as a woman? I certainly do. Do I care about opportunities for anyone wanting to compete in sports? I absolutely do. Do I care about the young people who I met standing outside of these doors on the Sinai dialect year who approached me about their concerns about a bill that we may have been taking up on a transgendered issue? And they shared with me that they are also concerned about men using this issue to gain access to women and children's spaces and that they were concerned for their safety. I do care about them. But today I am most concerned about what is fair and safe and preserving of opportunities for women. This issue threatens opportunities for women to secure scholarships, to advance their athletic careers, or simply to be recognized for their hard work and their excellence in their sport. So friends and colleagues, I am respectfully asking you to consider what is fair and right for women and vote yes on House Bill 267. I yield the well. Ladies, yield of the well. That completes those speaking in favor of and opposed to the bill. Is there any objection to the previous question being ordered? This time we'll move on to the minority report up to 20 minutes for the minority report. And then we'll have the chairman's time up to 20 minutes for the chairman's time. So 20 minutes for minority report, there's three speakers signed up. And I'll let y'all dig up that time as you see fit. Representative Jasmine Clark has recognized to speak to the bill. Representative Clark. Thank you, Mr. Speaker. I'll be brief. I just wanted to come up and clarify some things from my exchange with the sponsor of the bill earlier during questioning. I mentioned that the problem with whittling things down to just male and female is that it's completely dismissive of intersex individuals. These people do exist, but the sponsor dismiss this as quote rare. But before we just write off our intersex constituents into oblivion as if they do not exist or they do not matter, let's look at the number. There are 10 NCAA trans athletes. There are however 60,000 babies born per year that our intersex or have disorders of sexual development. We are so busy trying to target certain people, but the scatter shot will touch many. Thank you, Mr. Speaker. The lady is yielded the will, Representative Drenner has recognized to speak to the bill, the resident college runner. Give the lady your attention, please. Thank you, Mr. Speaker. You know, I have always believed that God has a plan for my life. And today, as I reflect on 25 years of legislative service, I am reminded that this journey has been much more than just passing laws. It's been about standing out for what's right, advocating for those who need a voice, and fighting for equality, justice, and human dignity. As the first, the first, the OG, I don't even know what that meant. I thought it was old girl, right? I know that's what I did. As the first openly gay state representative in our state and in the South, I have faced challenges in opposition, and yet I have never wavered in my commitment to fight against anti-gay legislation. There hasn't been one session in my 25 years of life, without these battles, not one session. But throughout it all, you know what, I've stood firm. Knowing that the work that I do makes a difference for countless individuals in the LGBTQ plus community and beyond. I'm a proud mother of four. I have two daughters and two sons, and my family deserves a safe place to live. The other day I was dropping off my children, and I felt bad, right? It was winter break, and I said to my six-year-olds, should I quit my job? My daughter said, absolutely. Absolutely. She was all for me coming and picking her up every day from school, and my son said, no mama, we need you to change the world. Now that was a six-year-old. I've always been an advocate for transgender rights. Especially for our kids. And I'll continue to stand up for them just as I have always done in the face of adversity. That's why I'm standing here today. House Bill 267 is not a sports bill. It is a calculated, dangerous, deeply discriminatory piece of legislation that goes far beyond the realm of athletics. This bill is nothing less than an attempt to erase transgender Georgians from public life. And now, you know what? Since I have been doing this for so many years, I know that many of you are not listening to me, and that's fine. I am talking to you out there. I'm talking to my children, so that they will know that their mother stood up for them. This bill is nothing less than an attempt to erase transgender Georgians from public life. As Ann Applebaum reminds us, history will judge the complicit. This moment, all across the country, calls for courage and conviction. It demands that we stand on the right side of history, not just as Democrats or Republicans, but as human beings. Transgendered individuals make up less than 1% of the population. They are not clamoring to dominate youth sports. This is a manufactured crisis by the most extreme factions of the Republican Party. Designed not to solve real problems, but to divide our communities and distract from their lack of a real plan to govern. While Republicans focus on phantom threats, Georgia families are struggling with real challenges. Poll after poll shows that voters want action on the issues that matter most to their daily lives. 45% of Georgians want jobs and a strong economy. 44% are struggling with health care costs in access. Yet only 4.5% mention protecting transgendered rights as a priority. And none listed the anti-trans issues that have been addressed over the last three legislative sessions that Republicans are so fixated on. If this were truly about sports, this bill would focus solely on athletics. Instead, sections 4 and 5 of House Bill 267 seeks to radically redefine Georgia law, touching over 45 code sections from probacorts and mental health services to organ donations, child abuse reporting, and even funeral director discipline. How do these topics affect who plays on a junior high volleyball team? Nothing. And that's the point. This bill isn't about fairness in sports. It's about rolling back protections for transgender Georgians in every aspect of their public lives. Words on a page matter. And here are the words on House Bill 267 that matter. Onlines 323 to 327 lines 515 to 516, lines 520 and lines 553 to 555 removed discrimination protections for trans Georgians. Onlines 297 to 350, it defines motherhood and fatherhood so as to exclude transgender parents from being recognized accurately by the state. Onlines 317 to 322 introduces language that bans transgender people from using restrooms without clear guidance or consideration of the facts or even delineating between public and private accommodations. Although gender was put back under the hate crimes protections in Section 52 of this bill, Section 5-1B clearly states that reports of crimes or discrimination will not be recognized as transgender Georgians as following under those protections. Lines 323 through lines 327. That's not all. This bill proposes countless changes that will not impact a single person voting on this bill today. But we'll have life-changing results for a sliver of the population who asked nothing from you but to be left alone. And many of these proposed changes to law don't even have the pretense that they are protecting some other group from transgendered people. Think about who is safer when a transgender Georgians are not protected by a hate crime law. Think about the person who is glad to hear that transgendered people are more vulnerable to violence. The person who is proud of the job being done here today. Imagine you are called slurs, taken behind a building, and raped. You are denied access to a rape crisis center shelter and are told that this targeted attack was not a hate crime because the hate crime against transgender people is deemed appropriate in the state of Georgia thanks to House Bill 267, the transgendered sports bill. So if this bill is going to pass, and if you are going to say all of this falls under one legislative action, let's propose a more honest title for the bill. Let's call this the Eraser of Transgender Georgians Act today. Let me close with this. My Angela said, you may shoot me with your words, you may cut me with your eyes, you may kill me with your hatefulness, but like air, I'll rise. The all of you listening today, don't lose hope. Don't give up. We need you. Mr. Speaker, I ask for you to vote no, and I yield the well. Ladies, you are the well. The minority leader of this house, Representative Higley, is recognized to speak to the bill. Representative Higley. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I rise to speak to this minority report on House Bill 267. Indeed, the very act of offering of minority report could not be better titled. You see today's actions are intended to demonize and scapegoat a very minuscule minority of Georgians. A number so small as to be of zero impact on the lives of our 11 million citizens. A number so small as to be irrelevant in the scope of the lives of most Americans. Yes, these are children. I said children who are the subject of this legislation. The objective being a law that would question their humanity, segregate them from their classmates, and make them the object of ridicule at the direction of the state. House Bill 267 is intentionally vague, and it penalizes teachers for protecting their students and staff from defending the children in their care. It solves no problem. It serves no purpose. It is political theater. Yes, I said political theater. You know, the proponents of this bill, I'll give them credit. Because in the last election you heard advertisement play time and time and time again. And just like merchandising sex sales in politics hate sales. And it sells very well at a time when we should be talking about what's really happening to our children. At a time when we should be talking about 500,000 Georgians have lost their health care under the watch of the Kemp administration, including thousands of children who are not here. We're not here to call for the immediate expansion of Medicaid and the aggressive re-enrollment of needed children in peach care. In a state when one and five children go hungry every day, where 23% of children in Georgia live in homes without enough food, we are not here to pass legislation to guarantee school launches or to accept the summer EBT. At a time when the federal government is terminating thousands of Georgians, we're not here to discuss how we will secure employment for the neighbors and friends who have lost their jobs. We are not here to talk about how we protect veterans who are facing canceled services or inspectors who should be looking after our farmers from lawsuits. We are not here to discuss at a state who had one of the highest rates of COVID. The fact that 10% of the CDC employees have been fired. Why are we not here to talk about saving lives and protecting our children from the violence or the scourge of hunger? We're not even here to talk about protecting our children from guns. Why? Because too many Georgia legislators are addicted to the profitability of hate. Addicted to how many clicks they can get when they do mean things on social media. It is a well-known truth in politics that if we can make you afraid enough, we can promise to be your savior. And HB267 is all about making Georgia's afraid and saving them from the evils of empathy and the dangers of compassion and the peril of common sense. Yes, hate not only sales, it works because it riles up the passions and let folks pick size. It feels seats and when properly harness hate wins elections. And that is what this is all about. Hate wins elections and it always has. History will tell you that. Whether we're talking about the Nazis in Germany, the apartheid in South Africa or segregation right here in America. It was in this very room where segregationist decided that people of color were not worthy. You see, I was born a color girl. That's what my birth certificate said, color girl. And when I was a child, what I wanted to do more than anything else was go to spa pills, the drive-in. And my father, who was a proud World War II veteran, I will never forget the sadness in his eyes when he had to tell his baby girl that you can't go to spa pills. Because if I take you to spa pills, I got to take you around to the back. And we got to wait until all the white patrons have been serviced and they might come back to that window so that I could buy you that milkshake. And I believe you deserve better. My father had to tell me why we could not go to the movies because at the movie theater, you pay for your ticket up front but you had to go around outside and walk up the stairs and sit in the balcony because the state said that you were not worthy. My father hated to tell me that we could not...\n\ndrink water in public because he did not want me to internalize that the state said that I was not worried and I would have to go to that colored water fountain. My father was sad because when we traveled and one of us had to go to the bathroom, he had to pull over on the side of the road and my mother would open the front door and open the back door and you do your business in between. I am sad today because we should never under any circumstances put hate in our code. This matter has already been handled. It is not happening in our state and I, for one, I'm asking you to don't be that politician in that very undignified position. You know what that is? The politician that has the ear to the ground and the finger to the wind. The ear to the ground and the finger to the wind. That is the most undignified position for a politician to take. This matter is before us because it pulls well and it wins elections. That's why we're here today. But I cannot forget that the state is the one who said that I was a colored girl and the state said that I was the one that was not worthy and there was no one to stand in a place like this and speak up for me. I don't know anything about this community we're talking about but I do know about hate and I do know about being treated differently and I ask us to think about this and I know everybody's going to do what they got to do and my time is up. I tell you that we can do better for the people of this great state and I know all of you and I know your hearts and I know none of you want to codify hate. I yield well. And lady, as you were the well, that completes my order report. My order report, we'll move on now to the chair's time, the chairman of our education committee, chairman Irwin has up to 20 minutes, up to 20 minutes. The gentleman's recognized. Thank you, Mr. Speaker. And colleagues, I rise today in the sport of House Bill 267, the Raleigh Gangs Act because it's a bill that upholds common sense, protects privacy and ensures fairness in our schools. This legislation affirms the simple truth, one that has guided our society for generations. That biological sex is real and the distinctions based on sex are necessary in certain spaces for safety, privacy and fairness. HB267 does not introduce a radical new policy rather reinforces long standing expectations regarding personal privacy in restaurants, locker rooms, and overnight accommodations. Our schools are entrusted with the safety and well-being of students and part of the responsibility includes ensuring that intimate facilities remain or excuse me, facilities remain spaces where students feel secure. When young people change for gym class, when they prepare for an athletic competition, or when they stay overnight on field trips, they should have confident that these spaces are designated accordingly to the biological sex. Mr. Speaker, we must stand for clarity over confusion, for fairness, over ideological pressure, and for fundamental right for every student to feel secure in spaces that were designed with privacy in mind. HB267 is a measured, reasonable, and necessary response to growing concerns among parents, students, and educators alike. This bill is not about targeting anyone. Let me state that clearly. This bill is not about targeting anyone. I urge you, colleagues, to support this bill and uphold principles that have long guided our institutions. Mr. Speaker, thank you for the opportunity. Chairman, thank you for this bill. I ask colleagues, please join me in passing this bill. With that, I'll yield the well, Mr. Speaker. And gentlemen, as yielded the well, Mr. Clerk, I'm going to ask you to ring the bell, so members will know to come back to the floor and ready to vote on this proposition. Is there any objection to withdrawing the Committee's substitute here in the Committee's substitute is withdrawn? Is there any objection to adopting the substitute offered by the Committee on Rules? Here in the Rules Committee's substitute is adopted. Is any objection to agreeing to the report of the Committee which was favorable to the past to the bill here in the report the Committee has agreed to? Well, this bill now passed. All in favor of the passage of the bill, we'll vote yes. All those opposed, we'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Pursue it to Rule 130. What purpose is representative Niel Rice? Mr. Speaker, I rise to vote Rule 133 and it's request to be excused from this vote. General Lady, has that right and the journal will so reflect. All members voted. We've debated this issue very thoroughly, but I'm going to take a couple of them, Parliamentary inquiries for what purpose is representative Ellen's rise. Parliamentary inquiry. State inquiry. Mr. Speaker, isn't it true that the NCAA has a policy that reads, quote, a student athlete assigned mail at birth may not compete on a women's team? And isn't it further true that the Georgia High School Association has a policy that reads, quote, boys are not allowed to play on girls teams even when there is no corresponding boys sports team. And a student's gender is determined by the gender noted at his or her birth certificate. So we do not need this bill to protect our girls in competitive sports. And all we are doing today, all we are doing today, is bullying very vulnerable children. And providing a vague path to lawsuits against our schools that are already overstrapped. And indeed, as our great leader said earlier today, codifying hate. I'm sure the lady believes in everything she said. I'm not sure that I agree with her, but I'm sure she read the rules that were in the body of questions. Correctly, but we can all agree and I think we'll have that opportunity right now. But I appreciate the ladies parliamentary inquiry. For what purpose does Chairman Bonna rise? I'm Terry inquiry. State inquiry. Mr. Speaker, is it not true that the U.S. Women's National Soccer team that was mentioned in 2017 was actually defeated in a scrimmage by a U-15 boys team. Further highlighting the need for this type of legislation. I'm sure the gentleman knows of what he speaks as well. And I'm sure all the members are very passionate about this issue. For what purpose is represented by Queen, rise? Parliamentary inquiry. State inquiry. Is it not true that while this bill does not explicitly outline civil liability, it creates a vague and burdensome grievance process that could open the door to lawsuits against teachers, administrators, and even students if they are accused of violating these newly created rules? I know the lady has her opinion. I'm sure it's willing for them. For what purpose is represented by a peatry rise? Parliamentary inquiry, Mr. Speaker. State inquiry. Mr. Speaker, is it not true that super majorities of Americans in both parties oppose biological males and women's sports? And then in a very recent New York Times poll, 67% of Democrats and 80% of Americans bold oppose men and women's sports. I'm sure the gentleman believes what he speaks. If all members now voted, all members voted if so. Mr. Clerk, were you locked machine on the passage of House bill 267? The yeas are 102, the nays are 54. This bill, Henry C. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House bill 254? House bill 254, members, on the book, nerve, 137th, another, to be entitled to amend chapter 3, a total 50, the fiscal to Georgia annotated relating state flag seals, our other symbols shows a revived for the placement of a revolutionary war patriots marker upon the grounds of the state capital. This bill, I'm referring to the committee on state property. That committee recommends that this bill do pass. Representing Debbie Burtner is recognized to present House bill 254 from Junction City, Georgia. Yes, ma'am, ladies recognized. Thank you, Mr. Speaker. House bill 254 is a bill that we passed out of this house last year. It is a bill, there's a process that you have to go through whenever there's a historic marker put on the grounds of the capital. It has to be approved by us and then it has to go to the Capitol Arts Commission where they will further refine its location and its content. This is being offered to us as a gift. It is a bronze historic marker from the Commission on America 250, which is a celebration of America's 250th birthday. The marker will say that it's commemorating all of the men and women who achieve American independence and that it is as one of the 13 original colonies, it is recognizing us and saying happy birthday, I guess you'd say. There have been some questions raised and I want to address those two questions. There is no cost of this to the state. It is all being donated and it is just going through the proper channels of approval. And it is in recognition of the fact that we are one of the 13 colonies and it is recognizing all of the American Revolutionary War soldiers which included both enslaved and free African Americans. It included non, I mean Native Americans and it included because back then the country was truly full of immigrants. It included soldiers who were from France, Germany, Scotland, Ireland and Spain. And I just want to point out one thing in closing and I ask for your favorable consideration. These folks were willing to fight for an aspirational goal that we still have in the words of our constitution that we all are bound to uphold. That we are always to strive to form a more perfect union with that Mr. Speaker. I'll go for questions if there are any and I ask for your favorable support. You do have a couple of questions. Representative camp to your right. By the doors has a question. Ladies recognize. Do you? Yes ma'am. Thank you. Isn't it true that by placing this plaque at the state capital, given the opportunity for all the thousands of students who come to our capital to understand the significance of Georgia in relation to our country and the formation and the sacrifices made by men and women for us to have this nation. Very well said. Yes. Thank you. Lady Yule for another question. Yes sir. To your left right out in front representing Park Cannon. It's a recognized for a question. Thank you Mr. Speaker. Do you yield? I do. Can you speak to some of the individuals who fought in the American Revolutionary War? Just kind of spelling out a little bit more how diverse that group was. Basically the the the list that I gave we had African Americans who were both free and enslaved. We had Native Americans particularly in Georgia. This was a frontier area so there were a number of Native Americans that fought. And then we were also quite I think very lucky to have a lot of Scottish people here because that's my heritage. They were the Highlanders that came here and helped to Oble Thorpe keep the Spaniards out but we did have Spaniards here and we had people from France and Germany and Ireland and Switzerland. So it was it was a group of people that were truly a group of immigrants, Native Americans and African Americans. Thank you. Lady Yule for another question. Yes sir. One more. Representative Ridley to your extreme right. Representative Jason Ridley. Thank you. You talk about people who fought in the Revolutionary War as a representative buddy to Lutcher. We're going to be able to do a statue for him. We've been discussing putting his picture on the on the bronze plaque. No I'll be in favor of that. Thank you Mr. Speaker. I do ask for your favorable consideration and yield the well. Thank you. Lady has yielded the well. And is there any objection to the previous question being ordered? Here he none the previous questions ordered. Is there any objection or agreeing to the report of the committee which was favorable to the passage of the bill? Here he none the report the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote? Yes all those opposed will vote no. And Mr. Clerk will you unlock the machine? All members voted. All members voted if so. If so Mr. Clerk will you lock the machine? All the passage of House Bill 254 the A's are 166 the A's are zero. This bill haven't received a requisite constitutional majority as therefore passed. Mr. Clerk will you read a caption House Bill 329-329? House Bill 329 by the Rifts of the Filton of the 40 A's to be entitled to amend Article 2 chapter 34 Title 43 to fiscal to George annotated relating to medical practice shows authorized certified nurse practitioners and physician assistants perform artificial insemination. This bill I refer to the committee on health that committee recommends that this bill do pass. Will your representative Scott Hilton is recognized to present the bill? Thank you Mr. Speaker honored to present House Bill 329 which is another and a long line of pro-family policies considered by this body. Just today we've reaffirmed our commitment to IVF which keeps the dream of parenthood alive for millions. In the past few years this body has increased pay parental leave for state employees. We've required insurance companies to cover contraceptives. We've created the maternal mortality commission. We've expanded health care coverage for mothers 12 months postpartum. HB329 is to help families who are seeking help to conceive. IUI or artificial insemination is typically the first step in a pregnancy journey. HB329 streamlines the process and potentially reduces the cost of IUIs by allowing nurse practitioners and physician assistants to administer artificial insemination under the delegation of a physician who is physically present at the time of insemination. As you know we serve the most incredible constituents. I want to conclude my remarks by thanking publicly my constituent Suzy Snyder who I believe is watching on the live broadcast right now who brought me this piece of legislation and with that Mr. Speaker I will yield for questions. Gentlemen ask no questions. Thank you Mr. Speaker I yield the welcome. Is there any of the gentlemen as you are the well? Is there any objections to the previous question being ordered? Here you know the previous question is ordered. Is there any objection to agree to the report of the committee which was favorable to the passage of the bill hearing none the report of the committee has agreed to? Shout this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine? I have all members voted. All members voted if so Mr. Clerk will you lock the machine? All in the passage of House Bill 329 the yeas are 167 the nays are zero this bill hadn't received it requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to House Bill 169 169? House Bill 169 by Representative Cannon and the 170 second to be entitled to amend article 1 of chapter 5 of the title 48 the district of Georgia and attitted relating to general provisions for ad ballarm taxation and property so it's the limit exceptions to the breach of covenants this bill I refer to the committee on ways and means that committee recommends the dis bill do pass by committee substitute. Who representative Chaz Cannon is recognized to present the bill? Thank you Mr. Speaker ladies and gentlemen I bring you House Bill 169 House Bill 169 removes an existing exemption for solar facilities on conservation use valuation assessment cova property and also on forest land protection act flip a property and in doing so it re-emphasizes the importance and critical nature of the cova statute to Georgia agriculture and to the preservation of our farm land in crafting the language of the bill we strive to achieve consensus and the reason for achieving consensus and balance is that we still want to have solar as an option for our land owners especially if it allows a farming family to keep land in their family or hold on to it a little bit longer it's also a private property rights issue so for those reasons we want to solar to remain as a potential option for land owners but we also wanted to clarify that farm land converted to a solar facility is not the same as land that remains in agricultural use and therefore it should result in a breach of the cova contract as I mentioned previously the C and the U in cova stand for conservation use so the use is a critical component of of this statute and this bill re-emphasizes that standard we did accept an amendment from the gentle lady from the one 30th 37th my fellow forestry board member to delay implementation by year appreciate that and overall I think we've got a fair compromise that balances the ability to have solar as an option while re-emphasizing the importance of the cova statute and the preservation of our state's farm and forest land ask for your favoral consideration now I'll stand for questions mr. Speaker gentlemen has no further questions are you the well or no questions I shouldn't say any further I didn't have any either thanks for the bill gentlemen as you order the will it is there any objection to the previous question being ordered hearing none the previous question is ordered is there any objection to adopting the committee's substitute hearing none the committee's substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed we'll vote no and mr. clerk will you unlock the machine have all members voted all members voted if so mr. clerk will you lock the machine on the passage of house bill 169 169 the yeas are 160 the nays are zero this bill however you see the wreck was a constitutional majority is therefore passed mr. clerk for your e-captain is house bill 241 241 house bill 241 by Representative Rose the 124th and others being taught on act two men chapter one and title 13 of the fiscal to George annotated relating the general provisions regarding contracts so as we revise provisions regarding convenience fees for payment by electronic means this bill that refer to the committee on banks and banking that committee recommends a dis bill do pass by committee substitute chairman road is recognized to present house bill 241 gentlemen is recognized thank you mr. speaker i have before you today house bill 241 i've introduced this bill to help provide regular regulatory clarity for certain types of urn wage access providers in Georgia to enhance consumer protections ew a allows workers to access their pay as they earn it rather than waiting for payday the purpose of this bill aims to provide regulatory transparency for ew a providers that offer their services as loans rather than creating a new regulatory framework house bill 241 allows ew a providers operating as lenders to fall under existing statutes so this ensures these types of services comply with established laws designed to protect consumers so all this bill simply does is permit a convenience fee for up to five dollars for ew advances structured as loans and they are allowed to get 50% of their pay up to five hundred dollars mr. speaker i'll be glad to answer any questions gentleman has no questions thank you i ask for your favorable vote gentleman has you to the well is there an objection to the previous question being ordered hearing none the previous question is ordered is there an objection to adopting the committee's substitute hearing none the committee's substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report of the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and mr. clerk will you unlock the machine you have all members voted all members voted if so mr. clerk will you lock the machine on the passage of house bill 241 the yeas are 160 and nays are three this bill having received the requisite constitutional majority is therefore passed mr. clerk will you read the caption the house bill 94 9 4 house bill 94 by revs it have lumped into the 12th and others being tied up back to amend chapter 24 title 33 the fish go to Georgia annotated relating the insurance generally so as the required coverage for certain expenses for standard fertility preservation services this bill that refer to the committee on health that committee recommends that this bill do pass chairman lumbston is recognized to present house bill 94 thank you mr. speaker members of the house I bring to you house bill 94 which is a bill that will provide insurance coverage for cost associated with a harvesting and storage for up to one year of certain biological tissues necessary for future in vitro fertilization for those individuals who have been diagnosed with cancer lupus or sickle cell as you may know the treatment for those who have such a diagnosis usually involves treatment such as radiation and chemo therapy which will render them in fertile this bill does not cover the cost of in vitro fertilization it only addresses the cost of harvesting and storage of the biological tissue necessary for future in vitro fertilization mr. speaker that is the bill how would appreciate your favorable consideration gentlemen had no questions these yielded the well I believe you did have one question I take that back it just popped up if if gentlemen were yield how will you represent the scofial is recognized for a question to your right thank you mr. speaker did you gentlemen yield I did is this not a bill that I'm in support of because it will align with the bill that I dropped regarding freezing the eggs but thank you for adding lupus to this bill well and I really appreciate my right minds think alike so I'm glad we were on the same page yes thank you very much thank you just speak right the other one gentlemen is yielded the well is objection to the previous question being ordered here in under previous questions ordered is there any objection to a green to the report of the committee which was favorable to the passage of the bill here in under the report the committee has agreed to shout this bill now pass all in favor of the past the bill will vote yes all those opposed will vote no and mr. clerk will you unlock the machine all members voted now have all members voted if so mr. clerk will you lock the machine on the past of house bill 94 the A's are 162 the Nays are two this bill Henry C to requisite constitutional majority is therefore passed mr. clerk will you read the caption of house bill 163 163 house bill 163 members and it really the 22nd and others to be entitled not to amend art 13 to chapter 22 total 26 of the physical to Georgia annotate\n\nIn relating the food service establishments, so as required, that certain food products be disclosed as containing cell cultured meat, plant-based meat alternatives, or both this bill I've referred to the committee on agriculture and consumer affairs, that committee recommends that this bill do pass. Representative Jordan Ridley is recognized to present the bill. Representative Ridley. Thank you, Mr. Speaker. Today I bring this bill to have restaurants labeled lab-grown meat on their menus. Recently, the United States Department of Agriculture has approved two lab-grown meats to be sold inside the United States. This bill is very simple. It's only 30 lines long. We're just requiring restaurants to label lab-grown meat on their menu for consumer protection and transparency. And I hope to have your support. You'll have for any questions. Gentlemen, have some questions. Thank you, Mr. Speaker. I hope to earn your favorable consideration. The gentleman's yielded the well. Is there any objection to the previous question being ordered? Is there any objection to agreeing to the report of the committee, which was favorable to the past to the bill? Here in the report of the committee's agreed to. Shall this bill now pass all in favor of the past to the bill? We'll vote yes. All those opposed. We'll vote no one. Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? All in the passage of House Bill 163, the yeas are 161, the nays are three. This bill, having received a requisite constitutional majority, is therefore passed. Hang with me, members. We're about there. Mr. Clerk, will you read the caption of House Bill 187? 187? House Bill 187, my reference to Washburn and the 144th and others to be entitled, and act to amend titles 8, 10, 36, 43, and 46. Are the officials going to Georgia annotated relating to buildings and housings, commerce and trade, local government, professions and businesses? This bill now referred to the Committee Unregulated Industries. That committee recommends this bill do pass by Committee Substitute. Representative Washburn is recognized to speak to the bill. Thank you, Mr. Speaker, ladies and gentlemen, the House on over hours late. We'll make this as brief as we can. House Bill 187 seeks to modify certain provisions related to contractors, including electrical contractors, plumbers, conditionary contractors, low voltage contractors, and utility contractors. This bill will streamline regulations and ask professional standards, help economic growth and contribute to public safety. All the lobbyists involved with these different categories came to the table during Chairman DeLoch's subcommittee, and everybody agreed to it. It passed the House last session and was not called in the Senate. And Mr. Speaker asks for everyone's favorable consideration, and will you deal for any questions that are in it? The gentleman has no questions. Thank you, Mr. Speaker. The gentleman's yield to the well is any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the Committee Substitute? Hearing none, the Committee Substitute is adopted. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee's agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote. Yes, all those opposed will vote. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. Yes, so, Mr. Clerk. There's a green in the red one there. That's what you got, guys. I've got to use one of the two. All members voted. So, Mr. Clerk, will you unlock the machine? All in the passage of the House bill 187. The yeas are 157. The nays are two. Mr. Bill Henry, see the requisite constitutional majority is there for pass. I don't know about y'all, but this is the one I've been looking for. Mr. Clerk, would you read the caption to House bill 227, 227? House bill 227 by roughs and a dicky, the 134th of me in total, and act to amend various provisions of the official code of Georgia annotated so to rename a low THC oil as medical cannabis. This bill ever further committee on health. That committee recommends a disbilled do pass by committee substitute. Chairman Dickie is recognized to present House bill 227. Chairman Dickie. Thank you, Mr. Speaker. I'm honored to present the XB 227. Putting Georgia's patient's first act. This is the 10th anniversary year of our medical cannabis program. Many of you are here with Alan Pete. My neighbor in Macon did a lot of work on medical cannabis. Since that bill, this is the first bill in my opinion that's considered to put Georgia's patients first. We have been focused on attention on other parts of this medical cannabis program but have not really focused on the patients where. So I want to put it back to where I think it needs to be. I wrote this bill thinking about the 100 patients and physicians who spoke during a listening tour on the medical cannabis commission conducted last year. And after I spoke to a commission and confirmed that this is some of the feedback they got. So with that, this bill does three things. Only three things. And they are small steps forward for this program. The first bill changes the term low THC or to medical cannabis. The term low THC or is confusing and misleading. It was what we used 10 years ago. So in addition to all the current law allows things like lotions and capsules. And so I just wanted to be more accurate in the description of this program. So it aligns with our commission, the Georgia Access Medical Cannabis Commission. The second thing it does is allows for physicians and patients to be educated about a program, about the program. Patients and physicians could receive accurate and reliable information. They need to know where to go and who to talk to about these products. This would also spearhead and be regulated by the commission with rules and regulations. The third and final thing this bill does, it updates the list of qualifying conditions. It adds loopess. We had loopess days last week as you remember. And that came to the forefront as well as the committee added that. It also removes the terms of their and in stage as the list of medical conditions. I think it ought to be the patients and the doctors decide when they have these conditions, when they can use these products. And I wanted them to be able to use it before hospice was called in. This is a simple bill and that is all it does. Three things. I ask your consideration. I'm happy to answer any questions if there's any. Mr. Chairman, the minority leader now shaking our heads both when you said this is a simple bill. That's always not a good thing to say. Just say it. You have a couple of questions. Representative Reeves to your right is a recognized request. Thank you, Mr. Speaker, with the Chairman. You'll for a question. Yes, I do. Mr. Chairman, is it not high time to update Georgia's medical terminology to medical cannabis, to reduce confusion with patients and medical professionals to ensure that people in the community are safe. Yes, I know we're sure people in need can access this prescribed treatment without any unnecessary burdens. And also that Georgians who are in great pain, but not yet in hospice care can take this medicine that God made rather than opioids made in a foreign lab. You are absolutely right, thank you for that statement. That is the reason for this bill. Mr. Chairman, would you yield for one more question? one more. Representative David Clark right out to your right in front of you. Has a question. Gentlemen's recognized. Does the gentleman yield? Yes sir. Isn't that true? The House bill 227 is the first time since 2015 that patients have been put first. It is my opinion. Yes sir. Thank you and a great bill. Thank you. Gentlemen has no further question. Well. Hey, we working together here. I like that when we're working together. Gentlemen's yielded the well. Is there an objection to the previous question being ordered? Here in none the previous questions ordered. Is there any objection to adopting the committee's substitute? Here in none the committee's substitute is adopted. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. Shout out this bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And the clerk. Mr. Clerk. Will you unlock the machine? All members voted. All members voted. All members voted. So Mr. Clerk, will you lock the machine? On the passage of House Bill 227, 227, the yeas are 164, the nays are won. This bill, having received a requisite constitutional majority, is therefore adopted. Members, we will postpone House Resolution 32 to the next legislative date. I'm going to ask the clerk if you'll get ready for some, reach some privileged resolutions. You'll get to that. But first, members, I'm going to ask you if you have a time sensitive afternoon order that we will take it up today. We will. And we have about seven of you that have some. But if you're, if you order can wait until tomorrow, we can, we can postpone until tomorrow. But if it's time sensitive, we'll take it up today. And we, you need to come up and inform the messenger. Just best say that what your decision is if you can help us there. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Terrence LeMont Cooper. Honoring the life and memory of Judge John Allen. Commending the invaluable contributions to school bus drivers and school food service workers in recognize in February 28, 2025 was honoring heroes day, commending and congratulating Reverend Herman Scott for over 20 years of dedicated service, recognizing women's golf week in state of Georgia, commending the Spelvin College glee club on its 100th anniversary congratulating the Northeast High School Raiders football team for participating in the 2024 GHSA Class A Division I state championship, recognizing February 25 as American Heart Month in Macon Bid County, recognizing and commending the Georgia Beverage Association congratulating commending Natasha Bird for receiving the 2025 Yellow Rose nicotine Randall service servant leadership award commending raising expectations incorporated congratulating commending Corey Greenblatt for receiving the 2025 Yellow Rose nicotine Randall served a leadership award recognizing commending fellowship Bible Baptist Church on the occasion of its 45th anniversary commending Chavez Holmes Peach County's 2025 teacher of the year recognizing commending Naya Alia Floyd recognizing the Punjabi language commending habit that for humanity Georgia and its Georgia affiliates and recognizing March 5, 2025 is habitat for humanity Georgia Day at the state capital commending Georgia line workers and recognizing April 14, 2025 is Georgia line work appreciation day at the state capital congratulating commending Christie Lunds for receiving the 2024 Yellow Rose nicotine Randall serve leadership award and for other purposes that completes the reading of the privilege resolutions. Thank you Mr. Clerk, is there an objection to adopting the privilege revolutions period during the resolutions are adopted? For what purpose is represented Paris rise? Creepers in Paris. Thank you Mr. Speaker. I have a... You like state emotion? Motion yes sir. I like state emotion that this house suspended rules under the bill may be read and committed to committee. Mr. Clerk, will you read the caption? I'm sorry I took down the number. A number of House Bill of our office in Paris is a hundred and forty second to be entitled to amend code section 22, 148.4 of the fiscal to Georgia and Tate related financial literacy instruction and curriculum. On the ladies motion that the rules of this House be temporarily suspended so bill can be read for the first time in the sign to committee is their objection. Yes, yes. That's a moving one. For what purpose is representing Matthew at rise? Thank you Mr. Speaker to make a motion. State your motion. I like to move that House Bill 520 be moved from the committee on public and community health and moved to committee health on health in both chairman and agreement. Mr. Clerk, will you read the caption? House Bill 520 by verse 7, Matthew act in the eighty second and others to be entitled to amend title 31 of the fiscal to Georgia and Tate related to health. On the ladies motion that House Bill 520 be withdrawn from the public and community to health committee and recommitted to the health committee is the objection. Judge your objection. So we have an objection on moving the bill from the public and community to health committee. Does the lady move? Yes sir, I move. The lady moves. So our vote will be on the you vote yes if you are in favor of moving the bill from the public and community health committee and nowhere if you are opposed. All those in favor of adopting moving the bill to the health committee will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machines? Mr. Clerk, all members voted. The machine is not working as I would you say. If y'all have come up and informed Clerk, we will allow them to vote for you since your machine is malfunctioning. Was there another one that was not working properly? All members voted. If so, the Clerk will lock the machine. The motion is on the motion to move House Bill 520 from the public. The public and community to health committee. The vote is yes or 95. The nays are 62. It is awarded. For purposes represent Cox rise. Make a motion. State your motion. I move that the rules be temporarily suspended so that a bill may be read for the first time in the signed committee. Mr. Clerk, will you read the caption? A number of House Bill by represent. Of Cox, 28th and others be titled. Next to amend chapter 11, title 16 of the fish go to George Anandtated relating the offenses against public order and safety. The general motion that the rules of this house be temporarily suspended so a bill can read for the first time in the signed committee is the objection. To do so, the motion is on the motion. For what purpose is represented, Cliffton rise. To make a motion. State your motion. Mr. Speaker, I move that the rules be temporary suspended so that a bill may be read for the first time in the signed committee. Mr. Clerk, will you read the caption? A number of House Bill by represent. Cliffton, in the 131st of being titled. Next to amend, part 3 of Article 8 of chapter 14 to the top of 44 of the fish go to George Anandtated relating the mechanics and material in relative to the leans. On the general motion that the rules of this house be temporarily suspended so a bill can read for the first time in the signed committee is the objection. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To do so, the motion. To move the house bill, HB193 be moved from the committee of judiciary to the committee of natural resources and environment. Both the chairman and the chair lady are in agreement. Mr. Clerk, will you read the caption? House of 193 by represent. More than 91st of being titled, next to amend, title 31 of the fish go to George Anandtated relating to health so to provide the persons doing business in this state. Sean not expose individuals to chemical snow and the cause of cancer. On the lady's motion, the house bill, 193 be withdrawn from the judiciary committee and recommitted to the natural resources and environment committee is objection. Hearing none is awarded. For what purpose is representing, Dempsey rise? To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. To make a motion. I'll numbered House Bill by represent again, Dempsey, 13th and others to meet a move, and act to amend, and title 31 of the fish go to George Anandtated relating General provisions of health. On the lady's motion, the rule of this house be temporary suspended. So a bill could be read for the first time in a signed committee is the objection. Health. For what purpose is representing Sheila Jones rise? Hold it. Sorry. just a whole adjustment I'm sorry. We don't get to you in just a minute, Representative Jones. For what purpose of representative Hilton rise? Thank you, Mr. Speaker, make a motion. State your motion. I move that the rules be temporarily suspended so that the bill may be read for the first time in assigned to committee. Miss Clerk, will you read a caption? Unnumbered House Bill of other representatives of Hilton of the 48. Please me and Todd will back to amend chapter 80, you title 36. The official go to George Antieta, relaying the general provisions of applicable counties, minister, corporations and other governmental entities. On the general's motion that the rule of this House be temporarily suspended so a bill can be read for the first time in assigned committee is the objection. Governmental affairs. For what purpose of representative Anderson rise? To make a motion. State your motion. Mr. Speaker, I move that House Bill 399 be recommitted from rules to governmental affairs. Mr. Clerk, will you read the caption? House Bill 399, our revs and volume of the 84th annulments be titled back to amend article 1 of chapter 7 of the title 44, which is go to George Antieta, relaying the landlords and tenants in general. On the general's motion that House bill 399 be recommitted from the rules committee to the governmental affairs committee, his objection. Here in notice awarded. We do have some afternoon orders. We're going to recognize members that have some afternoon orders at our time sensitive. And they're going to have about 30 seconds. Absolutely, one absolutely, no more than 60 seconds to let us hear about the afternoon orders. The representative scope field is recognized for an afternoon order. Hold on just a second, ladies. Let's get some attention. I, ladies, we'll receive. Thank you, Mr. Speaker. Members, I rise today in support of Black History Month and bring to you Dr. Patricia Bath, a visionary pioneer in medicine. She's a groundbreaking ophthalmologist and venture advocate for equitable health care. Born in Harlem, New York earned her National Science Foundation degree for cancer research at the age of 16, graduated with a BA from Hunter College. She was the first African American woman to complete an ophthalmology residency at NYU. And she's really noticed for her racial disparities in eye health. She was the co-founder of the American institution for the prevention of blindness. She also invented laser-focaux probe, which is a groundbreaking desire used to treat cataracts. She received the first US patent for her work and opened doors from women in medicine and STEM. Her quote, and is the ability to resource site as an ultimate reward. I cite as a basic human right and everyone deserves a chance to see the world clearly. Dr. Bath said, and I quote, vision is a gift, not a right. Through innovation, compassion, and determination, I believe we can create a world where no one is left in the dark. And every eye can have the possibilities of tomorrow. Mr. Speaker, she died in 2019, but I yielded well in her honor. Awesome. Very good one. We're glad you did it today. Ladies, you're the well. Thank you, members, that have postponed your afternoon orders until tomorrow. Very much appreciated. We'll move on to announcements now. Chairman Corbett. Give the gentleman some room. Recognize for an announcement. Members, let's move committees back. Mr. Chairman, until three o'clock, three o'clock, that gives us a chance to get something. We need if that works for you. Will that work for your committee? Absolutely. I'll mind. We'll most back all of them. Until three o'clock. Mojavego's committee eight o'clock in the morning, 606. Thank you. Well, that's even better. We want three o'clock. Won't work for you either way. Thanks a lot. Reps it to be clean. Recognize for an announcement. Thank you, Mr. Speaker. The working family of cocktails will not meet, but there is food and room, three, twelve, or but the CLOB. There's food and room, three, twelve. There's not a working family of cocktails meeting today, but there's food in three, twelve, CLOB. Thank you, Mr. Speaker. Representative Carter, recognize for an announcement. Thank you, Mr. Speaker. Good afternoon, everyone. Feel your attention, please. On tomorrow, Friday, the 28th, at eight o'clock AM, we will be hosting the National African American Gun Association in the capital in room 125. So if you are available in the morning at eight AM, come and meet those members. We will recognize them in the gallery for their 10th anniversary. Tomorrow, the National African American Gun Association will be here with us a year and a half. Thank you, Mr. זes. I would like to thank you, Mr. Chairman. Thank you, Mr. Wynne. Chairman Jasper, recognize for an announcement. Thank you, Mr. Speaker, transportation to be in room 606, as the speaker said at three o'clock. Thank you. Chairman Halkins, recognize for an announcement. Thank you, Mr. Speaker, the health committee will meet at three o'clock, 4.03CAM. She's got it. We were almost adjourned on that one. Chairman Gunther recognized for announcement. Chairman Camp. Chairman Gunther. Yeah. Stand Gunther right there. That's you. Thank you, Mr. Speaker. House Judiciary will meet in Room 132 at three o'clock. We've got about four bills to do. They've been work done. So hopefully it goes quickly. Thank you. Chairman. Chair Lady Camp. Thank you, Mr. Speaker. Intergovernmental coordination will meet tomorrow afternoon in Room 341 upon adjournment. Thank you.\n\nChairman Erwin recognized for the announcement. Chairman Erwin. Thank you, Mr. Speaker. Education will meet in CLOB at 3 o'clock, room 506. We'll get quite a bit to do. Education members to get your food in and be there at 3 o'clock, please. Chairman Anderson recognized for the announcement. Thank you, Mr. Speaker. Government Affairs will have a meeting this afternoon at in CLOB 606 at 4 o'clock. Be real quick. Got two measures we need to take up. So 4 o'clock, CLOB 606. Thank you. Representative Jardinius recognized for the announcement. Representative Jardinius. Thank you, Mr. Speaker. Georgia Legislative Black Caucus members, we have a GLBC Priorities press conference at 245 at the South Steps, from 245 to 330 at the South Steps. Thank you, Mr. Speaker. Chairman Parish recognized for the announcement. Thank you, Mr. Speaker. The rules committee will meet in the morning 830. 830 in the morning, rules. Thank you. Chairman Brad Thomas. Pay attention to his announcements. A little off the pace here, but it's going to be accurate. So the special committee on resource management has people that have flown in from across the country to talk about the specific topics. So we're actually going to meet upon adjournment at 341. And we are going to adjust the agenda. We're going to shorten it for the folks that are out of town. We want to be respectful of them. So let's see in 341. Thanks. 341. Now, Chairman Crowe, Director of the House of R&D. Thank you, Mr. Speaker. Members of the Public Safety and Homeland Security Committee, we will have a very, very quick meeting after the press conference. We're going to jump in right before education. Chairman Irwin was kind enough to let us jump in front. We've got one very small measure to take up. We'll last more than five minutes. CLOB Room 506. Thank you. We represent even leverage. Chairman Levitt recognized for the announcement. Thank you, Mr. Speaker. The subcommittee of rules on lawsuit reform is going to have its first meeting today at 330 and 341 of the Capitol. We'll just be hearing. It's a hearing only. We'll just hear the bill presented to us by the sponsor. But that'll be at 330 in room 341. Thank you. Chairman, the Petrie recognized for the announcement. Thank you, Mr. Speaker. The Human Relations and Aging Committee will meet at 3 o'clock today in 406 CLOB. We have one bill that's already been heard before that we'll take up just one issue. Thank you, Mr. Speaker. That completes our announcement. House, thanks for hanging with us today. We've got a lot done. We appreciate Charles' attention and your passion and your compassion for our work we do. Now, speaking of compassion, we have some birthdays today. One of them is the... Yeah, you are. Representative, Vince Smith, am I right right down? I thought you already had a birthday this year. First one this year. First one. Representative Matthew Gamble also has a birthday. Will's a Representative Gamble. He fled the scene, but he still has a birthday. And of course, the gentleman from the coast, representing Buddy Deloge. Happy birthday, buddy. Mr. Chairman. If you have a page, we invite you to come down front and we'll get some page photos. The majority of this house, majority of the left-street, majority of the left-street, is recognized for a motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 9 a.m. on Friday, February 28, 2025. On the motion of the majority leader that this house stands adjourned until 9 a.m., 9 a.m. Friday, February 28, 2020. We're the 28, 2025. All those in favor say aye. All those opposed will say no. Y'all got a little closer, David. We still got you. This house stands adjourned. Thank you.",
  "updated_at": "2026-02-13T02:00:25.352655+00:00"
}