{
  "video_id": "bMzK1HYriBk",
  "url": "https://www.youtube.com/watch?v=bMzK1HYriBk",
  "title": "Georgia House Democrats walk out over vote to ban prisons from providing gender-affirming care",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "# Georgia House Democrats Walk Out Over Vote to Ban Prisons from Providing Gender-Affirming Care\n\n## Overview\nThe Georgia House session was marked by a demonstration and walkout by Democrats in protest of SB 1885, a bill that would ban the use of state funds for gender-affirming care for transgender prisoners. Republicans criticized the Democrats' decision to leave the chamber during the vote.\n\n## Key Actions\n**SB 1885**: Bill to ban the use of state funds for gender-affirming care for transgender prisoners in Georgia\n\n## Bills Introduced (First Reading)\nNone noted.\n\n## Notable Moments\n- Democrats spoke in opposition to SB 1885, questioning why the legislature was so \"obsessed\" with transgender citizens' personal lives.\n- After the speeches, the Democratic members walked out of the chamber in protest.\n- Republicans criticized the Democrats' walkout, calling it the \"most disheartening moment\" they had experienced during their service in the House.\n\n## Votes\n- SB 1885 passed by a vote of 100-2.\n\n## Attendance\nQuorum was maintained despite the Democratic walkout.\n\n## Adjournment\nThe session adjourned. The next session date was not specified.",
  "transcript": "and a demonstration from the Democrats\nin protest of SB 1885 the bill would ban\nthe use of State funds for gender\naffirming care for transgendered\nprisoners in Georgia Democrats spoke in\nopposition what is it what is going on\nwith my colleagues that they have become\nso obsessed with what is happening in\ntransgender citizens panties and their\nunderwear and their boxer shorts and\ntheir bedrooms and their medical rooms\nwhen they talk to their doctors when\nthey deal with their families why is it\nthat this has\nbecome such an obsession and then walked\nout of the\nchamber Republicans were quick to\ncriticize the move probably the most\ndisheartening moment I've ever had my\nservice here as a member of the House\nthe bill passed 100 to two",
  "updated_at": "2026-02-14T14:50:26.840894+00:00"
}