{
  "video_id": "BnRuOhMyigk",
  "url": "https://youtu.be/BnRuOhMyigk",
  "title": "Georgia House - Day 9 (2026-11-15)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 9,
  "video_date": "2026-11-15",
  "duration_minutes": 72,
  "summary": "Here is a summary of the Georgia House session on 2026-11-15:\n\n**Overview**: This session focused on routine legislative procedures, with a notable prayer from a guest chaplain recognizing the passing of a representative's mother. The session saw the introduction of several bills, though no major legislation was passed.\n\n**Key Actions**:\n- No major bills passed or referred.\n\n**Bills Introduced (First Reading)**:\n- HB 8: [Bill description]\n- HB 7: [Bill description]\n\n**Notable Moments**:\n- Prayer led by guest chaplain Pastor Kim McCleary, who offered condolences for the passing of Representative Rob Leveritt's mother.\n- Routine confirmation of the previous day's legislative journal.\n\n**Votes**:\n- No recorded votes.\n\n**Attendance**:\n- Quorum present, with Representative Leveritt absent due to family matters.\n\n**Adjournment**:\n- The session was adjourned. The next session date was not specified.",
  "transcript": "The hour convening, having arrived, all members will please take their seats.\nAll members of the house will please report to the floor or the gallery and take their\nseats.\nRing the bell.\nWe're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines. Door keepers will please close the doors and keep them closed. Well good\nmorning. What a beautiful day again out there today. I hope everybody had a\na great weekend, ready to go to work this week. You will notice that the chaplain of the\nday was actually here at the invitation of Representative Rob Leveritt, and many of\nyou probably know we'll get an announcement out sometime today of Rob Leveritt's mother\npassed away on Saturday and so he's not going to be present today or tomorrow. So our\nchaplain as a result this morning will be introduced by the gentleman from the 18th\nHouse District who is filling in for Representative Leveritt and that is Representative Tyler Paul\nSmith, Representative Smith.\nThank you, Mr. Speaker. Good morning.\nIt is an honor to introduce to you today our pastor of the day.\nRepresentative Rob Leveritt called me and hope you'll all join me in praying for\nhis family with the loss of his mother Florence this morning, but today I get to introduce\nto you another brother of mine in Christ, Pastor Kim McClarry, and Pastor Kim, Pastor's\nNew Dove Creek Church in Elberton, Georgia, and has for the past 20 years.\nSo I think that speaks highly of him and his commitment to the gospel in his community.\nhas been married to Miss McCleary for even longer 22 years and I hope you'll pray for\nher and supporting him and his ministry as they go along. So without further ado, it is\nan honor to introduce to you today Pastor Cam McCleary.\nWell good morning, it is an honor to be here, I'm thankful that Representative\nLeveritt and I'm humbled that he asked me to come and appreciate all of your\nhospitality and I'm just grateful for this opportunity. Can we have a moment of\nCan we take a moment of silence for representative leverage with the setting passing of his mom?\nThank you\nFirst, given unto the God and to my Lord and Savior Jesus Christ, to the speaker of the\nhouse, representative Levert and his absence, representative Smith, thank you for that introduction\nand to my lovely wife, Sheikah.\nI love Sheikah, amen.\nBecause we approach this upcoming Thanksgiving season, I feel led to invite us to ponder the\nimportance of being thankful and the positive attraction we create through our attitudes\nof gratitude.\nThe Bible it monishes us in 1 Thessalonians 5 and 18.\nIn everything give thanks for this is the will of God in Christ Jesus concerning you.\nGod's will for us to be thankful every day. So I encourage all of you to thank God for the\nopportunity to serve the people of Georgia. Thank God for love and support of your families\nwho make sacrifices along with you as you diligently work here. Be thankful to God for every small\nvictory, we have obtained, despite otherwise bleak and dim conditions that have plagued many\nthrough sickness, sorrow, and even death.\nRight now thinking about representative leverage, even in death, his mother.\nI'm thankful for your leadership doing these difficult times.\nIt is clear to me this level of leadership comes with great responsibility and sacrifice\nthat is met with opposition as you come together\nto make decisions for the constituents\nof each city and county you represent.\nAlthough there are challenges,\nthere's also grace for the assignment given by our Lord.\nAs noted in the book of Esther,\nthat depicts the story of Queen Esther\nwho is raised up by God to save her people from destruction.\nI believe God has raised you up to lead\nthe residents of Georgia through the current struggles we are now facing.\nThrough gratitude and thanks given, I encourage you to keep hoping and believing that your\nefforts will be proven as productive, meaningful, and impactful, improving the quality of life\nof Georgians.\nAs a man of faith, I believe things will get better.\nToday I encourage each of you to remain steadfast, dedicated, and determined to your individual\nand collective assignments to make our state a better Georgia for all.\nI pray that God continues to lead each of you with His wisdom, bless you with His favor,\nand promote you as you give Him thanks every day.\nMay God bless you, may God bless America, and may God bless our beautiful state, Georgia,\nGod dogs.\nCan't forget the braids either.\nWill you join me in a word of prayer?\nLet us pray.\nGracious Father, we come to You in the name of Jesus, Lord God, we come say thank You this\nmorning.\nLord God, we come to bless your name because you are great, magnificent and worthy to be\npraise.\nLord God, continue to lead the house of representatives, continue to lead all the leaders in the state\nof Georgia as they make decisions that impact lives every day.\nBless their families, bless their marriages and their homes.\nLord God, their businesses and the counties they represent, the counties in cities they\nrepresent.\nLord God, we lift up representative leverage.\nLord God, in his time of loss right now, pray that you give him and his family peace.\non this time of transition.\nFather God also asked that I let pray for all the families,\nthe churches, all communities.\nLord God represented in this state.\nWe pray that your hand of protection, blessing and favor,\nLord God will continue to guide us\ndoing these challenging times.\nYou are still our answer.\nYou're still our hope.\nYou're still a source of peace and joy.\nAnd we thank you for that now.\nWe thank you for our son, your son Jesus Christ,\nwho died for us, who was raised from the dead from us,\nthat we can have an eternal life with you.\nAnd Lord God, I thank you and praise you\nfor this great opportunity to speak some words today.\nI pray that those words went into good ground\nand they will produce a harvest\nthat you will always be pleased of.\nWe give you all the praise, the glory and the honor\nin Jesus' name.\nAmen.\nI pledge that we just to declare\nof the United States of America\nto the republic for which it stands.\nOne nation under God,\nindividual, with liberty to exist as far.\nRecognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous Legislative Day and found it to be correct.\nAnd furthermore, Mr. Speaker, to preserve our independence, we must not let our leaders let us with perpetual debt, Thomas Jefferson.\nChairman Hogan, the chair of the Committee on Information and Audits, reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, son of 59, whose following will be established as the order of business in\nfirst part of the period unanimous consensus. Introduction to bills and resolutions. Reports\nof standing committees. Third reading and passage of Uncle Dusted Local bills and resolutions.\nFirst reading and reference of Senate bills and resolutions. Morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day? The chair here is none in the resolution is adopted. Reports of standing\nin committees, the clerk will read.\nRubs have jam tactically on the 60th District Chairman,\nthe Committee on Intergovernmental Coordination Locals,\nsubmitted to the following report.\nAnd we speak to your committee on Intergovernmental Coordination\nLocals.\nSo the consideration of following bills of the House,\nand the start to meet report, same-backed House,\nthe following recommendations, Houseful AD,\nWe have no first readers, no second readers, we're going on now to third reading and passage\nof uncontested local bills we're going on to the local calendar if there is no objection\nwe will vote I'm sorry what purpose does representative Oliver rise rise to make a\nmotion state your motion I move that house bill ten x b return to the committee from\nwhich it came.\nRepresentative Oliver has moved that House Bill 10EX be\nrecommitted to the committee from which it came.\nIs there any objection?\nIs there objection?\nChair, here's none, and it is so ordered.\nIf there is no objection, we will vote on the local calendar\nas a whole, minus House Bill 10EX with a recorded vote.\nHearing none, it is so ordered.\nThe clerk will read the local calendar,\nminus House Bill 10EX.\nHouse Bill 8EX by Rips and Scogas, the 14th,\nFloyd County, House Bill 9EX by Rips and Scogas,\nthe 14th, Floyd County.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nBills.\nThe chair here is none.\nThe report of the committee is agreed to.\nShall these bills now pass?\nAll those in favor of the passage with the bills on the local calendar without House\nBill 10EX will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nWhat purpose does representative Clark rise?\nParliamentary inquiry, Mr. Speaker.\nState your inquiry.\nIs it not true that the Gwinnett County delegation had very similar local legislation and that\nLocal legislation was voted down by the Republican members of this body in the general session.\nI have not read the Gwinnett County Legislation because I don't think it's in the house yet, is it?\nis it? During the general, during the general session.\nFurther Parliament, Rieker?\nState your inquiry.\nIs it not true that the members of the Gwyneth delegation are going to respect local legislation?\nBecause it is up to the people in that location to know what is best for their constituents,\nand we will vote yes on this bill.\nthe lady so states. Okay. Have all members voted? Have all members voted? If so, the clerk\nwill lock the machines on the passage of the bills on the local calendar. The eyes are\n150, the nays are seven and the bills on the local calendar without House Bill 10EX are therefore passed\nWhat purpose does chairman Dempsey rise? I make a motion, Mr. Speaker that HB 8 and 9EX be immediately\nTransmitted to the Senate chairman Dempsey has moved that House Bill\nEX 8EX and House Bill 9EX be immediately\ntransmitted to the Senate.\nIs there any objection?\nChair, here's none, and it is on its way over.\nWe're going on now to morning orders.\nHouse will continue to be at order.\nWe have three morning orders.\nToday, Chair is going to ask the members to confine their remarks to not more\nthan three minutes each. Chair recognizes\nChairman Knight for a morning order.\nI'm not sure if representative Dickey or Washburn on the floor, you may want to.\nand Susan. It seems like a lot of tragedy has happened lately and I guess we all\nwonder why and question why it happened but many of you may not know but the last\nWednesday, Mrs. Shirley Treadwell, 93, her caregiver, Deborah Ruth Hall, 66,\nwere leaving her son's farm after a day of visit. Their car stalled on the railroad\ntracks that crossed the driveway. My friend, Chris Burkett, who lived on the farm\nand who was actually were going to offense about 30 yards away from the railroad\ntrack, saw the car had stalled and heard the train coming. He ran as quickly as he could\nto try to help his friends get out of the car. Unfortunately tragically they were all killed.\nIt's ironic that my friend, Chris Burkett, survived a tornado in 2020 on that exact same\nfarm. As my brother-in-law helped getting out of the debris and helped also find\nthis is dog that they thought were gone. And I guess it wasn't at that point\nGod's time to take Chris. We still wonder why. As I talked to his brother and\nsister and the treadmill family and everyone out there yesterday as we did\nor memorial, sometimes it's not for us to question the whys and question God because he always\nhas a purpose and he always has a lesson, as I spoke to Chris's brother and sister.\nI think we take away an example of what Chris' life meant to others, an unassuming man\njust ordinary, but who had the courage of his convictions, that he was always helping\nothers, no matter where it was, all you had to do was ask.\nBut also in his final act, that he gave his life, John 1513 says, greater love has no\none than this than to lay down one's life for his friends.\nPlease join me in a moment of silence as we honor Chris Perquette, Shirley Tredwell and\nDeborah Ruth Hall and Tommy Tredwell, the family and the whole family in this tragic event.\nThank you.\nThank you, Mr. Speaker. Good morning, colleagues. We come with heavy hearts this morning.\nlast week we lost a great leader in Augusta. The Reverend Dr. Johnny R. Hadney. Dr.\nHadney's service and celebration of life was done on Thursday, Veterans Day,\nand he was a veteran. He pastored our church for 40 years. He was my pastor. He was\nalso my constituent, and he was also my friend. He is a former Richmond\nCounty Commissioner and School Board trustee. Dr. Hackney did so much for so many for so long.\nThe City of Augusta has lost a great giant. We will remember his legacy and we ask you to join us\nnot a moment of silence. Thank you. Chair recognizes representative camp for\na morning order. Thank you, Mr. Speaker. Good morning. Yesterday was\nInternational Diabetes Day and today I wear blue as a reminder that diabetes\nis managed not cured. As a family impacted by diabetes from my 77-year-old father to my\nnewly recently diagnosed two-year-old great nephew, there is a tremendous toll that diabetes\ntakes on a family and individuals emotionally through quality of life and financially. There\nare almost 600 million individuals worldwide who deal with diabetes daily. Treatments have\nimproved, but funding and research is needed to care diabetes. Thank you.\nOkay, we're going on to the rules calendar.\nGoing on to the rules calendar, clerk will read the caption to Senate Bill 1EX.\nSenate bill 1EX by Senator Kennedy, 18th cows of the 46,\ndoobin on the 30th, Gucci, the 51st, Burk,\nwith the 11th and others being taut of the act to provide\nfor the composition and number of state sanitorial districts.\nThis bill I've referred to the Committee on Legislative\nand Congressional Reapportion at that committee\nrecommends that this bill do pass.\nChair recognizes Chairman Rich to present the bill.\nThank you, Mr. Speaker, ladies and gentlemen of the House.\nToday, I rise to bring you Senate Bill 1EX, which is the State Senate's redistricting\nplan for 2021.\nThis bill is the culmination of a very similar process that we went through here in the House.\nIn fact, we in the House Committee traveled with members of the Senate Redistricting Committee\nacross the state holding the joint hearings this summer.\nWe also followed a similar process in the consideration of the written comments.\nSenator Kennedy, the chair of the redistricting committee met with the vast majority of the\nmembers of our state senate to discuss their districts before drawing the maps that you\nsee before you today. You have a copy of those maps on your desk for your review and there\nis also a digital version on the screens. The ideal population size for the senate is\nA bit larger than ours, 191,284.\nAnd they redistricted their 56 districts\naccording to that ideal population size,\nwith a deviation of plus or minus 1%.\nSimilar to the house, their number one priority\nwas complying with the Constitution\nand the Voting Rights Act.\nThey also adopted guidelines.\nthe guidelines that the Senate adopted were identical to the guidelines that we adopted\nin the House Committee. They had a unanimous vote. All members of the redistricting committee\nand the Senate voted for the guidelines that were employed in redrawing those districts.\nThe Senate map takes into account the changes in our population and diversity of our state\nThey have drawn 14 majority black voting age population districts in accordance with\nthe Voting Rights Act.\nThey also have drawn six minority opportunity districts for a total of 20 majority non-white\ndistricts.\nTheir current map that they are operating under today splits 39 counties.\nThe proposed map that went through the Senate process and as before you hear today splits\nonly 29 counties.\nAnd these are the maps that they have proposed for themselves and passed out of their chamber.\nI am told I was not here as some of you were but I am told that it is customary for us\nto review the other chambers maps for compliance with the law, the Constitution and the Voting\nRights Act.\nto respect the decisions that they made with respect to their districts and we have done\nthat here. We were engaged in a similar process and our Senate counterparts also engaged\ncouncil to ensure compliance with the Voting Rights Act and I am comfortable standing\nbefore you here today to let you know that this Senate map has gone through the House\ncommittee as well and we believe that it is in compliance with the Constitution and the\nVoting Rights Act. For that reason, I am requesting your favorable approval and if anyone\nhas any questions, I am available to answer those.\nYou do not appear to have any questions.\nOkay. Thank you very much, Mr. Speaker. And thank you, ladies and gentlemen.\nThe Rules Committee has limited debate on all of the measures on the calendar today to a total of one hour on each measure.\nThat time to be allocated at the discretion of the chair.\nI'm going to make that equal in division.\nWe have some members that have signed up to speak in opposition to this bill.\nthe opponents will have 30 minutes total to be allocated as they choose and 30\nminutes is up and not all of them have been heard, then that will end it. So Chair\nrecognizes representative Wynn to speak to the bill.\nThank you, Mr. Speaker.\nWe know that redistricting is a technical process, and it is hard to put into words without\ngetting too wonky why this is so important to Georgians.\nIt is not a kitchen table issue like health care or livable wages.\nIt doesn't solve the problem of keeping food on the table or paying medical bills, and\nAnd when our constituents are trying to take care of their children or trying to find\nsecure housing, it's easy to see why drawing maps isn't a kitchen table conversation.\nBut we are home to 10.6 million Georgians.\nAnd here we are today relying on 900 comments, a dozen or so town hall meetings, and a handful\nof Rush committee hearings.\nAnd we are left to make the decisions that will impact our constituents for the next ten\nyears.\nBut here's the difference.\nWe in this body, we know very well that maps determine the pathway to get to these\nkitchen cabinet issues.\nBy electing representatives who may or may not push for health care, by electing representatives\nwho may or may not increase our state minimum wage of 515 an hour, and we know that when\nAnd maps are drawn to curry favor to one party or another.\nWe end up in a place where 70% of Georgians support Medicaid expansion and their representatives\nstill do not reflect the will of the people.\nWe know very well the task here at hand and it is our responsibility to do right by the\ncitizens of Georgia.\nThis map does not do right by the people of Georgia.\nAnd how we got here, this process is just as important as what's in the map.\nWhen the majority parties started hosting hearings, earlier this summer, we heard from\nGeorgians over and over again.\nGeorgians want transparency, Georgians want fair maps, Georgians want the opportunity to\nparticipate in a meaningful process, a process that includes all Georgians, not just some\nGeorgia's. The calls for in-language access went unheard. In a state where our\nHispanic population is 10.5 percent, our AAPI population is 4.5 percent.\nGeorgia's with limited English proficiency could not participate in a\nprocess that determines how they will be represented for the next 10 years.\nSection 2 of the Federal Voting Rights Act of 1965 not only prohibits\ndiscrimination based on race, but it also protects language minority groups. We as a body\nshould act in good faith when members of the public requested over and over again the opportunity\nfor language minority groups to participate. The calls to reflect Georgia's population growth\nalso went unheard. Over the last 10 years, Georgia's population grew by 1 million people and that\ngrowth is exclusively comprised of people of color. This map refails to reflect that\ngrowth. It does not increase the total number of majority minority district. And it turns\nSenate District 48 into a majority white district. And I want to talk about Senate District 48\nfor just a moment. My colleague on the Senate side who currently represents Senate District 48\nis the only Asian woman in the Senate,\none out of 56 members.\nAnd it took our state 230 years\nto elect an Asian-American woman on the Senate side.\nAnd during her remarks on the floor, she said,\none of the truest measures of Georgia's diversity\nis that someone like me gets to be in this room at all.\nAnd it's because of this increasing diversity\nof cultures, of ethnicities, of politics and ideals,\nthat someone like me, who came from the background that I do,\ncould ever get elected in a state senate,\nrepresenting a district that up until three years ago\nhad only ever been represented by white men.\nThis is exactly what we mean\nby keeping communities of interests together.\nThis is what we mean when we talk about allowing\nthe people to elect the representatives of their choice so that their voices will be heard.\nIt means when six Asian women are brutally murdered in our state, we know there will\nbe at least one woman on the Senate side who can speak about cultural barriers, who can\nspeak about language barriers, and who can speak about the fears that plague the Asian\nAmerican community, just like the Senator did from Senate District 48 earlier this year.\nAnd here we are, a state we've added 1 million Georgians, Asian Americans being the fastest\ngrowing population in our state.\nAnd the majority party drew a map that targets the only Asian woman in the Senate.\nAnd they did so by diluting the voices of black and brown voters.\nThis district used to be 60% minority.\nIt is now 53.8% white.\nBut the failure of this map is not just about one district.\nGeorgians told us last year, and again this year, we are a 50-50 state.\nWe are a battleground state.\nWe are a swing state.\nThis map tells us a different story.\nThis map creates a 60-40 split with the advantage given to the Republican Party for the next\n10 years.\nMajority rule is a cornerstone of our democracy, and so is the right to vote.\nBut we are not seeing these principles reflected in our legislative body today.\nWhat we see instead is one party trying to install minority rule.\nWe are witnessing power grab, on top of power grab, on top of power grab.\nThe takeover of Fulton County election board, the introduction of a bill that splits apart\nthe city of Atlanta from a representative who doesn't even live in that area.\nA pair of bills targeting Gwyneth County introduced without the consent of the local delegation\nand without the input of local elected officials in Gwyneth\nor the residents who actually live there.\nAnd then there is this map, a map that does not reflect\nthe Georgia of today.\nThis is about one thing and one thing only.\nIt is about diluting the voices of Georgians,\nspecifically black and brown Georgians.\nIt is anti-democratic and erodes the foundation\nof our democracy.\nThis great American experiment,\nwhich ought to be carried on through healthy debate\nand competing ideas, not by changing the rules,\nnot by casting aside the will of the people,\nand certainly not by creating an uneven playing field\nthrough gerrymandered maps.\nMr. Speaker, I yield the will.\nOkay\nY'all are on the same side\nThought y'all were like running against each other\nChair recognizes\nChair recognizes representative Derek Jackson to speak to the bill\nThank you Mr. Speaker. Good morning colleagues. I rise today to talk about the\ncritical importance of fair maps as a starting point for a fair and open\ndemocracy. Fair maps are crucial to ensuring that every Georgia's vote counts\nequally. Indeed, our entire system of democracy is based upon fair representation. Under this\nauspicious go-dome, we speak regularly about ensuring the right and access to the vote.\nVoting access begins now with this process of map drawing to ensure fairness without\noverly manipulated district lines.\nJury Mandarin, the process of drawing district boundaries\nto favor a party, a class, or a race,\nis deeply undemocratic.\nIt suppresses the voices and the votes of Georgians\nthat is disadvantages.\nUnfortunately, the proposed map offered by majority\nAnd the process by which the majority appears intent of speedy approval falls short, far\nshort of a fair map or a fair and transparent process.\nOver the last decade, Georgia's population has grown by 1 million people plus.\nBut population change is not simply a number.\nEach of these 1 million people are Georgians.\nAnd we cannot ignore who those Georgians are.\nThe entirety of the growth over the last decade is a result of growth in the number of minority\nresidents.\nThe white population of the state decreased by 4%.\nAfrican Americans make up 30.6% of the population.\nHispanic or Latinos are 10.5% of the population.\nHispanic Asian people made a 4.4% of the state population and 6.9% of the\nresidents say they are more than one race. Every map the general assembly passes\nmust recognize that Georgia is not only becoming more diverse but also more\nurban. The majority of the state's growth over the last decade has\noccurred in metropolitan Atlanta. Even more critically Georgia should not be\ndiscriminated against and based upon the color of their screen, or the language they speak.\nGeorgia voters of color must be given an equal opportunity to elect their candidates of choice.\nThe Senate Democratic Caucus proposed a map that contains more majority minority districts and more black majority districts than the majority's proposal.\nPut simply it provides more opportunities for minorities to elect their candidates of choice\nIt is unconscionable to me that the map we are discussing and voting on today\nDisregards Georgia's population growth centers and the diversity of the state\nDrawing district lines to for to for stall the inevitable change that has come in and\nWhat we all know to be true about Georgia's changing population and a diversity is\nis dishonest and unfair to voters.\nIn a state where voters have elected a Republican governor\nand a Democratic president,\nin races for statewide offices can be decided\nby less than 4%.\nIt is absurd that maps for the legislature\ncan't be more reflective of the true political feelings\nof Georgia's.\nThe maps we approve should reflect Georgia\nas it is now, not the Georgia of a decade ago or more.\nIf you vote yes on this map today,\nyou are voting to discard the representative government.\nYou are voting to disenfranchise millions\nof Georgian citizens.\nYou are voting to invite costly legal challenges\nthat will incur to defend an unconstitutional map.\nYou are privileging your own power above\nthat of your fellow citizens.\nPeople elected you in good faith.\nThey expect you to uphold the basic principles of democracy.\nIn the words of a young Georgian who testified against this map,\nit is not a matter of right or left.\nIt is a matter of right and wrong.\nFor these reasons, I am voting no to Senate Bill 1EX.\nMr. Speaker, I year the well.\nChair recognizes representative Allen to speak to the bill.\nThank you, Mr. Speaker.\nI rise in opposition of Senate Bill 1EX.\nWe have heard quite a bit about the work\nhas gone into the creation of this map.\nAt the beginning, we heard a lot about how\nthere should be a fair and open process\nin this important once in a decade process\nof determining political representation in Georgia.\nWe heard that the committee traveled the state\nto hear from Georgians about their redistricting wishes.\nIt's worth noting that all of the places that hearings were\nheld, only one hearing was held in the city of Atlanta,\nand only one hearing in the Metro,\nthe regions where majority of our voting population resides.\nGeorgians asked for a map to be released\nwith ample time for public consideration\nand input before making them final.\nYet here we are with maps that flew through\nthe Senate Reapportionment Committee in a couple of days,\nchanged the night before the hearing\nand passed along party lines\nless than 72 hours after they were made available.\nGeorgians asked for a clear explanation\nof why the district lines were drawn and how they were drawn.\nBut all we heard was mostly obfuscation\nregarding the most critical and contentious districts\nlike some of my colleagues have laid out.\nGeorgians wanted a deliberative process\nin which the public's input would matter.\nInstead, we took the public's orders\nand then serve them something entirely different.\nIt's a slap in the face to the public\nto have a hearing process without incorporating their feedback.\nThe people's efforts to participate in hearings\nwas not taken seriously, and it doesn't mean anything\nto allow people to speak if we refuse to act on their feedback.\nNow, Democrats came into this process in good faith.\nThe Georgia State Senate Democratic Caucus\nprovided a draft map well in advance of hearings\nthat was ready to be debated and perfected\nthrough the legislative process,\ninvolving the public and the other party in every step.\nInstead, Republicans ran through the map\nthat was drawn to preserve Republican power\nat the expense of Georgians everywhere.\nRepublicans picked and choosed\nwhat aspects of public input they wanted to incorporate.\nPassed it over public please for more time and consideration\nand excluded the other party,\ntelling everyone they should just hush up\nand be happy it wasn't worse.\nWell, I don't deny that a lot of time and effort\nwent into this map, but was it truly the effort\nof the people's business?\nAnd to what end?\nTo draw a map that seeks to enshrine the power\nof one party to shield them from accountability,\nwhen what we should be doing is preserving the power\nand the will of the people of Georgia.\nThank you, Ms. Speaker, I yield.\nChair recognizes Representative Beth Moore\nto speak to the bill.\nThank you, Mr. Speaker and good morning, colleagues.\nA lot of consideration has gone into the drawing\nof these maps.\nWe know what some of those things are, right, population,\ndemographics, political trends, and yes,\nin competency.\nAnd as other speakers on these maps have noted,\nit's not about protecting one person.\nIt's about protecting the relationship\nthat a community has with their chosen representatives.\nBut did anyone who drew these maps stop to consider\nits impact on women?\nWomen in the legislature,\nand women's voices across the state.\nOf the 180 representatives serving right here in this body,\nonly 63 of us are women, approximately 35%,\neven though we represent half of the entire human experience\non this planet.\nOf course, the Senate is worse.\nOf 56 senators, only 17 of them are women, approximately 30%.\nAccording to the Center for American Women in Politics at Rutgers University, in the\nyear 2021, women comprise 31 percent of state legislators nationally. Women of color\nmake up only 26.5 percent of those women currently serving in state legislatures. A recent\neditorial in the AJC points out that the redistricting process can be especially challenging\nfor female representatives. Women are usually more recently elected and therefore less likely\nto serve in leadership. That makes them more vulnerable to the power dynamics that impact\nredistricting. At a time when the number of women elected to local office is just starting\nto climb out of the basement. We should not be drawing maps that make it harder for women\nincumbents or harder for women to run and win in new districts. We should not be making\nchanges that have a greater impact on districts held by women. But unfortunately that is exactly\nwhat this Senate map does. In drawing the proposed new Senate District 48, the Republican\nmap is targeting a female senator, my senator, the woman that my community chose to represent\nus, who happens to also be the only female Asian American senator serving in the entire\nstate of Georgia.\nThe Republican map is also making major changes to the sixth Senate district, which is held\nYes, by another prominent female senator.\nWith so few women serving Georgia to begin with,\nhow is it that so many of them are being targeted\nwith harmful redistricting changes?\nWe are watching a process in which primarily men\nare using their accumulated power to diminish\nthe political impact of female legislators\nand therefore, Georgia voters.\nSo what does this all mean for women of Georgia?\nIt means that the issues impacting women the most,\nand I would argue impacting families the most,\nincluding childcare, maternal mortality,\nreproductive health, will continue to be overlooked\nand underfunded.\nSo let's be truthful.\nWhen you use the redistricting process\nto harm and target women's districts.\nYou harm and target all women and all families\nacross the state of Georgia.\nThank you, Mr. Speaker, I yield.\nOkay, that completes the speakers.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nWe have a minority report under the rules of the House.\nWe'll have 20 minutes for the minority report.\nThe chair recognizes representative Bays Moore.\nThank you, Mr. Speaker.\nAnd good morning, colleagues.\nColleagues, we came here with the direction to redraw our legislative maps so that they\nmight reflect changes to the state over the prior decade.\nAnd Georgia has seen a lot of changes.\nThe census data tells us that we have gained over 1 million new residents.\npopulation growth has largely occurred within our urban areas. The census also\ntells us that all of that is great, this great state has grown more diverse. In\nfact, Georgia is probably already a majority minority state. Despite the fact\nfact that Georgia is a majority, minority state. The map before you only has 20 majority\nminority districts. And, egregiously, cracks the black population in Henry County. This\nmeans that black districts, residents of district 17 and 25, consisting of some of the most\nsuccessful and fastest growing black communities will not be able to elect candidates of their\nchoice for the next decade. The 1EX map inappropriately splits communities of interests. While\nthe majority continues to tout the low number of counties they split, the problem is the way\nthe counties of split. Chatham and Bibb counties are unnecessarily split three ways.\nThe majority has drawn out of county legislators into these counties specifically to stack\nthe local delegation. Finally, the map before you is egregiously\ngerrymandered by the majority party.\nThe voters of the state have spoken,\nand they want to have a choice in November.\nA yes vote on this map is a vote\nto discard representative government.\nA yes vote on this map is a vote\nto disenfranchise millions of Georgia voters.\nof yes or on this map is an invitation to costly legal challenges that will be\nincurred to defend an unconstitutional map.\nI ask you, don't privilege your own power above that of your fellow citizens.\nPeople elected you in good faith.\nThey expect you to uphold the basic principles of democracy.\nAnd the top halls we held around the state,\nand the hearings we held in this building,\nand on the online portal created on our state website,\nthe people of Georgia are pleading for the same thing,\na fair process with maps that actually\nreflect the will of the people of this state.\nThis map, this rushed process,\nis not what the people of Georgia are asking for\nand continuing to ask for it.\nNor is it what the law demands.\nI urge you to vote no.\nI yield the rubel.\nChair now recognizes Chairman Rich for the Chairman's time\nBy rule limited to 20 minutes.\nThank you, Mr. Speaker, ladies and gentlemen.\nWe're hearing the same buzzwords over and over again.\nI feel a little bit like we're eating a dead horse here.\nYes, Georgians have requested transparency.\nAnd yes, we have given them transparency.\nNot only has the legislation for the Senate\nand the House maps, gone through the traditional committee\nprocess that is open to the public with multiple opportunities\nbefore the committee for hearings.\nBut we have also had 11 public hearings\nfor members of the public.\nWe have gone out of our way to make it as available\nas possible for individual members to contribute\nand to participate in and to observe the process.\nWe've heard calls for translations.\nThese are really not realistic demands.\nNot one of these people who has proposed this\nhas proposed any meaningful way for us to take care\nof translating into what languages,\nhow many languages some people have suggested six.\nWe don't, we follow the committee process\nfor this legislation like any other legislation\nthat comes before this body.\nIt is the process during which legislation is perfected.\nSomething else that's very concerning to me,\nthis Senate has been accused of targeting a senator.\nWell, first of all, that is an overly simplistic analysis\nof an extremely complicated process that has many layers.\nSecondly, the Voting Rights Act protects communities and voters.\nIt protects those communities.\nIt ensures that communities have the ability to elect a candidate of their choice.\nIt doesn't guarantee me my seat, and it doesn't guarantee you your seat or any senator their seat.\nThe maps that the Senate has drawn comply with the Voting Rights Act.\nI know this because we have worked on this process together.\nWe have engaged legal counsel who are experts in this field.\nWe are confident that the maps comply with the Voting Rights Act.\nelse that strikes me is outrageous is that you have members of this body who are encouraging\nyou to vote no because the map drawn by the Senate Democratic caucus is better.\nWell, guess what?\nThey didn't want their map to go through the committee process.\nTheir map and their proposed legislation was open for public debate and commentary.\nWhen the chair of that committee asked the sponsor of the legislation if she wanted\na vote, she declined.\nThey didn't even give you an option because they knew that their map was not a viable\noption.\nThe only map that you have in front of you is the map that has gone through the committee\nprocess and that has been vetted and perfected. And I implore you to vote yes. Anyone who votes\nno is exercising a dishonest stand based on partisan politics and buzzwords. So I request\nyour favorable consideration. Thank you.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to, shall this bill now pass?\nAll those in favor of the passage of Senate Bill 1EX will vote aye.\nThose opposed will vote no, and the clerk will unlock the machines.\nhave all members voted have all members now voted\nIf so, the clerk will lock the\nmachines on the passage of\nSenate Bill 1EX.\nThe eyes are 96.\nThe nays are 70.\nThis bill having received the\nrequisite constitutional\nmajority is therefore passed.\nClerk will read the caption to\nHouse Resolution 3EX.\nResolution 3EX, Representative Bonner, the 72nd and others,\nratifying Governor Brian Kemp's executive orders and suspending the collection of\nvoter fuel and diesel fuel taxes. And for other purposes, this resolution I'm\ngoing to refer to the Committee on Ways and Means, I committee recommends that\nthis resolution be adopted. Chair recognizes the governor's four-leader\nrepresentative bonner to present the bill or the resolution.\nThank you, Mr. Speaker.\nI appreciate the opportunity to present to you House Resolution 3EX, a resolution that\nis a part of Governor Kim's agenda for this special session.\nIn May of 2021, ransomware attacks on information technology systems forced the colonial pipeline\nto shut down.\nThis shut down led to panic at the pumps and up and down the east coast and throughout the state of Georgia.\nIn response, Governor Kemp issued four executive orders declaring a state of emergency due to the gas shortage and\nsuspending motor fuel and diesel fuel taxes in Georgia from May 10, 2021 through June 2, 2021.\nAction by two thirds of both chambers of the Georgia General Assembly is necessary in order to ratify the suspension of this tax.\nOur body has done this, these types of resolutions before, including in 2020, when we concurred with Governor Kim's public health state of emergency.\nSo that is the resolution, Mr. Speaker, and I ask for your favorable consideration, and we'll stand for any questions.\nYou do not appear to have any questions.\nThank you, Mr. Speaker. I yield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favourable\nto the adoption of the resolution?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this resolution now be adopted?\nAll those in favour of the adoption of the resolution will vote aye.\nSuppose we vote no and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the adoption of the resolution.\nThe eyes are 162.\nThe nays are two.\nThis resolution having received the requisite constitutional majority is therefore passed.\nproposed as chairman blackman rise make a motion state your motion move the house immediately transmit house resolution 3 ex to the Senate\nchairman blackman has moved that this house\nimmediately transmit to the Senate house resolution 3 ex is there any objection\nIs there any objection there is objection all those in favor of immediate\nTransmetal will vote I. Those opposed will vote no, and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachine on the motion to immediately transmit House Resolution 3X. The eyes are 159, the\nnasal four, and it is immediately transmitted to the state senate. Clerk will read the\ncaption to House Bill 7EX. House Bill 7EX may represent a black\nback when in 146, 9 to the 130th cars in the 46th and others being titled an act to amend and title 40, 80th of the fiscal to Georgia and\nuntil they're relating to revenue and taxation. So those are advised to term internal revenue code and\ninternal revenue code of 1986. This bill will have a refer to the committee on ways and means that committee recommends that this bill do pass.\nChair recognizes Chairman Knight to present the bill.\nThank you, Mr. Speaker, on the brief.\nEveryone knows that we do the IRC update every year.\nWe're going to do it early this year.\nThere was a provision last year in regards\nto the child tax credit that was passed at the federal level\nafter we got out or after we got our IRC bill done last year.\nWe're simply trying to get ahead of this\nso that the Department of Revenue can go ahead\nand start programming the software\nand so that our citizens can file accurate tax returns\nat the beginning of the year.\nI'd urge your federal consideration of House Bill 7EX.\nAny questions, Mr. Speaker?\nI'll be happy.\nYou do not have any questions.\nThank you, Mr. Speaker, the members.\nAgain, I'll urge your federal consideration.\nThank you.\nIs there any objection?\nDo the previous question be ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nAll members voted have all members voted.\nIf so, the clerk will lock the machine on the passage of House Bill 7EX.\nThe eyes are 165, the nasors zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nThe purpose is Chairman Knight rise to make a motion, Mr. Speaker.\nState's motion.\nI'd like to make a motion that we immediately transmit HB7EX to the Senate.\nChairman Knight has moved that this House immediately transmit House Bill 7EX to the Senate.\nIs there objection?\nIs there objection?\nThe chair here is none, and it is on its way to the Senate.\nClerk will read the caption to a group of privileged resolutions.\nHonoring the life and memory of Mr. Max Cleveland.\nHonoring the life and memory of Lisa Tyrona Howard.\nthe life and memory of Dr. Anthony Leroy Stucky, honoring the life and memory of Officer\nRM's Desai, commending a lower Muskegee Creek tribe, the Cherokee of Georgia and the\nGeorgia tribe of Eastern Cherokee, and for other purposes that completes the reading\nof the privileged resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here's done and the resolutions are adopted.\nWe're going on now to announcements, going on to announcements.\nThe chair recognizes Chairman Lumsden for an announcement.\nThere will be a meeting of the House Insurance Committee in the morning at 8 a.m.\nC-L-O-B-606, insurance commissioner King and his staff will be there for\npresentation and afterwards there will be a in room 216 based on coffee and\ndonuts available. Thank you. Chair recognizes Chairman Chokus for an announcement.\nThank you Mr. Speaker. Good morning ladies and gentlemen.\nTomorrow morning at 830 the Small Business Development Committee will be meeting\nand CLOB 506.\nI urge you to be there, all members\nof the Small Business Development Committee.\nThank you.\nChair recognizes Chairman Cooper for an announcement.\nThank you, Mr. Speaker.\nThe House Health and Human Services Committee\nwill meet this afternoon at 1 o'clock and 6 o'clock\nof the L.O.B. Thank you.\nChair recognizes Chairman Knight for an announcement.\nThank you, Mr. Speaker.\nAnd I want to make sure everyone knows there will be a joint higher ed sub higher ed appropriations subcommittee with the economic appropriations subcommittee at 3 o'clock today in room 341.\nThank you.\nThat completes our announcements.\nThere are no birthdays today.\nChair recognizes the majority leader of this house for a motion.\nThank you, Ms. Speaker.\nMs. Speaker, I move that this house stand adjourned until 10 a.m. tomorrow, Tuesday, November\nthe 16th, 2021.\nJardy leader has moved that this house stand adjourned until Tuesday at 10 a.m., 10 a.m.,\nall those in favor of the motion will say aye. Those opposed will say no. The eyes seem\nto have it. This house will be adjourned until 10 o'clock a.m. Tuesday.\n",
  "updated_at": "2026-02-12T14:43:34.486415+00:00"
}