{
  "video_id": "BPbePff989s",
  "url": "https://www.youtube.com/watch?v=BPbePff989s",
  "title": "Georgia House 2026 - Day 4 PM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 4,
  "video_date": null,
  "duration_minutes": 9,
  "summary": "# Georgia House 2026 - Day 4 PM Session\n\n## Overview\nThis session featured recognitions and announcements, including honoring the legacy of Rev. Dr. Martin Luther King Jr. and a representative's grandson's birthday. There was discussion of upcoming events and committee meetings, but no substantive legislative action detected.\n\n## Key Actions\nNo bills passed or referred.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Barry gave a speech honoring the life and legacy of Rev. Dr. Martin Luther King Jr., calling on the House to legislate with justice, mercy, and humility.\n- Representative Scott recognized her grandson Lucas' 13th birthday.\n- Representative Emory Dunahoo announced he has been providing daily devotions to members, with 4 colleagues joining him, but that this will be his last year doing so.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nQuorum present, no issues noted.\n\n## Adjournment\nThe House adjourned until 10 AM on Friday, January 16th, 2026.",
  "transcript": "Representative Donahue, we'll call.\nWe'll recognize Representative Barry first.\nHere he comes.\nTake your time.\nYou're right.\nYou got some friends going to come with you?\nFriends are invited as well.\nIf you will give the gentleman in the well and his friends,\nyour attention, please, is recognition of a birthday today.\nThank you Mr. Speaker. Today we honor the life and legacy of a great\nmore-house man and resident of District 56, the Reverend Dr. Martin King Jr., who\nunderstood best that to do justice means to love your fellow man. It means\nrecognizing that our destinies are tied together, that injustice anywhere truly\nis a threat to justice everywhere. He taught us that justice is not abstract. It\nIt is lived out in our laws, our budgets, and the choices we make when no one is watching.\nTo love mercy, as our King showed us, is to see the humanity in those society too often\ncast aside.\nIt is to meet punishment with rehabilitation, poverty with opportunity, and in difference\nwith compassion.\nMercy does not mean the absence of accountability.\nIt means understanding that every person is worthy of dignity and a chance to be made\nwhole.\nAnd to walk humbly with your God is to remember that leadership is not about power but about\nservice.\nDr. King walked humbly even as he shook foundations of this very nation.\nHe did not seek applause or comfort.\nHe sought righteousness.\nHe reminded us that the moral progress requires courage and that silence in the face of\ninjustice is itself a choice.\nAs lawmakers, we sit in the seats of immense responsibility.\nThe bills we pass and the votes we cast shape the lives of families we may never meet.\nOn this day, honor Dr. King is not about quoting his words, it's about continuing his work.\nSo my charge to his body is simple on this weekend that we celebrate him.\nLet us legislate with justice as our guide, mercy as our posture, and humility as our compass.\nLet us ensure that he will laws this state, been not towards convenience, but towards justice.\nAnd that is how we honor Dr. King, not just today,\nbut every day we are entrusted with the power to serve.\nLet us take a moment to silence our own\nand the life and legacy of the Reverend Dr. Mark\nfrom the King of Junior.\nThank you.\nThank you.\nThank you, Mr. Speaker.\nThank you, Representative.\nMary and friends for honoring Dr. King, a great legacy.\nThere she is.\nRepresenting Sandra Scott is recognized for,\nThey all listen up with this, this is pretty important.\nThat's right, that's right.\nThe representatives recognized.\nThank you, Mr. Speaker.\nToday, I would like to say happy, happy birthday to my grandson,\nLucas Scott.\nHe's 13 years old today.\nLucas, Granny, love you.\nHappy, happy birthday to you.\nHappy birthday to you.\nHappy birthday to you.\nHappy birthday, Luca.\nHappy birthday to you.\nThank you, Mr. Speaker, I yell the word.\nHe didn't tell it, I didn't know you could see him.\nAwesome.\nThe representative Donna who?\nRepresentative Emory Donna who for listening up,\nI think he's gonna tell you about something\nthat's important to you.\nThank you, Mr. Speaker.\nFor the last 10 years, I've had the privilege,\nbut I would like Danny Mathis, Brett Cox,\nand David Huddleston, if you can't in Eddie Lumps,\nand to come up here with me.\nI've been blessed to give each person in this room\na daily devotion.\nPlease use it.\nBut with it, I have four.\nI'll just for a minute, let him get up there with you.\nI've had four colleagues that have joined in this year.\nAnd it's a blessing, but please use this.\nAnd remember, someone will need to carry it on.\nThis is my last year.\nThank you.\nThank you, Miss Speaker.\nThank you.\nThank you.\nThank you.\nThank you, Representative Emmerdada, who in members we appreciate it.\nRepresentative Billy Mitchell, I recognize.\nGive the general your attention, please.\nThank you, Mr. Speaker.\nKeeping in the vein of Representative Barry tomorrow morning, 10 a.m.\nNorth steps will have the annual commemorative service honoring Dr. King.\nI understand that the speaker is on the program.\nAnd look for as many of you as possible to be there.\nThanks again, Mr. Speaker.\nWhat time did you say, Representative Mitchell?\nThat's the first time you told me about it.\nThat program starts at 10 a.m.\non the north steps of the Capitol tomorrow morning.\nWe'll make it work.\nWe're also beginning here at 10 a.m.\nWe're working out, representative Williams recognized for him that's about.\nThank you, Mr. Speaker.\nI had not planned to have an afternoon order, but I wanted to certainly say this after listening\nto the governor.\nI want you to say that I came here in 1975 with Zell Miller and I have known every governor\nsince then.\nis the first governor since 1992 has used the words need base of first governor to take\nthe stigma away from a word that seemed to have terrified for years. Thank you, governor.\nThank you.\nWe do have a fine governor.\nI think that completes our afternoon orders.\nOh.\nI think it's a close it out, it wasn't nice.\nSo we do that completes our afternoon orders.\nWe do have a couple of announcements.\nChair Lady Lynn Smith is recognized for an announcement.\nYour next represent to it, Colleen.\nThank you, Mr. Speaker and members of the House.\nThere will be a meeting tomorrow morning at 9 o'clock.\nNatural Resource and Environment Committee take up House Resolution 1-008.\nWe meet at 9 o'clock, thank you.\nThank you, 9 o'clock.\nAbsolutely, representative McLean.\nThank you, Mr. Speaker.\nI just want to let everyone know that the working family caucus will be meeting in CLOB upon the German and\nRoom 310, CLOB, room 310, and the Georgia AFL, CIO is making their presentation on their initiative.\nThank you, Mr. Speaker.\n310 upon adjournement.\nChairman Blackman.\nThank you, Mr. Speaker.\nWays and Means has an informational only meeting in 606 at 1 p.m.\nThank you.\nThank you, Mr. Chairman.\nBefore we adjourn, thank you members.\nFor your attention today and allowing the Senate to join us,\nwe'll remind you of the prayers for the Hempry family,\nBeth Hempry, an entire family.\nThe laws of our former member bill.\nI know they'll be appreciated.\nMajority leader of this house has recognized for a motion.\nThank you, Miss Speaker.\nI move that this house stand adjourned until Friday,\nJanuary 16th, 2026 at 10 o'clock AM.\nOn the motion of the majority leader,\nthat this house stand adjourned until 10 a.m. Friday,\nJanuary 16th, 2026.\nAll those in favor say aye.\nAll opposed, no.\nThey would need to doubt about it.\nYou can never win out.\nThe eyes have it.\nWe are adjourned.\n",
  "updated_at": "2026-02-12T01:27:41.219225+00:00"
}