{
  "video_id": "Bq2l3mgqEpY",
  "url": "https://youtu.be/Bq2l3mgqEpY?t=1254",
  "title": "Georgia House - Day 2 (2026-01-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 2,
  "video_date": "2026-01-14",
  "duration_minutes": 79,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-01-14:\n\n# Georgia House - Day 2 (2026-01-14) Session Summary\n\n## Overview\nThe session consisted primarily of procedural matters, including a scripture reading, prayer, pledge of allegiance, and a report from the Committee on Information and Technology approving the previous day's journal. No substantive legislation was mentioned.\n\n## Key Actions\nNo bills were passed, referred, or introduced.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Opening prayer and words of encouragement from Pastor Eric Gowell.\n- Appreciation expressed by Representative Casey Cooper for the members' service.\n- Designation of the House doctor for the day.\n\n## Votes\nNo recorded votes.\n\n## Attendance\nA quorum call was held at the start of the session, with all members present.\n\n## Adjournment\nThe session was adjourned. The next session date was not specified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nMay 2, members will please come in the chamber and take your seats, members please come\nto chamber and take your seats.\nIt's clear, or you ring the bell, let's get started.\nMr. Clerk, did you ring the bell?\nI'm not sure you did.\nWell, please take your seats.\nMembers, please take your seats.\nAll right, everyone, remember now you have to put your card in\nfor you, Mr. Leader.\nWould you help the, make sure he gets his card in so he can rest\nor is in?\nWe're going to have the morning row call, all members present will please vote green to\nsignify your presence here in the chamber and Mr. Clerk will you unlock the machines?\nI have all members of not checked in, I see.\nYeah, that's it.\nCarl.\nAll members voted, okay, all members voted this so, clerk will lock the machines.\nkeep us, will you please close the doors and keep them closed.\nAs is our custom, we will begin our day with scripture reading and prayer by our chaplain,\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the fourth House\ndistrict representative Casey Cooper to Casey. Thank you speaker colleagues friends and enemies. It's\nit's a it's a pleasure to be before you today. Most of you if you don't know me by now, no better than\nfor me to bring my own pastor down here. So I actually brought a friend that's a pastor. It's kind\nof a protectionism thing, if you will. But Eric Gowell is the pastor of\nChrist Church in Dalton, Georgia. We share children that go to school together\nChristian Heritage, Daniel, Riley and Molly. All three kids work for me at my\nwedding venue and he is a man of God. He's a man that loves this community. He's a\nman that loves the school that our children go to and we've set on the bleachers\nfor the last six, eight years together just yelling and screaming trying to\nSo he believes in victory, but he believes in Jesus if you'll give him your ear. We sure appreciate him being here\nWe're gonna have a special baptism service for Casey afterwards. So everybody's everybody's invited\nThis will be his ninth and tenth time being baptized because I'm going to hold him down\nto make sure it takes.\nHey, I want to let y'all know how much we appreciate you.\nYou start out.\nI know the miles.\nI know the time.\nIt's a lot and we really appreciate y'all and your service to your communities and your\nservice to our state, our nation, to the world. So thank you very much for your service.\nAs theme ladies and gentlemen members of the House of Representatives of the Great State\nof Georgia, it's indeed an honor and privilege to be with you this morning. I want to thank\nSpeaker Burns for the invitation and thank you, Casey, not only for serving Dalton and\nDistrict 4 with distinction, but also for being a good friend. So thank you. Lord Willen,\nI would love to share just a little bit of encouragement for y'all and then have a prayer.\nI'll be honored to pray for you and over you this morning.\nAs we begin the new year of our Lord, 2025, it is a new year and I always like how they\ndepict the new year as a little baby, full of promise and expectation.\nThe old is passed, the new year looms before as fresh and clean, kind of like everything\nlook like last Friday afternoon and Saturday after what will go down in the\nannals is the great blizzard of 25. I was really glad we got two and a half\nwhole inches of snow in Dalton, Georgia. I was glad I made it to the Wal-Mart\nbefore to get my bread and my eggs and my mill. But we made it but you know when\nyou look outside and everything was covered in snow it was it was fresh it\ncovered up all the winter blah it was softening the hard edges and it just\nlook full of promise just like this new year, endless possibilities. But for all these hopes\nand all these new starts and expectations, you know and I know that alongside those hopes,\nalongside those excitement of a new year, there's also going to be times of discouragement.\nThere's going to be times of frustration of anxiety and times of tough, tough times.\nAnd I know that's the case in church life, and I figure that's probably the case for all of y'all here in this August chamber as well\nWith that in mind because we live in a world that's been broken, been broken by sin\nWe know that there's always going to be hard times as well as times of blessing and to that end\nWhen you get when you and I when we face those difficult times. I just want to share\nshare some good news that one of my favorite authors, his name is Paul David\nTripp. I want to share these words with you, these thoughts. He says,\nremember that God is never anxious. Remember that God never rings his hands and\nwishes he had made a better choice. Remember that God never worries about what's\ngoing to happen next or stresses over how things are going to turn out. God is\nnever surprised or caught up short. God is never in a situation that overwhelms\nand God never fails to detest. Remember that He never makes promises, He cannot keep.\nRemember that He's all powerful, absolutely perfect in every way, He's faithful to every word,\nHe's sovereign over all that is, He's the definition of love, He is righteous, He is just,\nHe is tender, and He is patient all at the same time. My friends, remember, please,\nthe God's gotcha if you let him. God's got this if we let him. The good and the bad. That\nwhich brings joy as well as that which brings heartache. He's sovereign over it all. And\nGod has put each of you in this place and in this time to do great things for your folks\nback home to do great things for our state, for our nation, for our world, really for him.\nWe can't do it on our own.\nSo I want to share this wonderful verse for you to remember.\nComes from second Peter, one, three, God's divine power, remember this.\nGod's divine power has given us everything, everything we need for life and for godliness.\nRemember that he's got you, that he's got this, and he's giving you everything you need\nfor life and for living in a way that honors him and blesses others.\nSo in that great news, I pray that you'll find peace and joy as you go about this very\nimportant work that he has tasked you with.\nWould you please let me pray for you now?\nLet's pray together.\nLord God, I pray now for your blessing and your protection over these men and women\nwho make up the Georgia House of Representatives.\nI praise you that you are sovereign and that you're patient and that you're gracious and\nmerciful even with a sinner like me.\nLord, please guide their steps, guide their thoughts, guide their words, guide their actions,\nthe actions of these representatives and their staff.\nMay 2025 be the best year yet in their lives, both personally and as they seek to represent\ntheir constituencies to the best of their ability.\nThank you for giving us all that we need, everything we need for life and for godliness.\nHe's blessed us so that we can be a blessing, and I pray this in Jesus' name.\nAmen.\nDoorkeepers, you may unlock the doors, members, you may join Pastor Eric in the\nAny room, they have a photo.\nPastor Eric, thank you for those words of encouragement.\nWe really appreciate it.\nThank you so much for being here with us.\nThank you.\nOur doctor of the day today is Dr. Richard Thomas representing Miriam Parish as responsible\nbringing Dr. Thomas here today.\nSo thank you, Representative Parish.\nWe appreciate that.\nDr. Thomas, thank you for being here and providing.\nGreat health care for us here in this body downstairs.\nIf you need Dr. Thomas, you know where to find him.\nThis may be a historic moment.\nSo, members, if I can get your attention.\nChair recognizes Chairman Tarvan,\nthe Chair of Committee on Information and Artists.\nChairman Tarvan.\nMr. Speaker, your committee on information and all that's addressed journal from the\nprevious legislative day and found it to be correct and if I may have a few moments just\nto say a couple of things this may be the last you'll suspend just for a minute members.\nThis probably will be the last week I do this report as we assign new chairman but this\nweek we're going to look back on the choices we make in our life and the\ndirections we're going in our life and just so happened I woke up this morning\nat 4.30 and read the journal and it was quite interesting it was 111,642\nwords that's very lengthy for this early but it had everything we did in the\nsummer from all the vetoes to the Secretary of State for Port and as I look\nThrough that at the end of this year, if I'm still here, we may have a test on day 40 and the question is going to be\nWhen I look through there there were a hundred and eighty\ngreen\nvotes up there now that would be unusual to get a hundred eighty but I want everybody to see when we have a total of a hundred and eighty votes\nanytime during this 40 day term and\nAnd it won't be a long sheet of paper, I can assure you, because it's hard to get us all here at the same time.\nMy seatmate here will wait, gave me this, and we are, you know, what we were we choose, and that's where we head, and it's decisions we make in our life.\nNow you can add, you can put five years in this 10 or 20, but I'm going to live to be 94, so 20 years from now,\nfrom now, you'd give anything to be this exact age, exactly this healthy, and back in\nthis exact same moment. Now, take time and enjoy it. Thank you, Ms. Bigger.\nThank you, Chairman Tarvan.\nWe appreciate your diligent review of the journal over last session and certainly of our\nquestions.\nAl Williams knows how difficult it is to get to 94.\nHow's that going, Al?\nYou're looking good for your age, what can I say?\nChairman Tarvin, the chair of the Committee on Information and\nAudits, reports that the journal of the previous legislative day has been read and found\nto be correct, is there any objection to spend with the reading of the journal?\nI hope not.\nChair here is none.\nThe reading of the journal is to spend with, is there any objection to the confirmation\nof the journal.\nChair here is none and the journal is confirmed.\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative, administration 104th moves following me establishes the order of business\ntermed the first part of the period unanimous consensus introduction of bills and resolutions,\nfirst reading and reference of House bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution, excuse me, establishing the\norder of business for the day?\nChair here is done and the resolution is adopted.\nOkay, we are a move on.\none. To reading the bills and\nresolutions. This clerk will\nyou read. House bill one by\nGremson of Iowa, the 50th of\nBill being titled an act to a\nmen part three of Arctic four\nchapter 11, title 16, if this\ngo to Georgia, annotated related\nto carrying and possession of\nfirearms. Public safety and\nhomeland security. House bill two\nby Gremson of Iowa, the 50th of\nBill being titled act to a men\nChapter 7 to Title 4080, the fish go to Georgia, Anitetti, relating to income taxes.\nWays and means.\nHouse Bill 3 by Robson of Iowa, the 50th of the bill be titled act to amend Part 5,\n4 Chapter 11, Title 16, the fish go to Georgia, Anitetti, relating to Brady, Law, Regulations.\nPublic safety and Homeland Security.\nHouse Bill 4 by Robson of Iowa, the 50th of the bill be titled act to amend Part 5,\nPublic safety and home land security.\nHouse Bill 5 by rubs and if Campbell 171st bill be tied on act to amend act and act relating to the Board of commissioners into cater county.\nIntergovernmental coordination House Bill 6 by rubs and if Campbell 171st bill be tied on act to amend the act providing them for board of commissioners of Mitchell County.\nIntergovernmental Coordination House will seven by reps and Kendrick on the 95th\nBill beat out of an active men article to chapter seven to top of 40 80 the\nfish go to Georgia annotated ruling the imposition rate computation\nexemptions and credits relative to income taxes ways and means possibly by\nreps of Kendrick on 95th Bill beat out of an active men chapter seven to top\nof 40 80 the fish go to Georgia annotated relating the income taxes ways and\nmeans Houseful nine by reps and a school field of 63rd Drenner the 85th\nScott of the 76, Davis of the 87th Jackson, the 68th.\nThey'll be taught on an act to amend chapter 15,\ntitle 25, the physical to Georgia annotated,\nrelating to other safety inspections and regulations.\nNatural resources and environment.\nHouseful 10 by reps.\nLet's go feel the 63rd, Davis of the 87th,\nScott of the 76 and Jackson, the 68th.\nThey'll be taught on act to amend chapter code section 35,\n119 in the physical to Georgia annotated,\nrelating to prohibition of disclosure of arrest.\nlooking photographs, government affairs, House Bill 11. My\nreps of scope, scope field was 63rd Scott of the 76 Davis of the 87th Jackson\nthe 68th. Bill B. Todd on active men chapter 7 on title 31 of the physical\ncontrol to annotated relating to regulation and construction of\nhospitals or other health care facilities. Human relationships and aging\nHouse full 12 by reps of Canon the 170 second Irwin of this 32nd lever to the\n123rd quarter to the 174th Kelly the 16th and others will be taught on\nact to amend code section 22 165 the fiscal to Georgia and it's in to\nrelay the equalization grants.\nEducation House will 13th members of quarter to the 174th will be taught\nand act to provide for the compensation for the Eccles County Board of\nEducation.\nIntergovernmental coordination Houseville 14th members of Carpenter to the\nfourth, Tarvon in the second, Crawford of the 89th and Fleming of the 114th.\nBill B. Toddl, an act to amend our three, chapter three, a title 50, the fish go to\nGeorgia, and it ended relating to other state symbols, special rules, Houseful 15 by\nreps and a Williams into the 112, Williams to the 148, Douglas 78, Dickie the 134th, Ridley\nthe six and others, Bill B. Toddl, an act to amend title seven of the fish go to\nto Georgia and Teta Related Banks and Finance.\nBikes and biking.\nHousehold 16 by residents.\nScofield is 63rd.\nMcLean to the 109th.\nScott of a 76 Davis to the 87th.\nGlazed to the 67th.\nBill B. Todd an act to a mental 34.\nThe fish go to Georgia and Teta relate to relating\nthe labor and industrial relations.\nIndustry and labor.\nHousehold 17 by residents.\nScofield is 63rd.\nDavis to the 87th.\nScott of the 76.\nMitchell, the 88th in Jackson, the 68th.\nBill Bittado, an act to amend chapter one,\na title 31 of the official go to George Anatita,\nruling the general provisions regarding health.\nPublic and community health.\nHouse Bill, 18, members of Saints of the 180th,\nP3 of the 166th Richardson, 125th,\nJasperus of the 11th, Gulliver of the 19th.\nBill Bittado, an act to amend Code Section 22, 161.3\nof the official go to George Anatita,\nrelating the Dual Enrollment Act.\nHigher education.\nHospital 19 by reps on Scott of the 76.\nGofield the 63rd Davis of the 87th.\nWill be taught an act of men article one on chapter three.\nTitle 37 of the fish go to Georgia and it's either linked the general\nprovisions related to examination and treatment for mental illness.\nPublic and community health.\nHospital 20 by reps on Scott of the 76.\nGofield the 63rd Davis of the 87th.\nWill be taught an act to amend part three of article 16 to chapter two.\ntotal 20 of the physical to Georgia annotated relating to health of students\ngenerally. Education House will 21 by reps and Scott of the 76 Davis of the 87\nscope field of the 63rd. It'll be titled an act to amend Article 2, Chapter 7\nof Title 48 and the official go to Georgia annotated really in the\nimpositionary computation exemptions and credits from income taxes. Ways and\nmeans. 22 by reps and I've Scott of the 76 Davis of the 87 scope field of\n63rd, Bill B. Toddl and act to amend title 34 and 4080 because go to Georgia\nannotated, relating to labor and industrial relations.\nWays and means, 23 by reps of Scott of the 76 go field 63rd Davis to the 87th.\nBill B. Toddl and act to amend part three of article six to chapter two,\ntitled 20 of the physical Georgia annotated, relating to educational programs\nunder the quality basic education act.\nEducation Houseville 24 by reps of Scott of the 76,\nScofield of the 63rd Davis of the 87th,\nBill B. Todd, an active men article two,\nchapter one in title 37,\nhe fits go to Georgia annotated,\nrelaying their powers and duties in the department of behavioral health.\nEducation Houseville 25 by reps of Scott of the 76,\nDavis of the 87, Scofield of the 63rd,\nBill B. Todd, an active men article one in chapter four,\ntitle 49 in the fits go to Georgia,\nGeorgia and it's headed relating to public assistance in generally.\nPublic and Community Hill House will 26 by reps.\nI'm Scott of the 76 go field of 63rd and Davis to the 87th.\nBill B. Todd of an act of men are due chapter one in title 37 of the fish go to\nGeorgia and say to relay the powers and duties of the Department of Behavior Health.\nPublic and Community Hill House will 27 by reps.\nI'm Scott of the 76 go field of 63rd and Davis to the 87th.\nwill be taught an act to amend part five R the 6th chapter to talk 20 of the fiscal\nto Georgia annotated relating to program weights and funding requirements under the\nquality basic education. Education Houseville 28 by reps of can in the\n170 second of bill be taught and act to provide a homestead exemption from\nColquit County ad valorem taxes.\nIntergovernmental coordination Houseville 29 by reps of can in the\n172nd Ability Title and Act to Provide a Homestead Exemption\nfor Colquit County School District Add Valorum Taxes.\nIntergovernmental Coordination.\nHouse Bill 30 by Robson, a corner of the third\nAbility Title and Act to Provide a Homestead Exemption\nfrom Katusa County School District Add Valorum Taxes.\nIntergovernmental Coordination.\nHouse Bill 31 by Robson, a corner of the third\nAbility and Title and Act to amend\nto reconstitute the Board of Education in Coutusa County.\nEnter governmental coordination.\nHouse will 32 by rows of Canada, 170 second and 4 to the 170th of\nBill B. Todd and act to authorize the assessment and collection of a\ntechnology fee by the probate court of Cook County.\nEnter governmental coordination. House will 33 by rows of Canada, 170 second and\n4 to the 170th of Bill B. Todd and act to amend to authorize the assessment and\nof a technology fee by the Magistrate Court of Cook County.\nIntergovernmental Coordination House Resolution 6 by Ripson Kendrick of the 95th Resolution\nproposing an amendment to the Constitution so to authorize the General Assembly to\nprovide by law for more than one seat and capital fund.\nHigher Education House Resolution 7 by Ripson Campbell 171st Resolution honoring the life\nMr. George C. Trullock Jr. and dedicating a road in his memory.\nTransportation House of Resolution 8 by Robson Schofield\nthe 63rd Davis in the 87th Scott of the 76, Mitchell the 88th and Jackson the 68th.\nResolution supporting the creation of a state work group to increase chronic disease\ninformation and screenings and communities of color.\nPublic and community help House of Resolution 9 by Robson.\nmore than 91st of the resolution proposing an amendment to the Constitution\nstated Georgia says to provide that revenue derived from the regulation of\nsafe drinking water and toxic enforcement may be dedicated.\nNatural resources and environment house resolution 10 by\nrepresentatives of the 87th Kendrick of 95th Taylor the 92nd pen of the 94th\nmissile the 88th resolution urging the match following Atlanta rapid transit\nthe authority to reaffirm its commitment.\nTransportation House Resolution 11 by Representative Davis of the 87th resolution urging\nthe Georgia Environmental Protection Division, the Environmental Protection Agency, and the\nto Cap County Government to resolve sewage, pollution, and spills.\nNatural Resources and Environment House Resolution 12 by Representative Davis of the 87th\nScott of the 76th, Gofield of 63rd, and Cannon of the 58th.\nResolution designated in the month of April\nis Community Activist's month.\nSpecial rules.\nHouse of Resolution 13 by resident Davis,\nthe 87th, Scott of the 76th, Gofield of the 63rd,\nand Cannon of the 58th.\nResolution recognizing April 8th, 2025,\nis Community Activist Day.\nSpecial rules.\nThat completes first reading.\nThank you, Mr. Clark.\nMembers, one of the honors that you will carry with you, the remainder of your lives,\nis when you return to this body, even if even if you've only been going to\nshort period of time, you will be welcome back here and recognized for your\ncontribution and your service. And we have two special members that are back with\nus today. And I really can't both of them as my friends. Where you think, what's\nWhat's the problem, Gloria?\nI thank you and our friends.\nRepresentative Frazier, she and I have some fun together\nover the years, but we both been of one mind\non many different occasions.\nRepresentative Pam Dickerson is great to see you.\nWe missed you Sunday.\nWe're glad to see you today.\nSo two of our members that serve with distinction and honor\nin this body, Representative Pam Dickerson\nand Representative Gloria Frazier, make them welcome.\nRepresentative Sharper, the new members need to understand you lead the singing in this\nchamber, so guess what the day is, it's Pam's birthday, so let's all stand and sing and\nwish Pam a happy birthday, all right, Dexter?\nHappy birthday to you, happy birthday to you, happy birthday and God bless you, happy\nAnd by the way, Pam, you look great, and so do you, Gloria, good to have both of you back.\nDon't be strangers.\nWe have another treat.\nRepresent even Nolowitz, Terry Nolowitz, come on down.\nLet's all make Terry welcome. It's good to see you back.\nDon't be a stranger.\nWe have one morning order this morning representing Matt Reeves.\ntake your time. All right members let's give the member in the well we're about to the\nend of the day so give the member in the well your attention because you will receive\nthat attention when you're in the well. There's a few people in that any room there's\nnobody out there, so if you need to have an important conversation, that would be the\nproper location please give the member in the well your attention\nSenator Goodexample.\nRepresentative Reeves, you are recognized for a morning order.\nThank you, Speaker Burns.\nHouse colleagues today is Tamil Thai Pongal Day, which is Thanksgiving in the Tamil community.\nWe have a bunch of Tamil people here in Georgia.\nThey are 100 million worldwide, originated from India, Sri Lanka, Malaysia, and Singapore,\nDr. Andrew Krishnan from Burnett County,\nwho's one of our most consistent daughters of the day,\nhas made us aware of this holiday.\nWe've got a great resolution for them.\nThey are here at the Capitol today,\nlearning about Georgia and celebrating Pongal,\nwhich means overflowing.\nSo let's wish them a happy Pongal,\nwhich is Thanksgiving.\nOh, thank you, Representative.\nThank you, Representative Martinez.\nThanks for doing that.\nThat's important part of who we are here in Georgia.\nThank you.\nMr. Clerk, will you read the caption to a group of privileged resolutions?\nRecognizing January 14, 2025, a Tamil tie and pongal day.\nCommending the Corporate Volunteer Council of Atlanta,\nrecognizing the Lunar New Year celebrations,\ncommending the Atlanta Football Host.\nCommittee for hosting the 2025 College Football Playoff\nNational Championship, honoring and celebrating\nRepresentative Rhonda Bramow on her 50th anniversary\nas a member of Delta Sigma Theta Sorority,\nIncorporated.\nCommending Delta Sigma Theta Sorority Inc.\nFor its 112 years of service\nin recognizing January 13th, 2025\nas Delta Sigma Theta Sorority Inc. Founders Day.\nAnd gradually in the city of Carterville,\nupon its 175th anniversary,\ncommending this more Clayton County public schools,\n2024, 25, 2025, teacher of the year,\nhonoring and recognizing the veterans who were victims\nof Agent Orange during Vietnam War,\ncongratulating and honoring William Edwards.\nAnd for other purposes,\nthat completes the reading with privilege resolutions.\nIt is their objection to adopting the privilege resolutions chair here's done in the resolutions\nour adopted. We're moving on to afternoon orders afternoon orders I'm going to\nask the members we have several very respectful afternoon orders so\nSo members, please take your seats, members take your seats, and I know most of you standing\nup, so I'm going to start calling your names in just a minute.\nIf I don't know your name, I'm going to make up one and you might not like it.\nTake your seats and cease conversation, please.\nY'all will get the importance of our first afternoon order\nwhen I ask you all to stand.\nChair recognizes leader of frustration,\nRepresentative Persinger and Representative Gaines for an afternoon order.\nThank you, Mr. Speaker. September 4, 2024 was a day of immense tragedy for Appalachia High School,\nfor Barrow County and for the entire state of Georgia.\nAn evil act of violence took the lives\nof four cherished Georgians who were deeply\nloved by their families, colleagues, and the community.\nRichard Ricky Aspinwall, a beloved teacher, coach,\nand most importantly, a husband and a father of two girls.\nChristina Earmean, an educator with a loving husband, who reflected joy for teaching and\ntreated her students as if they were her very own children.\nMason Schimmerport, a friendly 14-year-old student who was creative, had a great sense of\nhumor and was kind to everyone.\nChristian and Gula, a wonderful 14-year-old student who was friendly, kind, loving, and cared for all.\nMay their memory be eternal. We must keep the families of these beautiful\nsouls in our prayers to show them the love and the care that each of us I know deeply feel for them.\nI commend the quick action of the Barrick County Sheriff's Department.\nBarrick County Schools, the GBI, GEMA, Georgia State Patrol, and many others for their work on September 4th and in the days that followed.\nTheir rapid response saved lives.\nBarrow County Sheriff Judd Smith said on that tragic day, this was an act of pure\nevil but love will prevail. My Lord and Savior Jesus Christ said as recorded in\nJohn 1622, now is your time of grief but I will see you again and you will\nwill rejoice and no one will take away your joy for the state of Georgia Barrow County\nand Appalachia High School. Love will prevail. We'd ask you to please join us in a moment\nof silence. Thank you, Mr. Speaker. Thank you, Representative. You may be seated.\nThe Representative Alexander is recognized for an afternoon order and friends.\nMembers give the lady in the well your attention.\nis a very special afternoon order. The matter of fact, lady will see someone ask you\nall to stand while they make this presentation. The lady may proceed. Thank you, Mr. Speaker.\nOn behalf of the women caucus, we wanted to do this because this is a milestone. Representative\nCarolyn Hughley, made history by becoming the second woman to hold the title of the minority\ncaucus leader and we're so proud of her and we want to congratulate her.\nWith these roses, we also have a nice plaque for you that reads, History Maker, a second\nwoman leader of the Georgia House Democratic Caucus January 2025 to 2027.\nThank you, Mr. Speaker.\nThank you, ladies.\nCongratulations, representative Heagley, leader Heagley.\nWe appreciate your service.\nNice tribute, guys.\nI think you all surprised her.\nShe was up there honoring herself for a minute.\nThey're keeping secrets from you there later.\nEveryone can be seated Chairman Dickey.\nAll right, I can tell you this is a port at one.\nHe's got a lucky leg before I guarantee you that German dick.\nThank you, Mr. Speaker and ladies and gentlemen, I'd like to recognize another very important\nwoman in Georgia this morning and ask my wife Cindy.\nShe today is our 47 wedding anniversary, so I just thank you all.\nI'm a very lucky guy.\nI don't know of any woman in this state who's more loving,\nmore hardworking, more forgiving than my wife.\nSo thank you, Cindy, for 47 great years.\nCongratulations, Chairman Dickie.\nCindy is a true jewel.\nI'm not sure you deserve her, but she's put up with you for 47.\nI think you're a pretty good place now.\nCongratulations, happy anniversary.\nRepresentative Chaz Cannon is recognized for an after-nord represented cannon.\nThank you, Mr. Speaker.\nIt's one of the new co-chairs of the House Sportsman's Caucus.\nI just want to inform our colleagues about the keeping Georgia Wild Data Mar and the\nSouth Steps of the Capitol, 8 a.m. to 11 a.m., it's formally known as the Coastal Sportsman's\nDay of the Capitol.\nIt's an annual event, allows Georgia Sportsman's and Coastal advocates to come together\ncelebrate contributions to our state's economy and quality of life. You've\nyet know this, hunting and fishing generate more than 214 million in state and\nlocal tax revenue. Help create nearly 40,000 jobs and have a total annual\nannual total economic impact of over 5.2 billion. Saltwater fishing generates\nover 500 million dollars in the economic activity while providing\nthe recreation of Fred Seethoo.\nSo tomorrow, from 8 a.m. to 11 a.m.\nSouth Steps, keeping Georgia wild.\nI hope to see you there.\nThank you, Mr. Speaker.\nThank you, Representative of Georgia.\nIt's a wonderful place to enjoy that of doors.\nNo doubt.\nOkay, let's see, Representative Davis\nand others as well, recognized for and afternoon order.\nI guess the folks coming with you, y'all coming with representative Davis, now's the time.\nMembers if you give the lady in the will, your attention please.\nRepresentative McQueen.\nYesterday was the 112th anniversary of our sorority, Delta Sigma Theta, and\ncelebrate our founders and those that came before us and set in motion what we\nneed to do to lead, to thrive, to accomplish our goals, and help our community.\nAnd a very special anniversary shout out to Sora Ronda Brunow,\nIt is her 50th anniversary as a member of Delta Sigma Sigma.\nI didn't know the sorority had high school members, because I'm sure she was in high school.\nCongratulations, great history there, great history.\nMembers, I'm going to ask you to stand again as I welcome\nRepresentative Panich and Representative Cox\nand recognize him for an afternoon order.\nIf you'll stand, please.\nAs co-chairs of the Georgia-Israeli caucus,\nToday, we have the privilege of our Israeli consul general\nand her team if you would stand, as well as some\nof the hostage families who have been impacted by what's\ngoing on in Gaza.\nIf you would stand the Siegel family, Roman family,\nForgive me, but\nGot that good end\nFirst I would like to say\nThank you this past Sunday\nWe're several of you attending our church and having a moment up at free chapel in Gainesville\nIt touched many souls and we really appreciate you being there\nNumber two, I would like to address Aviva and Shear. Aviva is the wife and Shear is the\ndaughter of Keith Segal, Samuel Segal, who is a current hostage in Gaza. Aviva was also\ntaken and miraculously, by the grace of God, was released roughly two months after being\ncaptured and our hearts go out to what you've seen, what you've experienced, but you continue\nto shed light in the midst of darkness. We appreciate you and truly as a community of people\nwe're praying for the salvation to pour over and the peace of God to pour over Gaza and\nthat this two, they will be free.\nTwo of Maya's family members were kidnapped by Hamas\non October 7th.\nHer cousins Yarden, Ramon Ghat, and Carmel Ghat.\nYarden fortunately was returned to Israel\nafter nearly two months in the pits of hell.\nCarmel tragically was murdered by her monstrous captors\nin a tunnel in Gaza, along with the American Hirsch-Glober\nPoland.\nCarmel was a beautiful soul.\nShe was an occupational therapist from Tel Aviv.\nReleased hostage children testified\nthat Carmel kept the children calm by doing yoga with them\nin captivity.\nToday, Maya travels and continues to tell their stories.\nYarden's sister, Romi Gonen,\nhas been a hostage in Gaza now for 466 days.\nRomi is a 24-year-old, happy young woman\nwho loves dancing and traveling.\nShe was brutally kidnapped from Nova on October 7th.\nShe tried to escape.\nShe called her mother, seeking guidance and comfort.\nfor four and a half hours,\nRomi stayed on the phone with her mother and sister\nbefore they lost contact.\nYardin has also been traveling the world,\nraising awareness for her sister.\nOur prayers are that the hostages will be released.\nAnd after this, you are all welcome to meet them\nin the anti-room.\nAmi Israel Khai and bring them all home now.\nThank you, members, you may be seated.\nRepresentative Lehman Franklin is recognized for an afternoon order for good folks coming\nto town tomorrow, Representative Franklin.\nThank you, Mr. Speaker.\nTomorrow is a great day for Georgia,\nbecause tomorrow is going to be dealer day at the Capitol.\nAnd your local dealer is going to be here in room 216\nfrom 830 to 11.\nAnd I would encourage you to drop by, talk to them,\nmeet them, and call and talk to your dealers.\nBut don't forget, 216, 830 to 11.\nThank you very much.\nThat completes our afternoon orders that we have some announcements.\nChairman Corbett, recognized for an announcement.\nThank you, Mr. Speaker.\nMembers, this is the announcement you have all been waiting for.\nThe rule caucus will have a meeting tomorrow upon a German.\nLunch will be served.\ndo's are fifty dollars a year or hundred dollars for the biennial so bring your checks\nC. Joe Campbell and the agribusiness council is our sponsor mall thank y'all look forward to seeing you there\nThere he is, Representative Dewey McLean is recognized for the announcement.\nThank you, Mr. Speaker.\nThe Gwyneth House delegation will meet immediately upon adjournment in room 514 and the CLOB that is the Gwyneth House delegation we have some important bits that we need to take care of and lunch will be served for the Gwyneth House delegation in room 514.\nLunches for the Gwyneth House delegation in room CLOB 514. Thank you, Mr. Speaker.\nChairman Stevens, Chairman Ron Stevens recognized for an announcement.\nThank you, Mr. Speaker.\nToday begins our series of lunch and learns and field trips, if you will, to see what we've\ngot going on in the state of Georgia.\nToday, our bus will leave for the Curiosity Labs, it's 30-minute drive, and there'll be\na lunch tour for about an hour, and they'll have you back here about 3.30.\nWe will leave here at 12.30 on the end.\nCuriosity labs for those of you that don't know.\nP Street Corner is a city owned and operated\nthis living laboratory designed specifically\nfor providing a ground technology for all over the world,\nfor things like self-driving cars, pizza delivery\nwith robots and groceries and that kind of stuff.\nThey're right up the street here\nand we're going to see what they do.\nIf you have not RSVPed, we've got six more slots.\nThat's today and 30 minutes right here on Mitchell Street.\nThank you.\nThank you, Mr. Chairman.\nSix slots remaining.\nSo if you're interested, you need to get\nwith the Chairman, Pronto.\nCheerleading camp is recognized for an afternoon order.\nExcuse me for an announcement.\nGood afternoon.\nI know we have several freshmen members\nand we welcome you.\nThere is going to be a luncheon learned tomorrow\nfor freshmen regarding local legislation.\nLunch is being provided, of course,\nand it will be informational.\nIt's gonna last about an hour.\nIf you have any questions, please come see me,\nbut you should have gotten an email talking about\nwhat the events tomorrow and when session ends.\nThank you.\nThank you, chair lady.\nChairman Williamson, chair of the majority caucus\nThank you, Mr. Speaker, for the majority caucus for planning purposes.\nPlease be aware there will be a brief caucus huddle tomorrow in 341 upon a\nGerman. Just a caucus huddle, no lunch, rural caucus has got lunch,\nfollowing, I think Chairman Corbett just addressed that.\nSo majority caucus huddle in room 341, that's the appropriations room for all the new\nmembers and see upon a German tomorrow. Thank you.\nThat concludes our announcements.\nLet me give a thank you out, a shout out to some folks.\nSo thank you all that got up this morning\nbefore the Rooster Crow to be down to the eggs and issues.\nHe went, he went up when I got up and said,\nI'm not sure.\nHe crowed a little bit later while I was on the way.\nBut I want to give a shout out to Marta\nto our cheerleading bar talk, the Brazil Cox, and Jennifer LaRosa, who represents them.\nThey provided transportation from many of you from here to the Capitol, over to the\nCongress Center, and very efficient travel back.\nI know they passed us, so they were getting it done, so appreciate that great service\nthey provided to the House.\nSo with that, Majority Leader of this House has recognized for a motion.\nThank you, Ms. Speaker.\nI move that this House stand adjourned until 10 a.m. on Wednesday, January 15, 2025.\nThank you, everyone, for your attention today.\nOn the motion of the Majority Leader, Majority Leader,\nthat this house stand adjourned until 10 a.m. Wednesday, January the 15th, 2025.\nAll those in favor will say aye, both say no.\nEyes clearly haven't. We're adjourned.\n",
  "updated_at": "2026-02-12T16:38:40.256977+00:00"
}