{
  "video_id": "bqvYVo7CGGA",
  "url": "https://www.youtube.com/watch?v=bqvYVo7CGGA",
  "title": "03-14-2024 | Sen. James' Press Conference on Midwifes",
  "chamber": null,
  "session_type": "press",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 15,
  "summary": "Here is a structured markdown summary of the Georgia Senate press conference on midwives:\n\n## Overview\nThis press conference focused on the importance of midwifery, especially for the Black community in Georgia. Key speakers highlighted legislation to support midwifery, the history and legacy of Black midwives, and the ongoing challenges around maternal health disparities.\n\n## Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Senator James discussed her personal experience not having a midwife and regretting it, and her commitment to fighting for mothers and supporting the midwifery profession.\n- Rep. Cannon honored the legacy of \"granny midwives\" in the South who attended over two-thirds of Black births historically, and discussed the decline in registered midwives in Georgia.\n- The press conference included a recognition of Charles Johnson, who lost his wife Kira to complications after a C-section, and the work of the Safe Motherhood Quilt to investigate maternal deaths.\n- The speakers emphasized the cultural competence and trusted role of Black midwives in caring for mothers and infants.\n\n## Votes\nNo votes were mentioned.\n\n## Attendance\nNo quorum or attendance details were provided.\n\n## Adjournment\nThe press conference ended without a specific adjournment time noted.",
  "transcript": "Hello and thank you very much for being a part of Black midwife day at the\nState Capitol under this golden dawn. You know so many of us believe it or not\nwho are sitting house and senate members were delivered at midwives or we've\ntouched a midwife my grandmother and my great-grandmother right here in Georgia\nwere midwives. But they helped so much and so much more needed now than ever\nbefore. That's why I was happy to introduce legislation. Senate Bill 546. Senate\nBill 546 and it is moving on the Senate side and I'm so happy to work with the\nlegislators from the house side, namely Representative Park Cannon, who has\nall so been working on this, and you are part of the profession. And it is a\nprofession, and we do have so many midwives who can deliver our babies,\nespecially in times like this with so much COVID and other pandemics to just\npop out of nowhere. We need professionals who love us and who won't to care for\nus and deliver our babies. So I'm going to yield to Representative\nCannon for her great work that she's doing on the house side but you know it\ntakes the house and the Senate to come together to make a law and that's what\nwe're doing, working together for the best of women and children all over the state of\nGeorgia.\nThank you.\nThank you, Senator James.\nThank you to everyone who has been a part of the planning and the execution of Black\nMidwife's Day in Georgia.\nWe are a part of a number of states across the country on today being clear that Midwifery\nis a sacred profession and a practice\nthat should be legal in all of our states.\nAs we stand here in Georgia,\nwe are doomed with the fact that mothers and babies\nare not facing safe experiences in hospitals.\nAnd even if they are experiencing safe experiences\nin hospitals, they have the understanding\nthat there is just something more culturally appropriate,\nthat there is something better about the home birth experience\nor possibly a birth center experience\nor even a hospital experience with a midwife,\nwhich is why today we are talking about\nthe important statistics related to black midwifery.\nAnd I am so proud to be standing here\nwith George's longest serving midwife,\nMs. Um Salama, who continues to share with us\nthese staggering statistics.\nIn 2023, the number of midwifery-attended births\nrose from 9.6% in 2016 to 11.9% in 2021,\nand it has estimated that an increase in midwifery\nled to the decrease in stillbirths by 26%.\nThe decrease in maternal deaths by 41%\nand the decrease in neonatal deaths by 39%.\nWhereas the institution of midwifery\nhas a huge debt to pay to the legacy\nof black, granny midwives in this country.\nWe know the history.\nAfrican women who were forcibly kidnapped and enslaved\nupon their arrival in this country\nbrought with them the traditions and healing of midwifery.\nAnd prior to the Civil War, these midwives were responsible\nfor bringing the babies of enslaved women into the world\nas well as the babies of their slave masters.\nAfter emancipation, many of these midwives\ncontinue to practice within their communities\nand became known as granny midwives.\nThey were prominent in southern states,\nincluding South Carolina, North Carolina, Alabama,\nLouisiana, Tennessee, Kentucky, Oklahoma, Texas,\nFlorida, Missouri, Arkansas, Virginia, West Virginia, Maryland, and our state right here,\nGeorgia. And during that period, Granny Midwives attended more than two-thirds of Blackbirds.\nIn those states, we know that in 1930, there were 3,000 registered midwives in Georgia,\nbut unfortunately, those numbers have significantly declined for a multitude of reasons.\nWe have continued to see there be legislative action to make training and licensing a requirement\nto practice midwifery, but we know that many black midwives who have been paramount to\nproviding maternal and infant health outcomes did not actually need those certifications\nin order to have safe deliveries.\nAnd in fact, when the work they do that is low risk, they continue to make up the midwifery\nmidforce of certified midwives, certified nurse midwives, are actually only seven percent.\nSo we know the importance of fixing the maternal and infant health disparities that exist.\nWe must engage in the word St. Kofa.\nword from Ghana that means go back and get it, go back and retrieve it and be with it meaning the\nlegacy of African midwives, traditional midwives and granny midwives. So it is our honor as House\nIncident today to honor this rich legacy and to present the 2024 Black Midwives Day Resolution\nto you, George's incredible honor, Umselama.\nThank you so much. You are welcome. You are very welcome.\nAnd at the same time that we celebrate in moving midwifery forward,\nI have to think about last session when the house presented a resolution,\nHouse Resolution 559 to Charles Johnson. Charles Johnson lost his wife Kira to internal\nhemorrhaging after a C-section at a hospital. He started the organization for Kira for moms which\nis a nonprofit dedicated to improving birth outcomes. He has been here with us advocating for the\nissues he brought their surviving children of him and his wife Kira. I'll hold the photo\nof him up here as to the time he spent with us in the house and I will invite Karina Edwards,\na midwife here in Georgia who works with the Safe Motherhood quilt to receive his resolution\nand to provide a few remarks before returning it back to Senator James we're closing.\nThank you, Representative Cannon, thank you, Senator James, for all your work and support.\nThe Safe Motherhood Quilts is something that was started in the 80s, and midwife, Fimey\nGaskin, had found it, and she began to do a lot of research where she would question\nevery death because a lot of the mothers that were dying were dying from the use of\nside attack. We're dying from cardiac arrest, which everybody dies from cardiac arrest.\nSo it was sort of a head scratching moment of why is this happening? And instead of just\ntaking the word from the doctor, you know, she would, she did some investigating. She\nwould try to talk to the family. She would talk to the medical examiner in the corner.\nShe would talk to the hospital attorneys because, you know, they would write one thing\ndown and then the hospitals would make a decision of what that cause of death was and\nthen by the time it got to the families, a lot of the families didn't even know.\nAnd so Charles Johnson has been really advocating and pushing for laws nationally to help improve\njust the communication and the accountability of these care providers in these hospitals\nand the checkbox, as far as how did this mother actually die?\nWhat led to her death?\nAnd you know, Kier Johnson, she is one of the mothers\nthat is honored on the Safe Motherhood quilt.\nThe mothers that are dying, you know, at the end of the day,\nit doesn't matter what your socioeconomic status is.\nIt doesn't matter what your level of education is.\nA lot of the practices that are happening\nis what's leading to a lot of the mothers dying.\nAnd so Charles Johnson, again, you know, after losing his wife to such a horrible, negligent death, has been fighting on behalf as well as several of the community midwives and others to just try to help shift things and make it so that women can live through birth.\nBlack women can live through birth.\nAll women can live through birth.\nAnd thank you again for recognizing Black Midwives Day\nand for supporting this work.\nAwesome.\nSenator James.\nWell, as a mother of two sons, I did not have the opportunity\nto have midwife.\nBut I regretted it for many, many years\nbecause all of my sisters who did have births with midwives\nare healthy and their babies were healthy.\nAnd so I wish that I had had an opportunity\nto have mine delivered by midwife.\nBut I'm here now to fight for the mothers\nbecause mothers are not dying in the care of black midwives.\nThey know the culture.\nThey touch us emotionally as well as physically.\nand they care for us and our babies,\nwho are really trusted by the community too.\nSo let us continue to recognize the importance\nof the legacy of black midwives and all midwives\nthroughout the state of Georgia.\nSo today we thank you for listening to us\nand let us continue to change the laws\nbecause this should not even be a topic of conversation.\nIt should already be done.\nSo together we stand.\nThank you.\nThank you.\nThank you.\nWe would love to answer any questions or.\nYou want to hear some more.\nYeah, so we're actually joined by another representative\nand her guest, who is Azula.\nAnd so we would like to invite them up.\nAt this time, we have another midwife who is also is here.\nSo we just wanna add to the space\nand have you come stand with us\nand representative Glaze will let you go ahead\nand present that resolution.\nThank you.\nWell, thank you.\nAnd I'd like to say I'm standing for mothers in Georgia,\nbut particularly black mothers, as I am a mother,\ntwo sets of twins, two pregnancies\nthat could have ended in my children not being here\nand even myself.\nbut I had insurance, and doctors, and family around\nto make sure that I was supported for the nine months\nthat I carried my twins and was on bed rest.\nSo that gives me the idea from the cup half full,\nmaking sure that we leave nobody behind\nand that doulas and midwives have been\nand are the bedrock in our communities\nfor making sure that our women are healthier during their perinatal period all the way to a year\nafter their children or child has been born. So in House District 67, which I am the representative,\nLydia Glaze, we do hereby command and recognize Mayor Teresa Thomas Smith, who is the first African\nAmerican and first female mayor of the city of Palmetto. But more importantly we\nrecognize her as the mortality, the mortality, the women's mortality, queen of the\ndistrict of 67 because of her work as a doula. And I would like her to say just a\nfew words. Yes, thank you. Thank you very much. Thank you for this opportunity. I would\nI'd like to say this work is serious work\nand not a single person that is standing here\nchose the work, the work chose us.\nThere's so many mothers that do not have anyone to speak.\nI had amazing birth experiences,\nbut when I heard the stories of my sisters and daughters\nand I don't mean the ones that I birth,\nI mean the ones that I shared the human experience with,\nwhen I heard the things that were happening to them,\nI also heard the cry of the God that I served\nand said, it's your turn to pour back the things\nthat the gifts that I've put into you,\ngive them back to the sisters and daughters\nthat do not have anyone to speak on their behalf,\nthat do not have anyone to advocate,\nthat literally just do not have anyone.\nAnd I don't think people know how many people\ngo into the birth experience with no one at their side.\nThat's right.\nThat's why midwives and dolas are so important\nto the experience and to the mothers that are having babies.\nSo I am grateful that I heard the calling.\nI'm grateful that I was courageous enough\nto answer the calling.\nAnd I extend myself to those that need support\nwhether on either side of the birth experience,\nmothers, fathers, and families,\nbecause we represent and support the entire family\nholistically and not just the mother and the baby.\nSo thank you for this opportunity.\nThank you for championing this cause.\nThank you for recognizing that we are a unit\nand we are stronger together.\nAnd we can do this when we all come together to do this.\nSo thank you very much.\nThank you.\nYou're welcome there.\nAll right.\nAnd in percent, thank you.\nThank you.\nThank you.\nGood cake for us.\n",
  "updated_at": "2026-02-12T19:17:22.61818+00:00"
}