{
  "video_id": "BQYKI5_G8pc",
  "url": "https://www.youtube.com/watch?v=BQYKI5_G8pc",
  "title": "House PM 2 Meeting for Day 40 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 23,
  "summary": "Overview:\n- The Georgia House held a legislative session on Day 40 of the 2025 Session. The session focused on passing two bills related to the judicial system and public records.\n\nKey Actions:\n- **SB 218**: Moves the Prosecuting Attorney's Qualifications Commission (PAQC) from the Prosecuting Attorney's Council to the Administrative Office of the Courts, clarifies the appeals process, and modifies confidentiality related to District Attorneys and Solicitor Generals.\n- **SB 12**: Defines the custodian of public records and specifies that requests to view public records must go through the custodian. Also requires third parties with government records to provide them to the custodian upon request.\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Debate on whether SB 218 removed a requirement for sheriff's deputies in courthouses.\n- Confirmation that SB 12 reverted back to the original Senate-passed version with carefully vetted language.\n\nVotes:\n- SB 218 passed 149-18.\n- SB 12 passed 167-1.\n\nAttendance: Quorum present, no notes on attendance.\n\nAdjournment: No explicit mention of adjournment, but the session appears to have concluded.",
  "transcript": "Mr. Clerk, will you read the caption to Senate Bill 218-218?\nSenate Bill 218, by Senator Robertson, the 29th and others to be titled.\nAnd act to amend title 15 of the Fish Code of Georgia Annotated Relay in the Courts.\nSo it's verified that the prosecuting attorney's qualifications commission shall be assigned for\nadministrative purposes only to the administrative offices of the court.\nThis bill ever referred to the committee on judiciary non-simile that committee recommends that this bill do pass by rules,\ncommittee substitute.\nRepresentative Gullet, Representative Gullet,\nhas recognized to present the bill.\nThank you, Mr. Speaker.\nI'm sorry for those of you who got bombarded by your sheriffs.\nBut just for full transparency in the rules committee this afternoon,\nwe removed the entire section that was problematic.\nI think that was a bunch of caution.\nBut just if you share for a set of tea with concerns,\nthat entire section is no longer in the bill.\nWhat this bill does is it moves the PAQC\nprosecuting attorney's qualifications commission\nfrom the PAC, which is prosecuting attorney's council\nto the AOC to solve some conflict of interest issues.\nIt allows PAQC to issue subpoenas\nand it creates penalties for the misuse of subpoena issuing.\nIt clarifies the appeal process and lays out\nthat the PAQC is the first step,\nSuperior Court, second step, appeals court, third step,\nSupreme Court, and fourth step.\nAnd it also modifies a confidentiality related to DAs\nand solicitor generals at their request.\nSo they can find out about complaints made against them\nbut have been dismissed before reaching the public stage.\nAdditionally, it'll address specifically addresses\ntheir concern that if a complainant publicizes\nthat they've filed a complaint, the PAQC can tell the DA\nor solicitor what's going on so they can respond\nappropriately, and publicly.\nMr. Speaker, this is a cleanup bill,\nand I appreciate your favorable consideration.\nHappy to answer a question, if there is one.\nThe gentleman has one question,\nrepresenting more to you left.\nIt's recognized for a question, representing more.\nDoes the gentleman yield?\nI do.\nThank you.\nCan you tell me if this particular version of this bill\nIt includes section code 15, 16, 10, the Georgia and I to code in this.\nSo let's say that one more time.\nIs this version of the bill included section what?\n15, 16, 10.\nI don't know, take a look.\nWhat's that section do?\nMaybe give you a better idea for that.\nWell, what that section actually does is require that there is a deputy, a sheriff deputy,\ncare of the every courthouse and every superior court judge.\nIn this particular version of the bill, it takes out every sheriff deputy and gives a\ngun to the attorneys.\nNo, ma'am.\nThat section was stripped.\nThis is LC-49-2429S.\nThat's not in here.\nBut it still did not put back in toward the 90 code, 15, 16, 10, which requires a sheriff\ndeputy on premise at all times.\nIt's not removed as part of this bill.\nAbsolutely, it did not fit it back in there.\nThank you, Mr. Speaker.\nThank you.\nI ask for your favor consideration.\nYou'll do well.\nThe gentleman's yielded the well.\nIs there any objection to the previous question being ordered?\nHere he known the previous question is ordered.\nIs there any objection to withdrawing the committee's substitute?\nHere he known the committee's substitute is withdrawn.\nIs there any objection to adopting his substitute offered by the committee\nHere in the rules committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nHere in the report of the committee's agreed to shall this bill now pass.\nAll in favor of the passage of the bill, we'll vote yes.\nAll those opposed, we'll vote no.\nAnd Mr. Clerk, will you unlaw the machine?\nHave all members voted?\nAll members now voted.\nIf so, Mr. Clerk, will you lock the machine on the passage of House Bill 218 to 18, the\nyeas are 149, the nays are 18, the Bill energy direct was at Constitution Majority, is\ntherefore passed.\nMr. Clerk, will you read the caption to Senate Bill 12?\nSenate Bill 12 by Senate again to the 47th and others to be entitled to amend Article 4, Chapter 18 to Title 50 that fiscal go to George annotated relating the inspection of public records, so as the revised provisions related to documents and records in the possession of private persons are added.\nthe committee on governmental affairs.\nThat committee recommends this bill do pass by committee substitute.\nRepresentative Victor Anderson has recognized to present the bill.\nChairman Anderson.\nThank you, Mr. Speaker.\nMy friends, I'm bringing to you Senate Bill 12.\nAnd before I start, I want to confirm that we're dealing with LC473644S.\nThis is the version of the Senate bill\nthat passed out of the Governmental Affairs Committee,\nnot the version that was presented in rules on Wednesday.\nSo this bill does basically two things.\nIt defines the custodian or lawful custodian\nof public records.\nAnd the second thing it does is it specifies\nthat those they request to view those public records\nIt must come through the custodian, and then it further clarifies that any third party individual or business or organization that in conjunction with the government may have some of those records that those records would be provided to the custodian upon request.\nMr. Speaker, that's what this bill does, and I will stand for any questions.\nEverything same part right in front of you to your left is recognized for a question.\nThank you, Mr. Speaker, does the gentleman yield?\nYes, sir.\nIs it not true that I greatly appreciate that Senate Bill of 12 has reverted back to the original version that passed out of the Senate with near unanimous support?\nAnd that also passed out of committee with carefully vetted language?\nI do believe this, sir, and as am I.\nIs it not true that Senate Bill 12 is, you know, provides narrow safe, is drafted in a manner that is narrowly tailored to accomplish its purpose?\nYes, sir.\nThe gentleman knows what he speaks, and thank you.\nThank you so much.\nGentlemen, representing Todd Jones, your right is recognized for a question.\nThank you very much for bringing this bill, but isn't it true that this clarification\nlanguage is going to protect Georgia company's intellectual property?\nIt will and also individuals, so thank you, sir.\nThank you.\nMr. Speaker, if there are no other questions, I will yield the will.\nThe gentleman has yielded the well.\nIs any objection to the previous question being ordered?\nChair, here's none.\nThe previous question is ordered.\nIs any objection to adopting the committee's substitute?\nHere in none, the committee's substitute is adopted.\nIs any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in none, the report of the committee is agreed to.\nShall this bill now pass all in favor of the pass to the bill?\nWe'll vote yes.\nAll those opposed.\nand Mr. Clerk, will you unlock the machine?\nhave all members voted for what purpose is chair lady Smith rise she weighs all\nmembers voted just to clear where you locked the machine on the passage of\nSenate Bill 12 the yeas are 167 the nay is one this bill haven't seen the\nThe requisite constitutional majority is therefore passed.\nMr. Clerk, will you read a caption to Senate Bill 207-207?\nSenate bill 207 by senator to strengthen to the 42nd and others to be entitled act to amend titles 20 26 31 33 and 43\nFor the future code of Georgia annotated related to education food drugs and cosmetics health insurance and professions and businesses\nThis bill ever for the committee on judiciary non-simile that committee recommends a dispel do pass by rules committee substitute\nRepresentative Tyler Paul Smith has recognized to present the bill or representative Smith.\nThank you, Mr. Speaker.\nI bring the y'all today Senate Bill 207 Rules Committee Substitute and as you'll see\nit's brief and this would allow for the ability for our firefighters across the state\nto hire someone who has completed their first offender status.\nI would be remiss if I didn't thank floor later Lauren McDonald for some of his work in this area, and miss speaker\nThat's what the bill does. I'll yield for any questions if there are any\nGentlemen has no questions. Thank you miss speaker. I'll yield message body's favorable consideration\nGentlemen's yield to the well is any objection to the previous question being ordered here in none the previous question is ordered\nIs there any objection to adopting this substitute offered by the committee on rules here in none the rules committee\nsubstitute is adopted, is he objection to a green to the report of the committee,\nwhich was favorable to the passage of the bill.\nHearing none the report of the committee is agreed to.\nShall this bill now pass, all in favor of the passage of the bill?\nWe'll vote yes.\nAll those opposed, we'll vote no, and Mr. Clerk, will you unlock the machine?\nAll members voted, all members voted this so, Mr. Clerk, will you lock the machine?\nFrom the past, if Senate Bill 207, the A's are 170, the A's are 0.\nThe Bill haven't received the records, the constitutional majority is therefore passed.\nMembers, we're going to take up a local calendar and then we're going to stand in recess and\nhave some barbecue. Our local calendar has a couple of local bills with\nhomestead exemptions bills and some further action. Three bills on the local\ncalendar relate to homestead exemption and require a two-third roll call\nover passage. Two bills are in the agreed disagree posture. One bill, having\nand receive the requisite number of signatures required.\nThe House delegation wishes to agree to the Senate's substitute.\nThe other bill have received the requisite number of signatures required.\nThe House delegation wishes to agree to the Senate's substitute as amended by the House.\nThird, reading in passage of uncontested local bills.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded vote.\nit is so ordered, Mr. Clerk, will you read the local calendar?\nHouse Bill 896 by Representative Clark of the 100th Hall County,\nSenate Bill 332 by Senator Jones of the 10th to Cab County,\nSenate Bill 234 by Senator Payne of the 54th City of Dalton,\nSenate Bill 235 by Senator Payne of the 54th Whitfield County,\nSenate Bill 336 by Senator Moore of the 53rd and Dade County,\nHouse Bill 685, agreeing to the Senate substitute by\nSenate of Gamble, 15th, Bartow County, House Bill 750 agreeing to the Senate\nsubstitute is amended by the House by Representative Cox, the 28th, for\nScythe County. Is there any objection to the previous question?\nWe know one of them, the local calendar. Here in none of the previous\nquestions is ordered. Is there any objection to agreeing to the report of the\ncommittee, which was favorable to the passage of the bills? Here in none of the\nthe committee has agreed to shall these bills now pass all those in favor of the\npass to the bills on the local calendar will vote yes all those opposed will vote no and\nMr. Clerk, will you unlock the machines?\nSo what purpose is represented the carpenter rise parliamentary inquiry, please?\nIs it not true that the representative Carpenter from the District 4 has a senator by the last name of pain and this legislation would not be very kind of the fine people of Whitfield County.\nWe're what purpose is represented park rise parliamentary inquiry stage inquiry, sir\nIs it not true I greatly appreciate my friend from Don but it is also true that you reap what you sow\nOkay\nfor what purpose is represented can't rise Parliamentary inquiry stay\nchambered ma'am isn't not true this might not be the last local calendar of\nthe day and we have the ladies cheers committee so we'll certainly follow her\nlead\nAll members voted, all members voted if so, Mr. Clerk, where you locked the machine on the passage of the local calendar.\nThe yeas are 112, the nays are 59.\nSo here's the posture of these bills.\nHouse bill 890, these bills required a majority.\nHouse bill 896, Senate bill 332.\nHouse bill 685, and House bill 750.\nThose four bills have received the requisite constitutional majority and\nare there for a past, Senate bill 234, Senate bill 235, and Senate bill 336, and fail to get a two-thirds majority, and they have failed.\nOkay, we have a couple of announcements for dinner time.\nOh, you country boys are ready for supper and girls.\nChairman Gunther is recognized for an announcement.\nKerr, ladies and gentlemen in the judiciary committee.\nWe have Jim's smoking cue from my neck of the woods coming down here, bringing ribs.\nand barbecue and their slogan is you can smell their butts for miles so it's\nreally good I suggest you come and eat with us did you really say that you\ncan smell their butts for miles I want everybody here that one so that's dream\nGreenland, that's Dreamland, who's the name of the barbecue joint?\nJim's okay, Representative Sharper has recognized for an announcement.\nI'm going to be very, very brief, thank you so much speaker.\nAngela Moore for the Cheesecake and everything she did.\nThank you so much for that.\nAnd also she's gone up, she's been honored as the trailblazer\nof the Year Award by the National Association of Women in Arts,\nBlack Women in Jazz and Arts and the Black Women's History Month Honors.\nSo we appreciate her being a celebrity,\npublicist, and also working hard in the entertainment industry.\nThank you so much more.\nAppreciate you.\nThat's, that's my sweet mate, y'all.\nRepresentative Coyote, you have an announcement,\nneeds to be paid.\nOkay, everyone, give the gentleman your attention.\nRepresentative Gabi Coyote, then I'm gonna tell you\nabout the barbecue from Dreamland.\nThank you, Mrs. Speaker.\nHey, everyone, if you signed up\nto Good and Nigeria in July,\nPlease look out for my email, we are about ready to start collecting payments, and you are going to have fun in Nigeria.\nAnd if you are interested in having signed up, right now we have about 48 people signed up.\nIf you are interested, please see me.\nThank you, Mr. Speaker.\nThank you, sir. Here's the deal, members.\nOur your dinner and my dinner is in room 216.\nWe have barbecue from Dreamland.\nI don't think they had the same slogan.\nIt's what Chairman Gunther's group did, but they're in room 216.\nNow, this barbecue is for house members and for house staff.\nSo, when everyone's fed, if there's anything that remains, that may open the door, but\nfor right now, we want to ensure that all of you have a nourishing dinner, it will\nbe delicious house members and house staff.\nAll right members, this house will be in recess until 7 p.m. 7 p.m. and then we will get\non with the order of the day 7 p.m. House will stand in recess.\n",
  "updated_at": "2026-02-12T17:03:36.408001+00:00"
}