{
  "video_id": "bwObad2dmxc",
  "url": "https://www.youtube.com/watch?v=bwObad2dmxc",
  "title": "11/14/2023 - Senate Study Committee on Expanding Georgia's Workforce",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 24,
  "summary": "Here is a structured markdown summary of the Georgia 11/14/2023 - Senate Study Committee on Expanding Georgia's Workforce session:\n\n## Overview\nThis was the final meeting of the Senate Study Committee on Expanding Georgia's Workforce, initiated by Lieutenant Governor Bert Jones. The committee heard from Lt. Governor Jones on the importance of workforce development across Georgia and the state's efforts to partner with businesses and education institutions to address workforce challenges.\n\n## Key Actions\n**SB 112**: No specific bills were mentioned as being passed or referred.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Lt. Governor Bert Jones addressed the committee, discussing his visits across the state to technical colleges, HBCUs, universities, and high school career academies, and the need to partner with businesses to build Georgia's workforce.\n- The committee Chair, Senator Albers, thanked the committee members and the working committee for their time and efforts over the multiple meetings held around the state.\n- Senators Halpern and Beach expressed their appreciation for the committee's work in gathering data and insights from across different industries to inform the final report.\n\n## Votes\nNo recorded votes were mentioned.\n\n## Attendance\nQuorum was present, with all committee members in attendance.\n\n## Adjournment\nThe meeting was adjourned. The next session date was not provided.",
  "transcript": "Please find a seat.\nWow, people are usually going to get that quiet that quick.\nWell, good morning again.\nI'm going to call this meeting to order for Senate\nResolution 275, the expanding of George's Workforce Study\nCommittee for our final meeting.\nWe have had six wonderful meetings throughout this state.\nAnd I mentioned that each one of those as we began.\nThis was an initiative from a Lieutenant Governor,\nBert Jones and he asked myself and appointed a committee here, which were all present,\nin order to explore ways that we could expand George's workforce.\nAnd he is here today to address our committee, so Lieutenant Governor, if you would please\njoin us, we'd love to hear from you.\nAll right.\nGood morning.\nGood morning.\nAnd it's good to be here.\nThank you, Chairman Albers.\nI appreciate you having me.\nAnd thank you committee members for participating in this.\nThis, you know, something that's very important to me and very dear to my heart, I will have\nto say that I have been traveling around the state and seeing a lot of different between\nour technical colleges, center of Halperin, I've been to our HPCU universities and also\nour universities from State Spurrow all the way out to North George as well and a lot\nof our college and career academies and we are really hammering home that we've got\nto get our young people prepared for workforce development and the thing of this great that's\ngoing on here in the state of Georgia there is a whole lot of opportunities on the business\nfront and dead men if you're talking about opportunities like Ann and Savannah with\nHyundai EV industry or the Gulf Stream market or if you're talking about\nDalton where you've got the carpet industry or Gainesville where I went to\nsomething that the Daniels construction operation they were doing a big\nworkforce development involving our young high schoolers you know and they\nwere teaching them skills and carpentry and electricity and things of that\nnature and and so what I have seen is that there's plenty of activity out there going on with\nprivate businesses and things of that nature and we've got to build as a state harness those\nopportunities and partner with those different groups around the state to help build out our workforce\nand we need to be focused on at every level from K through 12 to the technical colleges as well\nto our university systems.\nAnd I just want to make a special thank you\nto my good friend, Champ Bailey, who came in\nin an early in the session.\nAnd he and I talked about a few things.\nAnd Champ, you know, Champ and I were at George together.\nI actually played with his brother more than I did Champ.\nAnd of course, I didn't play much with Champ\nwhen I actually played with him, you know.\nHe was so much better than all the rest of us.\nBut at any rate, but when he came in and was talking\nabout how passionate he was about wanting to give back to his state, you know, like I\nhave.\nI said, well, you know what, let's partner on this and let's see if we can come up.\nHe's champed from a small town and folks in Georgia, a small town a lot like where I'm\nfrom and we know exactly exactly the limitations that a lot of the young people run into, being\nfrom small communities and things of that nature and so anytime you've got somebody\nwith his stature and posture and all the accolades\nthat he's achieved through athletics.\nWhen you've got somebody like that\nthat wants to be helpful in giving back to communities\nlike he is around the state, it's meaningful.\nAnd I wanted to harness that and say,\nwe're gonna do some other projects as soon as this is over\nwith, so we're looking forward to the recommendations,\nchairman Albert's that you're gonna come with.\nBut I think we have a good idea.\nI know y'all've met a lot, and I really appreciate\neveryone's time in doing that.\nI know that y'all are doing this out of the love for you\ncommunities, and most people in here are doing this\nfrom a voluntary basis, and I appreciate that.\nI appreciate the senators who've served on here,\nBrandon Beach, who's the head of our economic development.\nAnd I'll say, as I mentioned, Senator Halperin,\nshe and I have several projects going on that include a lot of it includes\nworkforce development and things of that nature and like I said this is one of\nthose things that it breaks across party lines and everything else because\nit's talking about trying to harness the talent that I know we have in this\nstate and help us continue to be a very prosperous state and a very\ncontinue to have that record of the best place to do business and we\nwant to have the best workforce you know for businesses to acquire and come\nto so thank you all very much senator and I appreciate everyone's time and\neveryone who's interested in this and and I look forward to working with y'all\nand after we get out we'll get done with the recommendations y'all have a\ngreat day today okay thank you\nI want to thank you for your red tape initiative, that will, it will get rid of some cumbersome\nregulation but it will also streamline the licensing process so we can get people to\nwork that are coming to our state, that are licensed in other states and we can get\nthese people to work and it will help from a workforce development standpoint.\nSo thank you for your red tape rollback, appreciate it.\nThank you.\nGreat point.\nThank you again, Lieutenant Governor Jones, for putting his faith in trust and honor for\nall of us to serve.\nI want to take a moment to thank our working committee first.\nThis group has, as mentioned, spent a lot of time when we're not meeting, preparing\nfor those meetings, gathering information, getting all the logistics put together.\nThey've done a phenomenal job.\nAnd we are going to have a photo with both our committee and our working committee right\nAfter this is done, we're going to walk down the steps over here to the Grand\nStair case on the south side of the building to get that committee photo done.\nSo please don't leave before we get that accomplished.\nNext, I want to thank each one of you.\nYou spent a lot of time away from your day jobs, other things that you have to\nfocus on at home.\nMy friend Ryan Pernes and I, we've had to have more important discussions at his\nrestaurant.\nWe're going to have to have many more in the coming days.\nI just know that will be the case.\nI think it's going to be disappointing to a lot of Georgians that champs not going to\nbe at the next committee meeting to take a picture with, though, and you've been very\ngracious with your time and status.\nBut folks, you spent a lot of time doing this, whether it be traveling to different areas\nas well as giving us your input, asking good questions, and I do very much appreciate\nwhat has been done.\nAt this moment, before we get to the final report, I'm going to ask if anybody on the committee\nHas any final thoughts or things they'd like to address\nto the committee and those that are watching here\nin person or on video?\nSenator Halpern, your three.\nGo right ahead.\nI would like to just say that the work of this committee\nhas been really important and just a thank you to you,\nMr. Chairman and the Working Committee\nfor the organization, the ability for us to look\nat the full angles of small business and big business\nacross a number of different industry sectors\nto really get our hands around\nwhere the problems are not just anecdotally,\nbut also through data,\nand being able to take all that information\nand compile it into a final report\nthat I think we can all be proud of.\nThank you.\nOther, Senator Beach?\nMr. Stecco, what Senator Halpern said,\nand thank you for this committee\nin doing the hard work.\nI can tell you as somebody that does economic development,\nnot only do I chair economic development,\nI will see you in the chamber for 15 years\nand still do economic development in North Fulton.\nWorkforce is an issue across industries.\nI mean, I don't care if it's healthcare\nor what industry it is, workforce is an issue\nand we've got to tackle it.\nAnd I will tell you some of the recommendations\ngoing to these meetings and hearing how\nthe carpet industry is working with the Department\nof Corrections, for example,\nand some of the unique things that are being done\nand how we have to continue to work with not only high schools but now down to middle schools\nand really get these kids on career paths where they can, you know, we heard from the\nFord dealership gentleman that you can make six figures and it's not an auto mechanic\nanymore. It's a computer job. It's a technology job now in these car dealerships. So we really\nI learned a lot and it opened my eyes up, but we've got to make sure we're, I'm a firm believer the private sector creates jobs, not government, but what we can do is create a conducive environment and give the private sector the tools to be successful and I think that's what this committee is going to do and some of these recommendations, I like these recommendations a lot.\nI also brought up the point about how the construction industry has used these simulators to really train people.\nAnd I think that's something we need to continue to fund and look at across industries,\nthese simulators that get these kids involved and get them to want to do these jobs.\nAnd so I just want to thank you, Ms. Chairman, for this committee.\nAnd thank you for the folks that don't serve in the Senate that were on this committee.\nThank you for that.\nAnd I'll make a motion at the proper time after everybody else speaks.\nfantastic and we're going to do a summary of the report and I think one of the things\nthat we all learned as well as the incredible work that Commissioner Dozier and his staff\nare doing on our technical college system for those that are not aware of that great\nwork.\nHopefully this was an enlightening experience and you're really doing an amazing job, your\nleadership and your vision so thank you, Commissioner, we appreciate your help.\nThank you.\nI could just...\nPlease.\nMr. Chairman and committee, thank you so much for the focus.\nOne of the things I've had the blessing for four years to be part of TCSG and honestly\nthe legacy of TCSG and the hard work precedes me coming four years ago.\nIt's just an incredible group of folks that are trying to change lives and change communities.\nSo one of the things I just want to say is thank you.\nThe team out there is working hard.\nThe focus is on workforce and the team is ready to step up and we appreciate your focus\npersonally in this committees and the lieutenant governor.\nWe stand ready.\nSo, thank you.\nThank you, Commissioner.\nOther members of the committee?\nAny final thoughts?\nAll right, we're going to then turn it over to Haley.\nNow, I wanna just take a moment to thank,\nagain, the working committee,\nbut specifically the work that Haley did.\nThis has been a lot of information.\nAnd not only has she assembled and took all this\nand created what you see in front of you,\nwhich are the findings,\nbut there's gonna be an appendix\nthat's gonna go with this.\nIt's gonna have all of the volume of information\nthat we have received during this process.\nShe also worked with each of our speakers\nto make sure their presentations\nwere addressing the needs of the committee,\ngetting them ahead of time,\nworking with our Senate Press team\nin order to make sure we had those available to view\nand we had copies made and all that stuff like that.\nSo thank you for all your great work.\nAnd if you just give us kind of a high level summary,\nwe're not gonna go point by point.\nBut for those that are listening,\nthe members of this committee got this report last week.\nSo they had time to review, make any suggested ads or changes.\nAnd like any report, we think we made this just about right.\nNot too too specific where it was one group that wanted something that was just for them,\nbut not too high level that it can't be meaningful.\nFrom this report, though, what you're going to see in which is the initiative of our\nLieutenant Governor is legislation, budget, and other things are going to come out of this.\nThis was not just an opportunity for us to get together and review, it was an opportunity\nfor us to get something meaningful to act upon.\nAnd I'm going to look forward when we have those bills in front of full Senate committees\nand full House committees in 2024, I'm going to ask some of you to please come back and\ntestify those committees because while it's important to hear from legislators, it's\nmore important to hear from those who are industry leaders who have been a part of the process.\nSo with that, Haley, I'm going to turn it over to you and turn your microphone on.\nOkay.\nOkay.\nI'm on to.\nYes.\nAll right.\nThank you.\nFirst of all, Chairman.\nVery kind words.\nI'm very happy to be useful.\nMoving on to the findings and recommendations section of the report.\nWe broke them down into policy recommendations and legislative recommendations.\nSome of the policy recommendations will kind of overlap with legislative recommendations.\nbut it's organized in a way that it's pretty easy to follow.\nFirst of all, the workforce marketing was a trend across each and every meeting that we saw,\nevery single employer that we heard from expressed that it was very difficult to just inform people that certain jobs even exist and the benefits of them.\nthem. So each of these touch on different initiatives for that, but I wanted to highlight the state-facilitated\nfree platform, like Indeed, for all Georgia employers to use, because I think that was something\nthat everyone was really excited about, and that will be something that is likely moved\ninto a legislative initiative as well. K-12 and higher education. Of course, we also heard\nfrom countless employers that these are,\nthis is where it starts.\nSo each of these initiatives are things\nthat could theoretically be done unilaterally\nby education systems, our local education agencies,\nand our state education agencies, particularly\nCleaning up the CTAE pathways.\nThose are highlighted in the K through 12 education policy\nrecommendations.\nGoodness, what mouthfuls.\nAnd under higher education, you'll\nsee several initiatives just encouraging TCSG\nto continue what they're doing, essentially,\nwith more support from the legislature.\nAnd something that was highlighted in that\nis basically finding ways to celebrate acceptance\nand attendance at TCSU institutions.\nOur next and final subcategory under our policy recommendations\nwill be inclusivity.\nAnd that is encompassing various subpopulations\nby especially the population of Georgians\nthat have developmental disabilities,\nwhich we heard from multiple employers as well,\nthat we are just not reaching that subpopulation.\nDoes anyone want to discuss these policy recommendations\nbefore we move on to the legislative?\nor if you see anything specifically\nthat you would like clarity on, okay?\nSeeing none, continue on.\nWonderful, so the legislative recommendations\nare a little more concise.\nFirst of all, the articulation agreements,\nwe all heard multiple times\nthat we need a better system for the transfer of credits\nand that will require legislation\nunder licensing, the pretty standard points of discussion,\nsuch as reciprocity agreements,\nand just generally increasing flexibility\nin obtaining licensure.\nUnder program funding,\nI'll go ahead and just touch on these individually\nsince they're only a few.\nIncreased funding for tuition reimbursement\nin high demand fields,\nand those examples include nursing or even technical degrees\nsuch as welding certifications and things like that.\nA grant program for high school graduates\nto work for a local government entity of some sort\njust to incentivize a gap year for students\nto get some real world experience\nand contribute to their communities.\nAnd that was specifically brought out\nby the Lieutenant Governor's Office as well.\nAnd the funding for the statewide employment portal\nthat we talked about in the policy recommendations.\nAnd finally, we did talk a lot about benefit cliffs,\nbut, and there have been really good studies.\nDaniela sent over some studies that have already been done\nthat are really excellent,\nbut we did agree that we should probably engage\nin further study for specific communities,\nrevisiting programs who encourage\nand instead of eyes retirees return to the workforce.\nAnd we also touched on with Senator Hickman,\nthese childcare centers that are operating\nin Effingham and Bryan counties\nwhere local school systems are building child care centers\nfor the teachers and staff who work for those school systems.\nAnd finally, pass SB 112,\nwhich will establish the Excel Center pilot program,\nwhich will award high school diplomas\nto adults over the age of 21.\nExcellent work.\nThank you for giving us that overview and summary.\nAny final thoughts from the committee members?\nSenator Hickman, go right ahead.\nWell, thank you, and I am very excited\nthat F&M County and Bryan County\nare building daycare centers for their teachers,\nand I think that's a big, big leak.\nLet me mention one other quick thing\nthat came up yesterday is that,\nyou know, when we look at the QBE formula,\nthe QBE formula funds one counts\nfor every 400 students in a school,\nand we know that's a big, big issue,\nbut what we came up on yesterday was,\nthose counts were primary academic counselors.\nMaybe in some point in time,\nwe need to be looking at career counselors for high schools.\nTo help these students, I keep going children,\nhelp these students determine what career they want to go into\nrather than take geometry or whatever.\nI think that's a big, big thing.\nAnd the other big thing I think is,\nand it came through the hearings was,\nhow much we need more businesses involved in\nworking with the schools and providing,\nyou know, if Delta Airlines wants to recruit out of\nof certain schools, maybe dealt with airlines,\nneeds to step up and provide the simulators\nfor type things, and I think those type things,\nand I think we can't, we got,\nI know in our accounting world,\nwe're very involved in the universities,\nand we know by being involved in the university,\nwe get opportunities to get the dream\nand the property account that's coming out of the school,\nand I think that's what our business\nis going to be thinking about at the same situation.\nThank you, Mr. Chair.\nThank you, Senator Hickman.\nany other comments?\nYes, Dave, number one, number five, okay?\nJeremy, thank you very much.\nI'd like to circle back just briefly\nto the policy recommendations under K-12 education.\nThere's a number of really good, solid recommendations.\nThere are one that I know that the General Assembly\nhas made some progress on already.\nIt's in the area of computer science courses\nand providing staff to teach those courses\nin our Georgia high schools.\nA number of states throughout the country,\nI was just doing a search on my way in,\nincluding three of our neighboring states\nin North Carolina just became effective last month,\nrequired computer science,\npassage of computer science course\nfor as a graduation requirement.\nAnd we saw one of the things that really impressed me\nabout everything that we heard on all these meetings\nwas how important technology is to every job\nthat we create today in Georgia.\nSo I would potentially offer that for inclusion\nso that we could be on par with other states\nthat we're competing with.\nYeah, no, I agree.\nIn fact, I've already had some conversations with Senator Clinton-Dicks, and he is the\nchair of our education committee for K-12 and discuss that.\nAnd I think we've had a pretty good dialogue of how our education system has to evolve\nnow, right?\nWe've talked pretty much the same way K-12 and especially the University of Status for\nabout 85 years now, but the world has changed many times over.\nAnd I think we use the example that Commissioner Dozer and TCSG has done, but we need to apply\nthat same methodology from kindergarten to 12th grade and then certainly at our university\nlevel as well.\nThank you.\nOther questions or comments?\nMr. Sorry.\nHang on a second.\nWhat number are you there?\nEight.\nOkay.\nGo right in.\nYes, sir.\nI just wanted to point out that we actually do have a point in the policy recommendations\non high school counselors to your point, Chairman Hickman.\nThat's something we've heard consistently that if students don't have guidance to help\nthem work through these college options and technical college options, they won't kind\nof be able to make their best decisions.\nSo just appreciate all your work on the Higher Education Committee and certainly echo\nyour thoughts to on making sure that we've got employers engaged.\nI know that's kind of a consistently what our businesses are asking for us to get more\ninvolved in the K-12 system.\nSo appreciate your leadership and then the work of this committee to make that easier so\nSo we can really build strategic pipons that benefit students.\nThank you, Danielle.\nAnd yes, Senator Hickman's literacy work that he's been doing with his committee and\nthe legislation he's worked on has been extraordinary because child can't read.\nThen we've got a lot of problems ahead of them.\nSo thank you for your great work.\nOther comments or questions to committee members?\nSeeing none, I'm going to recognize Senator Beach for emotion.\nMr. Chairman, I've moved to approve the Senate Study Committee report on expanding Georgia workforce.\nthat was created by Senate Resolution 275.\nSecond.\nAnd we've got a second from Senator Halpern.\nIs there any further discussion\nbefore we take a vote on this committee report?\nSeeing none, all those in favor, please say aye.\nAye.\nAll opposed, please say no.\nIt passes unanimously.\nThank you very much, we appreciate that.\nThe next step for this is we will print out\nthe final report, we will sign it,\nwe'll submit it back to the Lieutenant Governor's Office\nand to the Secretary of the Senate.\nIt will also go up on the website.\nIf you remember, expanding Georgia's work for study\nis a active website.\nWe will keep it up for some time to make sure everybody\ncan see the work that was done here.\nIt will also be posted on the General Assembly website,\nwhich is ledges.ga.gov.\nYou'll be able to find that report there as well.\nI know after committees are over,\ntypically everybody wants to chat either here\nor with the folks that are here in the audience,\nbut I'm going to ask you to give us a pass right now,\nbecause as soon as we're done, I'm gonna ask everybody\nif we can walk right out this door to the side.\nWe're gonna go down the stairs and get our picture made\nbefore everybody goes in different directions.\nSo at this time, we're gonna conclude this study committee\nand call this meeting here by adjourned.\nThank you.\nHave a great day.\n",
  "updated_at": "2026-02-12T20:18:40.794625+00:00"
}