{
  "video_id": "C-QrVR4LrRI",
  "url": "https://youtu.be/C-QrVR4LrRI?t=636",
  "title": "Georgia House - Day 40 (2026-04-04)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": "2026-04-04",
  "duration_minutes": 138,
  "summary": "## Georgia House - Day 40 AM Session (April 4, 2026)\n\n### Overview\nOpening morning session of the final day (Day 40) of the 2026 legislative session. Heavy focus on morning orders, recognitions, and beginning bill passage.\n\n### Key Legislation Passed\n- **HB 582**: Allows abuse victims to present evidence in defense; includes HB 384 defining police oath violations as felonies/high aggravated misdemeanors\n- **HB 266**: Major veterans tax relief - virtually eliminates state income tax on veteran retirement income; includes police foundation tax credits\n- **HR 7**: Road naming resolution honoring George A. Seat True Locke Jr. (amended to add HR 328 for Chief Jeffrey E. Turner I-75 dedication)\n\n### Morning Orders & Recognitions\n- **Pastor Jay Williams** (Chaplain): Reflected on significance of 40-day sessions, compared to biblical 40-day periods\n- **Rep. Stetson**: Thanked colleagues for support during cancer treatment; recognized new Macon County Sheriff Carlo Spelton\n- **Spelman College Glee Club**: Celebrated 100th anniversary\n- **Kindle Ray Johnson**: Recognized as youngest certified farmer in the USA\n- **Ocarian Dwight Perry Memorial**: Ice cream truck safety legislation (HR) in his memory\n\n### Announcements\n- Rules Committee meeting at 1:30 PM (Room 341)\n- Intergovernmental Coordination Committee in Room 406\n- First Annual Sine Die Block Party in Liberty Plaza (1-6 PM)\n\n### Session Notes\n- Final day atmosphere with celebrations and recognitions\n- Multiple family visitors in gallery for Sine Die",
  "transcript": "You\nWell good morning. Friday morning last day of the work week. Unless it extends into\nSaturday. I'm not sure about that. All members. All members. All members please come to\nof the floor, all members.\nWe're all good morning members because a good Friday, I think it's day 40 last I checked,\nwhich I've been looking for this one for a day or two, because we know that the hour\nfor convening having arrived, all members will please take their seats, Mr. Clerk will\nYou ring the bell.\nWell, good morning again, we're going to have the morning roll call, morning roll call.\nAll members present will please vote green to signify their presence in the chamber.\nAnd Mr. Clerk will you unlock the machines?\nAll members voted.\nNow, I'll vote, it.\nAll members voted.\nIf so, this clerk will you lock the machines?\nWell, good Friday morning again.\nDoorkeepers, will you please close the doors and keep them closed?\nAs is our custom here in the house, we will begin our day with Scripture reading and prayer\nby our chaplain, after which we will pledge allegiance to the flag of our country.\nThis morning I have the great honor and distinction to bring you our chaplain of the day.\nHe's my pastor, Jay Williams.\nJay is accompanied by some very important people in his life, and they're sitting right\ndown to my right.\nOne of his daughters, he has two daughters, one of them is paging today, and y'all will\nsee Annabelle.\nShe's a beautiful young lady.\nShe'll be here.\nNo, there she is right there.\nI'm sorry.\nShe joined the sunflow of Annabelle, hadn't seen you this morning.\nBut the other light of his life is sitting with Miss Dale, as a young lady named Lily\ntwo other important ladies are with him one of them assures that his life goes\npretty smoothly and that's his mother-in-law Molly Scott thank you Molly for being\nhere but his dear wife and one of the leaders in our church is his wife\nI mean, do you health care professional who takes care of many folks up at\nscreving county health systems in Sylvania, but also as a caretaker of many\nfolks, slides, spiritually and physically in our church, down at Misba, down in\nthe Clio community down in Northern F and Him County. Let me tell you about our\npastor today. He actually grew up with Chairman Matt Hatchett. He turned out\npretty good in spite of that. But he and Matt were pretty close neighbors down in\nDublin when they grew up. I'll tell you a lot about Jay from the standpoint of\nhis service over the years and in the South Georgia conference and now with us\nat MISBA. He served with distinction. He served with passion and compassion to his\nflock. He's been a teacher in the public school system, but he's been a leader in God's house\nhis entire life. Like many of us, he's had a time or two, getting started and he had to get\nit the right direction, but he's accomplished that and he's made a difference in his own life\nfor his family's life and in many, many other people's lives. My family then have attended\nthis 159-year-old church. No, I haven't been there 159 years. Thank you very much, Al.\nBut he's made a difference in our church. He's grown our church. He's, he brings God's\nWord and that's what it's all about. So without further ado, my pastor, Pastor J. Williams,\nThat's our chapter of the day, Jay.\nThank you so much.\nThank you, sir.\nSpeaker and distinguished representatives of this beautiful state of Georgia.\nI want to begin by telling you, thank you, thank you so much.\nIt's an immense honor to be before you today in this place and at this time.\nI also want to express a deep gratitude for all that you do here.\nI can't even begin to fathom what you juggle to serve our state or your personal sacrifices\nthat you give to be here.\nI may understand the basics of the legislative process, but the entirety of the experience,\nthe weight of it, is astounding to consider.\nYou serve the great state of Georgia and your district and all matters as it applies to\nstate and government.\nI know what that really means is you have thousands of people telling you what they want\nyou to do.\nyou can't please them all. You also live in a fishbowl. You live under the scrutiny of\nthe press, your peers, and people that don't even know you. And the truth of the matter\nis, is none of us are perfect. You face acceptance, rejection, and conflicting ideas every day.\nAnd you shoulder all that while still managing the business of this state. And on top of that,\nYou have the complexity of your own lives, your own internal struggles, your own family\nlives.\nIt's a greater undertaking than anyone can understand at just a casual glance.\nThat being said, it's important to have a 40-day session.\nAnd more importantly, it's important to have an ending day of a 40-day session.\nSo just like that, I want to tell you this, it's important because this is an all-consuming\njob. And if you didn't have a 40-day session, there's no telling where we may end up.\nIn the Bible, just like here, the number 40 is significant. There are many 40-day periods\nthat are mentioned in Scripture. There are usually periods of trial, testing, and preparation.\nLet's look at some of them. Know about the grace of God injured the flood for 40 days. Moses\nwas on the mountain top, receiving the law for 40 days. And Jesus was in the desert, tempted\nby Satan for 40 days and Jesus was after his resurrection and after his crucifixion death\nand resurrection he walked the earth and before sending into heaven he walked the earth\nfor 40 days. I'm sure some of you can relate. Some of you like Noah having endured a flood\nof challenges over the past 40 days. Although it's not quite over, the dove is up. Some\nSome of you like Moses have been on the mountain top and you've received your legislation and\nthe people didn't quite respond the way you wanted them to.\nSome of you feel like you've literally been in the desert with the same guy that Jesus\nwas.\nI pray that you pass the test and that you didn't give into his trap.\nAnd some of you are simply waiting for the end of day 40 so you can go to that little\nplace of heaven called home.\nThis is what I want to say to you today on this final day, that there's hope.\nThere's hope in this session and there's hope in the signing die.\nThere's hope in the end, in the end of the 40, in the adjourning.\nThere's hope in the remainder of this day and the possibilities that it holds and there's\nhope in the promise rest in its end.\nI can't begin to understand the weariness that comes from your schedule.\nThe pressures to please the masses and the looming threat of being replaced if you don't.\nAnd then there's the necessity of staying true to what you know is right in the process.\nIt's in this complex context that our state brings its problems to you.\nWhile you have protocols to address these problems, what about the ones that are too big\nfor even this house?\nThe ones that are beyond your reach with implications that are far too heavy to bear, yet the decisions\nstill have to be made.\nwhat of your own burdens, the ones that are too heavy to carry\nalone. An old hymn comes to mind. There is a place a quiet\nrest near to the heart of God. Scripture says it like this,\nJesus said, Come to me, all you who are weak and are heavy\nladen and I will give you rest. Forty is the number of days\nin this session, but forties also a metaphor for life. It's a\ntime of trial and testing and preparation, there's a promise for those that will respond\nto Christ's offer.\nWe don't have to face it alone, there's one greater in whom we can rest.\nThe promise is that if we walk with Him, we can have internal rest during the session.\nAnd at the end of it, we can have ultimate rest in our own personal, signy die.\nAs we move through today and toward the close of this session, I say thank you so much\nfor the work that you've done and the work that you're still doing. I invite you to find peace\nin knowing that you're not alone in this journey. Whether you carry the burdens of this state\nor your own personal burdens, there's an invitation to pause. An invitation to respond to Jesus is\ncalled arrest in someone that is trustworthy, someone that is greater than us, someone that is\ngreater than our circumstances, to rest in the one who holds it all together and let him direct\nand care you throughout this day. Again, I thank you for all that you do and all that you endure\nfor this state. I pray that as you find rest in the nearings of God that you do so in this final\nsession, I also pray that you do it in your lives out beyond this session. I pray that you're blessed\nin the adjourning, most immediately in the adjourning of this session, but more importantly,\nas you prepare for your ultimate and final home going.\nThere's hope in the session and hope in the Sinai die.\nThank you so much for the opportunity to speak here today\nand thank you for the chance to share the truth of God's Word\nand for the privilege of proclaiming the hope that's found in the name of Jesus.\nI pray that you rest in it in the rest of this session\nand also in the Sinai die. Let's pray.\nFather, as I stand before these people in my heart is heavy, my Father, they have worked\nso hard. They have done their best, Father God, to please their constituents, Father, and\nto do what's right. And Father God, I know it's a huge job. I pray today that as they go\nthrough this marathon day, Lord, that you're in the middle of it. I pray, Father God, that\nyou anoint them to walk in peace and love with one another. And Father, I pray that\nyour will be done. Father God, I thank you so much for the fact that you put them in\nthe place that they're in today. Father, use them for your glory. Father God, and for\nthe betterment of this state. Father God, thank you for their leadership. I pray you bless\nthem in Jesus' name. Amen. Please join me in the\nfriends are leading.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands.\nOne nation got indivisible with liberty and justice for all.\nExcellent.\nWell, folks, I was a little concerned there to preacher and vote sunny dye several times.\nI'm glad you didn't have the papers ready to go.\nWe would have been out of here.\nJay, thank you, and family, Mindy, and family.\nThank you for being here.\nIt's a four-hour drive up here, so we appreciate you all\nmaking this commitment.\nDoorkeeper, you may unlock the doors.\nMembers, you may join Brother Jay in that south\nany room in his family, and thank him for his service.\nSo that's it here today.\nhave two doctors of the day. Our first one is we'll serve us from 9 until 2 p.m. today.\nAnd that is Dr. Kisha Collins. Collins. And that's Dr. Collins was invited by Representative\nTanger Haring. Thank you Representative Haring. From 2 o'clock till adjournment will be Dr. John\nWilliam Gleason, Dr. Gleason's been here before he's invited by chair lady Debra Silcox.\nThank them for their service to us.\nThey're down in the aid station if you need them.\nChairman Hilton, the committee on impression audits has recognized Chairman Hilton.\nThank you, Mr. Speaker.\nLast day, best day.\nLet's make it a good one.\nAppreciate the opportunity to be your chair on information on it.\nWe have reviewed the journal.\nIt was a long one, Mr. Speaker.\nBut we've reverted, reviewed the journal\non the previous legislative day,\nand we found every word to be correct.\nWell, I can tell it's been long a couple days\nof some bags under your eyes.\nThanks for doing your job.\nChairman Hilton reports that every word is correct.\nThe chairman of the Committee on Information Audits reports that this journal of the previous\nlegislative day has been read and found to be correct.\nIs there objection dispensed with the reading of the journal?\nI certainly hope not.\nThe reading of journal is dispensed with.\nIs there any objection to the confirmation of the journal herein on the journalist confirmed?\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative, administration of the 104th moves following me establishes the order of business in the first part of the period unanimous consensus.\nIntroduction of bills and resolutions, first reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees,\nmorning orders is there any\nobjection to the adoption of the\nresolution establishing the order\nof business for the day here in\nnone, the resolution is adopted.\nFirst reading the bills and resolutions, Mr. Clerk, will you read?\nHouse of late 97, my revs.\nI'm out of the 50th.\nHugo Lee, the 141st park, the 107th miller, the 62nd fry, the 122nd and\nothers, Bill B. Todd, an act to amend chapter 4, title 49.\nthe fiscal to Georgia annotated relating to public assistance.\nPublic and community health.\nHouse Bill 898 by Representative Iowa,\nthe 50th, hugely the 141st parking lot.\nThe 7th miller, the 62nd fire, the 120 second and others.\nBill B. Todd, an act to amend chapter 4, title 49\nis the fiscal to Georgia annotated relating to public assistance.\nPublic and community health.\nHouse Bill 899 by Representative Jenkins,\nthe 136th sponsor of the 73rd,\nthe number to the hundred and twenty-third in camp of the hundred and thirty-fifth.\nBill Bitton and act to amend chapter seventeen and title forty-four in the fiscal of Georgia and attend it relating to transfer on death deeds.\nJudiciary, House Bill 900 by represent of Carson the forty-six and C-Vall of thirty-fourth.\nBill Bitton and act to amend code section forty-seven twenty-three sixty-four in the fiscal of Georgia and attended relating to transfer funds from the employee retirement system of Georgia.\nRetirement House but 901 by Representative Carper Carter the 93rd mentally 88 Davis the 87th of the Scope field the 63rd\nBill B. Tyler an act to men part one of our 11 chapter two a title 21 of the official go to Georgia and Tater relating to general provisions\nRegarding preparation for and conduct and primaries and elections\nGovernmental affairs well 902 by resident of Jones the 25th parent of the 24th William's 148\nNucleus is 78th and Kelly the 16th.\nBill B. Todd and Active.\nN. Toddle 33th, the fish go to Georgia,\nannotated, relayed the insurance.\nInsurance.\nHouse Bill 903 by reps in a pile of the 33rd.\nWork highs are the 157th target.\nThe second chance versus the 11th.\nAnd a McDonald's third of the 26th.\nBill B. Todd and Active,\nan article on chapter 13 and Toddle 50th,\nthe fish go to Georgia,\nannotated, relating the general provisions\nregarding administrative procedure.\nThe governmental affairs.\nHouse will 904 by refs on a silcox,\nthe 53rd in Cooper, the 45th.\nBill B. Todd, an act of men code section 31, 6,\n47 of these fish go to Georgia,\nto annotate a relay of exceptions\nfrom the Certificate of Need Program.\nHale.\nHouse will 905 by refs on a Richardson\nof the 125th, gone through the 8th,\nlevered to the 123rd,\na stretch to the 104th,\nbut chatted to the 176th and others.\nBill Bitton, an act to amend code section 47, 23, 64.\nHe'll be fished, go to Georgia,\nannotating, relaying the transfer funds\nfrom the employees retirement system of Georgia.\nRetirement.\nHouse will 906 by remission.\nAnd I'm Smith of the 41st,\nto build the title of an act to amend\nR3 chapter eight, and title 31.\nReally fish go to Georgia, annotating, relating the long-term care on the Baudsman program.\nHuman relations and aging.\nHouse 907 by Remstead of Jones, the 47th Burns and the 159th Duke Nick of the 29th Jaspers,\nthe 11th Irwin of the 32nd and others.\nBill B. Todd on active in article 31C in chapter two,\na total 20 of the official go to Georgia annotated the completion\nspecial schools act.\nEducation House Bill 908,\npart of the represent of Smith in the 41st of Bill B. Todd\nand act to amend some part two part one of article 16\nin chapter two, a total 20 of the official go to Georgia\nand tend to relate to compulsory attendance.\nAnd education Osville 909 by\nreps of generally 85th Scott of\nthe 76 Davis 87 scope field the\n63rd limber the 98th Bill B.\nTodd and act to men titles 12 25 and\n33 the fish go to Georgia and\nSanta related to conservation\nand natural resources public\nsafety and homeland security\nHousehold 910 by reps and I'm\nhatching the hundred and fifty\nfifth of Bill B. Todd and act to\nMin total 50 the fish go to Georgia and 10 and relating to state government\nHigher education also 9-11 by reps that have come into 39th Bill B. Todd and act to a men chapter five\nA total 51 of the fish go to Georgia and and take it relating to libel and slander\nJudiciary hospital 9-12 by reps that are Wilkerson to the 38 Smith and the 41st card of the 93rd ballad of the 147 the Cox of the 28th and others\nBill Bitton, an act of men part 9 of Article 6, Chapter 2, Title 20.\nLee Fischko, the Georgia Annotated, Related to Grants for Educational Programs.\nEducation.\nHouse 1913 by reps and a Fleming of the 114th Gollum of the 19th Holcomb of the\n101st, Reeves the 99th, Crawford the 89th.\nBill Bitton, an act of men part 1 of Article 3, Chapter 5 of Title 50.\nLee Fischko, the Georgia Annotated, Related to General Authority, Duties and\nProcedure.\nGovernmental Affairs.\nHouse Bill 914 by resident of Lumpton in the 83rd Campbell in 35th coming since 39th and\nlimited the 98th, but billed be taught an act of men chapter 5 and title 34 of the\nFist Dakota Georgia antenna relating to sex discrimination and employment.\nIndustry and labor House Bill 915 by resident of Lumpton in the 83rd\nand limited the 98th, billed be taught an act of men, title 35 of the Fist Dakota\nGeorgia antenna relating to law enforcement officers and agencies.\nPublic safety and homeland security House full 916 by reps and I've luped under the 83rd and lima the 98th\nBill B. Todd and act them in Article 2 chapter 5 of Title 15 is the fish going to Georgia and Tana relate the judicial counsel\nJudiciary House well 917 by reps and have Jones the 25th and Hilton the 48th of Bill B. Todd and act to men chapter 2 titled 20 of the fish\nGo to Georgia and Tana relating elementary and secondary education\nEducation House Bill 918 by reps that have hilted to the 48th and Jones to the 25th\nBill B. Todd and act to men part 13 of article 6 to chapter 2, title 20 of the\nFisher go to Georgia and Taylor related to organization of schools and\nsystems. Education House Bill 919 by reps of the P3, the 166th\nBill B. Todd and act to men chapter 6 and a title 12 of the Fisher go to\nGeorgia and Tate and relating Outdoor Stewardship.\nGame, Fish and Parks.\nHospital 920 by Reps and a Roberts,\nthe 52nd Park of the 107 Jones, the 143rd,\nafter the 130th Miles, the 126th and others,\nBillie Towne, an act of men,\nchapter 8, it's all 35 of the fish\ngoing to Georgia and Tate and relating\nemployment and training of peace officers.\nPublic Safety and Homeland Security.\nHospital 921 by Reps and a Park of the 107th,\nQueen of the 61st bearing 56th, Howard of the 129th,\nHerring of the 145th and others,\nBill B. Todd, an act of men,\nArt Board of Chapter Two, a total 20\nfor the Fist Dakota, Georgia,\nAntana, Related, and State Board of Education.\nEducation.\nHouse Resolution 905 by resident of Canada,\n58th, Willis of the 55th base, more on 69th.\nJackson of the 68th,\nQueen of the 61st and others,\nResolution urging the Department of Education.\nEducation House for Resolution 947 by reps of Jasper's the 11th resolution creating the House Study Committee on five point marital station permit issuance\nTransportation House for resolution 948 by reps of Stevens the 164th Kelly the 16th Hawk is the 27th\nBuckner the 137th of the Newton of the 127th\nResolution creating a House Study Committee on Pharmacy Benchment Managers\nHilt, that completes First Readers.\nThe second reading the building resolutions occurred will read House Bill 883 by ribs of Jasper's of the 11th to bill relating to electric vehicle charging stations\nHouse bill 884 by ribs of Canada the 58th scope peeled of the 63rd to the 141st pended of the 94th Smith of the 18th to bill relating to the Department of Public Health\nHouse bill 85 by reps of Canada, the 58th Scofield, the 63rd Park of the 107th Crawford of the 89th.\nSmith of the 18th, the bill relating to the Department of Public Health.\nHouse bill 886 by reps of Evans of the 57th place, more of the 69th Miller of the 62nd Scofield, the 63rd Canon of the 58th.\nThe bill relating to general provisions regarding state government.\nHouse bill 887 by reps of Stevens of the 164th Sains of the 180th Hitchens of the 161st Ballard of the 147th.\nbill relating to electrical contractors, plumbers, conditioned air contractors,\nlow voltage contractors, utility contractors, residential and commercial contractors.\nGeneral House bill A88, by represent Carpenter of the fourth,\nbill relating to education, House bill A89 by represent the Sanchez of the 42nd Park of the 107th Sanchez of the 117th Barrier of the 56th Dany of the 110th and others.\nThe bill relating to general provisions regarding law enforcement officers and agencies.\nHouse bill 890 by represent Carpenter of the 46th Martin of the 49th black, one of the 146.\nBill relating to exemptions from sales and use taxes House bill 891 by reps of\nnames of the 148th hatchet of the 155th Carson of the 46th mix of the 178th\nroads of the 124th and others.\nA bill relating to the general to the Georgia state employees pension and savings plan.\nHouse bill 892 by reps of Holcomb of the 101st Buckner of the 137th Miller of the 62nd.\nEvans of the 57th Barrett of the 424.\nA bill relating to massage therapy practice House bill 893 by reps of Hilton of the 48.\nJones of the 47th power to the 147th rise to the 139th of the 29th of the 29th of the bill relating to education in House Bill 894.\nBy rep.\nThe welcome of the 101st black one of the 146 of bill relating to procedure for\nsentencing and imposition of punishment.\nHouse bill 895 by rep.\nThe extension of the 150th of the bill relating to the Georgia legislative retirement system.\nHouse Resolution 882 by rep.\nThe hatchet of the 150th or one of the 32nd.\nResolution proposing amendment to the Constitution says provide that local school systems can\nand collect the sales and use tax for maintenance and operation expenses.\nHouse Resolution 883 by Representative Stevens of the 164th Gamble of the 15th.\nSevalued 34th Park of the 100th St. of the 180th and others,\na resolution creating the House Study Committee on making Georgia the number one state for tourism.\nHouse Resolution 884 by Representative Gaines of the 120th Chaspers of the 11th,\nHilton of the 48th Green of the 154th, Dempsey of the 13th.\nA resolution urging increased state autonomy to allow for the creation of innovative solutions\nwho worked as incentives and reformed the social safety network programs through second\nAnd readers.\nReport of standing committees, Mr. Clerk, will you read?\nPerhaps Senator Ron Stevens of the 164th District Chairman of the Committee on Economic Development\nand Tourism submitted the following report.\nWe speak your committee on economic development and tourism.\nIt's at under its consideration the following resolution of the house.\nThe instructor me to report the same back to the house following recommendations.\nHouse resolution 883 do pass, respectfully submitted,\nreps of Ron Stevens from the 164th district chairman.\nI've said a parish of the 158th district chairman on committee on rules submitted the following report.\nBut speak your committee on rules.\nIt's at under its consideration following resolution of the house.\nThis is Dr. Metri reports say back to the House following recommendations House resolution 885 do pass respectfully submitted\nReps that have parish the 158 district\nChairman that completes the reading the reports of standing committees\nright.\nHouse will come to order, House will come to order, as we complete our 40 days, House\ncome to order. As we complete our 40 days, a lady that I've invited to come spend a few minutes\nwith us. I want to recognize her is our new labor commissioner, Barbara Rivera Holmes, who's\ntaken on their responsibility and so important our state and so important to all the folks in\nour state so members I want you to stand and well with me and welcome\nCommissioner Holmes here to the House floor we're so glad to have you there\nand congratulations look forward to working with you the ladies gonna share\nsomething with us well good morning everyone thank you so much for\nrecognizing and I'm looking forward to working with you you know I get\nSo I'm going to get sworn in today at three, and I've been telling folks if you're not busy, come on by, but I don't know that that's going to be the case, but at three o'clock\nI would love to see you down on the north steps. I just want to express my gratitude, of course, to our speaker, to the governor, to Mrs. Kemp, and to all my officers for their support.\nWe're very excited about this role, and I can tell you as a labor commissioner, I will lead your department into a new era that builds trust,\nFoster's collaboration and empowers all Georgians to work for development, job\nattainment, safe working conditions, and innovative service delivery. We have a\nphenomenal team of nearly 800 professionals and we're going to deliver for Georgia.\nI'm proud to serve our state alongside you and we'll look forward to your\nsupport today, tomorrow and 26, so that we can continue doing the work for our\nhardworking Georgians. Thank you.\nThank you so much.\nCommissioner, we look forward to working with you.\nThe House has always supported and been proud to be a part\nof what you do at labor and to support a great job for you.\nThanks for taking it all.\nMembers, we'll move on to morning orders.\nMembers, we're ready to move on to morning orders, moving on to morning orders.\nmembers will please take your seats out and if you can't take a seat we have a very\nspecial morning order I'm going to ask the members if you'll take about a minute for\nyour morning order this morning we're going to give some more time to the first morning\norder. Representative Carter is going to be recognized not yet. We want to\nget some more not yet. I'll ask the folks that are handing out the passing out\nthe budget right now if you'll just pause for just for a minute. Members I need\nyour attention and your respect for this morning order.\nAll members cease conversation.\nRepresentative Doreen Carter is recognized for a morning order, Representative Carter.\nMembers of the field stand.\nGood morning.\nThank you, Mr. Speaker.\nApril 4th, 1968.\nThe committee was to spend just for a moment.\nas\nrepresentative Williams always tells me the protocol is don't anyone be in front of the lady in the well\nAll right, everybody, take a step back.\nLady, we'll continue.\nThank you.\nApril 4, 1968, the hearts of America were broken.\nWhen it was announced, the assassination\nof Dr. Martin Luther King, Jr.\nAnd today, April 4, 2025, we want to remember him.\nAnd if we would take a moment, we have a video\nthat we would like to share with you\nand then acknowledge some guests.\nI just want to do God's will.\nAnd he is a lot of me to go up to the mountain.\nAnd I've looked over and I've seen the promised land.\nI may not get that with you,\nbut I want you to know the night.\nAnd we, as a people, will get to the promised land.\nSo I'm happy tonight, I'm not worried about anything, I'm not fearing any man.\nMy eyes have seen the glory of the coming of the Lord.\nlittle did we know that will be his last speech.\nAnd this excerpt that we've shown you\nwas, has been said that this was his permanent.\nI just want to do that.\nAmen.\nOf his death.\nAnd so we wanted to share that with you.\nAnd we have some guests in the audience that joined us\ntoday for this memorial.\nIf you would stand and be recognized.\nSo thank you and as we finish our last day of session that this is also an important\nday for our country and I think it was a turning point for our country and I hope as we\nWe continue through our this day that we remember where we've come from as we remember the\nlife and legacy of Dr. Martin Luther King because we do believe that we will get there in\nJesus name, man. I yield the will.\nThank you, River that the Carter. Thank you for\nfriends for being here. Thanks for that video. That\ncertainly reminds us of how important Dr. King and his\nwork was in our country. And for mankind, certainly the\nKing Center is a great memorial to Dr. King and the King\nfamily. So thank you for that. Thank you members. Okay members, I want you to try to hold it\njust as close as you can to one minute. Representative Ruralman is recognized for a morning order. Members,\nif you will move back to your seats, we'd be much appreciated. Lady wants to spend just for a moment\nshe has some friends joining her. Thank you.\nThank you, Mr. Speaker.\nColleagues, happy signing day.\nToday, I rise to honor the life and memory of the very reverend\nfather, Dor Shukri Mahloof.\nFather George was born in Palestine as one of almost a million\nPalestinian-necked-best survivors.\nHe endured the hardships of being orphaned and expelled from his\nhome in West Jerusalem in 1948.\nHe began his professional journey as an educator at the Greek\nCatholic School of Our Lady of Anunciation.\nof our Lady of Anunciation in Ramallah and later at the Ramallah Friend School.\nIn 1985, he answered the call to priesthood and was ordained in the Church of the Holy\nSepulchre.\nHe never stopped his ministry and he served as an adjunct retired priest at the Saint\nElias Antiochian Orthodox Church in Atlanta, Georgia.\nHis wisdom, humility and kindness touched countless lives throughout his ministry.\nOn a personal note, Father George was my constituent.\nHis support and kindness meant the world to me, and I miss him dearly.\nI'm honored that his family gave me his kufiya today to wear in his honor and in his memory.\nSo will you all please stand today?\nWe have his family, friends, allies, and that includes his son, his daughter-in-law, and\nhis granddaughters.\nThank you all so much for being here and for sharing your dad with us.\nI know it's not easy, it wasn't easy, but I am deeply, deeply, deeply grateful to him.\nThank you, Mr. Speaker, I yield the well.\nRepresentative Roberts, recognize for a morning order.\nRepresentative Roberts.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nThis morning I want to recognize Ladore Milter from Sandy Springs,\nfounder of the Empowerment Workshop, a nonprofit committed to connecting our\ndiverse communities through education and empowerment programs for our youth,\nsmall businesses, minority communities, and our seniors. LaDora in the Empowerment\nWorkshop organized in sponsor events across Atlantic such as the Juneteenth\ncelebration in C&D Springs, the Atlantic Caribbean Carnival International\nWomen's Day in Atlanta's first senior ball.\nShe is amazing.\nHer vibrant personality is contagious.\nWe are blessed to have her as a public servant in our communities.\nAnd I am honored to call her my friend.\nYes.\nHi.\nHi.\nYou're a busy lady.\nThank you for what you're doing in the community.\nAnd thanks for being here today with us this way.\nThank you.\nRepresentative Stetson has recognized for a morning order.\nRepresentative Stetson, give the lady your attention, please.\nThank you, Mr. Speaker, ladies and gentlemen of the House.\nI just want to quickly say that when I was first diagnosed with my received the notification\nof the cancer diagnosis, I was really upset to learn that all the treatment was going\nto have to take place while I was in session and I just really didn't want to have to\nto miss time away from session\nand I really didn't wanna have to go through all of that\ndoing session, but now at the end of session,\nMr. Speaker and colleagues, I am so grateful\nthat I did go through that time with all of you.\nBecause without you, I could not have made it.\nAnd this was a really tough time\nand each of you have been great to me\nand I'm so grateful to your prayers and your support.\nAnd I ask that you continue those prayers\nbecause I'm still on this journey.\nIt's not completely over,\nbut I do thank you.\nAnd quickly, my purpose for standing here today\nis to recognize the new sheriff of Making County, Georgia.\nMr. Carlo Spelton, if you'll please stand,\nMaking County is the home of our very own,\nthe late great Lynn Moore James,\nthey served in this house for 20 years.\nSo we're so glad to have the new sheriff\nof Making County, Carlo Spelton,\nand community activist Kimberly Davis.\nSo thank you all so very much and may God bless you.\nAnd just know I love you all.\nIt is nothing you can do about it.\nHa ha ha.\nWelcome, Sheriff.\nGood luck.\nWe appreciate your service.\nWe're going to see if you'll lend more James what a fine man he was.\nFine man.\nChairman Tyler Paul Smith and at least one friend, gentleman's recognized.\nThank you, Mr. Speaker.\nI scheduled to recognize that when I was John Marshall Law School Law Journal editors\nand members, they do such a great job for us every year.\nappreciate y'all being with us there in the gallery right there to y'all's right\nmembers. Let's welcome them here in the house.\nAnd Mr. McGregor last but not least. I'd like to introduce this house to TIFF where we're\nable to get him down here today and so for him to bring him down here and let y'all\nmeet him so anyhow I appreciate y'all's prayers during the time and\nappreciate everything y'all've done for Shannon and I during these eight weeks\nthank y'all for the bottom of our hearts\nI like that jacket of your pants on and outfit he's looking good and glad he\nlooks like his mama. They're done about that.\nGood to have you too, Shannon.\nThat's right. Talk to him, trash boy.\nThat's what I'm talking about. Leader of the\nillustration. He's recognized for a morning order.\nWell, thank you, Mr. Speaker. Last session, my beautiful\nwife, Ashley, illustration was here in the gallery and\nshe got to meet Chester Thresh. Chester is a\na resident in the city of Atlanta and he's unable to see but he comes every year to watch\nSonny die.\nHe's been coming for years to just hear the work that we're doing in the chamber and\nso she met up with him this morning and Mr. Thrasch is in the gallery here now and I just\nwanted to recognize him for being such an outstanding Georgian and coming back for another\nother sign he dies. Thank you Ms. Speaker, I yield the welcome.\nMr. Taylor.\nRepresentative Rhonda Taylor is recognized for a morning order and friends.\nRepresentative Taylor.\nThank you, Mr. Speaker.\nMr. Taylor, give me a second.\nYou got a lot of friends.\nI knew that.\nLady was a spin just for a moment.\nThank you, Mr. Speaker.\nThis morning, colleagues, I want to come to the well\nto recognize the Spellman College Glee Club.\nThey're celebrating their 100th anniversary today.\nYeah.\nThey will stand.\nYeah.\nThis Glee Club has a reputation for Coral Excellence and has been since 1924.\nThey have sung all over the country and in various other countries, if I can get it out.\nThey've traveled to Canada, Brazil, Italy, and most recently to Portugal, and they have\nperformed at the White House for President Obama and at the historic mother Emanuel A.M.E.\nChurch in Charleston, South Carolina.\nCollege please welcome them and greet them in happy 100th anniversary.\nIf you ladies will come down to the any room for photos please.\nThank you Mr. Speaker.\nNow, what a celebrated history, a hundred years, thank y'all for carrying on the tradition,\nand I'm certainly y'all are very accomplished, it's good to have y'all.\nIf you're coming down to the third floor of the South, get some photos, thank you.\nRepresentative Willis.\nRepresentative Willis, you got somebody coming with you?\nYes, one moment.\nGood morning, Georgia.\nOn this wonderful day, as we speak about the dream of Dr. King, it is my absolute honor\nto acknowledge the youngest certified farmer in the United States of America.\nThat is Miss Kindle Ray Johnson, a stand before you with the chairman of the\nAgriculture Committee. We would also like to congratulate you for being a\nmaize. Congratulations, thank you all. I hope you're much\nsuccessful in the future. We are extremely proud of you my sister and I look\nforward to meeting you down here for photos. We just wanted to recognize you and\nyour family. Thank you so much. Mr. Speaker, are you at the well?\nIt's pretty cool. Agriculture. Thank you. Thank you for being involved in\nthe act. Thank you. Come on down to the third floor and you can come down and certainly\na family can come down and get some photos with Representative Willis and\nthe Chairman of Ag, Chairman Dickie, Representative Sharper.\nThere's a lot of people here.\nThe Dicks to Sharper is recognized\na gentleman from Valdosta.\nHis hair matches his suit.\nToday, absolutely.\nOr his suit matches his hair.\nI'm not sure.\nPlatinum blonde.\nPlatinum blonde, you got that right.\nWe're together on that one.\nThe gentleman is recognized.\nIf you guys don't mind,\nWe passed the bill in the house regarding more safety for the ice cream trucks and everything.\nAnd we have the family of the young man, and you see the photo here,\nvery precious child. When I saw it, my heart went out because the simple thing is,\nI was looking at IG and I'm going to try to be brief.\nAnd as I was looking at Instagram and I saw this video of a young lady doing her\nchild's hair getting them ready for the funeral and I saw a lot of different\ncomments about the strength and I saw the strength in that mother sitting there\npreparing her child for the funeral with her hands. She's very talented\nwhat she does, but she was preparing her child for the funeral, and that just did something\nto me. And I want to get involved and say, you know, the strength of a mother like that\nis just unbelievable, but I know that women, for one, they do what they have to do no matter\nwhat. So I respect that I'm not going to read the entire thing, but I'm just going to read\na little bit of this, honoring the life of memory of Ocarian, the white\nPerry, and supporting further actions to improve ice cream\ntruck safety in Georgia and for other purposes. The state of\nGeorgia mourns the tragic loss of Ocarian, the white\nPerry, a beloved child whose life was taken too soon in a heart\nbreaking accident when a vehicle went around and stopped, I went\naround to stop ice cream truck and struck him. There's an\nopportunity to improve our ice cream truck safety by require in-hats signage and\nother morning signs to alert drivers to proceed with caution when passed next\nstop ice cream truck and we did that here in the house. In honor of a Corian\nDwight Perry this body is dedicated to exploring new policies that could\ninclude improved visibility measures and public awareness in initiative to\nencourage safer driving practice around ice cream trucks.\nNow therefore be resolved by the House of Representatives\nthat the members of this body join in honoring the memory\nof a Korean Dwight Harry expressing their deepest condolences\nto his family and express their support for legislative\nefforts that enhance ice cream trucks safety\nto prevent future accidents.\nSo be resolved that the House of the Clerk, the Representatives,\nis authorized and directed to make appropriate copies\nof this resolutions available for distribution to your family,\nof accordion to white parry, of state agencies\nand public and the press.\nSo we appreciate you guys being here, the whole family is here.\nWe thank you, and our heart continues to be with you.\nAnd forever with this Georgia House,\nWe thank you so much.\nThank you so much for being the strong woman\nand the kids.\nAll you guys, thank you so much.\nAnd let's do a brief moment of momela's silence, people.\nThank you.\nThank you, and thank you, Speaker.\nThank you, Representative Dexter Sharper.\nTo the family, I will continue to know\nthat this is our prayers are with you.\nSorry for your loss.\nAnd hopefully that this house stands behind that legislation.\nHopefully it gets across that finish line.\nBut we'll keep working.\nThank y'all, and y'all do as well.\nTake care.\nResident Chaz Cannon has recognized for a morning order.\nGive the gentleman your attention, please.\nThank you, Mr. Speaker.\nThank you, Mr. Speaker.\nI just want to quickly recognize my two girls\nand my lovely life just back from spring break.\nI just turned 15 and 14 last week.\nSo happy birthday to y'all, good to see you.\nWait to be home with you next week.\nI love you.\nWe love you.\nWe love you.\nWe love you.\nYou're the lucky man.\nGenerally, we'll suspend just for a minute.\nRepresentative Martinez, if you'll step back just for a moment.\nmembers I think you're going to like this one you've had several great morning\norders honoring some and offering condolences so I want to ask all of you to give\nyour attention to representative Martinez as he acknowledges a very special\nguest you have some people going to join you in the well represent Martinez who\nwould they be? Veterans and friends represent Mark John the\ngentleman representing Martinez is recognized for a more special\nmorning order. Thank you, Mr. Speaker. It is with distinct\npleasure. And he is a pong. He is here amongst us up in the\ngallery. Wait, Mr. Davis. Distinguished pleasure to\nrecognize James L. Davis, who was born March 31, 1923.\nThis past Monday, Mr. Speaker and colleagues, he turned 102 years old.\nNot only that, colleagues, I'm Mr. Speaker, Mr. Davis served in the U.S. Army as a World\nWorld War II veteran, valiantly and courageously protecting his fellow Americans during World War II,\nreceiving numerous awards for outstanding service and retiring in the rank of sergeant.\nDuring the civil rights movement, James L. Davis was broadly recognized for his leadership\nin bringing fair housing to black residents in St. Louis\nand he continues to serve faithfully\npatriarch to his church family and community.\nAgain, speaker and colleagues, help me congratulate\nWorld War II veteran, 102 years young,\nMr. James L. Davis, thank you.\nThank you for being with us Mr. James, thank you for your service, thank you for your\nlongevity and being engaged, it's paid dividends for lots of folks.\nSo thanks for being with us today and congratulations on many more good years as well.\nThank you members.\nRepresentative Eric Bell and friends is recognized for a morning order.\nOne second while my friends get here.\nThank you, Mr. Speaker.\ncolleagues, friends, y'all know what today is.\nIt is officially 404 day.\nAnd if you don't know, that's the story area code for Atlanta\nand the Metro Pilots in area.\nAnd what you say, and it is.\nSo we are honored to be privileged and joined\nwith the group of Atlanteans who are taste makers,\nboth in civil rights or education and culture and music.\nThey are here in the gallery.\nIf you would please stand while we briefly say your names\nand give you the flowers and honor, we have Charles Black,\none of the original signers of the appeal of human rights.\nKiboha Ali, Pastor Troy, young Jack,\nand before I go on, I'll have to get the microphone\nto my amazing sister, the chairwoman,\nthe Atlanta delegation.\nVery quickly, Atlanta is hallowed grounds.\nWe recognize each of you today\nfor your contributions to our culture,\nas well as to our environment from every space that you're in.\nI'd like to recognize Mr. A.J. Callaway,\nHoward University, Manned Media, Mogul,\nenvironmentalist to thank you for being here.\nDonna Matthews, thank you for being here with us today.\nWe recognize again our youngest farmer in the country.\nIf she's still up there, will she please stand and wait\nfor her coming out of there?\nNina Packer, my sister, my friend.\nThank you, me and Packer, family rattler.\nMichelle Willis, where is she?\nThere you are, my sister.\nWelcome to 404 Day.\nWe introduce this to the body,\nwhere we recognize just how special\nthe city of Atlanta truly is,\nbut as we continue to produce excellence worldwide.\nThank you, Mr. Speaker.\nWe yield the well.\nLadies, you, to the well, is that really your sister?\nOr your sister?\nNot my sister?\nBecause you're pretty, not your baby sister.\nA different kind of system, Mr. Speaker.\nI thought that was what you were saying,\nbut she is a will to speak.\nMy sister is just the same.\nI yield the well.\nIt works. It works.\nAdditionally, join us in Liberty Plaza for the 404-day block party celebrating signing\ndie and all these great people we just see Liberty Plaza, y'all.\ncoming in here to the well.\nThank you Mr. Speaker. Good morning everyone. If you have ever attended an Atlanta Hawks game, I know you were up at your seat on that dancing meter. I know you were having a good time and that is probably because\ngood time and that is probably because of Mr. Hanky. He is the in-game producer for\nthe Atlanta Hawks. He also cares a lot about the community and always gives back.\nWe just want to thank you for mentoring young artists. We want to ask you to stand and\nask you to continue doing the work that you are doing in this competitive\nmusic industry here in Georgia. We honor you and we celebrate you today.\nThank you, Mr. Speaker.\nCongratulations.\nThank you, Representative Cannon.\nThank you.\nCool experience going to the Hawke's game by men.\nSo it's thanks for what you do.\nIt's a great experience.\nThanks for what you're doing in the community as well.\nThank you.\nMembers, we're going, we'll take up some agrees and maybe even some disagrees.\nRepresentative Bruce Williamson has recognized for a motion.\nI can just speak or I move that the House except the Senate substitute to House Bill 586.\nMr. Clerk, will you read the caption?\nHouse Bill 586 to be tied to a men article three, chapter six, title 48.\nI believe if you go to Georgia annotated relating the intangible recording tax it was revised the note for which such taxes imposed\nChairman Williamson is recognized explained this Senate substitute to House Bill 586\nThank you, Mr. Speaker colleagues if you recall House Bill 586\nSimply let me back up a second so right now under the current Georgia code if you borrow money\nIt is secured by a deed to secure debt for over three years.\nThere's a $3 per 1,000 recording tax.\nThis bill simply moves that exemption period from three years up to 62 months,\nwhich is five years and two months.\nThe happy answer in the question is not Mr. Speaker, I'll yield the well.\nThe gentleman has no questions.\nThank you.\nAll the gentleman's motion that the House agreed to the Senate's substitute to House Bill 586, House Bill 586, all those in favor, but yes, those opposed will vote no in, Mr. Clerk, will you unlock the machines?\nWe have all members voted.\nAll members voted if so, Mr. Clerk.\nWhen you lock the machine on the general's motion, the yeas are 161, the days are zero.\nAnd this house has agreed to the Senate's substitute to House Bill 586.\nChairman Rees is recognized for a motion.\nChairman Rees, excuse me, representative Rees, I was giving you a promotion.\nThank you, Speaker Burns.\nI move to agree to the Senate substitute for House Bill 131.\nMr. Clerk, will you read the caption?\nHouse Bill 131 to be entitled back to a men article 5 of chapter 4, title 10 of the\nFisher go to Georgia and tell you relating to self-service storage facilities.\nRepresentative Reeves is recognized to explain the Senate substitute to House Bill 131.\nThank you, Speaker Burns.\nHouse Bill 131 unanimously passed the House.\nThis bill brings a self-storage industry in line with 30 other states.\nThere were some articulate business women who came in and represented the 15 self-storage units.\nThe Senate Committee made a minor amendment pertaining to boats and RVs and campers and vehicles that are sometimes at storage units.\nThat's it. That is the only change.\nIt was a grieble to all parties involved and I would request your favorable support.\nWe have a couple of questions if you'll take them.\nI will, Mr. Speaker.\nMinority leader Hewglie to your left out front\nis recognized for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nTo the leader I do.\nThank you so much.\nI've got a concern that was sent to me in the true\nthat if three independent bidders attend the sale\nat the time and place advertised,\nit's need to be commercially reasonable.\nIs that still in the spill?\nIt is the three bidders, that is longstanding law.\nThe sale cannot be finalized until you have at least three bidders.\nAlso, all of the notice provisions, the due process to the delinquent customer,\nthose are not changed whatsoever in this bill.\nThis bill merely adjusts the advertisement procedures to bring in line with 30 other states.\nAnd what is the advertisement requirement, if you don't mind?\nto commercially reasonable so you can run a newspaper out,\nyou can run online, you can do social media,\nyou can do advertising through, you know,\nplacing signs out there for regular sales.\nSo there are a variety of ways it's done,\nbut they've got to get at least three bidders\nfor the sales.\nMr. Speaker, if there are two.\nRimsley Park, Ken and Rick and I have a little question.\nAll right.\nThank you, Mr. Speaker.\nYou yield to the representative. I do thank you. What impact does this have on urban business owners?\nIt has a positive impact on urban business owners as well as the customers of self-storage because\nThis outdated procedure that Georgia has on the ads if you have a delinquency in a unit it delays\nFilling that unit up to a paying customer and also if you think about the customers of self-storage\nYou have senior citizens, people who have gone through divorce, students, other people who are on the move, and this red tape that we've got in this area that 30 other states have improved on, that will save money if we change it to bring it into national standards. It's good for consumers.\nThank you.\nIf you release the camels, recognize for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield to the representative I do?\nThank you.\nI just wanted to clarify, it looks like one other change to me\nonline, 116, that the notice of advertisement\nactually has been reduced to once versus once for two weeks.\nCorrect, absolutely four.\nAnd that is something to clarify for boats, RVs, vehicles,\nthings like that that you've got to give notice for.\nThey're still as a newspaper ad required one time.\nThank you.\nThank you.\nGentlemen, has there further questions?\nAre you the well?\nJim was you to the well.\nOn the Jim was motion to the House agree\nto the Senate's substitute to House Bill 131.\nAll those in favor will vote yes.\nAll those opposed will vote no.\nAnd the clerk will unlock the machines.\nMr. Speaker, I request to be excused from this vote, according to rule 133.\nThe gentleman has that right and the journal will so reflect.\nHave all members voted, all members voted if so, Mr. Clerk, where you lock the machine.\nAll the gentleman's motion, the yeas are 163, the nae is one.\nThe house has agreed to the Senate's substitute, the house bill 131.\nRepresentative Rob Leveritt is recognized for a motion, Chairman Leveritt.\nThank you, Ms. Speaker.\nI'm hoping to have the cheat sheet up there on the screen, but I believe what I'm doing is moving to agree to the Senate substitute the House Bill 36.\nMr. Clerk, will you read a caption, House Bill 36, correct?\nHouse Bill 36 to be entitled, an act to amend title 29 of the Fisher go to George Antony relating to guardian and awards.\nIt was revised list of providers who are authorized to participate in the processes for appointment of a guardian for an adult.\nWe're representative Liberty is recognized to explain his motion.\nThank you Mr. Speaker.\nLadies and gentlemen, this is the bill that would add a number of professions to the list of\nthose that can provide an evaluation in a guardianship or a conservatorship proceeding.\nYou remember there was a lot of drama on the floor as the representative Evans I had\nan interesting exchange on this bill.\nI believe House Media Service is going to set that video to doing banjos to make a good\nsoundtrack with it, but I believe I've addressed all of her concerns.\nWhat I have done is added provisions that make it clear that the proposed ward, that\nis the person who would be the subject of the guardianship or conservatorship, can it\nany time challenge the qualifications, experience or manner of the performance of the evaluation\nduring the hearing or at the outset of the proceeding\nto stop it from going forward.\nAdditionally, for the Council on Developmental Disabilities,\nwe added some language that made it clear\nthat adult mental disability itself\nis not a reason for granting a guardianship.\nAnd finally, in the Senate, they made an amendment\nthat removed marriage and family therapists\nfrom the list of those who can do the evaluation\nso that profession is no longer included in the bill.\nWe believe this is essential legislation.\nWe really want to get it passed this year\nso that the backlogs in these cases can be addressed,\nand the probate judges can find qualified people\nwho perform these evaluations,\nso I'd ask for your favorable consideration of the bill.\nGentlemen, you?\nYes, sir.\nRepresentative Evans, Taci Evans to your left,\nis recognized for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nYes, I do.\nIsn't it true that I really appreciate you working\nwith me and us being able to work through some changes\nto make this bill better?\nI would hope that's the case,\nbecause that's certainly how I feel.\nI appreciate your engaging on it with.\nThank you.\nWill you yield for one more?\nYes, ma'am.\nIs it also true that throughout this process,\nI think we've both learned, or at least I have learned,\nthat our probate judges need a lot more support from us\nand help, and I look forward to working in the off season\nto try to help their job be a little bit easier\nfor the citizens of Georgia.\nThe lady knows of what she speaks,\nand I look forward to that collaboration also.\nThank you.\nThank you.\nRiverside Park, Ken, does lady have a question?\nYes, ma'am.\nThank you, Mr. Speaker.\nDo you yield?\nThank you for this legislation. Would you agree that this does not expand the scope of practice of a nurse practitioner\nBut it does recognize their expertise\nAbsolutely, that is precisely correct. Thank you for that question\nGeneral has no further questions. Thank you, Mr. Speaker. Ladies and gentlemen, I ask your favor\nSupport of the motion with regard to House Bill 36\nOn the gentleman's motion that House agree to the Senate's substitute to House bill 36 all those in favor\nYes, those opposed will vote no and Mr. Clerk will you unlock the machines?\nWe have all members voted, all members voted if so, Mr. Clerk, will you lock the machines\nAll in the gentleman's motion, the yeas are 165, the nays are two.\nThis house has agreed to the Senate's substitute to House Bill 36.\nRepresentative Leverd has recognized for a motion.\nHello again, Mr. Speaker.\nI move that the House agreed to the Senate's substitute to House Bill 37.\nMr. Clerk, will you read the caption?\nHouse bill 37 to be entitled back to amend sub part two, part six, particle six to chapter two, titled 20, the physical to Georgia and Tate relating to conditions of employment in elementary and secondary education.\nMr. Chairman, liberty is recognized to explain his motion.\nThank you, Mr. Speaker, ladies and gentlemen, this was the bill from last year that we\ntry to get this year that simply requires school districts to provide notice to employees\nconcerning whether self-security is being withheld, because as you may recall from the initial\ndiscussion, school districts are not required to participate.\nSome of them do.\nSome of them don't.\nThere's differing practice across the state.\ntrying to make sure that our school district employees\naren't met with any unpleasant surprises upon retirement.\nOver in the Senate, they did make one change.\nThey added a provision concerning that is not mandatory.\nIt just authorizes school districts\nwho are providing insurance to their board members\nthat they can also provide family coverage\nto those board members, you know,\nunder whatever terms, requiring the family to pay in\nor the board member to pay also.\nIt's not mandatory, it's simply permissive\nand it's intended to provide statutory authorization\nfor a practice that's already in existence.\nSo we are fine with that amendment.\nI will ask you to support the motion.\nI'll be answering your questions.\nGentlemen has a question or two,\nrepresent a berry of the center aisle just to your left.\nGentlemen's recognized.\nThank you.\nThank you for speaking to the gentleman, you.\nYes, sir.\nIs this done anywhere else in the country?\nIt's kind of bureaucratic burden of reporting every five years\nthat there are anywhere else in this country\nis just the first nation trying to be in Georgia.\nAnd I'm sorry, I cannot understand the question.\nWas this, is this kind of law done anywhere else in this country,\nor is this just a Georgia-specific issue?\nI'm not aware that other states have the original law\nthat was in the original bill.\nThis was, I guess, this is our innovation.\nOkay, thank you.\nWe're up to the burden now.\nTo your left is also a recognizable question.\nLadies recognized.\nThank you, Mr. Speaker, that's gentleman you.\nYes, ma'am.\nNow when would they have to let the employees know?\nWell, the bill tries to be fairly specific.\nUpon hiring, they have to be notified whether the school district is going to be withholding.\nIf they do not, they have to notify the employee of some other available plans that would provide sort of a replacement if you will force those security additional retirement plans.\nThen they've got to give them notice periodically through employment every five years.\nAnd then at termination, they have to say whether they withheld or not.\nThank you.\nSo we're hoping they'll get the message with this one.\nGentlemen, you, for one more historical question,\ngentlemen, was there where they created Social Security\nto your left, Representative Williams,\nhas recognized for a question.\nThank you.\nThank you.\nI appreciate you letting me in the door, when I got there.\nTwo shades.\nWell, the gentleman, you-\nYes, sir.\nIs it not true that over the last twenty or thirty years, though there was some initial\nresistance. Minimum tied teachers are very glad that they signed up for so\nsecurity because those that didn't left a lot of money on the table. I'm sure\nthat's the case. Thank you for the question.\nGentlemen has a further question and that gentleman knows of what he speaks to\njust ask that question for sure. I want a serious note. Yes. Miss Bigger I\njust asked the body statement of consideration all year the well.\nand gentlemen as you order the well.\nOn the gentleman's motion that the House agree\nto the Senate's substitute to House Bill 37,\nall those in favor will vote yes.\nThose opposed will vote no, and Mr. Clerk,\nwill you unlock the machines?\nHave all members voted?\nAll members voted if so, Mr. Clerk, were you locked the machines?\nAll the Germans motion, the Yees are 163, the Nays are zero, and the House has agreed\nto the Senate's substitute to House Bill 37.\nbut the deflemming has recognized for a motion.\nThank you, Mr. Speaker.\nI move that the House agreed to the Senate substitute\nto House Bill 150.\nMr. Clerk, will you read the caption?\nHouse Bill 150 to be entitled\nto amend part two of Article II,\nChapter 3, Title 20,\nthe official code of George Antony\nrelating the university system.\nSo it's required a quarterly reports regarding certain\nfunding received from individuals\nor entities related to China.\nMr. Speaker, as you all recall, House members, HP 150 deals with funding that comes from\nforeign countries of concern to our higher education institutions, requires institutions\nto report to this body, the Senate and the governor, what those funds are and where they\ncome from.\nIn the Senate, they changed the reporting dates from quarterly to twice a year to align\nwith other reporting that the USG system schools have,\nand set the cap at $1,000 for any contribution\nof $1,000 to be reported,\nand explain for what those dollars are for.\nJust to remind you, this does not pertain to any tuition\nfrom individuals from these countries,\nit's just other funding.\nAnd with that, Mr. Speaker,\nI'd have you taking questions or I'll yield the well.\nGentlemen's has a couple of questions of your yield.\nYes, we'll park right in front of it to your left\nas we recognize for a question.\nThank you, Mr. Speaker.\nIs it not true that I am concerned about the Senate amendment that reduces the amount\nfrom 50,000 to 1,000 precisely because in committee we were talking about the burden\nthis would put on our USG, TCSG institutions, in which case due to this amendment I would\nencourage all members to vote no. Is that not true?\nI know that you're concerned, yes sir.\nThank you, Mr. Speaker, as a gentleman yield, is it one thing that we have been discussing\nabout this bill is my concern that when we keep our focus so narrow, we might actually\nmiss the force for the trees.\nIn this particular instance, by only focusing on a few countries, we actually don't have\nan idea of where any other foreign investments might be coming from, and that my hope is that\nThe bills like this would be more broad to actually deal with the issue at hand here.\nYes, the lady not have to discuss that, thank you.\nMr. Speaker, I'll yield the way.\nRepresentative Jasmine Clark was recognized for a question.\nAlready had her button pushed if you don't mind.\nYes, sir.\nThe lady's recognized.\nThank you, Mr. Speaker, to the gentleman you.\nYes, ma'am.\nI guess to add on to the question asked by my colleague with Park, what was the Senate's reasoning for\ndecreasing the cap from 50,000, which we thought was reasonable because it would not be as\nburdensome to our USG systems, to the 1,000, which could probably trigger a lot of work,\nadministrative work for someone in USG.\nOr if you recall, my original bill that was in committee, we didn't have any cap on it.\nIt was zero cap, so any figure coming from any funding coming would be happy or reported.\nI'm not so sure what they're reasoning for, but my original bill had had no cap on it.\nAll right, thank you.\nGeneral Houser for the questions.\nThank you, Mr. Speaker.\nI ask for your favorable consideration for HB-150.\nThank you.\nThank you for your explanation.\nOn the General's motion, that House agree to the Senate substitute to House Bill 150, 150.\nAll those in favor will vote yes.\nThose opposed will vote no, and Mr. Clerk, will you unlock the machines?\nAll members voted, all members voted if so.\nMr. Clerk, will you lock the machine?\nOn the gentleman's motion, the yeas are 98, the nays are 64, and the House has agreed to the Senate's substitute to House Bill 150.\nChairman Todd Jones has recognized for a motion.\nMr. Speaker, I move that the House agree to the Senate amendment of House Bill 156.\nMr. Clerk, will you read the caption?\nHouse Bill 156 to be entitled an act to amend chapter 1 of Title 6 of the Fishercoded\nGeorgia Annotated relating the general provisions relative to aviation so as to provide the Department\ntransportation with authority over verteports.\nChairman Jones is recognized to explain the Senate amendment to House Bill 156.\nThe general is recognized.\nThank you, Mr. Speaker.\nMembers, this is a simple amendment that the Senate add on to the, on 156, 156 voted out 162 to 7.\nThe Senate, as amended, voted out 53 to 0.\nThe base bill effectively put vertiports into the code.\nThe amendment allows for the local tax development authority to be able to expand the use of that tax into air service product expansion.\nBasically looking for a second airline into the Brunswick Airport.\nThat is the amendment, Mr. Speaker, and I'll stand for any questions.\nGentlemen, ask no questions.\nThank you, sir, I yield the well.\nOn the general's motion, that the House agreed to the Senate amendment, the House bill 156.\nAll those in favor.\nI got it.\nWe'll vote yes.\nThose opposed, we'll vote no, and Mr. Clerk, will you unlock the machines?\nAll members voted if so, Mr. Clerk, were you locked the machines?\nAll the gentleman's motion, the yeas are a 159.\nThe nays are three, and the House has agreed to the Senate amendment to House Bill 156.\nRepresentative Wade is recognized for a motion.\nThank you, Mr. Speaker.\nI make a motion that we agree to the Senate substitute to House Bill 105.\nMr. Clerk, will you read the caption?\nCouncil 105 to be entitled back to amend code section 45 978 the fiscal to Georgia antenna relating to payment of a debt of indemnification for death or disability.\nThe representative way just recognize to explain his agreement to the Senate substitute.\nThank you Mr. Speaker, ladies and gentlemen, this is Governor Kimps, one of his priority\nlegislation, the Indentification Fund where we increase teachers from the 75,150.\nThe Senate wanted to ensure that we had new language that essentially will direct the\nState Board of Workers' Compensation that each law enforcement agency of the state\nto notify an injured peace officer of the Georgia State Indentification Fund so that\nwe had those two agencies communicating.\nthe Senate amendment, the Governor's\nin agreement until my\nask for your favorable consideration.\nGentlemen, has no questions.\nThank you.\nGentlemen, as you were to the well, on the\nGeneral's motion, the House agreed to\nthe Senate's substitute, the House bill 105.\nAll those in favourable vote yes.\nThose opposed will vote no, and Mr. Clerk,\nwill you unlock the machines?\nAll members voted for what purpose the representative panic tries.\nYou're computer must be sitting on your button I guess because your lights lit up unless your neighbors did that to you\nThat happens on day 40\nHave all members now voted. If so, mr. Clerk, will you lock the machines?\nOn the gentleman's motion the yeas are 164 the nays or zero and the house is agreed to the Senate substitute to house bill 105\nChairman Tyler Paul Smith is recognized for a motion\nThank you, mr. Bigger. I move this house agree to the Senate subject to house bill 179\nMr. Clerk, well you read the caption house bill 1790 be titled back to event article two chapter six and title five\nThe fish go to Georgia and Teddy relayed the appellate practice so it's the revised for the digital recording of certain trial proceedings\nWe'll explain the Senate's substitute to House Bill 179.\nCertainly, Ms. Speaker.\nLadies and gentlemen of this August's body, I bring to you this substitute.\nThe only change that was made was to remove the language that would have allowed for digital\ntakedown of depositions.\nThat's it.\nSo, Ms. Speaker, if there are no questions, I'll yield and ask that this House agree to\nthe Senate's substitute.\nfrom the House, no questions.\nThank you.\nGeneral is yielded the will on the General's motion\nthat House agreed to the Senate's substitute\nto House Bill 179, all those in favor, we'll vote yes.\nThose opposed, we'll vote no.\nAnd Mr. Clerk, will you unlock the machines?\nAll members voted, if so, Mr. Clerk, were you locked the machines?\nOn the gentleman's motion, the yeas are 167, the nays are zero, and the house has agreed\nto the Senate's substitute, the House bill 179.\nChairman Hawkins has recognized for a motion.\nMr. Speaker, I'd like to ask for HB197\nagreed to the Senate's substitute.\nMr. Clerk, will you read the caption?\nHouse of 197 to be entitled to men code section 33,\n46, six of the officials go to Georgia and Tadda\nand your requirements for certification utilization\nof nationally recognized accreditation standards.\nChairman Hawkins has recognized to explain\nthe Senate substitute to House Bill 197.\nThanks, sir.\nYou know, 197 passed Senate Committee,\nwell, House Committee, the House floor, Senate Committee,\nand Senate floor unanimously in all four bodies.\nThe Senate has added, and that was a peer to peer, the Senate has added a prior approval,\nwhich also increases access and decreases delay to health care.\nThat passed the Senate with only one vote against this House floor in its present, in its\nSB form, with only two votes against, asked for the House to adopt the, and agreed to\nthe Senate's substitute of House Bill 197.\nGentlemen, I was a question if you're yielding.\nI will.\nRepresentative Jasmine Clark to your left\nhas recognized for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI do.\nI think, thank you, Mr. Chair.\nMy question is on section two since that was added.\nAnd I don't know if it, if we actually got to vote\nfor that on that house floor.\nCan you kind of just expound?\nWhat exactly does the prior authorization language do in this?\nWould you repeat the question?\nI couldn't quite hear you.\nYes.\nIn section two, you said that the Senate voted it out,\nbut I don't know if you said that we voted\non section two of this bill in the House.\nYes, we did.\nThat was Senate Bill five.\nSenator Kirkpatrick's bill.\nAnd it passes House floor with one descending vote.\nOkay, thank you very much.\nYou just said they found, excuse me, too.\nThank you very much.\nThank you.\nGentlemen, has no further questions.\nSir, you have no further questions.\nYou can, you will.\nWell, he's yielding the well.\nIt's a good thing on day 40.\nOn to gentlemen's motion to the House agree\nto the Senate's substitute to House Bill 197.\n197, all those in favor of vote yes,\nthose opposed will vote no, and Mr. Clerk,\nwill you unlock the machines?\nAll members voted?\nAll members voted if so, Mr. Clerk, were you locked machine?\nOn the Jimless motion, the A's are 162, the Nays are zero, and the House has agreed to the Senate's substitute to House bill 197.\nA representative haung is recognized for a motion, a representative haung.\nThank you, Mr. Speaker.\nI move that this House agree to the Senate amendment to House Bill 217.\nMr. Clerk, will you read a caption?\nHouse Bill 217 to be entitled to amend Article 6 of Chapter 4, Title 20 of the Efficiency\nCode of Georgia, and attend it relating to the dual achievement program.\nSenator Hong is recognized to speak to the Senate amendment to House Bill 217.\nThank you, Mr. Speaker.\nThe Senate amendment adds two different provisions.\nOne has to do with immediate family members serving on local boards and\nthere's a specific date when it comes to current enrollment for waiver of that.\nessentially deleting that and making sure that the account is the current\ncount. The second provision has to do with the Promise Scholarship accounts and\nallowing the Education Savings Authority to gather information directly from\nthe Department of Revenue when it comes to the relevant income threshold. I\nI ask for your favorable consideration, or agree.\nLady has no questions.\nThank you.\nI hear the well.\nLadies, you're the well, on the ladies' motion,\nthat the House agreed to the Senate amendment\nto House Bill 217.\nAll those in favor will vote, yes, those opposed.\nWe'll vote no.\nAnd Mr. Clerk, will you unlock the machines?\nI have all members voted all members voted take your time\nAll members now voted, if so, Mr. Clerk, will you lock the machines?\nOn the ladies' motion, the A's are 143, the A's are 22, and this House has agreed to the\nSenate amendment to House Bill 217.\nRepresentative Clifton has recognized for a motion.\nRepresentative Rob Clifton.\nThank you, Mr. Speaker.\nMy motion is to agree to the Senate amendment for HB308.\nMr. Clerk, will you read the caption?\nHouse Bill 308 to be entitled,\nand act to amend, title 40,\nthe fiscal to George Antony relating motor vehicles\nand traffic, so as to revive for the operation\nof miniature on-road vehicles on certain highways.\nRepresentative Clifton has recognized to explain the Senate amendment.\nJim was recognized.\nThank you, Mr. Speaker.\nLadies and gentlemen, we're back with the mini-truck bill.\nThe Senate and all of its wisdom decided to add a few pieces to this bill.\nThe first is current law states that if you are caught road racing or I believe they\nthey called it, doing donuts, reckless driving, law\ncurrently allows your vehicle to be impounded permanently\nor crushed.\nThis amendment, however, allows the judge's discretion\nto add a governor device to your car that limits you\nto only 20% over the current speed limit.\nThe other amendment in here is a representative's amendment\nare bill earlier that allows it for when people are pulled over for speeding for a\nde-escalation aspect of the law to not have to sign the ticket.\nThey will, the ticket will put on their refusal to sign and that is the general of the amendment.\nThe gentleman has a couple of questions if you're yield.\nYes sir, I'll yield for one question.\nChairman Parsons was first to your left as recognized for a question.\nSpeaker. It's gentleman yield. Yes, sir. Yes, sir. I would just like to ask you. I think he said to one of the\nChains they made in the Senate was they had a provision that a driver could add a governor\ndevice to his car. Is that correct? It would at the judge's discretion, instead of having their car\nimpounded permanently or again crushed and destroyed, they can have a governor added to it so that\nthey can get their car back but will be limited to the speed that they can drive. Would you further yield?\nYes, sir. I'm just curious isn't it true?\nHow\nHow available or what kind of process you have to go through to get a governor\nI've never we I've never looked for one, but are they readily available? Are they very expensive?\nI'm not aware but I do believe that anything would be better than having your car lost forever\nIf the cost of the product is more expensive than the car itself\nYou're more than welcome to decline and have your car taken away from you\nbut this is just another option in order for people to keep their car instead of having to take it away.\nWell, if you, I would, isn't it true, it just seemed like before you vote on something we shouldn't know what kind of\nexpensive it would add to somebody in case that they did have to or if it made some kind of a problem for a family or\nwhatever because a lot of times, you know, it's not just the individual or his individual family, but his parents and\ngrandparents have to pay for these things.\nIs that not true? Thank you.\nYes, sir.\nGentlemen, you yield one more question. I think I can get the answer to that question. Yes, sir\nI'll yield for one more question\nRepresentative Jason Ridley's has some experience here limited to speed\nI think he might know how much it costs Jim was recognized for a question is gentleman yield. Yes, sir\nIs it not true that the device is a new device that just came out almost kind of like the one that they do on a DUI?\nWe do a breathalyzer\nBut what this right here does is it's attached your car\ncar and it's a couple hundred dollars a month that most and what that does is the judge\ncould make you make you have it on there for three to six months and then you be able\nto keep your car and be able to get back for the work.\nAbsolutely.\nAgain, this is an alternative instead of having your car gone forever and never having\nit back.\nThis is alternative to being able to keep your car and drive a limited speed limit.\nThank you.\nThank you, sir.\nWith that, Mr. Speaker, I'll yield the well.\nGentlemen's yielded the well.\nOn the General's motion, the House agreed to the Senate of Amendments to House Bill\nthree or eight all those in favor will vote yes opposed vote no and Mr. Clerk will you unlock the machines\nHave all members voted for what purpose is representative Neorah's\nProbably to inquire stitch inquiry is not true that it is a pleasure to partner with the author\non this bill to add the Travis signature bill that passed out of this house unanimously,\nnot too long ago.\nI want to agree with the lady, I hear everything she said, but I do agree with her about 99%\nof the time, so I'm sure the lady knows of what she speaks, have all members now voted,\nall members voted, if so, Mr. Clerk, will you lock the machines?\nOn the gentleman's motion, the Yays are 104, the Nays are 60, and the House has agreed to the Senate Amendment to House Bill 308.\nThe chair-led edimpsy is recognized for a motion.\nWe represent edimpsy.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate substitute to HB 567.\nMr. Clerk, will you read the caption?\nHouse Bill 567 to be entitled to act to amend Article 2, Chapter 11, the Title 43, the\nfish go to Georgia, and it's related to licenses for the practice of dentistry.\nRepresentative Dempsey is recognized to explain the substitute, ladies recognize.\nThe only change that was made in this was made in committee and made by the House actually\nto a small amendment to support the work of the Department of Public Health, the work\nthat they are doing in safety net locations today.\nAnd this is the bill to authorize and regulate the practice of teledinistry by Georgia, licensed,\nDennis and hygienists through the Board of Dentistry.\nIt passed the House 175 to two.\nSo I ask that you agree to this as written.\nLady has no questions.\nThank you, Mr. Speaker.\nI yield the well.\nLadies, you're the well.\nOn the ladies' motion,\nthat the House agreed to the Senate's substitute\nto House Bill 567, all those in favor will vote yes,\nthose opposed.\nWe'll vote no, Mr. Clerk,\nwill you unlock the machines?\nHave all members voted, all members voted this slow.\nof all members, vote of this little Mr. Clerk,\nwhere you like the machine.\nOn the latest motion, the yeas are 165, the nays are two,\nand the house has agreed to the Senate substitute\nto House Bill 567.\nWhere Representative Gunther is recognized for a motion,\nChairman Gunther.\nThank you, Mitch Speaker.\nI move the House agreed to the Senate substitute to House Bill 582.\nMr. Clerk, will you read the caption?\nHouse Bill 582 to be entitled back to event title 1617 and 24 of the fiscal to Georgia and\nit ended relating to crimes and offenses criminal procedure and evidence.\nChairman Gunther has recognized to explain the Senate substitute to House Bill 582.\nThank you, Mr. Speaker.\nThis is the bill that gives defendants who are victims of abuse,\nthe opportunity to present that evidence in defense of the crimes that they're charged with.\nWe worked with the prosecutors and made changes that satisfied them.\nAnd then the Senate added House Bill 384, which passed out of here, I think unanimously.\nWhich was defining the violation of oath for police officers to only felonies and\nmisdemeanors of high, of high and aggravated nature.\nStand for any questions.\nGentlemen, have some questions.\nOkay.\nNo questions?\nNo questions.\nNo questions.\nYou do a great job.\nOn the gentleman's motion that the House agreed to the Senate\nsubstitute to House Bill 582, all those in favor will vote.\nYes, those opposed will vote.\nNo, Mr. Clerk.\nWill you unlock the machine?\nHave all members voted, all members voted this so, Mr. Clerk will you lock the machine\nOn the gentleman's motion, the yeas are 164, the nays are zero, and the House has agreed to the Senate's substitute to House Bill 582.\nChairman, Jasper's is recognized for a motion.\nThank you Mr. Speaker.\nSpeaker, I'd like to make a motion to agree to the Senate substitute to HR 7 as amended by the House.\nMr. Clerk, will you read the caption?\nHouse resolution number 7, a resolution honoring the life of Mr. George, a seat, true Locke Jr.\nin dedicating a road in his memory.\nChairman Jasper has recognized to explain the Senate substitute and the as amended by the House.\nOkay, thank you Mr. Speaker.\nIf you look on your desk, you'll see an amendment\nwith my name on it, the 11.\nWednesday you heard our chairman, Prince,\nread off our road naming bridge bill, had 19 on it.\nIt should have had 20.\nI forgot one.\nHR 328, my representant of Bernal,\nand I apologize, and I'm asking you to amend HR 7\nand by adding her language into that bill.\nH.R. 328 honors chief Jeffrey E. Turner, by naming a portion of I-75 in Clayton County in his honor.\nThank you, Mr. Speaker, to help you vote with me to fix my mistake.\nWe all do it, Mr. Chairman, every day, and then you don't do it very often, but.\nNo, tell Mr. Jasper's.\nI understand.\nGentlemen, Jeal to the Wheel, he had no questions.\nIs there any objection to adoption of the House Amendment?\nHearing none, the House Amendment is adopted.\nOn the gentleman's motion, the House agreed to the Senate's substitute to House Resolution\n7 as amended by the House.\nAll those in favor will vote yes.\nAll those opposed?\nNo, Mr. Clerk, will you unlock the machines?\nHave all members voted?\nAll members voted if so, Mr. Clerk, will you lock the machine?\nOn the gentleman's motion, the yeas are 166, the nays are zero, and the house is agreed\nto the Senate's substitute to house resolution 7 as amended by the house.\nIf these sayings is recognized for a motion,\nrepresentative sayings.\nThank you, Mr. Speaker, a motion to agree\nto the Senate amendment to the House amendment\nto the Senate substitute of House Bill 266.\nMr. Clerk.\nHouse Bill 266 to be entitled back to amend Article 2,\nchapter 7 of Title 48.\nif they should go to Georgia and attend a relay in the positionary computation exemptions\nand credits for state income tax.\nRepresentative Sains is recognized to explain the sin of the amendment.\nThank you, Mr. Speaker.\nNothing is changing with the first section of the bill, which this House and many members\nhave worked on to virtually fully eliminate veteran income tax in this state.\nBut there's one number change online, 92 of this bill.\nIt deals with the police foundations that we've also added to this bill.\nIt just modifies 75% of total tax liability for that credit to, sorry, eliminate 50% and back to 75%.\nThat is the only change in the bill, Mr. Speaker, and I'll yield.\nGerman has no questions either, so he can yield.\nOn the Germans' motion, that the House agreed to the Senate\namendment to the House amendment to the Senate substitute\nto House Bill 266, as he explained,\nall those in favor will vote yes.\nThose opposed, we'll vote no in the clerk,\nwill unlock the machines.\nAll members voted for what purpose is the chairman press rise make a motion.\nHouse, Mr. McGaxby, excused from the vote reference house rule 133.\nThe gentleman has that right and the journal will so reflect for what purpose is represented black men rise elementary inquiry.\nStay tuned, Quarry.\nMr. Speaker isn't it true that we actually raised this in more than double what exempts our military retirees on their retirement income?\nThat's how I read it.\nThank you, Mr. President.\nI appreciate the work of the committee and of the representative and of this House to honor and take care of our retirees and they have all members voted.\nSo, Mr. Clerk, will you lock the machines?\nOn the gentleman's motion, the A's are 167, the nasor zero.\nAnd the House has agreed to the Senate amendment to the House amendment to Senate substitute to House Bill 266.\nThank you members for what purpose is chairman gullet rise make a motion state your motion a move that we recommit\nSenate bill 218 to rules\nMr. Clerk will you read the caption?\nSenate bill 218 by senator Roberts in the 29th to be titled an act to amend title 15 in the fiscal to Georgia\nAntony relating to court court so as to provide the prosecuting attorneys\nqualifications commission shall be assigned for administrative purposes only to\nthe administrative office of the courts.\nGeneral's motion SB 218 be recommitted to the Rules Committee his\nyour objection. Here it none is so ordered.\nThe ripples are the more.\nThere she comes, representing Moor is recognized for an announcement.\nRepresentative Moor.\nMembers, we're going to be in the posture of taking a break for lunch.\nAll right, after representing Moor, makes her announcement.\nHey, Corey.\nThank you, Mr. Speaker.\nColleagues, today would have been my mother and her twin\nbrothers, Birthday.\nSo in honor of that day, I made their favorite cheesecakes.\nThey were twins, male and female.\nThey could never decide on one cheesecake.\nSo I always had to make two.\nSo I made one set for one side and one set for the other.\nchoose blueberry and caramel as soon as I can get somebody to help me bring them\nout the car. They're very heavy and it's a lot of them. Do I get any volunteers?\nAnd happy birthday to my mother and my uncle and their heavenly peaceful home.\nThank you, Representative Moore. It's a great honor to honor someone. They're going to help you.\nThank you.\nThe representative Parish, Chairman Parish, has recognized for an announcement.\nThank you, Ms. Speaker.\nI'd like to ask the members of the Rooms Committee to meet me in room 341 at 130, room 341-130.\nThank you.\nMembers, we have two additional announcements.\nBut if you have a page, if you have a page today, join us down\nfront after we complete our announcements as when we go into\nrecess, cheer lady camp is recognized for an announcement.\nThank you so much, Mr. Speaker.\nThe Intergovernmental Coordination Committee will be meeting\nupon our lunch adjournment in room 406 and CLAB.\nWe're going to be taking a substitute on one bill.\nThank you.\nCheerleading Miller is recognized for an announcement.\nThank you, Mr. Speaker.\nThe Georgia House Democratic Caucus will be meeting\nupon adjournment in CLOB 605 for lunch and a presentation.\nSee you all there.\nPresent the park.\nCanada is recognized for an announcement.\nThank you, Mr. Speaker.\nOn your desk, you'll see that we are having the first\nAnd you all, Sci-Di Block Party today in Liberty Plaza\nfrom 1 to 6 p.m., all members are invited,\nall members can speak on the mic\nand just welcome guests to the Capitol.\nSo please join us in Liberty Plaza anytime today\nfrom 1 to 6 p.m., we do have a lot of different performers.\nMaybe y'all are familiar with Young Jack,\nor Pastor Shoy, or Rich Kids,\nbut they will be performing.\nThank you so much.\nSee you there.\nChairman Williamson, recognize for the announcement.\nThank you, Mr. Speaker.\nThe majority caucus will have lunch in room 403 immediately on the German for the lunch\nbreak.\nThank you, Mr. Speaker.\nThank you.\nThat completes our announcement.\nThank you for your attention this morning.\nAll members, this House will stand in recess until 2 p.m. today, 2 p.m.\nAnd this house will come back in session 2 p.m.\nEveryone enjoy the lunch break.\n",
  "updated_at": "2026-02-11T21:09:10.800432+00:00"
}