{
  "video_id": "c35rvsm0DhI",
  "url": "https://youtu.be/c35rvsm0DhI?t=151",
  "title": "Georgia House - Day 35 (2026-03-14)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 35,
  "video_date": "2026-03-14",
  "duration_minutes": 43,
  "summary": "Here is a structured markdown summary of the key points from the Georgia House session transcript:\n\n## Overview\nThe session focused on passing routine privileged resolutions and debating and passing Senate Bill 448, the annual Code Revision Bill to correct errors and reenact statutory provisions in Georgia's code.\n\n## Key Actions\n**SB 448**: Annual Code Revision Bill to correct errors and reenact statutory provisions in Georgia's code.\n\n## Bills Introduced (First Reading)\nNo new bills detected.\n\n## Notable Moments\n- Rep. Doug Stoner gave a farewell speech, noting this would be his last term in the House after over 20 years of service, including a previous stint in the majority party.\n- Stoner reminisced about his time as a \"freshman\" in 2002 and the changes in district boundaries that impacted his legislative career over the years.\n\n## Votes\n- SB 448 passed with a vote of 138-0.\n\n## Attendance\nA quorum was present, with all members voting on SB 448.\n\n## Adjournment\nNo specific adjournment time noted, but the transcript indicates this was the final day of the 2025 legislative session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nHouse will come to order.\nMembers will please come to the floor of Mr. Clerk, will you ring the bell?\n.\n.\n.\n.\nMembers will please come to the floor, all members will come to the floor.\nMr. Clerk, would you read the caption to a group of privileged resolutions?\nhonoring the life and memory of Naomi Ruth Barber King.\nHonoring the life and memory of Amy Wald St. Pierre.\nRecognizing April 2024 as Arab American Heritage Month\nin Georgia, recognizing commending Shab battle,\ncongratulating commending, Danica Rodriguez,\nreceiving the 2024 Yellow Rose Dicke T. Randall Service\nLeader Award, recognizing commending Martin Wilson,\nrecognizing commanding Dr. Natalie Hernandez,\nrecognizing commanding Naomi Bond,\nrecognizing commanding Shanti Moore,\nrecognizing the 90th anniversary\nthat Georgia Tech Research Institute,\nrecognizing commanding Poplar Springs Baptist Church.\nOn the occasion of its 150th anniversary,\nrecognizing commanding his splanta,\nrecognizing and commanding the U.S. Military Vets Motorcycle Club,\nrecognizing Commending Jessica Wilson,\nRecognizing and commending Tiffany Bryant,\nrecognizing Dr. Kim Coder,\ncongratulating commending Shandroa Wright\nfor receiving the 2024 Yellow Rose\nnicotine Randall Service Leader Award.\nAnd for other purposes, that completes\nthe reading of the privilege resolutions.\nIs there any objection to adopting your privileged resolutions, Chair?\nHere's none.\nThe resolutions are adopted.\nMr. Clerk, will you read the caption to Senate Bill 448-448?\nSenate Bill 448, Senator Hatchett, the 50th Strickland, the 17th Kennedy, the 18th and\nGoods, the 51st to be entitled and act to amend the official code of Georgia, and\nit's a rise modernized correct errors or emissions in and reenact the statutory portion of said code.\nThis bill ever referred to the Committee on Code Revision, the committee recommends this bill do pass.\nChairman Yorta is recognized to present the bill, the gentleman from Silvester, Georgia.\nChairman Yorta.\nThank you, Mr. Speaker.\nI bring you Senate Bill 448.\nThis is the annual Code Revision Bill.\nThese are Georgia code edits to the code revision commission has recommended.\nThis is to correct grammatical errors, typos, and actually other acts that have become\nobsolete or unsconstitutional.\nAnd most importantly, this bill re-enacts a statutory provisions of our official code\nof Georgia.\nSo our laws will stay on the books.\nSo it's a very important bill and I appreciate your support on this bill.\nYou have no questions.\nI yield the well, sir.\nIs there any objection to the previous question being ordered that Chair, here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee which was favorable\nto the passage of the bill?\nChair, here is none.\nThe report of the committee is agreed to.\nout this bill now pass all in favor of past year the bill will vote yes all\nthose opposed will vote no and the clerk will unlock the machine\nWe have all members voted.\nAll members vote of this, so the clerk will lock the machine on the passage of Senate\nbill 448, the yeas are 138, the nays are zero, this bill hasn't received a requisite\nConstitutional majority is therefore passed.\nMembers, we all know that the summer of our family\nthat is moving on, that we will not return in 2025.\nOne of those is a dear friend of mine\nthat we've served together over a number of years.\nHe had some different capacities,\nand but we've always remained friends\nand had to have had great respect\nfor the gentleman from House District 40, Doug Stoner.\nRepresentative Stoner, you'll recognize, come speak\nto your family, Representative Stoner.\nThank you, Mr. Chairman.\nAs the speaker said,\nAs many of you are aware, I will not be returning to this chamber next year.\nOnce it was clear that Representative Noel Woods is Terry, and I would be in the same\nnew district, I made the decision not to run for re-election.\nAnd for more than 20 years, Terry and I have been friends, political allies, and colleagues\nboth in this house and on the Smirt City Council.\nSo in spite of what one may think, this was not a hard decision due to our friendship.\nI know Terry well, and I know she will represent my hometown of Smurna and Cobb County with\nintegrity.\nBut for those who may not know, this was not my first time serving as a freshman in this\nhouse.\nIt's been interesting because the freshman class I've come in with in the 2022 election\nlearned that I was not really a freshman, they kind of figured that out real quick.\nAnd so they were very nice, they gave me the title of Dean of the freshman class, which\nI thought was really nice.\nNo offense to Gerald Green, representative Green as Dean of this house, but they gave me\na dean of the freshman class, which I really appreciated that.\nBut to give you a little back, I was elected in the 2002 election and served as a member\nof the majority under Speaker Terry Coleman in 2003 and 2004, which I know for some of\nmy colleagues on my side of the aisle, that's something they're not used to.\nObviously, I was very fortunate to serve in the majority and yes, I do miss being in\nthe majority.\nI will not lie.\nI do miss being the majority.\nno offense, Mr. Speaker, or my colleagues across the aisle.\nNone, take it.\nIn fact, if I've got to serve in the minority,\nI would serve a speaker of Burns, definitely,\nis who I would want to serve within the majority,\nand the minority.\nIn fact, several members of my first freshman class\nare still serving this chamber today.\nAnd Ralph, that speaker, Pro Tem Jan Jones,\nwe were freshmen.\nChairman Billy Mitchell, who's I don't think here,\nbut Billy Mitchell was also a Pete Marin,\na representative Debbie Buckner,\nrepresentative Al Williams,\nrepresentative Mary Margaret Oliver,\nrepresentative Roger Bruce,\nrepresentative Chuck Martin was a freshman with me.\nAnd until recently,\nrepresentative Barry Fleming, now Judge Fleming.\nAnd one other member who I was looking for\ndeserving with again,\nand unfortunately could not,\nand that was Speaker David Ralston,\nwho was a freshman with me in 2002.\nNow, this is not the first time\nRedistricting has impacted my service\nin this legislature.\nIn fact, the Redistricting session of 2001\ncreated a multi-member house district.\nSome of you may remember those.\nMulti-member house district\nallowed me to run for the house in the first place.\nThen at the beginning of the 2004 session,\nI know members of my freshman class\ndefinitely remember this.\nThe courts throughout our maps and drew new ones.\nThose maps drew me into a house seat\nwith former representative of Rich Goldock.\nA lot of y'all knew Rich.\nAnd instead of running against my fellow house member,\nI ran for the Senate against an incumbent senator\nwho I defeated in 2004.\nNow, just to be honest, I'm a Democrat.\nShe was a Republican.\nSo I mean, I took out a Republican senator.\nBut hey, at least it was a senator.\nIt wasn't a house member.\nSo I looked at it.\nI thought that was something.\nAnd so I served for about another eight years in the Senate,\neventually becoming chairman of the Democratic Caucus\nover in the Senate.\nBut again, redistricting in the 2011\nredistricting session impacted my service\nin this legislature.\nAnd I was drawn into a 62% Republican performing\nSenate district due to the courtesy of my friends\non the other side.\nNone of my friends here on the other side.\nThis was my friends over in the other chamber\non the other side.\nAnd I will tell you, I always like a challenge.\nAnybody knows me?\nI like a challenge.\nAnd yes, I did lose the contest in 2012,\nbut I'm a little proud only lost by four points.\n52, 48, considering I was drawn\ninto a 62% Republican forming district.\nBut, you know, during my absence from this body,\nI served on the Smarter City Council,\nwithin my colleagues, Senator Council member,\nI know it's.\nAnd then in 2021, this body again drew new maps.\nAnd I was fortunate enough to have an opportunity to return back to this chamber in the 2002\nelection.\nObviously, I'm here today giving this speech to the outcome of the latest redishting,\nwhich by the way is the fifth one I have gone through in the last quarter century.\nAnd I have to be honest, three have benefited me, two have not, so I'm just being honest\nhere and everything.\nNow, you think by now I have to take a hint after all that's happened, which obviously\nI can't take a hint, or that would either be bitter or cynical about my circumstances.\nAnd I assure you I'm neither.\nI'm neither one of those.\nThe reason I'm not is that I've always enjoyed public service in spite of all the challenges,\nand we all know what the challenges are, everybody serves in this body.\nAnd I get a deep satisfaction in helping my fellow Georgians while also improving in my\ncommunity improving my community and my state. Those who have worked with me over the years\nno matter their political affiliation know that I enjoy building coalitions to solve problems.\nThis desire to be involved civically was both drilled into me and demonstrated at an early age\nby my grandparents and parents. And why I say that is when your family owns a dairy queen in town,\nwhich we still do own dairy queens, you have no choice but to be involved in your community,\nbecause everybody wants to come to your dairy queen,\nwants you to sponsor their sports team, or whatever it is.\nI can tell you, I was very popular as a child in school\ndue to us owning the local dairy queen.\nI can tell you that.\nEverybody wanted to know, could I bring ice cream\nto every school party or everything like that?\nOh, by the way, just not trying to.\nToday's pie day, if y'all know, is 314, right?\nAnd some of you may have noticed I had some pies over in the\ncooler over here.\nI had a son that said, do not touch, those were for some of the pages that we had that\nwere type one today.\nOf course, they didn't need all the pie, so there's plenty of pie, by the way, if y'all\nlike, courtesy of Representative Stoner today, sitting over there in the anti-room, kind\nof brings about my days of the dairy queen.\nNot surprisingly, this background led me pursuing a political science degree in college, so I actually\ndid use my degree, which is not something everybody can say.\nBut my public service did not begin with elective office like many of you in this body.\nI served as a local appointed public official first, which I did in a number of capacities\nfor 32 straight years from 1991 to 2023, while concurrently serving in elective office.\nI was a vice chair of a development authority for 25 years, chairman of another authority,\nand I was even chairman of the cop transit system at one time.\nIn the same time, I was also serving in public office, an elective office.\nSo no one needs to feel sorry for me and I don't think anybody here is without respect.\nBut as those of you who have known me over the years, I will continue public service in\nanother forum.\nIn fact, this morning when the governors were here, who I served with all three of those\ngovernors, Senator, excuse me, a representative of Governor Campus, excuse me, mentioned\nHe mentioned, he says, I hear you're leaving, representative.\nAnd I said, yeah, he says, I'm not worried.\nYou'll be back eventually.\nI know you dug, which I appreciated that.\nBut I would conclude this farewell address,\nor as I like to call it a farewell for now address, OK?\nWith a famous quote attributed to Hubert Humphrey,\nformer vice president of the United States,\nthat sums up how I kind of view my years of service.\nI quote, once you get politics in the blood,\nThe only cure for it is in bombing fluid.\nAnd I think a lot of us know folks, and I'll admit to be one of those folks, and my first\nbullet campaign occurred when I was 13 years old, actually I worked on a campaign when\nI was 13.\nSo at early age, and hopefully that cure is not any time soon, is the way I look at it.\nAnd I want to thank Mr. Speaker and my colleagues here in the house.\nI've enjoyed many years of service in both chambers\nand have built a lot of friendships with a lot of individuals\nwho are serving now or served in the past.\nBut if my legislative service has to end now,\nwhich again, I'm not saying it will, hopefully not.\nBut if it has to end now, I find it very appropriate\nthat I finish it in this house where I started\nover 20 years ago.\nAnd again, I thank y'all.\nI know it's Thursday afternoon.\nI'm not going to keep y'all here and everything,\nbut I just want to come and let you know my thoughts on this\nand leaving.\nAnd as I say, my farewell for now address and everything.\nThank y'all very much.\nYou've been a friend as I said for years, and I don't take that friendship lightly.\nWe've also been a fierce, fierce advocate for your district, and I can tell you as a\nGeorgian, I appreciate that.\nWe wish you the best, and somehow I think we'll see you again in some capacity.\nYou're quite resilient, and I think the reason you have that success is you care about\nthe people of Georgia, and you're a good man, and we appreciate you.\nWe're going to miss you.\nYou\nYou\nMembers, I'm going to give you a moment to greet and speak to Representative Stoner.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nHouse will come back to order we have one one more bill on the calendar.\nOne more bill.\nMr. Clerk will you read a caption to Senate bill 450 450 Senate bill 450 by Senator Kennedy\nthe 18th Strickland of the 17th tillery of the 19th Gutes of the 51st and\nothers. The title of an act of men, title of five, 15, 44 and 53 of the\nfish quota, George Antady, relaying the PLAIR Courts property, Wilson Trust and\nadministration of the States. Miss Bill, I refer to the Committee on Judiciary.\nThat committee recommends that this bill do pass by committee substitute.\nMembers, if you'll please take your seats.\nChairman of Reapportionment, you'll look around us who's standing up so when things down that we'll could have a special session on Reapportionment\nMembers will please take your seats, give the gentleman in the will your attention\nRepresentative Rob Leveritt is recognized to present the bill, Representative Leveritt\nThank you Mr. Speaker, ladies and gentlemen, I've been told by Chairman Collins that when\nI get up to present some of my bills, it's so boring his heart rate slows to such a\nlevel he can't hardly maintain consciousness so in the interest of public health I'll\ntry to be brief.\nThis bill amends the state and spirit court appellate practice act that we passed about\ntwo years ago.\nIt made some changes in the way you appeal from like probate, magistrate, lower courts\nup to a superior court.\nThey are normally a trial court, but they do have an appellate court function in that\ncase.\nAnd we did that by doing away with the old petitioners there sure are in replacing it\nwith a petition for review, which is a much cleaner, simpler method of appeal.\nWell, as often happens, there were some issues raised about really exciting things, like\nstandards of review, how you dismiss a petition when mutual consent is needed.\nThere were some changes also made to some of the condemnation statutes, which I don't\nI think Vice Chairman Reeves, unfortunately he got chewed on pretty hard at the condemnation\nseminar earlier this summer and we don't want that to happen to him again.\nSo we're trying just to clean up those issues, address some of those technical issues that\nthe bill raised.\nI want to thank Vice Chairman Reeves again for bringing those provisions to my attention\nand also so much thank the President of the Senate for allowing me to put those condemnation\nprovisions into Senate Bill 450.\nAnd that, Mr. Speaker, is basically the bill.\nGentlemen, has no questions.\nThank you, ladies and gentlemen.\nI ask your favor, consideration, Senate Bill 450.\nIs there any objection to the previous question being ordered?\nThe chair here is none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nChair here is none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none, and the report of the committee is agreed to.\nNow this bill now pass, all in favor of the passage of the bill, we'll vote yes, all\nthose opposed, we'll vote no and the clerk will unlock the machine.\nAll members voted if so, the clerk will lock the machine.\nOn the passage of Senate Bill 450, the yeas are 150, the nays are zero.\nBill haven't received a requisite constitutional majority, is therefore passed.\nThat completes the rules calendar.\nWe will move on to afternoon orders, Representative Tran.\nIf you will, give the gentleman in the way or your attention, Representative Tran.\nHe has some friends.\nThank you, Mr. Speaker.\nI rise today to remember what happened three years ago\non 316, but I'd actually would like to yield the well\nto my colleague to say a few words about it.\nYou may.\nYes.\nThank you, Mr. Speaker.\nGood afternoon.\nToday marks the solemn remembrance of the third.\nMember will stand, please.\nToday marks the third anniversary of the devastating Asian spa shootings.\nThree years ago, lives were tragically cut short, family shattered, and communities left\ngrieving in the wake of senseless violence.\nWe must remember the victims.\nThey had hopes, dreams, and loved ones who cherished them dearly.\nTheir lives mattered and their absence continues to leave an indelible void and the hearts\nof many.\nWe also honor the survivors whose resilience in the face of unimaginable horror is a testament\nto the strength of the human spirit.\nTheir stories remind us to support those in times of adversity.\nAs we reflect on this somber anniversary, let us recommit ourselves to combating the\ndeeply rooted prejudices and injustices that perpetuate violence against our communities.\nWe must stand united against hatred, bigotry, and discrimination.\nLet this day serve as a reminder of the work that still lies ahead in creating a world\nwhere every individual is valued, respected, and safe from harm.\nMay the memory of those lost inspire us to strive for a future filled with compassion and understanding.\nTogether, let us honor the victims, support the survivors, and work towards a brighter tomorrow.\nThank you.\nI yield this well, Mr. Speaker.\nThank you, members.\nRepresentative Kendrick has a special afternoon order.\nThank you, Mr. Speaker.\nGood afternoon, colleagues.\nI would like to wish my granny a happy birthday.\nher name is Maddie May Kendrick and she turns 82 years old tomorrow. My dad is her son.\nShe has five grandchildren. I'm the best-looking one, of course. She has three great-grands and she lives\nin Representative Crawford's district and the three things that she enjoys is gardening,\nlooking at the bachelor and talking about Republicans. So happy birthday, Granny.\nGreeny's birthday. Happy birthday! Chairman Petrie, he recognized for an afternoon\norder. Thank you, Mr. Speaker, and if our other members of the Savannah\nVatican County delegation, that would be helpful. Ladies and gentlemen, just\nwant to tell you our parade committee could not be here this year. We're sorry\nabout that, but we do want to let everyone know here. This is the 200th anniversary\nof what is now one of the largest Savannah St. Patrick's Day Parades in the\ncountry 200 years and our chairman this year is Tim Mahoney, Timothy P. Mahoney\nand our grand marshal this year Mr. John Forbes are really excited about the\nparade this year hope all of y'all come it'll be on Saturday thank you very\nmuch Mr. Speaker well what a great 200 that's pretty good huh\nYeah, Chairman Hitchens looks pretty good for walking in all those parades.\nI can tell you that.\nRepresentative Stacey Evans is recognized for an afternoon order.\nThank you, Mr. Speaker, ladies and gentlemen.\nGood afternoon.\nI want to come in some reading to you for over the weekend.\nPerhaps on your drive home, this can be downloaded in an audio book, which is how I read\nit.\nBut the zenith man written by a former member of this house, McCracken Poston, he represented\nwringled Georgia when I was growing up, had an infamous race for Congress against then\nCongressman Nathan Diel.\nBut this book is about a murder trial that took place in my hometown by an eccentric\nof an eccentric television repair man, which is why this is called the zenith man.\nBut it's a great story of how we can misunderstand people that are different from us.\nthe story of redemption and the justice system working, and also there's some great stories\nfor anyone who's lost a political race. You'll enjoy reading this, but I commend to you,\nthe zenith man. Thank you, Mr. Speaker. Thank you, Representative Evans. That completes\nour afternoon orders. We have a couple of announcements, and we're getting close.\nRepresentative Pennitch is recognized for an announcement. Thank you, Mr. Speaker.\nthe Fulton delegation will need at four o'clock in room cap 216. We need to pass the minutes.\nIt'll be quick. Fulton County delegation 4 p.m. 216 in this building. Thank you.\nThank you representative.\nRepresentative Ramon, Rua Ramon has a fun announcement. I think\nyou're recognized.\nHi everybody, for those of you who are wearing green, if you can come up here so we can take a group photo, that would be great after we're done.\nThank you.\nAs soon as we adjourn.\nRepresentative Crowe.\nRepresentative, I got it, that's I'm going to represent Clint Crowe.\nThank you Mr. Speaker.\nMembers of the Ways and Means Committee will have a meeting immediately upon a\nGerman 406 CLOB. We'll be meeting. We've got two bills taken up. Should go\nrelatively quickly. 406 CLOB upon a German. Thank you Mr. Speaker. That completes\nour announcement. Members, I want to say to you again thank you for your\npatience and involvement in our work for this day. I tell you I don't think it\ngoes unnoticed by the people of this state,\nhow this house operates, and y'all are doing a great job.\nAnd I just want to thank you for that.\nThe House Majority Leader, Leader Illustration,\nhas recognized for a motion.\nThank you, Mr. Speaker.\nI move that this house stand in recess\nuntil 4 o'clock PM today, then stand adjourned until 10 AM\non Monday, March 18, 2024.\nOn the motion of the Majority Leader of this house\nthat we stand in recess until 4 p.m. today at which time we will be adjourned until Monday\nMarch the 18th, 2024 at 10 a.m. at 10 a.m., all those in favor will say aye. Those opposed\nwill say no. I was saying around a while, I ain't got anywhere to go this weekend. But\nOh second thoughts, I think the eyes clearly had it, Mr. Leader, what do you think?\nThis house stands in recess.\n",
  "updated_at": "2026-02-12T13:52:51.171171+00:00"
}