{
  "video_id": "C7AXuXJ18x0",
  "url": "https://www.youtube.com/watch?v=C7AXuXJ18x0",
  "title": "Senate PM 3 Day 40 of the 2025 Legislative Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 40,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "Here is a summary of the Georgia Senate PM 3 Day 40 of the 2025 Legislative Session session:\n\n**Overview**\nThis session focused on the passage of SB 82, which aims to incentivize local charter school approval. Several new bills were also introduced for first reading.\n\n**Key Actions**\n**SB 82**: A bill to enact the Local Charter School Authorization and Support Act of 2025, providing incentives for local boards of education to approve new charter school petitions.\n\n**Bills Introduced (First Reading)**\n- SB 373: To amend Article 1 of Chapter 17, Title 45\n- SB 374: To amend Part 1 of Article 1 of Chapter 2 of Title 35 (Public Safety)  \n- SB 375: To amend Chapter 1\n- SB 376: By Senator Robertson\n- SB 377: By Senator Smith\n- SB 378: By Senator Smith\n\n**Notable Moments**\n- The Senate suspended certain rules to allow for the first reading and assignment of the new bills.\n- The chamber broke for dinner, which was provided by Copeland's restaurant.\n\n**Votes**\n- The Senate voted 44-10 to agree to the House substitute on SB 82.\n\n**Attendance**\n- A quorum was present.\n\n**Adjournment**\nThe Senate stood at ease for dinner and reconvened around 7:30pm. The session then adjourned for the day.",
  "transcript": "Thank you, Mr. President.\nI move that the Senate agree to the House substitute to SB 82.\nSecretary Decaption.\nSenate Bill 82 by Senator Dixon, the 45th, and others.\nBill's been telling act to amend Article 33, Chapter 2, Title 20.\nThe official of Georgia Ante, the Charter Schools Act of 1998,\nsays to enact the local charter school authorization\nat support act of 2025 to provide for local boards of education\nto reconsider the denial of local charter school petititions.\nTo require the official office of charter school compliance\nto repair guidelines and for local boards of education for the evaluation of charter school petitions to rise reporting to rise for related matters to rise for legislative findings and intents for effective date and for other purposes.\nMr. President, the House Office of the Long Substitute Senate Bill 82, a bill to be entitled not to amend Article 31 on chapters 2 of Title 20, the Peshkao Georgia annotated the Charter Schools Act in 1998, so as the National Local Charter School Authorization and Support Act of 2025 to provide for the State Board of Education and Collaboration with the State Charter Schools Commission to establish a program for the purposes of promoting and supporting the approval of new local charter groups.\nschool petitions by local board's education and provide incentive grants to local board's\neducation that approve new local charter school petitions for the award and use such incentive\ngrants and for other purposes. Mr. President, I complete the order.\nSenator from the 45th.\nThank you, Mr. President.\nColleagues Senate Bill 82 has to do with charter schools here in the state and it incentivizes\ncharter schools be approved at the local level.\nThe changes in the House was after working with DOE and it had to do with the Capitol Outlay\nprojects and then it also had to do with it put a 10-year sunset just for\naccountability but besides that there were no other substance changes be\nhappy to answer any question Mr. President.\nDo you have new questions?\nThank you Mr. President, I yield well.\nDoes any other senator which speak for against the measure hearing none the senator\nhas moved that the senate agreed to the House substitute on a Senate bill 82\nall those in favor will vote yay all opposed nay secretary and lot in the\nmachine\nYou\nOn the motion to agree, the A's are 44 and the A's are 10 and this motion has prevailed.\nAre we going to ask the pro-TM for a motion?\nThank you, Mr. President.\nI ask for unanimous consent that the Senate rules 3-1.2 and 4-2.1A as an alpha be suspended\nto allow for the first reading and assignment of six Senate bills.\nIs there objection?\nNo objection.\nSecretary Reed, the captions.\nSenate bill 373 by Senator Kennedy, the 18th and others, the bills we entitle like to\nto amend Article 1 of Chapter 17, Title 45.\nYou're adjourned.\nSenate Bill 374, by Senator Strickland,\na 40 second in a built to be entitled to amend,\npart one of Article 1 of Chapter 2.\nPublic safety.\nSenate Bill 375, by Senator Still, the 48th,\nand others, built to be entitled to amend, Chapter 1.\nYou're adjourned.\nSenate Bill 376, by Senator Robertson.\nYou're adjourned.\nSenate Bill 377, by Senator Smith.\nYes, thanks.\nSenate Bill 378, by Senator Smith.\nYes, thanks.\nMs. President, I complete the order.\nThank you, Mr. President, so we're at that time of days, we'll have our second meal together,\nbe the last one of this session.\nBut we've got Copeland's restaurant food for us, which is a great spot up near your area\ncenter from the 37th, but it's also an honor of the center from the 21st, it's good New Orleans\nCajun food for our man and in the normal spot in the secretary's break room or\nwhat I call under the stairwell down to the left dinner is ready and I hope you\nenjoy dinner and we'll see y'all back here whenever the bus man tells us\nthanks okay so we're going to stand at ease for dinner and obviously the\nproteum told you he has dinner for everyone and when we get back I think we\nWe've just got a couple of things to take up and then we'll be down for the night.\nAll right, so let's stand at ease and we'll reconvene about 730.\nYou\n",
  "updated_at": "2026-02-12T17:00:44.943763+00:00"
}