{
  "video_id": "C8VHGljz-SE",
  "url": "https://www.youtube.com/watch?v=C8VHGljz-SE",
  "title": "Lawmakers Day 39 04/02/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**:\nThis was a busy day 39 of the Georgia legislative session, with lawmakers racing to pass as much legislation as possible before the session ends. The session featured partisan debates on voting bills, as well as recognitions and emotional moments around school safety and mental health.\n\n**Key Actions**:\n- **HB 397**: Controversial voting bill that passed along party lines, with Democrats criticizing it as an attempt to disenfranchise voters.\n- **SB 17**: \"Ricky and Lisa's law\" adding clarifying language to a school safety bill passed earlier.\n- **SB 185**: Bill banning state funds for gender-affirming care for transgender prisoners, prompting a walkout by Democratic lawmakers in protest.\n- **SB 214**: Bill requiring paper ballots in elections, which will have to wait until the next session since it missed the crossover day deadline.\n\n**Bills Introduced (First Reading)**: No new bills mentioned.\n\n**Notable Moments**:\n- Emotional testimony from a legislator about their child's fear of school shootings.\n- Georgia First Lady Marty Camp joined the session to discuss the 988 mental health crisis hotline.\n- Walkout by Democratic lawmakers in protest of SB 185.\n- Recognition of longtime legislative cameraman Wesley Nichols for his 25 years of service.\n\n**Votes**:\n- **HB 397**: Passed 33-23 along party lines.\n- **SB 17**: Passed unanimously.\n- **SB 185**: Passed, prompting a Democratic walkout.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The session details do not mention a specific adjournment time. The summary notes this was the 39th day of the legislative session, with 2 days remaining before the session ends.",
  "transcript": "As we barrel towards the last day of our precious time here in this esteem body, please\nstop wasting my time.\nOn behalf of the 60,000 strong I represent, please stop wasting their time.\nplaying in their faces, stop manufacturing crisis, stop making up stuff.\nThe Democratic Party and the Georgia House representatives have logged out of the House\nChamber, instead of standing in here fighting for fiscal responsibility of your tax dollars.\nAnna Dramatic move, Georgia House Democrats walk out during the vote over banning Georgia\nof prisons from providing gender-affirming care for transgender inmates.\nGood evening and welcome to Lawmakers.\nIt's day 39, the last day before Sinidai.\nI'm Donna Lowry in Atlanta, we'll have more on the day coming up.\nGeorgia's business community is trying to adapt to some major changes these days.\nThey're tackling everything from how artificial intelligence is changing the business landscape\nto figuring out the potential effects of federal tariffs.\nIn this session, they turn to the governor and the legislature for help in limiting damage\nawards in civil lawsuits.\nI had a chance to sit down with the president and CEO of the Georgia Chamber to discuss\nchallenges, the big win with the tort reform, and a look at what's next.\nAlso tonight, we'll talk about what's been memorable this session and what bills are\nstill hanging around before it all wraps up late on Friday, to people who closely follow\nthe action join the show.\nfirst. Capitol correspondent Sarah Callis breaks down the 39th day under the\ngold dome.\nHi, Donna, the House and Senate jumped into hyperdrive on day 39.\nIn the Senate, almost 90 bills and resolutions were posted on the rules\ncalendar as legislators hostile to pass as much legislation as they can in the\nlast two days of the session. HB 397 is a controversial bill dealing with a\na variety of voting measures.\nWe helped them streamline this thing,\nand this has the blessings of Gabrielle,\nwho actually performs the elections all over the state.\nIt fixes the issues with our third party candidates,\nand it stops counties from doing this pop-up voting sites.\nNot true, say Democrats will pose the bill.\nElection security is important,\nbut this isn't about security, it's about control.\nIt's about disenfranchisement and it's about keeping power in the hands of the few at\nthe expense of the many.\nGeorgians want elections that are free, fair and accessible, not the partisan attempt\nto put more roadblocks between the people and the ballot box.\nThey say it erodes voting rights by removing Georgia from Eric, the Electronic Registration\nInformation Center, gives unconstitutional power to the state election board and would\nno longer allow absentee ballots to be hand delivered the weekend before elections.\nThe ability for a voter to drop off an absentee ballot the weekend before election is a\ncritical one.\nIt's a crucial access point that this bill would take away.\nAnd in an era where we have seen that the post office is wholly unreliable, many voters\nhave relied on dropping it off the weekend before a election because life happens.\nThe bill passed along party lines, 33 to 23.\nThe two house bills recognizing homegrown Georgian foods, cornbread and brunswick stew,\nwere both Frankenstein into new bills.\nHB 14 would have made cornbread the official state bread, but was changed into the Georgia\nMusic Office and Music Reddy Communities Act.\nAnd HB 233 would have made brunswick stew the official state stew, but was co-opted into\nnot only the stew, but also making the fourth Friday each November National Sugarcane\nsyrup day in Georgia, became the new home for the missing cornbread bill, and prohibits\nstate agencies from contracting with any country considered a foreign country of concern.\nBoth were passed, but no word on if the changes left a bad taste in anyone's mouth.\nAnd in the House, recognition of one of our own, as long-turned-camera men, Wesley Nichols,\nwas recognized for his 25 years of contribution, covering the legislature for lawmakers.\nWe are thrilled to honor West on his quarter century career milestone capturing Georgia politics and another special guest in the chamber Georgia first lady Marty\nCamp. She was joined by Department of Behavioral Health and Developmental Disabilities Commissioner Kevin Tanner to talk about 988 the mental health crisis hotline in 2023 only 16% of\nGeorgia's had heard of 98. A poll that we did recently, 84% of\nGeorgia's have now heard of 98. And a lot of that is because\nof work that the First Lady's done helping us spread the\nword. Then the House moved on to the first of several rules\ncalendars. Members approved Senate Bill 17 or Ricky and a\nLisa's law named after two school shooting victims. The\nlegislation originally in the bill to create a panic button\nsystem in classrooms was added to the school safety bill past\nMonday, so this version of SB 17 added clarifying language.\nWe passed this in the school safety bill.\nThis is just the amendment and cleanup.\nMembers had personal testimony about this issue.\nI waited a day or two before I asked my child if he had heard the news and asked him how it felt.\nI asked him if it made it feel scary or if it made him feel anxious.\nAnd he said no mom, that school only had one resource officer.\nOur school has two when an active shooter comes we're going to be better prepared.\nThat was the day I realized that my child uses the word win, not if, when he thinks about\nan act of shooter coming to his school.\nThe bill passed unanimously, and a demonstration from the Democrats in protest of SB 185.\nThe bill would ban the use of state funds for gender-affirming care for transgendered\nprisoners in Georgia.\nDemocrats spoke in opposition.\nWhat is it?\nWhat is going on with my colleagues that they have become so obsessed with what is happening?\ntransgender citizens, panties, and their underwear, and their boxer shorts, and their bed\nrooms, and their medical rooms, when they talk to their doctors, when they deal with\ntheir families.\nWhy is it that this has become such an obsession?\nAnd then walked out of the chamber.\nRepublicans were quick to criticize the move.\nProbably the most disheartening moment I've ever had my service here as a member of the\nHouse.\nto two.\nIn an unusual move, the Senate also passed SB214, which requires voters to use paper ballots\nin elections.\nThe bill will have to wait until the next legislative session to be considered, since\nit didn't pass before crossover day.\nThat's my Capitol report, Donna.\nThanks Sarah.\nEvery year, the Georgia Chamber of Commerce supports hundreds of bills that help businesses\nacross the state, regardless of their sides.\nI recently chatted with the president and CEO of the Georgia Chamber of Commerce to get\nhis insights on how this legislative session is shaping up for the business community.\nWe talked about some important topics like the need for a skilled workforce, the challenges\nbusinesses are facing related to AI, and how some companies are preparing for the impact\nof tariffs.\nBut first, we took a dive into a big win for the Chamber, civil lawsuit reform.\nWe were very excited and appreciative of the Governor, the Speaker Lieutenant Governor\nof Passing, really the first piece of tort reform or lawsuit abuse reform.\nAnd it put in perspective with me the other day when I realized it was 20 years ago this\nyear that the Georgia Chamber worked with Governor Perdue to pass the first round of\ntort reform in Georgia.\nAnd it's been 20 years of work every day with our members and with the General Assembly.\nAnd so, you know, our hope here is that we see a reduction in some of the frivolous lawsuits\nthat we see some insurers return to Georgia,\nthat have left, that we see some stabilization of rates.\nAnd it may be most importantly,\nwe can actually see some of our rural hospitals\nimprove their ability to attract doctors,\nparticularly OBGYNs, into some of the parts of the state\nthat really just haven't been able to keep those physicians\nin place.\nAnd so Big Bill, 69 is still out there.\nSome other bills that are still in that space,\nbut the governor's Senate Bill 68 was a huge win, a huge step.\nLet's talk about 20 years.\nYeah.\nWhat happened in that space, that tort-reform space over 20 years?\nSo what happened primarily was in those first five or six years\nafter that, the court system overturned a lot of those findings\nthat the general assembly passed.\nAnd the general assembly, for whatever reason,\nwe didn't come back and fix them\nwhen the courts pointed out that there were flaws and out there.\nAnd so between that and then a lot of new calls of actions\nbeing passed at the same time.\nThe business community suffered through that.\nWe made our points, but it wasn't until about three years ago\nthat we decided that we really needed to engage differently.\nThe governor was very engaged.\nHe wanted to, you know, he's traveled the state this year\nlistening to businesses and doctors and everyone\nto really hear what those issues were.\nAnd then he came out with his two bills in January.\nAnd you had some heavy hitters, you had Waffle House,\nyou had Uber, you had those big executives involved.\nYou had those executives, but I think what was more important\nis if you look at that first press conference\nthe governor held and you look behind him.\nI look behind him, I didn't see all the CEOs up there.\nWhen I saw, we're hardworking Georgians\nin their home depot aprons, in their Waffle House aprons\nand their hard hats and their lab coats,\nthey said, this matters to me and my family\nand I wanna be here.\nAnd we heard, I mean, every community that I toured\nin the last three months, we heard from small business owners\nwith their stories.\nJust, we heard from doctors saying they were shutting down\ntheir practices because their physicians were moving\nto North Carolina.\nI mean, we heard those horror stories everywhere we went.\nSo this wasn't just about the grass tops.\nThis was the grass roots.\nEvery day, hardworking George and saying,\nwe need to see a change.\nDo you worry about lawsuits like you had 20 years ago?\nOf course.\nAnd I think what we'll do this time is we'll go in\nand we'll battle those out and we'll try to preserve\nWhat Governor Kemp said was important, what our members say is important, and we\nneed much more vigilant than our predecessors were 20 years ago.\nLet's talk a little about insurance reform.\nSo that is something that people are saying that's next year.\nWhat are your feelings about that?\nSo I think we have to, first of all, we need to make sure that these changes that go into\n68 and 69 have chance to work.\nWhat we saw in Texas, what we saw in Florida is that those rates did come down.\nIn Texas, they saw med mal rates go down 54%.\ntwo years, but they saw them go in.\nSo, listen, last year, I consider what the governor passed last year was insurance form\nwhen insurers had to provide all that data to John King.\nWe trust Commissioner King with what recommendations he might come back with as he looks at that\ndata.\nAnd so, we'll be part of those discussions, but I think we've got to let...\nI think we'll see more insurers come back to the market because of what we've passed\nthis year.\nAnd the more competition in that market, the lower the rates are going to be.\nIf you only got two or three companies that are writing, you know, trucking, underwriting\nfor trucking companies, they're going to set their own price.\nIf you got 20 coming in, it's a much more competitive market.\nAnd so that's what our hope is that we'll see some immediately stabilization, and then\nwe'll work with the commissioner and others next year.\nSo you'll see some companies who want to come into Georgia, stay in Georgia because\nthey think insurance will stabilize at least if nothing else.\nRight.\nAnd hopefully they don't, we don't see the frivolous lawsuits, we don't see the nuclear\nverdicts at the same level. We've closed some of those loop holes and our hope is the\ninsurers we've talked to said we want to be in Georgia. We want to underwrite in Georgia.\nJust not feasible for us right now. Okay let's change gears a little bit and talk about\nyour strategic plan. Georgia 2050 what is that? So in January after almost two years of\ntraveling the state listening to our members listening to legislators elected leaders at the\nlocal level, we unveiled Georgia 2015. It's a bold 25-year outlook for the\nstate's economy. So it's more than just our strategic plan. It's really a\nstrategy for the state's economy. And what we heard from business leaders,\nthat we weren't just thinking four or five years out, that they were making\ninvestments for 20, 25 years. And you think about it this way. We were at\nHyundai's Meta Plant Grand Opening and announcement last week with the\ngovernor. They were very clear. This is not a short-term investment. We're\nWe're going to be here for the next 100 years.\nTo fix the interstate going into Savannah is a 20-year project to build two new nuclear\nreactors is a 20-year project.\nTo deepen the port of Savannah is almost a 20-year project.\nAnd so we felt it was important to look long-term.\nSo this plan looks at the data, how Georgia's growing, where it's growing, what the business\nis going to look like, what the disruptions are going to be.\nAnd Donnet focused on five kind of core pillars, as we call them, making sure we've got\nthe right workforce and talent in place.\nIn case you're those young men and women\ncan AI proof their careers,\nthat's what our big concern is.\nNumber two, to make sure that we've got\nthe energy production in place\nand the infrastructure investments that we need,\nto make sure that we're focused on growing\nthe next generation of innovators\nand entrepreneurs in the state,\nthat we remain a competitive and vibrant location\nfor economic development.\nAnd at the end of the day,\nthat we have regional prosperity and healthy community,\nso that every community in Georgia\nhas the chance to grow,\nand we've got the right healthcare supported systems\nin place to help them do that.\nAnd so every policy, every event, every program,\nevery bill at the Capitol that we work on\nfalls under one of those five pillars.\nFirst of all, let's talk about where are we now\nif we don't make some changes?\nI think there are two things we need to look at.\nNumber one is we have to get many women\nthat are disconnected from the workforce today back in.\nIf everybody that wanted to work could find a job\nand have the skills, we'd be at full employment.\nThat's what we have bills like Senate Bill 207\non occupational licensure reform coming\nfrom Senator Strickland to make it easier for men and women\nthat have been incarcerated to get the license\nthey need to go into the workforce.\nAnd so that's part of what we got to work on.\nThe other part is looking at generation alpha,\nwhich are our elementary, our middle school kids right now,\nto make sure that they've got the skill sets they need\nto be horrible 20 years from now\nwhen they get out of college.\nAnd that they've got the right skills in place\nis AI disrupts their first choice career\nand their second choice career.\nSo there's a lot of work that's got to go on in that space.\nWe have a couple bills that the governor supported this year,\nbest place for talent being one of those.\nAnd so we've got to have those types of policies.\nBut I also think we've got to be much bolder.\nThe fact that my son's a freshman at UGA right now,\ngo dogs.\nHe graduated with much the same class schedule\nthat I had 30 something years ago.\nAnd that's not going to work in a system\nwhere kids need more real world experience,\nmore technology experience, more humanities,\nwe're gonna have to really rethink K through 12,\nI think, in the long term.\nWhat were the bills that dealt with AI\nthat you were looking at this session?\nSo I think there's a lot of concerns,\nwe didn't have any specific bills,\nthere are lots of bills that kind of floated out there\non data privacy and artificial intelligence,\nand I think our concern has been,\nand it will continue to be.\nOur companies online transcend states,\nthey transcend countries.\nAnd if every state has its own artificial intelligence bill\nand its own data privacy bill,\nall of a sudden your company, my company, everyone else,\nwe've got 50 different states\nthat we've got to watch their laws for.\nAnd so we think that's a national solution\nthat tells us what the parameters are for ethical AI\nand for ethical data privacy\nand that we're punishing the bad actors\nand not the mainstream mom and pop companies\nthat get hacked even though they did everything\nthey were supposed to do.\nAnd so that's been a lot of our education\nat the Capitol this year is helping legislators understand\nthis is a very big issue, it's a national issue,\nand let's make sure that if we do pass bills,\nthey look like a bill that North Carolina passed\nor Alabama passed so that we're all on the same page.\nWell, almost a sunny day.\nWhat are you looking for in the next few days?\nSo we still need to pass a couple of bills\nin tort reform, like the Governor Senate Bill 69\nneeds to move out of the Senate or out of the House.\nThat deals with third party and foreign litigation\nto make sure that people aren't abusing our legal system\nfrom Russia or from China or from London for that matter.\nAnd then we've got a couple of more bills on tax\nthat we want to get out.\nBut I think those will all move easily.\nAnd quite frankly, at this part of the year,\nyou play a little bit of defense to make sure\nthat something that has unintended consequences\ndoesn't undermine what you've been working on.\nOK.\nI've got to ask, some of the cutbacks\nat the federal level, especially grants,\nare already hitting some of the business community in Georgia.\nSo, what are you hearing from your members,\nand what are you saying to them?\nSo, a lot of our members are worried about\nwhat the impact of tariffs are gonna be,\nthe word about cuts, particularly in research and development.\nWe have a lot of research universities in Georgia.\nWe've spent out a lot of companies from those.\nSo, we're now part of a national coalition\nthat's looking at how you fund science, research,\nand development to make sure that we're telling\nthe right story, and we're getting those dollars\nthat are available back into our universities\ninto our state.\nYou know, I've heard from the President of Morehouse an\nEmory about the potential impacts there.\nSo we're just trying to be a good advocate, make sure that\nour members of Congress understand where those dollars go,\nthe impact that they have, and the fact that they're\nspinning off companies every single day in Georgia.\nAnd that's the great work of the Georgia Research Alliance.\nSo we're trying to advocate and be a good partner there.\nAnd then obviously on tariffs, we're just trying to work\nwith our partners all over the country, all over the\nworld and make sure that Georgia businesses know what they\nknow what they need to do in order to be compliant and to mitigate or to lessen the impact\nof any of those tariffs and continue to talk to our friends in Washington every day about\nthe potential impact.\nI want to thank Chris Clark for that conversation.\nThat interview took place before the final passage of SB 69, another of the tort reform\nbills.\nIt is now also on the governor's desk.\nWell, coming up, as the session winds down, we take a look at what made this one stand\nout the twists and turns and what to expect on Sinydai. We'll get analysis from two people\nwho have watched the legislative process on full this year and have done so in the past.\nYou're watching Lawmakers on GPP.\nGeorgia Farm Bureau, a grassroots organization dedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers at the State Capitol during the session and\nyear round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nAnd a queen. I don't fear anyone.\nThis was a woman. People wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse.\nImmediately.\nShe's a female trailblazer.\nWe did it.\nFive-knowledge in our own worth.\n1.\nOh please, do continue.\n2.\nThis is the first time that anyone has seen this in 2,000 years.\nThis is amazing.\nI'm excited now.\nPompeii is a battle against time.\nWell, I'm excited now for it.\nPompeii is a battle against time.\nYou think I'm joking, but look at this. It really happened.\nDon't let anybody tell you who you are.\nHistory teaches us to honor the past.\nWhen you look back, like, wow, that was pretty special.\nThis is something that's actually\naltering the course of history.\nYou're charged with keeping these stories alive.\nWelcome back to Lawmakers, I'm Donna Lowry.\nYou might say every Georgia legislative session\nhas its own vibe.\nTonight, we're going to discuss some of the bills\nthat made this session unique and look at\nwhat's yet to come as things wrap up.\nJoining me is journalist Ty Tagami.\nHe's a reporter with Capitol Beat\nwho is covering state government and Capitol Beat is a partner with GPB and you'll find the stories on gppb.org.\nAlso here is political analyst, commentator Bill Crane, who is often on local and national media outlets.\nHe is the owner of CSI Crane Communications. He also writes the column One Man's Opinion. He'll give us his opinion tonight more. Welcome to Lawmakers to both of you.\nLet's start with this session.\nI talk about each one having its own vibe.\nHow would you describe it?\nI'll start with you, Bill.\nI would say a national tilt and shift to the right\nin deference to the new president,\na return of Donald Trump,\nand some business-oriented bills\nlike you just talked about with Chris the Georgia Chamber\nto re-underscore Georgia's place\nas a top place to do business.\nHow about you?\nI would you describe it?\nIt's always a frenetic pace,\nbut the Sierra feels even faster than it has been in the past.\nAnd I think Bill's right, there's a lot of emphasis on national issues\nor things that people have been talking about.\nThere have been a lot of bills about transgender issues,\nfor instance, whether it's in the schools or the prisons.\nThere have also been some bills that really affect people,\nbirth to death, I like to think of it,\nwith IVF, Guarantee in Georgia, passing is a bipartisan bill, and that's important.\nA lot of people were concerned about that publicly.\nAnd then also on death, is this the time to talk about one of my favourites in the session?\nYeah, talk about that bill.\nThis was a favourite of yours?\nI think so just because it came out of nowhere, and I think surprised all the lawmakers involved\na funeral director brought a bill that has, I guess it was already legal, but put some\nrules around composting. It's something that composting people after we die. So that's\nsomething that all of us, at some point, will face. And there's a new way to explain\nit.\nAlmost ash, yeah. I was, I was taking them back, because I was thinking increasingly\npeople are cremated.\nThey are. They are.\nAnd if they're not, I'm on the board of the monastery, the Holy Spirit. And we have\nnatural burial ground where you put people in hemp baskets and into the ground and I'm thinking\nsurely they're not going to be farming there. I just I can't make the leap.\nSo so talk about this a little bit. So if you said it's actually a tub they put people in and\nI mean they didn't go that far into the details but yeah that's some sort of final\nI was imagining a rain barrel or something you know looking like that and there there's a time\nframe it's like six weeks to two months and there's a certain temperature you have to maintain\nAnd if you do it right, it apparently there was testimony that it smells like a feed store in the facility where they do it.\nAnd what's, I guess, compelling is that the family can have the remains back in the form of soil and\nplan it in their, you know, use it in their garden to grow things.\nI will say, and I'm not trying to be too cynical, the funeral home industry has been very profitable for a number of years, but that industry is shrinking.\nFewer and fewer people are going for traditional burial cemeteries, so a new revenue stream.\nThat was interesting.\nLet's talk about you.\nYou mentioned one bill that was partisan, and then we've had, you know, the bipartisan\nbill was IVF.\nLet's talk about some more of the partisan bills.\nAnd we will still wait.\nThe Statewide Doge Committee there.\nYeah.\nTalk about that.\nWell, it's not something the state hasn't done before and couldn't do again.\nI mean, Sony Purdue, for example, when he was governor, authorized to study the state\nof Georgia did not have at that time a complete inventory of all the real estate.\nBut the state owned, and that resulted in a lot of surplus real estate being sold, put\nback into the marketplace, and also downsizing that inventory, the utility expense, et cetera.\nSo there's a place for this.\nBut obviously that's probably not the reason that we got it this year.\nSo we'll see what happens with that as these agencies start cutting back.\nLet's talk about another part of the taxes, of course, but it was reducing the tax rate.\nNot the rebates that are coming back.\nThe state continues to work on that.\nYeah, that's right, this year was a continuation.\nI don't remember last year's cut, but this year it's,\nit's income tax, so it was a 0.2% rollback.\nThat is 0.2 or 0.2 for last year.\nYeah, so the eventual goal is to eliminate it.\nIt's difficult to do because it's\nabout a third of the state's revenue.\nYeah, and then the other thing we were still waiting\nto see what's happening with the budget.\nI want to talk about that right now.\nIt's in conference committee because each side\nhas their own idea what they want in that budget and they're\nand the governor is a little different to exactly the Georgia\nGeneral Assembly has to do is pass a budget now they got the\nlittle budget pass they got a little budget pass which is\nstirring up the old years budget with realities and what came\nin very quickly but yeah it'll be a long night for tie yeah\nit looks like it'll be a lot dealing with the part of it is\nthe promised scholarship or vouchers where the the houses\nreduce the amount of money and the Senate wants to use\nto have more?\nYeah, well, I think Governor Camp had one number,\nwhich was kind of lower, and then the house,\nI'm sorry, I'm mixing that up with the other one,\nwhich was prisons.\nOh, yeah.\nThose are the two contentious issues.\nYou know, there's a need for more correctional officers\nand improvements in facilities.\nAnd so I think Camp had one number, the house had another\nand the Senate's kind of come in between with the number\nbetween and they're still negotiating.\nAnd the vouchers, the house, it was when the bill passed,\nthere was an assumption that it would cost about $140 million a year.\nAnd the house set it at $40 million, I believe,\nand the Senate put it back at $141 million, actually.\nSo we'll see where that goes.\nLet's talk about what's going down in the wire.\nThe religious freedom bill?\nTalk about that.\nI do not believe it will be signed into law.\nReally?\nI do believe it'll pass.\nIt'll pass, but you don't see it doing something like\nwith Governor Nathan Deel, who he voted.\nI don't think it'll be as dramatic as Governor Deel's\nstatement was, and I was talking before we started the show.\nThe Georgia Chamber was very vocal that time,\nabout the potential concerns they had,\nabout the religious freedom bill.\nThey've been very quiet this time.\nSo, but I also think Brian Camp, the governor,\nis a very pragmatic man, and there's still some questions\nabout some of the verbiage and what it would be overturned.\nThere is a federal law already that guarantees\nreligious freedom, a superseding statute that passed\nduring the Clinton administration.\nSo the need is not great.\nIt would be a pin to the conservative base\nof the Republican Party.\nAnd I think it will pass the General Assembly.\nI do not believe the Governor will sign.\nWell, your thoughts, even on any other bills\ndown to the wire?\nWell, there is a little bit of Republican resistance\nagainst the Rift and Bill, but it was one Republican\non the last committee that passed it, who opposed it.\nSo there's some other bipartisan bills\nthat actually do affect people.\nAnd one of them passed today, it was the,\nit has to go back, but it was an election bill.\nIt would make some major 22-page bills.\nSo there's a lot of changes in there.\nAnd I think one of the changes that people would notice\nright away is you can't drop off an absentee ballot\nat the weekend before an election, or you can now,\nbut you wouldn't, if this passes, as is.\nThere are a host of other changes in there,\nand that was a better vote for Republicans and Democrats.\nYeah.\nOkay, so we'd only have a little bit of time.\nInteresting session and that what we saw today\nwith the Democrats was a big move walking out, right?\nI understand why the GOP is made\nsuch a series of issues around transgenderism,\nbut the specific bill looked one to provide gender\naffirming care in Jail's mirrors of the discussion again\nin the national campaign level.\nAnd if you didn't see it, there was an ad with Vice\nPresident Harris talking about not just providing\ngender affirming care, but paying for transition\nsurgery for state and federal inmates\nthat was critical in that campaign.\nWe're going to have to leave it there.\nI want to thank you both for coming in.\nAlways go so fast, because that does it today for lawmakers.\nThere are more committee hearings tomorrow\nbefore signing day on Friday so we will not have a show we'll be back on Friday for one\nhour lawmakers with live interviews and we'll see you then.\n",
  "updated_at": "2026-02-12T01:29:54.237592+00:00"
}