{
  "video_id": "C8VHGljz-SE",
  "url": "https://www.youtube.com/watch?v=C8VHGljz-SE",
  "title": "Lawmakers Day 39 04/02/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 29,
  "summary": "Here is a structured markdown summary of the Georgia legislature floor session transcript:\n\n**Overview**:\nThis was a busy day 39 of the Georgia legislative session, with lawmakers racing to pass as much legislation as possible before the session ends. The session featured partisan debates on voting bills, as well as recognitions and emotional moments around school safety and mental health.\n\n**Key Actions**:\n- **HB 397**: Controversial voting bill that passed along party lines, with Democrats criticizing it as an attempt to disenfranchise voters.\n- **SB 17**: \"Ricky and Lisa's law\" adding clarifying language to a school safety bill passed earlier.\n- **SB 185**: Bill banning state funds for gender-affirming care for transgender prisoners, prompting a walkout by Democratic lawmakers in protest.\n- **SB 214**: Bill requiring paper ballots in elections, which will have to wait until the next session since it missed the crossover day deadline.\n\n**Bills Introduced (First Reading)**: No new bills mentioned.\n\n**Notable Moments**:\n- Emotional testimony from a legislator about their child's fear of school shootings.\n- Georgia First Lady Marty Camp joined the session to discuss the 988 mental health crisis hotline.\n- Walkout by Democratic lawmakers in protest of SB 185.\n- Recognition of longtime legislative cameraman Wesley Nichols for his 25 years of service.\n\n**Votes**:\n- **HB 397**: Passed 33-23 along party lines.\n- **SB 17**: Passed unanimously.\n- **SB 185**: Passed, prompting a Democratic walkout.\n\n**Attendance**: No specific quorum notes provided.\n\n**Adjournment**: The session details do not mention a specific adjournment time. The summary notes this was the 39th day of the legislative session, with 2 days remaining before the session ends.",
  "updated_at": "2026-02-12T01:29:54.237592+00:00"
}