{
  "video_id": "cAHoiMza7w0",
  "url": "https://www.youtube.com/watch?v=cAHoiMza7w0",
  "title": "3/21/23 - Senate Committee on Appropriations",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 21,
  "summary": "Overview:\n- The Senate Appropriations Committee considered several key bills, including HB 611 and the FY 2024 budget bill (HB 19).\n- There was notable discussion around preserving the General Assembly's role in appropriating settlement funds and addressing issues in the state's Medicaid, child welfare, and mental health systems.\n\nKey Actions:\n- **HB 611**: Requires that any settlement agreement or proceeds from a settlement agreement be appropriated by the General Assembly after June 1, 2023.\n- **HB 19**: The Senate Appropriations Committee substitute for the FY 2024 budget bill. Key provisions include:\n  - Restoring Medicaid utilization cost cuts\n  - Shoring up the state health benefit plan by $1 billion\n  - Addressing structural deficits at child care institutions\n  - Increasing reimbursement rates for the \"Babies Can't Wait\" early intervention program\n  - Providing over $40 million to address mental health staffing and facility needs\n  - Funding 500 new COMP waivers\n  - Fully funding dyslexia screening for K-3 students a year earlier than required by SB 48\n\nBills Introduced (First Reading):\n- None mentioned\n\nNotable Moments:\n- Discussion around the need to preserve the General Assembly's role in appropriating settlement funds, particularly related to ongoing opioid litigation.\n- Remarks on the Senate version of the budget bill aligning more closely with the Governor's proposal than the House version, while still incorporating some House priorities.\n\nVotes:\n- HB 611 passed by substitute.\n\nAttendance:\n- A quorum was present.\n\nAdjournment:\n- The meeting adjourned, but the transcript does not provide the specific time or mention the date of the next session.",
  "transcript": "If everybody will take your seat, please.\nIf you're not a member of appropriations, I ask if you don't mind step backwards just\nso we can count and make sure we have a quorum.\nOkay, we do have a quorum.\nRepresentative Burns, do you mind leading us in invocation?\nPlease Father, we're grateful for today.\nWe're grateful for opportunities and challenges.\nBe with us now as we consider the business\nof our great state and make sure that we do the things\nthat are pleasing in your sight.\nChrist, name my pray.\nAmen.\nAppreciate all you've in here.\nThank you, Chairman Burns.\nOur first bill will be House Bill 6-11.\nRepresentative Bush said, if you want to step up\nto the podium, you can take it.\nYou can go from there, floor jurors.\nThank you, Mr. Chairman.\nHouse Bill 6-11 is billed at this committee.\nalready passed, but as with any lawyer bill, if you get several lawyers involved, there's\na question about how the words should be on the sheet of paper. So this is just the\nsubstitute that accomplishes the same exact thing. It's just reworded and the House\nPost 611, what it does is it requires that any settlement agreement or any proceeds\nfrom a settlement agreement shall be appropriated after June 1, 2023 by the General Assembly.\nAs you recall, we've had many settlements with the state of Georgia and they've been\nappropriate or allocated outside some of them, the appropriating power of the General Assembly.\nThis would assure that those appropriating powers that are in the Constitution remain\nwith the General Assembly going forward from June 1, 2023 on into whenever the General Assembly\ntakes action again. That's the essence of the bill. Mr. Chairman, thanks again for working\nwith me on this bill and helping me to make sure these words read correctly. And the parties\nthat are interested in this are General Assembly, of course, and then the AG's office. And\nThere is currently some ongoing litigation settlement negotiations happening for a second\nround of opioids.\nIf you recall last year we had the first round of opioids settlements.\nThis would, all the parties are in agreement of this language, is the language that would\nbest serve moving forward.\nThank you, Representative.\nMaking sure that I'm correct, the parties involved in this bill are at peace with it.\nwould preserve settlements that are made before this day and would require anything in the future\nto come to the General Assembly. Is that correct?\nThat is correct. Currently with the second round of opioid litigation, the time is of\nthe essence and the last round of opioid settlement, the General Assembly is taking\nno part in appropriating those funds. All those funds go directly to trust, both regionally\nand state trust that are appropriated outside of the General Assembly.\nWhat this bill, what we've been able to do is strike a deal with the parties involved\nto say that of the state portion that is coming to the state in the settlement agreement,\nin the settlement agreement moving forward in this second round.\nThe state portion, 65% of the, excuse me, 75% goes to the state of that 75%, 40% goes to a regional spin, which will go to a trust.\nThat's the other remaining 60%.\nThe General Assembly will appropriate and those parties involve the AG, General Assembly, and the locals are all in accordance with this.\nAfter this, however, all dollars shall be appropriated\nby the General Assembly.\nAll right, thanks for your explanation, Chairman Veach.\nIf it's proper time, I'd like to make a motion.\nIt's proper.\nAll right, I'd like to make a motion HB611 do pass.\nThere's a motion that HB611 passed by substitute.\nI think it's LC432837S.\nIs that the correct one, representative?\nYes, sir.\nAll right, there's motion and second.\nAny further discussion?\nAll those in favor, please say aye.\nOpposed, no.\nThank you so much.\nThank you, Mr. Chairman.\nGot one other bill on the calendar day, a little cleanup bill.\nIt's going to be House Bill 19.\nNot committee substitute.\nSpeaker Burns was busy, so I think I'll present it for him.\nI do laugh.\nHouse Bill 19, what you have a four-year green front, is the Senate\nAppropriations Committee Substitute to House Bill 19. Let me just run you through it generally. We'll talk about a few other specifics and see if you have any questions.\nThis is the FY24 budget. Remember it's a $32.4 billion proposal.\nIt supports law and order. It protects our families, supports our children, and\nfiguratively and literally gives them hope.\nThe big picture I think it's fair to say is that the Senate version more closely reflects\nthe governor's version than the House, but that's not to say we didn't pick up the nuggets\nof wisdom from the House where we could.\nAreas where we more closely reflect the governor's budget, we were able to replace funding\npulled from Medicaid, we were able to replace and add to the reinsurance program supported\nby the governor at the office of Commissioner of Insurance.\nWe were able to return hope to 100% funding for students with a V average, which was a proposal\nby the governor, and we were able to support the governor's $2,000 raise for all state-funded\nemployees.\nLet me walk you through a few of the details just in policy areas.\nIn health, in Medicaid, ABD, we restored utilization cost cuts in ABD low income Medicaid and\npeach care.\nWe allowed for the reimbursement of OTAs, that's occupational therapy assistance, and physical\ntherapy assistance, providing services for Medicaid members, receiving children's intervention\nservices, CIS, another abbreviation for Medicaid, and creating parity with our surrounding\nstates. In the state health benefit plan, we shored up the state health benefit plan\nto a tune of $1 billion. We talked about this during the amended phase too. At DHS, we\nworked with our friends at DHS, DCH, and with the Office of Health Strategies to begin\nplan to address a structural deficit at our child carrying institutions in our state\nand allow for better placements and care for children with more federal support for foster\ncare maintenance payments while funding the current cost of this deficit for a six month\nperiod. At DPH we matched the house and actually doubled funds for reimbursement rates in\nthe baby's can't wait program to help support early intervention for infants and toddlers\nspecial needs. Also at DCH we continued our support for\nhoteling and ending that practice with a $5 million ad there. As of this\nminute we have 14 children who are in state care who are sitting in an\nemergency room. That is not their best care. It's not the highest and best use of\nour funds and we are going to continue to pound that point with our state\ncontractors so that they can remove these children from an ER where they are not\ngetting care so a place where they can get the care they need because their lives\nliterally depend on it. At Behavioral Health the Senate version supports over\n$40 million to address mental health staffing facility needs and others. We\nheld the line with the House on increases to our home and community-based\nservice providers and the Senate budget also funds now 500 now-comp waivers\nwhich was a position point championed by the Senator from the 56th and the\nSenator from the 40th in a bipartisan fashion and was probably the one item that\nI received more letters on from you members than any other singular item. In\neducation at the K-12 level, for the second year in the row the Senate's\nversion supports a position that allows for no austerity in the QBE formula and\nand teachers receive a $2,000 salary raise.\nThis budget also makes significant progress towards screening\nof all adult of all children from kindergarten to third grade\nfor dyslexia.\nYou'll remember as the senator from the 42nd has told us\nmany times that we passed SB 48 with an end date\nfor making sure we screened all children by third grade\nby FY25.\nThe Senate committee version you have before you now fully\nfunds that measure one year early and support\nscreening, dyslexia screening for all children from\nkindergarten to third grade.\nThe Senate version also provides not just support for the\nCouncil on Literacy champion by the Senator from the\nfourth, but operation funding and a directive to work\npursuant to Senate Bill 211 and monies to support that\nendeavor at over a million dollars.\nWe believe that literacy is important, SB 48 and SB 211\ndon't we believe dovetail to make sure we have an educated and competent workforce for\nall the jobs that the governor is so eloquently bringing to Georgia.\nAt higher education the Senate's budget returns to the governor's position as I told you\nsupporting a 100% factor rate for prior to your tuition for the hope grant and for the\nhope scholarships for public schools. At public libraries the Senate version also supports\nanother nickel raise to take the book allowance, as we commonly call it, to $0.70 per capita\nfor a total of $7.7 million.\nThe Senate's budget also recognizes that certain TCSG fields cost more, and it provides additional\nfunds to TCSG to recognize the high cost of delivering CDL and nursing programs, which\nare both careers which are desperately needed and in demand.\nWe funded the aviation side of that last year.\nThe Senate's budget supports conservative budgeting as well by requesting our Board of Regents utilize carried forward funds to support their teaching formula and\nconserve valuable state dollars at a time of significant financial turmoil and uncertainty.\nWe also expect continued discussions with the governor's office and the house concerning the funding of state buildings.\nThere are a couple of planning ads in this budget and we want to make sure that if we're adding planning dollars that we're able to support the buildings that would\nfollowed behind those planning dollar additions.\nIn public safety, the Senate's committee version\nsupports technological and data management upgrades\nat our courts.\nIt supports a $6,000 increase for state troopers, capital\npolice, DNR rangers, and our GBI folks.\nWe weren't trying to single anyone out\nand make them seem more important than the others,\nbut we want to recognize the hard work\nand the duties, increased duties we have placed\non these individuals, particularly over the past two years.\nWe were able to fund this by reducing our funding towards troopers schools.\nAnd it's logical and sincere in the reason we did this.\nWe believe that keeping our experienced law enforcement matters, and there is a learning\ncurve when we bring more troopers on.\nWe don't get to create state dollars in this budget.\nSo we were able to take a portion of the $11 million that we annually use to support\ntrooper schools and use that for the pay raises.\nNow those pay raises, $11 million is not enough to cover everyone.\nSo we did have to pick and choose and we chose to focus on those whose job duties increased\nthe most we feel over the past two years.\nThe Senate version of the budget also funds a cold case unit at the GBI, various scientists\nposition for the crime labs and bonds to improve the crime lab, the GBI crime lab in\nMacon, which we know has been championed by the senator from the 26th.\nIn economic development, the state budget creates a program to improve natural gas\naccess in rural communities, acknowledging because of the governor's incredible success\non broadband, natural gas is becoming this generation's broadband issue.\nWe used to talk about could we provide cell service to each community, then we talked\nabout could we provide broadband to each community, because of the extreme success of the\ngovernor and this body, we've almost done that.\nAnd natural gas is becoming the next titan of utilities that we're going to have to tackle.\nWe also support our growing EV industry by transitioning certain unfilled positions at\nregional economic development projects that haven't been filled yet to other regional\neconomic development projects in other areas of the state.\nAt the Department of Ag, we funded the Department of Ag's needs and forced soul amendment rules.\nWe also increased COLA's at Department of Natural Resources for Game Wardens, as I mentioned,\nand then back over to Ag, we supported funding for blueberry, citrus, and peach positions.\nThere are other areas of the budget where we were able to add as well.\nOur statewide independent living council, they have a wait list of about 700 individuals.\nBy moving and not funding certain positions that have not yet been filled by pulling\nback those funds, we were able to clear the 700 person wait list at the statewide independent\nliving council.\nWe were also able to make a commitment to reduce state liabilities by committing $5 million\nfor a continued reduction of state workers' comp liabilities at DOAS.\nThe Senate's budget also provides a one-time benefit of $26.75 million for eligible state\nretirees and recognizes that ERS coales are now being pre-funded by employer contributions.\nWe were able to increase funds to the Georgia Food Bank program, which has been championed\nby many, including the Senator from the 44th.\nI asked, but certainly not least, one of the other items I want to point out is that\nthe Senate version of this Senate committee version proposes that we recognize $11 million\nfor transit in project areas outside of Atlanta.\nIt's a novel idea.\nOur Commissioner of Department of Transportation has championed this.\nWe send out DHS vehicles to move people for non-emergent reasons.\nWe also have Department of Transportation vehicles that we use for non-emergent regions.\nWe also do that through other various DHS agencies.\nThe Department of Transportation has come up with a plan by looking at other models that\nit's, I would call it Uber-esque in its essence of saying, hey, if we're already running\nin this vehicle there, why aren't we double track overing with another agency to do the\nsame thing? Why didn't we not just try to grab two people with the same ride? And we've\nput $11 million towards that project outside of the metro area.\nTalk to you a lot about the ads. Well, where do we get these funds? We don't get to create\ndollars and the Senate doesn't have its own printing press. The credit for this goes\nto our staff. We have a staff of eight at the Senate budget office that's headed by Brent\nchurch well, but there's more than that. You know Austin, Courtney, Lindsey, Martha\nGrace, Mary, Sonny, Caitlin, Carly, and Noah, and then of course Miss Angela and Abby\nwho work directly in our office. They spent hours combing state budgets to figure out who'd\nalready been hired, who had not been hired, where we could, what funds have been it-spended,\nwhat funds were surplus to help create the dollars that you see to fund the projects\nthat you specifically asked for for you and your districts here. And I want to give them\naround of applause until then thank you for all their work.\nAnd there's other areas that we had to find savings too, you know, we can't just find\nall the savings based upon positions not yet hired.\nSo we didn't agree with a few house ads.\nWe also were able to find some FMAP changes, the Senate going last is able to have the\nmost updated information on FMAP and we were able to create a few savings there.\nAs I already told you, we trued up the dollars of hired and unfilled positions.\nWe used conservative budgeting at our largest agencies and pointed them sometimes to other\nfunds.\nWe held the house's reduction at airport aid and we provided the same percentage to\nreduction for railroads.\nWe pulled funds that were committed to the criminal data exchange program due to legislative\nchanges in governance and plan to put those back when that legislative change in governance\nis complete.\nWe also reduced funds for program expenditures like the Georgia Coordinating Center which\nnow has run its time and the Georgia Cyber Center which made a commitment to us early\non that after several years they will be able to support them cell phone rents and we're\nnow going to move them to that part of their budget.\nas well as a reduction at Georgia Public Television\nbased on testimony and current requests.\nWe also reduced the testing budget.\nWhy did we do that?\nWell, it's a recognition of this body's continued reduction\nof testing requirements on our students and teachers.\nAnd if we're gonna reduce those requirements,\nthen the budget should commiserately follow.\nThe budget before you now is one that, again,\nI feel promotes safety for our state.\nIt gives our students hope the pun is intended.\nAnd it makes sure that our state is in a position\nto weather storms that may come over the next 12 or 24 months.\nAs we see those clouds that were gray,\nget darker and darker on the horizon.\nI appreciate the governor and his insight and forethought\ninto the plan and the conservative values\nthat it represented before it ever even\ncame to our body for consideration.\nAppreciate the staff at OPB who have been open to answer any questions that we've had in this process.\nAnd I know the hours and months of work that they've put in.\nAnd also want to commend and thank Christine Murdoch at House Budget Office and\nChairman Matt Hatchet, who have been open to this process as we've ran as fast as we possibly could.\nYou know that normally it takes 16 days for the Senate to work through our eight committee process and\nmake sure we've trueed everything up.\nWe have a little slogan, we say, two weeks, two days.\nAnd that's how long it takes from the day the House\nhands it to us the day we can roll it out in this committee.\nWe were handed the budget on March 10th.\nThat would mean March 26th would be the quickest we can do it.\nBecause of your hard work and the hard work of our staff\nand our friends who've helped us along the way at OPB and the\nHouse Budget Office, we've been able to do that five days\nfaster or 33% faster than we've ever done it before.\nAnd again, that's a tribute to you\nand it's a tribute to our staff\nwho probably are just about functioning\nat the level of exhaustion.\nThank you again for the letters you wrote.\nWe've tried to work them in.\nI think you'll see them reflected\nif you have specific project requests.\nI'm happy to talk to you about them offline,\nbut I've seen many of you've already turned to the bonds\nand know what you're looking at to begin with.\nSo if there are no further questions,\nI'll take a motion.\nMotion by Senator Dugan, is there a second?\nSecond by Senator Gaines, any further discussion or questions?\nOkay, all those in favor of the Senate\nappropriations committee substitute,\nHouse Bill 19 as presented, please say aye.\nOpposed, no.\nThank you so much, I've got to have a great afternoon.\nYou\nYou\nYou\n",
  "updated_at": "2026-02-12T03:19:52.237487+00:00"
}