{
  "video_id": "cB6V5JAgp6w",
  "url": "https://www.youtube.com/watch?v=cB6V5JAgp6w",
  "title": "03/20/2025 Sen. James  Press Conference on Film Day",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 8,
  "summary": "Overview:\nThe Georgia legislature held a press conference to celebrate \"Film Day\" and highlight the significant impact of the film industry in the state. Lawmakers emphasized the industry's economic contributions, job creation, and Georgia's status as a top filming destination.\n\nKey Actions:\nNo specific legislation was mentioned.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- State Representative Long Tran and Senator Danzala James co-hosted the event, joined by other state legislators.\n- The event honored the late Steve Messer, who had been instrumental in supporting the film industry in Georgia.\n- Speakers included Rep. Kim Skofield, Rep. Angela Moore, and Darius Evans, the president of the Georgia Production Partnership.\n- Lawmakers praised the film industry's economic impact, with the industry generating over $4.1 billion in direct spending in the state last year.\n- Legislators expressed their continued support for the film industry and commitment to keeping Georgia a top filming location.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nThe event was a press conference, not a legislative session. No adjournment information was provided.",
  "transcript": "Good afternoon everyone or good morning everyone sorry jump in ahead. My name is\nLong Tran State Representative of House District 80 thank you for being here\nthis morning. We're here to celebrate film in Atlanta it's such an important\nindustry to us. Last year it provided over 2.6 billion in spending over 60\nthousand work in the film industry and provides over $800 million in to Georgia's GDP.\nI'm going to give you a little run of show today. I also want to thank Senator Danzala James\nfor co-hosting today with me as well as state representative Kim Skowfield, Shea Ginedaña,\nKim Alexander, Yasmin Nioh and Angela Moore. But today we are going to this morning be\nhonoring Steve Mench who we lost last year in both the Senate and House chambers at 10 a.m.\nAnd then at 1 p.m. today, there'll be a meeting greet with the state legislature in room 216 at 1 p.m.\nAnd I'd like to quickly recognize Lee Thomas from our film office. And then tonight at Atlanta\nCity Hall will have our film day over at City Hall at 5.30 p.m. So Senator James if you'll make some remarks.\nGood morning. I greet you all and I'm honored to join today with my colleague in the house\nand we are thrilled to celebrate the film industry day.\nI'm honored, always, to see the incredible impact\nthat Georgia Film Industry has had on our state.\nOver the years, Georgia has become a top destination\nfor the film and television industry,\ncreated opportunities for countless\nGeorgians and boosting our economy\nhere in the state of Georgia. In ways that you could never imagine\nmost people think it's just the actors and the\nperson behind the camera but no. There's so many other jobs that have been created\nby one thing that the legislature did and I'm glad I was the second\nsign on it and that was when we pass the bill to give tax credits to the film industry\nand we wanted to kind of give them an incentive to come to Georgia and it's working because\nlast year alone the film industry generated and astonished, I can't even pronounce it right\nNow, astonishing $4.1 billion in direct spending.\nAmen?\nContinuous.\nAnd we continue here in the state of Georgia\nto ask the top filming locations in the nation.\nWe're very proud to be in front of Hollywood,\nin front of New York, or standing alongside of them.\nSo thank you very much for joining us\nfor Film Day at the Capitol.\nGeorgia is continuing to move forward\nand to lift up our film industry.\nThank you.\nI need the water.\nThank you.\nAnd now.\nGood morning.\nI am Georgia State Representative Kim Schofio representing District 63, which includes\nFulton County, City of Atlanta.\nHappy film day at the Capitol.\nWe are so excited today to recognize those in an industry that has made Georgia proud.\nThose that are working in the film industry, those that are vendors in the film industry,\nthose from top down, we're happy today to celebrate you.\nAs Senator James has said, the film industry has brought in significant dollars here in\nthe state of Georgia.\nWe continue to work hard through all of the avenues, whether it's independent films, whether\nit's films that are coming through our major studios, our upstart studios, our production\ncompanies.\nWe've got amazing opportunities here in the state of Georgia that we're taking advantage\nof.\nfield organizations like the Black Entertainment Economic Council is doing\nphenomenal work to ensure that minority representative representation is\nacross the board. We have a lot of people that are in the industry as a whole when\nit comes to being trained. We are the best and we have the talent. There's no need\nto go further. Georgia is your stop. So today I am excited and proud to\nto stand with our colleagues as we embrace\nand we grow and we move forward in the film industry.\nLet's continue to keep Georgia on our minds\nwhen it comes to filming and making a reputable mark\nthat can never ever be erased in Georgia.\nI support the film industry 150%.\nThank you.\nThank you.\nThank you, Rep. Moore.\nI'd also like to thank Georgia Production Partnership\nfor organizing Film Week.\nThis week it's been a week of celebrating Film\nthroughout Georgia and they help make today happen\nat the Capitol and later tonight at City Hall.\nI'd like to introduce you all to you,\nthe president of GPP, Darius Evans.\nThank you and good morning.\nAgain, I'm Darius Evans,\nI'm president of the Georgia Production Partnership.\nAnd first we'd like to thank Representative Tran,\nRepresentative Scofield and Senator James for hosting\nfilm day here at the Capitol of the Day.\nWe're happy to be here.\nAnd today, this is a day that not only highlights\nGeorgia's thriving film industry, but we also\nare honoring the organizations that make the success\nin the state possible.\nOne such organization is ours, GPP.\nFor nearly 30 years, GPP has been the driving force behind\nbuilding Georgia's film community.\nWe, from advocating for the Georgia Entertainment Tax Credit,\nwhich has brought billions in production spending to our state,\nto fostering a network of industry professionals,\nGPP has worked tirelessly to create opportunities for filmmakers,\ncrews, and businesses alike.\nToday, we celebrate those achievements\nand the incredible people who make this industry thrive\nAnd on behalf of GPP, again, I'd like to thank our legislators,\nour industry partners, and the dedicated professionals who have worked to make Georgia one of the top filming destinations in the world.\nWe have multiple activities that have already happened this week, and we're culminating in with our celebration this evening at City Hall at 530.\nWe hope everyone will join us.\nThank you very much.\nThank you, we hope to see you this afternoon at 1 p.m. and room 216 and then later on at 530 at City Hall. Thank you.\nAlso, please join us in the Senate Chambers at 11 a.m. this morning where we are going to\ngoing to honor the film industry,\nbut not only the film industry, but Steve Messer.\nAnd we lost him a few months ago,\nbut he lives on and on.\nAnd all of the hard work that he did with the film industry\nis going to continue to live on.\nThank you.\nThank you, Senator James.\nThank you.\nThank you.\n",
  "updated_at": "2026-02-12T18:54:23.004168+00:00"
}