{
  "video_id": "CbI86lQKHsg",
  "url": "https://youtu.be/CbI86lQKHsg",
  "title": "Georgia House - Day 21 (2026-02-28)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 21,
  "video_date": "2026-02-28",
  "duration_minutes": 134,
  "summary": "Overview:\nThe Georgia House session on 2026-02-28 focused on routine procedures and opening the legislative day, with a notable prayer by the chaplain emphasizing unity and compassion in serving the diverse citizens of Georgia.\n\nKey Actions:\n**HB 987**: No substantive legislation passed or referred.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- The chaplain, Pastor and Doctor Thurman, delivered a thought-provoking sermon using a \"fish story\" to encourage the legislators to recognize their shared humanity and work towards unity in serving the diverse citizens of Georgia.\n- The chaplain's prayer asked for the legislators to have wisdom, compassion, and courage in their work.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nThe session began with a quorum present, as all members were instructed to report to the House floor.\n\nAdjournment:\nThe session adjourned, with the next session date unspecified.",
  "transcript": "The hour of convening, having arrived all members of the House, will please report to the House and take seats all members of the House. Will please report to the floor and be seated. The clerk will ring the bell. All members of the House will please report to the floor. Take your seats because we are now going to have the morning roll call. All members of the President will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Can someone vote representative Uyards machine? Will all members vote? Have all members voted? If so, the clerk will lock the machines. Well good morning. What a beautiful day to be in Georgia on a Friday and the sun is shining and we got a weekend to come up and life is good. We are going to begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 160 second House District representative Carl Gilljard representative Gilljard. Thank you Mr. Speaker and good morning my brothers and sisters of the Georgia General Assembly. If I ask the eloquent question that might become a bonnic and I said how many Republicans in the House raise your hand? If I said how many Democrats in the House raise your hand? But if I said how many believers in the House stand to your feet and clap your hands? I get excited about that part, Don. Mr. Speaker I get excited about that part that we all got children, right? This is the best part when I first came to the House of Representatives. I got an opportunity to tell my family and home. We have church every morning. We have the Word of God. We pray every morning. And the best part about this is receiving the messenger. And so today I don't know about you but I know I need a word from the Lord. And so I want to welcome my brother, my friend and Mr. Speaker there are times that I come home to Savannah and I'll place a phone call and I'll say pass a thermon. Would you pray for the state of Georgia and the House of Representatives? And he says I'll do a little bit better than that. Why don't we pray right now? And so today I'm glad to have a ministry that made me and there's no place like the Paul. They say St. Paul, see me. And they say they just bought a few people with them. But I'm elated on your desk you have his bio. There no long words to explain. This humble man of God, he's with his first lady and only lady, the first lady thermon is here on today. Would you give her a hand? They have their son from more house. University is here on the day. His twin is here. you stand. His sister is here on the other side who tells everybody in the house what to do. Amen. And his friend is here today as a student of Spellman University. So I do want to take no more of your time to present the pastor, the chaplain of the day, my dear brother and friend from the great city of Augusta, Georgia. Am I correct? By ways of Augusta, Georgia. Everybody from Augusta, let me hear you say a man. Pastor and doctor, Thurman as he comes to give you the word from the Lord. Would you greet him? Good morning. Thank you, Mr. Speaker for this high honor and certainly Mr. Guillard, my brother and friend. Speaker Ralston, I ask you where you're a fisherman and you told me that you are from the trout capital of the world. And so if it's okay with you, I'd like to give a fish story this morning. David Foster Wallace tells the story that two young fish are swimming along one day and they happen to meet an older fish swimming in the opposite direction. The older fish, noticing these two young, vibrant and bright individuals nods at them in recognition and says, good morning, how's the water? The two young fish are caught off guard by the older fish's greeting and question and they simply smile and keep on swimming. A few moments later, after they are a distance from the older fish, one of the younger fish looks at his friend and says, what is water? Perhaps the point of that simple fish story is that most often, the most obvious, important and vital realities of our shared experience are the various ones, the very ones that are the hardest to see, most difficult to speak about and the first to be ignored. As you gather this morning for the work of making our beloved state even better than it already is, as you debate and legislate to create a more perfect union, as you labor and lead to elevate the state of Georgia to greater heights and new levels, I pray this morning that the rhetorical question you will ask each other is not what is the water, but how is the water that we share? I hope you will seek that the proverbial water for the citizens of each legislative district will be clear, flowing and vibrant. I pray that the proverbial water for the Georgians you serve will be buoyant and teaming with life, liberty and the pursuit of happiness. I pray that the proverbial water for the great people of our state you represent will be filled with bountiful opportunities and ample examples of the American dream that our ancestors so desired. Exodus chapter number two reminds us that one day Pharaoh's daughter was walking along the banks of the Nile River and she saw a basket with a baby floating in the water. Interestingly, in that moment, she did not see the child's heritage nor history, but she saw the child's humanity. Though public policy and societal position may have separated them, Pharaoh's daughter's recognition of that baby's humanity united them. Though they did not bear the same religious beliefs or even have the same worship rituals, Pharaoh's daughter's awareness of that baby's humanity connected them. Perhaps the greatest story of liberation ever known to humankind, the journey of the children of Israel from Egyptian bondage to the Promised Land was in part facilitated by the conscientious decision of the daughter of Pharaoh to careful one that was born into poverty and persecution. On that day, she decided that the water they share would not become a cemetery, but a birth canal. She decided that the water they share would not become a place of death, but a river of life. She made up in her mind that the water they share would not become a place where differences predominate, but where similarities orchestrate their lives together. And so she had compassion on that baby in the water that day and she named him Moses for she drew him out of the water. And so this morning, I pray you'll ask the question, how is the water in Savannah and how is the water in Sylvania? How is the water in Rome and how is the water in Roiston? How is the water in Augusta and how is the water in Albany? How is it in Carleton and Columbus? How is it in Macon and Millageville and even in Atlanta? And as you continue to practice not separation because of our diversity, but unity because of our humanity, Georgia will be the state where justice will roll down light waters and righteousness like an ever flowing stream. Would you join me in prayer? Gracious and giving God, today we thank you for the blessing of what we call today. Thank you for the gathering of all those who have come concerned with the people in business of this state. Oh God grant these legislators wisdom to discern what is not always visible, compassion to feel what is not always understandable and courage to do what is not always popular. Amen. Pledge leads to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. The Chair recognizes doorkeepers can unlock the doors. I'm going to hurry to get out of here. We'll lock everybody in and might get done quicker. Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits. Mr. Spaker, your committee on information and audits read the preceding proceedings of the previous legislative day and found them to be correct. Chairman Hogan, the Chair of the Committee on Information and Audits reports that the Journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The Chair here is not and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns, on our 59th month's final to be established is the order of business to earn the first part of the period unanimous consensus. Introduction to bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The Chair here is not and the resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 1055 by RIP is in Jasper's, the 11th Carper in the 4th. Tarvan in the 2nd. Bill B. Tidal Nack to amend Part 14, Particle 6, Chapter 2, Title 20, the Fischkoda, Georgia, and Tady relating me, other educational programs under the Equality Basic Education Act. Education. House Bill 1056 by RIP, Senate of Harold, the 106, Bill B. Tidal Nack to amend Chapter 8, Title 48, the Fischkoda, Georgia, and Tady relating the sales and use taxes. Ways and means. House Bill 1057 by RIP, Senate of Rose, 120, Fleming, and 121st, Erwin, 28, Fry, 118th. Bill B. Tidal Nack to amend our 3th Chapter 12, Title 2, the Fischkoda, Georgia, and Tady relating the sales and use taxes. House Bill 1058 by RIP, Senate of Stilcock, the 50 second, Willisky, the 79th. Bill B. Tidal Nack to amend Part 1 of Article 3, Chapter 5, the 50th, Fischkoda, Georgia, and Tady relating the general authority. Governmental affairs. House Bill 1059 by RIP, Senate of Erhard, the 36th, Act of Stilcock, the 50th Second, Taylor, the 73rd, Mathy Act, the 73rd. Bill B. Tidal Nack to amend Article 33, Chapter 2, Title 20, Fischkoda, Georgia, and Tady relating the Georgia, Special Need, Scholarship Act. Education. House Bill 1060, B. Tidal Nack to amend Title 31, Fischkoda, Georgia, and Tady relating the Georgia, Special Need, Scholarship Act. Education. House Bill 1060 by RIP, Senate of Erhard, 36th, P. Trey, the 166th, and others. Bill B. Tidal Nack to amend Title 31 of the Fischkoda, Georgia, and Tady relating the health. Health and human services. Title 1061 by RIP, Williamson, the 115th, Bill B. Tidal Nack to amend Article 1, Chapter 2, Title 48 of Fischkoda, Georgia, and Tady relating the to state administrative organization. Ways and Main. House Bill 1062 by RIP, Senate of Meeks, the 178th, Hogan of the Hunts, 79th, Scyth, and 180th, Burns, 159th, and Corv. of the Hunts, 74th. Bill B. Tidal Nack to amend Part 1 of Article 2, Chapter 8 of Title 12, the Fischkoda, Georgia, and Tady relating the general provisions relative to solid waste management. National Resources and Environment. House Bill 1063 by RIP, Senate of Parks, the 101st, Clark, the 100th, and 8th, more than 95th, McLaren, and the 51st, Canada, the 100th, Second, and others. Bill B. Tidal Nack to amend Article 7, Chapter 4, Title 49 of Fischkoda, Georgia, and Tady relating to medical assistance generally. Heldt in Human Services. House Bill 1064 by RIP, Senate of Jackson, and the 64th, Ways and Main, the 63rd, Scofield of 60th, Kendrick, and 93rd, Bernal of the 77th and others. Bill B. Tidal Nack to amend, Title 16, 20, and 31 of Fischkoda, Georgia, and Tady relating to crimes and offences. Regulated Industries. House Bill 1065 by RIP, Senate of Smith, the 41st, Wilkinson, 38th, Lopez, Romero, the 99th, Roba Show, the 48th, and 189th. Bill B. Tidal Nack to amend, Code Section 22, 210, the Fischkoda, Georgia, and Tady relating to annual performance evaluations. Education. House Bill 1066 by RIP, Senate of Parks, the 44th, and Holcomb, the 81st. Bill B. Tidal Nack to amend, Article 2, Chapter 7, Title 48, Fischkoda, Georgia, and Tady relating to imposition rate computation, and exceptions from state income tax. Ways and Main, House Bill 1067 by RIP, Senate of Parks, the 44th, Holcomb, and the 81st, and Jones of the 25th. Bill B. Tidal Nack to amend, Article 2, Chapter 7, Title 48, Fischkoda, Georgia, and Tady relating to imposition rate computation, and exceptions from state income taxes. Ways and Main, House Bill 1068 by RIP, Senate of Abstration of the 104th, Bill B. Tidal Nack to amend, Article 1, Chapter 7, Title 19, the Fischkoda, Georgia, and Tady relating to general provisions regarding parent and child relationships. Juvenile Justice. House, a resolution 1300 by Representative Perkule, 155th, Dunahue, the 30th, Work Hides, and the 157th, Jones, the 167th. A resolution authorizing the change, abuse of certain property located in state properties. House, Resolution 1301 by Representative Smirie, 135th Buckner, 137th, Hugley, 136th. Smith, 134th, Smith, 133rd, Resolution urging the Georgia General Assembly, and the United States Corps of Engineers. Natural resources and environment. House, Resolution 1302 by Representative Dempsey, the 13th, Jones, the 53rd, Cooper, the 43rd, England, 116th, and Newton, 1123rd. A resolution creating that joint study committee on chronic weight management and type 2 diabetes. Health and human services. House, Resolution 1303 by Representative Carson, the 46th, Harold, the 106th, a resolution creating a House study committee on the collection of public utility, ad, valorum, taxes. Ways and means House, Resolution 1304 by Representative, Knight of the 130th, Resolution proposing an amendment to the Constitution. Ways and means. Senate Bill 316 by Senator Thompson, the 14th, Miller of the 49th, Alvers, the 56th, Mullis, the 53rd, Karpatric, the 32nd, and others. They'll be taught on Act 2, MENT, Title 43, the Fish, Go to Georgia, Antidio, Lidding, Professions, and Businesses. Governmental Affairs. Senate Bill 320 by Senator Payne, the 54th, Mullis, the 53rd, Ligon of the 3rd, Robertson, the 29th, Cowsford, the 46th, and others. They'll be taught on Act 2, Chapter 1, Title 42, the Fish, Go to Georgia, Antidio, relating the Sexual Offender Registration Review Board. Judiciary non-sevel. Senate Bill 377 by Senator Jones, the 25th, Burk, the 11th, Mullis, the 53rd, Robus, the 29th, Karpatric, the 32nd. They'll be taught on Act 2, MENT, Go to Section 8, 2, 102, the Fish, Go to Georgia, Antidio, relating to inspections. Insurance. That completes first readers. Second reading of Bales and Resolutions, the Clark-Wreed. House Bill 13, House Bill 1031 by Representative Evans of the 83rd, Irwin of the 28th, McLean of the 51st, Williams of the 145th, Hitchens of the 160th, others of Bill relating to procedure for changing any rate, charge classification, or service, and recovery of financing costs. House Bill 1032 by Representative Hatchett of the 150th in England of the 116th, a bill relating to requirements or permits to operate certain health care related institutions. House Bill 1033 by Representative Ayerhart of the 36th, Reaves of the 34th, and all the way to the 42nd. Wilkerson of the 38th, Carson of the 46th, and others. A bill to amend and act to create the State Court of Cobb County. House Bill 1034 by Representative Warke Heiser of the 157th, a bill relating to regulation of employment of minors. House Bill 1035 by Representative Martin of the 49th, a bill relating to sales and use taxes. House Bill 1036 by Representative Tarvan of the 2nd, sets for the 35th, Harold 106, Welch of the 110th, Estration of the 104th, and others. A bill relating to the Georgia Uniform Civil Forfeiture Procedure Act. House Bill 1037 by Representative Dollar of the 45th, Stevens of the 164th, Selcox of the 52nd, Williams of the 168, Fri of the 118th, a bill relating to the Georgia Entertainment Industry Investment Act. House Bill 1038 by Representative Dreyer of the 59th, Selcox of the 52nd, Jones of the 25th, pairs of the 142nd, bar of the 103rd, and others. A bill relating to county boards of tax assessors. House Bill 1039 by Representative Watson of the 172nd, roads of the 120th, Lehoed of the 175th, Corbord of the 174th, Perchette of the 176, a bill relating to automatic renewal provisions. House Bill 1040 by Representative Dunhu of the 30th, Fleming of the 121st, Hawkins of the 27th, gravely of the 67th, thumbs of the 12th and others. A bill relating to agreements for probation services. House Bill 1041 by Representative Matthewc of the 73rd, controlled the 22nd, Bonner of the 72nd, and Williams of the 145th, a bill relating to sale, or distribution of harmful materials to minors. House Bill 1042 by Representative Rolston of the 7th, a bill to authorize the governing authority of Fannie and County to leviate excise tax. House Bill 1043 by Representative Rolston of the 7th, a bill to amend and act, providing for the election of members of the Board of Education, a Fannie and County. House Bill 1044 by Representative Carson of the 46th, a bill relating to sales and use taxes. House Bill 1045 by Representative Hogan of the 179th, Sains of the 180th, Williams of the 168th, Petrie of the 166th, Stevens of the 164th and others, a bill relating to the funding of services, or production of advolomate taxes, and unincorporated areas of counties, and powers and duties of governing authority. House Bill 1046 by Representative Howard of the 124th, Williams of the 145th, dukely of the 136th, Beverly of the 143rd, Welch of the 110th, a bill relating to petroleum products. House Bill 1047 by Representative Hatcher of the 150th, a bill relating to Reformation, modification, division, consolidation, and termination of trusts. House Bill 1048 by Representative Basemore of the 63rd, Bruce of the 61st, Bowdie of the 62nd, Jackson of the 64th, Mets of the 55th, a bill relating to home rule powers. House Bill 1049 by Representative Mataham of the 17th, Parsons of the 44th, Hitchens of the 161st, Gallaud of the 19th, Homes of the 129th and others, a bill relating to military, in emergency management, and veteran affairs, and state government. House Bill 1050 by Representative Lumson, the 12th, Carson of the 46th, Hockens of the 27th, Taylor of the 173rd, Williams of the 148th, a bill relating to Georgia life and health insurance, Guant Guarantee Association. House Bill 1051 by Representative Williams of the 148th, the bill is providing a new charter for the town of Araby. House Bill 1052 by Representative Parsons of the 44th, Harold the 106th, Blackburn of the 146, a bill relating to exemptions from state sales and use taxes. House Bill 1053 by Representative Wilk Linsky of the 79th, Thomas of the 39th, Fleming of the 121st, Harold the 106th, Hitchens of the 161st and others, a bill relating to offenses against public order. House Bill 1054 by Representative Cooper of the 43rd, Silcox of the 52nd, Martin of the 49th, a bill relating to control of hazardous conditions, preventable disease and metabolic disorders. House Resolution 1281 by Representative Tanner of the 9th, Resolution Dedicating Thunder Road, House Resolution 1282 by Representative Hutchinson of the 177th, Cooper of the 43rd, Lawner of the 72nd, Tramble of the 130th, Sumire of the 135th and others, Resolution creating the House Study Committee on evaluating, simplifying, and eliminating duplication of regulatory requirements for mental health and social service providers. House Resolution 1283 by Representative Matthew of the 73rd, Knight of the 130th, Lawner of the 72nd, Poland of the 131st, single of the 71st, Resolution honoring the life of Dr. Randy Valmont dedicating a road in his memory. And Senate Bill 399 by Senator Harbison of the 15th, a bill to amend and act to create a board of elections and registration for Macon County, through 2nd Readers. The Senate bill will be approved by the Senate. Reports of Standing Committees, the clerk will read. Representative Arknan, to the 123rd District Chairman of the Committee on Access to Quality Healthcare, submitted the following report, we'll speak to your committee on Access to Quality Healthcare, here is that on consideration, following bills of the house, as instructed me to report the same backthos to following recommendations. House Bill 882 passed by committee substitute, House Bill 982 passed by committee substitute, House Bill 946, House Bill 947, do pass, House Bill 952 do pass, respectfully submit, Representative Mark Newton, with 123rd District Chairman, Representative Rick Jasper, the 11th District Chairman of Committee on Education submitted the following report. Mr. Speaker, your committee on education has had an consideration following bills of the house. Mr. Struck to meet you to report the same backthos following recommendations. House Bill 957 do pass by substitute, House Bill 852 passed by substitute, House Bill 755 do pass by substitute, respectfully submitted, Representative Rick Jasper, the 11th District Chairman. Representative Jan Tuyker, the 160th District Chairman on Committee and Intercom and coordination local submitted the following report. Mr. Speaker, your committee on intercom and coordination locals and a consideration following bills of the house in the Senate. Mr. Struck to meet you to report the same backthos following recommendations. House Bill 952 passed, House Bill 990, do pass, House Bill 1000, do pass, House Bill 1000, do pass, House Bill 1000, 16 do pass, House Bill 1019, do pass, Senate Bill 304, do pass, respectfully submitted, Representative Jan Tuyker, firstly the 160th District Chairman. Representative Barry Fleming, the 11th 21st District Chairman on Committee on Judiciary submitted the following report. Mr. Speaker, your committee on Judiciary sent a consideration following bill of the Senate. Mr. Struck to meet you to report the same backthos following recommendations. Senate Bill 104 do pass by committee substitute, respectfully submitted, Representative Barry Fleming, the 111st District Chairman. Representative Neffs, the 104th District Chairman on Committee on Judiciary and non-civil submitted the following report. Mr. Speaker, your committee on Judiciary and non-civil, is that a consideration following bills of the House. And it's just struck to me to report the same backthos following recommendations. House Bill 488 do pass by substitute, House Bill 576 do pass by substitute, House Bill 885 do pass by substitute, House Bill 911 do pass by substitute, House Bill 947, 941 do pass by substitute, House Bill 984 do pass by substitute, respectfully submitted, Representative Neffs, the 104th District Chairman. Representative Corbett, the 174th District Chairman on Committee on Motor Vehicles submitted the following report. Mr. Speaker, your committee on motor vehicles has had a consideration following bills of the House. And it's struck to me to report the same backthos following recommendations. House Bill 66 do pass by committee substitute, House Bill 853 do pass, House Bill 877 do pass, respectfully submitted, Representative Corbett, the 174th District Chairman. Representative Benton, the 31st District Chairman on Committee on Retirement submitted the following report. Mr. Speaker, your committee on retirement has had a consideration following bill of the House. And it's struck to me to report the same backthos following recommendations. House Bill 336 do pass by committee substitute, respectfully submitted, Representative Benton, the 31st District Chairman. Representative Brent Harrell, the 166th District Chairman on Committee on Ways and Means submitted the following report. Mr. Speaker, your committee on Ways and Means has had a consideration following bills and resolutions of the House. Mr. Struck to me to report the same backthos following recommendations. House Bill 815 do pass, House Bill 829 do pass by committee substitute.\n\nHouse Resolution 962, due passed by Committee Substitute, respectfully submitted, Representative Brett Harrell, the 160-106 District Chairman. That completes the reading of the Report to Standing Committees. All right, we're going on now to the local calendar. We're going on to the local calendar. Third reading and passage of uncontested local bills. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered the clerk will read the local calendar. House Bill 95 by Representative Irwin of the 28th City of the Homer. House Bill 990 by Representative Meeks of the 178th City of Screbin. House Bill 1000 by Representative Benton of the 31st town of Brassleton. House Bill 105 by Representative Dickie, the 140th City of Forsyth. House Bill 1016 by Representative Perchette of the 176th Ackinson County. House Bill 1019 by Representative Beesmore of the 63rd City of South Folden. House Bill 1010 by Representative DeGrooge of the 51st White County. Is there any objection to the previous question being ordered on the local calendar the chair here is none the previous question is ordered? Is there any objection to agreeing to the Report of the Committee, which was favorable to the passage of the bills, the chair here is none, the Report of the Committee is agreed to. Shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote aye those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so the clerk will lock the machines on the passage of the bills on the local calendar. The eyes are 142 the nasors zero these bills having received the requisite constitutional majority are therefore passed. House will continue to be at order. We're going on now to morning orders going on to morning orders. Members will be limited to one minute each and that will be strictly enforced. Chair recognizes representative Hewgley for a morning order. Good morning. Thank you Mr. Hewgley. Mr. Speaker. I got to say on my mind I guess. Thank you for this opportunity and this is our moment in black history today. I wanted to show you all video and the video would encapsulate all of the areas that African Americans have contributed to in this contribute that video was one minute and 42 seconds so I can't show it to you but I want you to know today that African Americans have been a part of making this country what it is. From the very beginning when 20 African Americans arrived in this country in the bottom of a slave ship we got off the boat and we've been working ever since. And we are a part of this country our history black history is American history and we can't do a justice in one minute but it will continue and you will hear from other members throughout the course of the next few weeks. Thank you I yield well. Chair recognizes representative Stephen Meeks for a morning order. Thank you Mr. Speaker. Good morning. Standing Lawrence grew up drilling the basketball along the dirt road. He had no idea of knowing that his burgeoning skills were one day leading him halfway around the world. He earned a spot starting center where he would routinely throw the crowd with his barrage of slam dunks. His great play earned him a scholarship at the University of Tennessee at Chattanooga and during his four years Lawrence squad reached the NCAA Division I tournament as he earned a degree in criminal justice. After earning a degree Lawrence left for the European leagues and returned to the States in 1985. Lawrence wanted to do two things in life play basketball and be a police officer. In 1990 after leaving pro basketball the father of three daughters traded his jersey for the uniform of Atlanta Police Department officer. His philosophy was simple. Being a police officer is not about taking people to jail but helping people. His most recent assignment suited him quite well as he worked with the police athletic league continuing his love for children and for basketball. Officer Stanley Lawrence known as the Jessup Johnson was killed February 19th at his home in Riverdale. He is the son of Carita Wright Lawrence and the late Joe Lawrence. Please join me in a moment of silence as we remember this giant of a man in life and in basketball. Thank you Mr. Speaker. Chair recognizes representative Bentley for a morning order. Thank you Mr. Speaker and colleagues I access other members of the funeral industry to please join me as today. We are recognizing members of the Georgia funeral services practitioner association and to remind this body that the funeral industry is a very very important industry in the state of Georgia. Representative Rick Williams. Thank you all and if you would stand to be recognized these are special people in the special profession. I represent Millageville Gordon and Eatonton funeral practitioners. Congratulations. Glad you all here this morning. Thank you colleagues and you are all invited to come down to room 230 immediate upon a German to say hello to the funeral directors and have lunch with us. Thank you. Chair recognizes representative Bernal for a morning order. Thank you Mr. Speaker. I congratulate my uncle Maurice Faust who works at the General Motors poll town plant and Hamtramic Michigan. The plant will close today and he will retire after 39 years of service. Thank you. Chair recognizes representative Stovall for a morning order. Thank you Mr. Speaker and members of the house. Today is black male educators day at the state capital. I would like to thank Jason Allen and the other organizations. Data shows that schools with black male teachers have a higher success rate of black boys who matriculate through their schools. The center for black male educators says that black male educators represent 2% of the field. And they are underrepresented in pre K through 12 education for years. The presence of a black male teacher results in better test scores, lower dropout rates, fewer disciplinary issues and more positive views of schooling for children of color. The 2019 Georgia pre K teacher of the year Jonathan Hines is the first black male pre K teacher to win the award in Georgia. Today this event brings awareness to the world to the work black male teachers are doing in the classrooms. Thank you Mr. Speaker and will you all join me in welcoming the black male educators to Georgia. And Georgia. Chair recognizes chairman Seal Cox for a morning order. Thank you Mr. Speaker. I just wanted to come and commend the Atlanta track club for hosting the U.S. Olympic team trials for track and field in Atlanta tomorrow. Among the athletes that are going to be competing will be representative Pat Gardner's niece Allison Krausen. So please come out and cheer on the runners tomorrow. Chair recognizes representative Jenner for a morning order. Thank you Mr. Speaker. During the month of February each day one of our colleagues has taken a moment and shared a significant story or person with us regarding black history month. Today I rise to recognize and celebrate our own black history legends. Can every African American in the chamber rise? Hello. Can every African American in the chamber rise? Mr. Speaker if we could take a moment and look around in our chamber. Each of our extraordinary colleagues epitomizes the purpose of black history which is to make Americans aware of the continued struggle for freedom and equality. I want to thank each of you for your service and each of you for being here today. Thank you Mr. Speaker. Chair recognizes representative Matthew Wilson to introduce the doctor of the day. Thank you Mr. Speaker. It's my privilege today to welcome Dr. Nega Rasuli as our doctor of the day. Dr. Rasuli was born in Naples, Italy. She received her medical degree from Tehran University of medical science. After graduating she moved to the United States to complete her medical education, completing her residency in internal medicine at Mount Sinai St. Luke's in New York and an endocrinology fellowship at the University of Arkansas. Dr. Rasuli is currently an endocrinologist with Kaiser Permanente and we welcome her and thank her for her service here today. Good morning. Thank you all for the warm welcome and thank you for the introduction. It's an honor to be part of this great tradition and serve as a doctor of the day. It's also a privilege to serve the people of Georgia as a member of the South East Permanente Medical Group. While some of you may not be familiar with our practice, we are the largest physician-owned physician-led medical group in Atlanta. I and the other 800 members of my group work with you, not an insurance company, to make your care decision. That has been our model for more than 70 years and I'm proud to be part of that tradition. I practice in Kaiser Permanente Medical offices in Converland and San Luis Spring, which is one of our 26 locations across the Metro-Eston-Ainta. I'm endocrinologist, which is one of 40 specialties who all work together to deliver care to over 300,000 individually Metro-Eston-Ainta in Athens. That number includes almost 40,000 state of Georgia employees and their depends. Thank you so much. The House will continue to be at order in the clerk or read the caption to House Resolution 1-008. House Resolution 1-005. House Resolution 1-05, or a sort of Apollo 32, Hitchens, the 161st, Clark, the 147th, Collins, the 68th, and Williams, the 145th. A resolution commending Assistant Chief Community Supervision Officer Travis Rucker, a being named the Department of Community Supervision's 2019 Officer of the Year and for other purposes. Chair recognizes Chairman Allen Powell for an invite resolution. Thank you so much, Mr. Speaker. Colleagues, it's a great pleasure for me today to recognize the Georgia Department of Community Services 2019 employee of the Year, Travis Rucker. Before I introduce him up in the gallery, we have Assistant Commissioner Scott Meyer, Travis's coordinating Chief Kevin Allen and the Department's external director, Brian Tubes. If you would give them a round of applause, because in recognizing them, you're also recognizing 1,500 certified officers, men and women that serve this state, of trying to correct the behavior of a lot of our other citizens. So, Travis is accompanied by his wife Margie, and there are two sons, David and Caleb, and also the son is bigger than Michael Nale, but Commissioner Michael Nale. Briefly, I want to tell you, Travis has been honorably served this state for 17 years. He's a prime example of the Department's core values of selfless service, accountability, integrity, teamwork, and professional development. He's been awarded the Agitant Instructor Award for the past four graduating basic community supervision officers training classes, and he's a well-respected role model and a minister in the Northern Judicial Circuit. That being said, I'd like to introduce Travis and let him say just a brief word since it's Friday. Good afternoon. Good afternoon, House. I'd like to say, it's honor and the privilege to be here. I also like to thank you guys for this special recognition. Thank you, God, of Commissioner, for this recognition as well, and I appreciate everything. Thank you, Travis. Thank you. Thank you, ladies and gentlemen. Clerk will read the caption to House Resolution 1121. President of Jackson, 128th, in Prince of the 127th, a resolution congratulating the Thomas Jefferson Academy football team on becoming the 2019 G.I.S.A. football state champions and for other purposes. Chair recognizes representative Mack Jackson for an invite resolution. Thank you, Mr. Speaker. Today, Representative Prince and I are proud to introduce to you today Coach Terrence Hensley and the Thomas Jefferson Academy 2019 G.I.S.A. state champions. He's a company with seniors, camera and Evans, Rhett, Willis, Stone Chapman, and Sam Smith. Also in the gallery, the other members are present and I ask that you stand so that they can be recognized. Let's give them a hand. And now we'll have short comments from Coach Hensley. Mr. Speaker and the other members of the House, we want to thank you for the honor and privilege of being here and recognizing us and everything you'll do for the state of Georgia. Thank you. Clerk will read the caption to House Resolution 1307. House Resolution 1307 by Representative Setsler, 35th, a resolution congratulating the Eleetune High School volleyball team for winning the 2019 G.I.S.A. class 6A state volleyball championship and for other purposes. Chair recognizes Chairman Ed Setsler for an invite resolution. Thank you, Mr. Speaker. Ladies and gentlemen of the House, it is an honor today to bring to you a team that's overcome some tough challenges. The 6A state volleyball champions from allotino high school are here with us today. Coach Joe Sully has with him five of his 16 years here at the Rostrum and some more of the players are here in the gallery. Would you guys please stand for us so we can recognize you? Thank you, Mr. President. Thank you, Mr. President. Thank you, Mr. President. I'm sorry you overcame something that I can relate to. My junior in high school, I finished second in the state on a team. But in my senior year, I came back and made that effort to take the next step for state championship and I fell just short. I finished second two years in a row. This team, however, having finished second in these ladies junior year, were committed to completing and really finishing the climb. They came back this year and they won their state 6A volleyball championship. So that true grit and the intensity, the teamwork is evident there. We would like to honor their accomplishments and with that I would like to recognize Coach Joe Sully for some words. Mr. Speaker, my name is Joe Sully. I had volleyball coach allotino high school. First I would like to thank Ed Settler and all of our legislators who continue to support public education and our high school athletes. This state championship would not be possible without each of you who worked tirelessly for the students of Georgia. Our student athletes not only succeed on the court, but they also succeed in the classroom. This group of team has a team GPA of 3.97. We are proud to recognize today in representing allotino high school, the Cobb County School District, and Super Attendant Chris Ragsdale. I would like to thank my team, my players, my coaches for such a hard work and to make this a fun magical season. And lastly I would like to thank our two administrators in the gallery, Principal Candice Wilkes and AD Amy Howard for all your support throughout our state championship season. Thank you and go Bucks. We are now going on to the rules calendar. Going on to the rules calendar. The rules calendar. Clerk will read the caption to House Bill 987. House Bill 987. House Bill 987. I would like to thank the mayor for the protection of elderly persons. Thank you, Mr. Speaker. Chair recognizes the chair of the Health and Human Services Committee, Chairman Cooper, to present the bill. Thank you, Mr. Speaker. Thank you, Mr. Chairman. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would like to thank the mayor for the protection of elderly persons. I would appreciate the Mayor's proposal. It makes and adds things for proving that if you're going to open one of these facilities that you have financial stability and two and that you have that for at least can show two years so that you're not going to have one open and then go bankrupt. It also says that you need to give the residents of these facilities at least 60-day notice if you are having financial difficulties that are leading to a bankruptcy. Elderly people consider these facilities their home. They make friends, they're fragile and they don't need to get one week's notice that they have to go out and find another place to live so it makes provisions for those to stop that problem. It also says that you should have some background in dealing with the elderly with these conditions if you're going to run one of these as an administrator and if you don't have that there is going to be a course that you can take that will be required to make sure that you at least have basic understanding of dealing with frail elderly people and people with dementia. It adds for the first time staffing ratios. Believe it or not they're basically it's been wide open. We are not dealing with people that are up, you know you see these ads for these wonderful facilities and people are having a cocktail parties and gathering around a fire pit like they show for Florida. They do have many of the places, do have these amenities but the people coming to live in them are not the people that have just turned 65. Most of them are waiting till they're in their 70s and they're living longer and they're living into their 80s. And one of the things that happens when you do live into your 80s, over time you gradually lose many of your facilities both mentally and as far as motor skills and those decrease and when those decrease you definitely want to still live.\n\nas independently as possible, but you want help to be available when you need it. We didn't even have a requirement that there had to be two people on staff at all time in these facilities. This bill puts that into effect. It also, for the first time, requires an RN or an LPN, both of which have been specially trained in dementia care to be in these facilities at least some time each week, depending on how large they are. This is one of the areas that I don't totally agree with. If it had been up to me, they would have an RN or an LPN, especially trained there 40 hours a week. But that's probably not a realistic start, considering that there have been no requirements and we have an RN or an LPN shortage. If you have a facility, we've tried to be reasonable. With up to 30 patients, you have to have an RN or an LPN at least eight hours a week. This is not to sit in an office or to work on reports. This is to be out with the patients assessing their ability to move and to interact and their mental competency at all and helping teach other staff members. This is a major movement. This is basically, those features, are basically the provisions of the bill. It does come up with another certificate and that is for memory care units. These are people that have moved way into dementia. They wander. They get lost. They go room to room. If you're not careful if they're in a general assisted living facility, they are out the door and we get report after report of missing patients. These are usually locked wards and they do need a tremendously increased amount of supervision. They will have to now get a certificate from the department. We will know where they are located. We will know the number of people they have and be able to monitor them. There's been a lot of discussion about how many people the department has to check on these facilities. And I would certainly agree with Representative Petrie that we could use more. But if we had 500 more that went every six months to one of these facilities to check on them, we would still have problems if we did not institute many of the provisions of this bill. I'm a nurse. I believe in prevention. This is a proactive approach. Let's get the staffing and the provisions we need to make sure that people living in these facilities have better oversight. And I think we will have less need for people to go in after we have complaints and severe injury are death. If that is the basic part of the bill, I want to think the governor for something else. Besides my colleague and everybody else that has worked on this bill, my colleagues. Since I've been here in the last few years, I always hear we can't find enough staff. We can't find enough staff. This is in the nursing homes assisted living facilities and it's across our state. We have the Hope Grant Program which has identified areas where we have serious needs for different professions. The governor has heard my plea and my request that certified nursing assistance training be added to that list. And as of January 2020, that is one on the list of one of our special needs in Georgia. And now people across Georgia citizens can go to one of our technical schools and take the certified nursing assistance program at no cost to them. So I applaud the governor for this move. It will help us take care of this lack of number of people to work in these facilities. And it will help the in facilities to instigate these new rules. I ask for your favorable vote on the substitute to House Bill 987. And Mr. Speaker, if there are no questions, I will yield a well. You have a number of questions if you care to yield. Mr. Speaker, I'll take a few. Chair recognizes representative Petrie to your left for a question. Thank you, Mr. Speaker. Does the general lady yield? Yes, I do. Is it not true that this bill does not affect any facilities or homes less than 25 beds unless they choose to certify themselves as a memory care unit? That is correct. It does not affect homes under 25 members unless they want to have a certified memory care instance, except in one of the area. We did increase the fines. Right now, if there is a death, not from natural causes, but because of lack of care or mistreatment, the fine is $601. Our fines have not been changed in years and we did increase the fines. And because of the way the fines are written in our state, excuse me, they apply not only to the small homes, but also to our hospitals. And they are raised across the board. Here again, I would have raised them higher. But they are now more like doubled. And so if there would be a death, the fine would be $1,200 and $2. To me, that is still inadequate, but at least it's a start. Do you further you? Yes, sir. Chair recognizes Chairman Seal Cox to your right for a question. Thank you, Mr. Speaker. Does the general lady yield? I will. Isn't it true, Chairman Cooper, that this will improve the quality of life for aging citizens all across Georgia? It is true. It isn't also true that we have a rapidly aging population, so it's important for us as a state to make a move in this direction to regulate this industry greater. Yes, not only are we one of the fastest growing or the fastest growing state, East and the Mississippi, our elderly population is outgrowing. Our other population by 4 to 1. So apparently as you age, people like the atmosphere and the weather in Georgia and they are by how many are bypassing Florida now to make their homes in Georgia. So we have a rapidly growing elderly population. I appreciate you bringing the bill. Thank you very much. Mr. Speaker, I'll take one more question if there's a question. Your recognizes representative Bentley to your left for a question. Thank you, Mr. Speaker. This is General Later Heal. I do. Have a friendly question. Thank you for your work on this legislation. But my question is relating to general public. How would they know if someone is interested in placing their family members in one of these facilities, how would they know that the facility is not cooperating or is cooperating with the laws of Georgia as it relates to this particular piece of legislation? Well concerning what's been going on lately, if they get a subscription to the Atlanta Journal Constitution, they will know. I'm being funny. So because they are the ones that have written a series on what's been going on in these, but they are posting and have made a website showing the fines and all that go along have been made against each individual facility. But also our department is in the process of doing the same thing. So it will be out. They're supposed to make it easy to access. So people would be able to look up and see what's going on or what kind of problems a certain facility will have. But representative, as I said, over and over again, families, friends, church members for people who don't have any family need to be our eyes and our ears in these facilities. And there's a saying that goes for children, but it's also true for our elderly. If you see something, say something. It is better to report something that turns out to be not on purpose or not something that couldn't have been avoided. It is better to do that than not to say something and this elder abuse or exploitation. So we still need a lot of help from the public. Thank you very much. Mr. Speaker, thank you very much. I ask for your favor or consideration again for the members of this body and I yield the well. The lady has yielded the well. Chair recognizes the dean of the house, Dean Smirie, to speak to the bill. Mr. Speaker and ladies and gentlemen of the house, I come today to fully support HB 987. Given where credit is due, I want to thank Health and Human Services Chair Sharon Cooper and her co-sign is a Representative Lahood, Speaker Protein Jones, Representative Petra, Representative Nessration and Representative Mary Margaret Oliver. And I want to see Chairman Cooper and ask her, could I sign this bill as well? And I want to commend them on their work and the full committee on the Senior Protection Act. I watched closely and read the series of articles as many of you all did. Investigative articles unprotected that ran in the AJC. It struck my nerve because we all have had various expressions and experience with family members needing additional care and assisted living or personal care homes. I always knew it was a time to act on protecting our vulnerable senior citizens population. But there was one story that really struck me and had a very personal impact on me. It was a lady who lived and I won't call her name, but she lived in Meacon. And she lived the kind of life that we all had hoped for, hoped for. She loved her family. She had achieved the ultimate maternal title of great grandmother. She was a revered teacher who, in Jordan, worked that she even substituted when she was in her 80s. She certainly earned her fulfilling final chapter in her life, it seemed. But the time had come for her to be moved into a place where her family could visit her and live out her life and confident safety. And they placed her in a home in Meacon. And her daughter made sure that she was well cared for. She paid $7,000 a month for her assisted living facility. And she also had a private caregiver. And her daughter drove from Atlanta to Meacon every week to visit. But one night, this nine-year-old two-year-old wandered from the home. Her dimension, apparently, leading her out of door near her room. No one noticed that she was gone. Around 4 a.m. someone saw she wasn't in her room. Finally, she was found nearby at the bottom of a steep hill in her night-gown dead of a broken neck. But after the state investigated and the executive from the facility called her daughter and let her know that the state didn't hold the home responsible. As tragic as her life and her story is, unless we do something as policymakers in this state, it will be more changes that we need to make. But we need to continue to create good public policy to oversee our senior care facilities so that we can stop such tragedies in the future. I had a personal experience of the same nature with my grandmother. And she wandered away from her home from her facility. But the good side of this was she was found and we moved her into another home. And I tell you this and I say this to you that to me, this is a huge step in the right direction. And I would agree with Chairwoman Cooper. It doesn't cover and do all that needs to be done because I've talked to several of you all in here and some of the areas that we talked about. But it does cover the fines, it does cover the state inspectors, it does cover the care giving staff staffing. And another key point is that it covers transparency. And to me that is an important part of this. And I remember Representative Carolyn Huggler. She had all the personal care people to come to Columbus and we had a hearing aid in our hometown. And it educated me on how these facilities work, how they are notified, how they don't notify, what the transparency is, what is the staffing ratio, etc., etc. And so I just want to come today and just say a lot of times we do and we pass a lot of bills. But I think this is the one that we can say that we are certainly going in the right direction and doing the right thing because our elderly, that's our anchor and our homes and in our communities. And they are the most vulnerable of all of our population. So I'm going to take pride in voting for this bill. They went about it right, no sensationalism. The committee went and drilled hard and did due diligence. And I just want to say that to me this is a good bill. This is something that I can go home this weekend and look back on in my days here and this legislative session saying that we did the right thing and we did it for the right reason. We did it for the right sector of our community and our state. So that, Mr. Speaker, if there are no questions, I will yield the well and I ask all of you all to join the chair of the committee and all the co-signers and all of those that have seniors that may be living in the facility of this nature. And I ask that you vote in the affirmative on House bill 987. Tillman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Now this bill now pass all those in favor of the passage of House bill 987 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted. If so, the clerk will lock the machines on the passage of House bill 897. The eyes are 160. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House bill 842. House bill 842, by the way, is the 145th and others to be titled. The committee is signed to amend chapter 1 and title 31 of the physical to Georgia and it is related to the general provisions regarding health so as to prevent prohibit providers from discriminating against potential organ transplant recipients. This bill had referred to the committee on insurance. That committee recommends that this bill do pass by committee substitute. They are recognized as representative Rick Williams to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I come before you. If you look on the screen, you'll see Ms. Gracie. Ms. Gracie is who this bill is named after. This bill prevents any discrimination from anyone for receiving an organ or tissue transplant regardless of developmental or physical disability. The children's health care of Atlanta, life link, others have vetted this bill. They're in complete favor. And this just shows, again, that Georgia values life. I ask for your favorable consideration. Ms. Speaker, I'll answer any questions. You have no questions. I ask for your favorable consideration. Thank you very much. Chair recognizes representative Mack Jackson to speak to the bill. Thank you, Ms. Speaker. Today I rise in support of House Bill 842, Gracie's Law. Gracie's father, David Nobles, called me one night in December. And after Mr. Nobles introduced himself and told me about little Gracie Joy. Gracie is a miracle child. She was born with Down syndrome and a heart defect. She had surgery and Gracie's heart is now doing fine. This bill will make sure that children with disabilities in Georgia cannot be discriminated against. David asked me if I would support Gracie's Law this legislation. And when Mr. Nobles said the words, I've thought about the words of Mordeky in the book of Esther in chapter 4. Those words came to me. And I quote those words when Mordeky told Queen Esther, for if you all together hold your peace at this time, then shall their enlargement and deliverance arise from another place. But you and your father's house shall be destroyed. And who knows whether you'll come to the kingdom for such a time as this. And this is one of those defining moments in time. And I urge your support of House Bill 842, Gracie's Law. Thank you, Ms. Speaker, you'll the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members now voted? So the clerk will lock the machines on the passage of House Bill 842. The eyes were 160. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 555. House Bill 555, I represent a partner of the fourth and others to be entitled to amend Article 3 and Chapter 4, Title 17 of the Efficient Go to Jordan Annotated relating to warrants for arrest. This bill I refer to the committee on juvenile justice. That committee recommends that this bill do pass by committee substitute. The chair recognizes Representative Carpenter to present the bill. Thank you speakers. Members of the House I come before you to present House Bill 555. Many years ago this body saw it fit to protect peace officers, law enforcement officers, teachers and school administrators from frivolous arrest warrants being issued. This bill would simply add defects case managers to that list. There's a growing trend in Georgia of individuals headed to magistrate court to file a complaint against the defects worker. This bill would require the individuals to instead petition law enforcement to review and reach out to probate court, superior court or state court in order for warrants to be issued. With law enforcement, I'm sorry, with law enforcement's present at 99% of child removals, if a crime has been committed, the petition should be simple. As it stands under the ease of magistrate, I'm sorry, as it stands, using the ease of magistrate court to issue these warrants, undermines the jurisdiction of juvenile court and puts an unnecessary burden on case managers that are already overworked, underpaid and stressed to the max. My friend Wayne Grumman at GPHSA fully supports this bill and I ask for your favorable consideration. And are you for any questions? You have a couple of questions. I've been looking forward to it. Well, if I keep looking at the screen, they keep piling up. Chair recognizes, Chairman Welch, to your left for a question. Thank you, Mr. Speaker, gentlemen, you'll for a question. Yes, sir. It's a friendly question. I just wanted to confirm that the intent behind theirs to provide the protection for the defects management to do their jobs, to the effects without being operated under the fear that they're going to be subpoenaed by a magistrate court judge and not an otherwise officer of the state, which is what we have in the provision of the bill, the current law, would be that of a probate judge or the spirit court judge. Is that correct? That is correct. So, you know, these front line workers are under a lot of pressure and it's a highly volatile situation. And so, just to ease that fear, I think this is a great bill. Is it not further true that we, gentlemen, you'll, yes, sir. It's not further true that we, that as a state, we have struggled and we have done an almighty job to try to recruit case workers to come and work the defects and also to provide the level of service that we all think the door just needs, especially the children of this state. Yeah, you're correct, sir. And one final follow-up question. Absolutely. And then allowing for a magistrate judge to issue these, these warrants, that not also deter those individuals from surveying our state as defect workers. Yes, yes, sir. It would. That's what, thank you. Chair, recognize as representative Ken Trail to your left for a question. Thank you, Mr. Speaker. Is the gentleman yield? Yes, sir. Representative Carpenter, isn't it true that this bill basically just gives our defects, workers, the same protections to do their job as we already give to our school teachers and school administrators? Yes, sir. So it's not granting them special status, it's just the same status as school teachers and administrators already have. Yes, sir, you're correct. And I made the point of 99.9 percent of the times there being police officers on site when with child removal occurs. So it's almost, it's even more so because the police officers are there. So if there's some criminal activity, then we'll actually, the officer will be there to see it. Thank you, Representative Carpenter. Thank you.\n\nYou yield for another question or two? I think so, yes sir. Chair recognizes the minority leader of the house, leader tremble for a question to your left. Well, Jim and you'll absolutely. The thing you said that this was a growing trend. How many times has this happened? Two times right now. So it's growing, absolutely. Because two years ago it was zero. You can't even put a number on that growth actually. I don't know if you remember the sideways 8, but that's a potential. No, it's not. It's actually infinitely grown, as a matter of fact. The sideways 8, leader. Two can be a lot, can it? I think it all depends on if you're the case worker or not, sir. You have no further questions. Al Lue, you thank you so much. I appreciate your consideration. You're the well. Chair recognizes representative Reeves to speak to the bill. Thank you, Mr. Speaker. Thank you, Representative Carbenter, for your bill. Real quickly, I want to say that this bill addresses what is in my opinion a very significant issue, something that I've hoped that this body will take up for some time. And that is looking at how we do this civilian war application process. A lot of you may not know this, but in what case, what representative Carbenter is getting at is that a person can go to a magistrate court without any police investigation behind it and fill out paperwork to have somebody arrested and charged with a crime. And that seems kind of hard to believe, but it's real. And it bypasses law enforcement and creates this option. And I'm not going to say that there aren't times where it's not appropriate, but it is something that has been abused a lot. I have had some experiences in this in my career. And the way that the Magistrate Court, at least in some jurisdictions, send notice if somebody comes to fill out the paperwork to have you arrested, the way that you get noticed to go to court is you get a letter in the mail. Now, let me say this, if you sue somebody in Magistrate Court for $15, then you have to get served with process by a process server. If you sue them for $15, if you want to seek to have them arrested and charged with a crime, they get a letter in the mail telling them you need to come to Magistrate Court to defend yourself on whatever day. I had a client that is a lawyer who had been through a very, very messy divorce with a very emotional child custody issue. And the police were called to a scene and refused to make an arrest. And his ex-wife went and took out a warrant or went and applied for a warrant. And notice was sent to my client. He didn't get it. A lawyer knows, oh, I got this to the mail, I'm just going to ignore it. Maybe it'll go away, right? That's not the case. If a lawyer would know, I can't just ignore this and it goes away. He didn't get the letter, he didn't go to court, the warrant got issued. He was arrested and as you can imagine, that was a life-changing experience for him, getting all of that unwound. But this process is flawed and it needs work. These defects workers are involved with emotionally charged decisions. And we do not need this, we do not need them to be subject to casual accusations. And then force our already underpaid defects lawyers to have to go and hire a lawyer to go and take part in this very informal process. If allegations are appropriate, they need to be investigated and handled in the proper method with law enforcement. I yield the well, Mr. Speaker. Chair recognizes the minority leader of the House to speak to the bill. Thank you, Mr. Speaker. Why didn't think I was going to get up here to talk about something that happened in the pandemic of two times. But this is a sledgehammer to kill a fly. It is a general bill to address a local issue. But I want to step back for just one second and make sure that we all understand what the bill purports to do. The bill basically eliminates the ability of a magistrate judge to sign an arrest warrant for defects case workers who have been alleged to commit a crime in the performance of their duties. Magistrate judges sign the overwhelming majority of arrest warrants in Georgia. If a law enforcement officer had information for probable cause that a crime had been committed, the law enforcement officer would go to a magistrate judge for the warrant. But in this bill, they can no longer do that. They have to go and track down the spirit court judge to get that warrant. But to speak to you, and I put on your desk, a little brochure that came from the Fulton County Magistrate Court, but courts throughout Georgia have this information. And this is about the application process for regular assistance to go and help themselves when a crime has been committed to get a judge to determine whether or not a warrant should be issued. You know, earlier this week, we had the state of the judiciary address. And the chief justice talked about one of the big problems in Georgia being the number of pro-se litigants in our court systems and the efforts to try and make better access to justice and better access to legal information out there. The Magistrate Court is the people's court. If there's one place that people feel comfortable going to the judicial system without the assistance of a lawyer, it's going to be the Magistrate Court. The Magistrate Court is in the best position to provide information about how you avail yourselves of the legal process than any other court in Georgia. And this bill would take away access to the Magistrate Court for every citizen in Georgia in this circumstance. Everyone. So we can frame it about a protection for certain people, but it is a removal of the right of all Georgians in that instance. And the gentleman from Cobb talked about the application process in Native Refinement. Maybe so. But you know what? This bill doesn't eliminate the warrant application process. It just says you can't go to Magistrate Court for it. It forces you into a more complicated procedural court, like the Superior Court. Courts more difficult to navigate without the assistance of a lawyer. So it is a policy question for the General Assembly. It's not a partisan issue, but I'll be voting no. And the reason that I'll be voting no is because I believe that Magistrate judges are in the position to make this decision, that there's not this growing emerging trend, that we have a case of one or two examples two times. But that I'm against removing the right of all Georgians to access to their justice system. And Mr. Speaker, I'll yield for questions if there are any. There are a few questions. I'll yield. Well, let's see. Chair recognizes the author of the bill representative Carpenter. Do you write for a question? I'll see. Oh, we're working. Does the leader yield? I do. A real quick question. Is it not true that if a crime is a felony, involves sexual offense or domestic violence that regardless, this case has to be investigated by law enforcement first in Magistrate Court? The gentleman, gentlemen, may be correct. I don't have the statute in front of that. I'll defer to the gentleman if he does. And one more question. Does the leader contend that all citizens of the state of Georgia deal with defects cases in issues? That's not my contention, but my contention is that the process that is outlined in 1740 for a warrant application does not require me to be involved in the case of a crime. To be involved in with defects in order to go to Magistrate Court to say that I have witnessed a crime and that I want a felony warrant, want to apply for a felony warrant based on information that I witness. Now, I also have the alternative to go to law enforcement who can investigate and do that. But this would remove my right in that circumstance to go and apply for a warrant. In Magistrate Court, I still do it in Superior Court. And, you know, as a lawyer, I could navigate the Superior Court process, but I can promise you that it is much more difficult for a pro-say litigate to navigate the Superior Court process or another court process than it is a Magistrate Court. Mr. Speaker, I would yield for any further questions. Chair recognizes Chairman Fleming to your left for a question. Thank you, Mr. Speaker, to the Chairman in the well. I do have the bill in front of me and I'm looking at the statute that you referenced. As I read the bill, it appears here that there is a list that this legislature has decided as a public policy that there should be a layer of protection for certain men. For certain members of our society to make sure that the process of arrest warrants is not abused. And it appears to me, and you can tell me if you disagree that Representative Carpenter is simply trying to add defects to that list. But I see here that teachers are on this list of persons that are protected. Does your logic for not including defects workers also extend to the idea that we should take teachers off this list? To the gentleman, it's not my bill. I'm saying that in this circumstance, if there was evidence that it was interfering with the ability of case workers to do their job, then maybe that's a different case. But that's not the case. We're talking about taking away a right of Georgians to pursue felony warrant applications. And we're saying that magistrate judges should not sign these warrants in this case. And it is a policy determination. The legislature has previously made that determination with respect to other categories. And I can make that case for those categories as to why you don't. You don't want to take teachers out of the classroom during the school day. You don't want to take law enforcement officers off of the beat during the day to respond to a citizen application. But I don't see the case here with defects case managers. Well, the gentleman agreed with me that the idea that you just expressed that teachers have a very important role in our society. And that is the care of children. In fact, we give them to them for probably eight hours a day on many occasions. Would the gentleman not also agree that defects workers may be even having a more important role because when they're trying to protect children, they're protecting them in a situation that is probably already in bad shape. Would the gentleman agree? I certainly agree that defects case workers have an incredibly difficult job. But the question in this is, why is the magistrate court and why are magistrate judges all of a sudden taken away the ability to sign and warrant in their case? And I just don't see that case. They still have the ability to go to superior court to do the same thing. But what we're talking about is access. Access to a magistrate judge to pursue where there are instances, allegations of criminal conduct. And I don't see that with two instances in Northwest Georgia. Would the gentleman also agree that the purpose of this statute is to add a layer of protection against abuse so that persons cannot so easily take folks like teachers who are in this case defects workers who deal with very difficult situations sometimes and abuse the process by not making in this case a spherical judge have to take a look at it. I think the case has been made that it's about abuse. I'm not sure that that's the that was the original intent of the statute because again this doesn't take away the application process. It just shifts it to a different court. In other words, in my final question would be people that think that a defects worker has done something inappropriate still have access to get an arrest warrant under this bill. Isn't that true? It's absolutely true that they still have the ability to get an arrest warrant. However, what it does is it takes them out of the ability to navigate the court without the assistance of a lawyer that is most open and most receptive to proceeding in a process manner. And that's the magistrate court. That was going to be a last question, but now you're making a different point. Are you asserting that our superior court judges and your superior court judges would not assist a citizen that needed to relieve with a warrant against a defects worker? Well, I've had words put in my mouth before, but I'm not sure I've had words so many words and implications put in my mouth. Our superior court judges do a great job. And they're already the reason that magistrate judges issued the majority of the arrest warrants is because the superior court judges, they have full dockets in criminal cases too. They would do they do every day a fantastic job trying to assist the best they can. But the assistance isn't just about what happens with the judge and the interaction in a hearing. It starts at the level in which they interact with the clerk. It starts at the level in which they go to a website. Go to a superior court, just do this experiment right now. Pick a superior court, go to that superior court website and find out if it has anything like this, the letter that's on your desk from the Fulton County Magistrate Court with respect to how to do this. You won't find it. And the reason you won't find it is because the magistrate court deals with people coming in on a pro-say basis all the time and they have forms and information out there designed to help people. Just like the chief justice when he addressed this body earlier this week talked about the need for information and law libraries and assistance. I'm not suggesting that they don't do the best they can. I'm suggesting that the resources that are in place are better in the magistrate court. So the last words, Mr. Speaker, that I would attempt to put in the leader's mouth was that he and I do appear to agree that I spear court judges are capable and willing to help citizens who need this help. Well, I do mirror Mr. Speaker. I think I've answered a lot of questions. I know members. This is a matter. The members have to decide for themselves. I appreciate the body's time and I will yield the well. The chairman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 555 will vote aye those opposed will vote no and the clerk will unlock the machines. The purpose is chairman Welch rise. Let me take your inquiry. State your inquiry. Mr. Speaker, is it not true that the probate that this bill includes the probate court which is also founded in every single circuit of the state and is also the court that issues marriage licenses can help with firearm licenses, helps individuals who wills and estate planning is very friendly and receptive to those citizens of the state of Georgia on very basic and rudimentary and everyday needs. I think the gentleman is correct in that assertion. What purpose does the minority caucus whip representative Bowdie rise? State your inquiry. Mr. Speaker, is it not true that most chief Magician Court judges in the state of Georgia do they elected? Chief Magistrate judges. Yes. The minor standing yes. Mr. Speaker, not also true that what you have preliminary hearings on serious criminal matters most of those here are heard by Magician Court judges. Is that not true? I think that the gentleman is correct. And it's not true, Mr. Speaker, that if we have a situation where defects work is arrested, a Magician Court judge would probably sit in and hear that particular matter. Is that not true, Mr. Speaker? As anyone else who had been arrested, that would be my belief. Thank you, Mr. Speaker. All right. I want to do one more parliamentary inquiry and then we're going to lock the machines. What purpose does representative Holly rise? The following inquiry. State your inquiry. It's not true. That for the thousands of cases in which I was a criminal arrest warrant officer for Fulton County State Magistrate Court that each of those cases were involved a state employee that that Magistrate judge would have to go to Superior Court and sit as pro Hock Vicce for that specified time simply because the Superior Court calendar, the Supreme Court judges were overloaded with cases. And so by voting for this bill, you would therefore put an undue burden on Superior Court judges throughout the state. All right. Well, I'm given to understand that there is quite a caseload in the Superior Court. Although some apparently don't understand that. But all right. All in favor of the bill will vote aye and those opposed to vote no. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 555. The eyes are 112. The nays are 47. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 463. House Bill 463 by Representative Montmohan of the 17th and others to be entitled to amend Title 40, the fiscal of Georgia, and to be relating the motor vehicles and traffic. So it's required for the issuance of a classy driver's license to operators of certain three-wheeled motor vehicles. This will never refer to the committee on motor vehicles. That committee recommends a dis bill. The chair recognizes Representative Montmohan to present the bill. Like Mr. Speaker, members of the House. Today I present to you House Bill 463. This bill addresses the different ways to control a three-wheeled auto cycle and the requirement of wearing a helmet and goggles when fully enshrouded and enclosed within the frame of the vehicle. And when such vehicles equipped with a safety belt, this bill addresses a safety aspect of restraining a torso while adding weight to the head and neck. This equation of adding that kind of weight to a head and neck is a deadly equation and can result in a fatality at even low speeds. That is the bill, Mr. Speaker, and I yield to any questions. You have a question if you care to yield. I will yield. The chair recognizes Representative Ridley to your right for a question. Does my friend yield? I do. Is it not true that this bill will require people that ride tricycles to have all this equipment? I motorized tricycles. Thank you. If there's no more questions, I'll yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of House Bill 463 will vote aye. Those opposed will vote no and the clerk will unlock the machines. The clerk will lock the machines on the passage of House Bill 463. The eyes are 152. The nasor 2. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 752. House Bill 752, members, and a bill with 112th and others being titled an act to amend Article 133 of Title 43, the fiscal to Georgia and Tate are relating the general provisions regarding physical therapists to spill them in further committee on regulated industries that committee recommends that this bill do pass by committee substitute. The chair recognizes Chairman Belton to present the bill. Thank you, Mr. Speaker. I really appreciate this leadership of the speaker and this body is passed over 34 new laws to help our military. I would like to thank the secretary to remember the red yellow green sheet I passed last year as a request by the military to pass certain laws. And we did so unfortunately two of the laws we passed last year with the physical therapy compact and the psychology compact. The FBI had a problem with it. So this is basically a fix on that problem that created fingerprint criminal check on these both boards, psychologists and the physical therapists welcome this change. They're all for it. Again, these compacts effects all physical therapists and psychologists, but in particular I'm bringing it because of the military spouses and the military wants this. And when I think about the military, I think about the legislators who served this people's house. I think about Sergeant Al Williams who locked in vicious firefight some God forsaken jungle Vietnam severely wounded one the purple heart. I think about Sergeant David Clark fighting the Taliban in Afghanistan scaling the slopes of the Himalayas as Army Ranger. I think about my hero Colonel Bill Hitchens who wandered through the rice paddies of Vietnam as a Marine and treacherous waters as a coast guardsman. I think about Colonel Brian Prince who devoted half of his life to the Army. I think about Colonel Josh Bonner captain Scott Holcomb both stirring three tours overseas. I think about Philip Singleton as Apache helicopter pilot. I think about Master Sergeant Mike Glanton. You jumped out of perfectly good airplanes to deliberate the Panama. Think about Commander Sherry Gilligan staff Sergeant Sandra Scott commander action Jackson representatives lay at Eddie Lumpstrom both a veteran and a state trooper. I think about chairman Randy Nicks chairman Ed Setsler, Dr. Martin Newton representative Mark Morris chairman Chuck Estration Lieutenant Viola Davis, all these men and women who served the United States Armed Forces the you and I can breathe free. The most ball I think about Gloria Frazier who was a herself a military spouse this tough a job in the military is a military spouse. So on behalf of these men and women all across the globe I ask you to support this measure. Mr. Speaker I yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered the chair here's none. The previous question is ordered is there any objection to adopting the committee substitute to chair here's none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote I those opposed to vote no and the clerk will unlock the machines. What purpose does chairman of Stration rise. State your inquiry. Mr. Speaker is it not true that with the gentleman's comments I I just want to make clear many family members including both my grandparents served honorably but I did not serve honorably and so I just wanted to correct the gentleman's statement on that. So I did not serve I have not had the honor of serving in the United States military and I want to make sure the record is very clear thank you. I'll sit down now thank you. That is a burst of candor I think what purpose does chairman martin rise. State your inquiry.\n\nthe chairman clarify that he did in fact if he had served it would have been honorable I'm sure. What purpose does representative Bennett rise? Parliamentary inquiry. Is it not true that this law will only provide for citizens to have access to physical therapy on a notable profession? I'm sure the lady is read the bill and believes that to be true. Thank you. All those in favor are voting aye those opposed are voting no. Have all members voted? Have all members voted? If so the clerk will lock the machine on the passage of House Bill 752 the eyes are 155 the nays are one this bill having received the requisite constitutional majority is therefore passed. What purpose does representative Perkel rise? Stature motion. Committed to the rules committee. 859. Representative Perkel moves that House Bill 859 be recommitted to the rules committee. The clerk will read the caption. House Bill 859 I represent a Perkel of the hundred fifty-fifth and others be titled an act to men code section 48 73.1 in the fiscal of Georgia and it's either relating to the tinting of windows or windshields so it's to provide for a maximum monetary penalty. On the gentleman's motion that House Bill 859 be recommitted to the rules committee. Is there any objection? Is there any objection the chair here's done and it is so ordered? What purpose does representative Williamson rise? Stature motion. Slate of day. Representative Williamson moves that House Bill 378 which is on the rules calendar. Be carried forward to the next legislative day. Is there any objection? Is there objection the chair here's done and it is so ordered? The clerk will read the caption to a group of privileged resolutions. Recognizing commending the most worshipable smooth ashlar grand lodge free accepted ancient York right maiths. Recognizing the Southern crescent women in business. Recognizing commending Lieutenant Colonel David Titus. Commending the links and corporator recognizing March 3rd 2020 as links day at the state capital. Recognizing commending the members of the Savannah St. Patrick's Day Parade committee. General Chairman Lawrence E. Egerly and Grand Marshal of 2020 St. Patrick's Day Parade. Michael Rauch senior on the upcoming occasion of the 2020 St. Patrick's Day Parade in Savannah. Commending the United the Atlanta track club and welcoming United States Olympic team trials honoring the life and memory of Ford Clemens Green. Commending Georgia trio and recognized Georgia trio's day celebration of February 29 2020. Congratulations Reverend Robert D. Finch for his installation this pastor at Billips Grove Baptist Church. Recognizing the civil air patrol for the service the citizens of Georgia. Recognizing March 28 2020 as progressive multiple sclerosis day at the state capital. Recognizing February 25 2020 as Forest Park Day to state capital. Commending police chiefs and other heads of law enforcement agencies in this state. And recognizing March 10 2020 as belief chiefs and head of law enforcement agencies recognition day at the state capital. Recognizing and commending Matthew Weedner. Recognizing commending Dr. Nadine J. Caslow upon receiving the Nikki T. Randall Service Leadership Award for a service to your community. Commending McKenna Trap Hagen Woodland High School's 2020 star student. Commending Crawford Taylor Woodland High School's 2020 star teacher. Commending Sheila Smith Cass Howney Sky Schools 2020 star teacher. Commending Caleb Doolittle Cass Howney Sky Schools 2020 star student. Recognizing commending Ava Lipscomb on her outstanding public services Barthode Cassett Director. Commending and congratulating Caleb Chambers and for other purposes that completes the reading with privilege resolutions. Is there any objection to adopting the privilege resolutions that chair here's none in the resolutions are adopted? If you have signed up for an announcement, please make your way to the front of the chamber. We will start momentarily with announcements. All right, we're going on to announcements. Going on to announcements that chair recognizes representative Stovall for an announcement. Thank you, Mr. Speaker. I wanted to let everyone know the blackmail educators are having a panel discussion over in CLOB room 514 and also to remind you about the cultural celebration with the Europe African tribe is going to be at the City of Riverdale tomorrow from 12 to 5 and it's real charged. Thank you, Mr. Speaker. Chair recognizes chair Montana for an announcement. Thank you, Mr. Speaker. If you would just take notice of the letter I put on your desk that we are going to have our last transportation meeting before crossover day next week. If you have a road naming bill that needs to be in, you can check with Abbey Day and House Research to make sure everything's in line. But if you don't get it in in time by the deadline on the letter, then it will have to be included in the Senate version and will not be included as a House bill. Thank you. Chair recognizes representative Jason Ridley for an announcement. Thank you, Mr. Speaker. Regulated Industries, Occupational Professional, Lies and Subcommittee. We're going to meet at 1 o'clock in room 415, CLOB. And I need everybody there if you can. I know it's Friday. Thank you. Chair recognizes representative Patty Bentley for an announcement. Thank you, Mr. Chairman. Colleagues, I just want to let you know that you all invited to come down to room 230 to greet the members of the Georgia Funeral Service Practitioners Association and they will have lunch around 12, 12, 30. Room 230. Thank you. Chair recognizes representative Bernal for an announcement. Thank you, Mr. Speaker. Monday is Delta Sigma Theta Day at the Capitol. So we hope that you'll come down and take pictures with us at 930. Chair recognizes chairman dollar for an announcement. Thank you, the speakers working group. Creative Arts Entertainment will meet upstairs in 403 at 1 o'clock. I so. Chair recognizes chairman Corbett for an announcement. Thank you, Mr. Speaker. The Environmental Quality Subcommittee of National Resources will meet Monday at 2 p.m. in room 515, CLOB. Thank you. Chair recognizes chairman Cooper for an announcement. Thank you, Mr. Speaker. The Health and Human Services Committee will meet this afternoon. At let's do 12 15. He'll give you time to go to your office. Please be on time. We need a quorum and we have three bills. They should not take very long if you're on time and we have a quorum and you'll be on your way home if that's where you're headed. So Health and Human Services room 606 starting at 12 15. Thank you. The chair wants to recognize on the floor of the house a former member of this body former state representative Jeff Cobble. Chair recognizes chairman McCall for an announcement. Thank you, Mr. Speaker for all of y'all that like them fried peanut butter sandwich in Monday is peanut butter day at the Capitol so y'all help yourself downstairs. Okay. That completes our announcements. The chair recognizes the majority leader of this house leader burns for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move that this house stand adjourned until 10 a.m. Monday, March 2, 2020. The majority leader has moved that this house be adjourned until Monday, March 2, 2020 at 10 o'clock a.m. All those in favor of the motion will say aye those opposed will say no. The eyes have it and this house will be adjourned until Monday, March 2 at 10 a.m.",
  "updated_at": "2026-02-13T11:10:42.332478+00:00"
}