{
  "video_id": "cCc6FRIJkh8",
  "url": "https://youtu.be/cCc6FRIJkh8?t=359",
  "title": "Georgia House - Day 25 (2026-02-28)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 25,
  "video_date": "2026-02-28",
  "duration_minutes": 161,
  "summary": "Here is a structured summary of the Georgia House session transcript from 2026-02-28:\n\n**Overview**\nThe session featured a notable speech by Rabbi Adam Star, who discussed the importance of standing up against bigotry and intolerance, drawing parallels to the story of Queen Esther from the Book of Esther. The Rabbi emphasized the need for lawmakers to use their positions to help those in need and make the world a better place.\n\n**Key Actions**\nNo major bills were passed or referred during this session.\n\n**Bills Introduced (First Reading)**\nNo new bills were introduced.\n\n**Notable Moments**\n- Rabbi Adam Star delivered an inspirational speech, calling on lawmakers to speak up against hatred and injustice, like the biblical figure Queen Esther.\n- Representative Esther Panage introduced Rabbi Star and discussed the significance of the upcoming Jewish holiday of Purim.\n\n**Votes**\nNo recorded votes were mentioned in the transcript.\n\n**Attendance**\nThe transcript notes that the Speaker urged all members to come to the floor and take their seats. The doors were closed to maintain quorum.\n\n**Adjournment**\nThe transcript does not explicitly state when the session adjourned or provide information about the next scheduled session.",
  "transcript": "All members, all members, if you're pleased, come to the floor. All members come to the floor. We'll see if we can get going here. I think rules are still meeting. We'll see if we can get going. All members, all members, will please come to the floor and take this seats. Mr. Clerk, will you ring the bell? We're going to dispense with the roll call at this time. All members, all members, come to the floor and take your seats. Doors will please close the doors. We'll close those doors and keep them locked. Please, and you can just keep them closed. As is our custom, we will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. I enjoyed meeting our chaplain this morning, and I'm sure you're going to enjoy his message today. Our chaplain this morning, we'll be introduced by the lady from the 51st House District, Representative Esther Panage. Representative Panage. Thank you, Mr. Speaker. Shalom, y'all. Come on. Shalom, y'all. Thank you. Rabbi Adam Star has served as the Rabbi and Spiritual Leader of Congregation or Hattara in Atlanta since 2008. Under his leadership, the congregation has grown in membership and built a brand new state-of-the-art synagogue, the first Orthodox synagogue in the world, constructed from the ground up, according to environmentally sustainable standards. Rabbi Star received his rabbinical ordination from the Rabbi Isaac Elkhunan Theological Seminary at Yashiva University in New York. He has served as the Executive Committee of the rabbinical Council of America and as a past President of the Atlanta Rebinnical Association. While Rabbi Star is not my congregational Rabbi, he is a friend and a teacher. And he also was the one who put up the Mizzosa on my office door post. A Mizzosa is a parchment inscribed with Hebrew verses. Come by and visit, and I'll be happy to show you the Mizzosa. Please welcome Rabbi Adam Star. Thank you. Shalom. Good morning, esteemed representatives. It is an honor to stand before you today as the chaplain of the day and to open this session with words of prayer and inspiration. Thank you to my dear friend, Representative Esther Penich, for this special honor and invitation. As you will soon hear, Esther's strong and courageous leadership carries on the legacy of her biblical namesake, Queen Esther. In just a couple weeks time, Jewish people around the world will be reading the whole Maghilla from the skull scroll of Esther and celebrating the joyous holiday we call Poros. The poem's story recalls a time when the Jewish people scattered throughout the Persian Empire, faced an existential threat. Haman, the King's advisor, devised a genocidal plan to annihilate the Jewish people simply because they were different. He cast lots or purim to determine the date of their destruction, believing that fate was on his side. But fate was not the deciding force. Courage was our heroine, Queen Esther, who had hidden her Jewish identity, was called upon to risk her own safety and life by outing herself as a Jew. To plead to her husband, King Ahashveroch, for her people's survival. She was initially hesitant, but her cousin Mordechai urged her with these powerful words that ring so true today. For if you remain silent at this time, relief and deliverance will perish from the Jews from another... Relief and deliverance will arise from the Jews from another place, but you and your father's house will perish. And who knows if it was for such a time as this that you attained royalty upon hearing this, Esther spoke up with courage and moral clarity there by saving the Jewish people from genocidal annihilation. This verse reminds us that there are moments in history when silence is not an option, when injustice threatens the vulnerable, when evil seeks to destroy, we are called to act with moral courage. Today, this lesson resonates very deeply. The story of Porum reminds us that hatred against any people left unchecked can lead to violence and death. It is a call to all of us to stand up against bigotry in any form. But today, I speak on behalf of my people and your Jewish constituents, we are not okay. We have been reeling since October 7, 2023 with the brutal murders, rape and abductions of our Israeli brethren by the blood-filled hands of Hamas. Those painful wounds were reopened this week with the return of the dead bodies of the Bebas family, of mother Shiri and her young children, children, queer aged four, and Ariel, who was less than a year old, who were brutally murdered with bare hands by Hamas, returned to be buried by their father Yardin, who was just released a couple weeks ago after 500 years, 500 days of being hostage, being held hostage in Gaza. And there are still 59 innocent hostages who remain in captivity in Gaza, including American citizens, brutally torn from their families enduring unimaginable anguish. We are also witnessing a frightening rise in anti-Semitism across the world, even here in Georgia, and especially across college campuses in this very country. We cannot be silent. Their plight is a painful reminder, our plight is a plain painful reminder that hatred and violence still exist in our world. Like Esther, we must raise our voices on their behalf, and I implore you to let your Jewish constituents hear your voice in our time of pain. The Georgia homegrown hero and prophetic voice of Dr. King taught the world and I quote, In the end, we will remember not the words of our enemies, but the silence of our friends. Your voice means so much to us more than you can ever imagine. Please rise and let us pray. Almighty God, source of justice and mercy, we turn to you in these halls of law and justice. Grant wisdom and strength to the leaders gathered here that they may govern with compassion and a steadfast commitment to righteousness. May they, like the biblical hero Esther, recognize the power of their positions to bring hope and healing to those in need. May we never be silent in the face of evil. May we stand together, people of all faiths and all backgrounds united against bigotry and intolerance and hatred. May you make the world a better place by best serving the people you are here to represent. Bless this great state of Georgia and all who labor to uphold the values of freedom, dignity and justice. In the face of darkness, may we be bearers of light. In the presence of hatred, may we stand for love and peace. May we each recognize that like Queen Esther, perhaps we have been placed in this place and position for such a time as this. And let us say, Amen. We will now turn and recite the pledge of allegiance to the United States of America. We will now turn and recite the pledge of allegiance to the United States of America and to the Republic of which it stands when nation under God, indivisible, with liberty and justice for all. Thank you very much. Thank you. Thanks for your effort to make this a good message. Members, you can join Rabbi Star in the south any room for a photo and greet him and thank him for being with us today. We appreciate your message, Rabbi. Door, keep it to me, open the doors. Members, our doctor of the day is Dr. Catherine West. Dr. West, it was invited here today by Representative Lee Hawkins. Dr. Lee Hawkins as well. So we appreciate her service and if you need her any of her attention should be downstairs in the aid station. Chair recognizes Chairman Hilton that chair of the Committee on Information and Audits, Chairman Hilton. Mr. Speaker, I don't have a very big audience today but I'm going to tell you your Committee on Information and Audits has read the journal of the previous legislative day and we found it to be just okay and all correct. Thank you, sir. Thank you, Chairman Hilton. You don't need a big audience to read so you're doing a good job there. Full attention. Chair of the Committee on Information and Audits report said the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Here in the journal is dispensed with. Is there any objection to the confirmation of the journal? Here in the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? President, I have a station in the 104th Moose Follow-up. He establishes the order of business to earn the first part of the period unanimous consent. Introduction of bills and resolutions for us reading and reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to adopting the resolution establishing the order of business for the day? Here in the resolution is adopted. First reading of bills and resolutions, Mr. Clerk, will you read? House bill 657, my friends, on a haggen and 156, to the 13th camera to the first, Buckner, the 137th, Willis, the 55th and others, Bill Bintala, and act to amend Title 37 of the fiscal to George Anzator relating the mental health. Public and community health. House bill 658 by Representative Hawkew and the 101st, hugely the 141st, milliliters of the 62nd, aisle, the 50th, draper of the 90th and others, Bill Bintala and act to amend Chapter 24, Title 33, the fiscal to George Anzator relating the insurance generally. House bill 659 by Representative Green and the 154th, Taylor, the 173rd, Hawkins, the 27th, Jasper, the 11th, Hagen, the 156th, Bill Bintala, and act to amend Chapter 34, Title 31 of the fiscal to George Anzator relating the medical professionals for rural assistance. The rural development. House bill 660 by Representative Cox, the 28th Jasper, the 11th, Rysed, the 139th, Scotland's the 14th, McDonald's the 3rd of the 26th, Bill Bintala, and act to amend Chapter 18, Title 45, Chapter 4, Title 49, and Chapter 1, Title 50, to the fiscal to George Anzator relating the employees, insurance and benefit plans. Injurance. House bill 661 by Representative Bird of the 20th, Cahani, and of the 81st. Beared to the 24th, Ridley, the 22nd, Chastain, the 7th, and others, Bill Bintala, and act to amend Chapter 2, Title 21 of the fiscal to George Anzator relating the elections in primaries generally. Governmental affairs. House bill 662 by Representative Osteen, the 169th, and 4th of the 170th, Bill Bintala, and act to amend Code Section 31-8, and 9.1 of the fiscal to George Anzator relating the eligibility to receive tax credits. House bill 663 by Representative McCollum, the 30th, Apollo 33rd, Bill Bintala, and act to amend Code Section 12-9, 46 of the fiscal to George Anzator relating the powers and duties of the Board of Natural Resources. A natural resources and environment. House bill 664 by Representative Silcox, the 53rd, Reeves, the 99th, and the 51st, Hilton, and the 48th. Bill Bintala, and act to amend Article 6 of Chapter 3, Title 44, and the fiscal to George Anzator relating the property owners associations. You this year, excuse me, you this year. House bill 665 by Representative McCollum, the 30th, Cooper, the 45th, Taylor, the 170th, and the frustration of the 104th. Bill Bintala, and act to amend Article 1 of Chapter 2-8, Chapter 3, and Title 5 of Title 31, and the fiscal to George Anzator relating the general provisions of the Department of Public Health. Public and Community Health. House bill 666 by Representative Doug Wilson, 78, Neil, 79th, Levert, the 123rd, Smith, the 18th, Lornau, the 74th. Bill Bintala, and act to amend Code Section 15-6-2, the fiscal to George Anzator relating the number of judges, the superior courts. The judiciary. House bill 667 by Representative Anderson, the 10th, or one of the 32nd. Campbell, the 15th, Skoggins, the 14th. Bottom of the 73rd, and others, Bill Bintala, and act to amend Article 7-5, Title 40, the fiscal to George Anzator relating the commercial drivers licenses. Judiciary. House bill 668 by Representative Thomas, the 21st, Seaball, 34th, Washburn, 144th, McCollum, the 30th. Dempsey, the 13th, and others. Bill Bintala, and act to amend Title 16, Chapter 4, Title 30, and Chapter 6, and Title 40, the fiscal to George Anzator relating the crimes and offenses. Agriculture and Consumma Affairs. House bill 669 by Representative Meeks, the 178th, per chat of the 176, Hagin, the 156th, and Corvard, the 174th. Bill Bintala, and act to amend Part 10 of Article 6, Chapter 2, and Title 20, the fiscal to George Anzator relating the capital outlay funds. Education. House bill 667 by Representative Clark, the 100th, and 8th, Hugley, the 141st, Carter, the 93rd. Evans, the 57th, Holcomb, the 101st. Bill Bintala, and act to amend Title 8, 10, 34, 35, 45, and 50 of the fiscal to George Anzator relating the buildings and housing. Judiciary. House bill 671 by Representative Rice, the 139th, Fleming, the 114th, picked on on the 3rd of the 26th, Kelly, the 16th, Smith, the 18th, and others. Bill Bintala, and act to amend Chapter 1, and Title 51 of the fiscal to George Anzator relating the general provisions as pertaining to torts. Judiciary. House bill 671 by Representative Rice, the 139th, Fleming, the 114th, picked on on the 3rd of the 26th, Kelly, the 16th, Smith, the 18th, and others. House bill 672 by Representative Cannon, the 58th, pays more 69th, Bill, the 62nd, and bened the 94th. Bill Bintala, and act to amend Chapter 2A, Title 31 of the fiscal to George Anzator relating the Department of Public Health. Public and Community Health. House bill 673 by Representative Lim of the 98th, the Bill Bintala, and act to amend Article 1 of Chapter 10 of Title 17 of the fiscal to George Anzator relating the procedure for sentencing and imposition of punishment. Judiciary, juvenile. House bill 679 by Representative Sanchez, the 42nd.\n\nby the 120 second coming. So 39th fellow 75th and Taylor, the 92nd, Bill Bittado, and Acto Men, chapter eight, and title 13 of the Fist Dakota Georgia annotated relating illegal and void contracts generally. Judiciary House will 680 by Grimms, Sanchez, the 42nd, Tran of the 80th, Iowa, the 50th, Clark the 100 Nays, Scofield the 63rd, and others, Bill Bittado, and Acto Men, title 34 of the Fist Dakota Georgia annotated relating to labor and industrial relations. Industry and labor. House will 681 by Representative Clark the 100th, Nathan Cannon of the 58th, Renner of the 85th, Barnes of the 86th, Bill Bittado, and Acto Men, chapter 12, title 19 of the Fist Dakota Georgia annotated relating to the name changes. Judiciary House resolution 426 by Representative Scofield, the 63rd, Jackson of the 68th, Davis of the 87th, Cannon of the 58th, Bernal of the 77th and others, a resolution urging the general assembly to support the creation of a black maternal health caucus. Public and community health. House of resolution 427 by Representative Workhyes of the 157th and meek of the 178th, a resolution honoring the life of Dr. Esco Hall, Jr., and dedicating a road in his memory. Transportation House of the resolution 428 by Representative Reece of the 140th, Hugo Lee the 141st, Buckner the 137th, Smith the 138th, and Rice of the 139th, a resolution creating the House study committee on the affordability and accessibility of Georgia's legitimation process. Judiciary House resolution 429 by Representative Martin of the 49th, Parsons of the 44th, runner of the 85th, Crow of the 118th, Cannon of the 172nd, a resolution creating the House study committee on funding for next generation 911. Energy utilities and telecommunications, resolution 448 by Representative Jones, the 60th, the resolution recognizing women's cop week in state of Georgia. Special rules. Senate bill 42 by Senator Hatchett, the 50th, Eccles of the 49th, Capacitor to 30th, painting the 54th, Strickland to the 42nd and others, Bill B. Todd of Actumend Code Section 16613, the fiscal to Georgia, annotated relating to penalties for violating code sections. Judiciary non-civil. Senate bill 69 by Senator Kennedy, the 18th, Gooch of the 51st, Robertson the 29th, Anitvarate of the 31st, and Hatchett of the 50th and others, Bill B. Todd of Actumend Title 7, an article five, chapter 11, and Title 9, and the fiscal to Georgia, annotated relating to banks and finance. Rules, the Senate bill 101 by Senator Robertson, the 29th, Hatchett of the 50th, painting of the 54th, Williams the 25th, still of the 48th and others, Bill B. Todd of Actumend chapter 12, the Title 31 of the fiscal to Georgia, annotated relating to control of hazardous conditions. Public and community health. Senate bill 131 by Senator Hodges, the third Watson in the first, still of the 48th, Dixon's 45th, Goodman in the 8th and others, Bill B. Todd of Actumend chapter 10, the Title 49 of the fiscal to Georgia, annotated relating the Georgia Board of Health Care Workforce. Regulated industries. Senate bill 141 by Senator Hatchett of the 50th, health stat, with the 52nd Alvers to the 56th, Kennedy the 18th and of Arte, the 31st and others, Bill B. Todd of Actumend, Title 48 of the fiscal to Georgia, annotated relating to revenue and taxation. Ways and means. That completes first readers. Second reading the bills and resolutions, the clerk will read House bill 619 by Representative Green of the 154th, the bill to amend and act providing a new charter for the city of Donaldsonville, House bill 620 by Representative Kayhan of the 81st, Clark of the 100th, Campbell of the 171st, Martinez of the 111st, of the 99th and others, a bill relating to holidays and observances, House bill 621 by Representative Baker of the 64th, Henderson of the 113th, Cummins of the 39th, Glazed, the 21st, the 21st, the 21st, Cummins of the 39th, Glazed, the 67th, McClean of the 109th and others, a bill relating to general provisions, regarding the Georgia Bureau of Investigation, House bill 622 by Representative Corbett of the 174th, the bill to amend and act providing a new charter for the city of Hoboken, House bill 623 by Representative Smith of the 18th, Huttles, the 70stack at Howard of the 71st, a bill to authorize the assessment and collection of a technology fee by the property court of Carroll County, House bill 624 by Representative Smith of the 18th, Huttles, the 72nd, Howard of the 71st, a bill to authorize the assessment and collection of a technology fee by the State Court of Carroll County, House bill 625 by Representative Silcox of the 53rd, the 51st, along the A of the 59th, Scoville, the 63rd, Holland of the 54th and others, a bill to amend and act creating a state court, a fault in county by consolidation of the existing civil and criminal court. House bill 626 by Representative Lepton of the 183rd, all come to the 101st Mathiaque of the 82nd, the 29th, the 28th, a bill relating to preservation of evidence, House bill 627 by Representative Pershing of the 119th, Canada of the 177th, the Hitchens of the 161st, Smith of the 18th, Thumbs of the 12th and others, a bill relating to courts, House bill 628 by Representative Camp of the 135th, Pro of the 118th, Thumbs of the 12th, with hour of the 121st, a bill relating to imposition rate, computation exemptions and credits for income taxes, House bill 629 by Representative Hawkins of the 27th, Cooper of the 45th, Newton of the 127th, Green of the 154th, Mathiaque of the 82nd, a bill relating to health, House bill 630 by Representative, with hour of the 121st, Ridley of the 6th, Corb of the 174th, Prince of the 132nd, Reeves of the 99th and others, a bill relating to youth motor vehicle, and youth motor vehicle parts dealers, House bill 631 by Representative, Green of the 60th, First hearing of the 145th, Blaze of the 67th, Barrier of the 56th, and Lawley of the 59th, the bill relating to salary schedules, for professionals, and elementary and secondary education, House bill 632 by Representative Bonner, the 73rd Jenkins of the 136th, Blackburn of the 146th, Hulcomb of the 101st, Williams of the 168th and others, a bill relating to disabled veterans, and blind persons engaging, and peddling, operating persons, or practicing professions, House bill 633 by Representative, Bays more the 69th, Lawley of the 59th, Roberts of the 52nd, Oliver of the 84th, the bill relating to elections of primaries, House bill 634 by Representative Barrier of the 24th, Townsend of the 179th, Jones of the 25th, Jasper of the 11th, Jones of the 47th and others, a bill to amend the Georgia Special Needs Scholarship Act, House bill 635 by Representative, we now have the 121st, 522nd Reeves of the 99th, Persing over the 119th, Franklin of the 160th, and others, a bill relating to residential and commercial general contractors, House bill 636 by Representative, Queen of the 61st, Bell of the 75th, Barry of the 56th, Canada of the 58th, Wells of the 55th, a bill relating to sexual offenses, House bill 637 by Representative, coming to the 39th, Cooper of the 45th, Wilkerson of the 38th, Smith of the 41st and Campbell of the 35th, a bill to amend the act, creating a board of commissioners of the Cobb County, House bill 638 by Representative, Council of the 53rd, Hall under the 54th, Lawley of the 59th, Evans of the 57th, Jones of the 60th and others, a bill relating to metropolitan, lands our rapid transit authority, House bill 639 by Representative, we now have the 121st, administration of the 104th, Cox of the 28th, Gaines of the 120th, Jasper's of the 11th and others, a bill relating to the juvenile code, House bill 640 by Representative, Martin of the 49th, Jones of the 47th, Jones of the 25th, Owl of the 58th, Hilton of the 48th, a bill to amend an act to amend, consolidate, to recreate, revise and supersede the several acts, incorporating the city of Alpharetta, House bill 641 by Representative, Lim of the 98th, Matthewic of the 82nd, Workhides of the 157th, runner of the 85th, Lumpton of the 83rd, and others, a bill relating to electric services, House bill 642 by Representative, Lim of the 98th Carpenter of the 40th, 50th, a bill relating to student health, House bill 643 by Representative, Hilton of the 179th, Hilton of the 48th, Mallard of the 147th, Price of the 139th, Wendell of the 29th and others, a bill relating to, Lloyda Ring at or Disrupting Schools, House bill 644 by Representative, Hilton of the 179th, Stevens of the 164th, Buckner of the 137th, Taylor of the 173rd, Hilton of the 33rd, and others, a bill relating to the Environmental Protection Division, Environmental Advisory Council, duties of council, members and director, appeal procedures, generally permit applications, and inspections, House bill 645 by Representative, the 175th, Cooper of the 45th Carpenter of the 4th, Corpenter of the 174th, Williams of the 148th, the bill relating to Regulational Hospitals and Related Institution, House bill 646 by Representative, the 150th, the way to the 9th, Jackson of the 128th, Reads of the 140th, a hearing of the 140th, the bill relating to coroners, House bill 647 by Representative, Don Tuget, the 105th, the 134th, the column of the 30th, the Bill to amend and act to incorporate the City of Mulberry. House bill 648 by Representative, Goffield of the 63rd, for now the 77th, Miller of the 62nd, Jackson of the 68th, a bill to amend and act to create, providing a home set exemption from City of College Park, Edgelarm, Taxes for Municipal Purposes. House bill 653 by Representative, the 22nd, Mom to Hand of the 17th, Warner of the 3rd, Camp of the 135th, Roman of the 97th, and others, a bill relating to Public Utilities, Public Transportation, House bill 654 by Representative, Campbell of the 35th, Al of the 50th, Wilkson of the 38th, Clark of the 108th, Westbrook of the 163rd, a bill relating to General Provisions, regarding insurance, House bill 655 by Representative Hilton, the 48th, or Shadow of the 176th, Clark of the 100th, Carpenter of the 4th, Sains of the 180th, and others, a bill relating to imposition rate computations, exemptions, and credits from income tax, the House bill 656 by Representative, Sains of the 180th, Stevens of the 164th, a bill relating to Development Impact Fees, House bill 674 by Representative, Paris of the 140th, and Hilton of the 48th, Ballad of the 147th, Glazer of the 67th, Wade of the 9th and others, a bill relating to Financial Literacy, Instruction and Curriculum, House bill 675 by Representative, Cox of the 28th, Hilton of the 26th, Pantish of the 51st Edges of the 161st, Jasper's of the 11th, a bill relating to Offences against Public Order and Safety, House bill 676 by Representative, Lippton of the 111st, Guntard VIII, Zleuth of the 99th, with Hilton of the 111st, Pershing of the 119th, and others, a bill relating to Mechanics and Material Men, Relative to Leans, House bill 677 by Representative, Density of the 13th, Taylor of the 173rd, Hawkins of the 27th, Hatches of the 155th, and Oliver of the 84th, a bill relating to General Provisions of Health, House bill 678 by Representative Hilton, the 48th, still Cox of the 53rd, Carpenter of the 4th, Crow of the 118th, Tate of the 117th, and others, a bill relating to General Provisions, applicable to counties, municipal corporations, other government entities, House Resolution 392 by Representative, Carpenter of the 174th, Powell of the 33rd, with Hour of the 121st, Relative to the 6th, Smith of the 138th, Resolution creating the Joint Study Committee, on the State Board of Registration of used motor vehicle dealers, and used motor vehicle dealer parts dealers, House bill 393, from Resolution 393 by Representative, Scott Field of the 63rd, Davis of the 87th, Calvin 76, Jackson of the 68th, Renard 85th, and others, Resolution urging the General Assembly, to enact the Workplace Safety, and Heat Protection Act. House Resolution 394 by Representative, Campbell of the 35th, Hugh Gleib, the 141st Barnes of the 86th, Tram of the 80th, Stamson of the 153rd, and others, Resolution affirming that the American Dream belongs to all of us, House Resolution 395 by Representative, Canada of the 58th, Miller of the 62nd, Clark of the 108th, Bayes of the 69th, Paris of the 142nd, Resolution designated month of May, as maternal, mental, health, awareness, month. House Resolution 396 by Representative, Campbell of the 35th, Hugh Gleib, the 141st, Miller of the 62nd, Glazed of the 67th, Howard of the 129th, and others, a resolution proposing amendment to the Constitution, so as to authorize the General Assembly, to provide by law for the creation of Georgia's children first, trust fund, House Resolution 397 by Representative Cooper, of the 45th, still Cox of the 53rd, Newton of the 127th, Dowell of the 50th, Hawkins of the 27th, Resolution creating a House Study Committee on Healthcare Quality and Reporting, House Resolution 398 by Representative, Ridley of the 22nd, Moved Canada 17th, Horner of the 3rd, Campbell of the 135th, Romana of the 97th, a resolution proposing amendment to the Constitution, to the State of Georgia, so as to rename the Georgia Public Service Commission, as the Georgia Public Utilities Commission, House Resolution 399 by Representative, of the 117th, Holley of the 160th, Thark of the 100th, Hawkins of the 27th, Cameron of the 1st and others, Resolution creating a House Study Committee, on one way street markings, House of the Real and Solution, 400 by Representative Heftar of the 130th, Douglas of the 78th, Glazed of the 67th, Gamble of the 15th, Way to the 9th, Resolution proposing amendment to the Constitution, the State of Georgia, so as to authorize the General Assembly, to provide by law for a home setting exemption. Senator Bill 40 by Senator Patch of the 50th, Goods of the 50th, and the Barathe of the 31st, and Robertson of the 29th, a bill relating to secondary metals recyclers, Senate Bill 79 by Senator Goodman, and the 8th, Stricland of the 42nd, Kennedy of the 18th, Hillary of the 19th, Goods of the 51st and others, a bill relating to crimes and offenses, Senate Bill 123 by Senator Kennedy of the 18th, Dickman of the 4th, Patch of the 50th, Goods of the 51st, Robertson of the 29th, and others, a bill relating to secondary metals recyclers, Robertson of the 29th, and others, a bill relating to compulsory attendance. Senate Bill 130 by Senator Hodges of the 3rd, still of the 48th, Watson of the 1st, Kirk Patrick of the 32nd, Dickman of the 4th, a bill relating to health, 3rd, 2nd readers.omy, Report sustaining committees. Mr. Clark, were you read? Chris Erwin, one of the 32nd District Chairman of the Committee on Education submitted the following report. And with Speaker, your committee on education has added an iruts consideration following bills and resolutions of the House. Instructing me to report same back to the House of the following recommendations. Household 175, do pass, House of Resolution 145, do pass by substitute, Household 127, do pass, Household 371, do pass. Household 12, do pass by substitute, Household 335, do pass, Household 200, do pass by substitute. Household 235, do pass by substitute, Household 37, do pass by substitute. Respectfully submitted, Representative Chris Erwin, one of the 32nd District Chairman. Representative Victor Anderson, the 10th District Chairman on Committee on Government Affairs submitted the following report. To speak to your committee on Government Affairs, this add under its consideration, following bills of the House. Instructing me to report the same back to the House, it's following recommendations. Household 399, do pass by committee substitute. Respectfully submitted, Representative Victor Anderson, the 10th District Chairman. Representative Hawkins, the 27th District Chairman on Committee on Health submitted the following report. To speak to your committee on health, this add under its consideration, following bills and resolutions of the House. Instructing me to report same back to the House, it's following recommendations. Household 473, do pass, Household 567, do pass by committee substitute. Household 522, do pass, Household 612, do pass. Household 571, do pass by substitute. House Resolution 72, do pass. Respectfully submitted, Representative Hawkins, the 27th District Chairman. Representative Jesse Petrie, the 166th District Chairman on Committee on Human Relations and Aging submitted the following report. Mr. Speaker, your committee on Human Relations and Aging has added under its consideration, following bills of the House. Instructing me to report the same back to the House, following recommendations. Household 465, do pass by committee substitute. Respectfully submitted, Representative Jesse Petrie, the 166th District Chairman. Representative Gunner, the 8th District Chairman on Committee on Judiciary submitted the following report. To speak to your committee on Judiciary, he's added under its consideration, the following bills of the House. Instructing me to report the same back to the House, it's following recommendations. Household 179, do pass by committee substitute. Household 339, do pass by committee substitute. Household 482, do pass. Household 531, do pass by committee substitute. Respectfully submitted, Representative Gunner, the 8th District Chairman. Representative Clint Crow, the 118th District Chairman on Committee on Public Safety and Homeland Security submitted the following report. To speak to your committee on Public Safety and Homeland Security, he's added under its consideration, following bill of the House. He's the instructor, may he report the same back to the House, with the following recommendations. Household 246, do pass by committee substitute. Respectfully submitted, Representative Clint Crow, the 118th District Chairman. Representative Rick Jasper, the 11th District Chairman on Committee on Transportation submitted the following report. To speak to your committee on Transportation, as added under its consideration, following bills of the House. Instructing me to report the same back to the House, with the following recommendations. Household 224, do pass. Household 575, do pass by committee substitute. Respectfully submitted, Representative Rick Jasper, the 11th District Chairman. That completes the reading of the report to standing committees. Thank you, Mr. Clerk. Thank you. It's been brought to my attention, members. By the clerk of this House, Chairman Parrish, how calm and collected this room was, how quiet, so orderly, until the rules committee came in. I'm not sure what that says about. To all pin up, I guess, in your meeting, it comes unleashed when it comes down here. So we'll move on to our morning orders. The representative Carter. Is recognized. I'm going to we're going to work on a two minute schedule here, everyone. Up to two minutes, then that's into the line. Two minutes. I think you can do it less than that. I don't see Representative Carter, so we'll move on to... Oh, there she is. Representative Durin Carter. Ladies recognize. Give the lady your attention, please. Okay. Good morning. And friends. Yeah, and the chairman, I was supposed to be down here with us. Well, good morning, everyone. We have some special guests here with us today. It's the National African American Gun Association. They are here with us celebrating their 10th anniversary. Their Atlanta chapter is at Atlanta Bass Rees chapter. And this organization has been established to not only support the education of gun rights, but also training individuals. They have a huge initiative with educating our youth. They do a gun safety gun lock giveaway. So if you would at this time, please stay in the members of the National African American Gun Association. And you all give them a wonderful Georgia General Assembly. Welcome. Thank you so much. They're going to come downstairs and they say, well, join us in the entry room if you guys want to take pictures with us. Thank you. Any other way? Thank you. And welcome to the people's house. Representative Smith, you ready? Representative Tyler Paul Smith has recognized chairman Smith. Farah, give the gentleman your attention, please. Well, thank you, Mr. Speaker. Thank you, Mr. Speaker. Today I have the distinct honor and pleasure of welcoming the one A Division I, the leading state championship team, which just happens to be for my alma mater at Bremen High School. Throughout the year, they just kept on winning and winning and won when it really counted and brought one of many state championships. Mr. Speaker, we are proud to say that our team at the Bremen cheerleading has brought home to our beloved hometown. So I think they were supposed to be here this morning. They may be over in the Senate. But if y'all would just help me give them a round of applause. Thank you, Mr. Speaker. Congratulations to them. That's an awesome achievement. No doubt. Let's see. We have Representative Scoffio, Representative Kenna, and Representative Scott. Representative Brinnell, and Representative Davis, recognize some very important people in this state. So give the ladies in the way, or your attention, please. Thank you, Mr. Speaker. We are the colleagues and members. Today, we honor the dedicated school bus drivers and food service workers across districts, 58, 63, 76, 77, and 87 serving Atlanta Public Schools, Fulton County, Clayton County, and DeCab County. Their unravering commitment ensures our children arrive safely, start their day with nourishment and are cared for beyond the classroom. To you guys, you are the heartbeat of our schools. During early mornings and late evenings to uplift our students, we see you. We appreciate you. And we thank you for your invaluable service to your community. Your work does not go unnoticed. So today, we thank you. I'll have you stand in a minute, but we'll ask Representative Brinnell to come on up. Thank you, Mr. Speaker. I want to thank our superintendent, Dr. Anthony Spiss, Sam Coger, who is here. He's in charge of our maintenance department, Audrey Hamilton, nutrition, Denise Hall, transportation, and all of our cafeteria, maintenance, and bus drivers for all you do for our students. Welcome to the Georgia Capitol. And would you ask, would you all please stand there? Mr. Speaker, they're for awesome legislation for us too. Well, that's a good thing. Hey, thank you all for being here. Thank you for what you do. Things wouldn't work without you. I can assure you of that. So thank you all for y'all's hard work, and thanks for being here today. Glad to have you in the people's house. Chairman Chokus, Chairman Dickie, and some other friends. All right. All right. Members, we have some great friends in the gallery. So y'all stand up. Stand up. Stand up. We want to recognize and. Good. Absolutely. Gentlemen's recognized. Thank you, Mr. Speaker. Today is Georgia Ag Day at the Capitol. Today, the watermelon Capitol Queens, the Georgia, Miss Georgia commodity Queens, the Miss Georgia sweep potato Queens are excited to join us. These Queens are from all over the state of Georgia, and they have a passion for agriculture. They have been presenting some of Georgia's largest commodities throughout the year at various events, and we are proud for them to be a part of Georgia Ag Day here at the Capitol. And I'm just going to read off their names. I'm waiting. I'm sorry. Collins, Austin, baby, Miss Georgia commodity Lee Sternerman is Miss Georgia commodity. Scarlet Tyson couldn't make it. Teenie Miss Mellon, Avowokinson Miss Mellon, Abigail Odom, petite Miss Mellon, Jesse Blair, Miss Georgia commodity, and Miss Georgia sweep potato. Charlotte Schiflett, baby Miss Georgia commodity, Carter James Smith, little Miss Georgia sweep potato, Atlanta, and Teen Miss Georgia sweep potato, and Dora Downey, Teenie Miss Georgia sweep potato. Thank you, young ladies for being here. They have the looks and they have the wave. I can tell you that because they got that part down. They're going to do great. Thanks for being here. Thanks, Mr. Chairman and members for recognizing these young ladies. David Clark and representing Mathis, are y'all folks here? General recognized. Thank you, Mr. Speaker. Today, I want to congratulate the North Carolina High School Game Day Chair Squad upon winning the 2024 State Championship. This all-star team includes nine seniors, 14 juniors, two sophomores, and seven freshmen, all of whom have the heart of a champion and represent the swanity community with pride. Please help me welcome them to the gallery. Please stand, girls. We're proud of you. And I'm going to hand it over to Representative Mathis because one of the chair leaders has a very special place in his heart. Thank you, David. I appreciate that. It's my grand daughter sitting right up in front of Emma Kate Perkins. That's the reason I'm in that. And I appreciate you so much. And one little note, I was at the championship chair off over in Columbus and they did a great job doing what you did. Thank you again. Granddaddy, I know you were a little bit biased, but evidently the judges thought they were really good too. But congratulations, all. Good to have you with us. Quite an achievement. Representative Barry. And friends. Thank you, Speaker. I have my name for you. Give the gentleman your attention, please. We love all of our members of our minority Democratic Party, but if you are under the age of 40, can you please join me up here? It's true. I think it's just us. It's just us? Okay. Yeah, I think I'm going to be. Under the age of 40. Anybody under the age of 40? Thank you, Mr. Speaker. It is a great day. A special day for all of us up here because it is a young Democratic's Georgia day here at the Capitol. We're here. Young Democrats are coming from across the state advocating for gun safety, livable wages, and better schools. I was honestly this organization just two years ago and now is ran by the impeccable leadership of President Devonce Jennings. Where's he at? Devonce Jennings right there from Clayton County. We are here today to talk about several issues that relate to our state and moving our state forward. So we thank the people in the people's house today. Thank you, Mr. Speaker. Thank you. Welcome to the people's house. Maintenance crew was here too good. Glad to have you all. Representative Lauren McDonald, Governor's floor leader, recognized for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen, Mr. Warren here. Who are you looking for? Representative from Hall County. He's probably out on his shrimp boat somewhere. Anyway, today is EMS day at the Capitol. I want to welcome all of our frontline EMS professionals. I'd like to join from Cobb County is here with me. He knows it very well because he lives it every day. These guys are our frontline guys that are and the ladies are out there throughout our state, urban and rural, providing good professional EMS services in our communities. It's 49 years they've been providing frontline EMS care to our citizens. And March 2nd this Sunday is officially EMS day in Georgia. I would also want to thank our EMS Association. Gentlemen, if you all would stand up there, Chad Black, he's one of our big leaders that helped get us great that is here every day to provide a service to not only us as members, but the people that attend the people's house each and every day. But I want to thank our EMS professionals that provide this service throughout our state. Thank you. Great work. Some good EMS professionals right here in this body as well. Thank you for what you all do and welcome to the people's house. Representative Niu and friends and friends, ladies recognize. Thank you, Mr. Speaker and colleagues.\n\nPlease join me in welcoming the Georgia Federation of Republican Women in the gallery today started in 1957 with the first club in Augusta. We now have over a thousand members in the state and over 65,000 strong across the country. Last election cycle, our ladies made over 1.4 million calls. Over 14 million volunteer hours, the GFRW is educating, engaging and empowering women to be part of the political process. Welcome them to the People's House. Please stand if you're in the gallery. Thank you, Mr. Speaker. Great to have you all appreciate what you're doing. Representative Cohen, don't leave. The ladies recognize for a morning order. Give the lady your attention, please. Good morning to piggyback on that recognition. I'd like to honor and recognize the hardworking volunteers and my friends of the Henry County chapter of this other traditions Republican women. And some are still in the hallway, making their way in. Thank you so much for being here today. Thank you for recognizing them. Thank you all for being here. We're great to have you in the People's House. Majority Leader, Eftration, is recognized and I thank some folks that are going to join you. Members, this is an important one that we're going to give thanks to a person who has served this house. And the leader is going to give us some information on that service and some thanks of members if you'll give the. Mr. Leader, you're recognized. Thank you, Mr. Speaker. Well, this is really a bittersweet day for my office, the representatives who are standing here with me and the entire House of Representatives. Today is the day of retirement for Mrs. Talmadjames who has served this chamber and the state of Georgia honorably for 25 years. She has worked as an administrative assistant, my office worked and thank you members for joining me up here. She's worked with Chairman Dickie, Chairman Hatchett, Chairman Rhodes, Chairman Powell, Leader McDonald, Leader Gamble, Leader Hong, Leader Wade and many others here in this chamber. And just provided exemplary service to our constituents, has worked incredibly hard for the House of Representatives and she is joined here on the floor today so that we can present her with House Resolution 404, signed by you, Mr. Speaker. Thank you so much for co-sponsoring along with her husband, Lee Roy and her family. If you would please House of Representatives, if we could give the incredible Talmadjames a round of applause in the day of her retirement. Thank you. Talmadjames, you mean so much to all of us. Congratulations and best wishes in your retirement. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Chairman. Thank you, Mr. Chairman. Talmadj, can you do a favor for me? Would you write down the recipe so we can share with some other folks how you made all these folks look so good? I will tell you. Thank you for your service. Thank you for caring for all of us and thank you caring for this House. That was a heavy load to make you look good in a lot of ways. I won't go any further than that. She did great and has done great best of luck to you and thank you family for allowing her to serve. That completes our morning orders. Thank you members. Thank you. Will the James family join me up here? And you can bring your mom and Ms. Talmadj with us. Members, I'm going to photo up here. I'm honored to be able to do that. But I want to invite you if you want to join Ms. Talmadj and the family in that south any room and thank her for her service and have a photo. You can do that as we move on to the rules calendar. You can do that. Thank you. Thank you. Members, we'll move on to the rules calendar. Mr. Clerk, will you read the caption to House Bill 307? House Bill 307 by Representative Ballard, 147th and others being titled an act to amend Part 3, Mark 6, Chapter 2, Title 20 of the Fisher Code of Georgia and Tederlain and Educational Programs and the Quality Based Education Act. So, there include provisions for students significantly at risk of not achieving great level reading proficiency. This bill I'm referring to the committee on Education Act. Committee recommends a disbilled do pass by Rules Committee Substitute. I want you to give the ladies going to be in the well your attention. The lady from Warner Robbins knows a little bit about this subject matter. We appreciate her leadership here. So with that, I'm going to recognize Representative Ballard to present House Bill 307. Thank you, Mr. Speaker. House Bill 307 is a continuation of this body's hard bipartisan work and its strong commitment to improving literacy that we began in 2023 with the passage of House Bill 538. We are continuing to head in the right direction, but more work is needed to ensure that our children and all our children read proficiently. This bill removes outdated language regarding programs that do not align with our new science of reading standards, defines characteristics of dyslexia and dyslexia, and creates the structure and composition of the Literacy Coach Coordination Committee. To ensure our state's literacy coaches get quality and uniform training. That's the bill, Mr. Speaker, and I will stand for any questions. The lady has a question if you're yield. I am. To your left, Representative Rice has recognized for a question. Thank you, Mr. Speaker. Do you yield? Representative Ballard, is it not true that early identification and intervention for students with reading difficulties can significantly improve their academic outcomes? Absolutely. When we identify these children in kindergarten or first grade, they might need this much help to get on grade level. When we wait till third or fourth grade, they need this much. So it's imperative we identify them early. Good question. Good answer. You have one more question from a gentleman who knows a little bit about education. Chairman Irwin, to your right. Thank you, Mr. Speaker, and does the general lady yield? I am. Is it not true that ensuring educators receive the necessary training to identify and sports students with reading difficulties will lead to a better educational outcome for this entire state, including all of our citizens? Absolutely. Great bill. Thank you. Thank you so much. Lady, you have one more? One more. Her representative Barnes has recognized up to your left up to the center aisle. Thank you, Mr. Speaker. Thank you for bringing this bill. Is it not true that when children are fed a nurse meal that they help some read better and perform academically in school? The lady knows of that of which she speaks. Thanks for this bill. Thank you. Lady has one more? One more, and then I'll go and get out of here. One more. Representative Silcox to your right straight up center aisle. Does recognize for a question? Thank you, Mr. Speaker. Does the general lady yield? I yield. Is it a true representative, Mallard, that this will also contribute to Georgia's economic success by fostering a more skilled and workforce and educated workforce? Absolutely. Children cannot be successful in school or in life without reading proficiently. And with that, Mr. Speaker, I yield the well, and I would appreciate your favorable consideration. The lady is yielded the well. Thank you for your presentation. Is there any objection to the previous question being ordered? Here in none the previous question is ordered. Is there any objection to withdrawing the committee's substitute? Here in none the committee's substitute is withdrawn. Is there any objection to adopting the substitute off by the committee on rules? Here in none the rules committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Yes. Yes. Yes. Have all members voted for what purpose is Chairman Hilton rise? Parliamentary inquiry. Mr. Speaker, is it not true that under your leadership Chairman Irwin and Representative Ballard, who has taken significant strides in literacy and House Bill 307 has yet another step toward making movement to make sure that every child in our state reads as they should? Is that not true? I think General Manose of what he speaks is a team effort. This House is behind literacy and I think the vote on the board clearly demonstrates the quality of this bill and the dedication of this House of literacy in our state. Have all members voted? Yes. Mr. Clerk, will you lock the machine? On the passage of House Bill 307, the yeas are 166. The nays are zero. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption of the House Bill 423? 423. The House Bill 423, by the way, of the 9th and others to be entitled to amend Article 12 of Chapter 3 and Title 38, Part 4, Article 2, Chapter 5, and Title 46. The official go to George Anantetti relating emergency communications authority and emergency telephone number 9-1-1 system. This bill I refer to the Committee on Public Safety and Homeland Security. That committee recommends a disbile due pass. Governor's floor leader, Representative Will Wade, is recognized to present the bill. Representative Wade. Thank you, Mr. Speaker. The colleagues I rise today to request your favourable support of House Bill 423. This is what has deemed the next gen 9-1-1 bill. This is a bill that came out of a study committee that was going to help improve public safety and our overall 56-year-old system when 9-1-1 was approved. When 9-1-1 was originally introduced in our state. And while some of our communities, very few of them are currently utilizing this technology to help improve and be in a 21st century service level for our citizens, whether it be folks in rural Georgia, suburban Georgia, or in our urban centers, all across our state we see a great need to utilize current technology. This current bill will amend the purpose and duties and responsibilities of our agency, GEMA Homeland Security, to include procuring, implementing, and overseeing the next gen 9-1-1 service. It will amend the responsibilities of our executive director and representation from information technology, cyber security, geographic information systems, commonly known as GIS, and also to the G-Caborda directors. This is going to be critical to help maintain better public safety service delivery and help lives of all Georgians all across the state. With that, Mr. Speaker, I would be happy to answer any questions. And again, I ask for your favor, consideration for this very important agency legislation. Thank you, Representative Wade. You do have several questions. Representative Hefner, to your left about midways back. Ladies recognized. Thank you, Mr. Speaker. Mr. Gen. Maniel. I certainly do. Sir, thank you so much for bringing this bill. This particular type of legislation would have offered much needed support during the time of Hurricane Helene. When in the Augusta area we had a complete blackout. There was no land lines and no cellular lines. Our GEMA and FEMA all had problems communicating with the police and the fire department. So this bill circumvents the current system and helps us to have a more adequate process online. Is that correct? That is correct. You know what you speak. Yes, ma'am. Thank you so much, sir, for bringing this bill. Thank you. And gentlemen, here for another question. I'll give it for one more question, sir. Representative Niew has recognized for a question to your right. Thank you, Mr. Speaker. Does the gentleman yield? Yes, I do. Is it not true that this bill will modernize George's emergency response system by implementing next generation 9-1-1 and ensuring faster, more efficient and accurate emergency responses? Yes. The general lady knows exactly what she speaks. Yes, ma'am. Thank you for this bill. Thank you. All right. If there are no further questions, Mr. Speaker, I look for your favor. You have a couple other questions. That's your choice. I'll one more. I'll take a question from Representative Senschis. General's recognized to your right. Thank you for being this important bill. Does the gentleman yield? I yield. Just a quick question. Is there a language already in the bill about making sure that the location access that these new services provide will only be used for when that knows 9-1-1 services are being used, like specifically narrowly for those cases? So this is specifically for 9-1-1 usage. That is correct. And so do you yield for further questions? Sure. So when they have access to the location of an individual that will only be used for the specific 9-1-1 case, correct? And that would be initiated by the actual person that isn't making that connection to 9-1-1, it is not reversible. Great. Thank you for this great bill. Thank you very much. And with that, Mr. Speaker, I yield and I appreciate your favor. Consideration. Is any objection to the previous question being ordered? The gentleman's yielded the well. Hearing none of the previous questions ordered. Is any objection to agreeing to report of the committee, which was favorable to the passage of the bill? Hearing none the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is representative Reese rise? Parliamentary, angry, Mr. Speaker. State your inquisitor. Mr. Speaker, isn't it true that since the implementation of 9-1-1, we have become better at responding to emergencies. And this bill here is going to help us keep up with the times in addition to systems like 2-1-1 that help with non-emergency situations doing natural disasters and other trying times for Georgians. I can totally agree with the gentleman. He knows what he speaks. Thank you for the question. Have all members now voted? All members voted. If so, the clerk will unlock the machine on the past of House Bill 423. Then the A's are 163. The A's are zero. This bill has received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to House Bill 475? 475. House Bill 475, I represent a gamble with 15th and others to be entitled to amend the Code Section 48740.026. The official code of Georgia and Antietta related income tax credits for film gaming, video or digital production. This bill will have them for the committee on Grady of Arts and Entertainment. That committee recommends a disbilled do pass. Representative Matthew Gamble is recognized to present the bill. The gentleman from Carter's bill. Yes, the gentleman, your attention please. Thank you, Mr. Speaker. Colleagues, I rise to present to you House Bill 475 today. And what I want to make sure you understand is that this is simply a Department of Economic Development bill that will clean up, clarify and confirm some things as it relates to our film tax credit. This is not an expansion of that. It has nothing to do with that. But we're updating some terminology like the word laser disk is no longer relevant in this credit. So we will be deleting that. But televised in front of commercial advertisements is somewhat of an outdated terminology because not all commercials are televised as they once were when this was originally proposed. We're also clarifying and adding definitions for subscription based platforms. Free advertisers supported streaming because those are some new things that are now part of the film industry as well. And then the main thing that this does is if someone applies for the film tax credit and is denied by the Department of Economic Development, they can appeal to an administrative court. And we have to pay for legal fees in defending ourselves as the state in the promulgation of that film tax credit. And so this would create a loser pay scenario where if they appeal and they are ultimately denied in that appeal, they were responsible for paying those attorneys fees. So that is the essence of House Bill 475, just a simple cleanup bill from the Department. And I would ask for your favorable consideration and I'm happy to answer any questions. Gentlemen has a question. Representative Ramon to your left. Hi, does gentleman yields? I yield. So I don't know if it's because I'm millennial, but we were just wondering what is a laser disc? So a laser disc. For those of us that lived through the 90s, a laser disc was a really big deal. And you know, I don't really see a lot of those out there anymore. But at the time, if you had a laser disc player in the 90s, you had something really special. It would have been like a high definition, 5K, you know, but at the time that was a big deal. We're deleting that terminology because it is an antiquated technology no longer used. So that's what a laser disc is, but I appreciate the question. With that Mr. Speaker, I will yield the well and ask for your favorable consideration. Gentlemen, is yielded the well? Is any objection to the previous question being ordered here in the previous questions ordered? Is any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the report, the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Yes, all those opposed. We'll vote no, Mr. Clerk, will you unlock the machine? Will you unlock the machine? Have all members voted? All members voted. Mr. Clerk, will you lock the machine? All in the passage of House Bill 475, the yeas are 161, the nays are two. This bill, having you see the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption of House Bill 495, 495? House Bill 495, I represent a ticky, the 134th and others to be entitled, and act to amend title 20. The official go to Georgia and annotated relating education. So it's the repeal, chapter 18. This bill ever referred to the Committee on Agriculture and Consumer Affairs, that committee recommends a disbilled do pass by Committee Substitute. Someone from Newsella, representing Mark Robert Dickie, is recognized to present the bill. Thank you, Mr. Speaker, and distinguished House members. I bring you a East Bay 495, Georgia Center for Rule Prosperity and Innovation. So, Georgia's blessed to have the Center for Rule Prosperity, which was organized six years ago. The rules center exist to build and exist rural communities and businesses to help them prosper. You know, 120 out of 159 counties are considered rule. And many are plagued by population loss, insufficient access to health care, quality education, and infrastructure, and lack of employment opportunities. And so this center serves as a center for information and research to help with best practices in those communities. The goal is to reconnect the state's rule in urban people and places. It's leverage $425 million of investment in those communities. So this bill simply moves this great center from A back over to the Georgia Department of Agriculture. And that's really all it does. It keeps its same budget, budget line in our budget, no change in board or any other responsibilities. It's just better for long term stability and efficiency and just better lines there. So that is what we're asking you to do is to simply move this from under USG over to the Department of Agriculture. I'll be happy to take any questions, Mr. Speaker. Gentlemen, I think he has a question, but I just wanted to thank him for bringing this bill. This center has done a lot of good work working for rural Georgia. And I think this is a good move and we appreciate you bringing it up for what? See, you're going to yield for a couple of questions. Is you good for a couple of questions? You do have a couple of questions. I'll take one or two. Representative Osteen has her button, nice. Ladies recognized. Mr. Speaker, is it not true House Bill 495 will help to bolster rural? Representative, I don't know the answer to your question. I'll go and tell you now. I think Chairman Dickie made that. How you yield? Chairman Dickie. Is it not true House Bill 495 will help to bolster rural prosperity across the state? It absolutely true. Thank you for that. I knew the answer to that one. I'm sure if it's one more. You got one, you'll take one more? I'll take one more. Representative Joe Campbell is recognized to... There he is right to your right. I'm sorry. I was looking further back. Representative Campbell. Thank you, Mr. Speaker. Does General Niel... I do. Is it not true that transferring the Center for Rural Prosperity and Innovation to the Department of Ag will allow for better coordination of resources and expertise to support George's rural communities? Yes, sir. With that, Mr. Speaker, it reminds me of a quote by a great philosopher, Contamas Carlisle. It says, the main business is not to see what lies dimly in the distance, but to do what clearly is at hand. So I ask you members to pass this bill this morning, vote affirmative, and thank you for your consideration. Great bill, great city to you are, and a great philosopher Carlisle was. No doubt about that. Is any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is any objection to adopting the Committee's substitute? Hearing none, the Committee's substitute is adopted. Is any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. This bill now passed. All in favor of the passage of the bill. We'll vote yes. All those opposed? We'll vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. Representative Osteen, did you have a problem in your inquiry? Did you have an inquiry? You must inadvertently hit your...\n\nbutton I guess so we won't recognize you then have all members now voted all members voted if so miss clerk were you locked the machine on the passage of House bill 495 the yeas are 167 the nays are zero this bill haven't seen the requisite constitutional majority is therefore adopted you meet you need to watch your neighbors over there I thank you do and good luck with that with that group miss the clerk were you read the caption to House bill 6666 House bill 66 by representative Stevens on 64th and others we titled an act to amend chapter 5c a total 48 of the fish go to Georgia annotated relating to title at the alarm tax on motor vehicles so to expand the definition of a rental motor vehicle this bill I'm referring to the committee on ways it means that committee recommends a dispelled do pass by committee substitute the dean of the Chattam County delegation representative Ron Stevens is recognized to present the bill mr chairman thank good luck ladies and gentlemen the House House bill 66 relates to the t a v t and how the taxes paid when purchasing certain vehicles currently we've got some heavily modified vehicles that basically have a chassis that's made specifically for the movie industry they're rented out once they're made all this bill does is it moves them to a motor coach type titling provisions so that it gives them the opportunity to pay half of the tax now and then half of the tax within one year this is exactly the way the motor coach division works it's something that will help these folks stay in business as they begin to rent these vehicles and it does not reduce at all the amount of t a v t this do mr speaker that's what it does and I'll answer any questions if there are any gentlemen has no questions oh you the well thank you thank you mr chairman is any objection to the previous question being ordered here he none the previous question is ordered is there any objection to adopting the committee substitute here in the committee substitute is adopted is any objection to agreeing to the report of the committee which was favorable to the past to the bill here in the other report the committee is agreed to shout this bill now pass all in favor of the past to the bill we'll vote yes all those opposed we'll vote no and mr. clerk will you unlock the machine have all members voted all members voted if so mr. clerk will you lock the machine on the passage of house bill 66 the yeas are 164 the nays are two this bill have received a requisite constitutional majority is therefore passed mr. clerk will you read a caption to house bill 377 377 house bill 377 my reps and I've levered the 123rd and others being titled back to amend subpart one and part four of article two a chapter two a title eight of the physical to judge annotated relating the general provisions for manufactured or mobile homes so to provide for limited exceptions to circumstances under which a manufactured home shall become real property this bill ever further the committee on banks and banking that committee recommends this bill do pass and gentlemen from the granite capital of the world in that right the upperton Georgia represents leverage to recognize to present the bill thank you mr. Speaker ladies and gentlemen I have house bill 377 this is a bill that will encourage the availability of credit for work force housing within the state it has to do with manufactured housing what I call a mobile home sometimes a trailer but everybody in the business their head explodes and use that term this basically has to do with the manner by which you can surrender the title to a manufactured home after it's located on real estate this this bill will simplify that process it will hope it is thought that it would encourage the presence of lenders in that space so that folks can get loans for these and it will streamline the process of converting a loan which is based on the status of the mobile home as personal property into a loan like a mortgage loan which is based on it being converted to real estate this has to do with there's a existing process in the law where you surrender that title and file a certificate of permanent location this just tries to streamline line that and encourage it because it protects the status of any lien a lender has if it's converted so it's again it's the idea is it will encourage the availability of credit in this kind of marketplace so we're hoping it'll help with workforce housing in the state and that's basically the bill must speak around glad to answer any questions you have a question to you lia for a free as recognized for a question thank you miss speaker does the gentleman you absolutely yes sir in it's really that I'm sure he could use this legislation about a year ago and I was trying to get an abandoned trailer off my property and I could not move it because we could not find the title to it and we had to go through about a three or four month process before I can even enter the building because the trailers treated like a vehicle not a house and this helps it be treated like a house as we are fond of saying in this building the gentleman knows of what he speaks thank you sir appreciate you thank you gentleman here for one more yes sir representative wait to your right in the back has a question yes sir I'll yield is it not true that House Bill 377 simplifies the tiling process for manufactured homeowners which will reduce bureaucratic delays and also will add to the real property tax base for local counties and cities I am truly impressed by the level of knowledge and understanding the gentleman this place well I was going to vote yes now I have to accept thank you and surprised well yes a little bit miss speaker but he impressed me today gentlemen have a further questions I'll yield the well and ask your favor consideration House Bill 377 gentleman is yielded the well is any objection to the previous question being ordered hearing none the previous question is ordered is any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report the committee's agreed to shy this bill now pass all in favor of the passage of the bill we'll vote yes all those opposed we'll vote no and Mr. Clerk will you unlock the machine have all members voted for what purpose is represented health and arise parliamentarian quarry mr. Speaker stay chin quarry ma'am is it not true that as the former motor vehicle director for Richmond County it is it is a relief to have this measure in place for constituents who would normally have to go get a bonded title and pay the expenses in order to be able to get the title for this vehicle I'm sure it'll make life easier but we want you to stay here we don't want you to go back there and assume their responsibility again so the lady knows of what she speaks on this question thank you for the question all members voted if so mr. Clerk will you lock the machine on the passage of house bill 377 the yeas are 166 the nasa zero this bill haven't received the requisite constitutional majority is therefore passed mr. Clerk will you read the caption to house bill 422 422 house bill 422 by represent of mccollum of 30th and others to be titled tonight to amend chapter 18 title 45 the fish go to Georgia and Tater relating employees insurance and benefit plans so as required the states employees health benefit insurance benefit plans include high deductible health plans this bill ever through to the committee on insurance that committee recommends a dis bill do pass represent mccollum is recognized to present the bill the gentleman is recognized give the gentleman to well you're attention please thank you mr. Speaker ladies and gentlemen I bring to you hb 422 which is passed unanimously out of the house and senate last year was was veto veto by the governor due to a fiscal note this year we have a fiscal note and it's a cost savings to law premiums and taxes which result in immediate savings from both the state state and employees it makes it it lets the employees have a ability to pre-tax contributions to a high deductible savings account if they have a high deductible insurance plan at this time I will consider consider your favor favorable consideration thank you at least I didn't amend my amendment this year you getting better me too I mean we'll we both the work in progress I tell you that mr. Speaker gentlemen you're for gentlemen you're for a question how you are for question thank you represent no we must see you're right way to your right house of question gentlemen's recognized representative do you deal for a question I do thank you is it not true by offering these health savings accounts through payroll deduction that it is going to enable this state employees to purchase the health savings account through pre-tax dollars therefore saving them money in the long run is that not true sir it is true thank you for bringing this bill thank you President McCullough you have no further questions are you out of the well gentlemen's yielded the well good job is there an objection to the previous question being ordered hearing none the previous question is ordered is any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no mr. Clerk will you unlock the machine have all members voted for what purposes represented gamble rise parliamentary inquiry state-owned quarry mr. speakers it not true that this bill does not eliminate any current health insurance options but simply provides additional choices for the state employees and as we know choices are always good good degree any stronger would you thank you for your observation your insight have all members now voted all members voted if so if so mr. Clerk will you lock the machine on the passage of house bill 422 the yeas are 163 the nays are zero this bill here to see the requisite constitutional majority is there for past you got a good style there represent McCullough you're doing good keep it coming mr. Clerk will you read the caption to house bill 373 373 house bill 373 by ribs and a glaze the 67th another's be titled back to men article one chapter 24 of title 33 the fiscal to George annotator relating to general provisions regarding insurance so as to require major medical coverage for annual prostate cancer screening for certain men this bill emphir to the committee on insurance that committee recommends a disbilled do pass by committee substitute I want you all to give the lady in the will your attention blazes very important bill representative glaze is recognized to present the will give the lady your attention thank you mr. Speaker my dear colleagues I rise before you respectfully to ask for your favorable consideration for house bill 373 this is a requirement for major medical insurance coverage for the annual prostate cancer screenings for men of high risk and the reason we need this is because the men in Georgia will have 11,000 new cases of prostate cancer this year over 1100 of our brothers will die in this state this bill will help to improve early detection treatment of prostate cancer and ultimately save the lives and reduce the financial and emotional burdens on the families who suffer the loss of their loved ones through prostate cancer this bill has strong support from medical professionals patient advocacy groups and concerned citizens who recognize the importance and the access to preventive health care I thank you and open for questions lady you used it for will you for a couple of questions represent the breeze to your right is recognize for question thank you mr. Speaker with the general ideal for question yes sir representative glaze is the true the house insurance committee study your bill and approved it overwhelmingly and then announced a prevention's worth pound of care when it comes prostate cancer I agree with your whole heart and leave thank you lady you for another question yes sir representative prince chairman prince your left has a question general's recognized will lady you yes sir isn't it true that prostate cancer amongst men are most commonly diagnosed it done early we can possibly cure that person you are correct and thank you thank you for the bill representative Henderson has recognized for a question to your left thank you mr. Speaker will the general lady yield yes ma'am isn't it true that prostate cancer is a leading cause of death for men in Georgia yes ma'am and if detected early men would be able to see sunshine and live a cancer free life thank you for bringing this bill thank you represent the Jasmine Neil has a question to your left does the lady yield yes ma'am is it not true that this is your first bill yes it is it's also not true that you are doing this bill in honor of a former member of this house who passed away tissue negacy that is correct thank you what a fine lady she was to on a great representative thought a lot of miss tish representative representation was a a good friend we have a couple more questions at the lady will yield I do yield representative holly is recognized for a question to your left did the general it you yes sir is not true that you're taking of this matter and putting it before the public you not only speak for the many the multitudes of African American men who may be affected by this but also the families that love them that would hope that our state do more to allow for them to be able to see be seen in her full early detection thank you sir this bill is will help all men in Georgia and we're grateful if we can pass that today we are grateful for you representative Hagen to your right has a question thank you mr. Speaker do you yield yes ma'am thank you we have had many conversations so I know that you are very compassionate woman and do care greatly for other people and isn't it true that my father successfully battled prostate cancer a few years ago and it was that early detection that helped him to get in front of it and successfully complete his treatments and isn't it true that I greatly appreciate your work here to help other people and make sure they get the care that they need thank you so much for sharing your story of success and we hope that there'll be many more as a result of this bill later you over another question we're gonna be Paris just recognize for a question thank you mr. Speaker yes thank you sir does he General Lady Beild yes ma'am is it not true that the risk of prostate cancer increases with age and that with early detection we can get the numbers down of deaths and make sure that you know people live a longer healthier life that is correct thank you thank you so much for this bill and your beautiful work on it and thank you representative Koyay representative Koyay is to your left is recognized for a question does it really later yield yes sir is it not true that though this is your first bill you sound like a veteran down there I don't know about that but thank you for the compliment let's get one from the medical perfection representative representative doctor Newton to your right is recognized for a question thank you mr. Speaker with a generally yield yes sir doctor is it true that we had an opportunity to work together on this and perfect this bill and that in doing so you're making it possible for a disease that might involve very invasive and difficult treatments to be caught so much earlier that it can be very benign in the medical profession can do what we need to do which is care for all of us well I want to say thank you to you doctor Newton for your work inside of this bill and your support and this bill hopefully will go forth and take care of the lives of many men in this state again thank you for your collaboration partnership thank you for your work you're doing such a great job I want to recognize one more if you let me do it yes sir rift and is recognized for a question to your right would agenda lady yield yes sir is it not true at age 45 I started having yearly prostate counsel test I hope that is true and I hope many more men will start around 40 now well I'm trying to and trying to go somewhere with that question okay with a gentle lady continue to yield for another question is it not true after taking those tests yearly at age 65 I came up with prostate counsel but it was in the early early stage and I went through the treatment and I am still counsel free thank you for bringing that bill thank you for sharing your story and with that I ask your favorable consideration mr. speaker I yield the well gentle ladies you to the well represent you glaze I don't think the outcomes in question but we'll do it anyway is any objections to the previous question being ordered here you know the previous question is ordered is any objection to adopting the committee substitute here you know the committee substitute is adopted is any objection to agreeing to the report of the committee which was favorable to the passage of the bill here you know the report the committee has agreed to shout this bill now pass all in favor of the passage of the bill we'll vote yes all those opposed we'll vote no and mr. Clerk will you unlock the machine have all members voted for what purposes represent the Jasmine Clark rise parliamentry and green mr. Speaker statue inquiry isn't not true that I am very much in support of this bill because my own father during the COVID-19 pandemic missed his PSA test just that one year and the difference between getting screened in 2019 and getting screened in 2021 was the difference between him being cancer-free and unfortunately still battling cancer prostate cancer to this day our prayers with your dad and we wish him the best outcome at very much possible thank you for your certainly knowledge of this testing thanks for your obviously as well and thank you for your vote have all members now voted all members voted if so mr. Clerk will you lock the machine on the passage of house bill 373 the yeas are 164 the nays 1 this bill had received a record of cost to some majority is therefore passed congratulations and thank you again congratulations representative glaze and thank you good job appreciate you working that bill mr. Clerk will you read the caption of house bill 24240 hospital 240 by restaurant Williams the 148 to be entitled back to men park to article 15 chapter one of title 10 an article 13 to chapter one of title seven of the fish go to Georgia and Tate relating to fair businesses practices act in licensing of mortgage lenders and mortgage brokers this bill ever for the committee on banks and banking that committee recommends that this bill do pass thank you members members we're moving on with the rules calendar now of course real and house bill 240 is the clerk just read the caption representative no Williams is recognized to present the will bill representative Williams thank you mr. Speaker members this bill should sound familiar to you from last year it was a trigger leads bill it passed out of this house unanimously it died a slow death on day 40 across the hall basically this is a consumer protection act when you're getting alone a mortgage loan basically what trigger leads are they they're generated when a lender pulls a consumer credit report through trans union aquifax experience and then they sell those consumer information to other lenders what this bill helps to do is to stop unwanted solicitation when someone applies for alone they still can use their current mortgage or their vendor but this just stops the companies from selling to other companies and then you getting those inundated with tax with um faxes and emails and text messages trying to get you to switch a lot of times people's credit is ruined there's a lot of fraud and deception and we had a lot of bankers calling I'm warning this past this year it comes a hundred percent by the mortgage bankers association it's a great bill for the consumers and it's a great bill for state of Georgia well that mr. Speaker I'll yield for any questions gentleman has a question to your right representative Martin is a nice work question gentleman yield for a question I certainly do I could have come down to speak on your bill and support of it but I'll ask you this question isn't true that what you are doing here is in fact stopping fraudulent actors in the process because you and I have talked isn't true that I am aware of cases where people not only get these trigger leads and communicate with the loan originator the customer as if they are the original broker that the general the citizen went to and this could also cut out that as a potential for those fabulous folks that would take that isn't that true yes sir that is correct it will help stop harassment deception and fraud and predatory lending and the gentleman knows of what he speaks gentleman yield for one more from representative Wade yes sir to your right in the back representative Wade do you have a question yes sir gentleman yield sure is it not true the House Bill 240 will enhance consumer protection and reduce confusion among potential home buyers in the buying process as well as homeowners in the refinance process as a banker I know you know what you speak and I appreciate you asking that question thank you sir appreciate your support on House Bill 240 Mr. Speaker I will yield the well thank you sir thank you Mr. Chairman the gentleman's yield of the well is there any objection to the previous question being ordered here he none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine have all members voted all members voted if so Mr. Clerk will you lock the machine on the passage of House Bill 240 the yeas are 160 165 the nasa zero this bill has received a requisite constitutional majority is therefore passed Mr. Clerk will you read the caption of House Bill 303 House bills 303 over a sort of gillier to the 160 second and others to be entitled next to men chapter 33\n\nTitle 50 of the EFISCO to Georgia annotated relating to state flag seals and other symbols shows to provide replacement of a monument to honor the original 33. This bill that referred to the committee on state properties that committee recommends that this bill do pass. For the representative Gileo Art is recognized to present the bill from Senate Carl Gileo Art. Thank you, Mr. Speaker. Today I rise at the pinnacle moment to present House Bill 303. My brothers and sisters, in 1868 there were 33 courageous men. 25 of them were AME ministers. 33 original members of the House and the Senate. They were African American Republicans. They were courageous Americans. The original 33 stood up so that we can sit down. This bill is a bill that commemorates 33 great Americans. Let me just briefly say their names. Ellie Barnes, James Ward Porter, Henry McNeil Turner, William Gilford, William Henry Harrison, Thomas M. Allen, Thomas Beard, Edwin Belcher, George H. Clawer, Abraham Coby, Romulus Moore, John T. Coulston, Madison Davis, Monday Floyd, F. H. Fyrell, Samuel Gardner, William A. Golden, my great great great cousin, Elysees L. Houston, James M. Sims, Philip Joyner, George Linder, Philip Lumpkin, Peter O'Neill, Alfred Richardson, Alexander Stone, Abraham Smith, John Warren, Samuel Williams, Tunis Campbell Jr., Malcolm Clayburn, Reverend Tunis Campbell Sr., Aaron Bradley, and Mr. George Wallace. They were the original 33. They were not allowed to serve in this general assembly. In the 1870, they petitioned to come back and serve. Unfortunately, 14 of them were lynched. I want to thank the Dean of this house. I want to thank the State Properties Committee for having the posture to do what is right to salute 33 great Americans. Mr. Speaker, I want to thank you on today for having the chairman of the rules coming. I want to thank you for having the posture to salute 33 original members of this United States of America. We ask today that this bill only simplifies to have 33 names that were not allowed to be inside of the walls of this capital to be able to be placing their names. Today I ask for your Facebook consideration of House Bill 303 to salute these great Americans. Mr. Speaker and members of this great body, I yield the well unless you have any questions. Gentlemen, ask no questions, but we do have some speakers. The speaker, I yield the well. Thank you, Representative. Gentlemen, as you are the well, Representative, I would like to thank you. I would like to thank you for having the posture to salute 33. Thank you. Thank you. Thank you, Mr. Speaker. I'm colleagues. Today I want to talk about House Bill 303. This is a bill close to my heart because it's about honoring 33 very important extra-ordinary people. These were the first African-American legislators elected to the Georgia General Assembly in 1868. Just three years after the Civil War, imagine the courage it took for these men like Tunis Campbell, Henry McNeil Turner, and Philip Joyner to step forward to serve in a time when this cause of slavery was still raw and the promise of equality was very, very fragile. They were elected by their communities, but that same year their service was cut short because they were expelled from the General Assembly simply because of the color of their skin. This story is one of resilience and hope, but also one of injustice for over 150 years of their contributions have been overlooked. Their sacrifices for gotten HB303 is going to change that. It simply calls for a monument to honor the original 33. It last attribute to their courage and a reminder of the progress we've made and the work still to be done. This monument isn't just about the past, it is about the future. It's about teaching our children the importance of representation, justice and equality. It's about saying we see you, we honor you, and your legacy matters. And let's be clear, this monument is going to be funded through private donors, not taxpayer dollars. It's a community effort to write a historical wrong and celebrate the pioneers who paved the way for so many of us like myself. So I ask you to join me in supporting HB303, let us honor the original 33, not just for what they endured, but for what they achieved. Let's ensure their story is remembered, their sacrifices acknowledged, and their legacy celebrated. Oh, thank you, Mr. Speaker, I yield. Thank you. The gentleman is yielded the well. Representative Holly has recognized, Representative Holly has recognized, I speak to the bill. I'm not recognized. Thank you, Mr. Speaker. Giving words to this moment today, I thought it best to remember the earlier eloquence of a time in which those members, who themselves were members, spoke their own truth. At this time, I would like to give voice to words that were spoken in the chamber of the House, not particularly in this building, but in the House that is in Millageville, of which my ancestor helped to build. Spoke this, Henry McNeil Turner, founder of the Georgia Republican Party. Mr. Speaker, before proceeding to argue this question, opponents in Trans-Syck Marits, I wish the members of this House to understand the position that I take. I hold that I am a member of this body, therefore Sir Aishal, neither fond or cringed before any party, nor stooped to beg them for my rights. Some of my colored fellow members and the course of their remarks took occasion to appeal to the sympathies of members of the opposite side and to eulogize their character of amenity. It reminds me very much, Sir, of slaves begging under the lash. I am here to demand my rights and to hurl thunderbolts at the men who would dare to cross the threshold of my manhood. I claim the rights of a man. Am I not a man because I happen to be of a darker hue than honorable gentleman around me? Let me see whether I am not. I want to convince the House today that I am entitled to my seat here. Am I a man? Have I a soul to save as have you? Does God saw it fit to make some red, some white, and some black, and some brown, or are we to sit here in judgment upon what God has seen fit to do? If you deny me the right of my constituents to have representation here, because it is a privilege, then Sir, I will show you that I have asked many privileges as the widest man on this floor. If I am not permitted to occupy a seat here for the purpose of representing my constituents, I want to know how white men can be permitted to do so. Never so help me, God. Shall I be a political slave? I am not now speaking for those colored men who sit with me in this House. Nor do I say that they endorse my sentiments, but assisting Mr. Lincoln, that is the President. To take me out a servile slavery did not intend to put me in my race into political slavery. If they did, let them take away my ballot. I do not want it and shall not have it. I don't want to be a mere tool of that sort. I have been a slave long enough already. The colored men who are unable to express themselves with all the clearness and dignity and force of rhetorical eloquence are laughed at and derisioned by the democracy of this country. It reminds me very much of the man who looked at himself in a mirror imagining that he was addressing another person and exclaiming, my God, how ugly are you? These gentlemen do not consider for a moment the dreadful hardships with which these people have endured, and especially those who in any way are endeavored to acquire an education. You may expel us gentlemen, but I firmly believe that you will someday resent it. The black man cannot protect the country if the country does not protect him, and if tomorrow a war should arise I would not raise a musket to defend a country where my man who it is denied. The fashionable way in Georgia, when hard work is to be done, is for the white man at that time to sit at ease while the black man does the work. But I will say this much to the colored men of Georgia as I should be killed in this campaign. I may have no opportunity of telling them at any other time. Never lift a finger nor raise a hand in defense of Georgia until Georgia acknowledges that you are men, and invest you with the rights pertaining to manhood. Pay your taxes, however obey all orders from your employers. Take good counsel from friends. Work faithfully, earn an honest living, and by your conduct you can be good citizens. You may expel us gentlemen by your votes, but today while you do it, remember that there is a just God in heaven whose all-seeing eye beholds alike the acts of the oppressor and the oppressed and who despite the machinations of the wicked never fails to vindicate the course of justice and the sanctity of his own handy work. I have concluded with Henry McNeil Turner's speech, let's honor him by showing him that the Georgia that exists today is not the one of the past because we can honor the blessings of our past by recognizing much greater truths today. Thank you. Thank you, Representative. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. Shall this bill now pass, all in favor of the passage of the bill, will vote yes, all those opposed, will vote no, and Mr. Clerk will you unlock the machine? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 303, the yeas are 167, the nays are zero. This bill, Henry C. The requisite constitutional majority is therefore passed. Congratulations. Thank you, members. Members' House Resolution 32 will be postponed to the next legislative day. What purpose is representative Carpenter, Roz? Make a motion. State's motion, sir. Have a bill read for the first time and committed to consent to committee? Suspend the rule, sorry, apologize. You got it. Mr. Clerk, will you read the caption? A numbered House Bill by Representative Carpenter, the fourth and others be titled, Act two men, Article five, Chapter three, Title eight, the fiscal to Georgia, and Tate of Related Housing Trust Funds for the homeless. The general was motion that the rules of this House be temporarily suspended, so a bill can be read for the first time and assigned to committee is, if, Jason, State Plain and Community Affairs. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of our art word, Howard Jr. Recognizing and commending the Georgia Forestry Commission for serving the State of Georgia's and Emergency Response Agency, Commending Health for Healthcare Professionals and Recognizing February 24th, 2025 is HHCP Day at the State Capitol. Congratulations, Terry Holder, upon his induction to the Georgia Sports Hall of Fame, Recognizing Commending Devote Jennings, Recognizing and Commending Kito Jamil, Commending Shay Sheikwa Nation, and Recognizing February 24th, 2025 is Shay Sheikwa Nation Day, Recognizing Commending Matt Prints and Commending the Carroll County Chamber of Commerce on 70th anniversary, Honoring the Food Bank of Northeast Georgia for its mission of connecting neighbors with nursing food and congratulating, commending, caterpillar, and countenance, 100th anniversary. And for other purposes, that completes the reading of the privilege resolution. Thank you members. Thank you, Mr. Clerk, is there any objection to adopting the privileged resolutions here in none? The resolution is adopted. We'll move on to afternoon orders. The new orders, Representative Wade, is recognized for an afternoon order, Representative Neal, your own deck. Why don't we represent your weight? Let's me change a second. Let's recognize Representative Wade for her afternoon order first. I'm sorry, Representative Neal. I was looking to her and saying your name, Representative Jack, he asked me Neal. Members, let's get the lady your attention, please. And so, Fred, go and join her. The Clayton County Delegation can join me. Clayton County Delegation. Give them just a moment. Clayton County Delegation. Thank you to the speaker colleagues, I rise today in support of a shooting that happened pardon me, in support of the Clayton County Police Department and an officer who was involved in a shooting on Tuesday of this week. Officer Kenyan Ford was involved in a shootout after a swat standoff in our county. He is dead survived. He is currently still in the hospital. The police department and the family, they do have a fundraiser going on for the officer, but we just wanted to come up here and make sure we gave the police department and our other first responders the acknowledgement that we support them and we look forward to continuing to support them in this body. So if I have a moment of silence for the recovery of the officer and his family. And thank you, Mr. Speaker, I yield the well. Thank you members, I'm sure that this house will continue uplifting that officer and his family in our prayers. Thank you members. Okay, Representative Wade and friends, gentlemen's recognized for a really cool afternoon order. Thank you, Mr. Speaker. And to my colleagues, I just think it's exciting when we get to come into this next month, March Madness. And I have to say I'm very proud of the University of North Georgia women's Nighthawk basketball team who clenched their first place position in the Peach belt conference, their regular season champions. They will be hosting round one and likely round two of the national tournament. And I'm just very proud of this team. I'd like to, Mr. Speaker, recognize five seniors that have given their dedication to this University and this program. Carly Fahey, Emily Trushel, Dasha Cannon, Hansley Hall and Livy Blackstock. And last but not least, to the impeccable and the amazing coach, Buffy Burson. She has just done phenomenal for that program. So way to go, Nighthawks. Thank you. Good luck, ladies. We'll have a few more. Bring it home. We'd love to have them down. Representative Ramon is recognized for an afternoon order. Ladies recognized. Thank you, Mr. Speaker. And colleagues, Ramadan, Mubarak. I know it feels like it's starting earlier. That's because it is Ramadan is starting this weekend. So for those who are going to be observing, including myself, that means abstaining from food and yes, water. I will say that was definitely a record-breaking question asking timing. So thank you to the gentleman that did earlier. But during this time, your constituents who are observing will be obviously fasting from food and water, but also engaging in more time doing prayers and being with family and friends. I would also like to invite any of you that are interested in fasting with me. You're welcome too. I would love to have you. So thank you, Mr. Speaker. I yield the well. Representative Bail, you're recognized for an afternoon order. Representative Bail. Thank you, Mr. Speaker. Today, I rise to honor a prominent dentist of Black History Month. Dr. Roy Charles Bail, a prominent dentist and civil rights activist, helped open the doors so African Americans could have proper access and health care at a great hospital. In 1962, he sued Grady in a federal case that led to the Atlanta hospital and others nationwide to provide equal care. Bail versus Fulton de Cap Hospital Authority, he segregated hospitals in the state of Georgia and across the country. Dr. Bail moved to Atlanta after finishing dental school at Howard University. He was welcomed by Dr. Martin Luther King Jr., who opened the, Dr. Martin King, who was the cousin of the dentist's wife, Clarice Mary Jetta White and other civil rights leaders. He joined the efforts to end Jim Crow. Dr. Bail was one of the first African American dentist to practice in Atlanta and did so from 1959 to 1979. He served as the, he also served on the commission of human rights and fair housing and Sacramento from 1981 to 1983 and the dental consultant from in Rockville, Maryland from 1983 to 2003 after returning to this city. During the civil rights movement, Dr. Bail served as the special projects coordinator for the Southern Christian Leadership Conference. He protested as a command among other issues, the Pay and Road Barricade, that was erected to keep African Americans from moving to the white neighborhoods in Southwest Atlanta. He worked in discrimination and practices of his profession too. He fouled a lawsuit in 1964. They led to the end of this segregation of the Georgia Dental Association and subsequently the American Dental Association. He wasn't the first blackness to join the organization but in 1968 he was accepted into the vote. He and other civil rights leaders were invited to the White House to serve as the citation for President Lyndon B. Johnson for the efforts in 1996 that Georgia State Senate passed for resolution to commend him on the desegregation work. He earned a law degree from Woodford Wilson College in 1990, excuse me, in the mid 1970s. He will forever be remembered as a father and a visionary and civil rights activist who dare to join, who dare to stand against the Jim Crow. Dr. Bail was mentioned in the 16th chapter of Dr. King's autobiography. His devoted to the Albany movement, the terrible jail conditions and the visitors that called on the civil rights leader. Soon, the Reverend in Walker came over to Dr. Roy Charles Bill from Atlanta in Lourdes Steele and a writer from the Jet Magazine. He instructed, he inspected,\n\nRalph's teeth and said he would be arranged for the chief preacher to get us some food packages. I told him that we needed this because we were starved on the jailhouse food. Additionally, Dr. Bell to survive by his relatives who are here today to join us. Ava Bell Sanders is in our audience. Please stand. Thanks, you got it. You're at the will. Representative Parsons is recognized for an afternoon order. Representative Chairman Parsons. Thank you. Thank you, Speaker. I'm rising up here to speak and take a black history moment. Today is the last day. It actually ends tomorrow. I'm going to march the first. But I rise in honor of a gentleman named Grant Gray. I knew him as Coach Gray. He was born in Pennsylvania. He became a basketball star up there. And then later after high school, and college, he moved down to West Virginia and played there at West Virginia State College where I would eventually go to school college at. It was segregated until about 1962, something like that. And I started there in 1965. But Coach Gray, like a lot of coaches, told great stories. And one story in particular, I remember a lot of them, the one in particular, I think of. And this is the story. I think there's a lesson in it, probably more than one lesson. He said when he was a kid growing up in the depression, hard times, family getting by shoes, there was some government agency that started providing some shoes for children. They had molded rubber souls. So his parents got him a pair of those shoes. They just had a kid in school. So he walks to school the first day, has him snow on the ground. He didn't know, or it didn't really care as a kid, but on the bottom of that shoe, it was imprinted in the rubber. It was in there the symbol of the federal agency that provided the shoes and the name of the agency. So some of the other kids, they saw that imprint in the snow as he was walking by. And he said, look at Gray, his parents can't even buy him shoes. They must be broke. Well, that hurt a little guy's feelings, of course, but he had warm, dry feet. But the thing the story is, he said, by the end of the winter, every kid had those same shoes. And every one of them were making the same imprint in the snow. So I honor Coach Gray. He was a great coach. He had coach basketball for a long time. He had a stroke. And he was confined to wheelchair and the college then moved him over to coaching football. He had a great record in basketball. And he had a very good record in football. And I just rise to honor Coach Gray. And Gray, thank you. Thank you, Mr. Chairman. Who represented Treyah now wants you to give this gentleman your attention. He's going to make himself look good right here. Thank you, Mr. Speaker. I just wanted to take this moment. Members of the assembly to wish my mom a happy birthday today. She's a two-year strong fighting lung cancer. But I also want to take this moment because her and I have been reminiscing about the last 50 years since she arrived in America. And the Vietnam War will not celebrate commemorate its 58th anniversary on April 30th. So thank you to the members in this assembly who fought in that war. Thank you, Mr. Speaker. Happy birthday to you, Mom. And best of luck with her health challenges as well. That concludes our afternoon orders. We have a couple pieces of business. And we'll get to them now for what purpose is representing Dickey rise. Motion. State your motion, sir. I'd like a motion that HV529 be recommended back to the House of Consumer Affairs Committee, Mr. Breaker. Mr. Clerk, will you read the caption? House of 529 by reps and a bearer to the 24th. And others to be entitled, not to men, title 13 of the fiscal to George Antidde relating to contracts. All the gentleman's motion, the House Bill 529, be recommitted to the agriculture and Consumer Affairs Committee is the objection. Here he none of this awarded. For what purpose does Rep. Crow rise? These back there. To make a motion, Mr. Speaker. State your motion. I move that the rules be suspended so Bill can be raised for the first time in a science committee. Mr. Clerk, will you read the caption? On numbered House Bill, our representative Crow, the 118th and others to be titled, not to men, chapter 3, a title 38 of the fiscal to George Antidde relating to emergency management. All the gentleman's motion that the rules of this House be temporarily suspended so Bill can be read for the first time in a science committee is the objection. Public safety and homeland security. Representative Sharper, we're going to recognize him. I'm going back to afternoon orders. He had worked with me and moved his afternoon order from earlier this week to today. And my pardon, my pardon please, that I missed you. So Representative Sharper is recognized for an afternoon order. Thank you, Speaker. I know you want to leave me, but I refuse to let you go. All right, that's all I'm doing. But my moment in Black History is the temptations are an American vocal group from Detroit, Michigan, who released a series of successful singles and albums with Motown Records during the 1960s and the 1970s, featuring five male vocalist and dancers. Otis Williams, who we actually had here last year doing session, Elbridge Al Bryant, and Melvin Franklin, and Eddie Kendrick's and Paul Williams of the Primes. In 1964, Bryant was replaced by David Ruffin, who was the lead vocalist on a number of groups, biggest hits including my girl, talking about my girl, my girl, ain't too proud to beg 1966. And I wish you a rain, 1967, over the course of their career, the temptations released four Billboard Hot 100, number one singles, and 14 R&B number one singles, three classic temptation songs, my girl, just my imagination, and also Papa was a rollin' stone. Thank you, Speaker. Thank you. No, thank you. Thank you for that good moment, and thank you for that excellent voice you have. Thanks for sharing that with us. That completes our afternoon orders. Completed all the business we have for the day, other than a couple of announcements. Chairman Noel Williams, recognize foreign announcement. Thank you, and banking will be Monday morning at 8 a.m. and room 406 CLEOB. We need you there, 406 CLEOB 8 a.m. Monday morning. Thank you. Representative Inga Willis has recognized foreign announcement. Give the lady your attention, please. Good morning colleagues, much to your delight, the Atlanta delegation will be meeting today at 2 o'clock in CAP123. CAP123, let me know if you will be attending, or if you can't, we'll be getting an update from our mayor. Thank you. Thank you, Mr. Speaker. Representative Vance Smith, thank you, Representative Willis. Vance Smith has recognized foreign announcement. Thank you, Mr. Speaker. The subcommittee, resource management on natural resources have a meeting Monday afternoon at 1 p.m. We've got three bills, two of representatives, tailors and one of representatives, Corbett. We hope y'all'll be there. I'm on save room 606 and then I'll correct that. There's four, four, 15, 415 CLEOB at 1 o'clock. Thank you very much. Thank you, Representative Smith. Representative Stevens, chairman Stevens, recognize foreign announcement. Thank you, Mr. Speaker. On Monday, a.m. room 415 at CLEOB will have a bill. Thank you. Any more? That concludes? You have announcement? Good. You won't recognize you anyway. I'm just kidding. I think that concludes our bit, members. Thank you for your attention today. I hope you have an enjoyable weekend. We had a good week. We debated some issues. We appreciate everyone's attention and their involvement. That's what this house is about. So I hope you'll go home and have a good weekend. Enjoy your families, take care of yourselves and we'll be back here Monday morning to attend to the people's business. Okay, Mr. Majority, let them recognize you from motion. Thank you, Mr. Speaker. I move that this house stand adjourned until 10 a.m. on Monday, March 3rd, 2025. On the motion of the majority leader of this house, that this house stand adjourned until 10 a.m. on Monday, a new month, March the 3rd, 2025, Monday, March 3rd, 2025, all those in favor will say, and the pose will say no. You know you have to work on that a little bit. Their eyes clearly have it. This house stands adjourned. Thank you all. Don't forget your pages, all members will have a page.",
  "updated_at": "2026-02-14T00:06:20.534695+00:00"
}