{
  "video_id": "cFZ_WjzJAPI",
  "url": "https://youtu.be/cFZ_WjzJAPI?t=1193",
  "title": "Georgia House - Day 5 (2026-01-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": "2026-01-17",
  "duration_minutes": 77,
  "summary": "Here is a summary of the Georgia House session from 2026-01-17:\n\n**Overview**\nThis session appears to have been a routine day with minimal legislative activity. The majority of the time was spent on procedural matters such as the morning roll call, prayer, and pledge of allegiance. No specific bills or notable actions were detected in the transcript.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)** \nNone detected.\n\n**Notable Moments**\n- Representative Matt Rees introduced Pastor Chuck Allen of Sugar Hill Church, who gave the opening prayer and remarks. Pastor Allen encouraged the legislators to keep working hard despite the challenges of public service.\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nThe session began with a roll call to verify quorum.\n\n**Adjournment**\nThe transcript does not include the time of adjournment or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nAll members, please come to the floor and take your seats.\nAll members come to the floor and take your seats.\n.\n.\n.\n.\nThe I work in meeting, having arrived, all members will please take your seats.\nMs. Clerk, will you ring the bell?\nYou\nWe're going to have the morning row call, all members present will please vote green\nto signify your presence in the chamber and the clerk will unlock the machines Mr.\nBoard?\nhave all members voted, all members voted.\nIf so, the clerk will lock the machines.\nDoorkeepers, will you please close the doors and keep them closed?\nAs is our custom, we will begin our day with scripture reading and prayer by the chaplain,\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 99th House District,\nRepresentative Matt Rees, Representative Rees.\nThank you, Speaker Byrne and good morning, House colleagues.\nI'm proud to introduce you, Pastor Chuck Allen of Sugar Hill Church in Gwinnett County\nwho's joined this morning by his wonderful wife Jenny who's there on the front row.\nPastor Chuck serves as a Gwinnett County police chaplain as well as on the Gwinnett County\nschool superintendents business leaders council.\nHe is the head pastor of Sugar Hill Church which has about 6,000 members and is very active\nin a lot of areas of life in Gwinnett County.\na pastor is his second career. He was a builder and developer before going into the ministry.\nAnd his church is engaged in a lot of things such as leading the meals on wheels, program\nand our part of Gwinnett County, and also a mental health ministry called Clear Path Counseling\nNetwork. And he also has a podcast, a regular podcast called The Positive Talk Podcast\nand Lord knows we need more positive talk in this day and age. Sugar Hill Church actively\nsupports good work in the Lanier High School area in Gwinnett County and the last time\nI visited his church, one of the people leading worship, they recognized him for celebrating\nCinco no Drinco, five years being clean and sober and so he is fighting addiction successfully\nand openly through the good news in Gwinnett County.\nSo since we have a three day weekend, we're celebrating Martin Luther King Day on Monday\nand a presidential inauguration and unfortunately a national championship that we might not be\nall as excited about. He's going to give us some inspiring words to get us through a three-day weekend.\nPastor Chuck Allen.\nThanks so much for the privilege to be with you today. Thank you, Mr. Speaker,\nLegislatures, my friend and representative Matt Reeves. Kind of like Elizabeth Taylor,\nI told one of her husbands, don't worry, I won't keep you long.\nI do bring you greetings from Gwinnett County in Sugarhill, Georgia, and it's good to be\nback in this house.\nIt's been several years since I've done this, but it's a great joy and honor.\nMy daddy was a state representative, a state senator, and another state.\nAnd so it's a privilege for me to be back in a place I'm comfortable with.\nMy encouragement to you this morning comes from Galatians chapter 6, verse 9.\nsays, let us not grow weary in doing good for induced season will reap if we don't give up.\nI imagine the joys of elected office can rapidly disintegrate into the lonely leadership\nfrustratingly challenging divisiveness and strain. My guess is I told Mr. Speaker earlier,\nyou guys are about like me, we're seen in the same esteem in the public. Preachers,\ninsurance salesmen use car salesmen and well politicians and yet this\ncountry and this great state needs you more than ever we need women and men of\ncharacter and decency and strength and the ability to say this is right this is\nwrong and let's go do what's right the possible Paul could have been speaking\nin these hollered halls in this very capital when he said to the Philippians in\nChapter 3, let's forget what is behind us and reach forward to what's ahead, because\nI am one of those folks who have lived in the great state of Georgia since 1972, and I'm\nabsolutely certain our best days are ahead of us in the right here right now, and much\nof that is because of you.\nThank you for all that you do.\nI'll leave you with this last word before we pray and pledge, I'd give you this word,\nwhich is the Chuck Yeager speech, which I give a bunch of young preachers all the time\nwhen I speak to them in 1947, they sent these group a young hotshot\npreacher or pilots down to the desert southwest of America.\nThey were about to try and break the soundbearer flying parallel to the ground.\nThey put them in these stubby wing little rocket ships and every time they\nwould approach what we now know as Mach 1, the turbulence in that ship would be\nso severe, they only had one of three opportunities.\nThey could pull back on the throttle and land safely and everything was good\nexcept for one thing that didn't accomplish the mission\nfor which they were tasked.\nThey had another option they could leave it like it was\nand everything would be just fine except those were the pilots\nthat crashed and burned because the assumption was\nit would just work out.\nYou know, I think we've learned it does not just work out.\nAnd on this fateful day in 1947, Chuck Yeager pushed\nthe throttle forward.\nAnd the ground crew hooded for the first time\nthat sonic boom from a plane.\nAnd after that crash and that boom,\nthere were seconds because of breaking the sound barrier,\nthey heard nothing on the radio,\nand they hung their heads and fought themselves.\nWe've lost another pilot, we've lost another ship.\nA few seconds later, they heard these words over the radio,\nyou won't believe how smooth it is on the other side.\nAnd my encouragement to you legislators\nis to know this, this great state\nand this great nation needs you more than ever, keep going.\nThe work that you do matters.\nAnd like the Apostle Paul said,\nforget what is behind you and press on\ntoward those things that matter most.\nYou are men and women that this state\nand people like me count on.\nAnd on behalf of the great people of Gwyneth County\nand Sugar Hill, Georgia, thank you for all that you do.\nMr. Speaker, thank you for this privilege.\nWould you join me as we pray?\nGod of all creation, thank you.\nIn your creation and for these men and women\nand these leaders.\nGive this speaker and give these legislators wisdom\nfrom on high.\nGive them the ability to make choices that are well\nestablishing grounded in principles that matter.\nGive them caretz or indecency and kindness and graciousness.\nGive them boldness to stand for those things which\nmatter most and protect the great state of Georgia\nin this great land.\nWe thank you and praise you for this day.\nI pray we'd act and lead in a way in which you are pleased.\nAnd you can look at your creation and say,\nthose are my men, those are my women, and I am so proud.\nThank you for this day.\nAnd Jesus, name we pray.\nAmen.\nWould you join me as we salute to the flag of the United States\nof America and to the Republic for which it stands,\none nation, indivisible with liberty and justice for all.\nGod bless you, going peace.\nDoorkeepers, you may unlock the doors, members join the pastor in the South\nat any room for a photo and thank them for being here.\nOur Doctor of the Day today is brought to us by the gentleman from the 127th House District.\nChairman Dr. Martin Newton, he's also agreed to be our Doctor of the Day today.\nThank you Dr. Newton for doing that.\nDouble duty today.\nChair recognizes Chairman Hilton, Chair of the Committee on Information and\nAudits, Chairman Hilton, give the gentleman your attention please.\nGood morning Mr. Speaker.\nYour committee on information audits has read the journal the previous legislative day\nAnd we have found it to be incredibly accurate.\nChairman Hilton, the chair of the Committee on Information and\nAudits reports that the journal of the previous legislative day has been read and\nfound to be correct in a very meaningful way he read it.\nIs there an objection to Smith's with the reading of the journal?\nChair, here's none.\nThe reading of the journal is dispensed with.\nIs there an objection to the confirmation of the journal?\nChair, here's none, and the journal is confirmed.\nMr. Clerk, will you read the resolution\nestablishing the order of business for the day?\nI've missed.\nThat's station to the 104th news following\nto be established as the order of business\nand the first part of the period unanimous concerns\nin production of bills and resolutions,\nfirst reading and reference of house bills\nand resolutions, morning orders.\nThank you, Mr. Clark.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nChair, here's none. The resolution is adopted.\nFirst, reading the bills and resolutions, the clerk will read.\nHouse Bill 67, my representative Burns 159, Jones to the 47th of the\nfrustration of the 104th and hatchet of the 155th, will be taught an act to amend\nthe act making and providing appropriations for the state fiscal year\nbeginning July 1st, 2024.\nAppropriations.\nHouse Bill 68, my representative Burns 159th, Jones to the 47th of the\n4th and hatchet 150 fifth there will be Todd in act to make and provide appropriations for state fiscal year beginning July 1st\n25 and ending June 30th\n2026\nappropriations\nHouse bill 69 by reps and it burns 159th Jones to the 47th\nadministration 104th and hatch it to the 150th will be taught on act to men the\nact making and providing appropriations for the state fiscal year beginning\nJuly 1st, 2024. Appropriations House bill 70 by reps and it burns 159\nJones to the 47th administration 104th and hatch it to the 150th will be taught\non act to men the act making and providing appropriations for the state\nfifth school year beginning July 1st, 2024 appropriations House will 71\nby reps and it burns 159 Jones to the 47th administration of the 104th and\nhatched to 155th will be taught an act to make and provide appropriations for\nstate fiscal year beginning July 1st 2025 appropriations House will 72 by\nreps and it burns 159 Jones to the 47th administration 104th and hatched to\nthe 155th, Bill Bitton-Nack to make and provide appropriations for state fiscal year beginning July 1st, 2025.\nAppropriations.\nHouse Bill 73 by Representative Green in the 154th of Bill Bitton-Nack to amend and that creating board of education of Seminole County.\nAndrick governmental coordination.\nHouse Bill 74 by Representative Pala 33rd, Washburn in the 144th, Jasper's to the 11th.\nwith Wilkerson in 38th Oliver the 84th and others.\nBill B. Toddlenak to amend chapter 27 and Toddle 50\nthat fish go to Georgia annotated the Georgia Lottery\nfor Education Act.\nRegulated industry.\nHospital 75 I represent Ridley the 22nd Ridley the 6th\nHorn and the 3rd Tarvern and the 2nd Chastain\nthe 7th and others.\nBill B. Toddlenak to amend article on chapter 11\nand Toddle 4 of the fish go to Georgia annotated\nrelating the general provisions relative\nto animal protection.\nAgriculture and consumer affairs.\nHouse will 76 by represent Evans, the 57th Smith, the 138th, and Barry, the 56th.\nBill B. Todd, an act of men code section 32, 2, 3, the fish go to Georgia, annotated,\nrelating to development and transportation plans.\nTransportation.\nHouse will 77 by reps and a Franklin 160th year to 150 second.\nCameron, the first Richardson, the 125th, and Corbord, the 174th.\nBill B. Todd, an act of men article four, chapter six, a title 40, the\nfish go to Georgia, annotated, relaying the right away for operators of motor\nvehicles. Motor vehicles. House will 78 by reps at a Franklin, the 160th\nCarson, the 46th Richardson, the 125th year to 150 second in Cameron in the\nfirst. Bill B. Todd, an act of men article seven, chapter 20, a title 47.\nHe'll be a fish go to Georgia, annotated the public retirement systems\ninvestment law. Retirement. House will 79 by the rest of Newton, 127th Cooper, the 45th\nReeves, the 99th, Hilton, the 48th, Silcox, the 53rd, and others, Bill B. Todd, and\nthat comment. Chapter seven, the total 4080, the fish are going to Georgia, and it's\neither relating to income taxes. Ways and means, Mr. Clerks, suspend just for a minute.\nThank you members. Mr. Clerk. House Bill 80 by Representative Westbrook on the\n163rd all over the 84th Crawford and the 89th Paris and the 140 seconds\nStevens the 164th. It'll be titled an act to amend Article 3 Chapter 5 of Title\n17 of the official go to Georgia annotated relating the disposition to\nproperty seized. Public safety and humbleness security House Bill 81 by\nRepresentative Ballard of the 147th Irwin of the 32nd Towns of the 179th\nfirst singer of the 119th Dubnick of the 27th and others will be taught an\nact to amend chapter 6 entitled 20 of the official go to Georgia annotated\nrelating to education compacts education house bill 82 by rose and it\nreads the 99th Martinez of the 111th Oliver the 84th Paul the 33rd work\nizer of the 157th and others will be taught an act to amend title 34 of the\nif it should go to Georgia Anitator relating the labor\nand industrial relations.\nThe local bill.\nWell, that was me.\ns\nindustry and labor\nSo to Iowa, the 50th Stevens, the 164th Hawkins, the 27th green\nand the 154th and Buckner, the 137th will be taught\nan act to amend chapter 11, a title 48.\nThe fish go to Georgia and tentative relating to taxes\non tobacco and vaping products.\nWays and means.\nHospital 84 by Rosen of Iowa, the 50th Stevens,\nthe 64th Hawkins, the 27th green and the 154th Buckner,\nof the 137th, it'll be Todd\nand act to men chapter 11 and\nToddle 48, the official go to\nGeorgia and Tato relaying the\ntaxes on tobacco and vaping\nproducts.\nWays and means House for Lady\nfive, I represent the lever to\nthe 123rd frustration 104th\nper shed of the 176th, hung on\nthe hundred and third gunner of the eighth and others,\nwill be Todd on active men are going to chapter six,\na title 15 in the fish go to Georgia annotated,\nrelaying the general provisions,\nconcerning superior courts.\nDid you disagree?\nHouse bill 86 by representative lever to the hundred\nand twenty-third of station,\nthe hundred and fourth per chat of the hundred and seventy-sixth,\nhung on the hundred and third,\ngone through the eighth and others,\nwill be Todd on active men,\ncode section 45, seven, four,\nin the fish go to Georgia annotated,\nbuilding the annual salaries of certain state officials.\nDid you do, Sherry?\nHouse Bill 87 by reps of Clark of the 100th.\nWeed hour, the hundred and twenty-first.\nMatthew, the act of the 82nd Williams, the hundred and forty-eighths.\nScofield, the 63rd, and others.\nBill B. Todd, an act of men, Todd, a 33.\nThe fish go to Georgia, annotated, related, and the insurance.\nHilt.\nHouse Bill 88 by reps of Barnes.\nfor 86, runner of the 85th, clocked with a hundred and eighth,\nprior to the 120 second for now, the 77th and others,\nthey'll be titled an act to men.\nPart six, a VAR to 70, chapter three,\na total 20 of the physical to Georgia,\nand it's a really in the state veterinary education.\nHigher education.\nHospital 89, virus of Cooper,\nthe 45th, way to the ninth, gamble the 15th,\nand hung of the 100th, third,\nthey'll be titled an act to amend chapter two,\na total 31 of the physical to Georgia,\nand a data relating to the Department of Public Health.\nPublic and Community Health.\nHouse Bill 90 by Representative Astration\nof the 104th Dickey, the 134th,\nHagen and the 156th and Buckner, the 137th,\nBill B. Todd and Acto Menon, Code Section 485,\n7.4, the Fisher go to Georgia and a data relating\nto preferential assessment for bona fide\nagainst conservation use property.\nWhere is in means?\npossible 91 by reps of Cooper, the 45th Carpenter, the 4th Chasverse, the 11th, Dickey, the\n134th, Camp of the 135th, the Bilby Todd, an act of men article 3, chapter 50 to Toddle 43,\nthe fish go to George Annett said relating to licensing.\nAgriculture and consumer affairs, 92 by reps and a black one, the 146 Kelly, the 16th\nWilliams, 148th, Irwin, 32nd, Washburn, 144th, and others.\nBill B. Todd will act to amend Code Section 485.\n44.2 of the fish go to Georgia,\nannotated, relating that base year, homestead exceptions.\nWays and means.\nHospital 93 by reps out of Smith, 18th,\nBill B. Todd will act to amend Code Section 156.\nTwo of the fish go to Georgia,\nannotated, relating the numbers, judges, a superior courts.\nJudiciary House Resolution 31 by resident of lever to the 123rd Paul 33rd\nResolution honoring the life of mr. R George Strickland Jr. And dedicating a bridge in his memory\nTransportation House resolution 32 by reps of illustration 104 ticket the 134th Hagen 156 and Buckner the 137th\na resolution proposing an amendment to the Constitution so as to increase the maximum acreage to qualify for assessment and taxation.\nWays and means.\nThat completes first readers.\nSecond reading of bills and resolutions, the clerk will read.\nHouse Bill 59 by Representative Glaze of the 67th Evans of the 57th Gailier to the 162nd pairs of the 142nd Dawson of the 65th.\nA bill relating to program weights to reflect funds for payment of salaries and benefits maximum class size reporting requirements, application or specific school years.\nHouse Bill 65 by Representative Barnes of the 86, he would leave the 141st Oliver of the 84th.\nComing to the 101st, Alexander the 66 and others,\na bill relating to elementary and secondary education.\nHouse Bill 61 by Representative Sebaugh of the 34th,\nMcDonald of the 26th, corporate of the 174th,\nMathis of the 130th,\nThird and Crow of the 180th,\nthe bill relating to annual license fees\nfor operation of vehicles.\nHouse Bill 62 by Representative Scott of the 76th,\nDavis of the 87th Gofield of the 63rd,\na bill relating to condominium associations\nand property owners associations.\nHouse Bill 63 by Representative Oliver of the 84th,\nNow, the 50th part of the 107th train of the 80th Westbrook of the 160-13 others,\na bill relating to carrying and possession of firearms.\nHouse Bill 64, by represent Oliver of the 84th.\nNow, the 50th, draper of the 90th, Roberts of the 52nd.\nLaptard of the 80-13 others, a bill relating to crimes and offenses and insurance.\nHouse Bill 65, by represent more of the 91st, Carpenter of the 4th.\nDunno who the 31st, Drenner of the 85th, Crow of the 118th and others,\na bill relating to other state symbols.\nThis bill 66 by Rep. Stevens of the 164th and Fleming of the 114th, a bill relating to title and advalorn tax on motor vehicles.\nHouse Resolution 29 by Rep. Kamp of the 135th hatchet of the 155th per shed of the 176th Gunter of the 8th limb of the 98th and others.\nResolution proposing a mem to the Constitutions as to provide for the appropriation of funds received from certain legal judgments or settlements.\nResolution 30 by Representative Clark of the 100th Gains of the 120th Stevens of the 164th\nReaves of the 99th Hilton of the 48th and others a resolution expressing support for the permanent extension of the tax cuts and jobs act of 2017 through second readers\nMembers will please take your seats.\nRepresentative Sanchez, you recognize for a morning order, give the gentleman your\nattention please, and friends represent Sanchez. Thank you Mr. Speaker. We are here\ntoday to honor a life of an important environmental activist who dedicated their life to protecting\nnature.\nManuel Esteban Baez Deban was someone who dedicated their life to helping our communities thrive\nand make sure we have a sustainable future.\nObjectly, tomorrow, January 18th, 2025, will be the second anniversary of Manuel's killing.\nKilled when peacefully protesting for the environment and against tearing down our forests right\nhere in Atlanta.\nThey were shot 57 times.\nManuel is 26 years old.\nThe killing of Manuel, an environmental activist, was a horrific and unprecedented injustice.\nBut with Manuel's tragic death, they left behind their family, including their mother,\nReverend Belguista-Don, and their brother, Pedro de Don, who are up in the gallery with us\nthis morning, along with fellow friends and colleagues.\nIf you would please stand, I want to recognize you all, and especially want to recognize\nManuel's mother, Reverend Belguista-Don.\nDespite such a tragic loss, she has dedicated her life to continuing Manuel's legacy of\nprotecting the forest, planting trees, and doing what we can to help preserve our greatest\ngift on this earth, Mother Nature.\nShe has even started a nature-based healing center to heal those in the community and\nhonor of Manuel.\nSo please join me in welcoming Reverend Belkis Dharan,\nthe Dharan family and friends to honor a life\nand legacy of Manuel Dharan and let us remember Manuel\nto continue their fight for justice, peace,\nand the preservation of our environment.\nPlease join me in a moment of silence.\nThank you so much.\nThank you.\nThank you, Representative.\nRepresentative Park Cannon is recognized for a morning order, and she has a number of\nfriends joining her for a special morning order to honor a former senator and\na member of this general assembly. So I'll ask as a to honor this former\nsenators that support, I'll ask y'all I'll just stand as represented canon.\nRecognizes his memory. Representative canon. Thank you, Mr. Speaker. Good\nmorning members, I stand today to end this first legislative week of just honoring the\nlife of Senator Vincent Fort who served for over 15 years to be an elected official who\ncare deeply about working families and who would bend over backwards to make sure that\nfolks had access to fair housing.\nHe was actually successful in passing our strongest state predatory lending law, which\nallowed for us to move up out of the category\nof the most predatory zip code in the country.\nAnd his family is here with us today.\nI'd like to ask for his son, Zand, to stand.\nAnd for us to, at this time, really let\nyou know the importance of your father\nwill continue to live on through the legacy\nthat we push here at the state capital.\nI'd like to also recognize his chief of staff\nfor many years, Javier Brown, as well as the individuals\nwho helped him to pass these laws, Ms. Vanessa Manley,\nDr. Angela Brown.\nI just want to thank y'all for coming out today\nand putting on a beautiful ceremony for him\non January 3rd, as well as January 4th.\nHe is now resting at the Southeast Cemetery,\nso please do go and visit him.\nAnd we do also have his program here with us today,\nand would just ask if you're interested\nin signing the program, it will go to the family.\nThank you, Mr. Speaker.\nThank you, Representative Kennan.\nThank you, family, for being here.\nSenator Ford did a lot of good work here.\nWe appreciate it.\nThank you very much.\nMr. Clerk, will you read the caption\nto a group of privileged resolutions.\nHonoring the life and memory of Bryce Allen Johnson.\nHonoring the life and memory of Barry A. Brown.\nRecognizing the 51st anniversary of the Consulate General\nin Atlanta, recognizing congratulating Sheriff Ron Freeman,\ncommending Travis Strickland in the 2024 West Georgia\nsoil and water conservationist of the year,\ncongratulating Great Dane upon the 125th anniversary\nof its founding.\nThat completes the reading with privilege resolutions.\nIs there any objection to adopting the privileged resolutions that chair here's done and the\nresolutions are adopted?\nWe're going to have some afternoon orders.\nSo if you've signed up for an afternoon order, you need to get ready to bring us your afternoon\nin order.\nI'm going to recognize Representative Brad Thomas.\nSo here's our posture, we're, we typically have, are going to allow, allow 10 minutes for\nafternoon orders.\nWe have a number of y'all signed up, but since we are nearing the end of the day and\nwe've done pretty good on our timing this morning, instead of having a minute, minute\nand a half, allowing all members, they want to make an afternoon order, two minutes, you\nwill.\nOkay.\nAfter Representative Thomas is represented Carter\nThank you mr. Speaker I've rise here to talk about the Georgia legislature AI workshop program\nThat's gonna be held Tuesday after the week after appropriations January 28th starts at noon and lunch will be provided\nAnd it will not be cooked by AIs so please be there and have a great weekend\nThank you mr. Speaker you will\nNo way I break, no way I lunch. Good to know, Representative Carter is going to talk to us about the heart association again. Good stuff.\nRepresentative Carter.\nGood morning, good morning. Since both of us won't be here next week for the most part, we're coming for a budget, but I want you to play in your wardrobe.\nSo on Friday, February the 7th, we will be having the official go red for women,\nLunching here at the Capitol from 12 to 2. So I want you if you don't have red to go on go shopping\nYeah, go shopping me and you can see a wherever it so on that Friday\nFebruary the 7th from 12 to 2 we were having our official go red for women luncheon and we hope that you will join us. Thank you\nThank you. Let's make sure we support the heart association representative Hutchinson\nAnd she's going to have a photo up.\nRepresentative Shelley Hutchison, welcome to the well.\nThank you, Mr. Speaker.\nToday I want to talk to you about the Social Empowerment\nCenter.\nIt's also in my district.\nThey are the mental health providers\nbefore, during, and after the Appalachia High School\nshooting.\nIt also happens to be the agency that I started 22 years ago.\nWhen my staff called me that morning, all schools in Barrow were under lockdown.\nI have one staff member that was in her office for six hours with her desk barricaded\nagainst the door.\nThe stories that we're getting from these kids will never go away.\nThe only thing we can do is help them cope.\nAnd right now, I want to recognize my staff who I'm incredibly proud of, who makes me\nproud every single day.\nThat's just a few of them.\nWe have about 100 employees that do in-home mental health services in Gwinnett, Barrow,\nAthens, Stevens, Banks.\nWe go in Northeast Georgia.\nNo other providers go.\nBut I wanted to recognize this staff who continues to work at Appalachia High School.\ncontinues to work with the families who lost people.\nAnd the kids' stories, oh, they had to triage their teachers.\nWe'll never go away.\nSo if we can give a hand around the plus\nto the heroes of Appalachia High School,\nmy staff at the Social Empowerment Center, I'd appreciate it.\nThank you, Mr. Speaker.\nI yield a well.\nThank you, Representative, for all of your work.\nWe appreciate you and your staff.\nRepresentative Odinya is recognized for an afternoon order.\nYou have the will, sir.\nThank you, Mr. Speaker. Good morning, colleagues.\nToday, we are celebrating Martin Luther King.\nWe have a celebration service that we take in place at 10 a.m. at the North Wing steps.\nYou are all invited to be there.\nThe governor, the speaker will also be there.\nAnd most importantly, we are going to be there because we're going to remember the memory\nof such a person that has impacted all our lives.\nsaying that I cherish a lot and I'd like to mention,\nlife's most persistent and urgent question.\nWhat are you doing for others?\nAnd that is a quote that I've lived by.\nWhat are we doing for others?\nMr. Speaker, thank you.\nSee you all there.\nThank you, sir, for the announcement.\n1030 downstairs were doing the governor to celebrate\nthe memory of Martin Luther King.\nRepresentative Charley Spurs recognized for an afternoon order in the morning\nand friends.\nYesterday what I witnessed outside those doors marks a dark and troubling moment.\nThe arrest of the senator from the 53rd following his ban from entering the House chamber\nafter making a statement that was met with disapproval,\nstrikes at the heart of our democratic principles.\nThis unprecedented action undermines the integrity\nof our legislative process and sets a dangerous\nand unconstitutional precedent when a duly elected member\nof the General Assembly is barred from fulfilling his duties.\nWhen differences of opinion lead to exclusion and arrest,\nrather than open dialogue, we erode the very foundation\nof our republic.\nThis is about more than one individual.\nIt is about protecting the principles\nof representative democracy and ensuring\nthat every voice elected to this body\nhas the opportunity to be heard.\nLet us reflect on the gravity of this moment and commit ourselves to upholding the rights\nand freedoms that define us as a station, as a state, and a nation.\nThank you, Mr. Speaker.\nThank you, Representative.\nRepturement Weed Hour is recognized for an afternoon order, representing Marcus Weed\nHours, recognized.\nGood morning, colleagues, afternoon order, I guess.\nI don't know how many of you got asked this question when you got elected for the first\ntime, but the moment I got elected, somebody asked me what I was running for next.\nSo that happened to you, right?\nWell guess what?\nI'm not going anywhere.\nI love this house, I love this chamber, all of the family that we create, certain individuals\nback in the back, and I'll have to say names, but you know who you are from the other\nparty that I've been become great friends with in this chamber, okay?\nWe elect somebody to control this room to make sure we have decorum in this room and\nhonor in this room, right?\nThere are proper ways to handle things and there are improper ways to handle things.\nSome it'll be debated probably for a long time what happened yesterday.\nRight wrong was it handled correctly, okay?\nLet me tell you something, certain people use this as theater, certain people plan things\nto be able to raise money.\nThey play on people's emotions, they play on what people want to hear at home because\nthey think that's going to get them to their next step.\nI'm not here for that.\nThe man that I elected to control his chamber is not here for that.\nDebate what happened yesterday all you want, call it what you want to call it, okay?\nBut I'm going to stand here for the truth.\nI'm going to stand here for the district of 121 that I represent so proudly.\nI'm going to stand here for you, my friends, my family.\nand I'm proud to be run to this chamber to be run\nthe way it is running.\nThanks, Conclude.\nThank you.\nRepresentative James Burchett is recognized\nfor a afternoon order in the morning.\nRepresentative Burchett.\nThank you, Mr. Speaker and thank you, colleagues.\nThank you, Chairman Weed Hour.\nI appreciate your words.\nI also want to come back up here and just say hello and welcome to the session for 2025.\nIt started off with the bang.\nI want you guys to have a good weekend, but I want to center us back to what we're here to do.\nand that's to govern the state of Georgia.\nAnd I want to reflect on something\nthat another one of our colleagues just came up\nand reflected on in Representative Hutchinson.\nIn the state of the state yesterday,\nthe governor mentioned one of his priorities\nas being education and funding our schools\nto harden our schools and assure that what happened\nin Appalachia does not happen again.\nAnd I am happy that Representative Hutchinson\nis in support and I hope everybody in this chamber will be in support and I think that we are.\nI think this is one area that we have been able to rally behind each other in that we can protect\nour children and I want to end today on a light note and say that I appreciate each and every one\nof you all here. I hope you have a great and grand and lovely three-day weekend because I think we\nWe need it already, and I hope to see you all back on Monday.\nThank you, Mr. Speaker.\nYou're coming on Monday.\nYou're going to be by yourself, but you come on.\nI'm coming on Tuesday.\nThat concludes our afternoon orders in the morning so we'll move on to announcements\nfor this time.\nRepresentative Gamble, he may have had to escort his, oh there he comes, Representative\nGamble.\nRepresentative Mac Gamble.\nYou have the wells, sir, and friends.\nThank you, Mr. Speaker.\nI'm joined by Representative Neal,\nand we are the co-chairs for the Japan Caucus.\nAnd so we want to invite everyone to Japan Day on Tuesday,\nthe 21st, from 8 a.m. to 12 p.m. here in the capital\non the South Steps.\nThey'll be set up, and they'll have many companies\nfrom Japan, our consulate from Japan,\nwho is based here in Atlanta.\nwill be here as well.\nThere's also a reception later that evening.\nYou have the information on your desk\nand we wanted to invite all members,\nRepresentative Neil, would you like to say anything?\nJust want to say thank you so much.\nWe are so happy to represent you all\non the Georgia Davanese Council\nand we look forward to seeing you next week.\nAnd then one other quick thing, Mr. Speaker,\na rad day for the addiction and recovery\nis also on Tuesday.\nSo if you have been involved\nthe working group on addiction recovery and the Jeff breed love and the Georgia Council\non recovery. They will also be here on Tuesday in the Capitol and I encourage y'all to come\nand be involved with those festivities as well. Thank you, Mr. Speaker.\nThanks to both of y'all for those announcements. Representative Nigo, you kind of just kind\nof wove your way in there on that, didn't you? But that's fine. So I encourage y'all of you\nsince there won't probably won't be a large crowd here from the this house. If you're\nhere, make sure you make a special effort to attend and\ngreet these folks and learn more.\nRepresentative Gaines, us here from you, you have an\nannouncement.\nYou're not playing football Monday, but you got to have an\nannouncement.\nUnfortunately not.\nI wish we were going to be in Mercedes-Benz on Monday, but\nChairman Hatch had asked me to make an announcement to remind\neveryone that appropriations hearings are next week.\nTuesday, Wednesday, Thursday, and if you haven't already, budget\nare ready in 412 CLOB. So just a reminder, look forward to seeing everybody next week.\nThere, you're going to be working hard there for Chairman Hatchett,\ncarrying his award. I can tell you what, he'll put you to work.\nWhile we're on that subject for our Recognized Representative Camp,\ncorrect me there, Mr. Chairman and Vice Chair. Members not on your committee can receive a\nper diem next week if they attend the meetings, is that correct?\nIn person, even if you aren't on appropriations, you will receive a per diem if you come\nand attend the meetings in person next week.\nIf there's any change from that because of the weather, you will be notified, this house\nwill be notified.\nThank you, Mr. Chairman.\nJournal of the camp is recognized for announcement.\nThank you, Mr. Speaker.\nYou probably got an email from me regarding delegation rules, and also there's information\non your desk regarding delegation rules.\nThis is an important thing because this will set the tone for your delegation for the\nnext two years.\nYou've got two weeks to do it, so please meet with your house delegation and establish\ndelegation rules.\nIf you are the only person in your county, then you have established a role, you have one.\nSo that's easy enough.\nBut if you have multiple people, please sit down with your fellow house members and have\na discussion on how you will handle local legislation.\nThank you, Mr. Speaker.\nThank you.\nYou do a great job respecting the members of this House and chair in the committee.\nSo thanks for continuing to encourage them to communicate with you.\nThank you.\nOh, that completes our business for the day.\nNow listen up, birthdays.\nWe won't be here obviously next week to celebrate birthdays.\nSo I'm going to call some birthdays out.\nI'm not going to tell your age, but I ask you to stand\nbecause we have a number of you.\nAnd then we're going to celebrate with you all at one time\nhere in just a moment.\nSo when I call your name, if you'll stand,\nThat would be appropriate.\nFirst one's already standing.\nScotty Lone, birthday's January 18th.\nMr. Clerk, obviously, obviously you didn't hear my admonition.\nYou have to follow the rules of the House, Mr. Clerk.\nOn Monday, January the 20th, 20th,\nChairman Gerald Green has a birthday.\nChairman Gerald Green.\nOn Wednesday,\nJanuary 22nd, Representative John LaHood, he's already\nall celebrating somewhere. On Thursday, wow, the old\nwhite-headed man down here, chairman Noel Williams had a\nbirthday. On Thursday as well, Representative Robert\nFlanoi has a birthday. Robert, happy birthday, buddy. On\nFriday, down in South Georgia on the coast, Representative\nAnd Alan Westbrook has a birthday, happy birthday,\nand on Saturday, January the 25th, his representative,\nCarrie Vic, and on, oh, that's you.\nYou've been promoted, I don't know about that.\nExcuse me.\nThe incomparable Carrie Vic has a birthday.\nOn Sunday, represented Carlton Howard\nover the gustor has a birthday, Carlton.\nAll right, let's all wish all of these members and staff\nthe clerk's office happy birthday, y'all,\nand many, many more.\nThank you, Mr. Majority Leader.\nMajority Leader of this House is recognized for a motion.\nThank you Mr. Speaker.\nI move that this House stand adjourned until 10 a.m. on Monday, January 27th, 2025.\nAll the motion, majority leader of the administration, that this House stands adjourned until 10 a.m.\nMonday, January 27th, all those in favor will say aye, those opposed will say no.\npretty close, pretty close, but the eyes clearly have it. We are during job, be safe, and have a good\njoin us downstairs for the MLK celebration with the governor, and then I hope you all have a good\nsafe weekend. See you back here on the 27th. Thank you.\nYou\nYou\n",
  "updated_at": "2026-02-12T16:32:21.187269+00:00"
}