{
  "video_id": "cGuYgd97wqE",
  "url": "https://www.youtube.com/watch?v=cGuYgd97wqE",
  "title": "3/16/23 - Committee on Rules",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 40,
  "summary": "Overview:\n- The Georgia legislature's Committee on Rules session on 3/16/23 was an active one, with the committee members engaged in discussing and advancing several bills.\n\nKey Actions:\n- **HB 493**: Allows nurses at veterans' hospitals to use $500 worth of work at their VA as continuing education credits, like other state-licensed nurses.\n- **HB 35**: Expands the Georgia Ports Authority's jurisdiction to one mile beyond port boundaries.\n- **HB 76**: Renames the \"Georgia Occupational Regulation Review Commission\" to the \"Georgia Occupational Regulation Review Council.\"\n- **HB 91**: Requires executors to provide notice to beneficiaries and treats investment/brokerage accounts with named beneficiaries like bank accounts.\n- **HB 120**: Allows people behind on child support to receive temporary driving permits to go back to work, and cleans up language around DUI-drug charges and license reinstatement.\n- **HB 183**: Updates the population bracket identifying Butts County to allow Georgia Power lease-holders on Jackson Lake to file homestead exemptions.\n\nBills Introduced (First Reading):\nNone noted in the transcript.\n\nNotable Moments:\n- The committee members were engaged in the proceedings, with some banter and light-hearted moments, such as comments about the chairman's outfit.\n- There was some discussion around the Lieutenant Governor's floor leader position in the House.\n\nVotes:\nNo recorded votes mentioned in the transcript.\n\nAttendance:\nThe transcript does not indicate the attendance or presence of a quorum.\n\nAdjournment:\nThe transcript does not mention when the session was adjourned or the date of the next session.",
  "transcript": "You\nYou\nDo you want to point out the scoreboard here?\nAnd I want to give the house props, y'all close the gap today, pass them, yeah, give\nthem a hand.\nYeah, they passed three bills today to R2 so they did close that gap 62 to 12\nThat's good stuff. We're proud of y'all\nProud of you guys and all the hard work you do\nAll right, let's get going. I know everybody's hungry\nWe're on this page\nLet's get their preparations chairman up there first. I'm home\nI don't know, use a little privilege here.\nThank you, Mr. Chair.\nAll of your questions.\nDo you want to grill me?\nFor the first time.\nFor the first time to get to present the bill.\nLet me think about it.\nWe've been really studying those Senate bills\nfor a long time.\nThat's why it's taking us so long.\nThey're real difficult bills.\nThis is not a difficult bill.\nYou know St. Paddy's days tomorrow, right?\nI do, but I wasn't going to be able to show you\nthis green jacket tomorrow, so I had to wear it.\nDid you win the masters?\nWell, you know, I keep waiting on my invitation,\nand I will never get one.\nI will never get one.\nMe too.\nI've got House Bill 493.\nWhat House Bill 493 will do is it will allow\nyour nurses at veterans' hospitals\nto be able to have the same privileges other nurses\nat state licensed hospitals when it comes to their continuing\neducation, they will be able to use $500 worth of work\nat their VA's as their continuing education.\nOther nurses are able to do that and VA's are not,\nthe nurses at VA's are not able to do that.\nIt's a simple little fix and it really is a simple bill.\nis a simple bill. Okay, I've heard that before. Yes, Senator Deegan.\nIt's number two. Mr. Chairman, you said VA's. Is that just VA's? It's not the state veteran\nhospitals. It's veteran federally operated veterans and ministers and it also includes\nFUHC's also. Now you've got no, you don't have another. You got any other ones on here?\nI've just got a little bill that happens to be in the Senate as HB19 and hopefully y'all\nmight be voting on that one day next week.\nCan you give us a two hour presentation on the budget, please?\nIt's a really good budget.\nOkay.\nOkay.\nOh, that sounds good.\nThank you.\nAny questions for the chairman of Appropriations?\nThank you.\nThank you.\nAppreciate it.\nCongratulations.\nAll right, back up to the top.\nColonel Hitchens, HB 35.\nOh yeah, yeah, that's right, Senator Watson,\nyou're gonna cover that for him, aren't you, right?\nHis wife is much more irons than anybody in the room,\nso he's heading to Savannah and he asked\nif I would be able to discuss the bill.\nThis has to do with the George Ports Authority,\nexpanding their ability to take care of things on port\nand one mile thereof has to do.\nHe's presented this bill several times.\nYes, yes.\nThat's about it.\nI'll be happy to answer any questions.\nWell, now I do want to report as well that his shirt today\nwas much more palatable.\nSo I don't think he'd mind me sharing that since he\npointed out to me.\nHe did look good today.\nAll right.\nAny questions for the Senate sponsor?\nAll right.\nHP 76, representative of Powell, that is me.\nWhat are we doing?\nOh yeah, this is our marriage license bill\nand removing Gork from existence.\nAny questions?\nHP 76, second on your page.\nPage one.\nGork.\nGeorgia Occupational Review, something, something, commission or councilor, it\ndoesn't matter. We're renaming it toast. All right. HB 80 is Senator Kennedy, but he\nactually asked since he wasn't here today, you wanted us to put a hold on this.\nwe're just going to put a little hold on that. Hold. All right. Representative\nWade, are you with us? Hey, you are. Come on up the podium. Tell us about. You know,\nHB91. Thank you, Chairman. This bill actually passed out of this body last year. We're bringing it\nback this year. We just ran out of time on Sinidod. This bill does two things. It requires\nExecutors and executive tricks is to provide notice to beneficiaries just like\nthey're required to receive notice if they're an air. And the second piece is\nit cleans up language so that if you have an investment account or a brokerage\naccount which you have a name to beneficiary that that would be treated just\nlike a savings account checking account within the banking world. All of the banks\nand banking groups wanted this including credit unions and so I'm happy to\nand answer any questions, appreciate your favorable consideration.\nCommittee y'all at real engaged today, are we a little tired?\nInto the week.\nCan I get a little...\nWe have been working hard this week, so...\nAny questions for the author?\nThank you, Representative Wade.\nThank you, and I believe the chairman of the committee is on the leader...\nBo Hatch to carry this on the Senate, should you put it on the floor?\nThank you.\nIs this a Governor's bill?\nGovernor's bill, but the Governor's supported me continue to finish the drill for this.\nIt's really important back home and I think it's going to benefit anybody that wants to\nleave their assets to their church, their philanthropic group, or their family.\nThanks.\nAll right.\nThank you.\nAll right.\nRepresentative Corbett, you with us.\nThere you are.\nCome on up, boss man.\nHB120's.\nFifth on our sheet.\nThank you, Mr. Chairman, when you're ready.\nHouse Bill 120 is two Department of Driver Services Bill that was combined, 120 and 167,\nso they now both are on House Bill 120.\nFirst part of the bill has to deal with child support.\nIt allows a person that may have fallen behind to receive a temporary driving permit to\ngo back into the work.\nThey currently do not have that option now.\nAnd then the state for the record, somebody that doesn't pay child support, I have them.\nThey'll have a whole lot of sympathy for it.\nBut if they can't get back into the work, they can earn living to pay that child support.\nSo this is a request from DDS.\nThe second part of the bill is some cleanup language from a bill that's passed in 2020.\nThere's a bill that removed the language that prohibited someone.\nIt was charged with a DUI drug charge from receiving early reinstatement or limited driving\npermit.\nBut the permissive language was omitted from that bill.\nSo they're doing it now, they just don't feel like they want to be codified to what they're\nactually doing.\nSo it's just some clean up language.\nSo that's what we're doing with this bill, sir.\nCodify, love that word.\nAny questions for the author?\nAll right.\nYou did such a great job.\nThere's no questions.\nThank you.\nThank you.\nRepresentative Crowe, are you with us?\nThere you are.\nCome on up.\nWhat do you want to codify?\nWell, I want to codify a lot of things, Mr. Chairman, but right now I want to update\nthe population bracket that identifies Butts County.\nThis bill we had last year, it couldn't quite get through at the end as well, but every\n10 years we have to update the population bracket on here that identifies Butts County\nto allow Georgia power, lease lot holders on Jackson Lake to file homestead exemption.\nSo there's something that's been done every 10 years since prior to the 80s, so just simply\nwhat it does.\nGood week to have a bracket bill.\nYes sir.\nSenator Calder.\nThank you, Mr. Chairman.\nWhat is the current residence of Butts County?\nIt is 25,400 in some change, so we're putting it between 25, 4 and 25, 5, so.\nGreat.\nThank you, sir.\nYes, sir.\nGreat question.\nSenator Robertson, you look like something's on your mind.\nDo we have any statewide elected officials\nwho are from Butts County?\nYes, sir.\nWe have one statewide elected official who\nis an office downstairs.\nOK, and we have one federal elected official from there,\nalso, who in the 10th congressional district.\nMr. Representative, I didn't ask you about federal officials,\nbut are you, is it not true that you're\nLieutenant Governor's floor leader in the House.\nI've not been designated now.\nI believe Jason Ridley claimed that title before I got it,\nsir.\nWhat are you looking at me for?\nSee if you want to be saying anything else.\nAny other questions?\nAh.\nSir Doza.\nBe it from Butts County, Mr. Rep.\ngiven your relationship with the Tenant Governor. I'm wondering if you have any\ncommentary on the utter domination that's being portrayed by the Senate in\nterms of workload and the Paltry workload that's being done across the hall.\nWell it does look a little bit one-sided right now but I assure you that a lot of\nworks being done on the other side of the hall and I feel real certain we're\ngoing to catch up.\nOh hold on let me recognize Vice Chairman. Go ahead Vice Chairman.\nI'm not real good at math or statistics, but I think there's 56 over there in 180 on\nthat side.\nSo for me, y'all got more than three to one on us on why the hell are y'all getting\nto work done?\nHey, watch the language.\nThere are so many of us that take so long to get us all together, I reckon, so we're\ntogether now and we've had a lot of meetings.\nAll right.\nWell, why don't you go to a committee meeting and pass a few more?\nYou did a good job, President.\nI will do that.\nYou're bracket.\nI didn't pick anybody and I didn't do a bracket this year.\nI went Guinness Hall State.\nYeah I went to Mercer and I think we did the best we're ever going to do a few years\ngoing to beat Duke in the first round so I don't know.\nNo bad.\nSo I'd also asked for House Bill 139 too when I requested this one.\nIt didn't make it on the sheets so I didn't know if that was...\n139?\nYes sir.\nWe'll go ahead and tell us about it.\nThat is a GBI bill that we also had last year.\nAnd what it does is it adds non-sworn employees.\nIt gives them the same protection as sworn employees\nof a law enforcement agency have,\nas far as not having to give out their personal address,\nphone number, as a witness on a witness list,\nin prosecution.\nSo, and I think Senator Albers\nis going to be carrying that one.\nOkay.\nThank you very much.\nThank you, Senator, or anything else?\nAll right, good job.\nRepresentative Laveritt, did you want to come up\nand talk about HB80, I know Kennedy wasn't here,\nbut if you'd like to come discuss that,\nwe can do that.\nYes, Mr. Chairman, I appreciate that very much.\nThank you, members of the committee.\nHB80 is a bill that was supported by the state bar.\nIt's approved by the Board of Governors.\nThe Genesis was the Atlanta International\narbitration society, this bill would allow an unnoterized statement that is in a proper\nform to tell the person signing it that they're doing so underpindly a perjury to be admissible\nin a civil case, but only if the person signing is outside the United States.\nSo the idea is that it's very difficult when you're outside the U.S. to get something\nnoterized.\nYou have to go to an embassy and have a consular vice consul sign it, requires an appointment.\nthey often can't keep the appointment, it takes months,\nand this would just simplify that process,\nbut still achieve the same result\nas the notarized statement of it being made\nunder penalty perjury.\nAre you a lawyer?\nI am, it's really exciting stuff in it, Mr. Chairman.\nVery exciting, what kind of lawyer?\nI do mostly whills and probate\nand some real estate closings and that sort of thing.\nOkay, cool.\nThat's good, Mr. Chairman.\nAh, question.\nSenator Dolezal.\nYou say you're a lawyer, Secretary?\nYes, yes, Mr. Senate.\nPretty much representing a spoke of what it sounds like\njust a challenge of the House to get through\nand understand our sophisticated bills.\nDo you think that you could help your members\nwork on the enemic level of work that's being done\nover there and increase the output a little bit?\nSenator Doesall, I'm working every day\nto throw Senate bills out of committees.\nI'm trying to get them on the floor as best I can.\nWell, we send them out into the rules committee.\nI don't have, that's above my pay grant.\nI can't control it above there.\nYes, pass, I would say.\nMercedes, I can't, what's that number?\nOh well, 62 to 12.\nDo you have any further comment on 62 to 12?\nWe can't count that high in the house center.\nThat may be part of the problem, so.\nOh, good answer.\nI understand that it's all becoming more clear, Mr. Represented.\nThank you very much.\nWell, I take my shoes off.\nI can go up to 10, but otherwise.\nIf you all can't tell, Senator Dole's\nI was a little hot about this.\nI sense, Mr. Chairman.\nlittle hot. We're trying to calm him down though. All right, well, any other questions?\nThank you, Representative Lever. Thank you, Mr. Chairman. Appreciate it. Thank you. All right,\nRepresentative Daniel, Representative Reese, for Representative Daniel. Yes, Mr. Chair.\nAll right. I'd like you to kind of explain this situation, because we never really got into\nthis. Yes. So, Representative Daniels bill. Yes, sir. But you keep coming to present it. So\nwalked me through this.\nYes, sir.\nWe're trying to work together.\nAre you okay?\nNo, sir.\nNo, sir.\nNo, sir.\nMy wife was docked the other day.\nI was second week of, and she was presented over in the Senate.\nOh.\nYes, sir.\nI'm happily married.\nDr. Chasigaro's.\nOkay.\nIs this her bill?\nNo, it's not her bill.\nIt's in it.\nIt's in it.\nI'm representative Danielsville.\nBut we try to work together in the house.\nAnd I did share your message yesterday, sir.\nI told them everything that you said.\nAnd that's maybe probably why we had one extra today, but we plan to do more.\ndo more as the days progress. We've got to work on it. Hey.\nRobes and Rees, you got a call before you walk. Yes, sir.\nAll right. Well, now that we got all that straight. Yes,\nsir. Why don't you tell us about. Absolutely. Once again,\nfor 175 is two main sections to a section to basically establish\nrevenue sharing for some existing tags. Kaffa Poseidon Alpha\nViola. But most importantly, section one established tags for our\nConstitution officers, all of our Constitution officers, right now the\nad commission as well as the public service commissioners are left out and we\nwant them to be to be a part of and as is importantly stated each person pays\nfor the own tax so the state is not pan for this and the revenue share and\nbrings revenue to the state Mr. Chairman. Okay. Oh yeah lots of questions. Lots of\nquestions. Okay. Thank you representative. So yes sir. When you came for\ncommittee and you agreed to let me amend this bill you agreed to let me amend\nbill it's not even yours. Why have permission to do so? I have permission to do so.\nReally? I'm an attorney as well. Yes sir. I have permission to do so. I mean in fairness\nwe've done that on this side. And total fairness I was going to do it anyway.\nI have supported so I'm on our side. I've been done that way. So yes sir. Okay. I'm trying to\nwork with you, Senator. I'm not your opposition. I mean y'all got my permission to\nI mean, any of these of you all, just kidding.\nAll right, any further questions?\nFor representing a breeze.\nYeah, I got to tell you, I got fired one time,\nbut I got named Teddy Reese, so.\nBut I like you better.\nYeah, it introduced me to a My Handling for you.\nNow, I'm out of the record.\nThank you for having me fired, but anyway.\nI just say by him one time. I didn't say I only got fired one time. All right, y'all\nquit talking about old stuff. HB 183 Representative Barton, are you with us? Senator\nPayne's with us, come on up. I guess Representative Barton's over here working on our\nSenate bills. And I can find it shocking to believe that you could have ever\ngotten fired from a job. You know I got all your bills out of here. This is\nHouse Bill 183. This is a Department of Revenue bill passed through the Senate\nlast year and just makes replaces terms temporary license plate with temporary\noperating permit and revise the standards for issuing temporary operating\npermits from motor vehicles. It's not a real complicated bill. We passed last year\nand just asked to move to this year. Okay. Any questions for the Senate sponsor? Thank\nyou, Senator. Great presentation. HB193 Representative Anderson. Come on up. You been here\nbefore handy. Well not this year no sir. Okay. Thank you sir and House Bill\n193 basically it raises the project cost threshold for compliance with\nGeorgia's local government public works law from $100,000 to $250,000. The\n$100,000 was set when the public works law was initially put in place over\ntwenty-three years ago and has not been adjusted since okay any questions so\ntwo thousand was last time yes sir good bill good bill all right no\nquestions. Great job. All right, HP 2-0-7 is represented roads. I didn't see\nthem out there. Senator Anderson, you want to cover that for us? I don't know.\nThis is another department bill. This is a department bill and this is just a\nbill upgrading to the type lighting that a vessel's supposed to have at\nnight. It also does something with drunk, drunk boating, doesn't it?\nDo you know that you cannot leave? Did you all know current law, if you, if you\ncrash your boat, you just have to report it within 48 hours. This is updating\nthat is updating this way you got to stay on the swing. Yep. I think that's good\nbill. All right. Any questions? No questions. Senator\nAmber Tarty, you know tomorrow is St. Patty's day, right? That's\nyou want to make sure you knew? Yeah, I heard you, Mr. Chair,\nwhen you told the house appropriation. I want to make sure you\nheard me. Although I wish I could get invited to Augusta.\nSenator Anderson can help us with that\nMaybe a roles committee\nLunch there with egg salad sandwiches and chicken salad sandwiches. It'll be great. I\nWon't put you in charge of that committee\nAll right, let's see represent corporate. Did you you could have covered them both?\nI'm sorry. I'm not hitting on all of a sudden. I've been waiting a long week sir. I understand go ahead hot house bill 340\nIt's came through education committee\nCriteria we tried to work on this year was the literacy student achievement and school safety\nWe work with the superintendents association principles and all the different organizations representing teachers\nWe define what a planning period is we protect that planning period, but at the same time we give the\nthe school, the superintendents principles,\nthe option to use them one day a week if they need to,\nor if there's an emergency, they can pull them at any time.\nSo working with them, it addresses what we want to work on\nin education this year, and that's what the bill does.\nAll right, good bill, any questions?\nHearing none, thank you.\nAll right, HB 373, I'll cover this one.\nIt's simply making September 11th, first responders appreciation day.\nRepresentative Jones has been up here multiple times, and Senator James has come up multiple times, and so I told her I'd cover that, so we could spare her the trouble.\nany questions? Hearing none. All right. Representative Blackman, HB414.\nCome on up. There, Mr. Chairman, how are you today? I'm good, Mr. Chairman. How about\nyou, sir? I'm good. How are them young, that young and... We had a great time at\nT-Bull last night.\nActually.\nThank you.\nHow are yours?\nThey're alive.\nHow's it going to school today, so I'm a little worried.\nI don't know what happened to you.\nThank you, Mr. Chairman.\nMembers of the committee, before you house Bill 414, which would create a Veterans Mental\nHealth Service Program, which is a matching grant program, now up under the Department\nof veteran services, it would match private investment in our state to help our service\nmembers their families and veterans and their families with any mental health issues.\nHappy to answer any questions? Any questions?\nSenator Dulles, I'll cherry black with a cherry of a powerful committee over there in\nthe house. It's all relative, Mr. Chairman.\nDo you serve on the rules committee as well?\nIndeed, I do, yes, sir.\nCan you help us understand this tremendous disparity\nbetween the workload that's happening in the Senate\nversus the poultry, anemic, almost non-existent workload,\napparently, that's happening over there in the house?\nWell, hold on now, and I get 12.\nI believe is that a bill and a half a day, Mr. Chairman?\nI mean, that's about a bill and a half a count, besides us.\nI learned new things every time I venture over into the Senate environment and so I appreciate\nwhat I'm learning here today and we'll do all I can.\nAre you learning how to get a 62-day measure?\nOkay.\nOh, we got more questions.\nThey're doing it.\nI just sent you a learning stuff.\nDid you know that they're going to shut down the hospitality suite over there until y'all\nget called up?\nThe house gets called up with the Senate.\nfighting words where where is the hospital this week any of the center of\nus and you like something on your mind go ahead no sir I just love sitting\nback and watching my elders joust with each other you have no\nelders in this room all right oh center of still I know that the the chair over\nThere's a really good at math.\nAnd so if he could take back to his membership,\nthat we have passed out more bills\nthat we have members.\nAnd if they could even do half as good as that over\nin their side, I think we could probably accept that.\nThat's a good final next year, we're hoping.\nYou know, in fairness, the Ways and Means Committee\nhas passed out every Senate bill\nthat was passed over to us.\nNot only that, three out to you.\nYou know for that might just put your bill on from Monday.\nWe'll see.\nThank you, Mr. Chairman.\nAll right.\nThank you.\nRepresentative Reeves.\nHB444.\nFirst bill.\nFirst bill.\nFirst bill.\nFirst down to rules.\nFirst down to rules.\nWell, well, well.\nGreat to be here in the Senate Rules Committee, Chairman Brass, House Bill 4404.\nHouse bill 444 if it looks familiar it's because it is this is a bill that\npassed the Senate last year regarding Liz pendants. Liz pendants means a\nlawsuits pending this gives some procedures and ground rules and allows a\njudge to cancel the Liz pendants at an early stage of the case if it's\ninappropriate to be filed and cloud-up title would be glad to answer any\nquestions. Chairman Strickland's the Senate sponsor.\nI recognize a lot of folks here on Rules Committee from House Judiciary and Judiciary\nnon-civil from bills we passed on this week.\nWe've been working hard for the sit down there.\nWe don't have a non-civil, do we?\nNo, we got rid of that one.\nThat committee's with Gork.\nAll right.\nWe're going to be.\nI'll tell Chairman Smith.\nOkay, any questions for the freshman representative on his first bill in rules?\nSenator Albert, you were like something that's just eaten at you.\nMr. Chairman, it's an honor.\nNumber three.\nI'm on your own.\nSpeaking to the mic.\nI've known the good representative for some time.\nIn fact, he tried a couple times to make it right here into the Senate.\nHe did.\nHe did.\nBut I'm glad to see he made it in any way to the House.\nto settle. That's okay. Great to be here at this August committee today. I do have a bill\nover there and Judy and Judy non-civil. Maybe you could help me get that. Look forward to hearing it\nand I appreciate you fighting gangs in Georgia. Thank you. We need to get them. We need to send them\nout. Gangbuster. Thank you. They train them well over there. So there wasn't. Did you have\nOkay. Nothing else for the freshman representative on his first bill.\nThanks so much. Thank you. I guess we'll just haze Senator Strickland on the floor.\nAll right. Representative Hatchett, where I did 493, HB 541, Representative Lomston, are you with us? Senator Robertson, can you cover that force?\nMr. Chair, remember in this bill it deals with the safe passing of\nmotor mail carriers and other delivery vehicles that stop on the roads almost\nif you will such as a move over law to protect the individuals driving down\nthe road and the individuals making the deliveries. So basically they got to\nget over if you can't just slow down. Yes, sir. You impressed I knew that. Yes,\nsure. I'll put some press. All right. Any questions? No questions? All right.\nRepresentative Cannon. You are with us. You're not with us. I represent\nSenator Watson. Are you with us? The same Watson. Not the Ben Watson. Come on up,\nSenior Wright. Sorry about my replacement not being here this afternoon. He peeled\non out of town I think with with his citrus commission bill. But this is\ncreating the Georgia Citrus Commission. We have 12 or 14 of these\ncommissions already with all the ag commodities that we grow and produce in\nour state. So what's one more? So what's one more? They're voluntary, they're used\nto raise funds for that specific commodity to marketing research promotion so they're\nvery valuable and we've also put a lot of money in the budget for the Citrus Commission\nin this last cycle so this will just kind of help supplement some of those positions\ngoing forward.\nCan you name all the Citrus brews that would be included under this commission?\nI cannot.\nSapsumas.\nWhat is that?\nThey're like a tangerine.\nOh.\nLike a kitty?\nan industry in our state. That's about I can tell you. Senator Roberts. Senator I appreciate\nyou coming up bringing this this incredibly complicated piece of legislation. Is there\na commission for blueberries? There is. And what is it called? Blueberry commission. So that\nwas the answer I was looking for. So is there a strawberry commission? I don't think so. But there's\nThere's a Georgia-grown commission that collects a lot of the other smaller.\nBut there's a standalone blueberry commission.\nFor sure there is, yes sir.\nWho's the chair of that?\nWe'd have to ask the senator from the eighth I believe.\nDo you think there's a good chance he may be?\nHe might be.\nYeah.\nThank you senator.\nYep.\nThank you.\nAre you on to do a floor amendment for the Strawberry Commission?\nYou're reading my mind Mr. Chairman.\nHow about pomegranates?\nget a pomegranate commission. We can always\namend it on the floor, Mr. Jim.\nAll right. Thank you.\nIs this your first time to send it rules?\nIt is.\nHey, what took you so long? I'm glad I wouldn't slide by.\nRepresentative Franklin, I saw it. Yeah, there we go.\nYou want to come up and tell us about something?\nSomething on your mind?\nYes sir, I appreciate this opportunity.\nI know I'm on the schedule, but I want to talk to you\nabout House Bill 285 and this retirement bill basically\nis some to extend the employment retirement systems\nfor alternative investments to 5% to 10%.\nIt's very similar to Albert's bill that he passed,\nor that helped pass to retirement.\nI'm just a mere freshman in this thing, but I guarantee that when I go over to the committees, I will put a talk to everybody I can get this bill through.\nWhat's that building ever center?\nSo it's one to twelve.\nWell, when you pass a hundred bills out of the Senate, you got your odds are a lot better.\nWhere?\nThis is a relationship business.\nYou remember that young Padawan.\nPatawon.\nI will.\nThank you, sir.\nIs this your first time rules?\nIt is.\nOh.\nOh.\nFirst time.\nSo.\nWell, so your bill did not make the yellow sheet just, I'm educating you and, um, so committee,\nI want you all to review his bill over the weekend and we'll reconvene on Monday and see\nwhat we want to do as a committee.\nThank you.\nThank you, sir.\nThank you, sir.\nWork the committee.\nMake them work me.\nAll right, anybody else out there?\nAny other representatives or senators\nthat would like to speak on behalf of Georgia and America?\nOK.\nWell, let's pick a few.\nWhere am I?\nI mean I still got you up but I feel like you're going to wave again. You can. You have\nthat right. But I'll remind you the ways of mains chairman, aren't you ways of mains\nchairman, has moved every Senate bill. This is true. This is true. All three of them.\nI was also impressed that Representative Reese mentioned that his hard work resulted in\nand the net plus one.\nAh, I mean, very fair.\nThat bill that he's representing for somebody else.\nBut Mr. Chairman, I'm no dummy.\nI see Chairman Hatchett on here with House Bill 493.\nAnd I think that's the one I'm going to go with.\n493 for the appropriations chairman.\nLet me circle that.\nAll right, Senator Wett.\nThank you.\nNo room on the ten.\nThank you, B.C.\nThank you, Maverick.\nI mean, Lieutenant.\nI mean, Mr. Chairman.\nThank you.\nThank you.\nI ask unanimous consent that we pull...\nYou're a little too formal.\nJust pick one.\nOkay.\nHold on just a second.\njust second here. I had it right here. 373. 373. Good one.\nSenator James might give you a big ol' hug for that one.\nAll right. Dr. Watson.\nHouse bill 35. House bill 35.\nPick.\nSenator Walker.\nshould have should have said House Bill 545 for the old\ncommodity commission crowd citrus commission\ngrowing government yes Senator digging what is what say you 80\nInplay or not in play.\nNo, that's.\nI wouldn't make sure.\nOkay.\n80 is available. But you don't have a pick yet. FYI. No, I got a list here and I keep\nit fair. I'm like Judge Smales. Senator Anderson. Why is this the right list? I\nI feel like I did these yesterday.\nThis house bill 207.\n207.\nAll right, that's four bills.\nHow should I be in the house?\nI can't count past four.\nUm, okay, two, seven.\nSeren Hausteller.\nNumber three here, but for the chair of Ways and Mings,\nnot because he passed out the three bills,\nwe sent him, but because he has to put it\nwith all those members over there on that giant committee,\nI would go with House Bill 414.\nFour, 14.\nAll right.\nI think that'll be enough.\nWe don't want to get too far ahead of him.\nWhat would be the mercy?\nI mean, 70 might be the mercy rule.\nAll right.\nFour Monday, I've got HB35.\nHB207.\nHB373.\nHB414.\nHB493.\nHB545. I've got a motion from my vice chairman. I got a second from the man in green on\nnon-sent St. Patti's Day. Any further discussion? Hearing none. All in favor say aye. All opposed.\nSame sign. Motion passes. Was that a, did I hear an eye over there? Motion passes,\nyou know anyways. Meeting adjourned.\nYou\n",
  "updated_at": "2026-02-12T10:46:10.386457+00:00"
}