{
  "video_id": "chbyyb-9dPQ",
  "url": "https://www.youtube.com/watch?v=chbyyb-9dPQ",
  "title": "3/22/23 - Committee on Insurance & Labor",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 37,
  "summary": "Here is a summary of the Georgia 3/22/23 - Committee on Insurance & Labor session:\n\n**Overview**\nThis session focused on discussing and passing House Bill 280, which allows life insurance policies to offer certain health devices as part of the policy. There was also discussion and agreement on House Bill 295, which aims to address issues that have arisen since the passage of the 2020 surprise billing law.\n\n**Key Actions**\n**HR 280**: Allows life insurance policies to offer certain health devices like fitness trackers as part of the policy.\n**HR 295**: Addresses issues that have arisen since the 2020 surprise billing law, including prompt payment, final payment notices, and provider practices. The bill was developed through collaboration between the legislature, Department of Insurance, insurers, and providers.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Representatives from the Department of Insurance, insurance providers, and healthcare providers all voiced support for HB 295 and the collaborative process used to develop the bill.\n\n**Votes**\n- HB 280 passed unanimously.\n- HB 295 did not have a recorded vote, but there was a motion and second to pass the bill.\n\n**Attendance**\nA quorum was present.\n\n**Adjournment**\nThe committee adjourned, but no specific next session date was provided.",
  "transcript": "You\nAnd then what we're going to do, Chairman Hawkins has to pass in a bill at one, so Chairman\nAugust, we're going to do you say, Representative Gamma's already presented once, and I don't think\nhe's going to take long.\nWe haven't heard your yet, but I don't think it'll take too long either.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nWe're okay, we're good.\nAll right, we have a quorum now, and I'll call the Senate Insurance and Labor Committee\nto order, and we'll start with Representative Gamble House Bill 280, which we heard last\nweek. I think it was last week. Yeah. Thank you, Mr. Chairman. I appreciate the opportunity\nto be with you today. House Bill 280 is a bill that you might be familiar with by the\nconcept because we passed a bill last year that allows property and casualty insurance\nto offer in the sale of a PNC policy a loss mitigation product so that could be a water\nleak sensor, a smoke detector, something of small dollar type value.\nAnd so what this bill does is it adds life insurance policies in with that so that a blood\npressure cuff or a fit bit that counts steps.\nSome type of health device product like that could be offered in the sale of a life insurance\npolicy.\nall dollar value type items that are have to be reasonable in relation to the premium.\nAnd this is overseeing the Department of Insurance has authority over this so there is\na bad actor and keeping mind no insurance company is going to want to risk their licensure\nwith the state over being a bad actor in this and we have not seen that demonstrated from\nthe bill we passed last year. But again, this bill just adds the life insurers into being\nable to offer these devices. I'm happy to answer any questions and that's, that's what\nHouse Bill 280 does.\nAll right. Any questions?\nOkay. I got a minute.\nSo I'm meant to say I'll open the floor for a motion.\nWe did hear that we heard this last week and there was a good bit of discussion and he's\nSenator Patrick had some questions or concerns and she told me that you met and addressed\nthose.\nWe got a motion, no, have a second, second do pass.\nAnd we're working off of LC 520188, any further discussion?\nAll in favor of do pass, please signify by saying aye.\nOppose, same sign.\nAll right.\nThank you.\nThank you.\nWhip Robertson is going to carry this for me.\nOK.\nVery good.\nThank you, Representative.\nAppreciate it.\nDr. Hawkins, we'll let you come next.\nI know you've got another engagement.\nI do, thank you.\nThis is House Bill 295.\nAnd we have not heard this bill yet.\nI know a lot of work has gone into this\nand I will let you tell us about it.\nThank you.\nYeah, you may remember we passed the surprise bill\nin the Patient Protection Act in 2000,\nsigned it in the law.\nWhat this bill did was help protect patients\nfrom those late charges that they would see months\nand months later out of getting out of the hospital\nof 2040, 60,000, whatever it may be.\nAnd the way this thing came to fruition was\nthrough arbitration, the patient was taken out\nof the discussions and the arbitration was between\nthe insuring and the provider.\nthe department, we worked closely with the department on that bill, Department of Insurance.\nAnd since then, they have come back to me and we've had discussions on areas that they\nwere having problems with.\nAnd so that's really the emphasis of this bill was addressing those.\nWe met in the summer and the fall with all parties, with the insurers, with the providers,\nfacilities, hospitals, and the Department of Insurance.\nThis bill addresses the things that the insurance commissioners office was having problems\nwith and you'll see in section one and actually just goes back and talks about the arrests\nof repeat that that was in the original bill at the top of the page two it talks about\nprompt pay that is already in code just sort of repeating that restating that then in\nIn section two, it talks about emergency services and you know that the fads require us, the facilities\nand positions, whether in network or not, with emergency services, that's going to be covered.\nSo we just added facilities into the wording that was not in the original bill.\nSection three, they were addressing some type of final payment notice.\ninsurers had some issues with putting final payments in certain ways. So we'll\nleave that up to the department for that to be designated. That needs to be\ndesignated because if the insurance plan is in a risk exempt plan, that goes\nup the federal ladder. If it's not, then it goes up the state ladder. And as you'll\nsee, we have shot clocks mentioned in here. And those are a little bit\ndifferent from the federal and the state. So that's the reason they asked for\nthat. And again, like I said, everybody was agreeing to that. You will notice, on the\nnext page, we address actually the providers, some of the problems with the providers. And\nif the providers are showing a practice, a pattern of continually filing for any reason\nof multiplicities of filings, anything that was not in good faith, that's going to be\nnoted and actually later on there are fines mentioned in this bill for that. So we're addressing\nevenly any problems that may be arising on each side of the fence with the insurers\nor the providers. And really that's what this bill is doing. Those fines are in section\nsix for the providers. We have extended the shot clock. Now that was one of the main things\nthat the department found that was very difficult to get pass was we had 30 days in the bill\nafter a year and a half of actually implementing this they found that was too short of a time\nfor the insurers to respond to and sometimes for the providers to respond to.\nSo they've extended that and Mr. Chair, and that's pretty much what the bill is.\nLike I said, everyone was in agreement to the wording.\nwording is very narrow, but then that's what happens when you come up with a\ndegree-to-pond bill. Thank you for your work on this, Chairman Hawkins. Any\nquestions from Chairman Hawkins? We do have some folks. I don't know if you\nwant to spend the time to listen to them, but Commissioner's office is here\nWiston-Burlson, JC Weithington from the insurance of folks, providers that\nThey're all here to say yes, we agree with this.\nWe have come to an agreement.\nI do have a sign-up sheet for people\nthat want to speak on the bill.\nAnd we'll do that now.\nLauren Palo with the American Anesthesiology of Georgia.\nAnd you can just state that you're in favor.\nYeah, we are in favor of the bill.\nAnd we just want to say we appreciate the collaboration\nbetween the Senate, the House, the DOI,\nand the providers and insurers on this.\nThank you for the hard work.\nIt is a cleanup bill and it is much needed.\nThank you.\nThank you.\nAll right, Jesse Wellington.\nGeorgia Health Care Providers.\nYes sir, thank you, Mr. Chairman.\nJesse Wellington with Georgia Association of Health Plans.\nI'll echo those comments.\nWe appreciate Chairman Hawkins for the process with us.\nThis is really the way to clean up the a lot of be good,\ndone and we're comfortable with this piece of legislation.\nThank you.\nThank you.\nBethany Sharer.\nAll right, Bethany Sharer with the Medical Association\nof Georgia just want to echo comments that have already been made.\nThank you for all of your work on this, Chairman Hawkins\nand for you all for listening to this.\nAnd this will definitely help us better implement this bill.\nSo thank you.\nThank you.\nWeston, since your name was mentioned,\ndo you want to, you didn't sign up.\nbut Western World Insurance Commission's office.\nI just echo everyone else's comments.\nWe've been, all of us have been in a room\nfor a couple of months, we're passionate this out\nand we appreciate Chairman Hawkins for caring the bill\nand it's gonna address some issues\nthat we're having in the meeting.\nThat's a prize billing,\nit's gonna make the whole process smoother for everybody.\nAll right, thank you.\nI've got a question, Senator,\nor um.\nNo point, no point.\nOh, yeah, I was in there by the way.\nsecond. All right, I got a motion do pass. Let's see. Motion do pass LC 460544. That's what\nyou got right and a second from Senator Harveston. Any further discussion? Yes, sir.\nIt is a little shocking but we needed to come by a moment. There's going to be a\nMarshmallow roast later. All right any further discussion. All those in favor of\nDupass SB I mean House Bill 295. Say aye. Oppose same sign. All right thank you.\nThank you.\nSenator Hofsteadler.\nAll right.\nThank you, sir.\nReconciliation.\nAll right.\nAll right.\nNext, House Bill 63.\nRepresentative Noe Williams.\nThank you, Mr. Chairman.\nHouse Bill 63 is LC number 520174.\nThis bill actually is for fully insured health insurance groups that have 20 or more covered\nlives or covered employees, we're simply asking for claims experience at renewal time from\nthe insurance companies to the insured or to the group.\nThat's all this bill does right now.\nIf your level funded or self-funded, you get claims experience from three and above and\nIf you're fully insured right now,\nyou get claims experience for a hundred and above.\nBut we have a lot of groups out there that are between 20 and 99.\nAnd this gives employers the claims experience.\nIt gives the insurance brokers the claims experience.\nSo when they're shopping, you know,\nit kind of gives everyone an equal playing field.\nSo the insurance companies know exactly\nwhat's going on with the risk.\nAll right.\nSo just to be sure it's sinking in, I guess,\nBecause you know, I've talked about this numerous times it took me a minute to fully grasp the benefit of this as\nAnd you're a broker yourself correct correct, and so you've spec- you specialize in employee benefits and\nThis bill like when you go to a small business owner you want to be able to offer them\nEvery option that might benefit them as far as the benefit package correct\nThis is another tool for them to look at because they ask you, OK, why are my rates going\nup and you say, well, your loss ratio, OK, what did I have, you know, can you prove it\nto me?\nAnd then so you had to take the word from the insurance carrier that gave you the information.\nBut if I had claims experience and say, well, you had six people that had this, this,\nthis, and this.\nAnd there's no HIPAA violation because, you know, as the broker or as the HR director,\nyou know, you sign off for HIPAA and the names are not on there, it is just saying what\nthe condition is and what the prognosis is and diagnosis so you can plan going forward.\nAnd it's equal footing for the insurance carriers is good for the employer groups and it's\ngood for the employees because they don't have to fill out all this paperwork and answer\napplications and I mean they don't know what their kids medicine are taking.\nBut you know if you have that information for the insurance carrier and they have that\ninformation.\nSo as a broker, without the information on the smaller groups, under 100, you may not\nbe able to offer that business owner for their employees a level-funded option or a correct\nor a self-insured option.\nWhereas with this, you have more options available.\nThat is correct.\nIt's great isn't it like I said it just puts everybody on the equal play and feel all right. I have a question from Senator Robertson\nChairman Robertson would you try Mike too?\nBetter yes, okay. I'm not an insurance broker. I'm a consumer and I just want to be clear\nThe information you're providing them, and what was the terminology I think you used?\nClaims information.\nWell, you didn't say claims information, it was another word phrase, I thought, but so\nthis information is it just the amount of claims that have been paid out?\nNo, it would be like for instance, if you had an employee that was a diabetic condition\nand then they had $60,000 in claims\nand they were taking this type of insulin.\nYou know, that would be disclosed\nso they could see why their rates were going up.\nOr if you had a pregnancy,\nwell, that pregnancy was over,\nso you could argue with the insurance company,\nhey, we're not gonna have these claims again.\nYou've got to give me better rates going forward\non this group at the renewal time.\nSo I came from a government that was self-insured\nand they're getting this information.\nNo, no, that's the thing.\nThe third party provider would come in and they would say,\nwell, we have one consolidated government employee\nthat consumed $500,000 with the claims last year\nbecause of cancer, diabetes, or medicine or medication.\nSo what you're saying is, in terms of companies\nwould be required to provide this information to you.\nSo when you spoke to your customer who are under the numbers\nthat you're talking about now, you would have these numbers\narticulate to the customers to why their insurance was going up and right now\nyou just right now all I have is you pay this in claims or this\nin premium and these are what your claims were and unless we fill out\nquestionnaires all the employees filling out questionnaires we're not going to\nknow what's going on with that group and a lot of times these employees they\ndon't know the medications they're taking or the kids are taking or their\nspouses are taking unless it's something you know really you know really big\nOkay, but it just it just a level play and feel for everybody. I just don't want to vote for something\nI don't understand and now I understand. Right. Thank you for the question.\nSenator Kazer, thank you, Mr. Chairman. On the second page line 26, you had another change\nfor insurers that utilize provider contracting methods that goes on and says, or other methods used\nto calculate premiums. What are you targeting this?\nThat's a good question. A lot of times that renewal, your\ncensus might have changed. The male, female factor.\nThe age change, you might have added some new people.\nYou might have brought in some kids on the group.\nSo when they're looking at the renewal piece,\nthey take that all into consideration, not only\nthe claims data, but what the next 12 months,\nwhat their forecast is going to be.\nAlso, there might have been something that was just diagnosed and it has not shown up yet in claims and they use that information going forward for a rating model.\nThere might be somebody that they know of that had some some cancer information or some funny medical and it's about to hit and they know that's going to take place in the next 12 months, so that gives insurance carrier the option to weigh that in their claims data.\nAnd this was model legislation from other states that have picked this up.\nSo it was national association of insurance commissioners model legislation.\nFollow up real quick.\nYes, sir.\nWell, I'm afraid this is going to hurt the consumer.\nMan, that's going to let them raise your rights, basically, by predicting the claims.\nThey're going to be worse.\nThey're doing that right now.\nBut if you can go to the group and tell them what's going on with their group,\nthey might can change their plan design or they might be putting some\nand send us some different wellness programs if they know they have a bunch of\ndiabetics on their health plan.\nOkay.\nThank you.\nYes sir.\nIf I can speak to Chairman Couser on that and Chairman that was the exact\nproblem we were running into until we started getting this information where\nwhen we realized a disproportionate amount of our insurance was being used for\nof those who experienced diabetic issues,\nwe were able to establish another tool\nthat would home deliver the services\nto our diabetic employees within the Columbus\nbecause all of the government,\nso they could get ahead of their issue\nbefore it became a bigger problem\nand impacted the premiums of the 2000 employees\nthat were on there.\nSo without this information,\nour rates would have continued to go high\nwithout us understanding that there were solutions\nthat we could adopt and go into that.\nSo this information helped us a lot in the phrase\nI was looking for this claims experience.\nSo thank you.\nMr. Protein, do you have a question?\nYeah, thank you, Mr. Chairman.\nChairman, this seems to make a lot of sense to me.\nMy question is, is there anyone that's against the bill\nthat you know of?\nNot that I'm aware of.\nGreat, thank you.\nOne of the insurance carriers was a little hesitant,\nbut when I talked to them,\nI'm like you're providing this information\nyour level funded piece was the issue and they said well it might put more work on us that's\nit okay imagine that all right okay we do we had a sign up she nobody signed up so that the\ntime it's good time if you'd like to make that motion thank you mr. Chairman like to make a\na motion do pass. All right. Have a motion on the second any further discussion. All those\nin favor please say aye. Opposed like sign. All right. Passed.\nThank you, Mr. Chairman. This is carrying this me. Yes, sir. All right.\nright. I'm glad we got a robust explanation. That'll help me. Thank you. All right, next\nI'm representing my thigh, House Bill 362, Matthew Ack, sorry.\nI appreciate you for sticking out for it.\nThank you.\nWould it be all right if I bring my council to?\nYes, that's fine.\nHouse Bill 362, LC 520244.\nYes sir. We went through subcommittee I think a couple weeks ago if I'm not\nmistaken. What this bill does is provide for all providers a transparency that\nwill benefit providers or the insurers that will provide the treating\nprovider upon written requests the accounting of the payments of the\nhealth care provider service. Often the checks are written to the patient or the\npolicy holder and then assigned to an attorney. The health care provider is not\nalways aware of the amount that's paid on their belt until the end of the\nyear. When the provider gets at 1099 and the amount of the that's been paid by\nthe insurer may be different than what is being dispersed through the\nattorney or what the patient has been paid. So basically that's what this does.\nIt simply allows the provider or the doctor to know exactly what's being\npaid on their bills.\nAll right. And so this did go through Chairman Kirkpatrick subcommittee.\nYes sir. Would you like to comment on that or do you all have a recommendation on\nthe bill. I don't think anybody has any issues with the bill.\nChairman Kirkpatrick, you did talk about Worker's Comp a little bit that day if you recall.\nAnd on line 93, the obligations provided in Code Section 34-9-11.1 is where that Worker's\nwas. Mr. Chairman, the issue was just making sure that this didn't interfere with anybody's\nsubrogation rights under workers' comp.\nOkay. Mr. Alvary, introduce yourself.\nI'm Alvary Galant who's the Georgia Chiropractic Association in line 92 and 93 basically says\nthat the rights of subrogation under workers' comp are not interfered with. And I'll answer\nany questions you have otherwise I'll just wave my testimony.\nAll right I do our learned attorneys on the committee you all may have some experience\nwith this and your practice you see any no questions all right what's what's the will of\ncommittee. We've got a motion to pass and a second. Any further discussion? I'm\ngoing to change up this time. All in favor raise your hand because some people\nhave their mouth off of it or any. All right. Good luck in rules. Thank you. Thank\nThat might be a little segue to thank our sponsors for the nice, deli lunch we had provided.\nWe are clearly enjoying that and we appreciate it very much and it was a pretty long list\nof sponsors just about every insurance advocate in the room helped by our lunch so thank\nyou all very much. Yes, ma'am. If you weren't able to participate, I think she won't\nsubmit. Is anybody willing to carry that bill on the floor? I can, but I've got a good\nmany. Anybody have an interest in carrying that?\nI'll give you my nose.\nAll right, I'll take care of it.\nThank you. Senator Merritt.\nSenator Merritt will handle it.\nThank you. Appreciate it.\nShe's very good in the well.\nI've already passed a few bills this session, haven't you?\nThank you.\nSo if you didn't get a chance to participate with sponsor and launch,\nwe'll have another opportunity.\nI'm sure down the road.\nAll right, next, House Bill 315, Representative Taylor.\nAnd I don't think we've heard this one.\nIs this in subcommittee?\nOkay, thank you, Mr. Chairman, members of the committee.\nI bring you House Bill 315 and I'm working off of LC 520242.\nThis actually is a bill we worked on last year and it came through.\nIt passed so that insurance companies would recognize a second mammogram when it's due\nto the high definition was needed.\nThey were sometimes writing those as not preventive and making them subject to deductibles\nand copay and they should not be.\nWhen we wrote the bill last year, it said we were using a set particular guideline, the\nNational Comprehensive Cancer Network as of January 1st, 2022.\nAnd it came to light that we need to leave that up to the insurance commissioners because\nthere's new books and regulations just about every year.\nSo we've changed that to allow the insurance commissioner who oversees these type of things\nto say which guidebook we'll use, and that's basically what it does, it's a simple little\nbill.\nOkay, any questions, Senator Roberts?\nNo questions.\nMr. Chairman, at the right time, I do recall this legislation last year.\nIt's good legislation.\nOkay.\nAll right. I have a motion do pass in a second. Senator Merritt any further discussion?\nAll in favor of do pass raise your hand. Any opposed? Senator Lucas a\nAffirmative on this one all right pass unanimous and\nthank you thank you thank you\nall right moving quickly here representative Henderson House Bill 384\nglad you were able to be with us today and we heard this last week but I'm not sure\nsure the same people were here so give us a quick synopsis of of your bill.\nYes so thank you chair and committee. HV 384 is for prostate cancer. Prostate\ncancer is one of the leading cause of death for men in the state of Georgia. This\nshare alone 9,300 men will be diagnosed and over 900 will lose their\nbattle to prostate cancer. This bill simply urges men to have a PSA test done\nyearly and to avoid having prostate cancer. The PSA test is a simple blood test\nthat men can receive. prostate cancer does not come with any pain or any\nwarnings, if you do have pain, then of course it's too late, it's already spread.\nSo therefore, this bill simply has the insurance company sends notifications to men upon\nreaching age 45 to recommend that men have a PSA test done yearly.\nSo this is pretty much an eye opener and a red flag raised for men to save lives.\ndetection is key early detection save lives.\nAll right. Thank you. And we heard testimony last week that these notices or reminders or\nnotifications can be delivered electronically.\nYes, sir.\nThat's correct.\nAnd I don't, there wasn't anybody last week that spoke for or against this. I don't\nsee anybody signed up today. You're not aware of any opposition to this. Are you\nNo, sir, it passed unanimously in the House.\nI haven't heard any opposition.\nThank you.\nThank you, Senator.\nAny further discussion?\nAll in favor, please raise your hand.\nSo the motion do pass.\nSenator Lucas seconds.\nSenator Robertson.\nAnd pass unanimously.\nThank you.\nThank you, Reverend.\nThank you, Chair.\nAll right.\nWell, that concludes our business.\nI don't think we're going to meet again this session.\nAppreciate y'all's work on the committee and we stand adjourned.\n",
  "updated_at": "2026-02-12T03:15:23.152876+00:00"
}