{
  "video_id": "cHcbk3MdC1M",
  "url": "https://www.youtube.com/watch?v=cHcbk3MdC1M",
  "title": "Rules meeting for Day 27 of the 2025 Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 27,
  "video_date": null,
  "duration_minutes": 20,
  "summary": "Here is a summary of the Georgia Rules meeting for Day 27 of the 2025 Session:\n\n**Overview:**\nThe Rules Committee heard presentations on several bills, including measures related to tax credits for workforce development programs, veteran license plates, and regulation of private water companies. The committee also discussed routine code revision and clean-up legislation.\n\n**Key Actions:**\n- **HB 7**: Provides a $4,000 income tax credit for graduates of workforce readiness programs employed in high-tech jobs in rural counties\n- **HB 583**: Allows totally disabled veterans or those with a high level of disability to obtain a second free license plate for their spouse or another vehicle\n- **HB 718**: Designates the first week of April as \"Women's Golf Week\" in Georgia\n- **HB 351**: Clarifies the permitting process for solid waste landfills to prevent future lawsuits\n- **HB 371**: Raises the maximum annual appropriation for capital outlay projects from $300 million to $375 million\n\n**Bills Introduced (First Reading):**\nNo new bills were introduced.\n\n**Notable Moments:**\n- Representatives advocated for their bills, highlighting the policy goals and need for the legislation.\n- The committee chair reminded members that bills not yet reported out of committee would need to be considered at a future meeting.\n\n**Votes:**\nAll bills discussed were recommended to pass, often with unanimous support.\n\n**Attendance:**\nA quorum was present, and the meeting proceeded without any notes on attendance.\n\n**Adjournment:**\nThe meeting adjourned. The next Rules Committee meeting was not specified.",
  "transcript": "Good morning, everybody. We've come to order, please.\nMorning. We're going to ask Chairman Hawkins to open us up with the word prayer here this morning.\nThank you, Mr. Chairman. Please bow your heads.\nGod, we come to you today and pray that we have the eyes to see the best in people, the\nheart that forgives the worst, a mind that forgets the bad, and a soul that never loses faith\nin God.\nThank you for this name.\nPlease guide us in our deliberations.\nAmen.\nThank you, sir.\nOkay. Those who would be presenting bills today, some bills have not been reported out\nof committee yet. So if your bill is not on the blue sheet or the yellow calendar, then\nwe'll need to have you come back in the morning at 9 o'clock. So if your bill is not on\nthe blue or yellow sheet, you don't need to be asking for that today. If it is, we'll\nbe glad to hear from you.\nOkay, let's go ahead.\nYes ma'am.\nGood morning, members of the committee and Mr. Chairman.\nI am asking for favor consideration of HV7.\nIt is the first bill on the yellow sheet\nand it is an amazing bill.\nLet me tell you about it.\nHV7 gives a $4,000 income tax credit\nfor a graduates of a workforce readiness program,\nI employed in full time in high tech jobs in our rural counties, so it was in rules\nlast year and thank you to Chairman Blackman for working with me on this last two years.\nSo I asked for your favorable consideration of HB7.\nHB7, okay.\nI don't see any questions.\nThank you.\nThank you.\nYes, ma'am.\nRepresentative Glaes.\nGood morning, colleagues.\nGood morning, Chairman.\nI come before you asking your favorable consideration\nfor House Bill 583, which is on page six at the top.\nThe LC is 394705S.\nAnd this bill is in reference to adding a second-free\nlicense plate for veterans who are totally disabled\nor have a level of disability.\nSo at this point, they only have one,\nand we're asking for a second one for their spouse\nor for a second car.\nAgain, thank you for your favorable consideration.\nOkay, thank you, ma'am.\nDon't see any questions.\nYes, ma'am.\nThank you, Mr. Chairman and members of the committee\nOn the yellow sheet, I bring to you HB718.\nI'm working from LC number 590125.\nAnd HB7186 to make the first week in April of each year,\nwomen's golf week in Georgia.\nThank you, and I ask for your favorable consideration.\nOK, I don't think that one's made it out yet.\nshould be on the yellow sheet I was told but I don't know. 718, yes. Thank you. Thank you, Mr. Chairman,\nmembers committee. Third page 13th one from the top House Bill 351. I'm back to ask for that bill\nagain today. This is the EPD Department Bill and basically all we're doing we're just clarifying\nthe permitting process for solid waste landfill whose responsible what the public hearings\nneed to be held. It's the prevent future lawsuits with the state and local save money.\nOkay we do have a question Jim Smith. Thank you Mr. Chairman. Does it determine you?\nYes, I do.\nThis is the project of work that has been going on for over two years and I know EPD and\nyou have been working with all the various interested parties and a lot of the bill just\nclarifies what needs to be done in the process to follow but there's a good buy-in around\nthe state.\nThere is a need we need to do this and I thank you for your tenacity and sticking with\nit.\nThank you for helping us perfect the bill.\nThank you.\nThanks, sir. I'll see you more questions.\nAll right. I have another one on the third page.\n16th now for the top House Bill 371.\nAnd basically what we're doing there, we're just raising the maximum allowable that we can\nappropriate anyone year from 300 million to 375 million for capital outlay projects.\nThis is a maximum we can appropriate less than that.\nIt doesn't take effect until 2027.\ntwo things that has caused the need for the increase.\nOne inflation, it had been increased in 2007.\nAnd also Pre-K was added to the FTE fund\nin the last year as well.\nSo that's the two reasons we need the increase.\nAnd I appreciate you for the consideration.\nOkay, you don't have any questions.\nThanks, sir.\nYes, sir, Mr. Chairman.\nThank you, Mr. Chairman, members of the committee.\nYellow sheet page five house bill 449.\nThis bill, Georgia's one of five states\nthat does not regulate private water companies\nin this bill,\nlooks to do that on companies\nthat use surface water for distribution.\nI'd be glad to answer any questions.\nOkay, I don't see any questions.\nThank you, sir.\nKim Yard.\nThank you, Mr. Chairman, committee.\nI have two bills, 484, half bill 44, half bill 45, they're on page 4, near the bottom,\nhalf bill 44 lasts for the Georgia law books, which are the tan books in some of your office\nrather than black code books to be published in either hard copy or digital forms.\nMaintaining a digital option can improve the accessibility of these importance as it\nbecause more difficult to find a cost effective publisher.\nAny questions?\nNo, see any questions on that?\nWhich other ones?\nAll right, 45.\nAll right.\n485 is this and the annual code revision bill,\nbut it's something that the Ledge Council worked on during the last season.\nIt actually helps clean up the code in a number of ways,\nforeign lines and modernizes technology as some of the federal references and the Georgia law.\nFor instance, change in the names on certain things like the note child left behind\nlack act which has sent the name there which you to succeed at. It also addresses items\nin the code which has been deemed unconstitutional. Also, it addresses items that have been funded\nthat have been on the book for some time.\nAnd any unconstitutional portions of the law\nthat require further debate or major pilot discussions\nwere not included in this bill.\nAnd I want to thank the legislative council\nfor the work they did on this\nand the House budget research office for their assistance\nand ask for your favorable consideration.\nOkay, don't see any questions on either one of those.\nThanks, sir.\nThank you.\nThat's a new shocker.\nGood morning. Thank you, Chairwoman and members of the committee. We'll be coming off the Blue Sheet House Bill\n369 on the Blue Sheet and I'll be asking your payroll\nfor help on this one\nSomething to pitch the glasses on\nHouse bill 369 basically what is doing a safety measure\nFor the ice cream trucks to have a little bit more signage on the back and on the side\nBecause not too long ago in October 23. We had a child here in Fort County\nwas killed by a driver that was going around the ice cream truck and we're\njust asking to slow down a little bit and as a paramedic that's one thing you\ndon't want to roll up on the child in that situation. Thank you.\nYou don't have to say any questions. Thank you sir. Thank you.\nThank you, Mr. Chairman, and members of the committee.\nI bring you HP 494s and the top of H5, LC 394, 607.\nAnd what this bill would do, it would require both head drivers to have, to be covered by some formal financial responsibility,\nwhich provide the ability for them to replace the damages for our abilities and account for accidents that they cause or\nthat they may be in.\nThere are 25 states that have, that require more payouts to have some type of insurance and that includes states like Alabama, Mississippi,\nTexas, New York, California, Pennsylvania, Utah, Colorado, that just to name a few that require more payouts to have some type of form of\ninsurance. Okay, don't see any questions. Thank you, sir. Thank you, Mr. Chairman.\nMr. Carr. Thank you, Mr. Chairman. I'm here to present House Bill 529 today. It's\non page 6 of the yellow sheet. Third from the top.\nThis bill is called the Georgia Online Automatic Renewal Transparency Act.\nMr. Chairman, virtually everybody in this room has been shot or surprised by an automatic\nrenewal on a subscription.\nThey've gotten more prices and shot up dramatically, and virtually everybody in this room has\nbeen incredibly frustrated with the difficulty of getting out of some of these subscriptions\nat times.\nThe Georgia Online Automatic Renewal Transparency Act addresses the challenges with automatic renewal subscriptions.\nAnd it was passed unanimously out of committee and I think it's a very popular bill that crosses every line.\nOkay, thanks sir, don't see any questions.\nThank you, sir.\nThank you Mr. Chairman members of the committee today I bring to you this on the yellow sheets page four house bill 429\nThis is a result of a constituent calling me and asking me why they are still paying taxes on a motor vehicle that was purchased prior to 2013\nThis is a 2010 car and I said a good question. Let me see what I can do for you\nSo what it does is, it removes the annual advalorem\nwith a birthday tax on motor vehicles purchased prior\nto March 1, 2013.\nAnything after that is not taxed currently,\nso this would put them in the same treatment category.\nAnd I would ask for your favorite consideration\nand answer any questions you may have.\nOK, no questions.\nThank you, Mr. Chairman.\nWhat we do have a question too.\nBig protein has questions.\nSince 2013, is that when we passed the birthday tax?\nAnd so they've been paying at the warms for what or they've been paying avalorn for this will be the 12th year that other car owners do not pay\nSo now we're saying you paid enough and yes, that is correct. Thank you. Okay. Thanks, sir. Thank you. Okay, that takes\nRepresentative Wilkinson. What was the fiscal note on that?\nThere is no fiscal note. There is no impact to the state for this. So it only impacts the locals. I will add this. There was a request from ACCJ to do an opt-in, but that would be a tax increase because that money would go to the state. So this is no impact to the state at all.\nmoney that the locals are receiving. That is correct. For all cars that they've\nbeen paying taxes on for 12 years. Thank you. Plus, thank you. Thanks, sir. Okay,\nthat's everybody on the wall. Before we get to the members for your request, we\nneed to have a little housekeeping I'd like to do. I'd like to recommit House Bill 397 back to\nGovernmental Affairs who hear a motion and have a motion and second is in opposition.\nOkay, it's back there.\nOkay, any members of the committee have requests?\nChair McGree.\nThank you, Mr. Speaker.\nMembers on page six, the fifth one down, House Bill 593, which is really a local bill,\nBut it has to be a general bill, a probate judge, a provide for a nonpartisan election.\nThank you.\nOkay, I don't see any questions on that.\nThanks, sir.\nChairman Newton.\nThank you, Mr. Chairman.\nAlso on the yellow sheet, bottom of page three, House Bill 341 is an insurance plan as\na department bill from the Department of Insurance in an effort to find out where the\ngaps are and insurance coverage.\nSome people that work for small businesses, 10 employees or less are often not able to afford a full-fledged plan.\nThis allows the employer to contribute an amount and let the employee also pay an additional amount to get an individual coverage of the Georgia Access Program where over one and a half million are already on it, but this allows the employer, once again, businesses 10 employees and less.\nOkay, I have a question.\nI had a question.\nI said, this is, you mentioned a department bill\nthat went through ways and means.\nIs that right?\nCorrect.\nIs there a cost to the state for this?\nI'm sorry, yes.\nIt is a $600 per year per employee tax credit\nto those small businesses to encourage them.\nThey have to spend at least $1,200,\nand many or most of them spend $3,000 or $5,000\nof employer contribution, but this does give them $600 per employee as a tax credit.\nIt is an incentive to encourage people who don't have a plan already to add one.\nSo state tax payers would be subsidizing $600 per person for their health insurance?\nRight, maximum of $5 million a year.\nOkay, thank you.\nYou have a additional one.\nOkay, it's over on page six at the top of page six on the yellow sheet is House Bill 526 it regards historic\nrenovations of historic properties recognizes that with commercial properties\nADA and other standards require a\nA lot more in-depth\nWork and this allows allows but does not require a local government to not just give eight years of a property tax abatement plan\nbut up to 20 years. It's not mandatory, it's just permissive, and there's no state funding involved.\nOkay, don't see any questions. Thanks, sir.\nSure, no you didn't see.\nThank you, Mr. Chairman. There are two on the yellow sheet, and I know we may need to talk\nabout them further as we get closer on the trail, but I thought I'd put them in the purview here.\nSo HB567, which is on the yellow sheet, and it is on page six about two-thirds of the way down.\nThis will authorize and regulate the practice of teledenistry in Georgia by Georgia licensed all health care team members.\nThat's the first one.\nNo, see any questions on that. What's your next one?\nAnd the second one is on page 7, 6 down.\nIt is HB677, which will deal with the challenge that we have of some of our children who are stuck in care situations in our hospitals\nhospitals as well as residential treatment centers, it will allow a team to come\ntogether quickly, the match team which already exists and try to help fund proper\nplacement for them as they are released from care.\nOkay, I've seen any questions on that one, okay.\nChairman Hawkins, did you have a request?\nYes, Mr. Chairman, it's on the yellow sheet page seven, top of the page, HB629.\nSure brought to me an issue that they were running into.\nWe passed legislation last year on AEDs and elementary schools, but back in the original\nlegislation which involved only high schools in years or years ago, it required that the\nprogram be evaluated and certified by a physician. In modern times, they found\nthat not to be necessary because it does allude to requirements on national\nstandards. Also, the AEDs have changed so much that now you just place the AED\non the patient's push and button and it tells you what to do. So this would\nI would take a load off, Chaua.\nOkay, you don't see any questions.\nThey had Chairman Blackburn.\nYou have one?\nYes, Mr. Chairman.\nI know Chairman Newton has already mentioned 8-3-41.\nWe missed a date change on that.\nAnd I know that we've been focused so hard on working on some of the language\nand they have been so amenable to it that we would like to recommit\nand then get it back to you with that date change if it all possible.\npossible. So I would move that we recommet 341. Send it back to two ways of means. Okay,\nwe recognize for a motion for that. Is there a second? Is there any opposition to sending\nthat back 341? It's back. Okay.\nThank you Mr. Chairman, on the third page next close to the bottom, House Bill 393 is the\nsafer cycling in Georgia, brought to me by one of my high school seniors and supported\nby most of the cycling closer.\nTell us the number again.\n393.\n393.\nOkay.\nto where they can turn right if no one is coming and they look without having to stop because that would happen.\nSpeak right into that mic. They're having trouble hearing that.\n393 on the bottom of page three.\nNext to the last one is the Safer Cycling in Georgia Act brought to me by one of my high school seniors\nand supported by the bicycle and clubs across Georgia.\nThey are trying to be allowed like they tell me they can already motorcycle people can do.\npeople can do to turn right if there's no one coming or in the back and they are\npedestrians blocking. So they don't have to slow down where and are less likely to\nbe hit and we'll reduce the number of accidents.\nOkay, don't see a question. Thank you, ma'am. Chairman Stevens.\nThank you, Mr. Chairman. On page four, the Yellow Sheet House Bill 382 allows we have a drug\nit's coming to the market before we're back in session so that we can put it on our annual drug\nupdate. This allows them to move it from a schedule one to a schedule probably two and allow the\nboard to use us emergency powers until we can get back in session and put it on our drug update bill.\nOkay, don't see any questions on that. Okay, on our calendar for today, I believe we have\n17 propositions that are on the debate calendar for today. I think that'll keep us busy for a while.\nSo all we're gonna do this morning is have a hearing and I suspect we'll all need to get together later on in the day and have another little conference\nSo y'all have a good morning. Thank you\n",
  "updated_at": "2026-02-12T18:29:36.826171+00:00"
}