{
  "video_id": "CIgJOffe2qQ",
  "url": "https://www.youtube.com/watch?v=CIgJOffe2qQ",
  "title": "Lawmakers Exclusive: Gov. Brian Kemp Talks with GPB on Final Day of Legislature",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 6,
  "summary": "Overview:\nGovernor Brian Kemp discusses the conclusion of the Georgia legislative session, highlighting the passage of tort reform legislation as a key priority that was accomplished. He also expresses openness to potential insurance reform in the future, while emphasizing the need to maintain fiscal responsibility.\n\nKey Actions:\nNo specific bills were mentioned as passing or being referred.\n\nBills Introduced (First Reading):\nNo new bills were introduced.\n\nNotable Moments:\n- Governor Kemp plans to address the General Assembly to thank them for a \"great legislative session\" and the productive work done, despite some \"tough issues.\"\n- Kemp expresses satisfaction with the passage of tort reform, which he sees as critical to stabilizing the business environment and insurance market in Georgia.\n- Kemp indicates openness to potential insurance reform in the future, but emphasizes the need for transparency and fairness, as well as increased competition in the insurance market.\n- Kemp dismisses the possibility of a special legislative session to address the state budget, expressing confidence in Georgia's fiscal position and the conservative budgeting approach.\n\nVotes:\nNo specific votes were mentioned.\n\nAttendance:\nNo quorum notes were provided.\n\nAdjournment:\nThe session is ongoing, with Kemp planning to address the General Assembly later in the evening. The next session date was not specified.",
  "transcript": "Well, we have Governor Kemp available right now, so we're gonna talk more about this in a moment.\nWe are happy to welcome this show, the Georgia Governor, Brian Kemp.\nGood evening, sir, and thanks for joining us for a few minutes.\nBusy night.\nHey, great, great to be back with you. Happy signing day.\nThank you. I want to start with what you told or you plan to tell those in the\nChambers this evening. I guess you haven't talked to them yet.\nNo, we're fixing to go do that here in just a little bit when everybody gets back from\ntheir dinner break and they're going to have a busy rest of the night but I'm looking\nforward to getting in there and thanking the members of the General Assembly for a great\nlegislative session.\nI mean we have had some really tough issues that we have worked on and debated but I think\nit's been done in a really open transparent, fair way where everybody had their say and\nthat's the way it should be.\nObviously, from my perspective, we've had a great session.\nThey passed a great budget today,\nand so I'm looking forward to the rest of the night\nand also the rest of the year.\nOkay, we've been talking about it here in the studio,\nbut one of your big priorities was to get torque-reformed\nfast, you did that.\nHow are you feeling right now about that goal being accomplished?\nWhen you were on the show last year,\nyou told us you were going for it, and you did.\nWell, very, very excited to get that done as y'all.\nWe're just talking about very, very close vote,\ntough debate, very tough issue.\nPeople have been trying to get this done for,\nyou know, really the last five years,\nyou know, in modern times,\nand really over the last 20 years,\nthere hasn't been a whole lot done.\nSo it's a tough issue to tackle.\nBut I think all the leaders in the General Assembly\nfelt like we had to do this.\nI know from my perspective,\nI felt like it was the one thing\nthat was really hurting our business environment here\nand that other states were using this against us\nbecause they have taken action on tour reform.\nAnd so, you know, our main thing was to stabilize\nthe marketplace that was out there.\nPeople cannot continue to live with, you know,\n15 to 30% premium increases every year.\nIt's killing small business people,\nkilling working Georgians out there.\nAnd so tour reform, you know, what we did,\nI think will help stabilize the market.\nAnd we're gonna continue to watch that,\nyou know, as we get out of session.\nAll right, so we've heard some people talking about this,\nIs there a possibility you'll want to see insurance reform next year?\nWell, now there's a lot of members of the General Assembly that were very concerned about some of the insurance companies\nand, you know, wanted to take a look at that.\nI kept asking people the whole session, hey, bring me something.\nYou know, if you want to legislate that, bring me to language.\nI'm open to talking to all sides on these issues, to stabilize costs, but also to open up markets.\nI mean, we got small business people out there, entrepreneurs and others that can't even\nget insurance because of the way the market was here and the way the legal environment\nwas here.\nSo we wanted to bring some parity, transparency and fairness to that issue.\nNow people want to look to the insurance companies.\nI'm open to talking to them about how they want to do that, but my message to the insurance\ncompanies is we did what we think was right.\nI think they're very supportive of that.\nAnd so now we're looking for them to get into this marketplace\nand have more competition, which will help stabilize prices.\nAnd so that's something certainly I'll be looking at\nin the months ahead.\nOkay, on another issue, given that the budget relies\nheavily on federal funding, and we still don't know\nwhere things are going to fall out when the state,\nin the state when it comes to money,\nyou think there will be a need for a special session\nto deal with the budget at all?\nI think it's very, very, very premature to be talking about special sessions when we hadn't\neven ended this one yet.\nIn regards to what's going on in the federal government, whether it's those other things\nthat the Congress is doing on ending COVID funding, I mean, look, they have to do those type\nthings.\nWe cannot continue to have the levels of spending in this country, especially things that\nwere related to COVID that quite honestly, when you look at the way the state of Georgia\nhis perform. I mean we haven't been you know relying on those things for over the\nlast two years. So you know I think they're making the right moves to make sure\nthat they worry and get down our debts and our deficits which will help bring\ndown interest rates and not burden our children and our grandchildren in the\nfuture. And I can assure you that we have continued to budget conservatively\nin our state even with this budget budget but we're also putting money back in\nour taxpayers pockets with another billion-dollar tax refund that's going to send $500 to the average\nfamily out there that's been paying taxes. We're low in our corporate tax rate. We're low in our\npersonal tax rate to continue to keep more money in Georgia's pockets so that they can fight\nthe high-cost environment that we've been over the last four years. And hopefully we're going to\nsee that continue to go down and have a better days ahead financially. So I'm very optimistic\nabout that, especially in the state of Georgia with the economic development, the jobs that\nwe're creating here, the amount of investment has been historic over the last three years,\nso we're positioned as well as any state in the country to weather whatever goes on in\nthe U.S. or the world economy.\nI know you said this evening isn't over yet, but I do want to know if you're already\nlooking toward next year at all, like you talked last year about tort reform for this year,\nyou think for next year?\nYeah, I'm not looking forward to,\nI'm not looking forward yet to next year.\nI'm looking forward to next year,\nbut look, we had a big agenda this year.\nWe had a lot to get done.\nSo we'll get this session done with tonight,\ngo into bill review and make sure that we're signing\nor potentially vetoing bills that would be bad\nfor our citizens and then we'll start looking\non what we're gonna do next year.\nbut a lot different than we were in this position\nthis time last year talking about tour reform\nand having to focus on it in the next legislative session.\nThankfully, we got that done along\nwith a lot of other good things\nand we've asked out a great legislative session.\nWell, I know that you are going to go talk to each chamber\nand thank them for everything\nand they'll be happy to hear from you.\nBut I want to thank you for coming to CS first.\nI appreciate you talking with this governor.\nGreat to be back with you.\nHave a good night.\nThank you.\nThank you, too.\n",
  "updated_at": "2026-02-12T01:29:40.5273+00:00"
}