{
  "video_id": "Cj0938jo7SA",
  "url": "https://youtu.be/Cj0938jo7SA",
  "title": "Georgia House - Day 39 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 39,
  "video_date": "2026-03-29",
  "duration_minutes": 48,
  "summary": "Here is a structured markdown summary of the Georgia House session from 2026-03-29:\n\n## Overview\nThe session covered notable legislation, including SB 255 which creates the Border Region Tourism Development Program, and SB 235 which legalizes mask-wearing during a pandemic. There was some debate around the history and intent behind mask mandates.\n\n## Key Actions\n- **SB 255**: Creates the Border Region Tourism Development Program to support border region retail and tourism projects.\n- **SB 235**: Amends the law to make it legal to wear a mask during a pandemic or state of emergency.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Meeks asked for clarification on SB 255 only applying to one Georgia recipient counties.\n- Rep. Wynn asked about protections for religious dress like burkas under SB 235.\n- Debate around the history and intent behind mask mandates in the state.\n\n## Votes\n- SB 255 passed with a vote of 157-6.\n- No other recorded votes mentioned.\n\n## Attendance\nNo specific quorum notes provided.\n\n## Adjournment\nThe transcript does not mention the time of adjournment or the date of the next session.",
  "transcript": "House will come back to order. House will come back to order. Mr. Clark, you\nwant to ring the bell?\nOkay, uh, Chair got a little over up to Mystical\nover how long it would take all the paperwork to get ready.\nBut we are ready to go now and all of the paperwork\nthat you need, the calendars, copies of the bills\nand everything are out back of the chamber,\nout back of the gallery, out back of 3.41.\nGo ahead and be getting those.\nPark will read the caption to a group of privilege resolutions honoring the life and memory\nof George Albert Gaines Jr.\nin commanding six Samuel's dry cleaners, recognizing March 22 through 28, 2021 as World\nDulu Week, recognizing in commanding Dona Marie Butler-Harley, and for other purposes\nof seconds, leads the reading of the Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions, the chair here is none, and the\nresolutions are adopted we had one bill left on the earlier supplemental calendar\nand that will uh, Senate Bill 255 clerk will read the caption to Senate Bill 255.\nSenate Bill 255, Senator Mulles, the 53rd Gouge, the 51st Bill, the 49th Dugan, the 30th\nand others, the entitlement act to amend chapter 34,\ntitle 50, the fiscal to Georgia annotated,\nrelating to the one Georgia authority act,\nsystem five for grant program,\nto support quarter region retail and tourism projects.\nLet's build that, refer to the Committee\non Economic Development Tourism.\nThat committee recommends that this bill do pass\nby rules committee substitute.\nChair recognizes Chairman Stevens to present the bill.\nThank you, Miss Speaker.\nThe latest gentleman, House, Senate Bill 255,\ncreates the Border Region Tourism Development Program,\nwhich should be administered by the one Georgia authorities\nto support border region retail and tourism projects.\nUnder the current law, the one Georgia authority\nis there to promote the health, safety,\nand economic security of rural citizens\nin Georgia through development and retention\nof employment opportunities in the rural areas\nand enhance these infrastructures\nand to accomplish this goal.\nWhat this bill to create this border region,\nretail tourism development program,\nwhich is a mouthful,\nand to award grants to help them in competition.\nThere's several things that this bill would require\nfor you to do before you could use one of these grants.\nand it would be the number in types of jobs to be created.\nThe total private capital investment,\nyou'd have to provide the impact of the state,\nthe regional and community tax base.\nIt would require the degree of local commitment\nfor skin and the game.\nIn the bill, it originally had a succumbence\naround the state to be within 10 miles.\nWe changed that to be within 25 miles of the border.\nMr. Speaker, this will be administered\nthrough the One Georgia Program and the Governor\nand the Commissioner of Economic Development\nmust approve these before the grants are awarded.\nThis is in addition to a statewide tourism development\nprogram that we already have.\nAnd recently, we've had cities like Claxton Douglas Field,\nJeff Davis-Takoa-Nunan, which is where Great Wolf came,\nis another program for the development of these areas.\nI hope you'll support the program and support House Bill,\nexcuse me, Senate Bill 255,\nand if there's no questions, I'll yield the well.\nYou have a question if you're here to yield.\nOh, yeah.\nChair recognizes representative Meeks\nup in the gallery to your left for a question.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI yield.\nJust for clarification purposes,\ndoes this program only relate to the counties\nthat are approved as a one Georgia recipient\nunder their current resources?\nYes.\nThank you, Mr. Chairman.\nMr. Speaker, I yield the well and ask for your favor.\nWe'll consider it right.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the substitute\noffered by the committee on the rules?\nThe chair here is none.\nThe rules committee substitute is adopted.\nIs there any objection to agreeing to the report\nof the committee, which was favorable to the passage\nof the bill.\nThe chair here is none.\nThe report of the committee has agreed to.\nShall this bill now pass all those in favor of the passage\nof the bill will vote aye.\nthose opposed to vote no and the clerk will unlock the machines.\nAll members voted, have all members voted, if so, the clerk will lock the machines.\nOn the passage of Senate Bill 255, the eyes are 157, the nays are six.\nThis bill having received the requisite constitutional majority is therefore passed.\nto Senate Bill 235.\nSenate Bill 235 by Senator Watson,\nthe first councilor to the 46th,\nHarveston, the 15th, Kennedy, the 18th,\nthe Goodman of the 8th.\nThe Italian Act to amend Article 2,\nChapter 11 of Title 16,\nwhere the official go to Georgia,\nannotated a relay in the offenses\nagainst public order,\nso as to revise the offensive,\nI'll see you'll see identity of the where.\nMr. Bill, I'm referred to the Committee\non Judiciary Non-Civil Act Committee\nrecommends this bill do pass by committee substitute.\nChair recognizes the chair of the Judiciary Non-Civil\nCommittee Chairman, Bershett, to present the bill.\nThank you, Mr. Speaker.\nI'm a little bit out of breath.\nI just took the trip from up in the gallery\nand it was running a little bit late, so.\nThis is a fairly quick bill here.\nCurrently in the state of Georgia,\nit's a legal to wear a mask.\nAnd if you look around at each and everybody in here,\nwe've got a lot of lawmakers in here.\nSo what this bill does is it makes it legal\nwhen there is a pandemic or a scenario such as the one\nwe're in now, to wear a mask.\nAnd that's all the bill does.\nIt makes it legal to wear a mask in a case\nwhere we have a state of emergency\nand we have a virus like we do have now.\nAnd with that, I'll yield the will for questions.\nIf necessary, Mr. Mayor.\nDo you yield for questions?\nYes, sir.\nChair, recognize his representative,\nEric Atomis, to your left for a question.\nDoes the gentleman yield?\nYes, ma'am.\nIs it not true that the reason why we had a mass mandate\nwhile it was illegal to wear a mask is due to the Ku Klux Klan?\nHi, I don't know if that has any relevance to this statute here.\nWhat we're doing here is making it legal to wear the mask\nthat you're wearing currently.\nCan the gentleman further you?\nCertainly.\nAgain, to my point is in history of America\nand the history of this state capital,\nwhich was built on my forefathers that built this,\nbut that was not able to even come into this capital,\neven though they built the capital,\nthat this mandate, we hope,\nwas because of the clan wearing masks,\nand because of people running up to you\nin a robbery situation, and I yield.\nWell, as I understand the law, as it's written now,\nit's for concealing your identity\nin the commission of a crime.\nSo I'm gonna have to leave the rest to the lady.\nDo you further yield?\nI do.\nChair recognizes representative Wynn\nto your left in the gallery.\nThank you, Mr. Speaker.\nDoes the chair yield?\nI don't need to yield. You need to ask the gentleman in the well.\nOh, I'm sorry. Does the gentleman in the well yield?\nYes.\nI just wanted to clarify that this bill wouldn't have any prohibitions as it pertains to religion in the wearing of something like a burka.\nAs I understand it, the federal law gives many protections for religious rights and wearing of a Berkha.\nI think you and I are actually representative Lopez and I have discussed this at length and I don't believe this bill touches that in any way.\nThank you, Mr. Chair.\nWith that, I'm going to yield the well, Mr. Speaker.\nThank you.\nis there any objection to the previous question being ordered? The chair here is none.\nThe previous question is ordered. Is there any objection to adopting the committee substitute?\nThe chair here is none. The committee substitute is adopted. Is there any objection to agreeing\nto the report of the committee which was favorable to the passage of the bill? The chair\nhere is none. The report of the committee is agreed to. Shall this bill now pass? All\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nhave all members voted have all members voted if so the clerk will lock the\nmachines on the passage of senate bill 235 the eyes are 166 the nays are 1 this\nbill having received the requisite constitutional majority is there for\npast. Clerk will read the caption to Senate bill 60. Senate bill 60 by\nrepresentative by senator Thompson the 14th alvers of the 56th most of the\n53rd robbers in the 29th painting the 54th and others being titled\nan act to amend part one of Article 5 of Chapter 9 of Title 45.\nThe official go to Georgia annotated relating the Georgia State indemnification fund.\nSo it was revised one indemnification shall be paid in instances of a heart attack stroke or vascular rupture.\nMs. Bill, I've heard the Committee on Public Safety and Homeland Security.\nThat committee recommends that this bill do pass.\nChair recognizes representative gravely to present the bill.\nThank you, Mr. Speaker.\nI'm ready to send a bill 60.\nVery quickly, several years ago in Polding County in Hiram,\nwe had a fire.\nAll units responded.\nAnd a man by the name of Kevin Van Dyke,\nlong time firefighter in our community,\naspirated during that fire, had a heart attack.\nhad Firefighter Van Dyke passed away,\nhis family would have received no death benefit.\nLadies and gentlemen, we have firefighters and public safety\npersonnel across the state that go out and put\nthemselves in emergency situations day in and day out.\nOne of the firefighters is turned back to the station,\nundoing his gear, had a heart attack and died.\nThat was not covered in the indemnification.\nAll SB 60 does is that connects us, ties us to the federal, matches us to the federal\nindemnification fund, where if a firefighter or public safety personnel in this state has\na heart attack, a stroke, or a vascular rupture within 24 hours of that type of rescue situation\nor imminent danger situation that their families would be able to benefit from the indemnification\nfund.\nfor questions. You have no questions. Thank you, Ms. Speaker. Is there any objection to the previous question?\nI'm sorry. We have another speaker. Yes. It means overlooked you. Chair recognized his representative camp to speak to the bill.\nThank you so much, Mr. Speaker.\nThis bill could be called the Lieutenant Bobby Patrick Bill.\nMy brother-in-law was a firefighter in Gwinnett County.\nAnd on April 14, 2003, he went to a fire.\nHe was on the roof of the fire.\nAnd he had a heart attack.\nSadly, his team was unable to revive him.\nBut because he passed away, because of a heart attack,\nThe Georgia State Demonification Fund did not pay his family anything.\nHe had been a firefighter for almost 30 years.\nI stand here in support of this bill because that $150,000 would have made a world of difference\nto his family.\nSo I ask for your support on this bill.\nI yield the well.\nThe lady is yielded the well.\nNow, is there any objection to the previous question being ordered to chair here's none\nthe previous question is ordered. Is there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill? The chair here is none. The report of the committee\nhas agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote\naye. Those opposed to vote no and the clerk will unlock the machines.\nWhat purpose does the rules chairman rise?\nThe speaker percent to rule 133, I ask to be excused from this vote.\nGentlemen has that right and the journal will so reflect, have all members voted, have\nall members voted.\nSo the clerk will lock the machines on the passage, Senate Bill 60.\nThe eyes are 167.\nThe nays are zero.\nThis bill, having received the requisite constitutional majority, is therefore passed.\nClerk will read the caption to Senate Bill 78.\nSenate Bill 78 by Senator Jones,\nthe 22nd Anderson, the 43rd Hill,\nwith 40th and others to be titled\nand act to amend part three of Article 3 of chapter 11\nto title 16.\nThe official code of Georgia annotated\nrelating the invasion of privacy\nso as to revise the prohibition on electrically,\nelectronically transmitting or posting\nnew to sexually explicit photographs or videos.\nThis bill I've referred to the committee on,\nthe judiciary non-civil that committee\nrecommends that this bill do pass by rules committee substitute chair recognizes\nrepresentative Tyler Paul Smith to present the bill representative please speak\nwhere I can understand you okay yes sir mr. Speaker I will try to not see\nthe best I know how. Mr. Speaker, members of this August, by the\ncoming for you again, bringing to you the rule substitute to SB 78. I just want\nto say on the forefront, I appreciate all of the staff members that have\nworked to make sure that we iron this out right as it should be ironed out\nand appreciate the use of our commas.\nIf you don't believe that commas make a difference,\nwell, I can assure you that they do.\nThis bill is actually amending our code\ndealing with the uploading of explicit content\non adult entertainment websites\nthat show explicit material.\nThis bill would actually put more teeth in our statute\nfor those that would upload or transmit these explicit\nmaterials that they receive without the consent\nor approval of those sending it to them\nand uploading it to an adult entertainment website\nor a medium that is used to upload this kind of explicit\nmaterial.\nFor that offense, you would now be charged\nwith a felony under this bill while we still\nkeep in the statute, the Mr. Men in our offense.\nFor the Mr. Men in our offense,\nthat would cover conduct as far as, for an example,\nsomeone receiving something,\nvia text, explicit material,\nand then transmitting that explicit material\nto another person's phone,\na Facebook post, Instagram post,\nor even Snapchat or Instagram.\nSo I bring this before you today,\nWe needed to put some more teeth in this statute.\nIt was a little bit vague as to what material this would cover.\nAnd this specification has been a great addition\nthat I hope that you all support with your yes vote.\nAnd Mr. Speaker, I'll yield for any questions.\nYou have a question if you care to you.\nI'll yield, Mr. Speaker.\nChair recognizes Chairman Sensler\nto your right for a question.\nMr. Jimmie, you'll not do.\nSo just to be clear, this keeps the penalty\nThe misdemeanor, if these pictures are shared with just friends or people, but if you\nload it into a commercial website where hundreds of millions of people can see it, that's\nwhat makes it a felony, correct?\nThat is correct, Mr. Chairman.\nNote that the misdemeanor still, misdemeanor of a high and aggravated nature, that's not\njust your regular misdemeanor, this is the increased misdemeanor pill on it, penalty.\nAnd then the felony provision, you have to have the intent to upload that material to\na website or a medium that actually does this for a living.\nIt's advertised.\nThey do advertising.\nOkay.\nThank you.\nThank you.\nNo further questions.\nThank you, Ms. Speaker.\nWell then, I ask for this body's favourable consideration and I will yield well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to withdrawing the committee substitute?\nThe Chair here's none, the committee substitute is withdrawn.\nIs there any objection to adopting the substitute offered by the committee on rules?\nThe Chair here's none, the rules committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe Chair here's none, the report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill?\nWe'll vote aye, those opposed will vote no, and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the passage of Senate Bill 78.\nThe eyes are 169.\nThe nays are zero.\nThis bill, having received the requisite constitutional majority, is therefore passed.\nbill 95 was on the calendar earlier today. It failed to receive the requisite\nconstitutional majority. This House reconsidered its action in failing to give\nthat bill a constitutional majority. It went back to the general calendar and\nis being called at this time the clerk will read Senate bill 95. Senate Bill 95\nof our Senate again to the 47th,\nbeech to the 21st Alvers of the 56th Senate in DeBarte,\nto the 31st, Kripatrick to the 32nd and others,\nto be entitled an act to amend, title 50.\nThe official go to Georgia,\nannotated relating to state government,\nso it's to provide conditions,\nfor meetings and public hearings.\nThis bill doesn't refer to the committee on government affairs,\nthat committee recommends this bill do pass\nby committee substitute.\nChair recognizes Chairman Allen Powell to present the bill.\nThank you, Mr. Speaker and ladies and gentlemen, first I do want to thank everybody\nfor giving me an opportunity to bring this bill back to you to be sure there was no misunderstanding\nabout the law of this thing.\nBottom line, this bill passed with pretty good numbers the first go around.\nWhen we came out and went through the process, we did raise the commission to the lottery.\nWhat this building is really all about, ladies and gentlemen, is about putting some teeth\ninto the management of an industry that serves a state.\nA lot of people have different views about this industry,\nbut this is not gambling because gambling\nis the paying out of cash.\nAnd that's the one thing that we've always\ntried to do in this, in trying to move forward\nto control this industry, to take that human element\nof violating the law in the paying out of cash.\nAs I said earlier that we put certain criteria in that they're both the retailers and the\nmasters that they'd be able to give or they would have to give more credentialed information\nto the lottery so they could scrutinize these operators even more.\nWe also did the gift cards and I've talked about this time and time again but the gift\ncards, once upon a time they were able to do gift cards and at that time a lot of the\ncash payouts went downhill considerably. Now, what that gift card does, and I'll say this again,\nit takes the rationale away from any retailer to pay out cash. And what it also does,\nit brings in, supposedly, we're bringing more monies into the coffers of the lottery,\nas well as to these retailers and the masters. But also, it'll bring in a ton of money into\nthe state sales tax coffers, quite frankly. So, you know, these are the things that this bill\ndoes. The most importantly, what it does is it helps to increase the rate for where the\nlottery will be getting more money, and it also makes a cleaner business out of it. That\nMr. Speaker is what this bill does, and I would certainly appreciate your favorable consideration\nto this bill. Gentlemen, as yielded the well, is there any objection to the previous\nquestion being ordered? The Chair here is none, the previous question is ordered. Is there\nany objection to withdrawing the committee substitute? The Chair here is none. The committee\nsubstitute is withdrawn. Is there any objection to adopting the substitute offered by the\ncommittee on rules? The Chair here is none. The rules committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nWhat purpose does representative Paris rise?\nParliamentary inquiry, Mr. Secretary.\nMr. Speaker, does this bill not say to us that these co-ems are definitive drain on our\ncommunities?\nYou can't sweeten this issue and that we just need to outlaw them all together.\nIt's like putting lipstick on a pig.\nThank you.\nLady is certainly entitled to that opinion. What purpose is representative McLaren rise?\nProbably very great nature inquiry. Mr. Speaker, isn't that true that the public meetings topic is too far a really removed from the coin\nOperated machines topic for this bill to be constitutional under the constitutional mandate that top that bills have the same subject matter\nI think that's something that each member will have to form their own opinion about\nWell, what purpose does representative Sains rise?\nParliamentary inquiry.\nIs it not true that I reviewed if there's been any bills that have passed to eliminate\nthis system and there has not been this session and this is the only bill that rectifies\na system that doesn't allow Georgia citizens who take part in this to use their winnings\nfor productive purposes like the lottery and that we have our taxpayers pay for a great\nlegislative council who would issue a statement saying if something is unconstitutional\nand they have not?\nI'm sure the gentleman believes that to be true.\nAll right, we're going to go ahead as all members voted.\nHave all members voted.\nIf so, the clerk will lock the machines on the passage of Senate Bill 95.\nThe eyes are 100.\nThe nays are 67.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe're going to bring the caption to Senate Bill 81.\nSenate Bill 81 by Senate Revolves the 53rd Miller of the 49th Anderson and the 43rd\nDugan of the 30th Walker, the 20th and others.\nWe need to add an act to amend Code Section 2437 in fiscal to Georgia annotated relating\nto the Office of College and Career Transitions and Powers and Duties, so it's the change\nto the name of the Office of College and Career Transitions to the Office of College and\nCareer Academies.\nThis bill I'm referred to the committee on higher education that committee recommends that this bill do pass\nBy rules committee substitute chair recognizes chairman martin to present the bill\nThank you mr. Beaker ladies and gentlemen. I'll try to be brief the hours late Senate bill 81 comes you out of the higher education committee\nIt does in section\n1.3 of the bill it seeks to change the name of the office of college and career transitions to a\nacademies, and later in the bill, update that again, and on line 68, add technical skills\nneeded to work.\nBasically, we're trying to get Jordan's ready to get into the workplace.\nIn addition, this bill has in section 1-1 and 1-2, and 2.1, the contents that passed this\nhouse on February 11th, that were at that time called House Bill 67, the University\ncarry over language. Those items passed 171 to nothing. The only thing that's been added\nto that language is additional reporting language that is I draw your attention on line 24\nthrough 30 and again on lines 39 through 45. So this is the original bill, a very simple\nbill out of the Senate to rename the college of transitions to academies and to place\nHouse Bill 67 on there so that we make sure we take care of the universities as this house\ndid on February 11th, 171 to nothing. If there are no questions, Mr. Speaker, the hour's\nlate and I'd ask the House's favorite questions.\nThank you.\nIs there any objection to the previous question being ordered? The chair here is none.\nThe previous question is ordered. Is there any objection to adopting the substitute offered\nby the committee on rules. The chair here is none. The rules committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill? The chair here is none. The report of the committee is agreed\nto. Shall this bill now pass all those in favor of the passage of the bill will vote\naye. Those opposed to vote no and the clerk will unlock the machines.\n,\nIf so, the clerk will lock the\nmachine on the passage of Senate Bill 81.\nThe eyes are 164.\nThe nasor zero.\nThis bill having received the requisite constitutional\nmajority is therefore passed.\nIt's about time again.\nClerk will read the caption to Senate Bill 100.\nSenate Bill 100 by Senator Watson, the first dude in the 30th Kennedy the 18th\nMiller the 49th hour the 48th and others to be titled an act to amend chapter\none in title 50 the Fisherhood of Georgia annotated relating the\ngeneral provisions for a relative state government so it's provided that\nthis state should observe standard time year round until such time that's as\nCongress authorizes the states to observe daylight savings time. Chair recognizes\nRepresentative Cantrell to present the bill.\nColleagues, I want to apologize that we're having to spend more time on this subject.\nUnfortunately, the Senate made light of the bill, which we sent to them a couple of weeks\nago, House Bill 44, which would have taken Georgia to permanent daylight saving time, pending\ncongressional approval.\nSo Senate Bill 100, which they sent our way, has now been substituted with the language\nof House Bill 44, that we passed out of this chamber a few weeks ago, which would take\nour state to permanent daylight saving time pending congressional approval.\nA couple of things, the Senate has recognized the error of their ways.\nWhen they passed SB 100, the outrage was tremendous because most people prefer permanent\nday-like saving time over permanent standard time.\nIn fact, Politico did a nationwide survey just a couple of\nweeks ago, primarily about President Biden, but in it they\nslipped in a question about day-like saving time and the margin\nwas over five to one people preferring day-like saving time over\nstandard time. And I want to remind this chamber that if\nour state does not pass this bill and Congress\ngives the states the ability to make this decision.\nFlorida, South Carolina, Tennessee, Louisiana,\nand Arkansas will all go to permanent standard time,\nand Georgia will be the odd man out.\nSo I want to encourage you to vote for this bill again\nas you did last time, and let's send it back\nover to the Senate.\nI'm told that they have recognized\nthe air of their ways, and they will agree\nto the changes that we have made to their bill.\nThank you, Mr. Speaker, I'll be happy\nYou'll for questions that there are any do you feel for a question certainly chair recognizes chairman p3\nDo you are left for a question? Thank you, mr. Speaker\nRepresentative I just want to be clear in the original version of\nSB\n100 it was a step\nTo daylight savings times first through daylight\nstandard time or through each. Through standard time.\nStandard time. Will you make it clear that this bill does not move us to\nstandard time. That's accurate. The Senate bill moved us to permanent\nstandard time until Congress gave us the approval to go to daylight saving\ntime. The bill that you see before you today has changed that to be clear to\nto move us to permanent daylight saving time pending\ncongressional approval.\nOnce the Congress gives us the authority to do so.\nAnd with that, Mr. Speaker, I will yield the well.\nGentlemen, as yielded the well,\nis there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nChair, here's none.\nThe report of the committee has agreed to shall this bill now pass.\nAll those in favor of the passage of the bill will vote aye.\nThose opposed to vote no and the clerk will unlock the machine.\nWhat purpose does representative Mitchell rise? Parliamentary inquiry. Is it not true that\nthe majority of letters I received about this legislation come from parents who are\nconcerned about their children getting on the school bus in the dark in the morning?\nIf the lady so states, have all members now voted? Have all members voted? If so,\nThe clerk will lock the machines on the passage of Senate Bill 100.\nThe eyes are 111.\nThe nays are 48.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe have two local callups, two supplemental local calendars, two of them.\nof the bills on the supplemental local calendar. It's on local calendar. Supplemental calendar\nnumber two relates to homestead exemption and requires a recorded two-thirds roll call\nvote for passage. If there is no objection, we will vote on both the supplemental local\ncalendars together and as a whole with a recorded vote. Hearing none it is so\nordered the clerk will read both supplemental local calendars. Senate bill\n209 by Senator Jones the 10th to Cab County Senate bill 295 by Senator\nGouge the 51st City of Cleveland Senate bill 297 by Senator Miller the 49th\nHall County Senate bill 275 by House substitute by Senator Thompson the\n14th Bartow County.\nIs there any objection to the previous question being ordered on both the supplemental local\ncalendars?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall these bills now pass all those in favor of the passage of the bills on both of\nSupplemental local calendars will vote I those opposed vote no in the clerk will unlock the machines\nhave all members voted, have all members voted, if so, the clerk will lock the machine\nAnd on the passage of the bills on the supplemental local calendars, the eyes are 137.\nThe nays are 24.\nThese bills having received the requisite constitutional majority are therefore passed.\nChair recognizes Representative Williamson for a motion.\nMr. Speaker, I move that the House agree to the Senate substitute to House Bill 150.\nRepresentative Williamson has moved that this House agree to the Senate substitute to\nHouse Bill 150, the clerk will read the caption.\nHouse Bill 150 by Representative Williamson of the 115th hatch of the 150th Kelly, the 16th\nand others to be tall and act to amend title 46.\nThe official go to Georgia annotated relating\nto public utilities and public transportation.\nSo it's a prohibit.\nGovernmental entities from adopting any policy\nthat prohibits the connection or reconnection\nof any utility service.\nChair recognizes Representative Williamson\nto explain the Senate substitute.\nThank you, Mr. Speaker.\nThe Senate simply added a clarifying language\nthat this bill also included heating oils\nthat are principally used to fire bores\nthat run circulating hot water through homes\nand also to businesses that use bores.\nSome of them are fired by what I call home heating wall\nbut this is heating wall.\nSo that's the essence of the change.\nImportantly, on lines 25 and 26,\nsays nothing in this code section\nlimit the ability of a government entity to choose utility services for\nproperties owned by such government lender entity. So Mr. Speaker, that's what it\ndoes. Are they happy to answer any questions or yield the well for your\nfavor and ask for your favor consideration?\nYou have no questions. On the gentleman's motion at the House agree to the\nSenate substitute to House Bill 150. All those in favor, opposed to vote\nknow and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of House Bill 150.\nThe eyes are 107.\nThe nays are 52.\nThis gentleman's motion has carried, and this house has agreed to the Senate substitute\nHouse Bill 150.\nWhat purpose does Representative Sainz rise to make a motion?\nState your motion.\nMotion to waive the rules so that a bill can be read and referred to committee\nOn the general park will read the caption\nOn number of house resolution\nCreating the house study committee on geographical distribution of state employee workforce\nOn the gentleman's motion that the rules of this house be temporarily suspended\nto allow a bill to be read for the first time in a signed committee. Is there\nobjection? Is there objection? Chair, here's none and it is so ordered industry and\nlabor.\nAll right, we're going on now to announcements.\nFirst of all, first of all, we have birthdays tomorrow, tomorrow will be the birthday of\nChairman Matt Dubnick, happy birthday, Chairman Dubnick.\nAnd it will be the birthday of Representative Pedro Marin.\nHappy birthday.\nNow we're going on to announcements, Chair recognizes Chairman Allen Powell for an announcement.\nThank you, Mr. Speaker.\nTo the members of the House Regulate Dendish Committee,\nwe haven't sent out a notice,\nbut expect a notice for tomorrow.\nWe're going to have a short meeting\nto move a bill forward in the Committee of Resolution.\nSo if you all would, please check your emails\nand check into the office tomorrow morning,\nwe probably won't have it before lunch.\nSo that way, if you want to take a nap.\nThank you.\nChair recognizes Chairman Hatchett for an announcement.\nThank you, Mr. Speaker.\nThe majority caucus will meet tomorrow at noon, which will be served tomorrow at noon,\nFloyd Room, Twin Towers.\nSenate Bill 115 will be postponed to the next legislative day.\nbill 164 will be postponed to the next legislative day. The chair recognizes the\nmajority leader of this House of Representatives for a motion.\nMr. Speaker, I have a motion in my pocket that I've been waiting about 38 to 39 days to\nused. Should I use it now? Don't tempt me. I understand. Miss\nBig Eye moved that this house stand adjourned until 10 a.m.\nWednesday March 31st, 2021. The majority leader has moved\nthat this house be adjourned until Wednesday March 31 at 10\no'clock a.m. All those in favor of the motion will say aye. Those opposed will say no.\nIt's a close call. Have it. We may put it on the board. Actually, we won't. The eyes\nnew habit. This house will be adjourned until Wednesday, March 31 at 10 a.m.\n",
  "updated_at": "2026-02-12T13:21:18.403308+00:00"
}