{
  "video_id": "ckRUJ5P9YOI",
  "url": "https://www.youtube.com/watch?v=ckRUJ5P9YOI",
  "title": "8/30/23 Senate Study Committee on Truck Driver Shortages",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 112,
  "summary": "Here is a structured markdown summary of the Georgia Senate Study Committee on Truck Driver Shortages session on 8/30/23:\n\n# Georgia Senate Study Committee on Truck Driver Shortages (8/30/23)\n\n## Overview\nThe session focused on the truck driver shortage in Georgia, with an overview of the state's economic growth and workforce challenges. Key discussion points included the high number of job postings, the mismatch between unemployed Georgians and available jobs, and the specific need for truck drivers in certain regions.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Chairman Sen. Nimbila acknowledged colleagues and thanked the Paulding County Board of Commissioners for their engagement on transportation issues.\n- Danielle Aperia of the Georgia Chamber Foundation provided data on Georgia's economic growth and workforce shortages, particularly for truck drivers.\n\n## Votes\nNo votes were taken during this session.\n\n## Attendance\nThe committee had a quorum present, with several legislators attending in person and on Zoom.\n\n## Adjournment\nThe session was adjourned, with the next meeting scheduled for September 2023. A final report is due by December 1st.",
  "transcript": "you I know we have several people joining us on Zoom a lot going on today. I call it here on the We begin, I do want to open the circle and I'm going to put a commission of Virginia gallery on the spot since we're commissioned a straight up for a meeting center brief where the plan and we're going to kick off with some opening remarks and then we're getting to testimony in a moment. Come on, sir. Thank you. Thank you commissioner. I'm going to start with the first meeting. I'm going to start with the first meeting. I'm going to begin with some remarks. I do want to acknowledge my colleagues. First in the room. State Senator Nimbila is on from Gwinnett County. Thank you for driving over and hanging out today. The chairman of our transportation committee in the center. Thank you for joining us this morning. I do want to welcome everyone to pardon county Georgia. I do believe it is the greatest county in the state of Georgia. 200,000 people. I do want to thank the board of commissioners who have been engaged with the Senate who worked on transportation issues who have been engaged in transportation. The chairman and chairman and chairman for being here. All of you taking serious interest in economic development and what it means for less Georgia. and Frank, thank you, Frank, for being here. And I want to come back on your city or maybe your future city, depending on how your future plans go, like you and the Grace and the folks talk about it later. And also do want to say Grace and the power, and Tim Blake, for hosting us today, and thank you for everything that you are doing. Tim, I'm going to give you a couple of minutes if you'd like to speak and just say a couple of words. I'm a friend and before Tim speaks, I do want to have to say everyone keeps 1000 players to family, friends, brought in your sisters in South Georgia. And there's a hurricane approaching, and I know a few of us become very dangerous and I don't know being contact with after colleagues in South Georgia, and the commissioner of the King, and his mother during the storm without a community of constitutional officers who were sitting for the worst. But also to the worst thing that we should be doing, to clean up the aftermath of what hopefully one of these baddest things, but you know, prepare for the worst. And so the folks that work in like Grace and the power and the other agencies that do so much good, so many great things for all our local communities, keep them in the brunt, the brunt's in your place as we work to the next hours, weeks and days ahead to Tim, Materieta or Tim, thank you. Thank you Senator. I appreciate you using our facility today because we are nonprofit member on Co-Info. One of our major tenants that we try to live by is to be community oriented. We're very thrilled to call our headquarters now. Since our inception in 1937, we've been located in Douglasville and Douglas County. This is the site of a former 200 acre farm. So we wanted to be a good neighbor. I think we have a 52 acre footprint here. And the rest of the land is going to remain follow. We have lots of wildlife, deer, turkey, beavers, unfortunately a lot of snakes, but we're very happy to call Pauline County home and we serve almost 130,000 homes and businesses and portions of eight Metro Atlanta, Western and Northwestern counties. We're very excited about Pauline County in its future. We have more of our consumers living here in Pauline than any other county. And it is going to continue to be with just the prison, growth patterns, our largest county of our eight that we serve in Metro Atlanta. But make yourself at home. If you even want to Starbucks coffee, we don't tell this to anything, but we put in a Starbucks coffee machine for our employees. So just let Blake or myself know and we'll walk you over there. But welcome and come back and say yes. Thank you. Thank you Tim. I do want to recognize Anna Hordak from my office. Anna, let's say thank you publicly for getting this all together, working with our same staff and snake communications team, Senator Research, general one who's here today to say thank you for all your hard work and all the things that you do behind the scenes that maybe sometimes goes unnoticed. But Anna keeps me straight out here in the district and tries to keep our caucus in line. So if I'm not doing something like until Anna and she'll fix it. I do want to say I guess to our team with one of the senators, just to get's way to him or if they have a question, just make sure I don't miss anyone while I'm around the Zoom. So we're going to get started being able to pair you with the Georgia Chamber. Foundations are going to talk about transportation and kind of what's going on in Georgia. And for the first meeting, just to highlight today, we're going to talk about opportunities. We will have a second meeting in September, we'll provide that date working with Coca-Cola for September. And then we'll have maybe one more meeting before we have a final meeting. The report will have to be voted on and completed by December 1st, under the resolution that the Senate passed under Senator Resolution 155. And so we'll have one that. So Danielle, I'm going to turn it over to you and thank you for being here this morning. Well, thank you so much, Mr. Chairman, for having me. Good morning, Molly. It's good to see you. And my name is Danielle Aperia, a service of Vice President of the Georgia Chamber Foundation for the research and data arm of the Georgia Chamber of Commerce. So excited to share a little bit of data about workforce shortages that were similar across the state. And of course, about those that are specific to truck driving. So just to kind of give a high level of review, I'm sure this is not news to many of you, but we want to certainly highlight the fact that we've had four years of record economic growth. And of course, Governor Kent just announced yet another year of record economic growth. And I think this certainly can't be understated, especially we've seen other states across the country struggle to rebuild their economies coming out of the pandemic. We have been able to see opportunity across the state in terms of jobs, investment, you know, all the things that we've been eager to have. And of course, as a statewide chamber, we think it's incredibly important that we've seen 77% of this economic activity outside and metro and rural communities, because we certainly know that the future of our state depends on economic growth that covers all corners of the state of Georgia. So that's a great reason that we've got tremendous growth, tremendous opportunity. But we certainly do have some challenges. And specifically, as we're thinking about workforce shortages, we've actually been tracking the number of job postings since 2020 back in May to kind of make sure that we're tracking and able to understand what's going on in the economy. So on the graph here, you'll see we started in Q1 in 2021. You'll see there's certainly been some dips in variations. That big dip was the Delta variant in August of 2021, big spike backup. And you'll see that we've leveled out a bit to for the past few quarters with around 350,000 job postings. So what I think you know is that since we've been tracking this since 2020 registered nurse and software developers are continually the top posting that we see. We've also seen tractor trailer truck drivers in this a number of times it's kind of dipped down to number five or six right now, but we look at specific regions of the state. That's when we'll kind of see a pop back up to that top three, especially those that are a major logistics quarter or doors that you can think about. I think some other key points to mention about this is that we have a little of 170,000 unemployed Georgians. And so we're thinking about 170, that's certainly not 354,000. So certainly just getting those unemployed off of the unemployment ones and into jobs will not need our workforce needs. We have to really think strategically and innovatively to make sure that we're able to get individuals into those hygiene and jobs. And I think a huge opportunity with that is thinking about maybe those that have chosen not to engage in the workforce. Of course, unemployment rate doesn't capture those that are not currently looking for work. So that's why we like to use the labor force participation rate. And you'll see that they're nearly 40% of individuals that are at working age that are not engaged in the workforce. I have to get questions about who are these people? What are they doing? Can we find them? If we could, I think we would love to make sure we're putting them on a technical college programs. And I think that's certainly the opportunity. There is data available about unemployed surgeons. And we've got about 55% of those are women and 45% are men. I think the most interesting thing is the largest share in terms of like an age group is the 25 to 34. There's around 25.6% of those that are unemployed are in the 25 to 34 age group. So we're thinking about folks that are starting to be able to get involved, that maybe don't know quite the best places to go. So talking a little bit more about labor force participation rate because it's something that this isn't new. And I would say certainly our challenge shortages and workforce shortages are not new either. We were starting to see these prior to the pandemic, but certainly the pandemic exacerbated those impacts. So this graph goes back to 2000. And our labor force participation rate actually peaked right before 2000, like the late 90s. So you'll see we've got that big bar graph. And obviously that was the great recession. We've got that skinnier bar graph towards the more far right. And that was the impact of COVID. So we've got some dips, but again, this kind of a downward decline in those that are engaged in the workforce. So again, as we're thinking about where's the challenges or where's the opportunity? We've certainly seen this downward progression, which isn't helpful when we know that we're increasing jobs, increasing opportunity. We've got companies that are relocating the state, companies that want to grow, but they can't necessarily because of availability of workforce. So again, just to highlight from some numbers, but we are expecting by 2032, so a little less than 10 years to have an increase of over 2 million jobs in the state and an increase of 1.2 million citizens. So this is really the opportunity. I think we're currently seeing workforce shortages across the state and every industry, every skill level. But we know this growth is going to continue. And we know that it's something that we need to make sure that we're again thinking creatively and innovatively about how we build our talent pipelines different in order to meet our current workforce shortages. But those that we know are going to increase, especially when we think about retirement risk, how our individuals changing understanding will have some baby boomers that are looking to retire in the coming years. So of course, we're talking about truck drivers. So we wanted to also include some projections around freight. Of course, we know what HUD is for its data Georgia for logistics. If you're thinking about the Port of Savannah, friends like course on gravel, railways, and imports all this opportunity, but we are seeing tremendous growth, especially as we look to bill long term. So a 92% increase in freight flow rate times by 2050, the ports are also expected, major increases in TEUs, regard in both to over 20 million by 2050. And in terms of warehouse distribution, so online shopping, we've come so accustomed to, and certainly increasing our demand as well. You can see 10-inch increase by 276% in value by 254%. So again, as we're thinking about, all those needs, we know that the logistics and infrastructure is going to play a critical role on how this takes able to grow long term. So I do want to provide a little bit of data around specifically those workforce shortage for tractor-trailer truck drivers. You'll see a little over 25,000 postings for jobs over the last few months. So this is a real-time labor market data that we utilize. I will say though that that 25,000 is just the individual posting. So often companies will have one posting, but they'll apply or hire like three or four people for that job. So the limitation of the data, but it's kind of the most available we have. So I would say it would certainly be under 25,000 individuals that people are trying to hire. We'll also see that we've got almost 2,000 employers are competing for this talent. So as we think about, you know, that we've heard folks leave, you know, for 50-cent increases and things like that, there's a significant challenge to get folks on the ground and to make sure that we're able to build up our workforce in the way we need to. One of the 6,000 hires per month. And I also wanted to include those age demographics because this is an area where we see retirement risk planning role. Obviously when you've got nearly half of those jobs are, you know, over 45 years old, it presents a significant challenge to make sure that we're getting folks into the workforce at Ian Grayage. Of course, in order to have a CDL, where you're able to cross state lines, you have to be 21 years old. And so that is a challenge and probably why you see that lower side on the 19 to 24H gap. It's like see, you're good. Perfect, thank you, Lexi. So I also wanted to include making an ex. This is an area that we hear about a lot, not just the sector, trade or drug drivers, but of course, is where they got logistics. Where do we go from here? This is an area we continue to see opportunity and growth. And so you'll see that information too. But again, here's where looking, you've got a significant number of individuals that are over 45 years old. And some of us were thinking about how to make sure that individuals in our high schools and middle schools are aware of these opportunities, aware of the salary, career advancement that they've got in some incredible industries that will provide them a high quality of life and a good opportunity over the long term. So I'm so happy to take any questions or sharing additional information. But again, I appreciate the opportunity to be with you all and to share a little information that we're monitoring. Thank you, Daniela. I'm going to start in the Zoom. If there's any questions from Senator Dozall or leader Guch. Hey, good morning, Chairman. And thank you, Daniela. The percentage over 45, that actually seems to kind of be the median workforce age anyway, 21 to 65. So how does that compare? Is that an outlier with other industries? Because actually 40% to me is not over 45 does not seem out of line less than missing something. But certainly, I think that we see certainly when we kind of look at this nationally of how do we compare to other states? We've got a tool that shows us kind of that retirement risk. We're slightly above the national average in terms of how they monitor and see some of those retirements. Of course, we are seeing people work longer. And I think that's something that will continue to monitor if individuals say, I want to work over 65, we're not close to 70. So it's something that certainly isn't, you know, we don't have to retire at 65. But as we think yet, individuals that are older, they may want different kinds of benefits or flexibility. And so it's just something to be mindful of as we think about our long-term workforce needs. And as it relates to the under workforce, Mr. Chairman, it's okay to ask one more question. Can I take a time? We have time. We have worked with Georgia Highway contractors in the state to provide simulators in a number of high schools relative to heavy earth moving equipment. I know there's similar simulators that are available for aviation, but also for truck driving. Has there been any pilot programs that, you know, have been Georgia specifically targeting training high schoolers? So I know that they're not eligible for interstate, but interstate, I believe they would be even the following graduation. Are there any pilot programs that you're aware of to kind of get them plugged into the workforce? You know, I believe the Highway Country Program too, it's the phenomenal program. I know we've got some partnership with BProB, be proud, and we certainly are kind of doing outreach with individuals on making sure people understand those opportunities. I know we've got a number of companies that are making investments, but I don't know if they're making it specifically on that like middle and high school front. But I'll certainly kind of do some research and we can get back to one of those as well. Thank you. And I'll just throw out a data point out loud. The Chairman Dozo's point about the heavy equipment operator pilot sites and virtual training. So basically 15 schools and on average, per side the cost is about $400,000 investment. And I know they're working to expand that. So I think that's probably something that probably does go in a greater and further conversation in terms of how do we support these across state? Thank you, Chairman Dozo for raising that. Any other questions? Senator, is that you guys are good? Yeah, I wanted to apologize for getting on light. I had to finish up a meeting this morning in my office. Really regret that I could be there in person. And your presenter may have already touched on this and you may have other presenters as I'll talk about it shortly. But the biggest complaint I hear around the state from literally in every industry because every industry is touched by the trucking industry and the trucking shortage, the drivers and all, but there seems to be a huge slowdown in the barrier to entry because the training requirements are so lengthy, it takes way too long to get a person certified to drive these trucks regardless of experience. I think there should be some consideration at the federal level. It has experienced driving trucks or heavy equipment. They probably don't need the same amount of time in a classroom and learning how to get their CDLs, somebody that just came out of school, never been behind the wheel of a car greater than 6,000 pounds. Is any discussion on that being held today? Certainly we hear from a lot of companies, especially on that, you know, 21 age. I have heard that previously some training was able to do on-site and employer sites that were restrictions with the federal rules. But I think there's certainly the opportunity to consider one of those opportunities within training. We will have those flexible relationships. I know we've gotten lots of member companies that are doing significant work with our universities in technical college. Make sure that they make it as fast and easy as possible. But certainly having more of those will probably be beneficial all around. Thank you. You want to follow up on that too, if you don't mind chairman. So the CDL requirements are mandated by the feds for interstate. But can we not relax some of the requirements to training requirements for truckers that are going to stay in state? So primarily your truck drivers, your small business people that are driving dump trucks and equipment trailers that really don't need to worry about going cross country. They don't have to have the same driving requirements that those truckers would have. Anyone doing anything on that? I was in. A few weeks ago in chairman, Larry Walker with his occupational licensing study committee. Some scientific materials passed out. I found a class over this. I mean I got abild whack bag filled with paper and it was there. We brought that up誇 about those opportunities. Might be good cost over for for both of these study committees. Literally, I know they're having the. Some considerations of how do we think about the city毋 despite photography. And have some flexibility there while we wait for some action in Washington. to the number of people that are truck drivers and the different age ranges. There is a differentiation between like full-time employees and independent contractors. So our data just kind of aggravated and break it down for those two sectors. Got it, thank you. Yeah. Thank you, any other questions? Danielle, thank you. I think the problem does want more discussion. We may even hear more of it today from some of our speakers just in regards to I think we've increased federal burdens that we're hearing around CTO driving and training and the federal government continue to want to just keep showing things down our business understrived some drivers. So I think that'll probably want more conversation. But thank you for coming out here today. Thank you for everything that you all do for Georgia and local businesses. Well, thank you again for the opportunity. Thank you. Except we're going to have a Commissioner John King. These are insurance and fire commission, safety fire commissioner. I think the last time we got together, we gave them a lot of grief down in middle of Georgia. So I think it's my turn since you deserve every bit of it. I think the second person that was John, I go way back, well, practically, but I guess I was a city councilman and a place to be from, you know, a really good job. I was at the time. I mean, it took political punchouts right in the road zone. So this guy came in with Android and this one I think you from what you do is a country with us to team with all of them. We've talked about it, but all the stories and I think personal experiences you've had as a police officer, but also, you know, somebody served in the Army, you know, worked out there, and he's become general and being on the battle and really in the middle field and those things and taking those experiences in terms of dealing with natural disasters and everything that you have in your crew now today, leading our state. So thank you for being here and talking about this important topic. Thank you, sir. I appreciate the opportunity to have this conversation today because I think this is probably one of the biggest challenges that we're facing in Georgia. And again, many folks might be warned or why is this state insurance and safety fire commissioner testifying about trucking in shortages in Georgia. Well, I will tell you the answer is relatively simple. There is no trucking industry in Georgia. If we can't find affordable insurance, I mean, that's the bottom line. Hey, you know, I know that, you know, some of the questions that got brought out today, as far as, you know, the requirements for trucking by the federal government, but there's an additional requirement. Insurance companies put some tremendous requirements on drivers. They have to have so many safe miles under their belt before they'll even willing to sell insurance. And so, you know, we last, early last year, senior leader of the legislature asked me, hey, we can look at this. What is the problem? Why we're having such many problems, meeting insurance and what can we do? And so, I had our team. We have incredible bunch of folks at when it started looking hard at the data, up to the folks in the chain, we're talking to the trucking industry about what are the root causes and what are the things that we could do as a state to try to bring some relief. And it was the immediate recommendation was that I wanted to discuss today with you. The one clear, the quickest thing that Georgia can do is repealing direct action, the direct action law. And what is direct action? Georgia's an outlier. Only four states in the nation have direct action. Other states that we shared this issue with Louisiana who's insurance marketplaces are wrecked. The part of one of the worst in the nation. Wisconsin and Kansas. So Georgia's only one of four states in the nation that allows this action to take place. So, none of our immediate surrounding states, South Carolina, Tennessee, Alabama, Florida have direct action. And so, the incredible amount of pressure right now in our industry is occurring in, our neighbors are catching up very quickly. We brag about Georgia being the number one state to do business in what our states around us are catching up. They're watching for opportunities and they're taking advantage of that. This is sad. California and New York have better protections for trucking companies. That's not something that I'm terribly proud of. Georgia does not allow, Georgia does not allow and ensure to be named as a defendant in any part of their business except for trucking. So, in making this, the only the trucking industry subject to these kind of requirements where an insurance company can be named as a name defendant on any lawsuit. No other company, no other mine of insurance. This is an outlier. In fact, in fact, mentioning an insurance company on any other kind of lawsuit can lead to a mispronouncement. So, why does Georgia have this, why does Georgia have this law? The most common argument in favor of direct action is that it's often necessary for finding and serving trucking company with papers on a lawsuit after an accident. While this might have been the case back in the 1930s and 40s, where we can have a Department of Transportation and people did not have to register their trucks, their drivers and all the federal, not only the federal departments, but also state requirements, that is not the case today. Commercial motor carriers are required to file a more proof of insurance with the federal government. That information is made available to the public instantly. There's a strict reporting requirements after an accident involving a commercial motor carrier, including detailed information on the carrier and it's the insurance provider. I know the folks at the motor trucking association are here and they will go.\n\nbut to probably greater detail on these requirements. So I'll let them provide that function. The fact is any competent lawyer, and I have to have confidence in our law schools to produce quality lawyers, do not need this problem for them to be successful in court. So again, why do we need direct action in Georgia? Simply, it's about the money. It lets lawyers have a direct advantage. Why do you, you know, this is one of the quotes from insurance from law firms that assume trucking companies. Why does Georgia direct action statue matter in a truck accident claim? When a jury understands that there's a giant commercial insurance company is responsible for the damages they're far more likely to issue a larger award. That's the bottom line. It's that simple. Defendants and direct actions won't keep it on the books because at least they're larger jury awards. But this is a problem. Large jury awards of large losses against insurance, large losses lead to higher insurance premiums for trucking companies. And higher insurance premiums make it more difficult to start a business and to remain in business. This is especially true for smaller trucking companies veteran and minority owned. It cost an average of $17,000 to ensure one truck in Georgia today. That is prohibited. Nobody's going to be able to start a company that does trucking in our state with that kind of cost. In addition to all the training and all the other things that insurance that a trucking company has to do, it is costful, evicted, and it especially affects better and only minority owned businesses, which is something that are taken in incredible interest in trying to promote. While it's easy to use the big bad insurance companies as the villain, the truth is commercial auto hasn't turned a profit in Georgia in 10 years. Higher insurance costs for trucking companies also lead to higher shipping costs. And those costs get passed onto the consumer on every product that gets moved across our state. And that leads to more expensive products. I want to be clear for one thing. I'm not advocating for change on behalf of the insurance industry. I have been very capable of holding insurance companies accountable. Issued the largest fine against insurance, it gets an insurance company in Georgia history on our health, for an in health insurance carrier. In the past legislative session, we passed a bill given our office additional authorities over rate approvals, over the objections of the industry. We force a car insurance company to pay full taxes for any vehicle they received a total loss. And we just forced a home insurance company to retract thousands of non-renewable notices. They had been issued illegally. So I'm not shy about holding insurance companies accountable. I want to make one point very clear. Repealing direct action does not, does not cap judgments. It does not keep somebody from getting their fair day in court. And it doesn't, and only does is treating insurance companies just like any other business in our state. It's about fairness. That's the bottom line. Repealing direct action is not also a silver bullet. It is not going to magically drop all our insurance rates. We have inflation, post-pandemic supply issues, weather events, and high rate of auto accidents in our metro areas. Those are factors, but repeal direct action will be a significant factor in bringing companies to the left of the state or have reduced their activity in our state to return back to the market and compete for your business. If we want to continue being the number one state to do business in the nation, we need to have fairness in our legal system. While there's much larger conversation that we had for other lines that we need to have reforms in. And the governor understands and he's come in support of one of these one of the strategies to try to bring fairness into our court system. And I'm proud the governor camp has signed on and understands the impact. As this committee continues to study the factors impacting Georgia truck driver's orders, I would ask you to seriously consider a full repeal, a recommendation for the repeal direct action. Which you do be doing everything in our power to encourage job creation. Repealing the law that negatively singles out Georgia trucking industry and drives up cost for all of us is a good place to start. And I thank you so much for your time. And I'd probably like to ask you probably Senator Goucch's comments and one of the strategies that we've pursued is going after a young man and women who are leaving the military who've been in the transportation industry. If you can pull a 72 tank on the tank trails to Fort Stewart, Georgia and you present your logbook, you ought to get credit for that. And that is what our conversation is with in Georgia's companies to allow those materials to be taken for credit because it's not just sufficient to have a CDL license in Georgia. You also have to have a number of miles under the supervision of a trained driver before in in Georgia's companies were willing to approve a driver's operator and to be in Georgia. A good comment on the use of simulators. The military is used simulators for almost every line including truck driving. And so we're trying to pursue with the technical college of Georgia to have a training course where we can group the information of the safe miles under supervision of an instructor or a simulator that should be given as part of a credit for the insurance companies to give credit to a young driver so they can have safe miles under a belt so they can be in short. Well, that, our pause and try to answer any questions that they have. Thank you, Commissioner. Senator Genshield, your hand is. Hey, thank you, sir. Thank you, Commissioner King. We appreciate your passion and your hard work and what you're trying to do. And as you know, the Senate has been leading the way on this issue for about four years now in different areas of tort reform or civil justice reform. And we, we completely agree, I do personally. No senators out of attorney and dole's all too have worked on this issue. We want to make this one of our top priorities next year in the Senate. Every trucking company I talk to are repeating the same thing you've been talking about. One of the things that the people on the other side of the issue are saying is regardless of direct action, it will not impact her premiums going forward. They're saying that can you guarantee our premiums would go down? And I sort of laugh at that. I said, can't guarantee they'll go down because I don't control claims, but I can guarantee they're going to continue to go up. If we continue to see these runaway jury verdicts in the tens of millions of dollars for a frivolous lawsuit. And so can you address the comment that the, the naysayers are going to throw back at us saying that this will not lower premiums for trucking companies and which ultimately it gets passed down to the customer and the consumer on every situation. Thank you so much for that comment, sir. And you're completely right. There is no silver bullet. This is a very complex question, but I will guarantee you, corporate is not writing as much in reducing the products with less competition in the marketplace. Your rates will go up. Because only the large carriers will be able to, I mean, on large carriers can diversify their insurance by having surplus lines, having a number of ways to that there can, you know, something short to a certain level. With a small minority arm, better than a company that wants to start into this industry with one or two trucks, there is no way they can start off. And I think that's not the Georgia way. I think we ought to be, you know, trying to level play a field. And the fact that Georgia's only win a third state in the nation that has this. And so the states around us are taking advantage of companies, are selling Georgia companies are slowly reducing that the number of policies that they're, and we had 6,000 policies non-renew just last year. As we, and this is a lot of big indicators, but then we tend to see, and they're going to be selling the same product. And so it responds, and it's an easy way for the opposition to try to get us to prove a negative. And because, yes, I'm not, it is not a silver bullet. In the public, I can guarantee you there with less competition, the cost to the consumer for every product that gets delivered to your home will increase. Thank you Senator Gage. Senator Dozalde, have anything. Thank you Commissioner. Appreciate your testimony. As always, you've worked hard on this issue ever since you were appointed and then elected. So thank you for that. I'm curious, as it relates to that one data point that could be helpful with the know, how do our premiums compare to those surrounding states? Is there a way for you to do some sort of apples to apples comparison to maybe give us a trend line? When you're up high, we're one of the highest in the Southeast. And in our team can pull the data, we'll be able to make that part of the record. But companies are, companies are very, very, so what we do is we do, we do comparisons with insurance commissioners of other states. And we basically go ahead and we try to price using the independent insurance agents association here, Georgia. And this is all I've advised me, the cost of insurance for a truck and then we use the same description to go to Tennessee, to South Carolina and Florida. And the challenge is it's going to be higher, but the problem with Georgia's nobody's willing to, nobody's willing to, you know, to, to, to, you can buy insurance, but $17,000 of a good example in Georgia right now is the average. It's, it's the outlier for the Southeast. It's not as, that expensive in other states. And the main reason is because of the state of Rotor. As a follow, Mr. Chairman, Commissioner, I know you mentioned when you testify before the Transportation Committee on Direct Action, that I believe you said we were down to three carriers in the state for trucking. How does that compare to five years ago or 10 years ago, or some period of time that you could help us understand what, what's happened in the state? The three major carriers are doing, but what they've done is, is what they're squinted, what they're doing is a lot of, you can find insurance with other carriers, but it's so cost prohibitive. It's like trying to buy, you know, a surplus line insurance, like for the coast or for, you know, and so you can buy insurance, but your price is that. It's a large company, you know, a large motor carrier, they has a presence in multiple states, can structure their insurance risk by, for example, self-insuring, a portion of their risk up to so many million dollars, because they have the capital, but if you don't have the capital, you can't even enter the market. And so what we're seeing is, I talked to a young veteran, the one who started logging in, trucking company down to Southwest Georgia. He was having a grown partner with another company, pay him a fee so he could get insured. And so that's, you're not gonna be with the man that we have, and a T's center of the tower, or another TiteFombs in, in Northern Georgia, or for a C commercial driver's license, without this man endorsement, starting pay for a driver is $89,000. So, winning employees' officers to go on a drive trucks. And this is the pressure is intense, and of course the drivers are hopping from one company to the other. So the pressures on the market are tremendous. I know I'm the insurance commissioner, and I'm not trying to protect the insurance industry. I'm trying to make sure that Georgia has an industry that moves our commodities across our state and not crushing the consumers, but focusing on startups, especially veteran owned and minority owned companies. They can't even enter the market because they just don't have the capital available. Thank you, Sarah Islam, do you have anything? You're good. I'm sure thank you for being with us this morning and safe trials. I know you're headed to go do some work and help those with the storm coming as we speak. So thank you and to your team be safe. Thank you so much. Thank you, we're seeing you. Thank you. Our next step we are going to see a fellow of Taylor Transport in Bartow County. Come on up. Thank you for having me and by no means am I a speaker. But only to what the insurance commissioner was saying or ask kind of where I was going, the thing here is the tort here is killing us. The nuclear verdicts are killing us. And that's the me personally. I don't have no data, but I'm just going to tell you how I feel and zone it. The reason we're having a truck driver shortage is anybody sitting in this room, they get up getting a car and they go to work. They do their job and they go home. You hire a truck driver, it takes them a half a day to fill out our application. Everything's scrutinized. Then you just say after he gets hired, then we as a company have to put in twice as much as the Feds require to cover us to protect us from these insurance from the lawyers and stuff. And that's I would say, why would you put yourself in that position? Even though he said you only can start 89,000 dollars a year. If you wait, if you wait up, why would you want to put yourself there? And I think a lot of the reason we don't have drivers now, is because they don't want, they don't want to put yourself in that position. And you know, that's the kind of stuff that we have to deal with. You know, right now, just because you have applications, they have to meet the federal criteria and our criteria. So that limits it to, you know, number of drivers you can hire, but it gets back to you. You have to protect yourself because, you know, there's even been suits that suit the people that hired them. You know, so it's a big problem. And I don't know that you can change any of the rules and regulations, because it's federal. But you know, and another thing that really hurt the driver situation was ELDs, when they started in 2018. Everybody's been driving down the road, and you know, you might get a little sleep, people over, get your cup of coffee. Well, the truck driver used to could pull over, log out, take a nap, two hours later, wake up and go, start it, you know, you can't do that anymore. Once you start, mainly you have to go. So there's a lot of things that, they've made to call it better, but some's better and some's not. So, and, yeah, we think that's the reason we're having driver issues. And, and for us, the young people, you know, that's the catch 22. I mean, the thing about it is, how many, 20-year-olds do you know that you put in the truck? You know, and I'm not going to say there's none. My fact, there's two sitting right back there, our owner and president, and vice president, that started young. I mean, I think that's not a thing. And, I mean, I think, that's not what you, they're few and far between. I had, I got two kids. I wouldn't have put me to one of them in a truck at 20 years old. So, the young part is going to, you know, I'm not saying, I'm not against it, don't get me wrong. But, back to the point, you have to protect yourself. You need somebody that is. job and to do it safely. And I'm not saying that there's not any out there, but I think that's something we're going to have to tread lightly on going forward because that seems to be the top to getting younger people in. And we could hire younger people with less experience because we are not in conventional insurance, but we choose not to protect ourselves. We do ever once in a while, but it's a very special person, or maybe he has been to another company and work a year under their training program. And then, you know, we take that as a better training. So before as the driver issue, that's just part of what I'm not thinking is, but still we're going our court is going to bear a problem. I mean, we're going to have to get something done about these as a billboard attorneys and waiting. I mean, you know, we have people cool out in front of us purposely. You know, we do a lot of Metro Atlanta, you know, how people do it to get hit. And if you have a fender bender in your car, you fix your cars and you going about your business, you have a fender bender in a truck. We've got, we've got to suit papers within 24 hours. And, you know, you had, you know, $2,000 worth of damage point both vehicles. So that's, this is a big thing that needs to be addressed. And, you know, when Georgia is above California in the suit levels, that's a bad situation for us. So that's my feelings on what we have going here. If we could get some help on it. I mean, let's come up a couple questions I have and then we'll go to the zoom. I can't talk about what those impacts, you know, how does that impact directly? You'd be normal to run your own business to, you know, support customers. And then second one, can you talk through just to get on the day in the rife of a truck driver? You know, the peer companies are working all industry, similar size business to you. Well, what does the experience like in terms of the training if you compare the private sector to the public sector, you're using, you know, a vendor training or whatever. I mean, not be vulnerable, just I know there was some really garrimding road bad stories of, you know, training people, but then, you know, they can withstand a job for 30 hours because they really have not a backup of a truck or those basic things. Can you talk a little bit more just in terms of what is that direct impact on your company being able to really operate day to day? Well, and that, that's up to one of the things, for as the federal government, if a driver has a driver's license, they consider him a driver, but we as a company require a driving test or a road test to verify the person can drive. And now, for training, we don't have the capabilities of doing any training because we don't have enough employees. We made some training from, we're very versatile in our different scopes of our business. So some of our guys go from one to the other, they want to come off the road or go on the road. And so we train that in house, but for as the driver training, we, we, we generally just try to hire people that's already trained and, and, uh, ready to go. Got it. Thank you. Senator Gates, Senator, does all any questions? No, just, I want to just thank the gentleman for being here today and we, we feel your pain. I have a business as well, and I received a letter from my insurance carrier back in June that they will no longer provide insurance coverage for companies inside of Georgia after next year. And so I'm one of the people that are going to be looking for a new insurance carrier over the next six months. And so, uh, I'm going to do everything I can to help try to write the ship and not, uh, in a, in an extreme way. I just think we need to look at the facts and the data like Senator Dova's office said earlier, and let's compare apples to apples between Georgia and other states and try to figure out why we are where we are. And I think a lot of the issues, you know, we're talking about torts and we talk about jury verdicts. A lot of these cases never make it to a jury trial because the insurance companies don't want to spend hundreds of thousands of dollars or millions of dollars in fighting these cases that end up being settled. And so they settled before they ever go to court. And that also drives up our premiums and drives businesses out of our state. And it drives insurance companies out of our state. And so we definitely need to take a close look at what we can do to be like the other states around us. We don't have to be, uh, to the extreme on either side, somewhere in the middle on this one, I think. So thank you for your comments this morning. Senator, does all you have anything? You're good. Senator is on. Well, thanks for coming by and telling us your story and I'm sure we're being in contact with you as we, this committee evolves into where we're going. And call it up next with the Georgia and Medvedracking Association to talk about what's going on in the room today. How are you? I'm well, sir. How are you? Hey, Senator, Mr. Chairman, thank you for having us. Thank you for taking the time to look at this important reduction. Let's see, what do we want to do? All right. I just want to say thank you to the real life senators and the online senators. Thank you all for taking the time to listen to us here. You know, a lot of actually what I want to talk about is already been touched on. I might get a little more granular on some of the data, some of the information and, uh, and then be happy to ask answer questions. You've already heard it from Senator Gusion from others and we call it our driver shortage because it does affect everyone in Georgia. Let's see, how do I drive? All right, drive for me. The first thing I want to do is show you a misleading chart. And I say it's misleading because you see that straight line that goes from one data point to the other. That is not the truck driver shortage. That's not what it looks like. The truck driver shortage is growing, but it looks more like a stock market chart in real life. That is, it goes up, it goes down. In different sectors, there may not be a shortage right now today. At different times, there may be less of a shortage. When the economy slows, there's less of a shortage than there is, you know, at other times when things are going great guns. And so the idea that there's a straight line for us to deal with is a little bit misleading if you'll move on. I do want to talk on a couple of things. I want you to see that these are actually good jobs. We're talking about you already heard somebody mentioned 89,000 at the tank farm. We'll talk about that. But it has many facets and it has many inputs. It's an employee shortage and it's an entrepreneur shortage. And again, that's something we've already touched on. Trucking has always had a foundation of men and women starting their businesses, starting small companies. Some of them make it, some of them don't. But it's an integral part of the trucking industry. There's one, two, and five, and ten truck operators that are the backbone of freight movement, the backbone of servicing the economy. And they are getting killed. They are getting wiped out. It's getting tougher and tougher. As you've already heard, for them to get started. And again, I didn't mean to focus on tort several people already have, but we'll certainly touch on that in a minute, if you would. Some of the problem that we have is actually a demographic problem. We estimate there'll be 80,000 drivers short in the United States, but we're not unique. We're not alone. As you can see, others are short. China, of course, that 1.8 million is because they basically killed their own population for decades. And now they find out that not having children is a bad idea. So they're way short of what they need in the workforce and they have all kinds of issues. But everywhere else in the Western world, we have the same demographic issues. This is something we touched on earlier as well. Senator Dollars, I'll ask about it. This is the kind of information I think you were looking for. You can see that trucking skews older than most other industries. You can see construction, professional business, and all U.S. industry on average, much younger workforce than what we have in the trucking industry. So the retirement risk is much greater for trucking. And then you'll see at the front end, the entry point is much lower. That lower number of people in that 20 to 24-year-old is a real issue for the industry. Part of that, you can't really affect at the state level because it is that ban on under 21 operating in interstate commerce. I believe it's 48 states that allow 18-year-olds to drive tractor semi-trailers, class eight vehicles. They've been doing that for forever. And the idea that 18-year-olds can drive trucks is not new. And as the gentleman said before me, you don't want every 18 or 19-year-old that you need driving a truck. But there are some who are capable of it. We're not even allowed to talk to them. Unless we have a strictly intrastate job, they don't have an opportunity. And that's one of the reasons you don't see a big push for simulators at the high school level. Most of those people have got to come out and find something else to do before we can get serious about them 21, 22, 23 years old. I would point out that in Europe, you can drive a commercial vehicle, full-size commercial vehicle at 18. In Mexico, you can at 18 and in Canada, you can at 18. The US is a real outlier in banning them until 21 for interstate commerce. But you can see where the risk is demographically. And our concern is that our truck driving workforce is aging is a more aged cohort than in other industries. And the same holds true for the mechanics as well. These are comments from truck drivers about what are the reasons it's tough to be a truck driver. What discourages them? Truck parking is a big one, detention and delay at customer facilities is another. You heard the gentleman before we mentioned the ELD mandate. You also heard him mention billboard lawyers. And you know, there's real truth to that. You know, truckers have a tough job. There are not many other jobs, especially safety sensitive jobs, where you spend your time around amateurs in your workspace. You think about it. The trucker goes down the highway and he's surrounded by people who aren't train drivers. They just pass the license. And they're zipping in and out. They're doing whatever. And the gentleman who said that some people hit trucks on purpose was telling you the truth. Some people hit trucks on purpose for the chance of a big payday. There are people in jail in Louisiana because it was such an organized event down there, even the attorney's got thrown in jail. Because it's known to be a lucrative payday. And having folk advertise as you drive down the highway that, hey, you're an evil person, you should be sued, doesn't encourage a lot of people to get into the industry. So that's part of the problem. And then it is a tough job. It is a difficult job to do. And of course, related to all that is the insurance cost and availability that you've already heard about. And we can go into that a little more. There are firms, some well known like nationwide, that has left the Georgia market and won't write for trepors anymore. And there are other firms that say they're still writing Georgia. But as the commissioner alluded to, they go way beyond that $17,000 per year per vehicle. And they'll say they're still right, but it might be $30,000 of vehicle. And you can't really start at one of\n\nsmall business if you're paying that for your truck, because trucks don't produce that kind of margin. I do want to tell you that these are good jobs we're talking about and it's to the benefit of all of Georgia for us to get more people involved. These are the averages from 2021 LTL is less than truckload yellow famously just went out of business, but those are the hub and spoke trucking operations that move smaller than a full truckload from one spot to one spot to another. And then they break break it up and deliver it maybe even delivered directly to your home national vans. Those are the guys that are JB Hunt Schneider, the 53 foot trailers that you're used to seeing go down the highway. Van dedicated is the same thing, but it's just got a dedicated run for perhaps one company under contract. Tank local are the people who keep the QT's the racetracks that can be in store gas stations filled and other things like that. The average of all truckload carriers is now about $70,000 a year on average and the more specialized like flatbed or the longer haul LTL, which is from city to city. Are in the 70s refrigerated, which the folks delivering to your grocery store or to the factories for meat processing and that sort of thing 75 and private carriers Walmart famously is known they have $100,000 truck drivers over there. And you know, so the averages are up these are significant dollars. We have good pay for people if we can find the people and again that at 18 to 21 year old is part of the problem of finding those people. We also have good benefits. These are the kind of benefits that are being offered paid holidays, paid leave lodging meals and incidentals covered life insurance health insurance is almost 100% retirement plans in almost every industry. And you can move on because there's just more the same. And and then finally it's already been mentioned that part of our problem is turnover. Most of the turnover is turn in the industry. Sign on bonuses things like that people moving from trucking company trucking company. That can skew things though because people may leave a particular aspect of the industry and go often leave a shortage in that aspect of the industry while filling the need in some other part of it. And and just as an aside, I got you. I want you to understand how pervasive truck driving is. Everybody needs it. I mean, we're here at Graystone Power. It's a great co up. They have CDL drivers here and they have a problem if CDL drivers here, find out they can make more money being a CDL driver over the road. So they'll go off and do that. You know, that's what happens in the industry. Everybody needs truck drivers. And so we've got to do it. We can to help bring more into this industry and if you were. One of the things I want to touch on to is truck parking and I mentioned that because Georgia D.O.T. is already doing a study and doing a lot of work on it. The chart you see is evidence of a truck parking problem. The red dots are parked. This is a four day period. The green lines are trucks traveling. Now if you could get in close enough, those are individual discrete trucks. By GPS, they're tracked. The data is anonymized so that we don't know what individual company it is. Those are trucks. This is I 10 out. I 80 West rather out in Iowa and similar things you see in Georgia. All the red are trucks that are parked on the side of the road. And they're parked on the side of the road because of the big red blotches, which is where the truck parking is and it's filled. Now truck drivers have to take rest breaks at a certain time. They have the powers of service that have to comply with. And so they've got to stop when they've got to stop. And the gentleman mentioned ELDs, the electronic data record is there are. Draconian, you can't fudge it for five minutes. You can't say, OK, I'm just five minutes away from a good rest stop. You got to stop when you got to stop. And that's why you see this truck parking on the ramps. It's a problem we're seeing in Georgia that a decade ago we didn't see. But as I said, G dots working on it and I'd encourage you as a committee to encourage them to keep working on it and look at what we can do to create more public rest stops and public parking areas for trucks. Perhaps using the right of ways in and around our interstate system. Another thing that you just should be aware of is the way we pay per mile is still the pervasive, the most prevalent in the industry. Now, if you think about it, per mile becomes really, that makes a really important congestion parking things like that become real important when you're being paid by how far you traveled. So those are real issues. We're seeing more and more of hourly fixed salaries as people try to stem the truck driver shortage, but saying, OK, we'll guarantee you X amount of dollars and we'll take the risk as a company if you're less productive than we need you to be and you can move on again. And then more of the same of different types. So as you see it varies from segment to segment and basically what has happened is the industry over the years, the market has figured out the best way to pay for different types of trucking. And so as we go through that, that's one of the things to be cognizant of because in a lot of these areas, there's not a one size fits all answer. We do need to find a way to get more young people into the pipeline. I'm happy to tell you we're actually getting more women into the pipeline. You know, ladies are finding out that $80,000 driving a truck can be a lot more beneficial than $30,000 as a hairdresser. And I'm not being facetious. We have quite a few folks who were in the beauty industry doing nails, doing hair, whatever left that to become truck drivers. And about 10 years ago, less than 5% of the drivers were women. We're now up to about 10% of the drivers being women and that increases every year. So it's a good opportunity for folks, women, minorities, just anybody truck driving is a great opportunity, great career. And then we're back to that misleading chart to finish. So with that, I'll be happy to answer any questions. Good to the Zim and thank you for that. I do think at a future meeting and I'm glad you raised the discussion around public facilities and parking because I know hearing from truck drivers on the road or even some of the ones I've even talked to that frequent, you know, the truck stops in a Harrison County or on the interstate 20. I know there's a lot of concerns and a lot of them talk about that there's not a spot at one of those truck stops, whether it's loans or whatever. You know, they have high concerns about security issues and other things. I know the Harrison County Sheriff's Office is an example. We've had discussions about, you know, greater cuts in the room to get to the visitor centers and the trucking areas to help people and there's an issue instead of running our own dial, Bama and back. So I mean, there's some people may think those are small things, but you know, we're talking about this discussion and why I want to be a truck driver. I think those individuals in their families, they were these these things under mine, especially for truck drivers and sometimes might be traveling with their spouse or significant or family members while they're in the road for, you know, many things at a time. So, um, secondary gates and does our own comments or thoughts on the similar. Okay. I think we're good. If I may, Senator, please, I left you a study from the American Transportation Research Institute about bringing younger drivers into the industry. This is something the industry has been working on and I've left a copy for everyone with Anna. Okay. Well, I appreciate it. I think we'll talk to Commissioner McMillan and to see if we can get an update on what's going on with. So, and the build down just kind of the plan and I know right now we're going through those brain logistics exercise in terms of updating the freight map and I know I've had conversations with. And I think we're going to be able to get out about, you know, these two things and what's the impact on what's Georgia. So, thank you for everything you do to represent your industry. Thank you. Next up, I'm Rob Gaines with the National Federation of Independent Businesses to talk about this issue. Thanks for coming up. Well, she's getting that loaded. Thank you, Mr. Chairman. I'm 100 logins National Federation of Independent Business. We are a small business association with over 6000 members here in the state of Georgia. One of which is online now and you'll hear for him in a minute. If you want to go ahead, the good part about going towards the end is most of this info has already been covered as Ed just mentioned here. The US has a shortage of 80,000 truck drivers, which is a 30% increase from before the pandemic. And as he projected 100 million new drivers will be needed in the next decade. And I think that's a little bit of data here that we'll touch on and mentioned that it might be misleading that one on the right. But it still looks like it's increasing. And that little graph to the left is what's what are the primary factors for the truck driver shortage. And that's one of the main reasons of the truck drivers are still need to pass a drug test. And that's becoming more and more difficult. And we've been talking a lot about the minimum wage of 21. A lot of other states are lowering that, which we'll get to in a minute. And schools. There's there having difficulty getting these CDL licenses because it's so difficult to start up a school and our member on the call will touch on that in a little bit. And we're going up only 7% of drivers, but it was encouraging the here ed say that that is increasing. So that is good news. Other life style issues. They're on the road for a long, long time. And just this day and age work life balance is a little bit tough when when folks don't want to be on the road as much. Infrastructure issues. And so that's the lack of parking and truck driver stops. That was touched on that's a really big one. Criminal histories is another and there's some other states that are working on easing those restrictions. And there's a few other we could go on and on. And so we're going to get into the small business issues just in general real quick. 91% of our small business owners have a problem with inflation. So they're not being able to hire their truck drivers are not able to pay him as much. And they've been paying for more per load as you can see from our member and play. Regulations is it another big one red tape. And so we have a lot of things to do with that. But we have a lot of things to do with that. And so it's a lot of things to do with that. And so this year has done a great job of examining the problems facing small our small businesses and we applaud them for that. But if you give them out of the cookie our small businesses. We could always use more. And there's a quote by John who will. And so we have the same kind of positions to feel. And 92% of that 71% are having trouble finding qualified candidates. And if you want to go to the next one why are they having that difficulty lack of education, work experience and work ethic are the main things when we surveyed out members whether saying. We've we've talked about the problems we all know the problems. Let's get into some solutions. I want to thank the legislature and the governors and everyone in leadership for our funding. We're the technical colleges and the CD more CDL facilities that have been implemented. If you can see there Columbus technical college. And they recently opened up a new CDL facility. That's expanding the driver programs to address this shortage and funding. The governor can have some urgency education funding helped with these these schools and along with the technical system of Georgia and public public private partnerships. We look at what other states are doing in New York, the governor signed a bill that lowered it. The age from to 18 year olds to be able to. Have a CDL license as long as they remain in state. That's something Georgia can look at doing. We want to touch on what Mr. Lewis said is looking at increasing the education within the. And the technical system to maybe have them not be so dangerous on the road as as he touched on. And as commissioner King touched on let's get some more opportunities for veterans in here. Michigan they signed a bill that would require it will it's a knowledge test for CDL drivers with skills in the military that those transfer over. And that would help the shortage. Virginia they created a whole initiative it's called the Virginia ready initiative and it touches on the workforce in in general, but they partnered with the Virginia trucking association to find the needs of our truck drivers industry and to. And the workers that they find into the jobs that are open. Never good in South Carolina. Governor McMaster did a complete waiver during the pandemic. And Georgia touched on this a little bit when it comes to the weight of truck drivers, but they did a complete overhaul and just a pause on some of the red tape for our truck drivers. And it also within the bill. It required the legislature and it associate our agencies to do a complete revamp and examination of their codes to find redundancies and maybe help out our folks that are struggling with when I said red tape earlier. Also in South Carolina funding. The 17 million expansion of the program for workplace scholarships to help place. Not only truck drivers, but any any technical skilled worker. But mostly what we're looking at is truck drivers because that's the main main problem here along with some scholarships and tuition. Another one is inmate rehabilitation in New Mexico. They're off in a six month training program for inmates looking to get back into the workforce in Tennessee. They were working with third parties to. To help with testing, but also to create a commercial driver's license program for rehabilitated inmates. And this, this is, I'm going to him on this one. This is something I thought was very interesting. The governor of Arizona. One, he linked and the validity of the learners permits from six months to a year for additional training, which Mr. Lewis touched on that could be a problem with, especially with younger drivers. This could help alleviate that worry. And also. They created the Arizona Department of Transportation, I'm sorry, transportation created a third party system. If you want to go ahead, it's called. The Arizona Transportation Consultancy Project, which essentially they requested guidance from the federal motorcare, your safety administration to determine which actions would be permitted federally. They got a little bit of leniency, so they will have they were able to expand their options with third parties to provide CDLs and what is what is required by a school to administer them, but it also allowed them to collaborate with other other states to adopt similar improvements to the programs and. And I just wishful thinking maybe helping and talking with our members of Congress to be able to have these systems work interest through interest state commerce, which I thought that was a good idea. I don't want to take up too much of your time, because we do have one of my members wanting to speak about his issue, but I could take any questions if there are any. You want to go ahead with your members speak with John speak and then we'll we can go into questions. Thank you. You want to do some. This is John Sanderman. He's a member of ours at NFIB also on our leadership council. He's been dealing with drug driver issues for as long as I've known him and probably a lot longer. He works for Samson trails incorporated their charter bus system, but he'll be able to tell you a little bit more about it. Thanks, John. Thank you for letting me speak today. Sorry, I couldn't be there in person. But the challenges we face as an industry have just become untenable, especially since the lockdowns and increasing regulations, the government took the opportunity to double some of the requirements we face when having just to run our company. And they've also made drivers personally liable for some of the accidents that might they might be responsible for. I know one case of a truck driver who the young girl, a stop sign hit his truck, killed herself. And he ended up because he was 10 minutes over his a lot of time driving. He was blamed for the incident and spent a year in jail. Now he can no longer drive anymore, lost his means of living. And Georgia's done some things like that during the pandemic, the DDS created an app called the Georgia DDS to go, which is what we're required to once once a driver of a news or medical card. They're required to attach it to their license, which you normally have to go in person to DDS to do that. You have 15 days or they suspend your license. I'm going to drive a that use the app to do that because we could not go in person. The app said it successfully was attached to his license, but we found out later it was not when I had a DOT audit later, they came out that that did not happen and he had been driving technically with a suspended license, even though his medical card was valid and his driver's license was valid. And that inspection resulted in a downgrade of our company from satisfactory to conditional, which now I'm worried if I could even get insurance as the insurance goes. It's really being driven by these nuclear verdicts. I know other people spoke to that. I had a case in a school bus where a young girl was in her mother were trying to make it to my school bus. We were not moving. We were part loading actively loading students. Nobody directed anybody to go across the street. But the mother and child run across the street to make the bus because they were late and get hit by a car, which kills the little girl. She was eight. And the mother was severely injured. We weren't involved at all. Somebody else they were those are legal stuff. We were, I don't know, 40 or 50 feet away. We get sued and because of comparative liability. There is a case, illegal loophole that if you only have one defendant on the case. No matter how much I'm liable, it's even just 1%. I'm liable for 100% of the damages that are awarded by the jury. And a mock trial of that case jurors were suggesting that we pay upwards of $136 million for a case where we weren't even moving and nobody hit us and we hit nobody. And that was that eventually paid out $5 million in my policy, which resulted in my rates going up by 90%. The next year and I had to change carriers. So I went from $15,000 a unit on motor coaches to $24,000 a unit. And now I'm looking at going up to $40,000 per unit for insurance. Just because of the nature of new third verdicts in this state. And as far as driver shortages go. I've been trying to start a school to train drivers. The goal of it is to train people coming out of the military to get them. And what's most of them have driven all kinds of very large vehicles, but the military cannot give CDLs. So I wanted to start a driver training school that actively sought people coming out of the military. You know, maybe they're not making it their career. And we can train them on class B and class A vehicles. Bianca can speak to this later, but we spent over two years and over $100,000 trying to start this school. We got nothing but roadblocks everywhere we went from the state and trying to start it. Now let her speak to that when you get to it. But. The concept we all need to be aware of. There's a phrase is called limited resources are subject to alternative uses. Which that means the resource in this case are drivers. And a young person. They have options. And if the option driving a truck or a bus, you I have some that do make $100,000 a year. But if they also risk jail time because somebody else runs into them. Or because these rules have gotten so restricted. It's almost impossible for them to actually perform the job. They're just not going to do it. It doesn't matter how much it pays. We need some protections for the companies in place that don't allow for these massive settlements that just don't make any sense. So you can't just wait for the fall in county to cap county or probably the two worst. As far as jury pool selection goes. Because people get up there and they see these large numbers. And they just want to hand out lottery tickets. And you speak to any defense lawyer and they'll say the same thing. But. You know, see where else was that. So we have an in house driver training program. And I have jobs for those vehicles and we train these people and what's called the Smith system is a truck driving and actually recognize system. We had some of our own twists to it. And so we train people they get to drive these smaller vehicles and once we get them a year or so under their belt will help them get their class B license. We need a class B with a P endorsement and an S endorsement that's P for passenger S for school bus. And then later we can train them to drive the larger vehicles or 45 feet long 102 inches wide 12 and a half feet tall. So it's a large vehicle. And we just have a hard time. I've got three different agencies out higher to find people for me and and we might look at 60 people and maybe three we might try a one might hire one. And I don't even know if they'll stay with me for a month or two and sometimes I've had one guy try to park a motor coach inside on somebody's personal driveway of a home ran over a dog with tree and and then just takes off. So I had to fire that guy. So I might hire two and lose one. It's it's very frustrating because I have I was running 62 units prior to the pandemic and I'm running 28 today and I'm doing that because they don't have enough drivers. So it makes it difficult when all these things I now have to use these 28 units to make enough revenue to cover the notes on the units I can't run because I don't have people to drive them. In addition to that inflation has hit us. She'll went up like 90%. Most parts went up 50%. I have some parts that went up 1500%. So we're really just in an untenable situation. We need some help. We need some relief. And I'll let Bianca speak to how difficult it was to start this school that we now can't start Bianca you go ahead. Hello, thank you so much for having me here today guys. Thank you chairman. My name is as John mentioned Bianca Thrasher star open and I have worked with Samson tours John Samdom and the Samdom family for a number of number of years on business development and government relations opportunities. And I just want to first start by saying this is it's a family owned business generations good hard working people. It's just I consider them part of my family. So when John reached out to me to speak to the experience that he had with starting the school with the Samson tours had with starting the school. I said absolutely and I was supposed to be out of town today and I just it's like whatever I whatever I need to do to be here. I'm thankful that we're having the virtual so if someone could please show the um the document that would be great. Thank you so much. I really appreciate it. All right. Once that gets up I'll I'll continue. We can see we can see. Okay, so I wanted to talk about some of the experiences that we had in the application process. I my job was to start the school to get it going from the very beginning to then I just want to first start by saying this process started in October 2020. And finally June 2023 is when we when John just said you know what let's just back up from this because so many resources have been expended so many different just red tape barriers and I'm just going to speak to some of the red tape and the experience that I had in no way shape or form why seeking to judge DDS. I'm going to speak my truth and that's what I was asked to do with regard to the certification process. I guess I'll start in the left hand upper corner. The team with DDS was understaffed and so there were many times from the time that we got our first application from the time we first went to the website where things just didn't match up on the application that were on the website some of the requirements. And when there when I reached out to the office that I was not able to get in touch with anyone sometimes not days, but sometimes for weeks. I wouldn't get a reply to my emails. I would not get a response to my voice mail. And then I'm kind of a go getter person which is part of the reason why we work so well together and I would say look I can come out to the office I can break.\n\nlunch, whatever needs to be done. And because some people were working virtually, I was never able to get out to the office to just kind of like go over the questions, get some answers, give them what they need. That never happened. The other thing is the approval process, I'm working from the left side. In the middle of the application, there were rule changes all of a sudden. One example would be the new pilot VIN program. We've already submitted an application and then they come back and they send me an email saying, hey, look, we're doing this pilot program. So now, Samson Tours is expected to jump over here and jump through these hoops, which include various different rule changes. And then when we have questions about the rule change, then the team themselves, they don't even understand. And then I don't know, it seemed like there was like a regime change. I like to call it a regime change, but folks were replaced or folks were fired. I'm not sure which brought on a whole set of other additional challenges that we had. We were asked multiple times to submit the same documents and I would go back and reference emails and show, I submitted those documents already. So I don't understand why they're asking for them. And then because of the timeframe from 2020 to 2023 with the application process, we were expected to resubmit for fire inspections. So not only do I have to, like am I navigating this stuff with for drive pro university, which is the name of the school that we were seeking to start, but now I have to go back to the municipalities and say, hey, we need to get another fire inspection when nothing has really changed. That's one of the examples. I mean, now we need to do another business license, additional costs for the Samdiments constantly having to. And then oftentimes not through our own fault because for weeks we're reaching out to them. For months we're reaching out to them. We're not getting responses so that we can do what we need to do so that we can get approved so that the Samdiments can go on and start generating revenue for their investment in this business venture. Another thing, like for example, like the range inspection with the application, they were just new parts, new expectations, new guidelines constantly coming at us and just watching them have to go through that was just so disheartening because they're good people. They are contributing to the economy. They want to help the service disabled veteran owned businesses. They've got great ideas and they're making things happen in addition to running Samson tours and they're just getting hit with one roadblock after the next, after the next. Another thing was like the fingerprinting portion of the application and beginning part, it said, hey, look, we need you to get, you need to start the fingerprinting and then we submit them. They say, oh no, we're not gonna, we don't do it until afterward. It's just like, it was just as I would come to them and report, it would be so frustrating because I like for things to be moving progressively but it was almost where we'd fall into my lap that like, well, we don't know what's happening and that was really quite a shame. So just in doing government relations in other areas, I happened to be talking to a member of Georgia Technical Colleges and administrative team and I respect my relationship so I rather not do the name dropping but in speaking with him, he mentioned that GTC, and this could be here, say whatever but this came from their people, actually loses money from the CDL program. So that was just, I was told that, I put that on the document, I have not researched anything outside of that information that was provided to me so I don't know the accuracy but I do know that person and I don't see any reason for them to be dishonest with me. So I don't know if that's part of what was happening there but all of this amounts to a domino effect of like just economic development. Why folks are not having, you can't get a driver, if a driver can't even get it into a program and the SAMHSAs were an opportunity for a driver to get into a program and to get their CDL truck driver training license and to go out there and start contributing to the economy and building wealth for themselves. So and then I was just deeply ingrained into the process. Actually, I put together just in doing research, put together the curriculum. So our curriculum was approved. It's just all of these other just red tape, insurance challenges, I mean, it was so bizarre. Like they would say, okay, well, we need this type of insurance. So the SAMHSAs would go and they would get that type of insurance and then we submit it and then DDS would come back and say, okay, well now we need this little line item change. It could be so simple as we need this person needs to own the policy or this company needs to own the policy and these names aren't matching. But it was all the DPU, it was all the sandiments, it was all SAMHSAs and tours. And so it was just little tiny meddling things like that. At some point in time, I just, because I care so much about these folks and this family and this company, they're my own family. It was just like, are do they even want them to get this license, this application approved? And again, I don't want to bash DDS. I had, you know, when I did get on the phone with folks, they were very kind. They weren't rude, they weren't mean and they could have just been drained. But at the same time, here we are from 2020 to 2023, it should not have taken that long to get approval, especially when the curriculum, which they went through with a fine tooth cone. Once that gets approved, we're still having to submit the same, resummit the same application documents over and over and over again. So I don't want to, I don't want to continue. I certainly don't want to seem like I'm rambling, but it really was an unfortunate experience and it really was an investment that's the SAMHSAs and the SAMHSAs made and they weren't able to get a return on their investment and they weren't able to contribute to the economy and they weren't able to create this new vertical. And so I just, and then in dealing with DDS, it was like, who do I go to? Who do I tell about this? And I really didn't know. So that's part of the reason that I'm here today. I'm thankful to be here today. If anybody has any questions, I'm happy to answer them. And I hope that this challenge can be overcome soon because if SAMHSA is going through it, then other folks are probably going through it as well. And that's all I have to say. Well, first of all, I'd say thank you, Bianca, John, and Hunter for your comments, your presentation. Okay, that sounds pretty painful. Takes three years or just to do some basic things with the business. I'm just trying to already see those on or see their gauge first and see if there's questions and those are your guild. Okay, it's later ginched. Anything you want to ask? Just quick question. You may have said that's an omitted. What are the stakes you operate in? SAMHSA and tours? Well, our business is located in Atlanta near HATE Bill. But we go through, I've been in all 48 contiguous states and three Canadian provinces. So we are an interstate carrier. We primarily stick to the Southeast and the Northeast. But we go all over. But we do train people. I have some equipment that only stays in the state. Some of the school buses. So I have the capability to train people in house if I can find them. But I've even considered buying one of those LED billboard trucks which is based on an Asusu truck. And anybody with a class C can drive it. I would use that as part of the training and advertising. I think the trial lawyers know how to get in touch with those vendors. Yeah, probably. But so your business goes outside of Georgia. My question was, and I don't want you to do this, but have you looked at other states? Which states would you use as a model if you had to move out of Georgia? Which state would you move your business to? That's a tricky question. I would have to basically do a study of who's most business-friendly. And I have asked my insurance companies, where are the safest places for me to operate versus the most expensive places? Like, I no longer go to New Orleans. I no longer go to Washington, DC. And I don't go to Miami. Because Miami and New Orleans are the two most prestigious cities in the nation. I've had people run into me on purpose in New Orleans twice. And they win. They give about 30 to $60,000. For like the other guy, other gentleman was speaking, I'd have $2,000 a damage, but it cost the insurance company $60,000. And that's common. And that happens in Atlanta too. It's happened a couple of times here. But one of the things I was going to speak to that I forgot, when officers come to a scene, they have a lot of latitude as to who they cite. And an often time, what happens is they will cite only the CDL carrying driver, even though they might know that the other driver of a PC vehicle was at fault or was also a breaking law. Like, I have one case where a woman hit my school bus going well over the speed limit, while looking at her phone, there was no breaks, she just slammed into it. And but it was noted on the police report that she was speeding and distracted driving, but she was not cited for it. And when that happens and it goes to court, clever lawyers can say that, hey, you were cited, but the other guy wasn't. So now it's mostly your fault, even though we, no, everybody can see a bus. You should stop. So maybe if there's some requirement that officers cite everybody who is at fault, regardless of how much insurance they had. And I've had another case where he didn't cite kids who didn't even have a license driving a car that ran into my bus because he smelled weed on him and he knew them and he didn't want them to get in trouble. And that later came back as a lawsuit against me, even though they ran into my bus, which was sitting at a light. So you have a drug test and policy after we're required to do that by federal law. So we had to solve the free employment and random drug screen process. Now that process was doubled by the feds during the pandemic. So they went from 25% of your pool to 50% has to be tested. And that's the end. And same with alcohol, it went from 10% to 25%. But after every accident, your drivers were tested within so many hours of the incident. If someone's treated at the scene or if any vehicle is towed, we're required to test them. Yes. Okay, thank you. Yeah, you're welcome. Any other questions? There is on me other questions. Yeah. Yeah, nice. You made it. I was talking about John from committee earlier this year and I was just testing on seatbelt liability. I didn't want to bring up to work, but Commissioner King started it and I'll just pile on. That is a huge issue for our members. Bianca mentioned early death 5000 years. We had to call death 5000 paper cuts, inflation, insurance premiums and liability claims. And that was a major issue for us. And we hope to continue the discussion moving forward in the next session. Yeah, and I appreciate that. And then I do want to make a couple comments on, I think that I know some of you made a hundred by your group and your friends you brought, saying I did have a comment. And this is more, I guess, directed towards the senators, but I mean, I did have conversations with DDS. And I mean, after I think hearing some testimony today and then I think the discussion I have, I think it may be interesting to have actually the DDS commissioner, I think, come and present maybe some stats on what's going on with driver testing. I know when the data points I was given to me in terms of forecasting for budget and determining it, I wonder, where do more CDL sites where they stood up around the state? My understanding and they can correct me if I'm wrong is that there were leads in a methodology and where these sites are located, how they're placed. In terms of modeling where the need is. So I think that would be an interesting conversation to have. I know there's some two senators that just opened and first I think Ann Dole is full that are averaging around 596 tests weekly in about 23, 2400 monthly. I did ask also about me and Bruce and I'm not gonna put my technical colleagues friends on the spot. These are my comments. But I think the realization of blending state funding for CDL sites for driver testing, I know we've attempted to do that here in Palin County, Georgia in the past. But I think if we're gonna be good stewards of tax dollars and maximize and be innovative, I think there's opportunities to see how if we have trained instructors certified doing classes and doing these things, how do we blend that in with what DDS is doing in a county or region around the state to maximize opportunity since we do have a driver shortage of 25,000. And then I think the other thing, the comments that were made, I think by Bianca. I've said it in Senate appropriations and enjoying meetings that I do believe over all TCSG's underfunded. But I also think too, we're like doing something and we're supporting blue collar workers, but the money isn't there to really, I think back up those policy statements. And again, not to put the commissioner or any technical college president on the spot, but those are based on looking at the budget and I know my colleagues that are on appropriations, they can look for themselves also, but I think that's a concern. If we're gonna invest in this space, looking at the future. Those are my general comments on that and I appreciate it. I may want to have more dialogue offline about what's going on kind of real time because again, it shouldn't take three years to go through nickel and diamond application for a business to be able to be efficient and run. So anyway, sorry for my rant. Well, basically at the end of time, I just want to turn it over real quick to enjoy the term and it's already coming up and from the bottom of the screen. Hey, I'll say one thing before Govazal closes out, he's the more articulate one in the group. The safety of our citizens on our public highways is still a top priority. I do not want anyone that's listening to this meeting to think otherwise, we have to have safety standards, we have to have regulations to protect the general public. But and then going back to the issue earlier, we talked a lot about civil justice reform. I believe that too has to be something that we approach this next session with sincerity and look at what we can do to help our business community but also the residents and the citizens of our state to find and maintain affordable insurance. We do not want people driving up and down the road without insurance because they can't afford to get it. So we've got to address that issue and we need all parties on both sides of this issue working together as we approach that in the cup coming session. But I just wanted to make sure everyone's clear, we're not trying to get rid of regulations, we're not trying to just dismiss the idea that we need regulations and we need bureaucracies in place to slow business down. That's not the intent. We have to protect the general public. And at the same time, we have to figure out a way of maybe fast track some of these processes. It should not take six months for someone to get a driver's license in this state or any other state in the country. And I think some of that could be coming from the Fed. So anything we can do with the technical college system, I think is a step in the right direction. I look forward to commission or dozer coming at a future meeting to discuss that as well. But thank you, Chairman. And everyone who participated in this today has been very helpful and gives us all some ideas and how to move forward. We want to thank Commissioner King as well. He did a great job on his testimony. Thank you, sir. Thanks, Senator Senator Dozerle. Thank you, Mr. Chairman. Senator, it is all good to see you as well. Appreciate the work of this committee and those who testify this morning, I've got really two thoughts. One, I think it's very easy to dismiss this issue as maybe be in a singular industry issue until an Amazon truck pulls up to your house. And you remember that that Amazon truck, while not an 18-wheeler is grabbing something from a warehouse that got there via an 18-wheeler. And as the, as e-commerce continues to explode, we look at freight logistics across the state and our growing needs for infrastructure, the success of the port and the predicted continued success of the port, I think is only gonna exacerbate this issue. Mr. Chairman, I think one thing that's worth diving into the future is what the role of autonomous vehicles will be in the future as it relates to this industry. I do not believe that in 25 years, the vast majority of our trucks will be driven by humans. And so how we bridge that gap, I know that at the federal level, the teamsters are fighting the autonomous side heavily because they're gonna kind of protect the interest of the Union drivers there. But that is something that, you know, with or without that political fight, that's something that's going to come. And I wanna ensure that Georgia is ready for it, both on the regulatory side, but also just on the logistics side, in terms of having the lane capacity to handle those and having the infrastructure ready to support that industry as it grows as well. Dolly Naredin and I have a charter to add down. I can do Senator Dozalk. Senator Dozalk. Senator Dozalk. I learned a lot today and I think that I sympathize with, you know, I'm gonna test and leave that. I think across the border, our state agencies can understand and we can look into that at the state legislature to see how we can help stream line services to Georgians and definitely see what solutions that we can come up with with prioritizing safety and making sure that we have the drivers that we need for economic development in the state of Georgia. Thank you. Thank you. So our next meeting is September 18th, a Coca-Cola meeting in the city of the state in Kevin Perry for our next discussion. How do we take ways? Because I'm sure that the agencies or otherwise will be growing up or on the office in the next few days. So we will add and I think it is probably a good healthy conversation. The center of Dozalk's point about having a discussion on autonomous vehicles. So we're bringing that to the table. I do think there's interest from hearing from the commissioner of DDS. Also, Commissioner McMurray, just talking about what's going on with truck parking and client and future plans and funding. And also too, I think a discussion from the technical college system. And I do want to recognize Ron Newcomb and the president of Chattanootry Tech, my longtime dear friend, mentor or public servant who's worked for many past, Lieutenant and also governors. And I know on this topic, you've been a champion and a mentor to me. So I just want to say thank you for being here today. And I think also too, having more conversation on the veteran piece, which I know we passed the bill. And unfortunately that was vetoed, but that bill's coming back and looking forward to working with the technical college system and others to see that happen. So without that, we adjourned. Thank you to everybody online, our senior staff and everyone here. Glad to see you.",
  "updated_at": "2026-02-14T01:05:15.433606+00:00"
}