{
  "video_id": "CmiyzggH49A",
  "url": "https://www.youtube.com/watch?v=CmiyzggH49A",
  "title": "11/27/23 Senate Study Committee on Foster Care and Adoption",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 17,
  "summary": "Here is a summary of the Georgia 11/27/23 Senate Study Committee on Foster Care and Adoption session:\n\n**Overview**:\nThe study committee held its final meeting, reviewing and finalizing a report with recommendations to address issues in Georgia's foster care and adoption system. Key focus areas included permanency timelines, state ID access for foster youth, case manager retention, the process of legitimation, expansion of infant/toddler courts, and support for foster and adoptive parents.\n\n**Key Actions**:\nNone detected.\n\n**Bills Introduced (First Reading)**:\nNone detected.\n\n**Notable Moments**:\n- The committee recognized the support and involvement from the Lieutenant Governor's office, the Department of Human Services, and members of the public who participated in the committee hearings.\n- The chair noted that the committee's work is just the beginning, and that continued efforts will be needed to address the complex challenges facing the foster care system.\n- The committee reviewed and discussed the draft report and recommendations, incorporating final input from members.\n\n**Votes**:\nNo recorded votes mentioned.\n\n**Attendance**:\nQuorum was present, with committee members and representatives from the Department of Human Services in attendance.\n\n**Adjournment**:\nThe committee was slated to complete its work by December 1st, along with other study committees.",
  "transcript": "Good morning everybody, welcome to the final meeting of our study committee on foster\ncare and adoption, and I'm going to ask Senator Jackson to open us in prayer.\nWhat's your mic then, ma'am?\n11.\nOkay.\nHoly God, we thank you so much for the opportunity to be in a position to care for your children.\nWe pray especially for all children who are in foster care, who find themselves in need\nof a home, a loving home.\nWe pray for all children who are in danger, who are afraid, for those who are in detention,\nFor those who've run away, we pray also for foster parents and for biological parents who\nstruggle to make decisions to care well for their children.\nWe pray that you would guide this committee and guide the General Assembly that we might\nmake laws and institute rules that will care well for all.\nAmen.\nThank you.\nOver the last few months, we've heard over a dozen hours of testimony in this committee\nand it's been a lot like drinking out of a fire hose for many of us.\nFrom experts and also from the public, there's been a lot of public interest in this committee\nand we really have an opportunity to make a positive change in our state.\nWe've got the juvenile court judges represented back there, John, thanks for two y'all for\nbeen here and I wanted to highlight a couple things that have been in the news. One is that the\nGeorgia foster care tax credit launched January 1st and if anybody's interested in more\ninformation about that, please help us get the word out about that. And then I also wanted to\nhighlight something that was in the news yesterday about the Cherokee County which is in my district\njuvenile courts receiving over $740,000 in grant funding for their family courts and they're\ngoing to develop a family court system there so that is directly related to what we've been\nworking on here and very excited about that. I wanted to thank the committee members for their\nengagement. Every member has made great suggestions and I really appreciate the hard work especially\nin reviewing all the material that was presented to us\nseveral the last few months.\nThat's a heavy lift.\nWe've had support from Senate staff, including Hannah Holcomb\nand Karen Edwards, our administrative assistance.\nMary Akkins from Senate Research is over there.\nAnd she's been doing this on the fly with me\nover the weekend.\nGreatly appreciated Holly Carter from Ledge Lab Council\ndown there and our wonderful Senate press staff.\nEmily is back there running the show.\nAnd we've had also a lot of support\nfrom the Lieutenant Governor's office\nand his staff, Ennis Owens, especially.\nShe's here with us today.\nAnd he really emphasized the importance of this issue\nby creating the Children and Families Committee\nand supporting the Study Committee.\nSo that is definitely very helpful\nin accomplishing our goals in the legislative session.\nThe attention and resources brought\nby the Department of Human Services has been extraordinary.\nAnd although she's in a hearing this morning,\nwe really owe a debt of thanks to Commissioner Broche\nand her staff who actually highlighted the hotel issue\nand others for the General Assembly\nduring her budget presentation two years ago.\nThe members of the public who attended our meetings,\nmany of whom were here today,\nand submitted material for review,\nwere very helpful to our work.\nThe final report and recommendations\nwere a result of every committee members reviewing\nand prioritizing the massive amount of material\nwe heard and read.\nThe draft report was reviewed by the committee\nover the last few days and additional suggestions were made.\nThe end result is what we're going to go over today.\nIt's important to realize that the work on behalf\nof our foster kids will never be finished.\nAnd this committee's work is just a strong start.\nWe spotlighted some areas that need future work\nin addition to the recommendations in the report.\nAnd we know we can't reach all our goals in one year.\nThat's not how we operate at the general assembly sadly.\nSome of our recommendations will require legislation.\nOthers will be budget items.\nAnd some can be accomplished by the agency\nwithout legislative intervention.\nWe're not going to have public testimony today,\nbut members of the public are still welcome\nto submit written material for review,\nand we'll get that to the committee.\nI'll now walk through the report focusing\non the recommendations as the bulk of the report\ndocuments the testimony that we heard\nat our three previous meetings.\nAnd then we'll answer any questions from committee members\nand then vote on the report\nas we are slated to finish our work by December 1st,\nalong with the other study committees.\nI did make one addition to the report committee members.\nThat's not in there.\nAnd I'll make sure that's OK with you all\nbefore we finish today.\nSo if you go to page 15 of the report that's in your folder,\nwe'll just briefly go through the recommendations\nand the committee each gave members\neach gave their input on what their priority items were,\nand we put all that together.\nNumber one is permanency.\nThe timeline for getting foster children to permanency,\nwhether through reunification or adoption is very important.\nThere are existing statutory reporting requirements\nwithin the juvenile court system,\nbut there are data limitations due to the lack\nof a uniform statewide reporting system.\nLegislation to create a uniform reporting system\nreportable to the general assembly should be considered.\nNumber two was state identification cards.\nChildren in care currently face difficulties\nin obtaining state IDs, photo IDs.\nAnd these difficulties prevent many challenges,\npresent many challenges for foster children,\nespecially related to driving and employment.\nLegislation to provide free, easily obtainable state\nfederal IDs to foster children should be considered.\nNumber three is case manager retention.\nHigh turnover among case managers within defects\nand other child placement agencies.\nBoth public and private is problematic.\nPossible solutions include increased salaries,\nmore training to include trauma informed care,\nand more resources to connect to non-governmental groups\nthat provide services to at-risk families and children.\nContractoring with a closed loop referral tracking system\nwill be highly beneficial for case managers looking\nfor community resources.\nAnd I already mentioned at our first meeting\nthat the department is working on an agreement\nwith you nine to us and they're here today,\nand can answer questions afterward if needed.\nNumber four is legitimation.\nIt was highlighted that the process of becoming\nthe legal father of a child is cumbersome in Georgia\nand slows the timeline to permanency.\nUnderstanding that this is a complicated issue\nwith potential downstream effects that we need\nto be careful about, legislation to streamline this process\nwith protections for victims of domestic violence\nand others should be considered.\nNumber five, expanding infant toddler courts,\nwhich are referred to sometimes as safe baby courts,\nsometimes as family courts,\nbut they're directed towards young children, zero to three.\nAnd we have piloted, we're working on a pilot\nof those courts due to the model success in other states.\nAnd so Georgia now has a federal grant\nfor three pilot sites that we heard about\nduring our testimony.\nThese courts focus on comprehensive support\nof at-risk families with infants and toddlers,\npromotes successful reunification,\nand feature enhanced attention to unmet mental health needs\nof parents whenever necessary.\nTheir expansion in Georgia could prevent many children\nfrom entering or returning to the foster care system.\nNumber six, foster an adoptive parent retention.\nMany foster parents leave the system due to redundant paperwork and other process issues.\nAnd a significant proportion of foster and adoptive placements dissolve because of an adequate\nsupport to manage formidable mental health challenges of the children.\nMany of these issues can be handled by DHS without legislation because they relate to laws\nthat already exist.\nwe recommend expansion and access to training to foster and adoptive parents in trauma-informed\ncare, and that all future compliance appraisals mandated by the 2022 Georgia Mental Health\nParity Act include a separate analysis that exclusively considers the state's foster\nand adoptive children, given their unique vulnerability to violations in mental health\nparity as a critical step in ensuring ready access to necessary\nvaluation and treatment services.\nThe one that I would like to add at the pleasure of the committee,\nnumber seven would be to recommend adjusting the adoption\nassistance rates in Georgia, which have not been adjusted\nsince 2009.\nAnd we heard that at our third meeting and I missed it\nwhen I was reviewing the material.\nIn addition to these recommendations,\nthe committee had additional ideas\nfor future improvements.\nNumber one, strengthening residential treatment options\nfor foster children with complex needs.\nAs part of the larger conversation\nin Georgia about mental health and substance use,\nthe use of opioid litigation settlement funds\nshould be considered.\nAnd I actually have a conversation set up this afternoon\nwith Commissioner Tanner,\nand he's already heard about this.\nSo we'll see what happens.\nNumber two, protection of children\nbeing transported across state lines.\nWe learned at our third meeting\nabout the Uniform Unregulated Child Custody Transfer Act.\nAnd it should be considered due to trafficking concerns.\nWe ran out of time to look into,\nto do a deep dive into that.\nNumber three was a unique program\nthat we heard about called Hannah with Care,\nused by some law enforcement agencies\nwhich notify schools when one of their students\nhas been involved in a traumatic event of any kind.\nThese programs have been very beneficial\nin the district where they're used and should be expanded.\nAnd number four, provisions for ensuring\nthat foster and adoptive parents themselves,\nin addition to the children,\nhave appropriate access to mental health services\nwhen necessary to persevere in their pivotal role.\nMembers of the committee, as well as the standing Senate\ncommittee on children and families will continue this work\nduring the upcoming session and beyond.\nAnd with that, I would like to take any questions\nfrom the committee, but I'd also like to ask\nfor approval of recommendation number seven,\nwhich is to increase the adoption assistance rates.\nYes, Madam Chair, to the question number seven,\nare we speaking specifically to the monthly assistance\nthat people receive or and the amount of legal assistance.\nSo there's a fun for legal assistance.\nAre we speaking about both of those funds increasing?\nAre we talking specifically about the monthly, right?\nI was actually talking about the monthly,\nbut I don't think there would be any limitation\non looking at the whole package.\nAll right, thanks.\nI just want to make clear.\nAnd I certainly would approve that if that's the will of the buy.\nDoes anybody object to adding number seven\nto our recommendations?\nAny other specific questions or comments about the report?\nJulie.\nI would just say to Senator Jackson's comment, I think referring to it maybe as recurring\nand non-recurring is how they, and then also maybe look at the, I mean there are other\nfunds that foster parents can have access to as well, but the recurring and the non-recurring\nare the main ones.\nThank you for adding that.\nOkay, we got it.\nThank you.\nAnything else?\nI don't know.\nI'm wondering, I love the item number four on the additional.\nAnd I'm wondering if we might consider adding that\nto recommendation six above.\nAs soon as how it's so related.\nSo let me find my page.\nyes. Could you repeat that? So I like the additional recommendations and\nrecommendation for about the provision for ensuring that foster and adoptive\nparents themselves have appropriate access to mental health. I'm wondering if\nwe might consider adding that to recommendation six above. In my opinion they\nof those things go hand in hand with the children they're caring for.\nAny discussion about that?\nI don't object to it.\nI think we're going to need more than this upcoming session to deal with that is the\nonly reason that we put it in the future recommendations that doesn't mean we\ncan't work on it now. No he's talking about under the future\nrecommendations number four which is provisions for ensuring that the\nparents have appropriate access to mental health services he's talking about\nNot moving that under number six in the committee recommendations.\nI think that number, that provision is something that DHS could work on without legislation.\nSo I think it would be appropriately appropriate to move it to number six.\nI don't think legislation would be required for DHS to put a focus on mental health care\nfor post-election.\nOkay, so the way that would work is we've got a little sub-paragraph one and two that\nwould become sub-paragraph three and would move from the future recommendations to the\nrecommendations for now from the committee.\nmake sense, Mary? Okay. Any objections to that? Okay. Good. Other questions? Okay. I'm\nnot seeing any. So at this point, I think we're ready to vote on the report as with the changes\nthat we've made, which were two, it's moving that one recommendation up to the body of\nthe report and then adding recommendation\nfor recurring and non-recurring adoption assistance rates.\nOkay.\nWith that?\nOh, you want to make a motion?\nHang on one second.\nWow.\nOkay.\nYes, Madam Chairwoman.\nThank everybody for all the work we've done.\nI'm proud of all of us and just in what this meant.\nAnd I'd just like to move that we've as amended here on the community today to go ahead\nand pass that out into the committee.\nWe have a second.\nA second.\nOkay.\nA second by Senator Jackson.\nA motion by Senator Payne.\nAll in favor?\nRaise your hand.\nAny opposed?\nGreat.\nThank you all so much for your hard work.\nAnd again, we can't do all of this at the same time.\nI think we've got a clear picture of where we stand in Georgia now with foster care and adoption\nand I really appreciate everybody's hard work and look forward to moving the ball down the field.\nSo thank you very much, we're adjourned.\n",
  "updated_at": "2026-02-12T01:51:54.249052+00:00"
}