{
  "video_id": "cP1YkqIhrBQ",
  "url": "https://www.youtube.com/watch?v=cP1YkqIhrBQ",
  "title": "Lawmakers Day 31 03/13/25",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 31,
  "video_date": null,
  "duration_minutes": 30,
  "summary": "Here is a structured markdown summary of the Georgia Lawmakers Day 31 03/13/25 session:\n\n**Overview:**\nThe session featured a mix of lighthearted debates on bills designating official state colors and heritage horses, as well as more serious discussions around school psychologist licensing, pesticide disclosure requirements, and the use of song lyrics as evidence in the high-profile prosecution of rapper Young Thug.\n\n**Key Actions:**\n**HB 81:** Allows school psychologists to work across state lines with equivalent licensing.\n**HB 167:** Allows the use of fluorescent pink in addition to orange for hunting attire.\n**SB 139:** Allows the city of Mulberry to annex certain parcels of land in Gwinnett County.\n**SB 138:** Waives Gwinnett County's sovereign immunity in providing services to Mulberry.\n**SB 144:** Prevents pesticide manufacturers from being held liable for undisclosed health risks beyond FDA requirements.\n\n**Bills Introduced (First Reading):** None noted.\n\n**Notable Moments:**\n- Debate on the appropriate \"shade of pink\" to be used for hunting attire.\n- Democrats opposing the Mulberry annexation and Gwinnett County service bills, arguing it was a \"free Berry\" approach.\n- Passionate discussion around the use of song lyrics as evidence in the Young Thug prosecution, with a Democratic representative joining the opposition.\n\n**Votes:**\n- HB 81 passed 48-2.\n- HB 167 passed unanimously.\n- SB 139 passed 96-74 along party lines.\n- SB 138 passed along party lines.\n- SB 144 passed 101-58.\n\n**Attendance:** Quorum maintained.\n\n**Adjournment:** Session adjourned, with the next session date unspecified.",
  "transcript": "The Senate debates about which pink works best and tonight's show will continue with\nthat theme.\nGood evening and welcome to Lawmakers. It's Legislative Day 31. I'm Donald\nAurean Atlanta. During the 40 days of the Georgia General Assembly,\nlegislators deal with serious issues that sometimes lead to heated debates,\ntense discourse, and an uncomfortable atmosphere. Despite that, they actually share\na lot of mutual respect. Regardless of their political differences,\nthere are also plenty of lighthearted moments with good nature teasing between both sides of the aisle.\nThat's why tonight we're switching gears a bit and having some fun with legislation\nand more under the gold dome.\nWe'll discuss some fascinating bills aimed at giving Georgia official designations for\neverything from color greens to a state heritage horse.\nThere's a lot of spirit behind these proposals.\nAnd later, we'll talk with the Atlanta Journal Constitution's Maya Prabhu,\nwho for several years has come up with the best dressed lawmakers list.\nOne of the winners joins us.\nOn a more serious note, we'll discuss legislation that's an outgrowth\nof Fulton County's trial against rapper Young Thug.\nFirst, Capitol correspondent Sarah Callis tells us how each chamber\nis now looking at bills passed across the hall.\nHi, Donna. Today at the Capitol, the Senate approved new hunting attire\nand the House debated a familiar issue.\nIn the Senate, two bills came to the floor.\nHB81 is an initiative that would form a compact with a minimum of seven other states\nto allow school psychologists to work in any of those states by allowing\nequivalent licensing. We are an\ndesperate native school psychologist. There's a shortage like we see in a lot of\nour workforce areas and this bill will help with our\nworkforce shortage in that area. The bill was passed 48 to 2\nand HB 167 if losing your orange hunting vest when you want to go hunting has\nas you're seeing red, relax.\nThink pink.\nNo longer will you be required\nto wear only a fluorescent orange vest,\nbut fluorescent pink, 500 square inches of fluorescent pink\nwill be sufficient.\nHB 167 does not limit the use of fluorescent pink\nto females.\nGentlemen like my friend, the country lawyer\nfrom the 42nd who's very comfortable in pink\nand his manhood, he'll be able to wear that\nto the great outdoors as well.\nBut there seemed to be some questions\nas to which pink was best.\nAre you aware that there's 240 different shades\nof pink I now I am?\nAnd is there a specific shade in this bill\nthat we're gonna recognize as the official pink\nof Georgia Hunters?\nIt's fluorescent pink, that's what we've addressed.\nI've gotten several calls from my district about pink.\nis pink and pink, is that the same color?\nAnd would that be recognized?\nSenator, I live about two miles from your district.\nAnd the higher we get an elevation there,\nthe longer the draw on the color.\nSo red is red and pink is pink.\nDespite some humorous filibustering by Democrats,\nit was passed unanimously.\nIn the house, issues concerning the city of Mulberry\nwere up for debate once again.\nSB 139 would allow the city to annex certain parcels of land and surrounding unincorporated\nGwyneth.\nThis type of bad fate, this type of gridlock, and the refusal to provide the constituents\nthat I represent would call them and other members will represent from receiving the\nservices that they are entitled to that they pay for what their property taxes is unacceptable\nand it does warrant action by the General Assembly when things get this bad.\nBut Democrats representing Gwinnett County oppose the expansion.\nWell annexation impacts every single citizen of Gwinnett County. It impacts every single\nlegislator who represents and is a member of the Gwinnett delegation because it is county money\nthat is otherwise being taken away.\nThe bill passed 96 to 74 along party lines.\nThe house then moved on to another Mulberry related bill,\nSB 138, which dealt with Gwyneth Sovereign Immunity and access to county services.\nThe bill does include a waiver of Sovereign Immunity and circumstances where Gwyneth County\nfails to comply with law as to how Mulberry is to be treated just for this transition period.\nBut once again, Democrats said no.\nI would not call it more, baby, because I would call it FreeBerry.\nYou all heard my colleague, FreeBerry, because they want everything free.\nThey are looking for everything free.\nThey're looking for free police service.\nThey're looking for free EMS, free lawyers.\nI mean, everything is free.\nThat bill also passed along party lines.\nIn the afternoon, the House took up a bill dealing with health risks of some pesticides.\nSB-144 would prevent pesticide manufacturers from being held liable for failing to disclose\nhealth risks, other than what is required from the FDA.\nThe bill garnered strong pushback from Democrats, who say it allows companies to put consumers\nlives at risk.\nI refuse to be used by a corporation as a shield for the consequences of their actions.\nIn fact, just yesterday, in the past 24 hours, because the point of this bill is it says,\nyou know what, the standard that we are going to go by is the federal one.\nAnd what this body is trying to do is try to use federal government inefficiencies to\nsay, we've done our due diligence.\nBut no, we haven't.\nThe EPA within the past 24 hours not only has announced almost 1,300 layoffs, but in addition\nhas announced multiple deregulations related to our air, to our water, to the things that\nwe need every single day. But Republicans say farmers need access to as much\ntechnology as possible. We have to have food in this country. It's a national\nsecurity. You think egg prices went up. You wait till we can't get food in this\ncountry. When our production starts going down, the oil population is going up.\nYou better hold on to your wallet. The bail passed 101 to 58. Also today\nThe Asian American and Pacific Islander caucus held a press event to mark the fourth anniversary of the Atlanta spot shootings.\nThis is a moment that leaves us with profound sadness and anger,\nbut it is also a moment that demands our unity, our compassion, and our resolve.\nTo the families and loved ones of the victims,\nyour loss has been our community's loss.\nI hope we continue to remember to stand on the side of love, respect, and dignity for all.\nDonna, with nine days left in the session, we're still waiting for the Senate's\ntour reform bills to make their way to the House floor. As you know, that's\nGovernor Cap's top legislative priority this session. That's my Capitol report.\nThanks, Sarah. The full and county DA's prosecution of rapper Young Thug and other members of Young Thug\nThe Glyph YSL became the longest and most expensive trial in Georgia history.\nIt accused the defendants of operating a criminal enterprise under Georgia's Rico, or Racketeer\nInfluence Corrupt Organization Act.\nPart of the prosecution's evidence came from Song lyrics, a move that upset many and\nthe creative arts community.\nFrom the beginning, they blasted prosecutors for going after artistic expression.\nIn November of 2022, artists and industry leaders took out a full page ad in the Atlanta\nand the New York Times called Art on Trial,\nProtect Black Art.\nOne of the creatives unhappy with the prosecution\nactually joins us.\nShe's Grammy-nominated songwriter\nand Democratic representative, Inga Willis of Atlanta,\nand she's on the House Creative Arts\nand Entertainment Committee.\nThanks for coming on Lawmakers.\nAlways.\nHave love having you on.\nSo to give the audience some background on you,\nyour connection to this issue, you co-wrote,\nyou know what's up for Donnell Jones,\nAnd you also did the lyrics for Anthony Hamilton's song,\ntwisted on Carlos Santana's record.\nYes, yes.\nOriginally a record written for Al Green.\nYeah, no kidding.\nIn the music business, you know,\nyou don't always land the record in the moment.\nSometimes years later it'll come back.\nSo with that particular record,\nI was asked to bring in someone who sounded like Al Green\nand there was an aspiring artist,\nliving in a basement apartment next door to me in Harlem,\nnamed Anthony Hamilton.\nNo.\nI offered him $20.\nand a pack of ramen noodles to come and sing a record for me\nand he did gladly and about three years later.\nIt made it on a Carlos Santana's album\nand he called me from the airport on his way to Italy.\nSo that's a part of my background, but yes.\nThat's so cool and you worked with TLC\nand that was my professional introduction\nto the music business.\nI was through Lisa Lopez and TLC.\nSo this is personal for you.\nSo what were your first thoughts\nwhen you heard about this trial with Young Thud?\nIt's, we live in a country of polar opposites sometimes.\nAnd especially in the seasons, there's so many hypocrisy.\nSo it gave me pause to hear people\ntout freedom of speech every chance they get,\nand then closing on artistic expression as just that.\nAnd so I'm a principled woman.\nIt was just a hypocrisy of such.\nYou can't scream free speech for one thing,\nand then art is life, life is art, you know,\nartistic expression should be protected\nby the First Amendment.\nOkay.\nYou assigned on the HB214,\nwhich is actually Representative Eric Bell's bill.\nIt is.\nAnd as the main sponsor,\nbut deals with making artistic expression,\neven beyond lyrics, not just the lyrics,\nin admissible at trial.\nExplain what that would actually do.\nWell, through my lens, again,\nIt was just extremely principled for me.\nAnd this was not a new concept.\nThis is something that had been talked about\nlegislative seasons before.\nAnd Representative Bell has come in and done an excellent job\nat bringing it to the forefront.\nIt also talked to Representative Casey Carpenter\nabout it as well.\nAnd so if we're going to have energy for free speech,\nI want us to keep that same energy\nfor the artistic community.\nIf there has been a crime committed,\nbring forth evidence and such and let the process be what it may be.\nBut when it comes to artistic expression,\nit should be protected by the First Amendment.\nIt was just that simple for me.\nI've written for all types of artists.\nI've done hip-hop, I've done R&B, I've done rock music,\nI've done political speeches, I'm a writer.\nAnd so when it comes to the written word and the protection\nof the protection of artistic expression,\nI'm serious about that.\nThe Harlem Renaissance was an artistic movement.\nDifficult conversations were had because of this artistry.\nAnd I believe that these artists have the same rights\nto that same protection.\nYou guys had a hard time pushing this through.\nIt didn't get a hearing.\nIt's still out there.\nSo next year, I expect maybe you're\ngoing to fight a little bit more for it?\nAbsolutely.\nAnd I think this is my second year coming to see you\nwhen we were pushing for that statewide music office as well.\nSo sometimes the legislation doesn't stick the landing,\ndoesn't get the hearing, doesn't become law.\nBut it doesn't mean we won't bring it back again\nthe next year.\nthese are things that we will continue to fight for\nand want to make people aware of the issues.\nAnd you're getting that information out there.\nAnd you're going to stick around for our next segment.\nSo thanks for doing that.\nBecause coming up, we're going to talk about\nthe best dress lawmakers list that came out\nin the Atlanta Journal Constitution today.\nThe A.J.C.'s Maya Prabhu will tell us who won\nand why coming up.\nGeorgia Farm Bureau, a grassroots organization\ndedicated to preserving Georgia agriculture.\nFarm Bureau advocates for all Georgia farmers\nat the state capital during the session and year round.\nGeorgia Farm Bureau, the voice of Georgia Farmers.\nI'm a queen.\nI don't fear anyone.\nThis was a woman.\nPeople wanted to follow.\nYou are an important part of our work.\nYou're stronger than you know.\nSaddle my horse immediately.\nShe's a female trailblazer.\nWe did it by acknowledging our own worth.\nOh please, don't continue.\nUnderstanding the past gives a sense of the future.\nThis is the first time that anyone has seen this in 2000 years.\nThis is amazing.\nNo, I'm excited now.\nPompeii is a battle against time.\nYou think I'm joking, but look at this, it really happened.\nDon't let anybody tell you who you are.\nThe history teaches us to honor the past.\nWhen you look back, they're like, wow, that was pretty special.\nThis is something that's actually altering the course of history.\nYou're charged with keeping these stories alive.\nWelcome back to Lawmakers, I'm Donna Lowry.\nIf you're a Lawmakers regular, you may remember our interviews recently with representatives\nCasey Carpenter and Rick Towson.\nAnd our discussion about their interesting yet quirky bills.\nCarpenter's bill makes core bread the official state bread of Georgia.\nAnd Townsend's bill makes Brunswick stew the official state stew.\nWell, they're not the only lawmakers with unconventional legislation.\nI talked with four other lawmakers who authored bills that are a little more on the fun side.\nMarsh tacky horses along the coast, they go all the way from like sleep marries all the\nway up to South Carolina, North Carolina, and then down into Florida as well.\nWe've got a Videlia queen in there, Videlia onion queen, and I hopefully be the next\nI like green flea.\nOne must wear at least 500 square inches of fluorescent orange.\nIf you're hunting in certain situations,\nthis bill just simply adds fluorescent pink to that\nso that you would have an option.\nI was approached by the native plant society\nin my district to bring this bill.\nAnd they are interested in promoting us,\neveryone planning native plants in Georgia\nbecause it has so many benefits.\nYou got HB466, the marsh tacky horse\nas the official Georgia Heritage Horse.\nAnd I know that heritage horse breed is important.\nTell us about it.\nOK.\nThe horse tanky horse came over with the Spanish\nabout five to 600 years ago.\nAnd they were used in the Revolutionary War, the Civil War.\nThen they did Americans used them for every day war.\nThey're a smaller horse, about 14 hands tall,\nwhich is about 55 to 60 inches.\nSo they're pretty durable.\nAnd the hooves are bigger.\nSo the way they picked up the marsh thing is that they don't get stuck in the mud because\nthey're closer bigger.\nAnd they can navigate where a bigger horse would get bogged down.\nSo that's why they were used to log.\nAnd the Gologici people used to, and they used them for every day work.\nThey could plow a garden or they could ride them to go hunting.\nSo they were very durable horses.\nYou know, the population is diminished in the south,\nit's about 2,000 left, and about 200 in Georgia.\nAnd the people are starting to worry\nthat they're going to just totally go out of existence.\nAnd so if they lose the horse, we also lose the history.\nAnd that's a big part of me that we teach children.\nThis horse was threatened through our history\nin Georgia for the last several hundred years,\nand why it's important.\nSo that's why we went ahead and did the bill to help some folks.\nAnd that brings awareness to the people\nwho tried to increase the populations.\nIt's a beautiful horse, but it's like the marsh horse\nand tacky tacky is an only English word for common.\nSo what it is, it's a common marsh horse.\nWhat it is.\nAnd it was used, like I say, by people,\nFrancis Meary and the Swamp Fox in the Revolution War,\nhe wrote a marsh tacky horse in the troops in Civil War\nin the south, they used marsh tacky horses.\nThis is what they had.\nIn color greens as the officials say greens\nand pot liquor as the official dipping sauce\nfor the state bread,\nwhich if representative Casey Carpenter gets his way,\nit will be cornbread.\nWhere did you come up with this?\nWell, everybody knows I'm a foodie, one and two.\nWhen I heard that there was something called cornbread\nas the official bread of Georgia,\nand there was a legal argument on the floor\nof where they should be cornbread\nor where they should be biscuits, ooh.\nI could not be outdone.\nI was not going to let these guys outdo me,\neven though his cornbread is the best cornbread I have ever had.\nBut I started thinking, you know,\ncollard greens has so many medicinal purposes.\nA lot of people don't know what potlicker is.\nAnd it's called P-O-T-L-I-K-K-A.\nThat's it. Well, back in the slavery days,\nI had a press release out and I wanted to tell people how serious this was.\nSo back in Africa, when they started growing the greens there, they started cooking them and they came over to America and they were planting them here.\nNot only did other ethnic groups have them, the Mexicans were using colic greens, they loved them, the aristocrats in London were using them.\nIt wasn't until slavery was almost at its end that the Anglo-Saxons here in America found out what we've all raised now\nThat Colleagues are good and so as they started back and away from the fried chicken\nThey were starting to eat and drink more of the Colleagues in its pot liquor and as they got sick during the winter months\nThey always stop how that froze it up put it up and they would drink it as you know, a tonne\nSo, collage greens have several medicinal purposes, and I would hope that we would get this\nbill passed, and that the next medicinal purpose for collage greens is to help the state\nof Georgia, not only in its notoriety, but the agriculture here as well.\nIt didn't pass out this house this year, but you're going to, you're sticking with this.\nI'm going to stick with it.\nI do believe it will bolster some agricultural content here in Georgia, and we'll start\nto see more farmers playing in\ncollar greens. People will come\nfrom all over once they pass\nthrough. They'll grab a peach,\nthey'll grab an onion and they'll\ngrab a handful of collar greens.\nAbsolutely will. And then on that,\nno, hopefully, we'll be able to\nput some money in the budget for\ncollar green growing farmers here\nin the state of Georgia.\nThis bill was brought to me last\nyear. A young lady in Goodnet\nCounty, a high schooler, loves\na hunt with her brothers, but she didn't like orange. So she did her research and found\nthat other states allow fluorescent pink as well as orange. So the idea was presented to\nme and I thought well I had an interest in hunting so I decided I'd run with it and it's\nbeen a it didn't make it through Senate rules last year so I reintroduced it this year.\nchairman brass asked if the color was going to scare turkeys right I answer\nthat the best I could I don't know I don't think turkeys are scared of our\ncolors I think there's just trying to find their next meal and stay as hidden as\npossible but why would Norge scare them huh yeah pink was gonna do you know\nexactly let's talk about Senator Rhett who said if it's hot pink should we\ndrop it like it's hot. I didn't really know what to do with that question.\nYes, if it's hot pink, should we drop it like it's hot?\nOoh, but you wouldn't want to drop it like it's hot while you're hunting.\nWell, you demonstrate what that means.\nThis is something you feel passionate about because this young woman came to you.\nYes, so I'm a former middle school teacher and what I want is for young people to\nbeing engaged in the process. And so when I found out that this was the idea of a high\nschooler, not because of an assignment that she had to complete, but just her peer\ninterest in this, that is what it tracked me to this bill. And through some research\nthat we did last year, we actually found out that fluorescent pink is more visible to\nsome people who suffer with colorblindness\nthan for us at orange.\nSo that actually made it a more important thing for me\nas well because we certainly do want safety for our hunters\nand anybody who's accompanying them\nwhen they're out on a hunt.\nSo I think this is a good option for multiple reasons.\nWe also know the states where it's been adopted\nthat hunting license sales have gone up.\nSo that would always be a good thing\nfor Department of Natural Resources.\nwe want to get more people outside enjoying nature.\nEach before 44 to designate April of each year\nas Georgia Native American plant month.\nWhat's that all about?\nYou know, I had some constituents actually,\ntheir members of the Native Plant Society\nreached out to me and say, you know,\nwe're interested in this.\nWe're going to promote Native plants,\nparticularly with Hurricane Helene coming to Georgia\nand with all the invasive species\nthat have been introduced to the state because of the storm.\nYou know, we now have armadillos in the state.\nWe have this awful hornet that the agricultural commissioners\nbeen trying to get rid of.\nThere's a lot of invasive species that were never there before.\nAnd so I went to them and they talked to me.\nAnd I said, yeah, I think this is a great idea\nto promote native plants because they grow the best.\nThey provide habitats for animals and plants\nto, it's pretty good animals to live in.\nAnd it's just, it's better for our ecology\nand Georgia to plant native plants.\nSo the main thing is education.\nSo what do you want people to know every April?\nThey need to plant native plants as they get out\nand start to prepare their gardens\nand their beds for the spring.\nAnd how do you find that out?\nWhich ones are native?\nI don't know.\nYou can look it up.\nAnybody can Google it.\nBut all the ones that you see the most\nhave like Azaleas, Bengois, those beautiful flowers\nthat you see on the master's tournament,\nall of those are native to Georgia.\nHow are you feeling about your bill\ndealing with Native American plants in the Senate?\nYeah, I'm feeling good.\nAnd Senator Rick Williams is carrying an identical bill, and he's interested in this as\nwell.\nAnd he's from Millageville, so middle Georgia, so they're interested in it, and I'm just\nhoping we're going to not have forest fires and have been drought and plant more native\nplants.\nNow most of those bills passed out of the house before crossover day, the color greens\nand potlica bill did not move, but representative Angela Morris plans to keep up her fight to\nbe the color greens queen.\nWe're going to change gears now\nand talk about something else fun.\nJoin us, joining us is the AJC's government\nand politics reporter Maya Prabhu\nto give us the scoop on the release\nof our much anticipated list\nof the best dress lawmakers in 2025.\nAnd also back with us is representative\nEagle Willis of Atlanta, who's on the list.\nWelcome, thanks for coming.\nSo you started this in 2019.\nAnd so it's been six years since you've been doing it,\nexcept for 2020.\nWere you going to show some of the winners beginning\nwith 20, we're gonna show some of the winners\nbeginning in 2019?\nWhat made you start it?\nHonestly, it was a couple of things.\nOne, I'm sitting in these chambers\nand walking the hallways every day\nand a lot of things are very heavy.\nAnd I noticed Senator Elena Parent\nhad on something that was really nice.\nThis is back in 2019.\nI was like, oh, this is her and then.\nYeah, I'm like, oh, this is a beautiful,\nI was like, oh, I love your dress.\nAnd then the next day I was like, oh, I love your shoes.\nAnd the next day I was like, oh, I love your coat.\nAnd I was like, I need to start this list.\nAnd so that's really what it is.\nIt's become kind of a moment of levity for us\nat the Capitol because things can be tense.\nLike you've been saying this whole show,\nlike things can be tense, things can be heavy.\nAnd so this gives us something\nto kind of just be lighthearted about.\nAnd people have really wanted to be on this list\nor want to recommend people, right?\nYes, yes.\nI have had lawmakers text me, say, where are you?\nI think they want to give me a scoop.\nAnd then I get there and they just model for me.\nAnd I'm like, oh, OK, you have on a nice outfit today.\nOK, thank you.\nAnd then, yeah, I have people who are constantly\nmaking recommendations and telling me\nwho needs to be on the list every year.\nOK, so let's get to 2025.\nand talk about who's on the 2025 list.\nAnd let's begin with representative Willis.\nWhy was she chosen?\nI'm gonna see her picture in a second, too.\nShe had to be.\nSo she's, she's, obviously.\nSo she has been on the list before a few years ago,\nand then last year I kind of did a best of the best bracket,\nwhich she also won.\nAnd then up until this year I wasn't letting people\nbe on the list more than once.\nBut it's been, like you said, a while since I started.\nAnd, you know, it was time to bring some people back.\nSo that's why you saw, you'll see a lane\napparent on the list this year.\nAnd there was no way I couldn't have Brett Willis on.\nNext representative, Charlie Spurred of Woodstock.\nYes.\nSo it was the same thing.\nYou know, I said to her a couple of times,\nI was like, you were very on trend.\nShe had on a vegan leather pleated skirt.\nI was like, look at you.\nLike, so that's how I started paying attention\nto her outfits, and I love that dress that she wore.\nNext, Park Cannon of Atlanta.\nPark Cannon.\nWhat I love about Park Cannon is that she takes risks.\nThey don't always land, but I do appreciate someone\nwho takes risks when they are getting dressed.\nOK.\nRepresentative Katie Dempsey of Rome.\nKatie Dempsey is just...\nI don't know how to explain it, but she's just classic.\nExactly.\nShe is just classic.\nShe just always is always dressed impeccably\nand her, and she's, you know, a petite woman,\nher clothes fit great.\nAnd she just, you can tell that she takes a lot of care\ninto that.\nOkay, next to the Senate, representative Drew Eccles-Ovolto.\nDrew Eccles, he, like his wife before him,\nhe replaced his wife in the Senate.\nShe was on the list in her first year\nand it's his first year and he's on the list as well.\nHe loves clothes and loves to talk to him\nWe got how much he loves clothes.\nOkay, we're gonna go through the next one's a little faster,\nso we get everybody in.\nMitchell Horner of Ringgold.\nAnd then Senator Harold Jones,\nthe second of Augusta.\nSenator Rashon Kemp of Atlanta,\nSenator Lane Apparent, you mentioned too, so.\nYes, so Senator Jones and Representative Horner,\nthree-piece suits often.\nPeople love that we're trying to bring them back.\nAlana parent just always looks wonderful.\nAnd Rashon kept started lobbying me\nwhen he was standing in the line to qualify\nto run her office, so yeah.\nWe don't have a lot of time,\nbut I need you to tell me how you feel about this\ntwice now.\nOr three times.\nThree times, that's right, we're on the bracket.\nI'm honored.\nLike, I come from women who take pride in their appearance.\nSo my father's the best dress man I've ever seen.\nAnd it's truly just the uniform\nas I was sharing with Maya.\nEach day I'm like, what's what uniform am I putting on today?\nAnd I just, you fashion as a way of communicating\nbefore you speak a word.\nI love that.\nSo it, it gives me, it helps me bring more pride\nto my work to put the effort into it.\nAnd it does, and my others to do this.\nAnd her list does bring levity to the, and we need so.\nOkay, we'll run out of time,\nbut thank you both for being here today.\nThank you.\nThat does it for lawmakers today.\nThe legislature is off tomorrow and Monday,\nand so are we.\nWe'll be back on Tuesday with a breakdown\nWhat's in the state budget?\nGood night.\nYou\n",
  "updated_at": "2026-02-12T01:31:35.103485+00:00"
}