{
  "video_id": "cpGhD-KVGLw",
  "url": "https://youtu.be/cpGhD-KVGLw",
  "title": "Georgia House - Day 5 (2026-01-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": "2026-01-26",
  "duration_minutes": 83,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 5 (2026-01-26)\n\n## Overview\nThe session focused primarily on a scripture reading and prayer by the guest chaplain, rather than legislative actions. There were no major bills passed or introduced, but the Speaker addressed concerns about COVID-19 within the membership.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- The Speaker addressed concerns about COVID-19 cases among the membership, noting that not all absent members had tested positive.\n- The Speaker reminded members of the testing protocols in place.\n- The chaplain, Rev. Mike Stone, delivered a prayer for the protection, wisdom, and spiritual guidance of the House members.\n\n## Votes\nNone recorded.\n\n## Attendance\nThe Speaker noted that there were a number of excused absences, but emphasized that this was not due to a widespread outbreak of COVID-19 among the membership.\n\n## Adjournment\nThe transcript does not explicitly state the time of adjournment or the next scheduled session.",
  "transcript": "All members will please report to their seats on the floor of the chamber in the gallery\nand in room 341.\nAll members will please report to the House of Representatives.\nthe clerk will ring the bell.\nAll members will please take their seats.\nWe are about to have the morning roll call.\nWe're about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nhave all members voted, have all members voted, if so the clerk will lock the\nmachines. Well good morning. Welcome back. You may notice that we have a number of\nexcused members on the board and they are out for various reasons. They are not\nall out and I want to repeat that. They are not all out because they've tested\npositive for COVID. So I don't want their rumors to not that there would ever\ndevelop a rumor in this building. But I don't want a rumor out there that\nthere's been an outbreak in the house because there certainly has not been and\nmany of these members will be present tomorrow. I want to remind all the\nmembers too before we begin of the testing policy that has been repeated\ndistributed amongst the membership of the house, the dates and the requirement that you\nbe tested by Georgia Tech and the protocol for the testing.\nYou know, that's not there to make you happy or make you feel good, but it's there to\ntake care of your members, your colleagues.\nSo we've had some concerns about why people have to test in that fashion.\nWell, I'm not trying to make anybody happy about the testing except I'm trying to keep\neverybody well and I'm going to keep doing that.\nSo, doorkeepers will please close the doors and keep them closed.\nBefore we begin today, I know there's a lot of prayer needs and a lot of people back home\naround us that are suffering from COVID, but I want to point out that we have had two\nmembers that have been informed about this morning that they have lost their parents\nAnd Representative Roba Show and Representative Dunahoo and let's keep them close in our prayers.\nThat's a pain like no other.\nWe will begin our day with scripture reading and prayer by the chaplain after which we will\npledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 178th House District\nRepresentative Stephen Meeks, Representative Meeks.\nThank you, Mr. Speaker.\nGood morning.\nWhat a beautiful day it has turned out to be after a very stormy morning, Hatton.\nToday it is my honor to introduce someone who is no stranger to this house, as he has\nserved as chaplain of the day in previous sessions.\nAnd colleagues are in for a treat because the messages that he brings are always\nbiblically true, always timely, and always needed. A dynamic speaker, he's a leader, a servant,\nand a true man of God. Brother Mike Stone is a native of Valdosta, Georgia, and a graduate\nof Valdosta State College, as he said this morning before, it was Valdosta State University.\nHe was first called as Minister of Music at a Manual Baptist Church 25 years ago.\nHe has served as Senior Pastor for 19 of those 25 years.\nFor many years he has served as the chaplain for the Pierce County Bear Football Team, which\nare also the 2023 state football champions. He has served the Georgia Bible's convention\nas preaching conference president, as chairman of the executive committee, and convention\npresident. He has also served at the national level on the resolutions committee, and the\nimmediate past chairman of the executive committee of the Southern Baptist Convention.\nMost recently, ladies and gentlemen, he has announced his\ncannot see for President of the Southern Baptist Convention,\nwhich would take place, the lecture would take place later\nthis year in Tennessee.\nHe has daddy to four wonderful children and husband\nto Andrea.\nI'm privileged to sit under his teachings every week.\nHe's a man of God who unapologetically teaches the word of God.\nPlease help me in welcoming my pastor, Mike Stone.\nWhat is indeed a privilege to be here, I have great respect for this house and those who\nserve the great people of the state of Georgia in your ministry here.\nThe Bible declares in the book of Romans that those who serve in seats of government are\nministers of God for the good of those who are under their authority.\nSo though our ministries are different and varied, we are all ministers of the Lord,\nand it is a privilege to be in this place today.\nI was reminded on several occasions of the tightness of your schedule and those frequent\nreminders reminded me of the story of the young seminary student preparing for the ministry\nand he went out as a student to preach one Sunday as a guest preacher.\nHe asked his preaching professor, do you have a word of advice?\nThe professor said, I don't have a word, I have five words of advice and they are these.\nBe brief, brother.\nBe brief.\nI do want to be mindful of your busy schedule,\nbut I've titled my brief comments today,\nmy prayer for you.\nAnd the text for the day is drawn\nfrom Paul's first letter to Timothy,\nchapter two, beginning in the first verse.\nThe word of God says,\nfirst of all, then I urge that in treaties\nand prayers, petitions and thanksgiving\nbe made on behalf of all men for kings\nand all who are in authority,\nso that we may lead a tranquil and quiet life\nand all godliness and dignity.\nthis is good and acceptable in the sight of God our Savior who desires all men to be saved\nand to come to the knowledge of the truth.\nIt was reported that when Reverend Edward Everett Hale was serving as chaplain of the\nU.S. Senate, someone asked him if he looked at the nation and prayed for the senators and\nhe quipped, no, I look at the senators and I pray for the nation.\nThe reality is regardless of what position or party or principles you may have, your position\nas members of this great assembly warrant the prayers of the people of God.\nThere are not many things that I can say I know for a fact or the will of God for your\nlife, but the Bible says it is the will of God that we pray for those who are in authority\nabove us.\nAnd the prophet Samuel declared in 1 Samuel 12-23, God forbid that I should sin against\nGod by ceasing to pray for you and so my devotional word this morning again\nsimply entitled my prayer for you. And I just want to mention three simple things\nthat will be the centerpiece of the prayers that I will pray as God lays the\nmembers of this body on my heart today and in the days ahead. First of all I\npray for your protection. I pray for your protection. I've attended this\nThis assembly on many occasions, as a guest in the gallery, on several of the past occasions,\nis Chaplain of the Day, but this is the first time that I recall seeing the type of armed\nprotection out in the streets, and of course we come through the metal detectors and this\nbuilding and all who enter here are protected by law enforcement and we thank God for that.\nFrom the violet riots that swept the country last summer to the tragic events and deaths\nthat occurred earlier this month in the nation's capital, we've been reminded in vibrant living\ncolor that our country can be a violent and dangerous place.\nAnd so we should thank God that in our country we don't change our leaders with bullets,\nbut we are blessed to be able to change them with ballots.\nWhether it's the Georgia State Patrol, the National Guard, the local police, the Sheriff's\nDepartment, or the many brave men and women who protect this building and all who enter\nit.\nfrom God. And I thank the Lord for them today as I pray for your protection. This\nwas really on the heart of one of our forefathers who wrote in a tremendous\nhymn, our Father's God to thee, author of liberty to thee we sing. Long may our\nland be bright with freedom's holy light, protect us by thy might, great God,\nour King. And I'm aware some 127 declares that unless the Lord guards the\ncity, the watchman stays awake in vain. And my prayer for your protection is that the only\nbarbs that would fly in these hallowed halls would be those verbal flaws that are the\nproduct of healthy debate. I heard about two senators who came from farming districts\nand they were arguing over an appropriations bill. One of them was a staunch liberal from\nan economic perspective and the other was a staunch conservative and the conservative\nfarming legislator said to his liberal colleague, he said, I don't understand your economic\npolicy, you want to give my hard earnings to someone who hasn't worked for it.\nAnd the liberal legislator said, well, that's just what I believe.\nAnd the conservative said, you mean if you had two farms that you had worked for and I had\nnot worked to earn one, you'd give me one of your two farms, he said, I sure would.\nHe said, you mean if you had two silos that you had worked hard to earn and I did not,\nYou would give me one of those, and the liberal legislator said, I sure would.\nHe said, well, I don't understand.\nYou mean if you had two giant combines that you had worked hard to earn, and I didn't have\none because I didn't work, you'd give me one of those two combines.\nHe said, I sure would.\nHe said, let me get this straight.\nYou mean if you had two cows that you had worked for to pay, and I didn't have one, you'd\ngive me one of those two cows, and the liberal said, well, that's not fair.\nYou know I have two cows.\nI pray that attempt that humor does not offend you, but I say it to simply say this.\nIf that does offend you, I pray that that is the worst thing that ever happens to you.\nAs you serve the citizens of the state of Georgia, I pray for your protection.\nQuickly now, secondly, I pray for your wisdom.\nThe Bible says in the book of James, if any man lacks wisdom, let him ask God and God\nwill grant it with liberality.\nSome decisions are easy in the home, in the community, in the workplace, and in this assembly.\nSome are as plain as can be.\nYou've already made up your mind.\nYou have these convictions.\nYou have your preferences and your stands.\nBut sometimes there are decisions we have to make for which there is no clear cut answer.\nThat does not mean that there isn't a right answer or a wrong answer.\nIt just means the right answer is not always an obvious answer.\nIn my ministry, I've been blessed as Representative Meek said, I have served as the chairman of\nthe board for the Georgia Baptist Mission Board, which has millions and millions of dollars\nin assets, an early 40 million dollar budget this year, the recent, the immediate past chairman\nof the executive committee of the Southern Baptist Convention, which has billions of dollars\nin assets and have served as presidents and chairman of these respective boards.\nI pastor a church in South Georgia that has a multi-million dollar annual budget, but\nI do not mind telling you that in the last ten months, I have questioned my own ability\nto lead more than at any other time in my life and my ministry, because of this thing that\nseparates and distances us even in this building and causes us to wear masks, COVID-19 has\ncreated a lot of different challenges.\nNot prayer for you as it whether you face challenging decisions as a legislator, as a parent,\nor even as a child, caring for aging parents that you would understand the truth of Proverbs\n3, 5, and 6.\nTrust in the Lord with all your heart, lean not on your own understanding, but in all your\nways acknowledge Him and He shall direct your path.\nMy prayer for you is a prayer for protection, a prayer for your wisdom, finally a prayer\nfor your integrity.\nThe word integrity is based on the same root word as the word integrated and it means there\nis consistency that when we look or peer into any aspect of your life, we see the same man,\nwe see the same woman.\nMy prayer for you is that you would reject all counsel that violate spiritual principles\nand that you would resist the inevitable pressures of this place to lose your integrity.\nI pray that you would be the same person here as you are at home, the same person in\nthe hallway as you are on the floor, the same person in plenary session as you are in\ncommittee, the same person in committee as you were at supper the night before, the same\nperson in Atlanta as you are back home.\nI pray that there would be no secret life hidden agenda or private side of you that only\na handful of people really know about.\nFor the Bible says in Proverbs 20 verse 7 that the righteous man walks in his integrity\nand his children are blessed after him.\nSome years ago, preparing to preach my first funeral\nof veteran pastor gave me a little illustration.\nHe said, challenge the people at that funeral\nto live the kind of life,\nso that they can enjoy it while they're living it.\nAnd then when they get old,\nthey can sit on their front porch\nand look back on it and enjoy it a second time.\n25 years in the ministry now,\nI've added a third line to that great word of advice.\nLive your life in such a way\nso that you can enjoy it while you're living it.\nWhen you get old in retirement, you can look back on it and enjoy it a second time.\nAnd then when your children lay you in the arms of God, your sons and daughters and grandchildren\ncan look back on your life and enjoy it even a third time.\nThat is my prayer for you that our great God would protect you, give you wisdom and help\nyou walk in integrity.\nMay we pray together?\nOur Father in our God, we come to you the only way we can, the only way we know how, through\nthe blood and by the name of your Son and our Savior, the Lord Jesus.\nAnd I do pray without apology that you would protect the members of this house and all\nthose who would serve in positions of leadership.\nI pray that you would grant them wisdom not based on their knowledge or experience, but\nbased on a wisdom that can only come from you.\nAnd I do pray that they would walk in holiness, righteousness, blamelessness, and integrity\nfor the good of the citizens of their district, for the good of the residents of this wonderful\nstate, and for the ultimate honor and glory of Jesus Christ and whose name we make our\nprayer.\nAmen.\nA pledge allegiance to the flag of the United States of America and to the Republic for\nwhich it stands, one nation under God, indivisible with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nFurthermore, Mr. Speaker, don't be distracted by criticism.\nRemember the only taste of success some people have is when they take a bite out of you.\nI'm going to remember that one just in case I ever get criticized, Mr. Chairman.\nChairman Hogan, the chair of the Committee on Information and Audits reports that the\nThe journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's none and the journal is confirmed.\n.\n.\n.\n.\nhere.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Brudge, on a 59-moose file, and be established as the order of business, then the first\npart of the period unanimous consensus, introduction of bills and resolutions, first reading in reference\nof house bills and resolutions, second reading of bills and resolutions, report of standing\ncommittees. Third reading and passage of uncontested local bills and resolutions.\nMorning orders. Is there any objection to the adoption of the resolution\nestablishing the order of business for the day? The chair hears none and the\nresolution is adopted. First reading of bills and resolutions the clerk will\nRead House bill 4 by represent of Scott of the 76 can of the 58th Mitchell the 88th in Jackson the 64th\nWill be taught on act to amend article 11 chapter 2 title 20 the Fisher go to Georgia and it's a\nDerelating public school property and facilities\nEducation House bill 6 by represent of Scott of the 76th country of the 93rd base more of the 63rd scope field of the 60th\nThomas the 39th and others\nWill be entitled to amend Chapter 7, Title 48 of the Fishercoded Georgia and Tated relating the income taxes ways in Maine\nHouse Bill 9, my represent of Scott of the 76, Hutchinson 107, Scofield, the 60th, McLeod of the 105th Davis to the 87th\nWill be titled act to amend Part 3 of Article 16 of Chapter 2, a title 20 of the Fishercoded Georgia and Tated relating the health of students generally\nEducation House Bill 15, my represent of Scott of the 76th, Canada 58th, Thomas of 39, Scofield, the 60th Hutchinson in the 100th\n7th and others.\nBill Meetotal and act to amend chapter 8 of Title 35\nto fiscal Georgia annotated relating employment\nand training of police officers.\nPublic safety and Homeland Security.\nHospital 16 by the time Scott of the 76 Davis,\nthe 87th, Scofield, the 60th, Kendrickland, 93rd,\nHutchinson, the 17th and others.\nBill Meetotal, act to amend chapter 1 of Title 35\nto fiscal Georgia annotated relating\nthe general provisions regarding law enforcement officers\nand agencies.\nPublic safety and homeland security.\nHospital 19, my represent of Scott of the 76 Thomas of the 39 Scofield,\nthe 60th Davis to the 87th and Hutchinson, the 100th and 7th.\nBill B. Toddlenack to men, Chapter 16 and Title 9,\nthe physical to Georgia and the today,\nwe're leading the Georgia uniform civil forfeiture procedure act.\nJudiciary non-civil.\nHospital 20, my represent of Scott of the 76,\nDavis to the 87th Scofield,\nthe 60th Thomas of the 39th,\nKendrickland 93rd and others,\nBill B. Toddlenack to men,\nArticle 1 of chapter 16 in Title 45 of the physical\nof the Georgia annotated related to general provisions\nregarding coroners.\nJudiciary, House Bill 21 by the Rep.\nof Scott of the 76, co-feel of the 60th Davis\nof the 87th canon of the 58th, Thomas of the 39th\nand others, building a title in act to amend Article 2,\nchapter 11 of Title 16 of the official\nof the Georgia annotated relating\nto offenses against public order.\nJudiciary non-civil.\nHouse Bill 57 by the Rep. of Scott of the 76,\nwent to the 89th Scofield, the 60th Davis to the 87th\nof the Canada, the 58th and others.\nWilmington, an active men article on a chapter,\nwon a title 42, the official put a Georgia annotator\nrelating to inmate policies.\nHealth and human services.\nHospital 86 by Rickon Stevens, the 164th Mitchell,\nthe 88th Hawkins, the 27th Hudson, the 17th dollar,\nthe 45th and others.\nWilmington, an active men chapter 27, the title 50,\nthe official put a Georgia annotated,\nrelating the lottery for education.\neconomic development and tourism. House Bill 87, my\nrepresent of it, Evans of the 57th, and Noah was the 42nd,\nWalensky, the 79th Jackson, the 128th, greened in the\n151st and others, will be titled an act to amend part 7 of\narticle 7 of chapter 3, titled 20, the physical to\nGeorgia, and Taney, related to hope, scholarships, and\ngrants. Higher education. House Bill 88, by\nrepresent of Evans, the 57th Stevens, 1164th, Holmes,\nand the only 29th Williams, the only 68th,\nmore into the 96th and others.\nWill be total act to amend part seven of article seven\nchapter three, a total 20 of the fish go to Georgia,\nannotated relating to hopes, scholarships, and grants.\nHigher education.\nHouse Bill 89, member of the Senate of Evans,\nthe 57th fry of the 118th Carpenter of the 4th,\nSmyrie of the 135th, Buckner of the 137th and others.\nWill be total act to amend code section 23.\n519 in the Fischercoda, Georgia, annotated relating the definitions relative to hope, scholarships, and grants higher education\nHouse Bill 90 by reps and have Williamson in the 115th Burns, 159 Tiki, the 140th hatches, the 150th Morris, the 156th and others\nLivington, an active men article 3, chapter 12, a title 51 of the Fischercoda, Georgia, annotated relating the damages for conversion of timber\nDo you do, Sherry?\nHouse Bill 91 by represent of Jackson in the 64th,\nBeverly the 143rd, Hobson the 153rd,\nVaysmore the 63rd, and Thomas the 39th and others,\nbuilding title an act to a men article 9,\nchapter 4, title 49 of the physical\nto Georgia annotator relating\nto temporary assistance for needy families.\nHealth and human services.\nHouse Bill 92 by represent Gamble\nof the 15th, Mathis the 144th,\nall over the 19th part of the 5th,\nSkoggins of the 14th building title\nand act to amend code section 31, 10, 25\nwith the physical to Georgia annotator\nrelating to disclosure of information\ncontained in Bible records.\nGovernmental affairs,\nHouse Bill 93 members of Cooper,\nthe 43rd building title and act to amend title 31\nof the physical to Georgia annotator relating to health.\nYes, health and human services.\nHouse Bill 94 by Representative Rich.\nIn the 97th thing, when the 116th dreams,\nthe 34th May the act of the 73rd camp,\nthe 131st and others will be taught an act\nto amend Article 1 of Chapter 8 and Title 16,\nthe official bill of Georgia annotated, relating the theft.\nJudiciary non-civil.\nHouse Bill 95 by Representative Limit the 99th Park\nof the 101st Scofield, the 60th dryer, the 59th,\nthe mainer of the 56 and others.\nHe'll be taught an act to a men article two,\nchapter seven, a title 48.\nThe Fisher put a Georgia annotated\nrelating to the imposition rate computation and exemptions\nfor ways and names.\nHouse will 96, part of some of Clark with a hundred and eighth\ngravely, the 67th for now, the 77th,\nan frustration 104th.\nHe'll be taught an act to a men article one\nof chapter nine and not title 19.\nThe Fisher put a Georgia annotated\nrelating the general provisions regarding\nchild custody proceedings.\nDo you know justice Bone Wellласти\nreproductive health culture for\n15th all over the 82nd Wilson the\n80th and others.\nGo to Georgia, annotator relating the jurisdiction power and duties.\nJudiciary House Bill 98 by resident of Lumpston to the 12th,\nLackman to the 146, Fleming on the 121st, Oliver the 82nd,\nWilliamson to the 115th.\nWill be taught an act to amend Title 50,\nthe fiscal to Georgia, annotator relating the state government.\nGovernmental affairs House Bill 99 by represent Stevens,\nthe orange 64th, Cooper, the 43rd, Wollinsky, the 79th.\nbuilding title act to amend title 30,\nthe fiscal to Georgia annotated relating\nto handicap persons.\nJudiciary House Resolution 2 by Representative Scott\nof the 76th, cloud of the 105th, Davis of the 87th,\nwent to the 89th and Scofield of the 60th.\nResolution proposing an amendment to the Constitution\nso that it provides that the office of any state county\nor municipal elected official shall be declared vacant.\nGovernor LaFaire's House Resolution 22 by President\nEngland 116th, Gaines 117th, Kirby 114th, resolution recognizing this is Judy Hill\nLofton dedicated to interchange in her memory.\nTransportation House Resolution 23, Barbara of some of Jones on the 25th, Jones on the\n47th, Fleming on the 111st, Perchette on the 176th, and Dubnick on the 29th, resolution\nurging the United States Congress to reject any and all increase in number of justices\nof the United States Supreme Court.\nJody Shuri House of Resolution 24 VIRS and a Mallow of 163rd and Stevens 164th.\nResolution compensating Dominic Brian Luci.\nAppropriations House of Resolution 25 VIRS and a Mallow of 163rd and Stevens 164th.\nResolution compensating Mac Jason Jones.\nAppropriations House of Resolution 26 VIRS and a Mallow of 163rd and Stevens 164th.\nResolution compensating Kenneth Eric Gardiner appropriations that completes first readers\nSecond reading of bills and resolutions the clerk will read\nHouse bill three by represent Allen of the 40th Wilkinson of the 38th and Illinois\nWhich is the 42nd Bruce of the 61st Jones of the 53rd and others\nA bill relating to Permanent Required Application Suspension or Amendment,\nHouse Bill 26, by Representative Kendrick of the 93rd Benefit of the 94th,\nScott 76, Hutchinson of the 107th Scofield of the 60th,\na bill relating to income taxes, House Bill 27, by Representative Kendrick of the 93rd Benefit of the 94th,\nSpire of the 135th Mitchell of the 88th Hutchinson of the 107th and others,\na bill relating to income taxes, House Bill 29, by Representative Kendrick of the 93rd Mitchell of the 88th,\nScott of the 76, Williams of the 168th,\nHutchinson and the 170 others, the bill relating to office of planning and budget.\nHouse bill 50 by Reptile of Phase more of the 63rd, Smirie the 135th.\nBeverly of the 143rd, Robert showed the 48th, Bruce of the 61st and others,\nthe bill relating to special license plates.\nHouse bill 54 by Reptile of Phase more of the 63rd,\nbened of the 94th, Davis of the 87th, Robert showed the 48th,\nBruce of the 61st and others, the bill relating to competencies and core curriculum.\nHouse bill 55 by Reptile of Phase more of the 63rd, Smirie the 135th.\nof the 143rd Bruce of the 61st Mitchell 88th and others of bill relating to general provisions\nof labor and industrial relations. House bill 69 by rapid Kendrick of the 93rd\nbody of the 62nd, McLaren of the 51st, Hutchinson of the 107th and Scuffield of the 60th, the\nbill relating to state tort claims, House bill 70 by rapid Kendrick of the 93rd, Bruce\nof the 61st pendant of the 94th Wames of the 168th Allen of the 40th and others, the bill\nrelating to general provisions of state government, House bill 71 by rapid civil cloud of the 105th,\nIt's got at the 76th Burnout of the 77th,\nbased more of the 63rd, Davis of the 8th, 7th and others,\nthe bill relating to financing\nunder the Quality Basic Education Act.\nHouse Bill 72, by represent Hugh Lee of the 136,\nBuckner of the 137th Smire of the 135th,\nthe bill relating to social services,\nHouse Bill 73, by represent Hugh Lee of the 136th,\nSmire of the 135th, and Buckner of the 137th,\na bill relating to general provisions regarding insurance.\nHouse Bill 74, by represent Washburn of the 141st,\nof the 111st, Powell of the 32nd, Smith of the 133rd Carpenter of the 4th and\nothers, a bill relating to fraud and related practices.\nHouse Bill 75 by Rep. Gamble of the 15th, next to the 69th, Stevens of the 164th,\ntankers leave the 160th, Skoggins of the 14th, a bill relating to general provisions regarding\nad lore and taxation of property.\nHouse Bill 76 by Rep. Carson of the 46th, parts of the 44th, a Nile of the 42nd,\nAllen of the 40th, Deku of the 140th, a bill relating to public utilities and public transportation.\nBill 77 by Representative Bruce of the 61st, Beverly of the 143rd Macau of the 105th, Alexander of the 66, McLean of the 100th, and others.\nBill relating to general provisions regarding preparation for and conduct or primary elections, House Bill 78, by Representative Bruce of the 61st, Beverly of the 143rd Macau of the 105th, Alexander of the 66th, McLean of the 100th and others, a Bill relating to the Department of Administrative Services.\nBill 79 by reference of Allen of the 40th.\nWell, just in the 38th.\nI know it's of the 42nd with the 51st millions\nof the 37th to build relating to regulation of fireworks\nand general provisions regarding provisions applicable\nto counties and municipal corporations.\nHouse Bill 80 by reference of Rolston of the 7th.\nJones of the 47th burns of the 150th and 9th in England\nof the 116th to build to him in an act\nmaking and providing appropriations\nfor a state fiscal year beginning July 1st, 2020.\nHouse Bill 81 by reference of Rolston of the 7th.\nJones of the 47th burns of the 150th and 9th in England\nWith 116th built make and provide appropriations\nfor the State Fiscal Year beginning July 1st, 2021,\nHouse Bill 82 by synapse,\nrelaxed under seven times,\nJones of the 47,\nburns at the 115th England with 116th\ntheir builds from into act make and providing appropriations\nfor the State Fiscal Year beginning July 1st, 2020,\nHouse bill 83 by wraps,\ninvolves on future sevenths,\nJones of the 47,\nburns on the 115th England with 116th\nbuild to amend the enact making and providing appropriations\nfor the State Fiscal Year beginning July 1st, 2020,\nHouse Bill 84 by Reptile Rolston in the seventh, Jones in the 47th, burns in the 159th, England\nof the 116th, a built-in-making provider appropriations for the State Fiscal Year beginning July\n1st, 2021. House Bill 85 by Reptile Rolston in the 7th, Jones in the 47th, burns in the\n159th, England of the 116th, the built-in-making provider appropriations for the State Fiscal\nYear beginning July 1st, 2021. House Resolution 12 by Reptile Kendrick in the 93rd\nMitchell, the 88th, Scott of the 76th Williams of the 168th,\nHutchinson of the 107th, and others resolution expressing\nsupport for the creation of a reparation study committee,\nHouse Resolution 13 by Rep. Kendrick of the 93rd,\nGovernor of the 85th, Scott of the 76th, Williams of the 168th,\nHutchinson of the 107th, and others,\nResolution urging the United States Congress\nto enact legislation removing cannabis\nfrom the Federal Control Substances Act.\nHouse Resolution 14 by Rep. Williams of the 168th,\nwhilst on the 7th, Burns of the 139th,\nof the 143rd, inspiring the 135th and others,\na resolution creating a national statuary,\nhall collection, replacement committee,\nthrough second readers.\nYou\nYou\nYou\nIf I could have your attention please, if I could have your attention please.\nWe have a member of this body who has deliberately failed at all to be tested since we began\nsession, clearly in violation of our testing policy, jeopardizing the health of other members\nin this chamber.\nSo I'm going to ask that member, I'm going to try to be as discreet as possible to quietly\nleave the chamber unless you prefer it otherwise.\nSo I have not heard the will of this house that we abandon our testing policy.\nIs it your desire that we not be tested?\nThen I'm going to ask a member of the public safety unit back there under rule four of\nthe House to escort the member from the chamber. He'll be eligible to return once he's complied\nwith our testing policy.\nAny public safety officer, uh, member of the Georgia State Patrol is authorized under\nroom four of the house to escort the member from the chamber.\nHouse will come back to order. House will come back to order. This house will be at\norder. You know this job sometimes is not all it's correct up to be but I don't\nknow about y'all but I've been to too many funerals and I'm getting tired of\ngoing to them. I don't know when this will end. We all pray that it'll be sooner rather\nthan later but until that time I think it behooves us to do whatever we need to do to be safe\nand to show love toward our neighbors rather than go out there and get media attention\nfor standing up to authority and I'm going to stop right there. Reports of\nstanding committee is the clerk will read. Representative Chan Takersley the\n160th District Chairman of the Committee on Intergovernment Coordination\nLocal submitted the following report. Mr. Speaker your committee on Intergovernment\nCoordination Local has that under consideration the following bill of the\nHouse is instructed me to report the same back-to-the-house following\nrecommendations, House Bill 61, due pass, respectfully submitted,\nrepresentative, chakersley, 160th district, Charmin.\nThat completes the reading of the Reports of Standing Committees.\nThird reading and passage of uncontested local bills.\nIf there is no objection, well, we only have one, so we'll vote on it as a whole with a recorded vote.\nThe clerk will read the local calendar.\nHouse Bill 61, my resident, Carpenter IV, Whitfield County, House Bill 61,\nauthorized Whitfield County to exercise all redevelopment powers in the Georgia Constitution and code.\nIs there any objection to the previous question being ordered on the local calendar?\nThe chair hears none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair hears none.\nThe report of the committee is agreed to.\nNow this bill now pass all those in favor of the passage of the bill and the local calendar\nwill vote aye those opposed will vote no and the clerk will unlock the machines.\nhave all members voted have all members voted\nAll members now voted if so, the clerk will lock the machines on the passage of the\nbill on the local calendar. The I's 131 the nays are one. This bill having received\nthe requisite constitutional majority is therefore passed for what purpose does representative\ncarpenter rise make a motion state your motion. I move that the House immediately transmit\nthis to the Senate.\nOn the gentleman's motion that the bill be immediately transmitted to the Senate, all\nthose in favor of the motion?\nOr is there any objection to the motion?\nIs there objection?\nChair here is none and it is so ordered.\nYou\nYou\nAll right, we're going on now to morning orders.\nThis house will come to order a lot of movement going on around here today.\nGoing on now to morning orders, we'll do a little different today.\nnot going to divide it up per member.\nWe're going to see who will respect the time of their\ncolleagues, but we'll turn it off after 20 minutes\nbecause that's pursuant to the rule.\nThe chair recognizes Speaker Ralston for a morning order.\nThank you Madam Speaker.\nA few years ago I had one of those moments that kind of last for a lifetime and I've cherished\nit since then, and it remained stamped in my memory.\nSitting in what was then Son Truss Park, I had an opportunity to sit and have a long,\nunhurried visit with a true hero, a giant with whom I had grown up, but I had never met.\nAaron. I told him that night that I could not remember a time in my life that he was\nnot a part of my world, although we had never met. You know, growing up a baseball fan\nback in the 60s, we didn't have 20 games a night to choose from on TV. You got one on\nSaturday afternoon with Dizzy Dean and P.W. Reese doing the play by play and I can\nremember how excited I would be on those Saturday afternoons when they had the\nMilwaukee Braves on and I still remember the celebration in this city across\nGeorgia and indeed the entire southeast when it was announced that the\nThe braves were moving to Atlanta.\nBig League Baseball was coming to the South because at that time, if you wanted to clean\nclosest to home, you had to pull for the St. Louis Cardinals or the Washington Senators.\nWe all became Hank Aaron fans from Little League Fields to Cal Pastures all over.\nSome boys tried to imitate that looping, fluid swing, and the smooth, seemingly effortless\ncatch of a fly ball in the outfield.\nFor most of us, we didn't see a black man.\nWe saw a ball player, a baseball grade who was quietly becoming a legend, and he was\na legend who played for the Atlanta Braves, not the New York Yankees, not the Los Angeles\nDodgers, and not the Chicago Cubs, but Hank Aaron was ours.\nMost of us were oblivious to the struggles of Hank Aaron on the road to becoming a super\nstar until later.\nWe were not aware of the hate mail, the cat calls, and the various other forms of hostility\nwhich were heaped upon this man.\nBut we saw a man of quiet dignity and a goodness that caused him to suffer in silence.\nHank Aaron will be defined by April 8, 1974 when he made baseball and sports history in\nan iconic moment.\nBut he will also be defined as a sports star who quietly gave back to his community and\nwho demonstrated that grace and dignity mattered.\nAnd a man who just two weeks before his death was doing something as simple and heroic as\nadvocating for people to take the COVID vaccination.\nHe was a legend.\nAnd he was ours.\nBut through it all, he was a ball player.\nI know that Chairman Smiley wants to be heard, and I think that Chair is going to recognize\nhim next, and we'll have a little treat after his remarks.\nBut I think it would be appropriate, Madam Speaker, for us to reflect and with a moment of silence\non this life.\nThank you. I yield the well.\nChair recognizes the Dean of the House,\nRepresentative Smarring, for a morning order.\nGood morning, now.\nThe speaker and members of the House.\nBefore I make my remarks, I want to thank you, Mr. Speaker, for your leadership this morning\nand ensuring the safety of all the members of this house.\nYou know, Speaker alluded to this, but Hank Aaron died from natural causes, and I was\nwith him when we took the COVID-19 vaccination together. And I want to thank him for that.\nAnd on our tombstones, there will be two dates, the day that you're born and the day that\nyou pass away. It's not your birthday, which we celebrate, nor your passing date, which\nwe mourn that matters on your tombstone. What matters on your tombstone is what did you do with the\ndash? What would your dash say? Hank Aaron dash will say yes he was a Hall of Famer,\nyes he received the Stam usual lifetime award, yes he was a successful business person,\nbut I think the person that I know his dash will say that he was a given person.\nthat he was a compassionate person that he did not waver in his love for his family\nin his community, in his state, and his nation. So I joined Speaker Austin and other members\nthat have signed the resolution on commending him for his life and San DeBilla Aaron.\nI talked to a family representative last night and she says thank you Mr. Speaker for this\nrecognition this morning when I text the speaker over the weekend and told him how I felt\nabout this and he knew that we all loved Hank Aaron and I met Aaron about 30 years ago\nbut I said in Fortin County Stadium on April I was a young man running for public office\nin 1974, and I saw him hit 715 on April the 8th, 1974, in the upper, upper, upper, upper,\nupper, upper, upper, way up there, out, in the upper, up, needed binoculars to see him\nrun around the bases, but to, to Bill Aeron and to the Aeron family, I want you to know\nknow that this house stands with you during this difficult time.\nAnd I pray that God hold you close to his heart where he can feel and know your deepest\nlost and then feel you with his deepest love.\nSo Mr. Speaker, thank you for this resolution and on behalf of the Aaron family.\nWe thank all of you all.\nHank Aaron was a favorite son.\nHe was someone we saw as a sports person, but I see him as a walk-in living legend, an\nicon in our state and in our nation.\nThank you, Mr. Speaker, and I yield well.\nThrough it all, Henry Aaron persevered.\nHis pursuit of baseball's most cherished record continued, and on opening day of 1974, he took\nhis place alongside Babe Ruth.\nThree one-fifth, air to drive into one field.\nThat ball is going, going, and out of here.\nHenry Aaron has just tied.\nThey broke in the all-time home run parade.\nThe record they said that couldn't be reached\nhas just been reached by Henry Aaron.\nFour days later, Aaron and the Braves\nheaded home to Atlanta.\nGet up for me, man.\nGet up my way.\nOn April 8th, 1974, the Braves hosted the Dodgers in the first home game of the season,\nwith Aaron one swing away from surpassing the Sultan of Swat.\nSomeone told me later once it was cold, I didn't feel a thing.\nThey said it was drizzling, I didn't feel a thing.\nHank told me, you know, that what he's gonna do.\nHe said, I'm tired of this, I'm gonna get this over with right now.\nHere's the pitch by Downey Swinging.\nHere's the drive into left center field.\nThat ball is gonna be out of here.\nNext time, next time, next time, next time, next time.\nThere's a little home-right champion of all time\nat a Henry Aaron.\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nYeah!\nI thought about you coming along, ways, baby.\nYou know what I mean?\nIt's from Mobile, Alabama, all the way\nto breaking one of the most prestigious record\nin baseball.\nI feel very proud of myself.\nI don't know how my mother ever got out of the stand,\nBut I guess she was bent on being out there,\nwhich was fine with me.\nBut she gave me the biggest, tightest hug I ever had in my life.\nI don't know how I got loose.\nHe had tears on his cheek and tears in his eyes.\nAnd I remember being stunned, I said, Henry Aaron is crying.\nWhat a marvelous moment for baseball.\nWhat a marvelous moment for Atlanta and the state of Georgia.\nWhat a marvelous moment for the country in the world.\nA black man is getting a standing ovation in the deep south\nfor breaking a record of an all-time baseball idol.\nNot just thank God, it's all over with.\nThank you very much.\nAt the time he called it quits, Aaron was second all-time\nin runs and hits, and had more home runs,\nRBI's, and total bases than anyone\nwho ever played the game,\ntribute to the remarkable quality and consistency of his career.\nThe way to fame is like the way to heaven through much tribulations.\nIt had been for me to quote a very popular song along in Wyndon Road.\nHe was a pillar of strength and if anybody black, white, red, or technical or has a problem\nyou can look at Henry Aaron.\nIt's a look at the strength he had.\nI think that people can look at me and say, you know, he was a great baseball player, but\nhe was even a greater human being.\nWe've got a few minutes left for morning orders and the chair recognizes Representative\nCarpenter for a morning order.\nyou speaker. I come before you today guys to show you the the rug for this\nsession. They're not in yet but they will be here in about a month and you'll\ncome by my office in 408 and we'll give it to you but it's a great rug. It shows\nthe carpet industry and it's support for Georgia grown and agriculture. So I'm\ngonna hold it up so everybody can see.\nSo of course I'll be dropping this one off in the speaker's office. I yield to\nwell. Always glad to get him. Chair recognizes the whip of the majority caucus,\nwhip Kelly for a morning order. Thank you, Mr. Speaker, and I want to thank you\nfor your words this morning about the seriousness of the pandemic we're dealing\nwith, and the tragedy that our country is going through, our states going through, and\neach of our communities is going through.\nYou talk about us having to attend too many funerals, I agree, and last week, unfortunately,\nour community, the Rotmart community, the Polk County community, had to have a funeral\nfor one of our most beloved members, our city manager, Jeff Ellis of Rotmart, passed\non January the 15th, 2021.\nJeff was a public servant in every sense of the word.\nHe served as the chief of the Rotemart Fire Department\nfor 15 years, and then he served as city manager\nfor 25 more.\n40 years of public service to the Rotemart community.\nHe left his fingerprints all over the city of Rotemart\nin Polk County, from the recreation department\nto our 911 system to redoing City Hall.\nLeft behind from Jeff was his loving wife of 45 years,\nMr. Ginger, son, mate, his daughter, Jennifer,\nfive grand sons, and three great grandkids.\nI ask you, please join me in a moment of silence\nfor this great public servant.\nThank you, Mr. Speaker, and I'll yield the well.\nI understand he passed from COVID.\nChair recognizes representative Dunnohoor for a morning order.\nThank you, Speaker.\nIt could be a little tough, but this morning at 2 a.m., my father, Emory West, and a\nwhose senior went to me with our heavily father.\nBut one of the things, he was an avid hunter, an avid fisherman that passed that loved me.\nHe retired with Southern Bell after 35 years, and we spent a lot of time hunting and fishing\ntogether. But one dream I remember as a young man, he said,\nBubba, we're going to move the Gainesville, Georgia,\nLake Lanier. And I'm going to catch the Lake record large\nmouth bass. Now, he predicted that. Not only did he predict\nthat, he did that. 55 years now, Lake Lanier's record, he\nhas held at 17 pounds and 9 ounces. And I'll never forget\nthat because the love that I have for my Father will continue. But I want to say a quick\nprayer and thank you everyone for reaching out.\nHeavenly Father, we lift you up and we praise your name. We thank you for each person\nhere. We pray that you be with each family that you put your arms around him. You know\nthe needs and the hurts, but Lord do we know you have us all in your arms. We pray for\nmy mom this morning in my family. As I go to them later, that heavenly Father, we know\nmy Father is with you. We lift up all these people in Jesus' precious name. Amen. Thank\nThank you.\nChair recognizes Representative Buttner for a morning order.\nThank you, Mr. Speaker, ladies and gentlemen of the House.\nI too come with a little bit of sad news.\nThe State of Georgia, Taubert County, Georgia, and Junction City in particular, lost the\nlongest serving county commissioner in the state.\nHe passed away January 15th of COVID, and he had served Taubert County as commissioner\nfor 50 years.\nDecember 31st he ended his term after serving 50 years, 35 of the 50 years he was chairman\nof the county commission. I thought it was kind of interesting to learn some things\nabout him as we visited and when he first started in the county commissioner, one of the\nthings he wanted to do was improve the pay and benefits of the county employees. And\nThe other thing he wanted to do was make sure that we had a way for people that were hurt\nor injured to get to a hospital rather than calling the funeral home and writing in\nthe Hearst.\nHe wanted an ambulance.\nSo he set up our ambulance system.\nHe set up seven, he and the rest of the county commission and a lot of grant need help\nalong the way.\nWe now have seven volunteer fire departments, an EMT system and we also were the first\nof many counties to look at how we could coordinate services and we are the first region to have\neight counties come together for a 911 call center. But when you talk to him the thing he was most\nproud of is that his boys went to 4-H camp and they came home and they said daddy,\nTabet County's got a horrible reputation.\nWe are the county with the most non-flushable toilets\nin the state.\nAnd so Freeman Montgomery went and did some research,\nand he got a ticket in Blue to Washington,\nand he came home with a block grant in the 1970s,\nof $900,000.\nAnd they went and they put in running hot water heaters, sinks,\nbathtubs, toilets, and septic tanks to over 100 homes.\nAnd Freeman would tell this story off of them.\nHe would say that a man in his 90s came up to him\nin a public meeting one day and he said,\nyou know, Mr. Montgomery, I gotta thank you.\nYou got me out of the bushes.\nHe said that was his most proud moment, and he would tell anybody that ran for office\nhe said, if any of us run for elected office and we serve for just a day, there are going\nto be those who love us and those who hate us.\nBut he said always remember to make yourself available.\nTo vote time to the job, be honest whether they like it or not, be dependable and be\naccessible and if all of that doesn't work when people call you call them back.\nSo if you would remember his family, his grandchildren and his wife and it is a sad time\nshe has COVID now and they are quite fearful for her as well and Talbot County lost someone\nwho has served them well.\nThank you.\nChair recognizes the Governor's floor leader, Representative Burt Reeves.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nToday I rise to provide some context and some clarity and some talking points about the\nnews stories that are being passed around amongst some of our colleagues and our friends\nout in the hallway.\nThe top story in today's Atlanta Journal Constitution reads, quote, no boost in budget\nfor pandemic.\" It makes it sound as if Georgia has ignored the pandemic. In fact, you have\nto read all the way to the 11th paragraph on page 8A before the story notes that more\nthan $1 billion has been spent by the state government alone in Georgia to respond to\nthe pandemic. And that is more than four times of our annual public health spending.\nIt does not take Georgia Tech calculus to add that up, members.\nHow can that be?\nHow can it say that there's been no boost in the budget when we have quadrupled spending?\nAs recently as last week, Governor Kimp and a press conference said very clearly that\nwe will use every resource.\nOur time, our people and our funding in our response efforts last week when members\nof this General Assembly asked our respected public health leader, Dr. Tumi, why she didn't\nrequest more state funding. She clearly answered that our federal partners have continued\nto provide the assistance that we need, and there's likely to be even more provided under\nthe new administration. In fact, the new administration has already proposed it. They've proposed\n$1.9 trillion. So I urge my colleagues and my friends in the room today, as we work together\nto pass budgets that address the priorities that we all have for our state.\nLet's get past the sensational headlines that very well may sell papers,\nbut do not help Georgians understand the full extent that we have gone through\nto protect both lives and livelihoods in this state. Thank you, Ms. Speaker.\nChair recognizes Representative Wolenski for a morning order.\nThank you, Speaker.\nAs our new U.S. Senators are sworn in, they carried history with them, a history not known\nto many.\nFor me, seeing a Jewish man and a black man in Georgia running side-by-side, running\ntogether for unity and health, jobs, just as for the people who made me extremely hopeful.\nWhile many have learned of the historic significance of the election of the first Jewish and first\nBlack Senators from Georgia, many didn't know the deep history of the Jewish community\nand Black community working together in Georgia throughout the civil rights movement.\nThere is a deep history of the Jewish community and Black community helping each other fight\nfor true justice, because we all know that in justice anywhere, hatred anywhere is injustice\nto everyone.\nTo me, the vision of Senator Assof and Senator Warnoff working together was a 21st century\nversion of Martin Luther King Jr. and Rabbi Abraham Joshua Heschel, a Rep. U.G. from\nHitler's Europe. Dr. King and Rabbi Helstrom can be seen in photos crossing the Edmund\nPettis Bridge, Armin, Armin, Armin, March 1965, and standing together outside Arlington\nCemetery in Silent Protests in 1968. I hope this vision of a Jewish man and a black man\nstanding up together in the fight for equal justice for all inspires us all to come together\nand show the people of Georgia that progress is possible. Their victories prove that the\nhistoric bond between Georgia's Jewish and black communities is alive and well is re-invigorated\nby this historic moment.\nAnother link to Georgia history at Lana History is that Senator Assof was sworn in holding\nHebrew scripture that belonged to Rabbi Jacob Rothschild, past Rabbi of the Temple, a civil\narts activist, and a close ally in front of Dr. King.\nAlso with Senator Assof, in his pocket were copy of the ship's manifest recorded Ellis\nIsland when his great-grandfather arrived in 1911 and his great-grandmother arrived in\n1913.\nA century later, their great grandson was elected to the US Senate, a true American Dream\nstory.\nToday I stand to honor the first U.S. Senator in Georgia,\nJohn Assoff.\nLet's give a round of applause, I hope,\nfor this historic moment at the very least for me\nand all the Jewish people in Georgia.\nThank you.\nI yield the well.\nWe are way out of time on morning orders.\nThose that didn't get reached today will be put\non tomorrow's.\nClark will read the caption to a group\nof privilege resolution.\nHonoring the Life and Memory of Henry Lewis, Hank Aaron, recognizing commending Mayor\nJimmy Guthrie on his outstanding public service, recognizing commending Robert Bobby Howard\non his outstanding services, civil rights advocate, and advocate, and activist, honoring\na life and memory of Jeffrey L. Ellis, recognizing commending and Cagans, honoring a life and memory\nof Alvin Marion Rhodes IV, honoring a life of Mr. Cecil Matthews, and dedicating.\nEcho please the reading of the Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions?\nThe chair here is none and the resolutions are adopted.\nChair recognizes the majority leader for a motion.\nspeaker I would move speak to a resolution speak to a resolution yes or\nthat's better but if you insist that I was going to speak to the motion as\nwell I just wanted to get it done let's speak I would ask the clerk if we\nhad read the caption a resolution relative to meetings and adjournments of the\ngeneral assembly chair recognizes the majority leader to explain the\nresolution. Mr. Clerk, if you will put a schedule up, our proposed schedule. I\nthink my colleagues, all of you know that under this speaker's leadership, his\nnumber one priority is the safety. Number one priority is the safety of the\nmembers of this body. But very closely behind that priority is tending to the\npeople's work of this state and make sure we're here. We're doing our work and\nwe're doing it safely and doing it efficiently. With that in mind, there's been\nbeen very close work. There's been schedules been working out with the Senate\nand Leader Dugan and all the leadership on the other side of the hall. They've\nbeen very welcoming and have the same priorities that we do to make sure this\nentire General Assembly operates efficiently, effectively, but with those\npriorities. So with that, all of you see that we will be in tomorrow, Thursday, and Friday of\nthis week. Then we will be out, of course, on the weekend, back in on Monday Tuesday, Wednesday,\nand Thursday of the following week. And then back on Monday, February the 8th, for day,\nliterally day 13. And certainly all of this schedule is opinion on the continued safety of the\nmembers of this body as we work to make sure we complete the people's work here in the house.\nThere are any questions, Mr. Speaker. I will answer those. We have some very important work that\nwe'll be attending to this week. It will come before us, and certainly the Senate will be close\nbehind us as they work on what we send over to them, but we appreciate them working with us\nas we put this schedule together that moves us on down the road towards completing our work here\nin completing our 40 days.\nWith that, Ms. Speaker, if there's any questions,\nI'll answer them, if not, I'll yield the well.\nYou did not have any questions.\nThank you, Ms. Speaker.\nI ask all those in favor of the adoption\nof the resolution will vote aye.\nThose opposed will vote no\nwhen the clerk will unlock the machines.\nHere we go.\nHave all members voted?\nall members now voted. If you\nhaven't voted, we're going to close\nit down here in a minute. You can\ncome down here and check in with\nthe clerk's office. Final call\nhave all members voted. If so, the\nclerk will lock the machine on the\nadoption of the adjournment resolution the eyes are 136 the nasa zero this\nresolution having received the requisite constitutional majority is\ntherefore adopted chair recognizes the chair of the House appropriations\ncommittee chairman England for an announcement thank you miss speaker good\nmorning everyone first off I do I want to say thank you to to some folks\nand we'll talk about the announcement in just a second, but Ms. Betsy set up here and\nher staff with the House Media Services, those of you that joined us virtually last week\nin our preparation, joint appropriations hearings, they did a phenomenal job on putting\nall of that together and making it run so smoothly.\nAnything, amen, thank you.\nMany mistakes that happened were purely the mistakes of the two guys that were setting\nup there trying to do the operation.\nSo they were flawless.\nThey were flawless again today as our subcommittees met to finish up their work and they'll be helping\nus again tomorrow as we do full committee at 8 a.m. tomorrow morning.\nNow remember, very limited seating in house, our capital 341, about 30 some odd seats\nin there.\nSo there will be some seating there, but many of you will need to watch virtually.\nSo I'll let you know that there will be copies of the bill available for pickup outside\nof 341 and there will also be copies to be picked up outside of the House Budget and Research\nOffice on the fourth floor in the LOB that if you wish to take and look at those tracking\ndocuments as we go through the document tomorrow.\nBut again, tomorrow morning at 8 o'clock, everyone that can please be on either in-person\nor virtual.\nWe appreciate it.\nThank you very much.\nChair recognizes Chairman Tim Barr for an announcement.\nThank you, sir.\nWe are excited to start our members' fellowship tomorrow, room 403, 7 to 8.\nThe members' fellowship, looking forward to kicking that off, a bipartisan group we get\naround.\nWe talk about leadership principles out of scripture, do some prayer requests, family\ntime, and get to know each other.\nSo if you haven't ever been to that, please come join us.\nWe've got a great group tomorrow morning, 7 o'clock, 403.\nThanks so much.\nChair recognizes representative Anola Woods for an announcement.\nThank you everyone.\nThe COB legislative delegation, we're going to have our organizational meeting for the\n21-22 by NAM in room 406 at the LOB right after we adjourn.\nThank you.\nrecognizes representative Alexander for an announcement.\nThank you, Mr. Speaker.\nWe will have a legislative women caucus virtually.\nHowever, you can't pick up your lunch immediately upon a German in room 216.\nThank you.\nThe chair recognizes the chair of the House Rules Committee, Chairman Smith for an announcement.\nSpeaker, I'm all ready to get in booze, coming up here first time.\nThe House Rules Committee will meet tomorrow morning at 915 in room 341.\n915 in room 341 tomorrow morning. Thank you.\nthat completes our announcement and completes our business. Chair recognizes now the\nmajority leader of the house for a motion. Thank you, Ms. Speaker. The\nSpeaker, I move that this house stand adjourned until Wednesday, January the\n27th at 10 a.m. The majority leader has moved that this house be adjourned until\nWednesday January 27 at 10 o'clock a.m. All those in favor of the motion will say aye.\nThose opposed will say no. The eyes have it at this house will be adjourned until Wednesday at 10 a.m.\n",
  "updated_at": "2026-02-12T16:20:00.62655+00:00"
}