{
  "video_id": "CpRbarufYf0",
  "url": "https://youtu.be/CpRbarufYf0",
  "title": "Georgia House - Day 17 (2026-02-16)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 17,
  "video_date": "2026-02-16",
  "duration_minutes": 109,
  "summary": "Overview:\nThe session included a prayer by Reverend Anthony Motley, who emphasized the importance of pledging allegiance to the higher authority of the Constitution and country, not just partisan political interests. He highlighted examples of public officials like Liz Cheney and Brad Raffensperger who demonstrated this higher loyalty during the January 6th events.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Reverend Motley's sermon emphasized the need for legislators to transcend partisan divides and act in the greater good of the country. \n- He praised officials like Liz Cheney and Brad Raffensperger who upheld their loyalty to the Constitution over partisan pressure during the January 6th events.\n- Reverend Motley called on legislators to choose \"a higher loyalty\" over lower political interests.\n\nVotes:\nNone detected.\n\nAttendance:\nNo specific quorum notes.\n\nAdjournment:\nThe transcript does not mention an adjournment time or the next session date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you get into the devotion that COVID testing today is going on until 12.30 pm downstairs. If you have not tested, remember our policy. No test, no admittance. So you got until 12.30 to be tested. We will begin our day with scripture reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from the 56th House District Representative Misha Maynard, representative Maynard. Thank you, Speaker. It's my honor to introduce today Reverend Anthony Motley. Reverend Motley is the senior pastor at Lindsey Street Baptist Church. Lindsey Street Baptist Church has been in existence for 109 years. Its oldest member is mother Savannah Williams. She is 102 years old. The church is located in my district in the English Avenue neighborhood, which is very close to the Mercedes-Benz stadium. Reverend Motley began his journey preaching the Lord's Word, First and Telepusa, Georgia, at Mount Sinai. And then second, he went on to Cedar Town and Rome, Georgia. He has a beautiful daughter by the name of Shanei, a granddaughter named Sanei. And when I asked him, how are things going during COVID? He said that the church has responded beyond his expectation, even more so, glorifying the Lord's name in adversity, without further ado, Reverend Anthony Motley. Speaker, Rostin, my host, representative Misha Maynard, a wonderful legislator who was just simply tailor-made for District 56. She will distinguish her district, herself, her people, this black history in Moth, as a black woman, an African American woman, to all of the members of the black carcass and my dear friends. Many of whom I see with us today, representative Al Williams and others. I've met many of them this morning, whom I've had the pleasure of meeting. Of course, you are, I'm sure proud of your own representative stays Abunds with Nobel Peace Prize people, all of the, my dear legislative friends and to all of the representatives from all over Georgia. I'm sure every district of Georgia, when we, when we turn to pledge allegiance to the flag, we will do so not simply with the mere colors and cloth in mind. But with what, of course, the flag represents and points to and stands for, our allegiance is pledged to the republic for which the flag stands, one nation under God, indivisible with liberty and justice for all of her citizens, citizens of the United States of America, across all lines, racial, religious, regional, sexual orientation, national origin, citizens, age, color, creed, citizens. We dare not reduce our allegiance to color and cloth. We belong to something higher, something nobler. We have a higher loyalty. But when does that loyalty, when does our allegiance, our commitment to that higher authority kick in? In his book, a higher loyalty, FBI director James Comey-Sites, the dinner meeting between he and former president where he says he felt pressured, pulled and some kind of an alien power emanating from the president to persuade him not to reaffirm his allegiance to the Constitution, or to the flag or to the Lord for that matter, but to pledge his allegiance to him, to President Trump, I need your loyalty, I expect loyalty, President said to him, by refusing to do so he made himself public enemy number one, was of course relieved of his duties, there comes a time when party politics, and the partisan divides must give way to what Robert Reich and David Hume referred to as the greater good of the common good. It's a time when the nations and legions must shift from democratic and republican party labels, those labels must lose their meaning and decisions must be made based on what's good for the democracy as a whole. On January 6th, we dodged the domestic terroristic bullet, no matter your politics, when the Congress was in the process of certifying the election of Joe Biden as president Kamala Harris as vice president went in a tipped a coup to destroy our democracy and installed a Soviet style dictatorship was attempted and almost succeeded, but for the intercession of our merciful God. Through officer Eugene Goodman and a host of others, we saw some notable persons who answered the call to shift their allegiance to a high authority, and representative Liz Cheney, a conservative conservative, who nonetheless harness the courage to say the president of the United States some of this mob, let the flames of this attack, none of this would have happened without the president. The president could have intervened to stop the violence, he did not, has never been a greater betrayal by President of the United States of his office and his oath to the Constitution, I will vote to him, peace the president. We saw it in our own Secretary of State Brad Raphson Spurger, who's allegiance to a higher loyalty kicked in to overcome the almost unbearable pressure, presidential power to find the desperate command and chief 11,780 votes. One addition of votes to put him over the top, the Secretary of State and manager Gabriel Sterling made the shift to this higher loyalty, vice president Pence, the most loyal of the former president's loyalists, who because he embraced a higher loyalty. We would not disrupt official procedures to do what the Constitution would not permit him to do, who running for his very life, because his boss set him up for the kill, who the mob sought to hang, refused to embrace. The big lie that the former president won the election by landslide, our governor responded in kind, when by the certification of all 50 states, 61 courts, Congress of the United States of America, Joe Biden won 45 laws, all three are passionate conservatives. We're the opponents of Democrats under normal circumstances, but who nonetheless, at that critical historical moment, shifted gears, laid down the garments of partisanship and wrapped themselves in the garb of a patriot in order to save the Republic. We're never cadenies are attempted with that huge image of himself looming over the city of Babylon to force Daniel and the three Hebrew boys to change their allegiance. They pledge to their God and under the threat of death by the red hot fires of the furnace, maintaining their allegiance to Israel God, Israel's God. They responded with these words, we will not bow because our God is able to deliver us. But if he chooses not to deliver us our allegiance, our devotion, our loyalty, our commitment, our ties that bind our hearts in Christian love and the fellowship of Kenton minds that is like to that above won't permit us to bow down to any other gods. Because he said he's a jealous God. We'll have no other gods before and thou shall not bow down to them. He said, and I serve them. I will visit the iniquities of the fathers upon the children, the third and the fourth generation, but we'll show mercy unto thousands of them that love me and keep my commandments. Our loyalty is to a higher power, a higher authority, a higher deity because he's able to deliver us. He requires full commitment and he rewards the faithful. So when you find yourself standing between the opposing forces of your allegiance to God and the allegiance to men and women legislators, say with Peter, we must obey God. Rather than men, you find yourself between love and hate, choose love, between light and darkness, choose light, between a higher loyalty and a lower one, take the high ground. Between high up or low down, go higher and get seminary's garden Jesus requested the removal of the suffering cup. But when the answer was not in the affirmative, there was a higher loyalty. He responded nevertheless, not my will, but thine be done. Those who are members of Christian churches will be familiar with the words of this old hymn. I'm pressing on the upward way new heights. I'm gaining every day still praying as I own what bound Lord, plant my feet on higher ground. Lord, lift me up and let me stand by faith on heaven's table and a higher plan that I have found Lord, plant my feet on higher ground. My heart has no desire to stay where doubts arise and fears dismay. Those who are made dwell where those are bound Lord, plant my feet on higher ground. Lord, lift me up. Let me stand by faith on heavens table and a higher plan that I have bound Lord, plant my feet on higher ground. Let us pray. For all that you do for us, our Father, which art in heaven, we give you thanks. For your kingdom brought us by Jesus Christ of Nazareth. That will one day come on earth as is in heaven. We give you thanks. In that day when the kingdom of this world shall become kingdoms about God and of his Christ, we shall he shall reign forever.\n\nAnd evermore we give you thanks for our citizenship there because of him your blessings upon this body, these decision-makers, these lawmakers, rest them that they will always do those things that are based on a higher loyalty to a higher power, to a higher God, to a higher deity. In the name of the carpenter of Nazareth, even your son Jesus, we pray for his sake. And it is all safe. Amen. I pledge allegiance to the flag of the United States of America. And this is a result of a rich Spanish, one nation under God, who is visible, who is led to a good news, not not to fall in love with him. Doorkeepers will unlock the doors. Thank you. Chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits. Mr. Speaker your committee on information and audits has read the journal of the previous Legislative Day and I have found it to be correct. And furthermore Mr. Speaker I know I'm not referring to this body but if common sense was large, most people wouldn't be able to grease a pan. I'm keeping a book of these. Chairman Hogan, the chair of the Committee on Information and Audits reports that the journal of the previous Legislative Day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. Mr. Burns on 59th moves following be established as the order of business during the first part of the period unanimous consensus, introduction of bills and resolutions, first reading and a reference of House bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Thank you. Is there any objection to the adoption of the resolution establishing the order of business for the day, the chair here is none and the resolution is adopted. First reading of bills and resolutions, the clerk will read House bill 412 by Representative Dempsey, the 13th, followed the 32nd, better than 94th group of the 43rd and Stevens, the 164th, will be titled an act to amend Title 43 to fiscal Georgia and attended relating to professions and businesses. Regulated industries House bill 413 by reps of camp 111st Thomas the 21st, Matthew, the 73rd, Scott, us the 14th, Campbell the 15th and others, will be titled an act to amend chapter 12, Title 31 of the fiscal Georgia and attended relating to control of hazardous conditions. Health and human services House bill 414 by reps of black men in the 146, Williamson in the 115th, Martin, 49th Smith, the 133rd, Newton in the 123rd, will be titled an act to amend chapter 7, Title 48, the fiscal Georgia and attended relating to income taxes. Ways and means House bill 415 by reps of black men in the 146, Newton in the 123rd, Stevens, the 164th, 930th, Rhodes in the 120th, will be titled an act to amend chapter 5c, Title 48, the fiscal Georgia and attended relating to all types of services. Ways and means House bill 416 by reps of black men in the 146, Stevens, the 164th, Rhodes in the 120th, Newton in the 23rd, 930th, will be titled an act to amend chapter 6, Title 48, the fiscal Georgia and attended relating to tax taxation of intangibles. Ways and means House bill 417 by reps of black men in the 140, Stevens, the 164th, Rhodes in the 120th, 930th, Newton in the 23rd. Ways and means House bill 418 by reps of black men in the 140, Stevens, the 164th, Rhodes in the 213rd, Williams in the 115th, will be titled an act to amend chapter 4, Title 48, the fiscal Georgia and attended relating to tax sales. Ways and means House bill 419 by reps of black men in the 140, Stevens, the 164th, Rhodes in the 120th, Newton in the 246th, will be titled an act to amend chapter 4, Title 48, the fiscal Georgia and attended relating to tax sales. Ways and means House bill 420 by reps of black men in the 140, Stevens, the 164th, Rhodes in the 120th, Smith in the 133rd, Martin in the 49th, will be titled an act to amend chapter 11 in the 48th, the fiscal Georgia and attended relating to tax sales on tobacco and vaping products. Ways and means House bill 421 by reps of black men in the 140, Stevens, the 164th, Rhodes in the 120th, Newton in the 23rd, 930th and others, will be titled an act to amend chapter 9, Title 48, the fiscal Georgia and attended relating to motor fuel in road taxes. Ways and means House bill 422 by reps of 930th, Rhodes in the 20th, Stevens in the 64th, Smith in the 133rd, Martin in the 49th, will be titled an act to amend chapter 5, Title 48, the fiscal Georgia and attended relating to tax sales on tobacco and vaping products. Ways and means House bill 423 by reps of black men in the 140, Stevens in the 64th, Newton in the 23rd, Rhodes in the 120th, Smith in the 133rd, will be titled an act to amend chapter 11 in the 48th, the fiscal Georgia and attended relating to tax sales on tobacco and vaping products. Ways and means House bill 424 by reps of Williams in the 115th, Martin in the 49th, Smith in the 133rd, Newton in the 23rd, Rhodes in the 120th, will be titled an act to amend chapter 7, Title 48, the fiscal Georgia and attended relating to income taxes. Ways and means House bill 425 by reps of 930th, Newton in the 23rd, Rhodes in the 120th, Stevens in the 164th, will be titled an act to amend chapter 7, Title 48, the fiscal Georgia and attended relating to tax sales on tobacco and vaping products. Ways and means House bill 426 by reps of 930th, Newton in the 130th, Rhodes in the 120th, Stevens in the 164th, will be titled an act to amend chapter 5, C in the 40th, the fiscal Georgia and attended relating to the alternative ad valorn tax on motor vehicles. Ways and means House bill 426 by reps of 930th, the fiscal Georgia and attended relating to tax sales. Ways and means House bill 427 by reps of 930th, Rhodes in the 120th, Stevens in the 164th, Smith in the 130th, Martin in the 49th, will be titled an act to amend chapter 5, Title 48, the fiscal Georgia and attended relating to ad valorn tax on property. Ways and means House bill 428 by reps of 930th, Martin in the 49th, Williams in the 115th, Smith in the 130th, Newton in the 23rd, 930th, and others, will be titled an act to amend chapter 8, Title 48, the fiscal Georgia and attended relating to sales and use taxes. Ways and means House bill 429 by reps of 940th, Williams in the 115th, Smith in the 130th, Newton in the 130th, Newton in the 23rd, 930th, will be titled an act to amend chapter 8, Title 48, the fiscal Georgia and attended relating to sales and use taxes. Ways and means House bill 430 by reps of 930th, next to the 69th, Collins in the 68th, very hard in the 36th, Martin in the 49th and others, will be titled an act to amend chapter 26, Title 43, the fiscal Georgia and attended relating to sales and use taxes. Ways and means House bill 431 by reps of 1080th, very hard in the 49th and other years, but they're funded by the newly createdetically hariage women in the Memphisision and all thosebeyhoods throughout the 30th. Ways and means House bill 431 by reps of the Sussex in the 50th, Weiterدة of com, Jubilee in the 54. regarding conservation and natural resources. Natural resources and environment. House Bill 432 by Representative Johnnie R. The 85th, Jackson, the 64th couch, the 50th, Beverly, the 143rd. For now, the 77th and others, will be titled an act of men titled 12, the E.F.I.S. Go to Georgia, annotated relating the conservation and natural resources. Natural resources and environment. House Bill 433 by Representative McClaren, the 51st and Wilson, the 80th, Bill B.T.O.D. Act of men, Code Section 175, 54th, the 50th, George annotated relating definitions and disposition of personal property. Public safety and homeland security. House Bill 434 by Representative Paul, the 32nd Chasper, the 11th, balance of the 23rd, Hitchens Zone, 61st Taylor, the 173rd and others. Bill B.T.O.D. Act of men, Chapter 60, a total of 36th, the 50th, George annotated relating to general provisions applicable to counties and municipal corporations. Governmental affairs. House Bill 435 by Representative Anderson, the 10th, gravely, the 67th, Washburn, the 111st, Lumpsin' to the 12th and Williams, the 145th, Bill B.T.O.D. Act of men, Article 2, chapter 91 and total 36th, the 50th, George annotated relating to contracting and bidding requirements. Governmental affairs. House Bill 436 by Representative Bruce, the 61st, based more than 63rd, Scofield, the 60th, Jones, the 47th, Jackson, the 64th. He'll be Todd and Act of men, Code 6 and 16, 13, 32.6th, the 50th, George annotated relating to manufacturing, distributing and dispensing. Judiciary non-civil. House Bill 437 by Representative Howard, the 124. Beverly, the 143rd, Scofield, the 60th and Cooper, the 43rd. He'll be Todd and Act of men, Chapter 60, a total of 36th, the 50th, George annotated relating to general provisions applicable to counties and municipal corporations. House Bill 436 by Representative Halton, Human Services. House Bill 438 by Representative Kendrick, the 93rd, Beverly, the 143rd, Neil, the 74th, McLaren, in the 51st, Bodie, the 60th, and others. He'll be Todd and Act of men, Chapter 8 and a total of 35. The official code of George annotated relating to employment and training of peace officers. Public safety and homeland security. House Bill 439 by Representative Hitchens, the 161st, lump into the 12th, states of the 180th, the 145th and gravely, the 67th. He'll be Todd and Act of men, Todd, the 40th and Article 7 of Chapter 42. Public safety and homeland security. House Bill 440 by Representative Polly, the 111th, Louis Ward, the 109th Wilkinson, the 38th, and Douglas, the 78th. He'll be Todd and Act of men, Chapter 31 and Todd, the 36th, the official code of George annotated relating to incorporation and municipal corporations. Governmental affairs. House Bill 441 by Representative Clark, the 98th, Bill, the Todd and Act of men, Chapter 7, a total of 48th, the official code of George annotated relating to income taxes. Creative arts and entertainment. House Bill 442 by Representative Collins, the 68th, abstraction of 104th, air heart of the 36th, balance of the 23rd and gravely, the 67th. Bill, the Todd and Act of men, Todd, the 19th, the official code of George annotated relating to domestic relations. Do you have an old justice? House Bill 443 by Representative, the 113rd and Skoggins, the 14th. Bill, the Todd and Act of men, Chapter 12, the total 51 of the official code of George annotated relating to damages. Judiciary. House Bill 444 by Representative Paris, the 142nd, the 88th, Beverly, the 143rd, Holcomb, the 81st Taylor, the 173rd and others. Bill, the Todd and Act of men, Code Section 141 of the official code of George annotated relating to public and legal holidays. State planning and community affairs. House Bill 445 by Representative Bruce, the 61st Bay is the 63rd, Jones, the 47th, go to the 62nd, Martin, the 49th and others. Bill, the Todd and Act of men, the act to incorporate the city of South Fulton and Fulton County. Intergovernmental coordination. House Bill 446 by Representative Kennedy, the 102nd, work eyes, the 157th, go to the 62nd, went to the 89th Alexander, the 66th and others. Bill, the Todd and Act of men, out of the 5th, Chapter 5, of a Todd, the 40th, the official code of George annotated relating to identification cards. Public safety and homeland security. House Bill 447 by Representative Knight of the 130th, hatched 150th England, the 116th and Newton, the 123rd. Bill, the Todd and Act of men, part one of our go on the Chapter 18, the Todd, the 45th, the official code of George annotated relating to state employees, health insurance plan. Special committee on access, the quality health care. House Bill 448 by Representative Knight of the 130th, hatched 150th England, the 116th and Newton, the 123rd. Bill, the Todd and Act of men, out of the 7th, Chapter 4, Title 49, the official code of George annotated relating to medical assistance generally. Special committee on access, the quality health care. House Bill 449 by Representative Smith, the 130th, part one of the 40th, burns the 159th, and for age of the 126th, Bill, the Todd and Act of men, chapter nine, the title 45, the official code of George annotated relating to lasting or excavating near utility facilities. Energy, utilities and telecommunications. House Bill 450 by Representative, the 123rd, hatched 150th, the group of the 43rd, Hodgents and the 107th, gains 117th, Bill, the Todd and Act of men, code section 31, 2A, 18th, the official code of George annotated relating to low THC, oil, patient, registry. Health and human services. House Bill 451 by Representative, Lumpston, the 12th, Williamson, the 115th, 930th, Carson, the 46th, and Mark, the 49th, Bill, the Todd and Act of men, part one of Article 2, Chapter 5, a Title 48, the official code of George annotated relating to property tax exemptions. Ways and means, Bill 452 by Ronson, Chasper, the 11th, Williams, the 148th, Smith, the 133rd, Bentley, the 139th Burns, the 159th and others, Bill, the Todd and Act of men, code section 48, 740.34, the official code of George annotated, relating to tax credit for class, three railroads in reporting. Ways and means, Bill, 453 by Ronson, McDonald, the 26th, Ridley, the 6th, corporate of the 174th, Lumpton, the 17th, Polly of 32nd and others, Bill, the Todd and Act of men, code section 42, 86.1, the official code of George annotated, relating to special license plates. Motor vehicles, Article 454 by Ronson, Newton and the 123rd hatch of the 150th, Cooper, the 43rd, Gaines, the 17th, and Hawkins, the 27th, Bill, the Todd and Act of men, code section 33, 20C, two, the official code of George annotated, relating to online provider directories. Special committee on access to quality health care. House Bill 455 by Ronson, a bar of the 103rd, corporate of the 174th, ticket of the 140th, Jasper's thing, 11th, went in the 89th and others, Bill, the Todd and Act of men, chapter 2, a total of 20, the official code of George annotated, relating to elementary and secondary education. Education. House Bill 456 by Ronson, Representative Smith of the 18th, next to the 16th, Collins to the 68th, Bill, the Todd and Act of men, and that providing for the Carroll County Board of it, of elections. Intergovernmental coordination. House Bill 457 by Ronson, Jackson, the 64th, Hopps, the 153rd, Frazier, the 126th, Hutchinson, the 177th, Scott of the 76th, Bill, the Todd and Act of men, Article 166, the Todd and 19, the official code of George annotated, relating to child provisions regarding, Alimony and child support. Judiciary. House Bill 458 by Ronson, the 43rd, Holcomb and the 81st, Gaines, the 17th, the 23rd, Hawkins, the 27th, Bill, the Todd and Act of men, Chapter 34, Title 43, the official code of George annotated, relating to physicians and physician assistants. Halt and human services. House Bill 459 by Ronson, the part of the 49th Jones, the 47th, the $1.45, Bill, the Todd and Act of men, Article 5, Chapter 36, Title 36, the official code of George annotated, relating to limitation, the taxation of areas furnished. Governmental affairs. House Bill 468 by Ronson, a Martin of the 49th, Hawkins, the 27th Jones, the 25th, Canada, the 102nd, Carpenter of the 4th and others, Bill, the Todd and Act of men, Code Section 10 of 1, 664.1 of the official code of George annotated, relating to restrictions on the ownership, operation or control of dealerships. Motor vehicles. House Bill 461 by Ronson, a Fleming of the 121st, Jones, the 47th, Rich of the 97th, Williams of the 145th, the Loch of the 167th, Bill, the Todd and Act of men, Chapter 2, the Title 21, the official code of George annotated, relating to elections and primaries generally. Special committee on election integrity. House Resolution 144 by Ronson, Williams of the 145th, the resolution honoring the life of memory of Miss Katie Poff, and dedicating an intersection in memory. Transportation. House of resolution 145 by Ronson, Williams of the 145th, resolution honoring the life of Miss, Danette Odom, Jackson, dedicating a bridge in her memory. Transportation. House of resolution 146 by Ronson, a park's the 101st honor, the 82nd Scophield, the 60th, Drenner, the 85th, Clark 100, Nathan others, a resolution creating a house study committee and adverse childhood experiences. Health and human services. House of resolution 147 by Ronson, a power to the 124th, Jackson the 128th, Bentley the 139th, Beverly the 143rd, Scophield the 60th, resolution creating a house study committee on abusive disabled parking permits. Health and human services. House of resolution 148 by Ronson, a lumpstone of the 12th, Coggins of the 14th, Tarvan of the 2nd, Carpenter of the 4th, Ridley the 6th, resolution honoring the life of memory, Probe H. Judge John Payne, and dedicating the intersection in his memory. Transportation. House of resolution 149 by Ronson, a park 100, Nathan, Couch of the 50th, Evans of the 83rd, and Buckner of the 137th, resolution urging the 117th Congress, and the Georgia Congressional delegation to support the Carven Dividend Act. Natural resources and environments. Senate Bill 32 by Senator Brass, the 28th, Robertson the 29th, Berkeley the 11th, Albright the 56th, Scooch of the 51st and others, Bill B. Todd on active men, Code Section 50, 1872, the official go to Georgia, and Tadya relating when public disclosures not required. Judiciary. Senate Bill 33 by Senator, Addiction of the 45th hatch of the 50th, follows the 53rd, Miller of the 49th, Jackson the 2nd and others, Bill B. Todd on active men, Chapter 1, Title 51 of the physical go to Georgia, and Tadya relating in general provisions, regarding torts. Judiciary. Senate Bill 34 by Senator, Addiction of the 45th hatch of the 50th, follows the 53rd, Miller of the 49th, Jackson the 2nd and others, Bill B. Todd on active men, Chapter 12, Title 19, the official go to Georgia, and Tadya relating the name change. Judiciary. Senate Bill 49 by Senator, Addiction of the 45th, Miller of the 49th, Anderson the 24th, Gouge the 51st, Duke and the 30th and others, Bill B. Todd on active men, Chapter 2, Title 8, and the official go to Georgia, and Tadya relating in general provisions, requirements for construction. Agriculture and consumer affairs. Senate Bill 86 by Senator Walker, of the 20th, Payne of the 54th, Hickman of the 4th, Alverso the 56th, tops of the 4th, 14th and others, Bill B. Todd on active men, Part 2, Article 15, Chapter 1, and Tadya, the official go to Georgia, and Tadya relating the fair business, practices active, 1975. Judiciary. That completes first readers. Second reading of bills and resolutions, a clerical read. House Bill 389 by Representative Jones of the 25th, the percent of the 176, Holly of the 111th, the delegate of the 24th, a bill relating to employment security, House Bill 390 by Representative Thomas of the 65th, for now the 77th, Bruce of the 61st, Jackson of the 128, Duke of the 154th, and others, a bill relating to vocational technical and adult education, House Bill 391 by Representative Thomas of the 65th, Holly of the 111th, Maynard of the 56th, Bruce of the 61st, Jackson of the 128th, and others, a bill relating to general provisions, relative to labor and industrial relations, House Bill 392 by Representative, Ridley of the 6th, Powell, the 32nd, Erwin of the 28th, Goggins of the 14th, and Washburn of the 111st, a bill relating to alcoholic beverages, House Bill 393 by Representative Stevens of the 164th, a bill relating to general provisions, or sales, New Year's taxes, House Bill 394 by Representative Stevens of the 164th, a bill relating to taxes on tobacco and vaping products, House Bill 395 by Representative Lenton of the 112th, where a Kaiser of the 157th, Corp of the 174th, Lumps of the 12th, who welcomed the 81st and others, a bill relating to professional counselor, social workers, and marriage and family therapists, House Bill 396 by Representative Green of the 151st, Campbell of the 171st, Duke of the 154th, the bill to repeal and act, creating the South Georgia Regional Information Technology Authority, House Bill 397 by Representative, Workhides of the 157th, Curby of the 114th, McLean of the 100th, Miranda of the 96th, a bill relating to professional employer, organizations, rights, powers, and responsibilities. House Bill 398 by Representative Williamson of the 115th, Hatchet of the 150th, Kelly of the 16th, Blackburn of the 146th, Martin of the 49th and others, a bill relating to conditions, we're taking job tax credit by business enterprise and calculating credit, House Bill 399, my represent clerk of the 147th, singleton of the 71st, built into the 112th Williams, and the 168th, Hulkingwood, the 81st and others, a bill relating to the computation of taxable net income, House Bill 400 by Representative dollar of the 45th, Powell of the 32nd, Jasper's of the 11th, and all of it to the 42nd, Hall of the 111th, the bill relating to property, House Bill 401 by Representative Ayer, Heart of the 36th, Newton of the 123rd, Jasper's of the 11th, and the gravely of the 67th person, the 46th and others, a bill relating to health, House Bill 402 by Representative Davis of the 87th, Drenner of the 85th, Evans of the 83rd, Mitchell of the 88th, Scott of the 76th and others, a bill relating to general provisions, regarding public officers and employees, House Bill 403 by Representative Whedower, of the 119th, preves of the 34th, games of the 117th, Hutchinson of the 107th, all over the 82nd and others, a bill relating to the Georgia child advocate for the protection of children at House Bill 404 by Representative Kenner to the 102nd, Hawkeyes of the 157th, McClarne of the 51st, Kendrick of the 93rd, Hullcomb of the 81st and others, a bill relating to review of individuals, criminal history, record information, House Bill 405 by Representative Lensky, the 79th, rich of the 97th, all over the 82nd, Scott of the 14th, Hullcomb of the 81st and others, a bill relating to general provisions, regarding superior courts, House Bill 406 by Representative Wade of the 9th, Blackwood of the 146th, Ridley of the 6th, Williamson of the 115th, Gamble of the 15th and others, a bill relating to elections and primaries, House Bill 407 by Representative Wade of the 9th, Thomas of the 21st, Glantzend of the 75th, McDonald of the 26th, Gamble of the 15th and others, a bill relating to income taxes, House Bill 408 by Representative Cooper of the 43rd, rich of the 97th, Evans of the 57th, Hullcomb of the 81st, a bill relating to accessory proceedings, House Bill 409 by Representative Gunter of the 8th, Fleming of the 121st, frustration of the 104th, Reeves of the 34th, Kelly of the 16th and others, a bill relating to council for public officials and agencies, House Bill 4010 by Representative Lumson of the 12th, Hitchens of the 161st, Collins of the 68th, Collins of the 14th, Jackson of the 128th, Bill relating to Bingo, House Bill 411 by Representative Galad of the 19th, England of the 116th, Burns of the 159th, Gravel of the 67th, Pershared of the 176th and others, a bill relating to general provisions regarding prosecuting attorneys, House Resolution 129 by Representative Neil of the 74th, Evans of the 57th, Gwyn of the 89th, Resolution proposing a amendment to the Constitution, so as to authorize the general assembly, to provide for the net proceeds of one or more lottery game, so the support economic development purposes, House Resolution 130 by Representative McDonald, the 26th, Jones of the 25th, Kentrell of the 22nd, Wade of the 9th and Gilligan of the 24th, the Resolution ratifying the action of the board of community affairs, approving the transfer of the Forsyth County, from Georgia Mountains Regional Commission, to the Atlanta Regional Commission, House Resolution 131 by Representative Pena of the 94th, Hugh Lave the 136th, Kendrick of the 93rd by the way of the 143rd, Wilkerson of the 38th, the Resolution creating the House Study Committee on Health in Georgia, House Resolution 142 by Representative Green of the 151st, and Perkville of the 150th, the Resolution authorizing the lease of state owned property, House Resolution 143 by Representative Green of the 151st, and Perkville of the 150th, Resolution authorizing the granting of non-exclusive easements. Senate Bill 44 by Senator Thompson of the 14th, the Patrick of the 32nd, Melissa the 53rd, McNeill the 3rd, Huffsetler the 52nd, and others of Bill relating to special license plates. Senate Bill 60 by Senator Thompson of the 14th, Albert's the 56th, Melissa the 53rd, Robert's the 29th, Paine of the 54th and others, of Bill relating to the Georgia State Indimification Fund, 3rd second readers. Okay. Reports of standing committees, the clerk will read. Representative Jan Tancerson, the 160th district chairman of committee on intergovernmental coordination locals submitted the following report. We'll speak to your committee on intergovernmental coordination locals and a consideration of following bills in the house, an instructor meeting report to same back to the house for following recommendations. House Bill 331, New Pass, House Bill 357, New Pass, House Bill 361, New Pass, House Bill.\n\n375 due pass, House Bill 376 due pass, respectfully submitted, Representative Jan Tancersley of the 160th District Chairman. Representative John Corber of the 174th District Chairman of the Committee of Motor Vehicles submitted the following report. Mr. Speaker, Committee on Motor Vehicles is in a consideration to following bills of the House, and is instructed to report the same back to the House with filing recommendations, House Bill 165 due pass, House Bill 179 due pass by Committee substitute, House Bill 353 due pass by Committee substitute, respectfully submitted, Representative John Corber of the 174th District Chairman. That completes the reading of the reports of standing committees. Third reading and passage of uncontested local bills. We're going on down to the local calendar. Going on to the local calendar. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none, it is so ordered that clerk will read the local calendar. House Bill 331 by Representative Frazier, 126th City of Sardis. House Bill 357 by Representative Campbell, 171st City of Pellum. House Bill 361 by Representative Green, 151st City of Edison. House Bill 375 by Representative Smith of the 18th City of Bremen. House Bill 376 by Representative Luricki of 169th, Bacon County. Is there any objection to the previous question being ordered on the local calendar? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? The chair here is none. The report of the committee is agreed to. Shall these bills now pass? All those in favor of the passage of the bills on the local calendar will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bills on the local calendar. The eyes are 162. The days are zero. These bills having received the requisite constitutional majority are therefore passed. We're going on now to morning orders. If you have signed up for a morning order, be making your way to the front of the chamber. Be making your way now to the front of the chamber. The recognizes for a morning order, Chairman Bonnie Rich. We're going to have one minute each for morning orders today. Thank you, Mr. Speaker. This on the screen is Henry Smith with his grandchildren at our local Welfel House in Swanee for their Christmas morning tradition. Henry was a devoted grandfather and husband and he had a goal to live to 100. He faithfully saw his doctors and took his medicine. He was mentally alert and living well when he became sick and he was hospitalized shortly. Unfortunately, he was separated at the door from his family and he was alone and scared. This once confident World War II veteran began calling his son fearful about what was happening to him. He didn't understand. He wanted his son to come be with him and when that couldn't happen, he asked his son to come get him. On the ride to home, he told his son that this hospital's day was one of the worst things that had ever happened to him. Days later, when he got into trouble, his home nurse pleaded with him to go back to the hospital, but he said he would never go back, that he didn't want to relive what he had experienced before. He chose to stay home and be with his family rather than to seek treatment because he didn't want to be separated from them. The time for this to stop has come. Thank you. Chair recognizes representative Bernal for a morning order. Thank you, Mr. Speaker. A March 2nd, we will celebrate Dr. Susan's birthday known as Read Across America Day. In honor of that day, I'm asking that each of us record ourselves reading a Dr. Susan's book and send it to the elementary schools in your district to be shared with the students on March 2nd. I am also asking that members in the house celebrate that day by the men wearing red tie or bow tie and the ladies wearing red and white. Thank you, Mr. Speaker. Chair recognizes representative Moore for a morning order. Thank you, Mr. Speaker. As we observed President's Day yesterday in the middle of Black History Month, I wanted to share my favorite memory in recent history that combines the two. You see on September 12th, 2019, I watched as 26 members of the Georgia Legislative Black Caucus publish a letter in support of the man who would eventually become the 46th President of the United States. Now remember this was in the middle of a crowded field. There was no clear front runner at the time. And admittedly I'd hitched my wagon to a different candidate. But these 26 members of this legislative body had the wisdom to know that experience matters. The foresight to pick a winner out of a crowded field and the leadership to put their name on the line for the man who had become the leader of our party, our state, and our country. So I want to celebrate these members and thank them for their leadership. Chair recognizes representative Scott for a morning order. Thank you, Mr. Speaker. From one female veteran to another, I salute you today. We served in the Army, Air Force, Navy, Marines, Coast Guard, Army reserves, and National Guard. We fought in all the wars and we are still fighting today. Women veterans in this great state, I salute you today. I had the honor of recognizing Nancy Gail Hemp, Jacqueline Perry, Blade Lock, and Better Turner to all the women veterans in this great state of Georgia. I salute you today. Thank you, Mr. Speaker. Chair recognizes representative Scott Field for a morning order. Thank you, Mr. Speaker. I am a black woman, although the nation honors black history for one month, I am proud of my history 365 days strong. Today I present Alice Coachman. Alice Coachman became the first black woman from any country to win a gold medal in track and field. Coachman had come from a poor background in Albany, Georgia, and due to segregation, she was restricted, had restricted access to top quality training facilities and was also often denied the opportunity to train for or compete in organized sporting events. However, that didn't stop her from continuing to develop her strengths and talents. Coachman ran barefoot on dirt roads and used old equipment to train. Then she was taken under the wing of the boys track coach at Madison High School, Harry E. Lash, who recognized her talents. She broke high school and college AAU track records for track and field barefoot. In 1939, she received a scholarship at the age of 16 to Tuskegee Institute in Tuskegee, Alabama. As she continued to dominate the AAU competitions, in 1946, she enrolled in Albany State College. She won the national champion in the 50 and 100 meters races as well as the 400 meter relay and high jump. Despite her back industry, engineering, Coachman set a record for the high jump with a mark of five feet, six and one eighth inches, making her the first black women to win an Olympic gold medal. Thank you, Mr. Speaker. I leave you with this word that she said, her quote is, and I grabbed it to my heart. I paid the way for them all. Alice Coachman. Thank you. Chair recognizes representative Derek Jackson for a morning order. Thank you, Mr. Speaker. Good morning, ladies and gentlemen. Founded 112 years ago on February 12, 1909, the National Association for Advancement of Color People was formed. It is the nation's foremost largest and most widely recognized civil rights organization. It has over 500,000 members and supporters, and this organization continues to fight the good fight to ensure that this true aim that it was created for. And it was created for all people, the rights guaranteed in the 13th, 14th and 15th amendments to the United States Constitution, which promised to end to slavery and the equal protection under law, under the law. The NAACP is a great example when we all come together. Nearly 60 Americans came together, whites and blacks to fight a common cause. And that is a true moment of black history. Thank you, Mr. Speaker. We had one more member who had signed up for a morning order. Representative Hopson, she's waived. We are now going on to the rules calendar. Going on to the rules calendar. Mark will read the caption to House Bill 146. House Bill 146 by members of the Gaines, the 17th Cooper, the 43rd, and others to be entitled to amend Article 20 and Title 45. The fiscal to George annotated relaying the general provisions regarding personnel administration. So it's a provide for paid parental leave for eligible state employees. This bill ever referred to the Committee on Health and Human Services. The Committee recommends that this bill do pass. Chair recognizes representative Houston Gaines to present the bill. Thank you, Mr. Speaker. I bring before you this morning House Bill 146, which is a piece of legislation that this House passed 164 to one last year. And so everybody in this body who was here last year voted for it because the one is no longer with us. So I just want to ask for your support on three weeks of paid parental leave for state employees who apply upon birth adoption or foster care placement for full-time state employees. This is something that President Trump and Ivanka Trump have led on at the federal level, including 12 weeks of paid leave for federal employees. And so we feel like this is a positive step forward for our state, Mr. Speaker. I want to thank you for your leadership on this issue in particular. So happy to answer any questions and would appreciate this body's continued bipartisan support of this measure. Any questions? Thank you, Mr. Speaker. I yield the will. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? The Chair here is none. The report of the Committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 146 will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 146. The eyes are 155. The nays are two. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 93. House Bill 93 by motion of Cooper, the 43rd to be entitled back to amend Title 31 of the fiscal to George Anatetti relating to health. The Chair goes to eliminate duplicative state licensure and regulation of clinical laboratories as bill ever further the Committee on Health and Human Services. That committee recommends that this bill do pass by Committee substitute. Chair recognizes Chairman Cooper to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring to you the Committee's substitute to House Bill 93. We have the federal government regulates labs in our state. But for 4% of our labs, our state bureaucracy has added even higher regulations on them. And so this makes it an even playing field by saying that all our labs will be regulated by the federal standard and the federal regulatory system. In the state, they will still have to report any infections diseases to the state and the state can step in if they are not following federal guidelines. That is the essence of the bill and I would appreciate your positive vote on this measure. And if there are no questions, Mr. Speaker, I will yield the well. You do not have any questions. Thank you, sir. I yield the well. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to adopting the Committee's substitute? The Chair hears none. The Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? So the clerk will lock the machine on the passage of House Bill 93. The eyes are 161, the nays or zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 254. House Bill 254, Representative Lomston of the 12th and others being tied on knack to a menarch on 1 on chapter 23, a title 33 of the fiscal to George Anaceta relating the licensing of agencies, sub-agents, counselors, and adjusters. This bill I refer to the Committee on Insurance Committee recommends that this bill do pass by Committee substitute. Chair recognizes the Chair of the House Insurance Committee. Chairman Lomston to present the bill. Reporting Mr. Speaker, members of the House, I bring to you House Bill 254. This is a department bill that comes as a priority request from the insurance commissioner. House Bill 254 addresses the laws governing the operation of public adjusters in our state. Whenever an insured person files a claim for a law, an insurance adjuster is involved in investigating and coordinating settlement of the claims. Larger companies may use a company adjuster while smaller companies often use a public adjuster. In a natural disaster such as a hurricane or tornado, public adjusters play an important role for many people. Most public adjusters are professional and perform a valuable service in helping those who have suffered loss to obtain repairs and coordinate settlement of their claim. However public adjusters are one of the most consistent sources of consumer fraud. The Georgia Department of Insurance deals with every year, costing consumers millions of dollars. The majority of this fraud is aimed at the elderly, the disabled, or those who are in the most need after a natural disaster. This has been a common problem in most coastal states for many years because like Georgia, they deal with natural disasters and have laws governing the operation of public adjusters that are broad and lacking in specifics. House Bill 254 changes Georgia's public adjuster law to align with similar changes made in Florida as well as Texas, both states that deal with natural disasters and public adjusters. The changes include new licensing requirements, higher standards of conduct, introduces new consumer protections, governs how a public adjuster can present themselves, requires the use of department-approved contracts, specifically bans the public adjusters from serving in multiple capacities, specifically from serving as a contractor as well as the appraiser. It gives the department the authority to adopt rules and regulations necessary to implement this legislation. Mr. Speaker, that is the bill. I'll be glad to answer any questions if there are any. I would appreciate your favorable consideration. You do not have any questions. Thank you. I yield the web. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 254 will vote aye. Those opposed will vote no and the clerk will unlock the machines. The clerk will have all members voted if so. The clerk will lock the machines on the passage of House Bill 254. The eyes are 160. The nays are three. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 200. House Bill 200 by Representative Powell, 32nd to be entitled to amend Title 40. The official go to Georgia and attend every lady, motor vehicles and traffic. Associate of the provide for the issuance of the Class C driver's license to operators for certain three-wheeled motor vehicles. This bill ever referred to the committee on motor vehicles. That committee recommends that this bill do pass. Chair recognizes Chairman Allen Powell to present the bill. Thank you, Mr. Speaker and ladies and gentlemen of the House. You heard about simple bells. This is one that we continue to have to bring up every so many years. Technology that has changed so many of the types of vehicles we deal with back a few years ago because of the driver's license classification. We had to redefine the difference in a three-wheeled motorcycle and a three-wheeled vehicle. We did this a few years ago with that certain definition. Now the changes have been made in these three-wheeled vehicles a little bit more. What we've done is that we have changed the definitions on the driver's license classification and it clarifies the difference between a three-wheel motorcycle and a three-wheel motor vehicle. Excuse me. That was my ex calling me. You want me to take that call for you? No, sir. But if you look on lines 1837 and 45, the definition we've given is that if these vehicles have seat belts in a frame, departure, or fully enclosed, the operator, then these would be considered a three-wheeled vehicle. Thus, they would be exempt from the seat belt in goggles. Mr. Speaker, that's quite simply, I said, as a simple bell, and that's what it is. And I would appreciate your favorable consideration. I'll be glad to answer any questions if there are any. You have some questions. Did you yield? I will, sir. Chair recognizes Chairman Petrie to your left for a question. Does the gentleman yield? Yes, sir. Can you tell us, sir, which ex was it that was calling you? That was the original. You have some coastal confusion, Mr. Chairman. Chair recognizes Representative Al Williams to your left for a question. I could assure you I've never had an ex from that in coastal Georgia. Gentlemen, yield? Yes, sir. There's still time. But I assure you so far, we're kind of happy about that. Very seriously, you know, there might be multiple. What does the current ladies' ex think about the bill? I'm sorry, what does what? Your ladies' ex, not from the coast. Think about your bill. And does she ride three wheels? There's a few of them with mine. What I rode as long as I rode the right thing. Mr. Speaker, this is pretty well self-explanatory bill, and I would certainly appreciate your favorable consideration. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The Chair hears none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. All members voted. Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 200. The eyes are 128, the nays are 35. This bill, having received the requisite constitutional majority, is therefore passed. Clerk will read the caption to House Bill 207. House Bill 207, I'm Representative Corbett of the 174th and others to be entitled in Act 2ment, Title 40, the Fisher go to Georgia, and it's had a relating motor vehicles and traffic. So as a reminder, electronic submission of certain documentation required of manufacturers, distributors, dealers, secretary, and recyclingers, use motor vehicle parts, dealers, and scrap mental processors. This bill, having further committee on motor vehicles, I've committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Corbett to present the bill. Thank you, Mr. Speaker. Members of the House, I'll bring before you House Bill 207, LC 392861S. With the new drive system that Department of Revenue has, documents that previously had to be mailed in, can now be filed electronically, which is easier and more cost effective for the business community. And it brings the state up to date with the way business is being done today. Basic section one of the bill provides that manufacturers, distributors, dealers, engage in the manufacturer's sale, or at least in the vehicle's shower, file this registration electronically, section two of the bill, anyone that cancels a certificate of title where there'd be a scrap mental dealer or an insurance company where they've told the car, that shall be filed electronically. Then the third section of the bill deals with when a court ordered sale, either be it from a repair facility or a tow truck that towed it in and it's been abandoned.\n\nThey have to submit a bill of sale to the Department of Revenue and this shall be done electronically. And that's basically all we're doing with this bill is just bringing us up the way business is being done today and I would appreciate everybody's favor consideration of the bill and I yield for any questions misspeak you do not have any questions. Thank you Is there any objection to the previous court question being ordered the chair here's done the previous question is ordered Is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted? Is there any objection to agreeing to the report of the committee? Which was favorable to the passage of the bill the chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye those opposed will vote no and the clerk will unlock the machines you Have all members voted have all members voted If so the clerk will lock the machines own the passage of House Bill 207 the eyes are 164 the nasors 0 this bill having received the requisite Constitutional majority is therefore passed the clerk will read the caption to House Bill 163 House Bill 163 members a Cooper of the 43rd and others to be entitled an act to men article 7 chapter 4 title 49 That fiscal to Georgia and in Tate relating the medical assistance generally so it's a directed department of community health to submit a state plan amendment diplomatic stress lane enrollment in Medicaid this bill ever referred to the committee on health and human services That committee recommends that this bill do pass by committee substitute chair recognizes chairman Cooper to present the bill Thank you mr. Speaker colleagues in the house I bring to you the health committee substitute to house bill 163 This would establish express lane eligibility What that means is that children that are eligible for snap which is our food assistance program in the state and Covers our families on the lowest lowest income levels That those children would be immediately Enrolled in the Medicaid peach care program for children They are already eligible for this program, but in our current time they have to go through to you were enrollment processes And for many families this is very difficult. They don't have computers They live in South Georgia where they don't have Wi-Fi connections are on my street in East Cobb where I don't have it either Are you know they don't have a car to go to the defects office and we have children across the state That are eligible for health care that are not getting it today because of this glitch in the way our plans you have to apply So this would have direct the state to ask for a state plan Waiver that we could set this kind of program up and say if there's that is it in a nutshell It's will cover many more of our children that are already eligible for health care and I ask for your favorable consideration of a house bill 163 The substitute and if there's no questions mr. Speaker ideal the well You Do you yield for a question Yes, or I'll yield for one chair recognizes leader Beverly to your left for a question As general lady you yes, or I will this is a this is a friendly question um Any event that we expand Medicaid just anticipate that we would have a Medicaid expansion With this bill still apply what we have to redo this Leader Beverly you're you're asking me something. I don't think I'm qualified to answer I guess it would depend on if we still had the separate programs for them and we still had peach care and And a separate sort of Medicaid program for it Yeah, and then just one clarify a question um you talked about Medicaid and and peach care Well-cared peach care combined And does this bill anticipate that if there's another third party insurance that it would already be grandfathered into This particular bill the difference is is that what level of poverty you are you are that's the only thing Medicaid has one level of poverty for this and for snap and all and then it's a little higher to be eligible for the peach care But basically it's one program, but that's why you see it split in the in the in the bill Thank you mr. Speaker. I think I will yield the well Thank you lady as yielded the well. Is there any objection to the previous question being ordered the chair here's none The previous question is ordered. Is there any objection to adopting the committee substitute the chair here's none The committee substitute is adopted is there any objection to agreeing to the report of the committee Which was favorable to the passage of the bill the chair here's none The report of the committee is agreed to shall this bill now pass All those in favor of the passage of the bill will vote aye those opposed to vote no and the clerk will unlock the machines You Have all members voted Have all members voted If so the clerk will lock the machines On the passage of house bill 163 the eyes of 166 the nasa zero This bill having received the requisite constitutional majority is therefore passed Clerk will read the caption to house bill 128 House bill 128 by resident Williams the 145th and others to be entitled back to men chapter one in title 31 The official go to Georgia annotated relating the general provisions regarding health So it's prohibit providers from discriminating against potential Oregon transplant recipients This bill have referred to the committee on health and human services that committee recommends that this bill do pass chair Recognizes representative Rick Williams to present the bill Thank you, miss baker Hello colleagues. I think a lot of you probably remember last year we passed graces law Uh, it was overwhelming majority and I asked for your favorable support again As we try to get this across the hurdle over to the Senate side This is a bill that represented mag Jackson and our co-sponsored last year and again this year Stamp any questions that there are in miss baker You do not have any questions. I ask for your favorable poll consideration. Thank you all very much We have a member that wishes to be heard from on the bill the chair recognizes representative Jackson to speak to the bill Thank you miss speaker today. I rise in support of house bill 128 This is a bill that represented Rick Williams and I worked on on last session And this bill passed out of the house But because of covid 19 it stalled in the Senate Look gracing and her family David and Aaron nobles who are friends of mine are watching us today Ladies and gentlemen I urge you to support house bill 128 once again So we can get it over to the Senate and Georgia can show the nation that we do not discriminate against persons with disabilities Thank you miss speaker a yellow well Is there any objection to the previous question being ordered the chair here's none the previous question is ordered Is there any objection to the agreeing to the report of the committee? Which was favorable to the passage of the bill The chair here's none the report of the committee is agreed to Shall this bill now pass all those in favor of the passage of the bill will vote I Those opposed to vote no and the clerk will unlock the machines You Have all members voted Have all members voted If so The clerk will lock the machines on the passage of house bill 128 the eyes are 166 the nays are zero This bill having received the requisite constitutional majority is therefore passed The clerk will read the caption to a group of privileged resolutions honoring the life and memory of Marcia moral harm and Dodd honoring the life and memory of Bradley Coleman Cole kui Recognizing commending private first class Bradford Davis billard of for completing the Marine crucible on February 25th through February 27th Recognizing commending urban county board of education memory Gary Paul upon the retirement from the board At first 26 years of exemplary service on the urban county board of education honoring the life and memory of Jimmy Ray East Recognizing commending av revs for receiving the 2020 Georgia PA of the year award And for other purposes that completes the reading of the privilege resolution Is there any objection to adopting the privilege resolutions the chair here's none And the resolutions are adopted for what purpose does chairman blackman rise make a motion state your motion Move that house bill 32 be recommitted the ways of means committee clerk will read the caption House bill 32 by resident built in 112th and others to be entitled to enact a men part 9 of article 6th chapter 2 titled 20 Deficit of Georgia antennae really in the grants for educational programs Charming blackman has moved that house bill 32 be recommitted To the ways and means committee is their objection Is their objection the chair here's none and it is so ordered what purpose does chairman Stevens rise to make a motion state your motion I move the house hr 30 be moved from the economic development tourism committee to the regulated industries committee both chairman and agree Clerk will read the caption house resolution 35 represent Stevens to the 164th and others proposing an amendment to the constitution is those to authorize a general assembly to abide by law for the local authorization of a limited number of licensed destination resort facility casino resorts On the gentleman's motion that house resolution 30 Be moved from the economic development and tourism committee to regulated industries committee is their objection Is their objection chair here's none and it is so ordered We're about to go on to announcements If you have signed up for an announcement Then make your way to the front of the cal chamber chair Recognizes chairman Todd Jones for an announcement Thank you mr. Speaker just want to remind everybody that the new wave of bus transportation for children is out on Mitchell Street right now It's a fully EV bus. So take a look at it. Thank you so much chair chair recognizes representative Reeves for an announcement Thank you mr. Speaker two cook announcements to the reuse judiciary non-civil committee will be meeting at 330 today We will take up house bill 411 and a second announcement is the governor is holding a press conference at two o'clock today To talk about the citizens arrest bill which I am holding in my hands here right now in them about the file and you're all invited to that press conference at two o'clock. Thank you chair recognizes representative Evans bickie Evans for an announcement Thank you mr. Speaker the women's caucus will meet today and you can pick up your lunch in two sixteen and Thank you so much chair recognizes chairman tree roads for an announcement Thank you mr. Speaker gain fishing parks today at two o'clock in 403. Thank you mr. Speaker chair recognizes representative gamble for an announcement Thank you mr. Speaker members of the house tomorrow morning at seven o'clock and room 403 the fellowship will meet and I want to encourage all of you to attend It's open day everyone. Thank you chair recognizes chairman duvenick for an announcement Thank you mr. Speaker the house education committee will meet at one p.m. In six o six. Thank you chair recognizes chairman dollar for an announcement Thank you speaker the subcommittee of uh energy utilities and telecommunications the subcommittee on telecom will be meeting at three o'clock upstairs in 403 and There will be a full committee Following that the chairman's going to come speak to that. Thank you chair recognizes chairman collins for an announcement Thank you mr. Speaker the public safety and homeland security committee the subcommittee a will meet today at four 15 CLOB at one p.m. That's public safety and homeland security subcommittee a one o'clock four 15 CLOB chair recognizes chairman Parsons for an announcement Thanks speaker the energy utilities and telecommunications committee will be meetings afternoon at three thirty and room 403 here in the capital it'll be uh at three thirty or right upon a German of the energy uh sub commit at the excuse me the telecommunications subcommittee It'll be a hybrid meeting and you should have received a link for the zoom if that's what you have to attend thank you speaker chair recognizes chairman Cooper for an announcement Thank you mr. Speaker health and human services will meet this afternoon at two o'clock in six o six c.l.o.b Two o'clock six o six c.l.o.b. Thank you chair recognizes chairman setslar for an announcement thank you mr. Speaker the setslar subcommittee of judiciary and non-sub all meet today at one o'clock one o'clock and five 15 CLOB chair recognizes chairman dicky for an announcement Thank you mr. Speaker the uh act calls from consumer affairs committee will meet in the morning at eight o'clock in four six CLOB thank you that completes our announcements I hope you'll join with me we have members celebrating a birthday today representative Sheila Jones is celebrating a birthday representative representative Elmati holly is celebrating a birthday today and happy birthday to representative Tom Kirby and a happy anniversary today to representative Roger Bruce and many much sympathy and condolences to his wife 36 years chair recognizes the chair uh majority leader of the house for a motion mr. Big-R-Muth this house stand adjourned until 10 a.m. tomorrow Wednesday February the 17th 2021 majority leader has moved at this house be adjourned until 10 o'clock a.m. on Wednesday February 17 2021 all those in favor of the motion will say aye those opposed will say no the eyes have it this house will be adjourned until Wednesday at 10 a.m. you you h the",
  "updated_at": "2026-02-13T10:06:16.220488+00:00"
}