{
  "video_id": "crLr2N1HUwY",
  "url": "https://www.youtube.com/watch?v=crLr2N1HUwY",
  "title": "Majority Caucus Press Conference | 02/03/2025",
  "chamber": null,
  "session_type": "press",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the key points from the Georgia Majority Caucus Press Conference on 02/03/2025:\n\n## Overview\nThe Georgia Senate Majority Caucus outlined a conservative legislative agenda focused on providing security and relief for Georgia families and communities impacted by Hurricane Helene. Key priorities include disaster aid, balancing the civil justice system, and protecting children in schools.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Senate President John Kennedy thanked the caucus members for their unity and hard work, and outlined three key priorities:\n  1. Providing state resources and relief to communities devastated by Hurricane Helene\n  2. Balancing the civil justice system to ensure fair access and stabilize insurance costs\n  3. Protecting children and creating safe school environments\n- Majority Leader Steve Gooch framed the caucus' agenda around providing \"security\" for families, neighbors in need, and job creators. He highlighted plans to explore legislative remedies to assist timber owners and farmers impacted by Hurricane Helene.\n\n## Votes\nNone detected.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment or next session date mentioned.",
  "transcript": "Good afternoon everyone. I want to thank you for coming. I'm John Kennedy and I have the\nhonor of serving as the president of the Georgia Senate. On November 5th of last year,\nthe people of Georgia sent the majority caucus a mandate. They told us and told the rest\nof you that they wanted competent, consistent, and effective leadership to bring conservative\nprinciples to the Georgia legislature and to continue to make sure that we governed\nlike that.\nI would tell you that in my years of serving in the Georgia Senate, our caucus has never\nbeen more united than we are today.\nWe have brought forth a conservative agenda, and in a few minutes I'm going to pitch\nit to our majority leader, Steve Gooch, who is going to give you some details of some\nthe legislation that we're going to propose. But I want to thank the members of my caucus\nfor their hard work, not only during this legislative session, but the work that we've\ndone before session to decide those priorities that we want it to bring forth, and also\nthe hard work that they're going to continue to do during the 40 days that we're going\nto be working here. For those of you that are not here but are following along at home,\nso to speak, if your senator is standing behind me, please know that they are dialed in\nand laser focus to make sure that they're doing the good, hard work for you and the work\nfor Georgians that we need to continue to maintain good, conservative, and common sense\npolicies.\nI want to touch just on three areas before I pitch it to our majority leader.\nFrom Governor Kemp to our Speaker Burns to Lieutenant Governor Bert Jones, they have\nWe've been clear that we must provide certain things to the people of Georgia.\nAnd three of those are one, we've got to provide relief to the parts of Georgia that have\nsuffered from Hurricane Helene.\nThe devastation, if you have not seen it, is significant.\nAnd the communities that have suffered under that hurricane are simply not going to recover\nif we don't provide the state resources that we can.\nThe families that have been devastated by Hurricane Helene have suffered generational losses\nand they need help as well.\nWe're going to do all that we can and we're going to be creative.\nI want to thank Governor Kemp for the proposals he has already placed in the budget and the\namended budget to help those folks that desperately need that help.\nBut the truth is, there are simply communities that are not going to recover if we don't\nprovide help.\nSecondly, we have to balance our civil justice system.\nWe've got to do that to provide fair access to everyone that needs to go to court, regardless of what side of the V that you're on.\nBut we also have to make sure that we stabilize the cost of insurance for consumers across Georgia.\nAnd we've also got to make sure that we keep a positive business environment to help those\njob creators so that we continue to have a positive business environment.\nAnd third, one of the things you're going to hear us talk a lot about this session.\nAnd the legislation you're going to see come forth from this caucus is going to be protecting\nchildren.\nThe stories that we've heard around the country of school shootings got visited on us\nand our state last fall.\nAnd as a father of two, it's devastating to think about the school environment that was\ncreated that day.\nWe're going to make sure that we continue to do what we can and be creative so that children\nthat are going to school know that they're in a safe school environment, that parents\nthat are dropping their children off at school know they're dropping their children off\nat a safe location, and finally to make sure that the administrators and the teachers that\ngo to work every day to teach our children are doing so in a safe environment.\nI want to thank you for being here. I want to tell you that this caucus is going to continue\nto work hard and bring common sense legislation forward. And at this point, I want to call\non our majority leader, majority leader Gooch, who's going to give you some details of\nthe things you're going to hear about as this session continues to unfold between now\nand April the 4th.\nThank you, John.\nThank you, Mr. Pro Tem.\nGood afternoon, ladies and gentlemen.\nIt's my pleasure to be here.\nStanding before these fine gentlemen and ladies behind me,\nwe have been working already for three weeks.\nAs you all know, this is legislative day 10 out of 40.\nSo we are well underway and anxious to get to work.\nMany of our efforts and our priorities are already in motion.\nYou've been reading about them in the local and Atlanta news\nand around the state.\nBut today, I want to talk about the agenda\nthat we've set for our caucus this session.\nIt's important for our priorities to reflect\nthose of the citizens who sent us here to do the people's work.\nComing off of a historic election last November,\nwhen Donald J. Trump was elected president again,\npresident number 47, it should be easy to understand\nthat the message sent by the folks around Georgia\nand across our great nation, their message can be summed up\nin one simple word.\nand that word is security.\nWhether it's economic security by cutting the income tax\nor returning billions of dollars of unspent surplus funds,\nas we've seen through the leadership of Governor Camp,\nand of course the leadership of the House and the Senate,\nwe continue to look for ways to cut waste,\nand we'll continue to look for ways to cut waste\nas we go forward in this session and next year as well.\nPhysical security, which includes stopping violence\nand violent crimes from occurring in our state,\nin our communities, and back home,\nand the flow of drugs and criminals\ncoming across our borders,\nor even what I would consider emotional security,\nwith a return to societal sanity\nby ending the assault on common sense\nby the overly weight-woke radical left in our nation.\nI don't expect the corporate media,\nor even the DC Washington establishment\nto get the message that I'm delivering today,\nbut when two Democrat U.S. senators from Georgia\nvote for the Lake and Rally Act just days ago,\nat least some folks on the left understand\nthat they have strayed too far in a fantasy land.\nAnd as a result, neglected the basic needs\nof the people that are supposed to serve\nevery day Americans and right here in Georgia as well.\nWith that context as our guide,\nthe Senate majority will spend these 40 legislative days,\nfocus on issues that enhance security for families,\nespecially children, security for our neighbors in need\nand security for the job creators\nwho help provide the economic opportunity\nthat ensures safe, stable, and healthy communities.\nFrom Valdosta to Augusta, Hurricane Helene\ncut a path of destruction across our state\nlike never seen before in our history.\nBillions of dollars in losses.\nPeople out of jobs, people out of school,\npeople with nowhere to sleep, people without water,\nno sewer, no access to their community medical providers.\nThese are things that we think are key and critical\nto providing a safe community in a safe state\nfor our families to live work and play.\nAs you have heard from Governor Camp,\nLieutenant Governor Jones and Speaker John Burns,\nThere will be a substantial aid package in our budget this year that will help\nGeorgians recover from the heartbreaking losses that was due to no fault of their own.\nOver the years, Georgia Republicans have conservatively managed our resources and\nbuilt surpluses for preparation for days like today.\nIn addition to our mutual support for disaster aid, our caucus will be exploring potential legislative remedies to help\nfellow Georgians who are hurting. Senator Russ Goodman, who stands behind me today,\nis examining ways to temporarily relieve the heavy tax burden on the timber owners in\nSouth Georgia, whose family legacies have suffered generational losses while they develop\nplans to recover. Secondly, Senator Sam Watson, a proud farmer\nhimself, who also served as our lead on monitoring ongoing federal and state relief efforts for\nour broader farm communities around our state.\nKeeping up with what's going on in Washington\nis a day-to-day responsibility.\nSenator Watson's up for the task,\nand he'll continue to work with our congressional delegations,\nour U.S. Senators, and of course, our White House as well.\nFinally, Senator Larry Walker would be evaluating\nour consumer protections, including price gouging,\nto understand how we can better protect everyday\nGeorgians in the aftermath of such disasters.\nIn the past, Senate Republicans have made various attempts at lawsuit reform with admittedly\nlimited success, and while some of our efforts came up short, it was simply due to disagreements\nover how to achieve the correct balance point for the scales of justice.\nWhat always remain true for our caucus and certainly hold true today is that we all\ncare about Georgian's litigation climate and how it adversely affects hard work in Georgians.\nGovernor Camp has made this a top priority for this session and I believe that he has adequately\narticulated the need for such reform. He has highlighted a hospital in northeast Georgia\nforced to close their labor and delivery unit due to workforce challenges and soaring insurance cost.\nThe South Georgia grocer that lost their insurance coverage completely because of frivolous\nlawsuits were filed and the courts found in favor of the plaintiffs.\nAnd countless other small businesses across the state that are just simply unable to afford\nskyrocketing insurance cost which we've seen in excess of 25 to 50% in the last two to\nthree years.\nAs a small business owner himself, Governor Kemp noted, if you can't get insurance, you\ncan not run a business.\nAnd if you can't pay your employees, and nobody can afford to spend years and millions\nof dollars in the courtroom battling to keep the doors of their small businesses open.\nAs he said, we can't put a band-aid on this problem.\nWe've got to fix the root of the issue, and our caucus stands ready to be part of the\nsolution, we stand behind Governor Camp, Lieutenant Governor Jones and Speaker John Burns.\nMost importantly, our caucus is prioritizing the security, whether it's physical, economic\nand emotional of our state's greatest blessing, and that is our children.\nWe will protect them because they cannot protect themselves.\nTheir innocence must be guarded so their futures remain unlimited.\nThere will be another round of robust school safety grants this year.\nIn support of those grants, our caucus has prioritized two critical school safety measures.\nSenator, end of the tard days, Ricky and Alisa's law would require all Georgia public schools to install mobile panic alarm systems directly linked to emergency responders and state and local law enforcement personnel.\nThe bill also mandates that each local school system procure local mapping data for each\npublic and private schools within its boundaries.\nIt should be noted that Ricky and Alessas Law is also deeply rooted in personal to three\nof our senators here behind me.\nSenator Clint Dixon, Senator Calzert, and Senator Frank Ginn, who serves the families of\nBarrow County that was impacted last year by the tragic shooting at the Appalachian\nhigh school in which coach Richard, Ricky William, Aspenwall, Aspenwall was killed just\nlast September. Additionally, Senator Dixon is invested in another caucus priority as\nhe and Senator Dolezal are working to ensure timely and accurate transfer of documents when\na troubled student changes schools from one jurisdiction to the other. Include, inside\nthose other safe schools, we want our students focused on the skills that set them up for\nfuture success in the working world.\nThe number one skill which is foundational for all learning is the ability to read and\ncomprehend.\nThat is why Senate Republicans have made literacy a multi-year priority.\nIn past sessions, we have laid the groundwork for improving literacy, but our work has only\njust begun.\nWith the leadership of our new Senate education chairman, Billy Hickman, who stands behind\ntoday we will continue to build on this solid foundation. Finally our caucus\nbelieves that safety for our children extends beyond the schoolhouse doors and\nout onto the fields of competition. Security should be a filling not just\nreserved for the classroom but also for the locker room. As mentioned before\nSenator Greg Dolezal's fair and safe athletic opportunities act is a\npriority for this caucus.\nWhile I understand that there will be similar bills\nintroduced this session in the other chamber,\nas well as the Senate, this comprehensive legislation\nbans biological males from participating in women's sports\nacross Georgia, middle school, high school, and college.\nThe time of half-measures, exceptions, and workarounds\non this issue is over.\nIn closing, our caucus is doing what is hard to do.\nThe primary and essential things, things that are hard to see,\namidst the distractions of daily life,\nthings that we all take too often for granted,\nand we will improve them wherever we can.\nThat's how we will get it done.\nThat's how we're ensuring that we restore a sense of security,\nand a renewed optimism for our neighbors and our children,\nthe teacher and the farmer,\njob creators and hardworking Georgians.\nThank you for coming today.\nWe're turning it over to you guys now\nLet's take a few questions.\nI think we're already putting funding in the budget if you look at the last three years\nI think we've added millions of dollars, tens of millions of dollars each year for that\nand we'll continue to fund that,\nI believe, into the foreseeable future,\nwhich gives the local districts full of flexibility\nin how they use those funds.\nAnd that'll all be subject to appropriations\nas we go forward this session.\nThat's right.\nSchool safety. That is a bigger umbrella. Those are three categories with multiple pieces\nof legislation under those three umbrellas.\nI believe you'll see more efforts being put forth on what the governor announced two weeks\nago on the Pathways program.\nI think the Senate is fully supportive of his efforts on that.\nWe do not support a full expansion of Medicaid at this time.\nThank y'all very much for giving us a great day.\nThank y'all very much.\n",
  "updated_at": "2026-02-12T19:04:34.101355+00:00"
}