{
  "video_id": "czl-OlduI_g",
  "url": "https://www.youtube.com/watch?v=czl-OlduI_g",
  "title": "Rules Meeting 2026 - Day 15 AM Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 15,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the Georgia Rules Meeting 2026 - Day 15 AM Session:\n\n**Overview**\nThis session featured discussions and votes on several bills, including HB545, HB57, HB948, HB971, and HR99. Notable moments included questions and debate around HB934, which would transfer securities and commodities oversight from the Secretary of State to the Department of Banking and Finance.\n\n**Key Actions**\n**HB545**: Creates a statewide rule for handling appeal transcripts, eliminating inconsistent local practices.\n**HB57**: Adds step-grandparent and step-grandchild relationships to Georgia's incest law.\n**HB948**: Requires more disclosure in foreclosure documents about excess funds.\n**HB971**: Allows municipal and county electric membership corporations to enter into longer-term contracts with end-users.\n\n**Bills Introduced (First Reading)**\nNone noted in the transcript.\n\n**Notable Moments**\n- Debate around HB934, which would transfer securities and commodities oversight. Questions were raised about an ongoing investigation that could be hindered by the change.\n- Representatives provided overviews and answered questions on several other bills.\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nNo quorum notes provided.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "Morning everybody.\nI ask everybody to take their seats and\nwe'll call the meeting to order. Please\nmorning.\nGood morning everybody. We're going to\ncall the meeting to order and we'll ask\nfor Williams to open us with a word of\nprayer. Please\n>> let us pray.\nMerciful and everlasting God, we thank\nyou once again for the opportunity. We\nthank you for those that have gathered\nto help the state of Georgia and his\ncitizens. Lord, we ask that you guide\nour minds. Help us to realize that you\nare the ultimate authority and to follow\nyour word. What is in Jesus's name we\npray. Amen.\n>> Thanks, sir.\nOkay, let's go ahead and we'll begin. Uh\nJeremy Camp, go come on up.\n>> Good morning. Thank you, Mr. Chairman.\nI'm looking at HB948, which is on the\nsecond page, sixth down,\nand we are looking at LC 620306S.\nThis bill is one that creates more\ndisclosure when someone is foreclosed in\nthe foreclosure documents to let\nindividuals know that if there are\nexcess funds available after all the\nforeclosure proceedings, how to get\nthose funds back.\n>> Okay. Don't see any questions. Thank\nyou.\n>> Thank you,\n>> Chair Lady Hagen. Members, when you come\nup, if you would please uh before you\nbegin, give us the House number and\nwhere it's located on the blue sheet.\nMake it easier for the everyone to find\nit. If you would please help us move\nalong. Thank you.\n>> Thank you, Mr. Chairman, committee. I\nhave House Bill 983. It is on page two,\na little over halfway down the page.\nThis bill was requested by the Georgia\nForestry Commission and it its purpose\nis to reduce confusion for our counties\nand our cities and our property owners\nregarding what a prescribed burn is. It\nclarifies the definition in the code.\n>> Okay. I don't see any questions. Thank\nyou, ma'am.\n>> Representative Jones.\nThank you, Mr. Chairman and members of\nthe committee. I have House Bill 545 on\nthe blue sheet is five, the fifth from\nthe bottom, LC number 481506.\nUm, I want to thank the committee for\npassing this bill out of rules in 2024.\nIt went to the Senate, but because of\ntime, it did not go any further. HB545\nis known as the Terry Act. This bill is\ndesigned to create uniformity across all\ncourts in Georgia in how appeal\ntranscripts are to be handled. This bill\ncreates a clear statewide rule that all\ntranscripts shall be prepared by filing\nthe notice of appeal with the clerk of\ncourt and\nall transcripts are to be requested from\nthe court reporter listed on the notice\nof appeal, eliminating inconsistent\nlocal practices and confusion.\n>> Okay. Don't see any questions. Thank\nyou.\n>> Thank you,\n>> Chairman Corbett. Wait, excuse me. There\nis a question. I'm sorry, M. Jones. Just\na minute.\n>> Thank you, Mr. Chairman. It's not for\nthe author. The previous bill, will you\nenlighten\nthis country boy? And what in the world\nis silver culture?\nDid Did we answer your question for you?\n>> How about 16 different ways, but I'm\ngoing\n>> They're going to meet you offline and\ntalk to you about that. Okay. Thank you.\nIf y'all have a question be I'm trying\nto watch the board, but let me know.\nMake sure I recognize you. Chairman\nCorby.\n>> Thank you, Mr. Chairman, members of\ncommittee. I'll bring before you House\nBill 956,\nuh, seventh from the top on the second\npage.\nWhat House Bill 956 does, it gives the\ndirector of the EPD the authorization to\ntake any actions as may be necessary to\nimplement provisions of the solid waste\ntrust fund. That's what we're doing with\nthis this bill. And I'll appreciate your\nfavor consideration or answer any\nquestions.\n>> Okay. Don't see any questions. Thank\nyou, sir.\n>> Thank you, Mr. Chairman.\n>> Yes, sir.\n>> Good morning, Mr. Chairman of committee.\nI bring HB57, which is the fourth bill\non page one. This bill does one thing.\nIt adds stepgrandparent,\nstepgrandchild relationship to the\nincest law of Georgia.\nThat's it.\n>> Okay.\nNo,\n>> no questions. Thank you.\n>> Thank you, Mr. Chair. Chairman Anderson.\nThank you, Mr. Chairman. This morning, I\nhave House Bill 1027. It's page three,\nthird from the top. This bill simply\nallows MAG participating cities and c\nand the one county to enter into\ncontracts with endusers for electric\nservice for up to 20 years.\nOkay.\nDon't no questions. Thank you.\n>> Thank you, Jim Jones.\nGood morning, chairman, members of the\ncommittee. House Bill 986, second page,\nsix from the bottom. Uh, four years ago,\nwe enacted the personal delivery device\nbill, which is effectively the robots\nthat are delivering food. You may see\nthem here in Atlanta. They look like\ncoolers with four wheels. Uh, we were\none of the first states to do that. Now,\nseveral states have done it. And we've\nkind of learned from what some of our\nbrethren have done across the union.\nWe've made changes from a safety\nperspective and also a traffic\nefficiency perspective. And you'll see\nthe three changes between line 16 and\nline 26.\n>> All right. Don't see any questions.\nThank you, sir.\n>> Thank you, sir.\n>> Chairman Williams.\n>> Uh, thank you, Mr. Chairman. Um, my\nHouse Bill 934 is on the second page\nnumber four. This basically transfers\nthe powers of the securities and\ncommodities um from the Secretary of\nState's office over to banking and\nfinance. Um this is done in 21 other\nstates right now and this will help um\nreduce some of the fraud and abuse.\n>> Okay, we got a question for you with\nParks.\n>> Thank you, Mr. Chairman. Uh to the\nauthor of the bill, is it not true that\nthis would hinder an ongoing\ninvestigation into First Liberty, a $140\nmillion Ponzi scheme? Uh that is\ncorrect. It is 140 in counting and the\nfolks who have been working on this once\nthis goes into statute or goes into law\nthey will automatically be transferred\nunder the department of banking and\nfinance. It'll be a seamless process.\nBut thank you for your question. So just\nto clarify, there's an ongoing\ninvestigation in which would it not be\nthat this bill would hinder\n>> Nove\nI I I think I just said clearly these\npeople that are working right now they\nwill come up under the Department of\nBanking and Finance and it'll be a\nseamless transition um upon July the 1st\nof 2026 and they can all work in concert\nwork as a team. But thank but thank you\n>> Secretary Kelly.\n>> Thank you Mr. Chairman, Chairman\nWilliams, isn't it true uh that there's\nbeen a ongoing investigation through the\nSEC that is spearheading this?\n>> Yes, sir. You are correct.\n>> And they're driving the majority of the\ninvestigation.\n>> They are. And isn't what's hindered this\ninvestigation is the Secretary of\nState's lack of prosecuting this case at\nthe state end. And that's why we need to\nput in the hands of a regulator who\nactually is familiar with this territory\n>> and also a smaller um web um of working\nwith because right now the Secretary of\nState has a myriad of different\ndepartments they have to be in charge of\nand banking and finance. They know\nbanking and finance and 21 other states\nare doing this and they seem to be doing\nit very well.\n>> Thank you.\nUh,\nRepresentative Evans has a question.\n>> Thank you, Mr. Chairman. Um,\nunderstanding your point about 23 other\nstates doing this, but\n>> 21\n>> 21 at any time in history until there\nwas this ongoing investigation, did\nanybody ever attempt to make this move\nhere in the state of Georgia?\n>> You know, I'm not aware of that because\nI was not the chair of banks and finance\nat that time. And isn't it true that the\nbanks and financing department has\nexpressed concerns about their budgetary\nneeds if this change is made?\n>> I don't I don't I I don't believe so. I\nthink they're more concerned of$1 140 to\n$150 million that has left Georgian's\npockets.\n>> There wasn't a letter that was addressed\nto you or to the committee expressing\nconcerns. There was and that letter was\nanswered um full committee meeting last\nThursday and we spent about 45 minutes\ndiscussing that in depth and I think we\nhad um it passed out. I think we had\nthree votes that were against it in\ncommittee.\n>> Isn't it possible um based on language\nthat's in line 56 that once this\ntransfer is made that the staff that's\nworking on this right now could be\ncompletely changed?\n>> I don't think so. But you could ask the\nDepartment of Banking and Finance\nchairman or Bo Fears who he plans to\nhire and fire.\n>> Well, you're the chairman. I don't But\nthe Let me ask Let me ask it this way.\nThe commissioner of the banks and\nbanking department will be able to make\npersonnel decisions after this change\njust like they are today. True.\n>> That is correct. But in the law, the law\nstates that they will bring them all up\nunder the Department of Banking and\nFinance at that time.\n>> Is there anything to require that that\nnot change during the course of the\ninvestigation? anything in this law that\nwould tie the hands of the commissioner\nof the banks and banking department not\nto make any personnel changes after the\nswitch?\n>> I can't speak for him, but the law says\nthat he will hire them and they will\nhave all the benefits that they have had\npreviously. Now, if they don't perform,\nyou know, that's that's something\nbetween the the chairman of the banking\nand finance or the department of banking\nand finance and those said individuals\njust like everybody else. have to\nperform to keep their job\n>> and and that whether they're performing\nor not will be determined by the banks\nand banking commissioner and his sole\ndiscretion. Drew,\n>> that is correct.\n>> And and final question, um these folks\nthat are leaving over from the Secretary\nof State's office, don't they have other\nduties? Are we not concerned about who's\ngoing to take up that work when they\nswitch over to the banks and banking\ndepartment?\n>> All we're working on is securities and\ncommodities, and that's what my purview\nis. um they're going to come over to the\nDepartment of Banking and Finance and\nthat's what they're going to be solely\nconcentrating on. I assume the Secretary\nof State still has a number of employees\nthat work on other projects.\n>> Has anybody talked about that workload\nswitch though? I mean, obviously, if\nsomebody's leaving one department to go\nto another one, I would assume this is\nnot the only thing those individuals are\ndoing. And I just want to make sure that\nthe committee at least considered the\nfact that workload within the Secretary\nof State's office is going to be left\nwithout additional personnel coming.\nWe're only sending personnel away. It\nsounds like\n>> Well, a lot of this was thought into um\nand we worked on it and this seems to be\na great um compromise for everybody. Um\nand it should work assuming this goes\ninto effect July 1 of 2026.\n>> Thank you.\n>> Thank you. Okay, Chair Lady Smith.\n>> Thank you, Mr. Chairman. Thank you. for\nbringing this bill before us. I know\nit's complicated. Is it not true that I\nactually am in the district in which\nthese individuals created this Ponzi\nscheme?\n>> Yes. Yes, ma'am. The lady knows of what\nshe speaks.\n>> Is it also not true that they got away\nwith this egregious action for several\nyears because we were peppered with\nauthority all over the code sections?\n>> Yes, ma'am. It has been going for quite\na while. I think they started I think\nthey said it could have been going over\nover 10 years.\n>> Is it further not true that I believe\nthis general assembly is intent upon\nwronging writing this wrong for the\nbenefit of the citizens who have been\ndamaged by this but also to prevent it\nfrom happening in the future?\n>> Yes, ma'am. I I believe that's\neveryone's intent in this body. And is\nit further not true that I still pray\nevery day for the ones who are the\nvictims?\n>> Uh yes ma'am, we all do. Thank you.\n>> Okay, Chairman Martin.\n>> Chairman Williams, just quick question.\nThe lady uh asked earlier, you know, is\nit not true that the um Commissioner and\nthe banks could replace the\ninvestigator? She asked that question.\nYou answered yes. Is it not true today\nthat Secretary of State could change\nthose this afternoon? Sure.\n>> Is is it not true? She also asked about\nthe people that were moving and the\ntasks they were performing. Is it not\ntrue that the task they perform or the\nspecific tasks that will be moved? In\nother words, you're moving the jobs and\nthe people. Is that not true?\n>> Uh correct.\n>> Is it not further true that if they were\ndoing something other than that, perhaps\nthat's the reason we got the check we\ngot in?\n>> One one could infer that.\nIs it not true? We have one more\nquestion.\nChairman Powell,\n>> my friend,\nagain, I've heard all the questions on\nthis, but I've only got one question.\nThe security uh division over there,\nthey're also in charge of investigating\nand enforcing the cemeterians and\nfuneral directors.\n>> Yes.\n>> And will they will this not change or\nwill this all stay the same under them?\nThis is only going to deal with\nsecurities and exchange and commodities.\nThis has nothing to do with graveyards\nor or any of that nature.\n>> So those investigations that are\nunderway, they'll stay at the Secretary\nof State's office, but we don't know in\nwhat capacity.\n>> Correct. That will be for him to\ndetermine.\n>> God help us.\n>> Thank you, sir. You have exhausted all\nthe questions. Thank you.\n>> Thank you, Mr. Chairman.\n>> Chairman Bonner.\nThank you, Mr. Chairman. Good morning,\ncommittee. I'm bringing House Bill 979.\nIt's on page two about midway down on\nyour sheet. Uh this came as a request\nfrom the Department of Defense,\nmilitary, community, and family policy\nuh division. This creates a process in\nGeorgia for concurrent jurisdiction on\nour military installations as it relates\nto juvenile cases. it does not obligate\nthe state of Georgia to accept these\ncases, but under the current under uh in\nthe federal system, there's no juvenile\nprocess. And so what this would do if\nthe state accepts it is to allow the\njuvenile cases to proceed through the\nstate and not have to go through a\nfederal system which does not\naccommodate that.\n>> Okay. Have a question.\nRepresent Williams.\n>> Thank you, Mr. Chairman. I like the\nbill, Mr. Chairman. My big question is\nif this moves,\nespecially in an area like my county\nwhere we have a huge amount of military\nfolk, will there be any help as far as\nthe expenses that will definitely rise\nin juvenile code?\n>> Well, we could certainly address that in\nfuture appropriations. Again, u the bill\ndoes not require the state to accept\nthese cases. It simply provides a formal\nprocess by which a request can be made\nto accept. And so um essentially if the\njuvenile system cannot handle certain\ncases based on their budget, then they\nwould simply not accept those uh in this\nin this process.\nBut to your point, I would certainly\nwork with you in making sure that our\ncommunities have the resources they need\nbecause the uh having this available to\nthe juveniles also provides them with\npotential for rehabilitation that does\nnot exist in the federal system.\n>> Okay. Thanks, sir. No more questions.\n>> Thank you,\n>> Repox.\n>> Thank you, Mr. Chairman. Um, page one,\nHR99 at the very top is a urging\nresolution for Georgia citizens, cities,\nand counties to remember and honor the\n250th anniversary of America and the\nDeclaration of Independence.\n>> Okay, no questions. Thank you, sir. I I\nalso have um House Bill 383, which is\nthreequarters of the way down on page\none. And this is the Georgia High School\nNIL Protection Act. And it's putting\nguard rails around um NIL contracts in\nthe state of Georgia, which currently\nexist. And it's making sure that those\ncontracts once the ath student athletes\nhave graduated that they no longer are\nbound by that contract that they can\nrenegotiate and have to renegotiate at\nthe next level.\nOkay,\nno questions. Thank you, sir.\n>> Representative Townsen.\n>> Thank you, Mr. Chair. This is uh HB971,\nsecond page about halfway down. This is\nthe career academy bill. This is\nactually uh follows the original career\nacademy bill. This will allow homeschool\nstudents and private school students to\nattend a college career academy, take a\nCTA course at no cost.\nAnd then the school system collects the\nFTE and it's an optin for school\nsystems. Currently the Golden Isles\nCollege and Career Academy in Brunswick,\nGeorgia is utilizing this as other\ncareermies across the state for their\nincount uh homeschool and private\nstudents and uh it's been really a\nwin-win for the workforce development,\nthe students and the school system.\n>> Okay, don't see any questions.\n>> Thank you.\nHilton Holden, excuse me.\n>> Thank you, Mr. Chairman, members of the\ncommittee. I'll refer to House Bill 109,\nwhich is at the bottom of page two.\nHouse Bill 109. As many of you in this\nroom know, last year we went cell phone\nfree in our classrooms K through 8,\nbacked by popular demand. We are now\nexpanding that to include high schools.\n>> Thanks, Chair. Have a question. Jim, uh,\nWhip Parks, you have a question.\n>> Thank you, Mr. Mr. Chairman, how many\nother states prohibit high schools uh\ncell phones in high schools?\n>> So, now we're up to 33 states uh\nnationwide uh that are cell phone free.\n>> For high schools?\n>> Yes.\n>> Okay. Don't see any other questions.\nThank you.\n>> Thank you, Mr. Chairman.\nUh\nany members of the committee have\nrequest?\n>> Chairman Green.\n>> Thank you, Mr. Chairman. Uh I bring\nbefore the rules committee house\nresolution 1050\nwhich is the um our conveyance annual\nconveyances and also house resolution\n1051 which is uh our easements for the\nuh for the year and there are 22\neasements and 11 conveyances that and\nthe Senate will add some more when we\nover there.\n>> Okay. Any questions for Chairman Green?\nDon't see any.\n>> L Hugley.\n>> Thank you, Mr. Chairman. I have uh House\nResolution 1049 and it's just\ndesignating Fentel awareness day, a\npermanent observance each year, the last\nWednesday of October.\n>> Okay.\nAny other\nLeader Estration has one. Go ahead.\n>> Thank you, Mr. Chairman. On page three,\nthe second bill, House Bill 1023,\ncontinuing with the efforts to maintain\na priority of school safety. I've\nbrought House Bill 1023, which would\nrequire weapons dete detection systems\nin all Georgia public schools. Uh this\num substitute would make an effective\ndate of July 1st, 2027, would allow for\nlocal discretion as to which weapons\ndetection systems to provide and would\nallow for state grants to help fund\nthis.\n>> Okay, Whit Mark, if you have a question.\n>> Thank you, Mr. Chairman. Uh thank you\nfor the bill, leaderration. Um is there\na fiscal note or an estimate of how much\nthis would cost?\n>> No. No, there's no fiscal note. The uh\nstate they through our uh budget have\nappropriated funds for lo local school\nsafety grants and that would make the\nfunding available for these systems.\n>> So is there an understanding whether or\nnot the 50,000 per school is sufficient\nto to cover these if they haven't\nalready been utilized\n>> as discussed in committee there are\navailable weapons detection systems that\ncan be paid for with that with under\nthat uh grant.\n>> That's less than 50,000 a year.\n>> That's correct.\n>> Thank you.\nrepresent Evans, you have a question.\nYou waves. Okay.\nJim Nur.\n>> Thank you, Mr. Chairman. Uh leader, is\nit not true that uh quite a few systems\nin the state are already proven that\nthis system is effective and and is\ndeterring unsafe situations and weapons\nat schools?\n>> Yes, sir. uh the improvements in\ntechnology and software have allowed for\ngreater capabilities of these weapons\ndetection systems and they have been\nsuccessful in my opinion in their\nimplementation where local school\nsystems have decided to roll them out.\n>> Thank you. Okay,\nthat's got that I'm going to ask Vice\nChairman Lever to come and take over the\nmeeting here.\nAll right. I see a new uh visitor to our\ncommittee today.\n>> So, young man, I'll recognize you and\nlet you introduce yourself and tell us\nabout your\n>> Thank you, Mr. Chairman. I'd like to ask\nthe members to consider House Bill 1215.\nUh this is a a simple bill. This is\nsimply adding a third judge to the\nmiddle judicial circuit.\nThis was requested by the judicial\ncouncil and the governor has placed the\nfunding for this in the budget as he has\nwith two other districts I think in the\nGainesville area and in the Gwynet area\nup there. And uh I would ask for\nfavorful consideration on uh House Bill\n1215. Be happy to answer any questions\nif there are any.\n>> Mr. chairman of the board is just lit up\nwith questions here. Um, no. Or I'll be\nhappy to speak offline if they want to\ntalk about anything.\n>> No, you did such a fine job, Mr.\nChairman. I'm There are no questions. I\nmust say that's just one of the absolute\nfinest bills and finest presentations\nwe've ever heard in this committee.\n>> Thank you, sir.\nGreat job there, Mr. Vice Chair. Thank\nyou.\nOkay, here we are. Let's uh set a\ncalendar for today,\nMonday, February the 9th, under modified\nstructure,\nHouse Bill 632.\n>> Have a move and a second. Is there any\nopposition?\nIt's on.\nHouse Bill 657.\n>> Moved and seconded. Any opposition?\nIts own.\nHouse Bill 676.\n>> Moved and seconded. Any opposition?\nIt's on.\nHouse Bill 957.\n>> Moved and seconded. Any\nopposition? It's on.\nHouse Bill 1215\nmoved and seconded. Any opposition? It's\non.\nSenate bill 162. Senate Bill 162.\n>> Moved and seconded. Is there any\nopposition? It's on. Okay. That will be\nour calendar for today.\nHouse Bill 632,\n657,\n676,\n957,\n1215,\nand Senate Bill 162.\nNow, for us to sort of get back on\nschedule, let's go ahead and set a\ncalendar for tomorrow, Tuesday, under\nmodified structure,\nHouse Bill 944.\nHave a move and second.\nAny opposition?\nIt's on.\nHouse Bill 10:15.\n>> Moved and seconded. Any opposition? It's\non.\nHouse resolution. House resolution 1050.\n>> Moved and seconded. Any opposition? It's\non. House resolution 1051.\nIt's moved and seconded. Any opposition?\nIt's on. So, we've set a calendar for uh\nTuesday and for today. Thank you all.\nWe're ajourned.",
  "updated_at": "2026-02-14T14:46:02.568024+00:00"
}