{
  "video_id": "d0MXLHcohSA",
  "url": "https://www.youtube.com/watch?v=d0MXLHcohSA",
  "title": "Georgia lawmakers debate plan to eliminate state income tax | Lawmakers 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 11,
  "summary": "Here is a structured markdown summary of the Georgia lawmakers' debate on a plan to eliminate the state income tax:\n\n## Overview\nThe Georgia Senate Special Committee on the Elimination of Georgia's Income Tax has been gathering input and developing a proposal to significantly reduce or eliminate the state income tax. The discussion centers around the details and tradeoffs of such a plan.\n\n## Key Actions\nNo specific bills or legislative actions were mentioned.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Republican Senator Blake Tillerie and Democratic Senator Nan Orrok, both members of the special committee, discussed the committee's proposals and their differing perspectives.\n- The proposals aim to eliminate income tax on the first $50,000 for individuals and $100,000 for joint filers, while reducing rates for other taxpayers.\n- Debate centered on the impact on the state budget, with concerns raised about funding critical services versus providing broad tax relief.\n\n## Votes\nNo recorded votes mentioned.\n\n## Attendance\nNo quorum notes provided.\n\n## Adjournment\nNo adjournment or next session date provided.",
  "transcript": "We're going to look closely at a Senate study recommendation\nto eliminate income taxes.\nWith me, our Republican senator,\nBlake Tillerie of Vidalia,\nhe has served in the state Senate since 2016\nand is the Senate Chair of the Powerful Appropriations Committee.\nAnd Democratic Senator Nan Orok of Atlanta,\nshe was elected to the Georgia Senate in 2006\nafter spending 10 terms in the House.\nWelcome to you both to lawmakers.\nI appreciate having you here.\nSo both of you has spent months on the Georgia Senate Special\nCommittee for the elimination of Georgia's income tax.\nSo, German tillery, I want to start with, who did you have\ntalk to you?\nWell, who testified?\nWell, hopefully saying the title is more than it takes\nto pass through.\nSo, I think it makes a lot of sense for folks.\nWe had, every day, Georgians come in and talk.\nWe had a police chief.\nWe had people who owned businesses.\nWe had a mom who was talking about child care expenses.\nAnd it turns out that it didn't take, you didn't have to go very far to find out that\neveryday Georgians are filling the affordability crunch in their pocketbooks daily.\nAnd they're screaming for help.\nAnd I'm listening.\nYou heard a lot too, Senator.\nI did.\nAnd actually I'd love to see some more experts than the ones that were brought in who have\nbeen beating the drum against income tax for longer than some\nof us been alive, the devil's in the details.\nOK.\nAnd we'll see.\nWe're going to get into some of those.\nOK.\nSo we're going to go through some of the highlights.\nWe show the flyer in the committee's executive summary\nand have you both comment briefly on each one of them.\nSo let's start with we recommend making the first $50,000\nfor individuals in $100,000 for joint\nfilers, completely tax-free beginning in 2027.\nWe also recommend reducing the state income tax rate\nfor all other families and businesses.\nGermantillery?\nYeah, I mean, it speaks for itself.\nWhat we have noticed is that the folks at the bottom end\nare filling that affordability across us the most.\nIf you're making $1 million a year,\nyou may be filling a crunch.\nBut you're making $100, $125,000 as a married couple,\nmaking $50,000 individually.\nYou're trying to figure out how you're paying for gas,\ngroceries, child care, your power bill. If we can eliminate the income tax on that first\n50,000, that's $2,500 a year in a person making $50,000 pocket every year.\nYou like it, Senator?\nWell, the other side of that story is that that cuts $16 billion out of our state budget.\nlong-term I don't see how we can afford that when we have high needs in every\nsector of funding child care, funding our prison system. Every agency in the\nstate is down. We're not fully staffing our agencies and we've got our\nvulnerable children in the foster system right now. $80 million in the\nSo we're, I'll let you a lot to talk about.\nOkay, I'm going to let you talk about it.\nI want to get through some more, though.\nSure.\nFirst.\nAnother highlight.\nThese proposals completely eliminate the state income tax on\ntwo-thirds of all working Georgians while drastically\nreducing the tax burden on everyone else.\nRight. Under our plan, if you're making 50,000 or less,\nyour income tax liability is eliminated in Georgia.\nIf you're married filing jointly.\nIn 2020.\nIn 2027, it's gone.\nYour married filing is only your first $100,000, as it's\nmeant.\nIf you're making more than $100,000, it's $5,190 in your\npocket every single year from now into eternity.\nIt's not just $250 a year, $500 a year.\nIt's forever.\nWhat do you think?\nWell, I think the proposal actually would dramatically\nchallenge us as a state to find the funding that we need\nfor so many underfunded responsibilities that the state\nhas tortured citizens.\nOkay.\nNext, two thirds of individual taxpayers\nwould have no state income tax liability\nunder this proposal beginning in 2027.\nNo income tax, two thirds.\nCorrect.\nSo in this plan, as we were going through debating\nand hearing from our colleagues on the other side,\none of the things they said is that all the benefits\ngo to the rich.\nWe wanted to make sure that this benefit\nwas applied equally to all Georgians.\nAnd so what we did is said,\nlet's exempt the first 50,000\nif you're seeing along all Georgians.\n100,000 if you're married.\nall Georgians regardless of your income and apply it across what that ends up\ndoing though is if you're making less than a hundred thousand dollars it\neliminates your income tax liability entirely that's two-thirds of Georgians\nthere's no way you can say that this only benefits the rich when every family\nmaking less than one hundred thousand dollars now has zero state income tax\nliability. Senator Orrah? Well the devil's in the detail seventy seventy seventy\n34% of the benefit would go to people earning six figures\nor more per year, $11.8 billion,\nI think is what it would come in at.\nOkay, let's get to the next one.\nThis proposal does not increase the sales tax\nnor creates property tax,\nnor does it cut government services for Georgians.\nCervant Delory.\nThe folks who are talking about affordability\nbut not willing to do anything about it\nwill always throw an excuse.\nAnd the excuse that was thrown out this time\nis what the state's going to do is instead of taking it out of your left pocket, they're\ngoing to grab it out of your right pocket instead.\nAnd we said, no, we're not.\nWe're not going to charge a new sales tax.\nWe're not going to add a property tax, the state charges no property tax now.\nWhy would we add that on?\nAnd we developed a plan that literally answered those concerns, didn't raise a sales tax,\ndidn't put a tax on groceries, didn't charge a property tax, didn't majorly benefit the\nwealthy if you'll find out in the first two years, it's a $6 billion plan.\nfor $4 billion goes to those making $100,000 a less.\nWe answer all those questions yet we still hear\nthat affordability is an issue yet,\nwe're not willing to do anything about it.\nSo where is the money coming from?\nHow are you replacing that money?\nGlad you asked me.\nSo you know I've shared the budget now for seven,\nthis will be my seventh term chair in the budget.\nSo I guess I'm uniquely qualified to talk about it.\nLast year we brought in about $2 billion more\nand it senses than revenue.\nSo there's $2 billion, the first year you need three.\nIf you move back from a cash standpoint\nwhere we've done bonds in the past, back to bonds,\nYou create about 700 million more.\nThe total cost is actually $5.87 billion.\nThat's about 2.9 a year.\nThere's your 2.9 to cover year one in year two.\nWhat we're suggesting is that all we should do\nis prioritize people over companies.\nI heard Chris Clark say $3 billion a year on tax credits.\nHe's playing funny math.\nHe's not talking about the sales tax exemptions.\nLet's add all those in.\nWe give away and corporate giveaways\nover $30 billion a year.\nTake 10% of those.\nYou can eliminate Georgia's income tax\nI'll take that bet, throw me in that brow patch.\nSo cutting back on some of these tax breaks,\nbut also the money that usually goes into that pot\nat the end of the year that has the surplus,\nyou're saying that that is some of the money\nyou're talking about.\nYou're saying we brought in more revenue last year\nthan we had in its census?\nWe're going to apply it somewhere.\nLet's apply it and give it back to the people\nwho sent it to begin with.\nOkay. Well, you know,\na person who has a lot of money\nYou know, a person getting a tax refund cannot go out and build the services they need\nfor their disabled child.\nWe need to put money together as Georgians to have a state budget that's robust enough\nto deal with.\nWe've got 7,000 families on the waiting list now with disabled children that cannot get\nservices.\nAnd what we keep hearing from the Republicans is, well, there's not, well, we can't afford\nit.\nThere's not enough money for that.\nenough money for us to have financial aid for needy students to go to college. There's\nnot enough money for this. There's not enough money for that. And that's what the\nword is that comes down, but yet you're going to really threaten half of the state budget\nby doing away with income tax.\nYou're response?\nWe spent over $2 billion on mental health and developmental disabilities each year. We\nWe spend 54% over $13 billion on education.\nThere is no way you can say by looking at what we fund.\nWith health care making up 23% of our budget and education making up 54% of our budgets,\nthe Georgia does not prioritize those areas.\nWhat we need to prioritize now, though, is those families making less than $100,000 who\nI don't consider wealthy.\nThat's your firefighters, your nurses, your police officers, your teachers, that we have\nan opportunity to completely eliminate their income tax liability.\nWhy would we not do it?\nYou're the budget guy, so not getting rid of things that people are used to right now,\nand they're what you're...\nWe've shown a way to do it in the current budget space.\nWhat we have to get rid of is the corporate welfare and subsidies that we've been plotting\nout for years.\nI heard someone say earlier that the data tax credit is $470, no it's $740.\nThey transpose their numbers.\nIt was only $17 million years ago, so now it's $740 million.\nWe know we have a film tax break of 1.2 billion.\nYou start adding these up.\nYou only need 3 billion a year to eliminate Georgia's income tax.\nIt's there.\nYou just have to put people over companies.\nSo you would agree with the data centers, cutting the breaks to tax breaks to data centers?\nThat absolutely needs to be tackled, yes, because they got a tax break that they didn't\nneed.\nThey would be here anyway without it.\nSure, that's their place is to look for tax expenditures in the budget.\nBut we are one, the 48 states do financial aid for needy students to go to college.\nIn Georgia, we spend 1% of our financial aid on needy students to go to college.\nSo there are needs that should be funded that are not in our current budget, that should\nbe there.\nAnd that's one example.\nOur foster child system is very, very challenged.\nMental health, we're not beginning to scratch the surface of funding the needs for mental\nhealth for both adults and for children.\nSo we hear this every year that the state doesn't have the money to pay for children and\nfamilies facing hunger.\nit just or to run humane state prisons where staff and inmates don't have their lives threatened\nand taken in that setting. And we do a bit, but with the commitment, it needs to be much\ngreater instead of blowing a hole in our state budget because $20 billion is what we gather\nin sales tax. A few seconds to respond.\nYou've heard Senator Oroch tell you about all the things that government does poorly.\nWhy would we want to throw more money into a whole of things that we've done poorly?\nWe're incredibly inefficient at programs.\nAllow people to keep their own money.\nThey can afford their own power bill, their own gas bill, their own grocery bill.\nI'm going to bet on them.\nOkay.\nWell, people all over the state turned out some public service commissioners that because\nof high electricity costs, we're going to have to leave it like that.\nI appreciate both of you being here.\n",
  "updated_at": "2026-02-12T01:27:28.196035+00:00"
}