{
  "video_id": "D56OW5qwymI",
  "url": "https://www.youtube.com/watch?v=D56OW5qwymI",
  "title": "Joint Appropriations Special Session PM - January 21, 2026",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 229,
  "summary": "Here is a structured markdown summary of the Georgia Joint Appropriations Special Session PM - January 21, 2026 session:\n\n# Overview\nThis session focused on the Secretary of State's amended budget recommendations for fiscal years 2026 and 2027. The proposed changes aim to maintain secure elections, protect consumers, support licensed professionals, and ensure efficient agency operations.\n\n# Key Actions\n**HB 1391**: Provides funding for election integrity measures, including a one-time employee salary supplement, optical character recognition technology, a second ballot blind count, and resources for full hand recounts of two statewide elections in 2026.\n\n# Bills Introduced (First Reading)\nNone mentioned.\n\n# Notable Moments\n- The Secretary of State highlighted that Georgia runs the \"best elections in the entire country\" according to Fox News.\n- The Secretary outlined various efficiency and customer service improvements, such as reducing nursing license processing time by 62%.\n- The agency has hosted over 49 financial literacy programs, including outreach to women's prisons.\n\n# Votes\nThe proposed budget changes were voted on and passed.\n\n# Attendance\nNo specific quorum notes provided.\n\n# Adjournment\nThe session adjourned, but the next session date was not mentioned.",
  "transcript": "Okay. The party's gone, but it's quality that's here now, all right. Well, we are already\nlate, and we'll probably continue to be late the rest of the day. So, Mr. Secretary,\nglad you're here. Welcome and we will get right to work. Turn it over to you.\nGood afternoon, Chairman Hatchett, Chairman Tillery, members of the committee. Thank you\nfor the opportunity to present the Secretary of State's amended fiscal year, 2026 and\nfiscal year 2027 budget recommendations.\nBeginning on page 330, the governor's budget recommendation booklet, these proposals\nare focused on maintaining secure elections, protecting consumers, supporting licensed\nprofessionals, and ensuring our agency continues to operate efficiently and responsibly.\nOur budget reflects careful stewardship of taxpayer dollars while addressing statutory\nmandates and operational needs.\nSlide 2 is on page 331.\nThe Corporation Division plays a critical role in supporting entrepreneurs across the\nstate and making Georgia more prosperous and affordable for all.\nIn 2025, we processed 898,883 annual registrations with 1.4 million active entities on record,\nhighlighting Georgia's leadership and successful business practices.\nWe're expecting a substantial increase in those numbers within the next year.\nWe served the state by accepting filings, issuing corporate documents and providing corporate\naccess to business records.\nOn slide two here, you'll see the only recommended change in AFY26 is a one-time 2,000 supplement\nfor full-time employees to remain competitive and recognize staff retention needs.\nThere are no requested changes for FY27, allowing the division to maintain consistent operations\nwhile continuing to serve Georgia's business community.\nSlide 3 is on page 331 also.\nThe elections division is responsible for administering Georgia's election laws and supporting\nvoters, candidates, and local government statewide.\nIn 2025, we successfully administered and certified all elections while upholding our commitment\nto keep Georgians safe and secure while they recognized their right to vote.\nSo much so that Fox News on Election Night on Fall of 2024 said that Georgia and Florida\nrun the best elections in the entire country.\nI differ with him on one point, Georgia runs the best elections in the entire country.\nIn AFY-26, the budget includes several key investments, a one-time employee salary supplement,\nfunding for optical character recognition, human readable text count technology to comply\nwith Senate Bill 189.\nA second blind count of all ballots and resources for the 159 counties to conduct a full hand\nrecount of two statewide elections during the 2026 cycle.\nThese funds strengthen elections integrity, transparency, and public confidence.\nWe are requesting that these funds be made recurring to ensure Georgia can continue to\nconduct audits that verify election outcomes that reinforce voter confidence.\nSlide four also on page 331.\nThe Investigations Division enforces laws related to elections, securities, professional\nlicensing.\nFor AFY-26, budget adjustments reflect changes in insurance premiums, Georgia Outwork\nBillings, and updated health-benefit contribution rates.\nWhile these are primarily technical adjustments, they ensure the division remains properly\nresourced to investigate complaints and protect Georgia consumers.\nconsistently upholding our commitment to keeping Georgian safe and just this year alone we've had\nthousands of successful investigations across all divisions and attached agency's divisions.\nOn slide five also on page three three one this discusses an office administration who provide\nessential support services across the entire agency. In AFI 26 the budget includes a one-time\n2000 salary supplement for full-time employees. This investment supports\nretention and recognizes the importance of administrative staff who ensure\nthe agency operates smoothly. Slide 6 is the Professional Licensing Division\nwhich protects public health and safety by supporting licensing boards across\nnumerous professions. Our most recent update has been the online application\ntracker, giving our constituents access to streamlined time view, timeline to review\ntheir application status 24-7. Additionally, we've reduced processing time for our\nconstituents to receive nursing licenses, for example, by 62%. Cutting the\naverage processing time from 48 days down to 18 days, proving our office's\nefficiency and commitment to our health care professionals.\nIn AFY26, the budget includes a one-time salary supplement for employees who support licensing\noperations.\nThis funding helps ensure timely processing, enforcement, and customer service for licensees,\nlicensees, and the public.\nThe Securities Division is discussed here on slide 7, page 332.\nThey administer enforced Georgia's Securities Charitable Solicitations and Cemetery's Act.\nOur office is extremely dedicated to Georgians and protecting Georgians, and we've hosted\nover 49 different financial literacy programs over the past year.\nActually, we've even gone into women's prisons to ensure that our constituents are prepared,\neducated and well-versed on the potential threats they could face.\nWe perhaps actually were in your account recently or in the past year.\nWe plan to continue to host these vital programs this year with two events that are actually\nhappening just this week.\nAnd AFY-26, the requested increase supports a one-time salary supplement for full-time\nemployees.\nThis ensures the division remains equipped to protect investors and prevent financial fraud.\nOn slide 8, this discusses FY27 recommendations.\nThese adjustments were largely reflect updated benefit\nand administrative cost changes including retirement contributions,\ninsurance premiums, and Georgia at work buildings.\nWe also reflect savings from reduced state health benefit\nplaying contribution and the eliminate elimination\nof one-time precedent card mailing funds following\nfollowing the passage of Senate Bill 424.\nOverall, these adjustments ensure fiscal responsibility\nwhile sustaining core election operations.\nThe FY recommendations continue these adjustments\non slide nine, reflecting updated administrative\nand benefit cost.\nThe overall reduction lines with protected expenditures\nwhile preserving the division's ability\nconduct investigations and enforcement actions statewide. Additionally, we are\nrequesting $755,649 in funds for salaries to reflect similar law enforcement\nagencies and staff for our post-certified investigators. Slide 10 on page 333,\nthe fiscal year 27 adjustment reflect routine changes in insurance premiums, telecommunications,\nand infrastructure rates, and Georgia at work buildings. These are partially offset by savings\nfrom reduced health benefit contribution rates. The goal is to maintain strong internal operations\nwhile remaining fiscally streamlined. On slide 11 relating to professional licensing on page 333\nand 334, the recommended changes for fiscal year 27 reflect updated administrative cost\nand reduction in state health benefit contributions. These adjustments result in a net decrease\nwhile still allowing the division to meet its regulatory responsibilities, maintain a high\nlevel of customer service. On slide 12 relating to securities on page 334, the FY27 recommendations\ninclude routine adjustments for insurance, Georgia Outwork Billings, and reduced health benefit\ncontribution rates. These changes result in a modest net reduction while preserving the\ndivision's ability to conduct examinations, investigations, and enforcement actions.\nIn closing, our AFY26 and AFY and Fiscal Year 27 budget recommendations reflect a balanced\napproach, supporting our employees,\nbeing statutory obligations, strengthening election\nintegrity, and protecting Georgia consumers\nall while maintaining fiscal discipline.\nWe appreciate your consideration and look forward\nto continue our work on behalf of the people of Georgia.\nWith that, I would answer any questions\nthe committee or members would have.\nThank you.\nThank you, Mr. Secretary, I have one or two questions.\nI noticed that you reported, I think fiscal year 25,\nthat you all had collected around 144 million in fees.\nDoes that include the expedited charges\nthat you collect for those fees?\nIn the past, I don't think it has, but I'm just curious if it has.\nDo you have any idea?\nYeah, that's included.\nIt is, include those.\nSo those, all those expedited fees are then\nturned into the general fund that we then\nhave the ability to.\nThat's part of our retained revenue.\nThe general summary receives 100% of the standard\ncorporation fee and of the professional licensing fee, if we charge a license, say $100, we run\nthe agency on about $33 and the other 65% goes back to the General Assembly.\nIt goes back where?\nTo the General Assembly.\nOkay.\nI just have an issue with all of our agencies at charge fees that we don't get to see.\nWell, we're running the corporations on zero taxpayer dollars.\nbut you are. Okay. Senator Burns. Thank you, Mr. Chairman. Thank you, Mr. Secretary.\nGood to see you today. Thanks for joining us. As we look at your request for $1.8 million\nfor the text-based ballot scanning technology, can you share with me that whether that software\nwould be used for tabulation or verification.\nThat's actually used for verification.\nThat's what we piloted back in the 2024 election.\nThat's correct.\nReading the human readable text.\nAnd this reflects the governor's budget of the $1.8 million\nand the $5 million that he put in there.\nCorrect, and I support that and champion that.\nMy point is, you notice here this is for tabulation.\nIs that incorrect?\nIt confirms the tabulation.\nText-based ballot is going to technology for vote tabulation.\nIs it EAC certified for tabulation?\nOn an election day, the poll workers will obviously the voters run their paper ballots\nthrough the scanners and the scanners record that with the QR code.\nIn post-election, we take those scanned images, and we run that through and verify what\nthose numbers are, the vote totals, raised by race, and the totals to verify the accuracy\nof the machine, the accuracy of the vote.\nSo it's really as a check, you know, it is a verification, is that correct?\nIt's a verification.\nAll right, and you use the word QR code.\nI believe Senate Bill 189 does not allow for the use of QR code after July 1st, 2000\nin 2006. Is that true? The system that we're using currently is available to be used until\nJune 30th, 2026. Correct. Thank you. The last question in this line, what was the cost,\nthe actual cost of providing that verification text-based scan in 2024?\nI will get the number for you, but it was in excess of the $1.8 million because there\nwere set up costs.\nI believe the legislature at that time appropriated $5 million, is that correct?\nRight, and it came in under that.\nAnd it came in under that substantially, I believe.\nYes.\nSo if you would please, I'd like to know what the actual cost was to utilize that technology\nin 2024.\nWe'll send that to the chair to verify that it's a verification of the tabulations that correct. We'll send this information to the chairman and members. Thank you, Mr. Secretary. I appreciate your service.\nChairman Yerda.\nThank you, Mr. Chairman. Thank you, Mr. Secretary, for being with us. You know, we made significant changes to have professional licensing boards operate and\nand particularly moving some of the authority to you guys inside and you\nanticipate you have the resources needed to smoothly make this transition and\nI know you've made some improvements already as I'm like but the further you\nknow make those improvements and make it a smooth transition for our\nconstituents you anticipate that's going to be workable.\nWell, restating that, you mentioned that how you've moved something to the professional\nlicensing.\nYeah.\nIt's really the same as it's always been.\nThere's some of those decisions made internally now by the authority itself.\nOh, I see what you're talking about, right.\nThat helps those expedite the approval of a license if you met all the qualifications\nand that speeds things up.\nBut the most important thing is really the technology upgrade.\nWe've taken software.\nThe old software was clunky 2002 software.\nThat's been replaced fully implemented.\nAnd now you're seeing, like for example, nurses,\nour largest group of licensed professionals went from 48\ndown, days, down to 18 days.\nAnd I'm happy to report our employees are dedicated.\nAnd now they're trying to reduce it even further.\nAnd I'm not going to stop them.\nBecause they're on a mission just to be more efficient.\nI really serve, you know, your constituents,\nour constituents across the state of Georgia.\nThank you.\nChairman Bill Zoll.\nThank you, Mr. Chairman, thank you, Mr. Secretary.\nI was just looking back through Senate Bill 189\nto make sure my recollection was correct.\nSo, and I want to just try to get down to a clear answer\nto the question that Chairman Burns was asking.\nIn November of this year, when our voters cast votes,\nWhat are we certifying? Are we certifying a ballot that is being tabulated with the QR code or not?\nWell\nThe challenge that you have is the Senate this general assembly has not funded a single dollar to upgrade the system\nSo if you do fund, you know that system then we could talk about alternatives\nbut it's not been funded and it's not reflected in the governor's budget.\nAnd so we're here reflecting what the governor has, you know, put in here and pending, you\nknow, some funding from the General Assembly will be, you know, having to make this choice\ncome November.\nI follow, Mr. Chairman.\nIn addition to that, can you, when we vote in November and in May, what version of the\nDominion software, our machines be running.\nFive, five, five?\nYeah.\nFor up to June 30th, it would be five, five.\nWhat about after June 30th?\nWith lack of funding, you'll be faced a choice\nthat we probably would have to use five, five, or some other alternative.\nThere's no funding been put forward by the General Assembly.\nassembly. And just to clarify 555A is the version of the software which says\nthe Department of Homeland Security have identified have the nine known\nvulnerabilities that they identified back in 2022. Is that correct? And since\nthat time now we do the human readable text verification. And when we did\nthe verification of that we found that there was basically zero errors with the\nhuman readable text and I believe it was 84 errors with the hand mark. I was\nI was just asking to clarify, that's the same version of the software that is the same software version that the Department of Homeland Security identified had those nine vulnerabilities.\nThat's 5.5a, I just want to make sure my number is correct.\nWe're using the same software because I know additional funding has been provided.\nThank you Mr. Secretary.\nquestion all of that. The 5 million in the governor's budget does that go for the\nhand recount them? That goes for the hand recount of two additional\nstate two not two additional but two statewide races. So it doesn't do it doesn't\nI was under the impression the five million was going to be we'll be able to\ncount all of them. No no that's no this is just for two statewide races. Would\nif we were able to count all of them, would you not just be able to certify the\nhand count there and that suffice to meet the Senate Bill's request of not counting\nthe QR code? No, because you have about 16 to maybe 20 races on each ballot. Now\nyou're just looking at two races that are on that ballot. So really it's the\neconomy of what it is. It's not like France or Germany or any of these other\ndemocracies which just have one race, we actually have say 15 different races on a ballot.\nWhat would be the incremental cost increase than the count all 16 over two? Obviously it's\nnot going to be eight times that amount. Could your office work on that number for us?\nWe could take a look at it. Thank you.\nMr. Secretary, we continue to receive complaints on the licensing side, that's one of the biggest\nconstituent issues that I have in my district and I know many others have had over the years.\nCould you just kind of update us on some of the things there to y'all track how many people\napply on the professional side and just licenses in general, how many are applying on a daily\nbasis and how long it's taken to fill those licenses and kind of a progress report on how\nall that goes because it just seems to continue to be an issue that we have and also have ethics\nmeeting tomorrow at four o'clock. I'd love to see you there as well, so I appreciate your response.\nI guess from a standpoint of productivity, we've gone from 900 applications per employee to\n1,250, which is a 28 percent increase in efficiency. We also have up 67 percent more applications\nsince 2018, with no increase in manpower.\nWith the new software we've taken, as I just used,\nthe nursing example, but I could pull up some other boards\nand send those over to you, but nursing gone from\n48 days down to 18 days.\nBut we now have a new online portal that went into place\nas an additional further enhancement.\nWe'll continue looking at how to enhance this\nimproved customer service.\nBut people have now 24-7 availability of looking exactly where they are through that process.\nInstead of having to call a number, email, they can just go online and see where they are in that process.\nAnd that has just reduced the number of calls we had and we've had thousands of people\navail themselves of that service.\nSo we'll continue to look at how to improve that.\nWe have a strong team and they're dedicated to making further improvements in the process.\nBut we're really impressed that we've increased our efficiency 28% and we've also\nhave 60% more applications, which shows that Georgia is growing.\nIt's open for business.\nAnd we want to make sure it continues to be a great place to start your business.\nRaise your family.\nThank you.\nChairman Carpenter.\nThank you.\nIs Liz here today?\nNo.\nHey.\nI'll just make this here.\nFirst of all, I want to thank you for all you do.\nI know I'm a pain in your side sometimes.\nI appreciate your help.\nTwo things.\nFirst thing, do you guys have any kind of legislative suggestions\non how to streamline the licensing process\nor there are certain boards that need some attention\nto make sure that we're continuing to get these things turned\nout so Georgians can get to work, especially folks\nthat move into our state that are qualified?\nAnd the second question is, could you guys put out some figures\non how many volunteers and the cost to Georgia taxpayers\nif we went to paper ballots hand counted?\nBecause I think there's, you know, I understand that the people\nhas desires, but I think that he'd understand the magnitude\nof the dollar and the magnitude of volunteers\nit would be required to do such.\nSo, well as to release the hand counting we could just really\nextrapolately where this is done in certain counties like an Arizona they did\nthis in other places and give you an idea what it would look like with four\nmillion people voting during a gubernatorial year, five million people voting\nduring a presidential year. So we can get that to you. Then your first question?\nWhat boards can we do to certain boards that you see they're lagging on? You know\nwhether it's they've got a 500 person quota for meetings for that month or what\nWhat can we do as a legislature to hold them to the fire so we can get people to work quickly as possible?\nAnd the reason being, is if somebody on a border community, people that have communities that surround other states,\nwe get a lot of people that move into our community to work and then they get held up.\nThat's the reason.\nWell Chairman, it's a great question.\nThis office, just our office, license over 240 different licenses and over 40 different\nboards.\nI think structural engineers should be licensed, I am one, and that's public safety.\nI think nurses should be licensed, that's public health.\nWe get it.\nBut sometimes you question some of this stuff.\nIn fact, when we were in the General Assembly, there was one for lactation consultants.\nI voted against that bill.\nThen I become Secretary of State, and as Secretary of State, I have to defend that bill.\nNotably, they never asked me for a deposition, and finally, as it wound its way through the court, it was struck down.\nAnd so we really need to be mindful of what really needs to be licensed and what does it need to be licensed.\nSo we could ask about other professions.\nDoes it need to be licensed to be a barber?\nAnd if it does, does it need to be re-licensed, you know, in that fee cost every year or every two years,\nor could we look at extending it out?\nWhat has really changed in that industry?\nObviously, electricians and plumbers technology changes,\nbut do we have to re-license that every two years?\nWhat could we do to stretch that out\nto make it more in line with any technology changes\nthat you could have?\nBut we probably need to do a deep dive in that.\nI do think we license too much.\nAnd whenever I have an opportunity to license things,\nI don't think need to be licensed\nor people have been doing it since the beginning of time.\nIt doesn't need to be licensed.\nAnd so I support, I think what you're leaning\nis towards that we don't, we want to make sure\nit's a friendly place to build a business\nand not over regulate people.\nWe need to cut rate tape wherever we can.\nBecause government doesn't create jobs.\nIf anything that can do is get them\nway of creating a good paying job\nwith entrepreneurs such as yourself.\nThank you.\nSenator James.\nThank you, Mr. Chairman.\nHello, I'm Mr. Secretary of State.\nI, two of my questions have already been answered\nwhile I was waiting to be called on.\nBut it's one that you might think is petty,\nbut I want to know, why is it that if we want to give\noutstanding Georgia citizen awards to people in our district,\nwe have to go to 10 or 15 for the whole year.\nAnd also with the, what is it?\nHonorary Georgia citizens for diplomats who might come here.\nSo why is it that, I mean, do you, we need to pay something?\nBecause clearly, the paper couldn't cost that much.\nI just need to know that question.\nBut if you answer the one about the elections\nand how many licenses do you give from the Secretary of State?\nYou've just answered that.\nThank you.\nThat goes back to long-standing policy.\nAnd I don't know when that began.\nIt may go back to Ben Forteson days.\nBut when we had the office, but there was a limitation.\nIt's really based also in our office.\nWe only have so many folks.\nIf you look at there's over 220 members.\nAnd so it's just really something\nto be manageable for the amount of staff that we have but obviously if you have additional\nfolks we'll take a look at it but we just wanted to make sure that you know we had some\nreasonable boundaries on it but obviously we want to be respectful of our senators and\nrepresentatives and if we need to expand that further we'll take gladly take a look\nat that for you.\nI hope you will look at it because if someone dies in my community and I've already\nI use 15, what am I going to tell them?\nOh, wait to next year and that won't work.\nSo I don't understand why.\nThat many people don't use those.\nBut I live in the metropolitan area.\nAnd I, for some reason, people think\nthat that's the greatest honor that a Georgian can get,\neven post-humans leave, if they are there.\nWell, thank you.\nAnd we'll look at it.\nAnd I'll get back to you.\nRepresentative Liam.\nThank you, Mr. Chairman.\nNew topic, security, so I'm a security attorney myself and I know that states play a really\nrobust, can play a really robust role in preventing fraud, particularly for seniors.\nI know that's been a cause for you.\nI also commend you for your agency op-ed after First Liberty, promising to essentially put\nmore towards securities investigations, the securities division, I'm not seeing that\nin this budget, and so I wanted an explanation for that, it's possible.\nPrimarily we had a bill called Senate Bill 284 that did not pass on the 40th day last\nyear, and we'd highly encourage to pass that one forward.\nAnd then additional strengthening of the law, that came out before the whole first Liberty\nsituation developed. But it gives protections to investors. Our recommendations that we\nare presenting are really the governor's recommendations. We were aligned on that.\nWe always could use additional resources, but for the resources we have, we have a robust\nteam. And our securities team is recognized as one of the tops in the entire country.\nAnd so we work very diligently. Our people are diligent. They want to make sure they\nThey stamp out frauds, Ponzi's schemes, and other illegal securities violations, and\nwe'll continue to do that with the team we have.\nBut it does take resources.\nIt will take the will of the General Assembly to add additional funding to add additional\ninvestigators.\nChairman Anderson.\nThank you, Mr. Chairman.\nSecretary, thank you for being here today.\nQuick question, just to follow up on some of my Senate colleagues' questions earlier regarding\nthe funding request for elections.\nThe amended request asked for 1.8 million\nfor the OCR count, and then the 5 million\nfor the full hand count for the two top tier elections.\nIs that for primary or is that for the general next year?\nThat's for the general.\nFor the general.\nOK.\nAll right, thank you.\nI can't tell.\nThank you.\nThank you, Chairman.\nSecretary, I wanted to ask a question around security as far as home ownership.\nFor foreign investors into the state of Georgia who buy homes, is there a possibility where\nthey can be treated like a business where they have to come and file an annual report just\nso that we know who owns what when they're outside\nof the country and where they own property.\nI know they're not supposed to buy within certain areas\nof more secure areas such as based, you know,\nour army or military bases.\nBut what about in communities so that we can see\nat a municipal level who owns what.\nAnd sometimes we've just, we've got bad actors\nand we don't know who owns.\nand we can't really get the other to comply with local ordinances.\nIs there a possibility or does that make sense?\nI know that there's a concern which I share about foreign ownership of our farmland,\nbut you're also raising another issue and I'll have to review that\nand I'll get back to the committee and the members.\nThank you. Thank you for your question.\nThank you, Mr. Secretary. I think you can see there are a lot of questions. You've answered all of them and I hope that you will continue the\ninterest and\nDirected toward the licensing division because we we did have a lot of focus on them over last\nTwo summers ago and things have improved but as you can see they're not perfect\nThey're not there and I hope you will continue to focus some attention in that area. Yes, sir\nBut also when we do get complaints we do respond to them\nIn fact, we had a person\nThey were inspected. It was a barber and so we now are providing the member, you know the photos of our inspection\nSo you can look out why that person did not\nMeet the acceptable level of standards that are required per state law\nWe will continue to provide great public service and to make sure that our members and the chairman are kept in the loop on these things.\nI may have some legislation headed your way for more pictures. Thank you.\nThank you.\nNext up is Commissioner John King with the Office of Insurance and Pire Safety.\nAll right, Commissioner, good, gotcha, you're about to hear me.\nOkay.\nThank you, Mr. Chairman.\nGood afternoon, Chairman Hatchett and Chairman Tilly.\nThank you and members of the committee.\nThank you so much for allowing us to come and do our budget presentation.\nBut I want to start off with this is my only opportunity to really come and brag a little\nbit about our agency in front of the legislature, and so I want to highlight some of the achievements\nthat you all have had a hand in helping us achieve, and so I'm very grateful for that.\nFirst of all, this is a tough week for our agency.\nWe lost Steve Manders, our Deputy Commissioner of Insurance, almost a 40-year veteran of\nthis agency serving the state of Georgia.\nSo, you know, it's been a tough week for the team,\nbut it's an incredible, incredible individual\nthat was passionate about serving Georgia,\nand we hope to continue his legacy\nin providing absolutely a top notch service\nto the state of Georgia.\nCommissioner, thank you for bringing that up.\nIf you don't mind, we're gonna ask the committee\nto hold a moment of silence in his members as well,\nand the services state.\nThank you so much, thank you all for this opportunity and to highlight what our agency\nhas done to serve the people of Georgia every day.\nThe support of this body has been essential in the tremendous growth of this agency in\nrecent years.\nToday, we are more effective, more responsive, and more transparent than ever before.\nAnd we could not have done that without the trust and confidence that you all have placed\non us.\nI want to begin by showcasing some of the success of our agency that you all have entrusted\nus.\nMy agency is the second largest generator or wealth for the state behind the Department\nof Revenue.\nOur premium tax division is tasked with collecting taxes on insurance products and purchases in\nGeorgia.\nIn fiscal year 2025, we collected $1.71 billion in premium tax revenue.\n$773 million of that was distributed to every city and county across Georgia.\nWith $737 million collected, it went to the state coffers.\nOur criminal investigations division is responsible for investigating insurance fraud and related\ncrimes.\nBehind tax evasion, insurance fraud is the second most costly white collar crime in America.\nThis cost of insurance fraud has passed directly to the consumer, and the costing the average\nGeorgia family between $400 and $700 increase annual premiums, according to the FBI.\nBut the stark reality is Georgia is still too high.\nWe are ranked number three in the nation for insurance fraud per capita.\nWe have a heavily invested in our division with your support.\nWe originally started with nine investigators in our office, and now we're not took office\nin 2019.\nNow we have more than 30 investigators, examiners, administrative staff, administrative staff\nwith enhanced capabilities that supports every community and we support all of the state\ninvestigative agencies.\nWhile we have grown in our capacity to identify and arrest those committing insurance fraud,\nThe conviction rate for these types of crimes continues to dwindle.\nIn order to decrease the amount of fraud happening in our state, we need prosecutors who are\nable and willing to go after-\nYou\nWhile Georgia being the number one state to do business, our state has been flooded\nwith new construction.\nAnd anytime there's a new construction like a new wing of a hospital, additional renovations\nto a church, or a new stadium, or public facility, our team is there to ensure that the safety\nof those occupants.\nWith the reopening of the Rivian plant, for example, our office is taking steps to have\npersonnel there at all times to ensure that the production can ramp up to full speed\nas soon as possible, and ensure to continue investment in our great state.\nWe're continuing to actively recruit, train, and retain boiler, elevator, amusement,\nto manufacture housing inspectors who are a critical part of the safety and occupation\nof our state. When I first took office, we only had 40% of the elevator inspections\nwere completed across the state. This year, we are projected to reach higher than 90% completion\nrate. And the only reason I don't have 100% is because we're building elevators almost\nevery day. It is just an ongoing battle. But thanks to you all support, we've been\nand able to put a serious dent in this challenge.\nLast year, this body provided us with the funding\nfor 45 additional positions in the Safety Fire Division,\nwhich was critical to this achievement,\npaving the way for a stronger and safer Georgia.\nNext slide.\nI don't know if you all know,\nbut there's gonna be an event later on this year\ncalled the World Cup.\nWell, apparently, our agency is very involved\nin the safety and inspections,\nof all the, you know, all the facilities and the places where a lot of our international\nguests would be coming.\nAnd so, there will be eight matches in our great state during June and July.\nWe're working closely with FIFA, with the World Congress Center, the city of Atlanta,\nand preparing well in advance for this truly massive event.\nWe are, we're hosting the, just like we hosted the Olympics in 1996, nearly 2 million spectators\nparticipating, participated and traveled to Atlanta and to our state. Recently, FIFA has\nseen millions of visitors from across the globe to travel to these matches. Currently\nprojections estimate that between five and six million people will be traveled to the United\nStates to watch these matches and participate in fan events. As a result, our team has\nbeen in all hands on deck and will make sure that we are prepared to host these visitors\nin a safe environment. In support of this responsibility, the office will enforce all applicable\nstate or Georgia life safety codes along with other relevant state approved fire building\nand safety codes and standards. This includes comprehensive plan reviews, permitting and\nonsite inspection of activities to verify compliance with requirements over occupant,\nsafety, fire protection systems, means of safe egress, and crowd management.\nEmergency preparedness and active crowd of facility monitoring during these events.\nOur law enforcement officers in the office will provide support to the inspection operations\nand regulatory enforcement and active crowd monitoring through these events.\nTheir presence will enhance situation awareness, support compliance efforts, and contribute\nin maintaining a safe environment for all participants.\nAdditionally, the office will conduct inspections and regulatory oversight of all escalators, elevators,\nand any conveyance system within stadiums, fan zones, and support facilities.\nThis includes ensuring that these systems are properly certified, maintained, and operated\nin accordance with Georgia law and applicable safety standards.\nNext slide, please.\nGeorgia Reinsurance Program provides the financial support for the health of insurers, helping\nand cover the costs of enrollees with high medical expenses without passing the burden\nonto consumers in the form of higher premiums.\nThe goal of re-insurance is to reduce consumer premiums, increase the affordability of health\ncare, and make Georgia an attractive market for health carriers.\nAs you can see in this play, since 2018, the number of health insurance carriers in\nGeorgia has more than doubled.\nWe now have 10 health insurance companies competing across our state, giving Georgia's\nmore control over the health care than ever before, and allowing the free market principles\nto drive the cost for the average Georgia.\nThe average premiums decrease by 12.4 percent, and in some of our rural areas, we've seen\ndrops up to 30 percent decrease in premium savings.\nto Georgia Access. Last year, Georgia Access launched a state official health insurance\nmarketplace. I'm glad to report that our platform has outperformed nearly every other exchange\nacross the nation and including the federal government. The first of its kind, Georgia\nAccess partners directly with enhanced direct enrollment entities to sign up consumers\nfor health coverage. The EDEs are web brokers that offer enrollment in all available plans\nacross insurance companies, an insurance company that offers enrollment in their own plans.\nThis year, over 1.3 million George signed up for health insurance coverage.\nOver 191,000 of these consumers did not previously have health insurance coverage in the exchange.\nAnd during open enrollment, our call center answered over 433,000 calls for assistance.\naverage over 5,000 calls every day helping people get coverage.\nSeventy percent of those consumers utilize the enhanced\ndirect control.\nAnd this is something that I really want to brag on our agents\nselling health insurance coverage.\nEighty percent of those who received assistance were assisted by\nGeorgia licensed insurance agent across the state of Georgia.\nGeorgia. And so that's really the key. We let agents do what they do best, sell insurance\ninstead of the government trying to do it for them. So in every, in the year when consumers\nsaw a lot of change in healthcare landscape, I'm proud that our team and our state is helping\nconsumers each step of the way and enroll for coverage. As you can imagine, this is a\nvery complex year. We're still reeling from some of the, from some of the failures in\nWashington DC. And unfortunately, as state leaders, we end up having to pick up and clean\nup the mess, as usual. Now, the easy part, Chairman, now that I'd like to discuss our\nagency's budget request before opening up to any questions you all may have. First,\nI am not requesting any additional changes to the amended fiscal year 2026. I know every\nThe Constitution officer comes here and asks you for more money, I'm not asking for money and just continue giving me the flexibility to use the budget that you've given me and be able to provide those priorities.\nFor amended fiscal year 2026, we only have two major items to report.\nFirst, we're giving back the state funds in two programs, nearly 2.6 million for administration and 582,000 for enforcement.\ntotal return to over $3 million. This return, it'll state funds as a result of our\nincreased other funds that you will see in insurance regulation program. We\nalso asked that you continue to support our re-insurance program because\nthat's the key to keeping these insurance rates flat or decreased across the\nstate of Georgia. We are asking for a continued support to re-insurance\nprogram in the amount of $120 million. User fees continue to support the\nre-insurance with 82 million going to this program, and it claims have increased from\nprior years by about 43% of medical expenses have increased.\nFor fiscal year 2027 budget requests, we are asking for the same items, the removal of\nthe $3 million in state funds for administration and enforcement, for an increase in appointment\nfees, and also the continued support to re-insurance program in the amount\nof $146 million. You will notice a $25 million difference between these two years, that's\nbecause 2026 claim your experience was slightly lower than expected. So we're able to return\nthat money back to the general fund. And so with that, I would like to open to any questions\nthat you all may have on this or any other topic. Thank you so much for the opportunity\nto do it. Provide this information to you all.\nThank you, Commissioner King.\nThe first question is Senator Carpetcher.\nThank you, Commissioner.\nGreat to see you.\nYou know, we passed laws over here, and then we hand them\nover to you.\nThose of us who do insurance work for enforcement.\nAnd so I just wanted to tell you how much we appreciate the\nrecent action that you took on the parity issue that we've\nworked on for several years where there are people who are\nor not following the laws that we passed.\nSo I appreciate that.\nHave you got everything you need, staff-wise,\nto continue that work?\nYes, ma'am.\nYes, ma'am Chairwoman, the challenge that we have\nis that a lot of people don't understand the process\nand it's a very methodical and careful process\nbecause if we take a misstep,\nI'll end up in Fulton County Court on appeals\nthat they will take even longer to get.\nI see my role as the old Atlanta police officer\nthat I was when I first started in law enforcement.\nI direct traffic, I direct commerce.\nYou all give me the tools.\nWhen a company breaks the rules, we pull them over,\nwe issue my citation, we give them a corrective action,\nand we get them back on the road.\nNow if they don't pay attention to that,\nthe pain will increase.\nAnd I appreciate the support that you all have given me\nand their tools.\nBut these investigations take a minimum of 12 months\nbecause we go through every line of insurance.\nWe go through all their emails.\nWe have actuarial, folks go through every one of these.\nAnd it's not as quick as I would like it.\nAnd my team will tell you, I'm one of the most impatient\npersons that they have to work with.\nBecause I want results.\nI want to be able to show the people of the state of Georgia\nthat the insurance commissioner's offices\nthat they're out on the ball.\nAnd so I appreciate the opportunity.\nAnd we will continue watching this carefully.\nYou all spoke very loudly.\nYou passed this bill unanimously.\nAnd then not many bills get passed unanimously in this day.\nBut you all gave me a charge that is very clear.\nInsurance companies got to follow the law,\nor else we're going to increase the pain.\nThank you.\nRepresentative Yerda.\nThank you, Mr. Chairman.\nThank you, Mr. Commissioner, for being here with us today.\nAppreciate the job you do.\nWith recent funds being approved for planned reviewers\nand other positions of dealing with construction\nand laser inspection, as the agency seen in notable improvement\nin inspection backlogs.\nAbsolutely.\nIt's significantly, when our first took over,\nwe were six or seven months behind.\nAnd in this day and when time and materials\ncan crush any construction project going on,\nwe've now sped up, we're now in the matter of a week or two.\nAnd we also offer the opportunity for major projects\nthat want to accelerate, that they can pay an expediting fee,\nand we will ship that work to a contract.\nAnd you all made the suggestion that I look at contracting\nsolutions instead of increasing the amount of staff.\nSo we look at contracting solutions\nto be able to speed up the Fed.\nSo we're in great shape.\nNow, we have to, when a project like Rivian\nor something else comes up, obviously we have to search.\nBut I'm, both Chairman of this committee\nare not going to allow me to increase the staff\nto be able to deal with those contingencies.\nI have to be respectful of the taxpayers money\nthat we can surge operations,\nand then we look at the data and where we need to grow.\nWe have our inspectors now based across Georgia,\nso they're not commuting from Atlanta.\nAnd so we're close and we're using our computer solutions\nto be able to manage, for example,\nif you have an inspector down in the middle drill,\nhe will look at what other inspections are in that general area\nand can hit him in using mapping and heat maps\nbe able to speed their amount of inspections.\nAnd so I'm very proud of the team.\nBut we haven't grown.\nYou all gave me 45 additional positions last year.\nBefore I come to you all and ask you for more,\nI want to make sure that we don't want to get too big\nand then start wasting.\nI'd rather keep a very close eye on how the throughput is.\nBut we're holding our own so.\nThank you.\nRepresentative Lamb.\nI just had a good to see you, Commissioner.\nI don't know you.\nSorry, I can't see you back there.\nI had a factual question.\nThe 14,000 insurance fraud complaints\nthat you mentioned earlier is quite staggering.\nAnd I asked the Secretary of State\nearlier about a fraud question.\nSo I'm obviously interested in this.\nWe're absolutely, can you speak up just a little?\nI know you're self-spoken, but thank you.\nYes, thank you, Chairman.\nSo the 14,000 figure regarding insurance fraud,\none, is that across all types of insurance?\nAll lines of insurance, yes, sir.\nSecond is, who are these actors?\nDo you have any idea who they are?\nYou name it.\nIt's the runs of gamut, it's not just,\na lot of it's sometimes as consumers,\nit's sometimes organized criminal groups.\nThe stage, for example, accidents.\nAnd people who are participating in this kind of fraud,\ndon't just do insurance fraud.\nThey do workers' comp fraud, they do insurance fraud,\nthey do banking fraud, romance scams.\nThese, I will assure you, GBI and your law enforcement agencies\nhave arrested all the dumb criminals.\nWe are now dealing with PhD level quality.\nThese are very complex tough cases.\nAnd as you can imagine, the district,\nWe're presenting quality cases.\nBut the district attorney's offices are overwhelmed,\nso they're having to choose do I prosecute a violent crime,\nor do we prosecute an insurance fraud scheme\nthat is very complicated and is tough to explain to a jury.\nThat's what we, instead of just whining about a problem,\nI wanna be able to go and help those district attorney's office\nwith additional resources with some of our attorneys\nto help them prosecute it so we can make a dent on it.\nWe're number three in the nation, and I'm not satisfied.\nNeither should you.\nAnd thank you, that's why I'm asking these questions.\nWe just want to know more, obviously.\nAnd so to that point, the third and last part of the question\nis of those 14,000, how many have been successfully\nprosecuted, landing in some sort of conviction\nfor the fraudulent actions?\nIt's quite disappointing, sir.\nWe're presenting cases across the state of Georgia\nin many of them, the district attorney's office.\nAnd the police do not take my comments\nto just bashing the district attorney's office.\nI used to be a chief of police.\nI know that they don't have any good, easy solutions.\nAnd it'd be easy for me to hear,\njust come and wind at the district attorney\nof this county, this county, it's not prosecuting.\nThat would not be a fair criticism.\nMy job is if I'm gonna present a problem,\nI need to offer viable solutions.\nAnd I have a great relationship\nwith district attorneys across the state.\nI mean, I've been in law enforcement 31 years.\nAnd so our rates is pretty low.\nI mean, we're presenting cases\nthen they get non-prosecuted\nor when they get prosecuted a lot of times,\nyou know, they give minimum sentences.\nIf we're gonna truly create a deterrent,\nwe got to make this type of criminal activity really sting.\nAnd the victims of these crimes are usually our seniors.\nEvery time we have a major storm,\nevery storm that we've had, our agents deploy,\nwe work closely with the sheriff's,\npolice chiefs and district attorneys,\nbecause the fraudsters follow these storms.\nEvery tornado, every wind storm we have, the fraud follows.\nAnd so we're deploying now.\nWe're not waiting for the fraud to come to us.\nWe're going out there to try to stop it before it occurs.\nAnd so we're number three, sir,\nand I'm not going to make any excuses.\nWe got to do better at this.\nAnd my log jam is getting prosecutions\nat the district attorney's office.\nI have two questions. One, when you talked about, well, first, let me back up and say thank you. Your office has been very reactive quickly in terms of getting information.\nBut I have a factual question about the slide for the reinsurance and the point about the reduction in premiums.\nYes.\nI have so many constituents who are reaching out to me to say the exact opposite that they\nare seeing skyrocketing premiums and it was my understanding that specifically for the\nACA premium increases, the average increase was well into the double digits, not a decrease.\nSo can you clarify this point and then-\nYes.\nYes, ma'am.\nWe're talking two different things.\nThe reinsurance pool covers-\nIf you look at the slide with 2008, it covers only re-insurance.\nAnd if you look at the slide, 2018, the majority of counties only had one insurance carrier\nparticipating in the market, which means that obviously the state benefit plan is the\ncarrier.\nSo part of the strings of that contract negotiation is you had to be in every county.\nWhen we started implementing re-insurance, look at 2022 and now look at 2026.\nNow we have the high risk where companies now want to go into these counties and compete.\nAnd so, yeah, the subsidies is a whole different topic that I would ask you to maybe have a\nconversation with your congressional delegation about.\nThank you for clarifying.\nI just want to clarify, this stat is not health insurance, premiums decreasing.\nis specific to re-insurance, and then the related question is on the next page, where\nyou talk about the dramatic increase in coverage on access, which was very positive, but can\nyou clarify the percentage of those that probably were impacted by the ACA tax credits and\nwhat you might be doing to serve our constituents as we're getting these 20, 30, 40% rate increases\nyear after year. Great question. I hope I answered your question based on re-insurance.\nAnd re-insurance is the ability of companies to go and compete across the state of Georgia.\nWhen we only have one carrier competing in parts of Georgia, they set them in the hospital system,\nset the rate. And you know, y'all giving me a lot of authority, but you haven't given me the\nauthority to set, you know, what rates, you know, what rates are applied or not. I don't have that\nauthority. I can accept them, I can slow them down, but ultimately, if the market is competitive,\nyou know, a lot of people think I'm the czar of insurance rates. And I guess my job is to be\nthe blame catcher for insurance rates. I get it. That's why I'm a constitution officer. But\nI can't go to an insurance company, says, I don't like your rate. I'm not approving it.\nWhat are the roadblocks that are in place? You?\nyou?\nThe roadblocks for the insurance companies?\nLegislature.\nThey have never given the authority to the insurance commissioner to, and don't give\nme wrong.\nI don't want, I think it's dangerous for one individual to have complete control over\nrates.\nWe can only go back to the history of insurance commissioners in Georgia and how many\nof them have gone to prison that I would temper that.\nBut I have, don't give me wrong.\nI have a lot of tools to be able to deal with that,\nwith that, and have an influence.\nBut please don't think that I'm the czar\nof insurance rates, because you've never given me that.\nI thought no insurance commissioners\nhad that authority.\nJust want to make sure.\nCan we go back to the other slide on that?\nI think that is a good place to end.\nCommissioner, you have answered all the questions.\nWe can sit down and talk to you.\nI've answered all the questions.\nThank you.\nThe chair is just happy that I'm not asking for more money.\nThank you very much chairman and members of this committee appreciate the opportunity to present to you all thank you thank you commissioner King\nNext up is commissioner Holmes with Department of Labor\n20 years ago, I'll get 30% of the graces every year, and there's none of the shittles in public.\nYeah.\nThe same church company talked about this roof.\nIt's a great piece of this.\nIt's destroyed in our country.\nAnd of the skies that they're helping.\nYou're absolutely right.\nHuh?\nAll right, y'all, let's turn to roll it down.\nCommissioner Holmes, thank you for being here and turn it over to you.\nWell, thank you so much. Good afternoon.\nGood afternoon to our honorable members of the Georgia General Assembly.\nI'm Labour Commissioner Barber of your homes, and I'm joined today by my Chief of Staff,\nJansson Head, my Chief Financial Officer, Kate Ferman, and we truly are honored to be\nhere and grateful for the opportunity you provided us to discuss funding for the recommended\nand the Governor's budget for the Georgia Department of Labor.\nOn behalf of our entire team, I do thank you for your partnership and for the state funding\nthat you have entrusted to our agency, because your support allows us to deliver mission\ncritical services to the Georgians who need them most.\nThat investment is powering the largest unemployment insurance modernization in state history.\nGovernment should meet the urgency of the people it serves, and as a part of this agency\nwhy transformation, we're replacing a system from the 1980s with technology that will help\nGeorgians faster, safeguard taxpayer dollars from fraud, and eliminate the technical bottlenecks\nthat have long impacted workers and employers alike.\nMigration to this new system will begin toward the end of 2026, and to say that we're excited\nabout this would be a significant understatement.\nThis afternoon, I will walk you through our new strategic plan,\nthe governor's budget recommendations for amended fiscal year 2026,\nin fiscal year 2027, and provide you an update on the agency\ntransformation and the unemployment insurance trust fund.\nLet's start with the foundation of our work, our strategic plan.\nSince taking office, I have met with workers, employers,\nand community leaders across your districts,\nand their message is clear.\nA strong Georgia depends on a labor department\nthat moves at the speed of business\nand delivers measurable results.\nThe Georgia Department of Labor is rising to meet that challenge\nby evolving into an organization\nthat is forward-thinking, future-focused, and resilient.\nAnd that is why we recently launched\nour Comprehensive Strategic Plan,\nthe future of GDOL, a bold transformation.\nThis plan is built on four pillars,\ncustomer-centric transformation,\nand powering talent and leadership,\nmodernization and operational excellence,\nand strategic influence and partnerships.\nTogether, these pillars align directly\nwith labor's budget priorities\nand reinforce legislative initiatives\nthat expand opportunity, strengthen our workforce,\nand fuel Georgia's continued economic rev.\nTo achieve the goals outlined in our strategic plan,\nThe governor's budget provides targeted funding\nto support our employees and key initiatives,\ntotaling $3.26 million for amended fiscal year 2026.\nStarting on page 250 of the governor's budget report,\nthere's a total increase of $1,563,078 to provide\na one-time salary supplement of $2,000\nfor our full-time regular employees throughout the agency.\nThe next item, which is line two under departmental administration, is an increase of $611,661 to cover\nrent for the Athens and Thomasville Career Centers while we work with the State Properties\nCommission to fill recently vacated space.\nThe Athens and Thomasville Career Centers operate under bonded leases, requiring that\nJudeo remain until the bond obligations are fully satisfied.\nThese centers co-host location partners, so we split and share operating costs among\nthe partners.\nBut when a partner departs, GDOL's share of costs increases until the vacated space is\nreoccupied.\nThat recommended funds will enable GDOL to manage these additional expenses while working\nwith the State Properties Commission to secure new partners to assume this space.\nLine 3 under Departmental Administration recommends an increase of $1,090,000 to replace\naging laptops across the agency through the Georgia technology authorities and\nuser computer services. The agency's outdated inventory of laptops and\nhardware is impeding our daily operations. Most of Labor's laptops were\npurchased at the onset of the pandemic and have now surpassed the recommended\nthree to five year life cycle resulting in rising hardware failures and\nincreased downtime. This funding will allow GTA to replace and maintain laptops\nensuring they remain modern, reliable, and effective in the years to come.\nLooking ahead, fiscal year 2027 recommendations build on these recent investments\nand position the agency for stronger performance and accountability\nwith 3.4 million in funding.\nThe budget, however, first addresses statewide adjustments.\nStarting with fiscal year 2027 on page 250 of the Governor's Budget Report,\nbudget report. There's a total reduction of $315,813 for statewide adjustments in fiscal\nyear 2027. These adjustments account for statewide changes in telecommunications and infrastructure\nbillings with the Georgia Technology Authority, Georgia at work billings, and a lower employer\ncontribution rate for the state health benefit plan within our administration and unemployment\ninsurance programs. Additionally, line four under Departmental Administration reflects\na reduction of $62,700 to remove one-time funds previously allocated in the FY2026 budget\nfor staff training, which was successfully implemented this fall.\nStarting on page 251 of the Governor's budget report, the next recommendations provide\nfunding for critical positions needed to support unemployment insurance program activities.\n2 recommends an increase of $1,642,557 to fund 20 additional positions dedicated to\nthe collection of unemployment insurance contributions.\nWe know that understaffing costs Georgia millions.\nWith only 36 collection agents, GDOL recovered just 11 percent of 288 million and delinquent\nemployer payments, leaving major regions such as Metro Atlanta underserved.\nand so a strategic investment pays off.\nAdding 20 collection agents at a cost of 1.6 million\nis projected to generate 11.3 million\nand recovered payments, penalties and interests.\nAnd this would then be a direct infusion\ninto the state treasury.\nSo the math is clear.\nFunding additional collection agents\ndelivers a strong return on investment,\nits strengthens Georgia's fiscal health,\nand it ensures it employers meet their obligations.\nIn alignment with the agency's strategic plan,\nline three recommends funding of $1,059,178 to support 15 additional customer service\nrepresentatives who will assist judges with inquiries related to UI claims, appeals,\nemployer UI contributions and other critical services.\nLet me give you a little data.\nOur average call time is approximately five minutes and 28 seconds.\nOur call abandonment rate is more than 30%.\nAnd our current staffing is 27 employees of which 13 are time limited, and they are handling\nupwards of 14,000 incoming calls every week.\nThe governor's recommended funding will enable GDOL to expand its permanent workforce, strengthening\noverall call center management, and ensuring greater stability and responsiveness.\nAnd in particular, the additional staff will provide critical support ahead of the UI\nfire system launch, which is expected to temporarily increase call volumes as customers adapt to\nthe new platform. User training is incorporated into the implementation timeline. It's something\nthat's so important for success, but a short-term surge in calls is anticipated during this transition.\nAnd these permanent positions will help manage that initial influx and enhance the long-term call\ncenter operations. Reduce abandonment rates, improve service delivery, and ensure Georgia's\nreceived reliable support well into the future. The need is urgent. The impact is statewide\nand the solution in this case is staffing.\nLasting, line four recommends an increase of $1,100,583 to fund 12 additional financial\nauditors dedicated to conducting detailed audits of employer UI contribution records.\nOur auditors drive measurable impact through four key metrics. It's a percentage of contributory\nemployers audited, the percentage of total wages adjusted, the percentage of overall\nwages audited, and the average worker misclassifications identified per audit.\nAnd we know that when audit shortfalls weekends are enforcement, GDOL is below the federal\n1% audit threshold, limiting our ability to detect fraud, identify misclassifications,\nand recover funds.\nThese additional positions will allow us to meet the federal standard and strengthen oversight.\nand auditors thus enhances compliance, it increases collections, and it safeguards the\nintegrity of Georgia's unemployment insurance system. This funding represents a commitment\nto meeting federal requirements and a strategic investment in protecting state resources.\nNow I'll turn to our capital items included in the FY 2027 governor's budget.\nOn page 390 under responsible and efficient government, line one includes 6.7 million\nand capital funding to address the agency's most pressing facilities need, the demolition,\ndesign, and construction of the downtown Atlanta Central Complex parking lot and warehouse\nbuilding. This building is saving, serving severe structural issues due to long-term\nwater damage. Despite waterproofing efforts in 2010, 2023 and 2024, damage persists due\nto the building's complex design. Concrete corrosion has compromised the parking\ndeck that is used by Career Center customers and the underlying warehouse structures.\nWater intrusion is now affecting the hallway between the warehouse and GDOL's data center,\nraising urgent concerns.\nWithout intervention, continued water intrusion will further compromise the integrity of the\nwarehouse and data center spaces, as well as the parking deck that's connected to the\nAtlanta Career Center.\nOnce underway, the work will take an estimated 18 months to complete, and our facility\nteam has developed a plan to mitigate disruption to the Atlanta Career Center operations during construction.\nWhile these capital improvements are essential to preserving our physical infrastructure,\nit is equally critical to ensure the financial foundation of Georgia's unemployment insurance system\nremains strong. Georgia's unemployment insurance trust fund was depleted during the pandemic\nin September 2020. As of December 2025, Georgia's unemployment insurance trust fund balance\nstarts at 1.98 billion, which is still 1.5 billion below the U.S. Department of Labor's\ncalculated solvency threshold of 3.48 billion. Multiple factors continue to impact solvency,\nand GDOL remains committed to working closely with the governor's office and the Georgia General\nassembly to develop responsive long-term solutions. These efforts will focus on strengthening\nthe trust fund's stability, ensuring its capacity to support Georgia's workforce, and\npromoting a healthier unemployment insurance system for the future.\nIn addition to safeguarding the trust fund's long-term solvency, GDOL continues to strengthen\nits fiscal stewardship through consistent revenue collections deposited with the state\nTreasury. For fiscal year 2026, GDOL remitted $17,354,194 to the state\nTreasury, which includes funds for administrative assessments, penalties and\ninterest. This amount represents an increase of $678,481 or 4% compared to the\nsame fiscal year 2025. The governor's recommended increase in audit and\ncollection staffing will further boost\nrisk return by driving higher revenue to the state\ntreasury.\nI thank you for your time and for the opportunity\nto be here with you today.\nYour partnership and your leadership\nare essential to keeping Georgia the number\nat state for business and the best place to work and live.\nAnd I will tell you, laboring is a team sport,\nand we're in it.\nWe're in it with you, and we're proud to be there.\nI look forward to continuing to work with you\nthroughout this legislative session\nto deliver real results for the people of Georgia.\nIt is a new era for the Georgia Department of Labor\nand we're proud to move forward with you.\nSo I'm happy to take any questions.\nThank you, Commissioner Chairman Workhazard.\nThank you, Chairman.\nCommissioner, thank you so much for what you've done.\nWhen you came in very quickly, you didn't just come in\nand keep the agency rolling.\nYou came in with a very aggressive vision\nthat you're already implementing.\nCouple of two things.\nThe experience of the Inspire system\njust real shortly about the experience for the employer\nand the employee with the new system.\nAbsolutely, so it's,\ncan I get the water?\nThank you.\nSo the UI system, really for us and for Georgians,\nrepresents a once in the generation overhaul.\nIt's a platform built in the 1980s.\nIt was never designed for today's volume,\nfor its complexity, or the cybersecurity needs that we have.\nSo when we launch UI inspired at the end of the year,\nour Georgians will experience faster, more intuitive\nservice.\nThe claims will be more efficient, reducing the delays\nthat have historically frustrated workers and our employers.\nSo for employers, excuse me, the system streamlines\nreporting it reduces technical bottlenecks and improves accuracy and wage and contribution\ndata. And those are really big pieces. When I'm speaking to employers, we're talking\nworkforce, we're also talking the complexity and inefficiency of our system now. So both\nour Georgia workers and our employers will see immediate benefits when this UI inspired\ngoes live in 2026.\nOkay. Thank you very much. One other issue that gets brought up every single year, in our committee, is misclassification. Employees, employers, misusing employees is 1099 versus when they should be WT's reasons.\nthe enforcement part.\nI think you mentioned that in your\ncome, come, come, come.\nI think that would backfill almost every agencies.\nShortfall if we could tackle that problems\nbefore the work on that issue.\nThank you, sir.\nChairman Lundsmith.\nThank you, Mike.\nDaniel.\nThank you for a wonderful presentation.\nI think you've got an active staff.\nWe have a fantastic team, and if you're standing,\nbut if you'll just wave anyway, fantastic,\nthen of course my CFO and my chief of staff\nare up here with me.\nThank you, thank you for your presentation.\nI'm still hearing from my constituents\nwho are victimized during the pandemic\nwhen all the names were captured,\nand they're still getting done in letters, threatening letters,\nand such to say it.\nSo is there a number that you could give,\nnot publicly, but give to your legislators?\nI'm going to try and reconnect some now that it appears to you I'll try to get on top of\nthe situation.\nAbsolutely.\nWe'll be happy to send out a communication to all members of the legislature with the\nappropriate numbers that you can pass on to your constituents so that they can receive\nthe assistance that they need.\nThank you.\nThank you.\nI represent Vance Smith.\nYou're the sorry.\nYou're the.\nThank you, Mr. Chairman.\nThank you for being here.\nAnd we appreciate your presentation.\nThank you Mr. Chairman. Thank you for being here and we appreciate your presentation.\nYou did a great job. You know you touched on the unemployment insurance trust fund and\nthe problems with that and I know in the governor's recommendation to have additional financial\nauditors. What are some other potential means to short that fund?\nAbsolutely. Thank you for that question. It is something that we should be asking ourselves.\nCertainly we're asking that question as a Labor Department and you're asking\nthe members of the General Assembly and there are several strategies that could help\nwith George's UI Trust Fund and we're again engaging in conversations with members of the\nAssembly as well as the Governor's Office. So I'll go through a few considerations and then\nwe'll continue to work with you. So one is to redirect the administrative assessment.\nSo that allowing the statutory authority to collect the administrative assessment from employers\nto labs, that would redirect about $20 million annually from the straight treasury directly\nto the UI trust fund.\nSo that's one option.\nYou could also establish a waiting week period and so 42 states right now require a one\nweek waiting period before claimants can receive benefits.\nGeorgia, however, issues two beats of benefits and the first payment.\nAnd so if you institute that waiting week, it reduces the initial payment to one week.\nIt does create a cost saving equal to one week of benefits.\nAnd what we know from our data is that the average claimant relies on UI benefits for eight\nweeks.\nThey can receive up to 14 weeks, but they're waiting, they typically use eight weeks.\nAnd so many will secure employment before that 21-day processing period.\nSo when you have the waiting week, you do create a savings.\nYou could appropriate state funds into the UI Trust Fund, some states, such as Texas,\nhave directed state funds into their UI Trust Fund to accelerate solvency.\nAnd you could adjust the taxable wage base.\nThis is not what we're recommending, but it is one of the methods that you could consider.\nSo again, increasing the taxable wage base is used by other states.\nIt is not our recommendation.\nHowever, just so that you do know, Georgia's current taxable wage base is $9,500 per employee.\nAnd it's the lowest among the eight South Eastern states.\nThe lowest is Florida.\nThe highest is North Carolina at 32,600.\nSo it's something to be considered.\nI'll also just note that maintaining one of the nation's lowest taxable wage bases\nsupports Georgia standing as a number one state for business and for talent and helps keep\nus competitive.\nSo those are some options that could be explored.\nCertainly we are open to exploring other avenues as well.\nthat I appreciate the question is a pressing matter\nfor our agency and certainly,\nI know that it is for the legislature as well.\nYes, sir.\nThank you, Commissioner Holmes.\nColleagues on first met her over the summer\nand I must tell you, it's just a breath of fresh air\nwhen you have a new person come in,\nthey put their arms around it,\nthey see what they need\nand they actually have a plan of what to do.\nSo thank you, Commissioner.\nmy pleasure. Those who know me know that I like a plan, I like to work the plan and I will deliver\non the plan, so I appreciate that. Okay, well thank you so much for the opportunity and again it's\na team sport and we're delighted to be working with you. Next up is Commissioner Frank O'Connell,\nthe Department of Revenue.\nYou\nYou\nAll right, I've got the room transferred over here for the most important man that we're\ninvolved with and that's the man that collects all the money.\ntime for us, this is last time presenting to us. I should know how many years you've been\nhere, Commissioner O'Connell, but I don't. But he likes to have meeting in his office. So\nI guess this is the last time that we're going to get to be frank with Frank.\nYes sir, but I'll try to be frank today as well. You're always frank. Thank you, Commissioner.\nThank you, Mr. Chairman, and good afternoon, Chairman Hatchett, Chairman Tillery, and members\nof the Appropriations Committee.\nThank you for the opportunity to speak with you today on the governor's recommended\nfiscal year 2026 and fiscal year 2027 budgets for the Department of Revenue.\nMy name is Franco Connell and I've had the privilege of serving as your state revenue commissioner since early 2023 and\nHave a wonderful staff and we'd just like to introduce some of them. I'm joined today by Keisha Beaver's our chief financial officer\nAustin Gibbons chief of staff\nstaff and an IIS Williams chief information officer and I'll add one of the\nthree finalists for Georgia CIO of the year. Joe Snowden director of\ngovernment affairs and communications. Now I'm also joined by another special guest\nMr. David Burge. Mr. Governor Cap announced Mr. Burge to be his next state\nRevenue Commissioner following my confirmation for the George Attacks Court.\nAnd coincidentally, David and I worked together right out of law school at a law firm called\nHansel and Post.\nFor both of our sakes, I won't disclose how many years ago that was that suffice it to\nsay that we have the same hair color today, and we have the same hair color that time in\nthe book that they used to produce every year of the young associates.\nI was going to say that you're hair coloring, you know, you used the same dye.\nNow back then, David worked in a different section than I did, but I found it to be very\nsmart and likable, very intelligent, and I'm confident that all of you will enjoy working\nwith David in his new role as State Revenue Commissioner.\nNow before we go into the department's budget request, I'd like to provide you with some\ngeneral information and updates about the department.\nThis is our Unclaimed Property and Process Improvement Project.\nUnclaimed Property, I have to admit before 30 years ago, I'd never heard of it, didn't know what it was.\nNow I think a lot of people know what it is, particularly since a law was passed a couple years ago, and we have CDR's claimants designated representatives.\nAnd that was an effort by you all, the legislature, to help unite people with their unclaimed funds.\nIt's been very successful and I could tell you that in fiscal 24 we reunited George's\ncitizens with $54 million out of the fund fiscal 25 that jumped to $115 million some more\nthan doubled.\nAnd this year it's trending at over $200 million.\nThat's a lot of extra claims, fiscal 25.\nWe had over 79,000 claims processed and paid out.\nWe've had a lot of pressure on the team this year, and I probably had more inquiries\nabout unclean property, and in an attempt to deal with that increased volume.\nNumber one, we're getting a new system, and we're scoring an RFP that just went out\nearlier this fiscal year.\nSo within the next time that the revenue commissioner appears in front of you,\nwe'll have a new system for unclean property.\nBut I decided not to wait until then because you can always make process improvements.\nAnd so we have a two person team of special projects and they've been examining\nwhat our folks do every day and they have found some ways that we can improve.\nDid the team want to invite those folks in?\nNo, you never want to have somebody come in into your sandbox, but I told them they were\nprivileged because it was going to make their jobs easier, provide better customer service,\nand they would be the first because every division is going to get the opportunity to have\na PIP.\nNow we're also going to bring forward agency legislation this year to help improve our\nuniting folks with their property.\nThe principal thing in that bill is called an exact match program.\nWe've got a lot of information about tax payers where they live so security numbers, et cetera.\nWe get information when holders submit funds to us that they can't unite with their former\ncustomers.\nAnd so we're going to ask for authority to match our income tax records up with our unclean\nproperty records.\nthen folks without even making a claim can be reunited\nwith their property.\nSo we ask your favorable consideration of that.\nI'd like to move on to Motor Vehicle.\nWe've made some meaningful improvements.\nWe've got a system called MyMVD.\nAnd you can sign up for an account.\nAnd in that account, you can do your renewal decals,\nSeveral other things, one thing that resonated with local folks who are agents and staff\nof the county offices was an ability to get a replacement title.\nFolks you just have to come down to the county offices and present some documents and get\ntheir replacement title.\nBut if you live at the same place, same owner, a lot of the information is the same.\nWe can do it online and get you your replacement title within a few days and you don't have\nto go anywhere.\nAnd I know that because I've used it myself for a title like couldn't quite locate but\nI had a new one within about three or four days.\nSo we're proud of that.\nMoving into alcohol and tobacco regulation.\nfew years ago we updated the alcohol regulations from A to Z. We're going to update all the\ntobacco regulations and we're going to modernize the way that we distribute tax stamps and\nthat's how tobacco dealers pay their fees through the tobacco stamps. Up to now we've had\nto have an inventory, manage the inventory, send out tobacco stamps.\nAnd now we've issued an RFP, we've chosen a supplier and the supplier is going to take\ncare of the inventory and send out the stamps.\nNow, the net for us, for the state, will generally be the same except it will free up one to\nto folks whose sole purpose was to manage that program.\nSo we'll be able to redeploy those folks to better uses.\nIn tax operations, we've got our website, the Georgia Tax Center.\nAnd one of my things to do has been to make that even more useful.\nYou can look at certain things in your account.\nYou can make payments.\nBut I know from being on our side, there's\na lot more information that we can look at than taxpayers could see.\nSo over the last three years, I've pushed to have some of the more useful information\npushed to that portal, and now we have a lot of tax credits, now tax payers can go online\nand see the tax credits they have, what they've used, what they've got left, and importantly,\nthey can see what they've transferred because a number of our tax credits are transferable,\nAnd they can see where they've pushed those tax credits and what the status of those is\nalso with net operating losses.\nAnd we're going to continue to make that more useful and increase self-service options\nfor Georgia tax payers.\nI'm modernizing the voluntary disclosure agreement process.\nIf you've not been following with us and you think you should have been, you can approach\nus anonymously and if the information we get from you pans out, we can limit the look\nback period to three years and waive penalties.\nWhen I started that the department 22 and a half years ago, I think we had about 25 VDA\nrequests a year.\nIt's been a very manual paper intensive process, but right now we're in a process to make\nit electronic, no paper, because we've gone to having perhaps a couple hundred VDA requests\na year, and that will serve taxpayers better.\nJust yesterday, I know I didn't know what AI was three years ago.\nWe can't get away from it, so we have launched an AI-enabled tool into production.\nIt's called MSU Amazon Q for Connect, and it's going to provide real-time assistance\nfor our compliance division folks.\nIt's going to be able to pull from our FAQs, our regulations, our standard operating procedures.\nIt's been particularly helpful to our newer agents, because believe it or not, as somebody\nHe is on the phone asking the question, the system can listen to that question and already\nknow what materials to pull up for the agent and make it possible for them to answer the\nquestion more quickly and accurately.\nAnd of course we have safeguards in place.\nWe let people know ahead of time that we're using AI in rendering this assistance.\nOne thing I'd like to note, we have publications in the state tax world and they monitor the\n50 states and I've been a little bit disappointed over the last couple of years but I found out\ntwo weeks ago that they have put Georgia in the top 10 for tax administration so I just\nwant to announce that is part of our idea of making things easier and give even tax\npeers what they want. It's been recognized by the National State Tax Press. Like to mention\na couple of DOR-wide projects, we moved and completed our move in February to 25 95\ncentury Parkway. This consolidated us into a five-story building with a lower base\nfrom an 18-story building. Just in fiscal 25, we realized budget savings of 1.6\nmillion. So something that we're doing to be responsible with our budget. I can\nNo longer sit in my office and see Stone Mountain, I see trees, but taxpayers shouldn't have\nto pay for my view, and I love trees.\nSo it's been a great move.\nIt's also given us a lot of good meeting space we didn't have before.\nAnd so when we had big meetings of groups with maybe 80 or 100 folks, they had to be off\nsite.\nNow we can do that internally.\nwe have two large meeting rooms on the first floor.\nOur next big project that I'll talk about with transition us into talking about the budget.\nAnd that project is the fourth round of surplus tax refunds proposed by the governor.\nThis $1.1 billion refund is included in our FY26 budget and will be supported by the\nthe legislature's passage of House Bill 1,000.\nNow this is an all-hins on-deck effort for us at DOR\nbecause we want it to be successful\nas it has been the last several times\nand make sure that our customers have a way to self-serve\nand also that we're prepared to receive all the calls\nthat we will get.\nNow I wanna move directly into our budget\nand look at revenues AF26, AFY26, and FY27 budget items.\nThese are located in section 42 of the budget tracking sheets.\nAnd I'll reference the fiscal year and specific line numbers\nas I walk through this recommendation.\nNow, beginning with amended fiscal year 26,\nI'll start with our cortex and motor vehicle systems.\nIn section 42, line 42.6.2, the governor's tracking sheet includes 6.5 million for the driver\nrecord and integrated vehicle enterprise system, also known as drives, and that's our motor\nvehicle tag and title system.\nNow in section 42, line 42.8.2, the recommendation includes 12.5 million for our integrated\ntax system or ITS. These funds are to support a core 26 upgrade for both systems, ensuring\nthat they remain secure and reliable and compatible with modern technology. Typically, I think\nvendors have a three-year cycle.\nThe last version we put into effect\nwas called version 12, and that was in 2022.\nAnd it's time to upgrade to the newest version from our vendor.\nIt's going to modernize the underlying system architecture\nand programming language.\nWe're going to go from something called vb.net to C Sharp.\nIt's going to strengthen our cybersecurity\nprotections for sensitive tax payer and driver data, it's been described to me, we have\nof course a lot of sensitive tax payer data, it'll be in the vault, there'll be an encryption\nlevel at which our systems operate on the data, if somebody breaches us and gets data, they're\ngoing to get the encrypted data, which will be of no use to them.\nSo a very significant cybersecurity upgrade.\nIt'll also expand some of our online service tools\nand improve our reporting and analytics capabilities,\nalso allowing taxpayers to complete more transactions online.\nOne last mention about Core 26, it'll improve our cloud infrastructure.\nWe were the first agency to the cloud, and I think the first DOR to the cloud in the\nUnited States.\nIt gives you a lot of advantages, but having this upgrade will enable us to take advantage\nof those ways to increase efficiency of server usage and storage.\nNow, replacing either one of those two systems I mentioned because you want to look at alternatives,\nthat would be estimated to cost between $100 million and $300 million.\nObviously, this is the most cost-effective way to continue to manage our systems.\nI asked my chief information officer because you always want to have something to compare\nAnd of the 50 states, probably about 40, 42 have a system comparable to ours.\n34 of them use the same vendor we do.\nWould I like to see some more diversity, yes, but it says that this is a product\nthat works and that's been our experience.\nAs far as whether we should go to court 26, I asked them about that.\nHalf a dozen states, even though this is a fairly new upgrade, half a dozen states,\nhave already started, including when it's larger than us, Pennsylvania,\na neighbor, Alabama, so other states are recognizing this is a great thing to do\nto continue being able to serve your customers and keep your data secure.\nNow I'd like to turn to fiscal 27.\nThe governor's recommendation tracking sheets includes funding\nto address also ongoing support and maintenance costs for these same systems.\nIn section 42, line 42.6.5, that recommendation includes $213,815 for drives.\nAnd in section 42, line 42.8.5, $225,128 for ITS.\nAnd these funds are to support the annual three and a half percent support maintenance increase under our vendor contract and ensure continued system stability and security.\nStill within fiscal 27, section 42 line 3400.\nThe recommendation includes $102,546 to address increased postage costs associated with\nthe production and mailing of motor vehicle tags, decals, registration cards, and temporary\noperating permits.\nGCI Georgia Correctional Industries has served as our primary supplier of these materials\nsince 2015.\nEach year they submit documentation requesting adjustments relating to postage and the\nproducer price index.\nFor fiscal year 27 funding reflected in this item addresses postage costs only.\nFunding for a PPI adjustment is not provided.\nThe department would need to address that issue separately\nthrough discussions with GCI.\nThroughout our budget, you'll also see other adjustments\nthat are reflected in the budgets of other state agencies,\nsuch as adjustments to billing for Georgia at work.\nI would really like to highlight and offer my full support\nfor the $2,000 supplement for state employees\nand the enhanced retirement benefit for post-certified law enforcement.\nThese raises provided by the Governor and the General Assembly\nover the last several years have been well received by our employees\nand have been extremely beneficial for retention of our workforce.\nLikewise, the enhanced retirement benefits for our deal, our law enforcement,\nwill be another tool in our toolbox\nas we recruit law enforcement to work in our law enforcement division.\nThat concludes my overview of the governor's recommendations\nfor the Department of Revenue and my final presentation\nas your state revenue commissioner.\nIt's been an honor and a privilege to serve in that capacity.\nAnd I want to say that I appreciate the governor's,\nthe committee's time and consideration on these requests,\nsupport the governor's recommendation,\nand we stand ready to answer any questions.\nThank you Commissioner, we appreciate your expertise,\nyour hard work, and the years you put in,\nand the time that I've worked with you,\nyou've been nothing but I'm not gonna use the pun,\nbut honest and frank with me, thank you sir.\nNo joking, Chairman Burns.\nThank you Mr. Chairman.\nNow Mr. Commissioner, I just want to add my thanks.\nI appreciate you, your service, I appreciate your staff.\nI appreciate the opportunity to work them on the Georgia 250 tag.\nI appreciate Alex and Joe, and their support there.\nSo looking forward to the next chapter of your career,\nbut I certainly appreciate what you did for the park revenue.\nThank you.\nThank you, sir.\nRepresentative Denson, it's your turn.\nThank you, Mr. Chairman.\nThank you Mr. O'Connell and your team, they do a really great job,\nespecially Austin, I call them anytime, so I thank you.\nBut I have helped a few constituents with the unclamed properties.\nMost of them that have had loved ones to pass away,\nand they have to get death certificates and all of those items are sent over.\noftentimes they come back to me because apparently there must be more\ndocumentation is required other than a death certificate when they're applying\nfor benefits on behalf of the family member that's passed away. Does anything\nthat you can tell me that I need to make sure constituents are aware of so as\nthey are working toward this endeavor they will be better prepared.\nYou know, of course it's more difficult if it's somebody else's property that you're\ntrying to claim.\nSome of the cases that have come up to me have been a similar situation and the death certificate\nwould be one of the documents.\nI'm not sure what other documents were requiring.\nI know there was a document when I looked into some things and I'll just tell you what it\nwas it was a funeral bill that we wanted and we told our folks, you know, that's not\nsomething that we need to have to identify the person who should get these benefits or\nthis property. So I'd be happy to work with you and let everybody know exactly what type\nof documentation we require in that instance, you know, because it shouldn't be a mystery\nand I'm sorry that your constituents\nhave had difficulty with that.\nMr. Chairman, Chokus.\nThank you, Mr. Chairman.\nCommissioner, I'm Mike Chokus from America, Georgia,\nand I just want to give a great shout out\nto one of your staff members, Jason Larkins.\nI've called him at all hours of the day\nand his responses have been immediate\nand very, very satisfactory,\nso I just wanted to give him a shout out.\nThank you.\nThank you, sir.\nJason Larkins is, in fact,\nthe most popular person at the department.\nHe listens and he gets things done.\nWe appreciate it.\nReps in Washington.\nThank you.\nMr. Chairman, a commission I wanna join the chorus\nof shout outs to your employees.\nI believe you have Robert Whirl is at home, and he helped us a great day of one of my constituents\nhave a very difficult problem with the truck type, very complex, and I was sent to him\nand he just responded beautifully and I got a wonderful take from my constituent, praising him for what he did.\nSo just wanted to come in on that, and also to thank you, you've always been kind\nand help me any time I've ever asked you, you serve so well and I wish you the best in the future.\nThank you, Commissioner.\nThank you, sir.\nWell, Commissioner, thank you.\nYou've been a statesman.\nYou have been truly just a steady hand and your advice was something we knew we could trust at all times.\nI've enjoyed parsing out with holdings versus any other type of legal matter with you\nand look forward to reading your decisions in the coming years.\nThank you for what you've done for our state.\nThank you for the steady hand that you've been.\nAnd David, no big shoes here, buddy.\nI mean, you just heard every single legislator praise him.\nSo, I mean, we look forward to seeing you\nat the subcommittee hearings a couple of days.\nBut welcome, welcome as well,\nand we know you'll do a great job.\nThank you, Mr. Chairman.\nAnd let me just say 14 years ago,\nsomebody at DOR asked me if I ever wanted to be commissioner,\nOf course, I said no, that job was too big for me,\nbut these have been the three most rewarding years\nof my career.\nSo thank you very much.\nI'm sure.\nThank you.\nThank you.\nThank you.\nThank you.\nThank you.\nNext up is Jim Potman, our retirement man.\nJim thank you for being here looks like it's cleared out pretty well if you'll go ahead\nand get started stay on time thanks for being here this afternoon.\nThank you Mr. Chairman members of the committee I'm Jim Potsland I'm the executive director\nof the Employees Retirement System of Georgia.\nJust to kind of remind everybody of who we are, we're responsible for the administration\nof state retirement plans for state employees, on the largest being, of course, the Employees\nRetirement System itself, a number of other defined benefit plans as well.\nIn total, those defined benefit plans have approximately 120,000 active members, 79,000\nretirees and we're approaching $25 billion in total assets and a statistic that I like\nto share frequently is the economic impact for the state of Georgia which various studies\nthat I've seen have estimated a multiplier of about two to three times the amount that\nwe pay out in benefits which would put the Georgia economic impact in the neighborhood\nof $3 to $4 billion per year so we're very proud of that over 90% of our retirees still\nlive in the state of Georgia. So I said the ERS plan itself makes up the\nmajority of that 58,000 active members which is notable because it's\nup significantly from our low of just over 52,000 just a few years ago. The\nrecruiting retention initiatives that the state has undertaken in the\nintervening years I believe are really bearing some fruit there. About 20\nbillion dollars in total assets and a funded ratio of just under 76% and I'll\nhave a lot more to say about that that figure in a few minutes. We also have\nother responsibilities besides the Define Benefit pension plans including the\nPeach State Reserves 401k and 457 plans. 97,000 total accounts about 44,000\nmembers are G-CEPS members. That's the current tier of the ERS plan. So about\nthree-quarters of our active population are members of G-CEPS and they make up\na very large and growing proportion of the 401K plan at this point. The Georgia\nDefined Contribution Plan is a savings plan for part-time and seasonal\nmembers. Group-term life insurance is actually two plans that were closed in\nIn 2009, it still has a substantial number of members for whom we administer benefits.\nWe also serve as the state's Social Security Administrator.\nCoordinated might be a better word.\nAs far as the governor's budget recommendations for amended 26, that begins on page 192\nof the governor's budget report.\nNo change to our deferred compensation program.\nThat is largely almost entirely paid for by plan fees and forfitted employer contributions.\nThe Georgia Military Pension Fund and Public School Employees Retirement System both\nare seeing decreases in their funding requirements from the previous year to the current year\nin accordance with the plan valuations.\nSo we're bringing that money back to the state.\nand the fourth one is not a change,\nsystem administration itself,\nwe're not asking for any change,\nbut I did want to highlight that in FY 26,\n$36.75 million was appropriated\nan extraordinary basis outside of our actual\nactuarial contribution requirements\nto be paid to our eligible retirees\nin the form of one-time payments,\nand those payments were made this past December.\nmaximum payment was approximately $830.\nFor fiscal year 27, again in deferred compensation program, there's no change to the budget request.\nThe Georgia Military Fund again sees a decrease in its actual evaluation, actual contribution\nrequirements, about $76,000.\nPublic school system sees a decrease of about $5.4 million.\nof that is due to the fact that previous years plan changes for which we had to do temporary\nincreases in the contribution requirements have now been rolled into the overall valuation\nand so we don't need those extra contributions added anymore.\nAnd again, in the system administration area, $26.75 million to be paid to be appropriated\nto be paid in one-time payments to ERS retirees in FY27, this represents $10 million decrease.\nSo we're going back to the base level of 26.75 million, which we've had for several years now in the budget.\nAnd I also want to highlight the governor's recommendation under the G-CEPS tier and the 401K plan for state law enforcement officers,\na budget item of about $5.2 million, which will support an enhanced 401K match.\nYou may recall a few years ago, we created an enhanced match for all state employees,\nincluding law enforcement officers, which resulted in the possibility of an employer\nmatch of up to 9% of pay. This enhanced newly enhanced match for state law enforcement\nofficers alone will improve that enhancement up to 15% of pay. So the remaining population\nwill stay at the level that we established a few years ago.\nBut I thought I would take a moment to kind of look back\nover the past several years, kind of give you\na little bit of the history of the progress\nthat we've made, some of the steps that we've taken\nto get to the point where we are at today.\nThis is a simple graph of our funded ratio\nover the course of the last seven actuarial valuations.\nHonestly, it doesn't look particularly impressive.\nWe've been pretty stable over that seven year period.\nFunded ratio, which is the ratio of actuarial assets\nto actuarial liabilities, is the most common kind\nof simple metric that we use to look\nat the relative funded status of the system.\nBut what I'm here to tell you is that just the Funded\nRatio by itself does not tell you the full story,\nand I'm going to describe to you what is going on\nkind of underneath the hood, so to speak,\nto get us to where we're at today.\nSo, over the course of the last seven years or so, we made a number of changes to the\nactual profile of the system, and these are all very significant changes.\nOur assumed rate of return, that's the assumption of what we're going to receive in investment\nreturn for every year into the future, was reduced from 7.3% to 7.0%.\nwith the idea that we're not, we're trying to become a little bit less dependent on\noutsized investment returns going forward.\nThat also serves to reduce our discount rate, which means the present value of benefits\nis a little bit higher today than it would have been using a higher discount rate.\nThese have the effect of increasing the liabilities of the system.\nOur amortization period for any unfunded liabilities has been reduced from 25 years down to 20 years,\na little bit more aggressive about paying back any unfunded liabilities during a shorter\nperiod of time.\nThe state has made the commitment to increase the required annual contribution in order\nto support that.\nMortality improvements, so every five years we do an experience study where we look at\nthe assumptions we make in the actual process and we evaluate them against what has actually\nhappened over the prior five years and if we seem to be off track in any of those assumptions\nwe make adjustments for the following five years.\nPrevious two experienced studies that I've conducted,\nboth included significant changes to our mortality tables.\nPeople were living longer, we weren't recognizing that\nas quickly as we needed to be, so we had to improve,\nbasically extend the lifespan assumptions\nin the actual evaluations, again,\nwe're adding expense to the system.\nThe police report that the 2025 one,\nwhich we just completed,\nhas virtually no change in the reliability overall.\nSo we are doing a much better job\nof anticipating what those liabilities\nare going to be going forward.\nAnd finally, and perhaps most significantly,\nwe began pre-funding a COLA for the first time\nin our history back in 2022.\nSo far, we're able to support an average COLA 1.05% going\nforward.\nThat's the amount of funding that we are receiving.\nThat's a number that we do expect to change over time.\nAnd I'll talk about coal as a little bit in a second.\nSo that's on the actuarial side.\nAdded a bunch of expense, stated Georgia, then went ahead,\nand continued its record of meeting its actuarial\nfunding obligations when expenses arise.\nSo what did we do?\nWell, perhaps it goes without saying,\nbut I'd never take it for granted.\nWe received 100% of our actuarial contribution\nrequirements every single year.\nA lot of states can't say that.\nSo thank you for that and for your commitment to meeting\nobligation to our pensioners and our retirees.\nIn addition, the pre-funding of ACOLA\nrequired a substantial increase in the funding requirements.\nIt was almost 5% of pay, about $150 million per year,\nindefinitely into the future.\nThat was met.\nWe received, and once again, thank you\nfor this $200, $500 million cash infusions\nin the last two years,\nthat billion dollars was put into the system\nin order to improve the funded ratio of the system\nand get us on a path to back to that 100% funded ratio\nthat we've been looking forward to.\nAnd finally, as I've mentioned,\nwe've received now four, if I can count FY27,\nwe could receive four separate appropriations annually\nfor contributions totaling $117 million\nto be passed through to our retirees\nin the form of one-time checks.\nSo this will be the fourth year in a row\nthat we are able to provide those.\nAnd we've also had, so to speak,\nthe wind in our backs a little bit.\nThe investment environment over the course\nof the seven-year period has generally been quite good.\nThe numbers here mask some volatility.\nObviously there's the one outlier FY22.\nBut other than that, even within the years\nsome volatility there that doesn't really show up in these numbers. But what we're booking\nin terms of final results for each year has been very strong, particularly in four out\nof the last five years. A seven-year average of 9.6 percent suggests that our assumption\nof 7.0 percent is well within reason. This is where I make my obligatory caution statement\nwhere I say, look, it's great that we have these. I'd much rather book them and be prepared\nfor possible regression or downturn than the other way around where we've already had\nthe downturn and we're kind of hoping for a turnaround. So I'm happy with where we are.\nI don't assume that we're going to continue to get 9.6% per year going forward, but it\nis something that does help us when we are trying to make decisions and meet our obligations.\nSo far in FY26, when I created this slide a couple days ago, 10% was the number today.\nIt's 8.5, so a little bit of that volatility that I was talking about, but still a strong\nstart to fiscal year 26.\nOkay, so back to the last seven years which I already showed you.\nThis is what the next five years looks like projected when I add it to those last seven\nyears.\nThe circle, the spot is where we are today.\nI guess I should caution this is not a prediction\nof what's going to happen.\nIt is a projection based on our current set\nof actuarial assumptions and assuming that we hit them\nright on every year.\nThose projections will change each year,\nbut I will say this is the strongest set of projections\nthat I've ever seen in my time here.\nSo all of the stuff that we have done up to this point,\nall those changes to the actuarial assumptions,\nto the funding and all of that,\nhas put us on what I would suggest to you is a very,\nvery positive trajectory,\nwhich could have us meeting our 100% ultimate funding goal\nmuch earlier than I thought, even four or five years ago.\nDirector Pum, what point during the year\ndo you compare that ratio?\nWhat day do you use?\nThese are the June 30.\nThese are the actual evaluation numbers.\nSo do you have the number for June 30th of 25?\nI do not.\nThat will be our next valuation, which will be a-\nHow long does it take?\nTo get it?\nIt will be in April.\nHowever, you've shared a number with us.\nAre you going to share that number with the rest of the committee?\nHi, I'm going to share that number.\nThank you.\nI do have some projections from the actuaries on this.\nAnd that number is actually hidden in this chart here.\nWe're going to continue to see.\nSo we saw between FY23 and 24 an increase of about 3.9%.\nThat by itself was the single largest increase that we had\nseen in at least 25 years.\nNext year, we are projecting that we're\ngoing to go from 76% to approximately 82% to 83%.\nThis is a significant milestone because a few years ago,\nChairman will recall that I had a conversation with him\nwhere we wondered how long it would take us to get to 80%\nsort of an intermediate goal.\nAnd I at that time told him it would take approximately\nthree years.\nand that was with the two, $500 million infusions.\nAnd it turns out, it took him taking advantage\nof the positive investment environment\nand the money that we have received from you,\nand we're gonna get there a year earlier than I thought.\nSo this is good news, just from this general standpoint\nof being in a better funded position,\nbut it also helps us with the COLA formula.\nThe COLA formula depends in part on where we are\nfrom a funding perspective.\nWe look at recent investment results,\nWe look at the funded status of the system as it crosses 70%, 80%, 90%, the COLA formula\ngets more generous.\nSo hitting 80% this year will help us provide a little bit more substantial COLA this coming\nyear.\nI don't have a final number on that, but we're looking at something, if it stays just between\nus, something close to 2%.\nis much more substantial than we've done up to this point. And just on the outlier years\nhere, we're looking at 100 percent potentially as early as 2030, if all goes according\nto the projections. So back to Cole, it's just for a second. I've mentioned it several\ntimes already. I just wanted to kind of consolidate everything that we've done into a single slide\njust to give you an idea of the focus\nthat's been put onto this very, very important issues\nfor our retirees.\nFirst of all, the formula that we used today\nwas established in 2022 in conjunction\nwith the $150 million per year commitment from the state.\nBasically, they said here we have $150 million available.\nWhat can you do with it?\nWe created the variable funding policy,\nthe variable funding formula.\nI think it's important that we keep it\nas a variable formula.\nI think it's important that the system be able to react to events if funded goes up.\nIt should be more generous if funding goes down.\nWe should have a way to tap the brakes and kind of help the system recover.\nIf investments are good in recent years, we have the ability to do better.\nInvestments are poor.\nYou want to, again, tap the brakes.\nSo those kinds of things are important.\nThat's why it's a variable formula rather than a flat one.\n$50 million funded and average, 1.05% COLA for indefinitely.\nI will say that experience study that we just completed,\nbecause our funded position today is better than it was in 2022.\nThe same formula actually can now be expected to produce\na 1.15% annual COLA incremental step without a doubt.\nBut at least it's a step in the right direction\nand it positions us to take further steps, hopefully,\nsooner or rather than later.\nAgain, the four annual contributions to fund one-time payments to coeligible retirees,\nthat's sort of the second leg of this process, and the third leg, again, is the $200 million\ncontributions to increase the fund address show, which hopefully would lead to sustained\nlevel of higher coel payments.\nNow, it's all on the defined benefit side.\nAs I said, we're currently, ERS currently is in tier 3 of its existence, what we call\nthe G-CEPS tier.\nIt was established in 1-1-2009 as a so-called hybrid plan, it's really just two plans, smaller\npension benefit than it used to be, and this 401k with a match.\nThe match, when implemented, provided a maximum match of 3% of pay.\nWe increased the default employee contribution rate, which was 1% at inception.\nIn 2014, we made it 5%, which led to significant improvement in savings rates.\nFolks tend to stay where the defaults are, so we wanted to put them in a position where,\nat least to start with, they were going to be able to receive the maximum match available\nto them under the plan.\nWhat they do from there was up to them.\nFortunately, many of them decided to stay at the level that we defaulted them in.\nAnd then, as I said before, effective in July of 2022,\nthe 401K match was significantly enhanced\nto be dependent not just on the amount of savings\nthat the person has, whether they save 1%, 5%, 10% of pay,\nbut also their service.\nSo anybody who has more than five years of service\ncan be eligible for an enhancement\nto their 401K match as long as they continue\nto save the 5% and that enhanced match\ncould be up to 9% of the pay.\nAnd again, this structure is the model for the law enforcement 401K improvements in the\ngovernor's budget recommendation, but in that case, it's a maximum match of 15%.\nJust a few charts to sort of close this out and give you an idea of how we've been doing\nwhat our experience has been.\nParticipation is just how many people are saving more than 0% right?\nSo in 2018, we're at about 88 and a half percent today and for the last really four years\nso we've been hovering right around 95% very proud of that number that's\nconsidered in the industry a good number. I do not take for granted the fact\nthat that means that 5% of our population is not saving. I'm not getting the\nbenefit of this match on any level to never mind the enhancement. So we do reach\nout to them we do have annual kind of campaigns to try to get some of them to\nsave but there will always be a certain number of them that just for whatever\nof a reason don't feel the need to do it.\nAverage contribution rate.\nAgain, this started climbing in 2014\nwhen we changed the default rate.\nBy 2018, we were around 4.4% average member contribution\nrate today.\nIt's more like 5.8%.\nAnd it's still ticking upward.\nWe've probably hit a plateau, but it is still ticking upward\nevery year due to our education initiatives.\nAnd then here's what happens when we enhanced the match in 2012-22.\nWhen the maximum match was 3%, the average could not be more than 3%.\nSo you can see we were in the low to mid-2s in the years leading up to 2022.\nOnce we added it, the enhancement, it became a dollar for dollar up to 5%, and then the\nenhancement above that.\nSo our average employer contribution to the 401k plan went from 2.3% to about 5.1%.\nThe average account balance, I don't have that table here, but the average account balance\nincreased from $8,500 to $30,300 just in that seven-year period.\nSo we're getting roughly 20% per year increases on average in our account balances.\nSo the total that is going into the accounts every year, whether it be employee contributions\nor employer contributions, has increased from 6.7% to 10.9% during this period.\nSo 4% more per year with compounding, that's going to make a real difference in the outcomes\nfor many, many of our retirees.\nSo we're very proud of this.\nIncidentally, I did pull some numbers at the last minute on the folks who are eligible\nfor the enhancement above 5%.\nSo it turns out that 37% of our GCEF's population is eligible for something higher than a 5%\nsomewhere between 6 and 9%.\nTheir average employee contribution is 6.5%.\nSo it's higher than the 5.8% population as a whole.\nTheir average employer contribution is just about 6% exactly.\nSo their total going into the plan is actually 12.5%.\nSo in the early years, it's already evident that that enhancement is beginning to work\nas if we designed it and we should have longer term positive outcomes for that population.\nAnd by the way, their average account balance is almost $60,000.\nPart of that's due to the fact they've got longer service, but part of it is also due\nto the early stages of the enhancement.\nSo I will stop there and I'll be happy to take any questions.\nhave one. Go ahead, Chairman. Director Jim great to have you here and enjoyed\nworking with you over the years. I particularly enjoyed working with you on that 9%\nthat we did years back and glad to see that it's actually working. I hate that\nthe governor is going to want up my bill by going to a higher percent but at least\nhe said he's using the same structure. He plays in the trail. This is I guess\nquestion back on the the previous plan. I didn't see any chart this a little bit\nmorbid but eventually that plan is going to go to zero. The new plan? The old\nplan. Yes that's correct. So it's going to trail off because everybody's the new\nvoyage on the plan and other people. Is there any you have any kind of a chart\nthat would show how that fun may eventually should keep dropping I guess\nI don't have a lot on that specifically, and the reason is, that's a long way to be perfectly\nhonest. The number of retirees that are coming out of the new and old plan out of the total\npopulation is still like 98, 99 percent. We have very few G-cept retirees yet, and so\nabout the tail on this. Well, let me put it to you this way. Remember the first tier,\nthe old plan, right? We closed that tier in 1982. There are still still seven state employees\nwho are old plan numbers. Okay. We'll be a while before we lose all of our new plan folks\nas well. All right. Well, again, thanks for your work. And as we said before, if everyone\nwill do the 9% max that we're tires and big and airs, I hope they do that. That's right.\nJust had a thought the other day when we were listening to GDOT talk about the private\npublic partnerships on peach pass lanes has, has there ever been any thought about doing\nsome of that type stuff with the state so we would actually be paying the return to\nmyself if that makes sense. I do understand. Honestly, our asset allocation for our systems\nis very, I don't want to call it vanilla, but it's very, very simple compared to a lot\nof other states. We're pretty much a stocks and bonds shop. About 60%, 65% in stocks\ndepending on in public equities, I should say, maybe 30%, maybe a little bit less in bonds.\nWe do have a small allocation to what we call alternative investments, but that's a\npretty limited in scope. We do private equity and not much else. So whether there's been\nany serious thought, I can't say, but I don't think that there are any plans in the current\nyear to do anything quite like that.\nThat's all the questions. Thank you, sir.\nThank you, Mr. Chairman.\nThank you, members.\nNext up is Director Branch with the Teachers Retirement System.\nThank you for being here today and for sure.\nThank you very much.\nGood afternoon, Chairman Hatchett, Chairman Tillery members of the House and Senate\nappropriations.\nIt's my pleasure to be with you this afternoon and take the opportunity to talk a little\nbit about TRS as well as share our budget requests. To give a little background on TRS and\nteacher retirement system we are governed by a 10 member board of trustees. Currently\nwe have nine trustees. Mr. Tom Norwood stepped away in December after 18 years of service\nand we want to thank Mr. Norwood for his outstanding service to the state of Georgia and teacher\nretirement system. There is a process currently underway by our Board of Trustees to fill that vacancy\nand we feel like that's going well at this time. Currently we do have six educators on our Board of\nTrustees, two active superintendents, two active teachers, a retired teacher and a retired principal,\nalong with, of course, several other outstanding leaders. I am coming on new as the executive\ndirector after serving on the board for approximately eight years filling the big\nshoes of Dr. Buster Evans who served the teacher retirement system for nearly a\ndecade and served on the board as well and so while I may be new in the\nleadership position our team that you see here has over a hundred years of\nexperience with teacher's retirement system of Georgia so we're in very good\nhands. A little overview of our system founded in 1943, operational since 1945, paying out\nour first payment in March 7, 1945, $41.69. So benefits have come a long way over the\nyears, celebrating 80 years of service to our over 500,000 members. Currently we have\nof about 155,000 retirees and over 242,000 active members.\nOur plan design currently calls for years of credible service multiplied by 2% for each\nyear and then looks at the high average two years for the maximum benefit.\nIt takes 10 years to best in our system and retirement eligibility happens after 30 years\nof service at any age and 10 years of service at the age of 60 you can retire with 25 years\nof service with a penalty.\nWe do pre-fund cola through employee contributions that is paid out at 1.5% each year in January\nin July, and as we are in IRS 401A administer plan, we do follow IRS guidelines as well\nas state law that currently has an anti-spiking provision, wouldn't relate to salaries.\nCurrently, we are the 18th largest pension system in the nation, assets of the fiscal\nyear, 116.8 billion, 6.5 billion paid out in payroll around our state and country and\nthen an economic impact in our state of $9.3 billion.\nWe did send an email to all of our House and Senate members as well as give a hard copy\nof our economic impact.\nHopefully you've received that if not it should be coming to you soon that reflects not\nonly the state economic impact but the economic impact in your particular area as well.\nYou see here some payroll information.\nWe do help for six various retirement options to our members.\nThe max plan continues to be the most popular option with about 60% of our individuals\nchoosing that but we do have several options and those are chosen at the individual level.\nStats as of July 2025, roughly 140,000 service\nmembers, or service retirees rather,\nreceiving around $3,700 per month,\nan average year of 25.5 years of service\nat retirement, an average age of 60 at retirement,\nand our retirees average around 72 years old\nthat are currently receiving benefits.\nboth of those numbers up slightly about two years ago.\nIt was at 59 for retirement.\nAnd as you can see, we were 71 last year\nin the fiscal year for our average payment.\nWe are pleased to see that over 99% of our retirees\nare receiving electronic payment, which we believe\naids in helping us not have as much fraud\nand keep their money safe.\nWe want to get that to 100% and we are continuing to work in that direction.\nYou see here now retirement trends over the last 20 years or so.\nWe average around 6,000 retirees per year, that's roughly 3% of our active members.\nYou can see that as of the close of 2025 calendar year, we had about 2200 retirees this year\nso far.\non pace for us to continue to have around 6,000 retirees.\nOf course, several of our retirees are interested\nafter a while, returning to work.\nAnd so we have some return to work stats here for you.\nLast year, we saw over 15,000 return to work\nin a part-time capacity primarily.\nThus far this year, we've seen around 13,000.\nWe're pleased that we work with our employers,\nand we can auto-approved those at a rate of over 80%\nin under about 10 minutes,\nmaking that good for our retirees returning to work\nand also our employers that they're assisting.\nOf course, since July 1st, 2022, House Bill 385\nhas allowed some of our retirees to return to work full time\nand high needs areas to assist in our educational settings.\nAnd you can see here that we've had roughly around 1700\nand 50 or 60, so do that since July 1st, 2022.\nThis year we've had around 430.\nInterestingly, House Bill 385 was recently audited.\nAnd the numbers came back that our retirees that\nare returning work on average have been retired\nfor and a half years when they do choose\nto return back to work.\nSee here, our current contribution rates employee is at 6%\nemployers at 21.9%.\nOf course, those funds then go into our investment pool\nwhich helps pay for this lifelong benefit.\nYou see the asset allocations for our current investments,\nequities at 74% fixed at 25% and alternatives at 1%.\nYou see the return on investment out\nto the side positive equity market of 14.4% that really helped us with the 12.2% return\nthat you see there. Historically, over the last 50 years, we've had a annualized return\non our investment of over 9% and 14 out of the last 15 years positive investment returns.\nmarket trends over the last three years we've had a combined 38.6 return on our\ninvestment you see here that in FY 2024 14.5% that led the nation and once\nagain at 12.2% while we don't have the particular stats in front of us at\nthis time we are seeing that those are also going to be in the tops in the\nnation as well. 80% of our assets are managed in-house at one of the lowest cost comparable\nto plans nationally. You see next are funding ratio and employer contributions. Our employer\nrate has remained stable over the last several years and we predict it to decline over the\nnext five as well as our funding ratio to increase over the next five years. You see,\nwe're currently at 77.9% headed to 79.7% and then as you can tell we're headed to close\nto 90% as we reach 23. A few sustainability changes that our board has taken over the\nlast decade here designed to conservatively manage our fund adopted a 30-year emissation\nschedule in 2014 looked at that again at 23 years and 2022 has been discussed\nearlier by our counterparts in the ERS. We have also reduced the assume rate of\nreturn from 7.5% to 7.25% in 2019 and then again to 6.9% in 2022. Recently\nconducted an experience study to look at our retirees, their trends, the\nsalaries to make sure that we are making the proper assumptions and have had\ngood feedback on that as well. To get to the meat of while we're here today, our\nbudget requests are currently for $26,000. This is a $36,000 reduction from our\nrecent requests that is due to declining the numbers of teachers who qualify for this particular\nbenefit that's funded. This benefit is designed to provide retirees from local retirement systems,\na minimum allowance upon retirement. We currently have two individuals who remain under this plan,\nboth of those individuals are over the age of 90 and so we do respectfully request $26,000\nin both the amended and the FY26.\nFinally, giving you a lot of stats as it relates to TRS,\nthought I'd give you a fun and encouraging one.\nOver 11,000 of our retirees are over the age of 85.\nThat's roughly 7% of our retired members.\nTake it one step further.\nIn fact, we have 89 of our beneficiaries\nthat are over the age of 100.\nSo I'd like to say that retired educators are not only the happiest people I know,\nbut perhaps the healthiest as well. So with that, I'd be happy to answer any questions that\nindividuals may have. Thank you, Commissioner. Representative Franklin.\nHow are you doing, sir?\nI want to welcome you to your new position.\nI know you do a great job, and I look forward to working with you.\nThank you.\nThe question I got.\nDid you say there was a 1% invested in alternative investments?\nIs that correct?\nYes, sir.\nDo you see any appetite to increase that at all, or do you predict that's going to stay\nat that level?\nWe have taken some measured steps into that since we've been allocated an opportunity to\ndo so.\nI think we're capped at 5%.\nso we're taking marginal steps within that,\nbut it has grown every year with the opportunity.\nOkay, I think we increased it a little bit more\nthan that, but I was just curious to see if you're old.\nYes, sir.\nThank you, sir.\nChairman Hips, Senator.\nYeah, I think it's 10% on the ERS and 5% still on the teachers.\nYes, sir.\nSo the ASS grew from 166 to 160 thing big, and I noticed\nyou had buster sitting back here.\nYou got a final friend available just in case.\nAnd you had, I think it said 77.9% funded.\nI know in the book, I thought I saw 85%.\nSo was the difference in that, the five years,\nI guess you call it smoothing or wherever you don't show it all,\nyou kind of spread it out over five years.\nWe do smooth out our returns over a five-year period\nto keep the volatility down.\nSo does the book have the non-smoothing\nand this is the smoothing number?\nLet me check on that for you and get back to you on that.\nI don't have the book in front of me at this time, so I apologize.\nThanks.\nWe're from a commission with us.\nThat's it. All the questions, thank you.\nThank you.\nNext up is I can't read it directly or I'll leave no\nCommissioner Angelique McClendon, Director of Driver Service. How are you today?\nI am wonderful. Welcome. I have Bob Griffin is here. He's our Deputy\nCommissioner and he's a former CFO. All right. So we'll get started but first\ngood afternoon. I know we're late in the day but I do want to thank you for your\nprevious considerations over the past years but what we've done so far we've\nimproved retention you'll see that we've been able to serve customers at the\nsame level I would argue better over the past year at least we've expanded\nservices without expanding staff by doing things like adding a self-serve\nkiosk things like that but overall volumes higher but wait times are\nshorter processes are more efficient, technology is better and we're heading into our second\ndecade as DDS so I don't know, I mean if you might remember but House Bill 501 was passed\nin 2005 and so it makes 20 years as the Department of Driver Services so at that point DNBS\nwas broken up to create the Department of Driver Services and as you know as you've heard\ntoday motor vehicles is with revenue and so we have a new commissioner but the\nsame mission same core values. Short update on what we're doing again it's\n20th year so the 20th year supposed to be your platinum year if you are\nmarried that is your platinum year just don't forget that and some of you might\nhave passed that platinum year so you're supposed to get platinum on that\non the 20th year, so this year's our platinum service year.\nSo we believe we have delivered that platinum service\nand we will continue to deliver that service.\nBut in 2025, our average wait time was six minutes\nand 10 seconds.\nAnd that was one minute and 16 seconds shorter\nthan the previous year.\nAnd the average longest wait time was 15 minutes\nand 35 seconds.\nAnd that was three minutes shorter than the previous year.\nNow, the previous commission of spend some more was awesome,\nbut these numbers are better, I would argue.\nAnd we keep our focus on wait times,\nbut we will also want to focus on the quality\nof the service as well.\nAnd just add a glance, there are 9.1 million ballot drivers\nin the state of Georgia, over 400,000 of those drivers\nare commercial drivers.\nAnd at the end of 2025, there were almost 600,000 digital\nlicensed users.\nAnd how many people have, how many of you\nhave your digital license on your phone?\nI see a smile.\nThat's not it, that's not it, that's not it.\nIt won't work.\nWell, we'll get you squared away after this.\nWe'll get you squared away.\nBut we have surpassed, but now that was at the end of 2025,\nthat we have since surpassed 600,000 digital licensed youths.\nSo if you are a person who uses your phone to pay for things,\nthat's how you add that credential to your wallet.\nAnd the same way you go to your sent your wallet\nor your Samsung or your Google or your Apple,\nwhatever your platform is.\nAnd you find a state because we're one,\nwe were one of the first, but we're one of many now.\nYou find your state, which is Georgia,\nand you add that, and it will walk you through those steps.\nAnd so we've made a lot of strides in that area as well.\nAnd of course, we have 68 locations.\nWe have a new one that we, since we last were here,\nwe have Hazelhurst in South Georgia.\nSo we cut the ribbon and Hazelhurst not too long ago.\nBut that site, we've conducted many CDL tests,\ncommercial testing.\nWe've served about 2,300, a little over 2,300 customers since the end of September.\nThat's when we opened and our average wait time was in line with our standard wait time.\nIt was less than 30 minutes.\nIt was around six minutes.\nIn the site employees ate people down there in Hazelhurst, Georgia.\nSo that was a great addition.\nAnd again, last year we had 11 commercial testing sites.\nThis year we have 12.\nAnd so last year we served over 4 million customers,\n4.1 total customers served.\nAnd so that's great, that is a huge increase,\nthat's a 6% increase from the previous year,\nbut that more customers means more calls,\nmore mail, more transactions, more face-to-face interaction,\nmore remote transactions, more need for cybersecurity.\nSo the increase volume matters a whole lot\nwhen it comes to our business.\nAnd then 158,000 of those customers that were totally served,\nwere served on kiosk, the self-serve kiosk.\nYou have many of those throughout the state.\nIn grocery stores, those yellow machines,\nwe have our services in those machines.\nAnd then we have self-serve kiosks in the locations\nwhen you come in where you can,\nmany people like it because you can take your own picture\nand you can do retakes if you like,\nif you don't like those pictures.\nSo I've seen a lot of people who actually have the patients to do it.\nI mean, you think some people come in and they might want to see a person, right?\nBut a lot of them love going to the kiosk, 158,000 of them have done that.\nSo that's great.\nSo as I travel around the state and go to each locations, I'm getting around to it.\nI mean, 68, I haven't made all 68 quite yet.\nI think I counted 28 so far since May since I've become commissioner.\nSo I've been counting since I've become commissioner.\nI've been at DDS 10 years as General Counsel,\nso I'm not counting though that time,\nbut since I've been commissioner,\ntraveled a lot throughout the state.\nWe have, again, 81 kiosks.\nOur services are in 81 ITI, those yellow kiosks\nin the grocery stores.\nWe have a total of 23 at locations.\nAnd so we're in the process of adding some more\nself-surf kiosks inside our locations.\nAnd speaking of those types of services,\nremote services, non-people-facing services,\nwe serve 1.1 million customers\nthat were served online and through the app as well.\nBut again, that leaves 2.9 million\nthat were served face to face.\nAnd on peak days, which are Thursdays and Tuesdays,\nwe can see upwards of 16,000 or more customers.\nSo again, about 30% of our customers\nto serve remotely and 70% are still served face-to-face.\nSo.\nCommissioner, do you have any idea the number\nof first-time license?\nYou know, I don't.\nI don't know the number of first-time licensees.\nI mean, that's an interesting number.\nYeah, that would be good.\nThose are actually what we'll talk about throughout this\npresentation are the predictables, right?\nSo we know who needs to renew.\nWe can kind of predict replacements maybe based on previous years, but we have been thinking\nabout other ways we can try to estimate things like who, how many people would be new drivers\nand we would have to work with populations statistics to figure that out, but I do think\nthat's a great question.\nOur budget is in three categories, Administration, License, Issue, and some regulatory compliance\nSo we'll start with the administration program.\nWe are very appreciative of the Governor\nKemp's salary supplement additions.\nThis will prove very, very helpful for retention and morale.\nBut we're requesting $114,109 to accommodate\nthe one-time salary supplements for employees\nin this administration program.\nAnd you see on the slide CDL Federal Mandate Notifications\nFrom time to time, we have federal mandates that come\nto our state that are related to commercial drivers.\nAnd so to implement those, we have to have system changes.\nWe have to notify these drivers of those changes.\nAnd we have listed on the slide three\nthat we had to implement within the past year.\nAnd those involve multiple notices to drivers.\nThe coming changes sometimes, unfortunately, of revocations.\nSo that's unfortunate, but we do have to notify the drivers\nthat we're requesting $150,000 to accommodate\nthose implementations.\nTo continue with the license issuance program,\nwe're requesting over 1.7 million to accommodate\nthe one-time salary supplements\nfor the license issuance program.\nThis is our largest group.\nSo this is over 800 employees.\nWe're requesting this amount, the 101.3 million\nfor increased cart production.\nThat's that increased volume that we talked about.\nAs I mentioned earlier,\nat least more transactions and more work overall.\nYou have more cars, more mail, more calls,\nmore interaction, more system changes\nand things like that that are needing\nwhen you have that extra volume.\nAnd so we had to issue about 250,000 extra cards.\nIf you do the math from year to year,\nour increase from the previous year,\nthat's around 250,000 as well.\nAnd this is the prediction that's based\non expiration dates and actual cards that were issued.\nAnd again, these are the predictables.\nBut as we just talked about, there are some other variables\nthat are unpredictable.\nWe talked about new drivers.\nThere's also new to Georgia, that's hard to predict,\nand we've seen that increase.\nThere's also mail costs that we don't control,\nnecessarily, that are part of the variables\nthat impact our car production costs.\nIn the third bullet you see there is for armed guard services.\nSo our locations, again, we mentioned 68 different locations\nthat we have throughout the state.\nThey do not all have security or armed security.\nWe would love it if they did, but they don't.\nWe have the 12 post certified law enforcement on staff.\nCourse 12 is not enough to cover 68 locations,\nbut eight of them are assigned to locations.\nThey are primarily fraud investigations,\nbut they are post certified and state certified law enforcement.\nBut we do have armed guard services at five locations currently.\nare requesting $150,000 to cover the cost for the armguard services.\nAnd just to mention, when we just talked about physical security with armguard services,\nanother thing we're doing that has not required additional resources is that we're using one\nof those post certified law enforcement officers on staff who has three decades of law enforcement\nexperience to do security assessments.\nSo he's traveling to each location, he's making security assessments and creating reports\nso we can figure out what we can do to ensure the safety of our customers and our team members\nwithout coming back here necessarily for certain requests.\nBut some requests we do make are based on the research that we've done from no security\nassessments and we'll see that a little bit later in the presentation.\nSo continuing with the license issuance program, leases have increased.\nSo several locations, and nine to be exact, the lease amount has increased.\nSo we're requesting $139,000 to accommodate for those increases, for the leasing of those\nfacilities throughout the state.\nAnd there are different parts of the state.\nWe are requesting $185,000 to continue compliance with GTA Security and infrastructure and that's\njust penetration testing and compliance testing for our back end system.\nSo we want to concentrate on cybersecurity as well as physical security.\nAnd then there's drives, cloud, migration, support, $428,000.\nWe are requesting for that and that is to support the drive system which we have a joint\nproject with, of course, as you can recall with Department of Revenue, but this is for\nDDS system maintenance and mandatory upgrades that might come out of legislative changes.\nContinuing with the license issuance program, we are requesting $2.4 million to support personal\nservices for decreased turnover. So our turnover has greatly increased and that's great.\nWe need retention, we need to retain team members\nfor their knowledge, their service,\nand that's really how we can keep that good customer service\nby people who are knowledgeable and are at that top level.\nBut to retain them costs, they receive promotions,\nthey receive standard increases\nbecause they have been there for a certain time.\nAnd so we're asking for $2.4 million to cover\nthe cost of decrease turnover.\nIn our smallest program is regulatory compliance and we are asking for $27,000 to accommodate the\none-time $2,000 salary supplement for the employees and the team members in our regulatory\ncompliance program.\nSo we'll move on to our bond request.\nOur bond request consists of funds for support of facilities and upgrades for the facilities,\nsecurity safety and the next-gen project. So we need to replace time clocks and\nticketing equipment. That's one point. That's one million dollars. We are\nrequesting for that equipment. We are also requesting one million dollars for\nfacility safety and heartening initiatives. So that's the part of those\nsecurity assessments that we've been doing where we found that certain\nmaterials are resistant to weapons and that they are helpful to secure the\ncounters and the other building material where our team members are during\nwork hours and then the CSE counter replacements we're replacing 430,000\ndollars to replace older, worn, counter materials. And some of these counters\nare over 20 years old. And for our FY27, a lot of these are the state required requests,\nbut then you also see in these requests you'll see the CDL Federal Mandate notifications\nof course, this is year after year that we have the commercial driver federal mandates\nthat we have to comply with, and again, part of that compliance is to make system changes\nand notify those customers of those changes.\nThe license issuance program for FY27, we have the same statewide requirements, the same\nstate requirements that are in this request, but then we also have some requested services\nand for armguard services, lease increases as well and then the GTA security services and\ninfrastructure or in this budget request as well.\nAnd also for the license issuance program, the personal services we just discussed due\nto decrease turnover, obviously we are requesting $2.3 million for personal services due to\ndecreased turnover and also we have received funds for SAVE that is the non-citizen verification\nsystem that we've been using in utilizing since around 2010.\nSo there are funds that are typically associated with SAVE and so from time to time there\nmight be some I guess federal wavers of those fees but then also at any point in time\nthose costs can be put back onto the agency and they also can increase as well.\nSo we are requesting the funds to make sure that we can maintain our personal services\nand be able to utilize safe if we have to pay again for using safe.\nThe amended FY26 regulatory compliance program, statewide required additions, which these\nare, the REC comp program requests are adjusted to reflect the benefit rates.\nSo these are benefit rates that we, this slide reflects that.\nDo you have any questions other than the wonderful ones you've already asked?\nCommissioner McLean, when did you become Commissioner?\nMay 1st.\nI was wondering when you started out how everything had improved and I was like, look, Commissioner\nSpencer Moore is not going to be happy.\nOh, yes.\nI thought he did a pretty good job, but he took it even better.\nHe did an awesome job.\nHe did an awesome job and I calculated that's about May is about 70% of last year.\nSo I'll take credit for 70% of all of them.\nYou know he was from my hometown so we had a connection but welcome you did great things\nare going look like the progress is continuing.\nWhat is your turnover right now do you know?\nThe turnover rate out the 38%, 34% we'll go with 34%.\nI hope it gets better and continues to get better.\nYeah, it is a must have been a lot worse.\nIf people are happy, so one of the reasons I try\nto visit so many locations is to kind of\nto see how people are doing and to see what their needs are\nas they are facing the public every day.\nSo we can think we know what those are,\nbut it's good to hear it from them themselves\nand actually observe what's going on, right?\nSo I can observe that maybe this location needs\nanother kiosk, you know, instead of waiting on the team to have the nerve to say that, right,\nbecause they have to get it all the way up to headquarters here in Congress. So I rather go to\nthem and see how things are going and I feel like people in general are happy with what they do\nand they take pride in what they do. I can tell that really from how they interact with the\ngeneral public that they really take pride in what they do. Yeah, because I don't have many\nbusinesses that could run with a 34% turnover rate. So I hope it's I hope it\ncontinues to improve. Right. Chairman Carver. I couldn't let this go away unless\nMiss Leslie stands up because she puts up with me all the time. I bother that\npoor lady. I must be the only person in the world that has license issues. Thank\nyou so much for all your help. And if you haven't used a kiosk I swear you're\nThey're in and out in like 30 seconds, so it's a great addition.\nGreat addition.\nRight.\nAnd our team members, and I will say that, is a testament to the front line team members\nbecause they really had to buy into it and to be able to send the customers to the\nkiosk.\nAnd so it works just like self-check out.\nSo if you have something simple, go to the kiosk.\nIf you want to take five pictures of yourself, go to the kiosk because we're not going to\ntake five pictures of you at the counter.\nAnd it takes six for me.\nI think he probably broke the machine.\nSenator Sims.\nThank you, Mr. Chairman.\nI just want to compliment the driver services\nin America's Georgia.\nI don't live there, but I didn't have my license.\nI didn't have my tag on my car.\nI was just, I was really going to jail, OK?\nNo, no.\nBut when I went in, I said nothing about being a legislator\nand they were awesome.\nI love it.\nAnd I told them afterwards that I appreciated the help\nthat they provided me and how the customer service\nwas just great.\nAnd I just want to give a shout out to those young folks\nand that were working well in America's Georgia.\nAnd it's part of my district.\nNo, thank you.\nI love that.\nAnd I would encourage you if you are visiting.\nNow if it's an emergency, Ms. Leslie is wonderful, right?\nBut I would encourage you to do just that, to go in,\ndon't identify yourself as someone important\nbecause they should be treating everyone\nwith the same level of customer service.\nAnd that's really how we find out how the customer service\nis if you're not famous to them.\nAnd so I would encourage people to do that.\nAgain, unless it's an emergency.\nRight.\nAre you sure, Commissioner, you don't have pictures of these troubled lawmakers on the walls\nup there and say, if they come in, we're going to check through it.\nWell, I wrote America's down, so I might be taking the trip to America's, we'll see.\nI'll report back.\nSo, Commissioner, I have the same thing.\nWe had, as you know, we have foster children, and what, one turn 16, we got as drivers license.\nAnd that lady yelled at me to get off my cell phone just like I was any regular old person\nin that building.\nWhat's her name when you give her a raise?\nShe made sure that I knew that if I wanted to use the cell phone, I needed to leave.\nBut I say that and also say they were incredibly, incredibly competent, fair, they treated everyone\nreally the same.\nGreat.\nBut yes, ma'am, I know not to use my cell phone in your buildings anymore.\nNow where was that?\nSeriously, she did the right thing.\nShe did that.\nThat's my name.\nBut it was great.\nThank you.\nIt was not invited we don't have they did not have\nA low is currently not a location in Videa you what there always could be but there is currently not one\nThere's one reveal. There's one in Reesville and how far far do you have to go 30 miles 30 miles?\nLegislators understand that I mean 30 miles\nThey were incredibly confident and they truly they made that little 16 year old guy feel extremely awesome\nI think it did a good job.\nThank you for that.\nThank you.\nBy the way.\nThank you, Commissioner.\nThank you.\nNothing wrong with having a little laugh.\nI'll return.\nNext up is director Ali with the Georgia Public Defenders\nCouncil.\nYou\nYou\nAll right, welcome, Director Ali. Thank you. And the floor is yours. That is a tough\nact to follow. I came in and I heard everyone laughing. I hope you're going to be laughing\nabout the public defenders, too.\nGood afternoon or good evening.\nMy name is Amataya Ali, public defenders\nfor the state of Georgia.\nAnd I'm joined.\nAnd the reason why I say I hope you're\ngoing to be laughing about the public defenders\nis because when we tell you what we're doing\nabout transformation to put our clients back in the communities\nbecause they're doing better, that's\nwhat I hope you're going to be happy about.\nnot because they're going through the public defense system.\nSo let me correct myself.\nI'm joined by Deandre Berry, who's our Deputy Director\nand Terry Rayford, who's the CFO and Kenya,\nwho's hiding right there, who's the manager\nfor social services, who's the one in charge of making sure\nthat we have services that's putting our clients back\nin our communities and transformed.\nJust a little bit about myself,\nI have been a public defender for more than 35 years,\na long time.\nAnd in those 35 years, we have struggled\nwhat are we going to do to make a difference?\nBecause wherever we are, we leave in those communities as well.\nAnd I job is more than just representing people.\nAnd over the years, I think we got it.\nToday, as public defenders, we represent,\nwe rehabilitate, and we restore.\nBut it's been kind of difficult to get those things done\nbecause we didn't have what it took.\nBut over the last few years, I just\nwant to say thank you to the representatives\nwho have worked very hard to make sure\nthat we have what we need, especially over the last summer.\nI don't see Chairman Gillette here,\nbut I'm still going to do a shout out to him.\nAnd all the members of the appropriation team\non both sides who worked on the common pay plan\nfor both the prosecutors and the public defenders.\nThat was a game changer.\nAnd I will be remiss if I did not say thank you.\nIn all my years as a public defender,\nI never thought I would see a day\nwhen we will have public defenders being considered\nso that we can actually deliver the job\nthat the taxpayers of access to do.\nAnd our job is more than just being in the courtroom\nWhen we leave the courtroom, we should always see to ourselves.\nThen what?\nThe what is making sure that we close the revolving door.\nAnd that's what you all did for us over the summer.\nAnd Chairman Hatchet sent it to artillery.\nAnd all the other members who are now here.\nThank you for spending that time during the summer.\nMs. Bogos, Ms. Smith, I see you all here.\nWe spent a lot of time during the summer\nwhen the session was not even on,\nto put a common pay plan together.\nSomebody is probably saying what does that mean?\nIt means that we have a defined budget.\nIt means that finally, we can retain our employees.\nFinally, we can provide better services to our clients.\nAnd finally, it helps us to recruit\nin even difficult to staff places\nthat we called, oh, Chairman Gillette is here.\nI just mentioned your name right before you came in.\nI was just talking about all your efforts\nduring the summer, and I just said thank you.\nAnd I said, the common people that you work on,\nI'm still saying thank you.\nI said thank you in July.\nI'm still saying thank you in January.\nThank you so much for all your efforts.\nI'm grateful.\nAnd because of all your efforts and efforts\nof your colleagues.\nWe are able to recruit, even difficult to staff\ncircles places that we call the legal deserts.\nWe can stabilize our employee turnover\nin the state, statutory attorneys right now.\nWe only have 6%.\nIt's never done before.\nAnd I credit that to your efforts.\nWe can ensure that people who want to be public servants\ncan actually do it.\nI remember when I first started as a public defender.\nI did have family support, but if I didn't,\nI didn't know that I can shop in the win-texies\nand pigly wigglies of my neighborhood.\nI didn't know that I even made enough money\nto do that at that time.\nAnd the most important thing we can do now,\nwe can raise the bar for effective\nhigh quality representation.\nWe thank you.\nAnd the parity that you have enabled us to get,\nAnd I don't know if I'm representing Judge Gunter.\nI think I see you.\nThank you so much.\nHB 1391, I would forever be grateful for that.\nIt's unprecedented.\nIt's never happened everywhere.\nIt's happened in Georgia.\nAnd it's enabled us to recruit and retain.\nIn the public defender's world,\nI never thought we would have that.\nNormally, I come here and I want to tell you\nall we have achieved over the last year.\nBut today, I would be remiss if I did not just stop.\nI just say thank you.\nI am full because even from last year,\nI'm still thinking as to how much we have been able to get.\nAnd so I just want to say thank you to all of you\nbecause today we can do that job that we have in call to do\nto represent the least of these,\nbut not just represent them in the courtroom,\nto step outside the courtroom so that Kenya\ncan find them services in the community.\nAnd at any point in time when you see that we need services\nin your constituencies, give us a call.\nWe will be there with services\nbecause that's what we're supposed to do.\nThe return of your investment is going to be measurable\nbecause what we're going to do is that we will foster\npositive transformation for all our clients\nbecause our goal is to break the cycle of recidivism\nand return them as healthy and productive members\nof their communities.\nWe will improve continuity of representation for clients,\nand there will be a system that better reflects\nthe values of fairness, efficacy, and accountability.\nI just want to say thank you.\nBefore I pass it on to Terry,\nCFO to do the needful by asking for what we need\nfor next year, I am grateful.\nThank you so much.\nThank you, Director Lee.\nThank you, Chairman Hillary, Chairman Hatchett and members of the General Assembly for the\nopportunity to present the Governor's recommended budget for Georgia Public Defenders.\nAnd we only have two programs and the first one is Public Defender Council.\nwas added one time salary supplement of $2,000 that comes at $135,000 for a\nsecond program public defenders of course is the one time salary supplement at\n1.5 million and also what was added was to offset the loss of ARPA funding for\ncomplicate cases for $5.5 million. We do have one additional ask and that is for\nparity for the pay scale to start retroactively to January 1st, 2026 for\nparity with district attorneys, that's at a tune of $4.1 million.\nFor FY27, for our first program, these are all state-wide changes in adjustments.\nAnd for our second program, one through four is also state-wide adjustments.\nWe do have, number five, an offset for the loss of ARPA funds at $6.2 million and also\nto align our public defender salaries along with the district attorney salaries at $7.8\nmillion.\nAny questions?\nYou got a couple of questions that I think they're going to come from Chairman Gollett.\nGollett, I don't know if me and you will ask the same things.\nYou want to go first?\nall right well thank you for your presentation I got a couple of things\nfirst of all you know we've been very committed to keeping parity among the\ndistrict attorney's offices and the public defender's offices but one of the\nthings I'm starting to fall back on and wonder now is what is parity the right\nthing so the reason I bring that up is I know that every single case that goes\nthis brought by the state is going to have to get defended by or prosecuted by\ndistrict attorney's office and the assistant district attorney. Clearly you'll\nhave private attorneys that enter into the public defender space. So I need to\nunderstand your case count or does everything go into into J Katz, every\ncase count you have? All case count. And I'm sorry, thanks for coming up and just\nstating your names with the rest of the folks know you in here. Good afternoon. I am\nD'Andre Berry and you keep up with the data for among other things, right?\nSo we're also making the juvenile courts to an extent move into J-Cats so we can have\na little bit more transparency there, too.\nSo this isn't us picking on you.\nWe just need to understand the data of where things break down.\nI got this case load summary.\nI know you've had some issues where you've hired conflict people, et cetera.\nHow do I know if I'm comparing apples to apples how many cases each public defender has?\nIs there a way you can tell me that, or do you have that info with you?\nI can pull that data and provide it to you, sir, but yes, so we have the ability to give\nyou that data.\nJ.Cats will help.\nYes, sir.\nAnd I'll say that so that other people understand why we're asking people to put things either\nin J-Cats are some of the formulas.\nNot trying to micro-manage you.\nWe just need to be able to see the data later on.\nSo even our court judges listening,\nhopefully they understand that, too.\nCan another thing that we do is we award judgeships\nbased on case counts, and you know that.\nThe way that we've moved with your conflict system\nkind of makes my circuit break down the public defender\noffices, I don't want to say skewed,\nbut maybe that's the best word to use.\nyou've got conflict and you've got obviously your Circuit of Public Defenders and then\nthe assistance that come underneath it.\nCan we get a breakdown of what each circuit looks like if there's employees per circuit\nand sort of, and then of course, if we've got cases for that, we can do the case counts\naccordingly.\nWould that be something that J-Cats would show us as well or something you can get for\nus?\nWe have the ability to break down the staff,\nnot from Jcats, but from the state system.\nFrom the statutory budget, you can hold the date of it.\nI can hear you, but I know that the folks listening\nare watching or hearing out there, maybe can't.\nSo for statutory positions, say Alapaha has three attorneys.\nYou would like to see from just a statutory standpoint,\nhow many cases they have, and how much each attorney has.\nWell, the statutory matters to me,\nBut also if you've done some other hiring with other funds,\nwhether it be county funds, et cetera,\nit just helps us understand why we may have bottlenecks\nin certain areas as to others.\nWe could do that.\nWe're wanting to get a better grasp of that.\nYeah, we could do that.\nWe could have state county contract employees,\nthis conflict contractors.\nWe could do that for each circuit what we have\nand how many cases are assigned to that judicial circuit.\nOne other thing I'm gonna wonder in that data\nis how many cases each conflict attorney has\nbecause one thing we've heard from judges is\nI have multi-defendants in a case.\nI can't set a scheduling hearing\nbecause that attorney has 30 clients\nand they're in courtroom B and I need them in C.\nSo again, we're trying to understand all of this.\nAs you know, we work through this entire summer chairman\nGullet has really spent his entire summer.\nappreciate his leadership on the, I won't call it a study committee, is that my\nmic? No working group and what's going on but those are things I'd like to\nsee too and as we follow up on the work that we've already been working on\nthrough all of this summer. Yeah thank you thank you Chairman for your\nhelp this summer too you came and spent as much time as I did on those\nThank you. I do have a question just related to ARPA funds. How long have ARPA funds been used for\nconflict cases? How long have we been using ARPA funds on conflict cases? Since 2022.\nFour years. Four counties. Do you have any idea of how much total ARPA money that was on conflict cases?\nNot right this minute, but we've allocated as much as we got to the\nConflict cases, I don't want to give you both a park figure that's not correct\nBut I can get it for you. That'd be great. Just because I'm trying to see if we have four years of opera funds\nYou're asking for five million now or you know more five million now for this to continue\nAnd so what is the I'm trying to see what the future holds for for conflict cases from a money for using opera funds\nthat was really the kind of get us out of COVID but now it's costing the\nstate now $5 million to kind of keep up with what was really a one-time\nfunding mechanism for complicate cases. Related to the salary study are there\nany to the changes have kind of implemented we're gonna you know figure out\nhow to get this thing funded from the from the the parity with the DA's and\nthe the funding mechanism for salaries but are there any APDs that make more\nother CPDs today, or make more than their CPD?\nAnd don't believe so.\nI don't believe so.\nAnd the ones who are making out of the salary studies\nthat we did during the summer, if it's beyond that range,\nwhat we're going to do is grandfather then.\nWe don't anticipate cutting any one salary,\nbut we are not going to increase.\nSo what we'll do is red line so that those salaries\nnot increasing until the attain a higher rate higher status rather just over the next\ncouple days if you can look and see if there's any APDs make you more CPDs we don't believe\nso but if I go back and I see that I'll let you know okay thank you and to say\nsomething about the conflict cases the reason why we have the conflict cases is\nnot it's not attributed to us is because of the indictment the cases that\nAgain, in diamond, if we get 161 single case\nin diamond, we have to find 159 attorneys for those.\nBut one thing we're doing because of the concurrence,\nI just came from the Supreme Court,\nwe're working on a different kind of model\nthat we think is going to make a difference\nin how we assign conflict cases.\nWe're working with our CPDs, and I think we can come up\nwith a different formula by the end of March.\nI have reached out to your office to see\nto discuss that as well.\nYeah, great.\nI appreciate that.\nAnd I know I think the Supreme Court's\nprobably going to write rules and regs or regulations\naround that.\nSo thank you.\nI think that's going to be important.\nAnd I think it's ultimately going to hopefully\ndrive down some costs associated to conflict cases,\nwhatever those rules are.\nWe believe so.\nAnd we're working on that in a way\nthat's going to actually make it better for us\nto represent our clients better and at the same time\nreduce the cost to the taxpayers.\nSo we're working on that with all the parties involved,\nand we will be in touch so that we can keep you informed\nas to how we're doing that.\nRight, thank you so much.\nThanks for being here.\nChairman donor.\nThank you, Chairman.\nOkay, on your $7.8 million to align\nassisted public defender salaries\nto the assisted district attorney salary.\nAbout a year ago, I guess,\nI was thinking that y'all are at 71,000\nwith your assistant public defenders\nand the DA's were at around 68, 60, 1 or 2000.\nSo this number doesn't make sense to me\nthat you're asking for more money to align\nbecause they weren't making as much as the folks.\nThat's what I'm asking, how do we get here?\nSo what we did at that point,\nAs we looked at both the supplement and what the state was offering.\nSo we went to the state allocation as well as the supplement if there was one from the\ncounty.\nFor the assistant public defenders.\nSo now we're doing what the prosecutors are doing, straight state salary.\nAll right, so let's build it.\nCan I?\nWere you using the ARPA funds to pay the $71,000 payments, then I'm confused too.\nSo can you walk us back through that one more time?\nYeah, I was the our understanding last year was you were paying the public the public defender.\nI guess average or maybe is actually set rate was set or starting rate was 71,000\nwhich sent the public the prosecuting attorneys into a little bit of a\nKnowsdive because they were like hey, where's parity?\nSo they brought us a proposal now to meet you but the number on here\nhere is showing that you need more money to be at parity with them that we thought we\nwere moving them to parity with you at, so that's accurate, right, exactly, yes.\nSo it was in 2023? 2023 we received two appropriations and when we applied all of that, our first\nline, APD1 went to 72, not APD2, not APD3, not APD4. It was nothing that we did. It was\nbecause we received two separate appropriations to increase retention and to increase retention\nand to improve hiring, is that? Those were the two. And so when we applied those two appropriations\nthat we got, the salaries of APD once went to 72,000\nwith the exception of three or four employees.\nWe didn't do anything to cost that.\nWe did not sell the salaries.\nIt was just what happened when we got those\nto appropriations.\nWhat were the numbers tearing?\nIt was, do you remember?\nSo there were only four employees who did not make it up to that 72 when we applied those\nto appropriations but it was only APD 1 and now we are doing it for APD 1, 2, 3, 4 and we're\nhappy to be joining the prosecutors in the pay plan with steps. So when you heard\nthat we were paying more, we truly were not. It was just appropriations that\nbrought this APD 1 up to 72, not the second, third and fourth levels. And that\nwas caused by those two appropriations that we got that particular year. But now\nNow we have the same common pay plan we're going from APD-1, APD-2, APD-3 realizing that\nour APD-2 that was not affected by that increase, not everybody is going up.\nI hope I can explain it.\nWhen you started, you had an APD-1 or an APD-4.\nWe just did APD-1 at that time.\nIf I was hard today, would I be at APD-1 or an APD-4, or I'd be an APD-1, right?\nAPD-1.\nSo if they were at 71, you're saying your two, three, and fours were less?\nWell, some of them had gone up to that.\nThey were not affected.\nSo we have sought money to get everybody up, but we did not receive the money at that time.\nAnd so we'll go into it and subcommittee, I guess, the county is more clear.\nSenator, Representative Chalkis, did you have a question?\nYes, thank you, Mr. Chairman.\nIn the case load, do you break down the case load between first offenders and second and\nthird offenders? Is there any way you could get us that information? Is there any way we\nWe can get the information on the offenders that you represent if they're first-time offenders\nor their multiple offenders, is there any information on that?\nYes, sir, our case management system can partially get that information for the most part\nyou can't, but I can definitely provide you with what the system is able to do.\nThank you.\nI think that would be very interesting. Just know how many times you're seeing\nrepeat people. I think that's what Representative Chukus is asking and how\noften. Any other questions? Thanks. We look forward to following up with subcommittee\nmaybe understand better. Thank you for your for being here today.\nWhat I might be able to do is send you some paperwork.\nThank you, sir.\nI'm going to go ahead, Mr. Hatchett.\nOur next presenters will be the Prosecuting Attorney's Council.\n.\n.\n.\n.\nDirector Scandalakis, we made again, you're the last one today.\nI ran into Chairman Powell outside a little bit earlier and he said, keep it short.\nNo, no, no, no, no, be careful with what he said.\nWell, it's a pleasure to be here, Chairman Haset, I appreciate it.\nChairman Hatchett, Chairman Tillery, Chairman Gullet.\nMy good Greek colleague over there,\nRepresentative Chokis, Chairman Chokis,\nalways a pleasure to be here.\nWith me as District Attorney Herb Cramford,\nHerb is the budget chair for the DA's association.\nHe's also a council member.\nHe will be presenting the budget for us today,\nand I'll be available to answer questions.\nAlso with us is Chris Jones, our chief financial officer,\nand Katherine Camp, who's also in our financial department.\nWe're all here to answer your questions,\nbut I will turn it over to Herb,\nand I promise you we will be short.\nThank you, Pete.\nYeah, thank you all for having us.\nThis whole presentation is 14 slides,\nand I aim to move very quickly, okay?\nSo this is the big budget ask,\nThe number one priority for DAs this year is increasing elected DA pay.\nThey're 51 DAs.\nOur request would put us at 88% of federal district judge pay as compared to superior court\njudges last year, y'all moved to 90% of federal district court judge pay.\nIf we got funded fully at 88%, the salary would be that 196 number.\nOur reasons for that are twofold primarily.\nOne, all the states that touch Georgia paid elected DA's more than the state of Georgia.\nSo currently elected DA's state pay is at a little over 132,000.\nThe next closest is North Carolina at 167,000.\nAnd it goes all the way to Florida to over 218,000.\nSecond, y'all really helped us out last year by increasing state ADA pay.\nWe moved the floor for a new ADA from like 64,000 to 72,000.\nWe moved the ceiling for a state paid ADA from like 125,000 to 134,000.\nThe result was there are now 83 state paid assistant DAs in the state of Georgia who are\nmaking more than their elected DA.\nSo out of 400 something state paid ADAs in the state of Georgia, 83 are at the top of\nof pay scale, making more than their elected DA.\nFor assistant DAs, we are asking, at very least, for a step increase, just so they, you know,\nthe people that stick with us, the people that try the most serious cases in our offices,\nthat they're still getting a merit increase every year.\nThose are the people that have committed their career to prosecution and we want to reward\nthem for that obviously.\nYear two of the competitive plan to skip forward to show you that, in fiscal year 2025, starting\nADA pay was at 60, the top of the scale was at 125.\nWhat y'all did last year is that FY26 year one of this three year plan.\nWe now start state-funded ADA's at 72,000 and they max out at 134.\nYear two of this plan, if you chose to do that this year, would be starting salaries at\n78,000 and it would max out at 157 at the top of the scale.\nSo again, we're asking for two things for ADA's.\nThere are 437 state-paid ADAs in the state of Georgia, a step increase, and if you're\nwilling to also give us year two of that three-year plan.\nKeep in mind, helping out state-funded ADAs disproportionately helps the smaller offices.\nThere are some DAs in the state of Georgia that get no county funding, they get no county\nbe paid assistant DA's, their offices entirely dependent on what the state of Georgia will\ndo for their offices.\nMy office, I'm in County County Lagrange, Maryweather, I'm kind of in the middle, about half\nof my state-funded ADA's are funded by my counties, the other half are funded by the state\nof Georgia.\nBut I think it's worth noting there are multiple offices that are very dependent on what\nthe state of Georgia does. Vacancy trends going back to July 2022 out of those\n437 state paid ADA's we've been over 30 vacancy statewide going back to\nearly 2023 and we remain over 30 roughly you know 9 to 10% roughly of our\nstate ADA's have been vacant for the last few years.\nADA turnover, you can see 2017, 18, 19, and 20.\nIt was in the teens as a percentage.\nSince 2020, it's remained over 20% as a percentage.\nAnd unfortunately, since 23 has ticked up the last three years.\nSo we've still got a turnover issue.\nJust to give you an example, I've got six\nassisted DA positions in Troop County since 2023.\nI've lost nine assisted DAs in that one county.\nAnd I presented that to my commission\nand city council recently.\nSo a lot of offices are experiencing\nthat kind of turnover.\nAnd every new person you gotta train\nand get them up to speed before you can give them a case\nthat anybody in the community's gonna care about, right?\nSo it's a real problem, this kind of turnover.\nThis is where we're at out of the 437 assistant DAs.\nOnly 25, when we pulled these numbers recently,\nwere brand new out of law school.\n245 out of 437 are in our class four.\nThat's the top class.\nSo we're struggling to get new people in\nand keep them.\nAnd thankfully, we've got a lot of career prosecutors,\nbut we're hollowing out in that middle zone.\nAnd that's what our three-year plan is really meant to address.\nWe can tell somebody, if you start with me at a law school,\nin 10 years, you'll be making over $100,000, for example.\nRight?\nThe career prosecutors handle murders, sex crimes,\ncrimes against children.\nThose are really the most important prosecutors in our offices.\nNext, we're kind of moving into the PAC program budget.\nWe split the Caluida Circuit a couple of years ago.\nThe new circuit is Carroll and Hurd County, the West Georgia\nCircuit.\nPAC has been using funding to cover the investigator victim\nadvocate and legal assistant positions.\nAnd we're just looking for full funding for those administrative non-lawyer positions.\nThe total budget need for those four positions is right under $500,000.\nThe conflict case program was started a few years ago.\nI think after 2020, there was a lot of turnover among DAs as a result of elections.\nand a private lawyer becomes DA,\nthey're conflicted from prosecuting a lot of cases\nin their circuit.\nWe started the conflict program as a separate program\nwith the idea that it would go away.\nOnce we handled all those conflicts,\nthen we wouldn't need those conflict prosecutors at PAC.\nKeep in mind, the Attorney General's Office\nused to handle conflicts in the state of Georgia.\nFor reasons that I couldn't tell you the answer, conflicts have stayed high.\nWe continue to receive a lot of conflicts, PAC does.\nOne thing to keep in mind, PAC can't scrutinize an elected DA who says, I have a conflict.\nThe law doesn't allow PAC to say, no, you don't.\nSo they have to accept all these conflicts.\nPAC is handling over 50% of the cases conflicted by elected DAs.\nThe other 46% or so are handled by other DAs offices.\nAnd if I pick up a conflict, I've got to send an ADA to another county.\nThat means they can't handle cases in our county.\nSo I really appreciate the fact that PAC is now able to handle in-house conflicts.\nSo part of our ask is to move what was a separate program into the PAC program and we're\nasking for a step for those conflict prosecutors and if ADA's get year two of the three year\nplan, we'd like that to apply to the prosecutors at PAC as well.\nAnd this is what I was talking about, moving the program over to the PAC program.\nThere would be a little bit of savings here.\nThis is at the $200,000 that we would reduce our current budget allocation by.\nThis is what I was talking about.\nof 512 conflicts referred in 2025 compared to 215 in 2024.\nPat candles a majority of those.\nAnd that was my best effort to move through that quickly.\nWe're all happy to take any questions if y'all have any.\nI know we're last, but.\nThank you.\nChairman Gollett.\nThank you.\nI have a couple of questions.\nOne on the three-year retention.\nSo the ask is for elected DAs for pay increase, 88%.\nAnd I want to get there.\nBut when I see the numbers continue to trickle up on 25%,\n20% I guess, you know, 24, your 2024, 2025,\nAnd your three-year plan, retention plan is going to get hit.\nI think I was, I know we've had conversations,\nhey, it's, both can't happen, right?\nIt makes me struggle to say, you know,\nyou're saying retention is a problem.\nI mean, it's clearly a problem.\nBut I don't know how, paying, fixing the elected DA pay,\nis going to help with retention.\nI know you got to, we got to balance.\nWe got to walk and chew gum at the same time.\nBut 25% is really, it's not sustainable.\nI don't think it's the DA programs.\nAnd so what would you say to that, I guess, as far as you know?\nElectives, as an elected, we know what we're getting into.\nI said this for the judges too.\nWe know what our pay was.\nAnd yes, judges got their pay raise.\nWe do need to figure this out.\nBut it's a difficult ask at the moment to me to say,\nelectives need it.\nBut we have a 25% retention rate.\nand this is a problem too.\nSo, you have a, it's a hard question,\nbut it's a different response on it.\nI mean, my take on that is, I think it is two problems,\nboth need to be solved in my view.\nThat's why when we had those discussions with you\nand other appropriators, I guess, more than a year ago,\nwe said, look, we're not trying to keep up with the judges,\nyou know, this year, our priorities are assistant DAs\ngetting this first year implemented,\nthat took effect in January of 25.\nSo I at least can speak for of 26.\nI mean, so it just took effect in 26.\nSo at least speaking for the conversations\nI've had with the ADA's in my office,\nthat just hit their pocketbooks, they're very thankful.\nI'm transparent with them about the fact\nthat I and DAs are prioritizing elected DAPA\nover year two of the year three plan,\nthis fiscal year, and they understand that.\nAnd at least in my office, they're supportive of that,\nin part because they know we're committed\nto years two and three in the plan.\nAnd I don't, I would like to think that year two\nof the plan would totally fix the turnover problem.\nI don't know that it will.\nI think it really is that three-year plan.\nAnd I would love for that to take place in three years in a row.\nI understand that may not.\nIf we can get there in five years, that's better than not\ngetting there at all.\nAnd so yeah, it's not a fun choice to make.\nBut last year, we prioritized the ADAs.\nAnd just candidly, this year, we're\nprioritizing elected DAPA.\nIf we got year two for ADA's, I think top of the scale,\nthey'd be at what, 150, if I recall correctly,\nfrom the slide.\nAnd so we'd be, elected DA's would be\nthat much more underwater, you know,\nfrom their assistance.\nLook how do you pay, or look how do you cap\nwith the idea to tell me a little bit,\nespecially like other things.\nSure, yeah, so I'm,\nOur thinking on proposing a DA pay bill was to essentially follow the framework that the\njudges used.\nThey got 90% of federal district court judge pay, that paid from 2022, so we're asking\nto get no more than 88%.\nUnderstanding we may not get that fully funded, right?\nare proposing we increase the retirement age. I think you know everybody would\nlove to keep it at 60 or 62. I understand that it's likely to be moved to\n65 where the judges are just to be candid. We've also proposed the same cap on\ncounty supplement pay. What's called locality pay? I believe the judges were\ncap at 10%, and if the funding we got was substantially lower than 88%, that could create\na problem, but if we're relatively close to where the judges end up, we're proposing\na 10% cap just like the judges got.\nAre there currently any ADAs making more than a DA?\nThe assistant DA is making more than the elected DA?\nYes.\nThat's that.\nAnd the same circuit.\nYes.\nOkay.\nYeah. There are some circuits that get no county funding that have, you know, an ADA or two at least that are at the top of that scale.\nMaking more than the elected DA.\nSarah, we got other questions.\nOh, all right.\nOne more question.\nThis is pretty in pay.\nSo, with the DA's who have, I guess, presumably more than one county in their circuit, do they\nget pretty impay or do they get mileage going between and do the ADA's get that as well?\nADA's, as I understand it, you have a home office and if you travel from your home to a different\noffice and that commute is longer than it is to your home office, you would get mileage for the excess.\nYour other question was about do DAs get speaking for myself if I go to any of my\nthree counties or before the split if I was going to any of my five counties I'm\nlucky enough to have a state vehicle so I wasn't asking for mileage there may be\nDAs that don't have a state vehicle that that's secret reimbursements I would\nimagine the same rule applies to them they've got a primary office for which\nthey would not get mileage but if they travel further than their primary\noffice as I understand the law, they could get mileage for that.\nChairman Chakus.\nQuestion I have is the same one I asked for the public defenders.\nDo you have any numbers on your recidivism, on the number of prosecutions I'll have, or repeat offenders?\nI don't know, you know, a lot of prosecutors in Georgia use a case-manage system called\nTracker that was made for prosecutors, the Prosecuting Attorney's Council helped develop\nthat software.\nWe can run a lot of reports that give us good data on different things.\nI don't know that we currently have that software where it can run a report on recidivism,\nBut as I heard you ask that question, I wondered, is that something we could develop?\nYou know, I mean, the names are the same, right?\nSo it seems like that's something we could do.\nI'm not a tech guru like Chairman Gullet here, but I think that's something we could\nlook into and try to do.\nChairman Gunner.\nThank you, Mr. Chairman.\nOkay, so I feel like I've been asleep for a year.\nSorry about that.\nCan you catch me up on the changes in the step system because apparently I'll\ngo on from a four or five step system to a three step, right, or how's that work?\nChris would be the best start of that, but my quick understanding is there are four classes.\nOnce somebody gets through steps one, two, three, and four for each class they graduate to the next class.\nexcept class four has multiple steps that once you're into class four and you\nstay a prosecutor you just keep going up so when we increased state pay the\ntop of the scale from 125 to 134 at 125 the most you could get was class four\nstep eight at one thirty-four if I'm looking at this graph right it increased\na step or two yeah one step I guess yeah so now you can get step nine. This is the\nsame scale that y'all have for a long time. For a long time. Okay, okay, we're\npercent of hope. Thank you Mr. Chairman. I don't understand the complex problem that you're\nraising. Is it an actual complex problem or are people just declining working on cases like what's\ngoing on here? This doesn't make a lot of sense to me. Yeah. For whatever reason, the last few years\nthere have been more cases conflicted than our understanding of how many cases were conflicted\nhistorically. One thing to keep in mind is these conflicts also include conflicts from solicitor\ngenerals and part-time solicitors. So a lot of counties have a part-time solicitor that also has\na local law practice and again they could feel like they have a conflict for a lot of different\nreasons and pack legally can't question that. Typically conflicts would jump after election\nyears because there's new elected prosecutors, solicitors, or D.A.'s, they had a private practice,\nthey obviously can't prosecute somebody they represented. So historically they were used to the\nbumps in the years after elections. For whatever reason that increased the last few years has stayed\nup there. Well it depends on what you represent the person for, so that you can potentially be at\nfirst to a prior client if it's a different action, if it's something where you\nlearn information that's related to that subsequent issue then you clearly\nwould be complicated but there are situations where it's a totally different\nsubject matter totally different. It's not automatic or as simple as you\nrepresented somebody so you're automatically out. I agree and if the implicit\nThis suggestion is that it might be helpful to have rules about what is a conflict and\nwhat isn't, I would agree with that.\nBut right now, as the elected DA, I could call Pete tomorrow and say, I have a conflict\non these 200 cases and he'd have to say, okay, I'll figure out somebody to handle them.\nAnd I wouldn't have to say why I think I had a conflict.\nTypically, I don't think people do.\nThey just say I have a conflict.\nBut I agree with the point you're making, like ethically, yeah.\nI have a conflict for the rest of this session.\nRepresentative Evans.\nThank you, Mr. Chairman.\nOne quick preparatory question.\nWe're in year one of a three year\npaced up up for the ADA, is that right?\nOnly then one year or three, OK.\nAnd then one other preparatory question,\nY'all's budget that you're presenting here today,\nthis is your presentation,\nthe governor doesn't weigh in on your budget\nbecause of the separation of powers, true.\nThat's correct.\nA couple of things I heard,\nI'm gonna repeat, you can tell me if I heard them\nright or wrong, I just want you to comment on them.\nSure.\nWe have every elected DA position is filled, true.\nBut we have a problem retaining assistant DAs, right?\nCorrect.\nCrucial levels in some areas, right?\nYeah, I would say particularly rural areas, yeah.\nI assume we have shared with the ADAs the presentation of the step up over three years.\nWhile they know it's at the discretion of the legislature, they would assume, I think,\nthat they're elected DAs and that PAC is going to advocate for the rest of those steps.\nI think that would be a fair assumption, don't you?\nYes, like steps two and three.\nCorrect.\nBut you're down here asking us to jump off the one, two, three in favor of a pay raise\nto elected DA's where we don't have vacancies,\nbut we do have vacancies of ADA's.\nI'm trying to understand how that's responsible\nfor leaders of offices that are responsible\nfor making sure that bad guys are on the street\nand how it's responsible to ask us to prioritize that\nwhen we know we've gotten these vacancies.\nYeah, well, to be clear, we're asking for both.\nChairman Gullet asked me, you know.\nBut if you had to prioritize, which one are you picking?\nYeah, if the DA's on behalf of the DA's that voted,\nand I personally agree with this,\nlike I said, I've spoken to my office about it,\nand they supported.\nThis year, if we're asked to prioritize one over the other,\nit would be elected DA pay.\nAnd we continue to want ADA pay,\nwhether that be one step or a step\nand year two of the three year plan.\nAnd are the ADA's in other offices\naware that their PAC council and their bosses are down there advocating for us to choose\nthem over the ADA's if a choice is required. I understand you want both, but when we ask\nyou, push comes to shove, if we can only give you one, which one do you want? That's the\nmessage.\nI don't know what other DA's have said or not said to their office. I know what I've communicated\nto my office, and I would say like I said earlier, just, I guess, this month, at the end\nof the month, all those ADAs are going to get the substantial increase that this legislature\ngave last year, right?\nSo I think they're very appreciative of what Y'all did for them, and I think they understand\nthe leaders of their offices, you know, they all want a good boss to, right?\nAnd I think they understand, at least the ones I talk to, I imagine a lot of ADAs understand.\nHaving the position of your boss being the lowest paid elected DA in the southeast just\nisn't a good thing.\nAnd so I do think, yeah, they would definitely like step two.\nThey would definitely like more money, don't get me wrong.\nthat would help the turnover problem,\nbut elected DA pay is a problem as well.\nAnd it's not just, yes,\nand my personal financial interest don't get me wrong,\nbut as a policy matter,\nI think this is a legitimate issue\nbeing this much lower paid than other states.\nPerhaps when we have our subcommittee hearings,\nwe could have some ADAs come in.\nI would be very interested to know if surveys have been taken across other offices and how\nthose ADAs feel and even more so perhaps other members of the criminal justice system about\nhow the system doesn't work when we don't have ADAs and that I want somebody to tell\nme why not filling those positions is not the priority over raising DAPA.\nThat would be good for subcommittee.\nOne other question if I might, Mr. Chairman on a different subject.\nof money is running out? How are y'all feeling in those gaps?\nYes, I'm glad you asked that. This occurred to me during the prior presentation as well.\nI noticed they were asking for ARPA funds. As I understand it, the Public Defender Standards\nCouncil was given ARPA money directly. DAs, to the extent we got ARPA money, it went through\nAOC and was subject to the decisions of our chief judge.\nSo early on in the ARPA process, before our circuit split, my office got new ARPA money\nfor those first two or three years.\nNow we've got a circuit split and I've got a different chief judge.\nThe last year and this year, I have gotten ARPA money to fund one ADA.\nI can tell you, we've had no discussions,\nmaybe we're dumb or something,\nbut we've had no discussions about coming to the legislature\nto ask for y'all to cover our ARPA allocations.\nMy understanding is I've got to go to my county to do that,\nand I intend to do that just so you know,\nbut I haven't had a single discussion with a single DA\nthat we expect the legislature to to pick up off the dollars thank you looks like\nthat's all the prosecuting you get today all right thank you all thank you all very much\ny'all we are finished we start like I have it eight in the morning just in case some of you haven't\nseen on the speaker and I don't know if the Senate is addressed or not but Monday we will not\nhave to be here but the speaker is going to gavill in so it counts as a day but we will not be\nexpected to be here Monday. But be here tomorrow. Thank you.\n",
  "updated_at": "2026-02-12T01:26:07.583669+00:00"
}