{
  "video_id": "D5sf1KufF1A",
  "url": "https://youtu.be/D5sf1KufF1A?t=802",
  "title": "Georgia House - Day 23 (2026-02-26)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 23,
  "video_date": "2026-02-26",
  "duration_minutes": 218,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-02-26:\n\n### Overview\nThe session featured discussions on several notable bills, including HB 156, HB 171, HB 308, SB 125, and SB 72. The proceedings included scripture readings, prayers, and reflections on the responsibilities of legislators to protect the vulnerable in their communities.\n\n### Key Actions\n**HB 156**: Bill discussed but no action taken\n**HB 171**: Bill discussed but no action taken \n**HB 308**: Bill discussed but no action taken\n**SB 125**: Bill discussed but no action taken\n**SB 72**: Bill discussed but no action taken\n\n### Bills Introduced (First Reading)\nNo new bills were introduced during this session.\n\n### Notable Moments\n- Opening prayer and scripture reading by Pastor Clint Hutchison, focusing on the responsibility of legislators to defend the vulnerable.\n- Representative Lisa Hagen introduced Pastor Hutchison and discussed the work of the Mercy Ministries, a free health clinic serving the uninsured.\n- Legislators were urged to make decisions that \"bless\" the people of Georgia and uphold moral and ethical values.\n\n### Votes\nNo recorded votes took place during this session.\n\n### Attendance\nA quorum was present, with legislators instructed to vote \"green\" to signify their attendance.\n\n### Adjournment\nThe session was adjourned. The next scheduled session was not provided.",
  "transcript": "the Well good morning members. Members will please come to the floor. Members will please come to the floor. The hour for convened having arrived. All members, all members please come to the floor. Mr. Clerk will you ring the bell. Please come to the floor. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk will you unlock the machines. Members vote green to signify their presence in the chamber. Members vote green to signify their presence in the chamber. All members vote if so the clerk will lock the machine. Members vote green to signify their presence in the chamber. We need to be here about 30 minutes early so you can make sure you get voted in. Get your cards in. Good morning members. Good to see you all this morning on this bright Wednesday morning. We have a lot of work to do today so we'll get started by asking the door to please close the doors and keep them closed. As is our custom move again our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the lady from down in sweet onion country by the Georgia teams county. The lady from the 156 house district representative Lisa Hagen. Thank you Mr. Speaker. It's my pleasure to introduce Clint Hutchison a devoted husband, father and community leader. He's also a devoted grandfather. This July and his wife Candace will celebrate 30 years of marriage. They have two daughters and a grandson. Clint serves as the pastor of Videlia Advent Christian Church and that is certainly an important job but that is not why I asked him to be here with us this morning. I met Clint years ago through his work at the Mercy Ministries, a free clinic providing essential health care, medication, dental care, counseling and more for uninsured adults in need in our area. For 15 years the Mercy Ministries has been a vital part of the community now serving around 650 patients across two locations. Joining Clint today are the Reverend Luis Gonzalez director of ministry, Michael Thigpin and Michael Williams who are board members at the Mercy Ministries. Everyone at the Mercy Ministries offers love, compassion, care and education to those who have fallen between the cracks and I'm so proud of what they do in our community. Thank you Clint for joining us in the chamber today and for offering us a word of devotion and a reminder of why we do this work that we do. I would like to take a second and say thank you for the opportunity to be here. Lisa thank you for the opportunity as well. So this is my first experience here at the Capitol and it is such a pleasure for me to come all the way up from South Georgia and have the opportunity to share with you some things that are super important for me. So thank you this morning. I have two short little passages I want to share with you one of those being a fable from Esau. The fable is the trees in the axe and this fable I took an elaborate eternity into a little bit of a South Georgia fable. Says one day a man wandered into a thick pine forest and asked the trees for a sturdy branch that he could make for his axe. The trees wanting to be neighborly agreed and offered him a young sapling but as soon as the man fitted his new handle he set to his work chopping down the tallest and the oldest pines in his sight. As the older trees fell one by one and old oak shook his branches and said to the cyclists well we've done it now. If we hadn't given up the little sapling we might kept our strength instead of generations. Esau gives us a lesson in the dangers of surrendering the rights of the weaker. It's oftentimes done with good intentions. The older trees wanted to help and be neighborly by extending the smaller saplings and sometimes we give up rights and sometimes we give up the rights of weaker with good intentions. It often happens that when we give up the smaller it will soon happen to the greater. The older trees and Cyprus and the pines and the oaks realize that as they give up that small sapling the axe was set to its roots and then very soon it was set to the roots of the larger trees. Our decisions today affect tomorrow. In this story we have this fable from Esau who reminds us that the decisions made here today will affect generations and I stand in awe of you out here today. You set have bills before you and you'll make decisions and you'll cast votes that will not affect Georgia this year but in years and years and years to come. As we look now to my second passage this morning I turn to the words of Jesus pinned by Matthew in chapter 25 verses 34 through 40 and this is the parable of the sheep and the goats and we see in this part of it one of our motto and verses in which we use it mercy it guides us and it guides us into a better way actually blessed way. Since the king says to those on his right come you who are blessed by my father and heard the kingdom prepared for you from the foundations of the world. For I was hungry and you gave me food I was thirsty and you gave me drink I was a stranger and you welcomed me in I was naked and you closed me. I was sick and you visited me I was in prison and you came to me then the righteous answered him and said Lord when did we see you hungry and feed you and when did we see you thirsty and give you something to drink and when did we see you as a stranger and welcome you in and naked and close you. When did we see you sick or in prison and come and visit you the king or answer and he said to them truly I say to you as you did it to the one of the least of these brothers of mine you did it unto me. Jesus reminds us in this passage of scripture and all the responsibility we have those to those that are weaker and for those that are brothers and sisters but he challenges us to a better way. He challenges us to a way where the blessings of God will flow into our communities and our families and into our own personal lives. Protecting the weak is ultimately protecting ourselves because the strength of our community depends on the well being of its most vulnerable members. When we stand up to those and when we stand up for those in need we create a society that is safer. We create a society that is more just and is resilient for everyone including our own selves. And here's how. Creates interconnect in this. A society where the weak or neglected becomes unstable leading to division and suffering and eventually harmed all when we uplift others we build a stronger foundation for everyone including ourselves. It increases moral and ethical strength when we protect the vulnerable we enforce our values of justice and kindness and integrity creating a culture that in turn protects us when we find ourselves in a place of need. And it's preventing of greater harm ignoring the struggles of the weak allows injustice to grow. We can later threaten the security and the rights of everyone by defending them we ensure that those same threats don't reach us by protecting the weak. We reinforce the very systems and the values that safeguard our own future. I want to encourage you to choose a better way. I want to encourage you to move along and receive the blessings that's given to us as we choose a better way. My prayer today is for you that you make decisions that are clear. My prayer is that you represent every individual in your district because you've been given the opportunity to do so. My prayer is that the wisdom of God may guide you into what is best for us all the state of Georgia and the kingdom of God. I'm so thankful to be here today and I thank you for all that you do for our great state and I challenge you. Make those choices based on the blessings that's given us from God. Let's stand now and we'll have a moment of prayer. Father, I reach out to you this morning and I say thank you. Thank you for the men and women that stand in this great hall. Thank you for the men and women that get to represent all of this great state, Father. Your wisdom is bigger than ours and greater than ours and your ways are greater and different than ours, Father. So I pray that divine God is upon these chambers that wisdom may prevail, Father, that your love and your kindness may be shown through all. Protect them, Lord, as they do their work and as they travel back and forth through their homes. Father, I pray for this dear brother Terry that's had this accident. May you bless and take care of him and heal him through this process, Lord. Father, we just ask today as we go in this session, Lord, that your wisdom and your God is fit upon us and thank you for all you do. Christ, name we pray. Amen. Let's now say, pledge allegiance. I pledge allegiance to the flag of the United States of America and to the Republic for which it stands one nation under God, indivisible with liberty and justice for all. Thank you, brother Clint, for bringing that message. We appreciate y'all making the effort to be here and thanks for what you're doing in the community with your mission work. Doorky, but you may unlock the doors, members. You may join Brother Clint and his team in the south any room for some photos and thank them for being here with us today. You You Members, our doctor of the day today is brought to us by Representative Jesse Petrie from down on the coast. Dr. Elizabeth Gray, we appreciate Dr. Gray being with us and taking care of that age station if you need Dr. Gray. Stop by if you want to just say thank you for serving. Stop by. Chairman Hilton, the chair of the Committee on Information and Audits is recognized. Thank you, Mr. Speaker. It is a great day to be a Georgian. Your Committee on Information Audits has read the journal the previous legislative day and found it to be correct. Perfect. Chairman Hilton, the chair of the Committee on Information and Audits reports that the journal of the previous legislative day has been read and found to be correct. Is there objection to dispense with the reading of the journal? Chair has done the reading the journal is dispensed with. Is there any objection to the confirmation of the journal hearing none the journalist confirmed? Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, a station in the 104th moves following the establishes the order of business and the first part of the period unanimous consent. Introduction of bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, first reading and reference of Senate bills and resolutions, morning orders. Is there objection to the adoption of the resolution establishing the order of business for the day? Here, no one the resolution is adopted. First reading of bills and resolutions, the clerk will read.\n\nA green and 154th Bill being taught in active providing the future elections for the Office of Prope Judge and Baker County shall be nonpartisan. Intergovernmental coordination general House Bill 594 by reps and a green and 154th Bill be taught in act to men in that creating the board of commissioners of Baker County. Intergovernmental coordination House will 595 by reps and a green and 154th Bill be taught in act to men in act providing a homestead exemption from early county school district out Valarantax. Intergovernmental coordination House will 596 by reps and a cannon to the 170 second of Bill be taught an act to authorize the assessment collection of a technology fee by the state court of Colquit County. Intergovernmental coordination House will 597 by reps and a ton of 2G the hundred and fifth McCollum of the 30th Scofield of 63rd Seaball 34th Scott of the 76th Bill be taught an act to men are due chapter 7 to the total 48 in the fiscal to Georgia 8 and then Tated relating the positionary competition exemptions and correlatives relative to income taxes. Ways and means House will 598 by reps and a Roberts 50 second Miller with a 60 second Kendrick's in 95th Scofield of 63rd Evans the 57th and others Bill be taught an act to men chapter 2 to the total one of the fifth go to Georgia annotated relating to persons and their rights. Public and community health House will 599 by reps and a ton of 2G the hundred and fifth black one of the 146 or one of the 30th airheart of the 36th silcox the 53rd Bill be taught an act to men are the 7th chapter 3 total 47 of the fish go to Georgia annotated relating to retirement allowances. Retirement House will 600 by reps and a Jackson the 68th McLean to the hundred and ninth. Holly the 116 Sanchez the 42nd Alexander the 66 and others will be taught an act to men total 34 of the physical to Georgia annotated relating to labor and industrial relations. Industry in labor House will 601 by reps and a Jackson 68th hour the 50th Mitchell the 88th Draper the 90th Sanchez the 42nd will be entitled back to a men are 4 chapter 11 a total 16 chapter 8 to total 35 and article 2 chapter 3 a total 38 the fiscal to Georgia annotated relating to dangerous instrumentalities and practices. Public safety and homeland security House will 602 by reps and a Fleming of the 114th pair to the 24th scog and is the 14th Carpenter the 4th Kelly the 16th and others will be taught an act to men chapter 1 and title 20 the fish go to Georgia annotated relating to general provisions relative to education. Higher education House bill 603 by reps and a very one of the 30th and a bill be titled that an act to authorize the assessment and collection of a technology feed by the probate court of banks County. Enter a governmental coordination House will 604 by reps and a Jasper is the 11th Cox of the 28th Tarvan of the 2nd Powell of the 33rd Ridley the 22nd a bill be titled an act to men chapter 2 title 21 of the physical to Georgia annotated relating elections and primaries generally. The government affairs House will 605 by reps and a limit in 98th ropers is 52nd and left in the 83rd bill be titled an act to men are to one of chapter 2 a title 31 of the fish go to Georgia annotated relating the general provisions related to the Department of Public Health. The Public and community hill House will 606 by reps and a limit of 98th and a lot of the 83rd bill be titled an act to men chapter 33 title 33 of the fish go to Georgia annotated relating the fair access to insurance requirements. Insurance House will 607 by reps and a limit of 98th and a lot of the fish go to Georgia annotated relating the public health public and community hill House will 608 by reps and a reach to the 140th hugely the 144th rise to the 39th Buckner the 137th Smith of the 138th bill be titled an act to a men and act creating the Miscogi County School District. Andrew governmental coordination House will 609 by reps and a reach to the 140th hugely public health public health public and a rich to the 140th hugely the 140 first rise to the hundred thirty ninth Buckner the 137th Smith 188.onte tell an act to a man chapter 44 title 36 s for the просто joining them for a later redevelopment posed and government affairs House will 60 eb a representing piece of hundred 40th weekend forty first rise. 139th Buckner the 137th Smith 130 eighth heavy tot Bill B. Todd, an act to amend chapter 44, title 36 of the EFISCO to George Annotated relating the redevelopment powers. Governmental affairs House Bill 611 by Repsund of Lumps, into the 12th, Hitchens, on 61st, Carper to the 4th, Anderson to the 10th, to Louch to the 167th, the Bill B. Todd, an act to amend Article 2, chapter 5, a title 12 of the EFISCO to George Annotated relating the control of water pollution. Natural resources and environment House Bill 613 by Repsund of Smith to the 18th, Jones to the 25th, four of the highs to the 157th, Hitchens to the 161st, Evans to the 57th, and others, Bill B. Todd, an act to amend chapter 5, a title 50, the EFISCO to George Annotated relating the Department of Administrative Services. Governmental affairs House Bill 614 by Repsund of Jones to the 47th, Thomas to the 21st, Martin to the 49th, Bill B. Todd, an act to amend Code Section 2510 to the EFISCO to George Annotated relating the prohibited fireworks activities. Agriculture and Consumma affairs House Bill 615 by Repsund of Petrie, the 166th, Evans to the 164th, Gilear to the 62nd, Hitchens to the 161st, and Jackson to the 165th, Bill B. Todd, an act to amend, an act creating the Chatham County Recreation Authority. Andrew, governmental coordination House Bill 616 by Repsund of Roman to the 97th, Fry the 120th, Holley the 116th and Barry the 56th, Bill B. Todd, an act to amend, chapter 7 to the 40, 80th, FISCO to George Annotated relating the income taxes. Ways and Mains House Bill 617 by Repsund of Roman to the 97th, Ridley to the 22nd, Lumpton to the 83rd, Apollo, 33rd, Campy to the 135th and others, Bill B. Todd, an act to amend, a title 46th, FISCO to George Annotated relating the public utilities and public transportation. Again, Consumma affairs House Bill 618 by Repsund of Campbell, the 171st, Bill B. Todd, an act to amend, a title 44th, FISCO to George Annotated relating the property. Judiciary House Resolution 367 by Repsund of McCoy A. The 102nd, Tarvan to the 2nd, Hugley the 141st, Reeves of the 99th, Williams of the 168th, Resolution proposing a members of the Constitution, so as provide the members of the General Assembly elected in 2028, and thereafter shall serve four year terms of office. Special rules House Resolution 368 by Repsund of Saints of the 180th, Work Hides of the 157th, Steven's 164th, Ballinger the 23rd, Townsend of the 179th, a resolution creating the Joint Study Committee on intoxicating, Kanan and Nibboloids in consumable hemp products. Agriculture and Consumma affairs Senate Bill 13 by Senator Summers of 13th, Tillery the 19th, Alvers the 56th, Couser to the 46th, Robertson the 29th and others, a bill be taught on act to amend, chapter 23, a title 50 by the FISCO to George Annotated relating the Georgia Environmental Finance Authority. The Energy Utilities and Telecommunications Senate Bill 28 by Senator Dalles-Al, 27th, Kennedy the 18th, Gooch the 51st, Annan Varday, 31st, Robertson the 29th and others, a bill be taught on act to amend, titles 28, 31, 50th, the FISCO to George Annotated relating to the General Assembly, Health and State Government. Budget and Fiscal Affairs Oversight. Senate Bill 72 by Senator Brass, the 6th, Cropatric and 32nd, a title 27th, Strickland of the 42nd, Walker the 20th and others, a bill be taught on act to amend, chapter 52, a title 31, a bill be taught on act to amend, title 31, the FISCO to George Annotated related to determining ill patient's rights to try investigational drugs. He regulated industries. Senate Bill 125 by Senator Walker, the 20th, Sessler, 37th, Kennedy the 18th, Strickland of the 42nd, Brass, the 6th and others, bill be taught on act to amend, chapter 15 and title 43, the FISCO to George Annotated relating to professional engineers and land surveyors. SB 125 is going to regulate an industry, Mr. Clerk. Will you reread the caption of SB 72? Senate Bill 72 by Senator Brass, the 6th, Cropatric and 32nd, a title 27th, Strickland of the 42nd, Walker the 20th and others, bill be taught on act to amend, chapter 52, a title 31, a FISCO to George Annotated related to determining ill patients right to try investigational drugs. Held. Senate Bill 125 by Senator Walker, the 20th, Sessler, 37th, Kennedy the 18th, Strickland of the 42nd, Brass, the 6th and others, bill be taught on act to amend, chapter 15 and title 43, the FISCO to George Annotated relating to professional engineers and land surveyors. Regulated industries, thank you, Mr. Clerk. That completes first readers. Thank you members. Second reading is reading of bills and resolutions, the clerk will read. House Bill 566 by reps of hung of the 103rd, Jones of the 25th, Carpenter of the 4th, 5th, 120th, Gunter of the 8th and others, a bill relating to selling and other trade practices. House Bill 567 by reps of Jemcey, the 13th, Hatcher of the 150th, Hawkins of the 27th, Buckner of the 137th, Taylor of the 173rd, a bill relating to licenses for the practice of dentistry. House Bill 588 by reps of scogons of the 14th, Gamble of the 15th, the Bill Smoth rise, the governing authority of the city of Yeharlay, the 4th, Levy and X-Eyes, TACS, House Bill 569 by reps of Howard of the 71st and Warkhies of the 157th, the bill relating to employment security. House Bill 570 by reps of corporate of the 174th, per shot of the 176th, where the 6th, roads of the 124th, the bill relating to local government and state government. House Bill 571 by reps of Hawkins of the 27th, Jasper of the 11th, Dempsey of the 13th, Jackson of the 128th, Silcox of the 53rd, and others, a bill relating to assistance and others. House Bill 572 by reps of person of the 119th, the gains of the 120th, the frustration of the 104th, a bill to provide a new charter for the town of Praslton, House Bill 573 by reps of Stevens of the 164th, Sains of the 180th, Hawkins of the 127th, the bill relating to Medicaid, care management, organizations, House Bill 574 by reps of Stevens of the 164th, towns of the 179th, Hitchens of the 161st, Petrie of the 166th, Gillier to the 160th, Saka and others, a bill relating to applicability of workers, compensation to employers and employees generally, House Bill 575, by reps of McCallum of the 30th Jasper of the 11th, all of the 33rd, McDonald of the 36th, Hagan of the 156th, a bill relating to highways, bridges and ferries. House Bill 572, by reps of gains of the 120th, Ridley of the 6th, Dempsey of the 13th, Stevens of the 164th, Williams of the 168th and others, a bill relating to revenue and taxation. House Bill 578 by reps of Chocas of the 151st, Green of the 154th, Canada of the 172nd, Smith of the 18th, Mathes of the 133rd, and others, a bill relating to emergency telephone number 911, House Bill 579 by reps of Reans of the 99th, Hatchet of the 155th, we now have the 121st, Prince of the 132nd, Fleming of the 114th and others, a bill relating to professions and businesses. House Bill 580 by reps and bonds of the 86, Jackson of the 68th, Drenner of the 85th, Glades of the 67th, Alalien of the 59th and others, a bill relating to compensation, a cork curriculum under the Quality Basley Education Act. House Bill 581 by reps of Hagan of the 156, we now have the 121st, Canada of the 172nd, the old 79th, Smith of the 18th, a bill relating to alcoholic beverages, House Bill 582, by reps and contract of the 8th, Reans of the 99th, new of the 40th, Hong of the 103rd, Smith of the 18th and others, a bill relating to crimes and offenses, criminal procedure and evidence, House Bill 583 by reps and blows of the 67th, Hitchens of the 161st, Bonner of the 73rd, Canada of the 172nd, Newton of the 127th, a bill relating to license plates for certain veterans. House Bill 584 by reps and a P3 of the 166th, a DEMC of the 13th, Taylor of the 173rd, Stevens of the 164th, Lehoed of the 175th and others, a bill relating to food, drugs, cosmetics, health, and mental health. House Bill 585 by reps and a P4 of the 47th, Jones of the 25th, Martin of the 49th, Thomas of the 21st, Gaines of the 120th, a bill relating to insurance and motor vehicles and traffic, House Bill 586 by reps and a Williamson of the 112th, Blackwood of the 166, Williams of the 148th, Hatch of the 105th, Astration of the 104th and others, a bill relating to intangible recording tax. House Bill 587 by reps and a gamble of the 15th, Scotland of the 14th, a bill to amend and action, reincorporate the city of Carter'sville. House Bill 588 by reps and a Drener of the 85th, Canon of the 58th, a bill relating to general provisions regarding insurance. House Bill 589 by reps and a Drener of the 85th, Canon of the 58th, a bill relating to medical assistance generally. House Bill 590 by reps and a P4 of the 170th, per shot of the 176th, Corb of the 174th, McDonald's the 26th, wait hour of the 121st and others, a bill relating to professions and businesses. House Bill 591 by reps and a Guntrod, 8th and wait of the 9th, a bill to authorize the municipal court of the city of Cleveland to charge a technology fee. House Bill 592 by reps and a Guntrod, the 8th and wait of the 9th, a bill to provide a new charter for the city of Cleveland. House Bill 612 by reps and a Dremes of the 13th, Matthew Hick of the 82nd, Jones of the 25th, all over the 84th, Cooper of the 45th, a bill relating to general provisions regarding the administration of mental health, developmental disabilities, addictive disease, and other disability services. House Resolution 347 by reps and a Cox of the 28th, Jazz Resolution of the 11th, plays of the 67th, Douglas of the 78th, Canada of the 172nd, and others, a resolution urging all Georgia high schools to establish a flag football program for girls. Senate Bill 10 by Senator Goodman of the 8th, Strickland of the 42nd, Watson of the 11th, Summers of 13th and Kennedy of the 18th, a bill relating to the number of judges of superior courts. Senate Bill 12 by Senator again of the 47th, Proper's of the 29th, Summers of the 13th, six of the 45th, still the 48th and others, a bill relating to inspection of public records. Senate Bill 68 by Senator Kennedy of the 18th, go to the 51st, Robertson of the 29th, and in about say the 31st, walk in the 30th and 20th and others, a bill relating to civil practice, contracts, motor vehicles, and torts. Senate Bill 161 by Senator Hustetler, the 52nd, and Paine of the 54th, a bill to provide a homestead exemption from Gordon County School District, Advalorn, Texas, for educational purposes, through second readers. Thank you. Thank you, clerk. First reading the bills and resolutions, the clerk will read. Yeah, that first, right? Am I bad? All the noise I've lost my concentration, I'm gonna sit down and get it back. So, Mr. Clerk, will your report sustaining committees? Kriller, we'll read. Representative Robert Dick in the 134th District Chairman of the Committee on Agriculture, Consumer Affairs submitted the following report, Ms. Speaker, your Committee on Agriculture, Consumer Affairs has had under its consideration the following bills of the House, instructing the meeting reports, the same back plows and following recommendations, House Bill 495, due passed by substitute, House Bill 413, due passed, House Bill 331, due passed by substitute, respectfully submitted, Representative Robert Dickie, the 134th District Chairman. Representative Yeard, or the 150th Second District Chairman, the Committee on Code Revision submitted the following report. Ms. Speaker, your Committee on Code Revision has had under its consideration following bills of the House, instructing the committee reports, the same back to the House, and following recommendations, House Bill 484, due passed, House Bill 485, due passed by committee substitute, respectfully submitted, Representative Yeard, or the 150th Second District Chairman. Perhaps in a Chris Erwin, or the 30th Second District Chairman, the Committee on Education submitted the following report. Ms. Speaker, your Committee on Education has had under its consideration the following bills of the House, as he's talked to me to report, same back to the House, and the following recommendations, House Bill 307, due passed by substitute, House Bill 198, due passed by substitute, House Bill 340, due passed by substitute, respectfully submitted, Representative Chris Erwin, or the 30th Second District Chairman. Representative Victor Anderson, the 10th District Chairman, and Committee on Governmental Affairs, submitted the following report. Ms. Speaker, your Committee on Governmental Affairs, has had under its consideration the following bill of the House, as he's talked to me to report, the same back to the House, and the following recommendations, House Bill 416, due passed by committee substitute, respectfully submitted, Representative Victor Anderson, and the 10th District Chairman. Representative Hawkins, the 27th District Chairman, and Committee on Health submitted, the following report, Ms. Speaker, Committee on Health, has had under its consideration, the following bills of the House, and the struck committee report, same back to the House, and the following recommendations, House Bill 323, due passed, House Bill 54, due passed by substitute, House Bill 87, due passed by substitute, House Bill 428, due passed, House Bill 298, due passed by substitute, respectfully submitted, Representative Hawkins, and the 27th District Chairman. Representative Lobstin, the 12th District Chairman, and the Committee on Insurance, committed to following report. Ms. Speaker, Committee on Insurance, has had under its consideration, the following bills of the House, and the Senate, and the instructive, the meeting report, the same back to the House, and the following recommendations, House Bill 170, due passed, House Bill 373, due passed by committee substitute, House Bill 420, due passed, by committee substitute, House Bill 422, due passed, the Senate Bill 5, due passed, respectfully submitted, Representative Lobstin, the 12th District Chairman. Representative Beth Camp, of the 135th District Chairman, and the Committee on Intergovernmental Coordinations, have been at the following report. Ms. Speaker, your Committee on Intergovernmental Coordination, has had under its consideration, the following bill of the Senate, as the instructive, the meeting report, the same back to the House, and the following recommendations, Senate Bill 138, due passed, respectfully submitted, Representative Beth Camp, and 135th District Chairman. Vice President Gunner, the 8th District Chairman, and the Committee on Judiciary, is submitted, the following report. Ms. Speaker, your Committee on Judiciary, has had under its consideration, the following bills, and the House, the instructive, the meeting report, the same back to the House, and the following recommendations. House Bill 132, due passed, House Bill 270, due passed, by committee substitute, House Bill 304, due passed, House Bill 325, due passed, House Bill 427, due passed, by committee substitute, House Bill 530, due passed, House Bill 545, due passed, House Bill 358, due passed, House Bill 515, due passed, respectfully submitted, Representative Gunner, of the 8th District Chairman. Representative John Corber, to the 174th District Chairman, and the Committee on Motor Vehicles, submitted, the following report. Ms. Speaker, your Committee on Motor Vehicles, has had under its consideration, the following bills of the House, the instructive, the meeting report, the same back to the House, and the following recommendations. House Bill 296, due passed, by substitute, House Bill 204, due passed, House Bill 255, due passed, by substitute, House Bill 551, due passed, by substitute, House Bill 461, due passed, by substitute, House Bill 563, due passed, respectfully submitted, Representative John Corber, to the 174th District Chairman. Representative Sharon Cooper, of the 45th District Chairman, on Committee on Public, and Committee Health, submitted, the following report. Ms. Speaker, Committee on Public, and Committee Health, the Saturn, or its consideration, the following bills of the House, and the following recommendations. House Bill 296, due passed, by Committee, substitute, House Bill 500, due passed, by Committee, substitute, respectfully submitted, Representative Sharon Cooper, to the 45th District Chairman. Representative Allen Powell, 33rd District Chairman, on Committee on Regulated Industries, submitted, the following report. Ms. Speaker, Committee on Regulated Industries, and Saturn, or its consideration, the following bills of the House, and the Senate, and the Senate, and the instructor, to meet and report the same back, with the following recommendations. House Bill 296, due passed, House Bill 314, due passed, by Committee, substitute, House Bill 391, due passed, House Bill 455, due passed, and Senate Bill 81, due passed, respectfully submitted, Representative Allen Powell, 33rd District Chairman. Representative John Carson, the 46th District Chairman, the Committee on Retirement, submitted, the following report. Ms. Speaker, Committee on Retirement, and cited under its consideration, following bills of the House, instructor, Committee, report, same back, the House, the following recommendations. House Bill 416, due passed, by Committee, substitute, respectfully submitted, Representative John Carson, the 46th District Chairman. Representative Karen Mathy, act of the 82nd District Chairman, the Committee on State Planning, and Community Affairs, submitted, the following report. Ms. Speaker, Committee on State Planning, and Community Affairs, has added under its consideration, the following bills, and resolutions of the House, instructor, Committee, report, same back, the House, the following recommendations. House Bill 486, due passed, House Bill 516, due passed, by substitute, House Resolution 273, due passed, respectfully submitted, Representative Karen Mathy, act of the 82nd District Chairman. Representative Gerald Green, and the 154th District Chairman, and Committee on State Properties, submitted, the following report. Ms. Speaker, Committee on State Properties, the Senate under its consideration, the following bill, the House, and instructor, Committee, report, same back, the House, the following recommendations. House Bill 303, due passed, respectfully submitted, Representative Gerald Green, and the 154th District Chairman. Representative Shaw Blackman, and the 146th District Chairman, the Committee on Ways and Means, submitted, the following report. Ms. Speaker, Committee on Ways and Means, has added under its consideration, the following bills, of the House, the instructor, Committee, report, same back, the House, the following recommendations. House bill 6060 passed by Committee Substitute, House bill 129 due passed, House bill 144, new, past, House bill 18062 pass, House bill 229 due passed, by Committee Substitute,,, House bill 248 due pass, By Committee Substitute,,, House bill 297 due pass. House bill 370, Due passed, by Committee Substitute, House bill 425 due passed, by Committee Substitute, House bill 566, due passed, by Committee Substitute, House bill 445, due pass, House bill 290, Due pass, Also 165 do pass by committee substitute. House bill 463 do pass by committee substitute. Respectfully submitted, Representative Shaw Blackburn, of the 146 district chairman. Representative Shaw Blackburn in the 146 district chairman, the committee always means submitted the filing report, was speaking committee on ways of means. As that under its consideration, the following bill in the house has struck to me to report same back to the House and filing recommendations, House bill 360 do pass by committee substitute. Respectfully submitted, Representative Shaw Blackburn, of the 146 district chairman. That completes the reading of the reports of standing committees. Okay members, if you'll please come to your seats. Members, come to your seats. We have a lot of guests in the gallery. Some folks we want to recognize and honor. Members will please take their seats. Here is the dilemma. We have quite a few bills on the calendar today. We're going to work right on through lunch. So you might better snack, but we have 42 morning orders. Not quite, but almost. Pretty close. Pretty close. So here's our posture. You will have a maximum of one minute. But we do have 24 morning orders. And some folks here that have traveled great distances to be recognized and appreciated. So I hope everyone here will care about their neighbor. Y'all need to listen to this because it may be you who doesn't get to recognize your friends here. You have up to one minute. But if you take the list, that will allow someone else to have a morning order. Or there may be someone who doesn't get a morning order this morning. And it may be you. So I'll ask you to give consideration to your neighbor. And I'm going to give call up leader of station for a morning order and some friends. And I'm going to tell you who's on deck. That means you come on up to the front and be ready to go. So on deck will be representing a gullet, my to hand and friends leader of station. You're recognized for a morning order and recognize some distinguished visitors in the gallery. Thank you, Mr. Speaker. Well, good morning, everyone. It is Scout Day here at the State Capitol. We have Scouts from all over the state of Georgia who are here scouting us such an important program for our youth throughout the state. Members, if you would please join me, rise to give a round of applause for our Scouts. And Scouts, have you please stand as well. Thank you, Mr. Speaker. It's a great day to be a Scout. Thank you all for being here. We appreciate you. Ripley, Paris, your own deck. Ripley, gullet, my to hand and friends are recognized for a morning order. Thank you, Mr. Speaker. Members, today I rise and recognize two outstanding young innovators from Panther Elementary, Anna Borsch and Natalie Condner as fourth graders in their venture class. They participated in Georgia Tech's K-12 in venture-price competition where they developed grocery eyes and app designed to help visually impaired individuals navigate grocery stores independently. This actually won them an award in the Diversity Inclusion Specialty Award. We want to congratulate them. Please join me in celebrating Anna and Natalie for their ingenuity and hard work. Thank you all. You're right there. Thank you, ladies. Sounds like a great idea to me. Thank you for being here. And thanks to a lot of friends with them from Pauline County. Appreciate you all. Representative, Paris, you're recognized for morning order. Representative Lutton, your own deck. Thank you, Mr. Speaker. We're going to just for a moment. Thank you, members. Proceed. Thank you, Mr. Speaker. Today is also PACE Center for Girls Day at the Capitol. And they're here with us. Girls, we do show us where you are. There they are. Yay!\n\nBut if you'll give them a hand clap, the pace team of counselors and educators provide three year-round middle and high school academic services, counseling, life skills, training, career preparation, and more, developing individualized approaches based on each girl's unique strengths, life experiences, and needs. We just are so grateful for you all being here today. Rebecca Richards, we are so grateful for your leadership. Thank you all. Thank you, Representative. Representative, thanks to the pace group. Sounds like great work there to me, Representative Paris. Representative Lutton has recognized them. We will have the Augusta delegation will be recognized next. Representative Lutton and friends. Thank you, Speaker. I want to honor Gina Galwah. Today she is a children's author, language enthusiast, and wildlife advocate based in Shambley, Georgia. Hey, she publishes children's books in three languages, English, French, and Spanish. She's a former French professor and now blends education and storytelling to introduce young readers to misunderstood creatures, especially possums and nocturnal wildlife. She's passionate about conservation and neurodiversity. We are so glad to have her today. Thank you so much Gina for coming. And I've got a beautiful resolution for you. Thank you. Thank you for being with us. Thanks for recognizing that author, Representative Lutton, Representative Prince and the Augusta delegation, a very robust delegation. A greater Augusta delegation. Greater Augusta delegation. You're going to honor Augusta University, is that what you're doing? Yes sir, we're going to do. Good morning colleagues. Today's the Augusta University Day at the State Capitol. We're proud to be home of the home of the Medical College of Georgia, the fourth largest medical school in the country, the dental college of Georgia, the only dental school in the state of Georgia, and the Georgia Cyber Center. Along we also, along with Wellstar, a partner with our own hospital. Today we have with us our president, Dr. Russell King and his lovely wife, the first lady, Ms. Karen King. They're up in the gallery as they're walking in. Please wave at us and please give them a warm house. Welcome Augusta University Day. Go Jads. Thank you, Brooks. Thank you. Thank you. Welcome to our friends from Augusta. It's good to see you all and y'all have a little medical school there I think too. Is that correct? And a great university. Thank you for what you do for our state and we're proud y'all are with us today. Thank you, President Kenis. Congratulations. I think since you've been here, you've been anointed as a president, I believe. Is that correct? Absolutely. We're proud of the work you've been doing and the work you're going to do. Representative Camp. Recognize and friends. Recognize for a morning order and represent your miles your own day. Thank you, Mr. Speaker. I stand here today with Chairman Ballinger honoring George Acosta. It is an honor to stand before you today and come together to support one of the most vital missions of our state advocating for the well-being in future of George's most vulnerable children. Cost of volunteers and staff playing a central role in ensuring that children and foster care have a voice, a champion and a guiding light in their journey towards stability and hope. The work of George Accord appointed special advocates or Cosa is nothing short of life changing. Every day, Cosa volunteers step forward to be the voice of a child in court ensuring their best interests are not only heard but prioritized. If you will join me in welcoming George Acosta, they should be up in the gallery. Thank you for all you do. Thank you. Awesome group doing awesome work. Thank you all for what you do at Cosa. I want to call this see. Just recognize Rift and Clifton and the Augusta delegation. This is a great Augusta day. Rift and Clifton. Recognize you and some friends come to the recognize from morning order. And then we're going to have Chairman Hawkins and Newton. Thank you, Mr. Speaker. I'd like to recognize greater Augusta today. This is a day that the leaders of the industry and our community come up to the capital to meet with representatives, understand what's going on and make sure we know it's important to them. I want to recognize our commissioners and the Augusta and Columbia County area. Also recognize Mayor Garnett Johnson and Doug Duncan, the chair of the Columbia County. This day means a lot to me. I came up multiple years in a row and last year it was on this day that I started the thought of running for this office, something that I've thoroughly enjoyed and been very happy to be a part of. So thank you very much. Awesome. Great day. Thanks for being here with us. Oh, sorry. If you will, Mr. Speaker, if you will find a gift on your desk, if someone hasn't already taken them from you, a master's hat because we have the best golf tournament in the entire nation. Thank you. Good job. There he is. There he is. Thanks. Thank you. Representative Miles, I apologize. I wanted to call you while you're up here. So representative Miles, if you'll come back up and let us hear your morning order and be a good time right now. Is that good? Would you, sir? Absolutely. Let's hear you. General's recognized. Representative Martinez, your own day. Good morning, colleagues. Today we celebrated a woman that was more than a voice. We celebrate she was a visionary. She was a force. She was a testament to what's possible when talent meets purpose. She encouraged me to opportunity and with someone who dares to dream beyond limits before them. Justin Norman was born in the city where I served as representative of Gus at Georgia. Her voice belonged to the world. She wasn't just an opera singer. She was an artist, a storyteller, and he beacons excellence. When she stepped on to the stage, she commanded it. Not just with a voice, but with her presence and with her dignity and with her unshakeable belief that she belonged. And that was her gift to us. Justin Norman just showed the world where she could do. She showed the world where we all could do. She remained everyone. Every child sitting in the church choir, every young person that dreamed of bigger than their circumstances, that greatness was there within reach. Thank you. Thank you. Appreciate it. Okay. Thank you, sir. Thank you, sir. Thank you, man. Okay. All right. Wrap it up pretty quick now. As I said, hug great. All right. Let me excuse me. I can't, I can't, I can't go up to there. When she stepped on to the stage, she commanded it. Not just with a voice, but with her presence. With her dignity and with her unshakeable belief that she belonged. Right there is the greatest gift she left all of us. Justin Norman did not just show the world where she could do. She showed all of us where we could do. She remained every child sitting in a church choir, every young person, daring to dream bigger than their circumstances, that greatness is within reach. She showed that her beginnings, that our beginnings, are not defined by any of us. That talent when nurture can break walls, cause compliments, and touch souls. She didn't just stop with her success. We got to move on, so have sipping and finding any spot here, okay, please. Okay. She couldn't just stop with her as a sis. Yes. She. To sis. Today. We thank you very much. And I appreciate you celebrating Justin Norman from Augusta Georgia. Thank you very much. Absolutely. Nice job. Thank you for doing that. A lot of good people came out of Augusta. There's another one. Chairman Hilton, you're recognized for a morning order. Hey, you Mr. Speaker. Ladies and gentlemen, today is Charter School Day at the Capitol. Charter Schools. There are 110 schools here in Georgia serving over 67,000 students. They are in high demand. We have over 21,000 students who are in wait lists across the state. The beauty of Charter Schools is they receive less funding, more flexibility, and achieve higher results. I want to highlight two Charter Schools in my district specifically, International Charter School of Atlanta, and the International Charter Academy of Georgia. I think the students up in the gallery here. Look at them. That is awesome. These students learn French, German, Mandarin, Chinese, Japanese, immersion, and they are rock stars. Can eat you all. Thank you. Good to have you all. Chairman Tarvan and Ripley Hooner are recognized for a morning order. Chairman Chauke is your own day. Thank you Mr. Speaker. We have a very sping just for a moment. That's a good folks who travel to be here. So give the gentlemen both gentlemen in the well, your attention please proceed please. Thank you miss speaker. We have a very special group here today. They've got a dose of what being that line is like left home at six o'clock and they have made it to the galley five hours later. We would like to welcome Superintendent Chance Nicks from the Ktoos County Schools, Assistant Superintendent Dr. Butler and the Superintendent's advisory board, a very special group of kids and I want them to stand up because they're very special our group. Thank you very much. Thank you very much. Thank you, Representative. Mr. Superintendent, no one of you doing such a good job with an advisory board like that. So welcome to the Capitol. We're glad to have you all. Thanks for making effort to be here. Chairman Chokers has recognized for a morning order. Thank you, Mr. Speaker. It is indeed a pleasure to get to welcome the Marion County High School AP government class. They made their trip to the Capitol this year and they're accompanied by principal Goodrow and star teacher James and are accompanying the students. So if y'all would stand, we can recognize you guys. There they are in the top left. Go Eagles. Go Eagles. I also have the opportunity to recognize the association of Georgia General of Aviation Airports. Thank you. There are 95 general aviation airports in Georgia and they're essential to the state's transportation and economic infrastructure. They're the backbone of the industry and they provide over two billion dollars to the state in revenue. Our economic impact. I'm sorry. Joining us representing the airport. So I hope my caluso Mario Evans, Amber McCall who's the president and Nate Shatner, Blue Skies. Blue Skies. Thank you. Thank you, Mr. Speaker. Thank you. All you pilots, Blue Skies, no doubt. Chairman Hawkins and Chairman Newton recognize for a morning order. Thank you. Thank you. Thank you. Y'all know who's going to speak. Making sure we're speaking on the right thing. That's important as well. General recognized. Thank you, Mr. Speaker. Representative Dr. Newton and I here to recognize the trauma commission and the trauma folks that are visiting at the Capitol today. Can y'all stand up? We got some right there. Thank you. I think as we all know, Trump is a leader. He calls the death. But that was under the age of 45. Yeah. The trauma also includes injuries from accidents, violence and national disasters. We'd like to recognize these highly trained, highly qualified people who give so much to save the people of Georgia. And the resolution ends up with this comment. Therefore, let it be resolved that the House will represent the state of the state. And the resolution ends up with this comment. Therefore, let it be resolved that the House will represent as recognized and command the Georgia Trauma Commission. And the Georgia Trauma Foundation has a recognized day of the February the 26th, 2025. Congratulations. And thank you. Thank you. Appreciate that. Morning order. Representative Dawson. Representative Dawson is recognized for a morning order. Thank you. Speaker, thank you colleagues. Today I rise to welcome young scholars from the Co-decider Intern and Leadership Program. This program provides real-world experience for personal growth. I don't know if they made it to the gallery yet, but I'm not. We'll be having lunch with them later on. I love the concept of giving young people a co-decider to help them with some of life's tough decisions. I've also admired what Representative Fry does. I don't know if you guys have heard the rumors, but there's quite a bit of entry under the gold dome because my interns, they sent me down. The conversation went something like this. Okay Dawson, you're the face of this operation. Are you not the face of this operation? We're the brains. I say all this to say that we have to spend time with young people. And it's important that we pour into them so it's good to have these mentees and audience today. Thank you very much. Thank you. Thank you. Thank you, Dr. Wilson. Welcome to those folks you just recognized. We're representing Jackson, recognized for a morning order and friends. Thank you, Mr. Speaker. Ladies and gentlemen, we are honored to have the Georgia Minority Supplier Development Council here. They're standing right over the air. With us today to commemorating remarkable milestone of 50 years, Mr. Speaker of Foster Economic Growth and Empowerment in Georgia, which also helps us to become the number one state to do business. And we also have the Southern Crescent Women in Business, Founder, Ariel Shaw, and Group. And with that, thank you all for being here. Thank you. Thank you, Mr. Jackson. Good groups. Appreciate everything y'all both are doing to make our state continue to be number one place. We really appreciate that. Representative Donna, who recognized for a morning order. Oh, this is a good one. Y'all pay attention to the gentleman in the well. And Mr. Halkins. Chairman Halkins. Well, I think we're going to talk about an area that's important to you. I think that's where you come from. Don't you live in Hall County? But this is a good one right here. This cross country between you and Representative Donna, who, but you're supposed to get there. Gentlemen, recognize. Thank you, Mr. Speaker. We stand before you the day. I'm going to say that we're going to be the first time in the history of North Powell High School. Every year it seems like we're privileged to bring North Hall high school or middle school down. And they win the state championship overall. North Powell middle school has won it three years overall in a row. And the high school girls this year, the first time in the history of North Powell High School won the state championship girls. The reason was a historic and record breaking year for North Powell High School, highlighted by the girls team winning the GHSA Class 3A State Championship. The first ever girls state title in any sports and schools history. The North Powell girls secured the championship in the dominant fashion, placing five runners in the top 14th at the state meet. The senior Cloderol Bryant earning the individual state championship title. And after an outstanding career of four time region champion, the school record she has in the 1600 meter in the 32. And the girls team saw additional all state performances from Summer Mucklow, who finished second, Harley Smith, who finished fifth. The North Hall boys were runner up where senior Bryant and young was third in the state. And then we bring in the rest of the team as they hopefully are here now. Traffic was terrible. And the middle school we have Russ Crane and Sam Borger. Are you here North Powell High School? And if not, would you say please stand up. I know they're outside the door. We've been trying to logistically bring them in. But give them a hand and for accomplishment, I thank you very much. And then that's it. Congratulations team. I just want to add a few names for the middle school, channel of shows, be hunting Hunter Morrison, Hudson Webb, Isaac Borr, and especially their coach Russ Crane. Thank you Mr. Speaker. The representative train is recognized for a morning order. Thank you Mr. Speaker. If I could ask the Dunwoody High School Youth City Council to rise, I'd like to recognize them for the impactful work they've done in our district. Thank you Mr. Speaker. Thank you Representative. That's a model everyone should follow right there. Welcome to the People's House. Representative Williams and Representative Deloche recognize for a morning order. Thank you Mr. Speaker. From the land where the water tastes like cherry wine. We have with us today some representatives with the Chamber and with Fort Stewart. We have Chairman Donald Lovett. We have his Brin Grant, who is CEO of Libby County Development Authority. Chamber Chair Ms. Burris. Derek Roja, who is CEO of our hospital and Ms. Leo Poole, who is the CEO of our Chamber. And certainly we have representing Fort Stewart, Mr. Auler and Ana and Mr. S. Steven Hood in Christopher Fletcher. A representing third ID. Will you all stand and let us welcome you to the House? And if you're already left, you will not get another drink. There you go. You get the cherry wine. Rock of the Maard. Rock of the Maard. Thank you Mr. Speaker. Will you LaWelle? Members, we just recognize. Thank you. Good to have you all with us. We just recognize the North Hall Cross Country team in the middle school and high school. So they just made it into the Chamber. Let's give the North Hall Cross Country team a big round of applause and congratulate them on their success. Good to have you all. Thanks for being here. We represent the Reese. We lost him for a minute. Cheer, ladies and smith. Recognize for a morning order. Thank you Mr. Speaker. If the Cowie to delegation will join me please. Good morning. If we're here today to recognize. Representative Glaze, we're looking for her team. But where your Cowie to County delegation? It's making to Northside Elementary School that's in the balcony and y'all can stand while we just welcome you. Northside is one of our oldest elementary schools. It's one of the schools with the pre-K program. I love going there every year, reading to the students and being part of the program. Thank you for making the trip up here and we hope you have a very knowledgeable day. Check on the two headed cow and the two headed snake. It'll be a good day. Thank you. Chairman Carpenter, recognition morning order. All right folks, two things. I'm going to spit it out pretty quick. Welcome leadership Dalton Whitfield. If you're in the balcony, please stand. Thank you for being here today. Appreciate the program that our chamber puts together every year to bring folks down to the Capitol. And the second piece of the day is today's Georgia Restaurant Day at the Capitol. Not a bad day to take up a cornbread bill. It's a $30 billion industry, over 500,000 jobs statewide. There's over 23,000 restaurant establishments. There's many of them like myself that are independent. They make your neighborhood great. They make your waistline bigger. And they make your people agree. Thank you. Representative Carla Drenner is recognized for a morning order. And friends. Thank you, Mr. Speaker. Can all the members of the DeCab House delegation join the representative Drenner down front? Good morning everybody. And thank you, Mr. Speaker. I'm honored today to stand. To stand with my colleagues to celebrate DeCab Day at the Capitol. Many of you will know that DeCab serves as a hub for healthcare and scientific research, housing the centers of disease control and prevention, memory, healthcare, and children's healthcare of Atlanta. We are joined today by the presiding officer, Michelle Long Spears, Super District Commissioner Ted Terry and Super District Commissioner Ladina Bolton. I've noted significance today. Under the historic leadership of CEO Lorraine Cochran Johnson, the first African American woman elected as Chief Executive Officer of the Cab County. Please welcome them to the House and join us in the Ritunda. Thank you, Mr. Speaker. Thank you, Representative. And welcome to the House. The Cab, if you all will come around this side, you can join us in the South Any Room and members may want to get some photos with you. Come all the way around. Good to see you there. See you. Representative Reese. Representative Teddy Reese is recognized to recognize a group here today with us. Representative Reese. Thank you, Mr. Speaker. I have with me here, members of the Columbus delegation. We do want to recognize a group of students that we have here today from Columbus State University. I don't see them in the gallery. They have to go down to be with the governor. But we have students from our political science and criminal justice majors here with Professor Dr. Kenner, as well as Professor John Lester. We want to thank them for their interest in what we're doing here at the People's House. And if you will, you guys just get them a round of applause, please, in their absence. Thank you. Columbus State, a fine, fine institution. We appreciate them. Representative Angela Moore, to recognize for a morning order. Then, Representative Rice, your own deck. Thank you, Mr. Speaker. colleagues, please join me in welcoming to the House of Representatives and the Georgia State Capitol, the National Association of Black Women in Construction. They actively, there they are up there. They actively engage in the community in service projects to improve the lives of the underserved communities here in the metro area and across this great state of Georgia. They are the Atlanta chapter. If you will help me, welcome them. And I will meet you all on the third floor for pictures. I yield the well and thank you. Thank you and welcome appreciate what y'all do as well. Representative Rice, the one we've been looking for, is recognized for a morning order. Good morning. Many of you know how close foster care is to me. Today we've got a great organization representing 16 different community homes of foster care. If you will please stand. We have a few of their representatives. Thank you for what you do for our state and for our children across our state. Members, we're ready to move on to the rules calendar. We have some work to do and we're going to get to it. Mr. Clerk, were you ready to capture the house bill 115, 115? House bill 115, I represent a P3, the 166 and others to be titled to amend chapter 7 and title 52, the official go to Georgia and tentative relating to registration, operation, sales of watercraft, so to provide for certain notice upon registration of a vessel with the Department of Natural Resources. This bill I'm referred to the committee on game fishing parks. That committee recommends a disbilled do pass by committee substitute. I'm in Petri's recognize to present the bill, Mr. Chairman.\n\nBigger ladies and gentlemen bring you today what was House Bill 957 last year House Bill 115 now we're gonna get a photo for you up here I hope in just a moment this bill passed last year went through here went through the Senate was ready to go on the floor of the Senate and failed to get out in time this bill very simply addresses a big issue on the Georgia coast and if y'all just look here you'll see just a few photos of what we're dealing with down to Georgia coast today we have got right now in Georgia about a hundred and fifty nine abandoned vessels on the Georgia coast about thirty eight on Georgia lakes for those of you in the northern part of the state and these are folks that irresponsibly literally just abandoned sometimes purposefully sink vessels in the water and leave them for us to clear up because they have no no longer have any value removing these vessels cost anywhere from thirty two to forty two thousand dollars that that cost is born on taxpayers if we have the money to do it and lately we haven't which is why we have a hundred and almost a hundred and sixty of them floating around the coast in my district two years ago uh... and we have several of these in my district quite a few one of them uh... they're oftentimes floated down from other states and so I had one in my district that was floated down here from New Jersey and just abandoned and it allowed to float off into the sunset the challenge is DNR does not have the tools to hold people accountable and that's what this bill does miss the speaker and so here's what we do if you look at this measure you will see that we've created a path for for discovering who who owns these vessels ensuring they're not stolen and then holding them accountable and you'll see in here we have a misdemeanor behind aggravated nature uh... for this practice as a first offense it further allows uh... you know uh... revoking boat vessel fishing licenses and even drivers licenses for those chosen pursue this path so uh... miss miss the speaker since we've dealt with this last year i'm going to keep it simple uh... and i'm glad to answer any questions but we're trying to end this practice we have only one time in history DNR tells me been able to hold anybody accountable for this practice and that's why it continues and so they've asked for the tools to fix this and that's what we're giving him here in with this measure thank you miss the speaker you will know you'll for a quick question the magazine chast can't hear right has a question famous figures the gentleman yield yes or are you just curious are there any imported shrimp on these abandoned vessels i hope not i'd be even fiery in this conversation gentleman has no further questions thank you miss the speaker let's hope uh... we can pass this back out and will send it back across the building maybe we can sing this for good and get dn rsum help here is there an objection the gentleman's yielded the well is there an objection to the previous question being ordered hearing none of the previous questions ordered is there an objection to adopting the committee substitute hearing none the committee substitute is adopted is an objection to agree to the report the committee which was favorable to the passage of the bill hearing none the report the committee is agreed to shout this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and mr. clerk will you unlock the machine yes yes i thought that's the one you're going to hold oh i thought it was too late to watch this have all members voted all members voted all members voted if so the clerk will lock the machine on the passage of house bill one one five one fifteen the yeas are one sixty four the nays are zero this bill having received a requisite constitutional majority is therefore passed mr. clerk will you read a caption to house bill two hundred and eight two oh eight house will two oh eight by rips and have smith the seventeenth and others to be entitled not to a man code section forty two eighty six of the official to George annotated relayed the license plates promoting a supporting certain agencies funds are nonprofit corporations this bill ever for the committee emotive vehicles a committee recommends that this bill do pass by committee substitute represent the bill in smith is recognized to present the bill cheerlead smith thank you mr. speaker and members of the house a bridge you today house bill two oh eight it creates four new license tags to explain to you the wonderful advertisement that these license tags do for Georgia it is a way to promote our state in every way and in this particular set of license tags you're gonna like what we have for you to look at so for the first plate is for the Georgia state parks and we all have parts are near part that we dearly love in our state the second time is for something called the bass tag by bass tag something about the world we're now fish caught way back when the very popular uh... and this goes to the protection of the environment for the for the bass fish and which also brings several several hundreds of people to Georgia the next two taxes as this bill was moving through the process two more tags were added to it one is for the shepherd center and for those of you who are not familiar with the shepherd center take a moment and think of where chief of staff Terry England is right now he's at the shepherd center this is an organization that would a bit and you know a practice a hospital that was for those who are disabled and it's in Georgia and it is very well renowned and known and then the last tag will be to support our veterans and their families and so all four of these tags first of all go to the go to foundations but they also give us a great way to promote and let everybody know we've got the best state in the united states of thank you mister speaker lady has no questions thank you let's get this car passed thank you it is any objection to the previous question being ordered chair has done the previous questions ordered is any objection to adopting the committee substitute here in the committee substitute is adopted is any objection to agree to the report of the committee which was favorable to the passage of the bill here in the report the committee's agreed to shout this bill now passed all in favor of the passage of the bill will vote yes all those opposed will vote no and mr. clerk will you unlock the machine have all members voted slow down now All members voted if so, the clerk will lock the machine. On the passage of House Bill 208, the Yays are 167, the Nays are 0. This bill haven't received the requisite constitutional majority. Therefore, passed. Mr. Clerk, will you read the caption to House Bill 172, 172? House Bill 172, my representative, Huddleston of the 72nd and others being titled next to amend. Part 6, day of article 7 of chapter 3, title 20, the fiscal to Georgia and it's related to state veterinary education. So it's to provide for limits on the student loan forgiveness program. This bill I'm referring to the committee on higher education that committee recommends that this bill do pass. You ready? Representative David Huddleston is recognized to present the bill. Thank you, Mr. Speaker. Thank you to the House members. I'm honored to come before you today with House Bill 172. This is the bill that I brought before you last session that passed favorably out of the House, made it all way through Senate rules to the floor and never got called up on sunny day. Basically, this is an existing program that started back in 2016. And like I said, as I mentioned, last year basically, Georgia is in a dire need for large animal food industry vets. So like I said, looking in within this program, basically this program is allowed for any graduate student and anybody that's been served or practiced in veterinary medicine 10 years or less. The maximum loan amount is presently at $80,000. We want to increase to 90 instead. It raises the annual loan purchase from $30,000 annual payment per applicant. This expands eligibility of service area to rural counties of population. 50,000 or less. This is from the 2020 census and it was originally at 30,000 population as less. This will allow 118 counties in state of Georgia that these veterinarians can serve. They can be residents within a county above 50,000 as long as they're well in the serve, large animal practice in those rural counties. And basically within that is a requirement that they have to serve at least 20 hours a week in large animal medicine. Basically, this was a one year program. We're looking at basically instead of having to reapply each year, once you apply, it would be a term of three consecutive years. And we clarified some language that said it shall not be necessary for the contract in Roli to reapply after entering into a contract provided. However, there will be a board may be required to contract to Roli to provide annual certification to continue compliance. So basically that's mean that we just want to make sure that they are serving in those rural communities. And by serving for three years, what we're kind of hoping is we get those individuals that serve in those rural communities after three years, they may kind of create yourself and decide to stay in those rural areas to serve. Will that Mr. Speaker, that's the bill now staying for any questions? Gentlemen has a couple questions, relative to remind, on the center out to your left. Thank you. I recognize for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. So why, I'm just curious why it says for those who have been practicing ten years or less, like what was the thinking behind that? Basically, like I said, you get to think in there within the number that may be coming out. Basically, the incentivization of getting those practicing, it'd be like if you practice less than ten years in a community that you can might say, okay, I'm willing to go serve in that rule so it'll allow you to be an applicant to serve. Gentlemen, do you live representing the spits of fries? Recognize for a question. Does gentleman yield? Yes, sir. Isn't it true that we, at one time in the past couple years, only had about four or five students within the large animal veterinary program, pathway? I'm assured the gentleman knows the speech, and I know that basically within that, I think only about 12% comes out from mixed animal practice. Absolutely. And it's also true that this is going to help our farmers grow cattle and grow food for the state of Georgia, and that's what we need right now. Absolutely. As I stated last year when I was in the well, our Department of Ag Commissions says food security is national security. Thank you, sir. Thank you. We're representing Dickie. Chairman Dickie, to your right, is recognized for a question. Thank you, Mr. Speaker. Is gentleman yield? Yes, sir. I'd like to follow up on that previous statement. Appreciate your efforts in this. It's vitally important to our farm economy to get more large animal vets. We're desperately short. So thank you for this bill. Thank you, sir. Mr. Speaker, will that be in set? I yield the way. Gentlemen, yield of the well. We just need to vote again to show the Senate that we care about. We have a very ordinary medicine, so let's do it again. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. This bill now passed all in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. Mr. Clerk will you unlock the machine? Have all members voted for what purpose is representing Barnes rise? Parliamentary inquiry. State inquiry. Is it not true that this bill will expand access and create a pipeline for our veterinarian, sciences veterinarians? Absolutely. That's the purpose. Thanks for the question. Have all members now voted? All members voted. If so, Mr. Clerk, will you lock the machine on the passage of House Bill 172? The yeas are 164. The nays are four. This bill has been requested at Constitutional Majority. Is therefore passed. Mr. Clerk, will you read the caption of House Bill 222? House Bill 222, by resident of Blackburn and the 146 and others to be entitled back to a men arc 3H6, total 17 in the fiscal to Georgia and Tenderly in bonds and criminal proceedings. So it's required the inclusion of certain contact information on such bonds. This bill 11 for the committee on. Would you share that committee recommends that this bill do pass. Thank you, Mr. Clerk. Chairman Blackburn has recognized to present the bill. Chairman Blackburn. Thank you, Mr. Speaker, fellow members. Bring before you, House Bill 222 at the request of our clerk back home. This would add some additional contact information for the principal and the surety and court proceedings. I think the intent being that it would improve communication, improve communication between the court and these agents. I'd be happy to stand for questions. You have one question, maybe two. You take as many as you want. Representative Jasmine Clark to your left has a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. All right. Thank you for the bill. Just very quickly. Line 12 specifically says legible. So I'm assuming that this is handwritten. Is that how that works? I would think in case it is, yes, ma'am. Does the gentleman further yield? I'll try to. It's friendly. I promise it's not a gotcha question. I'm just really trying to understand who decides if it's legible enough or not in this instance. Are you just saying not curse it? Like exactly what does it mean for it to be legible? Because it's written in law and I just want to make sure that people understand exactly what they need to do. Yeah, I'm assuming that as long as it's readable by the parties that need to be able to read it. And that is probably the best answer that I could give you. Ma'am, representative. Thank you for the question. Thank you. Mr. Chairman, it might mean that a doctor didn't write it because you can't read anything, right? But we'll move on from there. Representative Smith, Tyler Paul Smith to your left is recognized for a question. Does the gentleman yield? To the chairman, I do. Yes, sir. Is it not true that this bill ensures more efficient communication by requiring a comprehensive contact information being provided on these bonds and recognizes? I believe the gentleman knows what he speaks and that's the exact intent of the bill. Yes, sir. And would you further yield from one last question? Yes, sir, Mr. Chairman. Wouldn't we solve the whole problem of legibility by just printing with a manual typewriter or even a computer over that page? I'm sure that would. Yes, sir. Thank you. Gentlemen, has there further questions? All right. Well, I would thank you. This thank the spot for their consideration and yield the well. Thank you, Mr. Chairman. Gentlemen, yield the well. Is there any objections to the previous question being ordered? Here in none of the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none of the report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Please. Have all members voted? All members voted? Yes, so Mr. Clerk, will you lock the machine on the passage of House Bill 222? The yeas are 169. The nays are a zero. This bill, Henry C, the requisite constitutional majority is therefore passed. Mr. Clerk, would you read a caption to House Bill 308? 308? House Bill 308, by the reps, and a clifton of the 131st and others to be entitled. Back to amend, title 40, the fiscal to Georgia and the Senate are relating to motor vehicles and traffic. So it's to provide for the operation of miniature on-road vehicles on certain highways. This bill I'm referring to committee on motor vehicles. That committee recommends that this bill do pass by committee substitute. You ready, Representative Clifton? No pressure. You have all your family here in the House and you have all your family back home here today. Let's see what you got. The repressions, Clifton's recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, the House, I know we have, I know we have a lot of bills today, so I will be short and sweet. As you see right here in a picture, this is a mini truck and this is the mini truck bill. So essentially there are a lot of trucks you may see driving around. They're American made, that is not currently the issue, but there are a lot of imports that come in. This bill allows trucks over 25 years old that have been imported into the state to be driven on county and municipal roads. That we're not going to highways, we're not going to interstates. Essentially we are treating this very similar to the way we treated side by side, believe last year. The Department of Revenue has decided they wanted to treat this from a tax purpose as an antique. So every year these will be evaluated at $100 and you will pay an annual fee of the $100 valuation times your milled rates. Again, I promise I'd be short and sweet. So with that, Mr. Speaker, I'll stand for questions and please go easy on me. I don't know about that. You have a lot of questions. Some more questions than we had morning orders. That's hard to believe. I know. Representative Gamble has a question. I think he has one of these vehicles to your right up the aisle. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. On line 151, it talks about operating a low-speed vehicle and inserts miniature on-road vehicle. Would this apply to a hot wheels or matchbox truck? No, sir. It only requires the vehicles that are internal combustion engines. Okay. Thank you for clarifying. Yes, sir. I know this gentleman owns a couple of these. Chairman Weedauer, to your right, is recognized for a serious question. Does the gentleman yield? Yes, sir. Your first bill. Yes, sir. You took a lot of time preparing for this today. The most time I've prepared for any bill so far. Okay, sir. You further yield? Yes, sir. So just curious in all this time that you spent, I know it's Monday. Were you somewhere preparing for this bill? Because I didn't see you on the floor. Yes, sir. I was mentally preparing. Need to take a little time off to get my head in the right space. And there's a few ways that I can do that. And that's exactly what I was doing Monday. Well, I hope you weren't too sick because you look much better now. Well, I feel great, sir. Thank you. Okay, good. Glad you're back. Thank you. I know this is a good question. Do you represent the Montaghan to your right in the rear has a question. I know he has one of these trucks. Well, thank you, Mr. Speaker. Does the gentleman yield? As long as you don't say the same joke you did last time, absolutely. I do, Mr. Speaker. Thank you very much. Call them out, brother. We'll get to the bottom of this thing in a minute. Reps things, stints. Now, I want to know about this. I bet you use these in your business. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Isn't that true that I own a hearse that's over 25 years old. So can my hearse be a part of your legislation to be considered a antique? Is your hearse under 4,000 pounds? I don't think you want to answer that, brother. I'm waiting. You can, though. Go ahead. I believe you have to take that up with the Department of Revenue. That is why we have an amendment here on how they wanted to treat this. So you might have to take that up with them. I certainly will. Thank you. Thank you for your work on this legislation. I think a gentleman had something with this bill moving forward, Chairman Corbett. Is it coming out of your committee? It did, sir. This here about it, then. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. And I apologize for not asking this, but it came through committee. But line 221, when you look at that for me, it says all laws and parts of laws in conflict with this act are repealed. What laws are repealing? And I apologize for not asking in committee. That is a great question. And I will have to get back to you on the answer to that. Thank you. You can't make this stuff up. You came from your committee, didn't it? Okay. Just checking. Reps. Air. Air heart is recognized for a question. Thank you, Mr. Speaker. Will the gentleman yield? Yes, ma'am. Representative, is it not true that to the best of my knowledge, you and I may be the only two members of this body that are graduates of the esteemed Auburn University? Or ego and I would like to add, we are seven weeks running. Number one in basketball. Will you further yield? Yes, ma'am. And as a result of my knowledge of the stellar education that you received at that finance institution that I have absolutely no doubts about HB308 being equally important to the citizens of Georgia and have full confidence in your ability to carry this bill and that it will be the best possible bill we could carry. Yes, ma'am. I think you for that. Mr. Speaker, I know we have a lot of bills and I'll be more than happy to ask answer more questions unless it's time for me to yield. You have one more, you have a couple more but I'm going to recognize one more if you'll take it. Absolutely. To your extreme right, Representative Ridley, president Jason Ridley is recognized. Can I take that back? Hey, you can refuse the question. Does gentleman yield? Against my better judgment, yes sir. You probably sparn on that, ma'am. You said that the Department of Revenue considers this an antique and it's a miniature truck, right? That's correct. Over 25 years they would like to consider this an antique. So under the Department of Revenue by doing this does that mean that my sleepmate from 138th will now be considered an antique in a miniature? Does he get a tax break? I'm not sure of everyone's age but I'd like to thank pretty much all of us in this room or antiques at this point, ma'am. You should have followed your better judgment and refused to take that question. Mr. Speaker, with that I would like to yield the well. You may do that, the sole progative, yes sir. I ask your final job. Ask for favorable consideration. Thank you very much. The gentleman has yielded the well. Is there any objections to previous question being ordered? Here he none the previous question is ordered. Is there any objection to adopting the Committee's substitute? Here he none the Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee which was favorable to the pass to the bill? Here he none the report of the Committee is agreed to. Shall this bill now pass on in favor of the pass to the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machine? Have all members voted for what purpose is represented Martin rise? Portland Minister inquiry, Mr. Speaker. Is this about college athletics? It might be yes sir. Against my better judgment. State your inquiry. The gentleman wasn't looking good there for a minute and I was going to offer to table the bill. So he could get all the other people from Auburn that drive those many trucks away here. To help him out. Will that works out? Will that works out of all members voted? All members voted this so. Mr. Clerk will you lock the machine on the passage of the bill? All the passage of House Bill 308. The yeas are 170 and the nay is 1. This bill having you see the requisite constitutional majority is therefore passed. Congratulations on your first bill there. We're representing Clifton. Okay House members we're going to call House Bill 108. Mr. Clerk will you read the caption to House Bill 108. House Bill 108 by reps of the bond of the 73rd to be entitled and act to amend part two of Article 15. Chapter one, title 10 of the fiscal to Georgia and it's edgy relating the fair business practices act of 1975. It shows to provide certain protections for veterans and other eligible persons applying for benefits. This bill having further committee on defense and veteran affairs that committee recommends the disbill do pass. Chairman Bonna has recognized to present the bill. Thank you Mr. Speaker. Colleagues today I rise to present House Bill 108. First I would like to thank this body for all that you have done over the years for our veterans here in the state of Georgia. I'd also like to thank our defense and veteran affairs committee. Being the chair of that committee has certainly been a true honor and I appreciate all they do to help our veterans throughout the state. In the interim our committee along with our Senate counterpart had a series of hearings across the state to look at the issue of veterans benefits and how our Georgia veterans were receiving those benefits from the VA. And unfortunately kind of the result of those hearings is a determination that the VA is a broken system. We certainly have high expectations.\n\nfor one of our former colleagues that is now serving as a secretary of the VA, but there is a great deal of work to be done. Currently, the backlog on appeals is over 300,000 claims. This means the average wait time according to the VA for appeals is upwards to two and a half years. Most appeals take anywhere between five and ten years. Now, this is no reflection on our own Department of Georgia Department of Veteran Services, Commissioner Ross and her team are doing an outstanding job in doing all they can. And this is no reflection on our veteran service organizations like the VFW and the American Legion. Again, they are certainly doing all they can to keep up with the demand. We cannot fix the VA, but we can create a regulatory environment in Georgia that gives veterans an opportunity to obtain their benefits faster. House Bill 108 provides a free market option and allows our veterans to exercise their first amendment rights. The bill creates the following guardrails for claim consultant companies. First, it requires a written agreement to include a disclosure that that individual can receive the exact same service for free from the VA or a veteran service organization. All the fees are on a contingent basis and the total amount of fees is capped at five times the monthly gain. The bill also prohibits a promise or guarantee of a successful outcome. It prohibits private entities from having doctors on the payroll, performing secondary medical examinations. Claims consultants are also prohibited from using international call and data centers and it prohibits direct access to a veteran's medical financial or government benefits information. Additionally, the claim consultants are required to have a background check. All of this is adjudicated under the Fair Business Practice Act. Now to be very clear, I do not believe that any veteran should be forced to pay to receive benefits they have already earned. Nothing in this bill forces a veteran to choose one of these companies. Just like veterans might choose to use a company like H&R Block to do their taxes, they can choose to use a private company to help with their initial disability claim. I'm asking each of you to help me in doing what we can to ensure our nation's heroes receive every benefit they deserve. With that, Mr. Speaker, I'll take any questions. If you have a question to your left, Representative Hethner has a question. Representative Hethner. Mr. General, I do. To my friend, I do. Thank you, sir. Is it not true that I participated in those joint committee hearing sessions actually hosted in Augusta, Georgia this summer post session? Absolutely. They're at the Cyber Center. Great. We appreciate that. Mr. General, I do. Is it also not true that I had an opportunity to speak to the individuals who presented testimony and to the individuals who represented my veteran services organization locally. I had the opportunity to hear their concerns about why this bill is in support of what they'd like to see as an additional layer to support Georgia veterans. Absolutely. We appreciate your input on that committee. Thank you, sir. You have a question again to your left, Representative Jackson. He'd be recognized for a question representing Derek Jackson. Thank you, Mr. Speaker. Mr. Chairman, do you yield? I do. Is it not true that I oppose this bill? That is correct. Do you further yield, Mr. Chairman? I do. On line number 43, which gives me great heartburn that this allows for the middle person to not succeed five times what that veteran could get. So for example, if the veteran gets $300, the middle person that's offering these services will have the ability to charge the veteran $1,500 for them receiving $300. Is that not true? That is correct. I would say to that that it is again a contingent fee basis. So they only pay if they actually get the benefit. They know upfront what it would be capped at. So they have an idea of what that amount may be. And I would submit that there is a time value of money principle involved. So that getting that $300, getting that money now versus that benefit two to three years from now is worth more. And I think that our veterans ought to have the option in order to pay to get that benefit sooner versus later. Mr. Chairman, do you have one more question? I do. So is it not further true that if the veteran decides to go the free route which currently exists for that veteran, the results will not change because the middle person cannot influence that process no differently than if they decide to go the free route? Well, I would argue with one point in that while it is true they have the option to use a free service. What the data shows us is that oftentimes more often than not using that service going directly to the VA or directly to a VSO. Oftentimes the time it takes to adjudicate that claim is much longer than using a claims consultant. So I would say that again they have that opportunity but the data shows that if they want to have an opportunity to get that benefit faster they may use a claims consultant. Thank you gentlemen. I have a, let's see let's have a comment from a question from a veteran for Chairman Deloge. It's recognized for a question. Does Chairman Yeal? To my friend I do. Mr. Chairman isn't it true that if we don't pass this bill is absolutely no limitation on what these services can charge? That's correct. These companies operate in Georgia now. So we have the choice to do nothing which allows these companies to operate in unregulated or we have the opportunity to put in guardrails that protects our veterans. Thank you very much for the bill. Thank you. Gentlemen, further yeal? I'll yeal for one more question Mr. Speaker. To your right, Representative David Clark. Representative Clark has a bill. Does Chairman Yeal for question? I do. And true that House bill 108 holds bad actors accountable for misleading veterans when they're seeking the benefits. Absolutely. Thank you. Great bill. Thank you Mr. Speaker. I'd ask for your favourable consideration and I yield the will. We do have, thank you. The gentleman is yielded the will. We do have a speaker on the bill representing Sandra Scott is recognized to speak to the bill representing Scott. Thank you Mr. Speaker. And that's former staff Sergeant Sandra G. Scott. Excuse me. Okay. Thank you. Thank you, Mr. Speaker. Colleagues and honor guests. I rise today in strong support of House bill 108. The Safe Garden American Veteran Empowerment Act are the Safe Act. This legislation is more than just a policy change. It is a necessary step in protecting the brave men and women who have served our country from being preyed upon by the septic actors who seek to profit from their sacrifice. Yes, last year I had the unadrapteness very bill because I witnessed first hand the challenges veterans faced when seeking benefits they have rightfully earned. Unfortunately there are individuals and businesses that exploit our veterans during this vulnerable time. Charged them excessive fees making false promises and in some cases even withholding critical information about the free services available through the VA and the Georgia Department of Veteran Services. This bill puts an end to those practices. However we also recognize the importance of ensuring that veterans receive high quality assistance when navigating the claims process. During our discussions veterans and stakeholders raised a valid concern. How do we ensure that those providing services are legitimate, competent and truly working in the best interest of our veterans? We had filed a minor report done on this bill and after listening to the voices of our veterans, I support we ask for an amendment to require a certification process for vendors providing the system with veteran benefits claim. The certification would have established a standard of ethics and accountability ensuring that those who assist our veterans are properly trained, properly vetted and held to a standard that protect those who have protected us. The amendment would have strengthen House Bill 108 making it a bill by veteran, for veterans one that offers not only protection but also reliable and accountable assistance for those navigating the benefit system. Our colleagues today we have an opportunity to do right by our veterans by passing this bill with hopefully to get an amendment in the Senate. We will safeguard their financial security, protect them from deceptive practices and ensure that those often services meet the highest standards of integrity. I urge you all to join me in supporting House Bill 108 and to stand with our veterans not just in words but in action. Thank you, Mr. Speaker and I yield the well. The lady has yielded the well. Is there an objection to the previous question being ordered? The chair here is none the previous question is ordered. There is a minority report. Does the lady waive? The lady waives. Is there an objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? So for what purpose does Representative Glaze rise? Parliamentary. Stature. Is it not true that I am the wife of a disabled vet and it took over 20 years to get his disability benefits. We had to go to an outside company to get those benefits and so I do support this bill and I think the offer for bringing the bill. Lady knows which she speaks. Shall this bill for what purpose does Representative Holly rise? Parliamentary inquiry. Stature inquiry. Madam Speaker, is it not true that while I certainly support this bill, I think that it's going to be able to help our veterans but certainly we need to be cautious in the future to make sure that we are not excluding those persons who are in an assistive capacity and possibly by doing so by making sure that we are being careful with the words that we put in the bill so it's not be exclusive. General Knows of which he speaks. Have all members voted if so, the clerk will lock the machine on the passage of the bill. The A's were 158, the A's were 10. The bill having received the requisite constitution majority is therefore passed. Clerk agreed the caption to House Bill 176. House Bill 176. House Bill 176 by Robson of Smith of the 18th and others to be entitled back to amend Title V of the fiscal to George Annotated relating the appeal and error. So it was the change of revision relating to judgements deemed directly appealable. Mr. Bill, I'm sure the Committee on Judiciary, not civil that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Smith to present the bill. Thank you Madam Speaker. Members of the House, I come to you today with a bill that we passed out of this great house last year and word reached my ears that apparently there was a printing problem. I don't know whether it was at ran out of paper or we just need to go plug the darn thing back in over there. But I think we've got a good group that will go over there and help them with their technical difficulties this year if they run into that same situation. Ladies and gentlemen, just to go over briefly, Section 1 of this bill would make direct appeals of a conviction available when some charges are on the dead docket. Section 2 would make a direct appeal of a guilty police subject to judicial discretion. And Section 2, Section 1 would actually allow prosecutors more time to respond amended motions for a new trial. Section 1, Section 3 would reinstate meaningful access to request post-conviction review from the court. And Section 3, Section 1 would actually allow the motion to withdraw a guilty plea to be within the term of court or 30 days, whichever occurs last. That in essence is the bill, Madam Speaker, and I'll yield for any questions if there are any. That riveting explanation, there are no questions after that. I'm going to ask this body. I will continue to speak to quickly. Chair recognizes Representative Martin for a question. Jim, when you'll for a question over here, do you write? I will. Yes, sir. Mr. Wondering, as the pro-tum said, is not true of that riveting explanation of the bill. You went kind of fast because you do it again and speaks lower. Gentlemen is out of order. Is there any objection that gentlemen, there are no more questions. The gentleman is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Chair here is none. The committee's substitute is adopted. Is there any question? Any objection to agreeing to the report of the committee, which was favorable to the past of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? Yes, all of those opposed will vote no, and the clerk will unlock the machine. Have all members voted? Have all members voted? So the clerk will lock the machine on the passage of the bill. The a's were 168. The a's were zero. The bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 253. House Bill 253. House Bill 253, members and clerk of the 100th and others to be entitled back to a men chapter 11 and title 15. An article 1 in chapter 9 and title 19 of the official code of George annotated relating to juvenile code and general provisions relative to child custody. The state proceedings so to enact Ethan's law. This bill emits a committee on judiciary. Juvenile that committee recommends this bill do pass by committee substitute. Chair recognizes representative Clark to present the bill. Thank you, Madam Speaker. I'm honored to present House Bill 253 called Ethan's law. He measured design to better protect children and parents subject to child custody orders issued by spew courts. Under current law, severe court judges can order children to attend reunification camps outside of Georgia. This not only removes the child from our jurisdiction and issue in itself, but also violates parental rights. Parents with sole custody are being forced under court order and threat of contempt to send their children across state lines for reunification with a parent who is previously deemed unfit for custody. This is unacceptable, especially when Georgia has thousands of qualified counselors, therapists and mental health professionals available to provide support within our state. Ethan's law would also protect judges. Many spew court judges in Georgia are not fully informed about the realities of reunification camps and have not heard from victims. As a result, they may not fully grasp the lifelong trauma these rulings can't create. By passing this bill, we ensure that no child is subject to unnecessary harm and that Georgia retains authority over its most vulnerable citizens. The hospital of 253 is about safeguarding children, upholding parental rights and ensuring that our judicial system is informed and responsible. I urge my colleagues to support this critical measure and this bill simply just ends the reunification camps here in Georgia of having our kids sent out of state. I'll say, I call to Ethan's law and when this bill passes, and I'm asking you to vote yes, and we get it across in the Senate, into the governor's desk, it won't help Ethan. Ethan's bill gives an effect July 1st, he would just aged out. But what it's to do is help so many other kids from not going through this process. And I was talking to his brother Owen and he had aged out last year. And I was talking to him and I mentioned about an amazing book called The Comeback by Louis Giglio and that would really hit me. I talked about God would take us through things and sometimes horrendous, terrible. He uses it because he knows that you can handle it and he's going to use it to literally save another human life who can't handle what you just went through. And I told Owen that and I was encouraged all the job going through this type of situations, but that's what this bill will do. And I'll carry on the legacy of Ethan and even his brother Owen who went through the system. And so I'll take any questions with that Madam Speaker. As a question, the chair recognizes representative Gallup for a question. Does Jim and you'll write this in here? Your front. Do you yield? Are you? Isn't it true that when Ethan testified through video at the committee how moving and how just awful the situation was that he was put in and his brother Owen was put in. And I'm so appreciative of you. You're meeting with him. God put you together, but you're bringing the bill to fix this. So hopefully no other kids go through this. Exactly. And thank you for your support on this measure and working with me on this bill. Thank you so much. Chair recognizes representative Corbett for a question. Thank you Madam Speaker. Does Jim and you? Are you? Don't you have a couple that's constituent so over here in the corner that might be interested in this bill as well? I do. One's the step mom to Ethan, an amazing woman, and what brought this to my attention and got to know the family. And then another one, Nathan, he's going through the same thing with his kids, heartbreak. And so. Great Bill. Thank you for bringing me here. This bill will mean a lot to pass it right here for those two families and many other families throughout Georgia. There are no more questions. Thank you so much. And I ask that you all vote yes on this bill. And I'll say one last thing, a big celebrity who went through the reunification camp type process was pretty spares. And if you follow her story, she got sent to a camp like this. And so it affects everyone from the top down. And so please vote on House Bill 253 and let's pass Ethan's law. Thank you. The gentleman is yielded the well. The chair recognizes representative Evans to speak to the bill. Thank you, Madam Speaker. Ladies and gentlemen, I rise in support of House Bill 253. This bill will simply put some guardrails around any order of reunification therapy. And the two guardrails that are really the most important to me, and I hope it be important to you, is one, you can't order children to a reunification process that is going to say that they can't have any contact with the parent that they are currently living with with that custodial parent. It is heart-wrenching and traumatic for these children to be sent to these reunification camps. And they are allowed to have no contact with the parent that they are living with, fearing probably that that parent has abandoned them. This is just a bridge too far for me. And then the other one that's important is not sending them out of state. I'm going to read briefly from a Wall Street Journal article from August of last fall that I think really summarizes the human side of this and how horrible it is. There are plenty of stories out there, and we don't have time to talk about all of them, and I'm not going to read this whole article because it's 11 pages. But I want you, once I read this, there was no turning back from supporting this bill in my opinion. And I think, and I hope that it will be the same for you. Again, this is from last fall from the Wall Street Journal. Torey, a 16-year-old at the time, and her 12-year-old brother, were whisked away from their mother at the Maricopa County Courthouse by four strangers in a white minivan on the morning of May 27, 2021. The strangers wouldn't tell Torey and her brother where they were going, she recalled, as the siblings held hands and cried in the back seat. After hours on the interstate, they arrived at a hotel somewhere by the ocean. The strangers, three men and one woman, barricaded the door to their room with furniture so that it couldn't leave. The next morning, Torey, 16-year-old, remembers one of them saying, you're going to have a meeting with your father now. What Torey didn't know was that a judge had ordered the children to attend a four-day family reunification program in Ventura, California with their father. The judge determined it was the only way to repair their relationship, damaged during a decade-long custody battle. The children had been living mostly with their mother and resisted seeing their dad because of his temper, Torey said. But court appointed evaluators determined that the mother was poisoning the kids against their father. And she was suddenly barred from contacting her children at all. It would be around two years before Torey and her brother saw or talked to their mother again. Two years. This is from Torey. I tried to numb myself to what was happening. It was like surviving. But that only worked for so long because it absolutely destroyed me. The treatment this family underwent is part of an industry of intensive reunification therapy that has sprung up during the past decade. There have been efforts like what we're doing here by Republican led states, by Democratic led states. This is a bipartisan issue, ladies and gentlemen, that will protect our children and parental rights. And I am so proud to join with Representative Clark in asking you today to vote yes for this bill. Thank you, Madam Speaker, and I yield the well. The lady is yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. For what purpose does Representative Kelly rise? Parliamentary required. State to inquiry. Madam Speaker, is it not true that Aethan's law accepts his critical protections that will prevent use of force and coercion? And will ultimately prioritize the safety of our children across our state? Gentlemen, which he speaks. Is there any objection to adopting the committee's substitute? Chair here is none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no. And the clerk will unlock the machine. Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The A's were 166. The A's were zero. The bill having received the requisite constitution majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 156? House Bill 156 by the reps. I have Jones, the 25th and others to be taught to amend chapter 1 and title 6 of the Fisher go to Georgia and set it relating to general provisions relative to deviation. So it's a divided department transportation with authority over verteboards. This bill eminence for the committee on technology and infrastructure innovation. That committee recommends that this bill do pass by committee substitute. Chair recognizes representing Todd Jones. Chairman Jones has recognized you present the bill House Bill 156. Thank you, Mr. Speaker. Exciting day here in Georgia. Potentially bringing air taxi transportation to our great state. What HB 156 does is merely put into code the definition of a verteport which will effectively facilitate the use of air taxis in our state. And I thought instead of explaining what an air taxi is, I thought I would basically first and foremost acknowledge a Georgia based company manufacturing air taxis in our great state archer who's up in the gallery. We appreciate them being here and I'd like to cue a video so you can see an air taxi in business. Thank you. So you can see effectively what these verteports are. They will effectively what we're looking to do is create lily pads, not just in metro at land, but all around the state allowing us to be able to hop in different places. Those riots could be as short as three five miles. It could be as long as 20 miles, but effectively giving us an opportunity to lift traffic off the roads and put it into the air. They take off in land very similar to a helicopter, but they fly fixed swing like an airplane. Mr. Speaker, that is the summary of the bill and I'll stand for any questions. To your lip, represent Jasmine Clark has a question. Thank you, Mr. Figard. Is it gentleman, you? Yes, ma'am. So thank you for the video. That actually looks really interesting. My question is how many of these could be in the air at the same time without us having to now develop, I guess, a state level form of FAA just to make sure they're not crashing into each other and things like that. At scale, like if it's just one company now, that makes sense, but there's nothing that stops a bunch of air taxi companies from popping up and these things flying all around us and how do we regulate that? Yes, a representative. Thank you very much for the question. And I want to be clear, they are the only one in Georgia manufacturing, but there are other air taxi companies manufacturing in other states that they should change their mind and come to our great state and manufacture their product. But that state of the FAA is consistently putting out new rules just like they have rules in terms of where the helicopters have to fly, where airplanes have to fly, where no fly zones are at, where TFR is around, and we have zones one, I believe, through four within the FAA.\n\nOkay, law will have the exact same type of operations when they get functional next year. Thank you. Okay, thank you. How about if we have a question from a pilot, Mr. Chairman? Chairman LeHood to your right. Is recognized for a question. Mr. Gentlemen, you? Yes, sir. Is it not true that by passing House Bill 156 Georgia will establish itself as a leader in emerging technology and aviation? Yes, I think this is a great opportunity for us to transition from being number one in business to being number one in thought leadership. Thank you very much for the question. You have a lot of thoughts out there. I'll just tell you that. We'll recognize somebody else for a question. Reptenti Williams wants to take these from now where that cherry wine is to come to Atlanta from the coast. Reptenti Williams. Thank you, Mr. Speaker. Will the gentleman yield? Yes, sir. I am curious and I'm glad to see a manufacturer here in Georgia always. What I'm curious is who can afford the trip? Having figured out what's the difference between a helicopter ride and a taxi ride? Well, I think that's a great question. I want to let the free market determine that. But the operators that I do speak with, they want to basically market against an Uber Excel price. So I know from Forsyth County where I live, Uber Excel down to the airport is Circus 75 to 85 dollars. But again, can't guarantee that. But right now, I think the free market is going to come in and I think we'll see hopefully pricing in that area. With the gentleman yield for further question. Yes, sir. I love your optimism. But the day I see an airplane charge 85 dollars to crank up, muslims carry you. Please give me a call. You have my word. I'm going to make sure that you get onto the first ride, Reptenti Williams. And with that, I yield to well. Thank you very much. I didn't realize he volunteered for that first ride, but I guess he did. Is there any objections to the previous question being ordered? The gentleman's yielded the well. Is there any objection to the previous question being ordered here? And none of the previous question is ordered. Is there any objection to adopting the committee's substitute? Here in the committee's substitutes adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in the report of the committee has agreed to shall. This bill now passed. All in favor of the passage of the bill. Will vote yes, all those opposed. Will vote no one, Mr. Clerk, will you unlog the machine? For what purpose does Representative Rhodes rise? Parliamentary inquiry. Statue of inquiry. Is it not true that the question is, will these machines lie better and straighter than the basketball did last night for the Florida Gators? Well, that's an interesting question. And one that I'm sure the Chairman would love to respond to. For what purpose does Representative Crow rise? Parliamentary inquiry. Statue of inquiry. Thank you, Madam Speaker. Is it not true that if this bill is passed, the Department of Transportation will have the necessary authority to implement safety and operational guidelines for verteports across the state? Sure, the gentleman knows which he speaks. What purpose does Representative Fleming rise? Parliamentary inquiry, Madam Speaker. Statue of inquiry. Is it not true that this aircraft that we saw in the video a minute ago will be manufactured in the 114th House District in County, Georgia, and is not further true that this company has made a significant investment into Georgia. The gentleman knows which he speaks. For what purpose does Representative Adenio rise? Parliamentary inquiry. Statue of inquiry. Is it not true that this category of aircraft will be a new category in the last 80 years showing how much progress we've made in transportation and technology? Gentlemen, is clearly knows of which he speaks. For what purpose does Representative Jones rise? Parliamentary inquiry. Statue of inquiry. In addition to Representative Fleming's comments about archers' investment into our state, isn't it also true that the founder is a University of Florida Gator? Well, that's hard to believe, but I'm sure the gentleman believes that to be true. Have all members voted? Have all members voted the way they choose to vote? All members voted if so. The clerk will lock the machine. On the passage of the bill, the A's were 162, the A's were seven. The bill having received the requisite constitutional majority is therefore passed. Clerk agreed to caption the House Bill 14. House Bill 14. House Bill 14, my name is Carpenter. The fourth and others may be entitled to amend Article 3, Chapter 3, Title 50. The official go to Georgia and attendee relayed the other state symbols. Stowa's to designate, cord bread, as the official state bread of Georgia. This bill emigrant the committee on special rules, that committee recommends the disbilled do pass. Chair recognizes Chairman Carpenter present the bill. All right, you know what that means? It's getting close to lunchtime. House Bill 14 to make the state bread, cord bread, it's back, baby, it's back, it's a reunion tour. Wake up out there people. Glad to have this bill in front of you today. Basically this would just take such a southern delicacy that is such a profound heritage in the state of Georgia. Beginning with the Native Americans and on through our cuisine over the last 200 plus years. Making cord bread the state bread will solidify our position in the nation as one of the best culinary places to visit. And I appreciate your favorable support. I'll take any questions because I think we're going to have a good time with this. No, we're going to be real serious about this. I'm going to call on Justin Ridley first. Thank you, Mr. Baker. This is my colleague. Absolutely. Will make is your physique from eating so much cord bread? That's exactly right. Because you can't, is it a pan or a pound of a cornbread? It's a lot, it's a pan of cornbread, sweet savory, jalapeno cheddar, however you like it. We're not going to specify how to like it. But yes, I do have the figure of a man that eats a lot of cornbread. Gentlemen Yeild. Yes, sir. Ripsing Mary Francis Williams is recognized for a question. Well, the gentleman Yeild. Yes, ma'am. So can you answer the age-old question that has caused many a family breakup and fight? Do you or do you not add sugar to cornbread? I do add a pinch of sugar. I think if you studied the history of cornbread, the corn used to be a lot sweeter than it is now. Okay. Once they started mass producing it. Would you further Yeild? Yes, ma'am. And Johnny Cake, which Yankees eat, is not cornbread. This is not true. I would agree with that. Thank you. Thank you. Mr. Chairman, I had some of your cornbread out in any room. I escaped before I had some beans and cornbread. It's excellent. Thank you. Now, appreciate it. Thank you for doing that. Absolutely. I knew it would be a long day. What purpose is represented Cox rise? Well, four questions. I'm sorry. Yes, ma'am. I got a thing about that cornbread. I just think that's all I got around. It's got a mind working here. Yes, sir. I do. Cox has recognized for a question. Thank you. Is it not true that I was against this bill until I tried said cornbread in the any room? I think that is true. Okay, further. Further? Yes. Thank you. Thank you. Is it also a possibility that we could label any cornbread not made from the state as foreign cornbread? I don't think we're going to go that far. I don't think we'll go that far. Thank you. Thank you. Rippsley, Illinois is recognized for a question to your left. Gentlemen's recognized. Oh, there it is. Thank you, Mr. Speaker, with a gentleman you? Yes, sir, are you? So I have a pretty serious question. All right. I might need some clarification. So is cornbread supposed to be made in a skillet on top of the stove or in an oven? Can we clarify that? I think he can go either way, but I'm an in the stove kind of guy. Modern efficiencies. I think with that speaker, we'll yield the way on a look forward to your favorable consideration. Thank you, Mr. Chairman. Thanks for the cornbread as well. Gentlemen, as you were the well, is there any objections to the previous question being ordered? Is there the hearing none? The question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shout this bill now pass. All in favor of the passage of the bill. Will vote yes. All those opposed? Will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is representative? Petrie rise. Parliamentary inquiry. State inquiry. Mr. Speaker, is it not true that you and I and Chairman Parrish and several others grew up eating hoakes? That would be true. And is it not true that I was thinking of voting against this bill to a lot of discover that that is indeed qualifies as cornbread? Well, he voted for your sprint bill. I bet you better vote for your cornbread bill. No, he didn't. So, no, he didn't, Mr. Speaker. No, he didn't. Well, he's voting against his own bill, so that's fine. I guess he can do that. For what purpose is gripping his same rise? Parliamentary inquiry. State inquiry. Is it not true that given the supplemental information we've received in this room to the west of us that we appreciate the wisdom of the rules, Chairman, to ensure that food, symbol bills are brought to our attention when there are additional. Thank you for feeding us. I think so, yeah. Whatever you said. Have one more Parliamentary inquiry and that's going to see for what purpose is represented more rise. Parliamentary inquiry. State inquiry. Isn't it true that I have a bill out there on the floor getting ready to come through committee that will make the cornbread the official bread to the official dipping sauce of Georgia for collard greens? Not to be outdone. Those collard greens are special to Georgia too. Have all members voted if so, Mr. Clerk, where you lock the machine, own the passage of House Bill 1414, the yeas are 157, the days are four. This bill, hadn't received a requisite constitutional majority, is therefore passed. Mr. Clerk, where you read a caption to House Bill 233. House Bill 233 by representative Townsend of 179 to be entitled back to amend art 3, chapter 3, title 50, the official code of Georgia and it ended relating to other state symbols. So it does ignite runswick stew as the official states do. This bill, I'm referring to the committee on special rules that committee recommends that this bill do pass. Let's see the gentleman is going to present the bill from the city who lends their name to this particular type of stew, right? Yes, sir. Representative Townsend has recognized to present the bill. I'm proud to represent runswick and it is home with the runswick stew. It originated back in the 1800s and there's a county Virginia that claims differently, but you know, have Virginians are anyway. I'm proud to say this has an economic and historical significance. We have a stew believe every year raised over $20,000 having a little stew taste off, but you can find the best brunch stew down on South Georgia and of course down on the coast. I'm going to ask for your favorable consideration. It goes with many things whether it's biscuits crackers and especially cornbread is delicious to and that Mr. Speaker, I'll be glad to answer any questions. Do have some questions. I want to hear this one. For let's see recognize. Representative Hugley. I'm going to ask for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. Your colleague brought us some beans and cornbread, but I don't see any bronze stews so how can we judge whether or not we should do this? We are bringing it later. You can count on me. Okay, good question. I was wondering the same thing there. President Dunahue, can you add some light to this subject? Thank you, Mr. Speaker. Or spice. Does the gentleman yield? Yes, sir. Is it not true that I've never lost a contest with my brunch with stew. I'm undefeated. I brought two gallons of stew that I sell for $100 a gallon and the dean of the delegation Calvin Smiley tasted it. While we were in here doing the people's work, about 30 of the across the aisle friends went in and ate two gallons of brunch with stew. So the ones that are still here will understand that, but thank you for carrying the bill and make sure that my recipes included. I'll send it for a good price. Thank you, Representative. I do want to invite you down for our stew tasting. We have over 20 to 30 cooks every year come down and have a contest. All right, that's a good challenge. For what purpose is Chairman Harbin? I'm sorry, I recognized for a question. I was wondering about brunch with stew. Where are you, Leo? Jim and you? Yes, sir. Is it not true that the last question proves that no matter where you live, everybody lives in a small enough town to win a contest? Yes, sir. But do they have tasty stew? That may be the best question of the session right there. You order one more question? Yes, sir. We'll take one more. The same Paris has a question to your left. Thank you, Mr. Speaker. I'm sorry to the right of the back. I'm sorry. Okay. There you go. Is it down to the menu? Yes, ma'am. It's not true that if you took a poll in here today, this bill would lose. I can't hear you. If you took a poll in here today, would it not be that 50 and 1% of these people would say they don't like brunch? Yes, sir. They don't like brunchs, too. It would still be the best, too, in Georgia. To make it the official states, too. Thank you. Yeah, we're about to find out. That is the historic significance on the board that you can see as well, Mr. Speaker. And that, I'll yield the well. We appreciate it. The gentleman has yielded the well. Is there an objection to the previous question being ordered to chair? He has done the previous question as ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. Shout out. This bill now passed all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And, Ms. Clerk, were you going to lock the machine? Have all members voted? All members voted this so. Mr. Clerk, were you? Locked the machine. On the passage of House Bill 233, the yeas are 152, the nays are two. This bill, having received a requisite constitutional majority, is therefore adopted. Mr. Clerk, were you ready to caption the House Bill 134? House Bill 134 by represent of camp, 135th and others to be taught at NAC, to a man taught at 48th. The fish go to Georgia, and Senator really in the revenue and taxation, so it's to revive for definitions, and to revise and expand a state, a sales tax exemption from manufactured homes. This bill, I'm referring to the committee on ways of means that committee recommends that this bill do pass by committee substitute. Representative camp is recognized to present the bill. Thank you, Mr. Speaker. This is an important bill to me because it creates, it removes barriers to entry for individuals who are looking to become homeowners. House Bill 34, a men's state law, only slightly. Right now, when someone purchases a manufactured home and they go and they turn it into real property, convert it to real property, they can get 50% of the sales tax back. But only the state tax, this amends it slightly to include local tax. So for an individual that's buying a manufactured home, it puts it more parity in line with someone buying a stick-built home. And Mr. Speaker, I'm open for any questions. Lady has no questions. Thank you, Mr. Speaker. I ask for a favoral consideration on this bill. Thank you. Ladies, you and the will, is there any objection to the previous question being ordered? Here in the previous questions ordered, is there any objection to adopting the committee substitute? Here in the committee substitute is adopted. Is there any question to agree to the report of the committee, which was favorable to the passage of the bill? Here in the report of the committee is agreed to, shall. This bill now pass, all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 134, the A's are 160, the A's are zero. This bill haven't received the requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read a caption to House Bill 131? One three one. House Bill 131, by the way, the review is the 99th and others to be entitled to amend the Article 5 of the chapter 4, Title 10 of the official go to George annotated relating to self-service storage facilities, so as revise the advertisement requirements, before an owner of a self-service storage facility can enforce an owner's lien. This bill now refers to the committee on judiciary. That committee recommends this bill do pass. Representative Rees, Representative Matt Rees is recognized to present the bill, the gentleman. Thank you, Speaker Burns. Members of the House, the word bipartisan, which you used earlier, this bill is deflaed by partisan problem-solving bill that modernizes George's self-storage law in a very narrow and focused way for the benefit of our 1500 small businesses, mostly family businesses, who run self-storage, and it will also benefit customers, paying customers of self-storage who have course or renters, people who have gone through life changes, students, and people who definitely need to have the best budget they can. This bill keeps in place all the due process for customers, but what it does is it provides flexibility for the advertisements in case of a delinquency in a sale that is more in line with the industry standard of 32 states. Again, it keeps in place most everything in Code Section 10, 4, 2, 13, but it does provide flexibility on the advertisements which will save money, and it will make things quicker and it will free up storage spaces for paying customers. So there were three women owned businesses who testified in the committee. They explained this to the judiciary committee unanimously approved it, and I respectfully request your favorable consideration of House Bill 131 for the benefit of our customers. Thank you, Mr. Speaker. I'm glad to take any questions or if there are any questions I yield the well. Gentlemen, has a question, and the representative of the Senate are out to your left. Does the recommendation for a question? Thank you, Mr. Speaker. It is a gentleman yield. Absolutely to my representative from Duluth. Thank you. Just a quick question. It says in here that there will be no notice to deny the occupants access to their property. Can you just explain that a little bit more? I believe that once they've defaulted after the 30 days, they will not get a notice they leave. No. Representative Romano, I believe we have a big many storage between my house and yours were close by. This keeps intact all the procedures relating to the actual customer. There currently is a procedure that if there's a delinquency and there's notice that the unit can have a lot placed on it, the customer of course could come deal with the many storage and do that. So, we can change it. All this changes is placing two newspaper ads. It gives the flexibility of 32 other states about the ad for the sale. You have to have three people show up for the auction. That is a safeguard there. So, we are not changing the procedures for the customers just for the advertisements. I was just concerned about the no notice, please, but thank you. Thank you. Gentlemen, has a further question. Thank you, Mr. Speaker. I yield the well. Is there any objection to the previous question being ordered? Here, none the previous question is ordered. Is there any objection to a green to the report of the committee which was favorable to the passage of the bill that Jerry has none the board of the committee is agreed to? This bill now passed. All in favor of the passage of the bill. Will vote yes. All those opposed. Will vote no, and Mr. Clerk, will you unlock the machine? All members voted. All members voted. This so, Mr. Clerk, will you lock the machine? All the passage of House Bill 131, 131, the yeas are 166. The nays are zero. This bill, Henry C. Dirick, was a constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Bill 392? The read 9 to? House Bill 392, by Representative Martin of the 49th and others, be titled an act to amend chapter 5, be a title 15 of the fish go to George annotated relating to tax courts. So those revise the dates for certain events regarding the Georgia tax court. This bill, I'm referring to the committee on judiciary. That committee recommends that this bill do pass. Chairman Martin, Chairman Chuck Martin, his recognize to present the will. Ladies and gentlemen, for those that were here last year, you remember we passed two measures to move the tax tribunal from the executive branch to the judicial branch that required two things that required constitutional amendment which passed in November. And we also passed the underlying legislation. I will dispense from the details of why that move was necessary because most people that were here heard that last year, if there are questions about that, I can get with you offline here. What this bill does today is specifically correct some dates in the enabling legislation to allow the court to be implemented in the best possible manner so that our citizens will not see any interruptions. If you have questions about why we move from the executive branch to the judicial branch, that happened last year and is in law. This is just a fix to that. With that, Mr. Speaker, I'd ask for the House's favorable consideration of House Bill 392. If there are no questions, I'll yield the well. Gentlemen has one question to your left representative Kelly. Is recognize for a question. Thank you Mr. Speaker. Mr. Chairman, you'll. Yes sir. Chairman Martin, just so everyone is clear, who's bill or week correcting from last year? Well, I'm going to go with that and thank my sponsors of that bill last year. I believe they've involved maybe the chairman of judiciary, but I will take credit that we are correcting the gentleman from Alfredo, Chuck Martin's bill from last year. I would all. Can I at least hit by. I would think the learned member of the judiciary committee for not calling me out and last year, but waiting to embarrass me in the well today. We all have to admit our shortcomings. Yes sir. If there are no further questions, I know people are ready for lunch. I yield the well. Everyone has no further questions. Is yielded the well? Is there an objection to the previous question being ordered? Here in the previous questions ordered. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill that here in the other report the committee has agreed to? Shall this bill now pass? All in favor of the passage of the bill will vote. Yes, all those opposed will vote no. Mr. Clerk, will you unlock the machine? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 392, the yeas 164, the nays are zero. This bill, having received a requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption of House Bill 171? House Bill 171 by Representative Thomas 21st and others being titled an act to amend part one of our three chapter 12, the title 16 of the fiscal to George Annett's and a related to the general provisions, relative to obscenity in related offenses, so as to repeal and replace Code Section 161280. This bill, I would like to introduce to you, Mr. Clerk, will you read the caption of House Bill 171 by Representative Thomas 21st and others being titled an act to amend part one of our three chapter 12. The bill is passed by Representative Thomas 21st and others being titled an act to amend part one of our three chapter 12, the nays are zero. Today I stand before you discuss House Bill 171, LC number 481512S, the Ensuring Accountability for Legal Activities Act. This bill addresses one of today's biggest issues and that's the transformation of traditional crimes through the use of artificial intelligence. Through history, humanity has grappled with crimes that shock the conscience. However, with the advent of advancing technologies, particularly AI, these old crimes have taken a new and more sinister form. AI is a remarkable tool. It has the potential to help humankind do incredible things. I truly believe that we can obliterate a literacy in this state. It has the capability to perform medical examinations beyond superhuman. Unfortunately, it can also be used in many ways that can not only amplify the speed of a criminal, we can perpetrate acts, but the grief it inflicts on its victims. AI technology is enabled to create a highly realistic and believable simulation. This capability, while innovative, poses significant risks to Georgia when used unethically. One of the most heinous misuses we see today involves a generation of computer generated obscene material depicting our children. These are not mere images. They are realistic simulations that can be indistinguishable from reality. These AI's to make everyone clear, they're trained on the faces of our children and our grandchildren. They're taken from photographs and videos that people, these criminals, obtain online. Under HB171, we'll dress these crimes directly by making the distribution of AI generated obscene material to pay.\n\nTeam Children, a felony offense punishable with prison term. This bill serves as a strong deterrent against the exploitation of AI technology to create and distribute such harmful material. Additionally, the scope of HB171 extends beyond protecting children. It acknowledges and tackles other AI related offenses, targeting the most vulnerable populations that includes disabled adults and those that are dealing with stalking, whether it be regular or aggravated and interfering fraudulent with our elections. Again, we're using the definition, a homegrown AI definition that's now become the gold standard across the United States and in conclusion. It's a necessary step forward to adapt our legal system that challenges posed by rapid technological advancements. Thank you very much, Mr. Speaker, and I'd be happy to take any questions. Gentlemen, ask our questions. I'll be happy to yield for them. You have no questions. I think you, Mr. Speaker, that I yield well. Means you did a good job. The gentleman is yielded the well. Is there an objection to the previous question being ordered? Here in none, the previous question is ordered. Is there an objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there an objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed. No one, Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of House Bill 171, the yeas are 160. The yeas are 160 days or zero. This bill, having you see the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 444444? House Bill 4444 by Representative Silcox, the 53rd. No, this would be entitled to amend chapter 4, title 1 of the official code of Georgia and intending to relay the holidays and observances. So, it does ignite April of each year, Mr. Georgia, a native plant month. This bill I refer to the Committee on Special Rules, that committee recommends that this bill do pass. The representative, Deborah Silcox, is recognized to present the bill. Please turn to the Silcox. Thank you, Mr. Speaker. Please, and gentlemen, I bring to you today House Bill 444 on behalf of the Native Plant Society and the Garden Clubs of Georgia to designate April as Native Plant Month. Native plants are better able to respond to drought and forest fires. They help maintain the balance of our ecosystem. They help reduce erosion and provide food for nesting materials for animals, birds, butterflies and pollinators. By designating April as Native Plant Month, the goal is to bring awareness of the importance of planning native plants to keep Georgia healthier for animals and humans. I would ask for your favorable consideration. Lady, has no question. Oh, you'll be well. Thank you. She's yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill. Here in the other report, the Committee is agreed to. Shout this bill now, pass. All in favor of the passage of the bill. We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? Have all members voted if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 4444, the yeas are 158. The nays are three. The last bill haven't received. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to House Resolution 121-121? House resolution 121 by a rupture of Camp 135th and others, a resolution recognizing Mr. John W. Mixon and dedicating a building in his honor. This bill haven't, this resolution haven't been assigned to the Committee on State Properties. That Committee recommends that this resolution be adopted by Committee substitute. Thank you, Mr. Clerk. Chair Lady Camp is recognized to present the resolution. Thank you, Mr. Speaker. And thank you, colleagues, for hearing this today. House resolution 121 and it is naming the Georgia Forestry Building in Macon Dry Branch, specifically after a former commissioner. His name is John Mixon. He made a lot of innovations while he was commissioner from 1983 to 1995. He is still actively involved in the industry to this day. He's a good individual and commissioner Savo, when I called and spoke with him regarding this, he was supportive of this measure. So I ask for your favorable consideration. I am open for any questions if anyone has any, Mr. Speaker. I'll lady has no questions. Thank you, Mr. Speaker. I yield the well. Ladies, yielded the well. Is any objection to the previous question being ordered? Hearing none of the previous questions ordered. Is any objection to adopting the Committee's substitute? Hearing none of the Committee's substitute is adopted. Is any objection to agreeing to the report of the Committee was favorable to the adoption of the resolution hearing none of the Committee's agreed to? So this resolution now be adopted. All in favor of the adoption of the resolution will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the adoption of House resolution one, two, one, the yeas are 163, the nays are zero. This resolution here received the requisite constitutional majority is therefore adopted. Mr. Clerk, will you read the caption to House Bill 414, 414? House Bill 414, our representative Jones, the 25th and others to be entitled. And act to amend Chapter 5 of the Title 21 of the Fiscal to Georgia and Tady relating the government transparency and campaign finance. So as a devise, the definition of person to include certain non-residents to the state. Mr. Bill Amherst or the Committee on Governor Affairs, that committee recommends that this bill do pass by committee substitute. Thank you, Mr. Clerk. We're representing Tide Jones is recognized to present the bill. The gentleman is recognized. Thank you, Mr. Speaker. Ladies and gentlemen, I present to you House Bill 414. Effectively, this is a critical bill when it comes to our elections. Right now, we do not have an even playing field. So what this bill does, it does not expand in all the powers of the Georgia Ethics Commission. But it does expand its ability to apply its authority across all members of what I'll call the elections ecosystem. For an example, today, the Ethics Commission's subpoena stop at our state lines. If someone that you're running against is using a consultant, a mail house, a social media expert outside of our state, that subpoena cannot get perfected unless they get assistance from that state's AG. With this bill, that effectively says to all non-residents participating in our elections process, you're participating in our football game, you're subject to our referees, and that's effectively just an even application of the rules. Again, not an expansion, not an expansion of the law, but rather everyone participating underneath the same rules. Mr. Speaker, that's the summary of the bill. I will yield for any questions. Gentlemen, ask no questions. Thank you very much, sir. I yield the well, and I appreciate your favorable consideration. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to, shall this bill now pass all in favor of the passage of the bill? Will, will vote yes. All those opposed will vote no. Mr. Clerk, will you unlock the machine? Have all members voted? All members voted? If so, Mr. Clerk, will you lock the machine on the passage of House Bill 414, the yeas are 153, the nays are nine. This bill, having to see the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read the caption to House Bill 410, 410? House Bill 410, by the way, Representative DeLoch, the 167th and others being tiled of act to amend, Title 33, the official go to Georgia and related to insurance, so it's a provide for efficiency in the practice of the Department of Insurance. This bill, I would refer to the Committee on Insurance, that committee recommends this bill do pass. Chairman DeLoch has recognized to present House Bill 410. Thank you, Mr. Speaker, and members of the House. This is the bill you've been waiting on today. I think it's the last one on the calendar. This is a Department of Insurance Bill, and it is truly a housekeeping bill. It corrects some language, such as what says Vice-NAS President. We take that out, which refers to the insurance commissioner as he, we've added, or she, as we properly should do. The only thing of any real substance it does is it eliminates the need for agents to renew license every year and goes to a two-year license, and it removes the requirement for each branch agency to have a license and allows them to operate under the license of the main office. That's the bill, Mr. Speaker, and if folks are ready to go to lunch, I assume they have no questions. Your assumption is correct. Yeal the well. The gentleman is yielded the well. Is there an objection to the previous question being ordered? Here he none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here he none, the report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted this, so, Clerk, will you lock the machine on the passage of House Bill 410. The Yeas are 164 of the days of zero. This bill, having to see the requisite constitutional majority, is therefore passed. Members, House Bill 91 will be postponed to the next legislative day, and House Resolution 32 will also be postponed to the next legislative day. For what purpose is represented, if you hugely rise, leader hugely. To make a motion. State your motion. Mr. Speaker, I move that the rules of this House be temporarily suspended, so bill can be read for the first time in a scientific committee. Mr. Clerk, will you read the caption? Unnumbered House bill by reps and abended the 94th of being titled, and act to amend chapter 133 of the fiscal to Georgia and attend, relating the general provisions relative to insurance. The only ladies' motion that the rules of this House be temporarily suspended, so bill can be read for the first time in a signed to committee, is their objection. Insurance. For what purpose is represented, Cooper rise. To make a motion, Mr. Speaker. State your motion. I move that we move House Bill 91 back to the committee from which it came, which is public health and community health. Mr. Clerk, will you read the caption? House Bill 91, by reps and a Cooper, the 45th and others to be titled, and act to amend our 3rd chapter 50, the title 43, the fiscal to Georgia and said, relating the licensing. On the ladies' motion, the House bill 91 be recommitted to the agriculture and consumer affairs committee is the objection. Here in none of this so ordered. For what purpose is represented, Todd Jones rise. We'll come back to him in just a moment. For what purpose is represented, Eric Bell rise. I move that the rules be temporarily suspended so that a bill may be read for the first time in a signed to committee. I think that's a remotion. Mr. Clerk, will you read the caption? A number of House Bill by reps and a bill 75th and others to be titled, and act to amend, titles 15, 43, 44, and 45. And the fiscal to Georgia and said, relating the courts. On the gentleman's motion that the rules of this House be temporarily suspended so a bill can be read for the first time in a signed to committee to committee is the objection. Judiciary non civil. For what purpose is representative Allen Powell rise. Mr. Speaker, I ask the rules of the people's house to be suspended in a bill to be read and a signed for the first time. Mr. Clerk, will you read the caption? A number of House Bill by reps and a poll of the 33rd and others to be titled, and act to amend, Article 2, Chapter 14 and Title 40 of the fiscal to Georgia and Tate relating the speed detection devices. On the gentleman's motion that the rules of the House be temporarily suspended so a bill can be read for the first time in a signed to committee is the objection. Motor vehicles. For what purpose is representative Todd Jones rise. To make a motion. State your motion. I move that the rules be temporarily suspended so that a bill may be read for the first time in a signed to committee. Mr. Clerk, will you read the caption? A number of House Bill by reps and a Jones, the 25th and others to be entitled, and act to amend, Article 1 and Chapter 9 and Title 40, 80 of the fiscal to Georgia and Tate relating to motor fuel tax. On the gentleman's motion that the rules of the House be temporarily suspended so a bill can be read for the first time in a signed to committee is their objection. Hearing none, technology, infrastructure and innovation. For what purpose is chairman Parsons rise. To make a motion. State your motion, sir. I move that House Bill 344 be moved from the committee on motor vehicles to the committee judiciary, non-civil, both chairman and agree. Thank you, Mr. Chairman. Mr. Clerk, will you read the caption? House Bill 344 by reps and a Parsons, the 44th and others to be entitled, act to amend, Code Section 46, 163, on the fiscal to Georgia and Tate relating to duty of driver of vehicle meeting or overtaking school buses. On the gentleman's motion that House Bill 344 be withdrawn from the motor vehicles committee and recommitted to the judiciary, non-civil committee is objection. Here none is awarded. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Vanessa, Ania, Kilgore. Recognizing February 27th, 2025 as Georgia Municipal Court Clerk's council date, state cap of erectizing commanding MEAG power on a 50th anniversary, honoring the work of the Georgia aerospace and defense industry. Commending the Make and Bib County Industrial Authority for its exceptional contributions, economic development, commending the Mercer Bears, football team for their exceptional 2024 season, commending, visit making for its outstanding contributions to increasing tourism and making Bib County. Congratulations, Savannah County Day School Clay Target team for winning the 2024 Georgia State Clay Target Championship, recommending communities and schools in Atlanta, commending the Duluth Fall Festival, recognizing commending Delta Airlines on Centennial anniversary, commending Georgia Triumph, professionals of Georgia Triumph Commission in the Georgia Triumph Foundation, honoring and commending, not sultan to dawn. The Council general of Israel to the southeastern United States, congratulating the Bremen High School Competition Chair-leading team for winning the 2024 1A-D1 Chair-leading State Championship, recognizing commending the Georgia Teachers Leaders Consortium, recognizing commending Sally Grubs for her dedicated services, chairwoman of the Cobb County Republican Party, recognizing February 26th, 2025 as Charter Schools Day, as state capital. Recognizing February 26th, 2025 as the cabinet at the State Capital, congratulating Ernestine Hunter, recognizing March 26th, 2025 as the executive function day at the State Capital, commending the restaurant industry at Georgia and recognizing February 26th, 2025 as state restaurant day at the State Capital, recognizing and commending, Talmud James on the occasion of her retirement. Commending Delta Ascigna Theta Sorority Inc. for its 112 years of service and recognizing March 3rd, 2025 as Delta Day at the State Capital, commending rain over cancer, incorporated and commending Clayton State University, recognizing March 4th, 2025 as Clayton State University Day at the State Capital, and for other purposes that completes the reading of the Privilege resolutions. Is there any objection to adopting the Privilege resolutions here in none of the resolutions are adopted? Members, remember if you have pages today, don't forget we're going to take some page photos and we finish up, we're getting close to that now. We're going to, we have some afternoon orders, members, we're going to start with Representative Mack Jackson, then we're going to Representative Wade and Representative Wilkerson and Representative Martinez. That will be our order. Thank you. We're going to recognize Representative Jackson, members of field, please join me in standing, members of field, give the gentleman the will, your attention. Please stand to show your respect. All members, give the gentleman the will, Representative Jackson and friends are recognized for an afternoon order. Thank you, Miss Speaker. Today I rise because on September 27th, 2024, a monster by the name of Hurricane Helene blew into Washington County around 3 a.m. in the morning. Little Harmony, Leandra Taylor, her little brother, little Derek Dequantella, was sleeping in that room when an oak tree crashed into that home. These two precious young lives were lost during the most disastrous storm in this decade. Thank you to Governor Kim, Speaker Boards, for visiting Washington County after the storm and for aid and supplies during the recovery relief. Ladies and gentlemen, would you join me in a moment of silence for two precious souls that will lost the Hurricane Helene? Thank you, Miss Speaker. I yield a will. Thank you, Representative Jackson. Thank you for how you supported your people. I saw you in action and there was much, much appreciated by your home folks there in Sandersville and Washington County. Thank you for being there with them. And I know as you led your church too as well and remembering all those folks. Thank you for what you've done. Our condolences go out to that family. Representative Will Wade recognized and friends. It's good to know. All right, the UGA caucus, if you are a UGA alum or represent University of Georgia, come stand with me please. UGA caucus alumni, whether you're a caucus or not, I don't think you're right. But all UGA friends of University of Georgia and Athens. So as they come up, I just got to say sometimes it's a great, well, every day is a great day to be a Georgian, but it's even a little bit more special when you don't have to speak. You just let that picture be a thousand words for you. So I think they've got something to show. That's right. Number three floor to went down to the Bulldogs last night and to my friend from Forsyth County, you're welcome. Go dogs. And the rivalry continues. No doubt. Representative Wilkinson and friends is recognized. Give the gentleman your and the way your attention. Please were about done here. The gentleman's recognized. Carolyn coming up. Madam later out. HPC you grads any HPC you grads HPC you wait just a whole pause just for a minute. We don't have a. You know what? HPC you graduate. Here you go. HPC you. Yeah, HPC you folks. Thank you, Mr. Speaker. They're coming. All right. I'm going to wait on told them. You may continue. The few the proud. Thank you, Mr. Speaker. Today I proudly sound as one of the many graduates of HPC use historically black colleges across the state and across the country have done an excellent job of educating many of your colleagues as a graduate of North Carolina, anti those are the proudest years of my life. Today I stay in here to thank our federal delegation for the work they've done over the last week led by Senator Ossoff once the funding for the 1890 scholarship program was canceled. Senator Ossoff led the the led the discussions to make sure that we got this funding reinstated so today on behalf of all of the graduates all of those students that are impacted I just want to say thank you and I'd also like to turn it over for one minute to my colleague who represents the great Fort Valley State. The Fort Valley State University is the second land grant institution here in the state of Georgia and so on behalf of all the faculty and staff and Dr. Jones and students of Fort Valley State University I serve as the foundation board member. We are very grateful to Senator Ossoff and all of our federal delegation for the work they did to restore that funding because we certainly need that and more at all land grant institutions here, especially the Fort Valley State University. The Fort Valley State University I'll tell you what you got to love it. Representative Martinez and friends give the gentleman your attention please. Thank you Mr. Feaker of the Fort Valley I like the way that sounds. Thank you Mr. Feaker I rise today to celebrate Black History Month and the Georgia Republican Council they are right here to my right Mr. Feaker. The GBRC is committed on the importance of restoring Black family culturally economically and morally. GBRC believes in family first job creativity educational choice criminal justice reform and pro life and I have a resolution recognizing the members of the Georgia Black Republican Council. Thank you Mr. Feaker thank you so much. That concludes our afternoon orders now we have some announcements. I'll tip for all these announcements by making sure everyone does all committee meetings will be pushed back one hour one hour unless your chairman tells you different but all committee meetings will be pushed back one hour. Chairman Scottens recognize for announcement. Yes sir. Thank you Mr. Feaker the committee on special rules will meet at four o'clock in four fifteen four fifteen. Chairman Smith recognize in Corbett Balinger work either following a Charlie Smith. Thank you Mr. Feaker good afternoon everyone the House Natural Resource Committee meeting tomorrow morning eight o'clock room six o'clock six CLOB. We will first have a subcommittee meeting.\n\non House Bill 351 and depending on how that turns out, it will be on our full agenda and then it will be followed by presentation by Water Policy Expert, Mark Masters. Thank you, Mr. Speaker. Chairman Corbyt, recognize for the announcement. Thank you, Mr. Speaker. The rule caucus will be meeting the Ag Building upon adjournment launches. We'll be served. Come join us. Thank you. Chairman Belinger, recognize for the announcement. Thank you, Mr. Speaker. Your judiciary, juvenile committee will be meeting this afternoon at two, as per the speaker's instructions being put back one hour. So we'll meet it two in room 403 upstairs. Please come. We're going to have an exciting presentation by Commissioner Bros on the Department of Human Services and de-facts as well as hearing a couple of bills. So to be very important meeting, look forward to seeing you all over you there. Chairman Warkies, recognize for the announcement. Thank you, Mr. Speaker. The industry and labor will meet in 506 at CLOB at two o'clock. We've got two bills. Thank you. Chairman Hagen's recognize for the announcement. Representative Gilly Ardure next. Thank you, Mr. Speaker. The House Rural Development Committee is scheduled to meet today at two o'clock. We will meet at three o'clock. If that changes, I will send you a text message so that you're aware of it. In room 515 and the CLOB. Thank you. Representative Carl Gilly Ardure is recognized for the announcement. Thank you, Mr. Speaker. Tomorrow is Representative of the Doxtown Kendrick Day. It is Savannah C. Food Sampler Day on the menu. Snowcrab, blue crabs. That thing from Grill Group or the Crab Fried Rice, a low-country ball just to name a few. You have a ticket on your desk. If you don't have a ticket, we can't click it. So please, that is for you to come and we're going to be serving you at one o'clock in two sixteen. Look forward to seeing you. Thank you, Mr. Speaker. Got to get a ticket. It is tomorrow. Got to get a ticket tomorrow. Representative Gaines. Recognize for the announcement. Thank you, Mr. Speaker. Senator Hatchett asked me to remind the appropriations committee full appropriations tomorrow at 8 a.m. We've got to talk about appropriations. I've got to listen to you. Okay, I am. Chairman Hatchett asked me to remind members appropriations tomorrow at 8 a.m. full committee for three bills to consider. Thank you, Mr. Speaker. Chairman Crowe. Recognize for the announcement. Thank you, Mr. Speaker. The Public Safety and Homeland Security Committee will meet this afternoon in room 506. And we're going to push back to three o'clock now instead of two with all of these meetings pushing back. So we'll be meeting three o'clock, room 506. And we'll also have a quick meeting tomorrow afternoon at three o'clock also to hear one bill. Thank you. Chairman Anderson's recognized for an announcement. Thank you, Mr. Speaker. The House Government Affairs Committee will meet this afternoon in 606 CLOB at four o'clock. Thank you. Chairman Weed, I recognize for an announcement. Thank you, Mr. Speaker. General Government appropriations of committee will meet in 341 at two o'clock. We have five compensation resolutions to hear today. Thank you. Chairman Chokus. Recognize for an announcement. Thank you, Mr. Speaker. The Small Business Development Committee will have a short meeting this afternoon, a call meeting room 403, capital 3PM. We're going to hear Bill 250. Thank you. Representative Dave Cooyay, recognize for an announcement. Well, mine is not about a committee meeting, but I want to remind all of you who are interested in the delegation trip to Nigeria that we'll be having a meeting next week, but the date is set. It's July 18th through the 29th. So get ready. Thank you. Thank you, sir. Chairman Stevens, recognize for an announcement. Committee on Economic Development Tourism will meet on a German and 230 capital for lunch and learn. Chairman Dickey. Recognize for an announcement. Thank you, Mr. Speaker. Tomorrow morning we will have a committee meeting. I heard of course, consumer fires at nine o'clock. I know it's got a conflict with another committee, but I think we've got some report business too. So nine o'clock tomorrow, Ag. Thank you. Where'd you say what's room? I don't know what Mr. Speaker, but I think it's 606. C-L-O-B. We were very short on meeting rooms by the way. We'll try to bill something a year too. Meeting your office until then. Chairman Noel Williams is recognized for an announcement. Thank you, Mr. Speaker. Banks and banking is going to be at two o'clock and 406 C-L-O-B. Banks and banking at two o'clock, 406 C-L-O-B. Thank you. Chairman Cooper. Recognize for an announcement. Thank you, Mr. Speaker. Members of the Public Health and Community Committee. We are meeting upon a German and there is a room change because there is a shortage. We're in 132 here in the capital downstairs on the first floor. 132. See you shortly. Thank you. 132. Rift in Holly. Recognize for an announcement. Thank you, Mr. Speaker. On behalf of our Georgia African Legislative Caucus, members, please tomorrow, if you feel free to come in with, of course, wearing your professional tire, but also bringing you some African regalia so that we can celebrate our African diaspora day with us tomorrow. We'll also have a very lively lunch tomorrow at the Coverdale Legislative Office Building Room 318. So bring your appetite and your attire with you. Thank you, Mr. Speaker. You're the will. Thank you, Representative. Chairman Thomas. Recognize for an announcement. Thank you, Mr. Speaker. This is just to remind everybody that the special committee and resource management will be having a meeting tomorrow at 341 CAP at 2PM. And that would be tomorrow at 2PM 341 CAP. Thank you. And that completes our work for the day. Other than if you have a page, meet us down front for page photos. Majority Leader of this House is recognized for a motion leader illustration. Thank you, Mr. Speaker. We believe that this House stand adjourned until 10 a.m. on Thursday, February 27, 2025. On the motion of the majority of this House stand adjourned until 10 a.m. Thursday, February 27, 2025. All those in favor say aye. All those opposed will say no. Those are the ones that count. I was looking at them. We're adjourned. Thank you, Ayes.",
  "updated_at": "2026-02-13T02:06:21.43734+00:00"
}