{
  "video_id": "d6O8fUBptpk",
  "url": "https://www.youtube.com/watch?v=d6O8fUBptpk",
  "title": "Opening Day Under the Gold Dome | Georgia House 2026 - Day 1 AM Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 1,
  "video_date": null,
  "duration_minutes": 59,
  "summary": "Here is a structured markdown summary of the Georgia House 2026 - Day 1 AM Session:\n\n# Overview\nThe Georgia House of Representatives held its opening day session, focusing on recognizing the work done by the Georgia Building Authority (GBA) to renovate and restore the House chamber. Key highlights included the use of Georgia-made carpet from Dalton and the replacement of the HVAC system dating back to the 1950s.\n\n# Key Actions\nNo bills were passed or referred during this session.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- The House recognized Gerald Pilgrim, Deputy Executive Director and Chief of Staff of the GBA, for the team's work in renovating the chamber.\n- A video was shown highlighting the extensive renovation project, which involved over 500 employees and 400,000 man-hours of work.\n- The Speaker thanked the GBA team, the Governor, and the First Lady for their dedication and support in completing the project.\n\n# Votes\nNo recorded votes were taken.\n\n# Attendance\nThe session maintained a quorum, with members present in the chamber.\n\n# Adjournment\nThe session adjourned, with the next session date not specified.",
  "transcript": "Thank you, Audrey.\nAnd we look forward to enhancing your work and your passion.\nAnd that's literacy in our state.\nThis house is committed to that.\nAnd we look forward to working with you on that.\nSo thank you.\nWe're going to do something up special.\nIf we're going to take a quick couple photos up here,\nand then we're going to move into something else.\nSo if you're remaining in your seats,\nmaybe with a little bit of conversation,\nwe'll move right along.\nThe House will come back to order, please.\nMembers, please return to your seats.\nWe have one more, one more, special recognition this morning, one more special recognition.\nWe need to thank the folks who are responsible for what we see in this chamber.\nIt's incredible work that's been done to bring this chamber and this building back to\nmuch of his grandeur that when everything was newly minted here, if you will.\nSo I've invited a gentleman that was a critical piece of everything he was done here during\nhis entire work over the last year.\nAnd that's Mr. Gerald, excuse me, Pilgrim, Deputy Executive Director and Chief of Staff.\nI hope you get paid for both of those.\nWith the Georgia Bill Authority, Executive Director Smith, I know you're taking care of him\non both of those titles.\nIt's good to have Marty Smith here as well with George GBA.\nYou probably noticed this people's house is looking a little bit brighter today and every\nessence of that word and that's because of Gerald Pilgrim in this team at GBA.\nIf you'll all look back and remember just a few months ago this chamber was covered in\nscaffolding from talk about a many of you visited here.\nThe chamber was with Gerald and his team, you know, things are about getting done, kind\nof like what we're doing in the house.\nWe have a job, but we get it done.\nGerald and his team had a job to get us back in this chamber on time with the work completed\nand guess what?\nNo guesswork.\nHe got it done.\nThank you, Gerald.\nThanks for your team.\nguess what else he did? He did it on the budget. Yeah. I thought that deserved a round\nof applause as well, Gerald. Thanks for that. But if you will, all join me in thanking Gerald\nand his entire team from the Georgia Building Authority who works so hard to make this\nspace, all that it is, all that it has been, so all Georgians can be proud of it.\nI know y'all are, and I'm certainly proud of this chamber.\nGerald has prepared a video for us that speaks and shows us, reminds us of the work that\nwas done here, and how fast-paced it was, and then he's going to make some comments\nand introduce some folks, I think, as well.\nSo with that, are we ready for the video?\nWe'll play the video afterwards.\nVideo afterwards.\nWell, Gerald, then I'm going to welcome you here\nto this microphone.\nShare with us.\nAnd Mr. Speaker, we did get the word.\nWe are going to work on the sale, too.\nWe've had some people already.\nSo if that's the only hiccup we got today,\nwe're doing well.\nI really wish you wouldn't have shared that about the budget.\nChairman Hatch is already making notes over there.\nAnd we still got a long way to go, Chairman.\nSo please, let's hold off on, take anything back yet.\nSo, but at first I would like to acknowledge Marty Smith, the State Property Officer, and\nthe entire just-ficking GBA team.\nSo not only is it just big, I have just GBA and SPC, but they only paid me one salary,\nJim, Mr. Speaker.\nSo, that's it.\nBut you're represented today by, with Marty, Gifton Pazley, Charlie Parrish, Chris Blackburn,\nand then the project manager on this team's Sebastian Cobb.\nSo thank you all.\nIn addition, we have a construction team, and that word gets used a lot, but this is\na true team.\nThey take pride in ownership in this project and we're very proud to have them here.\nThat team was led by Mike Makin with Balfour Beatty and his staff, such in Salandra with\nSG Contracting and his staff, Sean Moxley with Garbit Construction and his staff.\nSo what a wonderful job in there, the primary reason we're in here right now like this.\nThe architectural and engineering team was phenomenal on this project, a huge team effort\nthat started probably two days after we knew the budget was passed.\nWe started working on this project, securing the team, getting people going on that.\nRepresenting the architectural and engineering team led by Lamar Wakefield and Henry Kent\nWell, with Nelson Worldwide, Debbie Fritz, and the excellent interior designer, Robin\nKirkman, with Paige Now-Stantec, and a host of other preservationals, including representatives\nfrom Conway Noens, Sheer Structural, Farmsworth Group, Action Electric, specialty wood works,\nCarrollton Office Equipment in OFS,\nJC Lane Mechanical, Benise Dowling,\nStilltech, Nehemiah 101,\nJohn Canning, which was the Painting Contractor,\nfor all their nonstop work.\nI also want to do a special acknowledgement\nfor a former teammate, David Goodhead,\nwho helped us organize and got the team go\nand set up, we set us up for success.\nSo I'd like to personally thank them.\nThis team represents over 500 employees that worked on this project and over 400,000 man hours\npreparing and executing this project.\nFew facts about the project.\nSpeaker, you alluded to this a moment ago, but this is the first time in the history of\nthe Capitol that we were using American-made carpet and more importantly, Georgia-made\ncarpet from Dalton, Georgia.\nThe HVAC system that was here was replaced in the late 1950s.\nSo I think you're going to have a lot cleaner air.\nNot only were there 400,000 of 400,000 man hours of work on this job, they were all injury-free\nexcept for a few feelings.\nIf you know, you know.\nWhen the scaffolding was erected,\nthere was 110,000 pounds of steel\nused on the house floor alone.\nAnd there's 120,000 feet of wires and capals\nunder the floor in the house.\nThere's also over 200 gallons of paint use\nand approximately 1,500 linear feet of hand-painted canvas\nin just in the house chamber.\nI'd also like to thank you, Mr. Speaker.\nyou and your staffs work on this project,\nespecially the works of the efforts of Terry England\nand Chris LaRally, which really helped us with this project.\nSo thank you.\nI also want to express my appreciation\nto the First Lady of the House, Ms. Dale Burns.\nWithout her dedication to hard work,\nthis team would not have been successful.\nSo thank you, Ms. Stone.\nSo to wonderful pride in this and we're proud to work with her.\nBut on behalf of the team, I would like to close by thanking the Governor, the Senate\nand the House for entrusting us with this project.\nEach of us consider this honor of our lifetime for our career and personally.\nSo thank you, Mr. Speaker, for this opportunity,\nand we've got a little video for you.\nThank you, sir.\nthe\nThe whole day, the whole day,\nYou're still on, sweet song,\nKeeps your journey on my mind.\nYour journey on my mind.\nI said, and your journey on my mind.\nGod, God, the sound of you, the sound of you, the sweet and blue,\nCause moonlight through the past\nOver arms reach after me\nOver high smile, tindery\nStill in the peaceful dreams I see, the road be back to you.\nI said, Georgia, oh, Georgia.\nThat's pretty awesome.\nHow we y'all can get all that done in this period of time is really almost mind boggling.\nA lot of people, a lot of effort.\nThank you for all those involved in the work.\nPlease let your employees know how grateful we are.\nThe work here is exquisite.\nWe travel across this country looking at some of these\ncontractors, and I can tell you, our capital, as we all know,\nis one of the most beautiful capitals in the country,\nif not the most beautiful.\nBut what the work's been done here just really brings us back\nto the state of art, if you will.\nand it's the craftsman that work for you guys\nand working in the junction with GBA,\na big shout of thank you goes out to them\nand please express that to your employees.\nWe most appreciate their efforts\nto make this a very best it can be and you succeeded.\nFrom the Georgia growing carpet casing,\npretty cool stuff, right?\nFirst time ever.\nSo thanks to all of the resources\nassets we have in Georgia that will make this possible to all the areas\ncleaner than in here than 50 years ago when you first came here so we know\nthat as a child I know as a child so many wonderful things and improvements\nhere the brass polished up very very well how about your seats are they starting\nsettle in a little bit, getting comfortable? I don't want to hear it. It's all good, right?\nSo we appreciate all of the work Gerald again. Thank you and thank you to the team for everything\nyou've done to make this the very best place it can be and I thank you all succeeded. So thank you\nyou again. Let's give Gerald and the team one more round of applause if you will.\nMembers, if I can continue to have your attention, we have another special event today.\nWe have our doctor of the day, Dr. Hoffman,\nExcuse me.\nNow, this is the second Dr. Kaufman that's been a part of physicians of the day, doctors\nof the day here at this house.\nAnd I'm going to allow him to make remarks here, because I think it's noteworthy.\nThere's 70 years between he and his dad who served us in this house as doctor of the day.\n35 years for this Dr. Kaufman and with Dr. Kaufman is his daughter Sidney and she's a graduate\nstudent at Emory.\nLet's welcome Sidney to the Georgia, to the people's house.\nPublic health, that's close enough.\nWe'll let her come in and be a doctor today as well.\nSo at this point in time, just as a show of respect and appreciation, I want to ask Dr.\nKaufman if he would come up and bring a few words to us.\nDr. Kaufman?\nThank you.\nIt's quite an honor, and Mr. Speaker, thank you.\n35 years, boy, it makes me feel really old, but I guess because I am, but it's been an\nhonor and a pleasure to do this and it's honor to follow my father's legacy.\nHe was a special friend of all the legislators and always was a big fan of the system.\nMy daughter, I've been doing this 35 years, who I finally got somebody from my family to\ncome and I'm really proud of her going to grad school and she's almost done.\nThank God.\nNo.\nNo, but you know, the service we serve here and the people, it's surprising how many people\nwill actually need a doctor during the day here.\nBut really, it's great to have the doctor,\nbut we are certainly not the most important person here.\nThe most important person over there\nhiding in the corner, Julia, the nurse at the nurse day.\nThat's the one who deserves a little cry.\nThanks again and I hope to see y'all at next section.\nLet's go to the photo, let's go to the studio, come on up.\nmember is thank you for your attention.\nmembers, thank you for your attention and thank you for your respect for these great\nthat have been with us and made this day so special.\nAt this point in time, we'll recognize the Chairman Hilton,\nthe Chair of the Committee on Information and Autism.\nChairman Hilton.\nThank you, Mr. Speaker.\nThese brand new microphones work great.\nI don't know about you, Mr. Speaker,\nbut it is a great day to be a Georgian.\nUnderstood.\nYour Committee on Information on it,\nit took us nine months,\nbut we made it through all 700 pages.\nWe read the journal the previous day\nand we found it to be correct.\nThat was speed reading, all those 700 pages.\nIt could have been more, you'll get that in a minute.\nChairman Hilton, the chair of the Committee on Information and\nAudits reports that the journal of the previous legislative day has been read and\nfound to be correct, is there any objection to the spence with the reading of the journal?\nHere in the journal is the spence with, is there any objection to the confirmation of the journal?\nHearing none, the journal is confirmed.\nMr. Clerk, will you read the resolution establishing\nthe order of business for the day?\nRepresentative, a situation of 104th Moose filing\nB establishes the order of business\nduring the first part of the period, unanimous consents\nintroduction of bills and resolutions.\nFirst reading and reference of house bills and resolutions.\nSecond reading of bills and resolutions.\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of\nbusiness for the day?\nHere and none the resolution is adopted.\nFor what purpose is Representative Kelly rise?\nThank you, Mr. Speaker.\nI move that House Resolution 949 be withdrawn.\nremoves it to withdraw House Resolution 949, are there any objections?\nHearing none, House Resolution 949 has been withdrawn.\nFirst, reading the bills and resolutions, the clerk will read.\nHousehold 932 by Representative Saints of the 180th\nfile of the 147th bottom of the 73rd, Newton of the 127th\nto Loach of the 167th and others,\na building taught on act to amend code section 487,\n40.1 of the official go to George annotated,\nrelating a tax credits for business enterprises.\nWays and means.\nThat completes first readers.\nThank you, Mr. Clerk.\nSecond reading of bills and resolutions, the clerk will read.\nHouse bill 897 by Representative Al of the 50th, you believe the 111st Park of the 107th Miller of the 62nd Friday of the 122nd and others.\nA bill relating to public assistance House bill 898 by Representative Al of the 50th, you believe the 111st Park of the 107th Miller of the 62nd Friday of the 122nd and others.\nbill relating to public assistance.\nHouse bill 899 by represent Jenkins of the 136th bonner of the 73rd\ngovernor of the 123rd camp of the 135th.\nA bill relating to transfer on death deeds.\nHouse bill 8900 by represent Carson of the 46th and\nSeavod of the 34th.\nA bill relating to transfer of funds from the employment\nrehire system of Georgia to the Georgia Judicial Retirement System.\nHouse bill 901 by represent Carter of the 93rd,\nMitchell of the 88th Davis of the 87th in the Scofield with the 63rd.\nA bill relating to general provisions regarding preparation for\nConduct of Primaries and Elections, House Bill 902 by Representative Jones of the 25th.\nBear of the 24th, Williams of the 148th, Douglas of the 178th,\nKelly of the 16th, the bill relating to insurance.\nHouse Bill 903 by Representative Powell, the 33rd,\nwork Kaiser of the 157th, Tarvon of the 2nd, Jasper's of the 11th, McDonald of the 26th,\nthe bill relating to General Provisions regarding administrative procedure.\nHouse Bill 904 by Reps of Stilcox of the 53rd and Cooper of the 45th,\nthe bill relating to exemptions from the certificate of need program,\nHouse Bill 905 by reps of Richardson of the 125th Gunther of the 8th Lever of the 123rd.\nAbstration of the 104th per shed of 176 others.\nA bill relating to transfer funds from the employee retirement system of Georgia to the Georgia judicial retirement system.\nHouse Bill 906 by reps of Smith of the 41st, a bill relating to long term care on both the program.\nHouse Bill 907 by reps of the 47th burns of the 159th, the 29th jasper of the 11th,\none of the 32nd and others, a bill to amend the Completion Special Schools Act, House Bill 908 by representative of the 41st bill relating to compulsory attendance and elementary and secondary education, House Bill 909, by representative of the 85th Scott of the 76th Davis of the 87th Scott Field of the 63rd lemon of the 98th, a bill relating to conservation and natural resources, fire protection, safety and insurance.\nHouse Bill 910 by Representative Hatchett of the 150th Bill relating to state government House Bill 911 by Representative Cummings of the 39th Bill relating to\nlibel and slander House Bill 912 by Representative Wilkerson of the 38th Smith of the 41st Carter of the 93rd Ballard of the 147th Cocks of the 28th and others\nBill relating to grants for educational programs under the Quality Basic Education Act House Bill 913 by Representative Fleming of the 114th Gallard of the 19th\n13, Holcomb and the 101st Reaves of the 99th Crawford of the 89th.\nA bill relating to General Authority duties, procedure of the Department of Administrative Services relative to state purchasing.\nHouse Bill 914 by reps of the leptin of the 83rd Campbell of the 35th,\nthe Cummings of the 39th, Lym of the 98th, the bill relating to sex discrimination in employment.\nHouse Bill 915 by reps of the leptin of the 83rd, Lym of the 98th, the bill relating to law enforcement officers and agencies.\nHouse Bill 916 by reps of leptin of the 83rd and\nlimb of the 98th, the bill relating to the Judicial Council, House Bill 917 by reps of Jones of the 25th and Hilton of the 48th.\nA bill relating to elementary and secondary education, House Bill 918 by reps of Hilton of the 48th, Jones of the 25th.\nA bill relating to organization, schools, and systems under the Equality Basic Education Act.\nHouse Bill 919 by reps of P3 of the 166, a bill relating to outdoor stewardship, House Bill 920 by reps of\nRoberts of the 52nd Park of the 107th, Jones of the 143rd,\nhalf-dirt of the 130th, miles of the 126th and others.\nIt will relate to employment and training of peace officers,\nHouse Bill 921, by reference to the Park of the 107th,\nthe Queen of the 64th, Barry of the 56th,\nHoward of the 129th, Herring of the 145th and others,\nBill relating to the State Board of Education,\nHouse Bill 922, by reference to the Sains of the 180th,\nStevens of the 164th, Ford of the 173rd,\nDonald of the 26th, Powell of the 33rd,\nand others, Bill relating to general provisions,\nregarding identification, regulation of motor vehicles,\ntraffic house bill 923 by reps of Hagen of the 156 still talks to the 53rd\nrelief the 22nd gamble of the 15th the bill relating to pharmacies house bill\n924 by reps of Franklin 160 a pair to the 150 a Stevens of the 164th burns of\nthe 159th for the 18th the bill relating to the Georgia legislative\nretirement system house bill 925 by reps of Canada the 58th milliliters the\n60 seconds got at the 76 days more the 69th you believe the 140 first and\nothers you'll be able to lead to health insurance labor and industrial\nRelations, Mental Health, Public Officers, Employees, Revenue, Taxation, and Social Services, House Bill 926.\nBy represent the Campbell of the 35th.\nA bill relating to the general provisions relative to the General Assembly, House Bill 927.\nBy represent the Willis of the 5th Crawford, the 89th Miller of the 62nd,\nMcQueen of the 61st, Jackson of the 165th, the bill relating to insurance, House Bill 928.\nBy represent the Willis of the 55th Crawford, the 89th McQueen of the 61st, Jackson of the 165th,\nMiller of the 62nd, and Bill relating to insurance.\nHouse bill 929 by reps of leptin of the 83rd and limit the 98th, the bill relating to the department of public health\nHouse bill 930 by reps of leptin of the 83rd and limit the 98th, the bill relating to insurance, labor and industrial relations, revenue, taxation,\nHouse bill 931 by reps of leptin of the 83rd and limit the 98th, the bill relating to health.\nHouse resolution 905 by represent candidate of the 58th, will so the 55th base more of the 69th Jackson of the 68th and Queen of the 61st and other resolution encouraging the Department of Education to implement a\nAwareness campaign for grade levels K through 12 regarding blockchain, cryptocurrency and web three house resolution 947 by represent jester was the 11th\nResolution creating the house study committee on five points of martis station permit issuance house resolution 948 by represent Stevens of the 164th\nKelly of the 16th Hawkins of the 27th partner the 137 Newton of the 120's have the resolution creating a house study committee on\nPharmacy benefit managers and consumer access to prescription medications house resolution 950 by represent Kelly of the 16th and Smith of the 18\nResolution recognizing May 2025 as foster parent appreciation month House resolution 951 by Representative Kelly of the 16th and Smith of the 18th Resolution recognizing April 2025 as child abuse prevention month House Resolution 952 by Representative Willis of the 55th and Crawford of the 89th Resolution creating the House Study Committee on risk associated with hair straightening products through second readers\nYou\nThank you Mr. Clark, that concludes second readings of bills and resolutions.\nNow members, we have some business for the opening of this session, so I'll ask if you\nwill return to your seats.\nWe might just talk about something they're interested in in a minute, right Sam?\nExcuse me, representative, representative?\nWe'll be interested in this conversation,\nso members will return to your seats.\nI want to borrow that majority leader just for a minute.\nYou can have him back.\nMr. Epstration is recognized for the purpose of offering a resolution, Ms. Leader.\nThank you, Mr. Speaker.\nI move that this House adopt House Resolution 995.\nMr. Clerk, can you help us with that resolution?\nRead that resolution.\nHouse Resolution 995 by Representative Abstration 104th\nto notify the Senate that the House of Representatives\nhas convened.\nYou'd like to speak that resolution?\nAs a time, you can speak to it.\nYeah, come on, tell us exactly what you want to do\nwith the Senate.\nWe don't make sure the lights are on over there, right?\nYeah, we don't know what to expect over there.\nI, Miss Speaker, thank you very much.\nThis is just notifying the Senate that the House of\nRepresives has convened.\nThank you.\nThank you, Mr. Leader.\nWe look very much forward to working with the Senate on some very important legislation\nthis year.\nIs there any objection to adoption of the resolution?\nHere is another resolution adopted.\nIs there objection?\nSwayed, the resolution is adopted.\nMajority leaders recognize, for the purpose of offering another resolution, Mr. Leader.\nThank you, Mr. Speaker.\nI move that the House adopt House Resolution 996.\nMr. Clerk, will you read House Resolution 996?\nHouse Resolution 996 by Representative Abstration 104 to notify the Governor that General Assembly\nhas convened. Chair recognizes leaders speak to the resolution.\nThank you ladies and gentlemen of the House as procedural matter we each year\nnotify the executive governor of Brian Kim that we have convened this\nresolution proposes for House and Senate members to be appointed to notify\nthe governor that we are in session for the 2026 regular session of the\nthe Georgia General Assembly.\nAnd I ask for your favorable consideration.\nThank you.\nIs there objection to adoption of the resolution?\nHere none the resolution's adopted.\nOkay.\nSupport a committee of notification.\nOne point, the gentleman from the 107 first\nhas strict representative Joe Campbell.\nThe lady from the 40th representative Kimberley knew\nThe gentleman from the 6th representative Jason Ridley,\nthe gentleman from the 48th representative Scott Hilton,\nthe gentleman from the 3rd representative Mitchell Horner,\nand the gentleman from the 128th hour chapel of the day,\nrepresenting Mac Jackson.\nIf y'all will make sure the governor knows we're here\nin working.\nMajority Leader is recognized as purpose\nfor offering another resolution.\nMr. Leader.\nThank you, Mr. Speaker.\nI believe that this House adopt House Resolution 997.\nMr. Clerk, will you read the caption to House Resolution 997?\nHouse Resolution 997 by Representative Abstration of the 104th, calling a joint session of the House of Representatives and the Senate for the purposes of hearing a message from the governor.\nto us about this resolution, Mr. Leader?\nThank you, Mr. Speaker.\nEach year we have the state of the state address\nwhere that is now scheduled to be\nwith if you adopt House Resolution 997, this Thursday,\nJanuary 15th, 11 AM.\nI'd ask for your favorable consideration\nso that we can have the state of the state address.\nThank you.\nNow the address will be in this beautiful house chamber.\nIs that correct?\nOkay.\nIs any objection to the adoption of the resolution?\nHearing none, the resolution's adopted.\nThis may have been the one they were waiting\non, Mr. Leader.\nMajority leaders recognize for a motion.\nJust speaker, I move that this house adopt\nHouse Resolution 998.\nWe'll put this resolution up on the board.\nMr. Clerk, would you read the caption?\nHouse resolution 990A by Reps and Investigation\nof the 104th, a resolution relative to meetings\nand adjournments of the General Assembly.\nMajor Leader is recognized to speak\nto the resolution, House resolution 998.\nWell, thank you, Mr. Speaker.\nI am so excited to announce to you all here today\nthat the House and Senate have come to an agreement\nwith respect to a scheduling resolution\nfor a historic fourth year in a row\nto be announced the first week of session for all 40 days.\nThis is really exciting.\nWhen Speaker Burns was first elected as our speaker,\nhe supported having a full 40 day calendar.\nAnd I as a member, that was so important to me\nbecause I knew just what a strain that this is\non all of us to do this job,\nto be away from our families, to be away from our businesses\nfor others who depend upon us.\nAnd so to know when we're going to be in session,\nwhen we're not, and also to have potentially weekend days\nwhere maybe we're working,\nbut just in our district offices,\nnot here at the state cap and be able to plan\nto have Fridays off or a Monday off\nadjoining a week and was very important.\nSo the calendar that is up on the board\nand you all should have copies, I believe, at your desk\nwould have us in all weekdays this week.\nSo we'd have through day five\nand then we would be in budget hearings,\nthe appropriations committee, join appropriations hearings,\nwould begin next week.\nSo the Martin Luther King Jr. holiday would be on Monday\nand then Tuesday, Wednesday, Thursday would be those hearings.\nWe would have the session for the following four days\nand then into February.\nWe would be in session for Monday, February 2nd\nto Friday February 6th. We'd have four days in session February 9th to 12th, February 17th to 20th,\nwe'd be in session. Then a committee work day on Monday February 23rd as we anticipate\ncrossover day coming up. Then Tuesday, Wednesday, Thursday that week. The following week we'd have\nanother Monday committee work day and then committee work day the day before\ncrossover which would be Friday March 6th so that you can plan for in advance.\nThen from there we've got committee work day on Wednesday March 11th and the\nfollowing week a committee work day on Tuesday March 17th St. Patrick's Day which\nis very important to members from Savannah who may need to get back for important community\nevents.\nThe following week, we have committee work days on Tuesday, March 24th, and Thursday,\nMarch 26th, so that there's opportunity for hearings anticipating Sunny Die, which\nwill be Thursday, April 2nd, for capital staff, capital security for our constituents.\nwho want to come here to the Capitol, having a set 40-day calendar this far in advance is incredibly helpful and it means so very much to them.\nAnd so I would ask for your favorable consideration.\nI will share that a distinguished member of this chamber shared with me religious observance that needed to be considered as I was working on this calendar and negotiating with the Senate.\nAnd that date that was given to me was Passover satire on April 1st.\nAnd so we made sure that that was considered here.\nAs I understand, any other questions or concerns as to a satire which may occur on a second\nnight, that there's understanding and agreement that there's no issue with us having Sinidah\nthat evening.\nSo I'm a Christian, and I've previously been here on Good Friday for legislative work,\nincluding Sonny Die.\nAnd so I understand that we often have religious holidays and observances that we need to take\ninto consideration, but I believe that this is a fitting and appropriate 40-day schedule,\nand it's something I really wanted to bring to all of you here on day one, so you had some\npredictability for this session.\nWith that, Mr. Speaker, I'm happy to yield the well and ask the members for their favorable\nconsideration of a 40-day legislative schedule announced the first day.\nThank you.\nWould you really need to answer a question?\nYes, sir.\nI'll be happy to.\nGot it.\nOur ripsage, Ramon, at the turnout to your left, is recognized for a question.\nHey, I'm warning.\nAnd happy new year.\nAnd thank you for working on this because it really does play a huge difference for all\nof us.\nFor my understanding, there was sort of some outreach middle of December about EID, which\nas you know, I always joke about Ramadan being during session, it's a whole 30 days.\nI have kept my crankiness to a minimum, but the, for my understanding, the issue is actually\nFriday, March 20th, which is EID the end of Ramadan, and usually there's like prayers\npeople travel, see family, and we do have staff that could be impacted.\nIs there any way that we could potentially shift the committee work day that week and\nand then just switch them out, essentially.\nWell, to the representative, I respect your question.\nThis issue was not brought to me until this morning.\nAnd it was something that I actually brought up initially,\nas it was being discussed a moment ago.\nThe, as I understand it, religious holidays,\nsuch as this holiday that you've referenced,\nmay be over several days.\nwhat I would just say is that holidays that are celebrated,\nmaybe at different times of the day,\nthat that understanding and accommodation\ncan be made certainly.\nSo that if there's an evening time celebration\nor something like that, we may not be in session.\nBut I would just say that this schedule's\nbeen very carefully vetted.\nI have taken all input as it has been shared to me.\nAnd if a member has concerns about a specific day,\nI would just ask you bring it to me\nin advance of the first day,\nbecause I'm trying to get you a schedule here on the first day\nso you can plan for it well in the session.\nWith that, Ms. Speaker, I'll yield the well\nand ask the body's favorite consideration.\nHow about if I get you to answer a couple more questions?\nYes, sir.\nI'll be happy to have you.\nRepresentative Luppton is recognized for a question.\nThank you so much.\nOh, my goodness, these new mics are a thing, aren't they?\nThank you so much, Mr. Majority Chair,\nMr. Majority Leader, for providing us this.\nAnd thank you, Mr. Speaker, because I know that this is an effort that you have done.\nI've heard the horror stories of people who have served before me, who have been trying\nto schedule bits and pieces at a time, so I really am grateful for this.\nI just wanted to ask that in light of what my colleague has brought, if this can't be\nchanged this year, I would just like to make a request that this be taken into advance,\ntake it into advance notice for next season,\nother legislative sessions.\nI have an open door policy in my office.\nAny representative wants to come see me\nabout any issue you're welcome to do so?\nOne thing.\nThank you so much.\nRepresentative Lynn Smith, up, sir,\nI'll recognize for a question.\nThank you, gentlemen, yields.\nYes, ma'am.\nIs it not true that this is my 30th year\nin the General Assembly?\nYes, ma'am, if the lady so states.\nIs it further not true that this is the first time I've seen us have consensus on a calendar\nand have it voted on the very first day of session, I commend you for your work.\nWell, I mean so much to me, the Chair, ladies, comments.\nI will just say that this would not have been possible without Speaker Burns leadership\nand support to see this through and a great working relationship with Majority Leader\nJason Ann of Attarte who's now serving on leadership over in the state Senate\nI was proud that we could work together to come to an agreement and present this to you here on day one\nMiss speaker if there are no further questions I want more from the minority leader\nRepresentative hegly is recognized for a question\nThank You mr. Speaker does the gentleman you? Yes, ma'am. I too want to\nconvey my thanks for this schedule, but I also want to\nto suggest that as we move forward, I'm happy that the majority leaders get together, but\nwe need to place an opportunity for the minority leaders to have some input before the schedule\nis printed.\nThank you so much.\nWell, Madam Leader, I'll just say you and I have always been able to communicate very\nwell, look forward to continuing that in the future.\nAnd in all seriousness, I know we have talked in previous sessions about, and your anniversary\nis April 4th.\nThat was a weekend, I didn't have to be concerned about that date this year.\nThanks to the body, thank you, Mr. Speaker, and I ask the body's favourable consideration of House resolution.\nWith the gentleman here for one more question.\nYes, sir, and now to finish him up, I promise.\nRepresentative Cannon has recognized for a question.\nThank you, Mr. Speaker.\nMr. Leader, I think transparency is super important.\nThere were certain members that were reached out to and asked about a certain day.\nThere were other members that were not reached out to, including the minority leadership team.\nAnd so, to see a press release really expressing that everyone had been conferred was difficult.\nThe question is, would you consider making a amendment for the date of March 20th to understand\nthat many Georgians observed the lunar calendar of which eat falls?\nWell, with respect, I just need to set the record straight.\nI took input from anyone who was willing to communicate with me about this in advance\nand the member who asked for us not to be in session on the date of a religious observance.\nThat was brought to me and we made sure that that was addressed in the calendar.\nSo I have always felt I've operated in very open and fair manner.\nWhat concerns me about this debate is the 40 day calendar may be very difficult to do\nin the future if getting something, getting a calendar before you becomes controversial\nin this sense.\nI would just ask that any member who has concerns about a specific date, please bring it to me\nwell in advance.\nWe can take into consideration our very best to continue to provide you with a 40-day\ncalendar.\nWith that, Mr. Smith.\nMr. Leader, there's one more question.\nWould you use a question for me?\nYes, sir.\nSo I think there are 180 members of this house.\nLast time I checked.\nYes sir.\nI don't want to thank you and please every one of them.\nSo you're doing a great job within the confines and I definitely understand those confines\nof working with the Senate to try to hammer out, if you will, a calendar that works with\nthe appropriations chair.\nSo we can get our most important job done and that's a budget and have adequate consideration\nof that budgetary cycle that we go through here.\nHaving all members of this House heard an opportunity to be heard on committee days.\nNo less than a almost a miracle working with the Senate.\nI'll just be honest about that, Mr. Chairman.\nMr. Leader, excuse me.\nSo I certainly as a member of this House appreciate.\nI'm sure the staff does, public safety does,\nand all of those that support us in this house\nsupport your work on bringing together\na lot of different opinions and views\nand being respectful of all the members of this house\nand everything's supported all of us\nand our personal lives and our lives as legislators.\nSo I just wanna express to you and say thanks\nfor your hard work.\nIt's been a pleasure working with you on this calendar\nand I hope this house will adopt this calendar today.\nI have confidence they will, so that's my question.\nThank you for your work, continue to do the good work,\nand let's see what we can do with the Senate.\nYou think you have some success over the Senate\nwith this calendar, Mr. Leader?\nI sure hope so, Mr. Speaker.\nAnd thank you for your comments.\nI couldn't have said it better if I tried.\nThere is a tremendous amount of work\nthat goes into being able to present this to you.\nAnd I'd ask for your favorable consideration\nso that we can get this adopt to get it transmitted to the Senate so that they can pass it as well.\nThank you, and I yield the well.\nThe leader is yielded the well.\nMembers, thank you for your questions.\nIs there any objection to adoption of the resolution?\nThere is objection.\nDoes the gentleman move?\nGentlemen moves, all those in favor of adopting the resolution will vote yes.\nThose opposed will vote no on the resolution to adoption of the resolution.\nMr. Clerk, were you in a lot of the machine?\nI have all members voted.\nhave all members voted it's so Mr. Clerk will you lock the machines on the adoption of\nthe resolution the a the yays are 150 and the days are 27 the resolution has been adopted.\nfor what purpose to the leader of the station rise?\nMake a motion.\nState your motion.\nMr. Speaker, I move that House for Resolution 998 be immediately transmitted to the Senate.\nSpeaker, excuse me, leader of the station moves that House for Resolution 998 be immediately transmitted to the Senate.\nIs the objection?\nHere in none of the so ordered.\nThe clerk will read a cap, read the caption to a group of privileged resolutions, Mr.\nDr. Clark, honoring the life and memory of Claire and Bartlett, honoring the life legacy and\nservice of Dr. Tammy Lamar Blackwood. Recognizing commending, Ms. Ernestine Denise Wilson,\nrecognizing commending, and teacher of point dexter upon being named, the Georgia Association\nConservation District's 2025 Supervisor of the Year.\nRecognizing and commanding Mr. Lewis Boss and for other purposes, that completes the\nreading of the Privileged Resolutions.\nIs there any objection to adopting the Privileged Resolutions?\nvery none the resolutions are adopted.\nWe do have some announcements today.\nReps of the aisle is recognized for a very, very important announcement.\nThank you, Mr. Speaker.\nIt's that special time of year again.\nYou might have noticed that the bloodmobile is right outside the Capitol just to make it easier\nfor people to donate blood.\nAgain, I recommend that people hydrate well\nbefore they go donate blood.\nI would recommend you drink two full bottles of water\nbefore you go in and get one of their gatorades\nwhen you finish up, but it's easy.\nI gave this morning, as you can see, it took me\nabout 40 minutes, and that was with some dead time\nof them, chitchatting with me.\nThis year, I just wanted to also make a note\nthat I would like to dedicate this blood drive\nwith blood cells to the memory of chairwoman Mandy Ballinger and to the mom of one of our\ndear friends Omar Crawford is mom Carolyn Crawford.\nWe recognize that cancer is a thief and donating blood buys families more time.\nThank you, Mr. Speaker.\nI yield well.\nDid everyone understand the blood\nmobile well is here today so do\nyour duty go get blood thank you\nrepresentative chairman Hawkins is\nrecognized for an announcement thank\nyou mr. Speaker there will be a\nmeeting of the health committee of\ntwo o'clock and four o'clock we will\nhave five presentations. Very important and very interesting. Thank you, Mr. Speaker.\nThat completes our announcements. Members, I looked at your attention for one more minute if you don't\nmind. I was going to do it earlier, but I think now is the more appropriate time. I want to thank\nRepresentative Williams for organizing the Tillman Convocation yesterday.\nHow many years is this now, Representative Williams?\n30 years total, we've come together on Sunday afternoon before the session begins.\n23, the representative Williams is taking the lead on that, be better tomorrow.\nSo I want to remind you all we lost one of our members, if you'll stand with me, please.\nA much beloved member of this house, much beloved member of the her community, and a much\nloved family member by her son Henry, y'all remember Henry, he's been here in this house\nmany, many times, by our husband, Judge D. Morris, who were with, they were both here with\nus yesterday, as we honored the life of cheerleading, many, many, many of you. What a great\nmember of this house, what a great advocate for children in this state, for those, a great\nadvocate for those who suffer from domestic abuse. Not only in this house, but in the\nThe South Eastern United States and in America, as she participated in SLC in CSL and leadership\npositions to make sure she brought attention to what her passion was, was imported to us,\nbut more importantly, it's reported, imported to whom we are as a people.\nShe was in Birmingham for SLC just a few months before her death.\nout their fighting. Still out their fighting. Encouraging us all to do better. So if you will\nbow with me for a moment of silence for our dear deported friend, if I want to thank\nyou for those who stand strong, thank you for a lane-many-belliger to be a part of this\nfamily. Lord, thank you. We ask your blessings on her family. We ask your blessings on those\nwho hold her memory dear Lord. And as we all know, the story seldom told is soon forgotten.\nThis all remember many, many Bellinger. Her contributions to some of the important things in our\nstate. Amen. Thank you, members. Majority leaders of this house has recognized for a motion.\nI move that this House stand adjourned until Tuesday, January 13th, 2026 at 10 a.m.\nAll the motion of the majority leader of this House stand adjourned until 10 a.m. Tuesday, January 13th, 2026.\nAll those in favor say aye, all those opposed, no.\nWhen even close, the House have it.\nWe are adjourned.\nThank you.\n",
  "updated_at": "2026-02-12T01:29:27.673148+00:00"
}