{
  "video_id": "d7Mrth0wNtY",
  "url": "https://www.youtube.com/watch?v=d7Mrth0wNtY",
  "title": "Legislative Day 3 | 2024 Session | 1/10/2024",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2024,
  "day_number": 3,
  "video_date": null,
  "duration_minutes": 47,
  "summary": "Overview:\nThe session transcript provided does not contain any substantive legislative actions or discussions. Instead, it primarily consists of routine procedures, introductions, and ceremonial activities. There were no bills passed, referred, or introduced during this session.\n\nKey Actions: \nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The senator from the 28th district read various historical facts and \"fun facts\" about the day, including national holidays like \"National Take the Stairs Day.\"\n- The Senate had a morning devotion and the majority leader introduced a guest pastor to provide the opening prayer.\n\nVotes:\nNone detected.\n\nAttendance:\nThe session transcript includes the taking of the roll call and excusing of several senators for being absent.\n\nAdjournment:\nThe transcript does not explicitly state when the session was adjourned or the date of the next scheduled session.",
  "transcript": ".\n.\n.\n.\nGood afternoon. Good afternoon. Good afternoon. Good afternoon. The time for\nGavini has arrived. The Senate will come to order at this time. I will ask all\nunauthorized personnel to exit the chamber. I recognize the senator from the 28th.\nGood morning, Mr. Right. Good afternoon, Mr. President. Good to see you today.\nAnd it's a sad day here in the Georgia State Senate, for today we don't have any pages.\nAnd so rather than introduce pages, I'm going to shame all y'all by reading some fun facts\nin this day in history.\nSo on this day in 1776 Thomas Payne published Common Sense, a 50 page pamphlet calling\nfor a war of independence that would become the American Revolution.\nOn this day in 1946, United States Army Signal Corps successfully conducts Project Diana,\nwhich was what you ask, bouncing radio waves off the moon and receiving the reflected signals.\nIn 1984, the United States and the Vatican established diplomatic relations after a 117-year break.\nAnd in better news, in 2012, Nathan Dill was inaugurated as the 82nd Governor of Georgia.\nNow, today is a beautiful day.\nIt is National Save the Eagles Day.\nbittersweet chocolate day. It's National House Plant Appreciation Day, National\nOysters Rockefeller Day, and it's National Take the Stairs Day. So Senate\ncolleagues, if you don't want me to read that every single morning for the next\n36-7 days, I would encourage you to promote the page program back home and let's\nLet's get some pages up here to help us continue our business.\nMr. President, the journal has been read and found to be correct.\nAll right, Senator, we appreciate that and we appreciate you letting us all be notified\nof how little they have to do in Washington with all those national holidays.\nNational Stairs Day, that was my favorite right there.\nAll right, so is there objections,\nsince there's a reading with the journal,\nchair here's none, the reading of the journal's\nspins with, is there objection to the confirmation\nof the journal, chair here's none,\nand the journal is confirmed.\nAll senators who have bills and resolutions introduced,\nplease bring them to the Secretary's desk.\nFirst reading references of Senate bills and resolutions.\nSecretary.\nSenate Bill 332 by Senator Robertson of the 29th and others,\nThe Bill to be entitled to amend Code Section 15, 1832 of the OCGA reading.\nShould issue.\nSenate Bill 339 by Senator Summoners of the 13th.\nThe Bill to be entitled to enact to authorize the assessment and collection of technology.\nState and local government.\nSenate Bill 340 by Senator Kirkpatrick of the 32nd and others.\nThe Bill to be entitled to enact to amend Code Section 4883 of the OCGA.\nFinance.\nSenate Bill 341 by Senator Kirkpatrick of the 32nd and others.\nThe Bill to be entitled to amend various titles of the OCGA.\nGovernment oversight.\nSenate Bill 342 by Senator Robertson of the 29th and others.\nA bill to be entitled to an act to amend Article 2 of Chapter 5 of Title 22.\nChildren and family.\nSenate Bill 343 by Senator Robertson of the 29th.\nA bill to be entitled to act to create a new judicial circuit for the state of Georgia to be known as-\nJudiciary.\nThat can lead to the Order, Mr. President.\nMr. President, the Senate Committee on Regulated Industries and Utilities has had under consideration\nthe following legislation and has instructed me to report the same back to the Senate\nwith the following recommendation that Senate Bill 172 do pass by substitute, respectfully\nWe submitted Senator Calder of the 46th District Chairman.\nI complete the order, Mr. President.\nIt is now time for the morning roll call, afternoon roll call.\nAre there any motions to excuse?\nChair recognizes the Senator from the 33rd.\nThank you, Mr. President.\nAnd good afternoon, y'all.\nAsk for unanimous consent to excuse the senator from the 38th for business outside the Capitol without Jackson 30th Center from 38th at a skews\nCenter from 29th\nSmith President asked for unanimous consent to excuse the senator from the 56 for business outside of the Capitol\nVal Jackson senator from the 56 is excuse\nSecretary will call the roll senators to verify your presence by voting the yay switch secretary will launch the machine\nYou\nYou\nSenator from the 41st for what purpose do you rise?\nAs for unanimous consent to excuse the senator from the 9th.\nThe 9th?\nYes.\nWithout objection, Senator from the 9th is excused.\nIt is now time for our morning devotion.\nAll senators, please take your seats and cease all conversation.\nI don't ask that the doorkeepers secure the chambers at this time.\nI now recognize the majority leader, Senator from the 51st,\nto introduce our pastor today and leaders in the Pledge of Allegiance.\nSenator?\nPlease stand for the Pledge of Allegiance to our flag and then the Georgia flag.\nA Pledge of Allegiance?\nTo the flag of the United States of America and to the republic of which it stands, one nation\nunder God, indivisible, the liberty of justice for all.\nAnd the Georgia flag. A Pledge of Allegiance.\nTo the Georgia flag, to the principles of which it stands, which wisdom, justice, inauguration, courage.\nThank you and be seated.\nIt's my pleasure to date introduce a personal friend of mine I've known for over 20 years\ninstead of giving you all the good stuff that I know about him I will read the formal introduction\nof Mr. Doug Sherrill.\nDoug was born and raised in Wayneville, North Carolina.\nHis father served in the Vietnam War and became a successful businessman in the fiber\noptics industry, leading Doug's family across the country all the way from Texas to Massachusetts.\nimmersion in many different communities along with his southern Baptist raising shaped\nDoug's view of our country from an early age. As Doug entered high school he was appointed\nto the Boy Scout or the Boy State Model legislature program and quickly became one of the most\nsuccessful debaters in public speakers in the state of Texas. He went on to attend the\nLouisiana Baptist University and the University of North Georgia where he earned his bachelor's\ndegree in political science and business followed by his master's degree in\npublic administration. He continued his work at North Georgia for the past four\nyears as a lecturer. Doug served as youth pastor as ordained minister prior to\nmoving to DeLonica, Georgia, where he began a successful business as a land\nsurveyor. Doug has generously served the Lumpkin County community as Lumpkin\nCounty surveyor and later Lumpkin County's commissioner. He is also a\ngraduate of Leadership Lumpkin. He is a graduate of Republican Leadership of\nGeorgia and he serves on numerous boards and charitable organizations in the\ncommunity. Through his many contributions to our community, he remains a go-to\ncontact for other leaders across both Lumpkin County and the entire state of\nGeorgia. Doug and his wife Laurie have been married for 25 years. They have four\nchildren and the remain active in the ministry at the Lighthouse Baptist Church\nand Dawsonville, Georgia.\nSenators, please welcome Reverend Doug Cheryl\nand lend your ears and your heart to his words\nas he comes to us today.\nThank you to my Senator Gooch.\nI appreciate the kind words.\nI was thinking that Senate Bill 1, this session,\nI didn't get to lobby my Senator,\nbut would be to declare that the Georgia Bulldogs\nwere number one in the country.\nI did notice in my invitation to speak today that it said no singing and so I wasn't sure\nif that was because someone had heard me sing before or if Senator Gooch did not want\ncompetition.\nI want to read from God's Word today out of the book of Ecclesiastes.\nI spoke last year about the motto for the state of Georgia and I want to hone in if you\nwill allow me just a few moments on the word wisdom.\nSolomon said this beginning in verse 13 of Ecclesiastes 9.\nThis wisdom have I seen also under the sun and it seemed great into me.\nThere was a little city and few men within it, and there came a great king against it and\nbesieged it and built a great bulwarks against it.\nNow there was found in it a poor wise man, and he by his wisdom delivered the city.\nYet no man remembered that same poor man.\nThen I said, wisdom is better than strength.\nNevertheless, the poor man's wisdom was despised and his words are not heard.\nThe words of wise men are heard in quiet more than the cry of him that rule of among fools.\nWisdom is better than weapons of war, but one sinner destroyeth much good.\nThe Bible here tells us that there are four qualities to this poor wise man.\nBut we often think that wisdom comes in the form of great leadership among the rich,\nthe wealthy, the known, and yet Solomon said who had more riches than we can imagine.\nHe said, I saw something incredible in my life.\nI saw a poor man with wisdom who saved his community, perceptive poverty.\nwisdom in unexpected places. Solomon said, we need to find these unexpected places and\nmay I encourage you today as our leaders in this great state find wisdom in the unexpected\nplaces. Wisdom is not often found amongst our peers but among outside arenas. We find\nwisdom in children. They have great stories to tell us and often they can cause us to\nto stop and pause and consider a moment.\nThey're the senior citizens who have lived and seen the history,\nand may we not forget to incline our ear.\nThere's the struggles and challenges\nthat we all face in life that can teach us\nand build wisdom as we lead.\nThe great poets of old found great wisdom\nby simply sitting outside and observing nature.\nlooked at the mountains, they saw the animals\nat how they would commune.\nWe need to stop and pause and seek wisdom.\nEveryday observations as you walk through the halls\nof this great capital,\nmay you find the wisdom\nthat this poor wise man found.\nNumber two, he had prudent planning.\nIt's obvious that in a small city, this poor man\nwas able to overcome apparently a king\nwho had formed a great army to besiege the city\nand in his wisdom he was able to overcome and protect the town.\nHow in the world was this possible?\nHow did he make this happen?\nI could give some maybe an illustration\nof a plausible outcome of what he did,\nDespite the city's limited resources,\nmaybe he ingeniously devised a plan\nto divert and ration the water,\ncreating a façade of scarcity.\nThis cunning strategy fooled the advancing army,\nled by the king into believing\nthat capturing the city would yield little spoils.\nBe wise as you lead.\nBe wise as you legislate.\nBe prudent in your planning.\nPlace the importance of strategic thinking\nand planning upon our actions.\nNumber three, he had a powerful preservation.\nIn verse number 17, it says the words of wise men\nare heard in quiet more than the cry of him\nthat rule with among fools.\nSometimes we find, or more often than not,\nwe find great wisdom in the quiet moments.\nNot in the boisterous sounds, not in being loud,\nbut in the quiet moments.\nIt's often the individual that speaks the least\nthat so many folks say, hey, he may have something\nimportant to share and something to say.\nSo this poor man employed diplomatic skills\nand in spite of what the world says about wealth,\nabout strength, Solomon said wisdom is better than strength.\nWisdom defeated the army.\nAnd verse number 17, wisdom is better than weapons of war, a praiseworthy perspective.\nYou know the saddest part of the story in my eyes and my view is that this poor man was\nforgotten.\nHis wisdom, what he did was forgotten.\nWe all seek to attain a certain level in society.\nWe appreciate a name.\nWe appreciate an obligation or being called today is such an honor for me to even be here\nand speak today.\nBut here was a poor man that saved his city and no one remembers it.\nThe Bible over and over says there arose a generation that knew not Joshua, that knew\nnot Moses, that knew not Joseph.\nNow often we forget those in the past who have done so much for our present.\nThe greatest example I can provide you of the poor man who was wise is Jesus Christ himself.\nFor the Bible says in him are he had all the treasures of wisdom and knowledge.\nThe Bible says he became poor that through his poverty we might be made rich.\nAnd yet so often we forget the one who is wisest above all.\nAs I think about each of you and what you embark upon this year, I truly do pray for you\nand pray for this session that God would grant you true wisdom.\nWe need good leadership in this state and I pray that God would grant each and every one\nof you, the wisdom it takes to lead and to legislate. Let's pray.\nGracious and eternal God, as we stand before you, we are humbled by the wisdom found in\nunexpected places, much like the poor wise man of ecclesiastes. We seek your guidance\nfor our journey of leadership in acknowledging that true wisdom comes from you alone. Grant\nGrant us, O Lord, the humility to recognize that leadership is not about status or wealth,\nbut about serving others with a heart filled with compassion.\nMay we, like the poor wise, man, find strength in simplicity and richness in humility.\nLord, teach us the strategic planning that comes from seeking your guidance.\nHelp us to navigate the complexities of leadership with prudence seeking solutions\nthat bring peace, justice, and unity.\nIn times of doubt, remind us that wisdom is a gift from you.\nIn our pursuit of it, may we bring glory to your name, may our leadership reflect the\nvalues of your kingdom, justice, mercy, and love.\nLord, we lift up our responsibilities, decisions, and the people we lead into your hands.\nMay your wisdom be our guide, may our leadership be a testament to your grace and goodness.\nMay God bless the great state of Georgia, in Jesus' name we pray.\nAmen.\nAmen.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nIf I can have everyone's attention real quick, everyone's attention.\nWe always like to recognize our doctors of the day and it's an honor to have our friendly\nface here.\nWe've seen him hit down here many times and he's a guest of the Senator from the 16th\nhere and I'll call him the Senator from the 16th to introduce the doctor of the day.\nGood morning, or afternoon, have to remember where we're meeting as far as that.\nDr. Chris Walsh is one of our own down in Fayette County.\nHe is an orthopedic surgeon with the resurgence orthopedics and specializes in hand and elbow,\nbut he assured me that he could handle anything else that breaks our needs fixing while he's here.\nSo that's a good thing.\nHe received his medical degree from the University of Pittsburgh School of Medicine in Pittsburgh, Pennsylvania\nand completed his residency with Case Western Reserve University in Cleveland, Ohio.\nHe serves on the board of the Georgia Orthopedic Society and its past president of the Georgia Society of ambulatory surgical centers\nand serves on the Physicians Performance Enhancement Committee at Piedmont Fayette Hospital.\nDr. Walsh served as a U.S. Navy Reserve and was an active duty baton surgeon\nof the Second Marine Division, where he was deployed to Operation Desert Shield in Saudi Arabia and Iraq.\nSo that was a long time ago, but still a very major time we thank him for his service in the military,\nbut also thank him for his service here with us. Thank you.\nI always appreciate coming down and enjoy the opportunity for a change of pace and to\nsee how you all do your work here.\nSo thanks for having me.\nAll right.\nThank you.\nThank you.\nYou\nWe have a special guest here today.\nIt is honored to have the Deputy Administrator, United States Small Business Administrator\nhere today and and my good friend and small business owner himself from the\nSenator from the fifth will introduce him and and we're glad to have him here\nand and I want to treat him treat him well because we love our small business\nand everybody associated with it so Senator thank you mr. President good\nGood afternoon, friends and colleagues.\nI'm honored to welcome my friend, Deputy Administrator of the United States Small Business\nAdministration, Delua Said, to the Georgia Senate.\nPrior to his appointment to SBA, he worked at the State Department where he championed\nAmerican businesses as special representative for commercial and business affairs.\nAs the State Department's top commercial diplomat, Deputy Administrator Saeed advocated\nfor U.S. companies to compete and win a broad and help ensure U.S. competitiveness in\nmarket across the globe.\nBefore joining the Biden administration, Saeed was CEO and Lumietta, the AI healthcare\ncompany focused on reducing healthcare cost and improving patient's outcome.\nThe lower side has driven civic effort at the federal state and local level, focusing\non economic growth and entrepreneurship.\nAs the founding chair of the California Entrepreneurship Tax Force with the Governor's Office of Business\nand Economic Development, Saeed promoted inclusive entrepreneurship, his serve on prison\nObama's White House Commission on Asian American and Pacific Islander A.P.I.'s and chaired\nthe White House initiative on A.P.I.'s economic growth committee. In that role, SAID laid\nthe administration engagement with small business across the United States after the passage\nof the American Recovery and Reinvestment Act of 2009. In 2020, SAID was stepped by the\nSan Jose California mayor Sam Ricardo to help lead Silicon Valley's\npandemic economic recovery as a member of the Silicon Valley recovery\nroundtable. Said holds an MBA from the Wharton School of the University of\nPennsylvania and unBA in economics and computer science at the University of\nTexas in Austin. The most importantly he was confirmed by parties with the\nby partisanship at the United States Senate.\nPlease give him a warm Senate welcome to my friend,\nDeloitte Heed.\nThank you so much, Senator Maun, for your very kind invitation.\nThank you so much, Governor Jones, for having me here\nand the leadership.\nAnd it's an absolute honor to be speaking to you\nin this August house.\nI'm here to talk about small businesses\nand entrepreneurship.\nthat I can say safely, everybody loves our small businesses.\nAnd we'll share with you what the SBA is doing\nthat I have this so much privilege to help lead.\nNow we know that Georgia is one of the top places\nto do business in the United States.\nI have done as an entrepreneur in a business person.\nI've done business in Georgia,\nI've done business in with folks in Atlanta.\nAnd I can test to you personally that we know what's\nhappening here is not only helping you in the country,\nfrankly, it's helping change the world.\nNow, these are extraordinary times in our country.\nWe are recovering from a pandemic.\nWe see recovery, but not too long ago.\nSo many in our communities were affected,\nespecially small businesses.\nClimate change, you know what that is doing\nin many communities across our state and nation.\nAnd of course, geopolitical challenges\nfrom the Middle East and Ukraine.\nThe President has responded to this moment\nwith an incredibly vigorous agenda.\nIn 2022, we passed, for most part, bipartisan legislation\nthat is helping us build industries of the future.\nEVs, batteries, semiconductors.\nI can tell you, somebody who spent 20 years in Silicon Valley,\nwe stopped doing semiconductor advanced manufacturing\nin this country a long time back.\nThat is starting to come back.\nAnd to share with you stats that I'm sure you know,\nhere in Georgia, $37 billion of investments\nis coming into advancement and manufacturing right here\nto this great state, in part because it's bipartisan\nhistoric legislation.\n$9.6 billion in infrastructure spend\nthat's going to improve our roads and bridges in Georgia\nimproving our airports.\nA couple of projects that I think are phenomenal.\nHyundai, $5.4 billion investment in the state.\nWe saw the governor.\nI know you joined him when they opened the plan here.\nQ-cells, which is going to soon be producing solar panels.\nAnd I was struck when I read this fact about Q-cells.\nOnce fully operationalized, they will be responsible\nfor almost 40% of all of the solar panel production\nin the country.\nThat's huge.\nSo when you have operations of this scale take place,\nhere is what takes place as well.\nSmall businesses start to expand in those communities\nbecause you need new services, new small British owners\nto serve those communities, to serve those businesses.\nI also know from my tech roots, a new class of startups\nemerge that you need to plug into these new value chains.\nAnd that's precisely what's happening\nacross the country, because these investments,\nwe have seen a record number of small businesses\nfounded in the last three years of this President's\nadministration, 16.1 million Americans\nhave founded a business in the last three years.\nIn the state of Georgia, roughly 760,000\nGeorgians have started a business.\nNow, as someone who has started many businesses\nand scaled others as well, I know that starting a business\nis the first step, but you need a lot of support, resources,\nfunding to grow a business, to create jobs,\nand that's where SBA comes in.\nAnd I'm going to spend just a couple of minutes\ntalk about what are we doing at the SBA to support these 750,000 plus\nGeorgians who just started their business in the last three years. One of\nour core priorities of the SBA is to democratize access to capital. We want to\nmake sure that entrepreneurs who are in rural Georgia, who are an underserved\ncommunity, have also access to the SBA funding. So number one, over the last\nLast couple of years, we have made permanent 143 mission-driven lenders.\nThese are CDFI's, these are community banks, regional banks that operate in rural communities.\nWe learned one interesting thing from the pandemic.\nIt wasn't the big banks that were available to our underserved communities for funding.\nWe had to invest in, we had to make sure the smaller banks were SBA banks so they can\nactually mobilized capital into these communities.\nSecond, we are cutting red tape to make sure\nthat smaller loans are being made available.\nYou've seen a decline in small dollar lending\nyear over year and it's gone on across administration.\nWe have made the process simpler and easier\nso more smaller loans can be made available.\nAnd finally, something to share with you,\nwhich I found it surprising when we did this.\nFor the first time in 41 years,\nSince President Reagan's administration, we lifted a cap on the number of what we call\nsmall business lending companies.\nThese are non-depositive institutions that are operating the country.\nWe're only 14 of them.\nSo now we have more of them coming and one of them is a FinTech called Funding Circle.\nSo no matter where you are in Georgia or where I'm in the country, in fact, you can go\nand apply for an SBA back loan because it is enabled with FinTech.\nI shared a lot of things, I shared a lot of numbers, but one thing that I want to underscore,\nthese policy reforms, these rules that we have done, a lot of with the statutory authority\nthat's given to us by the United States Congress, and the SBA have taken a lot of intentionality\nabout equity, about making sure that the taxpayer-funded resources are available to all Americans\nin every region, in every part of our country.\nAnd we have seen those results.\nLast year, I spent $54 billion in funding.\n$1.4 billion of funding for small businesses\nhere in the state of Georgia.\nOne, another thing I want to mention very quickly,\nfederal government contracts.\nThe United States government is the single largest purchase\nthat of goods and services in the world.\n$650 billion.\nThat's bigger than the GDP of many countries.\nAnd the economic output of many states.\nWe want to make sure that small businesses have\nto have a big share of that.\nThat's something that President has called out.\nIn fact, he went a step further and said\nthat we want to make sure that 15% of that figure\ngoes to minority owned, women owned businesses,\nrural businesses.\nAnd that commitment he made when he visited Tulsa, Oklahoma.\nat a very solemn time to observe the 100-year anniversary of the burning down of the Black\nWall Street.\nHe stood there on those grounds and he said, it's very important that this great resource\nthat our country produces a good amount of that goes to those who have been held back.\nSo with that, let me say, as we go into this new year, it's an exciting time with what's\nhappening in our country.\nLast quarter, we saw 5.2% GDP growth.\nInflation, we are managing it.\nMany states, gas is now below $3 of the share.\nThe most important as small businesses\nare back researching after the pandemic.\nThey need a help federal, state, local.\nI love the focus the governor has on small business\nand entrepreneurship here.\nLooking forward to partnering with all of you\nto make sure that we do everything in our power\nto have the backs of these new small business owners.\nThank you for having me.\nThat's an order.\nAre there any unanimous concerns?\nChair, here's none.\nDoes any senator wish rise on a point of personal privilege?\nI got your center. Hold on. Boy, you won't come to the floor.\nParliamentary inquiry then. I'm sorry.\nYou agree, Mr. President? Yes.\nMr. President, I would like to ask for unanimous consent to excuse the senator from the 6th for business outside the Capitol.\nAll right. That objection to the senator from the 7th or 6th. 6th, excuse.\nI thought you had something important there, Senator.\nYou scared me up here, so I recognize Senator from the 53rd on a point of personal privilege.\nMr. President, day back home I got a constituent, used to be a senator and back\nwhen he was a senator he used to say he had friends for a bill and he had\nfriends against it but he was with his friends and I hope my opinion on a piece of\nlegislation is never that ambivalent but I say that to say that I've got a\npiece of legislation that I've never been more confident and convicted about\nThere's a copy of it on each and every one of your desks this morning and I sent an email out last night\nIt's called the Stop Political Persecution's Act and I believe it's the first line of accountability\nunto the district attorney of Fulton County\nIf you would be so kind to sign on I think you'll certainly be a friend of our Constitution\nIt would be a friend of Liberty and I've got it back at my desk and lots of pins for you to sign on. Thank you, Mr. President\nThank you senator. Does any of the senator wish to rise on a point of personal privilege?\nYou have before you consent calendar of privilege resolutions, does any senator wish to remove\nresolution from the consent calendar. His objections to adoption of the\nresolutions on the consent calendar. Chair here is none and the resolutions on\nthe consent calendar are adopted.\nAre there any motions to withdraw or commit?\nI recognize the senator from the 51st and majority leader.\nThank you, Mr. President.\nDay three has come to an end.\nI move that the Senate stand adjourned until 10 a.m. on Thursday, January 11th.\nSecretary, we'll read the announcements.\nThe Health and Human Services Committee will meet at 3 o'clock p.m. today in room 450.\nThe Finance Committee will meet in MES-1 at 4 o'clock PM today in MES-1.\nAnd the State and Local Governmental Operations Committee will meet at 5 p.m. and 125.\nThe rest of the committee meetings have been canceled for today.\nThat completes the order, Mr. President.\nSenator from the, well, you're breaking all council rules of day shake.\nSenator from the fifth, and you come on up to the way.\nOh, you got an announcement.\nYeah, the announcement.\nProfessor colleagues, tomorrow is the keep Georgia while day at the Capitol.\nThe governor, the speaker of the house and the lieutenant governor will be giving remarks\ntomorrow morning from eight o'clock in the morning.\nIt's formally known as Georgia Sportsman Day at the Capitol.\nThis annual even allows Georgia's postman and coastal advocate to come together to celebrate\ntheir contribution to our state economy and the quality of life.\nJust to mention a few things, economic impact of hunting and fishing, hunting and fishing\ngenerate 214 million in state and local tax revenue, help create 38,000 jobs and have\nannual total economic impact over 3.9 billion annually.\nare fishing, generates over 500 million dollars in economic activity while providing recreation\nand fresh seafood. Hope you will can join the governor's and the governor's speaker tomorrow\nmorning and keep Georgia while day at the capital tomorrow. Thank you, appreciate.\nThank you, senator. Reagan has senator from the 36 for a point of personal privilege here.\nThank you very much, Governor Colleagues. I have a quick announcement and you will find\nthis on your desk. That is the first lunch for the session of the Georgia Working Families\nLegislative Caucus. It will be upon a German or at noon, whichever is first. And we meet\nin 307 for an in-person lunch meeting. We will hear what are the priorities of the\nState AFL-CIO for this session,\nand also discuss a top priority working families bills\nfor the session.\nYou are welcome, all come.\nAnd that's upon adjournment 307-CLO-B tomorrow,\nworking families legislative caucus.\nThank you very much.\nThank you, Senator.\nMajority leader has moved the Senate's standard\nadjourn until tomorrow morning, 10 a.m.\nTomorrow, remember, remind everyone,\ntomorrow is the state of the state,\nSo we will be gabbling in at 10 a.m. and then we will be escorted over to the House\nChambers for the State of the State, so be reminded of that.\nAnd majority leader has moved to adjourn.\nAll those in favor of the motion will say aye.\nAll those opposed?\nNo.\nNo.\nI swear we have it, we're adjourned.\n",
  "updated_at": "2026-02-12T20:04:25.198124+00:00"
}