{
  "video_id": "d8avYrkVlac",
  "url": "https://www.youtube.com/watch?v=d8avYrkVlac",
  "title": "House AM Day 28 of the 2025 Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 124,
  "summary": "Here is a summary of the Georgia House AM Day 28 session in structured markdown format:\n\n## Overview\nThis session featured routine legislative procedures, including the introduction of several bills, committee reports, and a prayer led by a guest speaker. The focus was on moving bills forward in the legislative process rather than debating substantive legislation.\n\n## Key Actions\n- **HB 1015**: No description provided\n- **HB 111**: No description provided \n- **HB 1437**: No description provided\n- **HB 185**: No description provided\n- **HB1**: No description provided\n- **HB111**: No description provided\n- **HB12**: No description provided\n\n## Bills Introduced (First Reading)\n- HB 1015\n- HB 111\n- HB 1437 \n- HB 185\n- HB1\n- HB111\n- HB12\n\n## Notable Moments\n- A guest speaker, Pastor Carter, gave an inspirational speech about the power of community and second chances, using the story of a church ministry assistant named Sheila Barrett to illustrate his points.\n- The House recognized Representative Tarry England, the former chair of the Committee on Information and Audits, who was not present.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nThe transcript indicates that the House took an initial roll call, with members voting \"green to signify their presence.\" The Speaker also instructed the Clerk to \"ring the bell\" to call members to the floor.\n\n## Adjournment\nThe transcript does not explicitly state when the session adjourned or the date of the next scheduled session.",
  "transcript": "All members, all members, if you believe he's come to the floor, all members. All members, please come to the floor, Mr. Clerk. If you'll get ready, the hour for convening to have an arrived, all members will please come to the floor and take their seats. Mr. Clerk, will you ring the bell? The House will come to order. Members, please take your seats. The House will come to order. We're going to have the morning roll call. All members present will please vote green to signify their presence and chamber on this cross over day. Mr. Clerk, will you unlock the machines? All members voted. All members voted. Mr. Clerk, will you lock the machine? Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Mr. Clerk, please take your seats. Thank you. Thank you Mr. Speaker and Representative Kelly for the opportunity to be here today at the Capitol and I'm honored to share a few words of encouragement before you start your busy day here at the State Capitol. I was here many years ago as a page as a young boy and I remember getting my picture taken with the late Speaker Tom Murphy right up here. He used to let us hold the gavel for that picture and accidentally walked off with the gavel. But I didn't get too far so hopefully I won't do that today. I'm joined here today by my son Jack and our ministry assistant at the church, Miss Sheila Barrett. Sheila retired from many years of working at the Georgia Department of Labor and her father was the late sheriff of Pope County for many years. Her sister actually worked in the governor's office as well for several decades. After Sheila retired she faced several battles in her personal life. She started as an addiction alcohol, spiraled into an addiction with drugs. And like others across our state Sheila experienced overwhelming grief in 2010 at the passing of her 22 year old son Brent due to an accidental drug overdose. She led Sheila down a very long and difficult path. One that involved addiction arrests jail time, broken relationships, and probation. When I first came to the church at Second Bab just members had mentioned to me about Sheila being in jail. And I remember praying for her not knowing who she was or what exactly she was struggling with. And what seemed like an impossible situation, God was not done with Miss Sheila Barrett. Things changed a little later on when my precious wife Sarah saw Sheila at the local grocery store. She had gotten out of jail and my wife had been praying for her and she went up to her and said are you Sheila Barrett? She said yes I am. And my wife invited her back to church that day. Well the following Sunday Sheila showed up at Second Bab just church to worship with us. And she was welcome with open arms. She began attending our new celebrate recovery program that had just started that year. And she became instrumental in managing our social media pages. She followed her probation rules meticulously and began helping others in their fight for recovery. She became our ministry assistant for hospitality at the church. And she greets every guest we have on Sunday morning. She has made it her life's ambition to honor the memory of her son Brent and to share the love of Christ everywhere she goes. She's been on mission trips. Just about every mission trip we have had as a church. She's been Idaho, El Salvador, Louisiana and she just got back from her third trip to the nation of Cuba. She has reconciled with her family and she will be off probation on September 15th of this year. With God and scripture says all things are possible. I share her story to illustrate to you the power of community and connection and most importantly the power of a God of second chances. A God who leads us and God's us every day. A God who is with us as a very present help and trouble. And as you start off your day here at the Capitol, I want to encourage you to remember the people just like Sheila all over our state. They deserve the opportunity to freely pursue God's plan for their lives to be provided with the resources needed to make their next step in life a more successful and a more prosperous one. And I want to thank you for your service to the people of this great state. Our prayers are with you and our prayers for wisdom and discernment are with this whole house and this capital. Today as you make very important decisions that impact the millions of people all across the great state of Georgia. Would you stand with me in prayer? Our Heavenly Father, I ask for your blessings and divine God's for the men and women in the Georgia House of Representatives. We pray for speaker burns and leadership of this chamber. As they go throughout their day today I pray that they can fill the presence of your Holy Spirit and experience your love that passes all understanding. God we ask for you to bless the people of our state. We pray that this would be a place where Godly wisdom and righteousness would prevail. We pray that you would allow our communities to flourish and our people to experience your grace. We ask this the name of our Lord Jesus Christ. Amen. Would you join me in the pledge? I pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. Pastor Carter, thank you for that, Mrs. Sheila. Thank you for being here. Thank you for your journey. Thank you for joining me in your own and we'll see a prayer for you as well. Jack, good to have you two, my friend. Good to be with you. Doorkeepers, you may open the doors. Members, you may join Pastor Carter in the south any room. And thank you for his service to us today and have a photo if you'd like. Members, our doctor of the day ironically is brought to us by Representative Chair Lady Katie Dempsey. It's Dr. Jason Harrison. Dr. Jason Harrison. Dr. Harris is down in the eight station. If you need his services, please find time to go by and see Dr. Harrison. Chairman Hilton, the chair of the Committee on Information and the Audits has recognized. Chairman Hilton. Thank you, Mr. Speaker. Your Committee on Information Audits has read the journal of the previous legislative day and found it to be correct. And Mr. Speaker, if I may, Chairman Tarry England, we love you. We miss you. We wish you were here on this special day. Mr. Speaker, for my colleagues, I'll take a line from the Hunger Games. May the odds ever be in your favor today. Thank you, Mr. Speaker. Thank you, Mr. Chairman. And I know the Representative, former Representative England, dear friend England, chief of staff. England appreciates that. And he's getting better. Chairman Hilton, the chair of the Committee on Information and the Audit Reports, that the journal of the previous legislative day has been read and found to be correct. Is the objection to the spends with the reading of the journal? Here he none, the reading the journal is the spends with. Is any objection to the confirmation of the journal? Here he none, the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Mr. Chairman, the administration of the 104th moves following me establishes the order of business. So, the first part of the period of unanimous consensus. Introduction of bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Here he none, the resolution is adopted. Second reading and reference of Senate bills and resolutions. Second reading and reference of Senate bills and resolutions. Second reading and reference of Senate bills and resolutions. First reading a bill and resolution is a clerk or read, Houseisp рy719 by referendum, meal tri council. Diagonary to Food Registration of Böyle inadequacy to 200 five months Education of Lee County. Andrew governmental coordination. House will 721 by reps of the Clark the hundred and eighth bill is 75th Sharper the hundred and 77 of the bill be taught on act of men park four bark the three chapter one a title 40 that's good to Georgia and the Tady relating rise share network services motor vehicles. House will 722 by reps of Stevens the hundred and 64th P.T. the hundred and 66 and Franklin to the hundred and 60th bill be taught on act of men and acts establishing the state court of Brian County. Andrew governmental coordination. House will 723 by reps of holly the hundred and 16th. McQueen into the 61st. Ladies the 67th fry the hundred and twenty second. Laptop in the 83rd. Nothers. Bill B. Todd on act of men. Artic to chapter seven to total 48. The fish go to Georgia and it's a little bit in the imposition rate computation exemptions from income taxes. The ways and means. 724 by reps of Franklin the hundred and 60th of the bill be taught on act of men and act to amend to solve the create revise and supersede to several acts of corporate in the city of Pembroke. And the government of coordination. House will 725 by reps of coming to 39th fry the hundred and 22nd lost for the hundred and 44th Wilkerson and 38 Smith. 41st and others. Bill be taught on act of men code section 44 713. The fish go to Georgia and Tady relating landlord duties. Judiciary House will 726 by reps of coming a 39th fry the hundred and 22nd sharper the hundred and 77 Smith and 41st Wilkerson and 38th and others. Bill be taught on act of men code section 10 1 393.3 the fish go to Georgia and it's a related to prohibited use of purchases credit cards. Thanks and banking House bill 727 by reps of Williamson the 112th abstraction of the 104th lever to the 123rd gains the 120th. Griefs the 99th bill be taught on act of men part one of our three chapter five a total 50. But he fish go to Georgia and Tady relaying the general authority duties and procedures in the department of administrative services. Yes industry and labor House will 730 by reps and P tree the hundred and sixty six Stevens the hundred and 64th itch and so on and 61st Gillier alone 60 second jacks and the hundred and 65th. Bill be taught on act to men the act creating the Chatham Savannah authority for the homeless. And for governmental coordination House will 731 by reps and a balance of the 23rd. Rimbly the 22nd bird of the 20th Thomas the 21st. Cogniz the 14th and others. Bill be taught on act to amend article 2 a a chapter a total 48 to the fish go to Georgia and Tady relaying the home state option sales and use tax. Ways and means resolution 480 by reps and a very one of the 30 second of resolution on a life of World War 2 veteran Bobby blackwell and dedicating a road in his memory. Trans partition House resolution 512 by reps and a pagan 156 canable 15 Jones the 25th. Feature the 166. Limit the 98th and others. Resolution creating the House study committee on the addiction epidemic and solutions for recovery. Health. The Senate bill 9 by Senator Albers the 56 still the 48th as to as the 35th ramen of the fifth. Cows to the 46 and others. Bill be taught an act to amend part one of our three chapter 12 entitled 16 of the fish go to Georgia and Tady relaying the general provisions relative to obscenity. You do sharing non civil Senate bill 36 by senator Sessler 37th brass the 6th and a divarie of the 31st Williams the 25th Hickman of the 4th and others. They'll be taught on act to amend title 50 that fish go to Georgia and Tady relaying the state government. Judiciary Senate bill 63 by senator Dixon the 45th good to the 51st Robertson the 29th harbor to the 16th Hickman of the 4th and others. They'll be taught on act to amend part 15 article 6th chapter 2 title 20 of the fish go to Georgia and Tady relaying the miscellaneous provisions on the quality basic education act. Education Senate bill 91 by senator Tillery the 19th Watson the first hatched the 50th perpetrator 30 second goodman the 8th and others. Bill be taught an act to amend part one of our one of chapter 18 to title 45 of the fish go to Georgia and Tady relaying the state employees health insurance plan. Health Senate bill 110 by senator and a bar today the 31st Robertson the 29th as to as 35th and perpetrator 30 second. They'll be taught on act to amend code sections 15 11 to the fish go to Georgia and Tady relaying definitions relative to the juvenile code. Judiciary juvenile Senate bill 112 by senator Dixon the 45th goodman the 8th Anderson 24th summers the 13th Jones the 22nd and others. They'll be taught on act to amend chapter 1 and title 10 of the fish go to Georgia and Tady relaying the selling and other trade practices. Agriculture and consumer affairs Senate bill 124 by senator still of the 48 Donald's out of 27 the pain of the 54th and it a bar today the 31st. Kennedy the 18th and others. Bill be taught on act to amend title 20 the fish go to Georgia and Tady relaying the education. Education Senate bill 126 by senator Dixon the 45th Hickman the 4th Donald's out of 27th and it a bar today the 31st pain of the 54th and others. Bill be taught on act to amend code section 22 2000 96.1 of the fish go to Georgia and Tady relaying definitions relative to the completion. Special schools act. Education Senate bill 144 by senator Watson the 11th go to the 51st Kenny the 18th Beach the 21st goodman the 8th and others. Bill be taught on act to amend article 6 chapter 7 of title 2 of the fish go to Georgia and Tady relay relating the liability for use of fertilizers. Agriculture and consumer affairs Senate bill 154 by senator hatchet of the 50th good to the 51st Kennedy the 18th property of the 29th and it a part a to the 31st and others. Bill be taught on act to amend titles 20 35 and 43 of the fish go to Georgia and Tady relaying the education. Education Senate bill 160 by senator Kropatric of the 32nd Alvers of the 56th Jones the 100th of the 10th Robertson of the 29th Halpert of the 39th and others. Bill be taught on act to amend code section 46 390 point one of the fish go to Georgia and Tady relaying the reckless stunt driving. Motor vehicles Senate bill 177 by senators and it will barter the 31st Alvers the 56th Burns the 23rd Robertson the 29th Williams the 25th and others the bill be taught on act to amend chapter 5 of title 21 of the fish go to Georgia and Tady relaying the government transparency and campaign finance. Technology infrastructure innovation Senate bill 180 by senator Dixon the 45th Council to the 46th Burns the 23rd Sessler 37th and it a part of the 31st and others. Bill be taught on act to amend our 7th chapter 4 title 20 of the fish go to Georgia and Tady relaying the high demand apprentice ship program. Higher education Senate bill 193 by senator brass the 6th hatched the 50th Harborson the 15th Alvers the 56th Beech the 21st and others Bill be taught on act to amend chapter 4 title 20 of the fish go to Georgia and Tady relaying the invocational technical and adult education. Higher education Senate bill 199 by senator Watson the 11th Gucci the 51st Burns the 23rd good men of the 8th Williams the 25th and others. Bill be taught on act to amend chapter 5 of title 21 of the fish go to Georgia and Tady relaying the government transparency and campaign finance. Government of fair senate bill 201 by senator Walker the 20th good men of the 8th Hodges 3rd tillery the 19th Watson the 11th and others. Bill be taught on act to amend go section 10 1 393 the fish go to Georgia and Tady relaying unfair and accepted practices. Agriculture income sum of fairs Senate bill 241 by senator Williams the 25th Anderson the 24th battle the 2nd Robertson the 29th and parent of the 44th. Bill be taught on act to amend chapter 18 to title 43 the fish go to Georgia and Tady relaying the funeral directors and establishments. Her regulated industries. Senate resolution 8 by senator and of our day the 31st Robertson the 29th Kennedy the 18th Gucci the 51st Alvers the 56th and others. Resolution honoring the life and memory of deputy Brandon Cunningham and dedicating an intersection in his memory. Transportation Senate resolution by senator Alvers the 56th McClar and the 14th beach the 21st Robertson 29th Karpatric of 32nd and others. Resolution honoring the life of officer Jeremy LeBonte and dedicating an interchange in his memory. Transportation that completes first readers. Second reading the bills and resolutions declared will read House bill 697 by the government of the second camera the first. A bill to provide a home say exemption from city of Chikamagat independent school district edularn taxes House bill 698 by our episode of the second camera the first to build to provide a home say exemption from Walker County School District edularn taxes for educational purposes House bill 699 by represent weight of the 9th chest 8th of the 7th bill to amend and act creating board of elections and registration Dawson County. House bill 700 by represent the senior the 43rd backels of the 96th draper the 90th the bill relating to prohibitive use of purchaser's credit card information by merchant House bill 701 by represent Chokas of the 151st to build to authorize the assessment collection of a technology fee by the private court of Terrell County. House bill 702 by represent Roberts of the 52nd draper of the 90th park of the 107th track of the 80th and Campbell of the 35th the bill relating to primaries and elections. House bill 703 by represent Bonner the 73rd Matthew of the 82nd based more of the 69th Jackson of the 68th built to amend and act to provide for the home say exemption from city of Peachtree City at the Lauren taxes from municipal purposes House bill 704 by represent Chokas of the 151st Jones of the 25th Dominic with the 29th Dekki of the 134th Parkman of the 146 others. A bill relating to maintenance of statistics and architectural engineering firms doing business with the state in eligibility of firms House bill 75 by represent of the 29th to the 43rd McClellan to the 109th Ridley of the 22nd a bill relating to general provisions relative to identification regulation of motor vehicles and traffic. House bill 706 by represent of the senior the 43rd between the 61st to law the 59th Austin of the 65th and Canada the 58th the bill relating to the quality basic education act. House bill 707 by represent of the senior the 43rd Cummings of the 39th lemon the 98th the bill relating to landlord and 10th House bill 708 by represent of the 10th and the 30th second a bill to authorize the city of Demarice Georgia to exercise all redevelopment other powers under the redevelopment powers law. House bill 70 by represent Jackson the 68th Mitchell the 88th and says of the 42nd Scott the 76th Goffield the 63rd a bill relating to commerce and trade and property House bill 11 by represent Scott the 76th Davis of the 87th Scofield the 63rd a bill relating to the 63rd a bill relating to offenses against public order and safety House bill 712 by represent Scott the 76th Davis of the 87th Scofield the 63rd a bill relating to general provisions regarding Adler attack section of property. House bill 713 by represent of the 76th Davis of the 87th Scofield 63rd Jackson the 68th a bill relating to general provisions regarding the general assembly House bill 714 by represent Hitchens of the 161st a bill to a minute act for the creation of one or more community and district in the city of Rankin House bill 715 by represent Barry the 56th Kendrick in the 95th Clark of the 108th Evans of the 57th Hulcom in the 101st a bill relating to fair housing House bill 716 by represent Barry the 56th Carpenter the 4th Friday the 120th second park of the 107th Sanchez of the 42nd and others a bill relating to the Georgia student finance authority House bill 728 by represent Hilton\n\n48, Draper of the 90th ballot, 147 Carpenter of the 4th, the bill relating to elections and primaries. House bill 729 by representative Miller of the 62nd. He will leave the 144th scope, feel the 63rd pairs, the 142nd Buckner of the 137th and others to bill relating to the Department of Public Health. House resolution 462 by Robert Sivrabort, so the 52nd Draper of the 90th part of the 107th Tran of the 80th Campbell of the 35th. A resolution proposing a amendment to the Constitution to provide that the people of the state are forced to child of the power to an act repeal or a min general statutory law by directs initiative and referendum process. House resolution 463 by represent banker of the 64th, 107th 150th Davis of the 87th Taylor of the 92nd Penet of the 94th and others. A resolution designated in the month of March as autoimmune disease awareness month. Senate bill 20 by Senator Carpenter of the 32nd summers of the 13th, paying in the 54th, Anderson of the 24th, parents of the 44th, the bill relating to scholarships, loans and grants. House bill Senate bill 29 by Senator Williams of the 25th, Alvers of the 56th, Robertson of the 29th, Hodges of the 3rd, Baird, and of the 30th and others. The bill relating to DNA sampling collection and analysis. Senate bill 30 by Senator Watson of the 1st, due to the 51st Kennedy of the 18th, Dex of the 45th, dollars, all the 27th and others. The bill relating to regulation of hospitals, related institutions, and the Georgia composite medical board. Senate bill 31 by Senator dollars, all the 27th, due to the 51st Kennedy of the 18th, and the March 31st Carpenter of the 32nd, others. The bill relating to income taxes, Senate bill 46 by Senator Harbin of the 16th, dollars, all the 27th, salary of the 19th and the March 31st, Kennedy of the 18th and others. The bill relating to general provision, relative to state government. Senate bill 51 by Senator Sandsler of the 37th, brass of the 6th, Dex of the 45th. Again, the 47th, Jones of the 10th and others, the bill relating to state, county, municipal road systems. Senate bill 55 by Senator Hickman of the 4th, Halper of the 39th, Dastaviz of the 35th, still of the 48th, heckles of the 49th and others. The bill relating to labor and industrial relations, Senate bill 56 by Senator, Senator Marchae of the 31st, Halper of the 56th, Robert of the 29th, Kennedy of the 18th, due to the 51st and others. The bill relating to the Georgia State Indimitification Fund, Senate bill 74. By Senator Burns of the 23rd, Walker of the 20th, dollars, all the 20th, valid summaries of the 13th, Hickman of the 4th and others. The bill relating to sale or distribution of harmful materials to minors. Senate bill 85 by Senator, brass of the 6th, due to the 21st, Senator Marchae of the 31st, Harper of the 15th, due to the 34th and others. The bill relating to secondary education grants for foster children and adopted children. Senate bill 111 by Senator, Albert of the 56th, Burns of the 23rd, Robert of the 5th, still of the 48th, set to the 37th and others. The bill relating to commerce and trade. Senate bill 139 by Senator Dixon of the 45th, still of the 48th, council of the 46th, the bill to amend and act to incorporate the City of Mulberry. Senate bill 151 by Senator Beech of the 21st, Albert of the 56th, still of the 48th. They bill to create the joint development authority for North Fulton Municipalities. Senate bill 175 by Senator Roberts of the 29th, due to the 21st, brass of the 6th, due to the 8th, Hodges of the 3rd and others. A bill relating to general provisions regarding elections and primaries. Senate bill 185 by Senator Roberts of the 29th, due to the 51st, Albert of the 56th, Albert of the 13th, Burns of the 23rd and others. A bill relating to correctional institutions of state and counties. Senate bill 195 by Senator Havsett, there are the 52nd, Krophatchok and the 32nd. Watch some of the first parents of the 44th and Oracle of the 36th. A bill relating to pharmacies. Senate bill 206 by Senator Summers of the 13th, the 13th, the 19th. A bill to create the South Georgia Energy Authority. Senate bill 234 by Senator Payne of the 54th. A bill to provide a home setting exemption from the City of Dalton, Independent School District, Adlor and Taxes for Educational Purposes. Senate bill 235 by Senator Payne of the 54th. A bill to provide a home setting exemption from Whitfield County. School District Adlor and Taxes for Educational Purposes. Senate bill 237 by Senator Strickland of the 42nd, Anderson of the 43rd. A bill to amend and act creating and establishing the Newton County Public Facilities Authority. Senate bill 302 by Senator Kennedy of the 18th. A bill to provide a home setting exemption from Peach County, Adlor and Taxes for County Purposes. Through 2nd Raiders. We report sustaining committees. Mr. Clerk, we'll read. I was on a Chris Erwin 32nd District Chairman on the Committee on Education submitted the following report. And to speak, your committee on an education set under its consideration to following bills of the House. Mr. Struck to meet report the same back to the House of filing recommendations. House of resolution 174 do pass by substitute. House bill 442 do pass. House bill 483 do pass. House bill 133 do pass by substitute. Respectfully submitted. Representative Chris Erwin in the 32nd District Chairman. Representative Don Parsons, the 44th District Chairman on Committee on Energy Utilities and Telecommunications submitted the following report. Mr. Speaker, your committee on energy utilities and telecommunications has had under its consideration to following bill of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 249 do pass by committee substitute. Respectfully submitted, Representative Don Parsons, the 44th District Chairman. Representative Victor Anderson, the 10th District Chairman of the Committee on Government of Affairs submitted the following report. Mr. Speaker, your committee on government of affairs has had under its consideration to following bills of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 397 do pass by committee substitute. House bill 502 do pass by committee substitute. House bill 604 do pass by committee substitute. House bill 613 do pass. House bill 728 do pass. Respectfully submitted. Representative Victor Anderson, the 10th District Chairman. Representative Chuck Martin, the 49th District Chairman of Committee on Higher Education submitted the following report. Mr. Speaker, your committee on higher education has had under its consideration to following bills and resolutions of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 88 do pass by committee substitute. House bill 217 do pass by committee substitute. House bill 419 do pass by committee substitute. House bill 541 do pass by committee substitute. House bill 602 do pass by committee substitute. House bill 686 do pass by committee substitute. House resolution 450 do pass. Respectfully submitted. Chuck Martin, the 49th District Chairman. Representative Bill Workhyes of the 157th District Chairman of Committee on Industry and Labor submitted the following report. Mr. Speaker, your committee on industry and labor has had under its consideration to following bill of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 311 do pass. Respectfully submitted. Representative Bill Workhyes of the 157th District Chairman. Representative Lomston of the 12th District Chairman of Committee on Insurance submitted the following report. Mr. Speaker, your committee on insurance has had under its consideration to following bills of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 101 do pass. House bill 649 do pass by committee substitute. Respectfully submitted. Representative Lomston of the 12th District Chairman. Rep. Sheriff Cooper, the 45th District Chairman of Committee on Public and Community Health submitted the following report. Mr. Speaker, your committee on public and community health has had under its consideration to following bills of the House. Mrs. Struck to meet report the same back to the House of filing recommendations. House bill 657 do pass. House bill 668 do pass by committee substitute. House bill 717 do pass. Respectfully submitted. Representative Sheriff Cooper, the 45th District Chairman. Rep. Sheriff Mike Chokus of the 151st District Chairman of Committee on Small Business Development submitted the following report. Mr. Speaker, your committee on small business development has had under its consideration to following bill of the House. Mrs. Struck to meet report the same back to the House with the following recommendation. House bill 704 do pass. Respectfully submitted. Rep. Sheriff Mike Chokus of the 151st District Chairman. Rep. Sheriff Cooper, the 11th District Chairman of Committee on Transportation submitted the following report. Mr. Speaker, your committee on transportation has had under its consideration to following bills and resolution of the House. Mrs. Struck to meet report the same back to the House with the following recommendations. House bill 638 do pass by committee substitute. House of resolution 7 do pass by committee substitute. Respectfully submitted. Rep. Sheriff Cooper, the 11th District Chairman. Representative Shaw Blackman, the 116th District Chairman of Committee on Ways and Means submitted the following report. Mr. Speaker, your committee on Ways and Means has had under its consideration following bills and the House. Struck to meet report the same back to the House with the following recommendations. House bill 260 do pass. House bill 330 do pass by committee substitute. House bill 266 do pass by committee substitute. House bill 341 do pass by committee substitute. House bill 357 do pass by committee substitute. House bill 511 do pass by committee substitute. House bill 586 do pass. House bill 577 do pass by committee substitute. Respectfully submitted. Representative Shaw Blackman, the 116th District Chairman. That completes the reading of the report's outstanding committees. Members, if we can have your attention please. We are moving on to morning orders. We have some folks here with us today we need to recognize. Members will come to your seats. Give your attention to the member in the well. Representative Scofield and Chairman Crowe recognize for a more in order. Representative Kim Scofield. Representative Allen Powell. Representative Chetty Reese. Representative Martin Muntahand. Representative Sanchez. Okay. Thank you, Mr. Speaker. The colleagues today we rise. We want to honor a group of folks that are here today. And what they do is very important to all of our safety throughout the state. The Georgia Association of Chiefs of Police are here today. We've got many members up in the gallery for those that are up there. If you would stand please. If you remember the Georgia Association of Chiefs of Police. So I've got a resolution I'll be presenting to them here just a little bit mountain to any room and we've known some photographs and also Mike Ayer as he was recognized as the outstanding chief of the year last year by the Georgia Association of Chiefs of Police. This is retired as a post director. So wonderful to have you all here. Thank you. And Representative Scofield. Thank you. You come up please. Thank you. Thank you, Mr. Speaker. As members of the House, I rise today to recognize the National Organization of Black Law Enforcement executives. They're in the gallery. We have a resolution. Can you all stand? This is their 10th anniversary. I'm celebrating them. I'm sharing them. Thank you for being here. Mr. Speaker, we yield a well. Thank you members. Welcome to the Capitol. We appreciate each and every one of you and what you do to keep Georgia safe. Keep doing what you're doing and we'll keep being supportive of you. So thank you so much for being here. We're representing Park Cannon. Ladies and friends. All right. It was us representing Lamb with you. Okay. Got you. Ladies, recognize. Thank you, Mr. Speaker. I'm here to celebrate Mojete's Day at the Capitol and those who are here for that. Mojete's means women in Spanish. It is brought to you by the Lambda Theta Alpha Latin Sorority Incorporated Alpha Sigma Alumni Chapter. And they are the first Latina sorority starting in 1975. So they are celebrating Cinque de Aguíneos 50 years. Today is a day to celebrate their advocacy for women across Georgia. They will be in room to 30 today until 3 o'clock for any members who want to stop by and say, Hola. And for those who are here, if you will just stand so we can applaud you. Gracias por estar aquí. Bienvenidos a tecapitolio. Thank you, Mr. Speaker. Thanks for joining the represent San Tos and represent San Chaz. Thank y all for coming up. Welcome to the people's house. We're glad to have you. And hope you have a good day here today. Representing Bell is recognized for a morning or representing Eric Bell. Just coming. And friends. Thank you for acknowledging me today, Speaker. Today in the gallery we have, today we have, in the gallery we have a life without rain, the widows and widowers of the state of Georgia. This is a very important organization for they have continued to live without the partners that they love and they continue to sow the seeds in Georgia that we all have. May they please stand and be acknowledged in the will for the hard work they do and the sacrifices that make for our communities. May you be loved and your loved ones will be remissed. As a past widow, I want to thank you all so much for being here and hope you enjoy your visit at the state capital. Thank you. May God bless you. You going to yield? I yield the will. Thank you members. Welcome to the capital. Thank you for what you all do. The comfort you all give. God bless you all. We appreciate you all being here today. Thank you. Chairman Chokus has recognized for a morning order. Thank you, Mr. Speaker. I've got my Marion County Middle High School FFA students up in the gallery on the right. Stand up guys. They've got their blue jackets on and they're accompanied by John Hagen, the best FFA instructor in the state. Thank you very much. Welcome to the people's house. Thank you, Mr. Speaker. Thank you. That's all those jackets earlier. You all looking good. We're glad to have you all. And thanks for applying yourself and helping other students and helping yourself. We appreciate you. You'll have a bright future. Thanks for being here. All right, members. We're ready to go. We're moving on to the rules, calendar. Mr. Clerk, will you read a caption to House Bill 532-532? House will 532 by a representative to the votes of the 167th and be titled an act to amend Code Section 126A12. I'd be fiscal to George Aniteta relating the annual grant when state owns properties and calculations. So it was revised provisions related to certain counties claiming such grant. This bill is for the Committee on Ways and Means. That committee recommends a dispelled do pass by committee substitute. The gentleman from Darien, Chairman Baudi DeLouch, is recognized to present the bill for representing DeLouch. Thank you, Mr. Speaker. And I hope you'll allow me to start off this morning by saying that I suspect my, oh, seatmate Terry England is watching us this morning. And so I want to take this opportunity to say, Terry, I don't tell you one more time how much I love you. And I want to tell you that you might not be physically present on this floor this morning. But your spirit and your influence is felt here every day. And we'll continue to be until you get back here and we look forward to that. And I also briefly need to say thank you. And now I'll talk about this bill. House bill 532 strikes from the Code section. Two lines, line 40 and 41. And on the last page, line 69 and 70 and the effect of those two things is to allow the department of natural resources. To use grant money that we appropriate every year to pay counties for actual works such as road grading and maintenance that they do on state property. And Mr. Speaker, if there are no questions, I'll yield the well. The gentleman has no questions. Did a good job. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee's agreed to. This bill now passed all in favor of the passage of the bill. Yes, all those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. Mr. Clerk, will you unlock the machine? On the passage of House Bill 532, the A's are 168, the A's are 0. This bill, Henry, is there for the constitutional majority. Is there for the past? Mr. Clerk, will you read a caption to House Bill 52? Five, too. House Bill 52, by the way, Representative Rice, the 139th and others to be entitled to amend Code Section 485, 48. Will the official go to Joe Janitator relating to homestead exemption by qualified, disabled veterans, filing requirements? This bill, I refer to the committee on ways and means that committee recommends a disbill do pass. Representative Rice, representing Carmen Rice, is recognized to present House Bill 52. The ladies recognized. Thank you, Mr. Speaker. Good morning, everyone. This bill, Bill 52, was presented last year by Representative Clay Parkle, if you recall. And the bill passed unanimously through the House, so it's another one that we're moving to the Senate again. And this bill is clarifying language as there's been some confusion in some counties regarding homestead exemption for the unremaried spouses and minor children of a deceased disabled veteran. As these families move from county to county across our state, as often happens during a lifetime change, this bill clarifies that the unremaried spouse and minor children of a disabled veteran would maintain their homestead exemption status. This is not extended in the exemption, but rather it clarifies the exemption would travel with them to that residence. Some counties were interpreting one way and some are interpreting another. This bill gives consistency and predictability to surviving unremaried spouses and minor children of our veterans across our state. And with that, Speaker, I'll take questions. The lady has a question to your left down front. Yes, I think she represents that part of the state you come from, representing hugely from the Columbus delegation, is recognized to ask her question. Thank you, Mrs. Speaker. Does the gentleman need a gentle lady, you know, yes. Isn't true that we have a lot of military spouses in our area and people in Columbus will appreciate you doing this for them. Absolutely. Thank you. The lady has no further questions. Thank you. I'm honored to present this bill on behalf of our veteran families in Georgia and ask for your vote and support. It's great when folks work together. Ladies, you are the well. Is any objection to the previous question being ordered? Here in the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in the report, the committee is agreed to shout this bill now pass all in favor of the passage of the bill will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? I have all members voted for what purpose of representative Hepner rise. I'm honored to present this bill on behalf of our veteran families in Georgia and ask for your vote. I'm honored to present this bill on behalf of our veteran families in Georgia and ask for your vote. Thank you. Thank you for the inquiry. Thank you, sir. For what purpose representative new rise? Parliamentary inquiry. Is it not true that this is the representative's first bill? Thank you, representative new. She almost slipped away. I had a question. I guess I could do a parliamentary inquiry, but I guess I won't. I bet he will get you back up. The vote is changing dramatically. Oh, it's getting worse all the time. Mr. Clerk, you better hurry up. Well, no, we're not going to close it. Let's see. We have one question I want to recognize for what purpose is chairman Martin rise. Parliamentary inquiry, Mr. Speaker. I'm going to have to get some help. So don't go anywhere. A station inquiry. Yes, sir. This is to you, Mr. Speaker. I'd like to know the gentleman's opinion on the lady slipping in there and getting it by us. You said you had a thought on that. My parliamentary inquiry. Would you clear to share that with the body? I think she's one of the smarter members of this body to do that. So very stealthy. Have all members now voted. Congratulations. I think. Have all members now voted if so, Mr. Clerk, will you lock the machine? The passage of the House bill 52, the Yees are a 17 and a's are five. You'll pay for that. I'd be writing that little to the clerk right now. I will you. Congratulations. This bill having to see the requisite constitutional majority 170 Yees 170 days five. This bill having to see the request constitutional majority is therefore passed. Congratulations. Thank you. Mr. Clerk, will you read the caption of House bill 425425? House bill 4255. I represent a perchetta of the 176 to be entitled next to men. Article 2, chapter 7 and title 48. The district will go to Georgia, Ontario, relay an in position rate, computation exemptions and credits. So it's a provide for a tax credit for the purchase of emergency power generators. This bill having for the committee on ways and means that committee recommends this bill do pass by committee substitute. Will Burtchett is recognized to present the bill, the gentleman from the 176 House district. Thank you, Mr. Speaker. No, be brief. Colleagues, I bring before you House bill 425 is a disaster preparedness bill. And what the bill seeks to do is allow for a tax credit for generators and switches for gas stations and nursing care facilities. The cap is $25,000 per store and the aggregate cap is $5 million. It's only allowable through December 31, 2026. The intent of this bill is to assure that our gas stations put in a generator and a switch. So when the power goes out for 24 days that folks can get gasoline to put in their generators as well as nursing care facilities will be able to have the incentive to put in a generator so that their folks, their vulnerable folks will be able to have power to recharge oxygen tanks and things of that nature. And that's the nature of the bill, Mr. Speaker. If I have no questions, I will yield a little. We have a couple of questions. Very good. We're going to see if you've newton to your right. Has a question. Jim was recognized. Thank you, Mr. Speaker. Mr. Jim, I'm in the yield. Yes, my friend, I do. Isn't it true that these convenience stores with gasoline but also necessary foodstuffs, milk, everything that was needed or crucial in that swath of Georgia from Baldosta through Augusta that made such a difference during Hurricane Helene. They were some of the first to get open. They tried to stay open even 24 hours a day in so many areas and don't and they're in a true that we appreciate the effort they did and this is going to help them do it even better the next time. Yes, 100% and thank you to the chairman for helping perfect the bill. The representative of the governor, Mr. Representative Carpenter, do you write in the rules? Recona's for a question. Does the gentleman yield? I do. Is it not true this legislation would greatly help the businesses and the people of South Georgia that were devastated with the hurricanes? It will help everybody in the state. Yes, sir. Thank you. With that, Mr. Speaker, I'm going to yield the well. Gentlemen, is yielded the well? No further questions. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. This bill now passed. All in favor of the passage of the bill will vote yes. All those opposed will vote no. Mr. Clerk, will you unlock the machine? I have all members voted. Mr. Clerk, will you unlock the machine? On the passage of the bill, 425, the yeas are 171, the maze are two. This bill here in the seat of the requisite constitutional majority is therefore passed.\n\nMr. Clerk, will you read the caption to House Bill 111-1-1? The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The House Bill 111 by the representative from the hundred and third to be entitled to amend Article 2, Chapter 7 to 1248. The original bill plan to initiate a flat tax beginning at 5.49% for tax year 2024 from 5.75 in 2023 and then allowed for an annual step down in our income tax rate to an eventual 4.99% by tax year 2022. However, things too are conservative budgeting and your support. Last year we accelerated the rate from 5.49% to 5.39% for tax year 2024 with HB 1015. This bill and this year's proposal will further accelerate the rate by an additional 20 basis points to bring the rate from 5.39% to 5.19% effective July 1st 2025 for tax year 2025. This acceleration and the reduction will save the tax payers $860 million. Overall, this additional 20 basis point reduction will be part of a 56 basis point total reduction in individual income tax since the governor signed into law HB 1437. So essentially we started at 5.75% back in 2023 and now we are looking to get down to 5.19% just in a three year time frame. While other states are raising taxes on their citizens and while we're facing sky high prices and can least afford it, we are doing the opposite here in Georgia. We have a surplus budget and we are able to put money back into our tax payers. Mr. Speaker, that's the bill and I'll take any questions. Lady has a couple of questions and all that members know we have a number of speakers signed up to speak there opposed to this bill. I'm a recognized representative and drenner for a question to your left. Thank you, Mr. Speaker. Does the general lady yield? I do. Isn't it true that in the past few weeks we've seen uncertainty and federal funding and tariffs from the new administration. We've seen talks of cuts to K through 12 school funding cuts to Medicaid and Medicare. And is this really the best time to accelerate an income tax cut that primarily benefits wealthy people in Georgia? Thank you, Representative. Several things in that comment. We've been dealing with inflation for the last four years. During that time, Georgia has had a surplus and we have conservatively budgeted. And so therefore that's why this year and last year we're able to accelerate and still be able to keep up with all of our expenses. I don't think that this bill only benefits the wealthy. This is a overall will get a tax cut for all Georgians. It will benefit 100% of Georgians. Representative Wade, do you're right in the back? Is recognize for a question? Does the general lady yield? I do. Is it not true due to our fiscal conservatism and the fact that Georgia has been the number one place in which to do business for over a decade. We're in a position to be able to provide this tax relief for Georgians. Absolutely. And that is exactly why we are able to do this for our hardworking Georgians. Thank you. Thank you. Chairman Blackman, right up the center aisle on your left, just recognize for a question. Thank you, Mr. Speaker. Is generally yield? I do. Is it true the original legislation provided for a significant increase in the standard deduction and was front loaded with that increase and took many. Georgia taxpayers off the tax rolls entirely as well as provided that $32,000 for a family of four would not be taxed. One single penny? Absolutely. And you would know you would know the best. Thank you for bringing the bill. Thank you. Representative Carl to your left, Representative Jasmine Carlton. Director, I ask for a question. Thank you, Mr. Speaker. Does the general allow you yield? I do. So can you give us some numbers? If I am an individual that makes about, let's say, $40,000, $45,000 a year, what does this tax credit look like for my family? Let's say I'm a family of three. So it's not a tax credit. It's a tax rate cut. So whatever you, when you follow your regular income tax, the amount that you are being taxed, that rate is being lower. So I can't do the math in my head right now, but whatever you are paying in your tax rate is being reduced. And that's why I say it is being reduced for all Georgians. So whether you make $300,000 or you make $40,000, you are paying a less rate and a lower rate for your income tax. Thank you. The lady, we have a couple of questions, but the leader of the illustration right now in front of the years, recognize for a question. Thank you, Mr. Speaker. Does the general allow you yield? I do. Ma'am, is it not true that if this body passes House Bill 111, we're on track for Georgians to keep more of their hard earned funds and to show our commitment to keeping Georgia the number one state to live, work, and raise a family? Absolutely. And again, this is for all Georgians. We want to make sure that they get their hardworking tax payer money back, and this is what this bill does. Mr. Speaker, I know we have a long day and there are many people that are signed up to speak, so I will yield the well. Thank you. The ladies yielded the well. We have a number of folks who want to speak that are opposed to the bill. We have three that oppose, representing Draper, St. Chas, and Remann. I'm going to give you up to five minutes. Up to five minutes. Representing Draper is recognized. Let me see if I can put this up here. All right. All right, Mr. Speaker, members of the General Assembly, I rise today not out of opposition to tax relief, but out of a deep concern for fiscal responsibility, and to hold this chamber accountable to the standards that we set for ourselves just last year. Calme-all fashioned, but I like to do what I say and say what I mean. Last year, I voted yes for HB 1015, which was a measured plan to ratchet down the income tax rate over multiple years. If you were in the House last year, you probably voted yes for that bill, too. The final tally for that bill was 165 Ye votes and zero nay votes. I left a copy of House Bill 1015 on everyone's desk, but let me break it down for you. House Bill 1015 promised a 0.1% income tax reduction in 2024 from 5.49% to 5.39%. But then it went on to say that beginning this year, the tax rate should be reduced another 0.1%. So long as certain financial benchmarks were reached, the bill goes on to say keep reducing that tax rate by a tenth of a percentage every point every year, so long as we continue to meet those financial health markers. And what does the bill say to do if we don't hit those financial health markers? It says delay further tax rate reductions for a year, reassess if we are hitting our goals and proceed from there. And you know what? I was good with that approach because it was thoughtful and conservative approach to tax relief. It balanced the return of revenue to Georgians with the financial health of the Georgia economy. I also really appreciated that it gave Georgia citizens, businesses and industry a guide map for how we were going to approach tax relief over the course of the next several years. I like the idea of giving the public information they can use to plan for the future. And I certainly believe that if we choose to give the public a guide map that we know they will rely on in planning, we should stick to that guide map. We should not do is tell the public we are going to do one thing and then reverse course the very next year. But that is precisely what we are doing with House Bill 111. Georgia did not meet its financial benchmarks that we laid out in House Bill 1015. That was a prerequisite for additional tax relief in 2025. Had we reached those benchmarks, we would have automatically received another tax rate reduction this year without the need for this bill. But we didn't. We didn't meet those benchmarks. And instead of holding ourselves to our own standards, we are now passing legislation to circumvent the rules that we thought were necessary. That is not fiscal responsibility. So you may be asking, how do we know we didn't meet our financial benchmarks that we laid out in the HB 1015? Well, one of these benchmarks is that the governor's revenue estimate for the next fiscal year must be 3% higher than the current year. That is lines 21 and 22 of the bill of a HB 1015 if you are following along. The 2026 revenue estimate is not 3% higher than the 2025 revenue estimate. As a matter of fact, it is 7% lower. So in other words, we didn't even come close to reaching our goal. And you don't have to take my word for it. Take the word from the governor's office of planning and budget. Under HB 1015, the Georgia office of planning and budget is charged with determining whether we meant those financial benchmarks. And if we had, it would have had to issue a report to the speaker and to key legislators saying as much. Well, I went over to the office of planning and budget and asked for the report. What they told me is that since we did not meet our financial benchmarks, they did not produce the report so they did not have a report to give me. HB 111 basically asks us to ignore our vote last year on HB 1015. It asks us to ignore the wisdom in that bill of not reducing tax rates further if the financial health of the state cannot support it. And why are we ignoring HB 1015? Why are we undoing our own work so that certain elected officials who have higher political aspirations can campaign on giving tax breaks? Even if it has a dire financial impact on Georgia, even when it goes against the standards that we set in this legislative branch to that I say no. Carry your own water. If you want to give tax rates, tax breaks, meet the standards that we have set in this chamber. I see my time is done. So Mr. Speaker, I yield the well. Thank you, Representative Draper. Representative St. Chaz has recognized for up to five minutes. Thank you, Mr. Speaker. I am here opposed to House Bill 111 because Georgians are tired of a government that is only benefiting the wealthy elite and not the rest of us. This bill provides essentially a flat tax cut for Georgians. In theory, that sounds equal. But in the real world, Georgians do not make the same income. The top five percent are making at least $300,000 a year while the bottom 20 percent are making barely $20,000 a year. Instead of fixing this huge disparity, we are giving a massive wasteful tax cut to the wealthiest Georgians and not investing in programs that serve everyone in this state. Nearly half of Georgians will only receive 5 percent of the benefits of this bill as you can see from the chart. That means the median family will get this $70 a year from this bill. That is less than $6 a month. That doesn't even cover Amila cookout anymore. Let alone child care, rent, health insurance, energy bills, or your kids' college tuition. Our state ranks third highest in the nation on inequality. The average rent has gone up $400 a month since 2020 in Georgia. Our people are hurting at a time where the federal government is cutting much neocerosis for our community. This assembly is failing to step up to the plate to help working Georgians. Instead of providing help for our people, we are proposing to not invest in our agencies that help regular people and instead benefit the wealthy. But hey, at least you'll get an extra cup of coffee every month. Working Georgians deserve tax relief. I agree. Do you know what they deserve even more than that? The ability to work 40 hours a week on one income and be able to live comfortably, buy a house, and support their families. Instead of giving working Georgians crumbs and doing a victory lap, how about we actually invest in our communities? How about we invest in affordable healthcare for Georgians? As has been said many times, expanding Medicaid will give 440,000 uninsured people in Georgia insurance. Affordable healthcare. What about affordable housing? How about we invest in building homes in Georgia to increase supply and stop these huge corporations buying up all this property, jacking up the prices and making it unaffordable for the rest of us? Instead of giving $70 a year back to working Georgians, how about we pay them $20 an hour of living wage so they can afford to live and thrive in our state? Instead of addressing these dire crises, we're pouring money down the drain to give a nice tax cut to the wealthiest of Georgians, some of which happen to be in this room. Because let's be frank, this is a bill made by the wealthy for the wealthy. So let's stop wasting our time with handouts to the wealthy and instead invest in working families here in Georgia. Thank you Mr. Speaker, I yield the wealth. Gentlemen, I have a question, but a year to the will. Representative Ramon is recognized for up to five minutes. The lady is recognized to speak. Thank you. Thank you Mr. Speaker. Colleagues, today I rise in opposition of House Bill 111. House Bill 111 is being sold as a tax cut, but it's frankly a scam for most Georgians. We hear the reasons for this bill is to try to keep more money in Georgians pockets to spend how they see fit. The problem is this bill is it currently exists, would barely return about $70 as you heard for the entire year to most Georgians while continuing to underfund important programs. The cost of about $748 million would go, which 70% of that would go to the top earners in our state making six figures or more, but just 4% of that, just 4% going to the rest. The thing is, it is getting harder every day just to make ends meet for so many people. We are experiencing larger economic factors than anybody is willing to be honest about last year, and while we bicker about politics, your average everyday family is struggling more every day. We are seeing, for example, worsening student outcomes, while there are many reasons for this, one is a lot of teachers can no longer afford to teach. And on top of that, as we lose teachers, our classroom sizes are expanding. And more than that, you don't think that a child, whose parents can't afford to put food on the table, isn't going to struggle and eventually act out. We are expecting more from children that we are hurting than ourselves. And while this may be an impassioned speech about tax breaks, it's also about our values. These parents are being forced to take on two to three jobs, sometimes four. They are doing this to make ends meet. And we are saying to them, you know what? We will throw you a little something, but we are going to keep the rest to give to those that we know. And it has been tax break after tax break that benefits the very few. Oh, and by the way, we are also telling them that as things get harder, we are not going to be able to do it. We are also going to make it harder for them to qualify for necessary programs. And on top of that, we are also going to refuse to expand already existing programs to help more Georgians because we don't have enough money. And we don't have enough money because we keep giving it to the top earners. And on and on and on. Our values are so upside down. The reason we have this bill, as my colleague mentioned, is we are actually behind benchmarks. And I think it's a travesty that we keep saying we can't expand Medicaid because of money. We can't provide a poverty wait for the QBE formula because of money. But we can absolutely give the already wealthy back more money. You don't think this is selling our future for cents on the dollar. You don't think that lack of investment our children is going to matter down the line. It matters to Georgians. There are ways to put more money back in people's pockets without taking what little they have. There are programs and bills on the table like the earned income tax credit that lets parents spend more time with their kids. But instead of doing programs like that in our state, we are dangling a little bit to agree to give up so much more. Colleagues, I strongly urge you to support me in opposition to this bill. The decisions we make here and the values we have are beyond contradictory and they are causing a lot of pain in our state so we can pat ourselves on the back for saying that we provided a tax cut. Because here's the reality. Giving people tax breaks like this is the equivalent of skipping out on your bills and handing out money to make you popular. It gets you some paths on the back. It might even get you an award. But the reality is your bills are still unpaid. The same applies to this. The same applies to the surplus. We have people struggling and we keep money sitting in our banks. We're not even going to bother to expand how much we're helping you. That's what we're saying today. I want to be clear this is not envy. I know a lot of you think that the reason many of us have this attitude is because we think, oh, we're just upset about what people have. But I want you to understand the deep-seated concern that I have is greed that we continue to enable that has continued to squeeze Americans, and Georgians more and more. Everything now has a shareholder fee. Everything now is more predatory and extraction area and we expect people to be okay while we continue to build hurdle after hurdle. This is not only immoral. It's also bad for a healthy and robust market. Today the top 10% of earners account for 50% of all spending because the other 90% can't even afford the basics. You heard me correctly. Not only can they not afford to slurge, splurge, they cannot afford the basics meaning people and workers specifically are being pushed into homelessness. They're not just becoming homeless because they're not working. They are working and becoming homeless. It is our job to level the playing field and negotiate on behalf of all Georgians, not just our friends. I am tired of becoming middle management for those who want to keep making more money at the expense of everybody else. I strongly urge you to vote no. Thank you, Mr. Speaker. I yield the law. The lady has yielded the well. Is there any objection to the previous question being ordered? We do have a minority report for up to 20 minutes and we'll let we have three speakers. We'll park us first. We'll let you guys decide how you divide up the time. The president park is recognized to speak to the bills. Mr. Speaker, today I rise not as a Democrat or Republican, but as a proud Georgian committed to the long term economic strength of our great state. We all share common values, fiscal responsibility, economic opportunity and ensuring that every hard working Georgian can afford the basic necessities of life. Unfortunately, House Bill 111 does not reflect these values. Instead, it undermines Georgian financial future while offering little relief to those who need it most. At a time when inflation has driven up the costs of groceries, rent and health care, Georgia families need responsible tax policy that alleviates their burden without putting our state's economy at risk. The HB111 takes the wrong approach. While it may be marketed as a broad-based tax cut, the reality is, as my colleagues have so eloquently stated, is that it overwhelmingly benefits the wealthiest Georgians while offering minimal relief to working and middle-class families. I'd like to encourage my colleagues and those who are watching, look at the screen. For my colleagues, how many of our constituents are making $2 million and more a year? The HB111 reduces the state income tax rate from 5.39% to 5.19% starting in 2025. The benefits are starkly, starkly uneven. The top 20% of earners will receive nearly 80% of the total tax savings with millionaires receiving thousands of dollars and benefits annually. Meanwhile, the bottom 60% of Georgians, those earning middle-class or lower incomes will see less than $6 a month in savings, $6 a month in savings for the vast majority of Georgians. You can't even afford a dozen eggs with $6 a month. At the same time, this will cost the state nearly $1 billion in loss for revenue by 2026 that may force lawmakers to either cut essential services or increase fees elsewhere to compensate. Now it's been argued that cutting taxes across the board will generate economic growth. But history and economic data tell us otherwise. Past state-level tax cuts of this nature where the majority of benefits go to the wealthiest have not resulted in significant job creation or income growth for average families. Instead, they have led to budget shortfalls, underfunded infrastructure, and cuts to essential services like education and health care. Georgia currently boosts a AAA credit rating. The highest possible which allows us to borrow money at lower interest rates for critical projects like roads, bridges, and public safety. But HB111 jeopardizes this financial standing. By reducing our state's revenue stream without a clear plan to replace it, we risk being forced into reactionary budget cuts that harm essential programs including law enforcement funding, rule hospital support, and public education. Fiscal conservatism does not mean reckless tax cuts that threaten the state's financial future. True conservative leadership means ensuring a responsible balanced budget that invests in long-term economic growth while keeping taxes fair and sustainable. If we truly want to reduce the tax burden on working families, there are better solutions. Expand targeted tax relief for low and in-middle income Georgians through increased exemptions and credits, approaches that directly put money in the pockets of those who need it most. Invest in infrastructure, health care, and workforce development which not only create jobs but also drive down or drive long-term economic growth that benefits Georgians. Let's ensure fiscal responsibility by aligning tax cuts with clear sustainable sources of revenue rather than relying on optimistic projections that could lead to future deficits. HB111 is not a responsible approach to tax reform. It is a risky, top-heavy tax giveaway that benefits a few at the expense of the many. It is bad economics, bad policy, and bad for Georgia's long-term financial health. I urge all my colleagues, and especially my Republican colleagues, those who believe in real conservative fiscal values to reconsider this approach. Rather, let's work together on a bipartisan, responsible tax relief reform that actually benefits hard-working families and keeps Georgia's economy strong. Now is not the time for giveaways to the wealthiest among us. Now is a time for real leadership. So let's stand up for the people we were elected to serve and reject House Bill 111. Thank you, Mr. Speaker. I yield the well. Jim is yielded the well. Representative Arden Sonja is recognized to speak to the bill. HB111. Thank you, Mr. Speaker. I'm friends. I rise today to speak against House Bill 111. Not because I oppose tax relief for hard-working Georgians, but because this is not a tax credit, it is a tax scam. Given tax break can be beneficial, especially in difficult economic times. But HB111, for short of that, yes, Georgians deserve relief, especially as people struggle with the rising cost. It is no secret that the cost of living has gone up since January 20th, with these misguided tariffs on imported goods. And our solution is to hand out tax break to corporations and wealthy people who shouldn't need any more money by now. And we leave many Georgians behind suffering. At the time where rural hospitals are closing down and our schools are underfunded, an inflation continues to head towards the ceiling. And this body solution.\n\nIt's to hand 500 million to the wealthiest 20% while the average Georgia and C's just $70 per year. As I entrepreneur myself with over 30 employees and I imagine this can probably be beneficial for me in some ways. But I didn't come here to enrich my own pocket. I ran for office to stand for and stand with the ordinary people. The leadership is a privilege to better the life of others. It is not an opportunity for you to satisfy your own personal greed. Two weeks ago we passed House Bill 223 to give tax credit to certain timber producers while I supported it as my vote indicates. And this chamber supported it in a strong bipartisan fashion. I must be completely honest with you all. It is a shame. It is a shame when you look at the unspoken design of that bill you will observe that many members of this chamber, high ranking members too, are the ones who will hijack those tax credit because many of them are timber farmers. They export timber, is peanut farmers and other agricultural products. It is a shame. We must also consider the long term risk. If revenue declines or we fail to grow at the expected rate, Georgia could face budget shortfalls. And that might lead to future tax hikes or cuts to essential services. I mean it is no secret. It seems that folks are ready to campaign beginning this summer. And this is what this bill is all about. I am not talking about what tax cut they gave to who. Look, you have to make a decision if you want to be for public service or you want to be for self service. Quit hiding and pretend that you are doing the people's work because you are doing your pocket work. Folks, I don't think anyone here need any more convincing to vote no one aged 111 in its current form. So let us work toward a smarter and fairer tax policy that truly puts Georgians first. Thank you. I yield. The gentleman is yielded well. There is any butner has recognized to speak to the bill. Thank you Mr. Speaker. Ladies and gentlemen of the house. I am going to talk to you from my perspective as a mother. I hope all of you have a child in your life that you have taken to a store sometime. And you have watched them see something in that store. And their eyes just pop wide open and they smile and they are gleeful and they see something they really, really want. I hope you have had that experience. And I hope that only a few times you were faced with the fact that the item that they want is not appropriate for them and you had to say no. Or that the item that they wanted you really didn't have the money for. And you didn't want to tell them and make them feel that they were poor. But you really couldn't afford it. Or for me sometimes the worst is well I know I've got the money and savings in like a rainy day fund. But the refrigerator or the car or the stove has been a little fickle lately. And if I buy this now and that breaks what am I going to do. That's where I feel like we are with this bill. To me the hardest thing is to say no to someone when they want something and there's anything possible I could do to give it to them. I want to do that. I want to give people things. And right now with the way people are hurting all across our state. I want to give them every chance to have every penny that they can have to buy every egg they want. I want them to have what they need. I want to give you some things I know and I think you know as well. I know the governor has a goal to lower Georgia's income tax rate to 4.99%. And I assume he feels his turn limit clock ticking and wants to check it off and get it done. And I think that the money involved with this is just in hundreds of millions of dollars and not billions like we have in the reserves. And I know that citizens need every penny that they can get. They are afraid. They are afraid of the unknown cost. They are afraid of the continuing increase in cost. And they are afraid of what might happen with the federal generated tariffs. I know we don't know what's coming our way. We don't have that crystal ball that tells us what's coming our way. But we do know that we have a budget that relies heavily on federal dollars. We are anywhere from 25 to 32% every budget year. And we don't know how much of that money is going to stay somewhere in Washington or come down to us. And I do know the man that sat in the aisle seat there many years ago, Mr. Tom Buck, who was the ways it means chair. And he thought the AAA bond rating of Georgia was the most important thing for us to take care of. Quite honestly on the side conversation, he might say it was more important than Medicaid for kids. But he really felt that that was the way we could have the money that we needed to do those things in the state of Georgia. Bond ratings are critical to our success. Bond ratings that are lower than AAA cost money. To keep bond ratings you have to do several things. You have to have positive employment trends. You have to have strong budget performance. You have to have balanced revenue sources. You have to have the ability to overcome financial and cover your financial obligations. And you have to maintain a reserve. And you have to honor your own statutes. I know we talk sometimes about things being either or. But sometimes choice is an option. And I know that's kind of wording that makes people nervous. But we have a chance today to put real money in the hands of citizens that will probably come up later. And that's representative McDonald's bill, HB12. 112. It is a more fair disbursement of funds. It is not a permanent change in our tax rates. And it is a possibility to help some of the people in our state that need it. In these uncertain times that are evidenced by the recent Atlanta Federal Reserve announcement of 2.8% drop in the GDP for the first quarter. And sometimes are uncertain. I just do not feel this is the time for us to make this rate change. I know we want to be like other states and have a low tax rate. But when you look at those other states with those lower tax rates, have you also looked at their bond rating? Have you also looked at their budgets? And have you looked at their economy to see how it compares with us? As I had to say far too often to my children, I just can't buy that today. I cannot buy this today. And I do not think we should pass this piece of legislation in these uncertain times. With that Mr. Speaker, I yell the well. I am glad you have yielded the well. That completes our minority report. We have up to 20 minutes, up to 20 minutes. You don't have to take it all. For the chair, it is time. Mr. Blackman, are you going to share your chairman's time? He is going to defer to Whitbert Shit for the first comments doing the chairman's time. Representative, you have to recognize and speak to the bill. Thank you Mr. Speaker. I started a bit earlier than I thought would today. But I am going to come in here and try to just refute some of these ideals. Firstly, it is interesting to me that a colleague of mine would come in here and say that we need not give a tax break. We need not give people's money back. We don't want to give them their money because we think that we can spend it better than them. Since when has the state of Georgia or the federal government ever spent my dollars better than I can spend them? I would submit to you that I know what kind of hamburger I like to buy. I know what kind of bananas I like to buy. Oranges. What gasoline I put in my truck. I don't know any state politician or state commissioner that can tell me that I can spend my money better than I can. This ideal that we do better a better job of spending our Georgia's money than they do is preposterous. It is crazy. It is nuts. I can't understand for the life of me how the party of the people can come in here and say that we don't want to give you your money back. We want your money because we know better than you. How in the world do we do that folks? That is just nuts. To me my perspective is that anytime anybody earns a dollar some parties want to take more of that dollar to offer to other people. I don't understand that. I wasn't raised that way I suppose if I earn a dollar I want to spend my money. I want to buy stuff for my kids. I want to buy stuff for my family. But to say that an entity other than me can spend my money better than me isn't totally nuts. I can't figure it out. One of my colleagues said this gives a break to the most wealthy, the wealthiest folks in this chamber. And I wish that graphic was still up there but without sounding condescending. And I don't want to be disrespectful, but this is a percentage rate. And the way percentages work is it's applied to amount and it takes the same percentage of that amount, amount away from our folks. So this income tax is a percentage rate of what you earn. So of course you take more from someone that makes more and you give back more to someone that makes more. But I would submit to you, someone gotten this will and said that $70 is not enough. $70 is not a lot. But I can tell you to a working single mother with two kids, $70 buys dinner, maybe two nights in a row. That buys dinner, two nights in a row. But my colleagues think that's a bad idea. You think that's a bad idea? It's a bad idea for a single mother to buy dinner for her kids. How is that a bad idea for a single mother? I don't get it. I just don't get it. One of my colleagues said that these other states have no income tax and have you looked at their bond rating. But one of them is Florida, zero income tax, triple A bond rating. You guys can look it up. Google took me five seconds to figure that out. Show me in this bill anywhere. Show me in this bill where this tax break gives a break to the wealthy and doesn't give it to the lowest income earners in this state. Point to the words, point to the lines. Show me where that is. I will help you strike it. Because that is not what's happened here. It is terrible for someone to come in here and characterize this bill as giving tax breaks to the most wealthy and not giving them to the lowest earners in this state. That is a terrible mischaracterization. It's a downright lie folks. It is a lie. It is a percentage. Point to zero to percent is what we're cutting for everybody in this state regardless of what you make from the lowest income. The lowest earners to the highest earners. The most fair way to apply taxes. I would really appreciate it if we would just characterize for what it is. For whatever reason, a party has taken a position to not give tax breaks. If you think you can spend Georgians money better than they can, then I welcome you to make that case in November. But that I'm going to yield back to the chairman. The chairman is yielded the well. The chairman of the committee. The chairman blackman is recognized. He speaks to the bill for the remainder of the time. Thank you, Mr. Speaker. I'll be brief. We've got a long day. But again, the very same legislation that provided for this rate reduction also took many off the tax rolls altogether. The more than double the standard deduction, providing along with last year's dependent deduction increase that a family of four now pays zero tax on their first $32,000 of income. That means a family of four that brings in $32,000 of income has an effective rate of zero. This measure again to reinforce the Whips point allows Georgians to keep more of their money, not the government's money, their money, and reduces the tax burden for every Georgian, for every Georgia family that pays taxes. Let's join in sending a message that we trust hard work in Georgians to spend their money better than does the government. Thank you, Mr. Speaker. I yield the well. And gentlemen, as you were to the well, that concludes those, I guess, the measure and those in favor. Is there any objection to report the committee, which was favorable to the passage of the bill? Here in the report the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes, all those opposed? Will vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? Mr. Clerk, will you lock the machine? Own the passage of House Bill 111, the yeas are 110, the nays are 60. This bill hasn't received the requisite Constitution majority is therefore passed. Mr. Clerk, will you read the caption of House Bill 112, 112? House Bill 112 by Representative Donald III with the 26 to be in, in, in, in total the NAC to amend Chapter 7 and in total 48 of the fiscal to Georgia and in Tate relayed an income taxes. So it's a provide for one time tax credit for individual taxpayers who filed income tax returns for the 2023 and 2024 taxable years. This bill I've referred to the committee on ways and means that committee recommends this bill do pass. The representative Lauren McDonald is recognized as the bill representative McDonald. Thank you, Mr. Speaker. Uh-oh, but thanks a lot again. Thank you pardon me. There we go. Ladies and gentlemen, House, I want to first, I want to thank my A-block friends over here. They returned my file right before I came up here. So I want to appreciate you all getting the bill back that I have to present. So who needs friends when you got the A-block guys over here? I bring this bill on behalf of the administration. This, this is not a bill that we haven't heard before a few years ago. HB1, 12 is a one time tax credit for those that have filed their 2023 and 2024 taxes. The amount that the, under there, the taxes that they filed for joint followers will get back 500 for ahead of household. We'll get back 375 for individual followers. You'll get back 250. Mr. Speaker, I yield for any questions. The gentleman has a question now. Front representatives, recommendations, recommendations for a question. Thank you, Mr. Speaker. Is the gentleman you? Yes, sir. Is it not true that House bill 112 was a reflection of the strong fiscal policy that management, the state has had that has resulted in economic growth and reflects our commitment to limited government? Yes, sir, Mr. Leader. With this and other legislation we've passed over the past two years, this commitment that each of us in this House is given to hard work in Georgia and will equal up to about $7.6 billion that y'all have given back to these Georgians. It's a big commitment that each of everyone have y'all made to Georgians. The gentleman you have one more question from width part to your left. Thank you, Mr. Speaker. Is the gentleman yield? Yes. Is it not true that I look forward to voting yes to this bill that provides fair tax cuts of 250, 375, and 500 to all Georgians, unlike the last bill, which again, per the map, resulted in unfair distribution of taxes? I want to thank you for your support and also the the pre-vote of support that my friend from Columbus gave in her presentation on the last bill. The gentleman has her further questions. Are you other well? The gentleman has yielded the well. Is any objection to the previous question, I mean ordered. Here he none the previous question is ordered. Is any objection to agreeing to report in the committee which was favorable to the passage of the bill? Here he none the report in the committee is agreed to. This bill now pass. I'll inflate the passage of the bill. Yes, I'll dispose. No, Mr. Clerk, will you unlock the machine? Have all members voted what represents a park can arise? She weighs. Have all members voted? Oh, members voted if so. Mr. Clerk, will you lock the machine? Owned the passage of House Bill 112, the A's are 175, the A's are zero. This bill ever see the requisite cost of majority is therefore passed. Mr. Clerk, will you read a caption to House Bill 159, 159? House Bill 159, by represent of Crow, 118th and others to be entitled, not to amend chapter 26 of Title 50, the fiscal code of Georgia, Antietta, Related and Georgia Housing and Finance Authority. So it's the increase the outstanding bond limit. This bill I'm referring to the committee on budget and fiscal affairs oversight that bill that committee recommends a disbilled do pass by committee substitute. Representative Crow, just recognize chairman Crow to present the bill House Bill 159. Thank you, Mr. Speaker. Colleagues House Bill 159 is a bill that would increase the aggregate amount of mortgage revenue bonds that the Georgia Housing and Finance Authority can issue each year. There's that story to cap to currently at $3 billion that would double that cap to $6 billion. These funds and the mortgage revenue bonds are used to support their Georgia Dream Home Financing Program. They originate loans for low income, first time home buyers, a lot of public safety, first responders, school teachers. It's a great program and this would allow them to continue to issue those bonds and keep that program funded so they can issue more mortgages. And I'll stay for any questions, Mr. Speaker. And gentlemen, has one question, Representative Washburn to your left for asking us for a question. Thank you, Mr. Speaker. Does Chairman here? Absolutely. Is it not true that I appreciate you bringing this bill? This is an important bill for entry level housing in Georgia, which we have a great shortage right now. Thank you for your support on this bill. General, I ask no further questions. Thank you, Mr. Speaker. Are you the well and ask for your favorable consideration? General, as you were the well, is there any objections to the previous question being ordered? Here in none of the previous questions ordered, is there any objection to adopting the committee's substitute? Here in none of the committee's substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Yes, all those opposed. We'll vote no, and Mr. Clerk, will you unlock the machine? I'm going to go on. Have all members voted for what purpose is represented? Williams and Rice? Mr. Speaker, is it not true that there is no obligation to the taxpayers of the state of Georgia by increasing this? There is no financial obligation to the state. Is that not true? I know that gentleman has learned it on this subject matter, and I believe he knows what he speaks, and I believe he's accurate. If all members now voted, if so, Mr. Clerk, will you lock the machine? On the passage of House Bill 159, the yeas are 162, the nays are 10. This bill, whoever is either requisite, constitutes a majority, is therefore the past. Mr. Clerk, will you read the caption of House Bill 185? House Bill 185, a rips and a earnhard of the 36 and others to be entitled to an act to amend Title 43, the fiscal to Georgia and TATA related professions of businesses, so as a repeal and reenact Chapter 118, the Dietetics Practice Act. This bill then referred to the committee on regulated industries that committee recommends this bill do pass by committee substitute. The lady from Cobb County or representative, Ginny Earhart, is recognized to present the bill. Mr. Speaker and members of the House, the Georgia Dietetics Act has not been updated in 30 years, so HB 185 serves to take care of that. What it does is it streamlines and narrows the requirements and the definitions to be licensed as a dietician and a nutritionist in Georgia. Most importantly, it makes a big distinction between general nutrition advice, like something that might be given to our children on their sports teams or a personal trainer or a coach, makes a distinction between that and medical nutrition therapy, which is often given in the treatment of a disease or disorder or a condition. That requires a much higher level of training. So the bill serves to streamline that, clarify that language. It also permits Georgia to join an Interstate Compact for licensed dieticians. We would be one of the first states in the Compact. I learned that there is an advantage to being one of the first seven states and that it allows you or would give Georgia a seat at the table and setting those requirements for the pact and the requirements for those dieticians that move in and out of the state. It's a good bill very much needed to fix some outdated language. Mr. Speaker, that is it and I will yield the well list or any questions. Lady has no questions. Lady has no questions. No questions. Thank you. I'm sorry. I said that real quick. Sorry about that. Lady has no questions. She's yielded the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there any objection to agreeing to report the Committee, which was favorable to the passage of the bill? Here in none, the Committee has agreed to shout this bill. Now pass. All in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no. And Mr. Clerk, were you in lock the machine? No. Have all members voted if so? No. Have all members voted if so, Mr. Clerk, were you in lock the machine? On the pass to House Bill 185, the yeas are wins 71, the nays are two. This bill, Henry C. the records, constitutional majority is therefore passed. Mr. Clerk, were you redecaption to House Bill 485, 485? House Bill 485, I represent a year to the 150 second and others to be entitled, not to amend. The official code of Georgia annotated so is to repeal various provisions enacted prior to 2013, which are contingent upon funding, in which remain unfunded. This bill ever referred to the Committee on Code Revision. That Committee recommends the Dispilled Do Pass by Committee Substitute. The Representative Bill Yurtah is recognized to present the bill or representative Yurtah. Thank you, Mr. Speaker. House Bill 485 is not the annual Code Revision bill, which will come later this session. That's actually a Senate bill this year. But this bill does the same function or similar functions. This bill streamlines and modernizes terminology, as well as some of the federal references in the Georgia Law. For example, references to like no child left behind act has since been renamed every Student Secede Act.\n\nSecond, the bill repeals provisions contingent upon funding that have remained unfunded since 2013, one of which has been unfunded since 1983. Finally, the bill repeals unconstitutional portions of a number of laws with language in this bill reflecting the reenacted constitutional portions of these laws. Any unconstitutional portion of law that requires further debate, of course, will be policy discussions of this general assembly were not included in this bill. I want to thank the legislative council for working hard on this and House budget and research for their assistance and would ask for your favourable consideration. The gentleman has no questions. Thank you. I yield the well, Mr. Speaker. And the gentleman has yielded the well. Is any objection to the previous question being ordered? Here in none, the previous question is ordered. Is any objection to adopting the committee's substitute? Here in none, the committee's substitute is adopted. Is any objection to agreeing to the report of the committee which was favourable to the past to the bill? Here in none, the committee has agreed to. Shall this bill now pass on in favour of the passage of the bill? We'll vote yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? Yes. Have all members voted? All members, all members have voted if so, Mr. Clerk. where you lock the machine on the passage of House Bill 485, the Yays or 175, the Nays or zero, this bill haven't received a requisite constitutional majority as therefore adopted. Members, if you have pages today, we're going to break for lunch and recess for lunch, we're going to ask you to come down and join your pages. Just before you move around too much, I want to ask you to remember a former member of this house, Chairman Bill Humbery, who many of you served with, he was chairman of rules. Bill is not doing well, so I'll ask you to keep him and his family in your prayers. Bill Humbery, he's represented the House District 67 at that time. A good man, a good friend, so keep him in your prayers if you will. We'll break until 1.30 p.m. we'll be in recess. This House will stand in recess until 1. Excuse me, I'm sorry, Mr. Clerk. Don't leave yet. Mr. Clerk, will you read a caption to a group of privileged resolutions? Honoring the life and memory of Bobby C. Pate, honoring the life and memory of Larry Max Cox. Commending William L. Bill Lundy for 40 years of distinguished illegal service, recognizing and honoring the members of the St. Patrick's Day Committee, recognizing and commending Dr. Terrence and J. Roberts, recognizing and commending Kinsley White, recognizing the City of Chattano, Hootie Hills, congratulating commending a Aletheia Chapman receiving the 25 Yellow Rose, NKT Randall Service, a leader award, recognizing commending the associate of St. Augustine Alumni, Atlanta, commending the links, incorporating and recognizing March 10, 2025 as Georgia and the link stay at the Capitol, recognizing Kumbaya as the Gula Gigi Anthem, recognizing and commending community supervision officer John Crue, the Department of Community Supervisionist, 2024 officer of the year, recognizing commending in Jerry Jerome Buie upon his retirement, and recognizing October 6 through 10, 2025 as Georgia pre-K week, and for other purposes that completes the reading of the privilege resolutions.",
  "updated_at": "2026-02-13T15:20:10.325332+00:00"
}