{
  "video_id": "d9fS5b4vmNM",
  "url": "https://www.youtube.com/watch?v=d9fS5b4vmNM",
  "title": "House Evening Session for Day 38 of the 2025 Legislative Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 38,
  "video_date": null,
  "duration_minutes": 86,
  "summary": "Here is a structured markdown summary of the Georgia House Evening Session for Day 38 of the 2025 Legislative Session:\n\n## Overview\nThe House session focused on passing key school safety legislation, including provisions from previous bills SB 17 (known as Ricky and Alyssa's Law) and incorporating new requirements around emergency communications, threat assessment plans, and mental health support for students. The session also included the introduction and passage of SB 199 related to campaign finance and transparency.\n\n## Key Actions\n**HB 268**: Amends education laws to require public schools to implement mobile panic alert systems, share digital mapping data with emergency responders, establish threat assessment plans, and create a student advocacy specialist position to coordinate mental health services.\n\n**SB 199**: Requires the State Ethics Commission to not accept or reject complaints against candidates within 60 days of an election, and streamlines campaign finance reporting requirements.\n\n## Bills Introduced (First Reading)\nNone noted in the transcript.\n\n## Notable Moments\n- Rep. Persinger provided an overview of the changes made to HB 268 in the Senate substitute, highlighting the incorporation of Ricky and Alyssa's Law and new requirements around emergency communications, threat assessments, and mental health support.\n- Several representatives asked clarifying questions about the implementation and funding of the new school safety requirements in HB 268.\n- There was discussion about ensuring timely transfer of student disciplinary records between schools.\n\n## Votes\n- The House voted 154-12 to agree to the Senate's substitute for HB 268, passing the school safety legislation.\n\n## Attendance\nNo explicit quorum notes provided.\n\n## Adjournment\nThe transcript does not provide information about the time of adjournment or the date of the next session.",
  "transcript": "268 as amended by the Senate, and we will agree to accept to as amended by the Senate.\nI think everyone has that. Now someone recognize\nRepresentative Persinger for a motion. Representative Persinger.\nThank you, Mr. Speaker. I moved the House agreed to the Senate's substitute to HB 268.\nMr. Clerk, will you read the caption?\nHouse bill 268 by Representative Persinger of the 119th to be entitled back to men chapter two titled 20 the fish go to Georgia and\nit related to elementary and secondary education so as to provide for the safety health and well-being of students and school communities.\nThank you Mr. Speaker I know the hours late so I'll be brief and just go over the changes that were made.\nThe Senate substitute incorporates SB 17 known as Ricky and Alyssa's Law and its entirety that will require all public schools to implement a mobile panic alert system.\nMuch like the one used at Appalachia that we know saved countless lives and\nprevented as much a much larger tragedy. This will also require each school to\nbe curi-digital mapping data to be shared with the state and local agencies\nthat respond to emergencies and school systems. The amended 268 also requires\nGMA and Homeland Security to establish a statewide alert system to report and\nmonitor incidents of safety threats made against schools. It will also require\nour schools to adopt threat assessment plans,\nproviding a structured and multidisciplinary process\nto identify, assess, and mitigate potential threats\nto schools while supporting the safety and well-being\nof students and school personnel.\nBill also creates a qualified student advocacy specialist\nposition who's required to coordinate mental health\nservices for students in crisis,\nand it also creates the grants to fund those positions.\nColleagues, after what we witnessed at Appalachian, this house committed to\nchampion legislation to bolster school security, mandate stronger\ncommunications between our schools and provide critical mental health resources\nto our students. That's exactly what House Bill 268 will accomplish and I ask\nfor your favor. Consideration is bill.\nGentlemen, has a couple of questions. Yes, sir.\nPhil Yeild. Yes, sir.\nRepresentative Roberts to your left has recognized for a question.\nThank you, Mr. Speaker, just gentlemen yield.\nI do.\nI'm all for all of these security measures.\nI just am curious on the, was it a listless law,\nthe mapping that is required to be implemented by,\nI think it was July of 2026?\nIs there funding in the budget for that\nor those school systems?\nI have no idea what they cost.\nI just wonder if we're imposing an unfunded man\nthey don't have schools with quick turnaround time.\nI think most of the mapping is already required\nthe school safety plans we did. I believe in 23. Okay. So it's just in addition to. Okay. Thank you.\nGentlemen, you are for another question. I do.\nWe're going to be in it.\nTo your left is recognize for question. Thank you with the gentleman you. I do.\nYou mentioned a mental health personnel. Is that per each school or for the school district?\nI wasn't I couldn't find it in the bill. So it was originally in our bill as a behavioral\na health coordinator and that's going to be allocated based on population. I believe\nit's 18,000, update 18,000 get one that we would fund through grants of 18,000 to 36,000\nwould have two and over 36,000 students would get up to three that would be funded by the\ngrants that we put in the budget. If they want to have more, they could have more. They\nI've set the fund in themselves.\nParticipant.\nCorrect.\nThank you.\nGentlemen, you have another question?\nYes, Mr. Speaker.\nReps of the barns to your left is recognized for a question.\nThank you, Mr. Speaker, Mr. Gentlemen, you'll.\nI will.\nAs far as the school safety devices,\nare they to be placed per classroom,\nlike the alert system?\nThat is the alert system that we use here at the Capitol.\nSame thing as the alert bathroom.\nAre we trying to place those in each classroom?\nThat's what I'm asking.\nWait, which alert system you speak?\nTell me about Alyssa's law or the one\nthat GEMA is responsible for?\nI guess the GEMA's law that we're gonna implement\nand put in each classroom.\nAre we putting these alert systems in each classroom\nor just in the school?\nNo, that's information sharing to make sure\nthat if there is a credible threat to a school system\nthat all agencies are involved in that communication.\nThat was part of the lacking in Appalachian.\nSo the other system that you were explaining\nis the actual device?\nCorrect, the device in a list of laws\nis the panic alert badges like we have here.\nOK, and they will go to each teacher or something\nlike that or student.\nCorrect, most systems are using that.\nI think if I'm not mistaken, we have about 80%,\nmaybe a little less than that compliance.\nAll right, thank you.\nYep.\nGentlemen, you hear from another question.\nOne more.\nReptility buttoner to your left has recognized for a question.\nDoes the gentleman yield?\nI will.\nThere was a great deal of conversation\nafter what happened in Winder and Appalachia School.\nAnd one of the things that they were talking about\nis that the student had only been there very briefly\nand that the records from the previous school\nthat may have given an indication\nof a potential problem had not arrived.\nSo when it talks about procedures\nto meet the requirements and student's education records\nin a timely manner, is timely mannered identified?\nWithin five days.\nOkay, thank you very much.\nGentlemen, you yield or one more question, is he?\nOne more.\nare rips that you sent you as is recognized for a question.\nThank you, Mr. Speaker, this is Jim and you.\nNo, will.\nSo the G3 databases removed from this bill\nthat would pass from the house or.\nThe S3 databases removed correct.\nOkay, for the yield.\nYes.\nBut the bill still includes disciplinary records\nfollowing students if they have a disciplinary record\nfrom school to school correct.\nCorrect, that's currently in a student's record now\nand follows a student now just not,\nthere's not anything codified as to the time frame.\nSo we're codifying that a student's record, which currently exists, must be transferred\nwithin five days.\nGreat.\nThank you.\nSpeaker, I yield the well.\nGentlemen has answered questions presented the bill and then you were the well.\nAll the gentleman's motion, the House agreed to the Senate's substitute to House Bill 268.\nAll those in favor will vote yes.\nAll those opposed will vote no.\nMr. Clerk, will you unlock the machines?\nof\nmembers voted, if so, Mr. Clerk, where you lock the machines.\nOn the Generalist's motion, the years are 154, the days are 12, and this house has agreed\nto the Senate's substitute to House Bill 268, the School Safety Bill.\nCongratulations, Rhapsody Perslinger.\nApplause\nThank you members.\nMr. Clerk, well you read the caption to Senate Bill 199, 199.\nSenate bill 199 by Senator Watson of the 11th being titled not to amend chapter 5 or title 21 of the official go to Georgia and attend it relating to government transparency and campaign finance.\nSo it's required that the State Ethics Commission shall not accept the reject complaints made against candidate 60 days prior to an election.\nThis bill em for the committee on government affairs that committee recommends this bill do pass.\nThank you, Mr. Speaker, members of the House, I have for you Senate Bill 199, which provides\na much needed uniformity in terms of our campaign finance disclosures, and also streamlines\nand simplifies some of our reporting requirements.\nI want to thank Mr. David Amadi, who was in the gallery with us right now, our State Ethics\nCommissioner Commissioner Executive Director for his input on this\nlegislation. This is a clean bill. No amendments. It passes in it without a single\nno vote. I think you're like it as well. Let me tell you about some of the\nkey provisions. Local filings now done with city and county. Election clerks will\nnow be reverted back to the state starting January 1st, 2027. It makes the\ndeadline 60 days prior to an election to submit complaints against the\ncandidate for election, currently at 30,\nchanges campaign disclosure reports to quarterly every year\nand provides uniformity of both election years\nand non-election years.\nAnd those days will be standard across the board.\nJanuary 31st, April 30th, July 31st, and October 20th.\nAnd also changes reporting for PACs,\npolitical action committees to those dates as well.\nSo uniformity across reporting dates.\nIt also requires PACs to have separate bank accounts,\nmuch like campaigns. It moves financial\nto closures reports to be due on April\nfirst every year instead of different\ndays and a non-election year. Again,\nmaking it clear find the situation\nmaking it more simple. It also requires\nour friends outside on the ropes to\nmake their reports once a month no\nlater than the fifth day of the month\nand also simplifies lobbyist\nregistrations. One of the last things\nI'll kind of talk about is also\nrestricts elected officials and candidates for office\nhomeless dress from public view.\nSo it does a good bit of things, makes things more uniform,\nstand it across the board, Mr. Speaker,\nI'll stand for any questions.\nYou have a couple of questions,\nRepresentative Stacy Evans, to your left,\njust recognize for a question.\nThank you, Mr. Speaker, does the gentleman yield?\nI yield.\nI think there's definitely more good in this building,\nbut I did have a question I wanted to ask you about\nonline 5.72, I guess really starting on 5.71\nwhere we are talking about financial statements.\nSay, amen, when you have it.\nNobody got my job.\nSo, two.\nWhat?\nYeah, no, I was I was are you there. I didn't want to start yet. Yeah, yeah.\nYeah.\nGarden in the thousand but not more than 2,500.\nWell starting this that whole section starting online 571 through 581 where we are.\nWe're having this part of the bill appears to me sets out the requirements for.\nand it may just be the statewide candidates\nfor their financial statements.\nMy question is, we've got a lot of compression\nat the beginning when you're setting out,\nwhen candidates are setting out their income\nor what they might hold in something,\nnot more than 1,000, then we've got between 1,000 and 2,500,\n2,500 and 5,000, 15,000.\nReally tiny, relatively tiny ranges,\nbut then we are like 500,000 to a million,\na million to five million,\nthe greater than five million.\nSo I'm having a hard time understanding why\nthere's more interest in knowing whether a candidate owns\nbetween 1,000 and 15,000,\nbut not knowing whether it was 5,000,000,000,\n100,000, 200,000, 500,000,\nwe're just letting that go as high as the sky can go.\nAnd I was wondering if that was discussed\nand what perhaps was the logic there?\nI can't speak to that exactly.\nI just know that it was creating ranges\nfor personal financial disclosure statements\non a source of income instead of exact amounts.\nThat's secondized law can give you\nin terms of the reasoning behind that.\nPerhaps that's something that could be looked at\nbecause I think from a transparency standpoint,\nthere's not a lot to be gained between the range of,\nto me, 1,000 to 15,000, maybe even 50,\nbut there's a lot to know between 5,500 million\nand we're leaving that to chance.\nWould you yield for one more?\nI will.\nI understand the logic of not having the Ethics Commission\naccept or decline a complaint during the 60 days\nbefore an election.\nI actually thought that was the law already.\nBut what happens to those?\nBecause they're very well maybe some wrongdoing\nthat needs to be brought to someone's attention.\nAnd will those just sit?\nor do they have to be filed again after the elections over?\nI will find out, but the intent with that\nis not to have a surprise, you know,\nsemi-logic complaint issue that close to an election timeline.\nI think it backs that timeline up,\nso we can have more time between those dates and the election,\nbut I will find out, get back to you.\nCould you tell me though, well, not the logic in that,\nI'm wondering what happens to the complaints.\nThe commission's not gonna accept them or reject them.\nI see the motion from the executive director saying\ngoing to go back to after the election. So you would have to refile it after the election.\nThat's correct. No, you don't. You don't have to refile it, but you could.\nThey roll over. So they're still heard, but after the election.\nUnderstood. And I guess if you would yield a little bit further, have a little discussion\nhere. If one more question. Thank you, Mr. Speaker. I understand it's great logic not to\ngive a campaign fodder to say a complaint's been filed or the ethics commission is considering\nthis complaint and that goes on a mailer within 60 days of the campaign but are we actually\ntaking that away because if they file it and it's not accepted or rejected it seems\nlike it would still be accurate for the complaining candidate within those 60 days to say ethics\ncomplaint has been filed against X, Y, Z. Is that would that be accurate if the\ncandidate said that? I'm not sure I can speak to that just I think we're just\ntrying to basically make some uniformity and simplicity to the timeline. Thank\nyou. Thank you. May not comply with state law but I bet you it'll be said about\nsomebody. Ripsney Bertchette. Whip Bertchette is recognized for a question. Thank\nMr. Speaker, does the gentleman yield to the whip?\nDid I understand you to say that this is going to simplify our filing so that even in election\nyears and non-election years, we're filing quarterly, is that correct?\nThat's correct.\nSo we don't have this three days provision like we've got right now.\nThe alternate seven between seven and fifteen days are non-election years.\nIt makes it standard April 1st, I believe.\nThank you.\nyou. You want another question? Mr. Speaker and the voice of Deputy Welp, Mr. Speaker,\nI will yield the well. The gentleman's yielded the well.\nIs there any objection to the previous question being ordered? Here it none, the previous\nquestion is ordered. Is there any objection to a green to the report of the committee which\nwas favorable to the passage of the bill.\nHearing none, the report of the committee has agreed to.\nShout this bill now, pass all in favor of the passage of the bill.\nWe'll vote yes, all those opposed.\nWe'll vote no.\nAnd Mr. Clerk, will you unlock the machine?\nhave all members voted have all members voted if so Mr. Clerk were you\nlocked the machine on the passage of Senate bill 199 the yeas on win 67 the\nThe Nays are one.\nThis bill, having you see the requisite constitutional majority,\nis there for the past.\nMembers in your folder, your agree-disagree folder,\nwe have Senate substitute to House Bill 288.\nSo that's what we're going to take up next.\nRepresentative Gaines is recognized for a motion.\nThank you, Mr. Speaker.\nI move that the House agree to the Senate substitute\nto House Bill 288.\nMr. Clerk, will you read the caption?\nHouse Bill 288 to be entitled back to amend\nArticle 2, Chapter 6, and Title 5, Chapter 4,\nTitle 9, Article 1, and Chapter 18, and Title 15,\nand Chapter 16, and Title 17, of the Fiscal Court of Georgia\nand attended, relating to a public practice.\nWe're upset that Houston Gaines recognized to explain his motion.\nThank you, Mr. Speaker.\nA House bill 288 in terms of the 288 did not change in the Senate.\nIt was combined with House bill 246, which was a bill that passed unanimously out of house committee here in the chamber.\nThese are both pro law enforcement bills that will help 288 is to ensure that if a district attorney accuses a law enforcement officer of credibility issues,\nthey have the opportunity to clear their name\nand this morning the Senate passed this bill unanimously.\nMs. Speaker, I'd be happy to answer questions.\nThere is one.\nTo your right, Representative Jason Ridley\nhas recognized for a question.\nThank you, Mr. Speaker, this is my friend, Yieldon.\nI think so.\nOn the end of the line, 8 to 18 and 2 to 19,\ncould you explain to me what a jiggle-o list is\nand why I'm not on it?\nIt's a giggly-o list.\nOh, giggly-o, okay.\nThank you.\nWe'll clear that up.\ndifferent string. I hope you're not on that other list, but\nMr. Speaker on that one I'll yield the will.\nSometimes I'm sorry I recognize people for questions.\nOn the gentleman's motion that the House agreed to the Senate\nsubstitute\nto House bill 288.\nAll those in favor will vote yes, all those opposed will vote no, and Mr. Clerk, were you in a lot the machines have all members voted\nhave all members voted if so miss clerk were you locked the machines all the\ngentleman's motion the yeas are 152 the nasa port to this house agreed to\nthe Senate substitute to House Bill 288.\nBack on the rules, calendar.\nMr. Clerk, will you read the caption of Senate Bill 201?\n201.\nSenate Bill 201 by Senator Walker, the 20th and others to be titled.\nan act to amend Code Section 10-1-393 for the fiscal to Georgia annotator relating non-fair\ndeceptive practices and consumer transactions, unlawful examples.\nThis bill I've referred to the Committee on Agriculture and Consumer Affairs.\nThat committee recommends that this bill do pass by Committee Substitute.\nThe lady from Lyons, Representative Hagen, is recognized to present the bill.\nThank you, Mr. Speaker.\nFriends, typically after a natural disaster, we tend to see the best in people, but sadly\non some occasions, we do see the worst in people.\nMost recently, after Hurricane Helene, we saw scammers in the form of storm chasing repair\ncontractors who suddenly appear to make home repairs.\nAnd I'm sure you've seen them in other instances\nof natural disasters around the state.\nThey show up and claim to be ready to make repairs.\nHowever, they often are praying on our senior citizens\nand potentially others of us who are not particularly well\nversed in contractual language.\nSo many people who are in a time of intense stress\nbecause of the natural disaster sign contracts\nfor home repairs more quickly than they would have otherwise\nwithout fully understanding what they're signing.\nSo this bill would do two things to address this.\nFirst, it amends the Georgia Fair Business Practices Act\nto provide greater protection for homeowners\nin the 12 months following a natural disaster\nto make sure that contracted work is performed\nin a timely and professional manner.\nAnd the second thing that this bill does is prohibit the assignment of insurance proceeds to contractors for a period of one year following the natural disaster.\nSo what it does is it gives homeowners who are in a time of intense stress the ability to cancel their contract if the contractor does not perform as they should.\nIt only applies within the 12 months after a natural disaster in a county that was included\nin a state of emergency proclamation by the governor.\nAnd right now this includes every county in the state because we have had these natural\ndisasters, state of emergency proclamations statewide for winter storms, hurricanes within\nthe past 12 months.\nAlthough it was a concern, immediately following the hurricane and this bill did come out of those concerns.\nIt is written in such a way that it would apply to any county who has within the last 12 months been declared a state of emergency due to a natural disaster.\nMr. Speaker, that is the bill and I'd be happy to take some questions if there are any.\nLady has no questions.\nThank you.\nI ask for your favorable consideration.\nLadies, yielded the well.\nIs there any objection to the previous question being ordered?\nHere in another previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in another committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nHere in another report, the committee's agreed to, shall.\nThis bill now pass all in favor of the passage of the bill.\nWe'll vote yes, all those opposed.\nWe'll vote no, Mr. Clerk, will you unlock the machine?\nHave all members voted for what purpose does Chairman Deloge rise?\nPower men are incorrect, Mr. Speaker.\nStay dead inquiry.\nSince our friend from Tim's mentioned that this bill was particularly beneficial to old\npeople, should I ask to be excused from this vote?\nYou would be if you were old, but you're not old, but the next guy that matches button,\nChairman Hitchens may have fit that bill, but you don't.\nSo I think you're clear to vote.\nHave all members now voted?\nYoungies, you feel right, Mr. Chairman?\nHave all members of the vote of this, though,\nthe clerk will lock the machine,\nown the passage of Senate Bill 201-201.\nThe Yays are 163 and Mays 1,\nthe Bill Henry, the requisite constitutional majority\nis therefore passed.\nMr. Clerk, will you be decaptioned to Senate Bill 130?\n130.\nSenate Bill 130 by Senator Hodges, the third to be entitled to amend Title 31 of the\nthe official code of Georgia Antietta,\nrelating to health shows to expand medical education,\nfunding, and the service,\ncancelable loan programs.\nBill haven't referred to the committee on health.\nThat committee recommends this bill do pass.\nRepresentative Townsend is recognized to present the bill.\nRepresentative Townsend.\nThank you, Mr. Speaker.\nSenate Bill 130 increases health care providers.\nThat's the goal.\nIncreases number of institutions offering residency\nand fellowship programs within the state.\nAt its final year, residents and fellows\nto the Georgia Board of Healthcare Workforce,\nConservation Loan Program.\nIf this should increase real healthcare providers\nin the area that track more fellows\nand residents in that area.\nHelps keep spine your residents and fellows in Georgia,\nespecially underserved communities.\nThis usually requires healthcare providers\nto commit to working in the underserved areas\nat least five years to repay the loan debt.\nThis applies to, of course,\nPAs, physicians, dentists, and advance, or ends.\nMr. Speaker, that's just to the bill.\nI can be glad to answer any questions.\nRepresentative Park Cannon, do you live?\nDoes recognize for a question.\nThank you, Mr. Speaker, do you yield?\nYes.\nI'm looking at lines 103 through 105 on page five\nFive of this measure.\nYes.\nWas this provision already necessary for someone\nto be a citizen or a US national?\nOr is this new language?\nFrom what I can tell, it's new language since it's underlined.\nThat's the best one I've read, this new language.\nOK, and further.\nYou said 103 to 105, correct?\nCorrect.\nYes, that should be new language.\nOK, so what's the legal reason?\nWhat's the metric for making this be only available to citizens at this time?\nI'd have to guess on that when the best thing I could say was to kind of\ngear it toward the citizens of the United States of America at this time.\nGentlemen, ask no further questions. Thank you, Mr. Speaker. Are you able to well?\nGentlemen, do you order the well? Is there any objection to the previous question being ordered?\nhearing none the previous questions ordered is any objection to agreeing to\nthe report of the committee which was favorable to the passage of the bill\nhearing none the report of the committee's agreed to shall this bill now pass\nall in favor of the passage of the bill we'll vote yes all those opposed we'll\nvote no and mr. Clerk will you unlock the machine\nhave all members voted for what purposes represent the rice rise.\nParliamentary quarry.\nState your inquiry.\nMr. Speaker, is it not true that Senate Bill 130 strengthened the storage of health care\nsystems by incentivizing medical professionals to remain in our state and serve in communities\nthat need the most?\nThe lady knows what she speaks, because that's one of the goals of this house.\nHave all members now voted, all members voted this so, Mr. Clerk, where you lock the machine.\nOn the passage of Senate Bill 130, the yeas are 155, the nays are seven.\nThis bill, having to see the requisite Constitution majority, is therefore passed.\nMr. Clerk, where you read the caption to Senate Bill 99, Senate Bill 99.\nSenate Bill 99, Senator Roberts of the 29th and others to be entitled now to men code section 16,\none, three of the official code of Georgia and it's had a really definitions relative to crimes and offenses.\nSo it's to provide for a definition of a law enforcement officer.\nThis bill has been referred to the Committee on Public Safety and Homeland Security.\nThat committee recommends that this bill do pass by committee substitute.\nHer representative Matt Reeves has recognized to present the bill, representative Reeves.\nThank you Speaker Burns and members of the House I present to you Senate bill 99 the Law\nEnforcement Partners Act and although this has a Senate bill designation this has house\nlanguage the House Committee on Public Safety worked on this this year twice once with\nthe House bill when the Senate bill passed 49 to one I talked to the Senate sponsor and\nhe agreed to work on our House version that the Georgia Sheriff's Association and the\nHouse Public Safety Committee had made some revisions too so we had a second hearing and\nthe committee passed it out on a bipartisan basis.\nGeorge is one of two states,\nNebraska being the other one that lacks\na jurisdictional basis for the federal authorities\nto work with our state authorities\nin cases of disaster upon state requests\nwith a joint task force.\nThat was an inadvertent repeal five years ago.\nThis bill would fix it and I really appreciate\nthe House members and public safety working so hard\non this on a bipartisan basis to present this bill,\nwhich I request your favorable support of.\nand I yield for any questions, Mr. Speaker.\nIf there are no questions, I yield the well.\nYou have a couple of questions.\nRepresentative Reese to your left and the back.\nRepresentative Teddy Reese.\nThank you, Mr. Speaker.\nThere's the gentleman you?\nAbsolutely, from my colleague from Columbus,\nwho I've talked about this with a lot.\nSo you're gonna take my inquiry from it in, huh?\nAbsolutely.\nOkay.\nI do wanna thank you for bringing this bill.\nAnd isn't it true that this bill will allow\nour local sheriff officers to have the necessary federal tools\nthat they need to help them do their jobs within a jurisdiction.\nAbsolutely, I appreciate you speaking to the local law and force\naround Columbus last year and this year,\nand I'm glad it's here on the floor.\nWe're representing NEO to your left.\nWay back here is to your, yes, is recognized.\nRepresentative NEO, recognize for a question.\nDoes the gentleman yield?\nYes, Representative NEO.\nIs it not true that we strip this bill and put your bill\ninto the house version, the better version, the preferred version,\nto make this a better bill.\nOur bill, our bill, our house bill.\nAbsolutely, and I appreciate your work on it\nin public safety and for speaking to federal authorities\nto get in better shape.\nAbsolutely, thank you.\nThank you.\nRep. William is back on our last question to your right.\nThank you, Mr. Speaker.\nDoes the gentleman yield?\nI do.\nI had a question.\nDo federal law enforcement acting under the request\nof state or local law enforcement\nhave the same immunities as the state law enforcement.\nThe reason I ask is I'm concerned,\nas I'm sure you know, federal law enforcement\nare subject to bivons, which are far narrower\nthan section 1983.\nAnd so if there's a differential in immunities,\nit's possible that federal law enforcement\nwould act in a far less constrained manner\nthan state law enforcement would in the exact same scenario.\nAnd I'm concerned that in that case,\nis either one would point to the other\nand either would avoid accountability or,\nperhaps even worse, the state would hide\ninto the guise of the federal enforcement.\nThat is a good question, Representative Lamb.\nAnd we got some questions answered in committee.\nNumber one, federal law enforcement.\nThey are prohibited nationally from moonlighting\nand do anything in the private sector\nlike sometimes people do in Georgia.\nSo when they come to work with a state law enforcement,\nthey are doing it under a specific request.\nThank New Orleans on January 1st\nwhen that terrible tragedy happened,\nthat kind of thing, if it happened here,\nwe'd want everybody hands on deck\nand law enforcement, whether it's a state\nor a federal issue going on.\nAnd so the issue of immunity,\nif they're doing their federal work on federal matters,\nthe federal law would apply and the state work,\nif they're doing it upon state requests,\nthat would be governed by analysis\nthat we have in here in Georgia, I believe.\nMr. Speaker, if there are no other questions,\nI yield the well.\nhave questions, but it's your choice.\nI yield well.\nYou were persuaded.\nGeneral Magiore to the well,\nis there any objection to the previous question being ordered?\nHere in none, the previous question is ordered.\nIs there any objection to adopting the committee's substitute?\nHere in none, the committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill?\nhearing none the report of the committee's agree to shall this bill now pass all in favor of the pass to the bill we'll vote yes all those opposed we'll vote no and Mr. Clerk will you unlock the machine\nHave all members voted all members voted\nIf so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 99, the yeas\nare 100 to 52, the nays are 11, this bill haven't received the requisite constitutional\nmajority is therefore passed.\nMr. Clerk, will you read the caption to Senate Bill 298-298?\nSenate Bill 298 by Senator Robertson of the 29th to be entitled back to men code section 5-6-34.\nThe fiscal to Georgia and attended relating to judgments and rulings deemed directly appealable.\nProcedures for review, judgments, orders, or decisions not subject to direct appeal.\nMs. Bill Ember for the Committee on Judiciary,\nthat committee recommends this bill do pass\nby committee substitute.\nChairman Rob Leveritt has recognized\nto speak to Senate Bill 298, 298.\nThank you, Ms. Speaker.\nLadies and gentlemen, we're kind of working on a theme here\nduring this portion of the rules caliber,\nbecause just like the previous bill,\nthis is sort of a house bill language coming back to us\nin the Senate bill.\nSenate Bill 298, at least the House or the Rules Committee\nSubstitute that I believe you have in front of you,\nwas House Bill 531, in essence.\nIt provides that a local government or any type of\ngovernmental any that it sued if they receive an adverse\nruling regarding sovereign immunity.\nThey have a right of direct appeal to that ruling,\nbut they've got to exercise the appeal only one time\nand within 30 days.\nDuring committee legislative immunity and then\nlegislative privilege has been added to that and it's also there's also a route\nfor direct appeal on a ruling relating to that whether it's a criminal or\ncivil case and there is no limitation because of course that can come up\nmultiple times within litigation during the course of discovery so that's\nbasically the bill mr. Speaker if there are any questions I'll be glad to try to\nThat's a good answer.\nGentlemen, has a question representing Miller to your left.\nSenator, I'll represent Miller.\nThank you, Mr. Speaker.\nJust a gentleman, you.\nYes, ma'am.\nWas there any consideration to giving citizens the right to appeal in adverse ruling direct\nappeal?\nIn other words, if the trial court found that the municipality had some kind of immunity\nthat the citizen could direct appeal it.\nMy understanding is there afforded a right of direct appeal already because that'd be\na final order in the case.\nThank you.\nAnd this is the, in the statute on direct appeals that are other than final orders.\nSo if it disposed of, just riddle me a second.\nIf it disposed of one party to the suit, the municipality, but there were other parties\nwho did not have the immunity, would the citizen be able to appeal even though the case\nwas still going on?\nAnd that I cannot answer to.\nIf there's multiple parties, I'm not sure they probably would have to get a certificate\nto appeal in that case.\nThank you.\nThank you for the question.\nGentlemen, there's no further questions.\nThank you Mr. Speaker, ladies and gentlemen, I ask your favor consideration of Senate Bill\n298.\nThank you and I yield the well.\nGentlemen, as yielded the well, is there any objection to the previous question being\nordered?\nHearing none, the previous question is ordered.\nIs there any objection to withdrawing the committee's substitute here in the committee's substitute\nis withdrawn?\nIs there any objection to adopting the substitute offered by the committee on rules?\nHearing none the rules committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee which was favorable to\nthe passage of the bill?\nHearing none the report the committee is agree to shall.\nbill now passed. All in favor of the past passage to bill will vote yes. All\nthose opposed will vote no and Mr. Clerk will you unlock the machine.\nAll members voted, all members voted, if so, Mr. Clerk, will you lock the machine on the\npassage of Senate Bill 1098.\nThe yeas are 142, the nays are 23.\nyour energy, the requisite constitutional majority is therefore passed.\nSenator Williams, the 25th and others to be entitled back to a men chapter 18 to title 43.\nThe official go to Georgia and to relay in the funeral directors and establishments in\nand bombers and crematories, so it's required for the organic human reduction as means of disposing deceased human bodies.\nThis bill ever further, committee unregulated industries that committee recommends that this bill do pass.\nChairman Powell is recognized to present Senate Bill 241.\nChairman Powell, thank you Mr. Speaker and ladies gentlemen of the House.\ntonight I bring you a Senate bill 241. This is a bill by a former member of the\nHouse and to distinguish one of few distinguished senators, who is a member\nlong-term member of the funeral caucus. Now a lot of people named different\nbills and I thought the appropriate name for this might be the buddy of the\nLoach Organic Farming Bill.\nYou know, one of the great things about being on reg industries that we hear\nabout all of it, but funeral homes have had a lot of ways of disposing by these old-fashioned\nways to bury them, and then you got cremation that a few years ago, I thought I'd about\nseen it all when it came up with this alkaline reduction about putting your carcass in a bucket\nof acid and all of that.\nWell now ladies and gentlemen, there's a new one in this called organic human reduction,\nand apparently this is the most the latest and the best on environmentally friendly disposal.\nhuman remains. I think you just basically and I don't know, don't ask me the\ndetails of how you do it. I think you scratch a hole in the dirt and they put\nyour carcass in it and cover it up so the cats can't drag it out. But what\nthis bill does, ladies and gentlemen, it puts guardrails on this type of\nbehavior and it requires licensing and inspections and this protects the\nfamilies that choose to use this type of disposal. Now it's almost dinner time so I\ncaution don't ask many questions because you might get some answers you don't\nwant to hear before dinner but if there's no questions I'll sit down and yield\nthe whale. Well there's a question and I'm a little bit concerned but it's my job.\nYes sir. Mr. Smith. Representative Donna Hugh to your left is recognized for\nquestion. The gentleman you? I certainly do. Said not true if this bill passes it\nwill help your dirt turn into worm farm and every worm farm will be productive.\nWell I have no idea that you're right to your honor but I would say that once\nyour body has been composted and I would almost assure you you can plant it in\na tomato plant and it might add a little bit more acidity to it. Well there's\nBecause we have one more I want to allow because I want to have dinner and I have to get\nover this for a few minutes or the caucus that knows a lot about this issue is represented\nby Representative Patty Stenson and she's recognized the lady's recognized.\nThank you Mr. Speaker.\nIt's a gentleman yield.\nI certainly do for the lovely lady.\nSo this question is really to help colleagues in the room that really don't quite understand\nour very important industry that really needs to be highlighted more in the state of\nGeorgia.\nIs that not true that the funeral industry does need to be highlighted more in the state\nof Georgia?\nAbsolutely.\nAnd the funeral directing needs to be a part of the list of hard-to-career demands.\nIs that not true?\nAbsolutely.\nI agree with you, lady.\nAnd is it not further true that we do need to separate the license of funeral directors\nand in bombers on the state of Georgia, is that not true as well?\nI would not if the ladies of states agree with her.\nBut back to this bill, Senate bill 241.\nIs it not true that this bill is only for, is optional for families that are, that wants\nto have this type of service, this cremation service, and it put guardrails in place to protect\nthe families as well as the environment?\nYou're absolutely right.\nFor those families that choose to use this type of procedure, you know, I think it may\nin another year will be bearing them like the crows,\nbearing them out west, we'll be putting them on scaffolds\nand things like this, but it's just another way\nof disposing of the relic remains.\nBut isn't it not further true that,\ndepending on the funeral home that you use,\nyou can probably get a really good deal\nby going this route its way, all right?\nIs that not true?\nWell, I'm not sure about that.\nThey tell me that this is a pretty expensive way,\nbut we know high environmentalists are,\nthey'll pay a little bit more to get a little bit less.\nBut is it not further true that I have a deal for $3900 that I take care of everything?\nIs that not further true?\nSo, ma'am, so.\nThank you.\nThank you.\nI will be supporting this bill and I encourage my colleagues to do the same.\nThank you.\nMr. Speaker, I would certainly encourage members to vote for Senator Williamsville.\nAnd let's move on to some other subjects.\nThat's why you're a wise man.\nThat's all I was waiting on to get it cleared by the funeral home caucus.\nThe other one is not commenting so we'll just move ahead.\nIs the gentleman's yielded the well?\nIs there any objection to the previous question being ordered?\nHearing none, their previous question is ordered?\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nHearing none, the report of the committee is agreed to.\nShout this bill now passed all in favor with the passage of the bill.\nWe'll vote yes.\nAll those opposed.\nWe'll vote no, and Mr. Clerk, will you unlock the machine?\nWe have all members voted, all members voted if so, Mr. Clerk.\nalert. We will lock the machine. On the passage of Senate Bill 241, the Yays or 157,\nthe Nays or 4, we buried this one. The Bill, having seen the records, constitutional majority,\nis therefore passed just...\nMr. Clerk, will you read the caption to members, they would be a little bit longer, a little\nbit longer.\nSenate bill 213, 213, Mr. Clerk, will you read that caption?\nSenate bill 213 by Senator Capatric of the 32nd and others to be entitled back to a men\npart two, Article 15, Chapter 1, and Title 10, the fiscal to Georgia and Tate are relating\nthe Fair Business Practices Act of 1975,\nso as to ban commercial cheating services\nthat target students and examine\na seeking of professional license\nthis bill having for the committee\nand regulated industries,\nthat committee recommends a dis bill do pass.\nRepresentative Martin,\nRepresentative Chuck Martin's recognized\nto present Senate Bill 213.\nThank you, Mr. Speaker.\nAnd all my years down here at the Capitol,\nI've never been dying to present a bill\nmuch as I have after following Chairman Powell. Yeah, that didn't work either. No, I do have a simple\nbut important measure for you this afternoon. There are companies out there that are taking\nadvantage of our professional people and our students. Advertising that they'll have exams taken\nfor you. This is in college, our technical schools, but primarily where it's most damage is in\nin the professions where these companies advertise\nthat somebody will take your professional licensing test.\nAnd what we're seeking to do today is add that practice\nwith the new code section and then have that code section\nalluded to in the Fair Business Practices Act.\nSo the Attorney General would be the person\nthat can prosecute that.\nOur idea here is that these companies\nthat are praying on students and our professionals\nin the state of Georgia that didn't get a license\nbecause somebody else took the test\nand are at risk of losing that license\nif they're found out.\nSo what our Senator, Senator Copatric has brought us today\nand what I bring to you in Senate Bill 213\nis very simple.\nIt holds those companies responsible for cheating basically\nto get a grade or a project done in school\nor a professional license or test\nand protect the people, the students,\nthe professional licensees, and the public in the state of Georgia.\nAnd with that, Mr. Speaker, I'll answer any questions.\nThe hour is late, and we'll move on.\nGentlemen, has no questions?\nI yield the well.\nAs for the favorable consideration of the House\non Senate Bill 213.\nGentlemen, as you were the well,\nis there any objection to the previous question being ordered?\nHere, none of the previous questions ordered.\nIs there any objection or green to the report of the committee, which was favorable to the passage of the bill?\nHearing none, the report of the committee has agreed to, shall.\nThis bill now pass all in favor of the passage of the bill.\nWe'll vote yes.\nAll those opposed, we'll vote no, and Mr. Clerk, will you unlock the machine?\nhave you\nhave all members voted if so Mr. Clerk will you lock the machine on the passage of Senate Bill\n213 the yeas are 155 the nays are 7 this bill having to see the requisite constitutional majority is therefore passed\nYou\nMr. Clerk, will you read the caption to Senate Bill 191?\n191.\nSenate Bill 191 by Senator Still, the 48th, and others to be titled an act to amend chapter 8.\nIt's on 34th.\nThe fish go to Georgia and attendee relating employment security.\nSo it's revised.\nCertain notice provisions relating to benefits and appeals.\nThis bill have been referred to the committee on industry and labor that committee recommends this bill do pass\nFor representative Judd Howard is recognized to present Senate bill 191 representative Howard\nThank You mr. Speaker bring you to a day Senate bill 191\nOne, Scott the same language as earlier I brought to you this year's House Bill 569, which\npassed this House unanimously.\nThis bill is a Department of Labor Bill that modernizes the Department currently, anyone\nthat goes and makes a claim for an unemployment claim, has to wait through the U.S. mail for\nthat decision to be reached to them.\nThis allows that claim that if they choose to opt in, they can provide their e-mail at\nthe time that they make that claim.\nAnd so they'll receive that notification\nof that decision much sooner.\nSo with that, Mr. Baker,\nI'll open to you any questions or yield the well.\nGentlemen, has no questions.\nThank you.\nGentlemen's yielded the well.\nMinority report is waived.\nIs there any objection to the previous question\nbe in order. Hearing none, the previous question is ordered. Is there any objection to a green\nof the report of the committee, which was favorable to the passage of the bill? Hearing none,\nthe report of the committee is agreed to, shall this bill now pass all in favor of the\npassage of the bill? We'll vote yes. All those opposed? We'll vote no. And Mr. Clerk,\nwill you unlock the machine?\nAll members voted, if so, Mr. Clerk, were you locked the machine on the passage of\nSenate bill 191, the yeas are 146, the nays are 16, this bill having to see the requisite\nconstitutional majority is therefore passed.\nYou\nYou\nMembers, we have a little more business attend to and then we're going to be out of here.\nFor what purpose is Representative Ballinger-Raz?\nTo make a motion.\nStage a motion.\nI moved an SB 8 to be moved back to the rules committee.\nMr. Clark, would you read the caption?\nSenate bill 8 by Senator Capatric.\nAnd 32nd and others to be titled back to event time with 15.\nThe fish go to Georgia annotated related to court.\nSo it was required for rest warrant requirements when juvenile courts are acting as a court of inquiry.\nOn the ladies' motion that SB 8 Senate bill 8 be recommitted to the rules committee.\nis the objection here and none is so ordered for what purpose is represented Cooper rise\ncharity Cooper to make a motion to stage a motion I move that we send back to the rules\ncommittee substitute to Senate bill 162 let's go on to your read the caption Senate bill\n162 by center helps that lower the 52nd to be entitled back to a man article on the chapter 34 title 43\nOf the fish go to Georgia annotated relating the Georgia composite medical board\nOn the latest motion at SB 162 be recommitted to the rules committee is our objection here in this order\nFor what purposes representative Allen power rise\nto make a motion.\nStage your motion.\nI move that this House recommit Senate Bill 204 back to the Rules Committee.\nMr. Clerk, would you read the caption?\nSenate Bill 204, Senator Jones, the 22nd to be entitled back to event code section 1770.1 of the fish code of Georgia annotated.\nYou're leading the trial upon accusations in certain felony and misdemeanor cases.\nOn the general's motion that Senate Bill 204 be recommitted to the Rules Committee, here's the objection, hearing none is awarded.\nFor what purposes, Chairman Bonna rise.\nHit your button please.\nTo make a motion.\nState your motion.\nI move that Senate Bill 293 be recommitted to rules.\nMr. Clerk, where you read the caption to Senate Bill 293, please.\nSenate Bill 293 by Senator Anderson, the 24th May the title of the act to amend Code Section 42.\n85.1 of the fish go to Georgia and Tate relating to license plates for certain veterans.\nAll the General's motion to Senate Bill 293 be recommitted to the rules committee.\nHere's your objection, here and done in this award.\nOkay, members, a little more.\nOkay, members, a little more procedural, very little, and then afternoon orders.\nChair recognizes representative work hours, chairman work hours are for a motion.\nThank you, miss, thank you, miss Speaker.\nI made this house agree to the Senate's substitute, the House bill 123.\nMr. Clerk, will you read the caption?\n1-2-3, House Bill 1-2-3.\nCouncil Member 1-2-3 by Representative Workhies of the 157 to be titled\nback to amend Title 17 to the fiscal to Georgia and to relay in the criminal\nprocedure so as to provide for pre-trial proceedings and capital offense\ncases where the death penalty is sought when the accused has an intellectual\ndisability.\nRepresentative Workhies or Chairman Workhies is recognized to explain the Senate\nsubstitute to House Bill 123. The gentleman's recognized.\nThank you, Mr. Speaker. The Senate judiciary made a couple of changes from\nreally fast. The defendant shall provide discovery at least 60 days because the\npre-trial motion was something new. So the defendant's got to give 60 days\ndiscovery and then the prosecutor halfway through that period has to give 30\ndays of their discovery so that both sides have 30 days where they're worth\nthe discovery. There's a clarification code on a couple of links and then since we took\naway the death penalty we added life without the possibility of parole and then changed\nthe effective date to the signature of the governor and that was it and I appreciate\nall of y'all's support on this and I'll stand for any questions.\nGentlemen has no questions.\nThank you and I appreciate your support and for everything you've done.\nThank you.\nGentlemen, Jeal to the Will.\nOn the Dylan's motion, the House agreed to the Senate substitute to House Bill 123.\nAll those in favor will vote yes.\nThose opposed will vote no.\nAnd Mr. Clerk, will you unlock the machines?\nhave all members voted all members voted this so mr. Clerk where you lock\nthe machine on the gentleman's motion the yeas are 150 the nays or three and\nthe house has agreed to the Senate's substitute to house bill 123\ncongratulations chairman workers I know you worked hard on that one\nFor what purpose is representative Anderson rise need to hit your button to make a motion speech a motion\nI move that this house temporarily suspend the rules or resolution can be read and assigned to committee\nMr. Clerk where you read the caption to the resolution a number of house resolution by represent of Anderson to the 10th of creating a house study committee\non election procedures.\nOn the gentleman's motion that the rules of this House be tipped for\nsuspended, so resolution, resolution can be read for the first time to sign\nto committee as their objection.\nRules.\nFor what purpose does Ripley's scenes rise?\nTo make a motion.\nState your motion.\nI make I move that the rules be temporarily suspended so that a bill may be read for the first time in assigned to committee\nThis clerk will you read the caption?\nA number of house resolution by represent of saints of the 180th honoring a life of Mrs\nRachel Hodge and dedicating an intersection in her memory\nOn the gentleman's motion that the rules of this house be typically suspended so\nSo a resolution can be read for the first time in the signed committee is there objection?\nTransportation.\nFor what purpose is represented Clark rise?\nStation motion.\nI move that the rules be typically suspended so that the bill may be revved the first time in a assigned to committee.\nMr. Clerk, will you read the caption?\nA numbered house bill by Representative Clark of the 100th and others to be entitled back to authorize the governing authority of Hall County to live in next size tax.\nOn the gentleman's motion that the rules of this house be tipper is suspended.\nSo a bill can be read for the first time assigned to committee is their objection.\nIntergovernmental Coordination\nSo what purpose does Chairman Blackman rise?\nNice button.\nMake a motion.\nStage a motion.\nI move that resolution be read for the first time I'm assigned a committee.\nMr. Clark, will you read the caption?\nUnnumbered House resolution by Representative Blackman in 146 creating House Study Committee\non reducing and prioritizing mandates for public school administration.\nOn the gentleman's motion that the rule of this House be temporary suspended, so they\nresolution me read for the first time assigned to committee as their objection.\nEducation.\nOkay members here's our posture we have some afternoon orders you're going to have about\na minute a little over but it's three of our afternoon orders that we need to stand\nfor I'm going to call them first I'm going to ask the members to stand and give the\nmembers in the well your attention members stand and give the members in the well your\nto represent the Val Williams, representing Buddy the Loach.\nI'll recognize, and who else would you like,\nand who else would you like to have with your representative\nWilliams?\nI represent Hitchens, members of the Chatham delegation.\nThese two Colonel's, Colonel Prince, Colonel Griffin,\nand any veterans, veterans retired military.\nVeterans retired military.\nI think the speaker is a deep regret this morning before the start of the session.\nI got a call from the garrison commander and forced to inform me that they had recovered\nthe bodies of three of the four missing military people.\nThe amazing part about it is they were in a six\n65-ton technical truck and fell into a peat bog, which they really literally covered\nthe entire vehicle, could not be found when it was found, special equipment had to be\nbrought in, General Norrie also released a statement that certainly the hearts of all\nmembers of the third goes out to those that is very doubtful that the fourth person\nwill be found alive, but certainly all of our communities around Hinesville, Liberty County\nand Savannah and all of our veterans along with you, we certainly extend our heartfelt\ncondolences to the family and we ask that we give them more than one of the silence\nthese heroes. Amen. Thank you. Thank you, Representative Williams. Members, if you're\ncontinuing to stand, I just want to say our heartfelt condolences to those families,\nRepresentative Williams, but also to their fellow servicemen that have worked so\ndiligently to recover those, those are, those are the servicemen there that have been\nalso our condolences to all concerned. Representative McClain give the gentleman\nyour attention and we're representing McClain. Thank you. Thank you. Thank you.\nI support this. Thank you very much for that delegation with me too.\nBut that delegation. Yes, because last Thursday was it it took a lot of us last\nThursday I got home in the district and it's kind of like this is a half\namount from my house. I tell you all earlier I had a have a nine I had what you\ncalled the 6,000 square foot district.\nThat is a picture of Indy Bullock,\nthe young five-year-old that was missing on Thursday\nand they found him Friday.\nAnd I like to thank the community, the teachers,\nHall County, the Gwyneth Police County Sheriff.\nI mean, everybody just got all together\ntrying to find this young man.\nHe's young, and it's, it's heartening because,\nand you think he was, he's nonverbal,\nhe was autistic, and they found him the day after\non that Friday.\nSo if we can just give a moment of silence\nfor the family because, again,\nthere's young people like that, that means a lot.\nSo if you can just give a moment of silence,\nI appreciate it very much.\nThank you, Mr. Speaker.\nAre you alone?\nThank you, Representative.\nIt's hard to lose a child.\nOur condolences go to those, that family.\nChairman Crowe and Representative McDonald\nare recognized for an afternoon order.\nThank you, Mr. Speaker.\nColleagues, as you may remember on Friday,\nI came and spoke to you about the five-year-old daughter\nof Sergeant Royce, Zah, Navy, who was in the hospital\nbattling an illness and sepsis. Unfortunately shortly after we left that afternoon, Friday\nevening, she passed away. And so I just come to ask you to continue to keep Sergeant Royce\nin his family, in your thoughts and in your prayers, and to say an extra prayer for five-year-old\nNavy. And if you would observe a moment of silence, thank you.\nI mean, thank you Mr. Speaker, thank colleagues.\nThank you colleagues, you may be seated.\nAnother tragic situation, our condolences go out to the family.\nRepresentative William is recognized for an afternoon order.\nRepresentative William.\nThank you Mr. Speaker.\nI timed this to a minute.\nSo I wanted to recognize the Title I parent centers in the 10 schools of the Meadow Creek\ncluster in my district, the staff at whom I've honored with House Resolution 534.\nBetween this year and last, you've seen me welcome students from actually the majority\nof these schools here for morning orders.\nSo if it's not clear, I love my schools, but I particularly wanted to single out the\nparent instructional coordinators and liaisons.\nThey are the glue of our communities and schools approach in a cluster that represents the\nplurality of Title I schools in the Gwinnett County Public School systems.\nI just wanted to read out their names, Johan Timmeron,\nSandy Rebus, Lucy Torp, Kenny Vanegas,\nAmanda Scott, Diana Rubio, Kyla Ramsey,\nIvan Serda, Michael Doin, Yvonne Crow, Judy Ruiz,\nNatalie Benevita, Martha Alonas,\nAnna Price, Maria Fernandez,\nMiriel Narenda, Judy Pena Perez,\nand Marisol Rocell.\nI'm so grateful to you all.\nThank you, Mr. Speaker.\nI yield the well.\nRepresentative Jackson just informed me\nthat if y'all remember one of our colleagues,\nRepresentative Craig Gordon, keep that family in your prayers.\nThey just, Craig just lost his dad.\nSo thank you, Representative Jackson.\nPrayers for that family condolences.\nCraig, good man, whether, did a fine job\nas representing Savannah and Chatham County.\nChairman Jasper's recognized for a net new in order.\nThank you, Mr. Speaker.\nMembers, I have in my hands a very important document.\nIf you're interested where we spend hundreds of millions\nof dollars on freight logistics spending.\nIt's a very detailed report.\nIt's the result of House Bill 617 that we passed last year\nthat adds transparency to how we spend dollars\nin freight logistics.\nMy fine intern Noah Rainwater over there has these for you.\nIf you're interested in one of these,\nI didn't give everybody one.\nbut also Noah has this antique thing called a map.\nAnd, you know, we thought that was pretty,\nyou know, we got some from Josh Waller,\nG.The other day, we thought we'd have Noah pass those out.\nAnd also, transportation, we meet tomorrow at one in 506.\nThank you, Mr. Speaker.\nIs that your announcement as well,\ntransportation at one tomorrow?\nYes.\nNothing like getting it all done at once.\nReptenti C.B.A.A.A.A.A.A.A.A.A.A.A.A.\nfrom these Devon Seaboss recognized for an eppin' order.\nRepresentative Willis, you're next.\nThank you, Mr. Speaker, members of this esteemed body.\nI rise today to recognize a true treasure\nin the heart of my district,\nthe crown jewel of Georgia's cultural landscape,\nthe Earl and Rachel Smith Strand Theater in Marietta\nas it celebrates its 90th birthday.\nSince opening its doors in 1935,\nThe Australian has stood as a place where generations of\nGeorgians have laughed, cried, and gathered for music, film,\nand storytelling.\nIt survived the Great Depression, stood through decades of\nchange, and thanks to a passionate community effort was\nbrought back to life with a stunning\nrenovation in 2009.\nToday, it's not just a theater.\nIt's a symbol, a symbol of what happens when a community\nrallies around the arts, a symbol of preservation,\nof pride and of purpose.\nWhether it's a local high school production,\na classic movie night, or a sold out concert,\nthe strand brings people to the Marietta Square,\nPhil's restaurant, supports small businesses,\nand reminds us why the arts matter.\nPlease join me in honoring the Earl and Rachel Smith\nStrand Theatre for his 90 years of cultural excellence,\nand in recognizing all those who have worked so hard\nto keep the lights on.\nThank you, Mr. Speaker, and I yield the well.\nCommunity treasure.\nHope it lasts for another 90 or so years.\nRepresentative Willis recognized for an afternoon.\nThank you, Mr. Speaker.\nArise today on the last day of Women's History Month.\nSonner, Mayor Emeritus of Atlanta, Shirley Clark Franklin.\nScripture states that with humility comes wisdom.\nShe is known for being bold, authentic, intellectual, brave,\nand compassionate, and that she is.\nShe was elected in 2001 as the first female mayor of Atlanta,\nand the first black woman to lead a major city in the South.\nShe was born in Philadelphia, Pennsylvania,\nsurrounded by civil activism and at an early age,\nher father was a judge.\nHer mother and educator, both of whom influenced\ntrajectory of becoming a staple in American politics. She's the second\ngeneration Howard University graduate, an avid arts lover, and she married\nDavid Franklin. He was an esteemed entertainment attorney and political\nstrategist. Fun fact, they met while she was a student at Howard. He was in law\nschool. He said he wanted to represent musicians. She said, please come meet my\nclassmates Donnie Hathaway and Roberta Flack, who became his first clients.\nLast week, Mayor Franklin was honored with the street.\nThree blocks from here in a park named in her honor\nand she deserves it.\nYou should know that she despises praise and accolades\nof this was no small feat.\nShe sent me a message thanking me for being there\nand speaking on her special day.\nI said, for you, are you kidding?\nI'd run a marathon barefoot to show up for you.\nThank you for being a safe space in my childhood.\nThank you for being an inspiration to women in leadership.\nThank you for being exactly who you say you are all the time.\nAnd then the spirit of being the music lover she is,\nI leave you with this Donnie Hathaway quote.\nSoul is about authenticity and feeling,\nand I want to give people the real thing.\nThank you, Shirley Franklin,\nforgiving Atlanta, Georgia, the real thing.\nWe acknowledge you today as a dynamic and courageous leader,\nand with that Mr. Speaker, I yield the well.\nThank you.\nThank you.\nThank you.\nCongratulations to former Mayor Franklin\non the nice honor having those spaces named in her honor.\nThank you, Mr. Speaker.\nColleagues, I rise today to speak on behalf of our three-in-a-fellow member, Representative\nCivilian Wakeer, a wakeer of District 64 in Douglas County, right back there.\nRepresentative Baker was recently involved in a car accident just outside the Capitol,\nwhere she was re-ended by a martyr bus.\nShe is suffering with a lot of pain, however she's doing her best to keep up with her legislative\nwork.\nShe's currently under Dr. Sorder to rest and recover.\nRep Baker asked me to thank all of you for your kindness and to let you know that while\nshe won't be returning for the remainder of the session, right now she is focused on\nhealing and continuing to serve in every way she can from afar.\nPlease keep representative Baker and your thoughts and prayers.\nThank you, Mr. Speaker, and I yield the well.\nThank you for reminding us.\nOur colleague is certainly not doing well,\nso let's keep her in our thoughts and our prayers,\nand let her know we miss her.\nIf you're watching, we do miss you,\nand we hope you'll be back soon, but if not,\nwe'll see you down the road a little bit further.\nThat completes our afternoon orders, Mr. Clerk.\nYou ready?\nI think we have some privilege resolution,\nSo will you read the caption to a group of privilege\nresolutions?\nMs. Clark.\nHonoring the life of memory of Clarence Ed Barker.\nHonoring and commending the life leadership\nin legacy of Wyatt Thomas Johnson Jr.\nCommending Hope Atlanta on 125 years of service\nto Metro Atlanta.\nRecognizing speak-life cancer care ministry.\nCommending a re through the Sharice Hopkins.\nRecognizing Commending, Michaela Arceia,\nRecognizing Commending, Pamela Brown.\nCongratulations to the Georgia Pharmacy Association\nupon its 150th anniversary,\nrecognizing Commending Ralph Evans upon its induction\nin the Georgia Agriculture Hall of Fame,\nhonoring the life, work, and contributions of Nina Packer,\nrecognizing Commending, Joyce Carter Stevens,\nrecognizing Commending, Andre Anthony Cross,\nthe junior, recognizing commending A.J. Calloway, honoring Michelle Taylor, Willis, honoring\nthe life and work and contributions of attorney Gerald E. Griggs, honoring the life and contributions\nof Patrick Mohammed and for other purposes that completes the reading of the privilege\nresolutions.\nThank you, Mr. Clerk.\nIs there any objection to adopting the privilege resolutions here in known the resolutions\nadopted. We do have some announcements but first I'm going to encourage you all when\nyou go to bed tonight before you go to bed to call representing Montaghan because he\nhad a birthday today. He is his birthday so call him and rouse him up in case he's\ngoing to bed early or anything. I don't see him back there. So happy birthday to\nrepresent him Martin Montaghan today. So I know represent Gullard you can call him\nlate and waking up, representing Martin Montohan. We have some announcements, Chairman\nHalk and this recognized foreign announcement. Thank you, Mr. Speaker, the\nCommittee on Health will meet tomorrow at 130 and cap 303, excuse me, 403.\nThe representative, Gay Baccoye, is recognized for an announcement, then\nrepresentative Gamble, you will be next.\nRepresentative Coye.\nThank you, Mr. Speaker.\nJust to remind us of you that have signed up for the Nigerian trip.\nYou will be getting an email soon, giving you more details about the trip.\nAnd also, there's a few who haven't signed up.\nIf you want to sign up, just give me your email address\nand your phone number and you'll be signed up.\nThe date remains July 18th through the 29th.\nThank you, Mr. Speaker.\nThank you, Representative.\nRepresentative Gamble recognized what announced, but.\nThank you, Speaker.\nTomorrow morning at 7 a.m., and Capitol 132,\nthe fellowship will meet for the final time of the year.\nIf you hadn't made it yet, you need to be there.\nThis is your last opportunity for the 2025 session.\nThank you.\nThank you.\nChairman Chokus, recognize one announcement.\nThank you, Mr. Speaker.\nThe Small Business Development Committee\nwill be meeting tomorrow morning at 8 a.m. 506.\nAnd we'll be looking at organized or retail theft\nto get an update on that.\n506, tomorrow morning 8 a.m. Small Business.\nThank you, Mr. Speaker.\nChairman Todd Jones recognized for the announcement.\nGood afternoon, TII will have a meeting tomorrow in CLOB 406.\nWe'll be taking up a drone bill.\nIt'll be a lot of fun.\nThank you.\nChairman Dickey.\nExcuse me, Chairman Dickey.\nMy apologies, 11 a.m.\n11 a.m.\nChairman Dickey recognized for the announcement.\nMr. Speaker, our coach consumer fares. We'll have the final meeting tomorrow at nine and see a low B would be here in the bill.\nThank you.\nChairman Guthrer, recognize one announcement.\nThank you, Mr. Speaker. Judiciary Committee will meet tomorrow at 2.30 and 1.32.\nWe have a few bills that are hearing only.\nThat completes our announcements, but I'll just ensure, make sure that everyone remembers\nthat tomorrow is a committee work day.\nSo you see some of your colleagues that had business a little bit early this afternoon and\nleft us before they heard all those announcements.\nWe need to be in our committee meetings.\nI encourage you all of all to finish out committee work day on Tuesday, what's the day?\nI'm bored.\nI'm lost.\nWhat's the day?\nIt's Monday.\nMars Tuesday.\nYes.\nTomorrow is Tuesday.\nIt's the committee work day.\nSo I encourage all of our members to attend their committee meetings.\nYou ready, Mr. Majority Leader?\nMajority Leader is recognized for a motion.\nMay not be the motion I want to make, but I'm ready to speak.\nMr. Speaker, move this house stand adjourned until 10 a.m. on Wednesday, April 2nd, 2025.\nThank you, Mr. Majority Leader. On the motion of the majority leader, this house stand adjourned until 10 a.m. on Wednesday, April.\nWow. Is that right? The second? Wow. Time flies. 2025.\nBefore I say this last part, I want to thank you all of your members for being here and your attention.\nToday, turning to the people's business.\nA good day in the house.\nThank y'all.\nAll those in favor of the majority leaders of motion\nwill say, ah, all those opposed, no.\nSome of us are going home.\nThe eyes have it.\nGreat day, y'all.\nThank you for your work.\nYou\n",
  "updated_at": "2026-02-12T17:21:38.846187+00:00"
}