{
  "video_id": "d9FvL9o5P8c",
  "url": "https://www.youtube.com/watch?v=d9FvL9o5P8c",
  "title": "House Day 36 of the 2025 Legislative Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 36,
  "video_date": null,
  "duration_minutes": 117,
  "summary": "Overview: This Georgia House session was focused on recognizing the contributions of long-time state Representative Terry England, as well as the opening prayer and pledge of allegiance.\n\nKey Actions: None detected.\n\nBills Introduced (First Reading): None detected.\n\nNotable Moments:\n- The House recognized the presence of Terry England, a beloved state representative, and celebrated his service and impact.\n- The opening prayer was delivered by Reverend Dr. Hugh Ward, who was introduced by Representative Chaz Cannon.\n\nVotes: None detected.\n\nAttendance: A quorum was present, as members were called to the floor to vote their presence.\n\nAdjournment: The session transcript does not indicate when the session was adjourned. The next session date is not provided.",
  "transcript": "All members, all members will please come to the floor. All members, all members please come to the floor. Are we going to, we'll be in session here a little bit. We have some business to attend to for the people of Georgia. So all members of your please come to the floor. Because the hour for convenient having arrived, all members will please come to the floor and take their seats. Mr. Clerk, will you ring the bell? All members, all members please come to the floor and take your seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? Mr. Clerk, will you ring the bell? All members, all members, vote if so. Mr. Clerk, will you lock the machines, please? The doorkeepers, will you please close the doors and keep them closed? I'm going to the vote just for a moment. Before we get to our chapel another day, we have another blessing today. That we've been experiencing over the last month or something like that. As one of the most beloved members ever are this chamber. And this Capitol Hill, this Capitol. If you have a seating right down here to my right. A few weeks ago, it's a miracle. Miracles still happen and miracles are continuing. He has some caregivers here with him today. Jamie Shepard's here. His family's done such outstanding work and helped the good Lord perform miracles in so many lives in this state and around the world. So thank you to the Shepherd family. Mr. Lannis Shepard, his grandmother, who founded the Shepherd Center, has made a difference. And thanks for the support from a lot of folks. We'll continue to make a difference in so many lives. Thanks to Jamie and the staff here with you today. We appreciate you all being here. Thanks to the one who really makes it happen. The kind of pushes and shows and pits and embraces and encourages. And that's Cindy England. Let's still see how much we appreciate her. Thank you. Well, that's all just about all I have to say on that. And the words of that wise man, I think that's about all I have to say. But not quite. You should have stayed standing up there, remaining standing up. A man who's really enshrined himself in history of our state in many, many ways I believe. And I think the records of this house and the records of his accomplishments, his friendship as he's built in this room and around our state. And the difference he's made in so many different areas with his compassion, his support as appropriations chair. But mainly as a human of fine, fine human being. We're glad he's having back here today. He'll be back. He's determined. And you can see that. So a friend of all of us in this room, a friend of Georgia, and our dear friend, Terry England. Thank you. Thank you. If you don't think the good Lord works in mysterious ways, this proof of it right there. He's blessed my life as he had so many of y'all's. And his example of in his belief, his strength, meaning the world to me. Thank you, Terry. Thank you for love for all of us and thank you for what you have done and what you will continue to do to make Georgia the best place, live, work and raise a family and have a little fun along the way. So thank you and we appreciate you being here. Now, I know all of you have some of you agreed form a representative chairman, a lot of hats, husband, grandfather, and all those good things. And I'm taking care of so many people in his life and so many different capacities. Terry's going to hang around. He's going to be here for the chaplain. Then he's going to go out to South Any Room. If you'd like to go out and spend a minute with Terry and the South Any Room, we'll continue with the business for this morning. But there'll be a time so you can do that. So thank you all for honoring Terry. Thank you, Terry Cindy. Shepherd's team. Thank you all for being here. So we'll move on. Thank you all. Y'all may be seated. As is our custom, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 170-second House District down in Motri, Georgia. I want you to vote for the little motriarch. I thought you were just making sure it is South Georgia. 170-second House District, gripping Chaz Cannon. Chaz. Thank you, Mr. Speaker. Good morning, members of the House. I'm honored to share with you this morning the Reverend Dr. Hugh Ward from Motri, Georgia. Reverend Ward, or as most of us refer to him as Hugh B, was born in Jackson, Mississippi in 1940. He graduated from high school in 1958, went on to graduate from Asbury College and Wilmore, Kentucky in 1962. Soon after, he joined the United States Marine Corps. He was up in 1966 and was sent to language school to become an interrogator. Later, he deployed to Vietnam with the Third Marine Division in 1968. Reverend Ward later received a Master of Divinity degree from Columbia Theological Seminary and a Doctor of Ministry degree from the Graduate Theological Foundation. He served 22 years as a senior pastor at first Presbyterian Church, my family's church in Motri. The members of my family have been long-term members. There are a multitude of honors and accolades that Reverend Ward has received over as many years of service. Aside from those many honors, the most important to me is that he married Beth and me over 20 years ago. He's baptized both of my children and he prayed for me during some of my most difficult times and my diplomas to the Middle East. Reverend Ward, at the very youthful age of 84, continues to serve his community on a daily basis. His wife of many years died. He could not join us today, but she still sings in the choir every Sunday morning in Motri. They have two daughters, Mandy and Katie and five grandchildren. Ladies and gentlemen, I give you Reverend Hugh Ward. This probably is one of the greatest honors ever bestowed on me in my lifetime. And, Mr. Speaker, I've watched you on TV, but you look a lot better in person. I love you, man. And, second, I have to say how heartwarming it is to see the way that you obviously have held Terry Inland in your prayers and thoughts and such a warm welcome this morning. It does me good to see that here in the state capital. Mr. Speaker and members of the House, I'm grateful for the opportunity to speak to you this morning. I'm grateful to my state representative, Charles Cannon, or as we call him, Chaz. Chaz himself had a distinguished career in many venues in the classroom, on the athletic field, as graduate of West Point, the military academy, on the battlefield, in the Middle East, and now in the public arena. He's retired Army officer. His wife, Beth, is a registered nurse. His two brothers-in-law also served with distinction in the United States Army as well. But thank God their pastor is a United States Marine. And then, this is a word about your work, not my work here. I bring words of gratitude for my president and CEO of Cockett Regional Medical Center, Dr. James Matney, and from our foundation staff. Thank you for your unwavering support of the Georgia Heart Program. This program has enabled Cockett Regional Medical Center to expand its service lines, to bring several capital projects to fruition and assist with the care of our indigest patients. Our rural hospital has a feisty, effective Georgia Heart administrator named Gina Horn, MacDonald. She has outhustled every other healthcare facility in South Georgia, and she spread the good news about supporting our local hospital. I also applaud the work of my good friend Sam Watson, who's crossed the way there, former father, husband, to Emily, and an effective and devoted citizen. I want you to know something about my county, where I've been a part of for 35 years. It has given birth to some of our state's greatest endeavors, the Sun Belt Expo, and if you've never been there, I hope you'll come and see the great things that happen there. The most most diving tigers, Saxby Chameless, makes his home in military. A YMCA that comprises 65,000 square feet of space. The birthplace of a Marist Mike, which we knew is ABC Mike in the early days. A national recognized hospital, and the Philadelphia College of osteopathic medicine, and some of the finest churches that excelled in reaching out to a needy world. I love living in Cockett County. Representative Cannon's father-in-law, Frank Harrison, kidnapped me from Decatur, and brought me to an island of tranquility in Cockett County to pass to the First President's Church. But speaking to you this morning enables me to give you a testimony that I had always planned to be a preacher and a pastor. No, I'm here to confess to you that at one time I actually worked for a living. I pedaled chemicals for a major corporation, Ashland Chemical Company. One of my favorite purchasing agent was a man named Larry Moore at Masonite Corporation in Laurel, Mississippi. He had been a slabberjet pilot in Korea. But I'll be honest with you when I met him, he weighed as much as a slabberjet. And over lunch one day, in a small barbecue joint in Laurel, Larry looked over an ear of corn dripping with butter onto his paisley tie. And he said, what would you be doing if you weren't calling on me? I said, I'd be playing golf. And he said, no you idiot. What would you be doing if they were alive? And I said, that would be a different question. I would resign from Ashland and become a Presbyterian pastor. If you resign now, he said, this time next year you'll have a year behind you. And so I hear I am 53 years later before you. God speaks to us in a plethora of ways. And sometimes we listen. You, ladies and gentlemen, are one of the largest congregations I've ever addressed in my whole life as a minister. And ever since Mr. Cannon invited me to be your champion for this day, I have prayed mightily that you all would have wisdom encouraged to serve this great state fight. I believe you will all work for the welfare and happiness of all to see that justice and compassion are allotted to your folks back home and throughout the entire state. Look, I know, and you know we live in a beautiful but burdened world. And at times it appears that our poor bleeding world is stumbling from one blunder to another. But we, the citizens of your state, have elected you. Whom we believe possess a broad vision for tapping the wells of wisdom. A wisdom that leads us in these challenging days toward a future of peace and prosperity. And so though I am not your personal spiritual God, I'm here to encourage you and your labors. Praying you will help us all pass on to our children a better world than the one we received for God's good and God's glory. I pray that this day in your daily adventures, you'll love the Lord your God with all your heart, with all your soul and with all your strength and your neighbor as yourself. I'd like to ask you to pause for a moment of silent prayer as you pray for Terry, as you pray for your constituents, as you pray for our state and our nation. Would you pause with me just for a quiet moment? O Lord our God, your love is unfailing and your mercies are renewed every morning. At this moment we lift up our souls to you as honestly and completely as possible. As we're able to do this, O Lord, fulfilling us what you long to accomplish, our freedom from sin and selfishness, our release from anxiety, lives tuned to truth and beauty, devotion and goodness. We know, O Lord, that you're the beginning and the end. You see the end from the beginning and you have seen, has seen us and been with us in all the ordinary moments of our life. You have laid your hand upon us in ways that are beyond our comprehension and because of this we have seen for ourselves in the extraordinary ways you're involved in the most ordinary moments of our lives. And we come to you. We come to you thinking of the rhythm of our lives. The daily routines we have here of sleeping and waking, of washing and dressing, of eating and saying goodbye, we come thinking of our work and the boredom and excitement that comes from our daily toll here in this howled place. In the midst of our thousands of wakings in the course of meeting our constituents and even in the fraction moments of our life, we know, O Lord, if you speak anywhere, it is here in the midst of our living. But it is in the cracks and crevices of our existence in the hairline fractions of our life we're not alone. We have come to know that you're the God of victory for us, for all of us. You're a victorious over sin and death. Those things which have a strangle hold on humanity. Because of you, we're awakened to a living hope that after every cross comes a resurrection, after every winter there is a spring. As we commit ourselves to you, let us go forth from this place with our confidence restored that compassion is able to conquer greed. That peace can overcome war, that love is stronger than hate, that life is miter than death. With that inspiration, let us arise and go into the world to find beauty and simplicity, to find riches and plain living, to find self-worth and self-giving for your sake, O Lord, we pray. I'm in. I pledge allegiance to the flag of the United States of America, and to the Republic for which it stands, one nation under God, interdiscipline with liberty and justice for all. Awesome. Great message. Thank you. The door keeps you made a lot of doors. Members, you may join Brother Ward, Dr. Ward in the south any room, along with Chairman England, and just a moment. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Thank you. Thank you, Mr. Chairman. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nWilliams, 168th and others, a resolution grading house study committee on protecting working families. Special rules, House of Resolution 713 by Refsan of Way to the 9th stillcocks of the 53rd Clifton of the 131st. Bullets of the 55th, Chastain of the 7th and others, a resolution urging healthcare providers across the state of Georgia to help promote the 988 suicide and crisis lifeline. Public and community health, House of Resolution 751 by Refsan of Crow, the 118th resolution recognizing Mr. William A. Fickling Jr. and dedicating a bridge in his honor. Transportation. Senate Bill, 332 by Senator Jones, 10th and James, 28th. Bill B. Todd, an act of men, an act of creating and establishing the Indicab County Georgia Districts from which the members of the County Board of Education to the County shall be elected. Andrew, Governmental Coordination. That completes First Readers. Second reading the bills and resolutions the clerk will read. House Bill 811 by Refsan of the 1175th, Corporate of the 174th, first chair of the 176th, in Sharper of the 177th, the Bill to provide a homestay exemption from Lounds County School District, Ed Lorn, Texas for educational purposes. House Bill 812 by Refsan of the 150th, Roads of the 144th, Williams of the 148th, Chaspers of the 11th, Prog, the 118th and others, the Bill relating to state building, plumbing and electrical codes, House Bill 813 by Representative of the 175th, Corporate of the 174th, Prog, the 176th, Sharper of the 177th, the Bill to provide a homestay exemption from Lounds County School District, Ed Lorn, Texas for educational purposes. House Bill 814 by Refsan of the 175th, Corporate of the 174th, Prog, the 176th, Sharper of the 177th, the Bill to provide a homestay exemption from Lounds County, Ed Lorn, Texas for County purposes. House Bill 815 by Refsan of the 175th, Corporate of the 174th, Prog, the 176th, Sharper of the 177th, the Bill to provide a homestay exemption from Lounds County, Ed Lorn, Texas for County purposes. House Bill 816 by Refsan of the 124th, the Bill to create the Green County Public Facilities Authority. House Bill 817 by Refsan of the 184th, Minks of the 178th, Dawson of the 65th, the Bill relating to livestock dealers. House Bill 818 by Representative Martin of the 49th, Lepreta of the 123rd, Gunter of the 8th, Blackburn of the 146th, Evans of the 57th. Bill relating to the Georgia Judicial Retirement System. House Bill 819 by Refsan of the 144th, Bill to authorize the governing authority of Jasper County, Chulebian, X-Eyes Tax. House Bill 820 by Refsan of the 144th, the Bill to provide a homestay exemption from Jasper County School District Ed Lorn, Texas for educational purposes. Bill 821 by Refsan of the 15th, Goggles of the 14, Lovers of the 12th, Editions of the 161st, Seaball of the 34th and others. A Bill relating to General Provisions, Relative to Bonds and Recogances, is House Bill 822 by Refsan of the 83rd, and the Bill relating to attorneys, House Bill 832 by Refsan of the 19th. In the 40th, Kelly of the 16th, Smith of the 18th, Bum, 10 of the 17th, the Bill to provide a homestay exemption from Pauling County School District Ed Lorn, Texas for educational purposes. Bill 833 by Refsan of Ridley of the 22nd, Thomas of the 21st, Goggles of the 14th, Bum, 20th, and the 20th, Ballinger of the 23rd. And others, a Bill to provide a homestay exemption from Cherokee County School District Ed Lorn, Texas for educational purposes. House Bill 834 by Refsan of the 16th, the Bill to authorize the City of Cedar Town, Georgia, drags aside all redevelopment of other powers under the redevelopment of powers long. House Bill 835 by Refsan of the 4th, the 6th, the 2nd, the Bill to a midnight to provide a homestay exemption from City of Dalton, Independence, School District Ed Lorn, Texas for educational purposes. House Bill 836 by Refsan of Smith of the 70th, Bum, 70th, the 3rd, Jenkins of the 136, Blaze of the 67th, the 16th, the Bill to a midnight providing a homestay exemption from County, School District Ed Lorn, Texas for educational purposes. House Bill 837 by Refsan, miles of the 126, Howard of the 129th, after the 130th Prince of the 130th, Newton of the 127th. A Bill to authorize the assessment and collection of a technology fee by the private port of Richmond County, House Bill 838 by Refsan of Smith of the 70th, Blaze of the 67th, Jenkins of the 136th, Bum, 70th, Dalson of the 65th, the Bill to amend an incorporating and providing a new charter for the City of Newton. House Bill 839 by Refsan gains over 120th, the 1st, the 1st, the 1st, the 1st, the 1st, the Bill to amend and act to pay the Board of County Commissioners for the County of Jackson. House Bill 840 by Refsan of the 11th, the Bill to repeal an act creating Pickens County Airport Authority, House Bill 841 by Refsan, jasper, the 11th, the Bill to provide a homesick exemption. From Pickens County School, this Advellant, Texas for educational purposes. House Bill 842 by Refsan of the 14th, Ridley of the 6th and Tarmony of the 2nd, the Bill to amend, and act to providing a home exemption. From Whitfield County, Advellant, Texas for county purposes, House Bill 843 by Refsan, Carpenter of the 4th, Ridley of the 6th, Tarmony of the 2nd, the Bill to amend and act to provide a homesick exemption. From City of Dalton, Advellant, Texas for municipal purposes, House Bill 844 by Refsan of the 4th, Ridley of the sixth time in the second, they built a Mandinac providing hope to the exemption from the field County School District at the loan taxes for educational purposes. House bill 845 by represent, Ridley of the 22nd, Thomas of the 21st, Scott guns of the 14th, bird of the 20th, balinger of the 23rd and others, they built a two-amending act to provide, putting numbering positions of membership of the Cherokee County Board of Education. House bill 846 by represent, Thomas of the 21st, Ridley of the 22nd, Scott guns of the 14th, Jasper of the 11th, Jones of the 47th and others, it built to provide a home say exemption of the Cherokee County School, Cherokee County, Advolume Taxes for County purposes. House bill 847 by represent, Cummings of the 39th, Campbell of the 35th, Steve of the 34th, between the 61st, Ridley of the 22nd, others, a bill to amend an act to consolidate the offices of tax collector and tax receiver into the Office of Tax Commission of County House bill 848 by represent, Kelly of the 16th, a bill to provide a home say exemption from both County, Polk County School District Advolume Taxes for educational purposes. House bill 849 by represent, Green of the 154th, a bill to amend an act to create a lower Chan Hucci Regional Airport Authority, House bill 850 by represent, of the 127th, principal of the 132nd, Howard of the 129th, after the 130th, Miles of the 126th, a bill to provide a home say exemption from a Guester Richmond County, Advolume Taxes for Consolidated Government purposes, House bill 851 by represent, Gaines of the 120th, with our of the 120th, first, Ridley of the 124th, a bill to amend an act to create the Athens County Board of Elections and registration, House bill 852 by represent, Gaines of the 120th, with our of 121st, Roads of the 124th, a bill to reconstitute and reestablish the Athens, Clark County Board of Elections and registration. House bill 853 by represent, Carpenter of the 4th, Ridley of the 6th, Tarvan of the 2nd, a bill to provide a new home say exemption from City of Tunnel Hill, Advolume Taxes for Municipal Purposees, House bill 854, by represent, Carpenter of the 4th, Ridley of the 6th, and Tarvan of the 2nd, a bill to amend an act to provide a new home say exemption from City of Advolume Taxes for Municipal Purposees, House bill 855 by represent, Taylor of the 173rd, a bill to amend an act to authorize the governing authority of the City of Thomasville to let me next size tax, House bill 856 by represent, the hood of the 175th, a bill to amend an act relating to the Brooks County, Reed Development Authority, House bill 857 by represent, Cummings of the 39th, Campbell of the 35th, Seabalt of the 34th, between the 61st, Ridley of the 22nd, and others, a bill to amend an act to create a state court of Cobb County, House bill 850 by represent, Cummings of the 39th, Campbell of the 35th, Seabalt of the 34th, between the 61st, Ridley of the 22nd, and others, a bill to amend an act to create a state court of Cobb County, House bill 859 by represent, Campbell of the 15th, and Skoggins of the 14th, a bill to amend an act to provide a homesack exemption from certain City of Cardiff's well-advolent taxes for educational purposes, House bill 860 by represent, Bartner of the 5th and Ridley of the 6th, a bill to amend an act to provide a homesack exemption from Gordon County School District, Advolent Taxes for Educational Purposees, House bill 861 by represent, Bartner of the 5th and Ridley of the 6th, a bill to amend an act to provide a homesack exemption from City of Calhoun, Independent School District, Advolent Taxes for Educational Purposees, House bill 862 by represent, Jackson of the 68th, between the 61st, ladies of the 67th, Jones of the 60th, Thompson of the 65th and others, a bill to, a bill to fix this allery of the share of a Fulton County, House Resolution, 685 by represent, sayings of the 180th, Taylor of the 173rd, Jones of the 47th, Oliver of the 84th, Ballard of the 147th, the resolution creating the House Study Committee on Mental Health Workforce Development, House Resolution 711 by represent, Oliver of the 32nd, Wade of the 9th, Dominic of the 29th, Chukas of the 105th, First Canon of the 172nd, the resolution creating the House Study Committee on Student Attendance in Pre-K through 12 Education. Senate Bill, 328 by Senator Strickland of the 42nd, Davenport of the 17th, Williams of the 25th, Jones of the 10th, a bill to amend an act to create a State Court of Henry County, Senate Bill 329 by Senator Strickland of the 42nd, Davenport of the 17th, Williams of the 25th, Jones of the 10th, a bill to amend an act to providing supplements to the salaries of the judges of the Superior Court, the District Attorney, and the Chief Assistant District Attorney of the Flint Judicial Circuit, three-second readers. The report of standing committee is a clerk will read. Representative Robert Dickie, the 134th District Chairman on Committee and Agriculture Consumer Affairs submitted the following report. In speaking, your committee on agriculture consumer affairs has had under its consideration following resolution of the House. It's struck to me to report the same back to the House of the following recommendation, House Resolution 368, due passed by substitute, respectfully submitted, Representative Robert Dickie, the 134th District Chairman. Representative Hawkins, the 27th District Chairman of Committee on Health submitted the following report. In speaking, your committee on health has had under its consideration following resolutions of the House. It's struck to me to report the same back to the House of the following recommendation, House Resolution 512, passed by substitute, House Resolution 592, due passed respectfully submitted, Representative Hawkins, the 27th District Chairman. Your Senate belongs to the 12th District Chairman on Committee on Insurance submitted the following report. In speaking, your committee on insurance has had under its consideration following resolution of the House and it's struck to me to report the same back to the House of the following recommendation, House Resolution 659, due passed by committee substitute, respectfully submitted, Representative Wilson, the 12th District Chairman. Representative Beth Camp, the 135th District Chairman on Committee on Intergovernmental Coordinator Locals submitted the following report. In speaking, your committee on intergovernmental coordination locals had under its consideration following bills of the House. I instructed me to report the same back to the House and the following recommendations. House was 774, due passed, House was 778, due passed, House was 781, due passed, House was 785, due passed, House was 786, due passed, House was 788, due passed, House was 789, due passed, House was 790, due passed, House will 794 do pass, House will 797 do pass, House will 798 do pass, House will 780 do pass, House will 787 do pass, House will 791 do pass, House will 793 do pass, respectively submitted represent Beth Camp of the 135th district chairman. Representative Gunner of the 8th district chairman and committee on judiciary submitted the following report to speak to your committee on judiciary, sat on an urd's consideration following bills of the senate is instructing me to report the same back to the House and the following recommendations. Representative Bill 10 do pass by committee substitute, Senate Bill 36 do pass, Senate Bill 173 do pass by committee substitute, Senate Bill 245 do pass by committee substitute, respectfully submitted representant Gunner of the 8th district chairman. Representative Tyler Paul Smith of the 18th district chairman and committee on judiciary noncivil submitted the following report. Representative Bill 10 do pass, Senate Bill 204 do pass by committee substitute, respectfully submitted representant Tyler Paul Smith of the 18th district chairman. Senator Sharon Cooper the 45th district chairman and committee and public and community health submitted the following report to speak to your committee on public and community health, sat on an urd's consideration following resolutions of the House and senate is instructing me to report the same back to the House and following recommendations, House resolution 611 do pass, Senate Bill 30 do pass by substitute, respectfully submitted representant Sharon Cooper the 45th district chairman. Representative Clinton crow the 118th district chairman and committee on public safety and homeland security submitted the following report, but speak to your committee on public safety and homeland security, as that under its consideration following bills of the senate is instructing me to report the same back to the House and following recommendations. Senate Bill 21 do pass, Senate Bill 29 do pass by committee substitute, respectfully submitted representant crick crow the 118th district chairman. Representative Parrish the 158th district chairman and committee on rules submitted the following report to speak to your committee on rules, sat under its consideration following bills, the senate is instructing me to report the same back to the House and following recommendations, Senate Bill 69 do pass by substitute, Senate Bill 255 do pass by substitute, respectfully submitted representant crick crow the 158th district chairman. Representative Jones the 25th district chairman and committee on technology infrastructure, innovations of the following report, to speak to your committee on technology infrastructure, innovation, as that under its consideration following bill, the senate is instructing me to report the same back to the House and following recommendations, Senate Bill 111 do pass, respectfully submitted representant Jones the 25th district chairman. Representative Shaw Blackman the 146th district chairman and committee on ways and means submitted the following report to speak to your committee on ways and means, sat under its consideration following resolution of the House is instructing me to report the same back to the House and following recommendations, House of resolution 557 do pass by committee substitute, respectfully submitted representant Shaw Blackman the 146th district chairman. That completes the reading of the reports of standing committees. Thank you. Okay members we have a local calendar this morning. I think y'all probably solve most of the problems in the United States of America and the world with all the conversations I've heard this morning. It's good to have Terry England back with us so members we do have a local calendar. We have four bills on the local calendar to relate to home set exemption and as you know require a two thirds rule called vote for passage. One of the bills on the local calendar is a degree disagree and this bill haven't received a requisite number of signatures required. The House delegation wishes to agree to the Senate amendment to the House substitute. Third reading now of and reading and passage of uncontested local bills. If there is no objection we will vote on the local calendar as a whole with a recorded vote. Here in none it is so ordered. Mr. Clerk will you read the local calendar. Please give the clerk your attention. House will 774 by Rose on Crawford the 89th to cab County House will 778 by Rose and Dickey the 134th Ups and County House will 781 by Rose and Dickey the 134th Crawford County. House will 785 by Rose and Dickey the 134th Crawford County House will 786 by Rose and Mathis the 133rd Dodge County House will 788 by Rose and Stinson the 150th Macon County House will 789 by Rose and Stinson the 150th City of Oklahoma for House will 790 by Rose and Stinson the 150th Macon County House will 794 by Rose and have scowled the 76 Clayton County House will 797 by Rose and Petry the 166th City of the 176th. City of Savannah Chatham County House will 788 by Rose and Mathiac of the 82nd Spalding County House will 788 by Rose and have rode to the 124th City of Greensboro House will 787 by Rose and Tarvan of the 2nd City of Chikamaga House will 791 by Rose and have crow the 118th Buts County House will 793 by Rose and have touns in the 179th City of Brunswick Senate Bill 77 agreeing to the 770th Senate amendment to the House substitute by Senator Huffstead with the 52nd City of Carter'sville. Is there any objection to the previous question being ordered on the local calendar? The very none the previous question is ordered. Is any objection to agreeing to the report of the committee which was favorable to the passage of the bills? The committee has agreed to shout these bills now pass. All those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk will you unlock the machines? I have all members now voted. All members vote of this so Mr. Clerk will you lock the machines? All the passage of the local calendar the yeas are 164, the nays are zeroed, these bills haven't received a record at constitutional majority or therefore passed. Members we have a lot of good folks who traveled here in our gallery. There we're going to have some morning order as it's important to them so I want you to give the member in the well you are attention. Okay members here's the deal. We have about 200 morning orders not quite but it's close. So you're going to have 30 seconds for your morning order. We'll cut you off at 45 because we have 25 morning orders this morning. So those of you who can go really fast do it and those of you who need a second or two longer to recognize some good folks here with us. That's what we would implore you to do represent. So let me give you his own deck represent. You wait you come on down your first up then chairman Todd Jones and represent the huddle son and friends and chairman Corbett. That's kind of the way we're going to roll here. So we can be much more efficient if y'all are ready represent. So I think the president of the waiting friends is recognized for a morning order. Members please give the member in the well your attention. Conversations can go out to the any room. Thank you speaker and thank you colleagues. I'm inviting my friends both to my left and right as they have served our nation. And I'm here to recognize one of Lumpkin County's finest the junior at the University of North Georgia. He is headed for the army but he was recently recognized for the UNG board's head brigade. Brigades S4 and he's going to be he also has a perfect 4.0 GPA. He just got recognized by congressional presidential fellowship at our nation's capital got home this morning and he is here to see the best state capital in the nation. And if you'll just congratulate him he and his family are here and Mr. Speaker I think you know this young man's grandfather former state senator, Godmiddleton. Thank you very much. Oh absolutely. Thank you well average appreciate you. Well done son. Quite the accomplishments tell your granddad we all said hello as well. Good to have you with us. You have another one. One more very quickly the gallery schools. I don't know that they made it in the gallery but I'd like to recognize the Lumpkin County High School girls state champion wrestling team. The state champions and we also had two individual state champs. Casey Carpenter is very proud of y'all too but go lady Indians and a special shout out to their superintendent head. She's with him today as well and the Lumpkin County High School principal and team. Thank you very much. Go Indians. Chairman Todd Jones is recognized for an announcement. Maybe not he's down with his folks representing the Huttleston Gamble Smith and Skoggins. I'm just recognize for an announcement in chairman Corbett. We'll get it just give us a good y'all go ahead get lined up. And friends ripsing Huttleston and friends there we go. All right give the gentleman the will your attention please. Thank you Mr. Speaker colleagues I come before you today with heavy hearts. This family and the tragedy not only affected us locally within my district. Excuse me just ladies and gentlemen members this all staying thank you I'm sorry I didn't realize what you recognize here. Thank you. With our heavy hearts like to this effect not only locally stay but across the country. We're here to honor the legacy of the Nigglands family and others. On July 26th 2024 the gospel music community and countless hearts across the world were shaken by tragic laws of seven beautiful souls and a devastating plane crash. Today we come together and remembrance in celebration of their lives. Kelly Neyland Clark a woman of faith Jason Clark a devoted husband Amber Neyland Kisler a voice of pure beauty. Nathan Kisler a loving husband Melanie Hodges a dear friend Larry Haney a skilled pilot a Melissa Haney a devoted wife. With our hearts morning we also recognize the resilience and strength of Aldon Nielsen straight men. They're surviving member of the family group. She is here with us with family members today in the gallery. Who carries forward the spirit and love of her family and the midst of her loss. May she find comfort in the embrace of friends, faiths and everlasting love of those who walk with her in spirit. The Nielsen's music is a beacon of faith and their legacy will continue to inspire generations to come. Through their voices made no longer echo in the concert halls they will forever sing in the hearts who love them. May their memories be a blessing and find that we find comfort in knowing that they now sing in the presence of the Lord. If you will just allow a moment of silence. Thank you colleagues. Thank you Mr. Speaker. Which all minds standing so we can recognize the family members please. Thank you all for being with us what inspiring performance is in music. The family presented to so many hearts and minds and thank you all and our continued prayers go out to you. Thank you for being here. We will represent you. Nisa Jones is recognized for and friends. Can I get all the members of Alpha Kappa Alpha Sorority Incorporated to the whale please. Thank you. I'm going to make this quick and I'm going to do it real good. Thank you speaker. It is an immense honor to stand before you today as we gather to celebrate the significant strides being made by the I-O-T-A-T chapter of Alpha Kappa Alpha Sorority Incorporated that was charted on January 11th, 1975. There are 50th anniversary on the campus of the Mercy University in Macon, Georgia and I get the honor of serving as one of its state representatives. In attendance in the gallery we have one of the charter members, Will and Wright if you please stand. And their current president, Nivia George and other members or other those that were made or initiated in that chapter if you please stand as well. So let it therefore be resolved with this resolution House resolution 364 and be confirmed by this House of the great milestone that this chapter has made in the city of Macon, Georgia. Thank you speaker. I yield the well. Welcome to the House. The ladies yielded the well. Representative Lisa Campbell. Recognize and then Representative Baker and then Representative Gamble. Representative Lisa Baker. Campbell. I'm sorry. Representative Lisa Campbell and friends. Please recognize. Thank you, Mr. Speaker. All right. Colleagues today.\n\nRise to recognize and celebrate executive function day at the Georgia State Capitol. This momentous occasion marks the first time this recognition has been granted in both chambers, underscoring the value and significance of teaching the cognitive skills essential for students and learners of all ages to succeed in literacy, science, math, and everyday life. We recognize students overall cognitive skills, mental health, and well-being in a world where the demands of daily life continue to grow. Nurturing and explicitly teaching these skills is essential to helping students navigate their challenges. I want to recognize, to Cheta Kameth, the nation's leading expert in the brain science of executive function. She's in the gallery today. Please rise and recognize one of our state's leading champions for children. Thank you so much. And I yield, I yield well. Thank you. Representative Baker, recognize for a morning order. Thank you, Mr. Speaker. It is a special honor for me today to welcome the staff and students from Chapel Hill High School in my hometown and my district of Douglas Field, Georgia, who are visiting the Capitol today. These bright students are here today as part of their American government and civics class taught by the incredible Mr. Hill. They're currently studying Georgia Standard SSCG8, which focuses on the legislative branch and there's no better way to bring those lessons to life than to see their state government in action right here in our chamber. So I'm proud to represent these students and their school and I'm grateful for educators like Mr. Hill who are shaping the next generation of our leaders. Please join me in giving a warm welcome to the students and staff of Chapel Hill High School. Go Panthers. Thank you, Mr. Speaker. I yield well. Good to have Chapel Hill. Welcome to the people's house. Representative Gamble. Representative Matthew Gamble. Thank you, Mr. Speaker. We have today in the house gallery with us members of the Hope Animal Assisted Crisis Response Team that have joined us in 2024. The Hope team from the Southeast region logged close to 150 volunteer hours and engaged in 1200 meaningful interactions with Georgia disaster victims. Today we're joined by Sweet Pea and her handler Melanie Dallas, the CEO of Highland Rivers, Oliver and her handler, Dave Thomas, Roby and his handler, Tammy McGill. They're going to be set up in the any room if you'd like to come have your photo with our assist, assist crisis response animals. They do with death notifications and traumatic instances. Come greet them and have your photo made with them. Thank you, Mr. Speaker. Great service to mankind here. Man's best friend. No doubt. Representative Cummins, I think you're still here and some friends are going to come along with her. Representative Terry Cummins. Good morning. I'm here today to welcome Mazel Tazaro. She is from Israel. I met her in December during my trip to Israel as she is a survivor of the October 7, 2023 attack at the Nova Music Festival. Mazel will be sharing her story with us later on this afternoon at 430 and Capital 216 by our light. Mazel and the members of the Consulate to please stand and welcome the Georgia's capital. Speaker, please come down to the any room. You can take a picture. There's a look for the dogs. Speaker, I yield the well. Thank you, Terry. Welcome. Council General, it's always good to see you. It's always good to see you. Thank you for being here with us. And we'll see y'all down here. Thank y'all. Chairman Martin recognized for a morning order. Then Representative Holly would be next. And the Henry delegation along with Representative Holly. Chairman Martin's recognized. Thank you. Good morning, Mr. Speaker, ladies and gentlemen. We all have gotten to know and get our jobs on because of interns. And this morning I rise to recognize Dr. Stephanie Kersy, who is the intern coordinator of the Georgia Legislative Internship Program, working alongside Ali Martin and Stacey Perry to bring interns to us down at the capital. She is an anchor to every intern. And she has ensured that they are. Have fantastic support as they come to work for us at the capital today. Also today she is in her gallery and I would like to ask Dr. Stephanie Kersy to stand to be recognized as the Georgia State Coordinator. And today is her birthday. If y'all would join me in recommending Dr. Kersy. Welcome to the People's House. Good to have you. Appreciate you work. Thank you for being with us. Representative Holly. He's going to have one by himself. Then he's going to have one with the Henry delegation. Is that how you go do this, right? Well, the first one by himself. First by yourself, the next one with friends. Representative Holly. All right. Mr. Speaker. We're pleased to welcome and acknowledge that we are in the presence of greatness for our third annual Black Men and Boys Day. Joining us are the men of Black Male Initiative, Georgia, members of Ebony Caucus, let us make men at Atlanta University Center students for the third annual occasion. So members of BMI and friends, I ask you rise up, you mighty men. Stand tall and connect with your power in this place. You all just get one hand there. I see we see you in the back. Appreciate you. All right. Now the Henry County delegation, if you would join Representative Holly. Yes sir. For another morning order. Henry County delegation, please step forward. All right. Mr. Speaker, thank you. Great American patriot, Patrick Henry, reminded us that perfect freedom is necessary to the health and vigor of commerce. Well, the freedom of commerce is alive in Henry County. Joining us in the gallery. We have Henry County Chamber President Joe Henning, board member Christy tuning of Central Georgia AMC and newly elected board chair, Morrell MacRerry, as well as a host of very successful entrepreneurs on the rise. So please, my colleagues in this chamber, show some love for the money in Henry. Colleagues, let's rise and recognize the Henry Chamber of Commerce. Thank you. You're welcome. Welcome, Henry Chamber of Commerce. Chair Lady Hagan is recognized for a morning order. Give the lady your attention, please. Thank you, Mr. Speaker. I'm here for on a very happy occasion today to recognize the Tooms County High School football team on their huge win in the state championship. Last fall, would you guys stand up please? All of you. Yes. They are the 2024 Georgia High School Association Class A Division One State Champions. They finished their season with a record of 13 and one and they did this during a time when our community was really struggling after the hurricane. They continued working together for their community, with their team and I'm so proud of them and how they persevered. It was our first ever State Football Championship with a decisive 38 to 18 win over in Northeast. So thank you guys for being here. We're so proud. Congratulations. That's awesome. Representative Sharper and Representative Mitchell and Representative Willis and other friends are recognized for a morning order. Give the members of the Will. Your attention, please. But anyway, it's an influential women of Georgia Day at the State Capitol and we appreciate everybody being here. But I think my co-sponsors as well. But we're going to recognize some great people here. The first person we have is Miss April Love, CEO, Executive Producer, author, TV host and press cancer survivor. We have Miss Roshan Ali Smith, philanthropist, multimedia personality and author who's been here forever doing a great job. Also, we have a representative for Miss Eamarsel, pick for who's actually right now on the stage play, Jason Lyrics, Andre Crenshaw is here to represent to receive that for her. Dr. Crystal Jordan, award-winning author and journalist and entertainment publicist. And also, we have Dr. Helmley Cahams, she's a dentist, author, inspirational speaker and actress. So if y'all don't mind, stand to your feet ladies and let us give you the encouragement and the support that you need. And these year in ladies will be coming down to take pictures with you guys. So once again, thank you so much. God bless you. Thank you, rain Stevens for putting this together. Thank you so much. God bless you. Good to have you in the people's house. Representative Reeves. Representative Reeves is recognizing representative Mathis to be next. Thank you, speaker Burns. I welcome going out members to come down here to honor two groups of young people we have in the capital day. First is, first is Sugar Hill Youth Leadership. Please stand up. House. Let's welcome them. They are some bright young people from linear high school and North Gwyneth high school spending a year learning leadership. Secondly, we have whole middle school here today. Their principal was honored a few weeks ago. They are a blue ribbon school. They feed into peach tree rich high school. So let's welcome whole middle school. Thank you. We yield the well. Welcome all you folks from whole middle school good to have you the capital representing Mathis. Representative Matthews recognize give the gentleman your attention please. Thank you, Mr. Speaker. Thank you, members of the house. Thank you folks in the gallery. I am honored to be here to congratulate the Blake County High School Royal Girls Cross country team for winning the 2024 Class 1A division state cross country championship. I'd like for you to stand over here girls if you would please and I would like to say that one thing for this is that this team is coached by Coach Shelley Cranford has multiple wins with the cross country team. We have our superintendent Dr. Trey Bellflower and our principal Dr. Brad Cutt Knox with him. If they'll stand too. And then I would like to say one thing. Speaker that the team work and extraordinary resilience made this team a spectacular one to observe throughout the season. And it's fitting finale to it's remarkable 2024 campaign. The team captured its third consecutive state cross country championship and its seventh title in the last nine years. Thank you so much for that. Congratulations, Mr. Speaker. I have one more. Also I want to congratulate the Blake County High School Boys Cross country team for winning the 2024 Class 1A division state cross country championship. The superior team working extraordinary resilience made this team. If you boys will stand now please make this team to observe throughout the season as a fitting final to its remarkable 2024 campaign. The team captured its third state cross country championships since 2015. If you all will please join me in the ground of a pause for both of these teams. If you all stand, thank you. Thank you, Mr. Speaker. Congratulations. The great tradition going on there in cross country. State championship. That's pretty cool. Representative Johnny Chastain recognized for an order. Thank you. Thank you, Mr. Speaker. We're here this morning to recognize a very special lady in our in our district and Miss Emma Lou Stover and Miss Stover has some friends and some family with her real quick that I want to introduce Wally Stover senior, Danny Stover, Wally Stover Jr. Stephanie Stover, Caden Stover, Hunter Johnson and Aaron Johnson and also the great grandson of one of our own house staffers here Wally Stover the third. Miss Stover has been and devoted her whole life to Gilmer County and she spent innumerable hours of her time and talents toward the betterment of her community. She has worked for many years with the LJ Lions Club where she spearheaded fundraisers to provide financial assistance for surgeries for the visually impaired, for buying and wrapping Christmas gifts for the less fortunate. She's provided a lot of extra time in for folks for college level scholarships. She founded a special friends program in Gilmer County to help the mental and physical disabilities for folks in Gilmer County. We're here to honor her this morning and we have a resolution that will be presenting later out in the Annie Room. We will be having a ceremony later on this year to name the outtown bridge on Star Out 52 East in the name of Miss Emily Stover. So thank you guys for being here. I know with Representative Fry wants to say one word. Miss Stover, back when you fed me lunch that day is one of the most memorable days of my life and I thank you very much for being here. Love you. Thank you Miss Stover. You've been quite deep impression. Thanks for making everything to be here and all of you. Thanks for being here. A good day for a lot of folks today. Thank you for being here. Chairman Corbett, recognize for a morning order. I'm going to try not to. Thank you Miss Speaker. Members of the House, it is my distinct honor this morning to recognize Miss Linda Henderson for her 50 years of superlative service to the City of Hoboken. Did her exemplary 10 years she has earned numerous honors in recognition of her dedicated service including the 2008 citizen of the year from Brantley County, the Chamber of Commerce, the 2006 Angel Award from the Southeast Cancer Center and many others. Miss Linda has given inspiration to many through her high deals, morals and deep concern for her fellow citizens. Miss Linda is loved by all. She has set the bar high when it comes to serving the public and is my honor to present her with this resolution for her service to the citizens of Brantley County and to the City of Hoboken. Miss Linda, we rise this morning. I have a couple more. We have Jonathan Westberry and Dalton Low in the gallery with us. Jonathan and Dalton of Brantley County completed their trial for 2024 rest in season by winning state championships in their respective weight classes, in Division 2A. Jonathan in the 126 pound division and Dalton in the 132 pound division. The coaches are Aaron Bag, Jenny Shelton and Jay Edwards. I would ask all of them to stand unless they recognize them this morning for Jonathan and Dalton. Okay, there you are. Thank you all. Keep up the good work. All right. And last but not least, we also have the Brantley County Girls tennis team. They also won the Girls 2A State Championship last year through their excellent place, a peer-team work and extraordinary resists made this team a spectacular one to observe throughout the season. And as a fitting conclusion to its remarkable 2020-24 campaign, the team captured the GS, G-HSA class 2A State Girls Tennis Championship. Members of the team included Brooklyn Wiles, Riley Strickland, Kaylee Oake, JC Riggins, Chazdie Waldron, Summer Coley, Savannah Carroll, Breed Crews, Harley Diggers, and Sheryl Tensa. I'd ask them to stand. They were coached by Patrick Steve, Dalton Larcy, Reed Tessort, and Kate Melvin. I'd ask them to stand. They're going to give them a hand. And we also have Dr. Kim Morgan, the superintendent of the Brantley County School. Glad to have her this morning. And also we have the mayor from Hoboken, Miss Crews, is in the gallery and our judge, Chief McMillan. Glad to have you this morning. I hope they turned the last set when they left South Georgia because there's nobody down here. Thank y'all for being here. Congratulations. Good to have y'all in the people's house. Who else you got? If y'all come down to the get to the any room, we'll take some photos. Come down to the third floor. Come down to the south any room. Good to have y'all. Representative Gabel Corrie, and his bodyguard. Thank you, Mr. Speaker. And friends, you have a lot of friends there, Representative. The gentleman's recognized. All right. Thank you, Mr. Speaker. Ladies and gentlemen, this morning I rise to recognize one of the little rock nine. As you may know, now I get more friends. As you may know in 1957, yeah, nine brave African-American children walked into the little rock central high school and integrated it. One of them is here this morning. Can I ask Mr. Terrence Robust to stand? He's up in the gallery. There he is. I have a resolution for him and he'll be coming down to the anti-room for pictures. Thank you, Mr. Speaker. Thank you, members. Thank you, Representative Corrie. All right, Representative Fla Noy, you're next. Now, I want you to suspend just for a moment. Here's a lineup. After you, Representative Dempsey, Representative Carson, Wilpar, Representative Taylor, Garlin Taylor, Chairman LeHood, and then with Berchette, Representative Fla Noy and friends. Thank you, Mr. Speaker. If the Clayton County delegation could join me, we have here with us today a councilwoman Rosinette Kirby, Kiwan Green, Caleb Carson, and also Dr. Sequena Scott, high school coordinator for Clayton County Public Schools. And very quickly, I want to highlight Caleb this morning because not only is he a star athlete, he's also gets great grades and very academic, he's sound. But even in the face of personal loss, losing his father on Thanksgiving, Kiwan has continued to push forward and bothering resilience and determination. He is not only an inspiration to his peers, but also a testament to the power of perseverance and dedication. So can we acknowledge them this morning from the gallery? Thank you, Mr. Speaker, I hear it will. Okay, you all join me on the third floor. Good morning. Good morning, Mr. Speaker. Good morning. We are privileged today to have the superintendent of the Roam City Schools, Dr. Eric Haaland here today who has the motto of I believe in you being very hands on with his students. The Roam City Schools Advisory Council is also here. And for many of these students, I understand it is your first day in our capital. It grades seven through twelve, help your school here and make decisions and really impact the life of your fellow students. Thank you for doing that. It's what we try to do here. It's good to have you at your state capital today. Please rise so we can recognize you. Thank you. Chair recognizes Chairman Carson from Morning Order. Thank you, Madam Speaker. I want to recognize the group that is here with us today, a fine hybrid private school in Woodstock. Georgia right between myself and Representative Thomas is district on Arnold Mill Road. Well, the civics club from the Kings Academy, we you guys stand. This is a group from Woodstock led by Kitty Singleton, their civics club advisor and Madam Speaker, I just want to mention they are a fine school, even though they have former Representative West Cantrell on their board, one of the founding members. It's still a great school. Welcome to your state capital. Thank you, everyone. Chair recognizes Whip Park from Morning Order. Thank you, Madam Speaker. Good morning, colleagues. I rise to recognize the student ambassadors of Gwyneth Technical College. These are outstanding young leaders who embody the values of service, dedication and excellence. As representatives of their institution, these students welcome perspective students, support campus events and promote Gwyneth Tech's mission of providing high quality education and workforce training. They are preparing for careers and feels critical to Georgia's future, healthcare, technology and the skilled trades. Their leadership and commitment to their community remind us that technical education is a vital foundation for opportunity and progress and that investing in our technical colleges is an investment in Georgia's future. Please join me in welcoming the Gwyneth Technical College student ambassadors to the people's house. Thank you, Madam Speaker. I yo the well. Chair recognizes Chairman Taylor for a morning order. Thank you and good morning, colleagues. Today is the City of Thomasville Day at the Capital, whereas the City of Thomasville was founded in 1825. The city was named after General Jeff Thomas who distinguished himself as a hero in the War of 1812 and is credited with constructing the first benefit building at the University of Georgia. Whereas Lieutenant Henry Flipper, the first black graduate of the United States Military Academy at West Point was born in Thomasville. Whereas former First Lady, Jacqueline Kennedy traveled to the City of Thomasville to say after the assassination of President Kennedy. Whereas General Lloyd Austin, former U.S. Secretary of State is a Thomasville native. The City of Thomasville is known for its roses and we are known as the City of roses. Please give everybody a strong hand and welcome the City of Thomasville. Thank you. Chair recognizes Chairman LeHood for a morning order. Thank you Madam Speaker and if the lounge allegations around, if you'll join me up here, Madam Speaker and members, we're just want to take a moment to recognize. I can say the hub of South Georgia and that's our border county on the on the Southern Georgia line. Lounge County are Chairman and Commissioners and County Manager up here in the gallery to a right and this year is the 200th anniversary of the this General Assembly creating Lounge County and there's over 120,000 residents there that are thriving because of the good leadership we have today and I just appreciate them being here and want to recognize them today so thank you. Please join around the boss. Chair recognizes four-liter HONG from morning order. Thank you Madam Speaker. I wanted to recognize a group from South Korea. They are, they essentially work out what is equivalent to White House here. It's called a blue house and they are pretty high officials that work there and they come to UGA, part of their program, to learn more about the policies and the political system here in the United States. If you can stand up and if we can give them a hand, they're visiting and they'll be visiting us at the Capitol today. Thank you. Thank you. Not in speaker. Chair recognizes what were shot for the last morning order. Thank you Madam Proton. Well good morning colleagues. I have the distinct honor and pleasure as serving as the sole representative from Leneer County and today with us in the gallery we have, not only the state champions for baseball, we have the state champions for softball coming from Leneer County and I'm asking you all to recognize these young men and young women if you will both stand for us please and recognize the state champions for GHSA Class A2 state softball and state baseball. Interestingly the baseball team went 30, 2 and 10 and the softball team went 24 and 4. Congratulations folks and thanks for making the trip from South Georgia and thanks for being here and thanks for all your hard work in Leneer County. Thank you Madam Proton. I was wrong. It was 201, not 200. Congratulations. Great program state championship. That's cool stuff. Good to have y'all. Members we have a imported invite resolution now. We invite our guest up.\n\nAll on. I think I've won. Yes. Yes. I'll hand it over to the other. We'll go on. If there's a three resolution, get that done. And she talks about each other. And it gets to close. Good idea. Good for the office. Members, I get your attention, please. Mr. Clerk, will you read the caption to a privileged resolution? House resolution 311 by Rapson. Senator 130th, Howard of the 19th, Prince of the 132nd, Miles of the 126th. A resolution, recognizing commending coach Andre Lacey in the pain college golf teams for their outstanding achievements and contributions to the growth of Colleach and golf and for fostering diversity and inclusion in the sport. If you're a part of the garden city, that's a great city of Augusta delegation. If you're joining us up here, Rapson, Charles and Howard is already with us, but I'm going to recognize Rapson, if you'll, then, Hepner to speak to the resolution. Rapson, Hepner. Good morning, colleagues. So I am joined by the rest of my colleagues from the Augusta delegation. This morning, we are joined by the Women's National Golf Championship team of Augusta's very own HBCU Pain College. So this winning lioness squad is escorted by their renowned golf pro coach, Mr. Andre Lacey. As a Pain College alumnus to himself and an Augusta native, he has quickly established himself as a transformative figure in collegiate golf. Leading his team of student athletes with the support of Augusta National Golf Club, Coach Lacey has enjoyed a head spinning journey to four national championship appearances that include the Women's NCCAA, Women and Golf Men's CCAA, and Women's NCCAA for years, 2023 and 2024. Mr. Lacey is the grandson of golf legend and Haller famer, Mr. Jim Dant Lacey, and he carries forward his family's legacy while breaking new ground as the only Black PGA professional in Augusta since 2016. Colleagues and friends, please join me in celebrating and congratulating them on their commitment of excellence. Congratulations. I mean, what a great program. Coach, sounds like you got it going on in the right way. We appreciate what you're doing. You're making a difference in people's lives. Thank you for what you're doing, ladies. Wow. Who's the best putter of all of you? There you go. Wait a minute. We're going to take a photo. Come back. Come back. We're going to take a photo. Congratulations to y'all. And congratulations to pain. Great school there on Augusta. We appreciate y'all. Thank you. Thank you. Ladies, we also have a resolution for women's golf. So y'all are certainly being recognized as well and that old deal too. So congratulations to you. We're ready to move on to the rules calendar. Mr. Clerk, would you read a caption to Senate Bill 7272? Senate Bill 72 by Senator Brass, the sixth and others being titled an act to amend chapter 52, title 31 of the official go to Georgia, annotated relating determining ill patients rights to try investigational drugs, biological products and devices. This bill ever for the committee on health that committee recommends the dis bill do pass. The chairman Hawkins is recognized to present Senate Bill 72. Speaker, Senate Bill 72 is also known as the Hope for Georgia Patients Act. It is an addition to chapter 52, which is a Georgia right to try act. This particular bill deals with experimental drugs and devices for folks that are terminally ill and have no way to survive with typical treatments. If you look on page five and I'll quickly go through this. The first section that deals with proof of need. Of course, it must be life threatening. And it's also there's an analysis done of the patient's genome. These will be DNA and RNA type active drugs. Next section deals with release of responsibility. The bottom page six, manufacturer's flexibility, type of page seven. This is not a mandate. It's not an insurance mandate. And then the bottom page seven, the docs are not held liable for trying these techniques methods in medications. Then the next section speaks to release of manufacturers, liability. Next comes the personal liability release. And again, it reiterates this is not a mandate. This bill is the last hope for some patients to have a chance to live a little bit longer. That's the bill, Mr. Speaker. If there's no questions, I will link wish the well and vote for your favorable consideration. I'm going to have a chair now. You have a question to your right represents cheerleaders still Cox. It's recognize for a question. Is it a tree, Mr. Chairman, that this bill will allow cancer patients that have drugs that have totally not been approved by the FDA to try experimental drugs as a last chance on their life? That's very true. And I appreciate that question. Some of these drugs take many, many years to be able to make it to market. This will allow a patient a shortcut for a drug and probably the only drug that will work for them in a chance for extended life. Thank you for bringing the bill. I appreciate it. Thank you. Thank you, Chairman. Dr. Hawkins, you have no further questions. Thank you. The gentleman's deal the well. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. This bill now passed all in favor of the passage of the bill. We'll vote yes. All those opposed. We'll vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so, Mr. Clerk, will you lock the machine? On the passage of Senate Bill 72, the yeas are 161, the days are zero. This bill, having to see the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of Senate Bill 63? 63. Senate Bill 63 by Senator Dixon, the 45th and others to be entitled, knack to amend. Part 15 of Article 6 of Chapter 2, titled 20, the official go to Georgia annotated relating to miscellaneous provisions under the Quality Basic Education Act. This bill then refer to the committee on Education Act, committee recommends this bill do pass by committee substitute. The lady from Columbus, Representative Carmen Rice has recognized to present the bill, Representative Rice. What Senate Bill 63 does is it would allow, it was an provision to allow homeschool students to take their tests or senior year, getting ready for college. Those tests would include PSAT, SAT, pre-ACT, ACT, the ACEVAB, and Advanced Placement Test in their locally-zoned schools. And so, it also requires a provision that the school district would announce and put online information for the registration for these tests. The homeschool students are willing to pay any fee that a student in their zone school would have to pay. And then the school district would pay the cost that they would any student that's within the school. And with that, Mr. Speaker, I will take questions. You have no questions. Thank you and I ask for your favor, both support this bill. I appreciate it. I yield the will. Ladies, yield the will. Is there any objection to the previous question being ordered? Here in none, the previous question is ordered. Is any objection to adopting the committee substitute? Here in none, the committee substitute is adopted. Is any objection to a green to the report of the committee which was favorable to the passage of the bill? Here in none, the report of the committee is agreed to. Now, this bill now passed. All in favor, the passage of the bill will vote yes. All those opposed. We'll vote no. And the clerk. Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the passage of Senate Bill 63, the yeas are 166, the nays are zero. This bill, having to see the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read a caption to Senate Bill 8585? Senate Bill 85, I send it to brass. The sixth and others being titled, not two men, art and twelve, the chapter three, a title 20 of the official go to Georgia and Tate relating to post-secondary education grants for foster children and adopted children. So it's to establish a grant program, this bill having fruit committee on higher education. That committee recommends this bill do pass by committee substitute. Representative Swainsboro, Georgia down in the manual county, representing Butch Parish, Mr. Chairman's recognized to present the bill. Thank you, Miss Speaker. Ladies and gentlemen, Senate Bill 85 establishes the Georgia Foster Care Scholarship Act and it provides grants to former foster youth for undergraduate education. It sets eligibility based on age and involvement with the Department of Family and Children Services. The funding for this program is subject to annual appropriations and a former foster youth is eligible for the foster care scholarship. If the young person is under the age of 26 and is in foster care or wasn't foster care for six months after the age of 14. The scholarship will be in an amount to cover the student's tuition, room, board, books, and deducting any scholarships or tuition waivers or federal and state financial grants available to them. No scholarship will exceed $30,000 per year. The scholarship may be used at any hope eligible Georgia institution to which the student has been admitted. The scholarship is available for no more than 10 years through the completion of a bachelor's degree or a total of 190 hours or 127 semester hours. I'll remind you that the appropriations for this is subject or the funding is subject to annual appropriation. Miss Speaker, if there's any questions I'll try to answer them if not I'll ask for your favorable consideration. The gentleman has a question or two. Okay, yes sir. Or representing more to your left. I recognize for a question. Good morning, does the gentleman yield? Yes ma'am. Isn't it true that as a foster parent I'm excited about this bill and when it came to committee I almost did a backwards flip. Isn't it also true that I wish this bill had been written 10 years ago. So many children could have had a course change of course in their life just from this bill. And I look forward to seeing Georgia's foster children attend and graduate college. Congratulations. Thank you so much for your comments. I certainly think it can have a positive effect on many of the youth in this state. Thank you. We're representing Chastain to your right as recognized for a question. Jim, you? Yes sir. Is it not true that by establishing a grant program for the foster children that this Senate bill 85 directly addresses the financial barriers that often hinder vulnerable youth from pursuing a higher education? Yes sir. Great program and thank you all. I know a lot of you have interest in what de facto is with our foster kids and this will certainly be a great handout to help a lot of folks. Thank you very much. Gentlemen's yielded the well. We did have a speaker that it signed up speaking favor representative Park Kennen. But I don't see representative Kennen. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, time. Representative Kennen is recognized to speak to Senate bill 85. Give the lady your attention please. Thank you, Mr. Speaker. Thank you members. I'm here to speak in support of Senate bill 85. I wanted to just bring to attention that I feel this legislation addresses really the future of our state. And a commitment that we're making to our future. I think it's not just a policy but it's actually a promise to countless young people who have navigated the challenging impacts of the foster care system. I have spent a lot of time with individuals who aged out of the foster care system what we consider too young before we changed it to 21. Establishing this scholarship for those in the Georgia foster care system for eligible students currently enrolled under the age of 626. Really help us with our statistics surrounding youth in the Georgia foster care system. If you've looked at them you know that they are quite sobering. They face many obstacles that can make educational attainment seem insurmountable with a lack of family support, financial instability, and the emotional scars of their experiences. These young individuals often find themselves at a disadvantage. However this bill gives us the chance to change that narrative. It actually provides these grants to the foster care youth who meet specific requirements. The requirements I believe help us ensure that the financial barriers do not hinder their pursuit of higher education. I think it's essential to note that this program is subject to appropriations meaning that we all have to remain committed to ensuring that these funds are available. It's our legislative responsibility not only in this measure but in the budget to responsibly advocate for the necessary resources to support our youth. Moreover I believe for the adopted children just as generally recognizing that whether they've been in foster care or whether they've actually gotten adopted, they deserve the opportunity to thrive. We as legislators and parents should really see this bill through to the end. I'm hopeful that the foster care youth that are listening right now and that are outside know that we are committed to your opportunities to succeed. I want us to all vote in favor of this bill. Thank you Mr. Speaker. A lady has completed her remarks and you are the well. That completes all those that sign up to speak to the bill. Is there any objection to the previous question being ordered hearing none the previous question is ordered is any objection to adopting the committee substitute hearing none the committee substitute is adopted. Is there any objection to agreeing to the report report of the committee which was favorable to the passage of the bill hearing none the report the committee is agreed to. This bill now pass all in favor of the passage of bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine. Have all members voted. All members now voted. I think all members are voted now so Mr. Clerk will you lock the machine on the past just sent it bill 85 the yeas are 166 the nays are two this bill having to see the requisite constitutional majority is there for past. Okay members. I'm exhausted after this morning orders I can just tell you that. I got to take a break. We're going to have a couple of announcements. We're going to have a couple of announcements. Thank you Mr. Speaker colleagues working for him the caucus lunch will be in room 307 CLOB it is provided by the UFC the up your 1996 so we will have lunch in room 307 CLOB upon a German well I don't guess we're not a German when we break for lunch thank you Mr. Speaker. We got a lot of work to do there represent the claim. We just going to take a little break. The representation is recognized for an announcement chairman is station leader is station I'm sorry thank you Mr. Speaker the committee chairman's lunch will be today in room 403 upon the break room 403 when we break committee chairman thank you. Chairman Parish is recognized for an announcement. Thank you Mr. Speaker I'd like to invite the members of the rules committee to meet me in 341 at 1230 thank you. Rules committee at 1230 you're not going to give much time to eat are you. That completes our announcement Mr. Clerk will you read the capture to a group of privileged resolutions we have a lot of privileged resolutions we're going to get half of them out of the way. So the clerk's going to read these resolutions here's our posture folks Mr. Clerk if you'll suspend just for a moment. As soon as he does these privileged resolutions we're going to take a short break we're going to recess for one hour and that's country boy is going to eat dinner you city boys go eat lunch. So that'll be our posture so Mr. Clerk will you read the capture to a group of privileged resolutions. Honoring the life and memory of Gary ever to her recognizing and commanding Dr. Dean Cursey. Commending Mr. Owen Kinney darlin high schools 2025 star teacher recommending Linda Pan darlin high schools 2025 star student commending. Carly win Rome high schools 2025 star student commending Seth Winsdeg Rome high schools 2025 star teacher commending Gavin Mullin ex pepperola high schools 2025 star student commending Jessica West Royal pepperola high schools 2025 star teacher commending Ealen Aston McLean our high schools 2025 star student commending Mrs. Emily Maurey our Merchys high schools 2025 star teacher commending Mrs. Susan Payne unity Christian schools 2025 star teacher commending Sophia doves unity Tristan schools 2025 star student recognizing April 4 2025 is 404 day. Commending Brian Butler for recognizing outstanding contributions. Recognizing commending Dr. Evan E. Grushen commending Lisa Cunningham recognizing commending Dr. Cheris Chambers recognizing an honor in the victims of communism recognizing February 9 through 15 2025 as national FBL a week recognizing commending Nadine Ali. Recognizing pending Lewis Grant recognizing commending Janice Reed recognizing and commending cookie right recognize commending Ray Murray recognizing commending Morris Roberts recognizing commending niece Williams recognize a commending to meet the Scott recognizing commending Amani Williams recognizing commending Terry Walker more. Congratulations the North of Coney high schools boy basketball team for winning the 2025 GSA class for a state basketball championship recognizing commending the 2025 regular session temporary administrative assistance for the George House of Representatives on their exemplary service. Commending the House interns for the 2025 regular session the general assembly commending and congratulating field and Marcus Chapman recognizing commending the Atlanta Parkman Association on its 50th anniversary. Congratulations the Savannah State University men's basketball team for winning the 2025 Southern in a collegiate athletic conference basketball tournament championship commending Savannah feed the hungry commending Mr. Edward Rockdale County high schools class of 2025 valedictorian commending may look to tell Salem high schools class of 2025 class of Victoria commanding Frankish Gupka Rockdale Magnus School of Science and Technology class of 2025 salutatorium commending Mcwell commending heritage high schools class of 2025 salutatorium commending J. David Coleman Salem high schools class of 2025 salutatorium commending Delano Page Rockdale Magnus schools for science and technology class of 2025 valedictorian commending David Hill Rockdale County high schools class of 2025 salutatorium commending Christian Bridges heritage high schools class of 2025 valedictorian recognizing commending Mr. Phil Alumny recognizing commending H. E. M. linear the second recognizing commending Carlene Anderson recognizing commending T. S. Smart Washington recognizing commending Valerie King recognizing commending the Alumni Association of Atlanta recognizing October 9th 2025 as pandas awareness day at the state capitol and for other purposes that completes the reading of the privilege resolutions. He has varied objection to the adoption of the privilege resolutions. Here you know the resolutions are adopted. Okay, we'll be in recess until 1 p.m. this house will stand in recess until 1 p.m.",
  "updated_at": "2026-02-13T13:52:55.062542+00:00"
}