{
  "video_id": "D9wukFye6p0",
  "url": "https://www.youtube.com/watch?v=D9wukFye6p0",
  "title": "10/31/2023 Senate Study Committee on Occupational Licensing",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 116,
  "summary": "Here is a summary of the key points from the Georgia Senate Study Committee on Occupational Licensing session transcript:\n\n**Overview**\nThe session focused on proposed changes to the licensing requirements for land surveyors in Georgia. The main discussion centered around decoupling the national and state-specific exams, as well as adjusting the educational and experience requirements based on an applicant's prior degree level.\n\n**Key Actions**\nNo specific bills were discussed or acted upon during this session.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Discussion on the importance of higher education for land surveyors and the challenges faced by states with more rigid four-year degree requirements.\n- Explanation of the proposed changes to allow applicants to take the national exam earlier and complete the state-specific exam in the final months of their apprenticeship period.\n- Debate around the varying experience requirements based on an applicant's degree level (high school, associate's, bachelor's).\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum was present, with senators actively participating in the discussion.\n\n**Adjournment**\nThe session adjourned, with no indication of the next meeting date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\na big need for a higher quality of experience to be imparted on an individual before their license to go out and offer their services to the public. I hope I didn't overcompricate that or if I failed to answer that, please follow up. So the question was in regards to the state specific exam, right? And so, I apologize. As he said right now, you have to get all the experience. The final step is you take the NCES National PS exam, professional surveyer's exam and the Georgia specific exam. And what the decoupling does is kind of into flavors. One, the national exams can be taken as soon as the education is in place. The state specific exam is more tailored towards practicing in Georgia. And instead of having to get all that experience and then wait for the testing cycle that can be months or even a year, the state specific exam would not be eligible on the front end while the education is there. It's more practice based and that's to be taken during the last six months of the apprenticeship period, which is the last two years of the whole endeavor. So they won't have to wait on results to get back, but they'll wait till near the end of their apprenticeship, which is when they'd be the most prepared to take the state specific exam. And my question is this, if let's just look at the associate degree track, it says 60 months of total experience, 24, which has to be an apprenticeship. Could you do your apprenticeship part on the front end of that 60 months or it has to be on the end of the 60 months? The proposed language is it can be done anytime after the minimum education has been achieved, just like taking the test. So you could take the test and start the apprenticeship at the same time on the front end of the experience. Then go ahead and take the Georgia specific in the last six months of the 24 months. And then you still have to complete the rest of the experience requirement of 60 months. That's correct. Yes, it is totally possible to do that. Typically, you would see someone with less experience being on the lower end of the skill and assignment level and working their way up so that the apprenticeship would probably naturally be at the end of the experience engagement, but it would not necessarily have to be. And for folks, especially the last presenter reminded me of a lot of military applicants that we processed when I was on the board. If someone has been, I know a young man who was in New Mexico in the Army and geospatial intelligence. And when he was in on leave, he was asking me a lot of questions that sound like what I do every day. So there's valid experience that's being gained that currently people aren't really able to get credit for. And by shuffling this and removing some of these barriers, that experience will be able to come home to Georgia and possibly allow possibly allow somebody to jump into their apprenticeship just as soon as they get their education requirement. As you were suggesting. All right. Senator Halper. Hang on what Mike? Yeah. Hello. On the same topic, I do have one other question just because I want to make sure I understand. So if I am a high school graduate or have a high school deployment or a GD or an associate degree or a bachelor degree and let's say it's not in any subject whatsoever that has to do with this. In all three of those cases, I must acquire 18 semester hours of specific land surveying education. Yes. Now I, on your proposed thing, now I pass my national exam. Now I need the experience part. I am curious as to why the, the months of experience is different based on whether I have the high school diploma, the associates or the bachelor's degree, even if again, my those, right, those 18 hours are the same, but I'm, I'm wondering why the experience is 96 months, which is eight years, five years, three years. Well, I can summarize it. We place, we, the profession places a high importance on, on higher education. It yields much better candidates for licensure and the test themselves are actually based. They're, they're written around someone having a four year degree. Right. So we're preserving this path, but it is a greater challenge because of the testing that is required to be passed. And we don't have the numbers in front of us, but they're available to show the passing rates. And so this is custom, and this is, we're actually less than a lot of other adjoining states that required. So we're being aggressive in our timelines, compared to other states in this regard. Mark, you got anything to add to that? I'll try not to talk too much, which as you can tell is a problem of mine. I wouldn't have been a bad idea, but in, you know, land surveyors, a lot of people don't understand what we do. A lot of people just associate us with the guy in the orange vest on the street corner. And that's definitely part of it. And gathering accurate data is a very, you know, that's the foundation of our profession. But especially as the world gets more complicated and property becomes more valuable in transactions and regulatory law becomes more and more complex, you know, the 18 semester hours is one of the lowest in the country that's required. Most states, including I think all of our adjoining states except for North Carolina require a backstreet degree. And the wisdom in that, if you want to call it that, and, you know, for years we lobbied for that in Georgia and it never happened. But the reason for that is that more than just the nuts and bolts that those 18 hours teach an individual how to physically go process this data and make the maps and the reports is the ability to communicate that and to really understand what they're doing in the bigger picture. And that's probably one of the weaknesses that we see in Georgia from not having the degree requirement. But if we did, we'd be in a lot worse shape than we are now. Yeah. As a matter of fact, I'll throw in just last week I had a call from a constituent in South Carolina. They have a very rigid four year degree requirement there. They registered one survey last year. And they're just floundering. They're not producing surveyors. Now why would, why in the world would that get passed? Because of faulty surveys being put out into the general public and all the problems created by that. And as surveyors, we're faced with dealing with that issue consistently. When we're surveying attractive land, it's got four adjoiners that were surveyed by other surveyors. And we end up with boundary line overlaps all over the place. And they have to be resolved many times they end up in court. So there's a happy medium somewhere. And we're trying to encourage the four year route and two year route that higher education is going to help that problem versus the high school guys that are just getting learning the nuts and bolts as Mark said. But they're not understanding the bigger picture. So hope that answers your question. I'll go to the last slide here. This just kind of demonstrates the comparison. We got another question. I'll get pretty well get it. Okay. Thank you. Senator Antivott already has a question. Okay. I apologize. What's going to move on? Thank you, sir. And I'll be quick. Was you, you know, you have three buckets here with a bachelor of research here at high school diploma. If you were, you know, saved 1% of Georgia surveyors kind of fall into each bucket. What is what is that work like? This probably high level. I'll let anybody chime in. I'm going to go. I'm going to go with. I'll be busy seeing Mark. Yeah. Mark reviewed them. But I saw most of not all the applications for 18 years. And there was a trend that wasn't consistent. You know, three is it was in 21. And three was mostly high school. Well, that took the college courses. And honestly, they didn't have a real high pass rate. They struggled to pass. But what I saw near the end, which I hope answers your question is, I believe now that probably around half of the answer question, I would guess 10% or less of land surveyors going into to be licensed now, not that we're licensed 23 years ago, would have a bachelor in surveying or geospatial science or something that's very own point. It used to be probably 70% or so that were high school. Now that's probably in the 30 to 40% range. The bulk of, I'd say roughly half or a little more than of the people that are trying to enter now have bachelor degrees, but they're in different fields. So they get kicked on the current code over to the associate degree route and these extra delays. And that's discouraging them from entering that. So we've got a pretty good crop, but we need to make it more conducive for them to be able to stay in. So that's where we're at is probably at the end, a third to get licensed, probably the high school route, close to half or a bachelor degree and something besides surveying in a small fraction to have the actual surveying degrees. So if we had to get surgical to fix the problem, it's fixing that bachelor associate kind of piece have more efficiency to get them through the process system. This one, I'm ready to go for those high school seems like it's a little bit more cumbersome in terms of getting to a passage and all that. But right now, if they're coming out of another field instead of kicking it back to associate is there a way to kind of tinker with that? That's what this does is in a lot of states, including our current code, only recognize the degree of surveying. And we realize that someone who's got a bachelor in business got 120 hours in business, then they get 18 semester hours in survey and I think at 138 hours, they've really got more than 120 hour guy with the surveying degree. And they're better prepared to communicate the service society. Thank you. Thank you. De-coupling will also drastically increase the pass rate of that high school guy, because he's got so much more experience on the back end that he's got to get that the other don't black school needs and less education. Thank you. I really appreciate you all bringing this idea to us and trying to solve your own, bringing us a solution versus us coming and telling us how bad everything is or whatever. Senator Craig comment, we figure if we don't find a proactive solution to make this better and keep George the best state in the nation to do business, you all will find a solution for us and we might not like it. Well you know we're powerful in the Senate. We did change the center of the earth. Oh yeah, that's right. A couple years ago. So that's pretty strong. Let's laws are always better than it. All right. Thank you very much. Thank you. Appreciate it. All right. Now we're going to move on to health back to health care. Robin. Pinchton. With the Georgia nursing leadership coalition. Thank you, Robin. We're going to set the clock. Good morning and thank you for having us. My name's Robin Pinchton. I'm a family nurse practitioner. I'm representing on behalf of Georgia nursing leadership coalition. Start the presentation is my colleague Beth Harrison. Good morning. My name is Elizabeth Bolton Harrison. I'm a previous outgoing public policy and legislative director for Georgia nurses association. And as my colleague Robyn said, we're representing the Georgia. And we're representing the Georgia nurse leadership coalition. And so we're part of a group of organizations, Georgia nurses association, including a United advanced practice registered nurses, Georgia associations, the Dean's the directors and nurse educators, as well as American Association of Nurse Practitioners. And what we're doing today is presenting information about challenges that we're having with. Licensure board with the Secretary of State and also will do a delve into some issues. And we're going to have a meeting with the Secretary of State and also the medical board for APRM practice. So by the numbers in the state of Georgia, we have as of yesterday, 171,982 nurses in the state. Of those LPNs make up about a little over 28,000 nurses registered nurses on 143,342. And we have 21,702 advanced practice registered nurses ranging from nurse practitioners, CRNAs, nurse me at wives and CNSs. As we look at the workforce data accuracy, you see there's some discrepancies between what the Georgia board of nursing is reporting, which are the numbers that I just described in addition to what the Secretary of State have is about, not quite 10,000 less as far as those discrepancies. Now, when we take this slide, we're looking at the revenue as generated by the license report. And so you can see that it's a little blurred on this slide, but you can see a listing of all the fees that are associated that nurses would have to pay to become licensed in state of Georgia. What I want to highlight is that with license renewal alone of the nurses in the nurse practitioner APRM's at the state, they're renew paying $70 per renewal amount. So it's $11.87 million in contributions to the state's budget. And so like I said, this is just license renewals. And if you take that 21,000 APRM's from the state, you're going to, that's another $70 for renewal. You'll get another almost 1.5 million that supports the state budget. You all being state senators, you all are aware that the board of nursing has 13 members at the point about a governor in the, they're responsible for the regulation of our practices for nurse APRM's registered nurses and LPN's alike. As we look at nursing workforce data, the board of nursing, we're excited about this because we really had challenges about getting accurate information. We're requiring nurses when they renew their license to be able to collect this data. And this was done by the authorization of House Bill 1013 in the 2022 legislative session. So right now the board of nursing is preparing to create the documentation to be able to collect the data. So we actually know where nurses are working. So the difference between a nurse being licensed and georgeable working in Florida, we'll have a little bit better more information. And that way as far as determining where we need to put nursing staff and where we need to focus our efforts on this allows to get more accurate information for this. And when you look at the Georgia board of nursing staff, the day to day functions, you have eight staff members. And when you think about eight staff members having to support over 170,000 professionals, this is not enough. You have an executive director, you have a licensing supervisor and seven licensing out analyst. So if you look at their staff expectations, a license analyst should be able to process 15 new nursing license applications per day. So you're talking about seven specialists at 15 per specialist. That's a 105 per day. And if no one gets sick, take off work goes on vacation of a 260 work days per year. You have 27,300 applications processed. And the current timeline is roughly around 15 to 20 days for the bar and there are no application deficiencies. So in perfect world order, they can get this many done. So if you look at this slide and let me just briefly back up. So this slide also gives you some raw data as far as the applications that are received in the app license that were issues from 2013 to 2023. And going back to the next slide, the nurse, if you look at this line graph. So it's a little difficult to see, but you can see how over the course of the years, the number of applications that these analysts have to process have increased. And if you see the very bottom that blue line there, you see that are set the staff for the board of nursing is flat. So they have been asked to do more with the same amount of staff and hadn't had their workforce increase over time. In addition to the staffing analysts, we also have the phone calls for the call center. And so all the nursing related inquiries that come into the professional license boards call center being answered by people who have to answer all the other 42 licensing boards. So nursing does not have a specific call center of people that are dedicated to be able to address and answer those questions specific to nursing licensures, which can be difficult. Here we're going to discuss the nurse educator position. And so the nurse educator position is important because this position will go in and assess the 88 nursing education programs that are currently in the state. And that doesn't include any nursing programs that are working to come online to help prepare nurses for to help take care of the member, the people of Georgia. So they have to schedule and plan and coordinate visits to existing nursing education programs, interview administrators, reviewing programs, evaluating their curriculum, the fact faculty partners also doing site visit reports in addition to monitoring the. Inclicks or the national council licensure examinations reports for each individual institution. Another challenge that we have are nurses with discipline orders. And so with the Georgia nurses peer assistance program that's a partnership with the Georgia nurses association and the board of nursing. And so that was in 1981 to be able to help support nurses with disciplinary orders for the challenges that they may have in order to be able to counsel them and rehab them to be able to get back into the workforce. Georgia was the first state to acknowledge this as an issue and need to treat and support the nurses that are having substance abuse challenges. One of the challenges is when they're placed in a discipline order, although they're rehabbed to be able to get back into the workhorse, it becomes very difficult for them to find jobs because of their history of substance abuse. When they have been placed on the we have alternative excuse me, alternative to discipline programs that are currently in the nation that work to help get nurses back to their jobs without the punitive issues that come with the disciplinary order. ATD programs they'll receive 70% more in relief just because people are more willing to be able to subject themselves to be evaluated and treated knowing that they're there is not the burden of having the stigma on them as having a disciplinary order. In addition to that more than 80 states have now the programs for alternative discipline orders and Georgia is one unfortunately one of five states that does not have discipline program in place at this time. So with this information, our recommendations to try to address some of the challenges that we're experiencing in the state is to be able to make sure that we respond into the licensed nurses of the state of Georgia being able to support them and ensuring that we have people that are educated and prepared and ready to serve the constituents that you serve. We want to respond to the states roughly 170,000 licensed practitioners facilitate license and relicenter process and a uniform and timely manner in order to get people to work. We also want to provide a comprehensive collection of data for workforce data so that we know where do we need to gear our resources and manage the disciplinary process for nurses in addition to regulating ensure that all nursing programs have quality education. So a few of the recommendations we've discussed not that you all part with the secretary of states Georgia works on program is adding additional licensing analysts on and that salary and this is listed within the state is 44,000 dollars. We need to develop a designated call center representative specific to nursing licensure. We also want to look at getting a part time workforce data analysts to be able to help us collect the data as I stated to be able to understand know exactly where we need to target nurses to support within the state. We're looking at part time nurse educator to be able to support the nursing educator role to be able to evaluate and track the 88 nursing programs in the state and addition of nursing to alternative discipline program with an estimated overall budget of 750,000. So even as we're looking at these recommendation and the price points for them, we have to go back to the revenue as generated by the nursing licensures with the state again just with licensure renewal along we have over 12 million dollars that it's generated that would be more than enough to support the recommendation of programs that we have. I should also we have some pending legislation coming up when we look at House bill 520 the mental health parody act this past the house back into 2023 legislative session is currently sitting in the Senate HHS committee to be picked up in 2024. This will also this bill will allow us to get the expansion of data collection for the state for workforce. It also allow creation for the alternative to discipline program. There's also Senate bill 164, which was a PR in licensure legislation bill that actually passed both the House in the Senate in 2023, but due to constraints and being able to initiate the bill without compromising a PR in licensure. It was vetoed in order to have a deeper look to make sure that we're able to get that done without impacting care that were provided. And as we now will transition allow my colleague Robin to speak about a PR in licensure. Thank you. Okay, so licensure currently in the state of Georgia. We do not have a license to practice in advance practice registered nurse. We have an authorization to our and license. So this can be very confusing, especially when we sign our name and our license number. Our license number has an RN in front of it and a lot of documents get kicked back saying that this is not accepted because we need an APR in signature. So that are in front of our license number causes a lot of confusion, a lot of backlog and time. So we're only one of 11 states that do not allow, but do not have a separate license for the APR ends. We do have legislation as Beth mentioned, it's going to be reintroduced this session. I like this map. This is a state of the state map. This compares all the states and where they are with their restriction. Green means full practice authority means there's very, very few restrictions. They can practice to the full scope of their education. And again, that's what we're talking about full scope to our education. We're not talking about increasing our scope. Yellow is more restricted. Red is very restricted. We are one of 11 and we are the most restricted in the country. And because of this, because we're restricted, we have something called the collaborative practice agreement that we're going to get into more detail, but that kind of restricts our practice. In your packets, you will find a copy of the collaborative practice agreement. You'll see it's about nine pages long. When I first started 25 years ago, it was about two. It just stuff just keeps adding to it, adding to it. It's very confusing document. It's not well understood. And because of that, it's taking about six to eight months for an APR end collaborative practice agreement to get approved by the board of medicine. And this is causing a delay of entry into the workforce for APR ends. So this slide just just goes over reviews the education process for how we enter practice. Oh, let's you read that there. So what I have in your packet is I have several maps of state to the state that show where Georgia stands. If you'll see there's one on prescriptive authority for emergency schedule twos, where one of two states that are not authorized to schedule an emergency. Two to three day supply of emergency schedule twos. It's us and Oklahoma. We're one of two states that cannot sign handicapped stickers. We're fighting in that with South Dakota for last place. You know, now the handicapped sticker has to be notarized as well. So if you're in a busy primary care office, you know, right now with the paperwork, the insurance companies, the pharmacies are paperwork is in a huge backlog. So everything that has to sit on the physician's desk to sign just creates more of a backlog and delaying care for our patients. Also, I believe I included the map of home health where one of 11 states that cannot authorize home health. The cares act allowed a lot of states to sign the research and certifications for home health Georgia is one of 11 that cannot. We're also one of 11 that cannot sign post forms, which is physicians orders for a life sustaining treatment. Okay, next. Now, the problem with being so restrictive in Georgia and taking six, eight months to get a cloud of practice agreement passed is that a lot of nurse practitioners are finding that they like to work in a less restrictive state. And we have owners of large telemed companies telling us that they will have a nurse practitioner with the Georgia license sitting in their living room in alpha red. But they choose to only takes assignments and Vermont where they also hold a license, but are less restricted said prefer to work in a practice and a state where they're less restricted. So I do have a testimony here they would like to read quickly and this is from former senator Renee entrepreneur and senator Walker she says hello. So she is she was in an urgent care in Andrews North Carolina and she writes I am sitting in an emergency primary care clinic 50 miles from the Georgia North Carolina state line. There are no practicing physicians in the surrounding communities my clinician is a nurse practitioner who lives in high o'whassy Georgia 50 miles away. She prefers to practice in North Carolina because it is less restricted. These areas are designated rural practice areas. Our needs I can't read the rest, but it is a shame. That the lack of health care professionals in Georgia, the ones that do have we do have to cross state lines to practice in another state. So that's from senator Renee Unerman. And if senator Unerman is watching hello, hope you're doing well. She chaired the Senate HHS committee for a long time and did a great service to the state. Robin, I'm gonna kind of cut you off there, but in case we have some questions for you. Anything senator inventory. What's your mic number five? Thank you for being here this morning. So one question I have. I mean, I guess in some ways it's kind of the obvious why in some ways having the alternative discipline program.\n\nburied in House Bill 520. What was the thinking of maybe not having that as a stand alone bill? I mean, I get the behavioral health substance issues with that from a policy perspective, but if it's a workforce, you know, issue a goal, why not do that as just a stand alone bill? I mean, and that's a great question. And so if Tim Davis is here, he's with our, I'm Georgia Nurse Association. He's our legislative chair. You know, as far as being with this, I think it just kind of with the mental health parity bill, this goes along the substance use of you disorders with mental health. It got added onto this bill, but Tim, I don't know if you're able to apply in about a little bit more. Well, I mean, I'm just just saying. I mean, it's kind of, I mean, probably have our colleagues don't even know. This is probably in 520. I mean, I agree. I mean, it seems like it would warrant its own discussion and its own debate instead of being part of such an enormous. Yeah, because I mean, I would be interested to know. I mean, I see there's only what three states, four states, five states that don't have it. But I think under the circumstances and I mean, these are frontline individuals who are experiencing everything under the sun, good, bad, ugly. And we all know the personal toll and impact that has on an individual workforce and family. So, I mean, to me, I think it's, this is my own opinion, but I mean, I do think it's probably more of a, you know, workforce lens. From that perspective, but I do think Mr. Chairman at some point offline, we can, I would like to have further conversation just learn more about the background of kind of wise is buried in 520, but that's my own question. Thanks. No, thank you. Thank you. I've got a couple questions. One, you talked about staffing at the nursing board. Do you have any data or statistics or comparison of what staffing levels, other states of similar sizes, ours have for the nursing licensing. I do not have that in this presentation, but also Tara, who's here with the Georgia board in our sense, she would probably be better. We can get that information better suited for comparison data. I have specific data in the right here, but I can get it for you. I can tell you that we are very well staffed here that other state. If you would get that, that would be helpful when we, if we decide to introduce anything relative to that. I mean, that's going to be an obvious question, I think. On the emergency schedule to prescriptions, I'm pretty sure we passed that out of the Senate. Did we not? Yes. When was that in 22 or? It was, it was this past session. So it's still alive. Well, it's Juliana. Yeah. Yes, man. Yes, that passed out of the Senate, but it started and then it also passed out of the house, but there were changes made in it Senate conference committee right now. And so that conference committee will be meeting in our expectation and hope is that it will be coming out quickly when the session starts. And it just has to be approved by both the House and the Senate to the changes made in the conference committee. Great. All right. Thank you. Anything else, committee? All right. Very good. Very great information. And Senator Walker, if I can just briefly, the your first presenter that was talking about the program with military as a former Navy nurse, I think I've worked with plenty of hospital corpsman that have done extremely good work. And so I'm very interested in seeing that go forth in Georgia to help support our staff in the hospital. I am too. Thank you very much. Thank you for having us. Thank you for what y'all do. Thank you. All right. Next we're going to hear from the licensed professional counselors association, Gail Mackie, is there executive director. And I learned that the Georgia works meeting is 3000 hours for the experience, I think, for a licensed professional counselor. Is that right? Yes, sir. And I also want a lot. Well, I do want to thank y'all for passing in 2021, the professional counselor compact licensure law at in 2021, 10 states were needed. We have 30 signed on now. And this coming summer, the committee will have the national rules. So Georgia was the first state in the United States to pass the professional counseling compact clause. So pretty excited about that. Thank you. And then I also have a good representation of the Capitol and Julianna. Yes, we do. Thank you. And then another amazing thing that y'all passed for us in 2022 is you reduce the hours required for the internship after you graduate with your master's degree or higher. You we were at 36 months, which the rest of the United States had reduced down to 24 months. So thank you very much for passing that that really made a big difference. So y'all have already worked really hard with us on reducing the barriers to licensure. So I decided I'd start out really early here and fast because I know we're sort of out of time. There are approximately 2500 psychologists in the state and approximately 8600 licensed professional counselors. So what we're asking for is just four simple points. The first one is a math conversion. Whoops. 60 semester hours equals 90 quarter hours. And in the law it says 80. We didn't really catch that when the update happened. So the our chapter has not been updated. It started in the late 80s. It was not updated until the last two or three years. The other thing that we're asking for is to go ahead and add the national accrediting body for professional counselors. You'll see in our chapter that it lists the national body for social workers and the national crediting body for. Um, marriage and family therapist, but we would like to add the national accrediting body for professional counselors. One other thing that in house bill 291 that's the one from last session in which the court systems. Uh, the judges asked to add more professionals for guardianship at this time to do a mental health evaluation for a person entering in guardianship of this under the state of Georgia. The only two professions that were allowed were social workers and psychologists. There are 3000 social workers. There are 2500 psychologists. So by adding licensed professional counselors for house bill 291, you will be adding a workforce of 89. 186 hundred people more available for that. The court systems are backed up by six months or more. So again, what happened with the profession, which is only about 40 years old. The education went from 32 hours, master's degree or higher up to where now at 60 semester hours to graduate with your master's degree or higher in clinical mental health. So as you can see, the education has across the United States has increased. So again, thank you all for reducing 24 months of internship in order to apply for full licensure. So I know the last items are removing the restrictions on um, diagnosing and testing. They were added in 2016. There was a debate on whether or not this was necessary. Again, the law was created in the late 80s. Uh, there were virtually no issues on diagnosing and testing. In 2016, it was added. We'd like to have it go ahead and have it removed. So if you have questions, all right, Senator, we're talking. Thank you for the presentation. The thing is Sherman. Um, who added the language in 2016? Um, trying to remember the House of Representatives. Um, he's a mayor in to co-affords now. And I can't exactly remember his name. His wife was a school counselor with a degree in psychology. Okay. I'm just curious. Yeah, I'll be curious to see who added and why was that added. And then you go back to your previous slide. You said, um, this piece about adding to the law, that was, that's part of a, a judges ruling or the judges are asking. Say that one would say yes. House bill 291 was adding additional providers to the current list. Because the current list only has, uh, LCSWs and psychologists. And they're just not enough in the state. And again, the licensed professional counselors education degree went from 32 hours. It is now at 60 hours. So they do have a semester on testing. They have to have a separate semester on diagnosing. And then they have to go out and field and practice for a minimum of 24 months. They are allowed up to 60 months because life gets complicated. So they do have that option that if life is interrupted, they can continue working towards their license. And they do have to pass a national counselor's exam. One thing that licensed professional counselors also have to do to graduate, they have to take an exam. Or they want to get the, I think she said a request from judges. Okay. It wasn't a court order or anything. Okay, I'm sorry. I'm sorry. I don't believe. Correct. Okay. It's a request. House bill 291 is the request, sir. Okay. Thank you. Senator Halperen. Thank you very much. Thank you. All right, I'm going to, um, get out of order here because I think Megan Ford's will, we'll, we'll tie ribbon on some of this for us. If that's all right and go ahead and ask Rusty, Ralston to come speak to us from the Soul Science Society of Georgia. Thank you, committee. Thank you very much for having us. We asked for your indulgence as we were rookies at this. Hi, how are you? And if you think you had a lot to deal with this, we've got very little because our numbers are probably the smallest of any group here represented today. We, and I want to introduce Patrick Davies, he's from Valdosta. I live in Blu, Blair'sville. We both serve on the Soul Class Fire Certification Advisory Committee for the Georgia Department of Public Health. Patrick is our chair. Um, for those of you who don't know, as Soul Siders and Soul Classifiers, our main purpose is to provide soul and side evaluations for own site wastewater applications. Majority of our work is from residential and commercial septic system permitting. We also work on community, large community drain fills. There's a lot of things that we do, but our main certification is through the Department of Public Health. And in the sale all, we're going to get to this little bit. There are requirements that we're looking at trying to change a little bit so that we can increase our numbers as well. If you'll notice on the, and I think you should have this in your package as well, as well, I'll try to gather as much different information as we could from the Department of Public Health. So what you're seeing here is the number of actual Soul Class Fires that have been certified in the state. This chart actually begins in 2004, but our certification program actually began in 2000 with a legislation that created this whole program with the Department of Public Health. But if you'll notice on there in 2004, we were right at about 60 Soul Class Fires that were certified by the Department of Public Health. And if you look at the very end in 2022, which is the last bit of data we have, we have exactly the same number. This is a critical issue. You also see that there was a spike or peak right around 2006. Of course, that was the height right before the Great Recession to head to the housing market got pretty hard, which of course had our numbers pretty hard as well. On the next slide, if you'll see that there is, these are the number of septic permits in the state. This ends at 2021, but it begins at 2012, which is after the Great Recession and things started to come back up. You'll see those numbers have increased. There's just a little bit of a spark down in 2021, but that number I think is kind of maintained at that level. So if you go back to the last one and you see that chart and the number of Soul Class Fires trying to meet and do the work for those many septic permits, it got a little hairy there for a while. We're not the only ones that perform this work, registered engineers or licensed engineers that are performing in their area of competency, as well as geologists can do this work. And if you'll notice, I believe geologists is the orange number or the orange line rather, and engineers with the gray line, Soul Class Fires of the blue line, there's more Soul Class Fires out there, but they have flat line as well as trying to get people into doing this particular type of work. And you'll see the total number up there. We've managed about 120 folks trying to actually perform enough work to get these 18,000 septic permits done a year. The other issue is, and I'll just be frank with you, we don't have any data on this, but the median age of a Soul Class Fires in state is probably around 50. And so we're not doing enough to bring people into our profession and trying to raise this up. This has been an ongoing concern, and we've decided to try to make some movement in that direction. So if you would, on the next slide, you'll see exactly what's required. Currently, by law, you must have a bachelor of science degree to be considered. You must have 30 semester hours of physical science and 15 semester hours of actual Soul Science coursework. And this is actually in the state law for what was required. And we're not proposing any change there. We think that that's appropriate. And a number of our folks that are coming into the profession actually have a bachelor's of science degree and are going back and getting their coursework. And there are our own line opportunities for them to try to get that rather than trying to get to a physical place to have that education. You'll see an examination area. There's a filled exam that's required. There's a written exam for the regulations for the septic system permitting the Georgia Manual, if you will, of onsite wastewater management. And then there's another written exam. And currently what we're using is the fundamentals of Soul Science exam that is administered by the Soul Science Society of America. We see this as a potential problem. I can tell you I took the test. I had been out of college 20 years when I took it and I had to take it again because I didn't pass it the first time. The real reason why we're looking at changing this particular, this particular part of the program is that what we do is very specific. We get out on a piece of property. We dig holes trying to get on about six feet. We're trying to do a map. It's very focused on that. The chemistry and microbiologists involved in the Souls has already assumed in the work that we do. So we don't actually do any kind of measurement when we're doing these type of evaluations. It's important to have that background through our academic program or work. But we don't see a need for that. This test, this fundamental Soul Science test actually requires a serious examination of Soul Chemistry, Soul Microbiology, Soul Physics, things that sometimes we don't actually do in this field. When we started in the program in 2000, I was part of that first wave that got certified and we actually used a state administered test and we're reviewing that possibility of going back to that now to try to reduce that effort. We have a moment of giving you names. We have one young man that's taking this fundamentals exam three times and he can't get through it, but he does great work. So it's a stumbling bought force. But the one that we're dealing with with the most is a four-year experience requirement. And it's not that it's that requirement. It's the requirement that happens after the full education requirements have been completed. So in other words, if we have somebody come in as an apprentice or somebody that starts working for somebody before they've completed their education, none of that experience can count towards getting your certification through the department of public health. We see this as a problem because a lot of people don't even think about Soul Science when they're in college. But once we get somebody out into the field and they see what we're doing there like what we do, they want to get interested in it. And sometimes it'll take them a little while to be able to get up to that point. We see that as an obstacle that we're trying to change. So what we want to do is change it to keep the overall four-year total requirement because we believe this and we've discussed this as a bunch of colleagues getting together. Other states do it differently. There's some that are five years. There's some all the way down to two years. But we believe the four-year requirement total is as useful. But what we'd like to do is to take and change that to two years after the educational requirement has been completed instead of the four-year. We believe that this will help us get more people in a resident. There are other things that we need to do. This is not the only thing that we need to do to get people in a resident's Soul Science. But this is probably one of the ways that we can help. And this is one of the ways we see that through the legislation we might be able to make that change. I'd be glad to have any questions that you might have. Thank you. So you're not under the state professional license boards. You're under the Department of Public Health. We're a certification program to the Department of Public Health. Yes sir. And your industry, do you often see people that do the Soul exam or classification also do the monitoring like the runoff and all that? Is that normally? There are some that hold both of those certifications. They do erosion and sediment control type of work. And is that under the Department of Public Health? No, sir. I still think that's under EPD DNR. Okay. I mean, I don't know how it was 60. I don't know how you all are doing it. And I mean, I- Well, you see what's happened to me. Is it a compensation issue too? We've heard stories of folks coming out with a degree in water and soil size out of the University of Georgia. They've gone through the whole program. I think Patrick's had experience with this that we have this or in terms of requirement as part of that degree. They get out there. They work it for a while. They decide they don't want to do it. So it's not an easy- it's not easy field. You're outside. You're dealing with with all the parts of the environment that that could be bad from whether to to insects, to snakes, the juror spider, which is now moving north with thank God. What's the terrible thing? But what we're seeing mainly is that we're not getting enough publicity out. And then when somebody finds out about it or they go out to the field with somebody or they're trying to get their house built and go out and get a permit, they find out they've got to have a level three souls survey. Can I be out there with you? Yes, please come out there with- oh, this is kind of a neat idea. I wish I'd known about it. Then they find out what the requirements are and by that time they're no longer interested in trying to pursue it. Essentially, this most is about a year process, a four-year degree and four years of experience right now to get there. I actually have young men working for me that was working for the US Army Corps of Engineers as a wetland regulator. And he has experienced understanding of looking at landscapes and land forms and making those kind of calls as it stands now. None of that experience can count for him to get a certification. So those are the kind of people that we're looking at. And he was actually somebody that went out with a soul classifier to look at how a soul inside evaluation occurred when he built this house and how was he? I think the market will determine that compensation. I think it's fair. I mean, I think we're fairly compensated for what we do. We had two interns this summer and this would help count some of their experience this summer and next summer. And honestly, most of all, the job experience is really what pays off the longer. Thank you all. Any questions? Great. Thank you all. If there's anything else, please let us know. Yes, sir. So before I call up Megan, I do want to point out we've got some information in the folder. Hold on a second. You'll see many members of the document here with their FTA at the top of it. This group will be aware of their recommendation. So this group wants to be aware of their recommendations for licensure reform, but they weren't able to come present. And I told them we would make you aware of this. Let you read it at your convenience and kind of entered into the record. So I want to go ahead and officially do that. And then we have another really kind of thank good document with just shows where Georgia is at the top. It says a snapshot of occupational licensing in Georgia. And it's got some recommendations. And reasons why reform is important and some ideas there. And it includes a pretty big spreadsheet of all the different licenses we have, what the fees are, and that kind of thing. So just for your reading pleasure at a later time, we'll have that in the official record. All right. So to really bring all this home for us, this is our, I think, is this our third meeting? So this is our third meeting. We're going to have a fourth meeting before we go into special session. And at that meeting, we'll have maybe one presenter is all maybe two. And then we'll have some, we'll discuss some recommendations. We'll vote on recommendations. And then we'll have a report, which is due by, I think December 1st. That correct. We could probably ask for an extension, but I'd rather not. So we're kind of trying to get high level view of where we are with all this license and stuff. We've heard a lot from specific industries and their concerns. But Megan, I think, can, can sort of bring all this home and kind of tie it together with how this is impacting our workforce in Georgia, our economy in Georgia, and opportunities for Georgia citizens. And so I want to call on Megan Forbes. She's a graduate of legislation for the Institute for Justice. Good morning. And thank you, Chairman Walker, for inviting us to speak today. I also have with me, Jamie Kavanaugh, who is a legislative council and attorney at the Institute for Justice. And we have Diamond Cherry with us, who is a makeup artist here in Georgia, who's going to talk in a little bit about how the licensing laws are impacting her. So my colleague Jamie is going to begin the presentation today. Thank you. Thank you, Megan. And I'm just going to talk for a couple minutes about the, um, lactation consultant license case, because I had the pleasure of litigating that case and the clicker is not working. Let me do this. Okay. Thank you. So you all have heard a little bit briefly about the case from another presenter. But what I wanted to talk about today are kind of the implications moving forward. And what the general assembly should be thinking about as a result of this case, when it thinks about either creating new occupational licenses or reducing the burdens associated with existing licenses. Jamie, you're, you've got a voice to me. Does it carry all that great? I'm having a little trouble. Get that microphone up to your mouth. Good. Thank you. Absolutely. Sorry about that. Thank you. Yes. Okay. Let me see if. Okay. There we go. Thank you. Okay. So I'm going to start by talking just briefly about our case where the Georgia Supreme Court struck down the license for lactation consultants. Lactation consultants are women who teach other women how to breastfeed. They are generally just giving support and advice in the first few days or few weeks of a baby's life. They're not doctors, they're not prescribing medication, they're not diagnosing, they're not treating any diseases. And they all are trained. They take different private training courses, but the license in Georgia single about one of several different types of training courses and said, it doesn't matter what training you've done before. Now to be licensed in the state of Georgia, everyone has to do this one specific type of training. And Georgia was one was the fourth state in the country to adopt a license for lactation consultants. Most states don't license lactation consultants, but they work in private practice, they work in hospitals, they work in physicians offices, because their employers trust the trainings that they all do. And even before this license was adopted, the Georgia Occupational Regulation Review Council reviewed the proposal and recommended against licensure. It found that there was no instances of harm to Georgia families as a result of unlicensed lactation consultants. And it actually said that licensing lactation consultants would harm the public because it would reduce access to lactation care and services. So when the court took a look at this case, it said a few really important things. And first of all, it said the Georgia Supreme Court said that in Georgia, our Constitution protects the right to earn an honest living, we call that the right to economic liberty. The court protects that more than the federal Constitution. So the Georgia Constitution is more protective of that right than the US Constitution. And that's a really amazing wonderful thing that we know happens here in Georgia. But that means when the general assembly wants to pass a law to restrict someone's right to earn a living, then it has to kind of have a few barriers in place and boundaries in place so that it doesn't overstep those bounds and infringe someone's right to earn a living and go beyond the bounds of the Georgia Constitution. So the court set out a new test that the legislature can keep in mind when it's creating new licenses or when it's thinking about reducing burdens associated with existing licenses. So the first thing that the general assembly has to provide is a legitimate interest or reason for licensing a profession. If you're thinking about creating a new license, what's the actual public harm that's happening? So here, the courts said that pure economic protectionism, protecting one group from economic competition would never be illegitimate government interests. Federal courts have actually said that is illegitimate government reason to regulate in license, but that's not true in Georgia. And the court also said that general quality concerns are not illegitimate government interests or a good reason to license. You can't say we might have better quality if we license a profession because that's true of any profession. So you need to\n\ninterest that's unique to this profession if you want to license a new profession. So if the government can't show a sufficient interest or reason for licensing of profession, then the new license would be considered unconstitutional by the court. But here, the general assembly said, hey, we want to increase access to lactation, care, and services, and we want to make sure that services are safe. So the court said, yes, on its base, that's a legitimate reason to create a license. And so then the burden flipped back to my clients as the challengers. And we had to show that the license was unreasonable in light of this specific stated government interest. So did the means that the general assembly chose, the means for regulating, did they fit kind of the end goal in place. And here the court said no, because the facts that we had show that there was no evidence that anyone had ever been harmed by an unlicensed lactation consultant. There was zero evidence of that happening in Georgia or anywhere in the country. And we had the information from the regulatory review council, as well as other information in the record showing that licensing lactation consultants would actually decrease access to care instead of increasing access to care. And so here are some of the real world harms from Licensure that the court considered during this case. So by licensing lactation consultants and forcing tons of women like my client, Mary Jackson, who had worked as a lactation consultant for 30 years, she didn't have the right training. So she would have had to stop her job, go back to school for two years, take an expensive exam just to keep doing a job that she'd already done for 30 years. So by putting tons of women like Mary out of a job, of course, it would have decreased access to care, but that would have been felt most in rural and minority communities where people with this one specialized type of training don't tend to be located. Some of the private entities that offer different various types of lactation consultant training just stopped offering courses in Georgia. So now there was a decrease in access to education. Some employers, even though the license never was enforced, some employers started asking the unlicensed lactation consultants to stop working directly with mothers and babies. This wasn't because the law was an effect. It was being challenged in court and the Secretary of State had agreed not to enforce it during the lawsuit, but the employers were still taking these actions. So it was still having the same effect and impact on the ground. And some hospitals actually stopped hiring lactation consultants that didn't have the training that wouldn't be eligible for a licensure in the future. So there are a lot of other effects that can happen in harms that happen as a result of a legislature, a legislative decision to pick one single type of training. So now I'm going to hand it over to Megan to talk about some legislative solutions. Thank you, Jamie. So I'm going to talk about IJ's research on occupational licensing and offer some practical strategies for reform based on best practices that we're seeing right now in other states. So I'm going to start by talking about our research, license to work. License to work is a national study of the burdens from occupational licensing for a 102 lower income occupations across the country. We looked at burdens across the board in every single state for the 102 lower income occupations that we identified. And we had a few key findings. We found that for these lower income occupations, licensing is widespread. It's burdensome and many of the burdens are questionable at best. Overall, we identified more than 2700 occupational licenses across the country. And we also found that licensing is not universal. Among the 102 lower income occupations that we studied most are unlicensed by at least one state. So 88% were at least unlicensed by one state. And licensing requirements often appear unrelated to health and safety. In fact, all of these occupations here require more training than an EMT that includes cosmetologist, painting contractors, skincare specialists, and auctioneers across the country, all of these bars in green. So how did Georgia do in our report? Georgia ranked 35th overall with first being the worst out of 50 states. And there's one thing that we found that was particularly concerning in Georgia. Georgia ranked 12th for its average licensing burdens, again with first being the worst. And this is concerning because these burdens are the burdens that disproportionately impact lower income workers the most. Another thing that we found concerning is that Georgia's licensing burdens actually grew worse over time. On average, Georgia's licensing fees and state mandated education and training all increased. So in our research over the years, we've observed a lot of problems with licensing. And I know that this committee has been hearing a lot about the problems with licensing over the last few meetings. But not everything that states are doing right now related to licensing is bad. Our research also shows that states are starting to take licensing reform seriously. So I'm going to turn to talking about some of these best practices that we're seeing right now across the country because they show what's possible for Georgia. So let's start by looking at the big picture. There are three things that we're seeing states doing right now to reform licensing laws. We are seeing states implement sunrise and sunset review processes to review proposals for new licenses and existing licenses to make sure that licenses are narrowly tailored to protect against credible evidence of harm. We're also seeing states considering less restrictive alternatives, one appropriate. Another thing that we're seeing states doing is repealing licenses for occupations that are not necessary to protect public health or safety. And a lot of times that involves looking to see what their neighbors are doing and what other states are doing in that regard. And then finally, we're seeing states pairing back broad scopes of practice in licensing laws to exempt safe and common services from licensure. So I'm going to talk a little bit more about each of these strategies for reform in detail. So first, let's talk review processes. What we've found by looking through our research at states sunrise review reports across the country is that most government reviews do not recommend licensing. 54% of the time government governments are not recommending that a license be created when reviewing the need for a license. They're looking at other alternatives and finding that there are other regulatory alternatives that are appropriate. So we think that this is really promising. And we found that sunrise reviews can be particularly effective at preventing the enactment of new licenses. So what is Georgia doing on this front? Unfortunately, Georgia repealed its sunrise review process recently. But we think that this creates an opportunity to start fresh. So I wanted to note a few key components of a meaningful sunrise review process. And the same is true for sunset reviews as well, which look at existing licensing laws. Strong standards for guiding the review. So we want to make sure that there are standards that are guiding the reviewers to look for the least restrictive regulation based on evidence of harm. Also independent reviewers doing the review. And then finally, sufficient time to complete the review. And I just want to know that often that's nine months. And that's what Georgia had before, which was producing pretty meaningful reports. So I'm going to turn to talking about another best practice. And it's reducing licensing burdens. So nationwide, we have observed that 20% of the licenses that we studied over the last five years became less burdensome. So what are other states doing in this regard? They're repealing unnecessary licenses. And again, pairing back broad scopes of practice. So strategy two here is to repeal licenses and reduce licensing burdens for occupations that aren't licensed elsewhere. So we've done a little bit of research on our end. And first, we reached out to the knee regulatory research center of West Virginia University. They have identified 10 occupations that Georgia licenses that are not licensed in 30 or more states. And we've listed these license here so you can see them. So we recommend taking a long hard look at these licenses because when people are working without licenses safely in at least 30 states, the need for them in Georgia is questionable at best. We also took a look at the licenses that we identified in our report that are licensed in Georgia and not licensed in a number of other states. And you can see they range from non-instructional teacher-assisted 40 states, student license that occupation all the way down to security alarm installer and travel guide. These are also occupations that we think are right occupational licenses that we think are right for reform. So the final thing that I want to talk about is pairing back broad scopes of practice for licenses for lower income occupations. And we took a look at our report in the one area where we see a lot of opportunity and also steep licensing requirements is the beauty industry. In Georgia, cosmologists have to complete 1,500 hours of training and pass two exams. And that's 10 times the hours of training that we require for EMTs here in Georgia. It's outdated and laws like these are an urgent need of reform. And that's what we're seeing across the country right now. We're seeing when thinking about best practices, states reducing barriers to beauty, to working in the beauty industry. We are seeing if you look at this slide here, all of the green dots represent reductions in days lost in training. And it's showing positive steps in the right direction toward reducing licensing barriers for people who work in the beauty industry. So what specifically are other states doing right now, 13 states exempt make up artistry for licensing, including Arizona, Florida, Mississippi, and Texas, and five states exempt blow dry styling from licensing. And these reforms have a real impact. They create opportunities for entrepreneurship and for people to have their own businesses. So what is Georgia doing on this front? Has Bill 212 was considered last session. It exempts safe niche beauty services like makeup artistry and blow dry styling from cosmology licensing. And we have Dim and Cherry here who is going to briefly speak about how the licensing laws have been impacting her as a makeup artist. Good morning, can you hear me well? Yes ma'am. Okay, perfect. How are you guys doing? So I'm Dim and Cherry. I am located here in Atlanta, Georgia, specifically doing makeup artistry. Me doing makeup, I have started out as an entrepreneur within my experience. I am unlicensed as well just to make that clear and I am self taught. I've been doing it for well over six years. I just wanted to let you guys know that basically I'm here to share my how my how the state laws impact the work and ability to earn a living. Basically the state's licensing laws are driving artists like me into a underground economy where some customers try to take advantage of us and pay us less or refuse to pay since we are not licensed. Even though they want our services, I think everyone should have the opportunity to earn a living and pursue the American dream. It is also important for many other people in the state, especially women entrepreneurs like me who are being held back by those by those laws and who lives will change who lives will change from these reforms. Excuse me. I think everyone should have the opportunities to earn a living and pursue the American dream. It is important for many other people in the state who are being held back. I also wanted to let you guys know that due to me being a makeup artist here in Georgia within these laws, a thousand hours is I have considered looking into school for cost and technology. It is not like that it has it been an option for me. The only thing is me as an individual here in this state I am working full-time as well as a part-time job and most of the positions available even if I were to such as the beauty retailer that I work at now. They can necessarily certify me for doing makeup there but one of the things that kind of put a burden on it is more of like the cost efficiency and aspects of surviving here in this world. A lot of people kind of take makeup artistry as a profession such as myself along with passion which is something that we need within our community. I do believe that makeup artists and beauty professionals are what keeps our excuse me. Our world going in regards to other individuals such as women and men or even in the film industry as well. I believe that if we were able to assist in making some changes it would be able to actually bring more artists to make more income because we do come across some individuals that do feel like due to us not being licensed within our skill sets that we do not deserve the pay that we are charging out here in this state. Within Atlanta because our economy and a lot of we have a lot of growth in our city right now especially with a lot of people coming from other states. I do believe that if we at least less than maybe some of the hours for makeup artistry because it does not take a lot of skill most of the time it's more so teaching technique and I believe if there's just more technique within taught excuse me if there was more technique taught within makeup artistry versus just giving basic skill level when it comes to cosmetology I believe it actually assists more makeup artist in the community better versus having to take a thousand hours and majority of those hours is confined to cosmetology here cutting, coloring, styling things like that sort as well as only entry level of skincare and things like that and I feel like if we're at least going to be licensed for our work we should be licensed in makeup artistry as well as learning other techniques because it's more it's a lot of versatility in our skill sets that we provide to the community. But thank you for having me and hearing me out. Thank you, Donna. Now is it is it accurate that the film industry in Georgia has a waiver I guess a lack of a better word that makeup artist working in the film or entertainment industry are not required to be licensed in Georgia? Yes, Megan did definitely include that to me um a while ago that it does there is an exemption in Georgia for that but if you really think about it it's really hard trying to get into the film and production industry if you're not at least put into the rooms that cosmetology licensing can give you. One of the things that I can say that's great about the cosmetology license it does put you in an environment to actually have you get to know other individuals and the actual industry so you can be a part of that but it's harder for individuals such as myself who are self taught because I do not have the means to go to school or have the actual time to attend the schooling just because it's like 20,000 to 30,000 dollars and again a thousand hours is not bad but most of the school curriculums when it comes to that hours to attend it interferes with you trying to actually make a livelihood and really um even if you were to still be an entrepreneur and a take clients while going to school some of the schools do not allow you to sometimes assist other clients so that also stops you as an entrepreneur from bringing your own revenue into your economy as well and I think we're really big into helping the economy grow as much as well excuse me if I over answered yeah so I mean the point it just seems to me if if the film industry or entertainment digital entertainment whatever you want to call it is exempt it must not be a safety concern so what is the concern but anyway thank you Diamond um all right thank you thanks diamond for speaking to that issue and I want to mention too that uh makeup is also exempt at retail locations in the state too we're arguably the public health and safety risk is probably creative so it's really when artists like diamond are going out on their own where they can make the most income where they're currently disalaped from working without completing that thousand hour training requirement so just to wrap things up well now our clicker is not working but it's okay we're at the end of the presentation here um there was one last best practice that I just wanted to briefly mention um but I'm not going to speak very long about it because I know that the committee's talked about it quite a bit and that's licensing reform for people with criminal records 40 states oh here we go thank you have reformed their laws to ease licensing burdens for people with criminal records who are rehabilitated um so we're very appreciative of senator Strickland for sponsoring this spill it adopts national best practices and Georgia would become a national leader across the country if it were to enact this spill um so we thank you all very much for your time today and we're happy to answer any questions you may have I also want to mention that our attorneys are available to help with research and crafting legislation if you need any assistance all right senator annabitori has a question I believe thank you miss chairman actually have several questions but I'm going to go quick um on the slide that had kind of the red wheel about licensing is not universal do you have the sub data that goes with this aggregate data to see yes we do um so i'll need it right now but yeah i'm interested to see um what the sub data says but also too um if you can also produce for the 102 lower income occupations i know in one of the slides you have some of them can you produce the entire list maybe in rank order of i would be curious to just see what that is yes absolutely so our report licensed work i have a copy with me here has all of that data and also the Georgia specific list of the licenses from most burdensome to least burdensome and i'll leave this copy here with the committee so you have it thank you do you also on going back to the slide best practice reduce the licensing burdens um do you have any data that shows that in some states that there maybe there's a correlation correlation between some states maybe just enacting licenses to create a backdoor to generate revenue or tax call a syntax whatever you want to call it maybe in those states where licenses are not needed or required as y'all talked about is there any data that maybe shows that it's more of an income generator versus a quality outcomes driven situation sure so um we this report as well shows the licensing fees and you can certainly see where fees can be quite steep and we've also seen at the local level here in Georgia that local licensing fees and some of the larger cities are quite steep too as much as four hundred dollars for business licenses for example so it's something that's definitely a problem where where people who are just trying to work or are having to pay these really high fees to start working which can be cost prohibitive prohibitive especially for lower income workers yeah I mean the presentation on the lactation consultants um in the Supreme Court case I mean honestly again my own opinion but that's pretty crazy you would need a license um I mean I've lived through that three kids I mean all that and I work in health care um but just the dynamics around it other than it being a revenue generator I don't know why it would even be needed because I've never heard of an issue with that workforce or anything right well and with that license in particular um they're definitely were trade groups behind pushing it um where there's it was their certification right that would have been mandated so there's a profit incentive there for the private organization to lobby to get that training that they're offering um and starting them a lot for everyone to have to to do um so sometimes we see private profit incentives too yeah I just don't think there's it's right to um you know levy taxes or some of these licenses on the backs of hard work in Georgians that are trying to do something good for their neighbor or the community um the other question I have and I don't want to maybe all can answer this I see George in the audience I want to put don't want to put them on the spot but why are there licenses or continue to be licenses in the non-intructural teacher assistant world and there's only four states that don't have those you see I got um I would be fascinated we could talk offline about that I would just be curious to see is that what is that what does that mean like who are those teaching positions we're not teaching positions who are those staff positions in school districts or education settings that this is kind of time back to um because that um and then I think for our outdoors men and women the tax taxidermist license maybe that should go away okay um auctioneer but we'll keep that one um all right thank you so much thank you thank you all for traveling to be with us and uh we're offering your sales as a resource as we try to come up with some good recommendations and hopefully some legislation but thank you very much thank you chairman maca all right that concludes our presenters if there is there any other business from the committee today thank y'all for your presence and time and again um I want to just throw this out for the committee members what do y'all think about maybe having our last maybe hopefully our last meeting on November 28 since we're going to be here on November 29th we do it on the 29 we could do it on the possibly do it on the I'm not on it see what time we're do you know when we're going to gabel anything not yet sir no um so i'm that's kind of what i'm thinking is either the 28th possibly 29th so that we're kind of already coming here or here but we do need to maybe we'll get a big crowd too that would be good we do need to count again bonus points but I do want to ask the committee members and I don't know Senator Strickland's online or not is he has he been y'all be thinking about what we've heard over these three meetings and and what we might want to put in our recommendations and I would think what I kind of would like to see us do is maybe kind of look at some low hanging fruit maybe the makeup artists for example or some low hanging fruit and then maybe some more aggressive things too so that because the hard stuff's hard to get through a lot of times I like doing hard things but I do want to you know I hope we can see some results out of this I think there's a lot of areas that are definitely needs some attention and some of the groups have given us some good recommendations that I think we ought to really take under consideration but I agree all right well thank y'all thank everybody y'all have a great day and meetings adjourned thank you thank you Mackenzie too",
  "updated_at": "2026-02-13T17:07:06.582902+00:00"
}