{
  "video_id": "DazexyczZmI",
  "url": "https://youtu.be/DazexyczZmI",
  "title": "Georgia House - Day 18 (2026-02-17)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 18,
  "video_date": "2026-02-17",
  "duration_minutes": 79,
  "summary": "Here is a structured summary of the key points from the Georgia House session transcript:\n\n**Overview:**\nThe session featured a devotional prayer by Dr. Eric D. Mason, a community pastor from Savannah, Georgia. The prayer focused on themes of courage, faith, and the ongoing struggle for equality and justice in the face of various societal challenges.\n\n**Key Actions:**\nNo substantive legislation was passed or referred during this session.\n\n**Bills Introduced (First Reading):**\nNone mentioned.\n\n**Notable Moments:**\n- Dr. Eric D. Mason delivered an inspirational devotional prayer, reflecting on his own upbringing and the legacy of civil rights leaders like Harriet Tubman.\n- The prayer emphasized the importance of faith, perseverance, and community engagement in addressing issues such as poverty, crime, education deficiencies, and social injustice.\n\n**Votes:**\nNo recorded votes.\n\n**Attendance:**\nQuorum was established, with all members present and voting.\n\n**Adjournment:**\nThe session adjourned, with no specific next session date provided.",
  "transcript": "They are convening having arrived, all members of the House will please report to the floor\nand take your seats, all members.\nPlease report to the floor of the House, the clerk will ring the bell.\nYou\nAll members will please take your seats.\nWe're about to have the morning roll call.\nWe're going to have now the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nAll members voted have all members voted if so the clerk will lock the machines.\nMore keepers will please close the doors and keep them closed.\nWe will begin our day with scripture reading and prayer by the chaplain, after which we\nwill pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 162nd House District\nRepresentative Carl Gilear, representative Gilear.\nThank you, Mr. Speaker.\nGood morning to my brothers and sisters on this morning.\nHow y'all doing?\nI'm going to say that again.\nGood morning to my brothers and sisters.\nHow are you doing?\nYou know, I've learned the word that says, everybody say yes.\nYes.\nI've learned the word yes means a good thing\nbeing submissive to something, some will, some way.\nSo the day, if you can just stand to your feet,\nclap your hands, give the Lord some praise\nand say yes to that, we can agree on that on today.\nCan you stand and give the Lord some praise\nup in this place?\nYes, to your will, to your way.\nYes, I will trust you and obey.\nYes, I will worship you.\nYes, I will praise you.\nYes is a big word.\ndidn't that feel good? That's our Williams, yes. So today I woke up with praise and\nThanksgiving on my heart with the opportunity to bring you something that we\nneed a word from the Lord. And today I was blessed that we have with us as our\nChappin of the day, Dr. Eric Mason.\nHe is not only a senior pastor\nand Dr. Eric Mason's senior,\nhe comes from God's country, Savannah Georgia.\nBy ways of God, the city.\nHe comes also by ways of Tampa, Florida.\nHe is not just a pastor,\nhe is a communicator that brings people together.\nHe's an educator,\nnot only a father in our community,\nhe does several programs,\nhe's initiated several reentry programs,\nseveral programs to empower our community\nand our children bringing people from races\nand colors and creeds together in our community.\nAnd that's something to say yes to.\nHe is the pastor of Jesus,\na first community church,\nand it is a community church that gives back,\ndoes a lot of things in our community.\nI do not want to waste your yes time,\nbut I want to bring to you our chafflin' for the day,\nDr. Eric D. Mason Senior.\nAnd the house said amen.\nAll right, we are so happy to be here this morning.\nI was have been greeted by some wonderful, wonderful people\nthat made me feel right at home this morning.\nSo I'm honored to be here as your devotional leader\nfor today and to the honorable speaker of the house,\nSpeaker Roltson and to our representative Carl Guillard,\nwho introduced us and afforded us with this opportunity\nto share this morning.\nNow where I come from, we do a,\nI'm not going to do it unless I get a few amen,\nBut where we come from is not a good sermon\nwithout someone first singing a hymn of some sort.\nI'm not going to sing unless somebody say sing,\nbut other than that, I will keep on sharing this moment.\nI hear some mumbling somewhere, but I'm\ngoing to keep on sharing anyway.\nAnd where we come from, it wouldn't\nbe anything for someone to just simply say,\nI need the all.\nI need thee, yeah, every hour, I need thee.\nOh, oh, bless, bless me now, my say,\nHey, yeah, I come to\nI am to thee.\nI'd like to give honor to my wife of 26 years, and to my four sons, and their wives, and\nmy wonderful grandchildren, and to one of the greatest churches in South Georgia, Jesus\nfirst, the community church, located in Garden City.\nAnd I'm sure all of them are watching this morning to amen witness this wonderful occasion\nto the Georgia House of Representatives and all of you\nthat are present.\nI'd like to say this morning, it is good to be here.\nDo Aramuni 31 and 6 if I was to use for text this morning,\nit simply says, be strong and of a good courage.\nFear not nor be afraid of them for the Lord by God.\nIt is he that doeth go with thee.\nHe will not fail thee nor forsake thee.\nAs a support Texas says in Isaiah 43 and 2,\nWendell passeth through the waters.\nI will be with thee.\nAnd through the rivers, they shall not overflow thee.\nWendell walketh through the fire.\nThou shalt not be burned.\nNeither shall the flame kindle upon thee.\nFor thought this morning, if I had to use one,\nthe Lord is with us.\nHe has not left us.\nHe is mindful of all of us.\nAs a young boy growing up in the projects of Savannah, Georgia,\nnamely Garden Homes, Hitch Village, Fred Wessels,\nand a small community called Pinpoint, Georgia.\nWith no father in the home, I was told by many\nthat I would not graduate or mount to anything.\nWhat did I turn that into a lie?\nOne would think the odds were against me.\nOne day, a great woman of God, Dr. Idael Chiever told me,\nand I quote, to believe in yourself and your God.\nAnd you can be whatever you put your heart,\nyour mind and soul in, you can accomplish it.\nI note it was not a program or the place where I live,\nbut a person, a prophet that made a huge difference\nin my life. On this journey called life, I've learned and concluded, you cannot make it\non your own. We need one another. Most of all, we need our Lord and Savior, Jesus Christ.\nWe need Him to lead us as we touch and empower and transform the lives of those we come\nin contact with on a day-by-day basis.\nThe fight for equality, justice, mercy, and peace\nis still in front of us, although we deemed ourselves\nas free through bondage, plague, disease,\nand the cares of this life.\nWe continue to fight the good fight of faith,\nworking together to combat all the issues we face\nin America today.\nWe see it every day through poverty, and crime,\nand economics, and educational deficiency,\npolice brutality, gun violence, and gang violence,\nand illegal drug use, and hunger, and homelessness,\nhuman trafficking, evictions, unemployment, and the like.\nIt all reminds us today.\nWe have a huge responsibility to those\nwe serve in our various community.\nThe struggle is real.\nThere is much work for all of us to accomplish.\nWe simply cannot give up now.\nQuitting is not an option.\nThe other night I found myself,\nbelieve it or not, watching the movie called Harriet Tugman.\nIn doing so, I was reminded that February is Black History Month.\nA time set aside for us to reflect on whence we have come\nand where we are going.\nRight before my eyes, I was reminded of the struggle,\nhow our forefathers and mothers and sisters and brothers\nsurvive such hard degrading and deplorable and brutal times.\nToday is clear to me, we are standing on the shoulders\nof greatness, the shoulders of people with integrity,\nthe shoulders of those who have character courage and faith,\npeople who have refused to give up regardless\nof the odds, the obstacles and opposition.\nCall it what you may.\nI see it all as a reminder, we've come a long way,\nbut yet have a long way to go.\nHarriet Tubman believed that God would bring out alive her\nand all her siblings.\nShe believed and trust God because he promised\nhe would never leave nor forsake her.\nThe Lord granted Harriet Tubman's wishes\nand saved alive her mother, her father,\nbrothers, her friends, and neighbors,\njust as he did for rehab,\nwho lived in the walls of the city of Jericho\non the outskirts at the limits on the margins\nand brought rehab out alive with her entire family.\nI believe it can also be done today.\nNeed I remind us, we are in the business\nof saving lives, families, and communities.\nLet me echo in your ears today,\nit was grace that brought us safe this fall\nand grace shall lead us on.\nThat's fast forward today as I hurry along to my seat.\nNo one could have predict that there would be a time\nwhen people around the globe would be fighting a deadly\npandemic like COVID-19.\nMany lives were snuffed out too early and loved ones\ntaken away by ambulance, never to be seen again,\ndying alone in hospital beds.\nBecause of mandatory lockdowns, elderly parents\nand nursing homes could only see their families\nto glass windows or speak on a phone.\nPeople hearts were so full of fear,\nthe suicide rate escalated\nalong with the numbers of domestic violence incident.\nIt has isolated families, friends, co-workers,\nand acquaintances.\nAll but I came to tell you today,\nthere is hope in the midst of all this turmoil\nand strife because you and I, we are not alone.\nMay I remind you of our texts.\nIt says, be strong and of a good courage.\nFear not, be afraid of all of,\ndon't be afraid of all of this.\nFor the Lord, by God, he is that do go with us.\nHe will not fail us, nor forsake us.\nWhen we pass through the waters of life,\nhe will be with us.\nAnd through the rivers, they will not overflow us.\nWhen thou walkest through the fire,\nthou shall not be burned,\nneither shall the flames can do the pundit.\nas I hurry to my clothes.\nI challenge all of us to remember\nour purpose, call assignment and our oath\nare calling to Michael six and eight.\nHe has shown the old man what is good\nand what do with the Lord require thee,\nbut to do justly and to love mercy\nand to walk humbly with thy God.\nWe are servants, we are here to serve humanity\nand bring about change.\nI challenge the room today\nTo feed the hungry, clothe the naked, provide the resources, build community, provide better\ntransportation houses, employment, food and educational opportunities, restore reentry\nfor those formerly incarcerated, return back to our community, raise the minimum wages\nfor our beloved Georgia citizens so they can have a better opportunity at life.\nIn doing so, we will fulfill the duties and responsibilities of great leaders, a great\ngovernment, a great people, and most of all a great Georgia, may we all stand. Let us pray.\nFather, oh Father, through all generations you have been our dwelling place. And for that we say thank you.\nThank you, kind Father. Birth is yours and the fullness thereof, the world and they that dwell\nvariant. It all belongs to you. You lay the earth's foundation on the seas and\nbuilt it on the ocean depths. We thank you for you. God, you for this general\nassembly, the speaker of the house, the governor of the state of Georgia, the\nsenators, the house of representative, counsel, and all of us that are part of the\nteam that keeps this house productive and safe. Lord bless their families and the\nstate of Georgia. We remember this day, all those who have been affected by\nCOVID-19, we pray for their strength, their healing and deliverance. We pray for\nyour wisdom, your knowledge, your guidance, compassion, understanding and\nprovision. Father, help us to always do justly, to love mercy and to walk humbly\nwith you. We pray that we will always remember our purpose, the agenda and the\nassignment that is set before us. This is to serve those who abide God in this\nour beloved state to the best of our ability with honesty, integrity and accountability.\nIt is in the name, which is above all names we pray, every heart that loved\nhim say, Amen. May we recite together the pledges of allegiance, our pledge of\nallegiance to the flag of the United States of America and to the Republic for which\nis staying one nation under God, indivisible, but vividly justice for all.\nThank you.\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and\naudience. Thank you, Mr. Speaker. Your Committee on Information and\nAudits has read the journal of the previous legislative day and found that\nthey'd be correct. And furthermore, Mr. Speaker, I don't trust anyone who's\nnice to me but rude to the waiter because they would treat me the same way if\nIf I were in that position, Muhammad Ali.\nChairman Hogan, the Chair of the Committee on Information and Audits reports that the\nJournal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the Journal?\nThe Chair here is none and the Journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 15th, who's following me establishes the order of business\nand the first part of the period unanimous consent.\nIntroduction to bills and resolutions.\nFirst reading and reference of house bills and resolutions.\nSecond reading of bills and resolutions.\nThe force of standing committees.\nFirst reading and reference of senate bills and resolutions.\nMorning orders.\nIs there any objection to the adoption of the resolution\nestablishing the order of business for the day?\nThe chair here's none and the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 462 by Representative Gillier\nand 160 seconds, Stevens and 164th.\nBill Vittata and Actumen, Article 5B of chapter 8\nand Title 48.\nNew physics, go to George Anitetti,\nwe're leaving the special districts for transit purposes.\nTransportation.\nHouse Bill 463, members, and Gillier to the 162nd Bill Meatonin Act to amend Part 4 of Article 2, Chapter 5 of Title 46, the Fisherhood of Georgia Annotated, relating the emergency telephone number 9-1-1 system.\nPublic safety and Homeland Security House Bill 464, members, of SCOGINS, the 14th Gamble, the 15th, Williams, the 14th lever, to the 33rd and Smith of the 18th Bill Meatonin Act to amend Title 29, the Fisherhood of Georgia Annotated, relating the Guardian and Ward.\nGeneral Justice.\nHouse Bill 465.\nArrows on a gullot of the 19th, gravity of the 67th,\nRidley the 6th.\nMop to honor the 17th, singleton of the 71st and others.\nBill Mitoll and act to amend chapter 60,\na total of 36th, the fish go to Georgia, annotated,\nrelating the general provisions of applicable counties\nand municipal corporations.\nGovernmental affairs.\nHouse Bill 466.\nI remember that in a pile of the 32nd,\nWilliams of the 145th, Ridley the 6th,\ncorporate of the 174th,\nPre-tree, the 166th and others.\nWilmington, an act to men, Chapter 5,\nand Title 40, and Chapter 13, and Title 43,\nwith the official bill of Georgia annotated,\nrelating to driver's licenses and driver training schools.\nMotor vehicles.\nHouse bill 467, by resident of Kendrick,\nthe 93rd, Drenner, the 85th,\nMitchell, the 88th, Lopez, the 86th,\nCarter, the 92nd, and others.\nWilmington, an act to men, Article 13, and Title 48,\nthe official bill of Georgia annotated,\nrelating to general provisions regarding\nspecific business and occupation taxes.\nWays and means.\nNo. 4.68 by resident of Carper to the 4th,\nlocked out in 17th, Thomas the 21st Smith of the 18th\nand Martin of the 49th,\nwill be taught an act to men.\nPart one of our three at Chapter 3,\nat Title 3080, the fish go to Georgia and attated,\nrelating the emergency powers of the governor.\nJudiciary.\nHouse will 4.69 by resident of Stevens,\nthe 164th and Newton, the 123rd,\nBill B. Todd and active in Article 2, Chapter 7 of Title 48 of the Michigan of Georgia,\nAnnotated relating the imposition rate and computation and exemptions from state income\ntaxes.\nWays and means.\nArticle 470 by Representative Washburn of the 141st Kelly, the 16th of the 176th, Wheat\nHour, the 119th, and Abstration of the 104th.\nBill B. Todd and active in Chapter 3, Title 44 of the Michigan of Georgia, Annotated relating\nthe regulations, specialized land transactions.\nJudiciary.\nHouse bill 471 by President McClaren of the 51st Cantrell of the 22nd Couch of the 50th and Paris of the\n142nd Bill Meantown on act to men part five art before chapter 11 to title 16 the official of Georgia and Teddy relating in Brady Law regulations\nGame, Fish and Parks, House Bill 472 by Representative Jones, the 53rd Building Title\nand Act of Adventure, House Bill 473 by Representative Jones, the 53rd in Canada, the 58th Building\nTitle and Act of Adventure, House Bill 472 by Representative Jones, the 53rd in Canada,\nState planning and community affairs House bill 474 by reps of Cooper the 43rd\nrunner the 85th Jasper's the 11th and Smith the 70th\nBill Bitton and active men are to chapter 13 and title 16 the fish go to\nGeorgia and Tater relating to regulation of controlled substances\nhelped in human services House bill 475 by reps and if Scofield the 60th\nDavis the 87th Scott of the 76th for now the 77th McLeod of the 105th and\nothers.\nHe'll be titled an active men chapter one in title 28, the fish go to Georgia annotated\nrelaying the general provisions regarding the general assembly.\nRules.\nHouse Bill 476 by reps and a washburn of the hundred and forty first nine to the hundred and\nthirtyth.\nFollowed thirty second Kelly the sixteenth and Thomas the twenty first.\nHe'll be titled an active men chapter fifteen to title forty three.\nThe fish go to Georgia annotated relaying the professional engineers and land surveyors.\nRegulated industries.\nHouse Bill 477 by reps and a watch in the hundred seventy second.\nSmith and 70 throws the 120th and 90th and 130th,\nbuilding title and active men code section 487 29.12,\nthe official go to Georgia and Tater,\nrelating a tax credit for qualified donation\nof real property.\nWays and Mains, also go 478,\nBarbara is in a bridge of the 97th,\nwe're chatted on the 176th.\nWelcome to the 81st fall under the 23rd,\nand grably the 67th and others,\nbuilding title and active men chapter seven,\nand title 24 of the official go to Georgia and Tater,\nrelating opinions and expert testimony. Judiciary non-civil.\nHouse Bill 479 by Representative Grieves 34th,\nPogun on the 179th, Gilear to the 162nd Frazier,\nthe 124th, Deloge to the 167th and others,\nBill B. Toddl-Nactiment,\nToddl-17, either fish code of Georgia,\nAntietta or Laney Decriminal Procedure.\nJudiciary.\nHouse Bill 480 by resident of Washburn to the 141st,\nJones to the 47th, Carpenter to the 4th,\nmore than 95th, Crow the 110th and others.\nThey'll be taught on an act to men.\nPart three of our collated chapter 14 and\ntaught a 44 of the physical to Georgia\nannotated relating to mechanics and material and\nsleans.\nJudiciary.\nOne by reps on a breeze the 34th and all the woods\nat the 42nd, built in the 112th Kelly the 16th\nwheat hour, the 119th and others.\nThey'll be taught on an act to men article two.\nChapter seven, the title 40 80, the physical to\nGeorgia annotated relating to impositionary\ncomputation and exemptions from state income taxes.\nWays and maves\n482 by reps. I believe in the 99th and Holcomb of the 81st\nBill Mehtal and act to men article one in chapter five with top of 40 80 fish go to Georgia annotator relating to add ballarm taxation of property generally\nWays and maves before 83 by reps and a fry the 118th trener the 85th and all of its 40 second\nAlexander the 66 and more of the 95th and Bill Mehtal and act to men article six to chapter three and article three a chapter five\nTitle 44 of the fiscal and Georgia annotated relating to property owners associations.\nJudiciary House Bill 484 by reps under Friday the 118th,\nhope from the 81st, Beverly, 143rd, win of the 89th.\nHouse entered the 66th and others.\nWill be titled an act to enact the Georgia Voting Rights Act.\nSpecial Committee on Election Integrity House Resolution 161 by reps under\nGillier, 160 seconds.\nStevens, 164th, B3, 166th.\nAnd Mallow, 163rd.\nResolution creating the House Study Committee\non Nancy Hanks, passenger rail line for transportation.\nHouse Resolution 162 by Rosa.\nMessed to the 55th.\nSmyre, 135th.\nStevens, 164th, Glant, and 70th Kendrick.\nThe 93rd, and others.\nResolution creating the House Study Committee\non the history of historically back colleges\nand universities.\nHigher education.\nHouse Resolution 163 by Rosa.\nthe prior of the 118th February, the 143rd Scofield,\nthe 60th Davis and the 87th, one of the 89th and others,\na resolution creating a house study committee\nto evaluate workplace safety and labor,\nlittle law enforcement.\nIndustry and labor house resolution 164 by resident,\nlimited to the 99th and whole, one of the 81st\nresolution proposing amendment to the Constitution.\nalso authorize the General Assembly,\ndrive by General Law.\nWays and Means.\nI'll say resolution 165 by Representative McLaren\nof the 51st, Skullfield of the 60th,\nCanada of the 102nd, Mitchell of the 106th,\nPark of the 101st, and others,\nresolution providing for an inquiry\nof certain matters related to Department of Corrections.\nPublic safety and Homeland Security.\nSenate Bill 27 by Senator Thompson of the 14th,\nfor Patrick in the 30 second,\nDugan in the 30th,\nHatchin' in the 50th,\nPuff Stetler in the 50 second and others\nof Bill Binton in the act of end code section 43,\n14, 15 in the fish go to Georgia,\nand Tater relating to military certifications.\nRegulated industries.\nSenate bill 43 by Senator Brass,\nthe 28, Mollos in the 53rd,\nMiller in the 49th, Alvers in the 56th,\nagain in the 47th and others,\nBill Binton in the act of end code section 33,\n6-4, the fiscal to Georgia annotated relating the enumeration of unfair methods of competition insurance\nSenate bill 45 by senator tops on the 14th albors the 56th Gucci the 51st\nMullis the 53rd beach the 21st and others will be title an active in chapter one title 43 the\nfiscal to Georgia annotated relating to general provisions and professions and businesses\nregulated industries\nSenate Bill 53 by Senator Huff-Statler,\nthe 52nd Albers, the 56th Butler,\nthe 55th Hickman, and the 4th.\nCapatric, the 32nd and others,\nBill Nitton, and active in chapter 25 of Title 50,\nthe fiscal to George Anzetti,\nruling the Georgia Technology Authority.\nScience and Technology.\nSenate Bill 87 by Senator Redd,\nthe 33rd Miller, the 49th Butler,\non the 55th delivery in 19th.\nHarbors is 15th and others.\nIt'll be Todd and act to amend Article 3, Chapter 7.\nTitle 48, the fish go to George Ancetti,\nrelated to tax returns and furnishing of information.\nWays and means.\nSecond, please first readers.\nSecond reading of bills and resolutions,\nthe clerk will read.\nHouse Bill 412 by Representative Dempsey of the 13th.\nHowell of the 32nd,\nsuspended of the 94th Cooper of the 43rd and Stevens of the 164th.\nThe bill relating to professions and businesses, House Bill 413.\nThe representative camp of the 131st Thomas of the 21st Matthewic of the 73rd\nscogons of the 14th gamble of the 15th and others.\nThe bill relating to control of hazardous conditions, House Bill 414 by\nrepresent Blackman of the 146 Williams and the 115th Martin of the 49th Smith of the\n133rd Newton of the 123rd, the bill relating to income taxes.\nHouse Bill 415 by Representative Blackman of the 146th Newton of the 123rd Stevens of the 164th\n930th Roads of the 120th will relate to alternative adjuvant tax on motor vehicles House Bill 416 by Representative Blackman of the 146th\nStevens of the 164th Roads of the 120th Newton of the 123rd night of the 130th the bill relates taxation of enhanceables House Bill 417 by Representative Blackman of the 146th\n6th Stevens of the 164th, Roads of the 120th night of the 130th and Newton of the 120th\nand Bill relating to the taxation of intangibles, House Bill 418 by Representative Blackman of the 146th.\nStevens of the 164th, Roads of the 120th, Newton of the 123rd, Williamson of the 115th,\nthe Bill relating to sales, to tax sales, House Bill 419 by Representative Blackman of the 146th,\nof the 164th Roads of the 120th Newton of the 123rd Williamson of the 115th\nof the 118th Motor Fuel and Road Taxes House Bill 420 by Representative Blackwin of the 146th\nStevens of the 164th Roads of the 120th Smith of the 133rd and Martin of the 49th\nof the Bill relating to taxes on tobacco and vaping products House Bill 421 by Representative Blackwin of the 146th\nStevens of the 164th Roads of the 120th Newton of the 123rd night of the 130th and others\nBill relating to matter fuel and road taxes House bill 422 by represent 930th roads of the 120th Stevens of the 164th\nSmith of the 133rd Martin of the 49th Bill relating to advalorem taxation of property\nHouse bill 423 by represent lack of the 146th Stevens of the 164th Newton of the 123rd roads of the 120th Smith of the 130th\nBill relating to taxes along tobacco and vaping products House bill 424 by represent Williamson of the 115th\npart of the 49th of the 133rd Newton of the 123rd Roads of the 120th will relate to income taxes House Bill 425 by\nreps of 9 with 130th Newt of the 23rd Roads of the 120th and Stevens of the 164th will relate to alternative Agilorm tax on motor vehicles House\nBill 426 by reps of 9 with 130th Roads of the 120th Stevens of the 164th Smith of the 133rd Martin of the 49th the bill related to tax sales\nHouse Bill 427 by represent 1930th roads of the 120th Stevens of the 160th floor Smith of the 133rd Martin of the 49th of Bill\nRelated to Evalor and taxation of property House Bill 428 by reps of Martin of the 49th Williams of the 115th Smith of the 133rd Newton of the\n123rd night of the 130th of Bill relates to sales and use taxes House Bill 429 by reps of Martin of the 49th Williams of the 115th Smith of the 133rd Newton of the\n123rd, 193rd, 130th, so bill related to sales and use taxes, House Bill 430 by Representative Powell of the 32nd Nicks of the 69th Collins of the 68th,\nEarhart of the 36th, Martin of the 49th and others, the bill related to nurses, House Bill 431 by Representative Jenner of the 85th Jackson of the 64th\nCouch of the 50th February of the 143rd, but now the 77th and others, the bill related to general provisions regarding conservation and natural resources, House Bill 432 by Representative Jenner of the 85th Jackson of the 64th Couch of\nthe 50th Beverly of the 143rd, but now the 77th and others are bill relating to conservation and natural resources.\nCus Bill 433 by Raphson McLaren of the 51st and Wilson of the 80th are bill relating to definitions in disposition of personal property and custody of law enforcement agencies.\nHouse Bill 434 by Raphson Powell of the 32nd jasper of the 11th Ballinger of the 23rd Hitchens of the 161st Taylor of the 173rd and others are bill relating to general provisions applicable to counties and municipal corporations.\nBill 435, by represent Anderson of the 10th gravely of the 67th poshman of the 141st plums and of the 12th Williams of the 145th.\nBill will aid to contracting and bidding requirements for public works.\nHouse Bill 436, by represent Bruce of the 61st Bayes, more of the 63rd.\nScofield of the 60th Jones of the 47th and Jackson of the 64th, the bill will aid to manufacturing.\nDistributing dispensing, possessing with intent to distribute control substances or marijuana in or within drug-free commercial zones.\nHouse bill force the 37 by reps of Howard of the 124th.\nBeverly of the 143rd scope, field of the 60th, Cooper of the 43rd.\nA bill relating to general provisions applicable to counties and municipal corporations.\nHouse bill 438 by reps of Kendrick of the 93rd.\nBeverly of the 143rd, Neil of the 74th.\nWe'll call into the 51st body of the 62nd and others.\nA bill relating to employment and training of peace officers.\nHouse bill 439 by reps of the 50th of the 161st.\nPlumson of the 12th Sains of the 180th.\nWilliams of the 145th and gravely of the 67th.\nthe bill relating to motor vehicles and traffic and interlock devices.\nHouse bill 440 by Reps of Holly of the 111th, Louis Ward of the 9th,\n109th, Wilkerson of the 38th, Douglas of the 78th, the bill relating to\nincorporation of municipal corporations, House bill 441 by Reps of Clark of the 98th.\nThe bill relating to income taxes, House bill 442 by Reps of Collins of the 68th,\nfrustration of 104th.\nAirheart of the 36th, Balancer of the 23rd,\ngravely of the 67th, the bill relating to domestic relations, House bill 443.\nby Representative Lebritt of the 33rd in Scotland's of the 14th, the bill relating to damages.\nHouse bill 444, by Representative Paris of the 142nd, Mitchell of the 88th, by Relay of the 143rd,\nwelcome to the 81st Taylor of the 173rd and others, the bill relating to public and legal holidays.\nHouse bill 445, by Representative Bruce of the 61st phase, more of the 63rd, Jones of the 47th,\nvoting of the 62nd, Martin of the 49th and others, a bill to amend and act to incorporate the City of South Fulton in Fulton County.\nbill 446 by reference to the tenor to the 102nd workers or the 157th voting of the 62nd win of the 89th Alexander the 66 and others bill relating to identification cards for persons without driver's licenses\nHouse bill 447 by represent night with 130th hatch of the 150th England with 116th Newton with 123rd bill related to state employees health insurance plan\nHouse bill 448 by represent night with 130th hatch of the 150th England of the 116th Newton of the 123rd bill related to medical assistance House bill 449 by represent Smith with the\n133rd, Parsons of the 44th Burns of the 159th Frazier of the 126th.\nBill will aid to blasting or excavating near utility facilities.\nHouse Bill 450 by reps of the 123rd hatchet of the 150th Cooper of the 43rd Hutchinson of the\n110th and the gains of the 117th, the bill will aid to the low THC oil patient registry.\nHouse Bill 451 by reps of Lumsland of the 12th Williamson of the 115th night of the 130th\nCarson of the 46th, Martin of the 49th, the bill will aid to property tax exemptions.\nHouse Bill 452 by reps of Jasper's in the 11th Williams of the 148 Smith of the 133rd Bentley of the 139th Burns of the 159th and others to build related to tax credits for class three rails railroads and reporting House Bill 453 by reps of McDonald to the 26th Ridley of the 6th quarter to the 17th month of the 17th Powell of the 32nd and others to build related to special license plates House Bill 454 by reps of Newton of the 123rd hatchet of the 150th Cooper the 43rd gains of the 117th Hopkins of the 27th of the bill related to online\nand provider directories, House Bill 455,\nby reps of bar of the hundred and third corporate\nof the 174th, Dickey of the hundred and 40th,\nJasper to the 11th, wind of the 89th,\nand others, bill related to elementary\nand secondary education, House Bill 456,\nby reps of Smith of the 18th,\nNix of the 69th, Collins of the 68th,\nBill to women in act, providing a lead charter,\nproviding for the Carroll County Board of Elections,\nHouse Bill 457, by reps of Jackson,\nof the 64th, Hopson of the hundred and 53rd,\nFraser of the hundred and 26th,\nHutchinson of the hundred and seventh,\nand Scott of the 76th,\nthe bill relating to general provisions,\nregarding alimony and child support.\nHouse bill 458 by reps of Cooper,\nthe 43rd, welcome to the 81st games of the 117th,\nNewton of the 123rd, Hawkins of the 27th.\nThe bill relating to physicians, physician,\nassistants, and others.\nHouse bill 459 by reps of Martin of the 49th,\nGems of the 47th, dollar of the 45th.\nThe bill relating to limitation on annexation.\nHouse bill 468 by reps of Martin of the 49th, Gems of the 25th,\nCanada of the 102nd, Carpenter of the 4th,\nEvans of the 83rd, the bill relating to restrictions\non the ownership, operation, or control of dealerships.\nHouse Bill 461 by Rep. Fleming of the 121st Jones of the 47th,\nRichard the 97th Williams of the 145th,\nthe Louch of the 160th,\nHammock the Bill relating to elections of primaries.\nHouse Resolution 144 by Rep. Williams of the 145th,\nResolution honoring the life and memory of Miss Katie Poff\nand dedicated in this section in her memory.\nHouse Resolution 145 by Rep. Williams of the 145th,\nResolution honoring the life of Mrs. Denette Odom Jackson\nand dedicating a bridge in her memory.\nHouse Resolution 146 by Rep. Park of the 101st,\nall over the second scope yield of the 60th,\ntrainer of the 85th, Clark of the 108th,\nand others are resolution creating\nthe House Study Committee on Adverse Child Experiences\nto improve the health of women and children.\nHouse Resolution 147 by reps of Howard of the 124th Jackson\nof the 128th, Bentley of the 139th,\nBeverly of the 143rd, scope yield of the 60th.\nResolution creating the House Study Committee on Abuse\nand disabled parking permits.\nHouse Resolution 148 by reps of the 12th Scotland's\nof the 14th, carbon of the 2nd, carbon of the 4th,\nRidley of the 6th Resolution Honorary, the Life and Memory of Pro-Mate Judge John Payne,\nDedicated to Intersection in his Memory, House Resolution 149 by Rex McClark of the 108th\nCouncil of the 50th, Evans of the 83rd, Buckner of the 137th Resolution, urging the 117th\nCongress on the Georgia Congressional Education to support the Carbon-Dividend Act.\nSenate Bill 32 by Senator Brass of the 28th, Robertson of the 29th, Burke of the 11th,\nAlbums of the 56th, Future of the 51st and others, the bill relating to when public\nThe disclosure not required.\nSenate Bill 33 by Senator Dixon of the 45th,\nhatchet of the 50th.\nMellissa of the 53rd Miller of the 49th Jackson\nof the 2nd Nothers,\nthe Bill relating to general provisions regarding torts.\nSenate Bill 34 by Senator Dixon of the 45th.\nHatchet of the 50th, Mellissa of the 53rd Miller\nof the 49th Jackson of the 2nd Nothers,\nthe Bill relating to name change.\nSenate Bill 49 by Senator Dixon of the 45th Miller\nof the 49th Anderson of the 24th Gutes\nof the 51st Duggan of the 30th Nothers,\nthe Bill relating to standards and requirements\nfor construction alteration of buildings\nand other structures.\nSenate Bill 86, my Senator Walker,\nthe third of the 20th,\nthe 54th, the 8th minute of the 4th.\nAlbers of the 56th, Thompson of the 14th and others\nare bill relating to the Fair Business Practices Act\nof 1975, three second readers.\nReports of standing committees, the clerk will read.\nRepresentative Robert ticking the 140th district chairman of the Committee on Agriculture and Consumer Affairs submitted the following report.\nAnd speaking to your committee on that culture and consumer affairs, has that under consideration the following bill of the House and instructing me to report the same back to the House with the same with the following recommendation House bill 342 due pass.\nRespectfully submitted, represented Robert Dickie, the 140th district chairman.\nRepresentative Don Parsons, the 44th district chairman of the committee on energy utilities and telecommunications submitted the following report.\nRespect your committee on energy utilities and telecommunications is in a consideration following bills of the house.\nInstructed me to report the same back to the house, following recommendations, House Bill 76 to pass, House Bill 152 passed by substitute, House Bill 328 to pass by substitute.\nrespectfully submitted, Representative Don Parsons, the 44th district, the chairman.\nRepresentative Tray Roads, the 120th district chairman on committee on game fishing parks in the following report.\nBut speaking of committee on game fishing parks, is that under consideration the following bill of the house.\nAnd it struck the media report, same back to the House of the following recommendations.\nHouse Bill 343, do pass by committee substitute.\nHouse Bill 362, do pass by committee substitute.\nrespectfully submitted.\nRepresentative Trey Rose, 120th District Chairman.\nRepresentative Cooper, the 43rd District Chairman\nof Committee on Health and Human Services submitted\nthe following report.\nWe speak to your Committee on Health and Human Services\nand under consideration of following bills\nand resolutions at the House and the Senate.\nAs a struck to meet your report,\nsame back to the House, the following recommendations.\nHouse Bill 245, new pass, House Bill 307,\nnew pass by Committee Substitute,\nresolution 52, new pass, Senate Bill 5,\npassed by committee substitute respectfully submitted represent of Cooper of the 43rd District\nChairman\nRepresentative Allen Powell the 32nd District Chairman of the committee and regulated industries submitted\nThe following report was speaking your committee unregulated industries has ended a consideration\nFollowing bills of the House and instructor meter reports same back to the House of the following\nRecommendations House bill 34 new pass House bill 68 new pass House bill 119 new pass House bill 124 new pass\nHouse Bill 268, do pass by committee substitute, House Bill 273, do pass, House Bill 305, do pass\nHouse Bill 354, do pass by committee substitute, House Bill 395, do pass, respectfully submitted\nRepresentative Allen Powell, 36 district chairman.\nThat completes the reading of the reports of standing committees.\nYou\nYou\nAll right, we're going on to morning orders.\nWe are going on to morning orders.\nAll members will please take your seats.\nAll members is my microphone working.\nI really don't want members to have to shout over the den of noise out there to do a morning\norder.\nAll right.\nWe're going to limit morning orders today to one minute each.\nThe chair recognizes for a morning order chairman Sam Watson.\nThank you, Mr. Speaker.\nGot two quick things.\nI want to thank Chairman Dickie for reminding me that today is National Cabbage Day.\nSo in case you are wondering, Georgia farmers grow about 30,000 acres of Georgia grown cabbage\nthat produces about 61 million pounds of cabbage.\nSo eat more cabbage.\nBut also I want to thank the speaker and the governor and this body for the funding they\nprovided for the Georgia National Fairgrounds.\nThere's approximately 2,200 students and 3,000 to 3,000 animals that are headed to our\nstate fairgrounds as we speak, that are showing livestock as we speak.\nso thank you all for that. That's a great program and teaches a lot of\nresponsibility and great things, so thank you all. So what time will the\nslaughter dogs be ready? Chair recognizes representative Carpenter for a\nmorning order. Thank you, Speaker. So I got really excited about the\ncabbage myself because today is Georgia restaurant day. Guys, we're here to\nThis is normally the biggest event we have during session, but of course with cover. We're not able to\nSo we just want to talk for a minute about the importance of restaurants. We all know how important they are to your districts\nRestaurants before this pandemic was the second largest employer in the state of Georgia with over\n24.9 billion dollars worth of revenue\nWe've seen a decrease of about 20% in our industry and almost 20% of restaurants that you hold near and dear are closing\nSo today on Georgia Restaurant Day, we just asked that you go out get you something to eat\nTake a date take your friend by gift card. Whatever it takes to help support this industry. Thank you speaker and I yield the well\nChair recognizes\nRepresentative Sains and chairman Corbett\nThank you, Mr. Speaker.\nIt takes 350 miles to get to our great capital city\nfrom Kingsland, Georgia.\nSo when we make that trip, we make it count.\nNo clear example of this than the Camden County\nhigh school wrestling team.\nThrough the hard work and dedication\nof these fine student athletes,\nthey took home their seventh consecutive\nstate team championship earlier this month.\nAnd three days ago, they closed out\nas the seven A traditional state champions.\nWe appreciate your hard work, and we're proud of you.\nThank you.\nRepresentative Sains, yes, Mr. Speaker.\nSo there were other champions and other classifications\nlast week, were they're not?\nI believe so.\nAnd one of those is going to challenge you all.\nAnd that's the state champions of Fanon County,\nhigh school.\nI wish them a good luck they'll need it no wrong answer you can go chair\nrecognizes representative Paris for a morning order\nthank you mr. Speaker you all know I don't use the well for\nreally so please listen up. Today I would like to announce Miss Olivia Lee Code\nwho was born on February the 13th 1921 in Macon, Georgia. You all do the math.\nYou know that means she's a hundred years old. We have a centenarian in Macon\nBip County. She was a homemaker over 75 years blessed with three children who\nWe love and adore her, six grandchildren,\nsix great-grands and one great-great-grand.\nShe has a zest and love for life.\nShe was active in the Civil Rights Movement,\nhas been affiliated with several organizations\nthroughout her lifetime for more than 50 years.\nShe's a member of Lizzie Chapel Baptist Church,\nthe Social and Savings Club.\nBut I wanna make note of this right here,\nand I see the light, Mr. Speaker.\nShe, Mrs. Code, did not reach this milestone without enduring a series of challenges.\nShe has survived cancer three times and is now rehabbing from COVID-19.\nYou all learn to live well and stay powerful, my people, stay powerful.\nChair recognizes representative Hutchinson for a morning order.\nGood morning, colleagues.\nToday I bring to you Brianna, also known as Bri.\nBrianna is a happy girl who enjoys life.\nShe shows joy through laughter, smiles, sounds, and gestures.\nShe enjoys having people talk to her, listening to any type of music that has a good beat,\nand life in general.\nColleagues, I bring to you, Rihanna, today, to emphasize how many medically fragile\nchildren we have ready for adoption in the state of Georgia.\nAlthough medically fragile children take extra effort, they return your rewards a thousand\ntimes over in the love that they show. Thank you, Mr. Speaker. I'll yield the\nwell. Chair recognizes representative Carter for a morning order. Thank you\nSpeaker. Good morning. Today in our moment in black history, I want to\nintroduce to some and bring to remembers to others Mr. Prince Hall a\na forgotten, bounding father.\nPrince Hall, a free African-American\nand a contemporary of John Adams\nfrom his formal acquisition of freedom in 1770\nuntil his death in 1807, Hall helped forge\nan activist black community in Boston\nwhile elevating the calls of abolition to new prominence.\nHall was the first American to publicly use\nthe language of the Declaration of Independence\nfor a political purpose other than justifying war\nagainst Britain.\nIn January 1777, just six months after the promulgation\nof the Declaration, and nearly three years\nbefore Adams drafted the state constitution,\nHall submitted a petition to Massachusetts legislature.\nWe will share this letter with you,\nand for his activism and his cause,\nHe should be considered as a founder of our nation.\nThank you, Mr. Speaker.\nI hear the word.\nWe are about to go on to the rules calendar.\nWe are about to go on to the rules calendar.\nChair, we'll ask all members to please take your seats.\nGive attention to the members and the well as they give\nexplanations of their proposed legislation.\nThe clerk will read the caption to House Bill 287.\nHouse Bill 287 by Representative Rich.\nIn the 97th and others to be entitled an act to amend our Part\n2 of Article 6, Chapter 2 of Title 20,\nfiscal to George Anatetti relating to\ncompetencies and core curriculum\nso it's to include tobacco and\nvapor products in course instruction\nMs. Belenberg for the Committee on\nEducation and Committee recommends\nthat this bill do pass.\nChair recognizes the chair of the\nlegislative and congressional\nreapportionment committee,\nChairman Rich, to present the bill.\nThank you, Mr. Speaker and my\ncolleagues.\nToday I bring to you House Bill 287,\nwhich is a continuation of my efforts\nto curb the teen vape epidemic that we have\nbeen enduring for the last few years.\nIt's a small but very powerful part.\nHey, HB287 simply adds vape and tobacco\nto the drug and alcohol instruction\nthat we are already providing in our K through 12 schools.\nIt does not include any additional requirements on any particular teacher or school system.\nThis will, curriculum will be developed by the state.\nAnd at this time, Mr. Speaker, I will yield to any questions.\nYou do not appear to have any questions.\nThank you.\nI would appreciate your favorable vote on this bill.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nprevious question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of House Bill 287 will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nAll members voted have all members voted if so, the clerk will lock the machine\non the passage of House Bill 287.\nThe eyes are 156.\nThe nasors zero.\nThis bill having received the requisite\nconstitutional majority is therefore passed.\nI'll read the caption to House Bill 90.\nHouse Bill 90 by Representative Williams in the 115, burns the 159th and others to be\ntitled an act to amend Article 3 of Chapter 12, the title 51 of the Fisher go to George\nAntietta, relaying the damages for conversion of timber so as to provide that certain persons\nfirms or corporations who are buyers of land for conversion of timber shall be\nextended from certain liabilities. This bill ever further committee on\njudiciary. Now committee recommends a disbilled to pass by committee substitute.\nChair recognizes representative Williamson to present the bill. Thank you Mr.\nSpeaker. Members of the House I bring for your consideration today House bill 90\nby committee substitute LC 4128878. This bill just simply clarifies that the\nUniform commercial code covers severed timber in Georgia. It's just clarifying it comes with the full endorsement and support of the Georgia Forestry Association as well as the Georgia Bikers Association.\nWe have to answer any questions.\nIt appears that you have a question if you yield.\nYes sir, all you yield.\nChair recognizes representative McLaren to your left up in the gallery for a question.\nYes, sir. Well gentlemen, you'll be happy to\nRepresented is it not true that this bill is a common sense response to\nThe revelation that there might be liability for buyers of timber that we didn't previously know existed as well stated\nThis deal I'd incidentally this came through\nThe judiciary committee that was very interesting to carry a bill through mr. Speaker\nDidn't know I was going to be carrying anything any bills through judiciary\nbut they were very kind and very thoughtful.\nIt did come out unanimously and the gentleman knows\nof what he speaks.\nThank you.\nMr. Speaker, there's no more further questions.\nI yield the well and ask the favourable consideration\nof this body.\nYou have no further questions.\nThe gentleman has yielded the well.\nIs there any objection to the previous question being ordered?\nThe chair here's none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none of the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nThe chair here is none of the report of the committee.\nIs agreed to shall this bill now pass all those in favor of the passage of House Bill 90?\nWill vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nYou\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines on the passage of House Bill 90.\nThe eyes are 165.\nThe nasa zero, this bill having received the requisite constitutional majority, is therefore\npassed.\nClerk will read the caption to House Bill 154.\nHouse Bill 154 by members that have reached 34th and others, being titled an act to amend\nTitle 19 in the fiscal to Georgia and Entetter relating to domestic relations.\nSo it's to strengthen, clarify and update provisions relating to the protection of children.\nThe Chair recognizes representative Reeves to present the bill.\nThank you, Mr. Speaker, colleagues, members of the House.\nIt's been five years, Mr. Spakers, since this house started leading on the issue of adoption and foster care reform.\nAnd we have, frankly, over the last five years, what we've seen is a synergy developing this building from our friends across the hall and\nthe Senate into the governor's office of continuing to build on the platform of making adoptions easier in Georgia and\ntrying to improve our foster care system and trying to create an environment where our foster kids can be more easily\nadopted. And what's great about this, we brag about a lot of things. This is\nsomething we don't brag enough about is that what we have done, if you take all\nof these separate measures for the last five years and put them together, we have\nincreased the number of adoptions that have been in Georgia and we have\nsubstantially decreased the number of children that are in foster care. And that\nis something that every single person in this body should be extremely proud of.\nWe have been changing lives, and in some cases saving lives.\nAnd this bill here, House Bill 154, is almost identical to what this body passed last year.\nIt was House Bill 913, it was passed by the House.\nAnd it was when we came back from the COVID break, like a lot of matters.\nIt was elected to focus on other things, and we did not take this up.\nSo this bill is pretty much substantially the same bill as last year.\nit has four additional clarifications\nthat are simply technical clarifying things\nthat would, I would say, relate to our efforts\nof efficiency on this issue.\nThis bill has been worked on by the Georgia Council\nof Adoption Lawyers.\nIt's had the input of the judiciary,\nof practitioners, and et cetera.\nAll of the players have been involved with this.\nAnd Mr. Speaker, at this time,\nI'll be happy to yield for any questions on this.\nYou do not appear to have any questions.\nThank you, Mr. Speaker.\nI will yield the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none of the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none of the committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe chair here is none of the report of the committee.\nis agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no,\nand the clerk will unlock the machines.\nHave all members voted?\nHave all members voted.\nIf so, the clerk will lock the machines.\nOn the passage of House Bill 154, the eyes are 160.\nThe nays are four.\nbill having received the requisite\nconstitutional majority is therefore passed.\nClerk will read the caption to House Bill 282.\nHouse Bill 282, members, on a mix of 178th to be entitled to an act to amend Article 13 to\nChapter 5 of Title 48 of the fiscal to Georgia and to relay an ad ballorum taxation of\nqualified timberland property.\nThis bill ever for the committee on ways and means that committee recommends that this\nbill do pass by committee substitute. Chair recognizes representative Steven\nMeeks to present the bill. Thank you, Mr. Chairman. Good morning, ladies and\ngentlemen. I'm bringing to you House bill 282. House bill 282 is legislative\nlegislative intent bill that makes some housekeeping changes to rules and\nregulations for the department at the hospital 282 is referring to the\nqualified timberland property which was passed by unanimous a unanimous\nvote under a constitutional amendment of HR 51 in 2018 with the enabling\nlegislation being House Bill 85 carried in this body by the late Chairman\nJ. Powell. House bill 282 does three things. It defines the definition of\ncontiguous, meaning that if you want a piece of property that has a has common\nownership on both sides of a road or railroad track where we just let it be\nknown that that is defined as a contiguous piece of property it gives a\nqualified landowner a one-time opportunity to make that declaration. Second\nthing this does is that it says that the the way we're going to value this\ntimberland property for the purposes of out of a room taxes will be the same\nway that Cuba and Flippa are done in a 65-35 market and income evaluation approach.\nThird thing this piece of legislation does, Mr. Speakers, it says that the tax commissioner\nwill accept a county map drawn by the cryptographer in the county or a GIS technician and then signed\nby the county board of assessors and the qualified landowner for that piece of property.\nSo Mr. Speaker, those are the provisions of HR 282 and I will entertain any questions\nif we have any.\nYou do not appear to have any questions.\nThank you, Mr. Speaker.\nI appreciate your attention.\nAsk for a favorable consideration of House 282.\nIs there any objection to the previous question being ordered?\nThe Chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe Chair here is none.\nThe committee's substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill, will vote aye\nof those opposed to vote no, and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machine on the passage of House Bill 282.\nThe eyes are 163.\nthe nasor zero, this bill having received the requisite constitutional majority is there\nfor past.\nThe clerk will read the caption to House Bill 130.\nHouse Bill 130 by the way, go over the 19th and others to be entitled back to amend\nChapter 60, Title 36, the official go to George annotated relating the general provisions\nof applicable counties and municipal corporations so as to find the term fence detection system\nthis bill ever referred to the committee on government affairs that committee\nrecommends that this bill do pass. Chair recognizes representative Gullet to\npresent the bill. Thank you Mr. Speaker. House Bill 130 is a bill that this\nbody passed last year but because of COVID we couldn't get it done in the\nSenate. This is a bill that brings uniformity to the permitting process for\nbattery-powered alarm security fences that are designated as non-residential. This bill\nwould authorize the permitting of battery-powered alarm security fences as burglar alarm systems.\nThis would streamline the process for permitting and registration in accordance to local\nlaws and allow businesses to protect their assets and property in a timely manner. Today,\nvariants can take months or years, and if you have property that you want to secure,\njust not acceptable. We've worked with GMA and ACCG in the language of the\nbuild this year and they're good with the legislation as written. Mr. Speaker if\nthere any questions I'd be happy to take them otherwise I'd ask for your\nfavorable consideration of House Bill 130. You do have a question or two do you yield?\nI do. Chair recognizes representative Shannon up in the gallery to your right.\nThank you Mr. Chair. Is the speaker yield? I do. Thank you. Republicans frequently\ntalk about how local control is always the best for decisions, for most decisions. Sometimes\nI agree, sometimes I don't, but the bottom line is these are your values not necessarily\nalways ours. In this case, my question is why does this bill include preemption? Why are\nlocalities not able to say that they don't want these types of fences in their community?\nThose are the final lines in the bill where it talks about basically it's just preemption\ncalls that cities and localities cannot pass any type of\nordinance that would prohibit these fences.\nThank you for your question.\nRight now, variances, so a lot of times if you want to\nprotect your property, you normally go to the max size of\na fence that you can get in that property.\nSo if a city has a 10 foot maximum, a lot of times that's\nwhat you'll build, because that's what you have.\nIf you want an electric fence, there's a requirement that\nit's got to be two feet taller than the tallest fence.\nSo if I have a 10 foot variance in the city's max,\nthis would allow, there's a process\nthat you would go through that takes time.\nSometimes it's six months, it could be over a year.\nI think ACCG and GMA are neutral to the language,\nwhich just says a lot, we restricted it from last year,\nbut then being given the bill, I don't see this as a problem.\nDoes the speaker yield for more questions?\nI do.\nOK, so I'm going to restate my question\nbecause this isn't about sizing and the process\nof how you get these fences approved.\nMy question is very directly,\nwhy does this bill include preemption?\nBecause even if once they get through the process,\nyour bill says that if a community decides\nthey don't want electric fences in their community,\nthey can pass no legislation, no ordinance\nor anything that would prevent these fences\nfrom existing in communities.\nSo I think it's key to say that you're saying\nelectric fences, that's not quite clear.\nIt's a battery powered electric trans security system,\nit's an alarm system.\nSo it's 12 votes, it doesn't actually,\nit gets you off the fence, but it doesn't hurt you.\nIt sends a alarm call to the police department.\nIt's an alarm system, not a electric fence system\nthe way you're describing it.\n12 votes, is this three votes more than the battery\nas you touch with your tongue?\nTo see if it still has a valid battery.\nSo it's not gonna shock you, it's gonna get you off the fence,\nbut it's not gonna hurt you in any way.\nSo, you know, from a freedom shift standpoint,\nthat this is a way for property owners\nto protect their property.\nThank you.\nThank you.\nDo you owe for another question?\nI'll you owe for one more.\nChair recognizes Chairman Jay Collins\nto your left for a question.\nIs it gentlemen, you?\nI do for my friend.\nIs it not true that I spent a good bit of time\nin local government before I came up here to the house?\nI know that to be true.\nAnd I have a love for the heel.\nI do.\nI have a love for a local government, is that not true?\nI believe that to be true.\nAnd my only concern about this bill was that we're limited\ninto 12 votes and not making it more like 120 votes.\nIs that not true?\nIf the gentleman's those states, I think this is really\na battery powered bill that 12 votes is a humane way\nto get someone off that fence.\nBut thank you for your question.\nMr. Speaker.\nYou wouldn't touch 100 and something\nvote battery to your tongue to check it, would you?\nNo, sir, I would not.\nAnd with that, I ask for your favorable consideration.\nI'm going to yield the will.\nThank you.\nIs there any objection to the previous question\nbeing ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing\nto the report of the committee, which\nwas favorable to the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage\nthe bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nall members voted. What purpose does\nrepresentative Sainz rise?\nParliamentary inquiry. Is it not true\nthat this bill it combats the rising\ncrime epidemic that is unfortunately\nprevalent in many areas of this state\nto ensure that there's a self\npreservation that businesses can\nprotect the property in which they\ninvested?\nWell, I think the motivation is\nsomething each and every member will\nhave to determine for themselves.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nOn the passage of House Bill 130, the eyes are 100, the nays are 63.\nThis bill having received the requisite constitutional majority is therefore passed.\nThe clerk will read the caption to a group of privileged resolutions honoring the life\nand memory of Margaret Harold Blitch honoring the life and memory of Douglas Doug Eugene Harris.\nRecognizing Scott Berry for an outstanding career, public service and leadership in the\nCounty County Sheriff for over 27 years, recognizing Ira Edwards for serving the Athens\ncommunity for two decades, a sheriff of Athens, Clark County.\nCongratulations, County State Bank for 60 years of operation\nserving the county community, commending Delta Sigma Theta\nsorority for its 108 years of service and recognizing March 11, 2021\nis Delta Day at the State Capitol.\nCongratulations, Gordon Lee Softball team for winning the 2021 GHSA\nclass a state softball championship, recognizing commanding\nhemophilia of Georgia and for other purposes that completes the reading of\nprivilege resolution.\nIs there any objection to adopting the privileged resolutions the chair here's none in the resolutions\nare adopted?\nWe're going on now to announcements if you have signed up for an announcement.\nyour way to the front of the chamber. Chair recognizes Representative\nGullet for an announcement. Chair recognizes Chairman Hatchett for an\nannouncement. Thank you, Mr. Speaker. The majority caucus will meet at noon\nat the Floyd Room at Twin Towers.\nName, lunch, and serve.\nChair recognizes Chairman Gerald Greene\nfor an announcement.\nThank you, Mr. Speaker.\nState properties meeting today in room 4.3 at 3.30.\nWe need all the members there, please.\nChair recognizes Chairman Jake Collins\nfor an announcement.\nThank you, Mr. Speaker.\nThe Public Safety Homeland Security Committee\nwill meet today at 1 o'clock in CLOB 506.\nMake sure and be there.\nWe've got bills are going to be voting out of committee.\nThank you.\nChair recognizes Chairman Lynn Smith for an announcement.\nThank you, Mr. Speaker.\nNatural Resource and Environment Committee.\nTomorrow morning, 8 o'clock, room 606 for two presentations.\nThank you.\nChair recognizes Chairman Warkhizer for an announcement.\nThank you, Mr. Speaker.\nThe Industry and Labor Committee will meet today at 3 o'clock in CLOB 506.\nThank you.\nChair recognizes Chairman Watson for an announcement.\nThank you, Mr. Speaker.\nSpeaker House preparation subcommittee general government will meet a three o'clock\ntoday 606 CLOB. Thank you. Chair recognizes representative Gullet for an\nannouncement. Thank you, Mr. Speaker. The government of affairs will be two o'clock\ntoday, 406 CLOB. Government affairs full committee room 406 in the CLOB. Thank\nThank you, Mr. Speaker.\nWe have no birthdays today and that completes the announcements.\nThe chair recognizes the majority leader of the House for emotion.\nMr. Speaker, I move to this house, stand adjourned until 10 a.m. Thursday, February 18th, 2021.\nMajority Leader has moved that this house be adjourned until 10 o'clock a.m. Thursday,\nFebruary 18th. All those in favor of that motion will say aye. Those opposed will say no.\nThe eyes appear to have it.\nThis house will be adjourned until 10 a.m. Thursday.\nYou\n",
  "updated_at": "2026-02-12T15:05:59.016023+00:00"
}