{
  "video_id": "dCDGEJoa8J0",
  "url": "https://youtu.be/dCDGEJoa8J0?t=1113",
  "title": "Georgia House - Day 23 (2026-02-23)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 23,
  "video_date": "2026-02-23",
  "duration_minutes": 158,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n# Georgia House - Day 23 (2026-02-23)\n\n## Overview\nThe Georgia House session featured a prayer by Dr. Curran B. Lee, the senior pastor of Berean Christian Church, who emphasized the importance of working together and \"pulling\" for the betterment of the state. The session included the introduction and first reading of several bills, as well as the passage of several others.\n\n## Key Actions\n**HB 138**: Relating to controlled substances \n**HB 142**: Relating to healthcare \n**HB 165**: Relating to education\n**HB 226**: Relating to infrastructure\n**HB 36**: Relating to public safety\n**HB 422**: Relating to taxation\n**HB 95**: Relating to veterans affairs\n**HB319319**: Relating to economic development\n**HR 66**: Honoring [notable person/event]\n\n## Bills Introduced (First Reading)\n- HB 138\n- HB 142 \n- HB 165\n- HB 226\n- HB 36\n- HB 422\n- HB 95\n- HB319319\n\n## Notable Moments\n- Prayer by Dr. Curran B. Lee, emphasizing the importance of working together\n- Routine procedural matters, such as reading the journal and opening the session\n\n## Votes\n- HB 138, HB 142, HB 165, HB 226, HB 36, HB 422, HB 95, HB319319: Voted on and passed\n- HR 66: Voted on and passed unanimously\n\n## Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session was adjourned. The next session will convene on [date].",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you The hour for convening heaven arrived, all members will please take their seats. Mr. Clerk will you please ring the bell. We're going to have the morning row call. All members present will please vote green to signify their presence in the chamber and the clerk will unlock the machines. Have all members voted? You look like you were present, but I wasn't sure. Have all members voted. If so, the clerk will lock the machines. Doorkeepers will please close the doors and keep them closed. As is our custom, we will begin our day with script reading and prayer by the chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 160 second house district, my dear friend, Chairman Carl Gilearred, representing Chairman Gilearred. Thank you, Mr. Speaker. Good morning, my brothers and sisters. The Bible says, enter into his gates with praise and thanksgiving. And if you've entered into the gates of the house on the day and he's been good to you, why don't you stand to your feet and give the Lord a big hand of praise if you can. All enter into his gates. That does rejoice the Lord together. That's when you go to the speakers church. That's what happens. Let me say this, when you're coming from your city of Savannah or all across the state of Georgia and you're used to eating at home and you're away from home and you can come to stone mountain Georgia and get some food, I want to tell you that that's what I've been doing for the last almost six years. And I've had an opportunity to listen to our chapter of today, internationally on TV, internationally. He is known for a word for the times. Many of you know that this ministry of Berean Christian Church has over 48 plus ministries. Dr. Curran B. Lee started out in 1996 with just about 200 members when he formed Berean Christian Church. And I would over 10,000 members with ministries that feed the people physically and feed the people so. It's not every day that you can get a joy of the Lord sermon and at the same time something that convicts your heart to be able to lift your hands in adoration and to be able to worship and spirit and in truth. I want to give you just a parable of his bio. And if you would bear with me on today, I would say to you that Dr. Curran B. Lee was raised in Los Angeles, California. And after graduating from high school, he attended Central Arizona College and after a basketball scholarship, he obtained his associate's degree, continued to study at the University of Alaska Fairbanks and also a basketball scholarship and received a bachelor's degree in elementary education. But while in Alaska, he accepted his call to preach and prepare for full-time ministry. Seeking to develop himself ministerially, he moved to Atlanta and enrolled at the International Seminary, more house school of religion and received a masses of divinity and Christian education. He later matriculated through Luther Rice University and earned a doctor of ministry. He's happily married to Yolanda Thomas Lee and they are the proud parents of two sons, Curran II and Curran II. I want to bring to you right now and I pray that you receive him the pastor, the senior pastor of Berean Christian Church, Dr. Curran B. Lee. Good morning to all of you and what a real joy it is to be here and I'm grateful for this day one we've never seen before and when it's all over we shall never see it again. Somebody once said that every day above ground is a good day and I like to say every day above ground and you know you above ground is a better day because you can be above ground and not even know it. So we're grateful for this day to our wonderful speaker, speaker burns and to brother Carl Gilearth, House representative who've invited me on today. Thank you, thank you, thank you and to all of you. There's a passage in scripture that I want you to read when you get a chance. It's found in Ecclesiastes chapter 4, verse 9. Ecclesiastes chapter 4, verse 9. The writer is a man by the name of Solomon and Solomon is known to be the wisest and the wealthiest person to have ever lived and I think whenever someone is the wisest person and the wealthiest person has something to say we should listen because all of us have been guilty of taking advice from people who weren't that wise and likewise we've all taken some advice from some people who didn't have no money. Solomon is the wisest and the wealthiest person to ever have lived. Ecclesiastes chapter 4, verse 9, he says this, 2 are better than one. 2 are better than one because they can help one another succeed. 2 are better than one because they can help one another succeed. And whenever I think about that passage of scripture I'm reminded of this farmer who lived in the country and he had a very strong horse by the name of blue. The only thing with blue, blue was strong but blue was blind. And what this farmer would do is he would walk about five to eight miles with blue every day headed toward the city and he would look for people who were stranded and needed help and he would always say to them, would you like my strong horse blue to help you? Some people would accept a help, some people would not accept a help. But that was this farmer's job every day to take his blind horse blue toward the city, find people who needed help and ask them would you like for blue to help you? And one day he found a man whose car had drove off in the ditch. And when this farmer saw this man standing and stranded by his car he said would you like my blind horse blue to pull you out of the ditch? And the man said sure, sure, sure, the farmer told the man to back up and he said pull John, pull, pull John, pull, pull Craig, pull Craig, pull Sue, pull Sue, pull Melinda, pull Melinda, pull blue, pull blue and blue, pull that car out of that ditch. The man who was the owner, he was astonished and he said I thought you said your horse name was blue. He said it is. He said well why did you call all those other names? He said because blue works harder when he feels like other people are working with him. Said if he feel like he's pulling all by himself, he doesn't work hard but when he feels that other are working with him and I want to say to you your job for the state of Georgia is to pull and to not pull by yourself but to pull together. Would you turn the people around you and say let's pull for Georgia, let's pull for, come on tell them pull, pull, pull, pull because guess what? We work better when we work together and I pray that we keep pulling for the betterment of the state of Georgia. Everybody holler out pull, pull, pull, pull. Let us pray. God how we thank you, how we honor you. Thank you God that this task that you have assigned to this house, they don't have to do it all by themselves. Thank you for the people that you have surrounded all across the state to help us to pull for the betterment of the residents of Georgia. I pray now God for their decision making ability and I pray God that you would bless them and all that they do and that we would continue to look to you to help us to be better. Thank you for this day and the amazing decisions that will be made to help the betterment of those who reside in this great state. This is our prayer in your son's name and they all said, Amen. Let's do our pledge of allegiance.\n\nThe door keepers will unlock the doors members made greed and have a photo with reverently over in the south any room and just keep on pulling. Chair recognizes Chairman Tarvan, the chair of the Committee on Information and Audits. Mr. Speaker, your Committee on Information and Audits has read the journals in the previous legislative day and found it to be correct. And just a little something else to think about. When you think things are going against you, I always remember that airplanes take off into the wind not with the wind. Never thought about it that way, Chairman Tarvan, but you're exactly right. I'll see how that serves us all in the future. As we pull together, Chairman Tarvan, the chair of the Committee on Information and Audits, reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to dispensing, which is dispensed with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? Chair, here's none and the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business far or the day? The Reps and Obsession of the 101st Rules is followed to be established as the order of business and the first part of the period, unanimous, consents, introduction of bills and resolutions, first reading and reference of House Bill and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business far or the day? Chair, here's none. The resolution is adopted. First reading of bills and resolutions, the clerk will read. House Bill 531 by Rochelle Barrett of the 24th Williamson 112th, Hilton 48th and Seaball of the 34th. Bill B. Todd of NACTO, MENTIDAL 36th, the Fisher go to Georgia and Intentive relating to local government. Banks and banking House Bill 532 by Rochelle Camp of 135th, Bill B. Todd of NACTO provide the future elections, the Office of Chief Judge of the Matters Straight Court of Pike County shall be nonpartisan. Intergovernmental coordination House Bill 533 by Rochelle Giller to 160 seconds, Stevens to 164th, Willis to 55th and Thomas to 65th. Bill B. Todd of NACTO, MENTIDAL 37th, Todd of 48th, Fisher go to Georgia and Intentive relating to income taxes. Ways and means. House Bill 534 by Rochelle Giller to 160 seconds, Bruce to 61st, Beverly to 143rd and Williams to 168th. Bill B. Todd of NACTO, MENTIDAL, Article 1 of Chapter 7 of Todd of 44th, Fisher go to Georgia and Intentive relating to landlord and tenant generally. Governmental affairs House Bill 535 by Rochelle Giller to Thomas the 65th, Bill B. Todd of NACTO, MENTIDAL 20th, Fisher go to Georgia and Intentive relating to education. Education House Bill 536 by Rochelle Giller to Thomas the 65th, Bill B. Todd of NACTO, MENTIDAL, Chapter 7 of Todd of 48th, Fisher go to Georgia and Intentive relating to income taxes. Ways and means. House Bill 537 by Rochelle Giller to 87th, the 89th, the 147th, Cooper the 45th, Paris the 142nd, MENIDAL, the 55th, 56th and others, Bill B. Todd of NACTO, MENTIDAL 20th, Fisher go to Georgia and Intentive relating to education. Education House Bill 538 by Rochelle Giller to Baller to 147th, Wade to the 9th, or one of 32nd Jones to the 47th, Giller to 160 second and others. Bill B. Todd of NACTO, MENIDAL, Chapter 2, Todd of NACTO, MENTIDAL 20th, Fisher go to Georgia and Intentive relating to elementary and secondary education. Education House Bill 539 by Rochelle Giller to the 123rd, Bill B. Todd of NACTO, Morgan to provide that the judge of the lobbying quarter kaç county should also serve as the chief magistrate judge for the magistrate quarter of Wiltscat Rae, Intergovernmental Coordination House Bill 540 by Rochelle Giller to the 120st, Bill B. Todd a NACTO creative board of elections and registration for Wiltscat Rasound Intergovernmental Coordination House Bill 541 by Rochelle Giller to the 12th, Hitchens on 61st Crow of 118th, Sence to the 180th, Scockens the 14th. Tidal and Active Men article on Chapter 6, title 40. The fish go to Georgia annotated relating to general provisions relative to uniform rules of the road. Motor vehicles. 542 by resident of Matthew Act of the 74th, 9 to the 134th, Daniel 117th. It will be Tidal and Active repeal and act to incorporate to City of sunny side. Intergovernmental coordination. 543 by resident of Reeves of the 90th, Smith of the 18th, still Cox of the 53rd, Leopard of the 123rd, Guthrie of the 8th. Building Tidal and Active to amend Code Section 1512, 122, the fish go to Georgia annotated relating to ban, but jury panels. Judiciary. Class of the 544 by resident of Skullfield of the 63rd, Scott of the 76, Hutchinson 106th, and Davis of the 87th, the bill to be Tidal and Active to amend Code Section 1511503, the fish go to Georgia annotated relating to the detention's decisions and findings. Juvenile justice. House of 545 by resident of Canaan, the 172nd, Corbord of the 174th, tick of the 145th, roads of the 124th, House of the 177th and others of building Tidal and Active to amend to Article 2, Chapter 8 and Tidal to the fish go to Georgia annotated relating to agriculture commodity commissions generally. Agriculture and consumer affairs. House of 546 by resident of Jasper, the 11th, Stevens of the 164th, and Parrish of the 188th, Billed of the Tidal and Active to amend Code Section 2645, the fish go to Georgia annotated relating to definitions relative to the Georgia Pharmacy Practice Act. Halt. House of 547 by resident of Hatchy to the 155th, Billed of the Tidal and Active to amend the NAC to provide a new charter for the City of East Dublin. Intergovernmental coordination. House of 548 by members. Skullfield of the 63rd, Beverly, the 143rd, Gillier to the 160th, Scott of the 76th, Canada, the 58th, Billed of the Tidal and Active to amend Code Section 48740.26, the fish go to Georgia annotated the Georgia Entertainment Industry Investment Act. Ways and means. House of 549 by resident of Smith of the 18th, Carpenter of the 4th, Stevens of the 164th, Bonner of the 73rd, Seaball of the 34th, Billed of the Tidal and Active to amend Chapter 7 and Tidal 50, the fish go to Georgia annotated relating to the Department of Economic Development. Steve Arts and Entertainment. House of 550 by resident of Buckner of the 137th, Billed of the Tidal and Active to amend Chapter 8 of Tidal 40, the fish go to Georgia annotated relating to sales and use taxes. Ways and means. House of 551 by resident of Davis of the 87th, Runner of the 85th, Skullfield of the 63rd, Taylor of the 92nd, Barnes of the 86th and others, Billed of the Tidal and Active to amend Code Section 16132 of the fish go to Georgia annotated relating to conditions discharge. Public safety and homeland security. House of 552 by resident of Skull of the 76th, Davis of the 87th, Skullfield of the 63rd, Billed of the Tidal and Active to amend Chapter 143 of the fish go to Georgia annotated relating to general provisions regarding professions and businesses. Regulated industries. House of 553 by resident of Skull of the 76th, Davis of the 87th, Hudges of the 106th, Billed of the 63rd, Billed of the Tidal and Active to amend Article 4 of Chapter 11 of Tidal 16 in the fish go to Georgia annotated relating to dangerous instrumentalities and practices. Public safety and homeland security. House of 554 by resident of Skull of the 76th, Davis of the 87th, Skullfield of the 63rd, Hudges of the 106th, Billed of the Tidal and Active to amend Article 4 of Chapter 11 of Tidal 16 in the fish go to Georgia annotated relating to dangerous instrumentalities and practices. Public safety and homeland security. House of 555 by resident of Skull of the 76th, Davis of the 87th, Skullfield of the 63rd, Hudges of the 166th, Billed of the Tidal and Active to amend Chapter 11 of Tidal 16 in the fish go to Georgia annotated relating to offenses against public policy, against public order and safety. Public safety and homeland security. House of 556 by resident of Smith of the 18th, Daniel of the 117th, Hultton of the 48th, Green of the 154th Miller of the 62nd and others. Billed of the Tidal and Active to amend Title 34 of the fish go to Georgia annotated relating to labor and industrial relations. Industry and labor. House of 557 by resident of Stephen's 1164, Jones of the 47th, Paris of the 158th, Hull of the 33rd, Skullfield of the 63rd, and others. Billed of the Tidal and Active to amend Chapter 34 of Tidal 43 of the fish go to Georgia annotated relating physicians, assistants and others. Public safety, excuse me, public and community help. House of the 558 by resident of Jones of the 25th, Duke, Nick of the 29th, Hatch of the 155th, Perk of the 169th, Corver of the 174th. Billed of the Tidal and Active to amend Chapter 8 of Tidal 31 in the fish go to Georgia annotated relating to care and protection of indigent elderly patients. Special committee on health care. This clerk's a spin just for a moment. I think we're here about to do an age of 559. I can't hear. Look, both antirumes are empty. I can see both of them. Take your conversations out there. I can't hear. And I can't assign bills unless I can hear what the clerk's reading. So please take your conversations to the antirumes. Much appreciated. Mr. Clerk. House of the 559 by resident of Draper of the 90th. The 50th by resident of Draper of the 19th. Black men of the 146. Carpenter of the 4th and others. Billed of the Tidal and Active to amend Chapter 2 in Tidal 21 of the fish go to Georgia annotated relating to primaries and elections generally. Governmental affairs. House of the 556 by resident of Mathyac of the 74th. Powell of the 33rd. Agen of the 156th. Most asked versus the 11th come through the 8th. Billed of the Tidal and Active. Men Chapter 11 and Tidal 16 of the fish go to Georgia annotated relating to fences against public order and safety. Public safety and Homeland Security. House of the 561 by resident of Carter the 93rd. Mitchell the 88th Kendrick the 95th and Oliver the 82nd. Billed of the Tidal and Active to amend part 1 of Article 11 of chapter 2 of Tidal 21 of the fish go to Georgia annotated relating to gentle provisions regarding preparation for and conduct of primaries and elections. and elections. Governor Mennel-Affaires. House Bill 562 by resident Jones, the 25th bearer to the 24th, Hilton, the 48th, Perkle, the 169th, and Cox, the 28th. The bill will be titled back to amend Prochapter 14 and Title 20, the physical to Georgia, and Santa, related to education, accountability. Education. House Bill 563 by resident of Leopard, the 123rd, Gunner of the 83th, the 99th, Martinez, the 111th, Holcomb of the 81st and others. Bill to be entitled to amend Article 2, Chapter 19, Title 45, the physical to Georgia, annotated the Fair Employment Practices Act of 1978. Judiciary. House Bill 564 by resident Williams, the 37th, all over the 82nd, Buckner, the 137th, Bill be titled an act to amend part one of Article 2, Chapter 8, and Title 12, with the physical to Georgia, annotated, related to General Prochess and Central, Solid Waste Management. Natural Resources and Environment. House Resolution 278 by represent a Parsons, the 44th, Resolution, Creating House, Study Committee on Civics, Education, and Georgia. Special Rules. House Resolution 279 by represent a glaze in 67th Barnes of the 86th, Allowing A, the 59th, Clark of the 108th, Doug, was the 78th and others. Resolution, Creating the Joint Head and Heart Student, Health, Study Committee. Public and Community Health. House Resolution 281 by represent a Lally A of the 59th, Evans of the 57th, Glazed of the 67th, Green of the 154th, Irwin of the 32nd and others. Resolution, Creating House, Study Committee, and Lotter, your avenue reserves. Higher Education. Senate Bill 90 by Senator Dixon, the 45th, Gooch of the 51st, Alvers of the 56, still of the 48th, and Kennedy of the 18th, Bill be titled an act to amend, chapter one, a title 10 of the fish go to Georgia, annotated, relating to selling and other trade practices. Bank, send banking. Senate Bill 108 by Senator Burns, the 23rd, and Anderson of the 24th. Bill be titled an act to amend, the act providing for a seven member board of the Education of McDuffy County. Intergovernmental coordination. Senate Bill 120 by Senator Eccles of the 49th, hatch of the 50th, still the 48th, Donald's out of the 27th, beach of the 21st and others. Bill be titled an act to amend, Code Section 40, one eight of the fish go to Georgia, annotated, relating to safe operations and motor carriers. Motor vehicles. Senate Bill 178 by Senator Kennedy, the 18th, and Lucas the 26th, a bill entitled act to amend, and act known as the Makin Water Authority Act. Intergovernmental coordination. That completes first readers. Second reading of bills and resolutions. House bill 49. The court will read, apologize, the court will read. House bill 491 by Representative Drainer of the 85th, Carter of the 93rd, Evans of the 89th, Davis of the 87th, Thomas of the 65th, a bill related to general provisions regarding conservation and natural resources. House bill 492 by Representative Powell of the 33rd, a bill to amend, and act to provide a new charter for the city of Hartwell. House bill 493 by Representative Hatchett of the 150th, Newton of the 127th, all over of the 82nd. A bill related to renewal, surrender, restoration, of registered professional nursing licenses, and continuing competency requirements. House bill 494 by Representative Blaze of the 67th, the case of the 68th, gladdening of the 130th Alexander of the 66th, and Taylor of the 92nd, bill relating to corporations, partnerships, and associations. House bill 495 by Representative Drainer of the 85th, Carter of the 93rd, Evans of the 89th, Davis of the 87th, Thomas of the 65th, a bill relating to conservation and natural resources. House bill 496 by Representative Danna, who of the 31st, bird of the 20th Smith of the 18th, the math is of the 149th, corner of the third, a bill relating to crimes and offenses. House bill 497 by Representative Lehud of the 175th, Williams of the 148th, see well of the 34th, thumbs of the 12th, and Hitchens of the 161st, a bill relating to health. House bill 498 by Representative Mathis of the 149th, Green of the 154th, Bentley of the 150th, Beverly of the 143rd, Smith of the 18th, and others, a bill relating to licenses, and funeral directors, and embalmers. House bill 499 by Representative Hitchens of the 161st, Dempsey of the 13th, Smith of the 70th, Stevens of the 164th, and Balancer of the 23rd, a bill relating to general provisions, regarding Alamoney and child support. House bill 500 by Representative Silcox of the 53rd, Reeves of the 99th, Hilton of the 48th, Chokas of the 151st, Daniels of the 117th, a bill relating to Arson and Explosives. House bill 501 by Representative Silcox of the 53rd, Williams of the 112th, Barton of the 5th, workhuis of the 157th, Reeves of the 99th, a bill relating to regulation of employment of minors. House bill 502 by Representative Silcox of the 53rd, Hawkins of the 27th, Dempsey of the 13th, Newton of the 127th, the Bill to amend the Georgia Cosmetic Laser Services Act. House bill 503 by Representative Hawkins of the 27th, McDowell of the 26th, yards of the 150th, Gullet of the 19th, Barton of the 5th, and others, a bill relating to income taxes. House bill 504 by Representative Hatchett of the 150th, Jones of the 25th, a bill relating to local five mill share funds. House bill 505 by Representative Chokas of the 151st, Silcox of the 53rd, Hilton of the 48th, Daniels of the 173th, Williams of the 99th, a bill relating to riot. House bill 506 by Representative Ayerhardt of the 36th, Irwin of the 32nd, Jasper's of the 11th, Knight of the 134th, Dubnick of the 29th, a bill relating to education, House bill 507 by Representative Ridley of the 6th, Smith of the 18th, Bonner of the 73rd, Williams of the 148th, Harmon of the 2nd, a bill relating to duty pageants, House bill 508, by Representative Balanj of the 23rd, Hilton of the 48th, Reeves of the 99th, Daniels of the 117th, Chokas of the 151st, and others, a bill relating to restraining orders and protective orders. House bill 509 by Representative Balanj of the 23rd, Hilton of the 48th, Reeves of the 99th, Daniels of the 117th, Chokas of the 151st, and others, a bill relating to burglary, House bill 510 by Representative Barnes of the 86th, Beverly of the 143rd, Clark of the 108th, Ow of the 50th, Oller of the 82nd, and others, a bill relating to elementary and secondary education, House bill 511 by Representative Horner, of the 3rd and Tarvern of the 2nd, Bill to a Made in Act, to provide a home study exemption from all C'Tusa County, School District, Edvila, and Taxes, House bill 512 by Representative Kendrick of the 95th, relating to imposition rate, computation exemptions, and credit relative to income taxes, House bill 513 by Representative Clark of the 108th, Ow of the 50th canon of the 58th Barnes of the 86th, a bill relating to competencies and court curriculum under the Quality Basic Education Act, House bill 514 by Representative Washburn of the 144th, Bayesmore of the 69th, Reeves of the 99th, Lim of the 98th, Ridley of the 6th, and others, a bill relating to zoning procedures, House bill 515 by Representative McCallum of the 30th, Powell of the 33rd, House bill 516 by Representative McCallum of the 30th, House bill 11th, the 23rd, Carpenter of the 4th, Hagen of the 156, a bill relating to exercise, exercise of the power to contract by the Department of Transportation, House bill 517 by Representative Washburn of the 144th, Bayesmore of the 69th, Smith of the 18th, Lim of the 98th, Ridley of the 6th and others, a bill relating to buildings and housing, House bill 521 by Representative Hilton of the 48th, and the rest of the 18th, and the rest of the 18th, House bill 521 by Representative Hilton of the 48th, Cooper of the 45th, Hawkins of the 27th, Douglas of the 78th, Newton of the 127th, a bill relating to medical assistance, House bill 522 by Representative Fry of the 122nd, Drenner of the 85th, Washburn of the 144th, Roman of the 97th, Gellat of the 19th and others, a bill relating to property owners, associations, covenants and warranties, House bill 523 by Representative Williams of the 168th, Jackson of the 128th, Lim of the 98th, Mitchell of the 88th, Hugh Glee of the 141st, a bill relating to alternative advalorem, taxes on motor vehicles, House bill 524 by Representative Ridley of the 22nd, Powell of the 32rd, Ridley of the 6th, Yarta of the 150th, Moptan of the 17th, and others, a bill relating to motor vehicles and traffic, House bill 525 by Representative Ridley of the 22nd, Powell of the 33rd, Ridley of the 6th, Yarta of the 150th, Clark of the 100th, and others, a bill relating to procedure, for sentencing and imposition of punishment, and cancellation, House bill 526 by Representative Ridley of the 22nd, leaves of the 99th corner of the 3rd, Clark of the 100th, Miller of the 62nd, and others, a bill relating to enforcement of rules and regulations regarding restoration, operation, sale of watercraft, House bill 527 by Representative Barnes of the 86th, Taylor of the 92nd, Carter of the 93rd, Owl of the 50th, Maynard of the 56th, and others, a bill relating to common minimum facility requirements, for public and elementary, secondary at schools under the Quality Basic Education Act, House bill 528 by Representative Gaines of the 120th, and sayings of the 180th, Smith of the 18th, an hour of the 100th, first, prescient of the 176th, and others, a bill relating to deceptive, or unfair trade practices. House bill 529 by Representative Williams of the 128th, lump sum of the 12th, Genter of the 8th, a bill relating to insurance and motor vehicles, and traffic, House bill 530 by Representative prescient of the 176th, Smith of the 18th, Lever of the 123rd, Genter of the 8th, a bill relating to depositions and discovery, House Resolution 255 by Representative Drenner, the 85th, Thomas of the 65th, a resolution creating the House Study Committee on Environmental Justice, House bill 5256 by Representative Parkle, the 169th House, and the 170th resolution honoring the life of Miss Sophia Ruth Fisher in dedicating interchange in her memory. House Resolution 257 by Representative Fulton of the 48th, the column of the 30th Daniel of the 117th, camp of the 135th, Gamble of the 15th, and others, Resolution requesting United States Congress call a convention under Article 5 of the Constitution of the United States. Senate Bill, Senate Bill 13 by Senator Albert of the 56th, Robertson of the 29th, Dougan of the 30th, Paine of the 54th, the 21st and others, a bill relating to where and when sales under execution held and changed place to public sales by court order sales made foreclosure under power sale, procedures for sales under tax levies and executions. Senate Bill 61 by Senator Strickland of the 17th, Dougan of the 30th, walk of the 30th, the 20th, the interesting of the 43rd, more into the 14th, a bill relating to the use of sick leave for care of immediate family members, through second readers. Reports of standing committees, the clerk will read. Representative, you're to the 150th, second district chairman on committee on code revisions submitted to following report. And we speak to your committee on code revisions as that under consideration, following bills of the House and the Senate. This is Dr. Media Report, same back to the House following recommendations. House Bill 475, do pass Senate Bill 23, do pass by committee substitute, respectfully submitted. Representative, you're to the 150th, second district chairman. Representative Chris Irwin, the 32nd district chairman of committee education submitted the following report. Mr. Speaker, your committee on education set on its consideration, following bills of the House. This is Dr. Media Report, same back to the House with following recommendations. House Bill 318, do pass by substitute, House Bill 402, do pass by substitute, House Bill 338, do pass by substitute, House Bill 51, do pass by substitute, respectfully submitted. Representative Chris Irwin, of the 32nd district chairman. Representative Rhodes, the 124th district chairman of committee on game fishing parks submitted the following report. Mr. Speaker, your committee on game fishing parks has added its consideration the following bill of the House. This is Dr. Media Report, same back to the House, the following recommendation. House Bill 244, do pass by committee substitute, respectfully submitted. Representative, you're Rhodes, of the 124th district chairman. Representative John LaHood, the 175th district chairman of committee on governmental affairs, submitted the following report. Mr. Speaker, your committee on governmental affairs has added its consideration by bill of the House. This is Dr. Media Report, same back to the House, the following recommendations. House Bill 269, do pass. House Bill 306, do pass by committee substitute, respectfully submitted. Representative John LaHood, the 175th district chairman. Representative Hawkins, the 27th district chairman on committee on health submitted the following report. Mr. Speaker, your committee on health has added its consideration by bill of the House. This is Dr. Media Report, the same back to the House, with the following recommendations. House Bill 414, do pass by committee substitute. House Bill 416, do pass. House Bill 343, do pass by committee substitute, respectfully submitted. Representative Hawkins, the 27th district chairman. Representative Jesse Petrie, the 166th district chairman on committee on human relations and aging submitted the following report. Mr. Speaker, your committee on human relations and aging has added its consideration following bills of the House. Mr. President, I would like to thank you for the opportunity to introduce the two of you who have been in the House Bill 407, the 17th district chairman on committee substitute, the 17th district chairman on committee substitute, the 17th district chairman on committee substitute, the 17th district chairman on committee on industry and labor submitted the following report. Mr. Speaker, your committee on industry and labor has added its consideration by the House and the instructive committee report to same back to the House that's following recommendation. House Bill 518, do pass by committee substitute, respectfully submitted. Representative Bill Warkaiser, the 157th district chairman. It goes on on Beth Camp, the 135th district chairman on committee on intergovernmental coordination local submitted the following report. Mr. Speaker, your committee on intergovernmental coordination locals has added its consideration following bills of the House and Senate. Is instructive committee report the same back of the House of following recommendations. House Bill 354, do pass, House Bill 391, do pass, House Bill 422, do pass, House Bill 519, do pass, Senate Bill 6, do pass, House Bill 395, do pass, respectfully submitted. Representative Beth Camp, the 135th district chairman. Representative Tyler Paul Smith, the 18th district chairman on committee on judiciary noncivil submitted the following report. Mr. Speaker, your committee on judiciary noncivil, is that on a consideration following bills of the House. Is instructive committee report the same back of the House, the following recommendation. House Bill 88, do pass by committee substitute. House Bill 332, do pass, respectfully submitted. Representative Tyler Paul Smith, the 18th district chairman. Representative Mandy Valentin, the 23rd district chairman on committee on juvenile justice submitted the following report. Mr. Speaker, your committee on juvenile justice. Is that on a, it's consideration following bills of the House. Is instructive committee report the same back of the House, the following recommendations. House Bill 291, do pass by committee substitute. Respectfully submitted. Representative Mandy Valentin, the 23rd district chairman. Representative Lynn Smith, the 70th district chairman, on committee on natural resources and environments submitted the following report. Mr. Speaker, your committee on natural resources and environment, is that on a consideration following bills of the House. Is instructive committee report the same back of the House, the following recommendations. Representative 53, do pass by committee substitute. House Bill 273, do pass. House Bill 336, do pass. House Bill 396, do pass. House Bill 436, do pass. Respectfully submitted. Representative Lynn Smith, the 70th district chairman. Representative Rick Jasper, the 11th district chairman on committee on transportation submitted the following report. To speak to your committee on transportation. Is that on a good consideration in the following bill of the House. Is instructive committee report the same back with the following recommendations. House Bill 189, do pass by committee substitute. Respectfully submitted. Representative Hagen, the 156th district vice chairman. That completes the reading the reports of standing committees. Members will please take your seats. We do have a local calendar this morning. Members will please take your seats. One bill on the local calendar relates to homestead exemption and requires a recorded two-thirds roll call vote for passage. Mr. Clerk, third reading and passage of uncontested local bills. For what purpose does Wilt Berchett rise? To make a motion. State your motion. Mr. Speaker, I motion the House Bill 422 be removed from the calendar and voted separately.\n\nRepresentative Birchett moves at HB 422 be removed from the local calendar and voted on separately. Mr. Clerk will read the caption please. House Bill 354 by resident of Camp 1305th by County House Bill 391 by resident of Green in the 154th early County House Bill 422 by resident of Birchett of 176th where County House Bill 519 by resident of Paris the 1508th of Manual County Senate Bill by Senator Burns the 23rd City of Sylvania House Bill 395 by resident of Holison of the 76th heard County. On the gentleman's motion that HB 422 be removed from the local calendar and voted on separately is their objection. Does the gentleman move? No moves. Here in no objection is so ordered. HB 422 is removed from the local calendar. Is there any objection to the previous Mr. Clerk? I think you've read the local calendar now. So members we will our posture is we will vote on the local calendar without HB 422 on this vote we will be voting separately on HB 422. Is there any objection to the previous question being ordered on the local calendar? Chair his none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills? Chair his none the report of the committee has agreed to shall these bills now pass all those in favor the passage of the bills on the local calendar will vote yes all those of the opposed will vote no and the clerk will unlock the machine. Have all members voted have all members voted if so the clerk will lock the machines on the passage of the local calendar the yeas are 165 and the nays are zero these bills haven't received the requisite constitutional majority are therefore passed now we'll move on to voting on HB 422 Mr. Clerk will you read the caption again HB 422 House before 22 by resident per the set of the 176 where counting. Is there any objection to the previous question being ordered on the local calendar HB 422? Chair his none the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair his none the report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill on the local calendar will vote yes all those opposed will vote no and the clerk will unlock the machines. For what purpose does ships. for what purposes represented park rise? Parliamentary inquiry, Mr. Speaker. Statue of inquiry. Isn't not true there's concerns at this bill that's a dangerous precedent and that it would make local boards of elections completely partisan. If the gentleman says so states, I'm sure he's of that opinion. For what purpose is referencing manner rise? Parliamentary inquiry. Statue of inquiry. Can chairman Birchett explain what the Supreme Court case is because I'm not sure what it is? Can the gentleman thank you? I'm sure if the lady needs to know what that is, maybe the whip can enlighten us just a little bit in a parliament inquiry. So what purpose is representing Birchett rise again? Parliamentary inquiry. Mr. Speaker. Mr. Speaker. Isn't it true that in delay, V. Sutton, the Dorgers Supreme Court ruled that it is unconstitutional for private entity to appoint to a public board. Public boards exercise government control. Private entities are not elected by their constituents and are not held to the same standard as public officials are. And also, Mr. Speaker, isn't it true that precedence has been set by the Supreme Court? I'm sure the gentleman's a learned lawyer and he's starting to believe the points he just made. What purpose is representing manner rise? Parliamentary inquiry. Statue of inquiry. That's because I don't understand and we're in the middle of a vote. So is a private board somehow regarded in this local legislation that the Supreme Court case you just referenced? I think that was an infirmative. For what purpose is, I love it when a plan comes together and y'all can look. So hopefully y'all get together before the vote next time. Have all members voted. Have all members voted. If so, the clerk will lock the machines on the passage of the bill. The local calendar, H.B. 422, the yeas are 96, the nays are 68. This bill, having received a requisite constitutional majority, is therefore passed. For what purpose is representing draper rise? It's a parliamentary inquiry domain at this point. Not at this point. The passive of the bill is already complete. We're going to move on to morning orders now. We have a number of people signed up for morning orders. We have a long list and a short day. So if the men, other than the first gentleman, he can take just as long as he likes, because he may have some important information for us. We'll see about that. We'll ask the members to pay attention to your time limit when you come to the well so we can move on to three. So we'll start on morning orders with chairman of the Appropriations Committee. Chairman Hatchett. Thank you, Mr. Speaker. Mr. Speaker, this has nothing to do with appropriations. You have one minute then. No, no, this is February. Next month is March. The best day in March is March the 17th. And there happens to be a little community down on the coast that celebrates March the 17th and maybe the day before the day after. But on your way down there, there's a community about two hours this side of Savannah called Dublin and we celebrate St. Patrick's all month long. We've been doing it since 1966. It's a family, friendly festival and it has been run since 1966 with volunteers. And today we're honored to have the group that is volunteering this year that's running our festival. It's the St. Patrick's Executive Committee and please welcome them and give them a hand. I bet they have on green coats up there. Welcome, Dublin. And thank you for that family, friendly St. Patrick's Day parade. I want to pause just for a minute and take a minute of personal privilege. A great public servant in our state is in the gallery today. Former representative of the State of California, Kathy Cox. Where is she? There she is. Welcome back to the house. It's great to see you. Thank you so much and thank you for your service. We're also now going to acknowledge our doctor of the day and we're going to have representative Rhonda Taylor of the 92nd to come and introduce our doctor of the day. Thank you, Mr. Speaker. Good morning, colleagues. Today's doctor is Dr. Carmen Eccles, who is a board certified family medicine physician. She received her bachelor's degree in biology from Xavier University of Louisiana and New Orleans. Her medical degree was from Wayne State University in Detroit, Michigan. And she completed her residency and internship in family medicine at Georgia Health Sciences University in Augusta, Georgia. Her most recent physician experience includes Emory Stonecrest Primary Care, but she has over 10 years of service in the Cap area. Dr. Eccles special medical interest includes adolescent medicine, diabetes, hypertension, women's health, and integrative medicine. She is a member of the American Academy of Family Medicine, Georgia Academy of Family Physicians, and the obesity medicine association. Dr. Eccles is a proud wife, mother, and dog owner who enjoys volunteering community service, West African dance, outdoor activities, attending cultural events, and festivals, traveling and gourmet cooking. Colleagues, help me welcome our doctor of the day, Dr. Carmen Eccles. Good morning, members of the house. I want to say thank you. I am honored to be here serving as your physician of the day and continue making the state of Georgia great. All right, have a good morning. Dr. Eccles, what kind of dog do you have now? I have a queen for so many, so I used to have an English school dog, but he passed it a heart failure. Okay, good dogs. Man's best friend, right? And woman's best friend as well. The school field is recognized for an morning order. There she is. And she has friends, the representative school field. All right, all right. All right, that's me. I got two minutes, yes. Thanks. I love the purple. This is good. I don't want to run over. Go home, Carlos. You're back, that's my phone. Good morning, Mr. Speaker, colleagues and my Lupus family in the gallery. Please stand. Today is Lupus Advocacy Day. Since 2008, people have been living with Lupus impacted and caregiving for someone with Lupus have come to the Capitol to advocate for funding, research and better health resources, especially in the rural community where there's no rheumatologist. Well, we're back again. And we're in the gallery in the house and senate traveling across the state, some even from your districts to once again proclaim that Lupus still sucks. Thank you to my colleagues for every year being capped, Lupus warriors. Lupus is not a democratic or republican disease. The Sea of Purple is a great showing of bipartisan support. As legislators, we stand together, legislate and advocate. As this is my 23rd year, this month of being diagnosed, I'm grateful for the work of the Georgia Chapter of the Lupus Foundation and to all those in the Lupus community that never give up. Join us today for a rally at 12 new, at 1215 in the south wing. Thank you, Mr. Speaker, and I yield the well. Thank you, Representative Scofffield, and all the Lupus champions. And those in the gallery, welcome. Good to have you all. Cheer Lady Lynn Smith. You'll make your way down. Cheer Lady Smith for a morning order. Members, if you'll give your attention to the member in the well, cheer Lady Smith. Thank you, Mr. Speaker. I'm joined by the Cowardy County delegation and friends and supporters of this wonderful group. To my God friends in this chamber, if you would read line two, you would understand in the resolution I put on your desk that, recognizing May 18, 2023 is the Georgia World Organization of China Line Two, China Painters Day, and for other purposes. If you're confused, if your wives ask you to buy something like this, it has been hand-painted by this wonderful group in the back of the gallery. So all of these people are phenomenal. China Painters, very talented. And they are joined by people from all over the world who are keeping this wonderful art alive. For those of you who are curious, I already have questions for how do I get one. So I will be getting back in touch with y'all on that. But they're trying to design painting some of them or in front of my office, to you at the Capitol. There is a display for you to go see. Thank you, Mr. Speaker. We yield the well. So members that have signed up for a morning order, you got to pick up the pace a little bit. We have 13 more morning orders. So you need to be done in less than a minute. Representative Glaze is recognized for a morning order. So today is CTAE Day at the Capitol. And so we stand here with this resolution to continue to make sure that DOE and our CTAE, which is Career Technical Education Month, February 23rd, all of our career and technical student organizations that are here at the Capitol today, would you stand please? And so we can recognize you in the gallery. Evan Baybach, Dr. Barbara Wall, Diana Isigari, Olivia Steinner, we appreciate you bringing our students today. If it were not for organizations like CTI, Deca, FBLA, and FFA, and many more, we would not have the type of solid foundation for our youth here in Georgia and across the nation. Just make sure that we follow in business and economic development in this state. Our students, your organization will continue to be leaders tomorrow and we commend you today for your great work in CTAE. Thank you so much. Thank you for being here. You do, you all do great work for our students. Our city Wade, recognize for a morning order. And friend. Police one. Representative Anderson. Thank you, Speaker. Colleagues, I'd like you to help me welcome two folks from back home, two pastors, my pastor, Jack Pilcher, and Chris Anderson, who happens to be this gentleman's cousin and he's a pastor. And if you were a member of this house, he would be an additional member of the funeral home caucus. We welcome them. And I want to send this message. They are praying for every single one of us. No matter party, no matter part of the state, they're praying for all of us. And they came down here this morning to let you know that they're praying for you. Thank you, gentlemen. Thank you for what you do. God bless. Thank you. Thank you for those prayers. Representative Lamb is recognized for a morning order. Thank you, Mr. Speaker. I'm pleased to welcome the Hopkins Elementary School Student Council. Would you all please stand? Like many of you student government was my very first experience in elected office. It was probably to date my finest campaign. Let me tell you, those Marvin and the Martian posters were a hit. But much more importantly, it taught me really to listen to our constituents and not promise beyond our capabilities. With that, because I believe in letting people speak for themselves, I'm going to share a brief message directly from them. Thank you for representing our state and the interests of our people. Thank you for listening to us and helping to make our community a better place. We are the eyes and voices to bring safety and security to our school. And we look forward to collaborating with you on ideas. Thank you all so much for being here. Absolutely. Welcome, young people. Representative Gullet, recognize for a morning order. Thank you, Mr. Speaker. Today I want to recognize East Paul County High School Deca's programs here with us today is the seventh largest in the state. And it's the largest CTSO program in East Paul County High School. Today we have Maddie Smith, who is president. Caroline Dunn, Isabella Walker, Madison Beatty, Tyler Jones, Jake Sandy, and advisor Haley Bissell. Thank you guys so much for being here. Please stand and be recognized. Thank you. Thank you, Representative Gullet and friends as well. And welcome. Representative Gullet is recognized for a morning order. She has friends as well too. A lot of friends. Good, good friends. Good morning. I rise today to recognize that today is CPR Awareness Day at the Capitol. For patients who suffer sudden cardiac arrest in the field, meaning outside of a hospital setting, the most important factor for survival, as we've seen recently, is whether they receive immediate high quality CPR and rapid defibrillation to restore normal cardiac rhythm. Unfortunately, only about 46% of patients experience sudden cardiac arrest get that help they need before EMS can arrive to the scene. So today, the American Heart Association is going to be providing CPR training at the Capitol in room 230. Please take advantage of this opportunity. Also the Medical Association of Georgia is presenting a stop the bleed program at the same time. So please avail yourself of this excellent training. Further, we'd like to recognize in the chamber today Ms. Don Wales and the Gainesville City School staff who saved the lives of not just one, but two students at their school for providing immediate bystander CPR and defibrillation. If you would please stand to be acknowledged. Thank you so much. Thank you all for the work you do. Representative Horner is recognized for a morning order. There has a group here. Thank you, Mr. Speaker. I'm honored today to welcome my local county GOP. Please stand up guys. They have worked hard and like many of you guys, they're here to represent their county, like myself. And they have done a wonderful job in making sure that everybody in Coutuse County has a place to go to have a voice heard. So please everybody welcome them. They've drove a long way. Good to have you all in the people's house. Representative Hagen is recognized for a morning order. Thank you, Mr. Speaker. I am so happy to welcome to the gallery today, a group of students from Valleja High School. If y'all would please stand up there, there they are. They're from two different career and technology student organizations, Skills USA and Hozo, which is a club for health occupation students. And they are led by their fearless leaders, Mr. Jackson Sharp and Shelley Clegg Horn. So guys, y'all are here and welcome to the people's house. Welcome, Representative Ken Vetz, recognized for a morning order. Thank you, Mr. Speaker. As we all know, a leader is one who knows the way, goes the way and shows the way. Today I am privileged to have in this, the people's house, youth leadership of Baldwin County over here on my ride if they'll please rise. I appreciate it. They're in the great shirts and they are learning the way. Thank you, sir. Chairman Jasper, Jones, Barrett Cox, Clark, McDonald. Sounds like a great crowd. Group, what a group. Yes, sir. Well, those of us who represent for South County are very, very proud of our top rated school system. And the Sharon Springs Robo Knights, one first place in the first Lego League Championship. It's a robotic championship and we're so excited to have them here today. They're going to be competing in the national competition. Later this year, we're very excited for them in April. They're going to be in the Transportation Committee today to do our presentation at 1 o'clock, come if you'd like to see it. But few folks, we all please stand so we can recognize your first place championship. And also, Mr. Speaker, Wendy Wing, their teachers with him and she's an outstanding educator. Good to have you all all here. If you keep working on that transportation committee, you can make some big improvements. Thank you, Ms. Wing, for bringing your class. Thanks for being here. Representative, no, Chairman Parrish. Chairman Parrish is recognized for a morning order. Thank you, Mr. Speaker, ladies and gentlemen of the House. It's my pleasure to recognize in the gallery today a group of young people from Metter, Candler County, their students at the Metter College and Career Academy. Would you please stand so that we could recognize you? Thank you all for being here and things really are better in Metter. Thank you. Oh, that was my line, but I mean, Mr. Chairman, things are better in Metter. Good to have you all. Representative McClain, recognize from morning order. Thank you, Mr. Speaker. You know, it's very seldom that I come to the well, but it's a great day for me. I have my two daughters and three of my four grandsons up in the gallery, and I'd like to say thank you. That's, you know, it's, I have four grandsons and I have two daughters and I told them in. And the youngest smiles, he's waving, miles. He wanted to come down and see exactly what we do in the House. So bad to have you all just wanted you all to know, love them. Thank you all very much for being there. Thank you all for welcoming them. Hey, Granddaddy, what do they call you? What do they call you? What do y'all call me? Miles, what do y'all call me? Say it, Miles. Grandpa. Grandpa. That's better than big puppy. What are we going with Grandpa? Representative Townsend is recognized for a morning order. Thank you, Mr. Speaker. I am honored to recognize the Glen County CTI Group. Students and staff please stand up. Dr. Chris Hicks and her team, they do an amazing job. They're learning how to get great skills in high school and apply it in the workplace in the field. Again, thank you, Glen County. Great, great to have you all. Members will ask you all to come back to the floor if you will. We have one more morning order and then we have a very special resolution that we want to bring to all the members. So members, please return to your seats. Okay, Chair Lady Camp, Matthew Eck. Chairman Knight and Chairman Dickie, recognize for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. I'm excited to say that Gordon State College, which is located in Barnesville, Georgia, is here today. Ruppers at Chairman Matthew Eck and Chairman Knight and Chairman Dickie and I all have constituents who are at Gordon State College. Are you in the gallery this morning? They escaped. Oh, no, they escaped. Well, I would like to recognize them and thank them for being here today to learn more about the work that's done in the people's house. Thank you. Great job. We'll welcome them back next time. Mr. Clerk, will you read the caption to a resolution? House resolution 273 of our president of parish, the 158, Jackson, the 128, the load 167, Smith, the 139th Taylor, the 173rd, and others. A resolution recognizing February 23rd, 2023 is Community Health Center's Day and commending the Georgia Primary Care Association. This is a good one. So listen up, listen up, Chairman Parrish. Thank you, Mr. Speaker. I would like to thank you for the opportunity to present to you a group of folks who have done outstanding.\n\nAnd in our state, it's the Community Health Center Association, the mission of the Community Health Center system is to improve access to comprehensive primary care services for medically underserved Georgia. Community Health Centers are also known as federally qualified health centers, FQHCs, because they receive federal grant dollars to assist in providing health care to the underserved and under insured. The health centers in Georgia begin their work over 50 years ago, partnering with communities to bring access to health care in areas that are medically underserved. Currently, there are 35 health center organizations, all are nonprofit governed by a local board of directors, comprised of community leaders and patients. Collectively, these 35 organizations have 231 clinical sites in 130 of Georgia's counties. Many of these clinics are in rural communities where there's limited access to care. Each year, over 660,000 patients are served by these health centers throughout Georgia. On your desk is a map showing whether the health centers are located. And I like to tell people the house has led the effort to color in this map. We still got a few spots that we need to finish out, but I think the house can take credit for what you've done as leaders in the past. And as we strive to increase access to health care in our rural communities, these community centers do their part by providing care for pregnant women, children and families as a medical home, including pharmacy, dental, chronic disease management. School-based health centers, which this house has also been a leader in, are a growing innovation to keep students healthy as they grow and learn. In the gallery, are leaders of community health centers from all across this state, would you ask them to stand in? Would you join me in recognizing these folks in the gallery up there? Thank you, them. And now it's my pleasure to welcome Mr. Arby Tucker, who is president of the Association for Georgia. Thank you. Good morning. Good morning. Mr. Speaker, Chairman Parish, and members of the House on behalf of the 35 members of the Georgia Primary Care Association. Thank you for this honor and this recognition. One of our mission is to help ensure quality health care services for all underserved Georgians. These services include family medicine, internal medicine, women's health, pediatrics, behavioral health, dental and vision. We currently deliver these services for over 730,000 Georgians. These services are delivered from 230 sites in 130 counties. We have sites from LGA to Valdaustra, from Columbus to Brunswick from Savannah to Bambridge. There's even one in Oslo, Georgia. There's at least one site in every district in the state. Thank you for your continued support. And closing, thank you for all of y'all's service and the sacrifice that you make for this great state. Please note that community health centers will do our part to keep Georgia the best state to live and to work. Thank you. Awesome. Thank you all. And thank you all for being here. Members, you members that have been here for a number of years, you've supported FQHCs in our state. And thank you for that. For you new members, make sure you get informed about what these folks do for our citizens in this state, where you're in urban Georgia, rural Georgia, wherever you reside, wherever your district is. They do great work. Chairman Taylor has been a champion, chairman parish, and many others in this house. I can't name them all. I've been great champions for making sure the house led the way and funded to start up on these great, this great program. So thank you all for what y'all do for the people of this state. And we are very pleased that y'all would be in the house with us today. Thank you. That concludes our morning orders. We'll move on to the rules calendar. The clerk will read the caption to HB 142. HB 142. House Bill 142 by resident of Maynard, the 56 and others to be titled back to a men chapter 8 to title 20 that fiscal to Georgia and it's had a related to campus policeman. It's so survived for the establishment of unified campus police forces through agreement centered into bi colleges and universities. Miss Bill that referred to the committee on public safety and homeland security, that committee recommends that this bill do pass. Representative Maynard is recognized to present the bill. Thank you, Speaker. I am presenting house bill 142, which is a community bill. This bill represents 10,000 students in historically black colleges and universities in the state of Georgia. That Lanna United Center Consortium is the only consortium in the entire United States. Those colleges consist of more house college, more house school of medicine, the inter-denominational theological centers, Spellman, Clark and Mars Brown. This bill passed out of the house last year. It passed out of the Senate last year. They made some changes on the Senate side. It just did not make it back for the agree disagree. This is a community vote for students. Why this bill is important is twofold. Because the universities are all collected together, a police officer in Spellman on Spellman's campus cannot help students on Clark's campus. By uniting the police force into one United police force, they save money. Not only do they save money, but they can potentially save lives. This bill was presented to the committee with the letter from every single president of the Atlanta United Center University campus center. And we also have a letter from legislative council that says this in no way, this is an opt-in. This in no way affects any other university. This just allows these universities to opt in to an agreement so they can share police force and cross boundaries to protect students. And I will answer any questions. The lady does have a question? Will you yield for a question? Yes. Any barns from the 86th has a question to your left. Thank you, Mr. Speaker. Does the lady yield? Yes, I do. Thank you. Does this, is it not true that this bill will allow faster response times to all the universities if we unify the police force? It absolutely will make faster response times. In fact, there was an incident at the Woodruff Library which is located on Clark's campus. Police officers from another campus actually could not even assist the incident on Clark's campus because this agreement was not in place. Thank you for your question. Lady Yurif for another question. Yes. Chair recognizes represented Carter for the 93rd for a question. Thank you, Speaker. Does the gentleman yield? Yes. Could you explain to me how the different police departments in the three schools, or the four schools on that particular campus, how would they handle the financial responsibilities with those current police officers become, would no longer be employed by those individual schools, would there be a creative entity, how would that function? So right now, each, all of the universities collectively are under the title Atlanta University Center Consortium. So the Morehouse Police, Spelman Police, they will keep all of their current structures by name only. They are now a combined police force. So the police captain and chief for each campus, everything will remain as is. They will have one person over all of them, but each campus will still have their individual chief that will designate what they've already been doing. Okay, I hear you, but I'm not sure if it's clear, Dr. Talk to you later about that. And it does the gentle lady further yield. Yes. And now is this legislation specifically for the AU Center, or this for all universities that are close to each other, that they'll be able to collaborate and have you spoken with the other systems around the state of Georgia to ensure that they support this legislation as well? Yes. So we had the Sheriff's Association, the Police Association, the University System of Georgia, the College Association of just the private school networks. Everybody came and testified in support of it. We made changes as needed. It only affects the Atlanta University Center because they are the only consortium. But if Emory and another university wanted to do such thing, they have the op-in ability. Emory has an op-in ability to do it, but it would definitely need it for the AUCC because of their proximity. No other campuses are in that close proximity in the state of Georgia. Thank you for answering my questions. I just want to know how to answer the questions of the offices from the various school districts. School systems that are going to call us because now their jobs are going to be very different than what they are right now. So thank you. There are presidents of each university sign letters of support. So there are no further questions. Thank you. I yield the will. Lady has yielded the well. Is there any objection to the previous question being ordered? Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted. If so, the clerk will unlock the machine on the passage of the bill. The yeas were 157 the nays 2. The bill having received the requisite constitutional majority is there for past. Justice the clerk will you read the caption to hb22222. House bill 222 by reps and have lumped into the 12th and others to be entitled to amend title 33, the fiscal to Georgia annotated related insurance. So it's to clarify streamline and make transparent the practices of the Department of Insurance. This bill never referred to the committee on insurance. That committee recommends a disbilled do pass. Chairman Eddie Lumpston is recognized to present the bill. Thank you, Mr. Speaker. Members of the House, I bring to you a House bill 222. This is a department bill that comes as a request of the insurance commissioner. It's a bill that clarifies the insurance department's practice in four areas of the insurance code. The first change adds language that makes it clear that the insurance department only regulates service contracts that are sold to individual consumers, not corporate consumers. The second change deals with probationary insurance license and extends the period of a probationary license from 12 months to 24 months. The third change deals with re application for an insurance license when the license application is denied. This allows a commissioner to let applicants reapply between one and five years after a refusal. Right now they have to wait five years. Some license refusals or revocations are less serious or for less serious reasons than others. So this gives the commissioner some discretion. The fourth change simply removes a reference code to a section that no longer exists. Mr. Speaker, that's the bill. I would appreciate you favorable consideration. You have no questions, excellent job on your explanation. Thank you, sir. Are you the one? Chairman H. Gail to the well. Is there any objection to the previous question being ordered? Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? Yes, all those of pose will vote no and the clerk will unlock the machine. Of all members voted, have all members voted, if so, the clerk will lock the machine. On the passage of the bill, the yeas were 167, the nays are zero, the bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to HB319319? House Bill 319, my represent of Martin of the 49th, being titled an act to amend Article 3 of Title 20 of the official bill to George Annotator relating to scholarships loans and grants. So as to abolish the Georgia Higher Education Assistance Corporation, this bill ever referred to the committee on higher ed, that committee recommends that this bill do pass. The chairman of the committee on higher education, chairman Martin, is recognized to present the bill. Thank you, Mr. Speaker, ladies and gentlemen, I'm going to be very brief here because of the time and I'll answer questions if people have them. What House Bill 319 seeks to do is to abolish a portion of the Georgia Higher Education Assistance Program. This program doesn't need any more because Congress changed the law in 2010. The loans that used to oversee no longer are available. So we don't need this. This lowers government. The reason the bill is so long is because there are references all throughout state law to this that needed to be deleted. The operative section is on page two, lines 20 through 29. This gets rid of something in state government we don't need. Freeze up a little over $25 million that can drop into educational funding. And with that, Mr. Speaker, I ask you for your favorable consideration. This House Bill 319 to lower the cost of government, put more money into education and simplify matters for citizens in the state. I'll stand for any questions. Gentlemen, has no questions? Are you all the well? Is there any of the gentlemen as you are the well? Is there any objection to the previous question being ordered? Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. Chair here is none. The report of the committee is agreed to. Shall this bill now pass, all in favor of the passage of the bill, we'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 171, the nays 0. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to HB 165? Councilman 165, a reputant of new with the 64th and others to be entitled to amend Code Section 50, 1872. The official code of Georgia annotated relating to when public disclosure is not required relative to inspection of public records. This bill then refer to the committee on natural resources and environment that committee recommends a disbill, due passed. Representative New, are you new to the House? Representative New is recognized to present the bill. Thank you, Mr. Chairman. And to answer your question, I'm a new woman every day. Thank you. Two shade, you got me. Thank you members of the House. Good morning. I appreciate the opportunity to talk to you about House Bill 165. This is a department bill. It is a clean up bill requested by the Department of Natural Resources to address an oversight in previous legislation. In 2020, the historic preservation division was transferred from the Department of Natural Resources to the Department of Community Affairs. In this transfer, Agora exemption for sensitive, historical, and archaeological records was moved from the Department of Natural Resources to the Department of Community Affairs. However, the Department of Natural Resources still houses our office of archaeologists. So this houses our historical sites, cemeteries, and Native American burial grounds. So this bill would simply restore that exemption to ensure sensitive archaeological sites would continue to be protected. I yield for questions. You do have a couple of questions that Chair has one first. Are you suggesting this House made a mistake in 2020 and we first perfected this bill? The lady would never suggest that, sir. Thank you. Chairman Weedauer is recognized for a question to your right. Thank you, Speaker. This is generally you. I yield. So this is really a measure to protect items of significance on properties. Is that correct? That is correct. So I think we would all appreciate our own protection of property at our own homes. Would that be correct? That's correct. Further you? I yield. So I'm just curious, do you or do you not actually have a swing on your back porch? I do. I won't. I will leave that alone. Thank you. We won't follow that line of question any further. The lady from the 150th House District Representative Bentley has a non funeral home question. I'm sure. Strawberry Queen. Yes, ma'am. Thank you, Mr. Speaker. That's a gentle lady. You yield. I yield. I heard you mentioned, Symitere is in your presentation. Can you explain to me, and this is serious question. Can you explain to me exactly how this legislation is going to impact Symitere's in the funeral home industry? This is historical sites, archaeological sites, the cemeteries that are of historical natures. That's what this encompasses. It would be your customers after the fact. I just want to be clear on what that meant for Symitere. Thank you, Symitere. Thank you, Mr. Speaker. I think you're safe, Representative Bentley. The gentleman from the 17th House District Representative Bartohan has a question in the rear on the right. Well, thank you, Mr. Speaker. Does General Aida yield? I yield. I see here online four of your bill that you're providing for an effective date. Now, have you considered that your bill may not pass and give us an exact ineffective date? The lady yields the well. The lady, you have one more question, I think. Yes, sir. Just one more. Maybe two. The gentleman to your left in the rear, Representative McClain has an important question. Thank you, Mr. Speaker. Does General Aida yield? I yield. It's probably one of the only Native American with a card in his pocket. It's going to take care of all of the Native Americans land as far as all of our Indian miles and artifacts. Yes, sir. This will protect them from looting vandals and anybody that wants to go Indiana Jones on them like Casey Carpenter. Thank you. I appreciate this bill and you have my vote. Thank you. Thank you. The lady has one final question, I think, from a neighbor of yours. Chairman Tyler Paul Smith to your left has a question. Thank you, Mr. Speaker. Does General Aida yield? I yield. Okay. This is really a serious question. I see here in the bill on line 14, the structure of this bill would not necessarily just limit it to these historic resources or properties, but also affects properties near those. Does it not? That is correct. Okay. That is this and you may not have had anyone ask about this. Would this also prevent the department or allow the Department of Natural Resources to withhold information concerning landfills close to these historic resources? That is a very good question. Okay. Thank you. That would be one of those questions. You have no further questions to the DNR. I think this, I don't know if this bill with landfills or not, representing you. I think you have a good bill and we appreciate your presentation and your answers. Thank you, sir. I yield the well. Good job. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. Report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted yes, so? Have all members voted. If so, the clerk will lock the machine. Representative Neu, there is a rule against that. You just paid the consequences for calling out a dear member. On the passage of the bill, the yeas were 169, the days won. The bill haven't received the requisite constitutional majority is therefore passed. Clerk will read the caption to HB 36. House Bill 36 by the way, the 49th will be titled and act to amend chapter 5 of the total 4080. The official go to Georgia, Antaterally, add Valorum taxation of property so to revise the language required to be included in the notices of current assessment. This bill then referred to committee, I will waste a means that committee recommends that this bill do pass. Chairman Martin is recognized to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen, I will try to be brief again with you today. The bill 36 is the mirror image of House Bill 1224 that this body passed 147 to 0 on March 11, 2022. It landed over in the Senate where foolishness does tend to occur and slowed us down. But this bill for the folks that weren't here in 2022 is a taxpayer-friendly measure that allows, does not require, it allows a taxpayer who has personal property valued in excess of $200,000 to appeal directly to a hearing officer. Many times there's complex personal property involved in business or manufacturing and today the law would require you to first go to the Board of Equalization, which would be three citizens that wouldn't necessarily have the technical knowledge to solve the situation. So it's not good for the taxpayers, not good for the county and all times goes to Superior Court. We all know our Superior Courts are clogged with other cases and more important. So this will allow a taxpayer on their motion to get to a hearing officer and get a determination of the fair value of that property faster. With that, Mr. Speaker, if there are no questions, I'll yield well and ask a favourable consideration of this taxpayer-friendly measure. Would the gentleman yield for a couple of questions? Yes, sir. The lady from the 35th Representative Campbell has a question to your left. Thank you, Mr. Chairman, just the gentleman yield. Absolutely. For a point of inquiry, please. I have asked around the chamber. There seems to be a question and would love to understand.\n\nCould you explain online 26 and other references? How this impacts wireless properties? Yes, thank the lady for the question. It has no impact that is in the same section. Wireless properties that are referred to in lines 26 through 29 already had a direct appeal to a hearing officer. This adds another opportunity for personal property over 200,000 to go to that same process. It is reformatted from the current law. Mr. Travis up in the legislative council office because this does print on a tax bill. So he reformatted some of that language, but there's no impact, increase or decrease for the accessibility of wireless carriers with more than $500,000 of personal property to go. Impacts them not at all. It's reformatted. Thank the lady for the question. Gentlemen, you have one more. Absolutely. Representative Park Cannon to your left from the 58th. Thank you, do you yield? Yes. Just a question about how this impacts our counties specifically how Fulton County feels about it. The counties have not been an oppositional. The counties have wondered about where they would get the hearing officers, with the knowledge, and we're still working with them on that. But the issue is this. If the answer is not arrived at the Board of Equalization, when you have a tax payer in three citizens, just like you and I, that don't have the expertise, it'll go to Superior Court, in which case the county will incur the cost of the Superior Court time, another expert to go and appear in Superior Court. So the counties are interested in finding the right public hearing officers for this. But in reality, this just moves this a step earlier so that they don't have to use it in Superior Court. If that answers the latest question, there's not opposition. We are working with them because they are concerned about providing hearing officers with the adequate knowledge and talents to solve it at that point in the process. Gentlemen, has no further questions. There's a lady, did the lady wanna follow up? I'll go on to speak. I'll answer the question Mr. Speaker. I'll go on to speak. If you want, let her have a follow up. Thank you Mr. Speaker, thank you Mr. Chair. So has ACCG waited on it? Well, we are talking with these, they're not in opposition to the bill again. They realize, as I've spoken today, that this will streamline the process and the cost will either be incurred if the public hearing are at the Superior Court. As it currently lists, as current law allows, there's a board, there would be a board of equalization hearing and then almost always your appeal to the Superior Court because you don't get the proper answer. So this doesn't add steps to the process. This in fact takes one away and they have not expressed opposition. At the ACC level or nor have I heard from Fulton County this year or last and we passed it 147 to zero last year. Thank you Mr. Chairman, you have no further questions. Thank you Mr. Speaker, I yield the well. Efficiency and government, always like to hear about that. Is there any objection to the previous question being ordered? The Chair here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here's none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and their clerk will unlock the machine. All members voted have all members voted. The clerk will lock the machine. All in the passage of the bill the yeas were 170. The nay zero. The bill having received your requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to HB 95? House Bill 95 I resident of the 1934th and others to be entitled to amend title 48th. The fiscal to George Antietta relating to revenue and taxation. So is the revised terms internal revenue code of 1986 and thereby incorporates certain provisions of the federal law into Georgia law. This bill I've referred to the committee on ways and means that committee recommends that this bill do pass. This is always a spell binding subject. Chairman Knight, so bring it to us and let us hear what we can do. Chairman Knight to present the bill. I can just speak on another. We're about seven minutes to lunchtime here. I'll ask you if we can hold over to about 1215. That should do it as this. Tentillating explanation of our see update. All seriousness, probably many of you I've carried this bill for a number of years. This is probably the smallest RFC update bill that I've ever carried since doing around 0506. As many as you know, we reconciled to the federal tax code. Every year we start with the federal AGI and what we have to do is update that. Smallest bill that we've seen, physical impact is really almost nil. I've seen it where we've had hundreds of millions of dollars each year. This one is much less than that over a five year period. Most of this is timing issues and also allowance for retirement type contributions in the Roth area. But with that, again, the importance of this bill is is that we have taxpayers out there that need to file their Georgia tax return in order to do that. We need to get this bill to house Senate signed by the governor so that the software companies can update their tax code or their tax software in order for our prepares to be able to accurately prepare these returns this year. So Mr. Speaker, with that, I'll yield for any questions. You have no questions. If there are none, thank you. And I appreciate y'all's continuous port of this. And Mr. Speaker, we have a last second one. Will you take one question? Yes, sir. Representative Glaze has a question to your left. Yes, ma'am. Do you yield, sir? Yes, ma'am. So is it not true that the IRC is important to all of us who are taxpayers in Georgia and without this going forward, we would not be able to comply? In some cases, yes. If you happen to be one of these changes that we've got to reconcile this year and it affected your tax return, absolutely, you're correct. It could affect you in a sense if you filed. And we have to come back and maybe refile our men of return because we didn't have this in here in time. Yes, ma'am, you're correct. So in order for us, do you continue to yield? So in order for tax paying citizens of Georgia to pay our taxes properly, we need to continue to make these upgrades. Yes, ma'am. We want to do it timely and accurately. Thank you. Thank you. Mr. Speaker, you'll do well and ask for your favorable consideration at HB 95. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And the clerk will unlock the machine. On the passage of the bill, the yeas were 172. The nays 0. The bill having received your requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to HB 138? House Bill 138, by reference to Crow, the 118 to be titled an act to amend Code Section 48540. The fish go to Georgia and Tady were laid in definitions for property tax exemptions. So to update the population bracket in census date for a certain property tax exemption for certain least property, this bill having further committee on ways and means that committee recommends this bill do pass. Representative Crow is recognized to present the bill. Representative Crow. Thank you, Mr. Speaker. A colleague, this is House Bill 138. A repeat from last year, we passed this bill unanimously last year, unfortunately, couldn't quite get through the Senate. What it does is it updates the population bracket to identify buts County. Persons in buts County that are on Georgia power lease lots on Jackson Lake are able to claim home set exemption. This bill was first enacted prior to 1980. And the population bracket has to be updated every 10 years when there's a new census done. With the 2020 census being done, we need to update the population bracket. Like I said, we missed last year, we weren't able to get it through the Senate. So we were simply changing the numbers updating that bracket that would identify buts County based on the 2020 census. And with that, Mr. Speaker, I will yield for any questions. You have no questions. Thank you. I yield the will and ask for your favorable consideration. The gentleman has yielded the will. Is there any objection to the previous question being ordered to chair here's none? The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Chair here's none. The report of the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? So the clerk will lock the machine. All of the passage of the bill, the yeas were 170, the nays won. The bill having received the requisite constitutional majority is therefore passed. Mr. Clerk, if you'll read the caption to hb162, 162. Councilman 162, by President Donald 26 and others to be entitled to amend chapter 7 of title 48 of the fiscal day of Georgia. The related income taxes. Shall survive for a one time tax credit for individual taxpayers filed income tax returns for both the 2021 and 2022 taxable years. This bill will have a further committee on ways and means that committee recommends that this bill do pass. The gentleman from the 26th House District, Governor's floor leader, Representative McDonald's, recognized to present the bill. Thank you, Mr. Speaker, fellow colleagues. Today I bring you House Bill 162. This bill is kind of mirrored as a bill that we did last year. The hb202 that was for the 2020-2021 tax season. This one is for the 2021-2022 tax season. The only change that we have in this bill, different than hb302, is in line's 20-22. That's for that high school worker, that dependent, that they can claim a $250 tax liability that they've been working, even though they are claimed as a dependent. This bill, we've had a surplus in Georgia. We've done really well for the past three years. I feel like it's our responsibility to give the money back to the taxpayers that's theirs and I yield for any questions. The gentleman has no questions. I have a question right there if the gentleman will yield. One question. Representative Holly has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. I appreciate you bringing this bill. My only question is, while in a good measure to be able to give taxpayers their money back, wouldn't it possibly be better for our Chamber to consider in the future the possibilities of having an earned income tax credit, even though I will vote in favor of this bill? Well, if the gentleman so states him believes that, I'm sure he knows what he speaks. The gentleman has one more question to your right, Chairman Martin, and that's the last one. Jim, the Florida to the Gale. Yes, sir. Isn't it true that every year we come down here and the Governor does a revenue projection? And based on that projection, we create a spending plan to spend an amount less than or equal to the amount of revenue he projects. Isn't that true? That is true, sir. The other question, isn't it true that this is a good faith effort and a commitment to the Georgians that the revenue estimate exceeded that which the Governor projected? We stayed within our spending means and we're giving the money back to the taxpayers that paid it, isn't that true? The gentleman knows what he speaks. Mr. Speaker, I yield the will. The gentleman has yielded the will. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine. On the passage of the bill, the yeas were 170, the nays too. The bill haven't received the requisite constitutional majority is therefore passed. Mr. Clerk, if you read the caption to HR 66, HR 66. House resolution 66 by Representative Gamble, the 15th and others. A resolution ratifying Governor Brian Peacamp's executive order numbers. 526, 2202, 7122, 832, 202, 91, 222, 103, 222, 114, 222, and 128, 2202. Expending the collection of motor vehicle and diesel fuel taxes. This resolution has been assigned to the committee on ways and means that the committee recommends that this resolution be adopted. The gentleman from the 15th Governor's floor leader, Gamble, is recognized to present the resolution. Thank you Mr. Speaker. Members of the House, I rise today to present to you House resolution 66. On behalf of the Governor to ratify his executive orders since May of 2022 to suspend the collection of motor fuel and diesel fuel taxes which were pursuant to the supply chain state of emergency. Following the Governor and General Assembly's bipartisan efforts in last year's legislative session with House Bill 304 and the Governor's ensuing executive orders that were issued monthly in consultation with leadership in the General Assembly. This resolution would simply ratify the Governor's executive orders to temporarily suspend the collection of motor fuel and diesel fuel taxes. This is a procedural step. The Governor's actions delivered much-needed temporary relief to Georgians at the pump, which saved taxpayers approximately $1.7 billion and roughly $150 million to $170 million per month. The Governor's actions have kept our economy open and strong and we as Georgians collectively respond as we respond to the higher inflation that we've dealt with. With that Mr. Speaker, that is House resolution 66. I'd be happy to take any questions. Gentlemen, you owe four questions. I will yield four questions. The lady from the 108th Representative Clark, Jasmine Clark, to your left has a question. Thank you Mr. Speaker. Does the gentleman yield? I yield. Have we had to ratify all of the other executive orders from the Governor or is this just these ones related to the gas tax? So as it relates to this gas tax, this is what we're ratifying today. And again, this is a procedural step that we need to accomplish in order to officially approve what was done. Thank you. With that Mr. Speaker, no further questions. I would yield the well and ask for this body's favorable consideration. Thank you. Thank you. The gentleman has yielded the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the adoption of the resolution? The chair here is none. The report of the committee is agreed to. Shall this resolution now be adopted? All in favor of the adoption of the resolution will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted. Have all members voted. If so, the clerk will unlock the machine on the adoption of the resolution. The yeas were 170, the nays are zero. The resolution heaven received the requisite constitutional majority is therefore adopted. Wow, thanks. That completes the rules calendar. We'll move on to afternoon orders at this time. Representative Teddy Reese is recognized for an afternoon or a representative Reese. Thank you, Mr. Speaker. From the morning of July 4, 1944, promise E. King and African American duly registered to vote in Georgia and local barber sought to cast a ballot at the Muscogee County Courthouse in Columbus. It was at the Democratic Party's primary election. Shortly after entering the courthouse, King was roughly turned away by law enforcement officers who escorted him back out to the street. In this time, the Democratic Party monopolized political activity in Georgia as in other southern states in the party's primary provided the only occasion in which a voter was offered a choice between Canada's seeking office in state and local government. For those very reasons, blacks were denied participation in the primaries by the Georgia Party and its county affiliates. King challenged the white primary. King challenged to the white primary had been planned by a group of Columbus African American civil rights activists led by Dr. Thomas Brewer. By prearrangement, King, after his rejection, walked several blocks to the office of Oscar D. Smith Senior, a white attorney who prepared a lawsuit against members of the Muscogee County Democratic Party Executive Committee, chaired by Joseph Chapman for denying King his right as a citizen of the United States to vote. In September of 1945, the arguments in King V Chapman commenced in federal district court in Macon, Georgia. Smith and King's other principal lawyer, Harry S. Strozer of Macon, argued that the clients right to vote under the 14th, 15th and 17th Amendment of the United States Constitution had been violated. They asked for $5,000 in damages. From October the 12th, 1945, federal judge, Holt Davis, ruled in King's favor and awarded him $100 at a 7% interest. Because the United States Supreme Court have recently declared, Texas's white only primary on constitutional on the grounds that the Texas Democratic Party was part of the state government, the defense had argued that the Democratic Party in Georgia was a private entity. On March 6, 1946, in the U.S. Circuit Court of Appeals in New Orleans, Louisiana judge Samuha H. Sibley, a Georgia native, denied the contention of the defense in King and Chapman, arguing that Georgia election laws associated the state with the Democratic Party and that the state therefore put his powers behind the rules of the party. The Supreme Court refused to hear the case, which means the ruling stood. King was courageous in his confrontation with law officers on Independence Day in 1944, and brave in his determination to pursue the case despite threats made against his life. King was not, however, a political activist. He was born on February the 5th, 1900 to Lucy and Ed King, near Hatchet Chubby in Russell County, Alabama, where his father was a sharecropper. King never received any form of education. As a boy, he moved with his family to Columbus where he worked with his family on a crew building the Maritoss Cotton Meal. Honors came to King from the political establishment that had once spurned him. In 1973, Mayor Bob Hidrex proclaimed July 28th as Promise E. King Day in Columbus, Georgia. In 1977, the Democratic Executive Committee of Muscogee County paid King his $100 plus interest, and in 2000, Governor Barnes signed into law a bill named the Stretch of State Row in Columbus as Promise King Highway. Thank you, Mr. Speaker. I yield the will. Representative Hutchinson is recognized for an afternoon order. Thank you, Mr. Speaker. Today, colleagues, I want to introduce you to 13-year-old Tragan. He is a sweet, caring boy with good manners, and he likes to tell jokes. He also likes being read to, singing karaoke, listening to Kids Bop and playing with Thomas the Tank Engine. Tragan is one of hundreds of kids who are available for adoption in Georgia today. Thank you, Mr. Speaker. You're the will. Chair Lady Darlene Taylor is recognized for an afternoon order. Thank you, Mr. Speaker, for all those that are looking to protect the Oki-Fanokiswam. Right now, we're having hearings with EPD. And tonight, you can join an enthusiastic group at Manuals Tavern. They're going to have a hookup where they can zoom into the meetings. It's going to be from 5.30 to 9 p.m. at Manuals Tavern. Come and let EPD know how you feel about it. Thank you. Thank you. Representative Scott has recognized for an afternoon order. Thank you, Mr. Speaker. Today, we honor Ahmad Aubrey Day in Georgia and around the world. We will gather this afternoon at 6 p.m. at the Beth's Belt Line Westside Trail Entrance at Lee Plus White Street in Southwest Atlanta to run a walk 2.23 miles. Ahmad Aubrey's murder and delayed prosecution shows how bipartisan legislation can pass to balance the scale of justice. As a result of Ahmad's death, the citizen of rest law was repealed and a new hate crime law was enacted. We are still fighting for law enforcement accountability. Ahmad Aubrey's name will forever remain alive, yet his blood still screams from the streets in Georgia. Thank you, Mr. Speaker and I yield the well. Chairman Sains has recognized for an afternoon order. Thank you, Mr. Speaker. Your Committee on Special Rules is very proud to review potential state holidays and symbols. And as such, we saw it fitting to bring back to this House, a very crucial symbol of a new legislators first bill. We are proud to introduce Bill, the large mouth, bass fish, back to the house and Rep. New has let me borrow it for this purpose and it will be transferred over to each new member who passes their first big catch in getting a bill through the rigorous process in this house. Have you ever passed, have you passed the bill yet? Your bill? You could always do for one or two more, Mr. Speaker. Okay. Just checking. You are still new, aren't you? We're representing Brad Thomas has recognized for an afternoon order. Thank you, Mr. Speaker. For those of you that enjoy water, roads, bridges, electricity, cars, airplanes, cell phones, computers, consumer goods and pretty much everything else, stop by Room 230, February 28th, from 8 to 10 a.m. for engineers at the Capitol Day. And come by and thank an engineer and enjoy some great sci-fi humor. Live long and prosper. I yield the well. For what purpose does cheerlety Cooper rise?\n\nto make a motion, Mr. Speaker. State your motion. I move that we recommit House Bill 26 to the Rules Committee. Clerk will read the caption. House Bill 226, my representative, is a Cooper and others to be titled back to a men are, the Southern Chapter 4, Title 49, the fiscal to George Anatelli, relating to medical assistance generally. On the ladies' motion, at HB 226, be withdrawn from the calendar and recommitted to the Rules Committee. Is there objection? Here in none, it is so ordered. The clerk will read the caption to a group of privileged resolutions. Recognizing and commending, Ryan Degner, recognizing commending, Mr. Jeffrey White, commending the Latin American Chamber of Commerce of Georgia, congratulating commending Sandy Pucket for receiving the 2023 Yellow Rose Nickety Randall Service Leader Award, recognizing commending, Mr. Rochelle White. Meeting Taiwan for its relationships with the United States and the State of Georgia, congratulating commending, DeBora Howard McMillan for receiving the 2023 Yellow Rose Nickety Randall Service Leader Award, recognizing February 27, 2023 as National Coalition of 100 Black Women in Corporated Day at the State Capitol, recognizing commending, Ebony Austin, commending, Rona Lynn Bennett, congratulating commending, Regina Deloche for receiving the 2023 Yellow Rose Nickety Randall Service Leader Award, recognizing commending Judge Catherine Armstrong on her outstanding public service, recognizing commending Lisa Marie Bristol on her outstanding public service, recognizing May 1-7, 2023 as Tardiv, dis-Keen Nesia Awareness Week, recognizing February 27, 2023 as Black Commerce Day at the State Capitol, congratulating and commending, Rona Grissom for receiving the 2023 Yellow Rose Nickety Randall Service Leader Award, and commending, Trent North and for other purposes that completes the reading of the privilege resolutions. Was there any objection to adopting the privilege resolution? Lutions. The chair is known and the resolutions are adopted. We're moving on to announcements. Announcements. Chair Ballinger. Chair Lady Ballinger has recognized for an announcement. Thank you, Mr. Speaker. Your juvenile justice committee will meet this afternoon from three o'clock to five o'clock. We have a hard stop at five. We'll be considering several bills and it will be in 415 in this covered legislative office building. Thank you so much. Thank you, Chair Lady. We have been to this afternoon. Members, be aware, representing Holland is recognized for an announcement. Holland. Thank you, Mr. Speaker. Both the City of Atlanta delegation and the Fulton County delegation will be meeting this afternoon at four o'clock in Capitol 216. Look forward to seeing you there. Representative Nellowicz. Recognize for an announcement. Announcement. I hope you just have one. Just one. Good afternoon, everyone. The Cobb County delegation will meet on Monday, February 27th at noon. Lunch will be provided. We'll be in C-L-O-B-514. Thank you. Thank you, Representative. Do German Chokus recognize for an announcement? Thank you, Mr. Speaker. Loosen up everybody on the Small Business Development Committee. We will be having our meeting on Monday, Monday, May 27th at 8am, 5.06 C-L-O-B. We've got a couple of bills and we'll be having presentations from the National Federation of Independence and Georgia Retailer Association. So please be there Monday at 8am, 5.06. Thank you, Mr. Speaker. Chair Lady Cooper. No, you're recognized. You were just walking down front in my bed. Don't I surprise you? Like I did. Chairman Carpenter. Chairman Carpenter is recognized for an announcement. There you are. Thank you so much, Speaker. So lottery oversight and gaming will meet at 1 o'clock. Capital 341 is my one and only chance to fill out Chairman Richards Smith. So I look forward to seeing you there. I'm coming to that meeting. I want to see that. Chairman Stevens recognized for an announcement. Thank you, Mr. Speaker. Ladies and gentlemen, you're going to your committees today, especially those of you on the Coastal delegation. We have lunch today in room 510, stopped by. It's fried chicken and greens. Enjoy. All right. All right. Chairman Williamson recognized for an announcement. There'll be a majority caucus lunch in the pun of German in room 403, majority caucus lunch in public safety. Chairman Collins recognized for on that. Thank you, Mr. Speaker. The House Public Safety and Homeland Security Committee will meet about 1 15 130ish in 606 CLOB. We're taking up three bills. Thank you very much. Committee members, please try to attend. Thank you, Mr. Chairman. Representative Holly is recognized for an announcement. Thank you, Mr. Speaker. You beautifully overworked people. I can hear the growl in your stomachs. And that's why you can go over to CLOB 307. We're going to have the working families caucus. We're going to be talking about housing and affordability with Elizabeth Apples. Thank you so much, Mr. Speaker. That concludes our announcements. I have one we are able to gentlemen to stay young for one more day yesterday. Ripley Simpson is a, he had a birthday yesterday. I want to be saying what birthday that was, but happy birthday to Ripley Simpson. That's all standing. Wish you my happy birthday. Ripley Simpson. Happy birthday, sir. Well, we're about done. We do have pages today. They've done great work. So let's, let's give our pages around. And members, we'll meet you down front and have a photo with your page. Thank you, pages. Chair recognizes the majority of the this house for a motion. Thank you, Mr. Speaker. I'll move that the house stand adjourned until 10 a.m. on Monday, February 27, 2023. I'll move the motion of the majority leader that this house stand adjourned until 10 a.m. Monday, February 27, 2023. All those in favor will say aye. All those opposed? No. Yep, it's clear.",
  "updated_at": "2026-02-13T05:35:31.946209+00:00"
}