{
  "video_id": "dDD8CMI4__4",
  "url": "https://www.youtube.com/watch?v=dDD8CMI4__4",
  "title": "3/16/23 - Committee on Regulated Industries and Utilities",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 122,
  "summary": "Here is a summary of the key points from the Georgia 3/16/23 - Committee on Regulated Industries and Utilities session:\n\n**Overview**:\nThe committee heard and discussed HB406, which would allow Advanced Practice Registered Nurses (APRNs) and Physician Assistants (PAs) to prescribe certain Schedule II controlled substances for a limited 5-day supply. The bill also aimed to streamline the licensing process for these healthcare providers.\n\n**Key Actions**:\n**HB406**: Allows APRNs and PAs to prescribe up to a 5-day emergency supply of Schedule II controlled substances after one year of practice, with continuing education requirements. Also enables APRNs and PAs to issue disability placards.\n\n**Bills Introduced (First Reading)**: None mentioned.\n\n**Notable Moments**:\n- The bill sponsor, Rep. Stevens, explained the intent to align Georgia with the majority of states that allow APRN and PA prescribing of limited Schedule II drugs.\n- Amendments were made to the bill to restrict prescribing of more potent Schedule II drugs like morphine and fentanyl.\n- Representatives of the Georgia Association of Physician Assistants voiced support for the bill, citing the need to address healthcare workforce shortages.\n\n**Votes**: No recorded votes mentioned.\n\n**Attendance**: Quorum was present, no specific attendance details provided.\n\n**Adjournment**: The transcript does not indicate when the committee meeting adjourned or the date of the next scheduled session.",
  "transcript": "you you you Appearance We have a series of bills on our agenda today. We're going to make a lot of progress and I'm going to start with 557. You may not have the sub in your folders yet, too. It's just the whole type. Representative Stevens, if you will, podiums great. Just lay this out to us a little bit what you're trying to accomplish and what your bill does. Thank you, Mr. Chairman, members of committee. What this does, it allows for us to join the rest of the country, if you will. The APRNs and PAs allows them to prescribe class two narcotic drugs. The only other state that APRNs cannot prescribe in is Oklahoma in the whole country. The only other state that PAs can't prescribe in is Kentucky. So this brings us more in line. What this bill does, it allows them after they've been licensed for a full year in in practice under a protocol for an APRN or under a job description for a PA to prescribe a five day emergency supply of a class two drug. They're required to bi-annually take a continuing education and they must directly evaluate the patient in person. Somebody can't call in and say, I need a five day supply of this particular drug. I've got to evaluate them before that particular person can prescribe a drug. On the substitute I saw where you added and I agree with the addition to help the physicians in these disability placards. It allows the PAs and APRNs to also issue those. That's all the bill does. There was another area that I've made a change that in the substitute other than adding the ability of these people to give a disability, you know, parking pass is to take away, make it clear you can't prescribe to people under 18 years old. There was some extra language that gave exceptions to that in your original bill that I removed. Is that all right? That's fine with me. I also made a limitation you allowed in your bill to prescribe me the schedule to drugs. And I removed that with a couple of exceptions that we would leave and make sure I'm not on any line yet. It's 58 and 59. You basically were allowing scheduled to drugs and I said they were excluded all scheduled to accept hydrocodone, oxycodone or compounds thereof. I was concerned that scheduled to also includes morphine, fentanyl and some more serious narcotic drugs and I wasn't comfortable with that. So we reduced it. And if you were to look at kind of if I've got my science right, the order of strength, you would have hydrocodone first and then oxycodone is about 10 times as powerful and then it only goes up from there to morphine and fentanyl and I am not comfortable with PAs or ARPNs prescribing those medications given the opioid crisis. Understand. All right. What that is that? I would have used hydrocodone compounds but hydrocodone. Is it in there as well? Okay. Yes sir. It says or compounds thereof. That's reference in hydrocodone. In case you want to put a seat of menophen or something in there with it which is commonly done, right? Which is actually preferred because you can't take too much of it without it becoming toxic. So it's a very good addition. All right. I usually would have had an occasion to talk with you in person before I edited or say perfected your bill but I wanted to make sure that that's satisfactory. We're eager to move along. All right. Any questions? I'm sorry. Did I catch you all before you finished your presentation? Any committee members have questions for the sponsor of the bill? Yes sir. All right. Mr. Senator Summers. Five days not a repeat of five days. It's just a one time feeling correct? Yes sir. You can't refill a prescription in a class two narcotic. Class three, four and five yes but not a class two. That's right. That's where it is. Thank you. All right. That's all the questions you have. Thank you. If you'll stand by we have quite a few people that would like to be heard. See you at the Hummersstone. Yes. A little bit. Call for the final. Yes sir. Mr. Chairman members of the committee my name is Sheila Hummersstone. Mr. Dunbridge consulting here in front of you today on behalf of Gappa the Georgia Association of Physician Assistance. I'm here with Amy Reeves who is our legislative chairperson. A long time practicing physician assistant. We are so grateful not only to the bill sponsor for bringing the bill but for you all taking time out of what is an extraordinarily busy time to hear this very important bill. We know that you all realize that we have a healthcare workforce shortage. You've heard it in this committee in fact more than once. We've worked on legislation to try to help protect our healthcare workers in our hospital systems and we are grateful. Quite frankly there's just not enough doctors to cover the state. The advance practice providers fill in and supplement the activities of the doctors to enable those doctors to see more patients. Someone much smarter than I made an illusion that it's not wholly dissimilar to a legal structure that has folks that work under them like a paralegal. The paralegal takes care of a lot of the work so that the lawyer can do what is in the sort of top line effort. Our PAs and our APRNs are taking care of patients today. They are working closely with their physicians. For the PAs we are governed at the Georgia Composite Medical Board. We are licensed by that composite medical board. The physicians for whom we are licensed too are also licensed by the composite medical board. But for that specific PA to work with that specific doctor we have to get an additional permission, an additional form signed at the board level, at the individual level by that composite medical board. So that's sort of the structure on the PAs side. The APRNs is a bit different. The only reason they need a nurse protocol agreement is to write prescriptions for schedule three, four, and five. This bill would obviously pull those limited schedule twos in there. So the reason for the schedule two is that there are plenty of places, particularly in rural Georgia, where there is not a physician on site. They may rotate between clinics and they may be there every second day or every third day. And so what we want is on that Friday if there is an emergency situation for that PA or APRN to be able to provide that very short course of medication to last them until that physician can see them a couple of days later. So that's sort of the purpose for that portion of the bill. The secondary portion of the bill is on the composite medical board. So if we think of again that licensure pipeline, right now we know there's a clog in that pipeline. And it's not the composite medical board's fault. They're having a workforce shortage as well. But every single one of those licenses has to be approved at the individual level as well as those licenses to practice with a particular doctor. So what this bill seeks to do is to say, look, if you've already got an approved protocol agreement or an approved job description and it is substantially the same, the same kind of physician that you're working under, the same kind of PA, the same kind of setting, then you just have to file and use that. You have to give notice that you're working, but it would be deemed approved. And so that's sort of what the bill seeks to do. I'm grateful to you all for hearing it. Amy can speak far more elegantly than I can on the practice of being a PA today. Any questions that you have on the clinical side? I will turn it over to Amy. Amy, would you like to hear from me? Just give us your new points. Oh, okay. Well, thank you for letting me have this time. I just wanted to say that, you know, like I brought Tina Hood, who is one of our many rural emergency medicine physician assistants. And there are times when there is no doctor in the emergency room and she is having to admit patients for proper pain management because, you know, in the hospital, we're allowed to order anything that the patient needs. But as far as like a prescription for them to take home, you know, you can't always manage fractures or kidney stones with, um, talon number three, which is a schedule three class of medication. We would have to abide by the PDMP, the prescription drug database that we have to check before we were to give a narcotic. And this would be limited to PA's in certain fields. Like it wouldn't be every PA or every nurse practitioner. In my field, I would say like I would need ADHD medication way more than I would need any like hydrocodone working in pediatrics, especially because we have a solo physician practice. And she's about to go out on maternity leave. So that's going to leave four and a half months with no physician there to manage our ADHD patients. But this would not mean that like a pulmonary PA could just prescribe hydrocodone. This would be, you know, these, you still have to practice within your, um, license, your and within your field of medicine. So if you're supervising physician is in neurosurgery and they are going home from a skull fracture or whatever, like that would be an indication of that something that, you know, you're supervising physician would do in that situation. I'm glad to take any questions. Recognize Senator again for question. Thank you, Mr. Chairman. Two things. Yeah, I'm proud of the PA's because I was actually out of state had an accident said the came very ill and the PA saved my life. But I'm worried that are you related to a birth rate by any chance? And is it true this is just an employee to get his stinger into somebody else? As a former buzz guy. Okay, you are no longer recognized Senator again. I got a text from Burke today, he told me to feel free to ask you all the hard questions that you were prepared to answer them. Anybody else have questions? I mean, if I might, the only other thing that I might add is at the end of the day, these job descriptions and protocol agreements, the physician is in control. And so if Chairman Kowler, you were the doctor and I was your PA, if you did not feel comfortable that I had the experience or the decision making skills to do this in your practice, then you would not afford me the opportunity to do that. So it always goes back to that job description or the nurse protocol agreement. At the end of the day, the physician is at the heart of this relationship and they determine what it is that we can do. I've come to view it as a force multiplier kind of, it allows doctors to serve more patients. And I think it's particularly effective in rural areas or less populated with doctor shortages. I like to see my doctor, but there are some people that fall in love with their PA's or I guess APR ends as well and almost consider them their doctor. I'm comfortable as long as there's that protocol and that supervision and my review of the bill. I think we're in good shape. We have six other people who might be heard. You never know. They might change your minds and be open minded. All right, thank you. All other questions. Aubrey Valenz. Thank you, Mr. Chairman. I'm the committee. I'll be brief. Aubrey Valenz with the Advanced Practice Registered Nurses. I have Robin Pence to hear me today can answer any specific questions. It's been thoroughly explained unless you have questions of me or Robin, I'll wave for the testimony. No questions. Thank you for expressing your support in a concise manner. Abigail Thompson. My former intern turned lobbyist superstar. I'm sure I'm in that intro. Make me proud. Good afternoon, members of the committee. My name is Abigail Thompson. I serve as Director of Government Relations and Advocacy for Shepherd Center, where a 152 bed, private, nonprofit hospital based in Atlanta. We specialize in the rehabilitation of spinal cord injury as well as brain injury, multiple sclerosis and other neuromuscular conditions. Shepherd Center is in support of House Bill 557 and the overall intent of the bill. We are particularly supportive of the new language in section 4, beginning on lines 189 through 292. That would allow APRNs and PAs to issue disability parking permits when necessary. So majority of our patient population is dealing with the disability to some degree or have mobility issues that require a wheelchair or a walker. So the new language is very important to improve the efficiency of our day-to-day operations and treating patients. As standard practice, our APRNs and PAs operate under the direction of a physician protocol agreement. Additionally, our patients are managed by a comprehensive team of doctors, nurses and therapists who all work in consistent collaboration with one another. So authorizing our frontline staff and our skilled nursing practitioners to issue disability parking permits and outpatient settings would be extremely helpful for our hospital and overall workflow. So I just want to thank the sponsor of the bill, Chairman Ron Stevens for allowing us to incorporate the new language and for all of his work on this issue and also appreciate you for allowing the legislation to be heard and happy to answer any questions. Any questions from Mr. Thompson? All right, thank you. Thank you. Kyle Wingfield. Georgia Public Policy Foundation. Thank you, Mr. Chairman, members of the committee, Kyle Wingfield with the Georgia Public Policy Foundation. You'll have a full docket today, so I'll be very brief. We do support this bill and thank the sponsor for bringing it forward as a way to, as the Chairman said, be a force multiplier for our healthcare professionals in Georgia. I'll only add that we have a recent study on our website at GeorgiaPolicy.org that delves into this issue more deeply and broadly as well if there's any data that the members of the committee are looking for is probably in there and if you're looking for it, we can help you find that. Any questions? All right. Thank you for being with us. Thank you. And last, Bethany Sherr with Medical Association of Georgia. Glad to hear your perspectives. Thank you. My name is Bethany Sherr with Medical Association of Georgia. We represent physicians across the state of Georgia in all practice settings and specialty types. I want to thank Chairman Stevens as well as you, Chairman Cowsert for your work on this bill. Obviously, MAG and physicians across the state have been increasingly concerned about the opioid crisis. We've been a lot of work done in the physician community to reduce the number of opioid prescriptions that have been written. We are definitely seeing a downward trend on that front and we obviously maintain concerns about increasing the number of prescriptions that may be out there, but we appreciate the narrow tailoring that has been done within this bill in order to try to address many of those concerns. We also appreciate the work done as far as some of the ADHD and stimulant medications. Obviously, those prescriptions are given out in accordance with very carefully done diagnoses that are not, you know, oftentimes that takes multiple visits to a physician before prescription may be written. From an emergency perspective, so if someone already has a prescription for that, we are concerned about how insurance may treat a partial fill so that we appreciate addressing that as well. And I believe that we've addressed the subsequent prescription language, which I think what's very vague and may have led to some refilling in a way that did not comply with the original intent of the legislation. So we appreciate all of the work that's been done on this and I'm happy to take any questions. We have taken that subsequent prescription refilling out of this of VA's and ARPNs would not have permission to do that after the five days. We appreciate it. Thank you. So can you tell me what's hydrocodone and oxycodone used for? What are the reasons to use that strong of a medication? So typically you're going to see them used for any type of pain. So in the acute space, you're going to see that for post-surgical pain or some sort of trauma-related incident that may happen. For the pediatric population, we're seeing a huge movement away from that in general. When we wrote the PDMP law that required physicians and other prescribers to check the PDMP for opioid prescriptions and your benzodiazepines, we looked at a three-day limit before you had to check the PDMP with the idea that it can take just a few doses before somebody can become addicted to those medications. So we are trying to make sure that we're kind of tailoring down prescription so that they're much for much shorter periods of time. The CDC has pretty robust guidelines when it comes to the prescribing of opioids. They've actually recently kind of gone back and modified those and they're modified every couple of years. And so for most opioids, you see those in the case of an acute injury or something like that. We are seeing a large movement in the practice of medicine away from managing chronic pain with opioids to the extent that we possibly can. So I think most physicians have moved to their patients to kind of non-opioid alternatives on the chronic pain front when possible. But then we use pain physicians who carefully monitor reactions and the possibility for addiction on that side. So this is just used in these acute emergency situations to sort of tie the patient over until they can get to their regular physician within the five-day period. Right. And you know, one of the things you think about is that like in a post-surgical pain or even in a post-traumatic injury situation, you're likely going to have a lessening of symptoms after a couple of days. So you're trying to get the person who may have a traumatic injury to the point where that pain has lessened, whether that's a reduction in swelling or your body kind of adjust to the situation that they're in. And from other things, it may be that they need to move on to see a general surgeon or an orthopedic surgeon or something like that if there's a kind of continuation of the pain past a few days. Okay. Any questions? All right. Thank you, Chairman Stevens. Would you like any concluding comments? Thank you. You said you're peace. All right. Anyways, I recognize Senator Chairman again for a motion. Thank you, Mr. Chairman. I said I move. Do pass. May I? 8, Bill. 557. All right. Multiple seconds. All right. Multiple seconds. And that is by committee substitute LC 33950SS. Any further discussion? Or any proposed amendments? All righty. In that case, all in favor say aye. Any opposed? All right. Do you know who you want to carry this in the Senate? I'll see you next time. Larry Walker. All right. You make them out of that. Please send it. Thank you very much. We appreciate your good work on this. House Bill 498, Representative Danny Mathes. Thank you, Mr. Chairman. Thank you, members of the committee. House Bill 498, I'm on LC 365421. This bill is to reinstate a lapse fuel director's license. This bill was brought through the House, the Senate signed by the governor. But the Attorney General's office deemed that it was only going forward, not in the arrears to 10 years. So what we're doing now is fixing that. What we're going to do if you've had your license lapse for 10 years, you can reinstate with the penalties. And you can also make sure you have the continuing education, if that's so being on a certain age limit. So pretty much that's the bill. I appreciate your favorable consideration for any questions I'll try to answer for you. We are pretty familiar with it. We passed it last year. Yes, sir. And I've got anybody, any members have questions? You passed, Mr. Chairman. All right. I've got a motion due passed from Vice Chairman. And a second from Senator Albers, any discussion or other proposed amendments. All in favor say aye. Aye. All opposed, same. Passed unanimously. Thank you for being with us. Appreciate you. Thank you, Madam. Chairman Jasper's House Bill 406. Those in the audience will recognize that we had a committee substitute as we discussed at the last meeting the changes that Chairman Jasper's and Leader Gooch had agreed to. I don't think we have any big surprises. I had copies of this left out on the table so that everybody could follow along. If you need one there, maybe a couple more there right in front of that podium. If you would just walk us through, Mr. Chairman, what you did, if it satisfied your concerns, and you conceded to the Leader on the areas that the his were better, and he conceded to you where yours was better. Well, we worked very closely together. Mr. Chairman, I sure appreciate Leader's work on this and also Ben Gerard in his office and Jenna working on the electrification and transportation. The bill does essentially three things that allows the sale of electricity by the kilowatt, allows for inspection of those electrical charging stations for safety, access to your location, and then allows for the collection of the excise tax. And so, that's what it does. You know, we jumped through on part one, 36. Was that highly negotiated work? Mr. Chairman, I did some. You gave me a question the other day I needed to look up and find an answer to. And I certainly did that, which learns 42 or 41-42. You'd ask me what it meant. And some felt in the world that it was unclear that those covered by the Territorial Act could do electrical vehicle charging. And this doesn't create an exception, but a clarification only. You know, on 48, we talk about, you know, this comes from the coalition that surrounds what to be in the electrical vehicle charging world. And saying that if it was just say Georgia Power, who is sub-regulation by the Public Service Commission, if they choose to expand beyond the current limits put on them, they'd have to create a separate entity to do that. Georgia Power is cert, and he does that now. In their street light business, they have a separate entity that does that. If you look over probably the biggest thing we worked on with Senator Gage was on line 84. We're talking about resonances and, you know, apartments and multifamily. We tried, we worked real hard in the last day or so to get a good clear definition of what those are and how they're charged. And I appreciate everyone's work on that. Jenna Dolly really helped us a lot. I missed that line number. What line was that? 80. Yeah. 84. 84. Yeah. Thank you. Worked very hard. I really appreciate their work and clarifying that. The only other real change from the other day is we get over to the revenue side section, you know, part three was that, you know, line 314, removing the sunset. As we talked about the other day, making sure that our exercise tax keeps up with inflation. As we want to make sure we're fixing those roads and bridges. And then on line 337, you know, revenue wanted us to go to one description of electricity. And so we use that as nine kilowatt hours. They were very helpful in the last day or two. There were some of the different groups questioned that nine. They met with them the last day and came to agreement that that's acceptable. And I appreciate revenue and G dot working on that. Senator, again, you give it and make sure we mention kilowatt hours, not kilowatts. You're good. You got it. You can rest easy this weekend. And then there's just a little bit of cleanup language. And I was just looking through it this morning. I come 394 just a little bit. But that's the bill. Mr. Chairman. That'd be glad to ask any questions. Throw any. Any members have questions for Chairman Jasper's? Senator again, you're recognizing us for questions. And I had done the math, but I'm sure you've got somebody that has. When I look at the compressed natural gas, you're talking about 110,000 BTUs. And then when you go.\n\nto liquefied natural gas or LNG, you're talking about 6.06 pounds and knowing that the expansion rate on natural gas from LNG to just natural gas is about 600 to 1. Are you positive on those math numbers there? Those are on 3.39 as good as I can be. Those current laws are 6.06. I'm not done the math. With those current laws, it's about to confirm that. On 3.39, we're just talking about the LNG being 6.06 pounds. There's quite a volumetric chain from LNG to just natural gas. I'm thinking about how many cubic feet that's going to be. I'm looking at line 335, standard compressed natural gas. I've got you there 110. Btu is fine. I'm just wondering on the LNG. That can also be done in Btu as well. I think they chose to do it in that. I think that would be from... I'm going to have to do the math. Both of us have to do it on that answer. I do believe to find that out. The current law... You might have should have called that. Years ago. You had mentioned in your earlier presentation that your version included hydrogen. Oh, yes sir. That's just one line above that I noticed. It sure does. Looking to the future, especially on heavier trucks. It looks like there's a lot of research being done on EV, class A, big trucks. But I think the idea you see in other countries is hydrogen is going to be the energy use of choice for that. So, we capture that. Other questions from committee members? All right. I have two people signed up to speak to the bill. We'll hear them real quick and then take action. Mark Woodall. Thank you, Mr. Chairman and members of the committee. Of course you want to start off. Oh, Chair Club, legislative chair, our three million members and supporters. 75,000 in Georgia. We want to start off as we have been doing with commending leader Gooch and Chairman Jasper's. And let's see, Mr. Chairman, you own that study committee and Senator again. And Senator Robinson, I believe. Most informative study committee I can ever remember. And certainly the most pages in your report, 700 pages. And we support most of this bill. I mean the kilowatt per hour, Charging is definitely way to go. And the territorial act language. And I'll certainly defer to Commissioner Ag here, all know that, the act language. But we do think we'll be in premature to put this new tax in. If you refer to page 60 of your 700 page report, you'll see that Georgia will be only the fifth state to implement one of these charging fees per kilowatt hour. And the highest so far in the country is Kentucky at three cents, three cents per kilowatt hour. Oklahoma, which goes into effect in January of 2024, is going to be three cents per kilowatt hour. And we appreciate the DOT and Department of Revenue trying to explain this to us. But it looks like that we would have the highest charge in the country at about 3.47 cents per kilowatt hour. And as you may recall, we have the second highest annual fee for EVs in the country. So I forgot to commend Governor Kimup on his initiative, Emobility. I think we're looking at $23 billion in investment and 28,000 jobs. So we're looking concerned that Georgia would have the highest fee, charging per kilowatt hour. And the second highest annual fee for EVs. We think we ought to be incentivizing EVs. But as we heard during the study committee, the head of GM's electrification department, and other people said is the motor fuel tax of trouble now is all these higher efficiency cars internal combustion engines. Now EVs are going to be a problem one day, but not right now. So we think 2025 is way too soon to implement a new tax. And we got the GDOT, big pilot study committee on road use charge. And we'll have some facts from that in the year two. And I think we have some other unintended consequences. All these they call them non network charges or destination charges, as we talked about in house technology. They cost to understand about one third of what the network charges cost to install. So if people have to spend all that money to charge, we think a lot of them will get shut down. And we think we might lose a much of charges. So anyway, for all those reasons, we would ask that you remove this new tax until we have more facts. Or at the very least do what charge points suggested in delay it to 2028. Thanks, sir. I do note that it doesn't kick until January 25, which gives us two years to review and analyze it if this passes. Of course, I'm receptive to any amendment to reduce that tax rate in the meantime. We always appreciate your perspective in your thorough analysis. I'm going to recognize the majority leader for question or comment. Mostly a comment. Thank you, Mr. Woodoff, for being here again today. I want to make sure the committee understands that what we're doing in the conversion of this from gasoline to kilowatt per hour is the equivalent of the current gas tax. We're not marking it up higher than what we're already paying. So it's important to know we're not trying to increase the cost on the electric car more than the gasoline or diesel engines. It's exactly the same based on the conversion of the energy. Furthermore, it's important we get this in place today because the 135 million dollar federal grant that's coming through GDOT this year for the RFP, for these contractors to deploy these charging stations. They need to know what the technology has to be retrofitted for. So it's good to know that there's going to be a meter on them. It's going to be a charge for these public stations to be able to collect the tax and submit it to the state. So we need to get this in place now. There could be changes in the future. If we see we miss something, we'll tweak it when the time comes. Thank you. Other questions from Mr. Woodoff and committee members. All right. Thank you so much for being with us. Mr. Doug Teeper. Georgia Conservation Voters. Thank you, Mr. Chairman and members of the committee. I'm not, I'm going to be very brief. I want to thank all the members of the study committee and all the members who are here today. This has been a big project looking at how we're doing the transition from gasoline or internal combustion engines to electric vehicles. I'll cut off the rest of my comments by saying I'm with our governor, Kim, who's trying to promote Georgia as the electric vehicle capital of the country. I want to make sure we don't kill the baby in the crib by putting too much taxes on the motor fuel transition to electricity. I know we need to maintain our roads and our bridges and I'm all for that. I drive down the cab avenue and believe me it needs something there. But I do want to say that on line 337, the line kilowatt hour, I am concerned that we don't want to be known as the state that taxes the most. I also, leader Goog, I appreciate your comments about us having to definitely tax on that. But electric vehicle folks are also paying the extra $200 and $17 a year as well. So I'll stop there. I just want to thank you all for your work on this. And we're very encouraged by the state of Georgia, engaging in this process and being ready for it. But we just want to make sure my organization has called Georgia Conservation Voters. I sometimes feel like we're Georgia conservative voters as well, so we don't want to tax too much. Thank you. We don't have any questions. You do charm us all there. Thank you. All right, what is the pleasure of the committee? This will be on the committee substitute HB406 LC393918S. Got a motion to do pass from Senator again in a second. A majority leader gooch. Any discussion or further proposed amendments? All right. How you get on this hot tax rate to their Senate again? Senator Summers. Mr. Chairman, may I be a question for Senator Gooch, Major Leader? Could you on 337, where everybody seems to be concerned about the kilowatt hours? Could we have something in there that kind of said we would take the average of three states or something that kind of gets away, where we stay on the same level? I think that is determined by the Department of Revenue. It will be determined all the way. Yes, that's why it's written the way it is. They will have the authority to regulate that throughout the year. That's why there's a lot more than clause in the bill. All right. Any further discussion? All in any proposed amendments? All in favor say aye. Any opposed, like so? All right. Passage unanimously. Thank you, Chairman Jasper's. I want to let Senator Gooch carry this for you, whether he wants to or not. I'll try not to let you down. I'll try not let you down, Chairman. Okay. Last bill on our agenda today is House Bill 458 represented purple. This concerns hemp farming provisions. We have seen it before. The Senate on the floor and didn't make it across the finish line. We felt like it made any little work and we'll see what we can do here with the House version. If you will just take that podium spiner, if you're more comfortable in the middle of the witness chair either way. You can't absolutely sit right there in the middle of the aisle. Any House germs on you? I promise you. Okay. We do not have a committee sub to your bill. We're working off your original bill as past the House. Thank you, kindly. And of course we reserve the ride if we learn things through the committee processes. We've got this to make tweaks and changes and anything you might recommend. We'd be happy to hear. I'll talk with you. We need a lot of educating on this. If you'll just tell us the purpose of you bill and what it does. And we may ask you a few questions and I have it looks like probably 10, 12 people signed up there. But like we heard just to give the little road map to the audience where we're going. We're going to hear this today as thoroughly as possible. Do not intend to take action on it. It's 442 right now. We are scheduled to meet till five, but I am certainly willing to go longer. Five, 30, maybe even the longest, as long as to hear as many people as I can. We will also have this on the agenda on our Tuesday meeting, which is at 4 o'clock in the afternoon. Same place here. So if you don't get heard today, don't storm out them huff because you'll have another shot. If we don't reach it, we'll hear you on Tuesday before we take action. All right. Floors, yours there. Representative. Thank you, Mr. Chairman. HP 458, LC 51-0363S is the, is the LC number that I'm working off of. There was a, we just had Revival at church the other day. Pastor got up to speak and he said there's nobody more unworthy to speak and bring to gospel tonight than me. And I feel kind of like that here because I was one of three no votes on the inaugural hemp bill that we're operating under now in the house. My good friend, one of the closest friends of half in the house, John Coulbert, cared to be on the voted note. But so you might ask, well, why in the world are you carrying this one now? All right, hemp in the state of Georgia right now is a hot mess. What we're looking at is, is problematic. The Journal of American Medical Association showed last year that they did a study found 76% of the CBD products they tested were inaccurately labeled. 76%. This is what is consumers in the state of Georgia are, are using. We have no idea what's in the products now. We have no idea where it's coming from or who's selling. So my intention here, there will be people speaking probably after me that will be in favor of this bill. Some think it should go further than what this bill does. And some might have concerns where this bill is. What my intention of the bill is to put the guardrail in place in an industry that we currently have in the state of Georgia that desperately needs it. Currently, a 10 year old child can walk into a store and buy 100 milligram THC gummy. And it is completely legal. This should change. Currently, right now, we can have your chance to speak. If you've signed up, let's be respectful to anybody speaking. I want farm guardrails in place. This legislation puts those in place. It has the potential to help farmers. It has the potential to help retailers and has the potential to help processors. It will absolutely help consumers. I'm going to walk through this bill in a 30,000 foot view. I'm going to walk through both sections, but the chairman says when you walk through it, walk through it quickly. Section 1 creates a language for a full panel certificate of analysis by an independent and accredited laboratory. Lines 33 and 34 specifically addresses that THC levels must not be more than 0.3% on a driveway basis. It does not include the language. That's what the federal language is currently. I used specifically the 0.3% rather than the federal level. If the feds adjust upwardly that level, we would need to address that someone here in the legislature should address that later. I included tolerances in the bill to ensure that the standards would not be extended automatically. The balance of Section 1, and this is kind of important, that it provides definitions and maximum tolerances of pesticides and heavy metals, residual solvents, impurities that should be in the product. Section 2, 3, and 4 address licensing requirements. Hemp growers will pay $50 an acre as it is now, with the maximum license fee of 1,000 processed permits, 5,000 annually. This will include background tricks that will be streamlined for growers and processors. Section 5 is new language. It retailers and wholesalers of Hemp-derived products will be required to purchase a license issued by the Department of Ag. This is the section 6 of the bill for me. This is the truth and labeling portion of the bill. All consumable Hemp products sold or distributed in Georgia must have a QR code on the packaging that shows a passing result of a full panel certificate of analysis. It shall be done by an independent laboratory. It also limits the THC preserving. The language will get rid most of the unsafe and mislabeled products that are on the market. That is what Section 6 will do. That is that truth and labeling requirement. 7 and 8 allows the Department of Ag to create rules and regs to be in compliance with federal law. Section 9 provides language to prevent the purchase of consumable Hemp products under the age of 21. That is the overview of the bill. There will be some here that probably want to expand. I'm really not that guy as I talk to the chairman today. I'm kind of like those of you that are older on the panel will recognize the reference perhaps. I'm kind of like the church lady on Saturday Night Live. I'm a pretty straight air and I just want guard rails in place for this bill. The genesis of the bill is the industry needs guard rails right now in the state of Georgia. Is this the perfect bill? I don't know. Probably not. But does it make it better in the state of Georgia where this to pass than what we have now? Absolutely. What was the vote in the House to you recall? There was one no vote. It was 169 to 2. Committee members have questions. 169 to 2. 169 to 2. Senator Lucas do you recognize for question? What is the federal law on the THC? It's 0.3% on a dry weight basis. Now ought to face looking at doing something to redo the rules on this team. Senator thank you for the question. But I have I've quick counting on Feds to do something that they say they might do because it inevitably drags out a long time. So I can't answer that question accurately. You've got to forgive me for some of these just basic questions but it's kind of new to me. That 0.3% is for the raw product in the field basically. 0.3% and I have a phone friend here. I have a respiriant here that is exceedingly knowledgeable in this area. And I wouldn't mind for him to speak to that but is it? He signed up. We'll get to that. Because I wonder is anybody or are there any federal rules as to the consumable products, the gummies and the things that are being sold, what their percentage concentration of THC is? It is still 0.3% on a dry weight basis. Even on any product made out of the hemp. That's correct. It can apply also so for the farmers and I talked to several farmers a couple of weeks ago. It happened to be a farmer but not a hemp. And there is a way to remediate a hot field. So if it tests more concentrate on the THC which is a psychedelic part of the thing that makes you high on this product. If it tests hot there is a way that you can remediate that down to a below the 0.3% level. However, federal law requires that once it is 0.3 or higher that it is marijuana and it has to be destroyed. And there is nothing in this field that will allow us to go something beyond that. All right. Other questions? All right. Thank you. Thank you. I'm going to let some folks from public speak here and let's find out their thoughts. Is it Rushman Bush? I'm only going by your own hand right in the best I can. Roshan? Okay, I'm sorry. Lalu Farms. Lila. Yes, correct. Okay. If you would introduce yourself to us, tell us who you with and what your views are on this bill. I will. My name is Roshan Bush. I live in Rinking, Georgia. I'm a partner of a company that was originally one of the six hemp processors in the state of Georgia. We no longer process in the state of Georgia, however, but we still farm. We have production facilities and as well as retail stores. Currently, I have 11 retail stores in the state of Georgia. Two weeks from now, I have a FDD dropping for franchising. 26 stores are on hold right now to go into Georgia because they're not sure how Georgia is going to go with the hemp rules. I can give insight or question answer questions for you guys that have to do with the farming side, the extraction side, as well as the retail side. The bill as a whole, I have zero problems with it being presented as guidelines. However, changing the federal meeting, as far as the THC delta nine, 0.3% to including all the isomers and polymers I don't agree with. But accepting the federal rule on destroying a hemp crop that can save a farmer is like taking pieces of the rule and applying it. If the crop can be saved on the farmer side, why can't we implement that if we're even if it's sideways of the federal laws. Save the crop if you're going to implement the entire rule the way you want to do because that's going to put the farmers in a tight situation. You take away that, take away the THC, HACs, everything else that goes along with it in the isomers and polymers. Follow the hemp, the federal meeting 100%. That's all I'm requesting. I got two issues with the bill. Everything in the bill that's guidelines that he's set forth. I'm pretty sure everybody that's in here in the retail side goes by those guidelines already. If they don't, that's the sketchy stories that you want to get rid of. Those are the sketchy stories I don't want to compete against. Every single one of my products currently, third party lab approved testing federal level. All under federal law, less than 0.3% in weight for Delta 9 THC. All of them have QR codes on them. I have not until now heard about federal testing of these hemp products. What is the agency doing the testing? SJ Labs does my testing. But what's the federal agency? They're contracted out. So their process has to be approved by the government, by the federal government. So there's chemists that sit in the lab. They have to sit there and test these products. And they have SOPs which are written by the federal government that they have to follow in order to determine what's what. Are you required to go through some type of federal testing to sell your products in your retail stores? I'm not, but I pay the extra to do it. And so all the products that you sell at the retail level have already been tested by SJ Labs or somebody called. Correct. And why do you do that? Because I'm aware of the issues that he's presenting for. But the way he's going, not the way you're technically going, but I'm just speaking about the bill. The bill, it kind of narrows it down so difficult to operate and continue to operate on a business that's been thriving. And the state of Georgia is going to be detrimental to retailers to pass this bill the way that is written. I'm not a user. I've never done a drug. I never smoked a cigarette. But I can tell you every day my, my model is a school teacher for 17 years. COVID happened. They really didn't care about how the teachers were being treated in schools. I opened her a store. She now runs her own store. She can tell you. She's here. She can tell you. Every week there's somebody that comes in and thanks us for having the products we have. And the ones that are thanking us aren't thanking us on anything around 10, 25 milligrams. These are people who have mental issues, addiction, who need higher milligram dosage. In making a cap on the milligram, you're creating a situation for those people not to be able to afford to have an answer legally. They're going to go to the street dealers, which right now street dealers around my stores are they come into my store to try to see what we got going on. Everything I do is within the law. The federal meaning. There are zero issues that I've ever had with children being 10. You are correct. I heard a bunch of no saying, you know, no, a 10 year old can't come in a store. No, they may not be able to come in your store. They can't come in my store and purchase, but they legally can. I'm going to afford a 21 and up. You look at any of my stores. I'll give you all the addresses. Take a picture of it. Look at it on Google right now. You'll see only over 21 allowed to come in. It's on my doors. Why is that? Is this dangerous to children? It's not dangerous to children. It's dangerous to be unsupervised. I have people. So I have a lady. I own liquor stores as well. I do drink, but I don't. I'm not the church lady. So I do own liquor stores and one of my liquor reps. Her son is six and was hit by a car in front of her house when he was four. He has a ton of seizures. She came to my store was telling me about the seizures had to leave. I said try some CBD. High milligrams dose. Start giving their son around 300 milligrams a day. He's now having one or two seizures a month. So there's all these stories that we hear at the forefront of the retail side that you all have no idea about. And you'll read a study. Studies are great. Studies are not 100% applicable. You look at all the products that you mentioned that were purchased in the state of Georgia. How many was it? This was not just the state of Georgia. The KMA added 150 products. Okay, you take 150 products. Where they purchase from actual stores and storefronts. Where they purchase from gas stations. Where they purchase from CBD stores that act as dispensaries which follow all the rules that aren't even written yet. Where were these studies done? What type of lab? What were what was it a product already grown and extracted and made in Georgia like mine? It's so many out there so many from overseas. There's so many things. And in a lot of these packaging where they can go and purchase things. Retailers will tell you those packaging you can buy on Amazon and seal them at home with an iron. Do you test the products in your store that are made overseas or out of state or do you sell anything that's not a Georgia product? No, I sell things that aren't Georgia products. But I don't sell anything that doesn't come to me with the COA. I don't sell anything that's made overseas. I saw it was made in North Carolina, California, South Carolina, Georgia and Florida. And when I get a product and it has a COA, I already know enough to look to see if it's a funky looking COA. It's always stand for, I'm sorry. Certificate of authenticity. So you can do full panels which I run. Certificate of analysis.\n\nThat's correct. So I run full panels. If I buy something, let's say you're on a company you call me and say, hey I want you to carry my product. Okay, send me a sample, send me your COA. I get your COA. As soon as I get your sample, it sits in my office. I take your COA, I go over it. I take your sample, I mail it out to be tested. Those COA is better match for me to sell it. It costs me money to do it. But it also keeps me out of y'all's hair and out of the legal realm. That's what we're all okay with that. We already mostly do that, the retailers that are policing themselves because four years ago, well five years ago when I started this, I knew they were policing what come. So why not already enact as the law would probably be written. That's what I've done. That's why I'm going to afford the bill except for those two sections because the lower milligram is not going to help your vets that have PTSD. Who wants a whole bunch of vets up here protesting against this bill once it passes and making issues. And I'm going to tell you this, I know this from first hand, I have a partner store in downtown Savannah. So heart recipient on 17 pills came to my store in Port Wentworth, purchased our our edibles, tried them, came back and said, what can I do to have one of these stores. I'm awful all my medication in one month. One month. He's not able to be here because he's going through a divorce with my personal things but his life and quality of life is 10 times better than what it was on pills. No, your products have Delta 8 or Delta 9 in them? No. Do any of them have either of those ingredients? Yeah, I got Delta 8, Delta 9, Delta 11, every single one. I got CBD, I got THC free products for people who get tested at their jobs. I make every single product be able to be useful across the line. And Delta 8 and Delta 9 understand there, there's not a good one in a bad one. They have different effects on people. That's why I isolated all of them and I use them by themselves. Have you had any of your customers come back with adverse effects or complaints or problems overdosing, anything like that? No. Okay. I'm going to cut you off here for a minute because we're going to be short. I'm going to allow a few questions for you. And then I'm going to encourage you to please come back on Tuesday afternoon. I'll be here. You are apparently vertically integrated. I have a growers license, a processers license and you retail stores which at this point do not require any licensing, right? The retail stores? No, they don't, but I'm fine with it. You're willing to pay 5,000 a store? I think it should be a 7% tax on wholesalers. That's what I think. Any committee members have questions? $2 billion, 7%? I'm going to recommend the recognized Senator Brass first. All right. I just want to make sure I'm clear on you said you're two concerns about the underlying bill. So is the cap, is that the 25 milligram per individual dose and 500 milligram per individual package? Correct. It's on 52 to 56. So lines 2, 65 to 267. 2, 67. Okay. So you do have a copy of the bill. Okay. Okay. Perfect. So that's one of the reasons. So you're saying there shouldn't be a cap at all or should it be higher or I'm saying is there a federal cap? No, there is. Okay. Only on the amount of THC per dry weight, per unit, like per piece, if it was an edible or a smokeable. Okay. So the package, the package cap of 500 milligrams? Fine, but not the piece. Okay. So that's okay. The piece where it says 25 milligrams kept, that's going to affect people purchasing it so much. Yeah, I see where you're coming from there because if you... If you need 150 milligrams of function, you're forced to go buy a lot of 25 milligrams. That's cost in our production cost to go up and the cost to get the aid to the consumer. Your packaging gives up too. Yes. All right, I got you. And then you're saying that .3, you were saying we're following federal all throughout this bill except for that piece. Correct. Because you're including all the isomers and polymers as well as anything outside of Delta 9. THC Delta 9 is what should be measured following the federal law. And that was done on lines 261, the .3. It was done anywhere else? 52 to 56. And there's anywhere else anybody can let me know? It's the only state Delta 9, THC Delta 9. All the polymers and isomers that go along with that are not mentioned in the federal law. Okay. No question. I just want to make sure I was straight. Thank you. So part of what we're hearing and what's generating this public outcry is that that federal law has loopholes. And one of those is Delta 8 that may have same effects or even maybe worse or what not. So that I think is why this bill was trying to identify isomers and etc. of polymers and things that might make other components like a Delta 6 through Delta 10 or whatever have the same effect as Delta 9 which was addressed by the federal law. How can we get to that? How can we close that loophole other than identifying these isomers, etc. Testing for them. I'd will I call it a loophole? Yeah. I'll agree with you as a loophole. But Delta 9 in its strength and in the quantity that it's grown in a marijuana plant is more effective. Fools time stronger than Delta 8. You take Delta 9? Look at 25 milligrams of Delta 9. Look at 25 milligrams of Delta 8. You have a heavy consumer who uses both of those. 25 milligrams of Delta 9 is going to go two times as longer and stronger as Delta 8. Delta 8 is a cure for those people who need that longer and stronger but they have to get it a couple more times already. It's already like that. All right. Senator Somers you've got to recognize for a question. Thank you Chairman. I appreciate you doing the testing. I like that. That's very you're I think you're way ahead of most of where you're you say you had Georgia grown products? Where are they coming from in Georgia and is the company that you're buying from testing them? The which one though? The plant? Oil? Yeah. Yeah. We get oil in plant so what we do is we get a percentage of the farms that sign up with us to process with. Are you excuse Mr. Fowell? Are you processing those oils? You have the equipment to process this oil? Are you buying the oils? No, we have the equipment to process it in North Carolina. You're extracting the oils and you're bringing them into Georgia? I test them and bring them into Georgia. So we're trying to get also we're trying to create a Georgia grown quote quote and that'll that'll that'll never happen and it sings pretty for the one processor that's left in the state of Georgia. That that makes no sense for any of the retailers. None of the none of the farmers in Georgia are going to be able to support the money that's already being made in this industry and the move hemp cross state lines is completely legal. Move marijuana cross state lines is not legal. So we grow up. I mean, I don't deal with marijuana. But it can't go across. So ours is extracted North Carolina. Our COAs are all done in SJ labs in Georgia and all of our products for our stores come straight from this state as much as I can use. But you do that. You don't have enough farmer support because there wasn't none in the beginning for the processors. Georgia did it backwards. So when when when I went and got a processor license for $25,000, there was nobody to process. So it's like survival of the fittest, right? Right across the state lines in South Carolina, $5,000 for the same license. Go up North to North Carolina, $1,000 for the same license and it could be in your backyard. There's differences. So once Georgia made it difficult for the processors, now the processors are like, why should I renew this license? Then they increased it to $50,000 for renewal. For what? So why are there no growers in Georgia? I thought we had 140 licensed or something. No, you you you may have 140 licenses. Check to see how much pounds they're growing. So why couldn't you get enough business to survive as a processor here in Georgia? Because the amount that we use in the state of Georgia, Georgia can't grow and you can't process it fast enough. There's a process to processing. So if you if I spend $3 million of my own money and I set up the top notch top tier processing that I would choose to use which would be softened list, which is what I currently use as softened list. So there's no softens in my products, no heavy metals none of that. So I use that $3 million I'll be able to probably push through around in a day running 24 hours on a push button system on a $3 million system. I'm probably going to be able to do 50,000 pounds. 50,000 pounds in Georgia grown light is going to give you oil that is subpar to California, Florida, anywhere. Unless they grow indoor, once they grow indoor, that's a smokeable flower. Nobody's going to want to extract that. It costs too much. So you got to sell it up here, not down here. Georgia outdoor and grown flower is not that great. It's not that great for processing. It's not that great for smokeable. It's not that great for consuming because once you get a oil, it's not just oil. You have to look at your percentages of all those THCs and all those CBDs and CBGs that you see in there. Not happening from our light. Last one, the inner summers. Last one. You're okay with the testing, obviously. Yeah, of course. 100%. So these products that we don't know where to come from, China, Mexico, wherever, that would take care of that issue if we did the testing, don't you think? Yeah, if you required it and if you follow it up and police on it, of course. But that's not going to stop China and everybody else and wholesalers from bringing it in and people in stores purchasing it that don't know. So what you said is we crippled the Georgia people to do this by allowing other people from other states just to bring it in freely. Well, yeah, you do. It's not, it's not, it's no way to police it. And even if it, if it comes in, wholesalers get it, then the wholesalers push it out. So the first issue is gas stations. That's what everybody's going to say. Gas stations, gas stations, gas stations, right? Going to gas stations, see what they have. Ask them questions. They're not answering the same things that we're able to answer or guide the customer along the way. It's not an experience. It's not a learning experience. So I can get where that bill could be helpful. I understand it. I agree with it because all in the end, you got to look at the consumer. I had no intent on making this a franchise. I had no intent on having 11 stores. I had no intent on telling my mom she could quit working. No intent zero. I initially started this because I enjoyed the research that I did and learned about the health benefits of this plant. That's where it came from. I don't even use it. I can grow it. I know how to grow it. I know how to process it. I know how to make it in the products and write formulation calculators to make products that help people. I get people that come into the stores and say, hey, I buy this gummy of this THC and I buy this gummy of this CBG. This is how many I'm taking. What are you taking it for? Oh, I get the shakes. I got I got a L S or yeah and it helps me with my shakes. Okay, give me one week. I'll formulate you just a gummy and I'll put it in all my stores and let people know this helped you with that. Now, I'm so I got 60 70 different combinations of the gummies that help people that sell and they're all more than 25 milligrams. One more question. Last one. So you extract the cannabinoids yourself and change the gummies and and make them in the gummies. Yes, I have a kind of set of cannabinoids out the oil and make them in the gummies. Correct. Impressive. Now again, with that same process, you take Georgia oil, take California oil. I can make more gummies with the California oil, even though they're both a leader. Then when I came with the Georgia, because I stay consistent on my product. So the percentages of the TAC have to be the same, not the amount of the dissilient. Again, you recognize for question. Thank you, Mr. Chairman. What do you repeat your name for me? Rishan Bush. Mr. Bush, I was the only question I had, but I want to compliment you. I know nothing about this subject. I can answer all. You truly sound like an expert and I want to thank you for coming in test five. Thank you. I appreciate it. Thank you. All right. Thank you. And we hope to see you back on Tuesday morning. Thank you. I'll be forward to looking to see all the odds. My first time speaking in front of everybody. A little nervous, but you dig right there. Thank you. All right. I'm kind of thinking we might need to have a little sort of read, maybe lightness up just a bit. And so, Aviva, the puppet, woman, if you would take, can you do your show from the podium? Doc, you don't have to pass those around. I'll put them in folders if we need to. Go ahead and tell us your thoughts in an entertaining way, please, ma'am. Thank you, sir. Thank you. I am between the four and against on how you signed up. So I'm picking you to sort of say what you got. Thank you so much for having us. We have a gig in Alabama on Tuesday. So we're so happy to be able to speak with all of you today. Tell us whose way is. Oh me and my ukulele. Skribbles is probably not going to make that one. Well, we'll talk about it later. Okay. So my name is Aviva Vizela. I'm the founder of the Georgia Hemp Economic Revival organization that's been around for 10 plus years, educating as many people as we can about what some of what our previous amazing speaker said. And we also send emails and writing as many people as we can to hearings like this with all of you amazing legislators. So get to the point, ma'am. Okay. Okay. So my point today is that, well, let me just talk. Okay. I think that you all don't know the difference between hemp seeds and CBD. Skribbles. Well, when I'm trying to say this, his hemp food is grass. I think it's pronounced grass. Generally recognized as safe. And in 2018, you know, there was a really big federal push for Americans to grow hemp food. Why is that? We get it all from Canada and maybe a little bit of China. That's $700 million a year of imports. Wow. That's a lot. So how much do you think Georgia spends on that? I'm not sure, but I'm pretty sure would help the Georgia economy. We've grew some more food here. That's a really good point. And I think these legislators are just scared that it's the same thing as Canada, but my extractions, you might be right. Has anyone here tried hemp seeds or hemp food? Do you think it'll make you high? Because it doesn't. It's big. Do you guys eat bagels? Do you have poppy seed bagels? Well, those are from the opium plant, but you don't have a problem with that. Why wouldn't you have a hemp seed bagel? That's a really good point. Plus, my favorite food is broccoli. That has a dietary kind of annoyed beta-cario fluid. Wow. That was impressive, Skribbles. That's true. And the processing fee for broccoli is not $5,000 in the state. That's a really good point. So do you think the processing fee is limiting farmers from going hemp for food? Because I think food is about $100 to $300 a license here. So we think it'll be a really good idea to just categorize a different license for hemp food. Because malnutrition is very unsafe and hemp food has so much nutrition in it. We think that it will don't forget to tell the mind's of being processed for CBD too. And also, breast milk has endocannabinoids and Skribbles. Let's keep this. Well, it is true. We have an endocannabinoid system. And there are two cannabinoids that we make when we're nursing babies, and they actually help babies to be stimulated to actually suck the breast. And without those cannabinoids that we make, then that wouldn't happen. And I might have to overdub some of your thoughts with that. But anyway, I think that everyone knows what we're talking about now, but we have a handout and that has education. And we think they're not too subtle to anyone, but Georgia has been a little backwards. So we think why not take a step back and just create cannabis education day and just educate people about everything? Because that'll help us legislate. So if you were looking at the handout, you see our proposed cannabis education day, whereas George Washington did not chop down a cherry tree. It was cherry cannabis, whereas food is nutritious. It has magnesium, manganese, potassium, omegais, root juices, cholesterol, all kinds of things on that fact sheet. We feel like we would like other people to talk, so we will bring this to a close. We thank you so much for letting us talk so wrong. We know that was more than two minutes and that was amazing. And if you have any questions. Hello, I think the rules chairman, Senator Rass has a question for you. Thank you, Mr. Chairman. If you allow, I've got a question for Mr. Skribbles. That would be just fine. Mr. Skribbles, I've never had that attention before. Well, I'm just curious, Mr. Skribbles. Are you a unicorn? Is that a horn? What's going on there? Are you a unicorn? Is that the thing on the middle of the head? What is that? I get a lot of knowledge. It's not cannabis that DNA turns to the left or anything. It's just a little bit indeed sewing, but it connects me to my planet. It's my antenna. And it's a, you know, children do think I'm a unicorn hybrid of some sort, but I'm just kind of like a fraggle like puppet thing. Follow up, Mr. Chairman. Last question, there's other speakers in addition to Mr. Skribbles that would like to be heard. All right. Go ahead of you. All right. Well, we'll just Mr. Skribbles, where exactly are you from? Good to come and teach about that. Go ahead and start there. Go ahead and I'm not home. I want to go home. It's okay. It's kind of a touchy subject. Okay. Lisa Gano. Okay. Right. I was curious. I know. Hi. I'm Lisa Gano with Bay Pride and I feel kind of nervous here following Roshan because I'm not as knowledgeable as him or as entertaining as Mr. Skribbles. But I've been, we've been in the business. We've had retail stores since 2011. And as Roshan said, it's always been the 20, once we had age of 21 for anything, that's what the people had to be 21 to even come in. So a lot of these things we are in total agreement with with the age, with testing. It is already to wear before anything comes into our stores. Do they have third party testing? We want full panel testing. We want to have that QR code that must be on our, anything that comes into our stores for us to sell. One of the things that I'm concerned about is with the portion with a 25 milligram and the total of 500 in the package. If we do that, of the total skews I have in my stores right now, 65% of them would have to be removed. And of that 65% 57 of those are currently taxed on the vapor tax. So all of those would have to be gone as well. That's my biggest concern of how much that would be missing from my stores. Everything else, I completely understand the framework on this and I think we do need to do something because you do have bad players in the game and those people who don't want to abide by these things do need to go. I'm short and quick. Is there? That's all I have. Any questions? Senator Brass, do you recognize it? So on the, you said 67% roughly would have to come out of your store. 65% 65% 65% of the current skews that I have today. Is that because of the 25 milligram or because of the 500 milligram or both? Okay. All right, that was it. What type of time period would you need to exhaust that supply without just throwing it out? I mean, if we, we can change the effective data this or schedule it so that you would have time to sell that in the normal course of business. I'm usually ordering order things like on a three-month time period. So, but I usually have some leftover. I'm not out. So over three months, so three to six months, I would say. All right. To make sure. Thank you. Chairman Summers, you're recognized. Mr. Chairman, thank you. Nobody seems to want to do the 25 milligram because I be just, is it not enough for people? Tell me, tell me, were you missing on this 25 milligram? On some things, well like in some things don't come that way. It's like a cream. I have a cream in my store that would have to be taken out because it is over the 500 on the total. There's not a purse serving on that. The purse serving would be unlike the gummies or the edibles. That is not going to take it. That has nothing to do when it's say, cart or a disposable. That's being baked. So those are pretty much all of those would be gone. Wow. It's crazy. I mean, yeah, it affects, it affects a lot of things. And that's why all of the disposable's, all of the carts, those would all be gone and the excess tax would be lost on all of those. Sure. What famous chairman, Kwella, if we limited it to 25, are you telling me that possibly people need a lot more milligram, they're just going to take a bunch more gummies and then have to pay a lot more. On some of those, yeah. Is that where we're going here, guys? And you just pack it all in. So to get where they need to be, is that what? On some of these people, yes. So what would be a limitation? What would be a number? Well, it comes in because some things aren't, that's only on the edibles. So you have those that some of them are larger than that. They could be 30, it could be 50 on those on milligrams. But a lot of things that to me on the 500 milligram total, that's even a bigger issue because that excludes many other things that would have to be gone because there's not a per piece. Can people overdose on these? Not that I'm aware of now. Your vape store, do you have THC vape cartridges? I do. Yes. And are those felonies? I'm seeing nothing vaping that are getting arrested for this. There is nothing in my store that's going to exceed that 0.3%. Okay, so that's why it's not. Yeah. There is nothing. I'm not going to have anything in my store that has that in there. Okay. Thank you. No further questions. Appreciate you keeping it brief. It gives other people a chance to be heard. I got another sloppy hand right and you have to come introduce yourself. HC Industries LLC. Can't tell if you're Cody or Jellie or tell us who you are. I don't know. Can't read. Yes, sir. My name is Cody Smith. I'm from Camden County, Georgia and I'm a retailer. I'm a have retailer. I have prepared because I do want to respect your time. I do want to go off a little bit and just say that I was one of those people that thought that you could not remediate hemp. But there is a USDA plan available online and it's actually in the Georgia Department of Agriculture rules and regs. So even though it's not codified in law it is in rules and regs. And now to my prepared statement. Ladies and gentlemen, I'd like to thank this committee for allowing me to speak today and working as hard as you do on the people's business. My name is Cody Smith and I'm blessed to have called South Georgia home for the majority of my life. I'm a small family owned hemp retailer with three stores located in St. Mary's Brunswick and Savannah, Georgia and proud to serve markets that include Fletsy, which is the federal law enforcement training center, Hunter Army Airfield and Savannah, and Naval Summarine based Kings Bay in St. Mary's Georgia. We are exceptionally diligent in procuring and verifying only the safest highest quality hemp products for our consumers, many of which are veterans and former law enforcement looking for an alternative to alcohol and prescription medication that can have undesirable and addictive side effects. I don't believe that any reputable retailer would sell hemp products to a minor and it also inaccurate that hemp is being imported from other countries like China and Mexico. I have over seven years of experience in this industry and consider myself an expert on what I'm about to say next. Georgia's competition lies right here in America. States hemp programs like that of Florida, Kentucky and particularly our neighbor to the Northwest, Tennessee, are eating our lunch. I know we can't fix Georgia's hemp industry here today but I would implore you in the future to work on modeling our own program after that of Tennessee or farmers stand to benefit the most. I know you all are tired of revisiting hemp legislation time and time again and suggest postponing this bill until next session to hear from all industry stakeholders and subject matter experts to get this right the first time before passing something that could cripple the retail market and subsequently the processors and most importantly the farmers. Getting language correct is one of the most important things this body is tasked with. These are the three biggest challenges of house bill 458 that I've identified as causing the most harm to Georgia's hemp industry and ask this committee look into reconsidering and or amending these provisions. I agree and welcome the provision related to having to be 21 or older to purchase hemp products and agree that it should take effect immediately upon the signing of the governor but I ask that all other provisions take effect January 1st, 2024 to allow retailers to transition into compliance without losing invested inventory and find new vendors that meet this bill's new labeling requirements. Moving forward as it is currently written we'll have damaging legal implications for hundreds of Georgia's small business owners. The current milligram produced limit would be detrimental to the industry and would effectively wipe 90% of current hemp products off the market. I believe the milligram limit should be based on a reasonable industry standard that the consumers are comfortable with and have come to expect. Tennessee has a similar bill to this one they are currently debating and have already removed the 500 milligram per product limit allowing consumers to get more value from purchasing a larger quantity or seeing having to purchase multiple bags. Many states have enacted full panel COA testing requirements for hemp in the field pre-harvest as well as the intermediary material used to make hemp products during the processing phase because those states ensure the hemp plant and intermediary material which is the distillate from processing meets full panel testing requirements those states only require potency testing requirements for finished hemp products. A full panel test can cost $500 on the low end where potency testing will only cost 80 to $100 and example would that would be so imagine you have a whole field of hemp material right we're talking thousand dollars a hemp it's only going to cost $500 to get that full panel analysis. When it comes to the processor they process all that hemp into like millions of dollars of distillate of that material that you process and that's only going to be $500 to test that. When it gets to the retailer side of thing or the manufacturing side of things you know the product's already been tested safe in the field it's been tested safe after it's been processed so imagine a regular bag of skittles you don't have a certificate of analysis showing a full panel that it doesn't have heavy metals and solvents because that's already been done before the hemp material has been added. So these are tested before their process? Ideally yes sir and that's a requirement for most states now it's not codified into law it's not codified whatever Matt Brass's favorite word is codified because that's what it is it's not codified\n\nThe law, right? But I will say there are other states. For example, Colorado, states that have had these programs around a lot longer. It's a requirement that once you need potency testing only to get it out of the field, right? So they want to make sure it's below that 0.3 Delta 9 THC threshold. So that's really the only requirement for getting it out of the field. They don't test for solvents and heavy metals. Once it gets to the processing side of things, before it can be brought into market, it does have to pass that full panel certificate analysis. That is codified into law in some other states. But not here yet. That's one reason. But not here yet, yes, sir. Now, I think some of the language in the bill, right? It's asking that all hemp products have a full panel certificate of analysis. So that's after you've gotten the distillate from the processor. And now, Suzy B. Anthony is over here making hemp lotions and hemp things like that. Ideally, the product she got from the processor tested safe met that full panel requirement. So to put a $563 burden on Suzy B. Anthony to get one batch of her lotions tested at $563, if she's only selling it for $20 a piece, she's going to have to sell 30 units just to break even on the lab testing cost. Whereas since it's already safe from the processor, she could spend anywhere between $80 to $100. And I do have a printout of a price sheet from a lab, ACS labs. It's not SG labs. It's not SG labs in Georgia. I did reach out to them. They didn't get back to me. But this is from Florida. Is SG the only one we got in Georgia right now? That is SG, yes, sorry. I was having trouble there. That's the only lab. That's right, yes, sir. They are the only lab. And so I mean, if we're testing, let's say I have 20 skews, 20 different individual products, hemp products, that times 500 can add up exponentially. And if we're trying to keep at a reasonable price point, 15 to $25 for an individual product, I think it's, if it's already been tested safe from the processor, just requiring a potency test so that it meets that is truth in labeling requirements, you know that a 25 milligram gummy is actually a 25 milligram gummy because the product used to make it has already been tested safe. So I would say to address that in this bill, if you were to move forward with it, is that only hemp products from out of state could be from states that have those laws enacted where the processor has to require that full panel testing before the, because that's the problem with a lot of these products now. You'll see where it only has potency. You know, I'll reach out to a vendor in Tennessee, right? I'll only get the front page. It's the potency stuff. The processor has the full panel analysis. The person that, that manufacturer got the distillate from to make the products, they know it's safe before they ever put it into a gummy or into a lotion. So the only requirement there is a potency test versus a $500 full panel certificate of analysis. If that would make sense. And I can answer any questions as well if you'd like, if I'm unclear. Any questions, Senator Brass? Very inquisitive today. Well, I'm just learning all about hemp today. It's a fascinating product. It is. So I've got a question on like your topical creams. What, how many milligrams are in a typical bottle? Or, so, and then, so this is actually a great question, right? When it comes to topicals, you don't see a lot of delta A, or you don't see a lot of delta products that are topicals. You'll see most, those are mostly CBD. And there's no limit on CBD products. Okay, so we're not limiting that. We're only limiting, okay. Well, yeah, essentially. So there's not a topical cream for, with delta A, delta nine. I'm not saying there are not. They're probably on. You sell it. Right. Oh, so there is. Okay, yeah. I don't sell them in my store. I only sell, so there's like HHC. There's all these crazy cannabinoids, right? I only sell CBD and delta eight, because that's what I feel safe selling. Right, there, once you get into the esters of the delta nine THC, that's where you get into the synthetic cannabinoids, and I don't feel comfortable selling those in my store. Okay. And that's addressed in this bill. I'm glad that they removed the provision for isomers of delta nine, because that pertained to delta eight. But so yeah, so I guess there are delta eight products and topicals. I mean, a dose would be whatever you, whatever you consider. Well, I'm not worried about the dose. I'm worried about the package. I don't know how you'd limit the dose of a, of a topical cream. Right. So in my experience, I've had CBD lotion. I've used on my back. And it's, I mean, it essentially feels like icy hot, but like the roll on, I don't know what's an icy hot. And I wasn't that it comes from a plant, so I'm fine with it. Of course. Well, there should be a, there should be a QR code where you can see the certificate analysis for potency. That's pretty much industry standard. Even if it's not codified into law, that is industry standard that you're going to have a company certificate of analysis with the product. To answer your question, there really is no limit. I mean, a 1,500 milligram topical, you're applying it topically. So I mean, it's not really getting into your bloodstream. You're not going to notice any adverse effects. You just might feel a little bit more comfortable because it removes some of that inflammation. Okay. All right. Got a question from Vice Chairman Somers. So you like the bill except for what? Great question. So the full panel certificate of analysis requirement for the finished product, for the finished product. If we can get a full panel certificate analysis at the processing stage, that's the, that's the oil, that's the distillate that you're using to make products. So I mean, it's, it stands the reason that that should be safe before it ever goes to market. It leaves the processor. And that just saves the manufacturers, $500 a pop every time they make a batch. If they get something from out of state that their processors meet that requirement, right? And all they have to go on is a potency analysis. It tells you how many cannabinoids are in it that it would save them from having to prop out $500 something dollars for a full panel because it was, it met the requirements of that state that would have the same standards as Georgia. Let's talk about that real quick. What other states do require a full panel analysis at the processor stage? Yes, sir. So I did some research this morning. I didn't write it down. But I know for a fact, California does. I know for a fact, Colorado does, Washington state does, and I believe Kentucky does. So if you're selling products in your store that are manufactured from states other than those or somebody that requires that full panel, you can't guarantee it's safeness. So I, so I, I purchase from a very limited number of states, right? So I have a vendor out of, out of North Carolina and they do have that requirement. They have a vendor out of Tennessee. And then we used to have a vendor out of Colorado. We don't use them anymore, but they meet that same requirement as well. Now the problem is is that their end product, right? Like the package of gummies or the, the bottle of lotion, it'll only have potency, right? But that's because they know that, we know they use safe product because the product that they used to make that was verified safe and met all of those standards in the processing stage. Okay. Very informative. Thank you. I'm going to have time for two more speakers. Thank you, gentlemen. Anybody else come back? I'm curious if, uh, Mr. Chairman, if all this same group testified in the house, did you have as much testimony over there? It was a, um, it was a full testimony time. Okay. Sounds good. All right. I'm going to hear before we leave today, uh, Sebastian Carlson, because you came all the way from Colorado. You happen to be next on the list so it will get you. I also have Russ Bryant here. It looks like Chris Stuperton back there and he's with the one, I think about the only open processor in Georgia. So I want to get the insight from the processor. Greg Reduc, if I had time, I'd want to hear from you too because I know your perspective on the danger sides of this. I want a committee to hear it, but it may not be today since your local stand by for Tuesday. All right. Sebastian, introduce yourself. Tell us who you are. Thank you, Chair, Chairman Senators. My name is Sebastian Carlson. I am the senior chemist of a hemp processing facility. I'm also the senior chemist of a functional mushroom extraction company dealing with Raci Lyons main courtesets, those sorts. I also own my own extraction consultant consultation business. I've been a research chemist for just under 10 years now, both in the university and now in the private sector. So I'll try to be quick. In my opinion, this bill is well intended. However, it's wildly inconsistent as it stands. I definitely agree that the regulation should be put into effect and that we should have a minimum age to purchase these products. It should definitely be 21 and up. No kids should be getting their hands on this stuff. So some issues that I have with this bill is specifically the language that's used to define a hemp product in lines 29 through 37. It only defines a hemp product as containing Delta 9 THC or esters of Delta 9 THC less than 0.3%. So by my interpretation of that language, there are hundreds of cannabinoids in hemp that wouldn't be regulated under this bill. And anybody that was making one of those, and many of those other cannabinoids are also psychoactive. So if anybody's making one of those, this bill doesn't apply to them. So that's a huge issue that I see. It also removes THCA from the definition, but later contradicts itself in 45, line 45 and 46. It suddenly brings up THCA. Tetrahydrocanabinoic acid is not an ester of THC. So calling basically expecting THCA to be umbrella affected by the ester definition, it wouldn't. It's a carboxylic acid. I've got to stop you right now. Yes, this debate has been going on in Georgia for five years. And you are the first person that has ever told us that any of these cannabinoids were psychoactive other than THC. So that's commonly known in the field of marijuana chemistry. It will. I don't deal with marijuana at all, actually, specifically hemp. I mainly focus on minor cannabinoids such as THCV and such. But that's beside the point. So tell me how many of those other cannabinoids are psychoactive? That. So there's a list of cannabinoid CB1 receptor agonists. That's the receptor in your brain that THC acts on. And there are, I think something like, there are over 200 cannabinoids found in the plant. And I think there's more than 90 of them have been found to be psychoactive. And if we solely define hemp off of Delta 9 THC content, then all of those psychoactive compounds aren't going to be regulated for my interpretation, at least. Moving along, I find that I definitely agree that there should be a standard set for testing these, especially for harmful contaminants, pesticides, heavy metals, et cetera. However, the testing limits brought up in this bill are quite seemingly arbitrary. Seems like they were pulled out of nowhere. They don't line up with FDA levels and they don't line up with similar states, like such as Florida and the North and South Carolina, doesn't line up with those states. It kind of just grabbed it out of thin air. Furthermore, it bans XOTHC as being an ester of THC, but XOTHC is not an ester of THC. It is simply the 9-11 double bond position of THC. And I guess finally, I would just want to say that ultimately here, we all want to protect the consumers, but we don't need to reinvent the wheel here. There are multiple other states that are already doing this, and FDA even has guidelines for what they define hemp as. And if we just mirrored that a little bit more, it would be a lot better for the bill and for the consumers as well. It would help boost the industry rather than handicapping it entirely. In Colorado, who does the testing? You're a processor there? Yes, I am. Is your product, or your oil, or whatever you're making out of that processing system get tested at your level or just at the level? So I do have in-house analytics, so I test everything myself, and then I send it out for third-party analysis as well to make sure that my own internal methods are lined up. But we never sell anything without an internal and an external C of A. Does the state of Colorado have its own testing labs where you have to submit to testing through their Ag Department? They have ISO accredited labs, yes. We have a handful of them in Colorado. So are you free to select whoever you want to submit your, what you can contract with any lab you want, or the system? I would only contract with a federally ISO certified lab. Does the FDA ever come in and test hemp products? No. Do they have the ability to come in my experience? How do they know whether it's 0.3% agency or not? So that's the thing is, I am an in-process producer. I don't sell products to end users. So ultimately, the seller of the product must test it legally, and then companies do get audited by governing agencies to occasionally come through and decide, oh, this isn't off. And any products that are, anytime there is a discrepancy, there's a full audit and products are usually removed from the store shelves. Sorry to interrupt you just to have a minute. Oh, no, you're fine. I lose my thought if I didn't. But yeah, that's mainly my issues with this bill is just the wild inconsistencies and contradictions. I feel like this bill is coming from the right place. I do agree with what others have said previously by hampering, by making 25 milligrams, the maximum dosage, that's, I mean, that really only comes down to edibles. Because if you look at any other product other than edibles, you're going to exceed those 25 milligram dosages. And so it basically takes smokeables off the market and other vapor style ingestion methods. Question. I'm going to recognize Senator Robertson here. Our whip for question. I appreciate you coming down to enjoy the cool weather in Georgia since you don't have enough in Colorado. I was blizzling right before I left. Love Denver and I looked at the marijuana industry there and Denver very closely visited a lot of places. And I'm curious, you said the seller must test the product or are you talking about at the retail level? Yeah, the retail level. So to my knowledge, anyone that needs to sell a hemp product in the state of Colorado needs to have that thoroughly tested, full panel tested. And that's, it's on them. It's on them to do that. But I also test it before we even send it to the final distributor so that they can just retest it, verify that it matches and we have a chain of custody that traces all of this material back. If you don't mind, Mr. Chair, do you find that the majority of this testing at the retail level happens on the premises or do they just contract this out? It is always sent out for third-party analysis. Most retail labs do not have the instrumentation required to test these. So on your chain of custody, would it come from the wholesaler to the test lab that the retailer has contracted with, be tested there and then delivered to the retailer? No. To my knowledge, it goes directly to them and then before they can sell it, they have to get it tested, get like batch representative tests done on the product before it can be sold. And what government agency audits that? To my knowledge, the FDA. Okay, so federal agency comes in and audits that? I honestly don't know who does the specific auditing of Colorado hemp businesses. Thank you. Yep. Or retailers licensed in Colorado? Not to my knowledge. I am afraid I don't have enough knowledge on that subject. I mainly deal with the chemistry side of it. I'm not too savvy in the business dealings. Mainly just what these compounds are and what they do. Any other speakers knowledgeable about that? Keep me posted or think about it on Tuesday. I'm interested to know if all states or any other states license at the retail level. I'm going to recognize Senator Lucas for a question. You're getting edgy over there? No. Okay. It is. I'm doing a lot today. That's what I'm interested in. You'll learn a lot. It's not too late and you'll learn a lot in this committee. Senator Summers. This is crazy. Kind of how picture worked your tell me, man. I appreciate your smarts here. You make the product and yourself to retailers, hotelers, what do you want to call it? If I understand correctly, two questions. Who has the best bill out there and the states you were talking about? Who has the best bill that does what we need to be doing? I don't honestly have an answer for you there. Next question. If we do it the way we're doing it, where you're kind of trying to say that we'll create a black market that will be unregulated period no matter what. Is that what you're trying to say? There is definitely room for massive loopholes in this bill the way that it's currently written. It focuses too intensely on one thing and I feel like it should loosen up on how specific it's being of the specific Delta 9 and esters of Delta 9 and realistically it should just stay as the current language which in the federal definition it is currently listed as any part of the plant including seeds there of an alderovatives, extracts, cannabinoids, isomers, acids, salts, and salts of isomers with no more than 0.3% of THC. Last follow up. Last follow up. Senator DeLukus asked one question a while ago earlier to our presenter. If the federal law changes what he asked the question would be waiting for years for it to change, am I not correct in assuming there is much higher than 0.3% that they're talking about the change? So, federally hemp is defined as cannabis sativa that has less than 0.3% Delta 9 naturally at current. So, it's no. So, why is there by think you shouldn't sell to people under 21? What's the danger? What's the harm? I mean, that's like saying should we give alcohol to kids? Probably not. Anything? I'll get you drunk. I'll keep saying this doesn't do anything to you. Well, so there are many cannabinoids that don't give any intoxicating effects but they do have some anti-inflammatory effects or other useful medical applications. However, there are a vast majority of the cannabinoids present in cannabis sativa plants that have psychoactive properties. Okay. One last question for you then we're going to ask majority percentage. So like I said, we have over 200 cannabinoids identified and I think about 90 of them are psychoactive. So, a little less than 50%. Yeah. But the way the bill is written, it would be like focusing on about 5 to 8%. Thank you. That's right. Thank you. Thank you very much for being with us and I'm happy to be here. Have you heard it from Colorado? Thank you very much. Thank you. Thanks for having me. Russ Bryant, this is going to be our last speaker. It's about 10 to 6. We'll be out here by 6. Is your wife calling? Good afternoon. I guess sitting through this, one thing that's clear to me is we definitely need a bill of some sort. We've talked in full circle here. We've talked about plant derived cannabinoids. We've mentioned cannabinoids that are not plant derived but are less than the federal level of Delta 90HC. You know, I don't know that any bills perfect anywhere where we are in this current state of the industry. But what I do think is that we're moving forward with something to try to get it right. The total milligrams that have been talked on about this, you know, at the beginning of moving this bill, that was not there and then it was asked to be put in there and then we tried to take it out and we've asked to be just 0.3 percent total THC. I think that where we're at on this bill, it just seems to me that we're pretty clear of what we can do on that. I think there's been some language change to the bill since I've actually read it in the last few weeks. I don't think you've told us who you are and who you are. I'm sorry. I'm Russ Brine. I'm Russ Brine. I'm sorry guys. My name is Russ Brine. I'm with Sickest Century Ag out of both Silla, Georgia. I think we were the largest grower of hemp last year. We're a fully operational extraction company. They're in O'Silla. I'm sorry to get ahead of myself. I'm just sitting there. You're talking about the bill. Did you draft this bill or you? No, I've just read and helped and kind of worked along with people with the bill of what they thought that should be in there and just trying to get us some guidelines. You know, I've talked with a little bit of everyone seems like to try to get some guidelines somewhere. Tell me why you feel like we need guidelines. Federal government's legalized hemp, longer than anything that's hemp, which is below 0.3% is the wild, wild west. Why do you think we need to regulate it? Is it dangerous to our citizens? Is it a competition deal? Is it dangerous to kids under 21? I need to know why we even need a bill. Speaking on different cannabinoids, you know, is if you're talking danger to children, would I want to give a child 200 milligrams of Delta 8? Absolutely not. Would never recommend that. Would I want to give them 100? Absolutely not. Would I want to give a child of CBD or CBDV that's having seizures? 6,200 milligrams? Possibly. I mean, we've seen studies there that's worked. You know, it's where we're currently at, we have no regulations. I don't think that we have many safety problems at all. The studies have been out there that it would take over 750 milligrams of psychoactive delta nine to cause problems, health problems. But I haven't, but I've heard of people taking way more than that, you know, before I've made 1000 milligrams gummies. You've seen stuff in stores that make claims to 1000 milligrams or 500. The thing is, we're just trying, we would like to see some kind of regulation to where you know that's what they're taking. Whether it's my mother, my grandmother, my dad, myself, you know, I would like to know exactly what I'm putting in my body. The topicals, you know, I don't think the topicals are word limited to 500 milligrams gum was my understanding. Clay, you have to be, because your body, you know, it works as a, a topicals a little different. Your body works as a protector when you're putting it on topically and it goes through the pore to where it's not getting into the bloodstream. So you're not going to fail a drug test topically. It's like I have an shield there. I have to take my glasses off to read. I guess I'm back with some everybody else for the C. So I guess it says any consumable hemp product should have a maximum total concentration of, this is the Delta 9. There again, what we're not addressing CBD, CBG, CBV, CBT, CBE, CBN, we're not addressing that. Those are non-psychoactive. We tried to address the psychoactive, I feel like in this bill. So the topicals, I don't think, you know, there was a statement made earlier that their topicals would have to come out the shift. I guess if that topical has more than 500 milligrams in it, it would have to come out the shift. But I don't think that those topicals are going to have 500 milligrams at two ounces or one ounce or whatever it is. So I don't know that that would be coming off. I mean, I don't know who here makes a topical with more than 500 milligrams on a roll on or a bon or anything. I'm going to recognize Senator Lucas for a question. Let me. We're saying 500 milligrams of, I'm sorry. Okay, I guess I'm saying 500 milligrams of Delta 9. This is what I'm asking. I don't think we're getting rid of, I don't think there's many of those out there. I mean, I'm wrong. I have to answer questions. You agree? Yes, sir. All right. Can you reduce the to the zero point three percent on the hill if the hill you go and test is more than zero point three percent? I haven't had any of my tests over the point three percent. So you don't know whether or not, if you've got a feeling you're over the percent, is that anyway, outside of getting rid of the whole crop to reduce it to what the law is? Yes, sir. Absolutely. We can remediate that. We can remediate all the THC in-house at our processing facility. So you don't have to throw away the thing, but you can make it to where it's legal. Then we have to dispose, by law, we would have to dispose of the THC by law of the Delta 9 THC. All right. The question. I'm going to the THC business. We got a question from Vice Chairman Summers. Mr. Bryant, is the THC, is a hill in a marijuana plant the same thing, basically, except for time limit on growth? There's some difference. They're both a cannabis plant. The hemp is considered a cannabis-to-tivya ale. You pick your hemp before, or you process your hemp before, you would process the-\n\nthe trichomes or whatever out of a marijuana plant? Not necessarily, but for safe measures, you would probably want to harvest or test a hemp. For harvest, a little sooner. Follow up. So if you had a field now the way the law's written, it's hot, which means it's marijuana. We have to destroy the whole field. You're saying that you could take that plant and those ten plants out and either immediate them or destroy those ten plants, not have to get rid of the whole field? Yes. We would be able to immediate anything over that level. A problem that a test had happened before, and I think that we have resolved a lot of that within the state of Georgia, is they were taking just part of the plant, you know, the most matured part of the plant and testing it. Now they're testing pretty much from the bottom to top of the plant, pulling samples, versus trying to take what is the most matured. That was the average of on testing. It's six o'clock. I hadn't recognized you at six o'clock. We'll get them back here on Tuesday if you need to. All right, I'm sorry, but it is six, and we promise we'd be done by then. We will adjourn for today. We'll be back Tuesday at four o'clock. If anybody has additional information, you want to submit to me, feel free to do that. A beforehand, if you can't be here alive to testify. I'd be glad to get as much education as possible. That's what the whole city should be. Yes sir. You sure can't. Thank you.",
  "updated_at": "2026-02-14T01:54:28.172484+00:00"
}