{
  "video_id": "dGPXMWPeHcw",
  "url": "https://youtu.be/dGPXMWPeHcw",
  "title": "Georgia House - Day 5 (2026-11-09)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": "2026-11-09",
  "duration_minutes": 31,
  "summary": "# Georgia House - Day 5 (2026-11-09)\n\n## Overview\nThis session of the Georgia House featured a stirring invocation by Representative Tyler Paul Smith's pastor, focused on the importance of governing according to Biblical principles. The session was relatively routine, with no major legislation introduced or voted on.\n\n## Key Actions\nNone detected\n\n## Bills Introduced (First Reading) \nNone detected\n\n## Notable Moments\n- Opening invocation by Pastor Zach Smith emphasizing the need for legislators to govern with wisdom, justice, and moderation, and to submit themselves to God.\n\n## Votes\nNone recorded\n\n## Attendance\nQuorum present, with all members voting to signify their attendance.\n\n## Adjournment\nThe session adjourned, with the next session scheduled for a future date.",
  "transcript": "They are convening, having arrived, all members will please take their seats.\nAll members will report to the floor of the House and take their seats.\nClerk will ring the bell.\nYou\nYou\nYou\nAll members will please take your seats. We're about to have the afternoon roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nMore keepers will please close the doors and keep them closed.\nGood afternoon, a beautiful day out there today, but we're in here for a short time.\nWe will begin our day today with scripture reading and prayer by the chaplain, after which\nwe will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 18th House District\nRepresentative Tyler Paul Smith, Representative Smith.\nThank you, Mr. Speaker.\nGood afternoon, members of this August body.\nToday I have a very humbling privilege of introducing you to my pastor and also my brother\nnow just so you know I did let him know we had a little bit of a time constraint today and although\nwe're meeting in the afternoon this is not one of them uh two services a day revival meetings so\ndid give him that notice but uh at this time it is my pleasure to introduce my brother Zach Smith\nIt is a blessing and a privilege to be with you, Mr. Speaker, thank you for this great\nhonor.\nTo find gentlemen from the 18th, you may not always call him that and I have not always\ncalled that him that, but I call him that today.\nI did tell him when he greeted me at the parking spot, I did tell him that a man of God\nis careful when he comes to the capital city because in the Word of God, when the man of\nGod goes to the capital city. Well, I'm preaching through the book of Mark on Sundays. It usually\nmeans the man of God loses his life. So I'm asking you to help me that that not be the case this day\nthat I would not lose my life over here as I've come to the capital. But it is a blessing and a\nprivilege. Let me read our text. I will say a quick prayer and then we will get into the rest of\nthe actual delivering of remarks. But the text today is simple. It is Genesis chapter 1 verse 1.\nin the beginning God created the heaven and the earth. Let us pray. Father, we pray that it\nwould not be my words, but that it would be your words today. Father, I pray that you would\nquicken it by the means of your spirit within all those that are gathered here. Father, I pray if\nanybody not know you, we pray that today would be the day that they come to know you, oh God.\nFather, we pray all this and thy son, Jesus Christ, most holy name, amen, amen. He told me I had a\nlength of time and then it got cut in half when I got the message. So if y'all\nwill listen fast, I will speak fast. So in Genesis chapter 1 verse 1 that's\nall that we have time for is to understand that God created the heaven and the\nearth. Why would you start out with God created the heaven and the earth?\nBecause we must know who we belong to. We must know who we are created by. If\nthis great body is to know how to govern it must be in subjection unto the\nLord and Savior Jesus Christ Himself.\nBeloved, if you want to know how to govern\nwith wisdom, justice, and moderation,\nI submit to you that he is the only way.\nI submit to you that if you should read\nthe book of Proverbs day in and day out,\njust one verse a day, it should greatly improve your wisdom\nand your way in which to govern here among this body,\ngiving you great wisdom, teaching you great justice,\nand teaching you ever more about moderation.\nsomething that I wish each and every one of us had today.\nBut in this text we see in the beginning, God created the heaven and the earth.\nBut by the time that you get to chapter 2 he's formed of man from the dust of the ground\nand he especially created man.\nHe breathed the breath of life into the very nostrils of man.\nHe had spoken everything else into existence, but when he came to man that was special.\nWhen he came to mankind he breathed the breath of life into the nostrils.\nHe had a special purpose for mankind.\nHe told man that man had the responsibility to take care of the garden.\nAs a matter of fact, that's why we have record of, of why he created humanity in the beginning.\nHe had created all of this, but he needed to somebody, he needed somebody to take care\nof all this.\nSo he created man.\nHe gave man a specific set of instructions.\nHe gave him great freedoms that he should have and he gave him wind limitation and what\ndid that man do but find that wind limitation and his wife Eve and he both partook of that\nwhich they were not supposed to. In essence, the problem that has had is still\nbetween heaven and earth. When man partook of that which he was not supposed to,\nwhen he broke the order of God, when he openly rebelled against God himself,\nthat's when the problems crept in. There was only one means of redemption that\nwas offered. He spoke to that great tempter in that garden and he said that\nhe was going to send a seed and he was going to send a redeemer and that\nBut that redeemer was going to crush his head, but that serpent would bruise that redeemer's\nheel.\nAnd beloved, that's exactly what happened when Jesus Christ came, lived the perfect fulfillment\nof the law that God had given.\nHe was the second man Adam.\nTo where the first man Adam failed, the second man Adam was truly the era of God Himself.\nAnd Jesus Christ died upon a cross when he went into that capital city over there that made\nme nervous on the way over here.\nWhen he gave his life up, when he took upon himself the son of all those who would believe\non him, that for all those who would believe on him, they may have life everlasting.\nBecause that's the problem of what happened in the Garden of Eden that day.\nIs when man sinned against God, when man openly rebelled against God, it created enmity\nbetween man and God.\nThere's a temptation among you all that we know that Jesus Christ, we know He's going\nto return.\ngoing to be sovereign overall. He is king of kings and he is lord of lords. But that leaves you\nhere to govern today. Your temptation is to think that it's the other party that's the enemy.\nYour temptation is to think that it's the other body across the way that's the enemy.\nBut the problem is not between you and these others. The problem is between you and God. And\nwhether or not you will submit yourselves unto him. I submit to you today that if you should\nsubmit yourselves unto God and unto Christ alone that you may truly know how to govern.\nThat is my prayer and my plea for you today.\nWe will make these remarks as short as we can.\nThat is your task today.\nYou must represent your country, your state,\nand your people.\nBut most of all, you represent Jesus Christ,\nKing of Kings, and Lord of Lords.\nMay you be in true submission unto Him,\nand true obedience unto Him,\nthat the separation between heaven and earth\nmay be shortened among this great body,\nthis day and every day moving forward.\nLet us pray.\nFather, we thank you for this wondrous and blessed occasion\nto be here among this body of God.\nFather, the prayer is simple to this, simple this day.\nWould you give them wisdom that they may know how\nto govern with justice and moderation?\nMost of all may they govern to your glory of God.\nWe pray all these things, and the Redeemer\nand the Restor, Jesus Christ, most holy name.\nAmen, and amen.\nLet us say the Pledge of Allegiance.\nthe United States of America, and to the Republic on which it stands, one nation on God,\nindivisible, with everything in justice for all.\nYou\nRequest for the\nChairman Hogan, the chair of the committee,\non information and audits.\nThank you, Mr. Speaker.\nYour committee on information and audits\nhas read the journal of the previous legislative day\nand found it to be correct.\nAnd furthermore, Mr. Speaker, everything\nthat is really great and inspiring\nis created by an individual who can labor in freedom.\nAlbert Einstein, Einstein.\nMr. Chairman, if you're going to quote him, you need to learn how to pronounce his name,\nokay?\nWe'll do that next time, Mr. Speaker.\nIt goes to move.\nBut I'll let you know I'm sitting by.\nYou know who here.\nMaybe that's the way they see it in court deal, then, true.\nChairman Hogan, the chair of the Committee on Information and Audits, reports that the\njournal, the previous legislative day, has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Barnes, honor 59, who is following me, establishes the order of business and\nin the first part of the period, an Amos Concepts,\nIntroduction of Bills and Resolutions,\nFirst Reading and Reference of House Bills and Resolutions,\nSecond Reading of Bills and Resolutions, morning orders.\nIs there any objection to the adoption of the resolution\nestablishing the order of business for the day?\nThe chair here is known in the resolution,\nis adopted, any first readers?\nFirst rating of Bills and Resolutions, a clerk or eight.\nHouse Bill 70, X by represent of 9 to the 130th Black,\nwhen I'm on 46, Carson to the 46th, prior to 118th Smith,\nand 133rd, and others.\nBill Vietnam, act to a man, title 48,\nthe fish go to Georgia, annotated,\nrelating to revenue and taxation.\nRaising means.\nHouse Bill 8, X by represent of Skoggins,\nthe 14th, Tempsley, the 13th, and Lums to the 12th.\nBill Vietnam, act to reconstitute and reestablish\nReestablish the Board of Elections and Registration for Floyd County.\nEnter governmental coordination.\nHouse Bill 9, eX by Representative Skoggins of the 14th,\nDeputy to the 13th, loves to the 12th.\nBill being titled an act to amend the act creating a Board of Elections and Registration for Floyd County.\nEnter governmental coordination.\nThat completes first readers.\nReports of standing committees, the clerk will read.\nRepresentative Bonny Rich of the 97 District Chairman of the Committee on Legislative and\nAggressional Reapportionment submitted the following report.\nAnd to speak to your committee on legislative or congressional reapportionment, is that\na consideration following Bill of the House, struck committee to report the same back\nto the House.\nThe following recommendations, House Bill 1EX, do pass by committee substitute, respectively\nsubmitted representatives of Bonny Rich of the 97th district.\nOkay, we're going on now to morning orders, going on to morning orders.\nChair is going to ask that you take your seats and be respectful of the members in the\nwell we have some special morning orders today. Chair recognizes for a morning\nOrder, Representative Holcomb and Dean Summary, three minutes each.\nto the house. Today we lost a giant of Georgia, Senator Max Cleveland. Senator Max\nCleveland was a very dear friend to me and to so many others. He lived a life that\nThat was not without pain and suffering.\nThat understanding of pain and suffering led him to a life of service where he wanted\nto help others and ease their suffering.\nunderstood that all of us are tied together in life and death and we have an\nobligation to help each other as much as we can. When I first met him I was\nlooking forward to it and it was it was such a big moment and I was thinking\nabout potentially getting into public service after a career in the Army.\nAnd he came in and the first thing that he said to me was, why would you want to do that?\nThat is the worst possible thing that you could do with your life.\nIt is a terrible way to make a living and you should not do it.\nAnd I was a little stunned by that, but then we talked for three hours, and at the end\nof the three hours, he told me to come over and give him a hug.\nAnd he closed with, I love you brother, and I'm going to help you.\nEvery conversation that I ever had with Senator Cleveland ended with us saying to each other,\nI love you, brother.\nHe was a mentor to veterans across this country.\nWhether in politics or not,\nhe wanted to help people who wanted to help this country\nthat he loved so dearly.\nHe was indeed a patriot.\nHe was a son of Georgia and he loved the state so much\nand so many people.\nAnd he was pained by what has become of our politics today.\nAnd he knew that we could do better as a people\nand as a country.\nSo I don't have the words to honor him appropriately.\nBut I loved him with all my heart.\nI miss him greatly.\nI love you, brother.\nThank you very much, Mr. Speaker, and ladies and gentlemen of the House.\nI know, I know a relationship of Scott Holcomb and Max Cleveland was very, very strong.\nAnd that's what it's all about standing together.\nAnd our Williams was here yesterday, or represent the Williams here yesterday,\ntalking about Vietnam.\nAnd Max Cleveland lost three limbs in Vietnam.\nU.S. Army captain won the silver and the bronze star.\nI met him in 1975.\nHe was in the state senate in Rampalutu in Governor's last year.\nHe went on to become the United States Secretary of State and then the United States senator.\nthe historical monuments I remember being in Normandy once and I visited the\ncemetery of the air and his picture was on the wall there as the\nadministrator for monuments and commissions for the United States of America. I had\na chance to visit Max a little a few weeks ago jump Galaway and I had the\nformer member of the Donald Trump Constitution had launched and he took me by\nand I had a chance to sit with Max for about 30 minutes and had a chance to just reflect\non his life and his career.\nAnd when I got to call last night that he had passed away, I immediately texted the speaker\nand I didn't know that I was willing to say a word or two about Max Cleveland.\nHe was a great Georgian from Lithonia.\nHe was just a wonderful person, always full of spirit.\nand I just wanted to say to you all and ask you all,\nif you would, during this time,\nwhether we would take a moment of silence\nand keep this family and our prayers in and our thoughts.\nAnd at this time, as a speaker and members\nof the House, as a would, let's take a moment of silence\nin the memory of forming the United States Senator\nand the George and Max Cleveland.\nThank you, Mr. Speaker.\nChair recognizes representative Douglas for a morning order.\nThank you, Mr. Speaker.\nMy colleagues, if you would, join me this afternoon for the home\nAnd one of my players, we've all heard about the young man who was tragically hit by a bus\nat an all-bending state university.\nWell he happened to be one of my athletes that I've coached for the past three years\nbefore he went off to college.\nOut of the 33 NCAA players that I've put in college, he is the first one that I've ever\nlost and to this capacity. He was a young man that did everything 100%. We just\nburied him about an hour ago and he was the reason I got cussed out by my head\ncoach. He did everything 100%. Even when we were walking through before the\ngame. It was at 100%. And my head coach would say, Coach Douglas, will you please get your\nplayer under control? And I said, Coach, you know him, he's been here with you. He does\neverything 100%. And that's the way when he went off the school to Virginia, he came\nhome and he called me and said, Coach, I don't think I can do it. I miss home so much.\nI said, well, you're going to school free, right?\nHe said, yes, sir.\nI said, well, finish this year,\nand we'll figure out a way to get you back home.\nAnd so when he got home, he called me, he said, coach,\nI think I got something at Old Bitty State University.\nAnd I said, go, you'll be close to home.\nAnd I want to thank Smiley for his classic last year\nof his classic in Albany State University, the team scored 57 points against Fort Valley\nand that was his number, 57.\nAnd all the numbers on the clock added up to 57 when the clock was left on.\nSo if there was ever a whisper from God and we know he speaks through people, signs\nand wonders. That was a sign that he was truly one of his children. And we want to thank you\ntoday for opportunity me. Passed him away. And me able to opportunity to be in his young\nman's life because I have all girls. And just thank you. And we would like to give a\nof a moment of silence right now for him.\nThank you so very much.\nThank you.\nThank you, Mr. Speaker, for this opportunity.\nThank you.\nChair recognizes representative Bernal\nfor a morning order.\nThank you, Mr. Speaker.\nDuring the 2018 legislative session,\nHouse Resolution 655 was passed unanimously in this house.\nThis bipartisan effort officially named November 9th\nas Go Star Fathers Day annually in the state of Georgia.\nOn Friday, November 9th, 2018,\nwe hosted Georgia's first official Go Star Fathers Day.\n25 fathers who lost their sons or daughter\nin defense of democracy and or as a result of war\nwere recognized.\nWould you please join me in a moment of silence\nfor the fathers and their sons or daughters\nthat made the ultimate sacrifice?\nThank you, thank you, Mr. Speaker.\nChair recognizes representatives Gamble and Kasha\nfor a morning order.\nThank you, Mr. Speaker. Good morning. Good afternoon, everyone. I'm here with my friend\nand colleague, Representative Matthew Gamble. We are the House co-chairs for the working\ngroup on addiction and recovery. And we are here today to recognize the strengths and\nthe effort it takes for people in recovery to get back on their feet. And we are asking\nhere to help us and to help them. Last session, we passed the bill, special license\nbills for people in recovery, who fight the stigma of addiction daily. And I was like\nto compare it, we like to say this a lot of times like it's American to pick yourself\nup from your bootstrips. So what could be more American than when you have fallen, really,\nYou hit rock bottom and you pick yourself up and you fight every day, every day because\nsimilar to people who have cancer, addiction is a disease and you fight it every day until\nthe end of your life.\nSo I applaud these people, I applaud people in recovery and we ask you to help you and\nhand it over to my colleague.\nThank you members of the House.\nJust ask that you help us support our over 800,000 people in Georgia that are in recovery\nat this time.\nour communities all around the state and you all hopefully have access to a\nrecovery community organization. This license plate certainly adds to our\nmission to support them. Thank you.\nThe clerk will read the caption to a group of privileged resolutions.\nCommending the 13 members of the United States Armed Forces who died during the evacuation\nof Kabul airport in Afghanistan, honoring a life and memory of Lashar and Hughes, recognizing\ncommanding Mayor Donnie Henriquez, commanding STEM Atlanta women and for other purposes\nThat completes the reading of the Privilege Resolutions.\nIs there any objection to adopting the Privilege Resolutions?\nThe chair here is none, and the resolutions are adopted.\nWe have one announcement today.\nI'm sorry, two announcements today.\nChair recognizes for an announcement.\nChairman Sam Watson.\nThank you, Mr. Speaker.\nHouse Rule Development Council will meet today,\nimmediately upon a German in room 606 at CLOB.\nI've got a lot of great topics from supply chain\nto forestry to truck weights and trucking.\nSo if you're not on the council,\nbut would like to join in and watch it on TV,\nI encourage you to do so.\nSo we're just talking about all of our rule issues.\nAnd thank you, Mr. Speaker.\nChair recognizes the Chairman of the House Rules Committee.\nChairman Smith for an announcement.\nThank you, Speaker.\nThe Committee on Rules will meet immediately on adjournment,\nimmediately on adjournment.\nThank you.\nThat being all of the announcements appears to be all the business to come before the\nbody today.\nThe chair recognizes the majority leader of the House for a motion.\nThank you, Miss Speaker.\nMiss Speaker, I move that this House stand adjourned until 10 a.m. Wednesday, November\nthe 10th, 2021.\nThe leader has moved that this house be adjourned until Wednesday at 10 a.m., 10 a.m., all those\nin favor of the motion will say aye.\nThose opposed will say no.\nThe eyes appear to have it.\nThis house will be adjourned until Wednesday at 10 a.m.\n",
  "updated_at": "2026-02-12T12:51:55.093408+00:00"
}