{
  "video_id": "DKjbv8C7ErE",
  "url": "https://www.youtube.com/watch?v=DKjbv8C7ErE",
  "title": "1/23/24 Senate Committee on Ethics",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 107,
  "summary": "Overview:\nThe Georgia Senate Committee on Ethics discussed several bills related to elections and voting procedures, with a focus on preventing the implementation of ranked choice voting in the state.\n\nKey Actions:\n- **SB 355**: Prohibits the use of ranked choice voting in Georgia, except for military and overseas voters.\n\nBills Introduced (First Reading):\n- SB 355 by Senator Robinson\n- SB 358 by Senator Burns\n\nNotable Moments:\n- Senator Robertson provided a detailed presentation on the issues and concerns with ranked choice voting, citing examples of problems in other states.\n- The committee discussed the need to restore voter confidence in Georgia's elections following the controversies of the 2016 and 2020 elections.\n\nVotes:\nNo recorded votes mentioned in the transcript.\n\nAttendance:\nNo specific quorum notes provided.\n\nAdjournment:\nThe transcript does not indicate when the committee meeting was adjourned or the date of the next session.",
  "transcript": "You\nSo we will call our meeting to order. I'm gonna ask Senator Williams if you'll open\nup with a prayer. Let us pray. The day Heavenly Father, we thank you again for the many blessings\nand opportunities that you've given us all. I thank you again for our men and women and\nblue and our men and women in harm's way and the armed forces. Please bless them and protect\nthem. Give us strength, give us courage, give us knowledge to carry out the duties of this great\nstate of Georgia and give us level heads and give us all the courage and the patience and the\nstrength and the name we pray, amen. Thank you, Senator. Welcome back. It seems like it's been a while\nsince we've had an opportunity to visit in this committee. We have on the agenda this evening two\npieces of legislation that we wish to consider. You have it on the agenda. Senate Bill 355 by\nby Senator Robinson and Senate Bill 358\nby Senator Burns.\nI'm going to ask Senator Robinson\nif he would provide presentation for SB 355.\nWhat about him, Mr. Chairman?\nYes, sir.\nChair recognizes the Senator from Savannah.\nWe have no notebooks on this end.\nWell, let's get that carried.\nLet's get that taken care of.\nI think he's starting now.\nWe'll hold until you get a full set\nInformation Center. Thank you for that.\nWe'll get this in ministry to be organized and\nAnd move\nWell, you know it probably had to come up I-16 and it got caught in that traffic down around Jonesboro\nAnd that what happened to you center\nIt happens to me all that\nWell, I'm glad the notebook finally arrived from Savannah\nIf you would as you look at the agenda you will see that SB 355\nYes, it's Tyrone.\nOh, thank you.\nAll right.\nNow we got Tyrone covered, Savannah covered, Augusta covered.\nWe've even got Katala covered.\nThat's good.\nSenator Robertson, if you would please share the input from SB 355, your mic number, sir.\nThank you, Mr. Chairman.\nand thank you for allowing me to present from my seat.\nI'm looking at Senate Bill 355, LC560021.\nMr. Chairman and committee members,\nI don't think any of us will deny the amount of confusion\nthat the state of Georgia and the citizens\nthat live here have suffered since the elections of 2016.\nI think we remember right after that election,\nthere were all talks of fraud, voter fraud,\nballot stuffing, ballot box stuffing,\nand all kind of accusations made.\nThese accusations at that time,\nwe were told that our secretary of state at the time\nhad manipulated the elections,\nand our citizens were in an uproar,\nand there was a polarization amongst citizens\nthat we had not seen in my lifetime when it come to elections and then four\nyears later, in 2020, we saw it again even greater. Our constituents,\nconfidence in our elections were absolutely cratered. The state's response to\nthese citizens has been weak at best. The 180 members of the house and the 56\nmembers of the Senate have done the best job we could to go out and try to\nrestore the confidence in the voters and the men and women who send us here to\ncarry out what they think is their business and to manage their money, their\ntax dollars, responsibly and in the best way possible. But still each and\nevery day. We are all flooded, whether it be text messages, whether it is emails or letters\nof citizens still concerned about the integrity of our elections. SB 202 that we fought for\nand passed just a couple of years ago went a long way in correcting some of these problems,\nbut we still have a ways to go. And I'm going to tell you what we do not need to do is\nattempt to change horses in the middle of a race while we are solving the problems that\nhave been around since 2016. And so last year, an initiative was taken to bring in something\nthat is commonly called ranked choice voting into Georgia. This has been an extraordinarily\nsuccessful campaign throughout the country. It is a well-funded campaign with lobbyists\nin all states attempting to do this.\nWhat they have succeeded in doing is putting\nrank choice voting and a lot of municipalities.\nAnd I want to be clear, rank choice voting is not new.\nRank choice voting was around in the early 1900s.\nAnd because of issues related to rank choice voting,\nit went away.\nAnd then later in the, I believe if I'm right,\nIt's going to be in the late 70s, possibly early 80s.\nThe discussion started again.\nAnd in the early 2000s, rank choice voting was brought back.\nWe saw some of the chaos associated with rank choice voting\nand the New York mayor's race, where it was over 15 days\nbefore the citizens of New York knew who their mayor was going\nto be because of the process used to count rank choice votes.\nAnd if you've never seen a rank choice vote ballot,\nit looks much like in some races,\nlike the lottery card that you pick up at the circle K\nwith all the bubbles on it.\nYou have many, many choices,\nand there is a certain way you have to go through\nto rank your choices,\nwhether they're three candidates on the ballot\nor whether they're 20 candidates on the ballot.\nI have a sample of a ballot that was used in 2013,\nand many anapolis in their mayor's race,\nwhere you have a possibility of 40,495\npossible combinations of candidates.\nAnd understand, we have citizens in Georgia\nthat are complaining because they're having problems\nwith touch screens, they're having problems\nwith ballot scanners, they're having problems\nwith QR codes, and many of them on both sides of the aisle\nconcerned about waiting in line in our precincts. If you want someone to wait in line all day,\nwhether it be you and your healthy self or your 80-year-old grandmother, then hand her a ballot\nwith all of these choices and all these decisions that needed to be made and all of these bubbles\non it and ask her to stand in there and rate her first, second, third, fourth, and fifth\ncandidates when in actuality she may only want to vote for one person and so if her one person does\nnot get the majority of the vote on one of the one of the first or second ballots then\nher vote is gone away it's thrown it's the ballot is discarded and we move on to the votes of\nthe other individuals but what this legislation does is it prevents ranked choice voting in Georgia\nexcept for those who already have the opportunity to do it and that are our\nmen and women who serve in the military and rightly so they should have a right\nthat is unique to them so they could vote because with run-offs and other\ntypes of contests they don't they're not afforded the opportunity that the\nrest of us have of getting in our vehicle and driving to our local precinct\nand voting on that day but to be clear some of the biggest problems with\nranked choice voting as it is today are exhausted votes. In other words, votes just don't count.\nThey're exhausted. It means that your vote either over-voted or under-voted, which means you\ninadvertently voted twice on the same column. Or you under-voted, which means you skipped over\none of those columns to vote because you were confused whether the columns were horizontal or lateral.\nOr you chose only a candidate who hadn't advanced any further rounds.\nTherefore, your ballots exhausted.\nThere was a rank choice voting election.\nAnd I know it's going to shock everybody, but rank choice voting is done in San Francisco.\nIt went for 20 rounds and exhausted over 10,000 votes.\nAnd I can tell you, Senator Williams, who has the most experience\nAs as a as an election supervisor than anybody in the general assembly that I'm aware of\nCould tell you that if he had to tell the voters waiting to see the results of election that there had to be 20 rounds of counting votes\nTo determine who won there would be chaos in his community. This was in San Francisco\nRanked choice voting and it's if you are confused\nDon't feel left out. It's a very confusing process this confusion has left to it has led to it\nvoter turnout that is lower than what is normally looked at throughout the\nUnited States. And I believe that is one of the things we tried to address in\nSB202 was to increase the number of individuals who had to write to vote. And I\nbelieve everybody from the governor to the Secretary of State, everybody in the\nHouse and the Senate have realized that the the corrections that we made, the\nsteps forward that we took in SB 202 increased voter turnout to record numbers.\nAnd I think if we bring something like rank choice voting into the state of Georgia,\nwe will reverse that trend.\nRank choice voting has a tendency to recruit and draft individuals who want to disrupt\nthe process, to process delays by coming up with concerted plans as to where they want\nI count where they want to cast their one vote for the candidate they really want and\nthen how they manipulate the other votes after that in order to eliminate the biggest threat\ncandidate in the race.\nOne of the biggest targets for ranked choice voting is third party candidates.\nAll of us have to go out and run for election.\nI happen to go out and run for election as a Republican.\nI have, I've had opponents who ran his Democrats.\nAnd if an independent wanted to come out and run, they have that right.\nIf they follow Georgia law, they have the right to be on the ballot with me just as much\nas the Democrat does.\nAnd it is my job as a candidate to go out and try to get every vote I can.\nNot just for my Republican friends, but for my Democratic friends, my independent friends.\nI do not need a game system set up\nto eliminate an independent\nwho may be just as qualified to serve\nin the Georgia State Senate as I am.\nAnd rank choice voting sets that up.\nI look forward to the testimony from the experts today\nand I think once you hear the testimony you will realize\nthat rank choice voting while being very novel\nand being very unique would be chaos to elections\nin the state of Georgia.\nAnd with that, Mr. Chair, I'll yield to any questions\nfrom the committee.\nQuestions from the committee for the author.\nYou must have done it.\nI'd say I thought you'd done a great job\nbecause there were no, I can guess where it's coming from.\nMay, from the gentleman from the gentleman from Savannah.\nChair recognized the gentleman from Savannah.\nThank you, Mr. Chairman, to my colleague,\nthe Senator from the 29.\nI think I've pretty much got that district down pad.\nIs it not true that the ranked choice voting\nwill eliminate the extremism we get\nfrom the dedicated primaries?\nNo sir, actually it increases it.\nIt increases the extremism as the last issue\nI was discussing where it gives certain groups\non both sides opportunities to come in and manipulate,\nespecially those elections with multiple candidates.\nAs far as there are certain issues,\nif you review a lot of what the proponents\nof ranked choice voting say, you know,\nthey're trying to look at making our elections\nleast polarizing, less unfriendly.\nWell, I think you and I know that\nif you want to find Republicans and Democrats\nthat treat each other with the utmost respect\nis the men and women inside this building.\nand we tend to do that.\nAnd a vast majority of the polarization\nthat happens here in the state of Georgia\nis what we read about in the news and on television\nbecause the vast majority of the citizens out there\nare too busy to try to polarize it.\nWhile I agree there is polarization in certain pockets,\nrank choice voting does nothing to eliminate the pro-polarizing\nand my contention is it does more to aggravate it.\nTo my good friend from the second best city\nthe state of Georgia. Mr. Chairman, one follow a question. Yes, sir. Senator, you are\naware that the Savannah is the first city in Georgia and therefore the best city because\nwe are the first city. Yes, sir. You always want to you always want to be the second ones\nyou can correct the mistakes that the first one made. Thank you for that clarification. I\nappreciate other questions for the off for the author. Seeing none, we will go to first\nto some invited testimony from individuals from with interest in this issue and then we'll\ntake public input. Chair, I'd like to recognize via Zoom, Manonlin, Melissa, is that right?\nThat's right, Mr. Chair. Thank you, Mr. Melissa. Let's see if we can't get you on the screen.\nIf you would just identify, thank you, identify yourself again and tell us where you're from.\nI think it's Maine.\nIt sure is.\nThank you, Chairman Burns and Vice Chairman Williams and Honorable Members of the Committee.\nMy name is Madeline.\nI am a visiting fellow at the Opportunity Solutions Project.\nWe are a nonprofit, nonpartisan organization.\nwe work all over the country with one clear goal,\nwhich is to help more people achieve the American dream.\nAnd I'd just like to thank the committee\nfor the opportunity to testify via Zoom today.\nI am due with a baby on February 8th,\nso unfortunately not able to be there in person,\nbut I appreciate the opportunity\nto testify here via Zoom.\nAnd I would like to thank the sponsor,\nSenator Robinson, Lieutenant Governor, Jones,\nand Chairman Burns for all making this bill\npriority this session. I'll say Georgia is a national leader on election integrity. As the\nsponsor mentioned since 2016, the General Assembly has heard voters concern and taken action.\nThere are forms that you've passed have increased election security and transparency and accountability.\nAs a result, as you know, well, Georgia experienced record registration and turnout in the 2022\nmidterms. And I think that's a testament to the hard work of the lawmakers in your state.\nAnd I'll tell you states across the country are looking to your example.\nAnd I would submit that banning ranked choice voting is the next step in protecting Georgia voters.\nAnd as the sponsor mentioned, SB 355 will protect voters by prohibiting ranked choice voting\nfor all federal, state, and local elections with an exemption for you, a Cava voters\nto comply with the timelines that are set by federal law.\nSo first today, I'd like to give you an idea\nabout what's going on nationally with ranked choice voting.\nIn 2023, there were a record 74 bills sponsored\nby a variety of proponents in favor of ranked choice voting.\nBut lawmakers across the country have wisely rejected this.\nAnd since 2022, Florida, Tennessee, Idaho, Montana,\nand South Dakota have all banned its statewide and preempted\nlocal jurisdictions from adopting it.\nAnd I'll tell you just in the last few months, Louisiana\nand Missouri, South Carolina, Ohio, Oklahoma, Utah,\nand Wisconsin have all introduced bills\nsimilar to the legislation here today.\nIn fact, no legislature is actually ever enacted\nranked choice voting statewide.\nMaine and Alaska are the only two states\nto use the system in addition to local jurisdictions.\nAnd it was because they were passed\nby ballot initiatives, some majorities.\nSo let me tell you why I'm here before your committee today.\nI'm a lawyer and a policy expert,\nbut I'm also a voter and I live in Portland, Maine.\nSo I've been voting in bank choice voting elections\nsince 2018, both at the local level and at the state level.\nAnd I can tell you from personal experience\nthat bank choice voting has been a disaster.\nIt has been a disaster for voters in my state.\nIt has been a disaster for candidates\nrunning for public office.\nAnd it has also been a disaster for election officials.\nI'd like to tell you a few of those reasons.\nSo first, as the sponsor mentioned,\nranked choice voting requires legitimate ballots\nactually to be thrown out.\nAnd I think we can all agree that Americans win\nwhen their votes count.\nBut in every election that uses ranked choice voting,\nballots are thrown out.\nThis is a design of the system.\nIt's a feature, it's not a bug.\nSo as the senator said, so how does this happen, right?\nSo unlike a traditional runoff election\nunder a ranked choice voting system,\nvoters have to vote for all of the candidates.\nHe described it as a lottery ticket.\nAnd I would say it's like a CBS receipt.\nIf you look at the ballot, it's long and it's cumbersome.\nAnd voters are required to vote for every single candidate\ndown the ballot in order to have their votes count.\nAnd that is an order for the system\nto manufacture that 50 plus one majority.\nSo if a voter decides that they only\nwant to vote for one candidate as they do right now in Georgia,\neither as their first choice or for all the choices,\nAnd that candidates no longer in contention,\nthe ballot is thrown out.\nSo let me tell you how that's worked\non the track record in the real world here.\nSo in Maine, our 2018, our second congressional district,\nit's our northern district or rural district,\nthere were over 8,000 ballots that were thrown out.\nThese are people who showed up on election day,\ncast their ballots only to have them discarded.\nThey walked away, not knowing whether or not\ntheir ballots counted, those voters could have just stayed home.\nAnd the last guy who was also experienced similar results\nin their 2022 special election,\nthis was the one to fill the seat of the late Congressman\nDon Young.\nThere were nearly 15,000 ballots thrown out.\nAnd in New York City's 2021,\nit was the Democratic mayoral primary,\n140,000 ballots were thrown out.\nThat was nearly 15% of the total ballots cast.\nI think we can all agree that that is a huge problem\nfor voters.\nSo the second big issue is the delayed results\nand rank choice voting, which of course,\nas we know, causes mistrust from the voters,\nrank choice voting guarantees multiple rounds\nof ballot counting because of the complicated nature\nof the ballots and the tabulation.\nSo if no candidate receives a majority,\nthis process has to go on.\nAnd as the sponsor mentioned,\nsometimes 20 rounds, like in that San Francisco race,\nit delays results sometimes for weeks, months,\nand I'll give you an example.\nThis is in 2022 out of Alameda County, California.\nYou may have heard about this race.\nIt was a glitch in the ranked choice putting software\nat two months after the election was certified.\nSo the third place winner had actually,\nthe third place finisher had actually won that election.\nAnd then in the 2021 New York City Democratic\nmayoral primary that I mentioned,\nthat was thrown into absolute chaos\nbecause a week after counting,\nthere were 11 rounds of tabulation,\nthey thought discovered an error as well,\n135,000 test ballots had been counted by mistake.\nSo it took eight additional rounds of counting\nand a month to declare the winner.\nEven though Eric Adams had actually won\nin the first round of that race.\nAnd here in Maine, I'll tell you,\nwe had eight days to decide the official winner\nof our 2022 Congressional race up in the second district\nbecause of a technical snaffoo.\nIt led to two memory sticks,\nwhich had recorded more than 16,000 ballots.\nThey were corrupted.\nSo ballots are discarded, results are delayed.\nAnd I will tell you,\nit is incredibly complicated voting process.\nAnd I urge you to take a look,\nas the senator said, that Minneapolis race,\nthe ballots, incredibly confusing.\nSo if you've never seen it, take a look.\nAnd I'll say also voters are given an ultimatum, right?\nSo that's a really important point\nI want you to consider for the voters in your district.\nEither vote for people you dislike,\nwho might pose your principles,\nor risk having your ballot toss the side.\nThat is the choice of ranked choice voting.\nSo into those of you who hold elective office,\nunless you want your ballot to be tossed,\nyou would actually have to vote for your opponent\nin your race under ranked choice voting.\nAgain, consider the voters in your district,\nvulnerable voters like the elderly, right?\nThat's what happens here in Maine.\nI'm telling you race after race.\nThey've been voting one way,\nand now all of a sudden they are forced to vote\nfor all of those candidates all the way down the ticket\nin order to guarantee that their ballots will count.\nAnother really important point I wanna reiterate here\nbefore the committee is that underranked choice voting,\nwinners, losers, and losers win.\nThat's a routine issue with rank choice voting.\nSo in that congressional race here in Maine\nthat I was mentioning, the incumbent actually received\nthe most first place votes,\nbeating as opponent by almost 1%,\nhe would have been the winner under a traditional election,\nbut because of the challenger,\nwas declared the election because of rank choice voting.\nAnd that challenger never actually received\nmajority of the ballots cast in the election only a majority of the ballots that were not tossed\naside. And I want to give you one more local example where I live in Portland, Maine. We had a race\nin 2021. There was a candidate who had a mere four percent of the vote after the first round of\ntabulation, but he won and was given a seat locally on our government because of ranked choice\nvoting. So I urge you just think about your most recent election or your colleagues. Does that\nkind of result sound fair. And I can tell you as a voter, results like these do not inspire confidence.\nOne other point I'd like to make is just the instant runoff voting is a real misnomer.\nI heard a lot of people just say this is an instant version of a general runoff.\nWell, it's not. Ranked choice voting is not an instant runoff vote because of all of the delays\nthat are required under the system. And it's not a viable alternative because ballots are thrown\nout. It does not produce a majority. It is an instant and it turns winners into losers.\nI think we can all agree that elections should be fair and prompt and inspire voter confidence\nand every vote should count. Any voting that by design throws out valid votes should be banned.\nIt's un-American, un-democratic, and I urge you to protect the voters in your state by rejecting\nthis disaster's voting system, the nightmare that we've lifted your main and supporting SB 355.\nI appreciate your time and I'm happy to answer any questions. Thank you.\nThank you for your input. I look to the committee of the questions for\nthe invited witness. Any questions?\nSeeing no questions. Thank you for your input. We appreciate it. I need a\ntemperature alert. What's the temperature where you are in Portland, Maine today?\nWell, I'm going to tell you we had 14 inches of snow last week. So it's chilly here.\nOkay, I want to make one comment. I've never shoveled humidity.\nSo south, you can put your snow shovel away, okay?\nDo we know to thank you for your input? Thank you.\nIt's the right, it's the other set, all right. Our second person is Jordan Kiddelsen. Jordan,\nare you here? If you join us please, if you could, limit your comments around five minutes,\nand then we'll take questions as appropriate. State your name and your professional affiliation.\nChairman Burns and distinguished members of the committee, my name is Jordan Kiddelsen.\nI'm the policy director for the America First Policy Institute and I came in today from\nthe other bastion of election integrity, the beautiful state of Arizona.\nI appear before you today in support of Senate Bill 355\nto prohibit rent choice voting\nfor any local, state, or federal elected office.\nR-C-V is a confusing,\nchaotic, disenfranchising system\nwhereby the person with the most votes doesn't always win,\nwhich is essentially un-American to his core.\nThe process makes the fundamental right\nvoting harder for both voters and election workers alike. As the voter is easily prone to make\nmistakes during what is an unnecessarily prolonged period of multiple voting rounds, a ranking candidate\npreferences, after which if not submitted correctly, the person's vote ultimately isn't counted\nanyway because their preferred candidate has been eliminated from contention due to ballot\nexhaustion. Our system is built upon the fairness and transparency of one person having their one\nvote counted one time, not one in which some people's votes are worth more than others. And I\nthink every senator sitting in this committee would agree with that notion. Members of this committee\nalso agree that election workers are already under a significant amount of pressure.\nImagine a scenario in which these same people are compelled to preside over a system where\ninstead of counting totals for two candidates for office, the election workers and their\nequipment rank the order of ballots for multiple candidates for an office, then redistribute\nand re-rank those votes multiple times after the first count until eventually one candidate\nIt reaches 50 plus one.\nTruth be told, most Democrats and Republicans I know in this state and around the country\nagree that this could even make a voting machine cry.\nWhat this simply translates to is more pressure, more counting errors, and a more time consuming\nenvironment when more Georgians than ever are demanding and deserve timely and accurate\nelection results.\nAnd it make matters worse, a recent MIT study showed that our CV in Maine increased rather\nthan reduced outside spending on the toxic negative political advertisements that millions\nof Americans have come to resent.\nAnd in a recent school board election in Oakland, California, where rain choice voting was\nused, a major error led to local officials even swearing in the wrong winter.\nIt took three and a half months before the rightful winner was sworn in.\nIs this the type of complexity and twisted process that we wish to subject hundreds of\nthousands of voters in Georgia to?\nIn fact, in Alaska, since ballot measure two was passed in 2020, implementing California\nstyle jungle primaries and rain choice voting, Alaskans have collected just in the past several\nmonths, over twice, the required number of signatures needed to send to the legislature\na full repeal of rain choice voting. With full consideration of this testimony today,\nI urge the members of this committee to move this bill forward and I applaud Chairman\nBurns, Senator Robertson, Lieutenant Governor Jones and members of this committee for raising\nawareness to this issue and yield the remainder of my time back to the chair. Thank you very\nmuch. Thank you for your input. You do have a question. Senator from the second.\nNow, I haven't studied ranked choice voting and I haven't read a litany of information,\nbut just follow me with my public school education. If myself, the center from the second\nand the center from the 29th were on the ballot. Now, we don't agree on everything\nafter time. But if we're on the ballot and then we were with the good senator from Augusta\nand the 22nd and we were all three on the ballot and the senator from the 29th beat us both out\nbecause he got over 50 and one. It ain't no, it ain't no risk on. He's ahead plus the 51 so there's\nno need for any risk on. Is that not true? So ring choice voting has oftentimes\nbeen termed the Common Core of Elections. And so the Common Core of Elections doesn't\nbegin until one candidate does not reach 50 plus 1. If the candidate, if there is a candidate\nthat reaches 50 plus 1 in the first round, then they are declared the winner. It's only\nif they don't reach 50 plus 1 where it goes through multiple rounds of tabulation. However,\nthat scenario is not likely because in a in a in rain choice voting, oftentimes final five\nvoting is utilized for the purposes of the primary election. And those top five candidates\nfrom the primary make their way into the general. So it is very difficult for a candidate\nto achieve 50 plus one when you have several candidates\nrunning on the same ballot in the general.\nJust one of the follow-up questions, Chairman.\nSo when we talk about the ranked choice voting\nlike for example, I follow the states\nas you've mentioned, you came from Arizona.\nSo for example, in Alaska, there's a Democratic Congress\nwoman who loves guns, fish, and has one\nbecause of ranked choice voting because she is a Democrat,\nbut she loves guns and fish and she's in Alaska.\nSo she's prevailed because for folks who love guns,\nfish and Alaska, she's the candidate of their choice.\nSo I'm just trying to understand\nhow that diminishes a voter's capacity\nbecause it allows them the opportunity\nto pick somebody that likes their ideals\nbecause I might like guns\nand I know the Senator from 29 likes guns\nbut the Senator from 22 may not.\nSo, you know, we might get kicked out of the race\nand the center from 22nd is still in\nbecause he doesn't like guns.\nBut that's just my understanding of it.\nMaybe you can shed light on that\na little bit better for him.\nWell, because of the capacity that I appear in,\nI can't go into the philosophical ideological component\nof rain choice voting,\nbut I will tell you in that Alaska election\nin the initial round of voting,\nthere were far more votes for the other two candidates\ninitially then there were for the the ultimate winner in that election. So the will of the voters were ultimately ignored because the election went through multiple rounds of tabulation.\nAnd in Alaska, as you well know, how could you rightfully have an at large congressional election whereby somebody of that persuasion.\none or advanced through the election but then you have a state in the presidential contest\nthat went so far in the other direction. It seems like there is an attempt and effort\nto disenfranchise voters and instead insert other winners who really ultimately were losers initially\nin the first round. That is the most disenfranchising thing because oftentimes when the person who\nhas won the election has been declared the winner by that time, there have been thousands and\nthousands of ballots that have been tossed and people as a result that have been disenfranchised.\nAnd so any election, any system of voting whereby you have some ballots that have been counted\nand other ballots that have been subject to what's called ballot exhaustion or tossed or thrown out\nthat goes against the very foundational concepts of freedom fairness and transparency\nthat are founding fathers originally meant for this country. And it's how I wanted to find\nthat question. I just want to clarify that you can have a state that goes in totally different\ndirections. The state of Kentucky has a Democratic governor, two Republican US senators,\nand overwhelmingly went for former president Trump. So I don't believe that that's true at all.\nThank you for your question. Other questions from the committee.\nChair, C's nine. Thank you. Thank you. Appreciate your input. We've now, I'm sorry we have a question.\nOh, you like fishing? Oh, you like fishing? That's right. That's right, especially Alaska.\nThank you. I appreciate your input. We've heard from two individuals that are supportive of the\nbill. We're not going to hear from three individuals that oppose the bill. And I'd like to invite\nScott Turner, former State Representative Scott Turner to come join us and share with us your input.\nThank you, Mr. Chairman and members of the committee.\nI had actually prepared a couple of notes, but I want to answer a couple of questions that kind of came up just now.\nAnd Senator Milo's question over and I hate talking about Alaska because nobody nobody in Georgia is pitching you the Alaska model so we can discount that all together.\nBut a unique thing did happen in Alaska and over a third of Nick Begge who was a republicans the other republican besides\nSarah Palin in that race over a third of of Sarah Palin or Nick Begge's voters voted for the Democrat in that race\nThat was a will of the people's election result. So to your point, there was a great deal of crossover\nAnd that's based upon candidate quality first and foremost and I believe elections are one\nnot by systems but by candidate quality first and foremost, but you know in 2013 I was elected\nin a special election there were five of us in that first round and I think one of them dropped\nout got this qualifiers there was four of us heading into election day on January 5th 2013\nand I was 122 votes shy of winning without running off in a four-way race and I had this whole big\nagenda in my head, and I had to sit and wait for a month while I went and run a special\nelection runoff.\nAnd that runoff happened on February 5th, 2013, and the vote total, the vote total for\ntotal turnout was 1,500 votes, which was about what I got in the first round, when there\nwere four people in the vote.\nAnd I wanted to talk about ethics reform, and I wanted to talk about civil asset forperture\nreform, and I wanted to talk about liberty and justice for all.\nAnd the very first conversation I ever have with Speaker David Rolson, he asked me, what\ndo you want to work on?\nI said, I want to get rid of runoffs.\nAnd he said, you might find some analyze in this building.\nAnd took me a while, State Representative Wes Cantrell came along later and convinced me\nthat ranked choice voting was the solution to our runoff problem and runoffs are a problem\nin Georgia.\nI live here, by the way, I'm not an outside group.\nI represented my first house just for eight years, honorably.\nI'm here to advocate for my neighbors,\nnot from some far off place,\nbut Kennesaw State University recently published a study\nwhere they said $75 million out of local coffers\nhave to be used for any statewide runoff.\n$75 million, think about that for a second.\nThat's hot holes that can't be filled.\nThat's a playground that can't be built.\nThat's a police officer salary that goes on paid.\n$75 million, that's a problem.\nThe second problem is,\nthese folks who are talking about on the screen\nAnd to come up here and they talk about trash ballots or ballots that are thrown out in some of our latest runoffs that we've had for US Senate, 500,000 people don't come back.\nTheir first round vote thrown out like it never counted their voices silenced by our current runoff system.\nIt's not right.\nIt's been as high as many 750,000 people haven't come back to vote in the second round.\nNow, there are some people who aren't going to vote for a second choice on a ballot,\nbut I would posit to you if you give them the opportunity, be far less than what we see in our\ncurrent system today. The second thing is, or the third thing that this Kennesaw State\ntalked about was the actual political climate of runoffs and how much more negative\nthrough the holidays, we have to be bombarded with negative advertisements. And you can get that.\nI've sent it to all of you last year and years previous. It's not a new study. It's been out\nfor a couple of years now. SB 202 introduced our CV to Georgia, meaning that if you voted for SB 202,\nyou actually voted to bring ranked choice voting to Georgia for the first time. It's the only way\nit's ever been used in Georgia for military and overseas voters. It allowed for a very specific reason.\nIt allowed us to go from a two month runoff where we were certifying our final winners in January\nto a one month runoff where we are certifying now at the end of November, early December.\nSB 355 cars out in exception for these folks, so you're not actually banning anything,\nand it's important to know that you, O'Coffe, is the only thing that we use Ranked Choice\nVoting for.\nSo you are actually passing a piece of legislation that doesn't ban anything new.\nAnd in fact, creates an exception that preserves Ranked Choice Voting for Georgia.\nSo you're not actually doing the thing that you're set out to do in banning Ranked Choice\nVoting.\nIf it's so bad, if Ranked Choice Voting is so bad,\nwhy are you subjecting our men and women in uniform\nto something that is confusing and would disenfranchise them?\nIt doesn't make sense.\nYour work on SB202 and allowing for Ranked Choice Voting\nmet a very specific need.\nYou saw value in it.\nYou would never ban it because it's working for this specific instance.\nWe have no stories of a soldier or marine or airman being confused by the ranked choice\nballot.\nAt least not that I know of, I mean, maybe they're out there.\nIf ranked choice voting, I want to talk about a little bit about timing too.\nCity of Boulder, Colorado just ran a ranked choice ballot.\nThey have multiple rounds.\nYou know, I've heard some folks come up here and tell you it takes forever for the results to be tallied sitting in Boulder, Colorado had multiple rounds. They ran their instant runoffs within a couple of days.\nThey declared a winner within a few days had certified results by the end of the week of the election.\nCompare that to how we do it today.\nAt a minimum, we don't know who our winner is for a month and we have to pay for it $75 million.\nAnd we have half a million people who are silenced by that process.\nYou know, there's a study by Ted Cowser, he's a political science professor, he says, for\nevery one piece of misinformation, you have to overcome that with four pieces of refutation.\nAnd unfortunately, that's where we find ourselves in the RCV debate today.\nWe recently had a panel discussion.\nI invited you all, and I hope that you'll have an opportunity to watch the video where\nWe debunked many of the myths about ring choice voting.\nThe panel featured, but at least one of the folks\nyou'll hear from today, who has actually\nrun ring choice voting elections.\nAnd we collected emails from legislators,\nfrom you guys that sent us the stuff\nthat you are hearing from people who\nare opposed to ring choice voting.\nAnd what we found is the opposition really fits into two\ncategories.\nThe first category is demonstrably false.\nIt's just untrue.\nSecond category is, technically true,\nbut run-offs are worse.\nAnd I'll give you a couple examples.\nOne opponent, I'm sorry, in the post-election polls,\nwherever rain choice voting is used,\nwhether it's in Maine, Utah,\nRepublican Party of Georgia of Virginia,\nwherever it's used, 80 to 90% of the people say\nit was simple and easy and it wasn't confusing whatsoever.\nThat's across the board, doesn't matter where,\ncould be a blue state, red state, doesn't matter,\nhappened in New York, even with all the stuff\nthat has allegedly been confusing about New York.\nIt's just not confusing.\nThe only thing confusing about rain choice voting\nis the opposition.\nRain choice voting is as easy as one, two, three.\nThink about your three favorite ice cream colors,\nwhich one do you want first?\nHere's your first choice.\nYou go to Baskin Robbins,\nI'm sure you can come up with 40,000\ndifferent combinations of Baskin Robbins.\nYou have no problem picking out who your first choice is.\nThe second thing is I have heard a opposition to a brain choice voting talk about one specific\nrace out in Burlington, Vermont and they talk about how the first round candidate got 29%\nof the vote and then that person became the winner and they say any system where somebody\ncan only get 29% in the first round and become the winner is not legitimate and let me introduce\nyou to two individuals. The first is Lieutenant Governor Jeff Duncan. Got 26.7% of the vote\nin his first round. He became Lieutenant Governor of the state. Second person I want to introduce\nto is Brian Kemp. Brian Kemp got 25.5% in his first round. Last time I checked, it's less than 29%\nbecame Governor of the state and has led us through some tumultuous times with an ease,\nWhat a great leader, leader, Brian campus.\nThat's not a knock on Ranked Choice Voting or Instant Run-Offs.\nThat's a knock on any type of run-off.\nThose types of results happen today.\nIt's not a knock on Ranked Choice Voting.\nI have a lot of other stuff written down.\nI'm really passionate about this issue because I want to see elections in Georgia maximize as a conservative.\na conservative. I want to see, I want to see elections run as efficiently as possible. I want to see\npeople's voices have maximum opportunity to be heard. And I want to see elections run without\na two months extra runoff. And I think the people of Georgia want that to, and they at least would\nlike an opportunity to have to use this in very key specific ways so they can continue to do a\nproof of concept on it, just like what you authorized an SB202. Thank you. Thank you for your input.\nSenator from club.\nGood night. Thank you, Mr. Chairman. Scott's good to see you today. Thank you, Mr. Whip.\nYou brought up the uniformed and overseer citizen absentee voting act and said that\nthat we voted on that and we passed that an SB202. Is that the way I understood that?\nYeah, that's correct.\nIs that federal law?\nNo, the Uacava is federal law,\nbut you allow for rank choice voting in SB202.\nYeah, and we allow it for military individuals overseas.\nYou allow for rank choice voting to be used\nfor Uacava voters in SB202.\nOkay, so you answered my question\nwithout answering my question, and I appreciate that.\nIf I don't understand your question, I appreciate that.\nLet me ask you a question.\nIf I go into Baskin Robbins,\nShould I be mandated to get three flavors of ice cream,\nor can I just get chocolate?\nWell, here's the thing.\nWhat if chocolate's not available?\nMy question is, if chocolate is available,\nand I walk into Baskin Robbins,\nshould I be mandated to get three different flavors?\nNo, I just get chocolate.\nNo, and that's not how ranked choice voting works.\nIf you wanted chocolate,\nyou could just walk into good chocolate.\nYou used your, I'm using your example.\nThat's all it is, and I appreciate your time.\nThank you, sir.\nOther questions?\nI have spirited discussion, other questions.\nRepresentative Turner, you've exhausted us, I'm sorry.\nI have that effect on folks.\nI highly don't balance, sir.\nHighly unlike.\nThank you for your input.\nOur next testimony comes from Josh Daniels.\nMr. Daniels, if you would please introduce yourself\nand share with the committee your input.\nThank you, thank you for your time.\nThank you, Mr. Chair, members of the committee.\nMy name is Josh Daniels.\nI am a former election official.\nI feel a little bit like a combat veteran\nbecause I counted votes in the 2020 election.\nIt was an eventful year.\nBut in that election, I was serving as the county clerk\nand county auditor in the second largest county\nin the state of Utah, Utah County.\nIt's a creative name, about 700,000 folks\nthat live in that county.\nAnd our county was the first county\nto implement ranked choice voting for municipalities\nin our state.\nAnd I was privileged to administer those types of elections\nfor our municipalities in our area.\nBut you know, I'm not new to ranked choice voting.\nOur Republican party in Utah has actually been using\nranked choice voting for over 20 years\nin some of our party meetings, our caucuses\nand our party conventions.\nIt really speeds the meeting up when you've got\nfour or five candidates running for one spot,\ninstead of having multiple rounds of voting\nand keeping all of the party leadership\nin the same room for hours and hours,\nwe've begun allowing a ranked ballot that we would submit.\nAnd we've been doing that for a couple of decades now.\nAnd so when we implemented ranked choice voting in our county,\nwe didn't experience any of these problems\nthat people are talking about.\nI've heard things are disastrous,\nThat's not what I've heard.\nI've met the Secretary of State from the State of Maine and they said that it was easy\nand that they didn't have a lot of problems.\nI've met other election officials around the country and have not heard sort of any of\nthese actual sort of war stories, if you will.\nI mean, I could share war stories because I served in Fulugia Iraq with the Marines.\nAnd about 16 years ago, I was watching that, you know, war of five Republican candidates\nin the New Hampshire primary about this time, 16 years ago.\nAnd I was sitting in the the chow hall in Faluja Iraq.\nAnd sometimes at that same chow hall, I'd sit at the same table as this Navy lawyer named\nBraun DeSantis.\nLittle did I know he was going to get in that war up on that television 16 years later.\nBut I remember thinking back then, boy, five candidates for president and you only get\nto pick one.\nAnd this kind of underscores the reason why folks want to use ranked choice voting.\nIn our cities, the cities wanted to use it because they had to have a runoff as well.\nThey would have to have an election in August and then an election in November and in August\nthey would narrow the number of candidates running for council and mayor down to a certain\nnumber that would go on to the sort of general election.\nThey're nonpartisan races so the general election functioned as a runoff and one of the things\nthat they noticed was that in the summertime people really were not keen on voting for people\nfor city council in the middle of the summer.\nThere was a lot less people interested in that election, a lot less turnout.\nAnd so some cities wanted to use ranked choice voting to say, well, let's just vote on all\nthe candidates in November when people are familiar with election time and we'll devote\na little more attention to the candidates.\nAnd we don't have to pay all the money to have this preliminary election, if you will,\nin the summertime.\nAnd so we use these ranked ballots so that folks could just vote in November and not worry\nabout this splitting or spoiling effect that necessitates the runoff, that you all are\nvery familiar with in some of your notable U.S. Senate races.\nSo as we implemented ranked choice voting, we were very concerned about whether it would\nbe easy for voters or not.\nWe did some sampling, we did some education, we did some polling.\nWe went to an assisted living center and had residents there use the ballot.\nWe didn't give them any explanation.\nWe just gave them the ranked ballots and saw if they could figure it out or not and saw\nwhat kinds of concerns came up.\nto report to you that there weren't any concerns. It was pretty intuitive for them to rank\nand bubble, you know, first, second, third choice. When it came to counting the votes, it\nwas not any more difficult than any of the other ballots. We used the same systems. We\nscanned the same paper ballots. We go through the same reporting cycle. There's just one\nmore step at the end where within your system, you just run the sort of winner selection\nprocess to do that instant runoff that that rank choice voting requires. And we were able to report\nrank choice election results at the same time. We reported plurality election results from\nfrom other cities and other elections. And so we didn't experience any of these\ndisastrous or difficult hurdles that that had been discussed. And then we were able to audit\nthe election the same way we do all of our other elections. We we even did some post election\nsurveys to see about voter satisfaction. Voters reported\noverwhelmingly that they found the ballot easy, that they did not find it\nconfusing, that they liked the ranked choice, and that they wanted to\ncontinue doing ranked choice. And we've now done ranked choice elections\nfor our municipalities for three different election cycles. And the post\nelection survey results are always the same. A commanding majority of\nrespondents who have participated in ranked choice elections, find it easy to\nuse. Don't find it confusing. I want to continue to use it. They like it. And so we've had a good\nexperience with that. There certainly has become more of a political issue recently. I think the main\nexample is why it's political because what you probably didn't hear was that that second\ncongressional district in Maine, what had happened in Maine was that was a blue district. It went for\nBill Clinton. It went for Obama. It is, it is a solid blue district. But in Maine, they have\nthree very viable parties, the Republican party,\nthe Democratic party and the progressive party.\nAnd what had happened was a very popular statewide\nRepublican official who wasn't particularly extreme,\nhe was able to win as a Republican in that blue district\nbecause the Democrats and the Progressives,\nthat voting coalition, if you will,\nkind of split themselves.\nAnd so a Republican won a blue district,\nwhich, if your team Republican, that's pretty cool.\nWhen your opposition splits themselves, so to speak.\nBut then what happened was Maine Institute\nand ranked choice voting.\nAnd so then that Republican lost after being\nin office for a couple of cycles.\nAnd so if you're a Republican and you're in that district\nand Maine, well, then yeah, you don't like this.\nBut at the same time, this cuts both ways, right?\nAt the end of the day, I think the thing that matters most\nis getting a majority of your community\nto sort of make their choice known at the time\nthat it makes sense to make that choice.\nIn the case of Utah cities,\nit makes more sense to vote in November\nthen to vote in June.\nAnd I think for your state, you can understand\nthat getting your voters in November\nto be the commanding decision on who wins a US Senate race\nand not telling the citizens they need to show back up\na month later to sort things out.\nThat's gonna be more effective.\nYou're gonna have broader participation\nand more buy-in from your electorate\nas to who won those elections.\nAnd I think that's the power of rank choice elections.\nIs it eliminates the need to have run-offs\nare multiple cycles of elections.\nIt eliminates votes splitting and spoiled elections.\nAnd voters then leave more satisfied\nand you actually have outcomes\nthat are more broadly representative\nbecause often you're having those ranked elections\nat the time when most people are going to be participating.\nSo for those reasons, I think you should consider it.\nAnd if you have questions about implementation,\nI'd be happy to answer them.\nThank you for your input.\nChair recognizes the center from the 50th.\nMike, number 16. Thank you. First, thank you for your service, and thank you for coming\nto testify today. I had a question about the military ranked choice ballots. Is it not\ntrue that the ballots that we send are, we technically send two ballots, one, which\nis a regular ballot that they vote on, and then a separate ballot that is a ranked ballot\njust in case there is a runoff? So your specific way that you do it in Georgia, I can't speak\nto that, but I've heard that, but it couldn't, but it wouldn't need to be two ballots,\nbut it really depends on how your local clerks are actually counting and organizing.\nSome states will do just one ranked ballot for those overseas citizens, but you could,\nyou could do what you just described as well. Okay. Thank you.\nThank you. The chair recognizes it from a second.\nThank you, Mr. Chairman. Uh, just a question so I can, I like to keep this, uh, so my constituents,\nuh, back down to 16 and watching this, uh, when you talk about the ring choice voting,\nif you wanted to vote for one person, you could vote for one person and let that be it, right?\nAbsolutely. That's what that's what your wish was. That's right. I'm a vote for this one person.\nand if he don't, he don't make it happen, then God be with him, right?\nThat's how ranked choice voting would kind of work.\nAbsolutely.\nSo you don't have to vote for everybody.\nYou can just make your person and go exactly and you're done.\nThat's right.\nBut if there, there's no runoff, so there's no situation where you\nwould be able to come back and vote for the, the next person, right?\nExactly.\nYeah.\nOkay.\nAnd find a question for you is if you are going to have runoffs,\nthen would you believe that the state should then invest in making sure voters know that there\nis a runoff so that they can come back out? Absolutely. Yeah. That's one of those things that's\nvery difficult. You have a runoff and voters may not know, hey, you got to show back up in\nNovember or December or January, right? And I think when you get to that question about,\nyou can just vote for one. You can just pick chocolate. The problem with the election is that if you\nYou just pick chocolate, you have to wait until you put your order in to find out they're\nout of stock.\nAnd oh, by the way, you don't get anything.\nYou know, imagine going to a restaurant and they give you a menu.\nAnd on the menu is a ribeye, a filet, and halibut.\nAnd then you say, well, are all these fish and stock was a lot, we don't know until you\nput your order in.\nOkay.\nWell, I order the filet.\nOkay.\nWhat do you order?\nThe ribeye, you order the halibut.\nGreat.\nThen the server comes back says, hey, sorry, we're out of the ribeye.\nWhat can I have the filet?\nNope.\nThere's only one chance to make your order.\nmajor order. Now we're out of stock. That's what happens in the election, right? You come to the\nSenate election, you say, I vote for the libertarian. It's like, well, the race is not between the\nlibertarian. It's between the Republican and the Democrats. So you need to make a choice. Oh,\nyou don't get an opportunity to make that choice. You got to come back in a month and make that\nchoice, right? So you don't get to find out really what that race is about until it's too late.\nYou've already thrown your vote away in a sense. You've been, uh, you've been given a really poor\nchoice. And I think ranked choice is a better choice. It gives you the option to give all of your\nchoices. Thank you chair recognizes the center from the 29th.\nThanks sir. I appreciate you making the trip from Utah, right? Yes sir.\nSo when you were more of the pocket auto drive,\nthat'd be similar to the election superintendent by me here in Georgia.\nCorrect. Now, were you there when the pilot public started? Yes.\nAnd how long did it go as a pilot pilot before it became the actual method done under current state law it's still a pilot cities can choose to use that method if they want and every year a city's having an election they can choose that year to use it or to not use it.\nAnd so the first year that that was offered was 19 we have an odd year for municipalities and then they you know cities have done it again in 21 and then more recently in 23.\nYeah, cities have switched back and forth. A lot of the reason that they might use it or not use it is depending on how many candidates are going to be running for office. If a lot of candidates run, it necessitates that June what they call a primary election.\nWho makes the decision if you run, if you use it or not use it, the City Councils make a decision to opt in or, you know, to use it or to not.\nCity Council members in your car they elected yep City Council are elected nonpartisan so it's not a party affiliation, but they're all elected. Okay. Thank you. Yeah.\nThank you. Any other questions for the witness.\nThank you for coming. Thank you for sharing. We're grateful. We have one more invited presenter or witness West Ken trail representative West Ken trail.\nWe're grateful for his presence.\nThank you, Mr. Chairman, it's a bucket list item of mine to come back after eight years\nserving down here and speak against my friends bills.\nWe're just about to have you.\nThere's a challenging issue.\nThere's good people on both sides of this, okay?\nSo one of my best friends opposes me on this issue, I get it.\nSo I'm just here to very briefly make my case for this by understanding how things work\naround here and their political forces at play.\nSo I'm going to try to persuade you based upon experience and facts, all right.\nSo 2014, I got elected, I went, I got to experience firsthand a nine week runoff in the middle\nof the summer begging people to come back and vote.\nPlease come back and vote.\nI got a clear majority in the primary, but I had to come back because I didn't get 5%\nplus one.\nI knew if I made the runoff, I would win because the other two candidates, I knew I was\nthe second choice of both of them.\nSo I almost had 70% of the vote, but there was a 21% drop off in the summer to vote.\nThis really alerted me personally to the problems we have with runoffs.\nIn fact, that year would have been a much larger runoff vote, much larger drop off, but\nwe had a senatorial race and we had a congressional race in my district that drove some of that\nturn off.\nIt would have been a lot worse.\nRunoffs result in voter fatigue much less turn out on average. It's over 30% less people turn out for the runoff millions of taxpayers dollars are wasted on something that could be easily avoided the only people who like runoffs are political campaign consultants because they make a lot of money off of all of us during those times. That's the only people that like them voters hate them. They hate runoffs and I'm here for the voter. Okay.\nSo, I immediately began to study, I called an instant runoff voting back then or RCB.\nIt's the same thing.\nRight after I got elected, I began to try to persuade my colleagues, and this was a good\nidea.\nNobody had heard of it.\nBut let's be clear.\nRanked choice voting does not eliminate runoffs.\nIt simply makes the runoff, if necessary, occur on the same night as the regular election.\nYou still got to run off. It just happens on the same night. You don't have to wait.\nWhat used to be nine weeks now is four weeks. So I began to run these ideas by leadership. I finally\ngot their permission to run with some bills so I would get a fair hearing on these bills.\nThis all happened prior to the election of 2020. Let's be clear. Prior to election of 2020,\nI wrote three bills. One was the bill that's been talked about. It became part of SB 202,\nHB 59, which allowed for ranked choice voting for overseas citizens and military personnel.\nHB 284, which allowed municipalities or counties if they so chose in their area,\nlocal control. If they wanted to use our CV, they could do so. And HB 285, which would allow for\nfor range voice voting in presidential general elections only,\nsince we don't have a runoff for our presidential election.\nLet's just pretend for a moment we had our CV\nin that 2020 fun election we had.\nThe winner of our presidential election got 49.5% of the vote.\nThe loser got 49.3% of the vote.\n65,000 people voted for third party candidate.\nThe research shows that had those people had\nthe opportunity to vote for their second choice,\nthe election would have been different.\nWould have been different.\nWe had a different outcome.\nSenate raised that year.\nOne candidate received 49.7% of the vote.\nHigher than the presidential person\nwho won all 100% of our electoral votes.\nAnd yet he was subjected to a runoff\nin which he lost because there was a lot of reasons.\nWe'll just go, we'll leave it at that.\nbut 10% less people showed up for the runoff.\nRCV is not a partisan issue.\nIt doesn't benefit Democrats or Republicans.\nIt benefits taxpayers and voters.\nThat's who it benefits.\nSo I told you, you know this already,\ncame up early in my bill, got rolled into SB202,\nwhich I assume most of the ours at this table,\nall the ours at this table today voted for.\nIt resulted in moving to a four week runoff\ninstead of the ridiculous nine week one,\nthat we had endured for years.\nAn instant runoff would help us avoid all these\nnegative things if you had more than two kinest.\nYou don't have to vote.\nI keep here, there's a lot of,\nI've forgotten what it's like being down here\nwith a lot of the spin and the misinformation, okay?\nBut you don't have to vote for every candidate on the ballot.\nPlus, you guys would control what our CV would look like\nif you wanted to.\nIt doesn't have to look like what main did\nor these examples that are given.\nEverybody, you figure out, you make it,\nyou'd write the rules for how you want it to work.\nIt doesn't have to be blanket.\nIt could be just for general elections.\nIt could be just for a presidential election\nwhere we don't have a runoff in Georgia.\nAnd routinely, we give 100% of our electoral votes\nto someone who didn't even get 50% of the vote.\nSo we got a problem in Georgia with these runoffs.\nWe can fix it.\nInstead of runoff voting, our CV results in a true majority, runoffs give you a false\nmajority because you have less people that come out, a whole lot less in a lot of cases.\nIt allows voters to vote their conscience instead of being forced to choose between the\nlesser of two evils.\nYou can vote for your first choice and then know that your second choice will count if\nyour first choice doesn't make it to the runoff, okay?\nNow let's be clear, we're facing a time where we're about to get to a general election,\nwhere there's a lot of voters in America that don't like either choice.\nAnd I would submit to you that if none of the above was on the ballot, he would have a\nreally good chance at winning this fall, if it goes like it looks like we're going.\nWe need to have more choices for voters so they can vote their conscious and not feel\nlike they have to vote for a person that, because that's really the only two viable candidates.\nrunouts are expensive. We talked about their negative campaigning. One of the things I did in my\nelection, the two people I would run against, they were just killing each other. I didn't say a word\nabout any of my opponents. I just ran on what I was for and guess what? I won because they were too\nbusy fighting. And I knew because they were fighting, if I went to a runoff, all those people were\ncoming my way for either voting. It's exactly, I got 40% of the runoff. They both got about 30\nand I got the other 30s. I got 70 in the, I'm sorry, in the general, in the 70 in the runoff.\nAccess, more candidates will run for office if we have ranked choice. And a third party candidate\ncan actually know how much support they really had based upon the first ballot. You know,\nthird party candidate in Georgia never knows because people are, are, you know, what do I do?\nIf I throw my vote away, quote unquote, by voting for the libertarian or the green party or whatever,\nOr do I vote for the one of the candidates I think might actually win?\nSo our CV eliminates that problem for the voter. So\nThat's what I got Mr. Chairman happy to answer any questions you might have. Thank you. Thank you for your input\nWe appreciate it again my good friend from Savannah\nNow I just want to make a clear Mr. Chairman\nI know everybody's thinking I'm asking all the questions, but I only two Democrats three and told on the committee\nSo I get to ask a lot of questions.\nAll right, we're so glad to have your answer there.\nYou've asked a lot of questions.\nIt's my memory and research, right?\nIt didn't matter how many D's or R's were in the room.\nBut go ahead.\nI'm not.\nWell, you know, I remember.\nSo Representative Cantrell, this will probably be the second issue we actually would agree on,\nright?\nThe first was daylight savings time.\nThat's right.\nIt's very controversial.\nAnd the second would be Rain Choice Voting Now.\nLet me be clear.\nhave affected the outcome of the two US senators that are in my party. I'm going to be the\nfirst to admit that it definitely would affect the outcome. But I'm not, I was going to run\noff, five person runoff, one by 20 votes in my house raised, five people in a race. And\nI did have people vote for me and leave. But if there was an opportunity to kind of look\nat how we do the ballots in how rain choice voting works, what would be your assumption\nas to the benefit to the voter versus the state.\nBecause what I'm trying to understand\nis I've heard from two conservative folks\nand I believe two other folks that are conservative\nand there's a split on the issue.\nAnd where my folks are, I'm agnostic\nabout ranked choice voting or the 50 and one.\nAnd if you don't get 50 and one,\nthen you get pulled into a runoff.\nAnd you know, so how did you find the happy medium\nin that what would be the ideal compromise?\nI know that's a bad word I didn't cuss,\nbut I'm Baptist, but what would be the compromise\nto make this a reality?\nSo one is easier on voters,\ntwo, it doesn't cost any money,\nbecause as you know, Representative,\nwe don't appropriate any money\nto administer elections in the state of Georgia.\nSo this falls back to local taxpayers.\nSo what would be the fiscally conservative answer to that?\nWell, I'm not sure I'm completely following your question,\nbut I would say that number one,\nWe say down here, we believe in local control.\nSo I think a great starting point\nwould be to allow municipalities and counties\nif they want to implement it and then see how it goes.\nBefore you can prohibit it across the board,\nexcept for military and overseas citizens.\nI also think that you could select the elections,\nnot make it blanket, but if you wanted to try it\nin a general election only where typically\nThere's three candidates, because three candidate model works the best with RCB.\nIt does.\nIt's simple.\nIt's right to the point.\nBut the people that are arguing hard as Ford are those that are in these municipal elections,\nwhere there's, you know, 20 people are running for city council.\nAnd it just, it's so much expense.\nIt's so hard to get voters to come out and vote.\nPeople are getting elected, you know, with 25, 30 votes in a town that's got thousands of people.\npeople, it's just not, the process is flawed.\nAnd it's because we were just where our voters held.\nThey just tired of it.\n2020 was a great example.\nAnd we had to vote twice in the spring,\ntwice in the fall and then in January.\nIt, you know, people just sick of it, you know.\nIf we want voter engagement,\nget rid of the run-offs, man.\nI mean, people are engaged,\nbut when you're running campaign commercials\nduring Thanksgiving and Christmas holidays,\nYou know, people just sick of it.\nThey're tired of it.\nThey're not coming back.\nAnd it just boils, it boils into the whole system.\nThank you for your input.\nI appreciate it to the Senator's point.\nThere are four Democrats on this committee.\nIncidentally, only two are present this evening.\nBut point may always welcome.\nThat's because one is a ex officio.\nThat is true.\nBut quite a number of the Republicans on this committee\nare also exeficient.\nWell, can you get me some more exeficial Democrats, Mr. Chairman?\nI'm sure we'll take that on a consideration, Senator.\nThank you.\nOkay.\nThat concludes the input from those who've had been\npreviously scheduled.\nWe have only three input individuals who requested\nto share their insights.\nWe welcome you if you could, by the way,\nif I understand it correctly.\nAll three are in favor of the legislation.\nSo the chair will recognize Victoria Cruz.\nIt's Cruz.\nRight, that's okay.\nWe could limit your input to three minutes if we could\nas we move forward into the evening.\nWe're now approaching 615.\nYes, is this...\nIt is indeed.\nAll right.\nI hope you can all hear me.\nYeah, my name is Victoria Cruz,\nand I'm from Athens, Georgia.\nSo I drove a little bit to get here,\nbut it's not as far as Arizona or Utah.\nI am in favor of the bill\nbecause I believe ranked choice voting\nshould be banned for all of the reasons\nthat Senator Robertson brought up.\nI have been looking into ranked choice voting\nfor quite a while.\nAnd I just have not seen a case where it turned out without controversy.\nThere's, there's an amount of opacity to the process, opacity in the voting.\nYou don't know whether your vote was filled out correctly, especially in the case of abs and tea ballots.\nright choice voting in an absentee ballot.\nIf you make a mistake at the polls,\nyou can redo it.\nThey'll tell you that you made a mistake\nor did you realize you should vote for all these?\nBut if you do it as an absentee,\nyour ballot comes in and the way you fill it out\nis not known until it's opened and run through.\nAnd if it is rejected for some reason,\nlike you over-voted, or you under-voted,\nlike you didn't like any of them,\nso you put them all last and the last few\nand left a few first spots open,\nthen your vote would be totally thrown out at that point.\nSo the absentee balloting is very popular.\nThat's very popular in both parties for a lot of reasons.\nSo I really think that the legislature should,\nthe committee should take that into account.\nAnd I also want to bring to your attention\nsomething I emailed all of you.\nIt is the Alec American Legislative Exchange Council's\npolicy, it's model policy that was passed this summer.\nA lot of input from a lot of election\nintegrity organizations passed this\nand they are, it's called the Safeguard American Boats\nand Elections Act.\nAnd not only does it recommend that rank choice voting be banned, but also anything that even that it that is masquerading.\nThere is also instant runoff. I think that wording should be in the bill. There is also star voting and approval voting. And I'm pretty sure that certain elite mathematicians are working on new ways.\nof getting a new form of voting that they can manipulate.\nAnd that is the biggest problem as well.\nThe one I look at wearing choice of voting\nis that the electorate can be manipulated.\nThank you.\nNowadays we have text messaging.\nThank you for your input.\nIf you would please,\nyou have some additional information\nyou'd like to submit as written testimony.\nIs that correct?\nI would like to submit a copy of the Save Act\nfor everyone.\nYeah, please share that with Ms. Jackson.\nand we'll share it with the committee.\nThank you for your input, Ms. Cruz.\nVictor Tripp, Mr. Tripp, we're glad you're here.\nThank you for your perseverance.\nThank you, Mr. Chairman, senators.\nI'm Victor Tripp of the Cab County,\nand I'm here in favor of the bill.\nA lot of time and energy has been spent debating\nthe merits of some version of RCV,\nAnd I think it's time to suspend the debate.\nMy reason to ban RCV is that it would be a huge disruption\nof the system that is already riddled with serious problems.\nI would be glad to return to the RCV debate\nwhen the system, we have a system\nthat inspires confidence to start with.\nAs it is, we have a system that fewer and fewer\nGeorgia citizens trust because more and more problems\nare being discovered.\nIn this state, we have paper ballots that must be preserved for two years so that elections\ncan be audited.\nAnd CISA of the Department of Homeland Security says it's critical to, quote, conduct\nrigorous post-election tabulation audits of the physical ballots and paper records.\nUnquote.\nA rigorous audit must be an independent audit.\nHowever, an independent audit is impossible\nwhen Nobel access is allowed.\nInternal audits have been shown to not match the original,\nand in some cases there is no evidence\nthat an audit was even done.\nThe SOS office says the audit matched perfectly,\nand Judge Tottenberg says that that office is, quote,\nnot credible, unquote.\nThen the SOS and the AG go to court to prevent us.\nBut please vote which comments on SB 355.\nOkay, well, I will sum it up then by saying,\nthis mass has to be cleaned up\nbefore we even think about something\nas complex and controversial as RCP.\nThank you for your input, any questions?\nThank you, Mr. Tripp.\nMiss Lee, Yale Lee.\nWe welcome your input.\nThank you.\nI agree with, oh, I'm Gail Lee and I live in DeCab County.\nI agree with SB 355 as it's written and I think those of you who have sponsored it.\nRanked choice voting is too complicated and it disenfranchises voters because ballots\nthat do not include the two ultimate finalists are cast aside to manufacture a false majority\nfor the winner.\nIt reminds me of the game of musical chairs, which is no way to select those who will make decisions over our lives.\nA ranked choice election will, in the end, boil down to only two opposing candidates.\nBut many voters will not have cast ballots deciding between those two choices.\nThe voter ends up with no say in the contest between the final two.\nOf course, had that election been a traditional runoff between those same two leading candidates\nthat voter would have had an opportunity to hear debates, listen to the issues discussed\nand make an informed choice between them.\nThere are at least two alternatives to ranked choice voting and one is the system, the runoff\nsystem that we currently have.\nThe edit time window gives potential voters the opportunity to re-examine and re-educate\nthemselves about the character and views on issues of the two candidates who receive\nthe largest pluralities in the general election.\nVoters have a greater opportunity to make an informed choice than with ranked choice voting.\nRunoff elections guarantee that the winner of the runoff election has a genuine mandate\nfrom a majority of the voters, which is a crucial factor in a democratic system.\nAnother possibility for an alternative is in a contest among three or more candidates,\nthe one who garners the most votes and exceeds 40 percent or another specified percent of\nthe votes wins. If none reached the level of support specified, our current runoff system\nis triggered. I personally think we should seriously consider such an alternative. In\nmy last few seconds, I'd like to say I have prepared a list of things that I think need\nto be fixed about SB202 and I'd like to pass it out to you if it's okay.\nbe 202 is not the topic of discussion this evening.\nSB 202 is law.\nThere will be follow-on legislation that may deal\nwith those issues, but we defer your input until that time.\nOkay, thank you.\nThank you.\nWell, we've completed the input.\nI'm grateful for those who came and shared.\nI'm gonna recognize the senator from the 29\nto close his presentation.\nThank you, Mr. Chairman.\nI just want to remind each committee member\nthere is a packet in your notebook.\nIf you would look, there are letters of support\nfor this legislation from the Opportunity Solutions Project,\nVoter Reference Foundation, Restoration of America,\nSave Our States, American Constitution,\nRight Union Action Fund, Illinois Conservative Union,\nTea Party Patriots Action, Center for Election Confidence,\nCapital Research Center,\nElection Transparency Initiative, AMAC Action,\nHeartland Impact, Honest Elections Project,\nHonest Elections Project Action,\nRank Choice Education Association,\nTea Party Patriots Action,\nVirginia Institute,\nElection Integrity Network,\nAmerica First Policy Institute, Georgia,\nAmerica First Works,\nand America First Policy Institute.\nAnd a good friend, Austin Smith,\nwho is an Arizona State Representative,\nwho's dealt with this in the past,\nand he proudly represents district 29 in Arizona.\nAnd so please feel free to research this,\nand I thank the committee for considering\nthis legislation to do pass.\nThank you, Mr. Duh.\nWhip, what is the will of the committee?\nI have a motion from Senator,\nfrom the Senator from the 16th.\n16th, thank you very much to do pass.\nDo I have a second?\nI have a second from Senator from the 50th.\nThank you very much.\nAll those in favor of the motion to do pass,\nSB 355 indicate with the uplifted hand.\nAll those opposed?\nThat's quite unusual.\nIs that a question there, Senator?\nI do have a,\nwell, they say I've got to clarify the vote first.\nI think I saw it both ways.\nI'm not sure.\nWell, that's why I was trying to slow the,\nI didn't want to get a point of order,\nbut you went from calling the question\nto skipping over the discussion.\nYou know what, point of order is indeed in order, sir.\nDo you have a question before the author?\nI do, all right.\nWith the majority party with the center from the 29th\nof gree on the compromise to lowering\nthe threshold to 45%.\nThat question, that's not a part\nor germane to this bill, Senator.\ntalk to me earlier and I'll be back in our conversation but 50 plus one is\nwhere I stand on that thank you all right I believe I saw a vote is that\ncorrect yeah I did so and I believe I saw a unanimous vote in support of do\npass on three five five is that correct I'm a no I will revise that there was\none no vote and I believe it would be about nine. Yeah, he's one, two, four, five, six, seven, eight,\neight, eight, eight, one, no. Thank you very much. The bill is recommended to pass.\nGonna ask Vice Chairman Williams if he will assume the chair so that I can provide you with a much\nThe next shorter discussion of SB 358.\nLike a motion for the dinner.\nYeah.\nYou know.\nYeah.\nWe're going to vote there.\nI think majority five out of five.\nThat's right.\nOkay, we'll move right on, we'll recognize Chairman Burns to present your bill.\nThank you, Chairman. I have a great board bill. SB 358. We're working from\ncommittee substitute, LC472735, excuse me, 472735S.\nIs that correct?\nThat's correct.\nThank you.\nThis bill does two very important things.\nIt clarifies the responsibility of the state election board in its oversight role.\nIf you maintain an awareness of what's going on in the state election board in the December meeting of the state election board.\nThere was some discussion about whether or not the board had responsibility and oversight of the secretary of state and the office, the office of the secretary of state and their elections of division.\nThey split on that two to two.\nsubsequent to that December 19th meeting, we received communication from, through a member\nof the state election board and then the chair of the state election board. So the chair of the\nstate election board and a letter to the honorable John Burns speaker of the house and the honorable\nBert Jones Lieutenant Governor Georgia requested that legislation clarify the responsibility\nof the state election board and and its role in oversight. And what that's that's the\nreason that I bring you SB 358. You'll notice it does two things. First of all,\nit removes the secretary's state from it from being an ex officio member of the state election\nboard. Again, if you're a casual observer, you will note that currently the secretary's state\ndoes not actively participate in those proceedings and I'm not aware of his attending their meetings on a\nroutine basis or even on a casual basis. So there's really no reason for the Secretary of State to\nmaintain an exhibition position. So that's section one and the most the other thing in section one\nthat is important is online 25 that it allows the state election board to conduct necessary\ninvestigations so that with the approval of the board they can employ and fix the\ncompensation of personnel including investigators to determine as determined to assist the executive\ndirector in his and her duties. So in the past the state election board has had to rely on the\nthe Secretary of State for Investigations,\nthey will continue to do so,\nbut they now have authority to do\ntheir own investigations as well.\nAnd then finally,\nthis legislation ensures that the Secretary of State\nis administratively,\nThe State of Luxembourg has administrative oversight for the Secretary of State and local\nelected officials, and it ensures that the Secretary of State provide cooperation with\nthe State of Luxembourg.\nNow subsequent to this legislation being submitted, and with the knowledge that we were having\na hearing here today, I received a letter from the Office of the Secretary of State challenging\nwhether or not this legislation was constitutional. I'm not an attorney. I'm simply making this\nas making the the committee aware of this concern. I invited the Secretary of State to come and\nshare their concerns with the committee. I don't know if they are here today, but I did ask\nour legislative counsel who assisted in the drafting of the bill to prepare a response to that\nchallenge. And if the chair would allow it, I'd like to ask Mr. Morelle to kind of share with you\nhis perspective of whether or not the legislature can authorize the state election board to have\noversight responsibilities for the secretary's state.\nOkay, Mr. Morelle, thank you.\nSo, as Sharon's burn stated, he did provide me with a copy of the letter provided to him by the Secretary of State's office, where they raised potential constitutional objections to Senate Bill 3-5-8.\nAnd the basis of the arguments raised in this letter is referencing back to a opinion that the attorney general's office issued back in 2005 when a similar issue came up as to whether or not the state election board could investigate the state or the secretary of state's office.\nAt that time, the Attorney General opined that there was nothing in Georgia law that\nseemed to indicate that the State Election Board had the authority to investigate the\nSecretary of State's office and that the law, as written at the time, envisioned much\nmore of a cooperative role between the Secretary of State's office and the State Election\nBoard.\nI will note is that the laws governing the state election board and the secretary of state\nhave changed a couple of times since 2005. One of the key points that the Attorney General\nmade in his 2005 opinion was that it did not make sense for the state election board, which\nwas at that time chaired by the secretary of state to investigate the secretary of state\nhimself. As the committee is aware, the secretary of state is no longer the chair of the state\nelection board so that rationale and the opinion probably is not as of much concern anymore.\nThe next position that the Attorney General seemed to focus on was that\nthere was no clear authorization in the state law for the election board to investigate\nthe Secretary of State's office, and that matter would be addressed by the proposed legislation\nof Senate Bill 358. Finally, the Attorney General did point out that there are some unanswered\nquestions as to the ability of the state election board to have oversight over the Secretary\nof State since he is since the Secretary of State's office is a constitution and office established\nby the Constitution and the Constitution provides certain duties to the Secretary of State's office.\nAnd at this point, I will concur with the attorney general that it is still probably an open question under Georgia constitutional law.\nThere is no clear interpretation of the separation of powers doctrine as it relates here, but there is nothing in Senate bill 358, which I'm aware of that directly contravenes any of the interpretations of the separation of powers clause that the Supreme Court has handed down over the past.\n200 some odd years and the constitutional duties that the Secretary of State have would\nnot be affected by the provisions of Senate Bill 358, the limited duties that the Constitution\ndoes provide to the Secretary of State would still remain within the purview of the Secretary\nstate's office. Most of the references to the Secretary of State and the Constitution\nare actually duties placed upon other officials to provide documentation to the Secretary of State.\nAnd then there is also a duty for the Secretary of State to coordinate with the Attorney General\nand Legislative Council to prepare summaries of proposed constitutional amendments.\nIf the Secretary failed to undertake that duty since it arises out of the Constitution,\nnothing and this legislation would authorize the Secretary, the State Election Board to investigate\nthat failure because the provisions of the State Election Board, the provisions of the State\nElection Board is limited to enforcing the provisions of the Georgia Election Code, the statutory law\nchapter two of Title 21. So any constitutional duties the Secretary of State may have\nand elections would not be subject to investigation, but my review of the Constitution as well as\nthe provisions listed by the Attorney General in the 2005 opinion list only a handful of roles\nthat the Secretary of State plays in elections that are constitutional who not statutory.\nThank you, Ms. Morella. I'll play for you guys some questions. I don't know if they're for you or\nThank you, Mr. Chairman and to Chairman Burns. My question is in relation to the constitutionality\nof this, we tried in creating statute in my time in house when we had a labor commissioner\nthat was absent. Commissioner Butler and we created a chief labor officer and passed out\nof the House and the Senate that was ultimately vetoed by Governor Brian Kemp because it violated\nat the state's constitution,\nbecause that person was duly elected\nas a constitutional officer.\nAnd I remember that chief labor office\nonly had to do two things.\nGo review the audit and to provide legislative responses\nto the entries.\nAnd it was vetoed by the governor's\nand unconstitutional bill that was an overreach\nto a constitutional officer elected by the state.\nAnd this seems to be headed down the same path.\nSo my question chairman has a governor's office\nthat the governor's flow of leader weighed in as to this bill.\nThank you for the question.\nI'll defer to the governor's flow later.\nNow, I'll say the governor certainly has his prerogative.\nIf he feels that this bill is unconstitutional, he can so note.\nBut I believe that it's clear that legislation has granted the secretary\nstate with most of the authority he currently has.\nand this bill simply takes the oversight ability\nand invest it within the state election board.\nAgain, this is not an unconstitutional act.\nIt's an act of a legislature\nto ensure the state election board has oversight authority.\nThis bill does three things.\nIt removes the Secretary of State from the board,\nnot even has an effect ex officio.\nit allows the state election board to have oversight for the Secretary of State's responsibilities\nas it relates to elections, and it provides the state election board with investigative\npowers.\nSenator Harper?\nYes, sir.\nSorry to burn.\nYou did it.\nYes.\nThank you for the bill.\nI think it makes a lot of sense with the issues that we've had over elections to have\nan election board with power to do some things.\nI have a question for you in the area of investigations.\nYes.\nAnd that you and I have had conversations in many areas\nabout the power and the funding is what I would look at.\nThe number one is the funding capabilities\nor the funding money for this to give them the power\nto investigate and what power do those investigators have\nfrom a standpoint of can they subpoena can they request\ndocuments is does that need to be broadened\nWhen you say investigator, what powers do they have\nand where would they derive those powers from?\nRight now they would conduct the investigations\nas designated by the State Election Board.\nI don't presume to have that detail available.\nI would suggest that the State Election Board\nwill make by rule those responsibilities.\nI think the most important thing is,\nthe State Election Board currently has no way\nto independently investigate\nany allegations of the Secretary of State, or any of his staff, or any local election officials.\nAnd if you look at lines 31 and 32, it specifically says that the State Election Board\nhas the authority to investigate the Secretary of State and local election officials.\nNow they would still work. I would say for the majority of their\ninvestigations through the secretary's date, but they would have the\npower to investigate independently. Yeah. Funding for this.\nFunding of this will have to certainly come through\nappropriations. And we're in discussions with, depending upon the results of\nthis legislation, what resources the state election board would need.\nI believe we have a vote on a new state election board\nChairman pending in the Senate as well as a new member of the state election board. So we're\nlooking at an opportunity to empower the state election board so that they can have oversight\nresponsibility and that they there's no confusion about who where that oversight responsibility is\nvested. Thank you. Appreciate it.\nYes, sir. My question is for the legislature council. This may surprise some of our members\non this committee, but I've read the Georgia Constitution and I looked at it again today.\nI can't find anywhere in the Georgia Constitution that gives the power to operate and run the\nelections to the Secretary of State. I'm looking at Article 2 under voting in election\nSection 1, paragraph 1, and it appears that the elections are to be done by a secret\nballot, and the procedures that are be conducted will be in accordance with procedures provided\nby law. And then it talks about paragraph 1, Section 200, General Provisions, again,\nthat the General Assembly will provide by law for a method of the appeals and so forth.\nBut nowhere in the document that I've read does it indicate that the Secretary of State\nis responsible for conducting the elections.\nCan you comment on that?\nThe, you are correct that the constitution does say\nthat the elections will be conducted in accordance\nwith the procedures by law.\nI will also point out the article two, section two,\nparagraph one of the constitution does provide,\nand the last sentence I'll read it,\nthat the general assembly shall provide by law for procedures\nwhereby returns of all elections by the people\nshall be made to the Secretary of State.\nSo at the very least, the Constitution does provide a role\nof, for the Secretary of State,\nas receiving the returns of all elections.\nCorrect.\nCorrect.\nBut those procedures would be determined by state law,\nwhich would be passing of general legislations\nand correct.\nYes, sir.\nThank you.\nJust follow up, Mr. Chairman.\nThank you, Mr. Chairman.\nI just have a question as relates to the Secretary of State having investigative power.\nMany of you may recall now Governor Brian Kemp was Secretary of State that investigated\nthose 12 folks in Whitman County and then related those charges to a criminal prosecution\nand which those charges have now been dropped.\nUnder what authority was then Secretary of State Brian Kemp operating under to have that\ninvestigative power?\nI'm not pretty to that particular case, and I wouldn't presume to speak for the Secretary\nof State at that time, Mr. Camp or the current governor.\nI would say that the currently, the Secretary of State has an investigation's division,\nand that they do routinely pursue allegations of voter irregularities.\nI would suggest that the Secretary of State in his office has no oversight and that's\nwhat this bill is about.\nThis bill is not necessarily targeted at direct voter allegations or voter irregularity\nallegations.\nIt's targeted at the ability of the state election board to provide reasonable oversight\nover the election's responsibilities that the Secretary of State has been legislatively\nprovide.\nWell, that's why I was trying to understand this German and maybe my public school education\nnot let me fathom it. So if the counties are only supposed to supply to the Secretary\nof State the information, and if there's any malfeasance, then he has a division in\nhis office that would do the investigations. So who would the investigators of the State\nelection board be investigating if they could they could investigate either allegations\nthat perhaps the elections division of the Secretary of State has not pursued, or they\ncould have pursued investigations associated with irregularities of the Secretary of State's\noffice. So that there's reasonable oversight. We're not out there on a witch hunt looking\nfor problems. We're out there to provide reasonable oversight of a very critical process\nthat impacts every citizen in Georgia.\nAnd my final question, would that not be a function of the Georgia Bureau of Investigation\nAnd they could and have been called in to assist in the investigations of voting irregularities.\nBut I will also say that the Secretary of State's election investigation division is\ngenerally the primary lead on that responsibility.\nThey could call in the GBI if necessary and as appropriate, realizing in every case where\nthere is probable cause. The the the allegations are referred to the attorney general or the\nreferred to the district attorney within that jurisdiction. Thank you.\nWhat I have witnessed in the past for my experience would be the Secretary of State's investigative\ndivision would investigate the allegations of irregularities and elections. And then they would\nturn that over to the state election board and they would actually meet and they would take action.\nBut is it not true, Mr. Chairman, that the state election board acts on the recommendations\nof the investigators of the secretary of state? That is correct. And when the secretary of state's\ninvestigation needs to be supplemented currently, the state election board does not have that\ncapacity, right. Do you have a question? No, thank you.\nYes, sir. Yeah. Isn't it true, Chairman Burns, that none of these powers that we're talking about\nare in the Constitution. They're all in general law that the Georgia General Assembly has passed\nover the course of time in our state history. So we can change them a minimum in any way we want\nThrough the legislative process. That is my understanding. Thank you\nAny other questions from the board?\nWell of the committee\nSenator Roberson. Mr. Chairman, I make the motion do pass\nHave a second\nall.\nHow to,\nSo I'm reading off of his LC 47, 2735 Sierra.\nSecond seems good.\nOkay.\nAny discussion?\nWe have a motion.\nA second in discussion.\nYes, Mr. Chairman to the concept of this bill.\nIt seems that we're creating another investigative body wasting precious taxpayer money\nthat could be allocated to other agents. Any other member? All in favor say aye. Any opposed?\nSo carry.\nThat concludes our meeting. You want to adjourn it?\nOur meeting will be adjourned.\n",
  "updated_at": "2026-02-12T01:43:23.446828+00:00"
}