{
  "video_id": "dMGA8h3FuBc",
  "url": "https://www.youtube.com/watch?v=dMGA8h3FuBc",
  "title": "1/10/2024 Senate Committee on State and Local Governmental Operations",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 62,
  "summary": "Overview:\nThis Georgia Senate Committee on State and Local Governmental Operations session on 1/10/2024 focused on a proposed Cobb County school board redistricting map. The committee chair noted the tight timeline to comply with a federal judge's order, and highlighted key aspects of the map such as maintaining a majority-minority district and achieving narrow population deviations across districts.\n\nKey Actions:\nNo bills were passed or referred.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The committee chair introduced a new administrative assistant, Karina Edwards.\n- The chair noted the committee had to act quickly to comply with a federal judge's order by January 10th, the date of this meeting. An agreement had been reached with plaintiffs to extend the deadline to January 22nd, though the chair was unsure if that was realistic.\n- The chair walked through the key features of the proposed Cobb County school board redistricting map, including maintaining a majority-minority district, minimizing population deviations, and reducing the number of split precincts.\n\nVotes:\nNo recorded votes.\n\nAttendance:\nQuorum was present, though the chair noted some members had prior obligations that limited the time available for the meeting.\n\nAdjournment:\nThe meeting was adjourned, with the next session date unspecified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThis is day three of a nice 40 day legislative session.\nWe're here for one short order.\nMy name is Frank Giena, chair of the committee.\nI want to introduce everybody to Miss Karina Edwards, who is my new administrative assistant\nthis year.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThere's a date that they thought was the appropriate date for us to move towards.\nSo Mr. Chairman, what I'm doing in acting on this, in the timeline we're acting under,\nis A, the direct order of a federal judge, Eleanor Ross from the Northern District of Georgia,\nto act on this by the 10th, which is today.\nbeen in agreement by the plaintiffs and the Board of Elections the 22nd is the\nappropriate day so we are moving this forward without rushing with great\ndeliberation and thoughtfulness this map is a product that's been worked on\nreally since the order came down on the 14th of December to a to comply with all\nthe provisions of her order and put something before this legislature and the\nCounty that we can be proud of that meets our voting rights act obligations and\nother provisions that were specified by the judge. They're the comments that\nwere made about it. But this map accomplishes that and if it pleases the chair\nglad to walk through some provisions some specific things we looked at and\naddressing the judge's concerns that are captured in this map I can give\nto this is quickly or slowly is like Mr. Chairman but that's kind of the\nframing of the issue before I move forward I just want to see if there's an\nand it was the chair wanted to add.\nThank you, Mr. Senator.\nSenator said, if I can, I want to see how many people\nare signed up on that sign-up sheet, you know, young man?\nYou go right ahead.\nAnd then just pass the sheet up here to me.\nI want to see how many people we got interested in talking.\nI will tell you that I know that some of our members\nhave obligations that they had committed to before.\nWe rushed to have the committee meeting this afternoon.\nAnd because five o'clock was our only opportunity,\nI want to be respectful of their time.\nSo our goal was to get in and out of here by 5.45.\nSo if I can get that coming towards me,\njust carry it up here, please.\nThank you very much, sir.\nMr. Chairman, as we're proceeding,\nI've got four people that are signed up to speak.\nSo if you can limit your comments to the next,\nsay five or 10 minutes at the most, said to me.\nYou got Mr. Chairman?\nWe are, as we know, the Senate's a separate co-equal body\nfrom the House, the House.\nMembers from Cobb County have rules that apply to their process.\nThat's been raised before.\nOur process is one in which if there's four of the six senators from Cobb County,\nif there's four or more on a map, it goes through the uncontested bills and resolutions process,\nbefore filing the bill, sought the signatures.\nNot to say that I won't get support from those senators, but it wasn't immediately forthcoming.\nSo having worked on this, having shared this information\nwith our Cobb legislators early Saturday morning,\nwe had a hearing Monday morning,\nor had a meeting of the Cobb legislators,\ndiscussed the map in great detail,\ntook 45 minutes of questions and discussed those back and forth.\nHad another public meeting yesterday,\nalso called by our delegation chair,\nwe spent more than an hour and a half,\nabout two-thirds of which was focused on this map\nand this plan to specifically discuss among our members,\nthose issues. And what I bring before you today is something that's been\ndiscussed extensively. Obviously there will be some that think we had to, you\nknow, follow some other process in presenting this. But what's before it?\nMembers today, again, as a plan for the Cobb County Board of Education, what\nyou see in the middle of this plan, if you can see the map to my left, you're\nright, you see Cobb County's boundaries, the white area in the center is the\nCity of Marietta, you may or may not know the Marietta City has its own city school system.\nSo the area that's represented in the center of the county is represented by Marietta City\nschools.\nThe colored areas around the county, there's seven colored districts are the proposed districts,\nthe seven districts for our Cobb County Board of Education.\nOur Board of Education has seven members, four year terms, and the seven members elect\na chairman from amongst them to serve as chair for a two-year period. That's how that\nprocess works. Consistent with the judge's order, what you see is you see a plan that\ncomplies with the Voting Rights Act. I'm going to see, I've got a pointer. Of our seven\ndistricts, what you see, but again, the color district was proposed. These dark lines\nshow, and at this for purposes of context, Mr. Chairman, these dark lines show the lines\nof the existing districts from 2012, sort of the baseline from which this map is being\npresented. Again, those are the districts that were in place before 2022. The 2022 map\nis in rural and litigation. So this 2024 map is what you see in these colored masses here,\nbut it's relative to these lines. So you can see, you know, this district three line complies\nvery closely to the existing lines. And I'll start there, Mr. Chairman, of these seven\ndistrict from 2012 and again in this plan there is one district that is a\nmajority black district under the Voting Rights Act. District 3 in 2012 was a\nmajority black district. It's a contingency being a majority black district\nand the lines of that district are very close. We had to make a couple changes\nto maintain population balances but district 3 is largely maintained here\nand that's the only majority black district that's that's required by Voting\nAlright, it's active cross-cov.\nOverall, the population equalization is strong\nacross this plan.\nHistorically, decades ago, these districts needed to be\nplus or minus 10%, that was narrowed to 5%.\nAnd in recent years, we've tried to get these plans\nunder 1.5% to 2%.\nThis plan is a total deviation, district to district to district.\nThe total deviation of this plan is 0.84%.\nSo the spread is very, very narrow from district to district.\nSo from the perspective of a proportional representation,\nthis plan is very, very tight, very, very close.\nWorking through other mandatory requirements in the plan,\nthere's a list of mandatory criteria,\nand there's a list of what we call preferred criteria.\nBest practices, they're not strictly mandatory,\nbut that we follow.\nSo criteria one, complying with the Voting Rights Act,\nit does that in district three.\nCriteria two, equalizing population, it's less than 1%,\nnet deviation across the map.\nAll geography within the Cobb County School Board\nis included here.\nWe have contiguous districts.\nThe only non-continuity you see here\nis islands they're created by the annexation\nof Marietta over the years.\nSo those are sort of mandatory islands,\nbut there's no other islands anywhere in these maps\nbecause continent being contiguous is a requirement.\nAlso, there's no incumbent pairings.\nAll of the incumbent sitting members of our school board\nor have their own districts, there's no pairings\nmade of incumbents.\nAnd then lastly, as we talked about,\nthe requirement to initially pass this into law\nby January 10th, not possible.\nAnd agreements have been put in place\namong the plaintiff on our Board of Elections\nfor January 22nd.\nI don't believe that's realistically possible either.\nThat wasn't ordered by the judge.\nThose were the members, so the judges\nis probably acted and approved on that.\nSo the mandatory criteria, the preferred criteria\nMr. Chairman, splits of precincts, of the 160 or so precincts in Cobb County, the 2012\nbaseline plan that you see in these dark lines have 22 split precincts.\nWe actually reduce that to nine.\nThere's about 165 precincts here with all these jagged lines.\nThere's only nine split precincts in this current map moving in a very strong direction\nin terms of reinforcement principles.\nSince it's defined places, cities, 2012 baseline\nhas four senses defined places that are split.\nThis has five, close to the same.\nThe only difference is the city of Kennesau\nhas an almost non-contiguous area to the east of I-75 here\nthat's not contiguous, but it's a real strange connection\nto the city, so this is essentially,\nsubstantially the same as the previous map.\nLast two things, Mr. Chairman, the preservation of the core,\none of the reapportionment principles\nis preserving the core of the districts.\nThe 2022 map that's in the courts\nmoved 36% of the citizenry of Cobb County\ninto different districts.\nThat was one of the things the judge raised\nwas that that was a large number that was of concern.\nAnd drawing this plan, even though we have population shifts\nacross our county, we lowered\nthe 36% relocation of folks from district to district down to 23.\nSo there's a significant drop in that, again,\nconsistent with the reapportionment principles.\nAnd then lastly, the compactness standard.\nIf you look at these black jagged lines,\nthis is what the compactness looked like of districts before.\nYou can see district five before was this.\nNow district five is a very simple core.\nDistrict three was stretched.\nI'm sorry, district six was stretched.\nall along Cobb County literally from way down here in the south of the\nKent and almost so the southern edge of Smyrna all the way up to this other\ncorner of the county what we could do is we can sell it at District 3 District 6\nhere District 2 same so the compactness of this is available to you I'll just\nleave this there's a little worksheet the top is the 2012 benchmark plan you\ncan see these standards of compactness there's four different industry standards\nthat are recognized. The 2022 plan, you can see this under litigation, you can see.\nThe standards are better than both the 2012 plan and significantly better than the 2022 plan.\nSo by every measure of compactness that courts look at, and there are four separate\nindustry recognized measures. Every single measure is improved in this map over\nthe 2012 baseline map that we started from. So that, Mr. Chairman, a lot of\nwork's been put into this map to meet the standards of the courts. I've got\nspreadsheets that could drive you nuts if that's what you want to say. I don't\nthink you do, but glad to take questions if there are any. Thank you, Senator\nSessler. It looks like you worked pretty hard to get concise map. Are there any\nAny questions from the committee members?\nSeeing no, wait a minute.\nSenator S. Wells, do you have a question?\nI do, Mr. Chairman.\nI'm sorry.\nWhat's your number?\nIt doesn't have a number.\nYou have it.\nI think that's your own.\nAll right.\nFor Georgia fans, Nick Saban is retiring.\nI see it.\nThere you go.\njust got that on my own, just got that on my watch, breaking news, more in line with this\nhearing. Senator, thank you for bringing your presentation. I, Mr. Chairman, I emailed\nthe order that the judge issued and you know I didn't read it.\nNo, it's okay. And just hope that the committee will receive that.\nFor those of you I know it's hearing only today.\nBut Senator, I wanted to read one piece of one sentence and\nask you a question related to it.\nIt says the parties do not dispute that the enacted map,\nwhich is the 2022 map. Move both black and Latino voters out of districts 1, 4, 5, and 7,\nand simultaneously increase the percentage of right voters in those same districts.\nThe court finds that this is evidence, this evidence supports that race was the predominant\nmotivating factor behind the enacted map. How does your proposed map differ from that of the 22,\n2022 map, which moved both Black and Latino voters out of districts, 1, 4, 5, and 7, which\nis the north side of Crabic County.\nSure.\nFair question.\nThe map in 2022 created much more jagged lines here.\nThe 2022 map has this district 3, instead of following this little trace here, kind of\nthat jets down and back out, there's a whole lot more happening in the 2022 map that\nis the court's sights in accomplishing what you're talking about.\nWhat this seeks to do is rather than making massive shifts, where 36% of the county has\nmoved, this reduces that to 23%.\nAnd it also focuses on compactness.\nThere's obviously not a big focus on compactness in the 2022 maps because those are in the courts\nand we're sort of setting that aside with respect to consideration.\nI didn't want to get folks confused with three sets of maps.\nThose maps are not a basis of comparison for us.\nThose are things that we, well, they were useful for us to understand what not to do.\nThat's why you see what you see here.\nWhat you see is you see a very, you see much more subtle changes here in three.\nIn fact, when you talk about moving people out of District 3,\nthe total shift of citizens out of in and out of District 3 is around 3,000 people.\nIt's a very, very tight move.\nYou can even see in District 2 here, relatively modest shift.\nshift. This is Dobbins Air Force Base. This is a lot of land, but this is not a lot of people\nin this area. It's heavily populated in this edge. This is Dobbins. So this shift, you\nsee much more subtle shifts in this map, specific for that reason.\nI appreciate that, Senator, but the judge specifically said that districts 1457, which you\ndid not mention in your answer right now, were the districts where both Black and Latino\nthe voters were moved out.\nSo I'm just asking, if she threw out that map,\nhow does this map comply?\nAnd we were both in special session just a few weeks ago.\nAnd one of the things that the sponsor of the previous maps\npointed out were the black districts that were drawn\nand where they were drawn.\nI'm just asking, the judge pointed out district.\nWhere minimal changes were made, I'm asking where were changes made?\nYeah. Well, I'm going to show you an example. I don't, I want to be respectful of the chair's time. Let me show you some statistics.\nWhat, what you see here is on your screen to your left, this is a matrix of total changes across districts.\nOkay. It's summarized and then it is, we see the, the breakout, exact amounts and then percentages.\nSo what you see here is in the 2022 maps that were frowned upon by the courts for this\nstatistic here, this is any part black, so this is black.\nThis is black who also identifies as Hispanic.\nYou see a retention of 71% of the African American population in Copenhagen stayed in place\nwhich means 29 percent shifted. That's what she's talking about when she makes her order.\nWhat you see now is the retention in this map goes from 71 percent to 84 percent. So you\nsee a significant, if 29 percent of African Americans were being moved in the 2022 map,\nyou see in this map just over 16 percent. So a significant drop in African Americans\nbeing moved around the map. And this is broken down by precinct. And that was a very important\npart of this. You can, in fact, if you look at the, in this, it's, it's much richer here.\nLook, any part black. Any part black was 71% and in what was, I mean, that means 29% of people\npercent of people in the 2022 map that was struck down in court were moved around.\nIn this case, in contrast to 29 percent of any part black moving, again, it's just under\n84, so it's 16 percent.\nSo we moved from moving 29 percent of African Americans in the county in 2022 in the map\nthat was passed, that was struck down by the courts.\nWe reduced that to 16 percent.\nWe were laser focused on that issue to be compliant in every way possible good.\nIt can't be zero, but we've reduced it from 29 to 16.\nOne last question, Mr. Chairman.\nAnd thank you, Senator, I won't pick through that answer.\nI'll move to the last point, which is that the judge raised concerns that the map was\nnot brought through the local legislative process.\nThis is a general bill, which is your prerogative.\nThere were concerns that were voiced by both Republicans and Democrats yesterday, about\nthree key points.\nOne was McEachron High School being split from Powder Springs, the splitting of Smirner,\nand how Smirner was split in your map.\nAnd then how we were in Walton, feeder patterns were drawn in your map.\nAgain, those were concerns that were voiced by Democrats and Republicans.\nHow have you worked to address those concerns, particularly because that's how the local legislative\nprocess typically works.\nYou get whoever is part of that delegation together to work through issues and everyone\ngenerally agrees.\nGiven that feedback from bipartisan colleagues, what have you done to change your map?\nLet me answer the rootier question, which is the use of school attendant zones as a central\nfeature for drawing maps.\nIf we were drawing a map from scratch that wasn't subject to a court order that says we have\nto maintain certain priorities of not moving things around, we might have drawn a map that\nwas more tied to school attendant zones.\nOne could say that the 2022 map was even more attentive to those kinds of things, maybe\nnot in one area, but certainly in others.\nBecause we're in a place where the judge was very prescriptive about the things we had\nto address, to address the very serious charge of moving black people around and other\nminorities around in ways that was seen as unacceptable by the judge, we had to address\nthose issues front and center.\nWe couldn't take secondary and tertiary criteria, which are meaningful, but not essential.\nWe focused on the essentials in this map.\nThat's why I was sharing that with you.\nexample of that when you look right here, this map shows spray berry high school, okay?\nSpray berry high school located right here across the street from spray berry high school\nand other district starts.\nSo the spray berry attendant zone, which is right here where my cursor is showing, is split\nin half by this map, okay?\nIf you go here, Kennesaw Mountain High School, where my son went to school.\nKennesaw Mountain High School is right on the scene between District 7 and District 1.\nThis Kennesaw Attendant Zone is split and carved up by this map.\nI mean, Kennesaw Mountain High School students will have two school board members.\nThey won't have four, but it's split right along that line.\nLikewise, as you go to the south, you raise the question of McEachron High School.\nMcEachron High School is not right on the line.\nMcEachron High School is in this Attendant Zone.\nMcEachron High School, much like many of the other high schools, has their school Attendant\nZone split among two districts.\nIt was raised yesterday in the discussion, but if you look across this plan, you have\nCampbell High School right here, right on the line.\nYou've got Osborne High School, yeah, you have Osborne's right here.\nPretty central within the new tube, but in the old line it was split.\nSo Wheeler High School, just north of this line, our goal was to make sure that high schools\nhadn't where we could have no more than two school board members we didn't want\nfor your four but the idea that we we can contain an entire school attendance\nentrance is not realistic given the order of the judge\nthank you senator sessler in the interest of time i'm going to ask you to\nrecede and i'm going to call on a couple of these folks that have signed up to\nspeak i'm going to try to limit them to two or three minutes the uh\nfirst person that looks looks like his uh\nsend the battles, send the battles in the room.\nIf you would miss battles, come in,\ntell us who you represent.\nWhat do we do?\nMr. Chairman, let me just shrink this down\nso we can have it visible and that will yield.\nGood afternoon, members of the committee, my name is Cindy Battles, and I am the policy\ndirector for the Georgia Coalition for the People's Agenda.\nThank you very much for the opportunity to be here today.\nI want to talk a little bit.\nFirst of all about the process, because Senator Settler keeps saying that the deadlines\ndon't work, but the deadlines work if we go through the regular process, the way that\nthis is supposed to go through.\nIf it went through the local process, the way that many of the local bills went through\nwhen they were redistricting during the special session last year, these deadlines would\nin fact work.\nSenator Settler was asked yesterday by Republicans and Democrats if he and Representative\nInuloids could work together to create a map that was agreeable to everyone and Senator\nSettler made it really clear that he was going to continue this process.\nWhat that means for our members that live in Cobb County is that they are not being given\nequal access to the democratic process.\nthey have elected representatives and senators who will come together and work for them and\nwith them to create school board districts and local districts and that type of thing.\nI have not had a chance to analyze the bill the way I wish I had, but this is the map\nthat the judge disagrees with and when I look at that and I look at this, my question is\nwhat analysis has been done or who did that analysis to guarantee that this map actually\ndoes meet Section 2 of the Voting Rights Act because a judge, regardless of what anyone\nin this room thinks about the process or the organizations who brought this forward\nfor the voters of Cobb County, the judge said that this violates the constitutional rights\nof the people of Cobb County.\nAnd if you haven't made significant changes to that, then there's a problem.\nGiven that the fact that the senators is here, I'd love to use the process to ask,\nWhat functional analysis has been done?\nDo we have an analysis that his proposal does meet?\nBecause what's going to end up happening\nif we get whatever process we go through,\nif it doesn't meet second to the voting rights act,\nwe're going to be here for another special session.\nAnd my other question would be who drew this map?\nBecause he keeps saying we worked really hard.\nBut I know on Monday, we didn't even have an LC for this bill.\nThe LCRO, when we went and asked for the information\nin the shapefile for Senator Settler's map, didn't have it.\nSo I have significant questions about the way this is done.\nI have real concerns about the fact that,\nand I appreciate Senator S. DeVez bringing this up,\nRepublicans and Democrats of the Cobb County Delegation\nhave raised objections to the way that this is going.\nSo I'm going to ask this committee to not move this forward\nand let it go through the local resolution\nin the way that it should go,\nso that the voters of Cobb County\nare represented by the folks that they sent up here\nto represent them.\nThank you for your comments, Ms. Battles.\nNext is, it looks like Michael Garza, is that correct?\nYes, that's correct, thank you.\nWho do you represent, Michael?\nOkay, my name is Michael Garza.\nI'm a, I don't represent an organization,\nI'm just here, I'm a resident of Cobb County\nfor over 20 years.\nI have a daughter who's the first grader\nthat goes to Copcany Schools.\nThis is my daughter.\nShe's going to be governed by this map\nuntil she's in high school.\nI'm also here as a member of the Latino community,\ncommunity whose constitutional rights were violated\nwith the 2022 map.\nAnd who is looking to have those rights restored\nwith this new map.\nNow, I don't want to get into talking\nabout too much about Senator's map.\nBut I did notice that he mentioned\nthat the movement of black and Latino voters,\nbut even with this map, I noticed the figure 74%,\nwhich means 26% of Hispanic voters were moved in this map.\nNow, our school district has, it's a complex district.\nWe have a lot of challenges.\nWe have great educators.\nMy daughter goes to a great school,\nbut we do have some challenges.\nWe have partisan leadership.\nWe have leadership that silences the voices of students,\nparticularly students of color.\nWe've even had an issue of officials\nwho have spied on students,\nwho have come to speak at public comment.\nAnd so I'm not here to ask you all to solve these issues\nbecause you're not really equipped to do so.\nThey talked about the Wheeler feeder patterns.\nI don't know if I asked any of you to tell me\nabout the Wheeler Magnet program that any of you could tell me about that because most\nof you live hundreds of miles away from Cobb County.\nBut I am asking you to allow us to have a voice in being able to solve these issues by\nbeing able to fairly elect leaders at the local level.\nAnd in this particular bill, there are three senators attached to it and they all represent\nthat northern half of the county, that half of the county,\nwhich was specified in the judge's order\nas being where they bleached the voters\nin making those districts wider and wider.\nSo yesterday I was in the county delegation meeting.\nMembers of the both parties talked about coming together\nto support a bipartisan map.\nThey asked point blank the senator if he would support that\nby by partisan measure and he declined.\nSo I'm asking for this body to just hold the process\nto allow for the delegation to come together\nand to hash out these issues.\nAnd because I think that to have three senators\ndecide our map from a very small part of the county\nis not how it should work.\nThose voters in South Cobb need to have a voice.\nthose voters in West Cobb, in East Cobb, in Smirna,\nI need to have a voice, and they're not gonna have a voice\nif this map proceeds through this process.\nThank you.\nThank you, Mr. Garza.\nOur next up is Jennifer Susco.\nIf you would, please tell how you represent.\nMy name is Jennifer Susco, and I am a post six resident,\nI'm not representing anybody, but myself.\nI went to all Cobb County schools.\nSo I said I am in Cobb County School Board Post 6.\nI think that's where I live.\nI'd really like to know for sure though.\nBut some are drawing out this process even longer\nso that voters in Cobb County remain uninformed\nand Black and Brown voters continue\nto be denied constitutional voting rights.\nSo I'm here to ask you to oppose the bill\nbecause of the incorrect process it's following again\nand instead allow local legislators to work together\nhow they should have the first time around.\nIt's incredibly frustrating that we seem to be back\nwhere we started rushing a bill through this way\neven after a federal judge has made a clear order\nabout the problems with this process.\nOur white school board chair excluded and lied\nto the black board members to collaborate with some\nto create maps that have now been proven\nby a federal court to be racist,\nby which I mean white people limiting the voting rights\nof black and brown voters.\nAnd somehow, though there's an order from a judge\nto move through local delegation,\nit seems the author of the bill is intent\non going down the exact same path forcing this process.\nHe doesn't consider the judges ruling to be official,\ncase law, et cetera.\nMy understanding is that he's wrong on the law\nand the map will be thrown out again.\nI'm sure Judge Ross will not be pleased\nthat colleagues and others have said,\nHey there, you're doing it wrong again,\nespecially when her order makes the remedy clear\nand this bill seems to intentionally go against it.\nThe Cobb County community deserves to know\nwho represents us and who is qualified to run for office.\nWe had to sit through the Earhart's first failed attempt\nat this and we shouldn't have to go through it again\nnow with yet another problematic map.\nI know that what I'm saying will not likely stop\nthe stonewalling by the author of this bill\nwhen colleagues offer fair ways to collaborate,\nbut I would like to have it on the record\nthat there have been warnings about knowingly going\nagainst Judge Ross's order and that the Cobb County\ncommunity is exhausted by the political games\nplayed by those terrified of losing power.\nThank you to those of you trying to offer our community\nthe leadership we deserve and who understand\nthat this is an urgent matter for Cobb County voters.\nI'm particularly grateful to those of you who understand\nthe depth of meaning behind these decisions\nyou're in charge of when Black and Brown voters\nare disenfranchised.\nSo thank you for allowing the judges order\nto encourage local collaboration\nand to repair harm from disenfranchisement\nby opposing this bill.\nThank you.\nYeah, excuse me.\nMs. Susco, would you answer a question\nfor one of the committee members?\nOh, I didn't know that was part of it.\nYeah.\nThey don't do this on the school board.\nThey don't interact with us.\nYeah, we interact here.\nOkay.\nthe chair allows it.\nYou have to chair now.\nIn this case, we're going to let our whip do that.\nI'm curious, you used the word that always\nperks up my ears.\nIs it racist?\nYeah, the judge said this in the order.\nNo, no, I said that.\nAnd then I said by which I mean white people limiting the voting\nrights of black and brown voters.\nOK, well, that's just a word that gets overused a lot.\nThat's why I said what I wanted.\nIf you let me finish, please.\nIf you let me finish.\nSo it's a word that gets overused in here.\nthe word has an actual meaning.\nI'm well aware of it.\nAs am I.\nAnd so when you said it and we're talking about\nthe judge's order and this kind of thing,\nI was wanting to know, I was going to ask\nfor a reference into the judge's order.\nBut the judge did not use the term racist.\nIs that correct?\nI don't know.\nOkay, you answered my question.\nThank you.\nSure.\nLast on our list is Gabriel Sanchez, I believe.\nAnd who do you represent, Mr. Sanchez?\nWho's myself?\nOkay.\nHello, everyone.\nMy name is Gabriel Sanchez.\nI am a candidate, I'm a Democratic candidate\nfor Say House 42 in Sumerna,\nI'm Ariadne in Cumberland,\nand I'm here today as a cobb resident,\nsomeone who's born and raised in cobb\nand an alumni of cobb schools,\nas well as a lot of younger cousins\nwho currently go to cobb schools.\nYou know, I really am concerned about these maps\nand I'm actually, before I ran for office,\nI've actually worked in redistricting advocacy work\nsince 2021.\nSo I've been pretty involved in the process\nof the last three years.\nAnd I just want to say, here we are again.\nTwo years later, almost every single district in Cobb County\nexcept for the municipal districts\nare ruled on constitutional and have to be changed.\nNearly all of those maps were drawn\nby the Republicans in this body.\nSo this is a problem of your own making.\nWe are here because of the maps that you all drew two years\nago.\nYou were warned over and over again that these maps\nnot good, yet steam rolled ahead by passing the typical process always done for local legislation\nby not following the majority of the cop delegation and steam rolling your bill ahead.\nSo why should we trust the people who made the maps that led us here to draw the new maps again?\nThis is the definition of insanity is doing the same thing over and over again and thinking we're\ngoing to have a different result. Because once again we're bypassing the cop delegation to steam\nrolled this map through because it benefits the Republicans.\nI would love to give more numbers and analysis on this, but unfortunately due to the secrecy\nof this process, I'm not able to give you that information.\nBut based on the track record, I don't have a lot of trust that this is actually going\nin a good way.\nTo me, if there wasn't really a problem with this map, I'm not sure why it's the author\nnow willing to work with others to compromise.\nIf there was no problems with the map, I feel like they would be more open to compromising\nand working together to make a map, but instead you seem really intent on pushing this map\nfor some reason.\nThis is why I believe we need independent redistricting commissions because clearly this\nbody is not able to draw their own maps without having to go to litigation every single year\nand waste taxpayer money and waste all of our time because we're in 2024 and we're still\ndealing with redistricting.\nThis is a shame, this show is just how ridiculous this body is and how unable you are to actually\ndraw fair maps for the people of Georgia.\nSo I plead with you, plead with you.\nLet's do the process right this time and put Cobb County residents first.\nNot y'all's party, not your own power.\nThe people of Cobb County first to make fair maps that align with the court order.\nI would appreciate it.\nThank you so much.\nAt this time, I'll ask the senator to come back up because he's asked for a hearing\non this bill and trying to comply with the judge's orders and as much as we could, what's\nyour desire Senator?\nMr. Chairman, if it please the committee, I'd love to have a motion do pass an act on\nthis today.\nI'm glad to address some of the questions that were raised by the people that testified\nor how we just leave it to the chair.\nIn a quick blitz through that, it's very quick blitz, Mr. Chairman.\nThe judge set the timeline.\nWe did not.\nWe're not rushing this process.\nwere simply trying to comply with the court order that said January 10th and now it's January\n22nd.\nWe don't ignore that.\nIt was a substantive court part of the judge's order and we're operating on that timeline.\nMyself, Senator Cropatric and Senator Albers all support acting on this.\nMember of the Cobb delegation yesterday that raised the question was a House member who\ndeclared herself that the adult in the room and to said their needs to, in her opinion,\nneeds to be more dialogue.\nAfter two and a half hours of meetings,\nmyself, Senator Krupatrick and Senator Albers\nare both resolute.\nWe've put an extraordinary amount of homework into this.\nI consider all night and walk through analysis\nand data and numbers, how we forensically peace by peace\nby peace complied with the judges\norder in developing this map.\nAnd just lastly, the falsehood that we're somehow\ngoing around the process. Our process in the Senate is very clear. It's very clear. If\nyou have a majority of, for example, if you have four legislators that sign the map,\nit goes to the uncontested bills and resolutions calendar. If you don't have four, it goes to\nthis committee process we're facing today. The premise, the recite stepping this process\nis falsehood.\nIt's being flamboyantly shared here by people\nin this committee hearing.\nPerhaps, I don't want to speculate, perhaps.\nThere was some clarity about our internal process\nwithin the legislature for how bills are moved,\nbut with respect to the Senate,\nwe are following the process.\nAnd I appreciate the chairman's scheduling hearing,\nand I think, again, on behalf of myself,\nSenator Kropactrick and Senator Albers,\nwho are resolutely in support of the homework\nthat's gone into this bill.\nI would ask for your favorable considerations, Chair.\nI appreciate your request.\nOne of the things that your request is a little bit late\nin the fact that we advertise this as a hearing for this bill\nsaid we didn't advertise it as the bill\nthat we were going to have a vote on the bill.\nI don't like to confuse the public\nand because we're not going to make the order of the judge\nto meet that timeline, the hope that you can allow us\nto hold us and we'll bring it up to our next committee meeting.\nYou know, I'll be glad to schedule that as quickly as you and I can get together on\ntiming on that.\nI know that Senator Mallow, you have a question.\nChairman, thank you, but I would be happy to yield to the majority whip, it seems that\nhe was eager to go.\nWell, he's always eager to go and it is getting closer to our time to go.\nit's the glasses. Senator, I'm concerned and it was brought up on a couple of occasions\nabout the analysis that was used to come up with these maps. So is there an explanation\nor a roadmap that you can provide to us prior to a committee where we may vote on this\nor not vote on it so that all committee members could understand exactly what process\nwas used to determine population and to all of the factors that we normally use when\nmaps are created in this building using the resources that we have.\nHappy to, Mr. Whip, love to do it in an open process like this.\nThere's been a suggestion by other members that we peel off and sort of huddle in a room\nand discuss map options.\nI don't want to do, I don't want X part A meetings where we're meeting and I want to\ndo it out in the open.\nWe had two open meetings about this.\nIt was raised by members of our delegation.\nWhy aren't we getting together in meeting on this?\nWe met for more than an hour on Monday.\nWe met for more than an hour and a half yesterday.\nDiscussed this map in great detail.\nI'll stay as late tonight as anyone wants to stay\nand walk through these numbers.\nYou won't see me being here with you.\nSo I'm sitting there.\nAnd again, but very briefly, we have the compactness numbers\nhere, four criteria.\nWe applied four criteria compactness.\nWe've got the voting blocks we maintain,\nwe've got the core retention numbers\nthat I've got in this matrix.\nWell, and my point is, there's a science to this.\nAnd I think everything should be on the table.\nAnd so not saying that you did not follow the science,\nbut I do think the science has to be a part of the discussion\nso that we ensure that it is transparent\nand that nobody on this committee is confused\nas to what science was.\nYou betcha.\nWell, it seems that after yielding he wants to come back again, so Senator Mallow, if you\nwant to address the question, I'll be glad to take it, but let's be quick.\nWell, listen, coming up by 16 is not as fast, but I yielded to the majority of the world\nbecause I knew where he was going to go, and I wanted to close with these comments,\nMr. Chairman, in Chatham County we have a evenly split delegation and we had the same\nissue with maps but we didn't have to go through a general bill process and the reason\nis as we did go into a room and Derek Mallow and Representative Jesse Petri could find\nsome commonalities and some common grind and I think that could happen but that requires\nthe political courage and the fortitude to set aside what you come in a meeting with\nso that we can find a way to find that common ground.\nAnd it requires hearing both sides.\nAnd if you both are angry when you leave a meeting,\nthen that means the job is done.\nBut to be a member of a delegation,\nand you come and hand someone a map without taking their feedback,\nthat doesn't quite always work so well.\nAnd I think this body has the opportunity\nto set an example that we can do that.\nAnd we should try to do that as often as we can,\nMr. Chairman.\nAnd so with that, I would hope by this time\nand our next committee meeting that the other three senators that represent Cobb could\nhave some agreement and consensus on this situation and it could be on the consent calendar.\nSenator Mallow, your wisdom is so appreciated and thank you for your comments.\nAt this time, we're not going to take a vote on the bill, we'll be glad to work with\nyou on scheduling the vote on the bill, I do agree that it is one of those things that\nI think our committee members would like to see a little bit more information and be\nglad to work with your own passage of your bill.\nWith no further other business, we stand adjourned.\nThank you very much for your attendance.\nYou\nYou\n",
  "updated_at": "2026-02-12T20:09:49.661971+00:00"
}