{
  "video_id": "dMj0lHhWUp4",
  "url": "https://youtu.be/dMj0lHhWUp4",
  "title": "Georgia House - Day 10 (2026-02-02)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 10,
  "video_date": "2026-02-02",
  "duration_minutes": 49,
  "summary": "Overview:\n\nThe Georgia House session on 2026-02-02 was marked by a prayer led by Pastor Sean C., who emphasized the importance of civil discourse and unity among political leaders, even in the face of disagreement. The session did not appear to have any notable legislative actions.\n\nKey Actions: None detected\n\nBills Introduced (First Reading): None detected\n\nNotable Moments:\n- Pastor Sean C. delivered the opening prayer and gave a speech urging lawmakers to avoid demonizing those with differing political views. He emphasized the need for integrity and civility in political leadership.\n- Representative Marcus Weedower introduced Pastor Sean C. and shared a personal story about how the pastor's church had provided him comfort during a difficult time.\n\nVotes: None recorded\n\nAttendance: Quorum present, as members were instructed to \"take their assigned seats\" for the morning roll call.\n\nAdjournment: The transcript does not explicitly state the time of adjournment or the date of the next session.",
  "transcript": "The hour of convening, having arrived, all members will please take their seats.\nAll members will please take their assigned seats in report to the House of Representatives.\nThe clerk will ring the bell.\nWe're about to have the morning roll call.\nAll members of the House will please take their seats.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nhave all members voted\nhave all members voted\nif so the clerk will lock the\nmachines\ngood morning\nHope everybody's ready to go to work today.\nWe will begin our day with scripture reading and prayer\nby the chaplain, after which we will pledge allegiance\nto the flag of our country.\nOur chaplain this morning will be introduced\nby the gentleman from the 119th House District\nRepresentative Marcus Weedower, representative Weedower.\nThank you, Mr. Speaker. Good morning, colleagues. It's my honor this morning to introduce\nto you my friend and lead pastor, Sean C. Sean grew up in Metro Atlanta, graduated from\nTicoa Falls College with a degree in Christian counseling. Then went on to earn his master's\nin theology from the Dallas theological seminary. He has served on staff at\nfirst Baptist Church of Atlanta, Northwest Bible Church in Dallas, Texas, and\nNorth Point Community Church in Alpharetta. In 1999, Sean was working at North\nPoint when he felt a calling to find a city that did not have a church quite\nlike North Point. After years of prayer and planning, he and his wife Bonnie moved\ntheir family. Now includes three children, Boone, Bryson, and Lola who's with us\ntoday as well. To Athens and started Athens Church, where he's now been the\nlead pastor for 16 years. First time I walked into Athens Church, so a man\nfrantically putting out chairs because clearly more people had shown up than\nhe had anticipated. Looked up me with a joyful smile, energetically said good\nmorning and scurried off to fetch more chairs. And minutes later, same man was\nstand on stage, welcome in the crowd to Athens Church as their lead pastor.\nI was, it's always stuck with me when I think about Sean, because I literally can feel\na joy in his heart, that his faithfulness to God, calling on him, to lead people into\na growing relationship with our Lord and Savior, Jesus Christ, had resulted in thousands of\npeople in the greater Athens area, calling Athens Church home.\nThis same faithless led Sean his amazing team to make a rather unorthodox real estate decision.\nAfter acquiring the entire commercial development where the church was located,\nthey decided to tear down an anchor space to the development and replace it with an outdoor\ngreen space for fellowship and worship. They broke ground on that green space project, August of 2019.\nHow would anyone have known that a few months later that decision would provide Athens Church\na setting to allow people to safely gather to hear God's word at a time when many of us\nneeded it most?\nLast July on a Monday morning in that same green space, I sat there with my oldest daughter\nwhen it became obvious that I was gravely ill and I was admitted into a hospital.\nI don't believe it was a coincidence that led me to seek peace that morning in that space\nthat was created from Athens Church's overall mission of leading people into a growing relationship\nwith Jesus Christ.\nBy the grace of God, I made it out of that hospital, and I'm standing before you today.\nAnd I credit Sean with having a vision for a church that has shepherded my faith which\nsaw me through one of the darkest times of my life.\nAnd for that, I will forever be grateful.\nPlease welcome my pastor and friend, Sean C.\nWell good morning.\nIt is an incredible honor for me to join you today.\nI can only imagine the only thing on your mind and your agendas, what I have to say in\nthese few minutes, but chances are you have a couple of other things that are on your\nmind as well.\nBut I want to tell you, I'm going to be brief, but I believe what I have to share with you\nis very, very important, not only for you,\nbut for the people of our state and even the next generation.\nAs Mr. Wiedauer just mentioned,\nthis is my daughter, Lola.\nYou can't all see this picture obviously\nfrom where you are, but she's just in the speaker's office\nthere.\nAnd I wanted you to see her because I wanted her to see you.\nI brought her here on purpose.\nI brought her here because this is an honor for her\nto see our state's capital and to see\nthe elected officials that lead her and lead the state\nthat she has enjoyed to call home.\nYou know this, but historically,\nmy position as a minister and your position\nas a public servant has been a very highly regarded\nopportunity, very highly guarded position.\nUnfortunately, as I stand before you in February of 2021,\npreachers and politicians are not necessarily\nas highly regarded as they have always been.\nAnd I believe that it is quite possible\nthat two of the reasons that that is the case\nis because some of us\nhaven't lived lives of integrity\nthat leaders are supposed to live.\nBut specifically what I wanna focus on\nin our few minutes together this morning is\nthe way that we have used our words in our leadership.\nYou see, our world has never been more full of words.\n24 hours a day, seven days a week, the four-profit media organizations have filled our airwaves\nand our lives with more words than we could ever imagine.\nAnd I understand the media is a four-profit business.\nIt is their job to tell us what to fear and who to blame, and they are doing a phenomenal\njob at what they have set out to do. But it is my observation that their words and their\ninfluence are impacting our leadership too much today. So much so that I believe that\nmany of us in the roles that I'm in and the roles that you're in are not using our leadership\ninfluence by the way we use our words very effectively and I will realize I'm going\nstraight to the point as a matter of time today but I believe this is something that's very\nvery important. Political leaders have taken people that sit across the aisle from them and\npeople that have different views from them and they have not only said that they're wrong,\nthey've gone to the extent of saying that they're a bad person. They've gone to the extent of saying\nthey're an evil person that many times gone get the extent of demonizing those people and I want\nyou to remember something today, please. Wars begin with words. Wars begin with words and that's\nan important idea and here's something I can't quite understand. Why is it we don't understand it\nis human to disagree. I don't know if any of you are married but it is human to\ndisagree. I don't know if you grew up in a home with a family, it is human to\ndisagree, right? That is normal but somehow we have developed the idea that\npeople who disagree with us are not just wrong but they're terrible people. Now\nI want to pause here just for a moment. I understand many of you come from very\ndifferent political perspectives. Some of you look at the political perspective\nopposite of yours, and you not only think it's wrong, you think it's going to lead to\na bad Georgia and a bad America. I understand that. And that's not unfair to disagree with\nthose ideas. But what we are modeling for this generation is that when you disagree with\nsomeone, you demonize them. That's bad leadership. That's what many of us have done. And I'm\nI'm here today to ask you as a father, as a man, and as a pastor to please not use your\nleadership influence in that way.\nI get political flyers sent to my house.\nThere's political ads on all day every day, it seems.\nAnd most of them are demonizing people on the other side.\nAnd we've somehow developed the idea that the ends justify the means.\nBut that's poor modeling for the next generation.\nThat's poor modeling for my daughter who I brought down here to meet you today and to honor\nyou today and to be thankful for you as her leaders.\nSo there's a very simple Hebrew proverb that I want to share with you today that is in\nthe Jewish scriptures and it's in the Christian scriptures and it's Proverbs 12-18.\nis a proverb that has impacted my life,\nit's a proverb that's impacted my family's life.\nIt very simply says this, proverb 12, 18.\nIt says reckless words, pierce like a sword.\nReckless words, pierce like a sword,\nbut the tongue of the wise brings healing.\nThe tongue of the wise brings healing.\nAnd I think that passage is uniquely specific\nbecause I want you to remember this today, please.\nYou are our elected officials.\nWe praise God for you.\nWe are thankful for you.\nI pray for you and we'll continue to do so.\nBut you don't ever get to wars without starting with words.\nIn reckless words, they pierce like a sword.\nBut the tongue of the wise,\nthey don't use their words that way.\nThey bring healing.\nAnd so what I'm simply asking of you today\nis even when you vehemently disagree with the perspective of the person across the aisle from you\nor across the house from you or across the bed from you or across the car from you\nthat you would please use your leadership that we would use our leadership influence\nin a way that honors the people we disagree with. Now the last thing I'll say is this\nI have no stones to throw. I've been married for 28 years. I have three children. I've said more\nthings in my home that I regret that I wish that I had. But those have been followed many, many times\nwith a humble apology and a recognition that what I said and how I said it was wrong. And I would\nask that you would please lead in that same way. Wars begin with words, reckless words pierce like\na sword, but the tongue of the wise brings healing. And my prayer is that as you go about serving our\nour state in a complex time that you would do it in a way that honors the people around you\nin the way you use your words even when you disagree. Thank you so much for your time. If you\nwould please stand so I can pray. Heavenly Father, we come to you in the name of Jesus who allows us\nto approach the throne of grace with boldness and confidence. We don't come to you with a righteousness\nof our own. We come to you with humility that you would even hear our prayers. And I thank you\nso much for these men and women who faithfully serve our citizens, serve our state. God, I believe\nwith all my heart that their motives are good. They're here because they want to serve. But\nGod, these are complex times. These are times in which our spiritual enemy wants us to turn each\nother into enemies. And Father, I pray over protection over this room and these\nconversations and everything that happens here. I pray, Father, that you would\nhelp us no matter what the situation to use our words in a way that brings\nhonor to you and to one another. Please bless this group of people as they go\nabout doing what they do. Ask an amazing name of Jesus. Amen. That's\npledge allegiance to the flag of the United States of America and to the Republic for which\nit stands one nation under God, univable with liberty and justice for all.\nDoorkeepers will unlock the doors.\nYou\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Inheritance,\nThe chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, when angry, count to ten before you speak.\nIf real angry, count to a hundred, Thomas Jefferson.\nThank you very much, Mr. Chairman.\nChairman Hogan, the Chair of the Committee on Information and Audits reports that the\njournal, the previous legislative day, has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nChair, here's none in the journal, is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, hall number 59, whose filing be establishes the order of business during the first\npart of the period unanimous consent, introduction of bills and resolutions, first reading and\nreference of house bills and resolutions, second reading of bills and resolutions, first\nreading and reference of senate bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is none in the resolution is adopted.\nThe next reading of Bills and Resolutions, the clerk will read.\nHouse Bill 211 by Representative Williams, 148,\nBuilding Title NAC to provide for a new charter for the town of Arabi.\nThe Intergovernmental Coordination House Bill 212 by Representative Carper,\nthe 4th Collins, the 68th,\nAbstration of the 104th Gamble, the 15th,\nCarson, the 46th, Building Title NAC to amend Code Section 31394,\nthe fiscal to Georgia annotated, relating to persons authorized to issue order,\nnot to resuscitate.\nIn addition, House Bill 213 by Representative Robo-Show of the 48, based more of the 63rd Scofield of the 60th Jackson, the 64th and half of the 153rd, will be titled an act to amend Code Section 16, 13, 21, Part 3 of Article 16 to Chapter 2 of Title 20, relating definitions relative to controlled substances.\nHealth and Human Services.\nHouse Bill 214, R.O.S. on a robust show of the 48th\nbased more of the 63rd couch.\nThe 50th, the scope field of the 60th,\nhops into the 153rd.\nBill B. Toddl and Acto, and then chapter 4,\ntitle 49 of the physical to Georgia\nand untated and relayed to public assistance.\nHealth and Human Services.\nHouse Bill 215, R.O.S. on a robust show of the 48th.\nscope field of the 60th, Jackson the 64th base more\nof the 63rd, hops into the 153rd and others.\nBill B. Toddl and Acto, and then article 7,\nChapter 4, Title 49 of the fiscal to Georgia annotated relating the medical assistance generally health and human services\n216 by reps and a demonstration of the 104th built-in act to amend article one of Chapter 7 and Title 19 of the fiscal to Georgia annotated\nRelating the general provisions regarding parent and child relationships juvenile justice\n217 by reps and a robo show of the 48 based more of the 63rd Lewis Ward of the hundred and ninth school field of the 60th and Jackson the 64th and others\nBill B. Todd on active men, chapter two, a title 31 of the physical to Georgia\nannotated relating to the Department of the Community Health. Health and human\nservices. House Bill 218, my brothers and a\ncalendar, the 23rd, Paul, the 32nd, Jasperist, the 11th, Perkle of the\n155th, and Taylor, the 173rd, Bill B. Todd on active men, Code Section 1611,\n126th, the physical to Georgia, and Tady relating to having or carrying\nhandguns. Public safety and homeland security. House Bill 219 by Representative\nRobert show of the 48 Jackson the 64th Scofield the 60th. Phase more of the\n63rd Kendrick the 93rd and others will be titled back to men chapter 1\nand title 28. Fish go to George annotated related to general provisions\napplicable to the general assembly. Health and human services. House Bill 220 by\nreps and a benton of the 31st Harvard and the 2nd Ridley the 6th Mathis the\n144th Bill B. Todd and act to amend part four of article six of chapter three\nat title 12 if it's going to Georgia annotated relaying the Stone Mountain Memorial Association rules House Bill 221 by\nRepresentative Benton of the 31st Bill B. Todd and act to amend chapter 66 at\ntitle 36 the official go to Georgia annotated relaying the zoning practices\ngovernmental affairs House Bill 222 by president Benton 31st Bill B. Todd and act to\nrepeal in act creating a new charter for the town of Penda grass.\nIntergovernmental coordination House bill 223 by Rose and a benton of 31st\nBill B. Title and act to amend the act to create a Board of Elections and\nRegistration for Jackson County. Intergovernmental coordination House bill 224 by\nresident baseball of the 63rd hops into the 153rd, Mitchell of the 88th,\nbenton of the 94th Boatty, the 62nd and others, Bill B. Title and act to amend\nan act to amend Chapter 9 on Title 33,\nthe fiscal to Georgia and Tadya,\nrelating to regulation of rates insurance.\nHospital 225, I represent a prince of the 127th,\nthere'll be a title act to provide\na new charge with the city of rents.\nIntergovernmental coordination.\nHospital 226, by represent of Connard,\nof the 102nd, Eftration of the 104th,\nFriday the 118th, Richard the 97th,\nStevens the 164th, and others,\nthere'll be a title act to amend,\nChapter 8, a title 48,\nthe fiscal to Georgia and Tadya,\nrelating to sales and use tax.\nWays and Mains.\nHouse bill 227 by Representative Hawkins,\nthe 27th done who the 30th bar of the 103rd\nand Duke Nick of the 29th will build\nthe title of an active men chapter two,\na title 21 of the official go to Georgia\nand tell you relating the elections\nand primaries generally.\nSpecial committee on election integrity.\nHouse bill 228 by resident bird of the 20th.\nPaul of the 32nd Kelly, the 16th Williamson\nand the 115th Bradley, the 67th and others.\nBill Bitton, act to amend Code Section 212, 417,\nfiscal to Georgia and Tadya,\nreally the presentation of identification to poll workers.\nSpecial committee on election integrity.\nHouse Bill 229, I resident of Carpenter,\nthe fourth Kelly, the 16 Jones, the 25th Gaines,\nthe 117th and Kendrick, the 93rd.\nBill Bitton, act to amend Park Two,\nParticle 15, chapter one,\nand title ten of the fiscal to Georgia and Tadya,\nrelating the fair business practices act in 1975.\nJudiciary.\nHouse Bill 230 by Representative Scofield,\nthe 60th clerk of the 108th, Beverly, the 143rd,\nHugo Lee, the 136th, Hopps, and the 153rd.\nAnd others will be tied on an act of men code section 8, 3,\n201 of the official go to Georgia annotator really.\nArticle one of chapter one of title 20,\nthe official go to Georgia annotated,\nrelating to definitions relative to fair housing.\nJudiciary.\nHouse Bill 231 by Representative Gaines,\nthe 117th balance for the 23rd,\none of the 89th, wheat hour, the 119th,\nfive, the 118th and others,\nwill be title and act to mend.\nArticle seven, chapter five,\na title 16, an article one in chapter 13,\ntitle 19 to fiscal to Georgia annotated,\nrelating to stalking and granting\na relief by superior courts.\nJudiciary non-civil.\nHouse bill 232 by resident of Jackson,\nthe 64th evidence, the 57th Wilson,\nthe 80th Shannon, the 84th Taylor,\nthe 91st and others,\nwill be title and act to mend,\nchapter seven, a title 17,\nfiscal to Georgia annotated,\nrelating to pre-trial proceedings.\nJudiciary non-civil.\nHouse Bill 233 by resident of Beverly,\nthe 143rd voting, the 62nd Smyri, 153rd school field,\nthe 60th mainer, the 56th and others.\nBill B. Todd, an active men article two.\nChapter five, a title 17,\nhe's physical to Georgia and Tater,\nrelating to searches with warrants.\nJudiciary non-civil.\nHouse Bill 234 by resident of Hawkins,\nthe 27th lot of the 122nd Smyri, 135.\nComfort of the eighth, another 123rd, and others,\nBill Bitton and Acton, and Acton, and Acton of 33,\nthe fiscal to Georgia and Antieta relating the insurance.\nSpecial committee on access to quality health care.\nHouse bill 235, I'm going to wait in the ninth,\nthe limit of the 99th gamble, the 15th,\nwe'd our within 119th of McDonald, the 26th.\nBill Bitton and Acton, and Acton, and Acton of 48,\nthe fiscal to Georgia and Antieta relating\nto revenue and taxation.\nWays and means.\n236 by reps of Niel the 74 tankers the 160th hugely the 136 Douglas of the 78 Taylor 173rd\nand others. They'll be Todd on act to a men article on chapter 13 to title 19. The fish go to\nGeorgia on 10th overlaying the granting of relief by superior courts. Judiciary non-seventh\nHouse bill 237 by reps and a Hutchinson 177 Mitchell the 88 Scott of the 76 go field in 60th\nwith Kenner to the 102nd and others,\nbuilding title and act to amend chapter three,\na title 50, the fish go to Georgia,\nand Tater will link the state flag seal\nand other symptoms.\nRules.\nHousehold 238 by ropes and a Hutchinson,\nthe hundred and seven Mitchell, the ADA,\nScott of the 76,\nScofield of 60th, Kenner to the 102nd and others,\na building title and act to amend,\nchapter three, a title 50, the fish go to Georgia,\nand Tater will link the state flag seal and other symbols.\nRules.\nHousehold 239 by ropes and a Hutchinson,\n107th Allen the 40th Scofield the 60th Beverly the 143rd Mitchell the 106th and others\nThere'll be Todd an act of men article on chapter 7 chapter 1 and title 37 the fish go to Georgia, Antietta\nWe're laying the gentleman visions relating the governing and regulation of mental health health and human services\n240 by reps and a Hutchinson in the hundred and seventh Williams and 68 Smyri 135th\nBeverly 140 thirds the Scott of the 76th and others have built me Todd an act of men chapter 4\nTitle one of the fiscal to Georgia and today relating to holidays and\nobservances governmental affairs House with 241 by Ripson of Gamble the 15th\nlumpston to the 12th Williams on and 48th gains on 17th and Smith and on\n33rd will be touted an act to amend code section 337 6 the fiscal to\nGeorgia and today relating to property insurance insurance Senate bill 6 by\nSenator Albers the 56 how stat learned the 52nd most of the 53rd Gucci the\n51st, Strickland in the 17th and others will be taught on\nact of an article three, chapter five, a title 28 fiscal to\nGeorgia and it's a relaying fiscal bills generally. Ways and\nmemes, Senate bill nine by Senator Anderson, the 24th\nBurns, the 23rd, Strickland in the 17th Miller, the 49th\nWallace of the 53rd and others will be taught on act to\ncreate a new judicial circuit for the state of Georgia.\nJudiciary, that completes first readers. Second reading of\nBills and resolutions, the clerk will read.\nHouse bill five by Representative Scott of 76,\ncanon of the 58th Mitchell, the 88 Jackson of the 64th.\nWe're now at the 77th, the bill relating to lottery for education.\nHouse bill seven by Representative Scott of the 76th,\ngallery of the 160th second park with the 101st Bentley of the 139th,\nand Nelson of the 125th, the bill relating to education.\nHouse bill 11 by Representative Scott of the 76th,\nDavis at the 87th, the rebu show of the 48th Scofield of the 60th Hutchinson of the 107th,\na bill relating to regulation and construction of hospitals and other healthcare facilities.\nHouse bill 12 by Representative Scott of the 76th Scofield of the 60th,\nDuke's of the 154th, Mitchell of the 88th, and Hutchinson of the 107th,\na bill relating to control substances.\nHouse bill 13 by Representative Scott of the 76th, Duke's of the 154th,\nDavis of the 87th Scofield of the 60th, Hutchinson of the 107th and others,\nBill relating to the Georgia Crime Information Center, House Bill 22, by reference to Scotted the 76 Davis of the 87th Canon of the 58th Jackson of the 64th Williams of the 168th Bill relating to powers of Housing Authority as House Bill 195 by Representative Clark of the 108th Dreyer of the 59th Park of the 101st Hutchinson of the 107th Couch of the 50th and others to Bill related to the Quality Basic Education Act.\nHouse Bill 196 by Representative Green of the 151st to build to amend and act reconstituting the Board of Education\nfor Terrell County, House Bill 197 by Representative Louis Ward of the 100th Night,\nVoting of the 62nd, McLean of the 100th, more of the 95th, and Park of the 100th and 1st,\nthe bill related to general provisions relative to labor and industrial relations.\nHouse Bill 198 by Representative Singleton of the 71st, Smith of the 133rd Williams of the 168th Belton of the 112th Gilligan of the 24th and others,\nof bill relating to the computation of taxable net income,\nhospital 199 by Representative Walensky of the 79th,\nCollins of the 68th, Richard of the 97th, Jones of the 25th,\nRobert showed the 48th and others of bill relating\nto enforcement of speed limit in school zones\nwith recorded images, hospital 200 by Representative Powell\nof the 32nd, available relating to motor vehicles\nand traffic, hospital 201, where the Evans of the 57th,\nbruised of the 61st, Oliver of the 82nd,\nbending of the 94th, Scott of the 76th,\nand others of bill relating to elementary\nand secondary education, hospital 202,\nby representative Hitchens of the 161st Burns of the 159th Petri 166th Lumps of the 12th\ngravity of the 67th Bill related to the Georgia Driver's Education Commission House Bill\n203 by representative Petri 166th Stevens of the 164th to the 167th Sains of the 180th Hitchens\nof the 161st and others of Bill relating to special license plates.\nHouse Bill 204 by reps of the 76th Spired the 135th Pinnet of the 94th.\nLet's go feel the 60th for now the 77th and others available to provide a comprehensive state civil rights law protecting individuals from discrimination housing public\ncombination employment House bill 205 by represent 148 loves them the 12th hatchet of the 150th Taylor the hundred and seventy third words of the hundred and twenty\nand others are building to insurance House bill 206 by residents of the 47th can trial the 22nd bill to amend and act to incorporate the city of Milton\nHouse Bill 207 by Robson Corbett of 174th,\nwhere they have the sixth part of the fifth,\nwatched on 170 second roads of the 120th,\nbill relating to better vehicles and traffic.\nHouse Bill 208 by Robson's Chokas of the 138th,\nJasper's of the 11th, Irwin of the 28th,\nwith the wreckage of 169th and Jones of the 25th,\nthe bill relating to holidays and disturbances.\nHouse Bill 209 by Robson with Cloud of the 105th,\nRobsho the 48th, Clark of the 108th,\nMcLean of the 100th, Carter of the 92nd,\nand others, bill relating to public assistance.\nHouse bill 210 by Representative Corbett at the 174th,\npartner of the fifth, Watson of the 172nd red to the 120th,\nRidley of the sixth, the bill with 82 search of thickets,\na title for motor vehicles.\nHouse resolution one by Representative Scott of the 76,\nCanada of the 58th, Mitchell of the 88th, Jackson of the 64th,\nand for now of the 72nd, 7th.\nResolution proposing amendment to the Constitution,\nso as to authorize the General Assembly,\nto provide for the proceeds of one or more lottery,\ngames to benefit homeless military veterans.\nHouse for Resolution 70 by resistance.\nGofield, the 60th, Thomas of the 65th, Davis of the 87th\nBuckner of the 137th, Evans of the 83rd,\nand others.\nResolution supporting the state goal of 100% clean energy\nby 2050.\nThe creation of thriving wage, green jobs,\nand equitable clean energy transition.\nHouse Resolution 71 by Representative Wilson of the 80th,\nBeverly of the 143rd, Williams of the 168th,\nOliver of the 82nd, and Oliver of the 42nd,\nand others.\nResolution urging the United States Representative\nor Georgia's 14th congressional district\nto resign from the 17th Congress House Resolution 72 by\nRepresentative Scoville, the 60th Scott, the 76th Davis\nof the 87th Maclough, the 105th Hutchinson, the 107th\nand others resolution urging the United States Congress\nto enact legislation placing a more thorium\non negative credit reporting during the COVID-19 pandemic\nthrough second readers.\nWe're about to go on to morning orders.\nThis house will come to order.\nThis house will come to order.\nto recognize this for a morning order representative Wollenski.\nChair is going to limit members to two minute seats this morning on morning orders.\nGentlemen may proceed.\nyou speaker. Today we recognize the second annual Jewish Genetic Screening Awareness Week\nin Georgia. This week to educate the community about the importance of genetic screening\nand to ensure that people have access to appropriate testing. JScreen is a nonprofit public health\ninitiative dedicated to preventing devastating genetic diseases. Headquartered in Emory School\nof Medicine, they make convenient at-home testing for reproductive care screening cancer genetic\ntesting. Reproductive carry screening is recommended for any one thing you've\nstarting a family and provides information that can help prevent life-threatening\ngenetic diseases. There's also cancer genetic testing as well. Raising awareness\nabout these simple tests will help people make an important decision that can\nultimately save lives. This year more than ever we must focus on protecting our\nown health as well as the health of our loved ones. Genetic testing is a\npowerful tool that can safeguard our families health for generations to come.\nThis week, we urge you to take action, take control and get screened.\nThank you, Speaker.\nI yield the vote.\nChair recognizes representative Bonner for a morning order.\nThank you, Mr. Speaker.\nI rise today to share a bit of good news about our state.\nIn the first half of the fiscal year 2020 Georgia announced the creation of more than 16,000 jobs and nearly\n$6 billion in new investment. Over half those jobs, by the way, are going to communities outside the Metro Atlanta.\nThanks to conservative physical management and our measured reopening, our rainy day fund is remains intact.\nThe governor's budget includes no new cuts to state agencies. Our budget includes no new tax cuts to state agencies,\nNo furloughs, no layoffs, fully funds, K-12 education, and includes significant funds for\nrural broadband expansion and health care reform.\nAll of this, Mr. Speaker, with no new taxes to pay for it all.\nThroughout this pandemic, we've been able to maintain our AAA bond rating.\nWe've also been named again for the eighth year in a row, the number one state for doing\nbusiness.\nUnemployment consistently below the national average.\nAnd Mr. Speaker, while other states are looking at massive budget deficits, planning furloughs\nand layoffs of state employees, and are forced to look to a gridlock Washington D.C. for\na bailout, I for one in glad to raise my family in the greatest state in America, the state\nof Georgia.\nThank you, Mr. Speaker.\nI yield the well.\nchair recognizes representative Mack Jackson for a morning order. Thank you\nthe speaker. Today I rise for a black history moment on an opera singer from\nWashington County. Mr. Mack Hendry boat right was born in Tunnel Georgia in\nin 1928. He studied Piana and Voice at the New England Conservatory graduating in 1954.\nHe sang with the New England Opera Theatre in Boston, where Leonard Bernstein heard\nhim and invited him to sing with the New York Philharmonic. In 1958, he appeared in Lost\nin the stars at the New York City Center Theatre.\nHe sang for several presidents at the White House,\nincluding President Jimmy Carter's 1977 in Orguration.\nIn 1980, he married at Roof Ellerton,\nthe assistant business manager of the late Duke Ellerton.\nHe produced the Duke Ellerton sacred concerts,\nproduced in New York and London in 1982.\nIn 1984, the city of Tennell named the street\nat this native son, McHenry Boatwright.\nThank you, Mr. Speaker, I yield the will.\nChair recognizes representative McLeod\nfor a morning order.\nThank you, Mr. Speaker, and big up to my colleagues.\nToday I rise to salute Black History.\nyesterday, today, and tomorrow.\nIn this chamber, we have an eyewitness to our past,\nour present, and our future.\nWho am I speaking about?\nThe shy, reserved, and modest representative, Al Williams.\nIn 1963, did you know that in 1963,\nas a high school student, Al attended a training session\nwith Dr. King and then participated\nin the March on Washington Wednesday, August 28th in 1963.\nDid you know that on March 25th, 1965,\nhe walked the 54 miles from Selma, Alabama\nto Montgomery, Alabama with John Lewis, Dr. King,\nand several other civil rights leaders\nin the civil rights movement?\nDid you know that he worked for the student\nnonviolent coordinating committee, SNCC,\nand the Southern Christian Leadership Conference, SCLC,\nwhere he would eventually go to jail 17 times\nin the quest for human rights and human dignity for everyone.\nRepresentative Williams said these were exciting times\nand times he would never forget,\nbut we know now that these were profound times.\nAlso in 1972, he sued the state of Georgia\nto become a delegate for the Democratic National Convention.\nAnd in 1975, Representative Williams\nbecame the first African-American to serve as an aide\nto the lieutenant governor.\nIn 1977, he became the first African-American\nto the American of the member of the electoral college\nfor then president Jimmy Carter.\nI just want you to know that you serve with black excellence\nthat walks and breeds amongst us 365 days.\nCan I get you guys to stand up and give him a round of applause?\nThat representative, all Williams,\nare black history in here in this house.\nThank you, Mr. Speaker, I yield the well.\nand McLeod, you brought tears to my eyes.\nChair recognizes Chairman Corbett,\nChairman Bershitt, and Representative Sains\nfor a morning order.\nGood morning, colleagues.\nWe had I was out yesterday and some of y'all may have noticed the corporate was well\nWe had a where County Commissioner Burton Carter 86 years old past and we put him laid him to bed yesterday\nAnd he was a good man. He spent many years serving this state from from the Georgia Department of Transportation to serving where County Georgia and\nAnd I appreciate everybody here standing for him.\nHe was just a remarkable man, supported politics\nfrom the local level all the way through the state.\nSo we've lost a good one in him.\nIf you would, wouldn't mind just recognizing\na moment of silence for him at least.\nThank you, Mr. Speaker.\nChair recognizes representative Hutchinson for a morning order.\nThank you, Mr. Speaker, and thank you for not putting me behind Donna McLeod.\nGood morning, colleagues.\nToday, I'm going to start bringing you another adopted child available in Georgia.\nI go to the my turn now website to see which child we should look at today and\nfeature on the floor of the house. Today when I open the website this child was\nlooking at me and I thought he is the one for today. His name is LaDairy. He's\n14 years old and he loves anything that has to do with gaming. He loves, he loves\nto watch basketball and play basketball, his favorite movie is Black Panther, and he loves\nrap and gospel music.\nLidari would love to go to college to learn how to code so that he can make video games\nof his own.\nHe loves graphic design, and he is just cute enough to be in one of Tyler Perry's movies.\nSo if any of y'all have any connections to Tyler Perry, I feel like this child should\nbe in a movie.\nThank you, Mr. Speaker, and I yield the well.\nThe clerk will read the caption to a group of privileged resolutions.\nRecognizing and commending the total Army Health Clinic and for other purposes that completes\nthe reading of the privileged resolution.\nIs there any objection to adopting the privileged resolution, the chair here is none?\nthe resolution is adopted. I'm sure that Chairman Smith is going to have us some bills to\nvote on here shortly. You don't know. Okay. We don't have to. We're going on now to announcements.\nIf you have signed up for an announcement, please be in the front of the chamber and be\nready to go when you're recognized.\nChair recognizes, Chairman Hatchett for an announcement.\nThank you, Mr. Speaker.\nThe majority caucus will meet at noon today in the Floyd room.\nToday in the floydroom, 20 hours, see you then.\nChair recognizes representative Alexander\nfor an announcement.\nThank you, Mr. Speaker.\nWomen caucus were meeting Mealy upon adjournment\nand we have box lunches, but we will be meeting virtually.\nThank you.\nChair recognizes the chairman of the Economic Development\nand Tourism Committee, Chairman Stevens,\nfor an announcement.\nThank you, Mr. Speaker.\nThe Economic Development and Tourism Committee will be meeting today in room 606, CLOB.\nWe will be taking up a bill, thank you.\nJust a little housekeeping bill out here.\nJust a little housekeeping bill.\nChair recognizes Chairman Heath Clark for an announcement.\nThank you, Mr. Speaker.\nColleagues, the House Defense and Veterans Affairs Committee will be meeting upon the\nadjournment of the Majority Caucus meeting in CLOB 606.\nIt will be around 1 o'clock.\n1 o'clock in CLOB 606.\nChair recognizes Chairman Parsons for an announcement.\nThank you, Speaker.\nThe Energy Utilities and Telecommunications Committee will be meeting today for organizational\nmeeting at 3 o'clock and room 403 upstairs here in the capital.\nIt's not a Zoom room.\nWe should have room for all the members.\nIf for some reason in that room you can't get in, which I don't think is going to be a\nproblem, but if you can't get in as a member, you can view it online and text questions or\ncomments to Blake Doss and his email address courses on the on the\nlegislative website. Again, energy utilities and telecommunication\nmeeting today, 3 o'clock, room 403. Thank you, Mr. Speaker.\nChair recognizes Chairman Carson for an announcement.\nThank you, Mr. Speaker. The retirement committee, the House\nretirement committee will meet today at 2 o'clock in the room 406 of\nthe CLOB adopting committee rules and getting an overview\nfrom our friends at ERS and TRS,\nretirement committee to a clock.\nThank you, Mr. Speaker.\nChair recognizes Chairman Timothy Barr\nfor an announcement.\nGood morning, colleagues.\nIt is Tuesday.\nSo that means tomorrow morning is fellowship\nand Representative Glanton is up here joining me.\nIt is a bipartisan fellowship meeting in the morning.\nSeven o'clock, four o'clock, three, be there.\nGod is a very bipartisan God.\nCan I get a amen?\nAll right, thank y'all.\nAmen.\nChair recognizes Chairman Allen Powell\nfor an announcement.\nThank you, Mr. Spaker.\nBut it represents is Benton, Carpenter,\nIrwin, Gunner, Lebritt,\nHurkel, Ridley, maybe Ridley,\nTarvin, Washburn.\nWould y'all be kind enough to meet in,\nover at my office in 6, 13 at 3 o'clock\nso that we can summarize some pertinent information\nit would affect the state and North Georgia.\nThank you so much.\nI got to tell you, that sounds like a dangerous group right there.\nChair recognizes Chairman Newton for an announcement.\nThank you, Mr. Speaker.\nThe special committee on access to quality health care will meet today at one o'clock\nfor a brief meeting about 30 minutes max in 406 CLOB, so it will be right after the caucus\nmeeting and we'll get started about one o'clock. Thank you. Chair recognizes\nChairman Dickey for an announcement.\nDr. Mrs. Speaker of the Agriculture and Consumer Affairs Committee will meet in\nthe morning at eight o'clock at CLOB 406 at eight o'clock in the morning.\nThank you. Chair recognizes Chairman Lumsden for an announcement.\nHouse insurance committee will be meeting in the morning CLO B606 at 8 o'clock.\nThank you.\nI think that completes our announcements.\nNo bills and no birthdays.\nChair recognizes the majority leader of the House for a motion.\nMiss Speaker, I'm not sure what the groundhog did this morning, but I sure hope it warms\nup soon. I don't think he even came out of his hole this morning. It's too cold.\nWhy is Groundhogg? Mr. Baker, I moved to this house stand adjourned until 10 a.m.\ntomorrow Wednesday February the 3rd 2021. The majority leader has moved that\nthis house stand adjourned until Wednesday February 3rd at 10 a.m. All those in\nfavor of the motion will say aye. Those opposed will say no. The eyes have it. This house will\nbe adjourned until Wednesday at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T15:47:58.707981+00:00"
}