{
  "video_id": "dO6oam4zxKA",
  "url": "https://www.youtube.com/watch?v=dO6oam4zxKA",
  "title": "Senate AM Day 28 for the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 28,
  "video_date": null,
  "duration_minutes": 132,
  "summary": "Here is a structured markdown summary of the Georgia Senate AM Day 28 session for the 2025 Session:\n\n## Overview\nThe session featured a debate and vote on the reconsideration of Senate Bill 4, which deals with training and responsibilities of local school boards. There was discussion of the bill's provisions regarding board member training and interaction with legislators.\n\n## Key Actions\n**SB 259**: N/A\n**SB 33**: N/A\n\n## Bills Introduced (First Reading)\nNone noted\n\n## Notable Moments\n- Debate on the motion to reconsider SB 4, with arguments from the bill's sponsor and an opposing senator\n- Approval of unanimous consent to excuse senators from the 49th and 50th districts\n\n## Votes\n- Motion to reconsider SB 4 - Outcome not specified\n\n## Attendance\nQuorum was present, with a motion to excuse senators from the 42nd district.\n\n## Adjournment\nThe session adjourned. The next session date was not provided.",
  "transcript": "you Good morning. The time for convening has arrived. Senate will come to order. Good morning, Mr. President. Happy crossover day to you. Glad you're here. I missed you. Mr. President, I got a great lineup of pages today out of Milton, Georgia. We have Ronack Botte out of Eatonton. We have Addison Brown from Atlanta, Leo Dosat from Valdosta. We have brother and sister David and Miriam Dennis from... Oh, and another sister, Suah Dennis. So two sisters and a brother here together from Valdosta. From DeLonaga. I haven't got confirmation, but we have... We have the majority leaders, son here, Seth Gouche. From Powder Springs, Adrienne Marriott. From Marietta, we have brother and sister KJ in Eaton Grace, Milliken. From Madison, we have the nephew of our very own senator from the 11th Senator Sam Watson, Laten Morris. From Decatur, we have Evie Owens from Jefferson, Annabelle Pritchard. From Calhoun, Annelili Rivera. From Marietta, Holt Rogers. From Jefferson, Caitlin Roper. From Commerce, Will Sexton. From Marietta, Jimmy Simmons. From St. Simon's Island, Evelyn Staffins. From Perry, Lawson Stewart. From Atlanta, West Stewart. From Powder Springs, Gillian Taylor. From Hotsdon, we have Noah Tindall. And from Atlanta, we have Liam Mitchell. Y'all give these pages a big round of applause. We appreciate y'all being here to help us do the people's business here in the Georgia State Senate. We've got a long day and a lot of bills, so look forward to working with you. Mr. President, the journal has been read and found to be correct. All right, thank you, Senator. Are there any motions to reconsider, recognize the Senator from the 26th? Mr. Governor, I so move. You move. I move the recon center. You need to state your position, Senator. Mr. Governor, I move that we reconsidered the Senate bill 4. The Senator from the 26th says move that we reconsider Senate bill 4 from Secretary of the CAHPSHA. Senate bill 4 by Senator Dolezell on the 27th and others have been tied to amend chapter 2. Title 20, the official code of Georgia annotated. We'll do elementary and secondary education. So the revised provisions are going to fundamental roles of local boards of education and local school superintendents to provide for requirements for the mode. Model code of ethics for local boards of education to be promulgated by the state board of education to provide for public complaints alleging ethics code violations by members of local boards of education to provide for required and prohibited topics and training programs for local board of education members to provide for a sanction. For noncompliance to provide for an effective date to provide for later matters to be able to look at laws and for other purposes. Mr. President, that completes the order. Senator from the 40th, for the purpose of the purpose of the U.S. Ashen and Mr. Consent to excuse the senators from the 49th and the 50th for business outside the chamber. Senator from the 49th and the 50th without it, Jackson will be its excuse. Now I recognize Senator from the 26th to speak to his motion. Thank you, Governor. Ladies and gentlemen, I hate to oppose my warm, close and trusted friend. But let me say something to you about this bill. I know you voted on it and you have no other idea what it does. By law, every superintendent and board members have to get trained. This excludes those in order for those who are new. If you elect a superintendent or you appoint a superintendent, you do it to make sure he manages the school system. Under this bill, you will have board members trying to micro-manage. Now my problem with you is to tell me some long time ago, boy you're meddling. This is meddling. When you go back home, you can't explain to your school board members. You didn't know what this bill did. It basically tells them that they cannot come here and see us who make the law. If they got a problem, board members are superintendents. Now it says training. But you're going to go and train and say you can't go up and see them legislator. Well ladies and gentlemen, we are the seat of power. And when they have a problem, they come see us about it. And that's how we find out about it. But make sure you know that you pass this bill when your board members come to you and your superintendent and you tell them, well, I didn't know that. Well, I'm telling you what it does. It's meddling. And I'm going to tell you something else. This is a good way to get an exit after the Georgia Senate. Thank you. Thank you Senator. Senator from 27th, since it's your bill, he's made the motion for a while, so we would like to speak to it. Thank you, Mr. President and colleagues. The words on the page matter. Not the words that are spoken in a well, but the words on a page. And the words that are on the page of the bill that we voted to pass is, quote, that it shall be the duty of the local board to hold the school superintendent accountable in the performance of his or her duties. That's what the bill says. The bill doesn't say that the school board needs a medal. That's one piece of the bill. So that's just, I think, an honest misunderstanding by the senator for what the bill does. As to the lobbying portion. There's nothing in the bill that says the school board members cannot come to the general assembly. There's nothing in the bill that says that they can't have breakfast with their local delegation. This gets down to the training that happens. The mandated training in what these school board members can be taught. Because here's what's happening today without these guardrails. The board members get elected. They are then forced into compulsory education every single year. They are the only elected officials that have to be trained every single year. There is no other elected official that has to be trained every single year other than board of education members. And in some cases, not all, but in some cases, that training goes something along the lines of this. You're not the expert. Your superintendent is. Go sit in the corner and be a house plant. Do whatever they tell you to do. Vote unanimously. Never disagree with each other in public. The you all being in public is the board. So they are encouraged to have all five votes. They are encouraged to never ask questions about the budget. And all that this bill does is as if they cannot be trained. To go sit in a corner and be a house plant. They can also not be instructed that a key component of their job is to lobby the general assembly. This is the key word here. I was a recommendation from the center from the 38th that we changed in the bill on specific matters. They can be told that part of being a good board of education member is to communicate with the general assembly. Part of being a good board of education member is to go meet with your local delegation. So I respect my friend. I'm happy to answer any questions off line. Thank you. Thank you. Thank you. So the question now is on the motion to reconsider. Put forward by the center from the 26th. And it's on Senate bill four. That's a bill that we took up. Tuesday. All right. So the motion for reconsideration. All those in favor of the motion for reconsideration will vote. Yay. All those opposed will vote. Nay. Secretary and Lentner machine. Senator from the 37th. Thank you. All the motion. All the motion. All the motion. All the motion. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. Senator. It is now time for the morning roll call. Are there any motion to excuse? I asked for unanimous consent to excuse the senator from the 42nd. Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? Any other motion to excuse? and the same is one nation under God, and it is will deliver to you in justice for all. And now the Georgia flag, a pledge allegiance to the Georgia flag, the French local religious stance, with them justice, moderation, and courage. Friends, colleagues, it gives me great pleasure to have the pastor of the day Reverend Matt Sap, who is the pastor of Central Baptist Church in my hometown of Newton, Georgia. And before serving at Central Matt, serve churches in both Canton and Atlanta, he's a graduate of Mercer University as well as Mercer's Macphee School of Theology. In addition to his work at Central Baptist, he also serves on the Board of Trustees at Mercer University, on the Board of Visitors for the Macphee School of Theology, and as the moderator for the Cooperative Baptist Fellowship of Georgia. Matt's wife Julie, who actually is on a trip this week, couldn't be with us, but Julie is a native of Wainsburg, Georgia, and is also a graduate of Mercer University. Matt and Julie have two sons, Hudson and Joey, and a daughter, Mary Jane. And many of y'all know that I go home every single night, and one of the reasons I do go home every single night, so I can get up the next morning, I can take my children to school. And when I take my kids to school, now I drive. I drive my kids to school. It's two blocks a long way from me. But when every single morning, when I'm taking my kids, I look, and then there's Pastor Sap walking up the street with his children dropping them off at the same school. And I can always just see the joy in his face. I know he enjoys doing that. And it really, to me, gives me joy to see him not just being a pastor to our community, but also being a loving father to those dear children. And I know he'll tell you that that walk is uphill both ways in the snow and it's a tough walk. So Elm Street can be treacherous. But without further ado, I give you my friend Ann neighbor, Reverend Matt Sap. Mr. President, thank you. Senator brass, thank you for that introduction, and for the invitation to be here today. Matt and I do live in the same neighborhood. Our kids do go to the same school. Most mornings we do pass each other on those mean streets of Elm Street in New Ninja, Georgia, as you described them to and from dropping our children off at elementary school. Representative Lynn Smith, by the way, also lives in our neighborhood. Not the privilege of being her pastor. So the Sap family is well represented here at the state legislature. And we love being from New Ninja. We like to think that we're from, Matt, you'll agree with us, I think, the greatest town and the greatest state in the greatest country in the history of the world. And down in New Ninja, we work pretty hard to keep it that way. Senator brass and his family are committed members at a church just down the street from ours, but I always like to tell Matt there's always room for him and his family at Central Baptist Church too. So for those of you who follow the Christian calendar yesterday was Ash Wednesday. That makes today the second day of Lent. For the next 46 days, just over six weeks, which is more than 10% of the year, by the way. Those of us in Christian traditions that observe Lent will use this season of the year to prepare for Easter through an intentional focus on things like prayer and fasting. When you hear someone say they're giving up Instagram for Lent, for example, that's a kind of fasting. And for those of us who observe Lent, we will spend 12% of our lives this way, 46 days, year after year. That's 40 days of Lent and fasting, six Sunday feast days scattered in between. We always feast on Sundays, but 12% of our lives, and eventually if you're old enough and faithful enough, 20 Lents go by. I think this is about the 20th Lent I've observed in my adult life. And you're left to wonder, giving 12% of your life over to this kind of observance, if you're really making any spiritual progress at all, or if you're just living the same year over and over again, each Lent. As the weather starts to warm up, we'll start to get into the heart of blue crab season down along the Golden Isles. St. Simon's, Jeacle, Cumberland Island, my wife's actually on her way down to that part of our state right now. Maybe we've got a senator in the room who represents that area of our state. I grew up in Virginia around the Chesapeake Bay. Blue crabs were the source of crab cakes all summer long, and Richmond, Virginia where I grew up and soft shell crab was a delicacy. Blue crabs can molt as many as 20 times during their lives, shedding their hardened outer shell to make room for a new, more fitting shell to take its place as the crabs grow. And as they get larger, shedding their shells, getting rid of that accumulated outer layer can be a painful process for crabs. It is for sure a vulnerable process, but they cannot grow without it. Lent each year for us is kind of like that. It's like shedding our hardened outer layer to make room for us to grow. Imagine how uncomfortable it must be to be stuck inside a shell that's grown too small, and how stunting it can be to your growth. Most of us don't have to imagine year after year, season after season, lent after lent, we refuse to shed the shells we've outgrown because it can be a painful process. It is hard to shed and leave behind the thoughts, the beliefs, the attitudes, the behaviors, even the relationships that we've outgrown, and it for sure can leave us feeling vulnerable, but we cannot grow without it. For a blue crab, the process of shedding that outer layer to make room for new growth begins with a hairline crack along the length of its back. For those of us who observe lent, that process began yesterday with ashes placed in the shape of a cross on our foreheads, as we begin to shed the things that have grown too small for us. The crab, by the way, never gives the old shell a second thought, it just sheds what it has outgrown and moves on, and that way the crabs may be are more evolved than we are. But just like the blue crab, our growth is an iterative process. We have to be willing to shed our shells over and over again. That's why Christians observe lent every year, 12% of our lives. Somewhere along the way, we got the idea that we could demonstrate our strength by all the things we carry on the day after Ash Wednesday. We remember with the blue crab that we grow by what we leave behind. Let's say a prayer together. Heavenly Father, bless the men and women in this room and bless the work they do together. Give them the wisdom to carry out their work in a way that best serves the people of our state and in a way that best honors you. We offer our prayer in Jesus' name. Amen.\n\nyou you you you you you you you you you How do I want in We'd like to thank you for everybody to go but make sure you put your name in the park so we can make sure we have all the equipment we need but it's March 11th Sign up All right, thank you senator Sonner from the 15th I Thank you, Mr President I rise this morning to recognize a special group of friends to me On Saturday we will commemorate the sixtieth anniversary of the ninth Marine Expeditioning Brigade's landing at the Nang Vietnam on March 8th 1965 These brave Marines were the first major U.S. combat unit to fight on the ground in Vietnam marking the transition from an advisor role to direct combat the arrival The courage and resilience of these Marines paved the way for thousands who followed the on wavering commitment to duty embodied the Marine Corps Model simple fidelis always faithful these Marines face not only the harshest combat condition But also the uncertainty of what was to come they were the first to take a stand in this land sitting the stage for Psychophyses that were to follow throughout the struggle they remain steadfast the 9th Me be was pivotal in the early years of the war and their role in establishing the Military strategy in the region for years to come they are the true definition of American heroes Today I would like to honor some of the men who served alongside me heroes who sacrificed defended our nation Willie Jowls Montgomery Alabama Cleveland Whitehead Atlanta a formal police officer here last Jenkins Atlanta Steve Peppie California Terry Houghton who served from Canada who just deceased Henry Stiltman Tony Stiltman was a sergeant who commanded me in Vietnam. He relocated recently here to Georgia He recently deceased Al Hampton Warner Winborn Follow Maxwell Dennis Kay Eaker who was KIA in 1966 on Operation Hastings Rapp Ortega KIA in 1966 as we reflect on their courage today Let us also remember the sacrifices of all who served over 15,000 Americans lost their lives in Vietnam Many more were forever changed by the experiences and we must ensure that their sacrifices are never forgotten as we honor them Let us refer my commitment to the values they fought for freedom Liberty and the defense of all that is good and just let us continue to stand by those who have served and continue to serve in The defense of this great nation to all the men in women who served in Vietnam arm in neighbor marine Air Force We salute you your sacrifices help shape our nation and your courage will never be forgotten. Thank you, Miss President. I yield the well Thank you Senator and thank you for that bringing that to us today and thank you for your service to our To our military recognize senator from the 56 Thank you, Mr. President today is Georgia chiefs of police stay at the Capitol We don't do presentations on cross-day otherwise we'd have them up on the rostrum right now But you will see many of our local police chiefs in the building Please take a moment to thank them for their extraordinary leadership. They are finest throughout the state It's been a challenging several years never been a harder to serve in law enforcement and we know here in Georgia We have their back so thank you to each and every one of you who are serving as our chiefs of police throughout our great state of Georgia Thank you You We're gonna send it from the 50 Thank you Thank you, Miss president rise today just to recognize the little girl that made me a dad Howie hatchet my oldest daughter turns eight years old today Howie, I hope you have a great birthday. I can't wait to come home to see you Thank you, Miss President. I yield the well You All right happy birthday to miss hailey Senator from the 53rd For a born and personal privilege You Recognize the center from the 42nd for a born and personal privilege Thank you, Mr President members of the Senate. I just want to take a second The recognize all of our leaders that are here today from the Prince Hall free, Macyry It is their day here at the state capital Of course they were founded back in 1784 out of Boston, Massachusetts And ever since they came to Georgia now we have almost six thousand members statewide We appreciate the work you do in our community, especially what you do for young people through scholarships that you offer If y'all please help us welcome them to the state Senate today Thank you All right always good to have our mason's Down to the capital day. We appreciate each and every one of y'all all you guys up there appreciate all y'all and what you do in your local communities Does any other Senator wish speak for? For yes any other spinners are wish to Point one important personal privilege We want to introduce our dark of the day too, so Our doctors have actually been busy today. We unfortunately had a couple of instances where they've been duty has hauled so But we're going to have our doctor the day in the chamber and I recognize the senator from the 52nd to introduce our doctor of the day You know, this is the second time I'm gonna bring a doctor up here to introduce him I had a mergacy that had to go to I think this one was a seizure and we had a house member pass out today But the last one I had here when I was bringing her up she had a problem too Dr. Jason Harrison here's a neurosurgeon. I Worked within the operating room I'm on neurosurgeon is a really politically active for some reason I can tell you more than a couple times I've gone on there and he said oh goody shoot today Chuck We've got lots of politics to talk about today and I'm in there. Oh my god. I'm moving here for hours But he he loves school. I know that he claims he hates school But I added it up. I think it's 17 years. He spent After high school two years as an x-ray tech four years of college five years working on a And this was the University of South Alabama and Mobile five years working on a PhD in DNA repair and then medical school And then seven years of Residence and Fellowship becoming neurosurgeon He did that at the universe at Virginia Commonwealth in Richmond is where he did his Neurological surgery work And I don't have to tell you I've been there and watched him Navigate the intricacies of the human brain in the spine And most of the time I even keep the patient asleep and still for him Maybe maybe not all the time but but most of the time He Really does great work for a lot of patients up there part of the advent Hospital system, but works at both Advent and atrium there in Rome On a personal note his wife and my wife for you agriculture people They graduated together and now certified master gardeners in the area So they take care of the plants for us Anyway Great surgeon. We've got up in Rome is Dr. Jason Harris and presenting to you to the Senate today Thanks, Chuck As the Chuck alluded to he and I worked together. He's a great guy I it's an honor to be invited to our state's capital to be your a doctor of the day and as Chuck alluded to I specialize in spine and brain If you guys experience any chest pain or respiratory issues, I think there's a reverence in the house day too But I just come see me if you need anything. It's a it's really minor to be here. I'm glad to do it You You You You You You Have a a consent calendar of privilege resolutions does any senator wish to remove us resolution from the consent calendar Is there objection to the adoption of the resolution only consent calendar Chair here's none and resolution only consent calendar is adopted Are there any motions to withdraw or commit? You Recognize the majority leader for motion mr. President I move that the Senate in gross the following resolutions this time and bills sb-129 and sb-2 Secretary read the caption Senate bill 129 by senator albert 56 and others bill between 10 and 9 to men part one of article two chapter five of title 48 The official could have judged annotated away to property tax exemptions So as to increase the amount of a statewide Homestead exemption for a certain totally disabled veterans great new statewide homestead exemptions for per certain per Partially disabled veterans and partially or totally disabled first responders Survivor definitions. Survivor early matters. Survivor compliance with constitutional requirements. Survivor short titles Survivor referendum effective dates. Not a matter of repeal Drupal conflicting laws and further purposes Senate bill 212 by senator still before the eighth and others the ultimate title 9 to men part 14 article six Chapter two is title 20 though cga Well, you do other educational programs under the quality basic education access to prohibited disclosure of public student directory information to political candidates campaign committees political action committees political organizations Or persons are working on their behalf to men article 15 of chapter two title one of the OCGA Well, you to misslany offenses relative to election of primaries to men article one of chapter five Totally one of those to jay will be to general provisions for government transparency and campaign finance Drive for later matters for right for an effective date to repeal conflicting laws and further purposes that complete the order Miss president Senator from the fifties first would you like to speak to the motions You You Thank you, mr. President Senators were about to start our session for the day. I know many of you are Meeting with constituents on the floor and out in the hallways We need everyone to get up to this chamber. We're going to engross these two bills Which is customary and traditional when these bills come from the finance committee and the ethics committee And that's the case with these two pieces of legislation. So if you would please make your way to the chamber and we will Call the question and I ask for you to can to vote to engross these two pieces of legislation. Thank you very much Senator from the 41st what purpose your eyes Parliamentary inquiry station requiring May is it in order to make a motion to divide the question so that we can vote in engrossment on these individually Would that be in order? That would be in order. Yes, it would So we can take them up one at a time if you like. Yes, mr. President. I move that we divide the question The The senator from the 41st has made a motion that we divide the two issues sp 129 and sp 212 is there objection Without objection without objection motion granted all right, so now we'll take up sp 129 And is there objection to engross and is there objection to engross and 129 Object 14 senator from the 14th of jx to that motion. So we'll vote on this The vote is on sp 129 a motion to engross all those in favor of vote. Yeah, all those opposed nay secretary and like the machine You You You All the motion C.A.s are 33 and the nays are 18 so this motion has prevailed So now we will take up the motion to engross sp 212 is there objection to Is there objection in gross now There is objection I can't I can't hear you back there saying your voice is gone All right, there's objection from the center from the 41st All those in favor of the motion To engross sp 212 with vote. Yeah, I'll pose nay secretary and like the machine You You You All in the motion to engross the a's are 32 the nays are 20 and this motion has prevailed You Moving on to the rules calendar What's exciting about today's rules calendar is we actually have a couple of members that have bills on for the first time in here today I'll let y'all know when they come up Senate bill 105 secretary read the caption Senate bill 105 by senator annav a chart later for some other bills we can tell like to amend chapter 50 a title 43 The official go to Georgia annotated really to veterinarians and veterinary technicians So as to authorize license veterinarians and veterinary technicians for practice veterinary televised to authorize license veterinarians Veterinary technicians to practice veterinary Telechriage under certain circumstances to authorize certain License veterinarians to practice veterinary telemedicine under certain circumstances to ride for the regulation of the practice of veterinary telemedicine Medicine veterinary telechriage and veterinary tele advised by the state board of veterinary medicine to revise and provide for definitions throughout Related matters for people collecting laws and further purposes Mr. President Sunday me and I'm culture and consumer affairs recommends that this bill do pass or so� Consumption center goodman chairman that completes the order of Mr. President We're gonna have center from 31st speaks of the bill You Name is president good morning friends Senate bill 105 we are updating portions of the Georgia veterinarian practice act A couple of things that this bill will do it will enable all license veterans in the same hospital provide care based on established Medical director records it will allow veterinarians to use telemedicine for patients for existing vcpr It will clearly distinct\n\ntelemedicine, televice, and teletriage. And finally, it will ensure oversight and accountability, in the sense that it will prevent out of state from veterinarians from exploiting telemedicine and on ethical practices like remote-only prescriptions, and will maintain alignment with federal regs, USDA accreditation, and state standards. Bottom line, this is a great build protect our veterinarians across the state that are taking care of our animals, whether you're in the city, or whether you're in the country. And with that, Mr. President, I yield the well. Does any of the Senator which speak for against the measure? Chair, here's none. Is there objections or previous question being ordered? Chair, here's none of the previous question is ordered. Is there objection to agreeing to the Board of Committee, which is favorable to the passes of the bill? Chair, here's none. The Board of Committee has agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. Questions on the passes of the bill? All those in favor of the bill will vote yay. All opposed, nay, secretary, and law in the machine. On the passes of the bill, the a's are featured to. The a's are zero. This bill hand received. Reckon at Constitution majority is therefore passed. Secretary Reed, Senate bill 17. Senate bill 17 by Senator Ann Vertarclay. The third person, the other is bill to be in tell and act to amend. Article 11, chapter 2, title 20, and Article 10 of chapter 3, title 38. The official court of Georgia annotated relates to public school property and facilities in state. Why first responder building mapping information system, respectively, so as to enact Ricky and Alyssa's law, to require local school system to implement a mobile panic alert system capable of connecting desperate emergency services, technologies to ensure real time coordination between the multiple state and local first responder agencies in the event of a school security. To authorize the Georgia emergency management and the Homeland Security Agency to adopt rules and regulations for the requirements for school mapping data to arrive for definitions, arrive for related matters, arrive for effective data to be able to look at laws and further purposes. Mr. President, Senate, on education and youth, recommends this bill to pass by a substitute, respect what's minted, Senator Hickman, chairman. Mr. President, the Senate, comment on education, youth, overstu long substitute to Senate bill 17, it builds maintenance to amend Article 11, chapter 2, title 20, and Article 10 of chapter 3, title 38. The official court of Georgia annotated relates to public school property and facilities and state why first responder building mapping information system, respectively, so as to enact Ricky and Alyssa's law and further purposes. Mr. President, I can please the order. Bring it as the Senator from 31st, speak to the bill. Thank you, Mr. President. On the morning of September 4th, lives were changed forever at Appalachia High School in Barrow County, Georgia. On that day, the Georgia Bureau of Investigation said at 10.20 AM, the Barrow County Sheriff's Office received the alerts about reports of an active shooter. The victims were identified by the Georgia Bureau of Investigation on that day as student Christian and Duke Glow, student Mason Schemmerhorn, teacher Christina Iramy, and teacher Richard Ricky Ashmol. That day changed Georgia forever, and I know on behalf of my family, your families, this entire Senate body, we think about those four individuals every day, we think about the students, the teachers in that building, and what they experience, and we think about the Barrow County community in general. To this day, I know Shane Ashmol, some of y'all met her, she testified, and the Senator from the Forest Committee about this bill and the lasting impact that's had on response, and it responses to an active shooter or a health emergency on a school campus. Very similar to what Alyssa Aldehef's mom and family experienced on February 14th of 2018 during the Marjorie Stoom and Douglas High School shooting in Parkland, Florida, where this bill that you voted on last year with bipartisan support was born, unfortunately. This bill basically is to improve public safety response times to life-threatening emergencies, and this bill requires that public schools provide classrooms with a mobile panic alarm technology to basically save lives, reduce the amount of time that it takes for law enforcement to respond, and get to an incident. The other part of this bill is a school mapping piece, and very simply, all it does is require that every school property in the state be mapped. So, that data is provided when an incident happens in real time. Our folks and friends in the public safety community know where to go to find the assailant, where to go save lives, where to evacuate people, seconds count, minutes count, nothing will ever change what happened in Parkland or Barrow County, but I think we all agree we can make our systems better, our schools better, and make sure that our schools are as safe as a humanly possibly can be. I do want to recognize the president of the Senate for his work on this and his support, the senator from the 46th, the senator from the 45th, and the senator from the 49th and others, those senators that represent the Barrow County community for walking alongside a lot of these families who still have questions about what happened in that school that day. And I do want to thank the Georgia Emergency Management Agency, their entire team, Chris Stallings, who has moved on to other things now. The Barrow County Sheriff's Office, Governor Kemp and many others who showed up that day and that night after an event that changed our entire world. So with that Mr. President, I'll yield, there's a couple questions, otherwise I'll yield the will. You have no question, Senator. Name is President, I ask for a green vote. Does any other senator wish to speak for against a measure? Chair, has there the obvious question being ordered? Chair, is it on the CDM? Is there an adopted committee that is adopted? Yes, it's scars and all internal concerns. The injured committee is adopted. The board of the committee has agreed to. It has their objectives to the main question being ordered. Chair here is none of the main questions. Ordered questions on the passes of the bill. All those in favor of vote, yay, all opposed, nay, secretary, and all on the machine. Thank you. All on the passes of the bill, the yay's are 55, the days are zero. This bill has received direct constitution majority. Therefore pass by substitute. Good job senator from the 31st. Those are bills. I know you worked very hard on those first two bills. Good work on those two. Secretary Reed, Senate bill 61. Senate bill 61 by Senator Dullesall, 27 with another. It's bill 19 to men. Article 6 or chapter 11, title 15 of the CGA. We're ready to deliver these. I ask to provide for additional offenses over which superior courts are authorized to use exclusive original jurisdiction for the trials of children in 13 to 17 years of age to include the offenses of certain terrorist, sexual threats, or acts involving public and private schools. An attempt or criminal conspiracy to commit certain offenses to arrive for which such cases shall be subject to the class a designated felony act provisions of code section 15-11-602. I'm on transfer to a juvenile court to amend chapter 2 of the title 20, those to GA. I want to do elementary and secondary education to repeal the flicking laws on further purposes. Mr. President, Senate committee on judiciary recommends this bill to pass by substitute or slightly submitted to the Strickland chairman. Mr. President, the Senate committee on judiciary offers the following substitute to Senate bill 61, a bill to maintain an act to amend. Article 6, we've chapter 11, title 15 of the Fisher-Gurah Georgia annotated. We'll be due to the link we'll see. It's just to provide for additional offenses over which superior courts are authorized to exercise exclusive original jurisdiction for the trials of children in 13 to 17 years of age to include the offenses of certain terrorist acts involving public and private schools and for other purposes. Mr. President, Senator Dolez on the 27th, offers the following amendment number 1 to amend the Senate committee on judiciary substitute to Senate bill 61 by replacing lines 133 through 155 with the following A. On public and private school, operate property including on limit to school buildings and school grounds by replacing lines 190 through 192 with the following A. Public or private school, operate property include not limited school buildings and school grounds and for other purposes. Mr. President, that completes the order. I recognize Senator from the 27th, speak to his bill and his amendment. Thank you, Mr. President, colleagues. We have a couple of school safety bills here in a row and Senate bill 61 comes about after conversation between the Lieutenant Governor's office, some of our juvenile court judges, my sheriff's sheriff, Ron Freeman, my school district council, my school superintendent, Mitch Young, and we had a number of things that we heard from them, some of which remain in Senate bill 61 and some of which are in the bill that the Center from the 45th will have, I believe, coming up next. Senate bill 61 adds to the list of crimes that are heard in Superior Court, adds terrorist acts committed against the school. So, when I pause here and point out that we did change in the original bill, we add two new criminal acts in the code, terrorist acts committed against the school and terrorist threats against the school. Originally threats was also given to Superior Court, but after feedback in our committee sub, we haven't such that only the act is what will be heard in Superior Court. The bill also expands to this list to include any aggravated assault or aggravated battery committed with a firearm. Currently in code that only applies if it's against a public safety officer. And so on lines 43 and 44, you will see that we strike the underlying requirement that it be committed against a public safety officer for those to be in Superior Court. In addition, the bill provides Superior Court the exclusive jurisdiction over cases involving criminal conspiracies or criminal attempts to commit the underlying offenses for which Superior Court already has exclusive jurisdiction. As you know, those are things like manslaughter, second degree murder, rape, aggravated assault, and me, et cetera. You will see that on lines 49 to 51. I think it's important to point out at this point as well that the bill preserves the existing authority for a DA at any time before indictment after investigation and for cause to decline the prosecution in Superior Court and bring the case to juvenile court for those between the ages of 13 and 17. You will see that on lines 68 through 71. Section 3 requires DJJ, DHS, and DFAQs to notify a local school system when a child has been because of their behavior placed on electronic monitoring intensive supervision program or home confinement program. One thing that I heard from my sheriff was that often you have kids moving through the system and the school is unaware of that. We want to make sure there's an open line of communication between law enforcement and the school system, but you will see on lines 154 to 167. Then we put guardrails in place to ensure that that information can only be used to keep the school safe and that they will not be used for any sort of confinement in the school against the student that that applies to lines 171 through 235 outline the two new criminal offenses that I talked about. The amendment that's before you amendment one follows through on a commitment that I made in committee to someone who can express concern about the inclusion of adjacent playgrounds off of school and parks off of school property. So all that we're doing with the amendment is clean out up to strike the language as it relates to parks that are adjacent to a school. And then lastly, as you all know members, we have a current school safety plan process that is in place. We strengthen that school safety plan process in section five of the bill by requiring each public school to perform an annual site threat assessment either with local law enforcement or with individuals who Jima has identified as being qualified to do so. We will use that site threat assessment to inform the school safety plans. We move that to an annual process so that every year at every school in the state of Georgia, we are assessing the threat and vulnerability threats and vulnerabilities around unlocked doors open doors, vestibules, things that professionals will identify as vulnerabilities so they can then work those showing up those vulnerabilities into the annual school safety plan. So I'm sorry, Mr. President, I'm happy to answer any questions if we have any. If not, I will yield the well. You do have a question, Senator. I recognize Senator from the 10th. I'm looking for no. I'm sorry, Senator. You do not have any questions. Thank you, Mr. President. I yield the well. Thank you, Mr. President. I'm here with his body. First of all, let me say I appreciate the senator from the 27th bringing his legislation. And on when you look at this legislation, you would think it is a great thing to do. And certainly there are some elements of this legislation that to me and certainly to some of my members appears to be problematic. And the reason why it appears to be problematic is because we are criminalizing our kids creating new code sections. And the whole thrust behind this is sending kids and cost of raising kids, rather than rehabilitating kids and getting them the services that they need. I believe there's a different approach when it comes to school safety. We have an opportunity to identify early on who those kids are with early alert systems. We also have an opportunity to get the kids to care that they need. This isn't a novel idea. These are all ideas that we discussed doing our forums, say storage study committee. And these are ideas that I heard overwhelmingly from all of those that attended from the clinicians down to the parents and even students themselves. Most kids do not have to commit these offenses in our school system. Do not have a prior record. And I will set that again. Most kids, not just in Georgia, but across this country that commit these offenses, do not have a prior record. So trying to use our departments of do not justice to identify who those kids are really is problematic. And we need to look at how to address this issue on the front end. I've offered up several bills to do exactly that, Senate Bill 54 and Senate Bill 53. And I would hope that this body would consider looking at this legislation so that we can provide early intervention. We can provide the social services in the clinical care that these kids need and not just provide it, but also continue to ensure that if those kids move out of their original setting, we would still have an opportunity to track those kids. And those new settings that they would happen to move to, would still be made aware of the issues and the problems that they had in a previous school system. So this is, in my opinion, and those of members of my coq is the best way to address the concerns, not by criminalizing early on and trying to look at our department of justice is in the department of corrections and trying to create more, certainly create more sentences for these kids. We need help, they need care, they need the clinicians to work with them early on. And Mr. President, thank you and I you to well encourage you to vote no and consider the approach that we offer in terms of treating this issue display in our great state. Thank you. Thanks, Senator. Any other senator which speak for against a measure? Chair, here's none. Is there objections to previous question being ordered? Chair, here's none. Preest question is ordered. Actually, we do have a amendment number one author by the amendment the senator from the 27th who is the underlying author of the bill. Is there objection to amendment number one? Out of objection, amendment number one is added. Question on adoption of the committee substitute as amended. Is there objections to adoption of the committee substitute as amended hearing none committee substitute is adopted? Is there objection to agree to the board of committee which is favorable to the past of the bill. Chair, here's none. The board of committee is agreed to. Is there objections to the main question being ordered? Chair, here's none. The main question is ordered. The question is on the passes of the bill by substitute all those in favor of O.A. All opposed nay, Secretary Unlocked the machine. Chair, here's none. The committee is agreed to. All the passes of the bill, the A's are 33, the A's are 22, this bill has received the requisite constitution. The majority is therefore passed by substitute. Secretary, Senate bill 179. Senate bill 179, by senator Dixon, 45th and others, bill to be attended. Chair, here's none. The committee is agreed to. The committee is agreed to. The committee is agreed to. The committee is agreed to. Chair, here's none. The committee is agreed to. The jury battled, the estimate of bill 179 by deleting the end of line would be a reasonable figure on the Chairman, on the set. Will it be a unanimous vote fraud? scales and compromise of the court company? I need an Ihrer's death bill of bribeschair Roll rational and court 때문에. before you today. It is the third school safety bill you've heard this morning. This one is more of a preventative side of school safety has several provisions in it starting out under current law. When a student transfers from seventh grade and up They have to on a conditional basis. They can be accepted into the school before their transcript Reaches their receiving school as long as their parent or guardian has executed a document providing the name address Of the last school that they attended what this bill changes is that it will require those records to be transferred to school administration within ten days By the local superintendent or principal of the last school the student attended also Under this new provision parents and guardians would have access to the students records within five days and they also must be required to List any class a or class b felony acts Under current law if there is due to judification For delinquency under such acts they must be disclosed already This is required by current law also in our current law students or parents Parents or guardians they must disclose if the student is currently serving as suspension or expulsion from the other school this all must be contained in their In their disciplinary records this being transferred What this bill changes is if a parent or guardian fails to do so they would be subject to a misdemeanor Find up to a thousand dollars 30 days in jail or a combination of community service The next provision this bill it also requires law enforcement if a student is arrested on a class air class b felony That it must be reported to the school superintendent within seven days The next portion of the bill has to do with foster children That are under the custody of defects In order to comply with federal law students must be immediately admitted Enrolling into the new school, but their transcripts must be transferred within ten days as well And the last piece of the bill has to do with mental health It would require from six grade to 12th grade students would be required to take a Minimum of one year class or training on suicide awareness and prevention also Youth-based violence prevention to either you know, you know, recognize if a student is Potentially going to harm themselves or someone else with that miss present be happy to answer any questions You have no questions, Senator. Thank you, Mr. President. I yield well. Does any other senator which speak for against a measure? Chair here's none Question is on amendment number one authored by the senator from the 45th is there objection to amendment number one I'm Jackson amendment number one is added questions on the adoption of the committee substitute as amended Is there objection to the adoption of the committee substitute as amended hearing none the committee substitute as amended is adopted? Is there objection to agreeing to the board of committee which is favorable to the passes of the bill? Chair here is none the board of the committee is agreed to is there objection to the main question being ordered Chair here's none of the main question is ordered questions on the passes of the bill by substitute all those are favor the bill vote Yeah, I'll pose an a secretary on the machine You You Senator from the fidget first you Parliamentary inquiry station requiring mr. President isn't true that the senators from the 45th 27th and the 31st have worked extremely hard For the last 12 months to prepare these three bills to protect our children in our school systems No, about it senator no down about it. I think we go I was just about the make say the same thing here, but I appreciate your reminder So thank you for that senator On the passes of the bill the a's are 54 the nays are one this bill having to see the requisite constitution is there for pass by And Light to echo exactly what the majority leader just stated Senator from the 45th the 30 first and the 27th thank you all very much those were priorities are thank you all very much for all the hard work you did For school safety measures\n\nAll right. We greatly appreciate that. Moving on to Senate Bill 276. Secretary Reed. Read the caption. Senate Bill 276 by Senator Eccles of the 49th and others of the Bill to be ten and act to amend code section 49-448 of the Fish and God of George and the Table A2 to recovery of medical assistance from third party liable for sickness injury disease or disability so to revive certain provisions to comply with federal law. To bar liable third party payers from refusing payment solely because a health care item or service did not receive prior authorization to acquire a third party payer to respond to an inquiry from the Department of Community Health regarding a health care claim within 60 days to arrive for a later manner to repeal conflicting laws and further purposes. Miss President Senate Committee on Insurance Labor recommends of this bill to pass or expect was minted Senator Walker Chairman that please see order Miss President. Recognize the senator from the 49th. Senator did I see your wife here earlier? The former senator? Well good. Any donors here? Well good. When they come in the back of the chamber let us know so we recognize them. Thank you Mr. President. Good morning colleagues. This morning I bring before you Senate Bill 276 this is an agency bill passed our chamber last year. This legislation addresses federal requirements impacting DCH and Medicaid third party liability. It brings state of Georgia and compliance with the US consolidated appropriations act of 2022. It requires states to have laws and effect that bar liable third parties from refusing payment to Medicaid for a service based solely on the fact that prior authorization was not issued. Medicaid's always been the pair of last resort and only pays for covered services if there are no other liability third party payers. This could be a commercial insurance plan a lawsuit settlement or a workers compensation settlement. This bill will ensure that those primary payment sources cannot unreasonably deny payment to Medicaid for the services for which they are responsible. That is all Mr. President. You have one question Senator I recognize senator from the 42nd. The senator you yes senator. Senator I noticed on lines 18 and line 24 you struck the words the words health care and replace it with health care. What is the difference between health care and health care? It should have been written together not two separate words senator. Do you further yield? Yes senator I do. And so whoever wrote this this bill previously this law previously had it misspelled. The gentleman knows what he speaks. Do you further yield? One more. One more. On line 32 there's the 60 day requirement still must respond than 60 days of inquiry. If the 60th day falls on a weekend is it all a macro to the Monday or how does that work? Appreciate it goes to Monday. You further yield? Yes sir. Are you pretty sure it goes Monday? It does it go to Monday. It goes to Monday. It goes to Monday. All right thank you. I yield the will. Senator's yielded. Does any other senator wish to speak for against the measure hearing none? Is there objections previous question being ordered? Chair here's none. Previous question is ordered. Is there objection to agreeing to the board of committee which is favorable to the past to the bill? Chair here's none. Board of committees agreed to. Is there objections to the main question being ordered? Chair here's none. The main question is ordered. All those in favor of the bill Vogueye pose nay secretary I'm not in the machine. All in the past to the bill the yeas are 54 the nays are won this bill him receipts rex and constitutes from George is there for pass? Secretary read Senate bill 259 Senate bill 259 by Senator Brass of the 6 and others bill between 10 and act to amend chapter 11 title 15 of the fish go to George annotated like to do the juvenile code says to provide for certain procedures to be followed when there is a determination of suspected child abuse and collect to provide for a physician holding temporary physical custody of a child based on a suspicion of child abuse or collect to provide for certain information to apparent legal guardian and the division of family and children and services to right for definition for right for a later matters right for an effective date and applicability to appeal to the laws and for the purposes. Mr. President Senate committee on children and families recommends this bill to pass by substitute seven and senator Patrick chairman. Mr. President the Senate committee on children and families offers to allow substitute to the Senate bill 259 and bill between 10 and act to amend chapter 11 title 15 of the fish go to Georgia annotated like to the juvenile code says to provide for certain procedures to be followed when there is a determination of suspected child abuse or neglect and for other purposes. Mr. President I can please de-order. Reganized Senate from the six. Thank you Mr. President colleagues. Over a year ago I got a call from an old friend and he was calling me from the hospital that he had been removed from. Just days earlier his grandchild had gone and had some medical complications to where he couldn't breathe. They took this child to the nearest fire department. From that fire department they life-flighted the child. Child's name is bridge. Ridge was life-flighted up to Choa and at Choa it was determined that the breathing stopped from some swelling on the brain and there were some other complications that were caused and so medical evaluation was was commenced on the child and at that moment the medical professional had deemed that Ridge had had been abused as a child. He was abused and Ridge at this time was about six weeks old. The grandfather was calling me and despair not knowing what to do and so I made a few calls to kind of understand the process, get a little better handle on what was about to happen and I called him back and I told him, sir this is going to be awful. What you and your family are about to go through is going to be a nightmare but you have to let this process take place. You want to be sure that that child is not being abused because the nightmare that you're living now would only be worse if that abuse did exist and that child did in fact one day pass away. So when I told him that I was thinking the process might take a few days, worst case scenario maybe a couple weeks. Well the process played out and through court and various other means they brought in they had to hire attorneys, they had to hire doctors, other doctors to come in and give second opinions in the court of law to where the abuse was, it was found there was no abuse it was it was all from some complications that Ridge had at birth that did cause that swelling on the brain and through all that hundreds of thousands of dollars later Ridge was able to go home. 15 months later Ridge was able to go home. For 15 months a family went through a nightmare situation, family torn apart, a child from six weeks old to just over a year old was removed from his from his family. So what this bill does is SB 259 also known as Ridge Ridge's Law thank you to the senator from the 50th who offered that amendment and committee. What Ridge's Law will do is when a child goes to a facility like Choa and goes to see a medical professional and their the child is taking into temporary custody. Well this will allow the parents to do is to get a second opinion and they can get it at that time instead of having to wait and go through the court system. This is modeled after Texas, they have a second opinion law there is very similar to that and the bill is very simple in the first part of the bill. It says that the doctor number one has to review the previous review the child's medical records and that will be filed in the in the de facto system that they did in fact review that those records and should there be a reason that those records were not reviewed that also will be filed in the in the de facto system called shines. And they must then notify the parents of their right to get that second opinion and then the second part of this bill simply makes it very clear that the family can get that second opinion. Now I wish I could tell you that Ridge was is the only case that this has happened. I will say it is it is very rare that this does happen but but rare is too many. Choa does review over 2300 cases of child abuse every year and the number of times this happens is is very small but it does in fact happen and we must give these families a second chance by allowing a second opinion. Well that Mr. President I will yield for questions. You do have one question Senator just recognize Senator from the 44th. Thank you Mr. President will the rules chairman yield? Absolutely. Senator thank you for bringing this bill. Is it not true that I had constituents that had the a very similar situation to Ridge's family? I believe so we had a couple other mothers. We had three mothers in total that testified in committee I believe one of them may have been years and unfortunately that's not the only three that this has happened. There is a there is a bigger number than that that this has happened to and so thank you for that. Yes and isn't it true that the the whole the whole shock family or my constituents upstanding employees at the CDC three children and due to a misunderstanding and lack of second opinion lost all three of their kids for over two years and were also criminally charged until finally those charges were dismissed and it destroyed their life. That's correct the mother gave a very compelling testimony very emotional in fact that was one of the most emotional hearings I've ever sat through as it's very sad I can't can't imagine my children being taken from me. And isn't it also true that they came to me to ask to run interference with defects on this issue? I believe that to be true. Thank you for your work. Thank you. We're going to as a senator from the 32nd. Thank you Senator for your yield. I do madam chair. Is it true that during the committee testimony that just about the entire committee was in tears including yourself? I was bawling that is correct. And isn't it also true center that you work closely with the Department of Human Services the commissioner in particular to be sure that we were doing the right thing on this bill? There's absolutely correct and you bring up a great point because during a separate committee hearing of that you held I had invited Commissioner Brogian and Regina Quick to come back to my office to meet with this grandfather. They were very familiar with the case throughout the year and a half process that went on. I was in touch with the grandfather frequently and many times I reached out to the commissioner directly to get answers and she was very helpful. In that meeting as we were discussing the problem that is when the grandfather brought a solution and the commissioner jumped right on it and said if we can figure out the details quick enough I will absolutely support this and that is how good government supposed to work. We're supposed to listen to our people and then come up with solutions. Thank you senator. Thank you for all your work on this on the great committee that you chair. You have no more questions. Thank you. I urge for everyone's favourable considerations so that we can prevent families from being ripped apart. Please support SB 259 ridges law. Thank you. Thank you senator. We're going to have a sit in front of the 50th. Thank you miss president. I will be brief on this. I just want to applaud senator from the 28th for what he's done with this bill. I've had two constituents that have dealt with this. My wife actually is a juvenile attorney and this was one of the main things she dealt with was parents who had their children taken away and while it is rare for the doctors to get it wrong when they do get it wrong this will help families stay together and I just I want to thank the rules chairman the chairman of children and families in lieutenant government for starting this committee. If you haven't had the opportunity to come it's an emotional committee and it always leaves you feeling better when you walk out so without miss president I'll yield the well. Thank you. Thank you senator. Does any other senator wish to speak before against a measure? Chair here's none. Is there objection to the previous question being ordered? Chair here is none. The previous question is ordered? Question has owned the adoption of the committee's substitute. Is there objection to the adoption of the committee's substitute? Here, you're none. The committee's substitute is adopted. Is there objection to agree to the board of the committee? Which is favor to the passes of the bill? Chair, here's none and the board committee has agreed to. Is there objection to the main question being ordered? Chair, here's none. Main question is ordered. Questions on the passes of of the bill by substitute, all those in favor of vote. Yay, all those, nay, secretary, and light on the machine. All in the pages of the bill, the A's are 55 and the NA's are zero. This bill can receive the requisite constitutional majority as they're full pass by substitute. Good job, Senator Goodjum. Secretary SB 33. Senate Bill 33 by Senator Kirkpatrick. The 30th second and others will be in ten on active men chapter 23 of Title II. The official of Georgia annotated the Georgia hemp farming act. So it's probably limits on the total THC concentration of consumable hemp products to revise positions, concerning the certificate of analysis. Public will to consumable hemp products to revise and provide for definitions, to write for laid-amatters, for people conflicting laws, and for other purposes. Mr. President, the Senate can be regulated, and the streets and utilities recommends this bill do pass by substitute. The bill is submitted to Senator Kousert-Cherman. Mr. President, the Senate can be regulated, and the interstitial utilities offers the following substitute to Senate Bill 33. You billed to me ten on active men chapter 23, Title II of the official of Georgia annotated the Georgia hemp farming act. So it's probably limits on the total concentration of intoxicating cannabinoids and consumable hemp products to revise provisions, concerning the certificate of analysis, applicable to consumable hemp products to revise and provide for definitions, to write for laid-amatters, to be able to conflicting laws and for other purposes. Mr. President, that completes the order. I'll break it down to the senator from thirty second. Thank you, Mr. President. This bill relates to Delta 8 and other intoxicating cannabinoids that were not included in Senate Bill 494 last year, which required testing and labeling of Delta 9 THC with a maximum concentration of 0.3%. We have reputable processors of consumable hemp products in our state who are already testing and labeling, appropriately, including one in the district of the center from the 13. But we also have products from China and other places that are being sold in gas stations, convenient stores, and smoke shops that are not being appropriately tested. These cannabinoids appear in trace amounts in the plant and they're then enhanced with various chemicals to increase their strength. The products may be contaminated with industrial solvents, heavy metals, and other contaminants. This is a health risk and the FDA has written a number of warning letters due to adverse events, resulting in emergency treatment, including right here in Georgia. And there's one case that I'm personally familiar with in Henry County. This bill includes other intoxicating cannabinoids like Delta 10 that were not captured in last year's bill, because there are others besides Delta 8 that are in this category, including a chemical called HHC, which was actually pointed out to me by the Agriculture Department. Senate Bill 494 already has restricted consumable sales or purchase to adults over 21. As you know, hemp currently has a definition of less than 0.3 percent. Anything above that is marijuana. Hemp products are regulated by the Department of Agriculture, marijuana by the Marijuana Commission. This bill has nothing to do with medical cannabis. What this bill does is add Delta 8 and other intoxicating cannabinoids to the total THC concentration of a product on lines 110 and 111. After defining intoxicating cannabinoids on line 55 to 63, it adds authority to the department to add any compound or group of compounds considered to be a health and safety threat on line 141. This bill is not a ban. It's a consumer protection bill that is not intended to impact processors that are already testing and labeling their products appropriately. It's intended to make sure that consumers buying these products are clear on what they are buying. The Agriculture Commissioner and his team are working hard to implement the program we put in place last year. And this bill is intended to help them in their efforts to protect consumers. I appreciate their input into the bill. You have a letter on your desk from the Georgia CERF's Association in support of this bill due to the many challenges faced by law enforcement and dealing with impaired individuals. The bill passed a regulated industries committee unanimously and I would appreciate your support. I'm happy to answer any questions. You have no questions Senator. Thank you. Does any other senator which speak for against the measure? Chair here is none. Is there objection to the previous question being ordered? The question is only the option of the committee to substitute. Is there objection to the option of the committee to substitute? Here none of the committee to substitute is adopted. The question is on the passes of the bill by substitute all those in favor of O.A. All opposed. Thank you. The bill is on the passes of the bill. The bill has received the constitutional majority passed by substitution. Secretary Reed, Senate bill 254. Senator Bill 254 by Senator Couser, bill 46. Senator Bill 109 to amend chapter 23. The official got a Georgia annotated. The Georgia hemp farming access to provide milligram limits on Delta 9 THC and consumeable hemp products. The provide for laid-of-manage through the public looking laws and further purposes. Mr. President, Senate Committee on Regulated Industries and Utilities recommends this bill due passed by substitute is five minutes. Senator Couser, Chairman. Mr. President, Senate Committee on Regulated Industries and Utilities offers to following substitute to Senate bill 254. Bill 109 to amend chapter 23. The title two of the official got a Georgia annotated. The Georgia hemp farming access to provide milligram limits on THC and consumeable hemp products to provide for definition to provide for laid-of-manage through the public looking laws and further purposes. That can be seen under Mr. President. I recognize the senator from the 46. Thank you, Mr. President. Senators, it's interesting all the different subject matters we learned serving in this body this year. Last year we learned an awful lot about hemp products and THC. We first regulated this in last year's Senate bill that gave the enforcement powers to the Department of Agriculture and also gave them the power to issue rules and regulations further controlling the use of hemp products. What we've learned is that the federal limit of 0.3% THC in a hemp product is an enormous amount of THC when you extrapolate it out to the volume. We've learned that this 0.3% dry weight is the equivalent of over a thousand milligrams of THC for a 12 ounce beverage. Most states are limiting greatly the amount of THC that can be included in a beverage or in a texture or any kind of lotions or in gummies. And the reason is to protect the consumers, protect the public from the psychoactive components of THC. So you're going to get high. What the science has shown us, we learned an awful lot in regulated industries is 2.5 milligrams will get you high. 5 milligrams, no question. And if you look on your desk, the senator from the 56 has sent out a little chart that shows the equivalent of 2.5 milligrams of THC to beers. And basically the best they can translate that is 2.5 milligrams is equal to a beer, a glass of wine or a shot of liquor. What we're trying to do in this bill is just follow up on what the senator from the 32nd just passed on including capturing all forms of THC. Not just Delta 9 which naturally occurs in Hemp and marijuana, but also capture Delta 8, Delta 10, other variants that are still THC. This bill captures them all as well, but it essentially codifies the rules and regulations that the Department of Agriculture came up with. Back in the fall, the original rules and regulations of the Department of Agriculture limited you to 5 milligrams per 12-mounts beverage and would not allow you to have larger than a 12-ounce container for the liquid forms of these Hemp infused beverages. It limited the gummies to 10 milligrams per gummy and no more than 150 per package, which would be 15 servings. As far as the topical creams and what not, it limited you to 1,000 milligrams of Delta 9 THC per package. And then the tinctures which are little oils, it limited you there to 1 milligram, not to exceed 10 fluid ounces in a container. This January those rules were updated and they increased the beverage from 5 milligrams to 10 and it increased the amount per package from 150 to 300. What this does is go back and codify the original rules, takes it back down to 5 milligrams per beverage and back down to 150 milligrams per package of the gummies. This is for public safety, you may hear other people speak on this, but these current 10 milligram beverages are like four shots of liquor, four glasses of wine or four beers, all in one can. So what we're doing is allowing folks to sell beverages that will impair your ability to do a lot of things but for one to drive. It's still illegal to drive under the influence of alcohol and we tell you what's the level that we deem to be intoxicated or to impair you. You may have heard .08 so that's roughly four beers we say is intoxicating your impaired on T.H.C. I don't know if the science is there to tell exactly how many milligrams or nanograms it takes to impair you, but I think the everybody in the industry agrees that if a 10 milligram serving is equal to four beers. Or four glasses of wine or four shots of liquor, you take that in one time.\n\ngoing to be impaired and the law in Georgia is your DUI drugs if there's any THC in your blood test. So we're putting loaded guns in people's hands in the form of a can or a gummy and we need to protect them. We need to keep it away from children and we need to make sure that people are responsible in their usage of these products. So with that Mr. President, I strongly encourage passes of this as we just codify the stricter rules and regulations and try to sort of get our arms around this new industry. I yield for any questions or may be. You have no questions, Senator. Thank you. I yield the well and ask for your support. Secretary, read the amendment. Mr. President, Senator Roberts, Senator 29th, and I'll be with the 56th off of the following amendment number one to amend the Senate Committee on Regulation and Instraising until these substitute to Senate Bill 254, by placing line two with the following. I'm farming access to prohibit the sale of consumable hemp beverages that contain THC, to provide milligram limits on THC consumable hemp, by placing lines 44 and 45 with the following be a drink or beverage that inserting eye contains striking contains alcohol or constitutes an alcohol beverage under Title III and serving or eye contains THC, Mr. President, that can please and for other purposes that Mr. President, that can please the order. Bring it out and Senator from the 29th, speak to the amendment. Hello, colleagues. This is a very simple amendment. I'll keep it very brief. We're on a bullet train with Dylan with marijuana. Now let's be clear, that's what we're dealing with. You can call it cannabis, you can call it CBD, you can call it whatever you want to call it. You know, farmers, product, whatever, we're dealing with marijuana, weed, the chronic, whatever you want to say. That's what we're dealing with. What this amendment does is it prohibits the sale of beverages that contain THC in Georgia. And I never thought I would stand in this well and say this. The state of California just put out an emergency order three weeks ago, signed by Governor Gavin Newsom, to pull all THC, all beverages containing THC off the shelves in California. Because of the adverse effects on people that were buying it out there, and the damage it was causing, and the numbers of individuals going to the emergency room. California has been dancing in the arena of marijuana for years and years and years, and they realize that they don't have control over it. We need to pump the brakes, slow down, and let's make sure we're doing the right thing for our state. And another very political thing to say, but is absolutely true in this case. I was talking to two of my colleagues just a few minutes ago. It's not about those of us in this room sitting here, the adults that I'm looking at. It's about our children. It's about my five granddaughters. It's about your children. Think of the world they're coming to while we're making these fast decisions related to something that there is so limited study on because it's a schedule one drug, and we have not been allowed to run the types of medical tests on these that we should. So I would ask you, please, to support the amendment, and I would also ask my friend from the 46 not to object. And with that, Mr. President, I'll stand for any questions. If I have any, if not, I'll be happy to yield the well. Do you have one question, Senator? Yes. Senator from the first. Thank you, Mr. President. Is the Senator to you? I do. I just wanted to applaud you for bringing this amendment. Certainly, the Senator from the 46 does put breaks on that and allows tries to thread a needle when it comes to that. But basically, what we're talking about is not the next bill where we're discussing medical marijuana. This is a really recreational marijuana that we're getting to. We're combining alcohol and THC in a formula that we really don't know what the outcome is going to be because there's not been good studies relating to this because this has been a schedule one drug. So I agree with you. We do need to pump the breaks on this as far as I'm concerned doing a wave of beverages. I think is a good idea. Let's keep it in the medical marijuana arena with the other 18 states that do this, isn't that true? That is true. My good friend and the doctor from the first, I appreciate your support and thank you. And with that, Mr. President, I'll happily yield the wealth. You have one question, but you always welcome to yield, Senator. I will take that one question from the 41st. Thank you, Mr. President. Senator, do you yield? I do. Can you just say in plain English again, what exactly your amendment is trying to do? If you read on line three, you'll see so asked to prohibit the sale of consumable beverages that contain THC. To be clear, if you will, you are attempting to take from the market any drinks that have THC in them. You and I just communicated perfectly. Yes, ma'am, that is true. Thank you. Thank you. Senator, do you have any other questions? Senator's yielded. Any other senator would speak for against a measure? Chair, here's none. We are questions on the adoption of Amendment 1. Adoption Amendment 1 authored by the senator from the 29th. I was getting to that, Senator. We do have objection. Would you like to speak for a objection, Senator? No. No. All right. So the question is on the adoption of Amendment 1. We do have objection from several members. So all those in favor of the adoption of Amendment 1 will vote ye. On the adoption of Amendment 1, the yeas of 29, the nays of 27, senator from the 14th. What purpose do you rise? Move to reconsider that amendment, Mr. President. All right. The senator from the 14th has moved for reconsideration. So all those in favor of the amendment will vote ye. All opposed, nay, secretary. I don't want to say. This is for reconsideration. This is for reconsideration right here. All those in favor of reconsideration will vote ye. All opposed, nay, secretary. I'm not in the machine. All in the motion for reconsideration, the yeas are 27, the nays are 29, and the amendment has passed. The amendment has been adopted, excuse me. since yananad great you you you On the passage of the bill the a's are 42 the nas are 14 this bill haven't received the registered constitutional majority therefore passed by substitute All right, so we're going to go ahead and stand at ease for lunch another his staff have got a good good lunch lined up for all the members here. So we're going to just stand at ease and we'll come back we'll come back about 115.",
  "updated_at": "2026-02-13T15:11:21.012853+00:00"
}