{
  "video_id": "dopAmYHvZX0",
  "url": "https://www.youtube.com/watch?v=dopAmYHvZX0",
  "title": "House Day 37 of the 2025 Legislative Session",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 37,
  "video_date": null,
  "duration_minutes": 150,
  "summary": "Overview: This Georgia House session focused on the introduction and referral of several key bills, including HB 86, SB 44, and SB 79. The session also featured a prayer by Pastor Jonas Chambliss Jr. and recognized the doctor of the day.\n\nKey Actions:\n**HB 86**: Bill to amend the Georgia Student Finance Authority\n**SB 44**: Bill to amend the state employees health insurance plan\n**SB 79**: Bill introduced but details not provided\n\nBills Introduced (First Reading):\n- HB 86: Bill to amend the Georgia Student Finance Authority\n- HB 68: Bill to amend the state employees health insurance plan \n- HB 71: Bill introduced but details not provided\n\nNotable Moments:\n- Prayer by Pastor Jonas Chambliss Jr. of Living Word Baptist Church\n- Recognition of the doctor of the day, Dr. Sanford Duke\n\nVotes: No recorded votes mentioned.\n\nAttendance: Quorum present, all members voted to signify attendance.\n\nAdjournment: The session adjourned, with the next session date not provided.",
  "transcript": "Bearing the bell. What day is it? Day 37. We're getting close. Good morning, all members. Please come to the floor and take your seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? Good morning, all members. Please come to the floor and take your seats. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. Mr. Clerk, will you unlock the machines? All members vote it in. All members. The doorkeepers, will you please close the doors? I think all members are voted now. Mr. Clerk, will you lock the machines? Again, doorkeepers, will you close the doors and keep them closed? As is our custom, we will begin our day with script reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the 111th House District, representative Ray Martinez, representative Martinez. Thank you, Mr. Speaker. I'm here to introduce to you past the Jonas J. Chambliss senior from Living Word, Baptist Church here in Loganville. He is married to Victoria Chambliss and the son of John L. Williams. He is married to Victoria Chambliss and they have four daughters, Yvette Sardierrielle, Janaye and son Jonas Jamar Chambliss. In the presence also, he's got his sister, Tais. Mr. Pastor Jonas grew up in New Orleans and in 2005, because of Hurricane Katrina, he moved to Gwyneth County. At the age of 10, he accepted the Lord Jesus Christ as his personal Savior and was baptized in July 31st of 1991. In 2007, God revealed to him the calling into ministry to preach and to teach the gospel. In 2007, Pastor Jonas was ordained as a minister for over 13 years. Pastor Jonas has served with this heart of God in our community and the Loganville community. God continues to bless Living Word, Baptist Church, as he shares the role of pastoring with Pastor Jeffrey Thread. He also serves in many roles in Loganville with Loganville United, NG3 and many other ministries in the community. Colleagues are now in to teach you Pastor Jonas Chambliss Jr. Thank you. Thank you again for the opportunity. Thank you for all who are here on today. Thank you for my family. God is so good. I thank him for this opportunity to minister here. I stand before you representing the Living Word Baptist Church in 1st and 4 months. My Lord and Savior Jesus Christ, thanking God for this opportunity to lift him up, give him the praise, the honor and the glory. Will you all stand before we pray? I just want to briefly share with you John 12.32. It says, and if I be lifted up from the earth, I'll draw all men unto me. The Lord Jesus Christ, He represents liberty, He represents justice, He represents us making the call to stand for what is right. And there are people who serve here today. You have been called to stand for what is right. God has appointed you and adointed you with such a time as this to make decisions that not only affect today but tomorrow. So let me pray with you every head bow. Every eye closed. Lord, we love you. We say thank you for your many blessings. Thank you for this opportunity. Time, Lord, to lift your name up, Lord. We thank you for Jesus Christ. Our Lord and Savior, the one who died for us. We thank you for this opportunity, Lord, to again bless your holy name for there is none like you. You are the creator of all the heavens and the earth. Again, we say thank you for those who serve here. Lord, thank you for speaking John, Lord, and all who are here serving Lord, every administrator, Lord, every representative of Lord, we just pray right now that you bless us to do the things you have called us to do for Lord. We are believing for greater change. We are believing for your will to be done. We say thank you in advance for what is going to take place. Those who may be sick and hurting here today, Lord. Those who have may have suffered in some capacity, Lord. We just pray right now. You heal their bodies, Lord. Bless our brother Terry, Lord. In the name of Jesus, Lord, we just pray for him that you heal his body. Thank you for allowing him to be here on yesterday. Lord, again, be with all who are serving and representing every county, every town, Lord, every person, Lord. Again, that we give you all the praise, honor, and the glory. We love you, Lord, and we say thank you. This is the day you've made. We will rejoice and be glad in it. And everybody who loves the Lord, shout it, Amen, and Amen. If you love the Lord, clap your hands. Bless his name. Now, what you follow me as I do my best to lead us in the pleasure of allegiance. Our pleasure, allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Thank you. That's right. That's right. The door, keepers, you may open the doors. Brother Jonas, thank you for that message and thank you for your encouragement. And good luck in your ministry as you continue to serve the people in Loganville and parts around Loganville. Thank you for your service. Thank you. Thank you. Thank you. Thank you so much. Members, you may join Brother Jonas in that south any room. Express your gratitude for him being here and take some photos. And thanks for his family for accompanying him today as well. Sisters, wife and daughters, thank you all. Thank you. Members, our doctor of the day today is Dr. Sanford Duke brought to us by Rifted Anissa Jones of the 143rd. Dr. Duke is down in the aid station. So if you need to have a conversation, I'm sure Dr. Duke will be glad to see you down there. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. You're committing an information in the office. We wiped all the pollen off the journal and we read it. And it was found to be correct after we met this morning and passed our rules. Thank you, Mr. Speaker. We were working on this, too. Thank you. You have your rules in place now. You're ready to go to work but you're waiting to go to work. But Chairman Hilton, the chairman of the National Information. The general of the previous legislative day has been read and found to be correct. Is there any objection to the speech of the journal? His area objection to the confirmation of the journal, hearing none, the journalist confirmed. Mr. Clerk. Mr. Clerk, will you read the resolution establishing the order of business for the day, Mr. Clerk? Representative, administration 104th Moose following to be established as the order of business in the first part of period unanimous consensus introduction to bills and resolutions, first reading in reference of House bills and resolutions. Second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading in reference of Senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day, hearing none, the resolution is adopted? First reading of bills and resolutions, the clerk will read. House of the 867, where are the bills and the bonds of the 86? Colleagues of the 67th, where now the 77th, the mental of the 88th. Schofield of the 63rd, and others, bill being taught in act to amend part three of Article 7 of Chapter 3, titled 20. I believe it should go to George Anteity Relay, the Georgia student finance authority. Higher education. House related 68, by the rest of the lumps into the 12th scogons of the 14th, Kelly the 16th, Gunner the 8th, Taylor the 173rd, the bill be taught in act to amend part one of Article 1 of Chapter 18, Title 45 with the official code of George Anteity Relay, the state employees health insurance plan. Insurance House related 71 by rest of Anderson, the 10th Williamson and the 112th, new with the 40th, Clark 100th, Stevens the 164th and others, bill be taught in act to amend code section 36, 83, 4, and the official code of George Anteity Relay, the authorized investments. Governmental affairs. House will lead 72 by rest of the Cooper the 45th, still Cox the 53rd, Camp on 35th, Pallard with 147 Jones the 47th and others, bill be taught in act to amend chapter one, and Title 31 of the official code of George Anteity Relay, the general provisions regarding health. Public and community health. House will lead 73 by rest of the thousands of 179th, bill be taught in act to amend Article 7 of Chapter 3, of Title 47 of the official code of George Anteity Relay, the retirement allowances. Retirement House Resolution 752 by rest of the Barnes, the 86 glaze the 67th, for now the 77th, the mentally 88th, Scofield the 63rd and others, a resolution creating the joint study committee on cosmology and barbering education. Regulated Industries. House Resolution 753 by rest of Donna Tucci, the 105th Hagen, the 156th, Camp on 35th, and Clifton on the 131st. Resolution creating a house study committee on proving access to internal medicine in rural areas. Rule development, rule development. House Resolution 754 by rest of the Beckles, the 96th Williams, the 168th, mentally 88th, resolution creating a house study committee on street lighting along state routes. Transportation. House Resolution 755 by rest of Scott, the 14th Gamble with 15th, Kelly the 16th, Canada, the 170th, Prince on the 130th, and others. Resolution creating a house study committee on electric franchise fees or unincorporated areas. The energy utilities and telecommunications. House Resolution 756 by rest of the 98th, Carper to the 4th, Santos, the 117th, Tran to the 80th, Clark on the 108th, and others. Resolution encouraging the General Assembly to preserve access to safety and justice. Public safety and homeland security. House Resolution 757 by rest of the Clark on the 108th, Evans, the 57th, with the 98th Barnes, the 86th. Resolution creating a house study committee on civil rights protections. Special rules of Senate Bill 340 by Senator Watson, the first to Bill B. Todd and Acta Manon, act to provide a new charter for the city of Ty B Island. Andrew Gov. Medial Coordination Senate Bill 340 by Senator Kennedy, the 18th, Bill B. Todd and Acta Authorize the Assessment and Collection of a Technology Feed by the Provecord Acroford County. Andrew Gov. Medial Coordination Senate Bill 345 by Senator Kennedy, the 18th, Bill B. Todd and Acta Authorize the Assessment and Collection of a Technology Feed by the Magistrate Court and Crawford County. Andrew Gov. Medial Coordination Senate Bill 347 by Senator Hodges, the 3rd and still of the 48th, Bill B. Todd and Acta Manon, act implementing the Brunswick and Glyn County Development Authority. Andrew Gov. Medial Coordination Senate Bill 348 by Senator Lucas, the 26th, Bill B. Todd and Acta Manon, act creating the Board of County Commissioners of Hancock County. Andrew Gov. Medial Coordination Senate Bill 349 by Senator Lucas, the 26th, Bill B. Todd and Acta Authorize the Government Authority of Hancock County to love his NXI's tax. Andrew Gov. Medial Coordination Senate Bill 350 by Senator Jackson, the 41st, Mangum of the 55th, Pair of the 44th, Jones of the 10th, Anderson of the 43rd, Bill B. Todd and Acta Manon, act providing for the compensation of certain County officers and officials of the Cab County. Andrew Gov. Medial Coordination Senate Bill 351 by Senator Walker, the 20th of Bill B. Todd and Acta Manon, act establish the State Court of Truth and County. Truthly and in and for the County of Truth. Andrew Gov. Medial Coordination Senate Bill 355 by Senator Maritay, the 31st and Beard and the 30th, Bill B. Todd and Acta provide a homestead exemption from Paul Ding County School District Advalorem Taxics. Andrew Gov. Medial Coordination, that completes first reading. Second reading of bills and resolutions, the clerk will read. House Bill 823 by Representative Wade of the 9th and Chastain of the 7th, the Bill to amend an act to provide a homestead exemption from Dawson County Advalorem Taxics for County purposes, House Bill 824 by Representative Wade of the 9th and Chastain of the 7th, the Bill to close for new applications, certain homestead exemptions. For senior citizens from Dawson County Advalorem Taxes for County purposes or educational purposes. House Bill 825 by Representative Washington, 144th, airing of the 145th, the Bill to amend an act to reconstitute the Board of Education of Monroe County, House Bill 826 by Representative Miller of the 62nd, Park of the 107th, Smith of the 18th, Friday of the 120th, work eyes of the 157th, a bill related to imposition rate, computation exemptions, and credits for state income tax, House Bill 827 by Representative Queen of the 61st, the 51st, the 52nd, Miller of the 62nd. By Representative Queen of the 61st, Roberts of the 52nd, Miller of the 62nd, Evans of the 57th, Will of the 55th, another, the Bill relating to selling another trade practices, House Bill 828 by Representative Park of the 107th, Hugh William of the 141st, Miller of the 62nd, Friday of the 120th, Williams of the 168th, and others, a bill relating to income tax, House Bill 829 by Representative Beckles of the 96th, Hugh William of the 141st, Friday of the 120th, Williams of the 168th, Florida of the 74th, and others, a bill related to elementary and secondary education, House Bill 830 by Representative Mark of the 187th, Beckles of the 96th, Florida of the 74th, Friday of the 120th, Williams of the 168th, thousand of the 65th, and others, a bill relating to insurance, House Bill 831 by Representative Beckles of the 96th, Hugh William of the 141st, Friday of the 120th, Williams of the 168th, Florida of the 74th, and others, a bill related to elections and primaries, House Bill 863 by Representative Reese of the 140th, Matthew Covey, and the second Smith of the 41st, Ridley of the 6th, and Barry of the 56th, a bill related to state purchasing, House Bill 864 by Representative Sanchez, and the 42nd Taylor of the 92nd, Friday of the 120th, and the holiday of the 116th, coming to the 39th and others, a bill relating to acquisition and loss of property, House Bill 865 by Representative De89, Draper of the 90th, Willis of the 55th, Oliver of the 84th, and LaLia of the 59th, a bill relating to elections and primaries, House Bill 866 by Representative DeFitt, Taylor of the 173rd, Hawkins of the 27th, Cooper of the 45th, Newton of the 127th, a bill relating to the Department of Community Health, House Bill 869 by Representative Gamble of the 15th, and Scott of the 14th, a bill to amend the 188th, and not creating establishing a joint airport authority for the City of Carter's Rail of Barthole County, House Bill 870 by Representative Neal of the 79th, Bill 75th, Scott of the 76th, Douglas of the 78th, Borne of the 74th, and others a bill to provide a hope to say exemption from Clayton County, Edgelome, Texas for County purposes, House Resolution 712 by Representative Park of the 107th, Hugh Glee of the 141st, Miller of the 62nd, Friday of the 122nd, Williams of the 168th, and others, a resolution creating a House Study Committee on protecting working families, House Resolution 713, by Representative Wade of the Ninth, Hill, Cox of the 53rd, Clefton of the 131st, Williams of the 55th, Chastain of the 7th and others, a resolution urging healthcare providers across the state of Georgia to help promote the 988 suicide and crisis life line, House Resolution 751 by Representative Crow of the 118th, Washburn of the 144th, Pairing of the 145th, a resolution recognizing Mr. William A. Fickling Jr., and dedicating a bridge in his honor, House Resolution 809 by Representative Don Chichy of the 105th, a resolution honoring the life of officers, Scott Osborne, Riner, and dedicating an intersection in his memory, House Resolution 819, a resolution 810 by Representative Gellied of the 162nd, a resolution recognizing Mr. Benjamin R. Polo, Sr., and dedicating an intersection in his honor, House Resolution 811 by Representative Gellied of the 160nd Resolution, recognizing the life of Reverend Dr. Benny R. Mitchell Jr., and dedicating a bridge in his memory, House Resolution 812 by Representative Gellied of the 162nd, a resolution recognizing the life of Coach Carl Middleton, and dedicating a bridge in his memory, House Resolution 813 by Representative Astralia of the 104th, Don Chichy of the 105th, Burns of the 159th, a pitch end of the 161st Crow of the 118th, a resolution honoring the life of Trooper Jimmy Sonskar and dedicating a bridge in his memory. House Resolution 814 by reps and a crowd of 118, Washington, Washington, 144th Resolution recognizing the honorable Susan poems and dedicating a rodent in her honor. House Resolution 815 by reps and a Jones of the 25th Kendrick of the 95th, ultimately the 101st Cox of the 28th Corp of the 174th and others. Resolution creating the House Study Committee on exploring the potential for human needs and robotics in Georgia workforce development. House Resolution 816 by reps and a Hilton of the 48th, P3 of the 166th. 4K is the 157th, DEMSE of the 13th, Cooper of the 45th and others. Resolution creating the House Study Committee for at-risk populations of use registry. House Resolution 817 by reps and a Clark of 100th, Bonner of the 73rd, Jones of the 25th, Crow of the 118th, Clums of the 12th and others. A Resolution creating the House Study Committee on Governmental Use of Drones and Unmanned Aircraft from 4 in the 3rd series. Senate Bill 332 by Senator Jones of the 10th and James of the 28th, though to amend and actually create an established into Camp County Georgia district from which the members of the county board of the education of the Camp County shall be elected through second graders. The reports of standing committees, Mr. Clerk, will you read? Representative Beth Camp, the 135th District Chairman of the Committee on Intergovernment and Coordination Locals submitted the following report. To speak to your committee on Intergovernment, Coordination Locals, head on due consideration following bills of the House and the Senate and instruct committee reports, same back to the House and following recommendations. House Bill 709, New Pass, House Bill 779, House Bill 799, New Pass, House Related to 1, New Pass, House Related to 2, New Pass, Senate Bill 2062, House Bill 301, New Pass, by substitute, House Related to 3, New Pass, House Related to 5, New Pass, House 8, New Pass, House 8, New Pass, respectively submitted Representative Beth Camp, 135th District Chairman. Representative Tyler Paul Smith of the 18th District Chairman of the Committee on Judiciary Non-Civil Submitted to Following Report, Prescreek Your Committee on Judiciary Non-Civil has had under its consideration following bills of the Senate, because its instructor made the report, same back to the House and following recommendations. Senate Bill 132, due pass by committee substitute, Senate Bill 244, due pass by committee substitute, respectively submitted Representative Tyler Paul Smith of the 18th District Chairman. Representative Allen Powell of the 33rd District Chairman of Committee on Regulated Industries, submitted the following report. To speak to your committee on Regulated Industries, Senate Nurse Consideration, following bills of the Senate, sister committee reports, same back to the House and following recommendations. Senate Bill 254, due pass by committee substitute, respectively submitted Representative Allen Powell of the 33rd District Chairman. That completes the reading of the report's standing committees. Okay members, we do have a local calendar this morning. We have a local calendar, so I'll ask you to come to your desk. Four bills on the local calendar relate to homestead exemption and require, as you know, a recorded two-thirds roll call vote for passage. This will be our third reading and passage of the uncontested local calendar. If there is no objection, we will vote on the local calendar as a whole with a recorded vote. Hearing none is ordered, Mr. Clerk, will you read the local calendar? House 709 by Representative Anderson, the 10th City of Demarist, House 709 by Representative Deloitte, 167th Long County, House 801 by Representative Deloitte, 167th Long County, House 802 by Representative Kelly, the 16th City of City of Cedar Town, Senate Bill 206 by Senator Summers, the 13th City of Ashburn, City of Douglas City of Fitzgerald, City of Oscello, City of Tipton, Senate Bill 331 by Substitute by Senator Dixon to the 45th City Winder in Barrow County. House 1803 by Representative Hatchett to the 150th City of Dublin, House 1805 by Representative Hatchett of the 150th City of Dublin, House 1806 by Representative Brodze, the 127th local fourth county, House 1807 by Representative Thomas, the 21st City of Woodstock. Is there any objection to the previous question being ordered on the local calendar? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bills? Hearing none, the report of the committee has agreed to. These bills now pass. All those in favor of the passage of the bills on the local calendar will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted on the local calendar? All members voted this so. Mr. Clerk, will you lock the machines? On the passage of the bills on the local calendar, the yeas are 160, the nays are zero. These bills have been received at requisite, constitutional majority or therefore passed. Members, if you will please come to the floor, take your seats and cease conversations. We're going to move forward with an invite resolution, a pretty special invite resolution. Who's going to honor someone who has done a great job in the position to she holds for our friends in Israel, but I can tell you on a personal basis, she's going to be able to be young. And as we deal with many issues here, but especially with Hurricane Elaine, and ensuring that\n\nGeorge and Zoller with his state were supported. But I'll let somebody else tell that whole story. But I want to say now, thank you. Council general for that support. Mr. Clerk, will you read a caption to House Resolution 417-417? House resolution 417 by Rep. Zoller was panicked to the 51st, Cox of the 28th, the train of the 80th, Carson of the 46th, Cummings of the 39th and others, a resolution, honoring and commending a nod, Sultam Dadawn, Council general of Israel with the South, Eastern United States, for example, resurfacing, strengthening the bonds between the state of Israel and the state of Georgia, and for a steadfast friendship to the people of Georgia. Thanks to Representative Panage and Representative Cox for bringing this resolution, more recognized Rep. Panage to speak to the resolution, Rep. Panage. Thank you, Mr. Speaker. Today, on behalf of Representative Cox and the Georgia Israel Caucus, we gather with hearts both hopeful and selfishly heavy. A night, your journey among us has been more than a chapter in our community story. It's been a beacon of light, illuminating our shared traditions, values, and connections. From the moment you arrived, you brought us not just your leadership, but your entire self. You've been a bridge between our local community and the broader Jewish world, particularly our beloved Israel. Your unwavering dedication to strengthening communal bonds have left an indelible mark on all of us. As you prepare to return to Israel, know that you carried with you, not just memories, but the deep respect and love of the Jewish community and the non-Jewish community. While geographical distance may separate us, the bonds of Mishpah, family, transcend any miles between us. Let he draw out Khavera Shalanu until we may again, my friend, our friend, may your path be blessed, may your new chapter be filled with joy, and may you continue to be a source of inspiration wherever you go from strength to strength, Shalam, and safe travels. And thank you. Thank you. Thank you. Speaker Burns, members of the Georgia House of Representatives, Shalam, and good morning, it is an incredible honor to stand before you today in this chamber, a place where Israel, the Jewish people, and I personally have been blessed with so many friends. Six years ago, when I received my appointment to this role, I learned that Georgia is known as the Peach State. An interesting fact, but not what first comes to mind when I think of Georgia today. Having lived here over these years, I've learned that Georgia is in so many ways America at its best. The growing number of people who choose to make Georgia their home have apparently come to the same conclusion. And as for being an Israeli in Georgia, I cannot count the number of times when I've been asked where I'm from and upon seeing Israel. I've been met with a huge smile and a warm embrace. That warm welcome that I received in Georgia is true for this house as well. Speaker John Burns, thank you. Thank you for your leadership, for your friendship, and for your support. And I also want to take a moment to acknowledge the late speaker, David Relston, of Blessed Memory, a true friend of Israel who support and friendship will not be forgotten. Representatives Esther Panich and Brent Cox, my dear friends, and co-chairs of the Georgia Israel Legislative Caucus. Thank you for your friendship, for your commitment, and dedication to ensuring that the bond between Georgia and Israel remains strong, vibrant, and bipartisan. The bilateral relations between Georgia and Israel span across many areas, trade, academia, technology, and innovation, culture, and more. These ties continue to strengthen and grow because they are built on a partnership that benefits both our peoples, grounded in our shared values of democracy, freedom, and humanity. Over the years, this house has passed numerous resolutions in support of Israel and our bilateral relations, as well as bills aimed at addressing and combating anti-Semitism and discrimination against Israel. To all the sponsors and supporters of these measures, especially those passed in the wake of October 7th, I would like to extend my deepest gratitude. These expressions of solidarity and moral clarity have been a source of strength and a reminder that we are not alone. This chamber has also extended its southern hospitality to many Israeli guests and speakers, including hosting hostage family members and survivors of October 7th, as was just done yesterday. Thank you for opening your hearts and minds to their accounts. There are still 59 hostages languishing in Gaza, and we cannot rest until every single hostage is home and reunited with our loved ones. Thank you. Thank you. Thank you. Alongside the hardship, there is also room for hope, for better days ahead, for Israel, and for all of us, because we share not only pain and concern, we also share a spirit of resilience, and a commitment, not just to hope for better days, but to work together to make them a reality. As I prepare to conclude my tenure in this role, I do so with immense pride in all that we have accomplished together and with deep appreciation for the friendships that I will carry with me always. To the many friends that I will leave here in Georgia, I look forward to seeing you in Israel. Thank you for the honor of working with you. May God bless you. May God bless the great state of Georgia. May God bless the state of Israel. Thank you. Thank you. Thank you. You have been missed. You have been missed. Thank you. Thank you, members. Councilor General, you have, you have enriched our lives and our relationship in the union that exists between the United States of America, the state of Georgia, and Israel, most important to the people. Of their forementioned, if you will, we respect you. We will miss you. You've become a part of our family thanks to the members of this body for supporting you and supporting Israel. Does it go in noticed? It's not about the three of us that are part of this body here, but it's about all of these members. It's about you, the values you bring, and your unrelenting support for Georgia and the values you stand for, what Israel stands for, and what we stand for as Georgia's. Thank you. Safe travels to you. May God continue to bless you and we just want to welcome you back to Georgia anytime. So we're going to miss you. Thank you for your service. The Council General will be with us for a few more moments. She's joined to be in the south any room if you would like to join her for a conversation in a photo. That would be the proper place and the proper time. So thank you, Council General. Thanks for the resolution members, and thank you members for your attention. We have some morning orders now members. We have about a third of what we had yesterday. We only have 50 or 60. We don't have 201. So it's not quite that many, but we have some great folks that are here with us that we need to recognize in the gallery. We're going to get started with that. I'm going to ask you to probably take a minute or two minutes maximum if you will, members to share your thoughts and encouragement those here with us. They will begin with representative David Huddleston and some friends who are going to be here to recognize some folks from West Georgia. So if you're a fan of the West Georgia cheer team, I would hope you're joining David Huddleston. The gentleman's recognized. Thank you, Mr. Speaker. Members, do thank you all for allowing us to be here today. We want to congratulate and recognize the University of West Georgia cheerleading program for its continued reputation and of excellence and global recognition as a dynasty with 35 total national championships for all girl and co-edged squads from 2001 to 2025. The University of West Georgia all girls and co-ed teams recently completed against top ranked teams across the nation at the University Cheerleaders Association National College Championship in Orlando, Florida. With a small co-ed squad, the large co-ed squad, the all girl squad and the all girl group stunt squad bringing home the Division I national championships. Both the all girl and co-ed squads exemplify extraordinary talents in their roles as stood at athletes through excellence and academics and contributions to the University and the community on and off the stage. Many of them are present here today. This is to the cheerleaders themselves. Now, therefore, be it resolved by the House of Representatives that the members of this body command the University of West Georgia cheerleading program on its legacy and excellence and to extend the sincerest best wishes for continued success. Y'all please stand for what we recognize you. Congratulations ladies. That's quite the boy. What a record. Y'all are good. Thanks for being here with us and thanks for your hard work. I know that is a very, very, very difficult tradition to uphold. Thank you for what you're doing and continue success to you. Thanks for taking time to come over and be with us. We're proud of you too. Congratulations. Congratulations. The RIPZP's Dependent is recognized for a morning order. Good morning again. I'd like to recognize and commend by this resolution the Atlanta Jewish film festival for 25 years of artistic and cultural excellence and other purposes. If you all would stand so you could be recognized from the Jewish film festival. We have Kenny Blank, Amy Arno, Liberty Lafferty, Mark Putnam, Justin Gottlieb, Sarah Davenport, Brennan Dicker, and Kaelen Baronhoud. And from the American Jewish Committee, Sam Halburn, Jacob Robo, and Alex Harrell. Please welcome them to the People's House as we celebrate the 25th anniversary of the Atlanta Jewish Film Festival. Please meet me down in the speaker's office. Thank you all for being here. Okay, Atlanta Jewish Film Festival. Congratulations. Hope everything goes smoothly. Our RIPZP's McDonald. Would you lead a group of folks to hear from a West 4-South? Let's see, we're going to have Representative Koch from the Todd Jones, David Clark, Representative David Clark and Representative Rick Jasperist joined the gentleman in the well. Gentlemen Lauren McDonald's recognized to speak to the group this year and give us some great information. Mr. Speaker, ladies and gentlemen, House, I know we said we're going to have a short calendar day and didn't have many morning orders, but as you can see, we're going to be here a while. So if you buy a needs to get coffee, feel free to do so during this morning order. We have eight high schools in Forsyth County. So we all brought them down together. These are our state champions in the 2024 early season this year. And so as I call out your names, please stand up in the gallery. I've got the West 4-South High Boys for about 100 freestyle champs, Colton Carter, Nathan Fedky, Kate Anderson, and Tom McQuinn. From Lambert High School, I've got the state champion individual cross country, Jackson Hock said, from Lambert High. I'm kind of a Lambert's kind of special to me since my daughter Hayley goes there. So I want to say hook them horns. So thirdly, I've got Adder Spingner from her state championship and girls 100 meter fly. Will you please stand? And then I've got Ty Hiboe for his 2020 for heavyweight boys wrestling state championship. All I can say guys and ladies enjoy your spring break. Once you get out of here, you deserve it and you get a week off. The embankment's finished up this year. After Representative Cox makes his presentation, if we'll come down to the third four outside the speaker's office for some photos. Representative Cox. So I would like for all of the athletic directors and coaches and anyone teachers. If you would stand as well from Versailles, that'd be great. Thank y'all for your service. Y'all, y'all remain standing. All of the athletes that came down, all of y'all please stand as well at this time. I'd like for everybody to show. Thank you. If y'all would remain standing, so I'm going to try to rifle through these. Okay, so these are team state champions 24, 25 East Versailles, East Sports, Super Smash Brothers, Ultimate State Champions, 2024 Versailles Central, Hot Rodders of Tomorrow, National Champions, we placed first, fourth, fifth, and 18th, I believe if I'm correct. North Versailles Competition cheerleading team, State Champion, pretty special group that backed the back state championships, um, in Coach Wood and Coach Abby Smith and then Coach Reed Jackson and then Coach Reed Jackson's father helped me get into coaching high school football ironically enough. 2024 Denmark High School Cross Country State Champions, then from an individual state champion standpoint, we have one act play state champions and also the literary, literary state champions in dramatic interpretation, which is a Christian, Repey and Gavin Harlett, I believe it's Harlett. From Versailles Central, we have GHSA 7A State all around gymnastics, competition bars and floor, uh, Katie Andrews, who's also a 2024 national qualifier, 2024 GHSA Gymnastic State Champion, Logan, forgive me here, Oteza Balance Beam, 2025 GHSA Jackson Moffitt State Champion, second, straight state champion in 170 pound class for wrestling, 36 and two record with 25 pins, East Versailles High School, 2025 wrestling, Artemis Eaton Girl State Champion wrestler from North Versailles High School, 2025 East Versailles State Champion in diving, a manual pits, all American consideration diver as well, 2025 North Versailles, O and Cooper in the 50 and 100 meter freestyle state champion in swimming, I would like to thank all of you that are here, we appreciate what you do in representing our county and continue to do great things and enjoy your spring break. We'll be down here after. Thank you, Mr. Speaker, we yield the well. Oh, they win in more. Hey, you can never win too much, can't you? Can you? Hey, congratulations. What, do you want a great storyline, administrators and students? Thank you for what you're doing and keep doing what you're doing. Reptility Beckles and others, thank you, friends, coming with her, representing Beckles. Recognize from Morning Order. Thank you, Mr. Speaker, and I promise I'm not going to be as long as my colleague, but I do have six resolutions. I like to recognize the North Cross historic business association for their contributions to the City of Narkross. If you would please stand. There are two nonprofits that have been supporting the City of Narkross for several years, and I'd like to recommend that this house considers giving the Goods to Margin Health Centers of Gwinnett a warm welcome. Thank you. Lastly, from Morning, the North Cross Court Ministries, they have been instrumental to residents of the City of Narkross over the past several years. He made me do it. Recognizing the National Vidaloggo Foundation, this group is instrumental. This group is instrumental in establishing online and offline communities, offering five resources to individuals with Vidaloggo. Thank you. And we wanted to recognize beyond the ribbon. It's a nonprofit group supporting cancer patients and their families since October of 2017 supporting children and rent utilities. And I wanted to recognize Bobby Maneag up there. And thank you so much for all your work. And finally, we have Joy Monroe, single parent alliance. Thank you so much for visiting with us today. If you could please come down to the anti-room for pictures. Thank you, Mr. Speaker. We are well. City of Narkross and all the nonprofits. Thank you for what you're doing. You're doing great work. We appreciate it. I'm sure the people there are ready to do that. If you're coming down to the third floor and come that any room, they'll have some photos with you. So thanks for being here with us. Thank you members. Representative Gay Bakoye, Representative Koye, recognized for Morning Order and Friends. He's bringing Representative Adina with him. And more more friends. Representative Koye. Thank you, Mr. Speaker. I'm sorry. Ladies and gentlemen. I rise to recognize a different of Mane and Shegun. He is an internationally renowned plastic surgeon. Sorry, you might need to have his number when I'm done. Yes, just kidding. But he is the president of the Georgia Society of Plastic Surgeons, the CEO of Georgia Plastic and Reconstructive Surgery, the president of Georgia Plastic Foundation and the president of Ampa Foundation. Ladies and gentlemen, Dr. Stanley O'Courer, please stand to recognize. They call him the Boat Eye Doctor. Please come on down to the anti-room on the third floor for pictures. He also has served us in our Navy, a proud surgeon in the Navy saving many lives. And also, he's an author. He wrote the book, Resilient Butleth. Please give him a round of applause. Thank you, Mr. Speaker. Thank you, members. Thank you for your service. Thank you for caring about your neighbor. We're representing Virginia. You're recognized for Morning Order. And friends. And friends. Thank you, Mr. Speaker. Today, I recognize the Georgia Haitian American Chamber of Commerce. Could they please rise? They're committed to the advancement of economic and cultural advancement of Haitian American community in Georgia. They established Erie Tosh, a visionary program designed to train, recognize businesses in Georgia, and provide scholarships for high school grads of Haitian descent. This organization has been very active in our community and they celebrate one of the most famous events that they host the Haitian Flag Day and they'll be hosting that in the City of Forest Park on May 18, 2025. Let's recognize and please welcome them to our house, the Haitian American Chamber of Commerce. Please meet us downstairs in the Anzirum. Thank you, Mr. Speaker. I you're the well. Representative, Representative baseball and friends are recognized for Morning Order. Okay, I thought I had more friends but we lost a strong one there right by you. She's strong. So you're doing good. Thank you, Mr. Speaker. You going to come stand with you? Yes, please. So I stand today to acknowledge along with some of the other South Metro women, our South Metro men. Today we are honoring them because they empower 5,000 community members with a focus on 500 black men to take control of their health and wellness through comprehensive screening, education, and resources while fostering a culture of prevention, early detection, and community support. Their vision is to save lives and powers families foster community engagement, promote health equity, and inspire positive change. They will be downstairs at 11 o'clock in room 216 and please go visit and have a chat. We all need to concentrate on our health, especially you men that don't like to go to the doctor. Thank you, Mr. Speaker. Our chair Lady Hagen recognized for Morning Order. Thank you, Mr. Speaker. I have the honor today to recognize a young lady in that lives in the district I represent for some incredible service and leadership that she showed. Rylan Rogers is a dedicated citizen of Wheeler County and stand out student at Vidae Heritage Academy and a true example of servant leadership. Immediately following Hurricane Helene, she was active in disaster relief efforts, including organizing food and supply distribution points, creating and managing social media to keep her fellow residents informed and supporting displaced families. Rylan went above and beyond to help those in need and showed true compassionate leadership. I ask my colleagues here to join me in recognizing Rylan because they saw her in action when they generously delivered much needed food and supplies to her hometown in the week following the Hurricane. Rylan is joined in the gallery. If you'll have a please stand. Rylan is joined in the gallery by her parents Eve and Resty Rogers and I hope y'all will join me in celebrating this this truly amazing young woman in the works that she's already done to show compassionate leadership and I look forward to seeing everything you're going to do in the future for your community for our great state. Thank you, Mr. Speaker.\n\nI'm glad you came here today so we could tell you thank you for all you've been doing and what the future is for you. We appreciate you and we thank you for caring about your neighbor. It's good to have your parents as with you as well. Looks like they instill some great values in you. Thank you all for being here. Leader, illustration, we recognize more. I'm on in order. Thank you, Miss Speaker. Would the members of the Georgia Association of College Republicans please stand? So we're here today to recognize the great work that the GACR does with the chairman, Emmanuel Arnays and the officers and members from all across state. GACR provides leadership at camps throughout our state that allows students to engage in political involvement, involvement in campaigns and action and speaking out on their campuses. So thank you all for being here and members if you're willing please join me in a round of applause for these outstanding students. Thank you, Mr. Leader. Thank you for young leaders. That's what it takes to keep this thing going so we appreciate your involvement and engagement and thank you for being here with us today. Reptile of LIM, say Marvin Lim. How about Representative Derek Jackson? We just discovered a great efficiency we had in morning orders this morning. So members, that concludes our morning orders. Members, we'll move on to our rules calendar. We're going to take up an agree as our first order of business this morning. We're going to recognize Representative Lehman Franklin for motion. Mr. Speaker, I move to agree to the Senate substitute to House Bill 428. Mr. Clark, will you read the caption to House Bill 428? House Bill 428, Mr. Franklin, in the 160th to be titled act to men chapter 1, title 31 of the fish go to George Rannon, that is relating the general business regarding health. So it's the codify the right to in vitro fertilization for individuals. Representative Franklin is recognized to explain the Senate substitute. Thank you, Mr. Speaker. Colleagues, I think fundamentally there's been very minor changes in this bill, but I want to go over it to you. There's been two slight changes and basically it's just the changes to words or legalese on it. The first one is moving from embryos to embryo to embryos, which I'm told legally doesn't have any effect, but that it does just clear up some of the language there. The next is on line 26, where we've taken out the right to and instead replaced it to not to prohibit or prevent an individual from obtaining vitro fertilization. Mr. Speaker, that's the bill. I'll take your questions. I've needed Jim. Will you request a part canon to your left as recognized for a question? Thank you, Mr. Speaker. Do you yield? I do. Can you explain why we have to keep writing the word female in this bill when we're discussing genitalia? I don't know if I can explain that or not. That's the way it was written. But there's a male and a female, and a female has the ovaries, so I guess that's why I just put that in there. Further inquiry? Do you need to stand for a question? Must I? Yes, ma'am. Yes, sir. So would you agree that it's redundant? I don't think it's redundant. I think it needs to be put in there. It's my bill. I put it in there. Gentlemen, ask no further questions. Okay, with that, Mr. Speaker, I yield the well. On the gentleman's motion that the House agreed to the Senate's substitute to House Bill 428, 428, all those in favor will vote yes, those opposed will vote no. And Mr. Clerk, will you unlock the machines? Have all members voted? All members voted? If so, Mr. Clerk, will you lock the machine? On the gentleman's motion, the yeas are 160. The nays are zero. This House has agreed to the Senate's substitute to House Bill 428. Congratulations to the Franklin's and to this House. Mr. Clerk, will you read the caption to Senate Bill 180? 180. Zero. Senate Bill 180 by Senator Dixon, the 45th and others to be entitled to act to amend Article 7 of the Channel for 4 titles 20, the official go to Georgia and it's either late in high demand apprenticeship program. Those are applied opportunities for apprenticeship sponsors, tender to apprenticeship program contracts, with a state board, the technical college system of Georgia, Ms. Bill Emmerford, the committee on a higher education committee recommends that this bill do pass. Representative Mad Dubneck is recognized to speak to the bill. Representative Dubneck. Thank you, Mr. Speaker. Ladies and gentlemen, the high demand apprenticeship program was initially created by Senate Bill 379 three years ago and the purpose was to incentivize apprenticeship sponsors to establish new or grow existing apprenticeship programs in Georgia. Last year under Chairman Hickman's leadership, the program was amended to make some improvements. Currently only businesses are allowed to apply for this. We're simply adding apprenticeship sponsors to this because given the demand like many of our industries including construction have seen in their growth around the state, we just want to support more apprenticeship spots. Ms. Speaker, that's the bill. gentleman has a question, you hear for a question? Yes, sir. Minority leader Hewglie's, you recognize for a question. Thank you, Mr. Speaker, does the gentleman heal? Yes, ma'am, for sure. Does this allow for unions to take on these apprenticeship programs? That's something that we've been asked about in the past. Will this do that? So we're looking for trade associations and things of that, excuse me, and organizations of that nature, when you start to think about some of the contracting associations that are out there, yes, we absolutely want to include them and empower them with the ability to foster apprentices. Gentlemen, you have another question? Yes, sir, one more. Representative Gullet, Councillor Cuner-Hulles, does the recommendations for a question? Jim Maniel? Yes. Isn't it true that this will enhance the effectiveness and responsiveness of the apprenticeship program and meet the evolving needs of Georgia citizens? Absolutely, I couldn't have said it better myself. Mr. Speaker, with that, I'll ask for this body's favorable consideration. I'll yield the well. Is there any objection to the previous question being ordered? The gentleman's yielded the well here and none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here and none the report of the committee's agreed to. Shall this bill now pass all in favor of passage the bill? We'll vote yes, all those opposed. We'll vote no. And Mr. Clerk, will you unlock the machine? All members voted. All members voted if so, Mr. Clerk, will you lock the machine? All in the passage of Senate bill 180, the yeas are 158, the nays are zero. This bill under the seat of requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption of Senate bill 245? Senate bill 245. Senator Hodges of the third and others to be entitled not to amend code section 1973. Are these fish go to Georgia and attend it relating to actions by grandparents or other family members from visitation rights or intervention? Ms. Bill Emmer, refer to the committee on judiciary. That committee recommends a disbilled doop pass by committee substitute. Thank you, Mr. Clerk for representing Townsend. He has recognized to speak to the bill. Thank you, Mr. Speaker. This is a grandparent's bill. I appreciate it, it's your work and heart on this. It is a substitute to the original bill. This basically will allow grandparents who already have visitation rights for the grandchildren to ask for revision at the maximum of once every two years. This is based on whether there was incarceration, a death of one of the parents or a disability, basically in compensation. So that's the gist of the bill. It was revised. I appreciate the hard work and judiciary looking into this and this is basically the bill. And I will yield any questions, Mr. Speaker. Representative Jones to your left. President, these Jones has a question. Ladies, recognize. Okay. Thank you. Thank you, Speaker. That's a gentleman yield. Yes. Is it not true that this bill provides grandparents with a legal avenue to seek visitation or modify existing visitation orders, especially under challenging family circumstances like death in capacity or in incarcerated parent and that it further clears and it, excuse me, and it further requires grandparents to present clear and convincing evidence that visitation is in the child's best interest. Yes, from what I can tell, yes, that's actually true. You're left. I'm sorry. A little bit to the back. I'm right here. Thank you. I'm sorry. There you are. I want to thank you for this much needed bill because it will immediately impact a situation that my mother is having right now with seeing the children of my late sister who now resides with their father's mother. Thank you. I appreciate you supporting. Appreciate that inside as well. Representative Glaze is recognized for a question. Representative Glaze, pardon me, to increase. There would be a question to your left. Is it not true that I lost my son five years ago at 41 and he left a daughter at 12 years old and this bill will continue to help as her grandparents to continue to support her as she continues to grow. Thank you so much for bringing this bill. Thank you, Representative. I'm sorry for your loss. Gentlemen, has no further questions. Thank you, Mr. Speaker. I yield the well. The gentleman has yielded the well. Is there any objection to the previous question being ordered? Did Chair here's none of the previous questions ordered? Is there any objection to adopting the Committee's substitute? Here in none, the Committee's substitute is adopted. Is there any objection to agreeing to the report which was favorable to the passage of the bill? Here in none the report the Committee's agreed to. Shout this bill now passed. All in favor of the passage of the bill will vote yes. Those opposed will vote no and Mr. Clerk will you unlock the machine? All members voted. All members voted. All members now voted this so, Mr. Clerk, will you lock the machine? All in the passage of Senate bill 245 the yeas are 160 the nays 1. This bill, Henry C. The requisite constitutional majority is therefore passed. Mr. Clerk, will you read the caption to Senate bill 44 or 44? Senate bill 44 by Senator Watson, the 11th and others being titled an act to amend Code Section 22165 the Fist Go to George annotated relating the equalization grants, annual calculations and allocations. This bill I've referred to the Committee on Education that Committee recommends that this bill do pass. Representative Chaz Cannon is recognized to present the bill who represented Cannon. Thank you, Mr. Speaker. Senate bill 44, my apologies. We put a lot of work in this bill over the last two years. It passed this House near unanimously last year. It got through Committee of this year unanimously, passed the Senate unanimously. As a quick refresher about the bill, it does simply lower the threshold for equalization eligibility from 14 down to 10 mills. It doesn't change the formula for equalization. It doesn't change the formula for QBE. It doesn't change the local five mill share. It would allow but not require very permissive. It would allow not require a local system that receives equalization to roll back to millage rate over time to a new minimum threshold of 10 if they so choose to do so. But this is also a new provision we added in this year after working with the pro-tim. The bill includes a penalty for those school systems who sometime in the future might roll back their millage under the new proposed threshold of 10. So there is no penalty in the code today. So if the school system goes below 10, they get a 25 percent penalty on their equalization. That's a pretty big stick. So that's basically the bill. Appreciate the help of the education chairman pro-tim and I'll take any questions Mr. Speaker. Gentlemen has a couple of questions. Chairman Corbett to your right. Is recognize for a question? Thank you Mr. Speaker. It's gentleman you. I yield to my friend. You mentioned we passed this bill last year in this House. Is that correct? That's correct. Man, gentleman knows what he speaks. It's great, great bill. It's not further proof that the Senate has trouble coming up with individual ideals on their own. That is correct. Thank you for the bill. Thank you. Easy on the Senate. We got a couple bills over that we need passing right now. We'll talk about them in private. Just saying, RIPC Irwin is recognized for a bill to you. Excuse me for a question to your right. Thank you Mr. Speaker. Does the gentleman yield? I yield to my seatmate. Does this bill continue to allow Board of Education to continue to set appropriate rates in a time when our property taxes are increasing? It does. Thank you for this bill. Gentlemen, has there further questions to speak? I yield to well. Gentlemen, is yield to the well representative Martin would like to let us know about his opposition to the bill. Chairman Martin. And gentlemen is recognized. Thank you Mr. Speaker. Members, no one ever opposes the opportunity for people to pay the less for the on their tax bill. I stand here today. Each and every one of us represent our own area and our own constituency. 180 counties over 400 cities. I respect the representative for his opinion and I'll respect everybody's votes for this bill. I want to tell you why I have paws with the bill. The QBE formula, even for somebody that did math pretty well in high school, is a far pale. It's very complicated and it stands on many pillars for its calculation. And what I stand before you today and what all for is this is one of the pillars on which it stands. I stand today and tell you that I think we need to look at the QBE formula in total, in overall. And I fear that if we allow some counties to go for their maintenance of effort from 14 down to 10 mills, when we start having that discussion about QBE counties with larger populations such as my county that has a 17 over 17 mill rate and contributes to the QBE formula may it be in a position that they would have to contribute more. So I want us to work together as a state. I'm fortunate enough to serve at the speakers pleasure and with my members in this body and post-secondary education to work with TCSG in the university system and we work hand in glove with our K-12 system. So it's not in opposition to people paying lower taxes that I stand today, but instead to work us toward a review and a reworking of a very complicated QBE formula that stands on multiple pillars rather than to just adjust one, which when that time comes to adjust that in the future may cause a bit of inequity relative to the tax base and the tax contributions of all of our Georgia. So with that I just want to explain my pause with the bill and again I respect each and every member of this body as I always have for voting your conscience in your district with that Mr. Speaker I yield the well. Thank you Mr. Chairman, he's yielded the well. You have an important question I'll say if I can get him back. General's yield the well always respect your insight and opinion Mr. Chairman that concludes our comments on SB 44. Is there any objection to the previous question being ordered hearing none the previous question is ordered? Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report of the committee's agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and Mr. Clerk will you unlock the machine have all members voted all members voted yes so Mr. Clerk will you lock the machine on the passage of Senate Bill 44 the yeas are 138 the nays are 23 this bill haven't seen the requisite constitutional majority is therefore passed Mr. Clerk will you read the caption to Senate bill 147 Senate bill 147 by senator red into the 33rd and others to be entitled to enact two men article three chapter five on top of four to the fish go to George annotated relating to conditions the detention generally relative to correctional institutions of states and counties this bill ever referred to the committee and public safety and homeland security that committee recommends that this bill do pass by committee substitute chairman workhizer is recognized present Senate bill 147 chairman workhizer thanks picker this is an effort that we worked on last year and it's a continuation of that and it's to help our inmates who are exiting the the system after completing their senate and having come pay their debt to society the department of corrections and conjunction with the department of driver services is going to provide a list of items to help them for future employment one would be a state issued ID or driver's license any program or treatment certificates any vocational training records work records certified copy of a birth certificate Social Security card a resume showing trades and and documentation of practice job interviews and then any notification that the he or she would be eligible for any occupational license certificates and then there's some reasonable exceptions for and that's the bill and I would stand for any questions gentleman has a question if you'll represent the prior to your left down front does recognize for a question thank you mr. picker's gentleman you absolutely in the tree that I really appreciate you bringing this bill to us that I'm involved in a similar program that I started at the Clark County jail where we take ladies that I have taught construction to on how to build houses and try to get them jobs in the construction field and this is something that I've been looking at for a very long time and I really do appreciate the state stepping in and making sure that we can get our hard to hire individuals back to work thank you very much I appreciate that in an environment where employers looking I really appreciate your efforts and passion and I appreciate your support with that mr. picker how you the well and ask for your considerable favor favorable consideration gentleman's yield to the well is there any objection to the previous question being ordered here in none the previous questions ordered is there any objection to adopting the committee substitute here in none the committee substitute is adopted is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill hearing none the report the committee's agreed to shout this bill now pass all in favor of the passage of bill will vote yes all those opposed will vote no and mr. Clerk will you unlock the machine you have all members voted all members voted yes so mr. Clerk will you lock the machine on the passage of senate bill 147 the yeas are 163 the nays or zero this bill having to see the requisite constitutional majority is therefore passed chairman petri is recognized for a motion chairman petri thank you mr. speaker I move that we accept the senate substitute house bill 584 this measure as you recall is we'll let you we'll let you explain it in just a minute we're going to have the clerk to read the caption first oh sorry mr. Clerk will you read the caption house number 584 by rubs and a petri the 166 another is to be titled an act to a mentalist 2631 37 of the fish included Georgia annotated relating to food drugs and cosmetics health and mental health chairman petri is recognized to explain the senate substitute all right mr. speaker as i was saying so this the senate substitute hb 584 this measure was brought by these are the this is a department bill by two departments department of community health department of behavioral health and developmental disabilities we're moving some regulated facilities that are routinely under dbh dd from regulation by dch over to dbh dd that would include facilities like community living arrangements for individuals with intellectual disabilities and as you'll see in the bill kind of itemized also facilities that deal with substance abuse and so forth the changes that were made in the in the senate are very simple they are all in section 3 we caught this after it left the house the departments realized that we had not moved some mandatory reporting provisions from dch to dbh dd as well that's very simply what this does it ensures that abuse exploitation and neglect are moved and those reporting requirements which are mandatory are moved from dch to dbh dd since they will be dealing with these facilities mr. speaker those are all the meaningful changes glad to answer any questions you have no questions thank you speaker on the jimmers motion that the house agreed to the senate substitute to house bill 584 all those in favor will vote yes all those opposed will vote no and mr. clerk will you unlock the machines you have all members voted all members voted so mr. clerk will you lock\n\nThe case is on the gentleman's motion. The yeas are 163, the nays are zero, and the house has agreed to the Senate's substitute to House Bill 584. Mr. Clerk, will you read the caption to Senate Bill 79, 7-9? Senate Bill, 7-9 by Senator Goodman and the 8th and others to be titled, NAC2-Man, in Title 16, the 5th Dakota, Georgia, and in Tate relating to crimes and offenses. So as the revised threshold amounts of fentanyl and related substances necessary to constitute the offenses of possessing, selling, distributing, and manufacturing. This bill lemurs further the committee on duty sharing. Now in several of that committee recommends a dispelled do-pass by committee substitute. Representative James Barchett is recognized to present Senate Bill 79, Representative Barchett. Thank you, Mr. Speaker and colleagues. I would like to ask you guys today to give you my full support and ask for your full support of Senate Bill 79. If you recall this body last session passed unanimously Senate Bill 465, which is Austin's law. And if you recall the story about Austin, Austin was yet another victim that fell to this deadly drug of fentanyl. Today we have with us in the Chamber Austin's parents who have become zealous advocates on behalf of the life of Austin, so that none of our kids or our grandkids or any of us in here can fall victim to this very terrible and deadly drug and fentanyl. So thank you for being here again. The Walters, I very much appreciate both. I can't tell you how much I feel for you and you guys just advocating on behalf of your son. That's what many of us in this Chamber would do if we were in the same position. So thank you very much for your advocacy. So what Senate Bill 79 does is it strengthens the trafficking penalties for fentanyl. Currently you're going to need to get it to get a trafficking charge. You're going to need to have four grams of fentanyl. And I've got four you here and approved by the Speaker. Four grams just to show you how much four grams is. And if this was fentanyl, folks, this is not fentanyl, by the way. I put it on the leader, Madam Leader's desk, she said, oh, I don't know anything. This is not fentanyl. But this amount right here would kill everybody in this Chamber. And in that Chamber, everybody in the hall, about 2,000 Georgians could die with this amount of fentanyl right here. That tells you how strong this drug is. This drug has medicinal value, but the problem is that it is being illegally imported. And it is being utilized by our youth and by people all over the state of Jordan, all over the country. And we have a silent epidemic here. And what we're trying to do is persuade folks not to trafficking this deadly drug. Earlier this week in Sandy Springs, there was the largest bus or one of a very large bus in our state's history. I think it was 21 grams is what they found. And that's enough to kill out of our districts, which we represent, roughly 60,000 folks. It would kill 40 whole districts in this Chamber, all the people in the district. And so that is a testament to how big of a problem we have. Right here in Sandy Springs, you have such a large bus. We know that is coming in folks. And to the specifics of the bill, currently it is crime already to have to traffic in 4 grams or more. What we have done is increased the penalty as the weight is increased. So the more weight you have, the penalty is much more increased. 10 years, 15 years, 25 years. And there are mandatory minimums. So that my colleagues share concern with mandatory minimums that I have. But this is aimed at trying to curb or curtail a very serious problem in our state. There is a provision within this bill that allows for a departure from the mandatory minimums. There are some elements that need to be met. I spoke with one of my colleagues about those elements. And they can't depart from those mandatory minimums. But I ask you and I'm pleased with you. Please, please, please continue to stand together on this issue. I think this is not a partisan issue. I think this is just a problem that you, me, for our kids and our grandkids are... We need to take a strong stand against this deadly drug. And, Mr. Speaker, with that, I will yield for questions. Gentlemen, has a couple of questions for you. I do. Representative Panich has recognized you are left in the back. Does the gentleman yield to my friend I do? Thank you. Is it not true that after amendments and deliberation that addicts will not be facing increased sentences for mere possession of a drug that they likely don't know? It probably don't know, contains that. Very, very good point. Yes, ma'am. The lady knows of what she speaks. We've been trying, even in Austin's law, to assure that someone that is an innocent... I don't want to say innocent user, but someone that doesn't know that it is in the drug, does not face these types of enhanced penalties. Thank you for the question. Thank you. Representative Campbell, down the center aisle, has recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield to my friend I do? Is that true that Senate Bill 79 addresses the reality of fentanyl being a scientific altering reality as we address the addition... Addiction epidemic in our state. And this bill strikes a bipartisan response that our working group on addiction recovery has been very interested in and active in and the Georgia Council on substance abuse. The gentleman knows of what she speaks. Thank you. A couple more questions. Do one more, Mr. Speaker. The hour is late. Representative Rees, to your right, is recognize for a question. I speak Burns with the majority in well yield for a question. Yes, I do. Is it not true that over a quarter of a million Americans have died from fentanyl since 2018 and that that's like five times a number of people who died in the Vietnam War? It is. Thank you for the question. Mr. Speaker, how yield the well. I think we have more speakers on the bill. I do not want to hold you up any longer than I need to, but this is a very important measure. I hope that I can count on your support for this measure. Thank you. The gentleman's yielded well. We have a couple of speakers signed up. Here's how we're going to handle this. We have one to suppose. I'm going to give him up to up to 10 minutes. And I'm going to allow the two that are in favor of five minutes each to speak to the bill. Representative Holcomb is recognized to speak to the bill. Representative Scott Holcomb. Thank you, Mr. Speaker. I'll start by saying that I agree with everything that the Whip said in terms of the problem. Fentanyl is a scourge on our country and it has caused heartbreaking loss to countless families. And certainly my heart goes out to the family that's here today on this issue. But the reason why I pose this bill is because of the mandatory minimums. We need to have a paradigm shift in sentencing and we need to move away from mandatory minimums. This is not an issue of leniency versus excessive punishment. This is an issue of doing what works versus what does not work. And mandatory minimums do not work. Why? It's very simple. The first time that most criminal defendants learn what the mandatory minimums are, are when they're talking to their lawyer after they've been arrested. They don't deter the conduct on the front end, which is purportedly what we're trying to do. And this is not new. The first mandatory minimum for drugs in the United States was passed in 1914 by the U.S. Congress. And its purpose was to address at that time opium. Throughout our history, we've had a swinging of the pendulum where we've reduced sentences and then we've gone back to mandatory minimums. But we've looked at this over and over and over again and the research is very, very clear, which is that mandatory minimum sentences do not deter crime. What does deter crime is the probability of getting caught. So that's where I would prefer that we focus our energy and I would support this bill if we took out the mandatory minimums. Because certainly I think that traffickers should be penalized, should be convicted, and should be sent to jail. But I disagree with the mandatory minimum portion of it. Of note, with respect to the system, our system right now is struggling. We have law enforcement agencies that are understaffed, underfunded, that goes for the law enforcement agencies themselves, the prosecutors, the judges, and our jails, and our prisons. Our prisons, we have put in millions of dollars, even approaching billions of dollars to try to have enough resources to keep those safe. And with mandatory minimums, there is no discretion in terms of what can happen of having those sentences be adjusted. And one point that I'll note out with respect to, it is true that this bill provides some potential reduced sentencing. But I would highlight line 70 and 71, which talks about the criminal conduct did not result in a death or serious bodily injury to a person other than to a person who is a party to the crime. If we're dealing with fentanyl, we're almost always going to have deaths, which means that all of the exceptions that start at 113 practically aren't actually going to happen. So you're just looking at locking up people for a very, very long time. A reference was made to what we did last year in 2024, and that law is called Austin's Law. That crime that we implemented also to address this scourge is titled the aggravated involuntary manslaughter for fentanyl overdose death. That bill does not include mandatory minimums. So I would support what we're doing if we move away from having mandatory minimums because they do not work. They are poor public policy, and we just need to really have this shift away from them. And then with that, in terms of prevention, on July 1st of 2022, the state legalized the ability to test drugs to find out whether or not fentanyl was in there. This took effect a couple of years ago, and there was a recent study performed by the University of Georgia to discern whether or not our pharmacists were aware that they could sell fentanyl testing strips. So people could test and see if the drug existed to prevent accidental overdoses in consumption, and they found most pharmacists didn't know about this. Most pharmacists didn't offer it, and if we're going to really try to work on the system to prevent deaths, there are better ways to do it. So I'll close by saying I agree with you on the objective. I disagree with you on the means, and I'm voting against it. Thank you. Gentlemen, as yielded the well, the chair recognizes representative Tran to speak to the bill. Thank you, Madam Speaker. It's themed members of this House, and my fellow Georgians, I ask that we become united today to take our first step in battle. And we have to understand that fentanyl is not just simply a powdery substance brought illegally across our borders from other nations. Fentanyl is actually a legally prescribed prescription drug here in the US. It's known under many names, Acthique, Dorisic, Sublamines, and Phantora. And one of the problems we have is say one of your elders passes away. What happens to all of their prescription? Do the kids get it accidentally, or do your own kids, because you've broken a leg, you've injured yourself and you're dealing with pain, are your children taking your drugs out of your cabinet to use it for themselves or to sell it? And so we have to recognize what fentanyl is in our community and start taking the steps to battle against it. Here in Georgia, the statistics are chilling. In 2023, fentanyl was involved in over a thousand overdoses in our state, a 35 increase from the year before. Among teens, the numbers are even more alarming. Between 2022 and 2023, there was a 40% increase. A fentanyl related deaths among teens for between the ages of 15 and 19. It's not just a national crisis. It's one within our community. I'll talk about my community, the city of Dunwoody. In the last six years, Dunwoody Police officers have responded to over 156 overdose incidents. 35 of those resulted in death. The life-saving drug, Narcan, was administered by Dunwoody Police over 79 times. And that's Dunwoody. We have rural cities who struggle to keep a constant supply of Narcan. fentanyl hit the city of Dunwoody hard about a year ago. We had a death at Dunwoody High School due to an overdose. Mia Diggas, she was 17 and she tragically lost her life to fentanyl overdose due to the pressure of her peers, her friends, and we need to start to address this. We need to follow the lead of the teenagers and students. One of the students at Dunwoody High, Madi Cohen, has started to run a program to get Narcan in every classroom. Now, we've gone Narcan into every high school, but we still, for the betterment of these children, need to get Narcan into every classroom. Over 20% of adults and 28% of teens suffer from mental health challenges, whether it's anxiety or depression. Access is easier, understand this. It is easier to get a counterfeit bill or a gummy laced with fentanyl than it is to go get mental health services from a professional. This is where we are broken. It should not be easier for students and veterans to turn to criminals for counterfeit drugs that will ultimately kill them. Over 1.2 million Georgians remain uninsured. That's nearly 12% of our population. It is far easier for the most vulnerable in our rural communities to turn to the drug dealers that pass through their city than it is to find healthcare, find a hospital, find mental health services within their communities. This bill is the first step. We have many steps to take to make sure that we defeat this fentanyl crisis. When we take a look at our homeless population, 13% of them are veterans. Nearly 2.3 have a history with drug and alcohol abuse. We are seeing with our veterans what's happening at the federal level. Their jobs are being cut, services at the VA are being cut. This problem for our veterans are going to continue to grow. While I'm concerned about the mandatory minimums of this bill, we must take this head on because more and more veterans are going to have to turn to counterfeit pills to alleviate the pain that they have from the injuries they took in combat. I urge you all to vote in favor of this bill and thank you Madam Speaker. I yield the well. General Masio to the well. Chairman Tyler Paul Smith has recognized to speak to the bill. Thank you, Mr. Speaker. I know it's Friday and everybody's wanting to get home, but Mr. Speaker, I rise in strong support of Senate Bill 79. About 10 years ago, I was working as I had here in this house and at the same time I was fortunate to speak to actually also work during that same semester with the District Attorney's Office of the Talpest of Judicial Circuit. It was a case that the then DA Browning told me to go and look through first down the job and it was related to fentanyl. And the first thing I see when I open up this case file are autopsy photos of what we believe according to my DA who's 88th time I was assigned to was the first fentanyl related death of a child in the whole state of Georgia. I'll tell you that I have not spoken about that to anyone other than my father who's actually a Bayroot Marine who's seen death firsthand. But I can tell you those autopsy photos until God either calls me home or I lose my mind down here before he does one will be ever burned in my head. Generally, I would agree that mandatory minimums for certain crimes might not be the best solution. However, with this one. I thought about this in committee the other day about that little baby girl. If I could convey to you the evil that was done to that little baby girl, I would have been a fine crime, crime, all night. With some experience of that myself now. That little baby girl was given a fentanyl sucker so she'd stop crime. She'd never cry again. The substance has been killing children of all ages, people of all ages. That I'll say about the graveyard. You can go out there and you find people of all ages. I think this is hopefully a step in the right direction so having for bed does that are the youngest above us. We'll even have to worry about that. That person that that child has no discernment just being given something by parent. It was deranged as it was. I really want to thank the family. I don't want to thank Senator Goodman and Whitford Jeffery. I was hard work on this. I really do believe that with this step in this direction the penalties becoming more severe for trafficking this pure evil poison to our population. Hopefully we can finally get a hold on it. Mr. Speaker, it's tough to share those kind of stories but I know some of you may be surprised that mean what I do for a living would be up here supporting it but I am all for public safety. I'm all for not allowing this deadly poison to our citizens in this state or this country. This is a measure that I think on certain days of this session or any session that this house has ever been in. We'll look back on and we can be proud of it. We talk about saving lives and different bills saving lives. You want to put something on the table that saves lives. You want to pass something that saves lives. This bill right here Senate bill 79 accomplishes that I believe that in the deepest part of my heart and the deepest part of my mind. Mr. Speaker, I know I generally leave that the lead discussions to technical matters but I felt like that story for those of you that might be on the fence on this one. I just hope that you'll know where my heart is on this and that it is my sincere belief. Well this coming out of the committee that I believe had accomplished the aims and intent that it started out with. I'm going to let Mr. Speaker yield well last is bodies favorable consideration. Thank you Mr. Chairman. Thank you for sharing with us on your heart felt experience and your belief. Majority of the illustration is recognized as speak to Senate bill 79 leader of the station. I can speak well it's difficult for me to add more than the very heartfelt impressive speeches that we've heard today in favor of SB 79 but I did want to just give a few thoughts particularly with respect to the policy around mandatory minimums. As we've heard today fentanyl is a unique type of controlled substance that has come on since say my time as an assistant district attorney in 2013 when I left the D.A.s office I was not familiar with fentanyl I had a prosecutor in offense for that. And then with the statistics we've seen this dangerous poison as has been said killing residents of our communities our neighbors friends family members the importance of taking strong action to address the danger to each of our communities has come into full view. And we've reflected that in action that we've taken here in this general assembly now trafficking offenses carry mandatory minimum sentences they do we have those encode are prosecuted those offenses where if you have a certain quantity and for certain substances it's the purity of the substance trafficking is an available offense and the public policy around that I believe is well founded talk about that in a minute. But more broadly you know we have mandatory minimum sentencing in all kinds of laws already just take murder just often murder in Georgia carries a mandatory life sentence it does it's in the code there I could go on and on all down the line of different criminal offenses where trial courts have to impose a certain sentence because the general assembly often many years or many decades. And it seems that only recently there has been what and while I have tremendous respect for my colleague who spoke earlier. I think that seems that there has been a real king in on this issue at least that I've received recently but that's inconsistent I believe with the history that we have in our state of taking action to deter criminal conduct that's dangerous to Georgians. And secondly to put individuals who are hurting or killing citizens of our state in prison whether or not it atters them now let me break each of each of those down first of all sentencing as a deterrent I believe that it is I have found as a prosecutor previously that criminal organizations are very smart they often know the sentence ranges that can be imposed by by a trial court they're strategic and where they operate they're. They're for profit into criminal inner process and when knowing that deaths results from the sale of your product that's incredibly evil industry to be in but that is the reality of certain criminal organizations cartel organizations organize crime that that is their effort. They will know what sentences are available in the respective states and how they contrast with federal law this measure in my view does a tremendous amount to deter fentanyl operations from operating in our state but even if you discount that argument distancing dangerous sales of drugs. Distancing the sellers or distributors of dangerous drugs in our state from the people of our state by synancing them to the Department of Corrections is a way to protect more Georgians. In other words criminals who are operating to pedal this poison putting them in prison for the sentence ranges we're talking about here will protect the people of our state and as we just heard from the chairman of the committee some of the youngest Georgians who made no decision whatsoever to be around or exposed. I implore you to support Senate bill 79 of you that fentanyl being an extraordinarily potent synthetic opioid with potency up to 100 times that of morphine we're talking about a completely different classification level of potency here and the need to pass Senate bill 79 is clear Georgia we can set we can say here today with a strong vote on this Georgia will not tolerate distributed. We're talking about the use of this dangerous drug and that we're committed to providing law enforcement and the judiciary the necessary tools to impose sentences in court to see that through now is there the possibility of a situation where a mandatory minimum would not be appropriate well you know Senate bill 79 actually contemplates that in the bill it provides that under certain if certain parameters are met that the trial court would have authorization. To not him.\n\nopposed to divert from the mandatory minimum. So this issue that has been raised, even if you hold it as your concern, ladies and gentlemen, I submit to you that Senate Bill 79 is still worthy of your vote because it will allow for those exception situations to be taken into consideration by the prosecutor and the judge and for justice to be done. Ladies and gentlemen, I ask for your favorable consideration and Mr. Speaker I yield the well. Gentlemen and gentlemen, I yielded the well. We have no more speakers that want to make their points on SB 79. So we'll put it to a vote. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to adopting the Committee's substitute? Hearing none, the Committee's substitute is adopted. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? Hearing none, the report of the Committee is agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? All members voted for what purpose is represented rise, rise? Parliamentary inquiry. State jinguari. Mr. Speaker, is it not true that Senate Bill 79 reflects our commitment to combating the opioid crisis by ensuring our legal system can effectively address the unique dangers posed by phenol trafficking? That's what I've been reading and that's what I've just heard. The ladies inquiry is on point for what purpose is represented if he can rise? Parliamentary inquiry. State jinguari. Mr. Speaker, isn't it true that last year a 25-year-old young man in my community was lost his life after being exposed to a deadly amount of fentanyl? And as the representative in this room for his family who was left to grieve him, I feel very strongly that these mandatory minimums will save lives by keeping the people who have no disregard for other human lives from practicing their particular form of evil? That's true. The lady knows of her experience in her community and certainly believes in what she speaks for what purpose is represented in Miller rise? Parliamentary inquiry. State jinguari. Mr. Speaker, is it not true that decades of research have demonstrated that mandatory minimums and sentencing in particular does not in fact deter crime? I'm sure the lady believes in what she speaks further inquiry. I'll take one more inquiry. But it not be a better exercise of our time here to honor these victims and our communities by doing things that will actually deter crime, as opposed to doing symbolic, performative gestures that will not stop the deaths that are occurring in our community. Is that not true, Mr. Speaker? I agree with the lady. We can do all we can in our communities to stop these discouraging events. I'll take one more inquiry from the gentleman who is in the bill for what purpose is represented by a burnt shed rise? Parliamentary inquiry. State jinguari. Is it not true, Mr. Speaker, that we are aiming this legislation at those sophisticated parties and networks that are bringing in large amounts of fentanyl, not aiming it at those folks that are actually possessing and using those. Is that not true, Mr. Speaker? I'm sure the gentleman understands every bit of the bill. I appreciate his insight. Have all members now voted? All members voted. If so, Mr. Clerk, will you lock the machine? On the past, just sitting bill 79, the yeas are one third to 31. The nays are 31. This bill, Henry C., the requisite constitutional majority is there for a past. For what purpose does Wipberchett rise? Make a motion. Make a motion that we immediately transmit this to the Senate. There is objection to gentleman move. Gentle moves. All right, we'll vote this one right now whether it's immediately transmitted or not. All of those in favor of immediate transmitted or vote yes, those opposed. We'll vote no, Mr. Clerk, will you unlock the machine? Have all members voted? All members voted? Yes, so, Mr. Clerk, will you lock the machines? On the general's motion for immediate transmittal, the yeas are 99, the nays are 62. Did I tell you to lock that machine? I did because we have the vote up there. So this bill is now, immediate transmittal to approve and this bill will be immediately transmitted to the Senate. Thank you, members. We have a little more business to attend to and I want to recognize a couple people on the floor with us today. The parents, Mr. Bearth and excuse me, Mr. Gus and Mr. Bearth and Sister Meredith. And also I want to thank Senator Goodman for his steadfastness on past his own past his bill and we appreciate y'all being here and appreciate the fight. We all continue to offer our condolences for your losses and thank you for your steadfastness. Just keep working. We appreciate y'all. Mr. Chairman, leverage is recognized for a motion. Thank you, Mr. Speaker. Ladies and gentlemen, I move that the House disagree to the Senate amendment to House Bill 86. I believe that's the proper, that we disagree to the Senate amendment to House Bill 86. That's thank you. Mr. Clerk, will you read the caption to House Bill 86? House Bill 86, by the way, Representative Lever to the 123rd and others to be entitled back to amend Code Section 4574 of the fiscal day of Georgia and the Tate relayed an annual salaries of certain state officials and cost of living adjustments. Chairman Lever is recognized to explain his disagree. Thank you, Mr. Speaker. Ladies and gentlemen, House Bill 86 is part of the judicial pay reform legislation that this House is championed and has, well, that advanced out of this House sometime ago this session. House Bill 86 is the bill that deals with statewide judicial pay. That is the pay of our statewide judges, Georgia Spring Court, Georgia Court of Appeals, Statewide Business Court, and the Tax Court. The bill was amended in the Senate. You may have seen a little something about the amendment in the news over the last 24 hours. And we are asking, or I am asking, that you disagree to that amendment. I think that is the discussion. We as a body need to have at some point, but we shouldn't have it as an amendment to a bill in the last two or three days of session. I believe it needs to be thought through a little more and it needs a little more study. I would like to pass our bill, my bill, House Bill 86, and let's deal with reforming judicial pay first before we move on to anything else. I just believe that is the good policy and I would ask that you support us in that endeavor. And I am glad to answer any questions you may have about this motion. General, would you go for a question? Yes, sir. Representative Allen Powell, and you are right in the back. Is the recommendation a question? Well, the gentleman, you? You yield, yes, sir. To my good friend, is it not true that sometimes there is always consequences to legislation that we pass for the week sceptor or dismiss? Yes, that is decidedly true. Further yield? Yes, yield. Is it maybe not possible by agreeing to the Senate and raising all of these constitutional officers' salary that we might have a positive effect that we can probably clear the Senate out of about 75% of their members have run for higher hold? Is that not true? Mr. Chairman, I still have bills over there, so I will not say nothing about that. You have another question, Mr. Chairman. Representative Billy Mitchell, to your left, has recognized for a question. Mr. Chairman, if we yield, yes, sir. Mr. Chairman, if I had to understand the original proposal, which would prevail if we disagree, this would lower the legislative salaries to 60,200 annually? That is incorrect. That is existing code that is not changing our salary. The House Bill 86 does not touch any salary except for, well, I would argue it doesn't even touch judicial salaries. It just changes the way they are treated in code from a numeric number to a cap. This will not change legislative pay in any way, shape or form. As you recall, there was an effort last year to add that to the bill and we rejected that. And I'm not proposing to do that again this year. Mr. Chairman, would you accept the proposal to amend legislative salary to the median individual income in Georgia, which would be $32,000 a year? I would accept that amendment for just me. No, I would decline that amendment. We have not talked about legislative pay in this process. We've not discussed it in a committee on either side that I'm aware of. I do not believe that is, well, I think it's good policy. I do not believe it's a proper time to do that. And what would ask that we not do that with House Bill 86, with all due respect to the gentleman. Yeah. I would just suggest to you, Mr. Chairman, if I may, we're contemplating raising the salaries of every other elected official in the state. What is a more appropriate time? No, no, we are not. The Senate contemplated that with this amendment. I see. I believe we in the House are contemplating taking that. I mean, look, I don't believe. The motion is to remove the Senate amendment so that we would only be addressing the issue of judicial pay with House Bill 86. Thank you, Mr. Speaker. Thank you for the question. Thank you for your explanation. The gentleman yield. How are you, Mr. Chair? Representative Westbrook to your right is recognized for a question. Thank you, Mr. Speaker. Mr. General Maniolde. Yes, ma'am. Thank you, Chairman. Could you just specifically speak to the pay for superior court judges in Georgia because we've got judges who are watching that as she closely and the Council of Superior Court judges, how this has worked closely on that. So I would appreciate if you just quickly clarify for us how this amendment addresses if it does at all, Superior Court judge pay. My understanding, and thank you for the question. My understanding is the proposed amendment did not touch the issue of Superior Court pay at all. It's simply dealt with pay of a number of state law officials in the executive branch. House Bill 85, which is, I believe, being discussed on the floor of the Senate if not right now, at least today, it's on their calendar, deals with Superior Court pay. And it imposes a consistent set of reforms so that Superior Court pay has also changed in the code to a cap based on a percentage of the bill. The U.S. District Court pay so that we sort of bring, make judicial pay for all state paid judges. These are judges who are state employees sort of harmonized into one uniform system. Thank you, Mr. Chairman. And thank you so much for the question. I appreciate you, Mr. Chairman. Would you like one more question? I will be glad to. I'll leave it here, Glee. Is recognize for a question. Thank you, Mr. Speaker. Does the gentleman heal? Yes, ma'am. Just for clarification purposes, isn't it true that when this House votes yes to disagree, your bill is going to go back to the Senate in the way that we sent it over there? That's precisely right. And that is the goal. And thank you, dear lady, for summarizing the goal here. The gentleman has some further questions. Thank you, ladies and gentlemen. I would ask your favorable consideration of the motion and I'll yield well. On the gentleman's motion, the House disagreed to the Senate amendment to House Bill 86 is the objection. Hearing none, the House has disagreed to the Senate amendment to HB86. For what purpose is representative's elaborate rise? Make a motion. State your motion. Mr. Speaker, I'll move that we immediately transmit House Bill 86 back to the Senate. Is the objection? Hearing none, it is so ordered. For what purpose does RIPP's representative Darlene Taylor rise? To make a motion. State your motion. I move that the rules be temporarily suspended for bill to be read for the first time in a signed to a committee. Mr. Clerk, will you read the caption? A number of House resolutions by Representative Taylor, the 173rd and others of resolution creating a House study committee on evaluating funding for public health. On the ladies' motion, that the rules of this House be temporarily suspended so bill can be read for the first time in a signed to committee. Is there objection? Public and community health. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of Reverend Dr. Robert C. White Jr. Commendating the first class in May. Recommendating Lynn Riley on the occasion of her retirement. Commendating and congratulating James L. Davis. Recommendating Dr. Ernest Afori Saupalm. Commendating the Building Owners and Managed Association of Georgia and Recognizing February 4, 2025. Is the Building Owners and Managed Association day at the State Capitol. Recognizing commending. Pilar King on winning the GHSA Class 4A State Swimming and Diving Championships. Recognizing the Charles, our Drew Public Charter School of Arsene Boys golf team for winning the State Golfing Championship. Commending Hazel Marie Gonzalez. Commending the Morehouse School of Medicine Physician Assistant Program. Recognizing commending the Southwest High School Patriots Ball, Patriots Boys basketball team for their outstanding 2024, 2025 season. And inspiring run of the GHSA Class A Division I State Championship. And for other purposes, that completes the reading of the program resolutions. And is there objection to adopting the privileged resolution here in the resolution that are adopted. That completes our rules calendar for today. We do have some afternoon orders before we complete our work. We will begin with Representative Roman. Members as several of you I'm going to give if you can do it in about three minutes. That would be appreciated. Representative Roman, wait to hold this lady will suspend just for a minute. Thank you, Mr. Speaker. Colleagues, I am ecstatic to share that we are almost run by done. This week Muslims will be celebrating either Sunday or Monday depending on the lunar calendar. This is the equivalent of Christmas for us. If it's going to be on Monday, feel free to give me gifts or anything else. But seriously, your constituents will be celebrating either on Sunday or Monday. If you've got any masks or some constituents that you know of, please do reach out to them. And to my Muslim community, Ramadhan Mabarak and eventually Aid Mabarak. Thank you, Mr. Speaker. I'm glad to welcome you. Representative Ballard in the Houston County delegation. Representative Ballard. Thank you, Mr. Houston County. They may be in Houston County, though there they come. Thank you, Mr. Moore. Oh, there's some more of them. Wait a minute, you're getting more all the time. Oh, there they come. They all traveled afar. Ladies recognized. Thank you, Mr. Speaker. We're up here today to honor and commend Mrs. J. Thomas. She is a Houston County teacher at Lake Joy Elementary and she is one of the finalists for Teacher of the Year this year. And we are so excited for her and we wish her the very best. Good luck to her. Hope she pulls through there. Reps. He's sharper. Give the gentleman your attention. He's got something that find very meaningful. He wants to talk to us about. Representative Dexter Sharper. Give your attention, please. Thank you, Speaker. A lot of you guys have been asking me and you heard about on social media as well as Amazon and other places about the books, the memoir that I came out with lately about a week ago. So it's true. And the first one is called from the Poor House to the State House is being a Oz where someone like me came from the outside of the Shracks but continued to move on and put attention to being part of the process. And I thank Larry Hanson 25 years ago when I visited Council and made my program to be involved in the Austin. He encouraged me to just keep on going and that one day I could be a state representative. And it came through and I mentioned a few people in the book. My publisher said you got to cut out the acknowledgements. You got like a thousand people. But Nicky Randall, if you're looking at this, when I came in as a freshman 13 years ago, she kind of embraced me. Others did too, but I know she's not in the room, but if you're out there, I appreciate that. And we do have an event before you. Now this other book I wasn't going to say it worked out. Because a lot of you were here when my dad passed away in 2018 and a lot of you guys were here when my mom died in 2020. And some of you guys were here when I almost died and you remember I was up in the area with oxygen on 24 hours a day. And a lot of you guys encouraged me. You were there, you prayed for me. And about 96% of the people that got as bad as I did, they died. But each day a lot of you guys encouraged me. You pushed me. You helped me some time up the stairs, the doorkeepers, everybody I kept pushing day in and day out. And this is the one called Breaking Free, Depression to Success. And I want to say this. I was nobody knew it, but I was actually from the time my dad passed and my mom passed and she was everything to me and then me getting sick. I didn't know that I was depressed for three years, 10 months and 17 days and nobody else around me knew because I always chill, relax, my business is kind of run by themselves. So I didn't have to leave home. I didn't have to do a lot of things because everything was automatic, but nobody knew. So I just want to encourage everybody. This tells my story. And if there's anybody looking at this or anybody in this room, if you're feeling some type of way, what is coming from passing up from a loved one because there's a thin line between grief and depression. So I'm going to encourage you to please talk to somebody, also notice the people around you because you never know what they're going through. Sometimes all they need is a listening ear. So speaker, I thank you so much. I thank everybody in this room, but one thing it is is when you don't know that you're depressed, that's even worse sometimes. But I thank you guys and I ask you for your support that these, some of the portions of all these books will be having one for financial literacy for young people and this is going to be having the movement and mental health awareness that we can be, it's okay not to be okay. So I thank you all so much. God bless you. Thank you so much. Thank you, Representative Sharper. We appreciate you and you always have caring about your neighbor. Thank you, sir. Members, I'm going to recognize Chairman Crowe. There's a situation that he needs to inform you on and I know that you will give him your full and undivided attention. Chairman Crowe, you may ask him to stand at the appropriate time if you would like to. Thank you, Mr. Speaker. Yeah, I would appreciate if you all would stand if you wouldn't mind, please. I learned earlier this morning that a member of our George St. Petrol family, Sergeant Royce Zah, out of the Marietta of Post, his five-year-old daughter, Navy, is at the Arthur Blank Children's Hospital in ICU. She's been diagnosed with sepsis and from what I understand, she's not doing very well at the moment. She had a seizure this morning and it done CT scans and they are not looking very good. So she's undergoing some plasma exchange and other tests today and I just wanted to come and as a family ask us to in a moment have a moment of silence for them, but to keep Navy and her family in our thoughts and prayers especially over the weekend, they're going through a tough time right now and I would ask that we continually pray for them and her health and her recovery. So if you join me in a moment of silence, I would appreciate that. Thank you, Mr. Speaker. Thank you, colleagues. I think we witnessed yesterday how powerful prayer is with Chairman England. And Representative Holly has recognized for an afternoon order. Representative Holly. Thank you, Mr. Speaker. Thank you for members who were able to join us yesterday, Black Men and Boys Day. Unfortunately, one of my locals, Andrea O'Mallard, was unable to come but I wanted to highlight him for the good of stepping up. His young son, Aiden, was unfortunately with his mother and South Georgia when a tree during storm came crashing through the house and to kill this mother. And Andrea was fortunately able to take his son, bring him home to Henry County and to be able to raise him. And the son is adjusted well enough. He has been excelling in school and we wanted to honor him yesterday because Andrea chose in that moment knowing that Aiden's mother would never come back again but brought him into his life by giving him his last name. So if you watch it at home, Andrea O'Mallard, Aiden Mallard, we thank you for reminding us that we may endure through the night. But joy, come with in the morning. Thank you. Thank you, Representative. That completes our afternoon orders. We have more announcement as maybe a couple of announcements. Representative Aidenia has recognized for an announcement. Gentlemen has recognized. Thank you, Mr. Speaker. I'm sure all of us are famished by now and ready to go home. But the Haitian American Chamber of Commerce is hosting a lunch downstairs in Room 230. So stop by there and grab some great food. See you there. Room 230, great food. I bet you will have some company. Chairman Gunther recognized for an announcement. Thank you, Mr. Speaker. Just a reminder, we have a House Judiciary meeting in 132 at upon adjournment. Thank you. Okay, members, as we plan for next week, this House will be in session on Monday, Wednesday, and Friday. I don't know what happens on Friday. There's something powerful I hope. So on Tuesday and Thursday, we have committee work days. I encourage all members to be here and participate in those committee work days as we get ready for the final push. We also have pages here today. So if you have a page, I encourage you to come up front and let's thank our pages for their work and have a photo. We also have a member with a birthday over the weekend. Representative Matt Dubnik will be 21, I think, over the weekend. Matt Dubnik, he's already celebrating. Thank you, Mr. Chairman. Majority leader of this House has recognized for a motion. Thank you, Mr. Speaker. I move that this House stand adjourned until 10 a.m. on Monday, March 31st, 2025.\n\nI can count on you all those opposed. No. It's getting closer. But the eyes clearly have it. This house stands adjourned. See y'all all Monday.",
  "updated_at": "2026-02-13T13:43:30.732012+00:00"
}