{
  "video_id": "DYybNsNgy7I",
  "url": "https://youtu.be/DYybNsNgy7I",
  "title": "Georgia House - Day 32 (2026-03-15)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 32,
  "video_date": "2026-03-15",
  "duration_minutes": 47,
  "summary": "Overview:\nThis Georgia House session transcript highlights the importance of kindness, compassion, and civility, as emphasized by the guest chaplain's sermon. The session focused on routine procedures rather than substantive legislative actions.\n\nKey Actions: \nNo notable bills passed or referred.\n\nBills Introduced (First Reading):\nNo new bills introduced.\n\nNotable Moments:\n- Guest chaplain Pastor Mike Davis delivered a sermon emphasizing the virtues of love, joy, peace, kindness, and compassion in public life and politics.\n- The chaplain shared a story about a nursing student's distress over witnessing insensitive behavior by medical staff towards a dying patient.\n\nVotes: \nNo recorded votes mentioned.\n\nAttendance:\nQuorum was present, with all members voting to signify their attendance.\n\nAdjournment:\nThe session adjourned, with the next session date unspecified.",
  "transcript": "They are of convening, having arrived, all members of the House will please report to\ntheir assigned seats.\nAll members of the House will please report to the House of Representatives in the clerk\nwill ring the bell.\nAll members will please report to their\nseats. We're about to have the morning roll call. All members present will\nplease vote green to signify their presence in the chamber and the clerk will\nunlock the machines.\nhave all members voted have all members voted if so the clerk will lock the machines door\nkeepers will please close the doors and keep them closed well good morning what a glorious\nThis weekend it was a beautiful, beautiful weather.\nWe will begin this beautiful day with Scripture reading and prayer by the chaplain, after which\nwe will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 152nd House District\nRepresentative Bill Yerda, representative Yerda.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nIt's a real pleasure for me to have Pastor Mike Davis with us.\nMike serves as a senior pastor at Hayhara United Methodist Church\nand he's been there since 2015.\nPreviously, Mike was at my home church,\nPenson Memorial Methodist Church, and Sylvester.\nMike's actually a third career pastor\nhaving previously worked in law enforcement,\nserving as a chief deputy in Sumter County.\nHe did that for about 11 years.\nHe also was in the insurance profession\nat working for Georgia Farm Bureau Insurance\nfor about 18 years.\nMike grew up in Sumter County of the Lesley area and America's area, so he's actually\nwas in close to my district, if not in my district, or Mr. Chocus's district.\nBut Mike is a graduate of Lagrange College and the counselor school of theology at Emory\nUniversity with a master's degree in theology.\nNot only could Mike deliver an inspirational message on Sunday, but Mike was always involved\nin the community.\nHe served as Chaplin for the Worth County Sheriff's Department, and he also does that for\nthe Lounge County Sheriff's Department right now.\nHe also serves on the Board of Directors for the Georgia Sheriff's Boys Ranch, which\nis important to us in Georgia and in South Georgia.\nMike made a real difference since the last of Georgia, and I know he's making a real\ndifference in Hey Hire in Lounge County, Georgia.\nHe always joined my family in our joyous times and he got us through some pretty difficult\ntimes also.\nTo sum it up, I would just categorize Mike as just a great guy and a great guy to be around\nand it's just a pleasure for me to have him today.\nwelcome my pastor and my friend, Mike Davis.\nI tried to lose about five pounds before I got here knowing that I was going to pass\nclosely with Bill.\nGood morning, Mr. Speaker, House of Representatives, staff members and\nYes, greetings from Hayhara and the wonderful people of Lowns County.\nA few weeks ago, one of my friends called and asked if I could meet with her daughter who was a senior nursing student.\nThe daughter had recently experienced her first death while doing clinicals in the intensive care unit.\nShe was having a difficult time.\nWe met for breakfast, and she described her recent experience.\nShe was part of a team attending a patient when the man went unresponsive.\nAt the instructions of her attending position, she and others performed CPR, and the man\nwas revived.\nEven though his prognosis was not so good within minutes afterwards he succumbed, the young\nwoman later discovered that this man, her patient, was a father of one of her friends.\nHowever, the death of the patient was not the point of her concern.\nIt's not what brought on our conversation that morning.\nThe problems that she had were dealing with the behavior of some of the staff who were\nin the room during the man's dying moments.\nFor most it was just another day at the office with the normal chit-chat and carrying on.\nAll the while little attention was paid to the patient outside of checking lines and\npump settings and vitals and monitors and among that chip chat going on comments were made\nabout the patient and his general condition including the fact that he would probably code\nor die no matter what they did. Since she had been taught that the sense of hearing was the last\nof the senses to go before death, it stung her conscience that experienced nurses and technicians\nwould carry on such a conversation in the presence of a dying man, acknowledging that perhaps\ntheir behavior could be a defense mechanism to protect one from the toil of dealing with death\non such a regular basis, it still grieved her that her mentors were not kind or considerate\nto one in such need.\nI shared this story to point out a general observation of the day.\nOur world seems to be becoming more and more contentious and less caring with each passing\nday. The lessons of kindness and compassion most of us learned from our parents and elders\nseem to be slipping from the norms of our culture. We turn on the news and experience vitriol\nand ugliness from every angle of society. We see it in our media, we see it in our leaders,\nwe see it in our culture. I want a better world, ladies and gentlemen. I want a world where I can\nrespectfully disagree with my neighbor, yet share a meal or maybe a church pew with her. I want\na world where my grandchildren learned to respect others despite any differences. I want a world\nwhere civility and kindness and compassion are indeed the norm.\nIn Galatians chapter 5 verses 22 and 23, the Apostle Paul writes, but the fruit of the\nSpirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness,\nself-control against such things there is no law. In a country where approximately 65% of\nthe population identifies as Christian, it's a shame that we are seeing less and less\nof these virtues being lived out. The very trademarks of Christian identity are becoming\nlast and last visible in the ways that we treat each other.\nThe Christian Bible expounds on the themes of kindness and compassion and love over and\nover.\nI'm pretty sure that most other major world religions follow similar teachings.\nWhat would the world look like with more kindness, with more compassion?\nI would like to encourage each of you in these ways.\nLove, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness, and self-control.\nYou cannot go wrong with these behavior traits.\nBesides, my mother always said, make sure the fool you're arguing with it and arguing\nwith one too.\nI hope that you all will set the example, you.\nI hope that you all will set the example for our state and perhaps even for our country\nimproving that there is a better way for us and it follows the footsteps of Jesus. Some\nof you might be thinking, well, now wait a minute preacher, there was a time when Jesus\nwent into the marketplace with a whip and he took some names and kicked some flowers\naround. And I will respectfully remind you that you aren't Jesus. To the follow-up of\nmy young nurse, I asked her what she did that day in the intensive care unit. And with\ntears in her eyes, she looked at me and she said, Pastor May, with everything that was\ngoing on. I didn't know what to do. In one of the most profound moments of humanity, our\nsystem failed this young nurse. There was no role model, no mentor, no example of even\na common courtesy. Much less kindness and compassion is a fellow man lay dying in a state of the\nart hospital. Please don't misunderstand me. If I'm in an intensive care unit, I want\na nurse that's sharp as a tack. I want technicians that know what they're doing. But you know what\nwant more than that. I want somebody that cares about me. I want somebody that cares about\nothers. I want to know that they care. So it is with you. Some of you will win battles\nthis legislative session and some will lose. Either way, I pray that you will do it with\ncivility, with kindness and care for one another and for the people of Georgia. Each of you\nall have the opportunity to set the example. And when you do, you will be a better person\nfor it. There's a line from the song, let there be peace on earth. It says, let there be peace\non earth and let it begin with me. I pray that as you go about your business, this legislative\nsession, the kindness, compassion, and goodness will prevail. Let it begin with you.\nMr. Speaker, thank you so much for the wonderful opportunity of being with you all this\nhouse of representatives. Thank you all so much for serving, for giving\nof yourself in the service of our state. Thank you. Last you to stand and pray with me now.\nDear God, I thank you for this day and all the blessings that it brings.\nI thank you God for these who come to serve our state, giving of themselves tirelessly and\nsacrificially. I pray that you will guide their hearts and their minds from the enemy\nwho comes to kill and destroy. Feel them instead with your Holy Spirit and lead them in your\nways of kindness, compassion, and goodness. As they govern, pour out your favor upon them,\ngive them the peace of Christ that which surpasses all\nunderstanding. Watch over this house, our governor, and all who\nrepresent and serve our great state of Georgia, and we will\nalways give you the praise and the glory. In the name of Jesus\nChrist, I pray. Amen.\nI pledge allegiance to the flag of the United States of America and to the Republic for which\nit stands, one nation under God, indivisible with liberty and justice for all.\ndoorkeepers will unlock the doors.\nYou\nThe Chair recognizes Chairman Hogan, the Chair of the Committee of the Committee\non information and audits. Wait just a minute. What purpose does the majority\ncaucus whip rise? A series of parliamentary inquiries, Mr. Speaker, isn't it true\nthat the chairman of information audits are celebrating a pretty important\nbirthday today? That's the rumor that is all over the state of Georgia this\nmorning. And further Mr. Speaker, isn't it true that I have serious concerns on\nhis 82nd birthday whether we could trust the accuracy for him to remember what\nread this morning and what he saw. You have shared those very serious and\nprofound concerns with the chair. And furthermore, Mr. Speaker, one more final\nparliamentary inquiry. State your inquiry. Isn't it true that while I sell\nthis 82nd birthday today, Chairman Hogan doesn't look a day over 92.\nI'm not going to respond to that at your inquiry.\nChairman Hogan, Mr. Speaker, it's hard to have a friendship with the majority whip.\nMr. Speaker, you committee on information and all this has read the journal of the previous legislative day and\nFound it to be correct and furthermore, Mr. Speaker going home this week, and I found a new magnet on the refrigerator\nAnd it said be good to your children for they will select your nursing home\nThat's that that is words to live by there\nand happy birthday, Mr. Chairman.\nChairman Hogan, the chair of the Committee\non Information and Audits reports\nthat the journal of the previous legislative day\nhas been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's none and the journal is confirmed.\nThe clerk will read the resolution\nestablishing the order of business for the day.\nMr. Brown, Senator, if you know I've been following\nestablishes the order of business in the first part of the period unanimous\nconsensus, introduction of bills and resolutions, first reading and reference of\nhouse bills and resolutions, second reading of bills and resolutions, reports\nof standing committees, first reading and reference of Senate bills and\nresolutions, morning orders. Is there any objection to the adoption of the\nresolution establishing the order of business for the day? The chair here is\nnone in the resolution is adopted.\nFirst reading of bills and resolutions,\nthe clerk will read.\nHouse bill 753 by ribs and a smith of the 70th,\nJenkins is on the 32nd,\nbottom of the 72nd,\nsingled into the 71st,\nbuilding Todd and act to create the coedity county\npublic facilities authority.\nIntergovernmental coordination.\nHouse bill 754 by ribs and a benton of the 31st\nbuilding, Todd and act to amend and act to provide\nfor new charter for the city of Houston.\nIntergovernmental Coordination Senate bill 274 by Senator Thompson the 14th and Hustler the 52nd\nBill B. Todd and act to provide a homestead exemption from Bartow County's\nIntergovernmental Coordination Senate bill 275 by Senator Thompson the 14th Hustler the 52nd\nBill B. Todd and act to amend the act to provide for a homestead exemption from certain Bartow County school district ad\nValorant Act.\nIntergovernmental Coordination Second reading of bills and resolutions the clerk will read\nHouse Bill 748 by Rep. Petrie of the 166 Hogan of the 179th Sains of the 180th, the\nLurch of the 167th Stevens of the 164th and others, the bill relating to coastal waters,\nbeaches and sand dunes, House Bill 749 by Rep. Galliard of the 162nd, Stevens of the\n164th Hitchens of the 161st Mall of the 163rd, the bill to create and establish the Chatham\nCounty Building and Facilities Authority, House Bill 750 by Rep. Galliard of the 162nd\nNext, Stevens of the 164th, Hitchens of the 161st, Mallow of the 163rd built to create the Chatham County Legislative Game Prevention and Intervention Commission.\nHouse Bill 751, by representatives of the 11th bar of the 100th,\nthird choke is the 138th, next to the 69th.\nEvans of the 57th, the bill relating to the Georgia Student Finance Authority, House Bill 752, by representatives of Cooper of the 43rd,\nDempsey of the 13th, Ogan of the 179th, Oliver of the 80th, second hatchet of the 150th, the bill relating to mental health.\nResolution 372 by Representative Holley of the 111th Bill,\nfrom the 80th, he would leave the 136th Scalier\nwith 160 second, Campbell of the 171st and others,\na resolution urging members of Georgia's employment\nfirst counsel to develop recommendations\non how to best, how best to transition\ncurrent use of sub-minimum wage practices\nto competitive integrated employment options\nfor people with developmental disabilities,\nthrough second readers.\nReports of standing committees, the clerk will read.\nRepresentative Matt Dupnick of the 29th District Chairman of the Committee on Education\nsubmitted the following report and will speak to your committee on education.\nIs that any consideration following bills of the Senate?\nDoes the instructor meet the report same back to the House following recommendations?\nSenate Bill 88, Dupasse, Senate Bill 220, Dupasse by Substitute, Senate Bill 159, Dupasse\nby Substitute, Senate Bill 66, Dupasse, respectively submitted, Representative Matt Dupnick of\nthe 29th district chairman completes the reading the report to stand in\ncommittees. Okay, we're about to go on to morning orders. If you have signed up\nfor a morning order and you are in the balcony or in 341, you need to make\nyour way to the floor of the house.\nNeed to make your way to the floor of the house.\nWell, against my better judgment, well before we start morning orders, in honor of March\nMadness, Chair wants to let y'all know that we have a new timer in the well and up here\nto podium. So, green means the timer is running. Yellow, the shot clock is on. 30 seconds.\ntime is up and the microphone will automatically deactivate. Okay. Chair recognizes\nRepresentative Reeves, Chairman Perkel, Representative Anderson, Chairman\nChairman Cantrell, Chairman Dubnick, Representative Benton, and Chairman Lomston.\nThank you, Mr. Speaker, as the self-appointed Chairman and Dean of the Georgia Tech Caucus.\nThe Georgia Tech Yellow Jackets are the ACC champions.\nThe conference where basketball means more for the first time since 1993, 28 years, our\ngroup of talented individuals, many of whom were overlooked during recruiting, came together\nand won the ACC and we are dancing. We have a rich tradition. Here is my t-shirt from the 1990 final\nfour. Here is my t-shirt from the 2004 final four. Mr. Speaker, here is my t-shirt from the 1990\nfootball national championship, which doesn't have anything to do with basketball, but just wanted\nto remind everybody that 1990 happened after 1980, we are so excited. We have a great coach\nand Josh Paster. He has brought us back to relevance. Georgia Tech is on the map again and nobody\nwants to play us in the tournament. And in seven person disharmony, here we go. I'm a rambling\nwreck from Georgia Tech and a heck of an engineer. Heck of a heck of a heck of a heck of a heck of\nthe heck of an engineer.\nLike all the jolly can fellows\nwill drink my whiskey clear.\nI'm a ramblin' wreck from Georgia Tech\nand a heck of an engineer.\nGo!\nJagged Stingham!\nBzzzzz!\nBzzzzz!\nBzzzzzz!\nBzzzzzz!\nBzzzzzz!\nBzzzzzz!\nBzzzzzz!\nBzzzzzz!\nBzzzzz!\nYou know you can, uh,\nBzzzzzzzz!\nBzzzzzz!\nBzzzzzz!\nYou.\nBzzzzzzzz!\nBzzzzzzzz!\nBzzzzzzzz!\nBzzzzzz!\nSome things I just can't do.\nYou know, you can always tell those institutions that are just don't win often enough.\nThen when they do, they just kind of go nuts.\nSo enjoy this while you can because you know what September will be here before you know it.\nAnd you all got to play the citadel in football.\nGood luck with that.\nChair recognizes representative Henderson for a morning order.\nGood morning and thank you, Mr. Speaker, and good morning to the House of Representatives.\nI rise this morning to thank all of my colleagues\nthat contacted me during my family emergency.\nThank you for the enormous amount of love that you've given.\nThank you, Chairman Billy Mitchell, for contacting me\nand everyone that came under that umbrella.\nI just thank you so much from the bottom of my heart.\nThere's a scripture that says,\ndo I speak with tongues of men and angels?\nDo I have to get for prophecy and understand all mysteries?\nIf I don't have love, I am nothing.\nAnd thank you so much.\nThank you, thank you, thank you for the enormous amount\nof love that you've shown.\nThank you and thank you, Jesus, for all that he's done.\nThank you, Mr. Speaker, I yield back.\nTo your recognizes, Chairman Ballinger, for a morning order.\nThank you, Mr. Speaker.\nAs you know, we're honoring women this month.\nSo today, I would like to bring your attention\nto two extremely awesome women in fellow Americans.\nCondi Rice was born in November.\nShe is an American diplomat, political science,\ntest civil servant, and professor, who\nis the current director of the Hoover Institute\nat Stanford University.\nShe served as a 66th United States Secretary of State\nfrom 2005 to 2009.\nand the 20th United States National Security Advisor\nfrom 2001 to 2005,\nshe was the first woman to serve\nas the National Security Advisor.\nThe second woman that I would like to bring your attention to\nas a homegrown Georgian, Nancy Hart,\nwas probably the most acclaimed female participant\nduring the Revolutionary War.\nShe was a devout patriot.\nShe gained notoriety during the Revolution\nfor her determined efforts to rid the area of Tories,\nEnglish soldiers and British sympathizers.\nShe was born in North Carolina in 1735 and made her way into Georgia eventually settling in the\nfertile broad river valley with her family. She was a tall gangly woman who towered six feet in height.\nHer physical appearance was matched with a feisty personal demeanor characterized by a hot headed\ntemper, a fearless spirit, and a pinchant for exacting vengeance upon those who offended her\nor harmed her family and friends. She was an expert herbalist, a skilled hunter, and an excellent\nshot. The most famous story of Hart's escapades as a frontier\npatriot was when she shot two toys and had four more strung up\nand they were later hanged. In 1912, workmen grating a railroad\nnear the side of the Old Hart cabin on Earth, a neat row of six\nskeletons that bear witness to this truth.\nGeorgians have memorialized Nancy Hart in a number of ways.\nHart County is named after her. Albert County's neighbor to\nthe north was named for her as well as its county seat,\nheart well and the general area Lake in the general area the Nancy Hart Highway\nGeorgia Route 77 commemorates the legendary woman and in 1977 Nancy Hart\nwas inducted into the Georgia Women of Achievement. Mr. Speaker I yield\nthe well chair recognizes for a morning order chairman hatchet representative\nto approve it, Representative Mathis,\nRepresentative Camp, and Representative Mack Jackson.\nThank you, Mr. Speaker.\nGlad to have my colleagues at Represent Lawrence County,\nRepresentative Mack Jackson, our neighbor,\nand Representative Beth Camp, a former alumni\nof Dublin High School.\nThank you for standing as I under the lives of Dr.\nJerole Stucky, his wife, Alicia, their two-year-old son,\nAJ, and their unborn daughter.\nJerole was a 32-year-old principal of Dubman High School\nto his alma mater.\nHe stood right over there almost a year ago when we\nwe honored the 2019 AA State Champion football team and Ms. Pearl Whitlock for her 50 years\nof service to Dublin High School. They sat there quiet and smiled the whole time.\nAlicia was a nurse at the Carl Vincent VA Hospital. They were the model family.\nJeroly touched so many lives, young and old,\nwith his quiet demeanor, his kindness, and his humbleness.\nHe was a leader.\nThe staff of Bevin High School and the students\nlooked up to him.\nOur communities in shock was this family\nperished in a multi-vehicle, multi-tracked\nor trailer accident on I-16 in Billy County yesterday.\nWe can only imagine the many lives\nthat would have continued to be touched and molded\nby him and his family over the coming years.\nMay we please take a moment of silence\nfor the Dublin community, Dublin City Schools,\nthe staff and students of Dublin High School,\ntheir parents, Mrs. Anita and Larry Foreman,\nand the Reverend Mrs. Isaiah L. Stevens.\nThank you, Mr. Speaker, and I know we all celebrated the speaker's birthday that was yesterday,\nbut today I rise because I wanted to wish a happy 79th birthday to my grandmother, Maddie\nmake Hendrick. She is currently a constituent of representative Shannon's\ndistrict, but she was born right here in the state of Georgia and mom to two\nkids, one of which is my dad. And she spent over 40 years cleaning the homes of\nwealthy people and she wasn't able to get her high school diploma. The first\ntime that she could walk through the front door of her white clients I was\naround three or four years old, but because she walked through those back doors\nI'm able to walk through their front door of the chamber.\nAnd so I just wanted to wish her a happy birthday.\nBut since we're talking about birthdays, Mr. Speaker,\nlet me take this time to do my annual rent,\nbecause my birthday is outside of the legislative session\non August the 28th.\nAnd I don't get to hear the speaker say my name,\nand I don't get an round of applause from my colleagues.\nSo right now, if your birthday is outside\nof the legislative session, please stand up.\nSo that your colleagues can give you a round of applause\nbecause your birthday is outside of the legislative decision.\nThank you, Mrs. Chair.\nChair recognizes Chairman Darling Taylor\nfor a morning order.\nThank you, Mr. Speaker, members of the House.\nToday, in honor of Women's History Month,\nI bring you the history of a young woman\nthat took her desire to make a difference\nanchored it firmly in a hometown of Cairo, Georgia.\nAs a young girl, Wessie Cannell, took her doctor's advice\nand became a librarian so she would work in a quiet environment.\nThe quiet didn't last long, as she quickly\nembarked on a personal ambassadorship\nto all the schoolchildren of Grady County\nto expose them to the wonders of books.\nIn 1939, Wessie became the Cairo's first librarian,\nstarting off in a room above the fire department.\nThis petite young woman had a fiery determination\nto reach the young people with the joy of reading\nand sought to be the figured, figure out ways to reach them.\nWhen the library ran out of books,\nWestie would tell the children's stories\nto keep them interested while she waited\nfor the books to be returned.\nShe had innovative ways to reach.\nWestie used her innovative mind to fill the needs,\nprobably not realizing she was making history\nwith her unique ideas.\nThose ideas included story time, branch libraries, book\nmobiles, and other outreach programs.\nHer award was numerous, including a top flight woman\nfrom the Business and Professional Club of Georgia.\nMs. Westie may not have lived in exotic places,\nbut her dedicated work made a huge difference in Cairo\nand all across the country.\nShe was a visionary who brought the world\nto the children adults of her hometown.\nfor her dedication to bring the joy of reading,\nto just all the people of her area,\nshe became an honored Georgia woman of achievement.\nThank you, Mr. Speaker, I yield the well.\nTime for morning orders has expired for today\nand we did not get to everyone.\nIf you signed up today and want to sign up\nfor tomorrow, please let the messenger know that,\nWhat purpose has represented Duna who rise?\nMr. Speaker, I would like to make sure\nof a clarification here.\nIs it not true that Georgia Tech\nis a parliamentary inquiry?\nYes, sir, it is.\nState your inquiry.\nI was going to make sure that everybody understood\nGeorgia Tech won on default\nbecause all the other teams had COVID.\nThat's an accurate statement.\nWe're going on now to the rules calendar.\nGoing on to the rules calendar.\nThe clerk will read the caption to Senate Bill 5.\nSenate Bill 5 by Senator Compatric in 32nd Berk of the 11th once and the 1st of Stettler\nof the 52nd and hour of the 48th to be entitled back to men, title 43, the fish go to George\nAntetta relating to professions of businesses, so as to provide patient protection measures\nPatients undergoing sedation in certain settings just build them referred to the committee on health and human services that committee recommends that this bill do pass\nBy committee substitute chair recognizes chairman Lee Hawkins to present the bill\nThank you, mr. Speaker I bring before you today\nSenate bill five by center cake her Patrick\nVery good bill as always center her Patrick has done a lot of good work in this area\nthis bill actually ensures patient protection by addressing sedation in patient\nsettings and offices and particularly Medispires. Medispires sort of a new thing\nthat's happening where people can go in and have liposuction, have some wrinkles\nremoved, maybe have some implants done and all in one day and be home at\nlaunch. Quickly, Section 1, one is existing code. It's in the dental section, right now\npresently, Dennis, that due, conscious sedation, have to have a conscious sedation permit,\nrequires not only testing, but in office visits to verify that everything's being done correctly\nto examine the equipment and to make sure they have pulled sawmeters, that type of thing.\nSection 2 of the bill actually addresses this is a new code section and addresses dental\nassistance and dental hygienist doing phlebotomy and binopuncture.\nThis is something they've been doing and oral surgeons often typically observed when\nthe dental board comes in to do the observations.\nThis puts it in code and describes their education.\nSection three is a new section in the medical practice\ncode, which establishes and puts in the terminology\nmetispies as it does in the earlier section\nof the dental section.\nReally, this is pretty much what the bill is doing.\nI don't know that there's anything much more to be\nsaid about this, and if there are no questions, Mr. Speaker, I'll yield the\nwill. You have a question if you care to yield. Do I get to know who it is first?\nSorry. I mean, if it's Carpenter, I would prefer to yield the will. You can't tell me\nI'll yield the will. Okay. Do you yield for questions? Yes, sir. Chair recognizes\nrepresentative Carpenter to your right for a question.\nDoes the gentleman yield?\nIs it not true that this bill will provide safety measures to ensure that Cardi B's backside\nimplants will be safe and ensure a lifetime of effectiveness?\nYou promised me you wouldn't get into this booty bill thing, but yes, this provides protection\nfor any type of procedure in an outpatient setting.\nAny further questions?\nYou do have one more if you care to you.\nI'll yield.\nChair recognizes Representative Cannon to your left for a question.\nThank you.\nDo you yield?\nYes, ma'am.\nSo does this legislation include teeth whitening that they would be doing at these medispa's\nand other kind of cosmetic procedures?\nThey can do that at the medispa's.\nYeah, it does.\nAnd so this legislation would restrict that, their ability?\nWith this legislation, what?\nRestrict their ability to do so.\nNo, no, no.\nIt only really applies to the anesthetic portion of anesthesia.\nYeah.\nWith no further questions, I'd ask for your questions.\nNo further questions.\nThank you, sir.\nI'd ask for your favorable consideration on SB5.\nThank you.\nIs there any objection to the previous question being\nThe chair here is none the previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe chair here is none the report of the committee has agreed to.\nShall this bill now pass all those in favor of the passage of the bill will vote aye?\nThose opposed will vote no, and the clerk will unlock the machines.\nWhat purpose does representative Holly rise?\npart of the minute we take your inquiry sir is it not surprising that one of\nour members is actually focused on a rapper's body a woman's body just I'm\nsorry just our members always surprise me thank you sir I really don't know\nI don't know what to say to that, but I have all members voted, I have all members voted.\nIf so, the clerk will lock the machine on the passage of Senate Bill 5.\nThe eyes are 160.\nThe nays are 5.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe'll read the caption to a group of privilege and resolution.\nRecognizing commending, Shannon Blair,\nPates Creek Elementary School Teacher of the Year, 2021,\ncommending Rianna Scott, Thurgood Marshall Elementary Schools, 2021, Teacher of the Year,\nrecognizing commending the Center for\nPanation Community Services Incorporated,\nRecognizing commending police chief Jesse Patton for his more than 32 years of dedicated service to the city of Locust Grove\nCommending graduating to conures cherry blossom festival for other outstanding efforts\nCommending the Clayton County Chamber of Commerce and recognizing February 10th 2021 is Clayton County chamber day at the state capitol\nAnd for other purposes that completes the reading of privilege resolutions\nIs there any objection to adopting the privilege resolutions?\nthe chair here is none and the resolutions are adopted going on now to announcements going\non to announcements chair recognizes the chair of the minority caucus chairman Mitchell for\nan announcement.\nThank you, Mr. Speaker.\nThere will be a minority caucus meeting via Zoom today at 12 noon, and lunch will\nbe provided in room 216.\nThanks again, Mr. Speaker.\nChair recognizes Chairman Lynn Smith for an announcement.\nThank you, Ms. Speaker, members of the House.\nTomorrow morning, 8 o'clock, 6 o'clock, 6 o'clock, 6 o'clock, CLEOV.\nThere will be a committee meeting, full committee meeting.\nWe'll take up one bill and you should get a notice this afternoon.\nThank you.\nChair recognizes the Chair of the Banks and Banking Committee, Chairman Morris, for an announcement.\nThank you, Mr. Speaker.\nFor the members of the Banks and Banking Committee, we will be meeting today to hear Senate Bill at 330 and room 341 here in the Capitol.\nThat's 330, room 341 in the Capitol.\nThank you, Mr. Speaker.\nChair recognizes Chairman Chokas for an announcement.\nThank you, Mr. Speaker.\nThe Small Business Development Committee will be meeting tomorrow morning at 8 a.m.\n506.\nIt's going to be a great meeting.\nWe've got angel investors in the Department of Association.\nThank you.\n506.\n8 a.m.\nChair recognizes representative Rick Williams for an announcement.\nThank you, Mr. Speaker.\nThe subcommittee of alcohol and tobacco will meet this afternoon at 2 o'clock in CLEOB606.\nAlso the state and local government committee will be meeting at 330 this afternoon in CLEOB506.\nThank you.\nWell, we've already acknowledged this, but it can't hurt to do it again.\nLet's wish one more time, Chairman Don Hogan.\na happy birthday.\nChair recognizes, Chair recognizes the majority leader for a motion.\nThank you, Miss Speaker.\nI move that this house stand adjourned until 10 a.m. Tuesday, March 16th, 2021.\nThe majority leader has moved that this house stand adjourned until Tuesday, March 16th.\nAt 10 o'clock a.m., all those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it.\nThis house will be adjourned until Tuesday at 10 a.m.\n",
  "updated_at": "2026-02-12T13:50:23.344549+00:00"
}