{
  "video_id": "e8v85EbAc6k",
  "url": "https://youtu.be/e8v85EbAc6k?t=638",
  "title": "Georgia House - Day 19 (2026-02-12)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 19,
  "video_date": "2026-02-12",
  "duration_minutes": 52,
  "summary": "Here is a summary of the Georgia House session from 2026-02-12:\n\n**Overview**:\nThis session focused on several key pieces of legislation, including bills related to solar power financing, increased penalties for cruelty to children, and updates to insurance and fire safety regulations.\n\n**Key Actions**:\n- **HB 300**: Provided protections for landowners entering into solar power facility agreements and maintained the balance of solar energy integration in the state's power mix.\n- **HB 1022**: The \"Colton McNeal Act\" increased penalties for first and second-degree cruelty to children, especially involving disabled minors.\n- **HB 984**: Updated practices of the Department of Insurance and Office of the Safety Fire Commissioner.\n\n**Bills Introduced (First Reading)**:\nNo new bills were introduced during this session.\n\n**Notable Moments**:\n- Representative Trade Kelly presented HB 300 and worked with the Agriculture and Consumer Affairs Committee to avoid referring to solar facilities as \"farms\".\n- Representative Sainz presented HB 1022, the \"Colton McNeal Act\", to increase penalties for cruelty to children cases, which were described as some of the most difficult to prosecute.\n- Representative Lumston presented HB 984 to update insurance and fire safety regulations.\n\n**Votes**:\n- HB 300 passed 146-0.\n- HB 1022 passed 158-0.\n- No other recorded votes mentioned.\n\n**Attendance**:\nNo quorum issues were noted.\n\n**Adjournment**:\nThe session adjourned without a specific next meeting date provided.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nI'm going to be talking to the floor and take your seats.\nMr. Clark, how about ring the bell?\nYou\nYou\nMembers will return to the floor, take your seats, take your seats please, members return\nto the floor.\nMr. Clerk, will you read the caption to House Bill 300?\nHouse Bill 300.\nHouse Bill 300, my wife, Senator Kelly, the 16th and others, to be entitled to enact to\namend Part 4 of Article I on Chapter 3, Title 46 of the Efficient Quoted Georgia Annotated\nRelating to Solar Power, Free Market Financing, so is it required for the establishment of the\nSolar Technology Trust Fund, this bill that refer to the Committee on Energy Utilities\nand Telecommunications, that committee recommends that this bill do pass by committee substitute.\nMembers, we are about to discuss a very, very important issue for our state's future.\nYou'll give the gentleman in the well your attention.\nRepresent Trade Kelly is recognized to present the bill.\nMr. Speaker, members of the House, I come before you today with House Bill 300, which looks\nto do two things. First, it looks to provide some certainty and protection for landowners\nwho enter into solar power facility agreements with those who lease the property from them\nto build out the solar power facilities. Second, it looks to maintain the balance that\nwe've seen in our state and the success we've seen as a state integrating solar into our\npower mix without placing undue burns on those who want to continue building out those facilities,\nwhile also protecting our property owners who are leasing that land to them. I want to thank\nChairman Don Parsons for giving us the ability to work on this bill over the session,\nover the summer. We started at last session and worked over the summer on the measure to\nperfect it and I want to thank him for allowing us to put together a working\ngroup on that and those who served on the working group. Mr. Speaker I know we\njust came back from lunch but I'll be glad to answer any questions. You have a\ncouple. I'll yield. I'm going to take the most important one first. He's not the\nfirst one. He has a button but Chairman Robert Dickie that chairs the\nagriculture and consumer affairs committee. Chairman Dickie. Back from his\nspeaker does the gentleman yield? I'll yield of course, yes sir. I just want to thank you for your\nlot of work on this bill through the time and I just want to ask you is some terminology you\ndid not include in this bill and nowhere in this bill that you refer to the solar power facilities\nas farms and I appreciate that and I thank you for that and these facilities do not\nto grow anything for us to eat.\nSo thank you for that.\nThey provide a valuable resource to us in terms of power\nsupply, but they don't grow those delicious peaches\nthat I like to get down to Moussella.\nWe had that good on peaches.\nI'm not sure.\nBut I like peaches, too.\nYou have no further questions.\nThank you, Ms. Speaker.\nYou had the well and asked for this body's\nfavorable consideration.\nThe gentleman has yielded the well.\nIs there an objection to the previous question\nbe in order. Chair has done the previous question is ordered. Is there any objection to adopting\nthe Committee's substitute? Chair has done the Committee's substitute is adopted. Is\nany objection to agreeing to the report of the Committee which was favorable to the\npassage of the bill? Chair has done the report the Committee is agreed to. Shall this bill\nnow pass? All in favor of the bill? We'll vote yes. All those opposed will vote no and\nthe clerk will unlock the machine.\nhave all members voted, all members voted for what purpose is representative Williams\nrise? Parliament inquiry. Oh, really, a request. I'd like to be excused under the\nKoch Chokas rule on this vote.\nI was wondering what this had to do with Cherry Wine, but I now get it.\nGentlemen, so state, see, you will be excused from the vote. What all members\nvoted. If so, the clerk will lock the machine on the passage of HB 300. The\nyeas are 146. The nays are zero. The bill having received a requisite\nconstitutional majority is therefore passed. Mr. Clerk, will you read the\ncaption to House Bill 10221022?\nHouse Bill 1022 by Representative Sainz of the 180th and others to be entitled back to amend Article 5 of Chapter 5 and Title 16 of the\nFisher go to Georgia and say to relating the cruelty to children so stand act the Colton McNeal Act.\nMs. Bill, I'm referring to the Committee on June 5 Justice that committee recommends that this bill do pass.\nChairman Sainz is recognized to present the bill.\nThank you, Mr. Speaker, members of the House, this bill titled Colton McNeill Act for Colton\nKing, a member of my district, a beautiful five-year-old soul who at the age of two had a\ncruelty to children's statue placed against a perpetrator, housing his home, his mom's\nadvocated for increased sentencing based on what happened in their family situation.\nThis simply modifies the cruelty to children's statue for the first and second degree and increasing the penalties having the first degree go from five to 20 years to 15 to 30 years and the second degree going from one to 10 years to 10 to 30 years with only in the instances that that child is defined as a disabled minor which is the first part of the bill in line 16 and below with that Mr. Speaker I'll yield the well if there's no questions.\nYou do have a question or yield for one represent Tony Miller to your left in\nthe back. Representative Miller you're recognized. Thank you Mr. Speaker.\nDoes the gentleman yield? I do. Chairman Saints just to clarify the sentencing\nprovisions that set forth in the bill. They do not require mandatory minimum\nsentencing but keep in in keep in line the same discretion that courts have to\ndecide a sentence based on the facts of the cases that correct. The general\nlady is correct it doesn't modify any of the ability to stay probate or\nsuspend it simply parallels the language within the first and second\ndegree and increases it increases the range there. Does the gentleman yield for\none more question. I do. Is it not also true, Chairman Sains, that these cases are some\nof the most difficult cases to prosecute and are often some of the worst cases of child\nabuse that we see in our state that's justifying an increase in penalties? I think this house\nhas an opportunity to take a stand in ensuring that those who perpetrate crimes to the most\nvulnerable amongst us are penalized to the degree that they should and with that Mr. Speaker\nall you'll do well.\nThe gentleman's yielded the well.\nIs there an objection to the previous question being ordered to chair his none?\nThe previous question is ordered.\nIs there an objection to agreeing to the report of the committee which was favorable to the\npassage of the bill?\nChair his none.\nReport the committee is agreed to.\nShall this bill now pass?\nAll in favor of the passage of the bill will vote yes.\nAll those opposed will vote no and the clerk will unlock the machine.\nhave all members voted what purpose is representative Reese rise he\nways. All members voted. If so, the clerk will lock the machine. On the passage of House\nBill 1022, 1022, the yeas are 158, the nays are zero. The bill having received the requisite\nConstitutional majority is therefore passed. Mr. Clerk, will you read the caption to House\nbill 984-984.\nHouse bill 984 by Representative Lomston of the 12th and others to be titled an act to\namend titles 25 and 33 of the official go to Georgia annotated relying to for higher\nprotection and safety and insurance respectively so is to update the practices of the Department\nof Insurance and the Office of the Safety Fire Commissioner.\nMs. Bill ever referred to the committee on insurance,\nthat committee recommends this bill do pass.\nChairman Lumston is recognized to present the bill.\nI apologize, I didn't see you.\nThank you, Mr. Speaker.\nMembers of the House, I bring to you House Bill 984.\nThis is the Department of Insurance Bill.\nThe bill does three things.\nFirst, it sets the framework for off due to use\ndepartment vehicles by post certified officers of the Department of Insurance.\nThe second thing it does is it deletes a subsection of state law to bring us into compliance\nwith national association of insurance commissioners, model law dealing with small cap life insurance\ncompanies.\nAnd the third thing it does is to require that insurers waive the age requirement for\ndependents with a developmentally disability or physical disability and allow them to remain\non their parents insurance or be added to their parents insurance policy. That's what the bill does.\nAppreciate your favorable consideration. I'll answer any questions.\nGentlemen, did you yield? Do you have a question if you? Yes.\nChair recognizes representative Jasmine Clark to your left.\nRepresentative Clark has recognized for a question. Thank you, Mr. Speaker.\nJudge gentlemen, yield. I yield. I just have a clarifying question on the section about\nindividuals with developmental disabilities or physical disabilities does that\nmean that they can be on the dependent coverage for indefinitely like there is\nno age limit whatsoever. There's nothing in the bill that addresses the age\nlimit it says if they fall into that category they can be on their parents either\ncontinue to be on their parents policy or be added to their parents policy. Thank\nyou.\nYou have no further questions with that I'll yield the well and the gentleman is yielded\nthe well is there an objection to the previous question being ordered chair his none the previous\nquestion is ordered is there an objection to agree into the report of the committee which\nwas favorable to the passage of the bill chair his none the report the committee is agreed\nto shout this bill now pass all in favor of the passage of the bill will vote yes all\nAll those opposed will vote no and the clerk will unlock the machine.\nHave all members voted, all members voted.\nIf so, the clerk will lock the machine on the passage of House Bill 984.\nThe yeas are 158, the nays are zero.\nThe bill having to receive the requisite constitutional majority is therefore passed.\nMr. Clerk, will you read the caption to House Bill 997?\n9.97 by Representative Corbett of the 174th and others to be taught on an act to amend Code\nSection 45, 151 of the fish go to Georgia and annotate everything, the disqualification\nof driving and action required after suspending, revoking, or canceling license or non-resident\nprivileges.\nThis bill I would refer to the Committee on Motor Vehicles, that committee recommends\nat this bill do pass.\nChairman Corbett is recognized to present this bill.\nChairman Corbett House bill 997.\nThank you, Mr. Speaker.\nMembers of the House, I'll bring you\nbefore your House bill 997, LC394096.\nThis is a Department of the Driver Services bill brought\non their request.\nWhat we're doing with this bill is the Federal Motor\ncare, safety administration, FMCSA, commercial drivers,\nlicensed drug and alcohol clearing houses,\na secure online database that centralizes records\nof the FMCSA drug and alcohol program violators.\nWhat we're doing with HB997, we're streamlining the\nnotification to the State Department of\nDriver Services when a customer is prohibited from a\nCDL and adds a layer of safety, making it more\ndifficult for drivers to conceal their drug and alcohol program violations from the current\nor prospective employers and evade the CMV driving prohibition. Currently, CDL holders\ncan employ shop once they are notified of their violation because the current process\nis not streamlined. This bill provides all parties real-time information. It also streamlines\nthe reinstatement of the driver's CDLs on the back end once they've completed the\nrequirement or valuation or treatment that the FMCSA requires that it streamlines the\nreinstatement portion of their license back to them as well.\nSo that's what the bill does, Mr. Speaker.\nI would ask for everybody's favorable consideration.\nYou have no questions.\nThank you.\nIs there any objection to the previous question being ordered that Chair has done?\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee which was favorable to\nthe passage of the bill. Chair here's none. The report of the committee is\nagreed to. Shall this bill now pass all in favor of the passage of the bill?\nWe'll vote yes. All those opposed will vote no and the clerk will unlock the\nmachine.\nhave all members voted. If so, the clerk will lock the machine on the passage of House\nBill 997. The Yades are 162. The NA is one. The bill haven't received the requisite\nConstitution majority is therefore passed. Mr. Clerk, will you read the caption to House\nbill 1044-1044.\nHouse Bill 1044 by Reps. Anderson of the 10th and others to be titled\nNAC2MEN, chapters 10 and title 13 of the official go to Georgia and TATA\nrelating to contracts for public works, so is the increase of dollar value of\ncertain public work contracts exempt from the provisions relating to\nretention of contractual payments. This bill I'm referring to the committee on\nThe Governor and the Affairs Committee recommends\nthis bill do pass.\nRepresentative Victor Anderson is recognized\nto present the bill.\nThank you, Mr. Speaker.\nColleagues, today I bring before you house bill 1044.\nIf that caption of the bill sounded familiar, it should.\nWe passed this bill last year in this chamber\nin pretty much the same form it is now,\nbut we've added some things to it.\npassed out of here with 164 votes passed out of the Senate and the governor's office decided\nthey wanted to add to the bill. So last year's bill, which was House Bill 193, addressed\nthe public works project purchasing limits for county and municipal governments. That's\nchapter 36. The governor's office wanted this to extend to other statewide departments.\nSo we've included Title 13, Title 20, and also a portion of Title 50.\nIn preparing for this revision and reintroduction of this bill, we checked with every department\nin the state that could potentially be impacted, gave them an opportunity to either opt in\nor opt out.\nAnd House Bill 1044 is what we have that I present for you today.\nMr. Speaker, I'll be all for any questions if there are.\nRepresentative, you have no questions.\nI have one.\nYes, sir.\nMy recollection serves me adequately.\nI think it was cloudy the day we passed this one last year and rainy.\nWas it not?\nIt absolutely was.\nMany of us refer to that day as Sinko de Vito.\nSometimes I should just keep my mouth shut.\nThere's no doubt about that.\nYou have no further questions.\nAsk for your favorable consideration, and I yield the will.\nIs there any objection to the previous question being\nordered?\nHere's none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the\ncommittee, which was favorable to the passage of the\nbill the chair here is none the report the committee is agreed to shall this bill now pass all in\nfavor the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock\nthe machine\nhave all members voted, all members voted.\nIf so, the clerk will lock the machine.\nOn the passage of House Bill 1044, the Yays are 154,\nthe Nays 8, the Bill haven't received\nthe requisite Constitutional majority, is therefore passed.\nMembers, because we have some important issues,\nwe need to take up and committee date.\nWe will postpone House Bill 1037 and House Bill 925 to the next legislative day.\nAll right.\nWe have a couple of afternoon orders.\nI want you to give your attention to the member in the well, especially on this first\none.\nRepresentative Gladney in the Augusta delegation, Representative Gladney in the Augusta delegation.\nIf you'll stand with us, please, members,\nrepresent Gladby and the Augusta delegation.\nThank you all.\nToday we'd like to honor the honorable Ed Taver,\nwho represented the Augusta area in the Georgia State Senate\nand served as U.S. Attorney for the Southern District of Georgia.\nHe responded to his final calling on this past Friday\nat the age of 64.\nThe distinguished gentleman, Tarver, was born in 1959\nand graduated from Augusta College\nbefore enlisting in the United States Army.\nHe earned a law degree from the University of Georgia\nin 1991.\nFrom 2005 to 2009, Tarver represented\nGeorgia's 22nd District in the Georgia State Senate.\nAnd later, in 2009, he was sworn in as the first black United States attorney from the\nSouthern District of Georgia.\nHe was a member of the Omega-Sci5 fraternity, Incorporated, and the alpha-mobile lay of the\nSigma-5-5 fraternity, Incorporated.\nHe is survived by his wife, Dr. Carol Dale Tarver, and his children.\nPlease bow your heads in a moment of silence and honor of his service.\nThank you, Mr. Speaker.\nI yield the well, sir.\nA very fine gentleman who served this state with distinction, he will be missed, prayers\nfor his family, representing Mike Cameron, you're recognized for an afternoon order.\nPlease get the gentleman your attention.\nThank you Miss Speaker.\nI rise today to remember one of our great teachers in Walker County, Georgia, who passed\naway last week.\nMary Biss Smith was originally from Ohio.\nShe came to Chattanooga to a Tennessee Temple University to get her teaching degree.\nShe met her husband Michael.\nThey spent a lifetime together.\nA few weeks ago, she didn't feel well one day.\nSo Michael took her to the hospital and she'd been diagnosed with advanced pancreatic cancer and she only lasted about three and a half weeks\nBut during that time she showed courage and joy that very few people show in that kind of situation\nAnd she passed away last week and she'll be remembered not only in the community\nShe was treasurer of Walker County GOP\nBut she invested herself as so many young people and helped so many young people over the years that that memory will never go away\nWe mourn, and the teachers, the staff at Ridgeland,\nhigh school and miss are especially.\nI'm like a moment of silence, please.\nThank you, Mr. Speaker, I yield the well.\nPrears for the family.\nChairman Dickie recognized for an afternoon order.\nThank you, Mr. Speaker and colleagues.\nAppreciate you recognizing Georgia today.\nat their birthday, 291st, birthday.\nAnd I just thought members of this chamber\nwould like to know a little bit more history.\nI'm a lover of history.\nAnd so Ogathorke got the idea for the colony.\nAfter he learned that a friend had died in debtors prison.\nHe and several other men approached King George's second\nwith this idea.\nThe colony was to be named for the king.\nIn a group, the trustees would govern the colony\nfor the first 21 years.\nThere were four reasons for establishing the colony of Georgia.\nRelief of poor subjects, a home for debtors,\na defensive barrier for South Carolina against the Spanish\nwho went Florida, trade, the production of wine and silk,\nand a home for persecuted European Protestants,\nlike many of the other colonies.\nThe boundaries were from the Savannah River on the north\nto the Altamhar River on the south\nand from the Atlantic Ocean on the east\nand believe this all the way to the Pacific Ocean on the west.\nGeorgia was only successful in two of these\nas a barrier against the Spanish and a home\nfor persecuted Protestants.\nNo debtors ever came to Georgia\nand they were not able to produce wine and seal in any quantities.\nTwo groups, interesting enough, were not allowed in the beginning.\nThey were Catholics and slaves.\nTwo occupations also were not allowed to come to the beginning.\nThey were liquor dealers and lawyers.\nThe trustees considered lawyers the scrunch of mankind.\nAnd that's your history lesson for Georgia today.\nThey had a lot in common, still do, probably, we don't worry about that later.\nRepresentative Reese, recognize for and afternoon order.\nThank you, Mr. Speaker.\nAs many of you know, there was a big game on TV last night.\nSome of you may have watched it. Some of you may have not.\nBut I tell you there was one man in my district who was decided to watch it.\nAnd that's 87-year-old retired command sergeant major William McKinley-Mail.\nHe was excited to watch it because his grandson, Wilbur Williams, was the trombone player\nfor us last night.\nIt was a very proud moment from him and a very proud moment for me because Mr. Williams\nattended Carva High School, which is in House District 140.\nMr. Williams has also toured with Tyler Perry and performed now at the Super Bowl.\nWe think that's quite an accomplishment.\nBut in fact, Mr. Speaker last night was a display of the great talent that we have here\nin Georgia.\nIt's a testament to our music industry and the entertainment industry that we have in\ngeneral.\nTo see Usher, Little John, and Ludicrous all on the stage together just truly warm our\nheart.\nAnd it's a fact that we are a superior and dominant display of the wealth of talent in the state\nof Georgia.\nThe cheese may have warned the game, but Georgia warned today.\nThank you, Mr. Speaker.\nI year the will.\nMr. Chairman, we're glad you could make it from the ballgame back here to be with the\nstate.\nYou just forgot your cap.\nThat's the only thing.\nIf y'all know what I'm talking about, look at him.\nRepresentative Gamble is recognized for an afternoon order.\nThank you, Mr. Speaker.\nI'm honored today to have Mr. Steven Schumacher here, the president of only in Carter'sville\nBartow County, which is also our Convention and Visitors Bureau, and I thought it would\nalso be a good opportunity to remind the Chamber that in Georgia in 2022, 168 million visitors\ncame to our state to tour and to vacation.\nAnd of that, we had $39.8 billion in direct spending and $73 billion in spending total\nthat that industry brought to our state.\nIt represents approximately 442,000 jobs in our state.\nRecently, Stephen and his staff there at only in Bartow\nhosted the Georgia Association of Convention and Visitors\nBureau's conference that Jay Mark Walter led.\nMany of y'all know Jay up until his move\nover to the Department of Economic Development,\nwhere he now is the statewide tourism director.\nBut Stephen and his staff put that together\nto bring people to our community,\nbut that conference moves around the state\nand has been in many of our communities\nas it moves annually.\nAnd so the final thing I'll mention is Mark Jaronski\nand the team at the Department of Economic Development\nthat oversee tourism to a fantastic job.\nWe have a lot to be proud of.\nAnd I just wanted to take the opportunity\nto welcome Stephen and to mention\nand highlight how important tourism is to our state.\nThank you, Mr. Speaker.\nThank you, and welcome Stephen, floor lead of McDonald, Governor's floor lead is recognized\nfor an afternoon order.\nThank you, Mr. Speaker, colleagues.\nArise today to thank our men and women in uniform.\nIn recent weeks, we've been reminded here in Georgia about the rest of these men and\nwomen take every day to keep us safe.\nWe as Georgians will not forget these men.\nCrawford County Deputy Timothy Rivers was killed in the line of duty on February 6th.\nState Trooper Jimmy Siskar was killed in the line of duty on January 28th.\nCalvita County Deputy Anthem Manics was killed in the line of duty on January 4th.\nAnd that's just this year.\nWe heard the weekend of a shooting at Lakewood Church in Houston that could have been much worse,\nbut for our off-duty law enforcement that were at the church and were able to respond\nquickly and decisively, the thin blue line is real.\nThese men and women keep us safe every day, seeking to maintain law and order in this\ncapital, in the city of Atlanta, and across this great state of Georgia.\nAs we saw in Texas, these aren't nine to five jobs.\nThese men and women give us, they're all, every day.\nAnd I believe this entire house owes them a debt of thanks.\nMr. Speaker, I yield the well.\nThank you, sir.\nRepresentative Nullowicz has recognized for an afternoon order.\nThank you, Mr. Speaker.\nI wanted to make sure everyone here knew something\nthat we were very proud of in Cobb County,\nand that is that our Cobb County Sheriff's Office\nhas received the accreditation.\nThey've attained accreditation\nfrom the top three law enforcement accrediting agencies\nin the country, which means that the Sheriff's Office\nand Sheriff Prick Owen have been awarded\nthe Triple Crown Award from the National Sheriff's\nAssociation.\nI just wanted to make sure everyone knew\nthat we were very proud of him getting that honor\nproud of the work that our Sheriff's Office is doing. Thank you. Thank you\nRepresentative. That's great to be recognized and to sure we all know about\nit. Representative McCullum is recognized for an afternoon order. Did a fine\njob earlier today? Thank you. Thank you, Mr. Speaker. Mr. Speaker has 20-year\nfirefighter and marine veteran and the father of a police officer. I rise today to\nI thank those of my colleagues that have joined me in standing up in our law enforcement community here in Georgia.\nIn our 2024 budget, we've provided $4,000 raises to law enforcement officers.\nWe've recently passed SB 63 to keep folks in jail when they put our law enforcement officers at risk.\nWe passed 881 to push back against prosecutors that don't take their jobs and\npartnership with law enforcement seriously. We pass HB 500, a common sense piece of legislation\nto strengthen the penalty of burning police cars. We've passed HB 505 to increase the penalty\nfor riding that often puts our law enforcement at risk. We pass SB 44 to go after gangs\nand those who recruit our young people, a scourge facing law enforcement in every corner\nof our state.\nThe men and women of law enforcement put their lives in harm's way to keep us safe.\nAs long as I have the privilege of serving, I will continue to stand up for my brothers\nand sisters in public safety, ensure that whatever happens, wherever in our state, that\nThey always have our support under the gold dome.\nThank you, Mr. Speaker, and I'll yield the well.\nThat completes our announcements.\nWhat purpose does Chairman Lomston rise?\nTo make a motion.\nStage a motion.\nI move that House Bill 1204 be moved from the insurance committee to the public health\ncommittee.\nBoth chairs are in agreement.\nMr. Clerk, will you read the caption?\nHouse Bill 1204 by Representative Lumpson of the 12th to be entitled to amend Chapter 24,\nTitle 33 of the Efficient Go to Georgia Antieta, relating to insurance generally,\nso as to require coverage for medically necessary expenses for standard fertility preservation services.\nOn the generalist motion, House Bill 1204, 1204, be withdrawn from the insurance committee\nrecommitted to the public health committee is the objection hearing none it is\nso ordered. Mr. Clerk, will you read the caption to a group of privileged\nresolutions? Honoring the life and memory Lieutenant Colonel Eugene Henry\nJr. Honoring the life and memory of Evangelist\nLillian Richardson Wardling, honoring the life and memory of Bobby Blue Smith, honoring the\nlife and memory of Arthur M. Jinlant Jr., honoring the life and memory of Burma Jean Gore\nKillings, honoring the life and memory of Cameron Jackson, honoring more house college and recognizing\nIn February 14, 2024 is Morehouse Day at the State Capitol honoring the students at Morehouse\nCollege, recognizing and commending community supervision officer Christopher Burke, the\nDepartment of Community Supervision 2023 officer of the year honoring and recognizing Edwin\nMoses, recognizing February 22, 2024 is law enforcement appreciation day at the State\nCapitol, recognizing and commending Alex Benson and his company born to compete.\ncongratulating the seater town high school game day cheerleaders for winning the GHS a three a four a division state game day cheerleaders twenty twenty three championship\nrecognizing February twenty seven twenty twenty four is sex trafficking awareness day at the state capital\ncommending Oliver L. Dean region four twenty twenty four principal of the year\nCommending the Mercy University School of Law on its 100th anniversary,\nrecognizing and commending America's Summary County.\nRecognizing February 28, 2024 as a Georgia Association of Broadcasters\ndate to State Capital,\ncommending the Georgia residents who have typed one diabetes and whose families\ncontinue to educate and advocate,\nrecognizing January 31, 2024 as licensed professional counselors,\nappreciating the appreciation date to State Capital,\nCommending Jennifer Oliver Hudson, Tony Elementary School's 2023-2024 teacher of the year,\nrecognizing commending the Cobb County Sheriff's Office and commending Barrow County 2024\nstar students and star teachers and for other purposes that completes the reading of the privilege\nresolutions. Is there any objection to adopting the privilege resolutions? Chair here's\nis known and the resolutions are adopted.\nWe have a few announcements, we will get started.\nRepresentative Gamble, did you have an announcement?\nThis afternoon, I thank you, too.\nThe gentleman is recognized for an announcement.\nThank you, Speaker.\nTomorrow morning at seven o'clock,\nthe fellowship we'll meet in the Judiciary Committee room.\nChairman Chokus recognized for an announcement.\nThank you, Mr. Speaker.\nTomorrow morning at 8 a.m. and room 506 C.L.O.B., the Small Business Development Committee\nwill have their weekly meeting.\nThe presenters tomorrow, the National Association of Professional Employers Organization and\nNFIB, National Federation of Independent Business.\nHope y'all can make it.\nThank you, Mr. Speaker.\nChairman Hawkins has recognized for an announcement.\nThank you, Mr. Speaker.\nThe health committee will meet upon adjournment and room capital for O3, that's cap for O3.\nChair Lady Cooper has recognized for an announcement.\nThank you, Mr. Speaker.\nOkay, today there will be no public health meeting.\nIt was scheduled for three.\nWe were following the health committee about giving them plenty of time.\nWe will meet on Thursday instead in room 403 here in the capital at two o'clock.\nOn Thursday, 403 here in the capital, the Public Health Committee will meet.\nThank you very much.\nChairman Mitchell, recognize foreign announcement.\nThank you, Mr. Speaker.\nThe Democratic Caucus will meet tomorrow morning for breakfast 9 a.m. in 2016 in the capital.\nThanks again, Mr. Speaker.\nRepresentative Hilton has recognized foreign announcement.\nThank you, Mr. Speaker.\nThe House Education Subcommittee on Policy will be meeting upon a German in CLOB 506.\nThe House Education Committee on Curriculum will meet about 45 minutes after that.\nThanks.\nThat concludes everything I think we need to do except one more\nClues I work for the day that\nMajority leaders recognize for a motion\nThank you mr. Speaker. I move that this house stand adjourned until 10 a.m. On Tuesday February 13th\n2024\nOn the motion of the majority leader that this house stand adjourned until 10 a.m\nTuesday, February 13, my lucky day, 2024. All those in favor will say aye. All those\nopposed will say no. No doubt about that. The eyes have it. We're adjourned. Thank\nyou very much.\n",
  "updated_at": "2026-02-12T15:15:01.237048+00:00"
}