{
  "video_id": "e_6cXhqLZFM",
  "url": "https://www.youtube.com/watch?v=e_6cXhqLZFM",
  "title": "Sen. Anavitarte Press Conference on Majority Party Priorities | 01/13/2026",
  "chamber": null,
  "session_type": "press",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 18,
  "summary": "Overview:\nThis press conference by Georgia Senate President Pro Tempore Larry Walker outlines the Republican majority's legislative priorities for the 2026 session, focused on addressing the high cost of living and reigniting the \"American Dream\" for hardworking Georgians.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- Walker discusses the significance of 2026 being America's 250th birthday, or \"semi-quincentennial\", and how this will bring patriotic celebrations.\n- Walker expresses concern that affordability issues have caused many Georgians to feel that the \"American Dream\" is slipping beyond their grasp.\n- The majority caucus plans to tackle affordability issues and \"reignite the American Dream\" through measures like eliminating the state income tax, providing property tax relief, limiting institutional investors in the housing market, and reforming the home-building permitting process.\n- The agenda also includes supporting first responders, preserving natural assets, improving K-12 education and literacy, and addressing challenges like street racing and technology access for children.\n- Walker criticizes \"insane liberal Democrat policies\" and the Biden administration's \"crippling inflation\" as drivers of the cost of living challenges.\n\nVotes:\nNone detected.\n\nAttendance: \nNo quorum notes.\n\nAdjournment:\nNo adjournment details provided.",
  "transcript": "Well good afternoon. Thank you all for being here. I'm Larry Walker and as of\nyesterday I'm officially the president pro-temporary of the state Senate. It's\nan honor of a lifetime to be selected by my colleagues to lead this August\nbody of dedicated public servants and the fact that my tenure begins at such\nsuch a critical time for our state makes this opportunity all the more humbling.\n2026 is going to be an action-packed year for Georgia politicoes.\nI think everyone knows exactly what I'm talking about.\nThe semi-Quince Centennial.\nOh, you thought I was talking about the high stakes.\nSpecial election going on now and all the bruising primaries and multimillion dollar\nmidterm for all the statewide offices.\nNo, 2026 is our nation's semi-quincentennial.\nI said it twice, correctly, I hope.\nI won't try to say it again.\nYeah, July 4th will be America and Georgia's\n250th birthday concurrent with these political campaigns\nthat inevitably will get a lot of attention during 2026.\nAmerica 250 will bring patriotic celebrations,\nreminding us all of what United States America's Americans,\nour love of country, our cherished freedoms,\nand our common pursuit of the American dream.\nThere's probably no concept more associated\nwith the United States of America than that of the American dream.\nSo when the majority later approached me about using this theme as we focused our majority\ncaucus agenda and developed our caucus priorities, it made total sense.\nI've spent my legislative career fighting for hard work in Georgians who don't necessarily\nhave a team of lobbyists helping them under this gold dome.\nIn cutting red tape and fighting government bureaucracy,\njust standing up for school bus drivers and cosmetologists,\nI wanted to be a voice for the everyday citizen.\nThe thought that for too many of our friends and neighbors,\nour fellow Georgians affordability concerns\nhave them believing that their American dream\nmay have slipped beyond their grasp.\nThat breaks my heart.\nThis caucus, the Georgia Senate Republicans,\nare going to do our part to change that by making sure\nthat our state, government, is part of the solution,\nnot the problem.\nI'll turn it over to the majority later.\nThank you.\nGood afternoon, thank you, Mr. Pro Tem.\nAs we enter the 2026 legislative session,\nobviously cost of living concerns are at the forefront\nof everyone's minds.\nLast year, broad stabilization in certain areas\nin some improvement in others,\nbut the absolutely terrible federal policies\nfrom the previous four years took some time to unwind.\nStarted with COVID, starting with COVID shutdowns\nand supply chain disruptions\nfollowed by massive federal spending,\npunishing inflation compounded year after year after year.\nWhile the Trump administration is confident that we will see economic improvement continued\nin the coming year, Senate Republicans are standing with me, understand that the accumulated\nhigh prices have made things very difficult for too many families in Georgia right now.\nWithout a doubt, we faced many challenges in recent years.\nThat's why I found I find inspiring that term, the American dream, as it was coined\nin the midst of a difficult time in American history,\nthe Great Depression.\nIn 1931, Beth Seller, in his Beth Seller,\nthe epic of America, James Trusslow Adams wrote of a quote,\ndream of a better, richer, and happier life\nfor all of our citizens of every rank, end quote.\nIt is the goal of this caucus this session\nto tackle affordability issues brought\nand broader quality of life issues heard head on\nwhile doing our part to reignite the American dream\nof a better, better, richer, happier life\nfor every single Georgian willing to work for it.\nThat starts by making sure hard-working Georgians\nkeep more of what they earned.\nThe past few years, Georgia Republicans\ncommitted to a multi-year reduction of the state income tax\nwhile delivering direct relief payments for taxpayers\nto help combat Biden inflation.\nNow, after months of a study,\nthe Georgia Senate Special Committee produced a feasible roadmap to completely eliminate\nthe state income tax, starting with the elimination of the tax for its first $100,000 for working\nfamilies. Last year, we also delivered property tax relief with continued improvement in the\nstatewide home set exemption. And on that note, I just want to be very clear on behalf\nof this caucus that as we work to strive to do bold things, we can and will do everything\non our power to address property taxes and income taxes to help families.\nBut the final bill that was passed out last year and got signed into law contained an\nopt-out provision that was unnecessarily exercised by too many local governments to the\nabsolute detriment of property owners and we're going to address that.\nThe Senate will work to eliminate the opt-out providing relief no matter what local jurisdiction\nYou reside in.\nOwning a home is virtually synonymous also\nwith achieving the American dream.\nAnd we want that goal to be attainable.\nIn addition to property tax relief,\nwe also will be very specific in tackling issues\nthat drive up the cost of homes.\nThat includes limiting institutional investors\nwho gobble up single-family homes and recycle them\non the Georgia rental market.\nMain street Georgians can't be expected\nwhen a bidding war with Wall Street billionaires for their dream home.\nSenate Republicans will also be looking to reform the permitting process for\nproviding surety for home builders, local governments must have a timely process\neliminating bureaucratic barriers for builders which increase the supply and\nalso decreases costs for potential home buyers.\nThe cost of living crunch has had a detrimental impact on the quality of life that we've seen,\nwhich has been difficult on the pain of high prices in impacting Georgia being the best\nplace to live work and raise a family.\nWe will make sure Georgia communities are safer by supporting our first responders, by\ncracking down on dangerous street racing, we will preserve Georgia's natural assets,\nwater, land, wildlife, while promoting outdoor access and economic development.\nWe will set up our next generation for success by ensuring Georgian's children have the opportunities,\nservices and resources they need to thrive.\nThat means the Senate will continually and on the multi-effort to improve literacy in this state.\nBuilding on the framework of the Senate Children and Families Committee supporting children in the foster care system.\nensuring that we retain and reward our best teachers,\ntackling chronic absenteeism in the K through 12\npublic education space, and placing guardrails around\ntechnology accessible to children,\neven if that includes artificial intelligence.\nMy optimism does not rely on Washington, DC.\nIt resides here in Georgia.\nIt's grit on local communities,\nthe innovation of the Georgia industry,\nin the compassion of the people we represent across the state.\nAcross the state, families who have felt squeeze\nor ignored continue to get up every single morning\nand do their best.\nThey deserve a government that meets them where they're at.\nI believe the Senate Republicans\nreigniting the American Dream agenda does just that.\nIn closing, I will return to James Trusslow Adam's definition\nof the American Dream, quote, a dream of a social order\nin which each man and each woman shall be able to attain\nto the fullest stature of which they are\nand ain't late capable and be recognized by others\nfor what they are regardless of the fertitious circumstance\nof birth or position.\nAsk yourself, whose ethos is most reflective\nof that sentiment actually better yet go further,\nwhich political party makes that aspiration more attainable.\nI think it would be a disservice as majority leader\nIf I did not state the obvious on behalf of our team,\nthe insane liberal Democrat policies\nis what's driving prices up.\nFour years of Joe Biden's crippling inflation\nfrom massive federal overspending.\nMillions of illegal pouring across the border,\nstressing our support systems.\nRadical environments policies driving up energy prices.\nWasteful local government bureaucracy,\ndriving up the cost of homes.\nAnd there's nothing affordable\nabout the Affordable Care Act and Obamacare.\nDemocrats, federal, state, and local\nhave created problems and actually have the audacity\nto claim that they should be the ones that actually\nsolve those problems that they created.\nThat's like putting the arsonists in charge\nof a fire department.\nWe Republicans will be standing, starting a fire\nof our own this session.\nWe will reignite the torch that lights the path\nfor every Georgia's pursuit of their American dream.\nThank you.\nAnd with that, take a couple questions.\nGo ahead, Jeff.\nJeff, will you see where this legislative process goes?\nThe only comment I'll make to that is that,\nas a former elected official,\nI was a city councilman, I've been a elected school board\nin my home county where I live.\nAnd the General Assembly, this last five to 10 years,\nseems to have to take up issues that local governments\nare not addressing on their own.\nPeople are being taxed to death,\nthey're seeing greater regulation.\nI know some of these, whether it's a school board\nor some of the cities, they blame regulation,\nwhether it's on the feds or the states,\nbut they also have a responsibility to the people\nthat elected them to do more, do less with more, you know,\ntying their bell just like every family that's trying\nto put food on the table and it goes to work\nevery single day.\nSo we are hearing from the citizens in our community\nsaying, hey, do something about it,\nbut I hope that the local elected officials will do more\nin working collaboratively with us\nto address these cause issues that are really\nbeing generated by local government.\nYeah, I mean, I appreciate the question, I mean, I think our goal this year is to have\na collaborative session.\nWe will have awesome competition between the House and the Senate.\nMy goal is to make sure obviously we win those competitions just like in a football game.\nBut I think at the end of the day, we are one team, we're one team working with our Lieutenant\nGovernor Burjones were working with Governor Kemp, and at the end of today, the citizens\nof Georgia want us to deliver results.\nThey don't care what's happening in this building, half of them don't even understand\nwhat's happening in this building.\nAll they care about is, is there pocket book being heard, are there kids getting the\nbest education, and are we creating the best quality of life for Georgia?\nAnd I think that's the goal of this caucus working with leader abstraction and speaker\nBurns.\nWe'll see, we're going to talk more of that as the days and weeks come.\nI know there's interest between the Senate and the House, so I think there is an opportunity\nfor both chambers to work collaborative with it.\nI will tell you just on a personal note, I mean I come from one of the highest growth\ncounties in Georgia and Pauling County,\nand I can't walk out my front door without seeing a new\nneighborhood rental community being built.\nI think the challenge that citizens have is,\nas you put more people into a community,\nthat's more stresses on our education system.\nThat's more stresses on our water system.\nAnd I think as we look at what people want in this day and age,\nthey don't want all these stresses while they're dealing\nwith all sort of the financial stresses at home.\nSo, I think we have to address the balance,\nand there'll be more to come on that.\nTy.\nI appreciate the question, Ty, I mean, my wife's a high school teacher, I have three\nkids in the public education system and I've served on the local school board.\nSo I feel like I've got a pretty good pedigree to be able to talk about these issues.\nAt the end of the day for us as a caucus, we're going to do what the citizens want.\nI know in Pauling County, Georgia, we saw a ballot initiative pass with 64, 65% of our\ncitizens saying, hey, we want to cap on assessments.\nSomething has to happen with the spending.\nAt the same time, we've seen school boards all over the state with excessive fun balances.\nWhile we've seen other counties literally going bankrupt, I think as leaders at the state\nlevel working with our school boards and our teachers and our principals, we have to figure\nout what is at right balance.\nAt the end of the day, the central office cannot be dominant while we're not putting resources\nin the classroom for teachers like my wife.\nAt the same time, the state, every single year for the last few years working with Governor\nkept, we've given teachers pay raises while we've seen local governments who do have strong\nfund balances not give teacher pay raises.\nSo we need to have a conversation about how we're going to address this.\nI think taxes right now, it's not just a short-term 2026 political issue.\nThis is a long-term issue that Georgia is going to have to come to grapples with.\nAnd also too, this caucus has passed school choice legislation trying to empower our parents\nto have more choice in the lives of our kids.\nAnd so I think through all of that, these conversations talk about the bigger long-term impacts\nof education, which we should have, which should be about empowering the taxpayer, empowering\npeople, empowering parents, and then most of all also empowering our teachers.\nYeah, I mean just in short, our Appropriations Chairman Blake Tillery, I know that's an issue\nthat's passionate to him and several of our senators.\nWe just want to make sure we have a strong foster care system.\nIt's resilient for the years to come.\nI think we've made great strides over the last couple of years and I think there's going\nbe more to come on that, but I think it's a long term issue that we want to continue\nand make sure has adequate funding, there's transparency and accountability, but it's\nalso most importantly, we're doing everything we can to support the kids.\nI think we have to head on and talk about what is going on with energy costs.\nThe balance of whether data centers should come and go, once again, this is a conversation\nthat's coming up that local governments should be solving that we're finding here in the\nstate capital.\nI think there are aspects of the financial arrangement for some of these data centers that\nI think honestly should be debated.\nThat is the debate our caucus will have with the leaders of this building to see what\nis in the best centers of the citizens.\nBut at the end of the day, I think if hard work in Georgia is there having to tighten\ntheir belts as it relates to the money that they're bringing in, to put food on the table,\nto pay for gas, to pay for child support, child care, maybe child support too.\nIf they're not doing what they're supposed to be doing,\nI think that is a real concern.\nI think we should have a transparent conversation about it.\nIt shouldn't be all about what big business wants.\nI think we need to talk about what the average citizen wants\nand find again what is that balance,\nbecause the energy challenges, whether it is around data centers\nor other things are only going to exponentially increase\nas we see the population increase in Georgia.\nAnd I think also the challenges that we're seeing,\nyou know, from a resource perspective.\nI think that's why we're interested in protecting water\nand seeing more things happen in terms of our natural resources,\nespecially after the devastation we saw around Hurricane Helene\nin Middle East and South Georgia,\nand the devastating impact it's had across our state.\nSo I think there's more issues to come on that.\nMore discussion?\nThank you.\nThank you.\nThank you.\nThank you.\n",
  "updated_at": "2026-02-12T01:38:05.222833+00:00"
}