{
  "video_id": "e_QyzLdymuU",
  "url": "https://youtu.be/e_QyzLdymuU",
  "title": "Georgia House - Day 6 (2026-01-27)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 6,
  "video_date": "2026-01-27",
  "duration_minutes": 64,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session included a morning prayer by Pastor Lee May, who provided inspirational messages to the legislators focused on aligning their actions and votes with their professed values and priorities. There were no substantive bills or votes detected in the transcript.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Darshan Kendrick introduced Pastor Lee May, a former elected official in DeKalb County, as the morning chaplain. \n- Pastor May provided a prayer and remarks emphasizing the importance of legislators' actions matching their stated values and priorities, especially when allocating state resources. He referenced biblical passages on aligning \"treasure\" and \"heart\" as well as speaking up for the poor and needy.\n- Representative Kendrick confessed that she had to use a Bible app to be sworn in recently since she forgot her personalized Bible.\n\n## Votes\nNone detected.\n\n## Attendance\nThe session began with a quorum call and all members voting to record their presence.\n\n## Adjournment\nThe transcript does not include an explicit adjournment. The session appears to be ongoing.",
  "transcript": "The hour of convening having arrived, all members of the House will please report to their\nassigned seats.\nAll members will report to their assigned seats.\nMr. Clerk, would you ring the bell?\nAll members will please take their seats we're about to have the morning roll call.\nWe are about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nrepresentative camp you have an issue with the tablet I see you up there mark representative\ncap present\nall right\nall members voted\nif so the clerk will lock the machines\nWell good morning, hope everyone had a pleasant evening last night, doorkeepers will please close\nthe doors and keep them closed.\nWe will begin our day with scripture reading and prayer by the chaplain, after which we\nwill pledge allegiance to the flag of our country. Our chaplain this morning will be introduced\nby the lady from the 93rd House District Representative Darshan Kendrick. Representative\nKendrick.\nThank you Mr. Speaker and good morning colleagues. It is my pleasure to introduce my friend\nand constituent and passed their pastor, Lee May.\nBut first, I would like to introduce my first lady,\nwho could not be with us today, Robin May.\nAnd she is a friend and constituent as well.\nPastor Lee May, the second, is a former elected official\nin Decalc County, Georgia.\nMany of you know, he served as the chief executive officer.\nHe was first elected as commissioner in 2006.\nHe served in that role until he was appointed\ninterim chief executive officer of DeCab County by then governor Nathan Deal in 2013.\nHe is a graduate from Emory University's counter school of theology, holding a master's\na divinity degree, and of the historic Clark Atlanta University with a degree in business.\nHe is a former small business owner having owned an independent movie theater located\nin Lithemia Georgia, he is also the author of My God, My Politics, a discussion on faith\nand politics.\nHe answered the call in 2017 with his wife, Robin, to start transforming faith church,\na wish I am a member, and it was launched in the heart of the Cap County Georgia.\nHe spends most of his time with his college sweetheart, Robin, and their three children,\nRyan, Reagan, and Riley.\nAnd before I bring him to the podium, I do have a small confession for the pastor.\nSo when we got sworn in a couple of weeks ago, I forgot my Bible and I have a very nice\nBible that was signed by the speaker and it was monogrammed and everything.\nSo I had to get sworn in on the Bible app and I'm hoping that that, I'm hoping that\nthat counted Mr. Speaker.\nSo that is my confession publicly to all of you.\nbut y'all continue to pray for me.\nSo without further ado,\nI would like to bring my pastor, pastor, Lee May.\nOnly because it's you.\nYou know they say confession is good for the soul.\nIt's such an honor to be here with you all on this morning,\nhadn't been in this room in quite a while\nand I do count it an honor and a privilege\nTo be able to say just a few words to you of inspiration, of devotion, and hopefully clarity\nas you continue to do the work of the people.\nAnd as my State Representative, Darshan Kendrick mentioned, as you swore, many of you with\nyour hand on the Bible, that you would do the business of the people with integrity as\nwell.\nI want to thank my State Representative, Darshan Kendrick.\nShe is my state representative, so I have to take a little personal privilege.\nI believe I have the best state representative in a nation.\nAnd hopefully your constituents say the same thing about you.\nNo I love our representative and she is a member of Transforming Faith Church, a church\nwe started, my wife and I approximately three and a half years ago in the heart of\nDecatur where it is greater and and such it is an honor to be here to our speaker David\nRalston. Thank you for your your leadership and your friendship over the years and\nMinority Leader James Beverly congratulations and thank you for your leadership as\nWell to the decap delegation. Thank you all many of you all for your friendship\nand for your leadership for our wonderful county. I see so many of you all here on\nthis morning, I'm so pleased to be able to stand before you. I have just a few words\nfor you this morning that I will hopefully help you today and throughout the remainder\nof your time in session. You know, there's two scriptures I really want to highlight here\nthis morning. Two scriptures that have brought clarity for me in my role when I was in public\nservice for almost 12 years and still continues to drive me now as we do the work of leading\na congregation in Decap County. Two scriptures, scripture number one, Matthew 6 and 21. Many\nof us know this scripture and we repeat it. Even if we're not people of faith, even\nif we're not professing Christians, many of us know this scripture because it really\nis telling and it's really apropos to us all in our daily life. And it says this,\nSo where your treasure is, there your heart will be also.\nWhere your treasure is, there your heart will be also.\nYou know, as my understanding that the governor has delivered his budget to you all, and\nas you begin to deliberate over the resources, the money of the people, and how they will\nbe allocated, my prayer is that you will keep this Scripture and the heart of your bosom\nthat you will continue to repeat this scripture\nand that you will keep atop of mine\nas you try to determine how you will use these scarce resources\nto deliver resources to people that are desperately in need.\nYou know this concept of heart and treasure is very similar\nto another concept in the New Testament in the book of James\nthat says faith without works is dead.\nfaith without works is dead. They go together. And what are those two concepts really saying?\nThey're really saying this, that your words really must match your actions, heart, treasure.\nIf you say this is what is important to you, then it ought to be a reflection in how you vote,\nhow you deliberate over the budget, what you are fighting for each and every day. Your heart ought\nto be a reflection of your treasure, your faith ought to be a reflection of your works.\nAnd so as so many people are tugging on you, as constituents are tugging on you, as paid\nlobbyists, and unpaid lobbyists are tugging on you, as your local city and county officials\nare tugging on you, asking for money for their needs, I want you to continue to think\nThink about your heart, your treasure, your faith, your work.\nScripture number two is this.\nIt comes from the book of Proverbs and my prayers that this will be wisdom that you will\ncontinue to take with you.\nIt is in Proverbs chapter 31, last chapter of Proverbs, this book of wisdom.\nAnd it is words of wisdom from a mother to her son.\nSome call it mother wit, a mother giving wisdom to her son.\nNow her son happened to be a king, king Lemuel, and in verses 8 and 9 it says,\nis speak up for those who cannot speak for themselves,\nfor the rights of all who are destitute.\nSpeak up and judge fairly.\nDefend the rights of the poor and needy.\nMy prayers that you will think about those\nwho may not look like you, may not talk like you,\nmay not have the same background\nas you may not share the same party affiliation\nas you may not share the same skin tone\nas you my prayers that you will think about those\nwho look like you and those who don't look like you as you are doing the people's business,\nthat you're speaking up for those who are in need.\nWe all ought to listen to the wisdom of our mothers.\nWe all ought to work on behalf of the people that are put us in this position all throughout\nthis great state of Georgia.\nAnd I'm so thankful that I live in Georgia with a great leadership, a body of leaders that\nare walking in this scripture that are concerned about the issues and the concerns of peoples\nall throughout this state and my prayers that as you continue to deliberate over the budget,\nover the policies and laws that you will pass during your time here, that you will do it in unity.\nI believe that Georgia can and will continue to be a picture of what this nation ought to look like.\nCan you believe that with me this morning that you will be a picture of\nworking together, a picture of unity, a picture of us coming together, the\npeople that don't look alike, that don't talk alike, that don't sound alike, that\ndon't have the shared experiences that we would be people that will walk in\nunity. And as you do that, I will continue to cheer you on and thank God for your\nleadership, can we pray together? God, we are so thankful that you have thought so much\nof us to walk in seats of authority, of power. God, I want to speak on behalf of all who\nare standing here. God, they don't, we don't take this lightly. God bless us this morning.\nNot just for today, but throughout our time here, God, bless your leader's God.\nLet them walk in faith and works, God.\nLet their hearts be connected to their treasure, God.\nGive them supernatural wisdom, God.\nWisdom that surpasses all understanding this morning.\nGive them what they lack, God.\nGive them more than enough to work on behalf of the people of this great state of Georgia.\nGod bless us during our time bless them as they continue to do your work and in\nthe Christian faith perspective that I speak from in your son Jesus' name we pray\ncan we all say amen together amen amen amen God bless you all\nI pledge allegiance to the flag of the United States of America and to the Republic\nfor which stands one nation under God, indivisible with liberty and justice for all.\nThank you, Mr. Speaker.\nGevers may unlock the doors.\nChair recognizes Chairman Hogan.\nthe Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal\nof the previous legislature day,\nand they found it to be correct.\nAnd furthermore, Mr. Speaker,\nonly two defining forces have offered to die for you.\nJesus Christ and the American soldier,\none died for your soul, the other died for your freedom.\nAnd I'd like to also say that I'm glad to finally\nthe majority whip got swarney,\nand I read that in his journal today.\nHa, ha, ha.\nAre you suggesting he's been illegitimate\nfor a few days?\nChairman Hogan, the chair of the committee\non information and audits reports\nthat the journal of the previous legislative day\nhas been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is none, and the journal is confirmed.\nThe clerk will read the resolution\nestablishing the order of business for the day.\nMr. Burns, the number 59 moves following me establishes\nthe order of business during the first part\nof the period unanimous consent,\nintroduction of bills and resolutions,\nfirst reading and reference of house bills and resolutions,\nsecond reading of bills and resolutions,\nreport of standing committees morning orders is there any objection to the\nadoption of the resolution establishing the order of business for the day the\nchair here's none in the resolution is adopted first reading of bills and\nresolutions the clerk will read house bill 47 my reps of gillier to the\nhundred and sixty second ability title act to men title 49 the fish go to\nGeorgia annotated relating to social services public safety and homeland security\nHouse Bill 48 by reps. I'm Qulier to the 160 second Bruce and 61st in\nScott of the 76 that built me titled back to a men article three chapel of\ntitle 50 the fiscal of Georgia annotated relating to state flag seal and\nother symbols state properties House Bill 49 by reps of Hutchinson and\n107th swery of the 135th Wilson in the 80th Clark 100 and 8th Scofield in the 60th and others\nWilmington and active men chapter 24 of title 33 the fish go to Georgia and Tady\nrelating to insurance insurance house bill on 100 by representative Gillier to the\n160 second of building title and act to amend code section\n48 9 3 the fish go to Georgia and Tady relating to levy of excise tax rate and taxation of\nmotor fuels\nWays and Mains.\nHospital 101 by Representative McLaren of the 51st went on the 89th,\nCanada to the 102nd, Scofield, the 60th, Mitchell to the 106th and others.\nBill Bitton, an act to amend Code Section 212-216.\nThe official bill of Georgia annotated relating to qualifications of electors generally.\nSpecial committee on an election integrity.\nHospital 102 by Representative Kendrick of the 93rd.\nBill Bitton, an act to amend Chapter 7 of Title 48.\nThe official bill of Georgia annotated relating to income taxes.\nTexas.\nWays and Means.\nHouse Bill 103 by Rose and Williams\nthe 145th Bill Meantown Act\nwho amend the act providing for the election\nof members of the Board of Education of Baldwin County.\nIntergovernmental coordination.\nHouse Bill 104 by Rose and Stevens\nthe 164th of Bill Meantown Act\nwho amend chapter 13.\nIt's out of 48.\nThe physical to Georgia and it's endless relating\nthe specific business and occupation taxes.\nWays and Means.\n1-0-5 by reps of Clark, 147th, bottom of the 76.\nWilliams, 168th, Tarvon in the second,\nHitchinson, 161st and others.\nBill Mehton, an act to amend part three\nof Article three, chapter two,\na title of 30-80th.\nBishop go to Georgia, annotator relating\nto pay pensions and allowances.\nDefense and veterans of fires.\nHouse bill 106 by reps of Clark, 147th,\nbottom of the 72.\nWilliams, 168th, Tarvon's the second,\nHitchinson, 161st and others.\nBill Mehton, an act to amend,\nCode Section 45-9-81 of the physical to Georgia annotated relating the definitions regarding the Georgia state identification for indentification fraud.\nDefense and veterans affairs House Bill 107 by reps of Hugley the 136th Spinery, 135th, Alexander the 66 Jackson, 128th, and Williams the 168th,\nBuilding town of an act to amend Code Section 50, 14-1 of the fiscal to Georgia\nand Tate relating meetings open to the public.\nGovernmental affairs, House Bill 108, members of Gamble of the 15th\nbuilt in 112th, Lumpston to the 12th,\nbottom of the 72nd and home and Holcomb to the 81st.\nBuilding town of an act to amend Code Section 42, 86, the fiscal to Georgia\nand Tate relating to special license plates.\nMotor vehicles, House Bill 109, members of the Clark, the 147th, Oliver,\nthe 82nd, and all of what's in the 42nd can trail of the 22nd,\nMathis of the 144th, and others,\nBill Nitton, an act to amend the Bill Nitton to act,\nto provide for greater protections for individuals\nwho have suffered from childhood sexual abuse.\nJudiciary House Bill 110, my rims of the clerk,\n147th, Harvard, and the 2nd.\nDonna, who the 30th, Glant, and the 100th of the 75th,\ngo over the 19th and others,\nBill B. Toddl and Acto Men,\npart one of article one of chapter three,\na title 12,\ntitle 16,\nand title 27 of the physical to Georgia annotated\nrelating to general provisions regarding parks,\nhistoric areas, memorials, and recreation.\nPublic safety and homeland security.\nHouse Bill 111,\nby ropes of the Williamson of the 115th,\nhas to the 150th,\nhouse to the 170th,\nBill B. Toddl and Acto Men,\nchapter one of the title seven\nof the physical to Georgia annotated\nrelating to financial institutions.\nBanks and banking.\nHouse Bill 112 by Russent Kelly, the 16th Cooper,\nthe 43rd Carpenter, the 4th Newton,\nthe 123rd Hawkins, the 27th and others.\nBill Bitton, an act to amend and act relating to\ntorts to provide certain immunities from liability claims\nregarding COVID-19.\nSpecial Committee on Access to the Civil Justice System.\nHouse Bill 113 by Russent and Alexander, the 66,\nhugely the 136 parts of the 101st dryer,\nthe 59th Douglass, the 78th and others.\nwill be titled an act to amend chapter 2 to title 21,\nthe official vote of Georgia Annotated relating to primaries\nand elections generally.\nSpecial committee on election integrity.\nHouse Bill 114, our reps and a briefs of 34th\nwill LaRickia, the 169th, Oliver the 82nd,\nBonner the 72nd, and Buckner the 137th.\nThey'll be titled an act to amend Article 2,\nchapter 7 to title 48, the official vote of Georgia Annotated\nrelating the imposition rate computation\nand exemptions from state income taxes.\nWays in Maine.\nHouse Bill 115 by Robson of Wolensky, the 79th,\nOnola West to the 42nd, Hawkins to the 27th,\nCooper to the 43rd, Williams to the 145th,\nand others, will be tied on act to amend,\ntitle 33, the fish go to Georgia,\nand Tater relating to insurance.\nInsurance.\nHouse Bill 116, by Robson of McLean to the 100th,\nJones to the 53rd, Alexander to the 66th,\nwent to the 89th, Shannon to the 84th, and others,\nwill be tied on act to amend, chapter 4,\ntitle 34, the fish go to Georgia,\nand Tater relating to minimum wage law.\nindustry and labor House Bill 117 by resident walesky the 79th\ngravity the 67th rich of the 97th fiery the 135th\nmentally 88th and others will be taught on an act to men code\nsection 31 to a 18 you the fish go to Georgia and tell you\nrelate that a low THC oil patient registry. Regulated\nindustries House Bill 118 by resident for now the 77th\nBeverly the 143rd Smiley 135th Scofield the 60th and Scott of\n76th building title of an act to amend part 13 the article 6th of chapter 2\ntitled 20 the official go to Georgia annotated relating organizations of\nschool and systems under the quality basic education act. Education House\nbelow 119 by Riffsett make the act of the 73rd hawk has the 27th rich of the\n97th an airheart of the 36th building title of an act to amend code section 147\nfor the physical to Georgia annotated relating professional services.\nRegulated industries House bill 120 by reps of Carpenter the fourth Washburn in the\n141st gamble with 15th one of the 89th Lopez and the 86th and others\nThere'll be title and act to men title 20 the fiscal Georgia annotator relating to education\nHigher education House bill 121 by reps of one of the 89th Alexander the 66 you believe the\n136 Shannon the 84th dryer the 59th and others\nBill B. Todd will act to amend chapter 2,\na title 21 of the E. F. George Anitator relating\nto primaries and elections generally.\nSpecial committee on election integrity.\nHouse Bill 122, my friends,\na quarter of the 174th hatch to the 150th rows,\nthe 120th Watson, the 170th second,\nand a hood to the 175th,\nBill B. Todd will act to amend Code Section 488,\n3.2 of the E. F. George Anitator relating\nthe definitions exemption of applicability and examples.\nWhat is it means?\nI'll spill 123 by rest of P3 the 166 hitch and son of 61st Steven son of 64th\ngravity the 67th Williams 168th and others.\nLomington on act to amend chapter 7, title 48, the physical to Georgia annotated relating\nto the income taxes.\nWhat is it mean?\nI'll spill 124 by rest of Williams on the 45th pile of 32nd and McDonald to the 26th.\nLomington on act to amend chapter 18 and title 43, the physical to Georgia annotated relating\nthe funeral directors and establishments.\nRegulated industries.\nHouse Bill 125 irons and the Williams,\n145th Mathis, 144th Polly,\n32nd Lumps into the 12th and Hitchinson, 61st.\nBill Bitton, an act to men,\narticle on chapter three, a title, 35.\nThe official go to George annotated\nrelaying the general provisions regarding\nthe Georgia Bureau of Investigation.\nPublic safety and homeland security.\nHouse Bill 126, five irons and Williams,\n145th Mathis and 144th Polly,\n32nd Lumps into the 12th and Hitchinson, 61st.\nThey'll be tied on an act to amend chapter one of title 35\nthat fiscal Georgia and Tadya were leading the general\nprovisions regarding law enforcement officers and agencies.\nPublic safety and homeland security.\nHouse bill 127, my resident Williamson,\n45th McDonald's, 26, Powell, and 32nd,\nlumps into the 12th and Hitchens,\nthen saw 160 first.\nThey'll be tied on an act to amend article one of chapter five\nof title 46.\nIf fiscal Georgia and Tadya were leading the general\nprovisions regarding telephone service.\nEnergy, utilities, and telecommunications.\nHospital 128 by Rosanna Williams,\n145th Jackson, on 28th,\nMathison, 44th McDonald,\nthe 26th and Apollo, the 32nd.\nWilmington, on active men,\nchapter one, on a title 31.\nThe fish go to Georgia,\nand it's in here relating\nthe general provisions regarding health.\nHealth and human services.\nHospital 129 by Rosanna,\nWatson, on the 172nd Kelly,\nthe 16th hatched in 150th games,\nthe 117th weed hour, the 119th and others.\nWilmington, an active men article on chapter 16 to title 15 to the physical to George\nAntitted relating to general provisions regarding sheriffs.\nPublic safety and homeland security House Resolution 28, part of the McLaren of the 51st,\none of the 89th, Kenner to the 102nd, Scofield of 60th, Mitchell to the 106th and others.\nResolution proposing an amendment to the Constitution so as to remove the conviction of a felony\ninvolving moral turquidude is an exception.\nCommittee on Election Integrity. House Resolution 29 by Rose on Hugley of the 136th\nInspire in 135th. Resolution compensating Mr. J. Keith, Vendray, Robinson Senior.\nAppropriations. House Resolution 30 by Rose on Stevens on 64th\nfollowed 32nd. Smire on 35th. Williams on 68th. Evans on 57th and others. Resolution\nproportions in a amendment to the Constitution so as to authorize the General\nsomebody provide by law for local authorizations of a limited number of licensed\ndestination Resort Facility Casino Resorts economic development and tourism\nhouse resolution 32 on reps and a broth to the seventh resolution honoring the\nlife of mr. Cecil Matthews and dedicating a bridge in his memory\ntransportation that completes first readers second reading of bills and\nresolutions the clerk will read\nHouse Bill 4 by Representative Scott of the 76th Canon of the 58th Mitchell of the 88th in Jackson of the 64th.\nThe bill relating to public school property and facilities House Bill 6 by Representative Scott of the 76th Kendrick of the 93rd.\nBased more of the 63rd and the Scofield of the 60th Thomas of the 39th and others.\nThe bill relating to income taxes House Bill 9 by Representative Scott of the 76th.\nHutchinson of the 107th Scofield of the 60th Macau of the 105th Davis of the 87th, the bill relating to health of students.\nHouse Bill 15 by Rep. Scott with 76, Canada the 58th, Thomas of the 39th Scofield of the 60th\nHutchinson and the 100th and others, Bill relating to employment and training of peace\nofficers.\nHouse Bill 16 by Rep. Scott with the 76th, Davis of the 87th, Scofield of the 60th, Kendrick\nof the 93rd, Hutchinson of the 107th and others, Bill relating to general provisions regarding\nlaw enforcement officers and agencies, House Bill 19 by Rep. Scott with the 76th, Thomas\nof the 39th, Scofield of the 60th, Davis of the 87th, Hutchinson of the 107th, the Bill\nRelating to the Georgia Uniform Civil for Chair Procedure Act.\nHouse Bill 20 by reference to Scott of the 76 Davis of the 87th Scofield of the 60th Thomas of the 39th\nKendrick of the 93rd and others, a bill relating to general provisions regarding coroners.\nHouse Bill 21 by reference to Scott of the 76th Scofield of the 60th Davis of the 87th Canon of the 58th Thomas of the 39th and others, a bill relating to offences against public order.\nHouse Bill 57 by reference to Scott of the 76th, when of the 89th Scofield of the 60th Davis of the 87th Canon of the 58th and others,\nto build relating to inmate policies.\nHouse Bill 86 by Rimsett Stevens of the 164th Mitchell\nof the 88th Hopkins of the 27th Hutchinson of the $107,\nthe 45th and others of bill relating\nto lottery for education.\nHouse Bill 87 by Rimsett Evans of the 57th\nand their lowest of the 42nd will let's get the 79th Jackson\nof the 128th green of the 150th person others\nof bill relating to hopes, scholarships, and grants.\nHouse Bill 88 by Rimsett Evans of the 57th Stevens\nof the 164th Holmes of the 129th Williams of the 168th\nof the 96th and others, a bill relating to Hope Scholarships and Grants, House Bill 89\nby Roads of Evans of the 57th, Friday 118th, Carpenter of the 4th, Meyer of the 135th,\nBuck from the 137th and others, a bill relating to Definitions relative to Hope Scholarships\nand Grants, House Bill 90 by Roads of Williams of the 115th, Burns of the 150th and 59th, Dickey\nof the 140th, Hatch of the 150th, Mars of the 150th and others, a bill relating to Damages\nor Conversion of Timber, House Bill 91 by Roads of Jackson of the 64th by Roads of the 143rd,\nHopson to the 153rd pays more of the 63rd,\nThomas of the 39th and others,\nBill relating to the temporary assistance\nfor needy families.\nHopson 92 by represent gambled with the 15th,\nMathis of the 144th,\nGallaud of the 19th,\nBarton of the 5th,\nSkoggins of the 14th,\nthe Bill relating to disclosure of information,\ncontained in vital records and transfer of records\nto state archives.\nHopson 93 by represent Cooper of the 93rd,\na Bill relating to health.\nHopson 94 by represent,\nRichard the 97th, England of the 163th,\nso the 34th Mathiac of the 73rd,\ncamp of the 131st and others available relating to theft house bill 95 by\nrepresent Lema the 99th Park of the 101st go field of the 60th drier the 59th\nmainer of the 56th and others available relating to imposition rate\ncomputation and exemptions from state from income taxes husband 96 by\nrepresent Clark of the 108th gravely of the 67th where now the 77th\nfrustration 104th the bill will lead to general provisions regarding child custody\nproceedings husband 97 drivers deliver of the 33rd floating of the\n121st Coggins of the hundred of the 14th Oliver the 82nd Wilson of the 80th and others a build related jurisdiction power in duties\nHouse bill 98 Arabson Lumson of the 12th black one of the 146th filming of the 121st Oliver of the 82nd Williamson of the 115th\nThe bill relating to state government House bill 99 by represent Stevens of the 164th Cooper of the 43rd well\nLet's give the 79th the bill relating to handicap persons House resolution 2 by reference to Scott of the 76th McLeod of the 105th Davis of the 87th when the 89th and\nScofield of the 60th. Resolution proposing amendment to the Constitution, so it's\nprovided that the Office of any State County or Municipal elected officials have\nyou declare vacant upon such elected official qualifying for certain other\noffices. House Resolution 22, by represent England of the\n116th, Gaines of the 117th, Kirby of the 114th Resolution, recognizing Mrs. Judy\nHill Lofton and dedicating interchange in her memory, House Resolution 23, by\nrepresent Jones of the 25th, Jones of the 47th, funding of the 111st,\nwhich had a 176, the 29th resolution urging the United States Congress to reject any\nand all actions to increase the number of justices on the United States Supreme Court,\nHouse Resolution 24, by Rep. Mallow of the 163rd, and Stevens of the 164th Resolution\nCompensating Dominic, Ryan Luchy, and other purposes, House Resolution 25 by Rep. Mallow of the\n163rd, and Stevens of the 164th Resolution Compensating Mark Jason Jones, House Resolution\n26, by Rep. Mallow of the 163rd, and Stevens of the 164th Resolution Compensating Kenneth\nEric Gardner.\nThree second readers.\nThis house will come to order.\nChair is going to ask all members to please take your seats immediately.\nPlease take your seats immediately.\nvery distinguished guest, the only guest that we will have this session. We have\nre-instituted a tradition that I'm value very highly and today we're going to\nwelcome one of the great leaders in this state.\nI have a great honor today of introducing, as I said, one of the great leaders in our\nstate, a real visionary individual, and someone I consider a friend, and with whom we've\nhad many discussions about issues and policy, Mayor Keisha Lance Bottoms is the 60th mayor\nof the city of Atlanta, a daughter of Atlanta, Mayor Bottoms is a lifelong public servant.\nShe happens also to be the daughter of one of the state's greatest entertainers, Major\nLentz.\nAnd the last time I said that, I got a CD of his greatest hits, thank you mayor.\nShe is the only mayor in Atlanta's history to have served in all three branches of government,\nserving as a judge and city council member before being sworn in as mayor.\nShe was recognized by Georgia Trend as the 2020\nGeorgian of the year among many other honors\nand accolades that have been bestowed on her.\nA product of Atlanta Public Schools,\nMayor Bottoms graduated from Frederick Douglass High School\nand received her undergraduate degree\nfrom Florida A&M University.\nShe earned her law degree from Georgia State University\nCollege of Law.\nShe and her husband Derek Liv in Atlanta\nwith their four children, Lance Langston, Linux, and Lincoln.\nAnd as I said, we may have differing views on policy.\nI can tell you that Mayor Bottoms shares my desire, our desire to see this city and this\nstate move forward together.\nI'm proud to welcome her to our Chamber today and present to you the 60th Mayor of the City\nof Atlanta, Mayor Keshe and Lance Bottoms.\nThank you so much, Mr. Speaker, and I am always honored when I invite it to share with you,\nI am doubly honored today to hear that I am the only guest this session, so I greatly\nappreciate that to speaker Pro Tem Jan Jones, Majority Leader John Burns, Minority Leader\nJames Beverly and to my friend and my mentor, the Dean of the Georgia House, my dear friend\nCalvin Smirey.\nEach time I have the opportunity to come into this building, I am reminded of my family's\nhistory. And the oral history of my family is that my grandmother's grandfather, a\nonce enslaved man from Crawfordville, Georgia, served in the legislature during reconstruction.\nNow, I don't know if that's true or not, but that's what the generations have passed\ndown in my family. I've seen a document signed by Shepherd Peek, a big ex. So I\nI am going to assume that he could not read or write.\nBut I stand here as 60th Mayor of Atlanta.\nAnd I am reminded of the grace of God.\nAnd that I stand here on the prayers of generations\nand the hopes and dreams of those who came before me.\nAnd so it is our responsibility today\nfor us to hope and dream for generations to come.\nAs we have mourned the loss this week of our great hero,\nHank Aaron, I'm reminded of a quote where he said,\nin playing ball and in life, a person occasionally\ngets the opportunity to do something great.\nWhen that time comes, only two things\nmatter, being prepared to seize the moment\nand having the courage to take the best swing.\nWell, today and this session will be full of moments\nand opportunities for us to do something great\nfor the people of Atlanta and the people of Georgia.\nSo it has been my honor and indeed a pleasure\nto call speaker Rossin a friend\nand to work alongside each of you\nto do what we have to do to make sure\nthat the generations that come after us\nwill be better.\nThank you, and may God bless you,\nand I pray that you hope that,\nI hope, hope, I pray and hope\nthat you have a safe and healthy session.\nThank you.\nThank you very much.\nReports of Standing Committees, the clerk will read.\nRepresentative Chuck Heffstration, the 104th District Chairman of the Committee on Judiciary submitted the following report.\nMr. Speaker, your Committee on Judiciary has added a consideration to following bills at the House.\nInstructor, may you report the same back to the House with the following recommendation, House Bill 5060 passed by committee substitute, respectfully submitted Representative Chuck Heffstration, the 104th District Chairman.\nRepresentative Terry England, the 116th District Chairman of the Committee on Appropriations submitted the following report.\nMr. Speaker, your committee on appropriations has had on its consideration following Bill\nof the House.\nMr. Dr. Meade, report the same back to the House with the following recommendation.\nHouse Bill 80, do pass by committee substitute, respectfully submitted, represented in the\nEngland of the 116th District Chairman.\nThat completes the reading of the reports of standing committees.\nWe are about to go on to morning orders.\nChair is going to ask that members please take your seats.\nGive attention to the members in the well as you would expect that attention to be given\nto you.\nAll right, we're going on now to morning orders. The chair is going to limit members\nto two minutes each. Chair recognizes representative Maynard for a morning\norder. Thank you speaker Austin for the honor to speak to you today. Yesterday we\nspoke about Hank here and at length and I'd like to come to you today on behalf of\nof the Friendship Baptist Church family,\nwhere he will be late to rest today.\nI am a church member at Friendship Baptist Church.\nAnd I'm grateful that you have granted his family, friends,\nand the entire Friendship Baptist Church membership\nto lift his name in high regard under this gold dome.\nMr. Aaron will be late to rest at 1 p.m.\nIt is not often that an icon is also a neighbor.\nHammer and Hank is known by many as a legend in baseball,\nbut those close to him know him as a man of God first.\nIt delights my soul to see the outpouring of love\nacross our nation and the world for him.\nHis legacy is a testament that love truly does conquer all.\nI offer to Georgia and my colleagues a divine opportunity that sits before us, love.\nIt is my opinion that Hank Aaron is the greatest baseball player of all time.\nIt is the love of baseball, our love for the Atlanta Braves, and the love of this father\nand husband that we pause to honor him today.\nHis death reminds us we are more the same than we are different.\nsoon, but his warm smile will be remembered forever. Thank you, Speaker\nAustin. Chair recognizes representative or I'm sorry, Chairman James\nBershitt for a morning order. Thank you, Mr. Speaker. I don't often read prepared\nwords, but in this occasion I'm going to have to and hope just pray that I\nget through it. Today I've got some more solemn news. My good friend Matt Campbell,\nmany of you know he works out in the hall, experienced a tragic loss in his\nfamily. Matt's a friend of mine, he's been a friend of mine since 5th grade.\nMatt and his wife Chrissy are not just friends, they're my family. Now I don't\noften address his body with personal issues. However, my friend and his family\nexperience the tragic loss. Matt and Chrissy are feeling the pain that no parent\nshould have to feel. The camels have unexpectedly lost their 18-year-old son.\nAlthough there are no words to ease the anguish accompanied with the loss of a\nchild. I ask this body to pray that peace will find its way into their hearts. The\nhearts of Matt and Chrissy and Michael, Michael's younger sister, Mary\nCatherine and older brother, Tristan. Please take a moment to say a prayer for this\nfamily, say a prayer for the camels and for Michael. Appreciate it. Thank you Miss\nspeaker. Chair recognizes chairman David Knight for a morning order. Thank\nyou, Mr. Speaker. Again, sad news. I appreciate I want to get up and thank\neveryone for your thoughts and prayers last week is we lost my father-in-law last\nweek. It was sort of a double pain too because my brother-in-law, his wife, they\nlost her dad also within two days. But I think as is mentioned before, the prayers\nand the support from this general assembly, from this family are so important.\nAnd it was part of what had lifted us and kept us up through this time.\nAnd again, I think our faith will help us deal with this and have peace as we lost these\nfamily members.\nAnd again, the others that were mentioned before.\nSo again, thank you for your support.\nOne more thing, is this state goes through a lot of issues health care wise.\nfamilies, both families experienced something that I think was notable. We think of health\ncare. We think of a hospital or insurance or whatever. And I want to tell you the personal\nexperience from our families, both families of these men that we lost this week. It was\nthe physicians and the nurses. They not only treated and helped our loved ones physically,\nbut I won't tell you what was so uplifting. They helped treat them in a\npersonal and a spiritual way. Please pray for them. They've had a tough job and\nwe were so uplifted by how much they met to our families. Again, thank you so\nmuch to my general assembly family.\nChair recognizes representative Scott for a morning order.\nGood morning and thank you, Mrs. Speaker. Teachers are parents, too. We want to open\nup schools, but our state courts, cities, counties and federal offices are closed. Teachers\nour parents too. Open up all of our state, local, and federal offices, and then ex-teachers\nto go back to school. Open the DOL so they can pay out claims. Teachers are parents\nand have families that love them too. Remember, the teachers that have fallen to COVID,\nThey had childrens and families that loved them.\nLet's value a teacher's life and remember,\nthey have childrens and families that loved them too.\nThank you.\nChair recognizes representative Jasmine Clark\nfor a morning order.\nThank you, Mr. Speaker.\nToday I rise to give a short but very important history lesson.\nToday I rise to speak about the original 33.\n33 black or mixed race legislators duly elected after the Civil War in 1868\nthat were expelled from the Georgia General Assembly\nbecause they were black.\nTheir white colleagues did not believe\nthey had the right to serve in this body.\nThey had to fight for their right to serve in their own black\nskin.\nIn the years following the Supreme Court\nwould uphold their right to be legislators,\nbut that did not stop them from being killed, beaten,\nor jailed because of their willingness to serve.\nSo let's be crystal clear this rainy morning,\nthe original 33 were not expelled\nbecause of some self-serving, attention-seeking,\npersonal protest about following safety protocols.\nThey were expelled because they were black.\nPeriod.\nAnd it is never acceptable for anyone to co-op\nor misappropriate the pain, suffering, or oppression\nof black people to score political points.\nBlack people fighting to be treated like human beings\nis not the equivalent to your fight to not spit\nin a cup to protect your colleagues.\nThank you, Mr. Speaker.\nChair recognizes representative Mitchell for a morning order.\nGood morning and thank you Mr. Speaker I would like to bring you another science morning\norder because I think this is science, we see a lot in the media right now and this is\na science behind recommending people upgrade their masks.\nSo we did not know a lot about how well mask prevented exposure to COVID in the spring.\nWe do now.\nRecent science has shown two things.\nThere are two things that make your mask better.\nis that it stops virus from going out or going in through the fabric of the\nmask. The second is that you're stopping virus from going around the sides of\nthe mask. This is science from one group that looked at different mask\nmaterials and ask the first question. What materials actually work to stop\nvirus from going in and out of your mask through the material? And this group\nWe've also then looked at if we put different masks on faces, which ones stop material from\ngoing around the sides of the mask.\nSo the end result ends up pretty simple.\nIf you have an N95 or an equivalent mask, those serve both properties very well.\nHowever, if you have a simple cloth mask and you want to increase the efficacy of that\nmask, you can put a surgical mask behind it and wear them both at the same time and you\nwill be safer.\nyou have a cloth mask that you want to add that has three layers in it and one of them\nis not fabric or it has a filter in it that will make you safer. There are ways we can\nmessage using science to make sure that our constituents have this information to know\nwhen they go about their business how to do it in the best way possible. Thank you very\nmuch Mr. Speaker. Chair recognizes representative Derek Jackson for a morning\norder. Thank you Mr. Speaker. Good morning ladies and gentlemen everybody can\nbe great because anybody can serve. You don't have to have a college degree to serve. You\ndon't have to make your subject and verbs agree to serve. You only need a heart full of\ngrace, a soul generated by love. That is a quote by Dr. Martin Luther King Jr. Yesterday\nmy good friend, Representative Walisky, recognized John Assoff.\nToday I stand before you to recognize the other junior senator, the Reverend Dr. Rafael\nWarnock.\nIt's amazing when you have the opportunity, when government doesn't get in this way, when\nAnd there's no voter suppression.\nAnd we live to the creed of the Constitution to allow our citizens to decide who they\ndesire to represent them.\nAnd so Georgia had the opportunity to send this young man, he's younger than me, this\nyoung man at the tender age of 51, that is the senior pastor at Ebenezer Baptist Church\nto represent in the United States Senate on behalf of Georgia the first time ever.\nSo I conclude, Mr. Speaker, that in 2021, because those who look like me did not have the\nopportunity to serve regardless of their capabilities and capacity, we are in 2021 still\naccomplishing first. I yield the well. Thank you, Mr. Speaker. Chair recognizes\nRepresentative Henderson for a morning order. Thank you, Mr. Speaker. Good\nmorning to the House of Representatives. My name is Pastor Sharon Henderson and I\nI represent District 113, which includes Newton County and a portion of Rockdale County.\nI rise today to inform all of my constituents that I am here at the Capitol working for\nyou on legislation and advancing issues of concern for our community.\nI want you to know that I am working for you.\nMy team and I are committed to serving you.\nIf you need to contact me, I would\nlike to be available and transparent.\nMy number is 404-656-7859, or email me at\nSharon dot Henderson at house dot GA dot gov. I will keep you posted regularly on\nwhat's going on under the gold dome. Thank you for the opportunity to serve. God bless you.\nThank you, Mr. Speaker. I yield back.\nThe clerk will read the caption to a group of privileged resolutions.\nCongratulations in the Calaway Cavaliers for winning the 2021 GHSA Class AA State Football\nchampionship, honoring the life and memory of Ken Penule.\nCommending Dr. Michael Duncan, the 2021 Georgia Superintendent of the Year, commending\nand congratulating Ryan Dean, commending and congratulating Austin Jordan, commending\nand congratulating Marlow Elmager, commending and congratulating Dominique Krueger, commending\nin congratulating Brooks Hess.\nRecognizing February 9, 2021 is Chase Elliott Day,\ncommending the Georgia Institute of Technology\nin Northeast Georgia Health System\nand expressing appreciation for the efforts\nto provide COVID-19 surveillance testing program\nfor the Georgia General Assembly.\nRecognizing February 1 through 5, 2021\nis National School Counseling Week, honoring the life and memory\nFreeman Mount Gummary and for other purposes that completes the reading the privilege resolutions.\nIs there any objection to adopting the privilege resolutions?\nThe chair here is none and the resolutions are adopted.\nLet's have order just a moment.\nWe're about to go on to announcements.\nWe still seem to have a little bit of confusion about the frequency and method of testing.\nAnd I want to try to clear that up.\nThis is not a blanket objection to testing, but this is about how we're actually doing\nit.\nHere's the policy.\nHere's the policy.\nI'm going to do a test on this when we get through.\nEach member must test twice a week with Georgia Tech.\nOnly under pre-approved limited circumstances can other testing be substituted.\nYou've got to get prior approval.\nWe have set up the testing with Georgia Tech and the scheduling to optimize the safety of\neach member.\nAnd they're good about reporting back to us the number that have tested and the number\nof results without names.\nBut I want to repeat that.\nPlease hear me.\nEach member must test twice a week with Georgia Tech.\nThey will be testing tomorrow from 7 a.m. until 11 a.m.\nThey will be testing Monday from 7 a.m. to 11 a.m.\nAnd then every Monday that we're in session, and every Thursday that we're in session,\nand if we get off, we'll let you know.\nAnd in the normal course of things, it will be Monday and Thursday.\nSo I hope that clears up the testing policy.\nWhat purpose does the minority leader rise?\nSpeaker, I have a parliamentary inquiry.\nState your inquiry.\nIs it not true that if you're not tested on the days that Georgia Tech tests that you\nYou have to get a pre-approval for a test to make sure that you can come in the next legislative day.\nThat's correct.\nThank you.\nOkay, we're going on now to announcements.\nChair recognizes Chairman Watson for an announcement.\nThank you, Mr. Speaker.\nWe're going to kick off rule caucus today at 12 noon.\nFor those of you that have RSVPed,\nwe're going to be over at the Sloppy Floyd Building.\nWe will be socially distanced\nand we'll have box lunches provided\nby George Ager Business Council.\nSo look forward to seeing y'all in the Empower Room\nat 12 o'clock for real caucus.\nThank you.\nChair recognizes representative Kendrick\nfor an announcement.\nThank you, Mr. Speaker.\nGood morning again, colleagues.\nSo I'm inviting all the women of the legislature\nto take a picture with me tomorrow,\nwearing all white upon a German,\nand we will be celebrating the historic inauguration.\nThe first woman, vice president of the United States,\nKamala Harris.\nSo regardless of your political affiliation,\nI hope you will join me wearing your all white tomorrow\non the South Capitol steps as we commemorate this date\nin history.\nSo hopefully we will see you all tomorrow at the South Capital Steps,\nwearing your all white ladies.\nThank you.\nChair recognizes Chairman Hatchett for an announcement.\nThank you, Mr. Speaker.\nThe majority caucus will meet today at 1 p.m.\nin the Floyd Room at 20 hours, 1 p.m.\nNo lunch.\nThe meeting will last as long as you ask questions\nof Chairman England. So look forward to seeing you. Chair recognizes Chairman\nEngland for an announcement. Thank you Mr. Speaker. Members you have on your\ndesk the the bill and the tracking sheets. Those of you in the gallery in 341\nI think you should have them at your seats as well. Hang on to those. Those are\nyour working copies. The information has been posted live now on the House Budget Research\nOffice tab of the General Assembly website. So it is there and available if anyone needs\nto look at it or has any questions. Thank you.\nI hope you'll join with me in wishing a happy birthday today to Representative Greg\nKennerd representative Kennerd. Chair recognizes the majority leader of the\nHouse for a motion. Miss Speaker I moved this House stand adjourned until\nThursday January the 28th 2021 at 10 am. The majority leader has moved that\nthis house be adjourned until Thursday January 28th at 10 a.m. All those in favor of the\nmotion will say aye. Those opposed will say no. The eyes clearly have it in this house\nwill be adjourned until Thursday January 28th at 10 a.m.\n",
  "updated_at": "2026-02-12T16:12:35.838567+00:00"
}