{
  "video_id": "EDw6m9BDiok",
  "url": "https://youtu.be/EDw6m9BDiok",
  "title": "Georgia House - Day 12 (2026-11-18)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 12,
  "video_date": "2026-11-18",
  "duration_minutes": 54,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript from 2026-11-18:\n\n## Overview\nThe session featured a prayer and scripture reading by the chaplain, as well as a thoughtful message about seizing opportunities, adapting to change, and making the most of one's time as a leader. There were no notable legislative actions detected in the transcript.\n\n## Key Actions\nNo bills were passed or referred during this session.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- The chaplain, Reverend Stan Leicester, delivered a sermon reflecting on the importance of creating opportunities for growth and potential, adapting to change, and making the most of one's time as a leader.\n- Representative Casey Carpenter introduced the chaplain and was praised for his frequent participation.\n\n## Votes\nNo recorded votes were mentioned in the transcript.\n\n## Attendance\nThe transcript notes that the Speaker called all members to the floor for the morning roll call, indicating a quorum was present.\n\n## Adjournment\nThe session was adjourned, but the transcript does not specify the exact time or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nI'll also stand at ease until 1015.\nHouse will stand at ease until 1015.\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThe Alpha convening having arrived, all members will please take their seats, all members will report to the floor of the house and take your seats, the clerk will ring the bell.\nYou\nAll members will please report to the floor we're about to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber\nand the clerk will unlock the machines.\nhave all members voted, have all members voted, if so the clerk will lock the machines.\nDoorkeepers will please close the doors and keep them closed.\nGood morning.\nHope everybody is feeling well today.\nWe will begin our day with scripture reading and prayer by the chaplain after which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the fourth house district representative Casey Carpenter representative Carpenter.\nThank you, thank you, Mr. Speaker, brothers and sisters of the house, I get to introduce\nagain my dear friend Reverend Stan Leicester, best I can calculate, besides the speaker\nand speaker Pro Tem Jones, Reverend Stan Leicester is now number three on the list of talking\non this microphone, so this is his third time here in like the last year and a half, he\nIt does a great job.\nAppreciate you having us, and I hope to hear a good word.\nThank you, guys.\nI wondered how this house has allowed Casey Carpenter\nto stay in such good graces here for so long.\nAnd then I walked in this morning\nand the place smells like a big ham biscuit,\nand I understand a little bit now,\nhe brings ham biscuits when he comes.\nSo, Speaker Olston, Representative Carpenter,\nthank you for the opportunity to share today\nand also to those of you who are members of the House.\nThank you for your steadfast commitment\nto help lead the great state of Georgia.\nThere's a part of the country called Death Valley.\nIt's the hottest place in North America.\nAverage temperature in September is 107 degrees.\nIn 2020, Death Valley hit 130 degrees.\naverage precipitation? Essentially zero. Something significant happened because\nDeath Valley is called Death Valley because nothing ever grows there. The surface\nis crusty, nothing happens, and something significant happened in 2004, the\nwinner of 2004, seven inches of rain fell in a very short period of time. It\nhappened quickly, and immediately nothing happened, but eventually something\nbegan to happen. In the spring of 2005, death valley was covered with wildflowers and flowers\nand vegetation. And what they determined was this, that death valley wasn't dead, death\nvalley was dormant, that beneath the surface there were seeds of potential and opportunity.\nAnd when you think about it, the idea is that when you get seeds of opportunity in the\nthe right environment and growth happens.\nAnd whether we're educators or lawyers or pastors or whether we're teachers or legislators.\nWhat we do is we position people in the right environments so that they can experience growth\nand their potential and be everything that they're supposed to be.\nPaul writes in Ephesians chapter 5 verse 15, be careful how you live, not as unwise but\nis wise, making the most of your time because the days that we're living in are evil, making\nthe most of your time. Maybe a great command of the Scripture that we rarely ever even realize\nis found in that passage that we should make the most of our time. We should redeem the\ntime that we have. He says, first of all, be careful how you live. He's not talking about\nbeing cautious. He's talking about taking the most of the opportunities that are before\nyou. The word is, is ab porta. It means it means that when the ships would come in, it's\na nautical term, when the ships would come in to port, the tide would rise, and when\nthe tide would rise, that's when the ships could come in. It was their opportunity to bring\nthe ships into port. It's been said that the opportunity of a lifetime has to be seized\nin the lifetime of the opportunity. And so every one of us have opportunities to make\na better Georgia for those around us. As leaders, we lead in such a way that create\nopportunity for others. The other thing that Paul teaches us is that we have to adapt.\nWe have to adapt to change. We have to adapt to circumstances. He says, don't be unwise,\nbut be wise. If we've learned anything over the last 18 months, we've learned the importance\nof adaptation. That we have to shift. We have to change. In 2013, Eastman Kodak sold at\n$35 a share. Yesterday, Kodak closed at $6.75 a share. Why the decline? Kodak was so\nblinded by its success that it missed the rise of the digital technology. That doesn't\nmake sense because the first digital camera was created in 1975 by an engineer named Steve\nSassen who worked for Eastman Kodak. It was as big as a toaster. It took 20 seconds to\ntake an image, it was low quality required, complicated connections to a television\nto view, and it clearly had massive disruptive potential.\nSassen himself told the New York Times that management's response to his digital technology\nand camera was, that's cute, don't tell anyone about it.\nSpotting something and doing something about it are two different things.\nI could act in vented the technology, but didn't believe in it enough to invest in it.\nAs legislators, as pastors, as teachers, we create a better tomorrow.\nWe believe in people.\nWe hope in people.\nWe believe in the possibility of seeds coming to life that maybe had been dormant for a long\ntime.\nHaving wisdom to know what to do is not enough.\nWisdom demands courage to do what we know we ought to do.\nThe third thing that Paul tells us is make the most of your time.\nMake the most of every moment you have because the days that we're living in their fleeting,\nhe says they're evil.\nAnd sometimes the way to make the most of things are right before us, right?\nWe've all experienced this where we're searching for something that's right in our hands,\nright?\nWe've yelled at the kids who took my car keys and as we're looking for our car keys,\nour wife, our husband looks at us and says, you're carrying them in your hand or we have\nof our reading glasses on the top of our head\nwhile we're looking for them.\nAnd my wife will look at me and say,\nyour reading glasses are right on the top of your head.\nSometimes the thing that we're looking for\nis right before us.\nI recently read this article,\na Turkish man, Bayon Mutlu, 50,\nwho lives in the Northwestern Berza Province,\nwas believed to be missing Tuesday,\nafter he wandered away drunk in the forest\nfrom his group of friends.\nWhen reported missing, a search party\nwas formed to find him.\nMutlu had fallen asleep in the forest.\nAnd the next morning when he awakened,\nhe came across the search party looking for a lost man.\nMutlu unknowingly joined the search party\nto find himself.\nWhen the volunteers began shouting his name,\nMutlu became confused and asked, who are you looking for?\nWhen they said his name, he said, I'm here.\nPolice realized the man they were looking for had joined his own search party and gave\nhim a ride home.\nIs it possible the very answers we're looking for are right before us?\nThat's what Paul would say.\nHe would say, make the most of the moments that are before you, but don't be so complex\nand so complicated as educators, or pastors, or leaders, or moms, or dads, or legislators\nthat we miss what's right before us.\nIf the scripture would scream one thing at us, it would scream this.\nThe thing that is right before us is simply this, love the Lord your God with all your\nheart, soul, mind, and strength, and love your neighbor as yourself.\nIt's really pretty simple, right?\nLove yourself because the only way to love your neighbor, your brother, your sister,\nis to love yourself.\nAnd out of that love for yourself,\nyou love others.\nAnd it all begins with an understanding\nthat we love God above all else.\nLove the Lord your God with all of your heart.\nMaybe the best way for us to reach people\nis to simply be kind.\nMaybe the best way for us to lead people\nis to simply be kind.\nIn an atmosphere where it feels like kindness is missing.\nIn our world, in our cultures, in our nation,\nMaybe the greatest thing that we need is right in front of us to simply love God and\nto love one another.\nWhat I've found to be true is this, that I can disagree with someone, I can disagree with\ntheir lifestyle, I can disagree with their preferences, I can disagree with their political\nleanings and still love them and still be kind to them.\nHow do we make the most of every moment?\nlead with humility by loving people and being kind to them. Would you pray with me?\nFather, I thank you today for your great grace. I thank you for this house. I thank you\nfor leader Rostin and the gift that he is to us. I thank you, Lord, for the many hours\nthat are invested. God, they're not hours invested in vain, but they make for us a better\nfuture and not just for us, but for our kids and our grandchildren. And I pray that your\ngreat grace would be upon each of them.\nThat God should give them wisdom, but not just wisdom, but courage, courage to make the\nkinds of decision that's going to help us be who we're supposed to be in our future.\nI pray God for the families, the marriages, the children that are represented, the grandchildren\nthat are represented in this room.\nI pray that this be a season of great grace.\nI pray for great rest during the holiday seasons, that God's memories would be made, that\nrest would be experienced.\nGod when everything is said and done, because we understand, Lord, in the great state of Georgia,\nthat all good things come from the Father of Lights will be careful to give you honor, to\ngive you glory in the name of our risen Savior, Jesus. Amen.\nI pledge allegiance to the flag of the United States of America and to the Republic for\nfor which it stands, one nation under God, indivisible, with liberty and justice for all.\nThank you, Speaker.\nAlways, always play.\nAlways, always enjoy.\nAbsolutely.\nAt any time.\nKeep everything straight and dull.\nChair recognizes Chairman Hogan, the Chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of a previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, if you compare yourself with others, you may become vain or\nbitter, where always there will be greater and lesser persons than yourself.\nChairman Hogan, the chair of the Committee on Information and Audits, reports that the\nThe journal of the previous legislative day has been read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here's none and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns on the 59th, who has fallen to be established as the order of business during\nthe first part of the period unanimous consent, introduction of bills and resolutions, reports\nof standing committees.\nThird reading and passage of uncontested local bills and resolutions, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is none and the resolution is adopted.\nReports of standing committees, the clerk will read.\nRepresentative Chantankus on the out of 60th District Chairman of the Committee on Intergovernment\ncourt nation local submitted the following report.\nWe'll speak to your committee on intergovernmental\ncoordination locals that on consideration following\nbills of the house.\nInstructor be to report the same back to the house and\nfollowing recommendation house bill 11 EX due pass.\nThis fact police admitted represent a tanker's lead 160th\ndistrict chair.\nI can please the reading the reports of standing\ncommittees.\nOkay, we're going on now to morning orders.\nActually, we're going on to the local calendar.\nThird reading and passage of uncontested local bills.\nWe have one bill on the local calendar.\nIf there is no objection, we will vote on the local calendar as a whole with a recorded\nvote.\nHearing none, it is so ordered, the clerk will read the local calendar.\nCouncilor Levin, E.X. by repson of Anderson's the 10th City of Cornelia.\nIs there any objection to the previous question being ordered on the local calendar?\nChair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favorable\nto the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to shall this bill now pass all those in favor\nof the passage of the bill on the local calendar will vote aye those opposed will vote no and\nthe clerk will unlock the machines.\nAll members voted have all members voted if so the clerk will lock the machine on the\npassage of the bill on the local calendar the eyes are one hundred and thirty nine the\nNays or zero. This bill having received the requisite constitutional majority is\ntherefore passed. Going on now to morning orders. Chair's going to ask that\nmembers please take your seats and be respectful to those presenting morning\norders of the chair recognizes Chairman Cooper for a morning order three minutes each\non morning orders today. Thank you, Mr. Speaker and ladies and gentlemen of the House.\nI'm not here to remind you to put a gift in for the toys for tots. I'm here to ask\nyou to patch yourself on the back and thank you for helping me in 2016 pass House Bill\n897, which was the donated drug repository program. This is one of the fastest growing\ndonation programs in the country, allowing unexpired surplus medicines to be redistributed\nto low income families and via networks of charities, clinics, and\npharmacists like Good Pill. Here in Georgia, we have GoodPill.org, GoodPill\nPharmacy. It's not an in-house pharmacy. It's the pharmacy that distributes\nthese drugs all over our state at a cost of about $6 for a 90-day supply of\nof hypertension drugs, drugs for heart failure, for depression, but we've got a problem.\nWe have a lot of people that don't know that there is a thing called the good pill\npharmacy and that they can get their drugs from that if they have financial problems and we have\na lot of people thanks to this COVID that are in that situation. So tomorrow morning outside,\nI'm going to have packets of this, this little card that you can take home and give to\nyour safety net organizations like a food bank or somewhere where they will be given out.\nAnd on the back of them, it's a real easy step-by-step way for the person to start getting their\nmedicines from good pill pharmacy. Give yourself a real big pat on the back for passing this bill.\nit came out of the house and like I said it's one of the fastest growing and we were the first one\nto do it statewide via mail which is especially good to help our elderly in our rural areas that\nmay have trouble getting to a pharmacy. Thank you again, thank you Mr. Speaker.\nChair recognizes representative drier for a morning order.\nThank you, Mr. Speaker.\nYesterday, there was a very grim statistic that was released in the past year over 100,000\nAmericans have died from drug overdoses.\nWe're seeing triple quadruple number of drug overdose deaths from just two to three\nyears ago.\nThere are people like Joe Thomas, Dustin Manning, 18 19-year-olds from Lawrenceville, who\nplayed baseball and fish together and accidentally took a pill that was laced with fentanyl\nand died.\nBut I think this has touched a lot of people in all of our districts.\nI think it's probably touched each of us once, even if it's a friend or a friend's son\ndaughter, but every one of these 100,000 people are brothers, sisters, mothers, fathers,\nsons, and daughters, and so we have work to do, but I think today would be a good moment\nto take a moment of silence to honor the lives that were lost.\nThank you so much, colleagues.\nThe clerk will read the caption to a group of privilege resolutions.\nThis is a historic day in this house.\nI have to share this with all of you.\nWe have no privilege resolutions.\ngoing. We have no birthdays, we have some announcements. If you have signed up\nfor an announcement, make you wait at the front of the chamber. Chair recognizes\nrepresentative Billy McLean for an announcement?\nThank you, Mr. Speaker.\nThe working family caucus is having a special Zoom virtual meeting today.\nSo please join us, U.S. Secretary of Labor Marty Walsh.\nWe'll be talking about bill back better programs.\nSo please look at your e-mails.\nYou'll have them find the information.\nand for the members, there's lunch provided in room 307 and the CLOB.\nAgain, this starts at 12 o'clock.\nThank you, Mr. Speaker.\nChair recognizes Representative Weedower for an announcement.\nThank you, Mr. Speaker.\nMembers of the House Working Group on rising costs and construction materials,\nwe have a meeting at 1 o'clock in 606.\nLunch will be served in 502 at 12 o'clock.\nThank you, Mr. Speaker.\nChair recognizes Chairman Darlene Taylor for an announcement.\nThank you, Mr. Speaker. The Congressional Reapportionment Committee and House Legislative\nCongressional Reapportionment Committee will meet at noon today in 406, 406. Thank you.\nChair recognizes Chairman Collins for an announcement.\nThank you, Mr. Speaker, the House Public Safety and Homeland Security Committee will be meeting at 1 o'clock in room 506.\nThat's a change from our normal meeting place of 406, so 506 at 1 p.m., CLOB, look forward to seeing you there.\nThat completes our announcements. The chair recognizes the majority leader of this house for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move to this House stand adjourned\nuntil 10 a.m. 10 a.m. Friday, November the 19th, 2021.\nThe majority leader has moved that this House be adjourned\nuntil Friday, November 19 at 10 o'clock a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no, the eyes have it.\nAnd this house will be adjourned until Friday.\n",
  "updated_at": "2026-02-12T12:38:38.217801+00:00"
}