{
  "video_id": "eg_e3D7wkvI",
  "url": "https://www.youtube.com/watch?v=eg_e3D7wkvI",
  "title": "08.21.2024 Secretary of the Senate James M. Tripp: Swearing-in Ceremony",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2024,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 16,
  "summary": "Here is a structured markdown summary of the Georgia 08.21.2024 Secretary of the Senate James M. Tripp: Swearing-in Ceremony session:\n\n# Georgia Senate Session Summary - 08.21.2024\n\n## Overview\nThis was a swearing-in ceremony for the new Georgia Senate Secretary, James M. \"Jack\" Tripp. The session focused on celebrating Tripp's appointment and honoring the previous Secretaries, David Cook and Bob Ewing.\n\n## Key Actions\nNone detected.\n\n## Bills Introduced (First Reading) \nNone detected.\n\n## Notable Moments\n- Chaplain Ron offered an opening prayer.\n- Outgoing Secretary David Cook and former Secretary Bob Ewing were recognized for their service.\n- Lt. Governor and Senate Pro Tempore officially appointed Jack Tripp as the new Secretary of the Senate.\n- Tripp was sworn in by the Senate Pro Tempore.\n- Speakers praised Tripp's experience and qualifications, as well as the capable team in the Secretary's office.\n\n## Votes\nNone recorded.\n\n## Attendance\nNo explicit quorum notes, but a full chamber is implied.\n\n## Adjournment\nNo specific adjournment time noted, but the ceremony concluded after the swearing-in.",
  "transcript": "We'd like to get this ceremony started.\nI tell you, I welcome everybody who's in the back\nfor the chairs who aren't already taken.\nY'all come and fill in the areas, the front rows.\nNow, this in church service,\nso y'all can fill in the first couple rows.\nWe're not going to be all from for all friends,\nso, asking for one.\nY'all always still got those that sit in the back, though.\nNevertheless, come on around, come on around.\nI see our chaplain, Ron.\nRon, you want to come up here and we probably all need a little prayer in today.\nSo you won't come up here and offer a water prayer for us\nbefore we get started, we usually start,\nfor those who aren't familiar,\nwe usually start with a chaplain of the day.\nHe's not gonna do a message a day,\nhe's just gonna do a prayer,\nbut I think it's always good to start with prayer, Ron.\nYou mind?\nThank God, appreciate that.\nThank you very much.\nThank you for everyone for being here.\nYes, people please stand and we'll have a moment of prayer.\nLord God, thank you for government.\nGovernment is ordained by you\nand great responsibilities, great privileges involved\nin serving, and I just as King Solomon\nrecognize those responsibilities, those privileges.\nHe asked for a wise and a discerning heart.\nSo I pray that for our new Secretary of the Senate,\na Jack trip, I pray that he would just know your favor.\nHe would know the also passing greatness of your power.\nThose of us who do believe in Jesus Christ\nis Lord and Savior, God.\nSo thank you that we can call upon you.\nPray that you're pleased with all the proceedings\nhere this morning, and I ask all these things\nand may name a Christ my Lord.\nAmen.\nGo.\nThank you, Ron.\nAppreciate it.\nThank you.\nThank you.\nThank you, Ron.\nI appreciate that.\nThat is a very special occasion today, and we're very excited to be here, and I thank\neveryone for attending this ceremony today.\nWe also, it's time to celebrate a new era here in the secretaries as the, here in the\nSenate with the new secretary, but also want to recognize two fine gentlemen who have served\nthan this post, David Cook and Mr. Ewing back there who I believe I know I've been here\ntoo long because we've made history today. For all of you for the first time since 1789,\nwe have three secretaries of the Senate, two former and one by to be current, secretaries\nthat's here today and so now that we've made history I think I'll just I'll let Senator Kennedy take it over from here\nSo but no let's give all those guys a round of applause, please\nAnd it is my honor to recognize the Senate Pro Tem obviously\nWe are a jack trip is is going to be taking the reins here as a new secretary and we're\nvery excited about jack he's worked in this role actually he's worked in just about\nevery role in the secretary's office for the last ten years which I am I have always\na big a big proponent of of always elevating those who have earned the right to to hold\nto position. I do it in my private business and I've done it throughout my career and\nI didn't want to change the way that we had done things that I'd been used to doing\nthings in the past because Jack has always done, has such a light David Cook, has such\na calm demeanor and has always done a fabulous job and they've got a great group of young\npeople that work in that office and you can tell there's good camaraderie and we felt\nWhen Senator Kennedy and I, the pro-tum got together and started talking about who were we going to get to replace?\nSecretary Cook, I said, I don't think there's any reason to mess with the\nwith the the group that we have right now and\nUntil they prove otherwise, you know, and I think they're gonna do a great job\nAnd I was glad that the Senator Kennedy and I saw that I and the value of that and\nand for the official moment of appointing Jack out,\nSenator Kennedy will make the official appointment\nand then I will do the swearing in\nand then we can congratulate the family.\nI don't know if it's congratulations to the wife now.\nHe's gonna have a lot of hours here during session tonight\nbut it's good to have both his parents, his wife\nand his in-laws here as well.\nSo without any more delay,\nI recognize the senator, the pro-tem,\nbut the Senate, Senator Kennedy.\nWell, good morning.\nAnd thank you, Mr. President, ladies and gentlemen,\nand members of the Senate that are here,\nthank you for being here,\nand thanks to all the distinguished guests.\nI know it means a lot to Jack's family as it does\nthe president and me as Pro Tem and all the members\nof the Senate for this important work\nthat we're here to do today.\nLet me add my words of welcome.\nIt is wonderful to see so many members and friends\nand the family of Jack Tripp that's with us today\nfor a really, really nice occasion.\nBefore I formally make the appointment,\nI wanna take a moment and briefly mention the process\nas the president alluded to a minute ago\nof how we really got here today.\nWhen there's a vacancy in the position\nof the Secretary of the Senate,\nGeorgia Law says that it is the duty\nof the President Pro Tem of the Senate\nto appoint an individual to the post.\nAnd that position will later be voted on\nwhen we come back here in January\nand enter the session for next year.\nWhen Secretary David Cook decided to retire,\nI understood that we needed someone\nto fill some shoes that quite frankly,\nwere almost too big to fill.\nAnd this is a historic vacancy that many President\nPro Tems in the past have had the honor of filling,\nand I'm certainly indeed honored to get to do that today.\nWith that in mind, I do take this duty very seriously.\nI consulted with our Lieutenant Governor,\nas he referenced, and appreciate the guidance and leadership\nthat he gave me, and as he said in the conversations\nwe had, it very quickly turned to the obvious choice\nof who we could turn to to fill these big shoes to do a fantastic job and maintain what\nDavid Secretary David Cook has done for so long, and we certainly appreciate his guidance.\nAnd quite frankly, there was a clear consensus between me and the lieutenant governor over\nwho the next secretary should be.\nWith that being said, and with a full endorsement of our lieutenant governor, the president\nof this body and importantly, Secretary David Cook.\nAnd pursuant to the authority granted to me\nunder section three of Title 28\nof the official Code of Georgia,\nhereby point James M. Jack Tripp\nas the Secretary of the Georgia Senate\nto serve until the next session of the General Assembly.\nThank you.\nJack, if you'll raise your right hand or pee after me, I do hear by solemnly swear or\naffirm that I will discharge my duties faithfully and to the best of my skills and knowledge.\nTo the best of my skills and knowledge.\nSo help me God.\nThank you all.\nCongratulations.\nI'm very happy that we were able to make this decision but the pro team and I always see\nout of our own most everything so it was an easy choice.\nIt is some big shoes to feel, David Cook, I just can't express my gratitude to you and\nwhat a wonderful job you've done Bob, I was young when I first got here and you were\nCasey, Lieutenant Governor Casey Kagle always bragged about the job that you did and you were\nalways very professional and just very gentleman-like and in my short brief but very pleasant\ndealings with you and we appreciate you being here as well. So I just proud to have Jack\nhere and proud to have the team, the IS team back because like I said, they are invaluable\nto this body and to the every member here that serves in this state, they are very helpful,\nvery good and very just on top of their game and everything that they do and I want to\nkeep that tradition going until somebody else wants this job and I can assure you that\nThe next person will be in good hands with this group in place.\nSo Senator, you like it?\nYeah.\nThank you, Mr. President, for those comments.\nJust a few more.\nI echo the sentiments of our President\nthat it really cannot be overstated of how vital and the value\nthat the role of the Secretary is at the Georgia Senate.\nAs you see, our current President do so smoothly and eloquently.\nIt seems second nature when you watch him,\nBut it's not really when you start,\nunless you've got someone like a David Cook\nand now a Jack Trip that's right on your wing\nto help you make sure things do go smoothly.\nThe people of Georgia and lately the entire nation\nseem to be tuning into the votes\nthat we have right here in this chamber\nand watching this closely.\nBut what was important, but somewhat,\nthe quiet duty of voting and debating\nis now seemingly the highlight of what we see\non the news at night.\nBut that's just what is seen out there from this chamber.\nWhat happens behind the scenes is critical\nto make sure that things do, in fact, run smoothly.\nIn the Lieutenant Governor and I talking about this\nand also the work that is done by the Secretary,\nnot only assisting us, but also helping\nand counseling committee chairman and other members\nas we navigate the procedures of doing the business\nof the people in this, the upper chamber,\nis so important to the work of this distinguished body.\nLucky for us, Jack has been sitting close by watching\nand helping, and also under the tutelage of Secretary Cook.\nAnd he's done that for the last two years\nwhile being right here on the rostrum.\nAnd before that, he was managing the voting procedures\nand the floor activity here in the chamber,\nalso helping Secretary Cook.\nNow he'll be standing right here on the rostrum\nwith his name and his work being directly impactful\non the lives of 11 million Georgians\nand all 56 senators without the privilege\nof coming in here and doing the work that we do.\nLet me make a way for the newest constitutional officer\nof the and the 44th Secretary of the Senate,\nSecretary James Tripp, but before I do,\nI also wanna give a shout out to all those\nthat have supported Secretary Cook\nand that will be supporting Secretary Tripp.\nAnd that is the staff of the Secretary's office.\nMany of them are here today.\nThank you.\nNot only for being here, thank you for the work\nthat you've done that make this chamber operate so smoothly.\nThanks for making Secretary cook look good for the last while.\nAnd thank you for what you'll do to make Secretary trip look good\nas we all work together.\nSo thank you for that.\nAnd with that, I bring you Secretary Trip.\nThank you very much and good morning. I'm so glad to see so many of the Senate staff\nyour day. It's, it is truly y'all who make this system go. So I'm grateful for the deep\nhonor you've given me to show up. Senator Kennedy, thank you very much for those kind\nwords. I truly value the trust and confidence you've placed in me by making this appointment\nand very much look forward to earning further your trust\nand confidence in the role.\nIt's one of the great honors of my life\nto be asked to serve as secretary.\nSo thank you for that.\nLieutenant Governor General Delso,\nI want to thank you for your kind words as well\nand for your support in the selection process\nand throughout my time in the Senate.\nIt really means a lot.\nI look forward to working with both of you\nas well as the distinguished members of this Georgia Senate\nto whom I owe a special debt of gratitude\nas I've been able to see for the better part\nthe last decade how you have shown the hard lessons of public service and what that is and\nhow best to do it. I'm grateful to you for your service and for your sacrifice on behalf\nof this body. When I or the office of the secretary can be of help to you, please don't\nhesitate to reach out. It's our honor.\nAlso I'm grateful for Secretary Cook and for Secretary Ewing to being here today and\nfor the immense shoes that they've left to fill.\nI'm glad the President, Pro Tim and I are in this\nin agreement on the size of shoes left to fill.\nThe impact of your many years of faithful service\nto this body and to the state will echo down\nthe generations of this great Senate.\nAs part of that enduring legacy,\nDavid and Bob have built a great and truly exceptional staff,\nboth past and present, many of whom I am deeply privileged\nto call friends, being asked to serve as a leader of friends\nis both a great honor and a daunting responsibility,\none for which I am very thankful and do not take lightfully.\nI would be remiss to not mention my family,\nwithout whom, as I think many of you would agree,\nthe work we do here would simply not be possible.\nTo my beloved wife, Kaitlyn, my parents,\nKathy and Troy, my in-laws, John and Jesse,\nand my adored grandparents.\nThank you for the many lessons you taught me,\nand for putting up with the many difficulties\nthat this work entails.\nI would not be here without you.\nAnd finally, Mr. President, I'm a great believer\nin the lesson which so many of our Senate chaplains have tried to impart, he who is heard\nbriefly will be heard again. Thank you very much.\nIt is, this will be the conclusion of our ceremonial event.\nThere will be a reception in room 230 here at the Capitol after this, but as custom\nhere, the Senate, when we do honor somebody here on the roster, particularly our pastors\nof the day, but other people as well, what we usually do is have those individuals or\ntheir family come down to the side here and the people in the room will come by and congratulate\nthem, and if y'all would do me the courtesy of doing that for Jack and Katelyn, I would\nbe greatly appreciative because it is a big honor that we have for him to be promoted\nto this position, but it's a lot of responsibility and I recognize that and he is ready\nfor the job and he will have a learning curve like we all do and anything we do, but I think\nhe is well prepared and we'll do us a fine job and we just appreciate it one being here today\nand y'all have a wonderful day. Take care.\n",
  "updated_at": "2026-02-12T19:12:31.388656+00:00"
}