{
  "video_id": "EkdGAFw4NwE",
  "url": "https://youtu.be/EkdGAFw4NwE",
  "title": "Georgia House - Day 34 (2026-06-19)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 34,
  "video_date": "2026-06-19",
  "duration_minutes": 79,
  "summary": "Here is a summary of the Georgia House session on 2026-06-19:\n\n**Overview**:\nThis session featured the passage of two notable bills, SB 431 and SB 346, related to education and veterinary medicine. There was also discussion of several other bills and some routine procedural matters.\n\n**Key Actions**:\n**SB 431**: Provides a definition of \"on-time graduation rate\" for school performance evaluations.\n**SB 346**: Increases the membership of the State Board of Veterinary Medicine and authorizes a registered veterinary technician member.\n\n**Bills Introduced (First Reading)**:\nNone highlighted in the transcript.\n\n**Notable Moments**:\n- It was the birthday of Representative Randy Nix, who presented SB 431.\n- There was some discussion around the process of tracking student enrollment and graduation rates for schools.\n\n**Votes**:\n- SB 431 passed with a vote of 122-0.\n\n**Attendance**:\nThe transcript indicates a quorum was present, with a large number of representatives voting on the bills.\n\n**Adjournment**:\nThe transcript does not specify when the session adjourned or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nThis House will come back to order, House will come back to order.\nMr. Clark, would you ring the bell, please?\nThe clerk will read the caption to a group of privileged resolutions.\nClerk will read encouraging all Georgians to participate in the 2020 census to ensure\na complete and accurate count, recognizing April 3rd, 2020, his community activists\nday to acknowledge the unsung hero activists and their strength, selfless courage and hopeless\nhopeful actions that create a positive and much improved future.\nAnd for other purposes, that completes the reading of the Privilege Resolutions.\nIs there any objection to the adoption of the Privilege Resolutions?\nThe chair here is none and the resolutions are adopted.\nWhat purpose does the chairman of the rules committee rise?\nMake a motion.\nState your motion.\nRecommit Senate Bill 316 and 336 to rules.\nChairman of the Rules Committee has moved that Senate Bill 316 and Senate Bill 336 be\nrecommitted to the Rules Committee as their objection.\nIs their objection?\nThe chair here is none and those are back in the Rules Committee.\nor read the caption to Senate Bill 431.\nSenate Bill 431 by Senator Wilkinson\nand the 50th tip is the 37th plaque\nof the 8th. We're asked to the 28th and\nMartin of the 9th. We titled an act\nto amend Code Section 2210.\nThe official put a Georgia and\nSenator relayed an annual performance\nevaluations so as to provide for\nfor a definition of on-time graduation rate,\nthis bill haven't referred to the Committee\non Education, that committee recommends\nthat this bill do pass.\nChair recognizes Chairman Nix to present the bill.\nBut before he does, you can go ahead and go up there.\nI want y'all to know that today is Chairman Nix's birthday.\nHappy birthday to Chairman Randy Knicks.\nSo you can't ever say I didn't get you anything for your birthday.\nThat's right.\nThank you, Mr. Speaker.\nAs I've said so many times during the session when we're always here in the winter,\nit's a cold day somewhere when we're here and I'm getting happy birthday.\nSo I'm not sure who is cold that, Mr. Speaker, but it's a cold day in somewhere.\nSenate bill 431\nThis is a short bill fairly\nSimple there's a complex formula, but let me tell you what it does\nWhen students go to register to go to a school a lot of times they will go in and they will register in July and August\nAnd a lot of those students never actually go to that school\nIf that school has registered those students even though they don't go in and never start there\ntheir candidate on their graduation rate.\nSo what this bill does, this bill sets October 1st said\nthat the cohort of students that attend a school\ncontinuously from October 1 of the calendar year,\nfour years prior to the calendar year,\nthe regular date of graduation.\nThat would be what was used to determine\nthe graduation rate for the school.\nIt's a better measure for the individual school.\nThere's a lot of tracking they have to do to track down\nstudents who leave and who come in but this gives the individual school\nitself a way to say okay this is what's happened when we get the kids here\nwhen they're in the ninth grade and they go they stay with us and we get them\ngraduate and these are the percentage of those kids who graduate so it's\npretty pretty simple there if you get into all the the calculations that go into\ngraduation it gets a little bit more difficult but that's the simple version of\nit Mr. Speaker and I'll be glad to try to answer any questions I don't think you\nhave any questions well thank you very much and I'll go back over and start\ncelebrating the rest of my birthday here with all my friends tonight on Friday\nnight thank you would you have it any other way is there any objection to the\nThe previous question being ordered, the chair here is none, the previous question is ordered.\nIs there any objection to agreeing to the report of the committee, which was favourable\nto the passage of the bill?\nThe chair here is none, the report of the committee is agreed to, shall this bill now pass?\nAll those in favour of the passage of Senate Bill 431 will vote aye, those opposed will\nvote no, and the clerk will unlock the machines.\nAlexander, Anelowicz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Burns, Carpenter, Carson,\nJocos, Clark H, Collins, Cooper, Corvette,\nDempsey, Dickie, Dollar, Drenner, Dubnick,\nEfstration, England, Irwin, Fleming, Frye, Gaines,\nGardner, Clinton, Graveli, Herald, Hatchett,\nHawkins, Hitchens, Holcomb, Holmes, Houston, Hugley, Jackson M, Jasper's, Jones J, Kelly,\nKendrick, Knight, LaHood, Larickia, Lomston, Martin,\nMathiac, McCall, Morris G, Newton, Nix, Oliver,\nParish, Parsons, Petri, Perkle, Powell, Reeves, Roads, Rich, Ridley, Rutledge, Skoggins,\nSetsler, Silcox, Smith L, Smith R, Smith V, Smirrey,\nStevens R, Tankersley, Tanner,\nTarvan, Taylor, Thomas E,\nTramble, Washburn, Watson, Welch,\nWorkhizer, Weed Hour, Williams A,\nWilliamson, Yerda, Allen,\nBayes Moore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDryer, Dunnehu, Earnhardt, Airhardt, Evans, Frazier,\nGilligan, Gertler, Hanson, Hill, Hogan, Holland,\nHolly, Hobson, Hobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V,\nKaush, Kenard, Lopez Romero, Marin, McClain, McClaren, McCloud,\nMeeks, Mitchell, Moore B, Moore C, Morris M. Nelson,\nwhen Paris, Prince, Pullen, Robyshow,\nSaints, Skofield, Scott, Shannon, Sharper, Smith M.,\nStevens M., Steven Sin, Thomas A. M., Turner,\nWalensky, Wilkerson, Williams M.F., Williams N. Wilson,\nBeasley Tig, B.C.T., Bonner, Buckner,\nYes.\nPerchette.\nPerchette.\nCall well.\nYes.\nCampbell.\nYes.\nCantrell.\nCantrell.\nYes.\nDickerson.\nDukes.\nYes.\nDukes.\nDukes.\nGamble.\nGamble.\nYes.\nGileared.\nGillion, Jordan, Gordon, Green, Green, Yes, Gollant, Yes, Jones, J.B., Jones, J.B., Yes,\nKirby.\nYes.\nLot.\nYes.\nMathis.\nMathis.\nYes.\nMathis.\nMathis.\nMathis.\nMathis.\nYes.\nMathis.\nMathis.\nYes.\nMontahan.\nYes.\nMark.\nYes.\nPark.\nPark.\nYes.\nPrude.\nPrude.\nRogers.\nPromise. Singleton. Singleton. Yes. Stovall. Yes. Williams R. Williams R.\nBees more, beastly teag, beverly, bode, burnow, I think bode was a yes, burnow did not sound,\nI'll sound again.\nBernal, carpenter, Collins, cook, Davis, Dempsey, Dickie, dollar, dryer,\nDestration, Evans, Gardner, Gileared, Gordon, Hitchens, Hutchinson, Jasper's,\nJones J.\nJones V.\nMartin.\nMcLeod.\nMitchell.\nPowell.\nPrince.\nRidley, Robucho, Skofield, Scott, Smyrie, Taylor, Washburn,\nWork Iser, Williams R, Williams Sun.\nOkay, members will take a moment and review the board.\nBe sure it's correct.\nOkay, Mr. Clark, you can lock the machine on the passage of Senate Bill 431.\nThe eyes are 122.\nThe nasors zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nI'll read the caption to take my rides here.\nClerk will read the caption to Senate Bill 346.\nSenate Bill 346 by Senator Black on the 8th,\nBerk of the 11th, Anderson of the 24th,\nHarold of the 40th, and Payne of the 54th,\nbeing a talent act to amend Article 2,\nChapter 50 of Title 43,\nthe Fisherhood of Georgia,\nAntega relating the State Board of Veterinary Medicine.\nSo to increase the membership of the State Board\nof Veterinary Medicine and Authorizer,\nregistered veterinary technician member,\nthis bill ever referred to the Committee\non Agriculture and Consumer Affairs.\nThat committee recommends that this bill do pass.\nChair recognizes representative Perkall to present the bill.\nThank you, Mr. Speaker and colleagues.\nI bring before your consideration SB 346.\nIt is a veterinarian bill.\nSection one adds a member to the veterinary board,\nwhich is the vet tech.\nSection two allows for the creation\nof a professional health program\nto monitor and rehabilitate impaired veterinarians.\nIt's the same program that we established for human doctors\nin the 80s, this is for animal doctors.\nIf this bill looks familiar,\nit's because it is, we actually voted this bill out last year.\npast the Senate had a little misunderstanding with second floor that has been\nstraightened out but it's the same bill that we voted on the last time those of\nyou that are concerned about your voting consistency I don't know how\nexactly you voted but the vote was 165 to 1 I'll let you make your own\ndetermination on that but that is Senate bill 346 of was SB 75 I'll stand for\nquestions if there are any, Mr. Speaker?\nDo not see any questions. Thank you.\nIs there any objection to the previous question being ordered?\nThe chair here is none. The previous question is ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe chair here is none the report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of Senate Bill 346 will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nAlexander Anola Woods, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Burns, Carpenter, Carson,\nChocus, Clark H, Collins, Cooper,\nCorbett, Dempsey, Dickie, Dollar,\nDrenner, Dubnick,\nEfstration,\nEngland,\nIrwin,\nFleming,\nFrye,\nGaines,\nGardner,\nGlanton,\nGraveli,\nHerald,\nHatchet,\nHawkins,\nHitchens,\nHolcomb, Holmes, Houston, Hugley, Jackson M, Jasperice, Jones J, Kelly, Kendrick,\nNike, LaHood, Larickia, Lomston, Martin, Mathyak, McCall, Morris G, Newton, Nick's, Oliver,\nFarish, Parsons, Petri, Perkle, Powell, Reeves, Roads, Rich, Ridley, Rutledge, Skoggins,\nSchetzler, Silcox, Smith L, Smith R, Smith V, Smyrie, Stevens R, Tankersley, Tanner,\nHarvin, Taylor, Thomas E, Trammell, Washburn, Watson, Welch,\nWorkhizer, Weedower, Williams A, Williamson, Yerda, Alan,\nBaysmore, Bernal, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas, Dreyer, Dunhu,\nEarhart, Evans, Frazier, Gilligan, Gertler, Henson, Hill,\nHogan, Holland, Holly, Hobson, Howard, Hutchinson, Jackson D,\nJones S, Jones T, Jones V, Couch, Kennard, Lopez Romero,\nMarin, McLaren, McClain, McCloud, Meeks, Mitchell,\nmore B, more C, more M, Nelson, when, Paris, Prince, Pullen, Robucho, Saints,\nScofield, Scott, Shannon, Sharper, Smith M, Stevens M, Steven Sin, Thomas A.M., Turner,\nWalensky, Wilkerson, Williams, MF, Williams N, Wilson,\nBeasley Teague, Bonner, Yes, Buckner, Yes,\nPerchette, Calwell, Campbell, Contreum, Dickerson, Dukes, Dukes, Gamble,\nYes.\nYes.\nGillard.\nYes.\nGillard.\nGordon.\nGordon.\nGreen.\nGreen.\nYes.\nGullard.\nGullard.\nYes.\nJones J.B.\nJones J.B.\nYes.\nKirby.\nLot.\nLot.\nYes.\nMathis.\nYes.\nMaths.\nYes.\nMaths.\nMaths.\nYes.\nMopthahan.\nYes.\nMopthahan.\nYes.\nPark.\nYes.\nPark.\nYes.\nPruitt.\nYes.\nPruitt.\nRogers.\nRogers.\nSingleton.\nYes. Yes. Stovall. Yes. Stovall. Williams R. Williams R. Yes. Beasley Teague.\nCan't trail, can't trail.\nYes.\nCook.\nDempsey.\nDickerson.\nDollar.\nDryer.\nF-stration, Evans, Gilear, Gordon, Henson, Hopson, Jackson D, D, Jasper's,\nJazz, Jones, V, Jones, V.\nPowell, Prince, Ridley, Scott,\nOkay, members will take a moment and look at the board, make sure it's correct.\nClerk will lock the machines on the passage of Senate Bill 346.\nThe eyes are 133, the nays or zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nthe\nclerk will read the caption to\nsenate bill 303\nsenate bill 303 by senator Watson\nFirst Jones of the 25th, Butler of the 55th,\nHonourment of the 45th, Markner of the 9th, and others.\nWe titled an act to amend chapter 24,\nTitle 33, the fiscal to George Annotator,\nrelaying the insurance generally,\nso is to provide for greater transparency\nof prices for non-emergency health care services.\nMs. Bill Hammer, referred to the committee on\nspecial committee on quality health care.\nThat committee recommends that this bill do pass\nby committee substitute.\nChair recognizes Chairman Newton to present the bill.\nThank you, Mr. Speaker.\nColleagues, I think we've made some amazing progress along with our colleagues across\nthe hall on items that we think will make great protections for Georgia consumers in\nparticular when they have health care needs.\nThe work on surprise billing, while it's come far, is still being completed, but there's\nThere's another piece to that that consumers care about and that's the affordability of\ntheir health care.\nIf care that's not affordable is not really accessible and that's why we have a committee\nto look at that.\nI'm excited to work with a colleague across the Hall Center of Ben Watson on Senate Bill\n303.\nThis Senate bill will along with our approval will create a new code section that will\nrequire insurers, remember insurers are the ones you send your money to monthly for you\nand your family, to make the insurers will require to have a public accessible website\nwith information regarding the in-network costs for health care services and\nin addition to that quality metrics. If you look at the bill the first lines 15\nthrough 62 or largely definitions the real meat of the bill comes on line 83 and\nthat's where that's where the insurer that you use is required to have a\nnotification on their website of the actual amount that is being paid to a\nparticular service provider whether it's a hospital an ambulatory surgery center\nand imaging center, and even more important it will require to have a calculator that\nwill let you calculate how much out of pocket it's going to cost you, and since cost is\nnot valuable unless you already know or also know the quality of the service, these websites\nwill take data that's being collected other places will require the insurer to right\nnext to the place where you have the price for a particular service.\nYou'll also have that hospital or maybe multiple hospital or centers quality available\nto. What this would do if you needed an MRI, it might give you the possibility of looking\nat several in-network options through your insurance. You could look on their website.\nYou could see the different in-network places. You could have this done. You would have\ntheir quality to determine if there was any difference in quality, but you're also going\nto have the price that they're paid and also the amount that's going to be out of pocket\nfor you. That could be true of a new replacement. You could compare it being done in a hospital\nor an ambulatory surgery center, it could be done and you could have an imaging center\nor a hospital-based radiologic procedure or maybe multiple hospitals that you have in\nyour network would be available to show you how much it's going to cost at the different\nplaces and then it would let you as a consumer start to shop to actually look at quality\nand price together in an easily accessible transparent website.\nWe think this is going to start with the commissioner, the department will make decisions about\nwhat procedures are appropriate for this and we'll expand it as much as possible.\nThese are elective emergencies and complications obviously involve things that someone can't\nalways give you a price up front for but there's so many things in health care where you\ncan look and if you can find price and quality and it's right there with the insurance plan\nthat you have, you'll be able to make a more informed decision and I think we can move\nto a more affordable health care as well as this message and this information becomes\nmore capable and more accessible. So with that Mr. Speaker, I'd be glad to answer any\nquestions regarding Senate Bill 303.\nYou do not appear to have any questions.\nWith that, Mr. Speaker, I appreciate the consideration\nand hopefully favorable consideration,\nand I yield the well.\nIs, I'm sorry, there is a question.\nMy bad, I didn't see you trying to be recognized.\nChair recognizes representative Davis, that's you,\nand, okay.\nNow, Jack and Clark.\nHuh?\nRepresentative Jack and Clark.\ncertainly just curious you said that the insurance company is going to have to tell you the\nquality.\nI'm just and you said it was going to come from all these different places.\nWhat entity decides the quality of a different one facility versus another facility?\nWho's the deciding entity that gives each facility at a fair rating?\nThat's a great question, and I thank the lady for that.\nThe quality, a lot of these metrics are admission rates\nalong with re-admission rates or complication rates.\nThose are already being gathered by the facilities,\nso we're not trying to add new regulations\nor new burdens to some of our overburdened hospitals,\nbut a lot of these are being reported already\neither to CMS or healthgrades or healthcare.gov.\nWhat this will do is will allow the insurer\nto get that information from the hospital\nthat's already been an in-network hospital\nthat they have an agreement with.\nThat's how they're in-network.\nAnd then it will allow them to pull that information\nthat's already being gathered.\nAnd as we gather more quality information,\nI'm sure it will expand.\nBut this is publicly available already.\nThis will just put it in a way where the consumer\ncan get to it without having to know\nhow to navigate multiple different government\nand non-governmental agency websites.\nIt'll put it on the website for your particular insurance\nplan for the network that you're in, so it'll give you the real cost for you, and it'll\nalso have next to that the quality for the different facilities that you might be able\nto choose from.\nAnd does it only for the yield?\nCertainly.\nWill that quality be in the form of stars, check marks, or is there going to be a number\nsystem?\nI got a 10.\nHow is it expected for this information to be delivered to the public as they're shopping?\nThere is a current federal, if you look on line 65, in particular there's a hierarchical\ncondition, category methodology, all capitalized.\nIt's something that CMS is gathering now.\nIt's well vetted to make sure it allows for fairness between a facility that say has a\nhigh number of hypertensive or diabetic patients versus another one that has very few.\nSo it risks, risk adjusts that data so that you really compare in apples to apples.\nThey're not unfavorably comparing one that takes higher risk individuals comparing with\nsomeone who takes really low risk individuals.\nSo by using that hierarchical condition, category methodology through CMS right now, it will\nallow that you get really true risk adjusted, not just patient selection bias, but you'll\nget risk adjusted quality data.\nThat's a great question.\nAll right.\nThank you very much.\nThank you.\nIf there are no other questions, Mr. Speaker, I'll yield the will.\nI don't see any further questions.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee\nwhich was favorable to the passage of the bill?\nThe chair here is none.\nthe report of the committee is agreed to, shall this bill now pass all those in favor\nof the passage of the bill will vote aye. Those opposed will vote no and the clerk will\nunlock the machines and call the roll.\nAlexander Anelowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nBruce, Burns, Carpenter, Carson, Chokus, Clark H. Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming,\nFrye, Gaines, Gardner, Glanton,\nGravley, Harold, Hatchett, Hawkins, Hitchens, Hulkam, Holmes,\nHausten, Hugley, Jackson M. Jasperce, Jones J. Kelly, Kendrick, Knight, LaHood,\nLaRickia, Lomston, Martin, Mathiac, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons,\nPeatery, Perkle, Powell, Reeves, Roads, Rich, Ridley, Rutledge, Skoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V, Smirey, Stevens R,\nTankersley, Tanner, Tarvin, Taylor, Thomas E,\nTramble, Washburn, Watson, Welch, Workhizer, Weedower, Williams A,\nWilliamson, Yerda, Allen, Baysmore, Bernal, Cannon, Carter, Clark D,\nClark J., Cook, Davis, Douglas, Dreyer, Dunahoo, Earhart, Evans, Frazier, Gilligan, Gertler,\nHanson, Hill, Hogan, Holland, Holly,\nHobson, Howard, Hutchinson, Jackson D,\nJones S, Jones T, Jones V, Couch, Kennerd,\nLopez Romero, Marin, McClain, McClaren, McCloud,\nMeeks, Mitchell, Moore B, Morris C, Morris M. Nelson,\nGwen, Paris, Prince, Pullen, Robucho, Saints, Scofield, Scott, Shannon, Sharper, Smith M,\nSteven's M, Steven Sin, Thomas A.M., Turner,\nWalensky, Wilkerson, Williams M.F.,\nWilliams N. Wilson, Beasley Teague,\nBonner.\nBonner.\nYes.\nBuckner.\nYes.\nBonner.\nYes.\nVerchette.\nVerchette.\nYes.\nCall well.\nYes.\nCall well.\nYes.\nCampbell.\nYes.\nCan.\nYes.\nCantrell.\nYes.\nYes.\nDickerson.\nYes.\nDukes.\nYes.\nDukes.\nYes.\nDukes.\nGamble, G-Yes. Gordon, Gordon, Green. Green. Yes. Goat. Yes. Jones, JB.\nJones TV.\nYes.\nKirby.\nYes.\nKirby.\nYes.\nLot.\nYes.\nLot.\nYes.\nMathis.\nMath.\nMath.\nYes.\nMaths.\nMath.\nYes.\nMom-to-hon.\nYes.\nMom-to-hon.\nYes.\nPark.\nYes.\nPower.\nYes.\nTrude.\nTrude.\nTrude.\nRogers\nSingleton\nSingleton\nNo\nStovalls\nStovalls\nWilliams R\nWilliams R\nYes\nBeasley Teague\nBeasley Teague\nVody\nCooper\nDouglas\nDouglass, Dryer, Gileared, Gordon, Powell, Prince,\nRidley, Taylor, Thomas AM, Williams A.\nYou\nYou\nMembers should take a moment and look at the board and be sure that it is accurate.\nMr. Clerk, you may lock the machine on the passage of Senate Bill 303.\nThe eyes are 128, the nays are 7.\nThis bill having received their requisite constitutional majority is therefore passed.\nClerk will read the caption to Senate Bill 462.\nbill 462 by center, Ken of the 18th,\ngo to the 51st, Duke in the 30th, Jones in the 25th,\nMulles in the 53rd.\nTo be titled an act to amend,\ntitle seven of the official go to Georgia,\nannotated relating to banks and finance.\nSo it's to transfer duties, powers, responsibilities,\nand other authority relative to industrial loans\nfrom the industrial loan commissioner\nto the Department of Banking and Finance.\nThis bill I refer to the committee on banks\nand banking that committee recommends\nthis bill do pass by committee substitute.\nChair recognizes representative Williamson to present the bill.\nThank you, Mr. Speaker.\nMembers of the House, I'm here today to present Senate Bill 462, the House Committee substitute LC500109S.\nQuite simply, this Senate bill passes Senate 54 to nothing.\nThe only reason it's a committee substitute is the effective date.\nFor budgetary reasons, we're sitting July 1, 2020.\nIt transfers the Georgia Industrial Loan Act from the Department of Insurance to where\nit should have been more appropriately administered on the Georgia Department of Banking and Finance.\nIt was vetted twice through the insurance committee and came out without objection unanimously.\nQuite simply, it's going to offer operational efficiencies to the regulated companies in a very professional manner by the George Department of Banking and Finance and at the same time as some saved Georgia taxpayers according to the Department of Audits about $190,000 a year.\nAnd seriously, quite simply, that's all it does.\nmoves, done change in terms of conditions of the products,\nmoves it from one regulating entity to another,\ninvest in my knowledge,\ndorge's the only state where the department of insurance\nregulates financial services industry such as this one.\nBe happy to answer any questions, otherwise I ask\nfor your favorable consideration and yield the well.\nI do not see any questions.\nI yield the well.\nThank you.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of Senate Bill 462 will vote aye.\nThose opposed to vote no in the clerk will unlock the machines.\nAllixander, Anolowitz, Bar, Barton, Belton, Bennet, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Carpenter, Carson's, Burns, Chokus, Clark H, Collins, Cooper, Corbett,\nDempsey, Dickie, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming, Fry, Gaines,\nGardner, Glanton, Graveli, Herald, Hatchett, Hawkins,\nHitchens, Holcomb, Holmes,\nHouston, Hugley, Jackson M, Jasper's,\nJones J, Kelly, Kendrick,\nKnight, LaHood, LaRickia, Lomston, Martin,\nMathiac, McCall, Morris G, Newton, Nicks, Oliver, Parrish, Parsons, Petrie, Perkel, Powell,\nReeves, Rhodes, Rich, Ridley, Rutledge, Skoggins, Setsler,\nSilcox, Smith L, Smith R, Smith V, Smirey, Stevens R, Tankersley, Tanner, Tarvan, Taylor, Thomas\nE. Trammell, Washburn, Watson, Welch, Workhizer, Weedower, Williams A, Williamson, Yerda,\nAllen, Bayes Moore, Bernal, Cannon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\ndryer,\ndonahue,\nairheart,\nEvans,\nFrazier,\nGilligan,\nGertler,\nHenson,\nHill,\nHogan,\nHolland,\nHolly,\nHobson,\nHoward,\nHutchinson,\nJones D. Jones S. Jones T. Jones V. Couch. Kennerd. Lopez Romero. Marin McClain.\nMcLaren, McLeod, Meeks, Mitchell, Moore B, Morris C, Morris M, Nelson,\nWhen, Paris, Prince, Pullen, Robyshow, Saints, Scofield, Scott, Shannon, Sharper, Smith M,\nSteven's M, Steven Sin, Thomas A.M., Turner,\nWalensky, Wilkerson, Williams M.F., Williams N. Wilson,\nBeasley Teague.\nBonner.\nYes.\nBuckner.\nYes.\nBonner.\nYes.\nPerchette.\nYes.\nPerchette.\nYes.\nCaldwell.\nYes.\nCaldwell.\nYes.\nCampbell.\nYes.\nCampbell.\nYes.\nCantrell.\nYes.\nCantrell.\nYes.\nDickerson.\nYes.\nDukes, Dukes, Gamble, Gillier, Gordon, Green, Gullet, John J.B., Kirby,\nCurry, Lot, Loth, Mathis, Mets, Mets, Mom to Han, Park, Pruitt, Roger's,\nSingleton, Stovall, Williams R, Annullowitz, Beasley Teague, Drenner.\nMembers who will, oh I'm sorry, dryer, guillard, Gordon, Paris, France, Ridley,\nWilcox, Tarvan, Taylor, Thomas E, Turner.\nOkay, members will now take a moment and reflect on the board and make sure that it is accurate.\nAnd Mr. Clerk, you may lock the machines on the passage of Senate Bill 462.\nThe eyes are 136.\nThe nasors zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nWe'll read the caption to Senate Bill 358.\nSenate Bill 358 by Senator Harper, the seventh,\nIt assumes the 12th Burke of the 11th Walker of the 20th\nBlack of the 8th and others to be a total of an act to amend\nArticle 3, Chapter 3, and Title 50, the official go to\nGeorgia annotated relating to state symbols.\nSo as to designate the Muscatine grape as the official state\ngrape, this bill ever referred to the committee on agriculture\nand consumer affairs, that committee recommends that this bill\ndo pass.\nYou\nChair recognizes representative Perkel to present Senate Bill 358.\nThank you, Mr. Speaker of Senate Bill 358. In six weeks, we will begin the harvest of the muskidines, the state of Georgia produces\nmore muskidines than anyone in the world. We are the leading producer. We have the largest muskidine orchard in the world in\nIrwin County\nnear\nbetween Lacks and Ray\nin\nIrwin County is\nbetween\n7 and 850 acres in an orchard down there and I was asked earlier if I can\nknew the difference between a muskidine and a scuppinine. It turns out the\nscuppinine is a variety of muskidine. This will be interesting to one of our\nmembers Chairman Hogan in the top who likes great trivia. It was first found\nalong the Scuppernon River in Northeastern North Carolina.\nIt's a variety.\nWe produce more.\nWe have the largest and oldest\nmuskidine breeding program in the world\nat the University of Georgia.\nAnd it's only proper\nthat this be the muskidine designated\nas the official Georgia grade.\nThat's what I have, Mr. Speaker.\nIn October.\nDo you have, does he have, is there any questions?\nThank you.\nIf you have a question, you need to jump up and down\nand do a summer solve so I can see you.\nNo questions.\nIs there any objection to the previous question being ordered?\nThe chair here is none the previous question is ordered.\nIs there any objection to agreeing to the report of the committee,\nwhich was favorable to the passage of the bill?\nThe chair here is none the report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill?\nWe'll vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nAlexander Honolowitz, Bar, Barton, Belton, Bennett, Bentley, Benton, Beverly, Blackman,\nCody, Bruce, Burns, Carpenter, Carson, Chokus, Clark H, Collins, Cooper, Corbett, Dempsey,\nDickey, Dollar, Drenner, Dubnick,\nAbstration, England, Irwin, Fleming, Frye, Gaines, Gardener,\nGlanton, Gravley, Harold, Hatchett, Hawkins, Hitchens, Holcomb, Holmes,\nHouston, Hugley, Jackson M, Jasperus, Jones J, Kelly, Kendrick, Knight, LaHood,\nLaRickia, Lomston, Martin, Mathyak, McCall, Morris G. Newton, Nix, Oliver,\nParrish, Parsons, Petrie, Perkle, Powell, Reeves, Roads, Rich, Ridley, Rutledge, Skoggins,\nSetsler, Silcox, Smith L, Smith R, Smith V, Smyrie,\nStevens R, Tankersley, Tanner,\nTarvan, Taylor, Thomas E, Trammell, Washburn, Watson, Welch,\nWorkhizer, Weedower, Williams A, Williamson, Yerda, Allen,\nBayesmore, Bernal, Canon, Carter, Clark D, Clark J, Cook, Davis, Douglas,\nDreyer, Donahue, Earhart, Evans, Frazier, Gilligan,\nGertler, Henson, Hill, Hogan, Holland, Holly,\nHobson, Howard, Hutchinson, Jackson D, Jones S, Jones T, Jones V, Couch, Kennerd, Lopez\nMermero, Marin, McClain, McClaren, McCloud, Meeks, Mitchell, More B, More C, Morris M, Nelson,\nGwen, Paris, Prince, Poland, RoboShow, Saints, Scofield,\nScott, Shannon, Sharper, Smith M, Stevens M,\nSteven Sin, Thomas A.M., Turner,\nWilinski, Wilkerson, Williams, M.F.,\nWilliams, N. Wilson, Beasley Teague,\nBonner, Buckner,\nYes.\nVerchette.\nVerchette.\nYes.\nCall well.\nCall well.\nYes.\nCampbell.\nNo, can't.\nYes.\nCan't trail.\nYes.\nCan't trail.\nYes.\nDickerson.\nYes.\nDickerson.\nYes.\nDukes.\nYes.\nDukes.\nGamble.\nGang.\nYes.\nGillard, Gillard, Gordon, Gour, Green, Green, Goat, Goat, Yes, Jones J.B.\nYes.\nKirby.\nYes.\nKirby.\nYes.\nBlot.\nYes.\nBlot.\nYes.\nMathis.\nMaths.\nYes.\nMetz.\nMetz.\nYes.\nMopthahan.\nMopthahan.\nYes.\nPark.\nPark.\nPruid.\nPruid.\nRodgers.\nRaj Singleton\nSingleton\nStovall\nStovall\nWilliams R\nWilliams R\nYes\nAlexander\nAnolowitz\nAnolowitz\nBeasley T\nBeas\nBlackman\ndryer, Fleming, Gilear, Gordon, Green, Jackson M, Jasper's, Kelly,\nAtheac, Paris, Powell, Prince, Pullen, Jasper's, Ridley, Setsler, Stovall, Taylor, Thomas\nE. Turner, Wilkerson, Williams A.\nYou\nmembers will look at the board and make sure it's correct and the clerk will lock the\nmachine on the passage of Senate Bill 358.\nThe eyes are 135.\nThe nasors zero.\nThis bill having received the requisite constitutional majority is therefore passed.\nYou\nYou\nThank you very much.\nYou\nI'm not sure if she's in the\nHouse now, but I hope you'll help me wish a happy birthday today to Representative\nHobson. Representative Hobson. Okay House Bill 1148 will be postponed to the\nnext legislative day. House Bill 1195 will be postponed to the next legislative day.\nSennebille 3-94 will be post-poned to the next legislative days.\nSenate Bill 249 will be post-poned to the next legislative day.\nSennebille 2-94 will be post-poned to the next legislative day.\nSennebille 306 is post-poned to the next legislative day.\nSennebille 3-10 will be post-poned to the next legislative day.\nSennebille 3-18 will be post-poned to the next legislative day.\nSenate bill 337 will be postponed until the next legislative day.\nSenate bill 340 will be postponed to the next legislative day.\nSenate bill 395 will be postponed to the next legislative day.\nSenate bill 408 will be postponed to the next legislative day.\nSenate bill 450 will be postponed until the next legislative day.\nbill 442 will be postponed to the next legislative day.\nSenate bill 443 will be postponed until the next legislative day.\nSenate bill 482 will be postponed until the next legislative day.\nand it bill 489 will be postponed until the next legislative day.\nWe have no announcements.\nThe chair recognizes the majority leader of the House for a motion.\nAs a speaker, I move to this House stand adjourned until 10 a.m. Saturday, June 20, 2020.\nThe majority leader has moved that this House be adjourned until 10 o'clock a.m. on Saturday,\nJune 20, 2020.\nIt is tomorrow, tomorrow is Saturday, 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it and this house will be adjourned until 10 o'clock a.m. Saturday morning.\nYou\n",
  "updated_at": "2026-02-12T13:04:30.70143+00:00"
}