{
  "video_id": "EMs9SHUc-Tg",
  "url": "https://www.youtube.com/watch?v=EMs9SHUc-Tg",
  "title": "Senate Day 32 of the 2025 Session",
  "chamber": "senate",
  "session_type": "regular",
  "session_year": 2025,
  "day_number": 32,
  "video_date": null,
  "duration_minutes": 268,
  "summary": "Overview:\nThe Georgia Senate session covered several bills and resolutions, including legislation related to retirement systems, study committees, midwife recognition, and various other policy areas. There were no major controversial votes or heated debates noted in the transcript.\n\nKey Actions:\n**HB 223**: Amends Chapter 2 of Title 47 related to the Employees' Retirement System of Georgia\n**HB 90**: Creates the Senate Study Committee on Artificial Intelligence, Digital Currency, and Other Purposes\n**HR 32**: Resolution recognizing March 14, 2025 as Black Midwives Health and Human Service Day\n**SR 148**: Resolution creating the Senate Study Committee on Improving Family Caregiver Services\n**SR 246**: Resolution creating the Senate Study Committee on Making Georgia the Number One State for Tourism\n\nBills Introduced (First Reading):\n- SB 339: Relates to the Employees' Retirement System of Georgia\n- SR 391: Creates the Senate Study Committee on Artificial Intelligence, Digital Currency\n- SR 393: Creates the Senate Study Committee on Improving Family Caregiver Services \n- SR 398: Recognizes March 14, 2025 as Black Midwives Health and Human Service Day\n\nNotable Moments:\n- Recognition of a group of pages from across the state, introduced by the Senator from the 8th district\n- Routine procedures such as dispensing with the journal reading and confirming the journal\n\nVotes: \nNo recorded votes noted in the transcript.\n\nAttendance:\nNo quorum issues or attendance notes mentioned.\n\nAdjournment:\nThe transcript does not provide an adjournment time or date for the next session.",
  "transcript": "you you you you you you good morning everyone.good morning the time for convening having arrived the Senate will come to order please at this time I'll ask all unauthorized persons to exit the chamber. It's my pleasure to recognize the distinguished senator from the sixth district. Good morning, Mr. President. How are you today? Doing great. So I missed you. It's been a long time since I've seen you. Long time. I'm a best good friend. Mr. President, we got a great group of pages here today. Normally from all over the state, but today I think they're all from the senator from the eighth district or at least a bulk of them. Out of Marrow, Georgia, we have Caitlin tune. From Homerville, we have a million cocks. And the senator from the eighth son, Alexander Goodman from cocktail. From Maynard, Georgia, we got Lilliana Henderson from Homerville, Jasmine Donnes from Grayson, Michael Kindle. From Homerville, Eliza Nipper and Jay Lee Pearson from Buford, Dana Reeves from Maysville, Dustin Shipley. From Homerville, Alia Smith, Callie Smith and JD Smith from Duke, Duke, Kent, Jocelyn Thomas, sorry, the center from the eighth helped me with my pronunciation. From Rins, we have Nathan Thomas and from Marrow, we have Savannah Tran. Y'all give these pages a big round of applause. We appreciate y'all being here to help us do the people's business in the Georgia states. Mr. President, the journal has been read and found to be correct. Thank you, senator from the sixth. Thanks for that distinguished reading and letting us know that all is well with the journal. And nice to have the pages with us this morning. Is there objection to dispensing with the reading of the journal? The chair here's none and the reading of the journal is dispensed with. Is there objection to the confirmation of the journal? The chair here's none and the journal is confirmed. Let's move on all senators, senators who have bills or resolutions to introduce. Please bring them to the secretary's desk at this time. Let's have the first reading and reference of Senate bills and resolutions. Mr. Secretary, read to us this morning. Senate Bill 339 by Senator Ork, the 36 and others built between 10 and 9 to men. Chapter 2 title 47, the official got a Georgia annotated. Will the two employees retirement system in Georgia? Retirement. Senate resolution 391 by Senator Albers and 56 and others. Resolution creating the Senate study committee on artificial intelligence, digital currency and for other purposes. Thank you, your financial institutions. Senate resolution 393 by Senator Jones and the 22nd and others. Resolution creating the Senate study committee on improving family caregiver services and for other purposes. Show them in families. Senate resolution 398 by Senator James and the 28th and others. Resolution recognizing March 14th, 2025 is black, midwives health and human service. Mr. President, that completes the order. Very good. Let's now have a reading and reference of House bills and resolutions, please. House Bill 699 by Senator Vuey to the 9th and others, built between 10 and 9 to amend. An act creating board of elections, right? So no. House Bill 701 by Senator Chokis of 151. Others built between 10 and 9 to authorize the assessment. House Bill 714 by Senator Hitchens of the 161st, the built between 10 and 9 to provide an act to write for the creation of one. House Bill 719 by Senator Yeartow of the 1 and 52nd, a built between 10 and 9 to amend an act to write for the creation of one. The compensation of the chairperson and members of the logo. House Bill 720 by Senator Yeartow of the 1 and 52nd, a built between 10 and 9 to amend an act to. Slogo. House Bill 722 by Senator Stevens of 164th and others, built between 10 and 9 to amend. Slogo. House Bill 724 by Senator Franklin of the 160th, a built between 10 and 9 to amend. And Slogo. Mr. President, that completes the order. Thank you, Mr. Secretary. The Secretary will read reports of standing committees. Mr. President, the Senate can be on an entrance and labor, has added under consideration the following legislation. I've instructed me towards the same exit with the following recommendation. House Bill 197, do pass. House Bill 348, do pass. House Bill 422, do pass by, so we respectfully submit it to the walker of the 20th district chairman. Mr. President, the Senate can be on a state and local governmental operation. It's the local. I've instructed under consideration the following legislation. I've instructed me to forward the same exit with the following recommendation. House Bill 381, do pass. House Bill 608, do pass. House Bill 619, do pass. House Bill 622, do pass. House Bill 640, do pass. So, strictly submitted. Senator Dixon of the 45th district, chairman. Mr. President, the Senate can be on a transportation, has had under consideration the following legislation. I've instructed me to forward the same exit with the following recommendation. Senate Resolution 283, do pass by, so we have bill 58, do pass by, so we have bill 156, do pass. House Bill 164, do pass. Yes, sir. So, please submit it to the Senate. And our dollars, all the 27th district chairman, that completes the order, Mr. President. Yes, sir. Thank you, Mr. Secretary. If you would please read bills and resolutions for a second time. Senate Resolution 323, boroughs. Senator Eccles of the 49th and others, Senate study committee. I'm making Georgia the number one state for tourism, create House Bill 34, boroughs and watch for a 1-44th professional licensing board, continuing education tracking solution, to monitor compliance of licenses with applicable, continued education requirements, establish. House Bill 38, boroughs and a martin of the 49th and others, education needs, based financial aid program, where rise definition of eligible student, House Bill 51, boroughs and a perchette of 176 and others. Georgia Environmental Finance Authority, finance and performance certain duties for projects relating to natural gas facilities, House Bill 74, revison a powell of the 33rd and others. Georgia lottery for education act, correct the reference, House Bill 78, boroughs and Franklin 168 and others. Employees, department sets, and the majority total percentage of funds invested in alternative investments raised in the limit. House Bill 86, boroughs and a lot of the 123 others, public officials and employees calculating and sending the salaries of certain state officials for rise provisions. House Bill 105, boroughs and a weight of the ninth and others, public officers and employees, increasing the demarcation award of certain state public school personnel, given of death, House Bill 101, boroughs and a convulnerant, one of the third and others, income tax reduced rate of tax. House Bill 112, boroughs and a McDonald, the third and the 26th and others income tax, one time tax credit for taxpayers who filed returns for both 2023 and 24, 24 taxable years provide. House Bill 137, boroughs and anterson, and the tenth and other contracts increased. The other value of certain public works, conscience exempt from revisions, really do retention of contractual payments. House Bill 155, boroughs and anterson of the tenth and others, the government selection and objection to arbitrator, survives for procedures. House Bill 159, boroughs and a crow, the one 18th and others. Georgia Housing and Finance Authority increased outstanding bond, the House Bill 161, boroughs and a crow, the one 18th and others. Georgia Bureau of Investigation Authority to Issues of Penance, the Walletra Communication Record for purposes of investigating certain cyber enabled threats to life and property provide. House Bill 165, boroughs and Franklin, the one 16th and others, income tax credit, business enterprises for released motor vehicles were preserved. House Bill 192, boroughs and a huddle son of the 72nd and others, veterinary education limits on student loan forgiveness program provide. House Bill 195, boroughs and a joan, the 25th and others, education employee, company and tax tax contracts for early care and education programs and head start programs for revisions. House Bill 181, boroughs and anter heart of the 36th and others, vital records, issuance of certificate of a foreign borne by the state registrar without a judicial order, the secretary of service provide. House Bill 192, boroughs of Lumson, the 12th and others, life insurance, excluding or restricting the ability for certain deaths occurring on individuals and equity service. Remember, prohibit. House Bill 19, boroughs and a Stevens, the one 164th and others, professions and businesses establish a professional health program to provide for monitoring and rehabilitation of impaired healthcare professionals, authorized House Bill 2, 35 boroughs in Townsend, the 179th and others, Georgia's supporting living donor educators, Act and Act, House Bill 240, boroughs and Williams, the one 48th and others, mortgage loaners and brokerage prohibit unfair or disapproval practices and consumer transactions, which will lead to more trigger lands. House Bill 241, boroughs and roads, the one 24th and others, contracts convened, fees for payment by the Chinese revised provisions, House Bill 266, boroughs and a stains of 180th and others, income tax exempt income received as personal compensation for full-time duty in the active military service in the United States. House Bill 2, senate boroughs and the reason that I and 9th and others, education service and airplane eviction act and act. House Bill 233, boroughs and a needle in the setting of the 9th and others, motor vehicles issuance over refusal to sign citation, provide House Bill 329, boroughs and hilt in the 48th and others, professional and businesses, authorized certified nurse practitioners and physician assistants, warm artificial insemination, House Bill 331, boroughs and a camp of the one 35th and others, animals prohibit transprosy domestic animals and certain locations, House Bill 366, boroughs and an illustration of one of four of the others, and taxation rehabilitation of historic structures, revised tax credit, House Bill 333, boroughs and a lover of the one 23rd and others, building and housing manufactured home provision, House Bill 392, boroughs and a martin of 49th and others, Georgia tax court, certain events, revised dates, House Bill 398, boroughs and a haggen of 156 and others, food, drugs and cosmetics, authorized production of the sale of cottage food, items with certain exemptions, requirements and disclosure, House Bill 410, boroughs and a deloge of the 167th and others, insurance department of efficiency, and the practices provide House Bill 414, boroughs and a zone to the 25th and others, elections, persons who include certain non-residents, revised definition, House Bill 416, boroughs, I represent a demonstration of one of four of the others, local government enterprise zones, revised class of retail, from which fees may be collected, House Bill 426, boroughs and a new 40th and others, courts, non-parts and election of magistrates, provide House Bill 475, boroughs and a gamble of 15th and others, income tax credit, film, gambling and digital production, revised definition, House Bill 483, or is it a principle of 130 second and others, crimes and offenses, protections for inspectors of code enforcement, provide House Bill 494, is a mid-claim of one on ninth and others, lower vehicles require mobs to be covered by the form of minimum financial responsibility for accident damages, House Bill 495, boroughs and a deliq, 134th and others, education center for rural prosperity and innovation, repeal House Bill 506, boroughs, delta, and the 48th and others, social services, Medicaid, coverage for tobacco, assessment, treatments, provide House Bill 511, boroughs and a lump sum of 12th and others, insurance deductions from taxable income for contributions by taxpayers, but to catastrophic tax-strophy savings accounts and interest earned, such accounts provide House Bill 547, boroughs and a CBO of the 34th and others, peace out of the earth's extended timeframe for which reimbursement of total training expenses by subsequent employer may be sought. House Bill 584, boroughs and a feature of the 166th and others, health reassign licensing and oversight of certain treatments and programs for departments of community health, behavioral health, and developmental disabilities, House Bill 586, boroughs and Williamsson, 1112th and others, revenue taxation, intangible recording tax, provides those House Bill 614, boroughs and Jonesville 47th and others, little government prohibit use or ignition of consumer fireworks and proximity to certain facilities, housing, equines, authorized House Bill 645, boroughs and the hood of 125th and others, health code 19 testing and staff members along the term care facilities, repeal certain provisions, Mr. President, I can place the order. It is now time for the morning roll call. Are there any motion to excuse or recognize Senator from the 33rd? Thank you, Mr. President. And good morning y'all. I ask the unanimous consent to excuse the senators from the 7th and the 32nd. The 7th and the 32nd. Yes, sir. With the objects and objects that they are excused, recognize Senator from 23rd. Yes, your name is consent to excuse the center from the 20th. That objects the center from the 20th is excused, recognize Senator from the 6th. Thank you, Mr. President. I ask for unanimous consent to excuse the senators from the 27th and 49th for business inside the Capitol. The objects and those centers are excused, recognize Senator from the 19th. Thank you, Mr. President. I move. We excuse the center from the 42nd for business inside the Capitol. Objection center from the 42nd is excused, recognize Senator from the 43rd. Thank you, Mr. President. Good morning. I ask for unanimous consent to excuse the senator from the 26th. The objection, the senator from the 26th is excused. Any more motion to excuse? Hearing none. Oh, sorry, Senator from the 41st. Thank you. As for unanimous consent to excuse the senator from the 40th. From the 40th without objection center from the 40th is excused. It is now time for one of the roll calls, sanctify your presence by voting the A's so it's secretary and line machine. It is now time for our morning devotion. All senators, please take your seats and seats all out of a conversation. I would ask that the doorkeeper secure the chamber at this time. I now recognize the center from the 45th is introduced our pastor today and lead us in our play. Senator? Thank you, Mr. President. Members, if you would, join me in saying pledge allegiance to the American flag. I pledge allegiance. Now the Georgia flag. Good morning, everyone. Excited to have my pastor from first Baptist church in Buford, Jared Thompson. Jared was here with us last year. I've been a member for about a year and a half now. And as I told you all last year, this time was in February. My middle daughter and I got baptized in her church, which was an amazing thing to do in adventure and experience with my daughter and seeing what the Lord's doing in her life is simply amazing. Pastor Jared has been with her since 2015 so coming up on 10 years, he studied at the New Orleans Baptist theology and seminary. He also got his PhD at Anderson University. I can't tell you that the impact that Jared and wife of our family over the past year and a half and grateful and honor to have him here with us today without further ado. My pastor, Jared Thompson, thank you. Well, thank you so much for having me. Thank you to Senator Dixon for having me down here today. We love their family. I'm grateful to have my wife here with us today. And so I just want to speak to you for a couple of minutes this morning on young David being anointed as King. And what we learned from that story in terms of our identity, where it comes from, and as well as what God truly values about us. In 1 Samuel chapter 16 and verse 6, the Bible says that as Samuel, the prophet Samuel went to anoint David as King, it says that when they arrived, Samuel saw a lie and thought surely the Lord's anointed stand here before the Lord. But the Lord said to Samuel, do not consider his appearance or his height for I have rejected him. The Lord does not look at the things people look at. People look at the outward appearance, but the Lord looks at the heart. So Samuel saw a lie of and he immediately thought that this money got chosen king for one reason and one reason only. It's because a lie of looked the part. As Samuel looks around the family to whom God has sent him, he for a brief moment relies on his own understanding of what a king should look like. Because in his experience, the king only had one particular appearance. And first Samuel chapter 9, we learned that the king before David, who ended up being very disobedient, it says about him that Kish had a son named Saul as handsome a young man as could be found anywhere in Israel. And he was a head taller than anyone else. Now I don't know how many of you have seen Braveheart, but William Wallace was, it said he was about six and a half feet tall. So leaders in those days, if you were a tall person, some would say it's still true today. I don't know if it's true today or not, but especially in ancient times, if you were a head taller than everybody else, you had a great opportunity to be a leader. And he assumed that a lie would be king because the only thing he knew was tall kings. And many times in life, we think that things are the way they are and will always be the way they are because it's all we've ever known. We feel like we can't break free of generational curses, we can't break free of the way things are because that's just the way that they've always been. But I wonder this morning if what's holding us back sometimes is not our circumstances, but it's simply a lack of faith and seeking the face of God through prayer. Now there's a danger in making decisions in life based on appearances. Remember the oldest sin in the book in Genesis chapter 3 and verse 6 where it says, when the woman saw that the fruit of the tree was good for food and pleasing to the eye and also desirable for gaining wisdom, she took some and she ate it. She also gave some to her husband who was with her and he ate it. And so Adam and Eve saw the forbidden fruit and said to themselves, how can this be wrong? It looks so good. We often do that in our own lives, but Proverbs 14 and verse 12 says that there's a way that appears to be right, but in the end it leads to death. And the converse of that is found in Proverbs 3 and verse 5 where it says, trust in the Lord with all your heart. Sometimes it's hard to trust with our eyes, isn't it? Sometimes we see our circumstances in front of us and it doesn't seem that we can trust those, but it says that we can trust in the Lord with all of our heart and lean not on our own understanding. In all your ways submit to him and he will make your path straight, do not be wise in your own eyes. Have you ever known someone who was wise in their own eyes? They thought they were smart and it was pretty obvious to everyone else that they weren't all that smart, but to them they really felt that strongly that they were. Well really being wise in our own eyes is simply another way of saying that I'm blind to myself. And so he says, don't be wise in your own eyes. Fear the Lord and shun evil. This will bring health to your body and nourishment to your bones. And so God says don't look at his appearance or his height because God doesn't value what's on the outside nearly as much as what's on the inside. Now why is that? Well because what we do flows from who we are. This is why the scripture says in Ephesians chapter 2 and verse 8, for it is by grace you've been saved through faith and this is not from yourselves. It is the gift of God not by works so that no one can boast. So first of all he urges us to be saved not by our works but by faith in Jesus Christ. And then in verse 10 it says, for we are God's handy work created in Christ Jesus to do good works which God prepared in advance for us to do. So he's not against good works. We just need to view them correctly. In other words you will not do and if you take anything away from this, I hope you'll take this, you will not do what God has created you to do until you become who God has created you to become. Because doing flows from being, action flows from identity. And Samuel saw Eliab and thought he was the one but God says he doesn't value the outside nearly as much as the inside. And I guess if I could speak to myself this morning, I would caution myself with this. Too many of us are working hard to have the appearance of Eliab when what God really values is the heart of David. And so I'd encourage us this morning to start with the heart, start with the heart and the appearance will take care of itself. If we get the heart right, then everything else falls into place. Let me pray for us this morning. Thank you God for your word. We thank you this morning that you don't value our appearance as much as you value what's inside. And we thank you for the gift that Christ has given us through his death, burial and resurrection so that if we will put our faith in our trust in him and confess him as the Lord and Savior of our lives, God, you will transform our hearts. You will make us a new creation. It's no longer I who live, but Christ who lives in me. And if I can say that about myself in sincerity, then God, the things that I do will flow out of that. They will flow out of him. And may we be people, especially those of us who claim the name of Jesus Christ, may we be people whose actions flow straight from our faith in Christ Jesus. We love you. I pray for this session today. I pray for all of those who represent us in our government. I'm so thankful for the sacrifices that they make. I pray that you would guide them, lead them, direct them and protect them. And it's in Jesus' name that we pray. Amen.\n\nyou you if i could have everyone's attention real quick please i can have everyone's attention we uh, we always like to welcome uh special guests especially from our congressional delegation And today we have a congressman. I like to say Dr. Rich McCormick who is a congressman and He is a congressman from the seventh congressional district and he's doing a wonderful job for us in Washington DC And there's very very sometimes a lot of there's not a lot of good news that comes out of Washington I can actually say that the work that Dr. Rich McCormick is doing is is wonderful work. He's representing his people and in district seven very well He's got a very decorated pass. He's from a military from his educational to his military service to his His public service it now is an elected official. It's really a great pleasure to have him down here today And if y'all can give him your attention and let's give him a warm welcome here Dr. Rich McCormick It's great to be here with my fellow Georgians. Thank you. Thank you for having me today Last time I had a public speech it made a lot of news I think there are four neat news cameras and about a thousand people So this is kind of actually a smaller group that I'm used to I Want to recognize doc over here and Sean two of great friends from the franchise franchise developers and just fantastic people in general I want to say especially thank you to my state legislators who do the heavy lifting You know used to be at one time in life that two thirds of all the government spending was at the state level The way it was supposed to be where states were empowered over the federal government now that's all flipped We have a bipartisan problem right now By frankly, I remember when I was a popular guy For those of you guys don't know I was a marine pilot. Don't mean to brag. I could fly helicopters. It's kind of cool Then it became an ER doctor every like ER doctors. Everybody likes Marines Everybody likes youth ministers, but then you go into politics I'm sure you guys can probably identify by essentially put a D or an R next year named about half America H instantly and to top that off and make you wear a tie Which is just incredibly painful for a guy who's worn Scrubs or flights you don't my life basically pajamas on my life now they make me wear a tie But we are witnessing history And we do have something we need to tackle together as American people something that started not from One party but from both parties something in 2004 that you saw this huge acceleration in government spending That we now all have to face this nation But we have a $37 trillion deficit That has to be paid by Democrats and Republicans and their children And for the first time ever last year we had interest payment on that 37 trillion that exceeded What we spend on the military now? There's never been a nation For those who you follow history never been a nation. He's ever survived that economically So we have some big challenges that we don't do something now Our children will pay the price because we've already been downgraded once if they decide we're going to get downgraded against it Well up the interest that we're going to have to pay on that money that we owe it will be about 40 trillion by that time And they'll add another nine trillion the next ten years to our debt It's irrecoverable So I'm not going to celebrate this. These can be hard times we have to tighten our belt a little bit And realize that the government's not the answer to everything As a matter of fact if you're looking to fix education Don't start here starting the home Start teaching your kids what's moral which right don't rely on the government to decide what's moral and right The government's not God The government's not church The government's not community The government's not family The government is government Get the Caesar with the Caesars but let's take charge of our own family and self-determine You all probably realize that more house is my alma mater That was the first normally student body president and more house school medicine that looks like I do That's right That's right There's a reason for that because I value Friendships more than I value being right In other words, I'm not going to be very influential to you if I try to convince you you're wrong In fact, I have yet to get on the internet and see somebody go oh gosh. Thank you for explaining on the idiot Thank you very much. I've changed my mind. It doesn't happen I keep on telling kids if you want to be influential stop trying to win an argument try to win a friend And then you'll find real influence So we need to work on this together. It's not a partisan issue if we don't solve so security There'll be an automatic cut about seven years 21% cut for everybody So let's work together and make sure we preserve Everything that everybody's supposed to get that is getting it right now. Everybody who's about to get it That's a bipartisan issue and you know what there's bipartisan solutions that There's one we can set our politics aside for a second to come up with real solutions. We can do that No reason to tell each other over that No reason to work against each other for that But let's come together as Americans first and realize that we have one one goal To keep liberty to keep the union and the benefit of the American people God bless you and temper for dollars. Thank you You You We always like to introduce our doctors of the day Because we appreciate I'm giving them and the resources to To come down here to General Assembly and help us with day-to-day operations And to do that, I'm going to recognize our senator from the 52nd to introduce our doctor of the day Thank you mr. President Our doctor of the day here doctor Greg Harris is from Hattiesburg, Mississippi The home of Brett Far and Jimmy Buffett But instead he went to college over at Starkville at Mississippi State and then went to a Kentucky For his medical education, Mississippi State I'm sorry Michigan State for his residency And on college you he is a on colleges to cancer doctor There with the harbored clinic We had his wife here the ER physician That was here a couple of weeks ago that works at Redmond adben as well He and his wife have one child and have been in our community for a lot of years now and we hope to keep him With that Dr. Greg Harris here You Good morning mr. President and the esteem members of the Georgia State Senate It is an honor to stand before you today to be the doctor of the day Offering my service and support for the health and well-being of this chamber As a physician, I deeply appreciate the work that you all do to shape the policies that impact the health of our communities across Georgia Health care is a vital vital vital part of our state's future And I'm grateful for it the opportunity to contribute even in the smallest of a way To help the work that you do here if there's anything that I can do to assist you today Please do not hesitate to reach out and thank you for your service and thank you for having me here You You You You You All right, we have some special guests here today and have a resolution To recognize these fine folks secretary read the resolution Send resolution 312 by center s-thus 35th and others a resolution recognizing convening the international franchise Dissociation for its contribution is to economic growth and small business development and for other purposes Whereas the International Franchise Association iFA is a leading advocate for responsible franchising practices Orging to protect promote and enhance franchise business model in Georgia and throughout the United States and where the Georgia has more than 32,000 franchises at once for instance to provide employment to over 340,600 individuals and contribute more than 34.6 billion in annual economic activity Now whereas Georgia was recently named the number one state for franchise growth by international franchise association Now therefore be resolved by the senate that members of this body recognize and commend the international franchise association For its contributions to economic growth small business development and entrepreneurial opportunity in Georgia and Beyond as well as extend best wishes for continued success and a resolution 313 by center s-thus 35th and others Resolution recognizing commanding Lorentz Shade dot Cohen and for other purposes whereas Lorentz Shade dot Cohen It's a pioneering entrepreneur and a franchise leader who founded DeBlond Corporation and cookie associates developing 35 great American cookie company GACC units across seven states and operating eight of the top 10 highest volume stores and the chain and where it's used Demeterated exceptional leadership within the International franchise association iFA serving as its treasure for five years and earning distinction as a Second franchisee in history to serve as chairman as its board directors now Therefore be resolved by the senate that members of this body recognizing them and Lorentz Shade dot Cohen for his many outstanding career contributions to the franchise industry as well as extend best wishes for your future health and happiness miss president i can please the order Is there objections adoption of the resolution the chair here's done and the resolution is adopted Like to have yeah there we go around the floor If i could have the members attention please we need to Quiet down the Whispers if you can't quiet the whispers down just please just step outside So we want to give our guests the respect and our senators the respect for putting these resolutions together So if everybody can just tamper it down just a little bit i'll recognize the center from the 35th to speak to the resolution Thank you mr. President and colleagues good morning as many of you know I am a proud franchisee With a couple restaurants and columbus and soon to be making and this morning I am here to recognize a couple of organizations one organization one person The first is the International franchise association which has been key To advocating for franchising across the country and right here in Georgia the organization promotes and protects the business model Both nationally and right here in the state franchising around the country Supports 8.8 million jobs and generates Close to 900 billion dollars in economic output in the United States And Georgia is one of the leading states in the nation when it comes to franchise growth The ifa has been instrumental in providing opportunities for underrepresented groups including veterans people color and women To achieve financial independence through entrepreneurship and I can certainly attest to that for my wife and my family Their contributions to economic growth and small business development has been vital and the ifa's ongoing support for job creation and franchise success Continues to make a significant impact and one that should be recognized in addition to that though I especially want to recognize one of the pioneers when it comes to franchising and entrepreneurship Mr. Doc Cohen who I have spent some time with colleagues and I will tell you that today This is his first time at the Georgia State Capitol And I thought it would be great Along with my colleagues Who are in the franchising business standing alongside with me To recognize the legend Doc Cohen He is known for founding deviline corporation and cookie associates which developed 35 great American cookie These this cookie franchise has was and continues to be very popular across the country And I certainly have spent a lot of money Both as a child but also on my children at the great American cookie company I'm sure many of you have as well Doc played a vital role in the growth of the franchise industry and particularly the great American cookie franchise He has also made significant contributions to the ifa where he served as treasurer and chairman and Doc's leadership and innovation have earned him new mercenaries including the William Rosenberg leadership award And his advocacy for small businesses and philanthropic work like organizations are with organizations like the leukemia and the phoma society have furthest notified his legacy and particularly colleagues He has served as a mentor to many franchises across the country but particularly here in Georgia So please join me in recognizing mr. doc Cohen Well Well, that was quite unexpected. Thank you. I think I'm really touched by that Do I get to vote now? Well, I had some remarks prepared, but I'm gonna throw those out the window because I'm kind of overwhelmed but For those of you who are not aware of the first franchise or In the country was Benjamin Franklin and I mentored Ben Um, I helped him develop his printing franchise and then singer came along and They were franchising and I came into franchising in Leave or not before most of you were born probably in 1978 When I found myself a vice president of a drugstore chain out in California And we had some financial problems with them which I discovered and I got in charge of correcting it and had to fire everybody uh, including myself And so I had no job um, and my sister saw the startup here in Atlanta called great American cookies So so long story. I won't worry with all of it, but I ended up taking the proverbial flyer and join the company to become their first franchisee Um, and I have to tell you that franchising enabled me to achieve my American dream here. I am unemployed looking for work. I had no money Um, the funny thing is my brother and mom sister said well, how much do you need? I said I need $25,000 And they said well, we'll partner with you. We'll put up half and I said well, that's great. Can I borrow my half from you? Um, and they did lend it to me over a statistic and I have to tell you the IFA um, allow franchisees to come in back in 1993 and I was fortunate enough to become one of those franchisees And franchising turned into something that created opportunities for people like me and people like Senator S. Ves and uh, Senator Halperin and Lieutenant Governor and probably some others here And I can't tell you how important it is and how much um, it means to you your neighbors, your family Because we are the people who are your neighbors And what a lot of people don't understand is that the great American cookie or the McDonald's down on the corner are not owned by some Corporate entity in Chicago or Atlanta or Los Angeles They are owned by your neighbors and we're hiring your children and we're teaching your children something about ethics and integrity Because frequently we're the very first people to hire your kids And so I want to thank you for your support of franchising um, which also supports small business because franchising really is about small business And so when you vote for issues that are impacting franchising and small business Remember that it affects your neighbors their children your family And so I want to thank you for your support I want to thank you for this very unexpected honor Um, very thrilled by you can tell I'm kind of choked up here, but um Just keep doing the right thing and um, let franchising help grow this great economy that we have in this country Because we are we are the engine that drives the economy in the United States And I'm happy to share some figures with you afterwards if anybody has quite anyone to have questions Thank you again You You You You We have Send resolution 399 by send our parent on the 44th and others or resolution commending side-by-side brain injury clubhouse incorporated for 25 years of work and transforming lies Georgia is recovering from brain injuries and brain injury related disabilities and recognized march About to 0.25 side-by-side club yesterday at the state capitol Where is the side-by-side brain injury clubhouse incorporated against the service in march 2000 following its founding by send a Johnson with the support of the The Shepherd Center and mary health care where she was the program director to provide ongoing support and growth opportunities to Be sure to be sure to be sure to be aware of the Club of rehabilitation Following standards by the international brain injury clubhouse alliance and adapted from clubhouse international And whereas since 2000's have I started to serve more than 800 Georgians. There is clubhouse now located in still amount of village To back in now therefore we resolve that As much as the spotty Corporate for its work in Georgia to the experience the brain injury as they recover and rebuild their lives and recognize march 11 2025 as side-by-side clubhouse state the state capitol miss president that police the order Is the objection to the adoption of the resolution chair here's none and the resolution is adopted We're going to send her from the 44 to speak to the resolution Thank you mr President and good morning colleagues and Watching us from the gallery It is my honor this morning to Commend side-by-side brain injury clubhouse on 25 years of Work transforming the lives of Georgians recovering from brain injuries and brain injury injury related disabilities Side-by-side Started 25 years ago this month with support from the Shepherd Center and from Emory University To provide support and ongoing growth opportunities to Georgians who have experienced brain injury Side-by-side provides a community to its family members Through a daytime rehabilitation program with a clubhouse model So at the clubhouse Survivors of brain injury are considered members not clients or patients and as such members have a responsibility For making program decisions and directing the daily operations of the clubhouse This includes roles in hiring staff and in advocacy At the clubhouse people with brain injuries experience friendship acceptance and purpose Side-by-side is Georgia's only brain injury clubhouse and it is considered the state's only purpose driven work program For men and women recovering from brain injuries Since 2000 side-by-side has served more than 800 Georgians and its consistent impact makes it an asset to decap county and to the entire state of Georgia Please join me in congratulating and commending side-by-side brain injury clubhouse on the occasion of their 25th anniversary With With me today to celebrate the 25th anniversary our executive director Brian Schroeder Cindy Johnson Cynthia Hall and Michelle Thompson and to hear a little bit more about side-by-side brain injury clubhouse and the impact that they are having every day here in Georgia I would like to call up executive director Brian Schroeder Good morning Senator parent thank you very much with the governor. Thank you the men and women of the senate Thank you very much. It is a privilege to celebrate side-by-side's 25th anniversary with you today I also want to acknowledge our members back in stone mountain Who are watching on livestream and say it is one of the greatest honors of my life To stay in here today and represent you and represent your journey through brain injury recovery Thank you very much and happy side-by-side day at the Georgia State Capitol To the general assembly and to the governor's office. Thank you for including side-by-side and the latest amended budget And thank you for your consideration For future funding in the budget that we're working on today Clearly this legislative body recognizes the vital role side-by-side plays in Georgia's trauma care system We are safeguarding the longest hardest and often unending road that men and women Survive brain injuries face and it's for these reasons that 25 years ago Cindy Johnson Shepherd Center and Emory joined forces to address a critical gap in our community Men and women who experience brain injury they would go through trauma care Grady Peabmont they would go to rehab at Emory or Shepherd Center But when their rehabilitation was over There was nowhere for them to go and continue to heal often they would return home with very little care And they would face setback after setback and a lack of community and purpose and ultimately a lack of hope Side-by-side was founded to fill this void And for 25 years we have been one of the few Resources in Georgia dedicated to supporting men and women impacted by brain injury as\n\nwell as their caregivers. And together with your support, we've helped serve over thousands of Georgians find, repurpose their lives and rebuild their dreams. I'm very fortunate to have two of our members here today. And it's my distinct honor to ask Michelle Thompson, who is both an attorney, a clubhouse member, a brain injury survivor, and a champion pickle ball player to share just a little bit of her journey with you. Thank you, thank you. I'll be brief, but I just want to acknowledge all the work that you do all for on behalf of the members at Clubhouse and so we're forever grateful. I'm sure many of you have done the simple task of just driving to pick up a takeout order. That's exactly what I did on August 1, 2020. I pair a little part in front of a restaurant and my spouse hopped out of the car to grab the order. While waiting, I had the windows in the car down, I was listening to Audible. The car was in park, I was just chilling. But then I heard an engine roar behind me and I happened to glance in my rearview mirror to see a huge white pickup truck heading straight for my car. And then the next thing was just darkness. At that point, I was nearly killed by a drunk driver. And that's how simple it is to get a brain injury. It changes the course of your life forever. As Brian said, I'm still a barbed member of the license member of the bar, but I cannot no longer practice because of my brain injury. And these are all the stories at Side-by-Side where everyone had careers that have been impacted. And it's so simple to get a brain injury. There are people at the Clubhouse who've tripped, walked into their car or just day-to-day task. And so it's so important that there's the next step in trying to build life after brain injury. And Side-by-Side is that place. And so we're grateful for your ongoing interest and support. Thank you. We have some University of Georgia National Champions here today. A proud to have them. Secretary, read the resolution. Central Resolution 269. My son are brought to the sixth and others. So I was listening to him, congratulations. Congratulations. The University of Georgia, women's tennis team for running the 2025 ITA National Team Mendoord Championship and for other purposes. Worses' pertinent team continues his triumph at season of tennis competition by securing the 2025 ITA National Team Endord Championship, marking its seven national championship and fifth national indoor title and program history. And what is this phenomenal performance of this team? It's a clear indication of the outstanding athletic ability, dedication, hard work in the right direction, use of tools and unity of purpose. And it's a spirit of each member of the team. It's a part of offense and defense talents and the ability to fit capabilities opportunity under the astute direction of head coach Drake Bernstein, the fastest coach in program history to win the national championship at the helm. Now, therefore, be resolved by the Senate. The members of this body congratulate the University of Georgia, women's tennis team for running the 2025 ITA National Team Endord Championship and extend best wishes for continued success, Mr. President of the police of Georgia. These are objections to the adoption resolution. Chair here is done and the resolution is adopted. Always glad to have particularly some local national champion tennis players here with us today for the UGA's women tennis team. And what better person to introduce them than Kelly to County's Badminton Champion Matt Brass, Senator? Thank you, Mr. President. It gives me great honor to bring up UGA's national indoor champions, the University of Georgia Bulldogs, women's team, and their coach, my good friend, and former Bulldog National Champion Drake Bernstein. Drake was promoted to head coach of the University of Georgia Women's Tennis Program following the end of the 23 season, which was following the retirement of legendary coach, Jeff Wallace, the 23 Bulldogs finished 26 and 5 that year with a final ITA ranking of number two. They advanced to the semi-finals of the NCAA champion, Chips, the finals of the ITA National Team Endord and won the SEC tournament. During his tenure with the Women's Tennis Program, which he's both been associate head coach and now head coach, Georgia has earned 10 consecutive NCAA tournament bids. The Bulldogs have captured an ITA national team indoors championship in 2019 and now in 25, three SEC champion tips, three SEC tournament titles with a final national ranking inside the top five, seven different times. Bernstein played an integral part in the development of 36 all SEC honorees, 36 all Americans, 31 ITA scholar athletes, three SEC freshmen of the year selections, two SEC players of the year and one national player of the year. He's native of Winder, graduated from the University of Georgia, a four-year letterman for the Bulldogs, he compiled 112 and 44 singles record and a 84 and 56 mark in doubles, ranking 16 all time in combined career wins. He's a part of Georgia's 2008 national championship team and the Bulldogs advanced to the NCAA semi-finals in three of his four seasons. He is married to the former Cassidy McComb of Henderson Nevada, who was also a fine tuned athlete where she was a four-time all-American and a member of Georgia's 2008 and 2009 national championship gymnastics team. So there are two children, Brody and Cassian have a legacy to live up to. But before I bring up Coach Bernstein, I do want to highlight one part of the resolution that was just red. And that part is the phenomenal performance of the team is a clear indication of the outstanding athletic ability dedication, hard work in the right direction, use of tools and unity of purpose and spirit of each member of the team. It's superb, offensive and defensive talents and the ability to fit capability, to opportunity under the astute direction of head coach, Drake Bernstein, the fastest head coach in program history to win a national championship. With that, I bring you Coach Drake Bernstein. Thank you Governor Jones and Senator Brass and the men and women leading this Senate for this invitation. My name is Drake Bernstein, Proud Head Coach, UGA Women's tennis team, just like Newton native, Senator Brass is Cougar Born and Cougar Bread. I'm Bulldog Born and Bulldog Bread. I've had the great fortune of living in Georgia for the better part of the last 30 years, grown up in Winder, playing my college tennis at the University of Georgia, being the associate head coach for 11 years now in my second year as head coach. I'm living the Georgia dream. Here with me today, it's Hayden Mulberry, freshman from Marietta in Walton High School, who won her first collegiate national event, and was named to the all tournament team and played a key role in bringing the trophy back to Athens. And senior Dasha Van Menova, the current number one player in college, tennis, NCAA singles champ, and NCAA doubles champ. James Oglethorpe, envisioned a Georgia as a colony of opportunity built to serve others in the greater good. Nonstabby said a lease, not for self, but for others. As a team, we discussed this concept in January and set out to embody that idea all through all the challenges that were in front of us. By keeping others, and the bigger pictures are focused, we were fortunate enough to bring a national team championship back home to Athens. These ladies represent that idea, not only by how they compete within the lines of a tennis court, but how they represent our state's flagship university. And again, we're thrilled to bring this trophy back to Athens and Georgia. We look forward to continuing to represent our university and great state of Georgia with pride for years to come. One more thank you to the Chamber on behalf of our staff and whole team who made this championship possible. Go dogs. Go dogs. a more is to the community. That he and his concerns. We will go to points of personal privilege, recognize the protein from the 18th for a point of personal privilege. Thank you, Mr. President. Good morning, colleagues. That special time of year we get to introduce and I get to introduce the questions. I am the speaker of the Peach Queens. They are here and I want to acknowledge and ask them to rise today. Are peach queens or are there peach queens? Are there 2024 peach queens? Let's give them a nice round of applause. Let me tell you a little bit about the conversation. I am the speaker of the Peach County. I have the honor of representing. This pageant is more than a competition. It is absolutely a way of life to honor farmers, businesses and communities that have made Georgia the peach state. Since its inception, the pageant was recognized without standing young women just like the four that we have in the gallery with us today who are in the community. We have a race, leadership, and pride of our agricultural legacy. Beyond agriculture, though, peach county is a community built on tradition and deep sense of pride. These outstanding young women that are visiting with us this morning have been selected to represent Georgia peach festival and the proud agriculture history of our state. We have with us Miss Peach Queen Kendall Bella Gaines and a little misspeach Queen Sky Harris and Tiny Misspeach Queen Ella James Young In closing, I am honored to have them with us this morning. I am honored to commend them as our 2024 peach Queen. Thank you for giving them a great welcome and ladies, thanks for honoring us being with us this morning. Thank you. Mr. President, I t want to thank you.) I am honored to have you celebrate superiority, figuredaval, heard out there. Iم Pantheon Thank you, Mr. President. Need somebody to block for me today to get down the aisle. Today's Japan Day at the Capitol, and there are a bunch of Japanese companies down in the South Wing. If anybody wants to visit their tables, I hope you get the chance. There's also a reception from 4 to 6 this afternoon in 216. We've got some of our business folks up in the gallery. There are over 700 businesses, Japanese businesses in the state of Georgia employing more than 40,000 employees. So with us today, we've got Council General Miyo Mayeda. If you could stand up. So happy you're here. And a lot of Japanese businesses, if you guys could stand. And thank you so much for coming to the Capitol today. I yield. Here's the hospital in practice. I started at edificentatio, mayo, and I've been working as an envoy from the Citizens' sickle that I've given you time to Heyday's book. www.hallebsacLo bit na Iran.andSpr con scar strion more songs on s.. ok i'll get queię Theme uno re wypresence who don't want to be a v Thank you, Mr. President. Ladies and gentlemen, I'd like to apologize for voting gay on Senate bill 244. What this bill is is a funny Willis bill. Let me read it to you. In the event based upon a motion by the defendant in a felony or Mr. Meena criminal case, that the prosecuting attorney in such cases disqualified due to improper conduct or the part of such prosecuting attorney, the defendant shall be entitled to and award a reasonable cost and attorney fees in the case. I apologize to the fools and county residents. That's for million dollars. It's for million dollars. When Bill Gates, if the Secretary of State had made the recorded, when the president asked him to find the vote. But I've not seen a bill in here that won't prosecute the president for trying to manipulate any election. He's got an oligarch by the name of Elon Musk and says he will primary every Republican who opposes the president. Now all of a sudden, people, the general public, is at his car dealerships protesting. And now the office of civil rights, the president has sent them on with the lowest people to prosecute them, but he didn't say anything by pardoning the rioters at the Capitol. The Elon Musk might be the richest man in the country. And the president might have a couple of me. And the president, you might not have as much money as Elon Musk, but you ain't in bad shape. And so when I said all of you, if you scared, say you scared and let the general public know you scared and don't run for office, I yield a will. The senator has yielded. The senator has a senator from the 44th for Point of Personal Privilege. Thank you, Mr. President. I am rising today in honor of and to recognize that it is Child Abuse Prevention Day here at the Georgia State Capitol. The Positive Childhood Alliance Georgia agency, formerly known as Prevent Child Abuse, Georgia, works to prevent childhood abuse and neglect before it starts. Positive Childhood Alliance offers educational programs, performs home visits, and collaborates with partners to ensure resources to protecting Georgia's children are accessible. Child trauma, including abuse and neglect, has long-term psychological, emotional, and physical effects throughout an individual's lifetime and impacts future generations as well. Families who receive the support they need before a crisis occurs are better equipped to provide safe, healthy, and nurturing environments. This leads to children who are safer, healthier, and more hopeful about their futures. Strengthening families through access to concrete economic, social, and community-based supports reduces the likelihood of childhood abuse and neglect and ensures that kids have the foundation for lifelong well-being. Positive Child Abuse prevention activities like those done by Positive Childhood Alliance Georgia succeed because of the partnerships created between child welfare professionals, educators, legislators, and families. Investments in these services, such as home visiting programs, families strengthening programs, economic supports, and community-based child abuse prevention efforts are essential to building safer, healthier communities for children and families. I want to recognize the members of Positive Childhood Alliance Georgia and the division of family and children services, prevention, community support section who are here today, as well as all of the stakeholders that are watching us from the gallery. Jennifer Stein, Kimberly Stewart-Lukus, Beth Florence, Karsten Hartman, and Laura Griggs. And again, many others who are present in the gallery and working tirelessly to end child abuse in Georgia. We thank you for your advocacy and your investment in protecting Georgia's children from abuse and neglect. Ask my colleagues to join me in recognizing prevent child abuse Georgia Day at the State Capital. Thank you. Thank you, Mr. President. Question! diaspora day at the Capitol. And please come and have lunch with us at 12 noon in 123 and a press conference at 1 o'clock. And today we have all many of our consular generals who are standing over here is Belgium, Columbia, Ghana. I know I see the ambassador and the person Ghana right here. India, India, Consular General, Nigerian Consular General, Taiwan, UK, Mexico, Peru and Haiti are all here. All of them were invited, but this is who's here today. So Pastor Janice Barnett, where you she's here with Chico, say, Chica, say, wisdom, profit, JJ, IO and profit, EB, taglet, tagled, all from Nigeria who are diplomats. So we thank you for coming today because again, we want it, it's Barnett the King said, out of the mountain of despair is a stone of hope. And together we stand. Thank you for being here today and everyone who want to meet their consular generals, please come down at 12 o'clock or whenever we get out and go down and meet them and have lunch. Thank you very much. And somebody else is going to introduce the children, all of you. Oh, please the diaspora people who are in the gallery. Please stand and be recognized. Thank you, Mr. President. Senator's, um, we get a weekly dose of Trump news from the senator from the 14th. So I've decided to give you a weekly or maybe even a daily update on news what I'm calling the funny follies. Okay, I think it's important that I point out that we have a district attorney, funny whilless in our capital city of the county of the state of the county that has zero regard for the law. Let me repeat that. Our DA has zero regard for the law. It was in today's paper. DA violates open records act. Find $54,000. Bolton County Superior Court judge Rachel Krauss has recently found DA willess $54,000 and ordered the DA to turn over all applicable records within the same time frame. I'm just going to let the government in the long running open records dispute between the DA and the defense attorney, Ashley Merchant. I asked you, what is the DA hiding? Why is the DA so afraid what will be made public? Why won't they not open request do the open records request? I think I know what it is. I don't think she wants it to be made public that she had communication with DAX Smith and the Department of Justice on how to take down President Trump during election through the legal system. It was a coordinated effort that backfired on the DA.\n\nYou talk about a possible RICO case. That's a RICO case. But I'm standing here today to tell you, D.A. Willis is not above the law. She's lazy or she's arrogant or maybe both. But either way, she must comply with our Open Records Act. I have today written a letter to our attorney general Chris Carr requesting to take action against the A. Willis. The attorney car is the top law enforcement officer in our state. And I'm asking him to get off the sidelines, get in the game, and act now. It is time for our attorney general to quit waiting on the courts and show some leadership. And not let this D.A. continue to make a mockery of Georgia law. I'll be back tomorrow, Mr. President, with another episode of Founding Follies. Mr. President, I yield the well. Senator's yielded. I recognize Senator for the night. Thank you, Mr. President. I always hate to follow my senator from the 26th. And I'm with you. If you're scared, say you're scared. But that's not what I came to talk about this morning. So today, I have the honor of recognizing an exceptional group of young leaders from Gwinnett County, the great Gwinnett County, except Mollby. Gwinnett County Youth Commission, since 2017, this program has given students a unique opportunity to engage with the local government, gain leadership skills, and play an active role in shaping our communities. To our youth commissioners, you are the future of the great Gwinnett County. Your dedication to learning, service, and advocacy is admirable. We are proud and excited to see what you all will accomplish. Congratulations, keep leading the way. And if you're in the gallery, if you'll stand up, if not, oh, there it is. Oh, yes, they're here. Awesome. Yes. Y'all give them a hand from the great Gwinnett County. Yes, Gwinnett is fine. And with that, Mr. President, I yield the will. Thank you. We're going to ask the center from 38. Thank you. Good morning. Thank you, Mr. President. Colleagues, it's my honor to recognize the Georgia Council of Court Administrators for its outstanding contributions to Georgia's judicial system. I'm not sure if we have folks in the gallery, but as a collective body of court officials and professionals, GCCA is dedicated to enhancing the professionalism of all tiers of Georgia's judicial system. Their mission is to promote the education of court administrators, ensuring they can professionally, ethically, and efficiently execute the operations of our courts. This work is critical in upholding the integrity and effectiveness of our justice system. Today, we are privileged to have with us GCCA President Timothy Ezell and members of the GCCA Executive Committee who lead this charge with dedication and excellence. It's only fitting that we formally recognize their service. Therefore, I'm honored to present the Senate resolution and their name. Thank you for your leadership and commitment to the courts and the people of Georgia and congratulations. If anybody is here, they may have left, but thank you for your service. And then with that, I yield the vote. We're going to have a center from 39. Thank you, Mr. President. Colleagues, I rise today in honor of Women's History Month, a time to recognize the women who came before us, the women leading today, and the young girls who will shape our future. Too often, history only remembers a few names, but progress has always been built by countless women whose stories were never recorded. Women who didn't fight for recognition, but for the simple right to be seen, heard, and valued. And that fight isn't just history. It's happening now. It's the mother working two jobs to build a better life for her children. It's the young girl who refuses to shrink herself to fit the world's expectation. And it's the women in this chamber and across our state who keep pushing forward. Not just for themselves, but for those who come next. So today, let's do more than honor women's history. Let's commit to a future where every woman and girl has the chance to write her own story. Because when women rise, we all rise. Thank you. Thank you, Mr. President. I am the senator from the 14th and this is Trump Morning News. Trump Morning News. You're a number one leader and Trump News Entertainment keeping you a prize of the health of your democracy. Remember, we're a radio show now. Listen, I told you all a few weeks ago. About the possibility of the Trump administration would violate court orders, which would be a really bad canary in the coal mine for the health of our democracy, which is of course a point of our show. Well, it seems like there's some relevant updates in terms of compliance with court orders coming out of the District of Columbia. The judge James Boesberg of the DC District Court recently issued what's called a TRO, a temporary restraining order. What's that? Well, TRO is basically a judge's way of acting fast at the federal level when something needs to be done on an emergency basis. And so what the judge said was the government has to stop three flights that were carrying Venezuelan nationals, two L Salvador to a terrorism detention center. And the reason was that the president didn't really have authority under what's called the alien enemy Zach. You all have heard the alien enemy Zach basically it's a very old law that says that the president has certain powers and wartime. Well, it doesn't seem to apply. So it's not really available as legal authority to deport those people. Well, what did the court do? The court said you can't deport those people. Those planes are in the air. You need to turn around the planes that are in the air. What did the government do? Ignored those port orders. Now, what's what it seems to happen to the court, which has the inherent power to enforce its own orders and her authority asked the government's lawyers come back into court to explain at what time exactly those planes were in the air. So that the government, the court knows if the government complied with the court order or not. And what did the DOJ say to the court? Well, unfortunately, the DOJ said, wow, we can't, we can't tell you that. The court said, well, we're in an open hearing. I've been on the fire. The court, you just walk walk up to me and tell me in my ear. How many planes? How many people? What time? Said, no, I can't tell you that. I'm under orders from DOJ higher ups not to tell you that. buzzer buzzer radio show noises. Here's the point where we got to think about enforceability of orders folks. If US citizens were to get detained and shipped out of the country by plane, the DOJ's official position is we can't tell you who was on the plane. We can't tell you what time plane was in the air and got the order. We can't tell you when the plane landed. And then we got photos that mainstream media ran of people, prisoners being head down after they got off the planes, being moved to the detention center for propaganda. A renowned photo editor on Instagram pointed out that the metadata of those photos, the timestamps show that those photos couldn't have been taken after the planes landed. They were taken before the planes landed, which means that there is a stage propaganda effort with multiple governments collaborating to make it look like serious dangerous people are being deported. But they did so in violation of court orders. They wouldn't even tell the court. The information needed for the court to be able to enforce its own orders. This is bad news folks. Bad news. Why would you Trump warning news to tell you about the news to give you a prize of the health of your democracy? I can see that everyone is wrapped by these developments in the constitutional order. And so am I. Anyway, we're here for around one. Trump warning news. Obviously we'll have a special 60 minutes installment later on during the rules calendar. But Mr. President, as always, it is my pleasure to be up here. Give you the news. Reminder your state legislators. There's nothing you can do directly about this except check your phone and drink coffee. And there's nothing the Republican Party could have done the last 20 years to prevent this from happening. Thank you, Mr. President. We'll see you next time on Trump warning news. All right, Senator. You know, I'm a little worried, Senator. You weren't holding their bodies of tension like you usually do. I'm a little worried about your ratings right now. And we've got to spice it up something next time. But good job. Good job. All right. Recognize the standard from the 48. Thank you, Mr. President. Colleagues, as I ponder the report from the center from the 14th, I'm reminded that one of the main reasons why people switch from television to radio is because I have a face for radio. And I just want to congratulate my brother for having a face truly meant for radio. I think it's a better form for you. And I believe that that our friend Sean Hannity may be looking for a replacement film in the afternoon with love for you to dig in on that. I love the reports I live for the reports. As you know, I sit in wrapped attention and always want to hear. But I'm here to talk about something far more important than funny, funny or Trump news radio. I'm here to talk about water access, rafting and kayaking, something we can all agree on on your desk. It's a fact about the freedom to float. Of course, 159 counties that we all represent 96% to streams and rivers that are capable of recreational vessels like canoes and kayaks. Boating and fishing generated $1.1 billion to our state's economy and public access to passage. Downstreams, generates visitors and sales tax in rural communities across the state, helping to reduce property tax burdens and local residents. To protect George's record setting for his economy and our outdoor heritage, the freedom to float and write the boat must be recognized and protected. So when you go out to the ropes today and you see folks wearing life jackets, please give them a moment of your time. Please talk to them, hear them and their concerns. And with that, Mr. President, I love to start from the 14th. You know, I was just playing with him. I'll be the one. Thank you. Thank you, Mr. President. My fellow Senators, colleagues, friends and y'all. Just a quick note today is children and youth day at the Capitol. And it's hosted by Senator Don Zell, Don Zell, James Knott. And we want to recognize all the children because it's only for the children that we keep love alive. Only for the children our love survives. Thank you so much. I yield the well. Oh, let's recognize and stand up. Those who are here in the balcony. Let's get my hand. I yield the well. Thank you. Thank you. Thank you. Thank you. Thank you. Good morning, Mr. President. Good morning, everyone. I just want to share on behalf of myself, the Senator from the 30th, just a gratitude of thanks to many people who helped our community in Pauling County over the weekend on Saturday. When an EF-1 tornado came through town, doing some pretty big destruction on Highway 61 in Dallas, about 11 mile path the storm took around 1230 on Saturday night. I just want to say thank you to the Pauling County Sheriff's Office, the Pauling County EMA or Fire, or 911 Center, the Dallas Police Department, the Hyron Police Department, Metro Ambulance, Grace Stam Power who was out there till last night, till about eight, nine o'clock working with the Georgia Department of Transportation and want to give Mike a gravely or board member from the 14th Congressional District. Thank you. Thank you. Thank you. My colleague, the standing I rise today to sound and alarm and call for civility in New York. And it may not be possible, but let this be a light, even as we jokingly talk about 47th President, jokingly talk about funny wills. However, let it be known that I too regret voting as the Senate upon the 26th stated voting for a bill that really was designed on the one hand to come to the president's. But as I read the bill, it's just bad conduct, which has already been found and is politics that will dismiss the charges against the 40th president. If those charges are not valid, I would like everyone in here a dinner. I said it everyone because we know politics. It is preposterous that someone with threatened a billionaire would take over democracy and threaten to put millions of dollars in each of our districts if we don't board a certain way. I am not only rise for Democrats, I don't know rise, I rise for everyone in the business and repulsing it all because I stand for democracy. Democracy dies in the darkness. I am a poll when some of us fail to stand up and we jokingly say, are you going to primary me? And that is a polling. And it is a polling that we have to stand up to a man who made a call to say give me 11,780 votes. And but for a man of integrity, we would have never known. And I'm a poll that how we are handling this. I'm standing for democracy, I'm standing for my grandchildren who are not even in existence. I'm standing for generations I'm told because it is not to be taken for granted. America is America. It is because the content of our character, not the color of my skin, not the color of your skin. Right is right. And wrong is wrong. And if someone does not stand, if someone does not stand, America will not be America. There are reasons that people are clamoring to get into America. I have been in countries where when I really got back to America I literally fell down and kissed the ground because my life was threatened because of the conditions of that country. And we cannot allow this country to go away because we're giving it away to billionaires. I do want to be a billionaire but not that bad. You cannot buy my integrity. Let not your integrity be bought. I changed my membership to a big box company. I stopped by there and get my gas. It's convenient. I was in traffic 54 minutes just today because I refuse to give my money to people that disrespect me. So I went over to Costco because they respect DEI and I understand that this is a battle now. And if the children of Montgomery, because they have those buses for 381 days, I am committed to preserving democracy in America to be the more conscious of this country. We cannot let it go by the threats of those who disregard court orders and executive order does not Trump a statute and does not disrespect judges. We have a law of the land. Let's respect the law of the land. I re-yield the well. Thank you, Mr. President. Senator Jeal to the well. It recognizes the center from the 41st point of personal privilege. Thank you, Mr. President. I just have two things. One, I want to wish a happy birthday to my chief of staff, Erin Castle, who many of you all have met along the way. She's been absolutely incredible. And today is her birthday. So I want to make sure she gets celebrated. I'm very grateful for all that she does to help make sure that office runs. And then the second piece is that we are starting a LGBTQ caucus for both those who are part of the LGBTQ family and those who are allies. And so if you would like to join as an ally or as a member of the LGBTQ community, please see me or my office. But we would love to have folks join as we create this caucus. Again, everybody is welcome. This is not exclusive in any way, shape or form. Our mission is simply to make sure that we look out for the well-being of all Georgians. Thank you. Chair recognizes the senator from the 31st. Thank you, Mr. President. I ask for unanimous consent to excuse the senator from the 6th for business inside the Capitol without objection. The senator from the 6th is excused. Does any other senator wish to rise on a point of personal privilege? Hearing none, you have a consent calendar of privilege resolutions before you. Does any senator wish to remove a resolution from the consent calendar? Is your objection to the adoption of the resolutions on the consent calendar? The chair here is none and the resolutions on the consent calendar are adopted. Are there any motions to withdraw and commit? You have a local consent calendar of local bills before you, Mr. Secretary. Are there any objections filed to any bill on the local consent calendar? Mr. President, no objections have been filed. Is there objection to agreeing to the report of the committee on state and local governmental operations, which is favorable to the passage of the bills on the local consent calendar? The chair here is none and the report of the committee is agreed to. The question is on the passage of the bills on the local consent calendar. All those in favor of will vote ye? Those opposed will vote nay. Mr. Secretary, please unlock the machine. On the passage of the bills on the local consent calendar, the ye is 51, the nays for zero and this bill having received the requisite constitution was already as therefore passed. All right, moving on. Are there any motions to engrossed? The chair recognizes the majority leader for motion. Thank you, Mr. President. I ask for unanimous consent that the following bills and resolutions be engrossed at this time. House bill 90, House bill 223 and House resolution 32. Mr. Secretary, read the captions. House bill 90, House representative of the administration, the one of the others, the bill 229 to amend the bill of Section 48-5-7.4. The official court of Georgia and the original assessment for bona fide conservation is property, bona fide residential transitional property. To increase the maximum acres to qualify for assessment and taxation, it's bona fide conservation is property to allow for later matters to appeal contingent effective date, not a macro appeal to repeal complex laws and further purposes. House bill 223, by our representative for chat, once on the six and others, the bill to amend Title 48 of the OCDA related to relevant taxation says to exclude from the calculation of taxable net income, certain disaster relief versus inscremant program payments for agricultural losses offered due to Hurricane Helene, which is a very useful tool for the federal reform and tax credits and further purposes. House resolution 32 by representative of the administration, one of the fourth and other, the resolution for the state of emergency constitution, so it's increased the maximum acreage to qualify for assessment and taxation as a bona fide conservation is property and further purposes. Mr. President, I can please the order. The majority leader has moved that HB 90, HB 223 and H are our house resolution 32 to be engrossed. Is there objection? There is objection. I recognize the majority leader to speak to the motion. As you know, it's typical tradition that we engrossed all the bills that come from the ethics committee and the finance committee. All three of these cases of legislation passed through the finance committee. They were properly vetted. They were debated and votes were taken and with tradition, we will continue to engross these bills and we'll do that again today. Thank you. That's for you to vote for the engrossment resolution and the engrossment motion and we will move on to the calendar. Thank you. Does the minority leader wish to speak to motion? They will. I'm ready to be engrossed. All those in favor of the motion will vote yay and those opposed vote nay. Mr. Secretary, please unlock the chain. Thank you. On the motion to engross the yays are 29 and the nays are 23. This motion having received or prevailed on is engrossed. Thank you. Let's take a moment now and recognize somebody special day. I think we've got a birthday boy. Maybe the guys got a number of 37. Let's give him a happy birthday. We've always dreamed of being here for his birthday. How about that? I've got a birthday wish that came true. Third reading and consideration of general bills. We're now moving on to the rules calendar.\n\nslide. the section. Please read House bill 89 as we start with the rules calendar. House bill 89 by representative Cooper the 45th and others will be in time to mention the two way title 31 of those CGA will be to the Department of Public Health. Those required health care providers, health care of civil and pharmacies, ride the machine mortality review committee with like Patrick and other clinical records to the Med Code section 37-3 those 266 of those CGA will be to treatment clinical records and release permitted scope of privileged communications liability for disclosure and notice to care for discharge, trust, permit, release of clinical records of a deceased patient to the maternity mortality review committee to a medical section for about that just 16-24 those CGA will be to notification of suspicious or actual deaths court order medical examiner's inquiry and written report of inquiry says to remove the requirement that the medical examiner's inquiry for pregnant female deaths be done through a regional prenatal center to arrive for really matters to reveal the booking laws and further purposes. Mr. President and Senate Committee on Health and Human Services recognize that this bill do passers-by for this minute, Senate Watson chairman that can be seen from Mr. President. Thank you Mr. Secretary. The chair recognizes the Distinguished Senate from Habersham Senate from the 50th. Thank you Mr. President. I rise to bring House Bill 89 which is a very important bill as some of you may know Georgia ranks in one of the lowest in maternal mortality in the country. And so what this bill is is an effort to try to lower the rate at which people are passing away after they give birth. I'll go through by section, sections one and three. This provides the maternal mortality review committee with the ability to obtain psychiatric records. Maternal mortality review committee or MMRC, their task with reviewing maternal deaths and making recommendations to improve maternal outcomes in Georgia. In 2022 it was found that the number one cause of death and the number one cause of maternal mortality was mental health and that included suicide and overdose. So currently Georgia's laws don't allow mental health records to be provided to the MMRC. This will allow that. Section four is a cleanup. This is requiring that maternal deaths be referred to the medical examiner's office instead of the regional perinatal centers. We worked with the GBI and the medical examiner to develop this cleanup provision. This legislation would require that these maternal deaths be referred to the medical examiner's office instead of regional perinatal centers as all other autopsies are handled. Section two establishes a formal process for creating regional perinatal centers or RPCs and regular cadence for reviewing the adequacy of the system and whether additional or new RPCs should be established. Just for your reference, the state of Georgia has six designated RPCs located across the state. We've got Phoebe Putney and Albany, Piedmont, Columbus, Grady, Atrium, Health, Navisan, Macon, Wellstar, MCG, and Augusta, Memorial Health, and Savannah. These regions and RPCs have been in place for more than 30 years without change. After meeting this fall with existing RPCs, our partners at the DPH, or excuse me, Department of Community Health, including our former colleague, Dr. Burke, they developed this bill to improve maternal health outcomes. This, as a son of an OBGYN and the father of four, obviously, maternal health is extremely important to me. I think this bill will help move Georgia in the right direction. And Mr. President, I'm happy to yield for questions or I'll yield the wealth there or none. No questions, Senator? Thank you, Mr. President. I yield the wealth. Does any other Senator wish to speak forward or against the measure? The Chair, here's none. Is there objection to the previous question being ordered? The Chair, here's none, and the previous question is ordered. Is there objection to the agreement that the report of the committee was desirable to the past of the bill? The Chair, here's none. The report of the committee is agreed to. Is there objection to the previous question being ordered? The Chair, here's none. And the main question is ordered. The question is now on the passage of the bill. All those in favor of the bill will vote yay. Those opposed nay, Mr. Secretary, please. You all the passage of the bill, the a's for 50 and the a's are one. So this bill having received the requisite constitutional majority is therefore passed. Moving on down the calendar, Mr. Secretary, read the heading. House Bill 223, by the Senate of 176 and others, you will think I'll my to amend Title 48 of those CGA with revenue taxation. So that's excluded from the calculable taxable net income certain disaster relief or assistance grant program payments. Thank you, Mr. Secretary. The Chair recognizes the distinguished senator from the eight who has distinguished visitors with him. Thank you, Mr. President. Yes, sir. The the fellow that has the last name of Goodman that is sitting in the desk where the Senator from the eighth normally says is a lot taller, a lot better looking and a lot younger, but that's my son, Ellie, because I'm glad he's with us today. It's my honor to bring to you a House bill 223. This is a governor's bill as the governor's hurricane disaster relief bill. I really want to thank his office. I want to thank the governor and thank Reagan in the governor's office who's been working on this for months as well as as with Bishop Bershitt in the House who cared in the house. This bill has four main components. The first component is the language from the Senate bill 52. Otherwise known as the trees act. Y'all remember we had that bill. I don't know the six weeks ago in here. Past unanimously. Thank you for that. We are talking with the governor's office and with our friends in the house where they agreed to to put that in the language in there. It's going to get it to the governor's desk faster. You remember that the trees act is where we suspend the severance tax for the last quarter of 24 and all of your 25 in the FEMA designated disaster counties. And we also create a program where those counties can apply for a grant and be refunded. What is the three year running average for their normal timber tax collection. The second component of the bill is a USDA disaster and crop loss payments income tax exemption. The third component is a reforestation tax credit. And the fourth component is agricultural structure repair temporary addition to gate. The fourth component is the Georgia Agricultural Tax Exemption Program. Concerning the income tax exemption, this bill will allow payments made to producers from USDA block grants and crop loss payments related to storm damage to be exempt from state income tax. The payments are already exempt and do not require legislation. This bill is similar to a provision included in House Bill 105 from 2019, which Governor Kemp signed. Concerning the reforestation tax credit, this bill will issue a new reforestation tax credit in the aftermath of Hurricane Helene, similar to that of House Bill 4EX from the 2018 special session was approved by Governor Deal. It allows taxpayers who want eligible timber properties devastated by Hurricane Helene to apply for a timber reforestation tax credit. The program will again be administered by the Department of Revenue with the assistance of the Georgia Forestry Commission in determining value-occasually losses. The maximum aggregate will again be $200 million. The per acre cap will be $550 per acre. If a taxpayer qualifies for more than their tax liability, the additional qualified tax credit could be refunded to the taxpayer. The tax credit could be transferred one time to another Georgia taxpayer who would then not have the ability to transfer or receive a refund for the value of the credit. As of December concerning the data on the House Bill 4EX from the 2018 special session, House of December the 3rd of the 24th of the previous credit established for those harmed by Hurricane Michael has generated just under $80 million in requests and less than $50 million has been claimed. The request must be generated by December 31, 2024 and due to the carry forward provision can be claimed through 2034. We anticipate it to be much greater in terms of applications for this program because Hurricane Helene went right through the heart of the wood basket of this state. You heard me say before that 37% of the timber land on this state was either damaged or destroyed from Hurricane Helene. And lastly concerning the agricultural structure temporary addition to gate, we lost close to 500 chicken houses from Hurricane Helene in the state. Georgia producers who are already qualified for a gate card is what we call them do not currently receive a sales tax exemption on building materials or real property. This bill will allow those building materials to be sales tax exempt for gate card holders through the end of 2025 for the repair or reconstruction of damaged agricultural structures including poultry houses and greenhouses. And finally I'd like to say this bill along with the other provisions that you all in this chamber and our friends across the hall there and the governor's office it brings the total Hurricane relief package to $1.2 billion. I think that has someone that represents a district that was devastated has many of you in this chamber your communities were devastated from the hurricane. I think that it shows how much our hearts are with those communities not only not only our farmers and our foresters with those communities have been affected the well. I'm proud of the response the state has taken and with that Mr. President I'll be glad to yield for questions. Senator you have no questions. Thank you thank you Mr. President and with that urge your federal consideration and again thank you for all your help that members of this chamber and our friends across the hall have helped our communities have been devastated with a stone thank you. Senator as yielded the well does any other senator wish to speak for or against this measure. There's none and the main question is ordered the question is now on the passage of the bill by substitute all those in favor of the bill will vote yay those opposed nay Mr. Secretary please a lot of the machine. you on the passage of the bill the a's are 50 and the a's are one this bill having received the requisite constitutional majority is therefore passed by substitute. Mr. Secretary read the caption for the next bill. I speak 90 House will 90 by represent of a station of 104th and others will tell them act to amend code section 40 to five to some before the fish could have George and two will to prefer a functional system for one of five conservation use property and the five presidential transitional properties increase the next one acreage qualified for assessment of taxation as a bona fide conservation use property to write for later matters to write for contingent effective date and auto medical appeal to repeal the laws and rather purposes. Mr. President and second way of finance recommends this bill to pass us for Christmas and our house to learn chairman that police your most president. The fiscal notice been attached. to recognize is the distinguished senator from the 11th to present the bill hb 90. Mr. President I do bring the four you house bill 90 it should look very familiar to this body we actually passed out Senate bill 45 which is an identical version of this bill it was one of the recommendations that came out of a farmland preservation committee. It's a bill to help with farmers and land the current law only allows an individual to own up to 2000 acres of land in one name this legislation will allow farmers in one name tone up to 4000 acres just trying to bring our code up to date with the family farm family farm to grown over the years and so this is just a legislation that we we found that would have benefit from the effort of the chairman from the 4th and his conservation farm and conservation committee. And I just definitely want to thank the majority leader in the house to check the frustration for his work on this bill he's worked really hard and appreciate his his support but also thank this body the public is in the Democrats for coming together and working on this issue together we've had lots of conversations about this and just want to thank everybody for their support and just would greatly appreciate your passage and this is the enabling legislation and I hope to be back with the constitutional of the law. I'm not a constitutional amendment and I appreciate your questions if there are any questions. You do have questions chair recognizes the center from the 14th. Thank you Mr. President as a center yield. This is companion legislation I guess with HR 32 is also on the rules calendar day correct. And there's a policy judgment made between those two pieces of legislation and well preface first of all you agree we we passed a version of this legislation that increased the amount from 1000 acres 2000 acres correct 2000 to 4000. Okay we passed 2000 for those we just heard just as is in this bill in this bill but did the house make any amendments to what we passed out of this chamber. Okay no further questions thanks senator thank you. Mr. President there are no other questions I'll yield the oil you have no other questions. Thank you for your support. Does any other senator wish to speak for or against the measure hb90. The chair here's none is there objections to the previous question being ordered chair here none of the previous question is ordered. Is there objection to the green to the report of the committee which is favorable to the passage of the bill. The chair here's none and the report of the committee is agreed to. Is there objection to the main question being ordered the chair here's none of the main question is ordered question is now on the passage of the bill all those in type of the bill will vote. Yay those opposed nay Mr. Secretary once again unlock the machine. Thank you. All the passage of the bill the a's are 47 and the a's are three so this bill having received the requisite constitutional majority is therefore passed. Thank you. Secretary H. R. 32 House resolution 32 we represent a demonstration one or the fourth and others resolution proposing an amendment to the Constitution. The motion is increased the mechanism acres to fall for assessment and taxation that's the bona fide conservation use property to regulate a matter for the submission of this amendment for out of occasion or rejection of other purposes. Mr. President the same can we have a finance recommends of this resolution do pass is roughly submitted center host that will chairman. Mr. President fiscal note has been attached and that police the order. Mr. President again good to be here thank you this also should look familiar this same version we pass out of this body 51 to 1 as Senate resolution 56. This is the constitutional amendment a portion of this legislation to put before the voters to make sure that they're okay that we do this again it was a recommendation that came from our farmland. Preservation study committee it's a tool to allow family forms continue to grow and expand and not have trouble with with taxes so it's a very very good bill want to take the leader in the house for his hard work on this and and also just the Republicans and Democrats both in this body and in the house for supporting this measure. Appreciate all the all the work that everybody's done and I'd like to thank any questions if there are any of not a researcher support you do have one question. Would you like to speak. Thank you Mr. President will the center yield. I am not you know on the committee that this. I have a question to all that. Can you explain to me. Let me put that by saying I'm aware of all the issues that have arisen in terms of federal taxes with syndicated conservation use. And how it's caused a lot of litigation and pain for folks that thought they were taking a man for credit. Can you explain to me. How this program relates and is there any concern that it might inadvertently end up in the same posture. Strictly a state of the program we offer a reduction in property tax to our farmers. The land that the farmers are using doesn't require fire or you know e emergency or the. In principle resources in the term we're able to do a candidate at a lower tax rate because it's not a burden on any local government or municipality. So it's just a tax rate that we put into place just in the state of Georgia back in the early 70s and of course 2000 acres. It was a lot of land but as you know over time our family farms continue to grow and get larger and larger and so 2000 acres is not as not the same today as it was in the 70s. So we're just trying to bring bring the code up today just specifically. Understood. It probably could and may already be in other states but I'm I'm unsure of that. Okay I may give it your fine thank you. Thank you. Thank you Mr. President. Does any of the other things we speak for against the banter. Chair here's not is there object to this previous question being ordered. Chair here's done the previous question is ordered is there objection to agreeing to the poor committee which is faithful to the passes of the resolution. Chair here's not the poor committee is agreed to. If there's any questions being ordered chair here's not many questions ordered questions on the adoption of the resolution all those in favor vote. Yeah I'll pose. I'm not motion. Thank you. I own the adoption resolution the a's are 50 the days are one resolution have received a reclet to thirds constitutional medaria is there for adopted. Secretary read SR 148. Senate resolution 148 by senator 33rd and others resolution recognizing a commanding Taiwan first relations with the United States and the state of Georgia and for other purposes. Mr. President the same committee on rules recommends this resolution do pass by substitute succulent submitted center brass chairman. Mr. President the Senate committee on rules offers following substitute to send resolution 148 resolution recognizing commanding Taiwan first relations with the United States and the state of Georgia and for other purposes. Mr. President senator more the 53rd offers following amendment number one to amend the Senate committee substitute to send a resolution 148 by striking on line 27 and encourage city by striking line 28 in its entirety striking online 33 who you and FCC. Adding online 27 after investments Mr. President that completes the order. Thank you. Thank you. Thank you Mr. President my fellow senators colleagues friends and y'all I'm just here with this senator from the six. And which we are co chairs of the Taiwan American caucus and today we just want to recognize and command Taiwan for his relationship as an ally and friend with the United States and of course of Georgia. I need your support there's an amendment that I don't agree with because we're not trying to build walls we're trying to build bridges and if you can support me I appreciate myself and the senator from the six. On which we are co chairs if you can support us we appreciate it thank you so much I yield well. Senators yield is senator from the three like speak to your amendment. Thank you Mr. President obviously a great supporter of our friend and friends in Taiwan great resolution but it does need a little bit of cleanup in my opinion that's why I've offered this amendment striking through on lines 27 and 28 as it relates to smart cities personally. Many folks in northwest Georgia are adamantly opposed to smart cities as well as a lot of rural Georgians all across this state as I certainly believe as well as many others that it violates our fourth amendment and our constitution also you know and colloquy known as Trump's floor leader and striking out W H O and UNFC see that's the world health organization in which we have pulled out of as a country. And ultimately we pulled out of the Paris Accords Congress failed to ratified the Kyoto agreement so I don't believe we ought to be encouraging our friends to take part in things that we ourselves in a country don't take part in and then adding on line 27 a period after investments and that's all the amendment is. I'll yield for any questions Mr. President. You have no questions thank you. Does any other senator would speak for against measure. Chair here's none. At least some might is vocal today. Center for thirty third would you like to close the gate for we take up voting on amendment. He is waved. All right it's on amendment number one. Off it by the center from the fifty third is their objection to amendment number one. All those in favor of the amendment will vote. Yeah all opposed. Day secretary and lot of the machine. You\n\nOn the adoption of amendment number one, the yeas are 22 and the nays are 29 and this amendment has failed. Questions on the adoption of the committee substitute is there objection of the adoption of the committee substitute? Here you none the committee substitute is adopted. Is there objection to agree until the board committee which is able to adopt some of the resolution chair? Here's none. The board of committee has agreed to. Questions on the adoption of resolution all those in favor of O.A. all opposed nay secretary and lot of machine. The committee has agreed to. The committee has agreed to. On the adoption of the resolution the a's are 47 the nays are 5 this resolution have a state directs the constitution majority is therefore adopted by the. Section read S.R. 245. Senate resolution 245 by senator Goodyear the 51st and others resolution commending dead columns and further purposes and Mr. President's and the chairman's military and home wants to recognize this resolution to pass which is submitted. Senator pain chairman that completes the order Mr. President. We're going to ask the majority later. No George nor George girls basketball team may since championship game they almost won almost no one recognize them today. I was about to Mr. President but maybe later today. Senator senator resolution 245 is a resolution honor in one of our previous members to the House of Representatives here in the. He just been nominated to be the secretary of the veterans of fairs up in Washington D.C. He was confirmed by the Senate on February 4th 2025 and that man's name is Doug Collins Doug Collins is no stranger to many of us in this room. Stuck Terry Collins graduated from North Hall high school and he later went to North Georgia college in D'Lanaga where he attended school there and graduated with the class of 1988. Receive a master's degree in divinity from the New Orleans Baptist theological seminary. He served in the United States Air Force reserves where he was promoted to the rank of Colonel and served as a chaplain in Iraq in the Iraqi combat zones. Collins has worked tirelessly to open access to health care, expand mental health services and improve accountability within the VA champion the needs of veterans and their families. Secretary Collins represented Georgia State House District 27 and later the Georgia's 9th congressional district. He played a pivotal role in shaping national policies including the bipartisan first step act which reduced reincarnation, re incarceration and enhanced public safety for nonviolent offenders. Collins is the first Iraqi war veteran to serve as Secretary of the Veterans Affairs. His vision for veterans care is rooted in his life as a military veteran ensuring world class care for our American heroes. With this resolution today we properly recognize him as a dedicated public servant and we commend him for his recent nomination. Now I know many of you will vote for this resolution. I hope that we all will. This sends a strong message that one of our own Georgians is up in Washington DC working hard on behalf of all Americans and especially our veterans who have served our country who have put their lives on the limb. We continue to support our veterans and that's what this vote is today is a vote for our veterans and it's a vote for our Secretary Doug Collins. Mr. President I'm happy to take any questions but I encourage everyone to vote for this resolution. You have no questions Senator. Thank you very much. Senator is yielded. I know there's several senators will like to speak on this resolution. Recognize senator from the 10th. Thank you Mr. President and and and members of this body. Let me just say and fatically that I rise today in support of Senate resolution 245. I wish former Congressman Doug Collins well in his new position as Secretary of Veteran Affairs. But this moment gives me an opportunity to talk about a conversation that I think we all need to have in this chamber. And I know it's an uncomfortable conversation but I want to get it started right now because we need to recognize that in this country our veterans are under attack. And I'm going to pause for a moment and just let that sink in with everyone. We have to recognize that at this moment in our country our veterans are under attack. And I can say that because throughout my history and my family's history all of us have served in the military. As a matter of fact my son who will be here soon as the past of the day serves in the military currently as well he's in an avi. But the reason why I say I veterans are under attack is because 30% of the workforce in this country are veterans. Any time there's a layoff you can expect 30% of those particularly in our federal government to be veterans. I would also share with you that it's really really difficult for a career service member who served all of his life certainly at least 20 as some of us say in the military to find a job because the federal government has always been that employer of first resort. They always look to hire military veterans. As a matter of fact college, DEI, whatever you want it was a preference of treatment for the federal government to hire military veterans. Some of you in here like myself who served 19 years in the service thank God most of you in reserve but I was ready to fight and go if I had to an army corps of engineers. The federal government now particularly in veterans affairs has already laid off well over 6,000 veterans. As a matter of fact there's reports that President Trump has slated to decrease the employment in the veterans ranks to the tune of well over 80,000 people that work for Department of Veterans Affairs over 80,000 people. Guarantee 30% of them are going to be veterans. I don't think in this war on our veterans that some of us in here really understand what the life is like for a veteran. You know I was safe because I stayed stay side but let me tell you what life was like for my older brother. He's only three years older than I am who I buried last year from blood cancer and bone cancer. Because he drank the water at Camp Le Jun up in North Carolina. My brother spent 27 years as a dedicated service member of the army. The only thing he ever wanted to do from high school was serve in the military and he did and he did it well. My brother was decorated first sergeant rose to the rank of first sergeant. He even told me he said, brother little brothers he called me. I actually became a sergeant major but then I got busted because when military members over 18,000 had some transactions every time. And he did too. But when he retired after almost 30 years of service he was a first sergeant. My brother from the time that he came back home had a problem finding a job. The federal government was just employer of last resort. You see the federal government make allowances for veterans because they know that he has skills in learning how to shoot weapons and to blow stuff up as I said. He didn't have the best formal education some military veterans do. He didn't but he was a great soldier and my brother knew how to take order. If you ask him to do something he was bowler and he got it accomplished. You see my brother was not just my oldest brother he's the one who took care of me after I was orphaned at 11 years old. And I remember when he signed up for the service early on in his career but he said we got my oldest sister is going to be here with you until you grow. He gave his entire life to this country and he died such a harbored death because bouncing around between him university and eventually on. Ventilator over at. The VA hospital that's now facing those same courts same cuts. Which happens to be off the clear my road in my district. Just imagine that this time last year I was at the VA hospital watching my brother as his machine was doing the breathing for him. Knowing that the only thing that he had was that government job that he had been given once he retired from the military. He had a check but military service members won't lot more than a check they want dignity they want to be respected when they come back to this country knowing that they fought and as my brother did in over five different theaters of war. You see in this country we have a declared war but we fight so many other wars that we don't even declare. We just called him theaters of war sometimes we even call him skirmishes or we may even give him the name like war and terrorism. It doesn't matter psychologically it has the same effect on those who go out and fight and represent this country. It's my hope that congressman Doug Collins will understand him having won the uniform the importance of giving our service members preference to treatment when it comes to higher. It's my hope that congressman Doug Collins former congressman Doug Collins will protect our service members. I know at this time in the age in this country we need warriors up there and I pray that Doug Collins will be one of those warriors for our veterans because we can't let those come in and indiscriminately get rid of them. Our service members are much more than a number they are so much more than a number they have protected our freedoms America would not be what it is they had it not been for those that serve. I'm not going to get up here and tell you all these names but I can go on and on about the importance of their service to our country. And those of you in here that's one of uniform you know what I'm talking about. Mr. President it is my hope and not just my hope that my prayer that this country this president we understand the importance of service. Someone who never wore a uniform himself and the importance that our veterans gave this country a year to a. I recognize senator from the 49th speak to them. Thank you Mr. President I went over this morning and I talked to the majority leader for just a second and I asked him to put a couple points in his speech about former congressman Collins and our new secretary and he told me he thought it would be appropriate for me to come up here and talk about the secretary. I can't say enough about about Doug I want to refer to him as Doug for a couple minutes here. If I had to you know I'm sure all of us have some favorite constituents if I had to if I had to pick five he would land in the top five. The secretary has been so good to me and my family my entire life even as I was a young child. His wife grew up what we call a stones throw away from away from my grandparents and as secretary and Lisa dated they were oftentimes visiting my grandparents and befriending them. He is about as fair of a man as I know he has worked tirelessly for our community there in Gainesville and Hall County for years. Like was mentioned here at the state house and then up in DC and he just you know as a young man and a young married couple shelly and I would go up to DC and lobby on behalf of agriculture and the things that were important to us and he always listen and he didn't always agree with us but he always listen. He always talked to us and he wanted to understand. He was when he got to DC he wasn't an expert by no means on H2A workers coming over here to help American farmers but he made himself an expert on that because it was important to shelly and myself. As most of y'all know this time of year you probably get to see in the news our peaches all over the state of Georgia they're blooming right now and they're at a very fragile stage of production. We get a cold morning right here and we're liable to lose a crop overnight. Anybody from north Georgia all the way to to middle Georgia South Georgia we're kind of in a little a tight spot for the next couple weeks at every single time that there's a forecast of cold weather I'll get a text messages from from secretary. Hey we're praying for you on those cold mornings about six o'clock it'll be twenty eight twenty nine degrees and I get another text message says hey how you doing well is still below still below freezing so we don't know yet. Congressman but but you'll be one of the first ones to know. I can't say enough about about the secretary I know that that he's going to lead the veterans affairs like he's led and cared for folks of his life. We were just recently my grandfather died about a little over a year ago and we're going through some pictures and he just showed up in so many family pictures. Over and over and over again tall skinny man but he was all we would have a picnic while the peaches were blooming and he was just always talking to the different family members and different members of the community making them feel so so very important. Colleagues I ask for you guys to support this resolution and I want to thank them senator from the fifty first for fifty first for bringing this I think is very important I'm just a little bit mad that I didn't bring it but thank you miss president I yield well. Thank you senator from the fourteen. Thank you mr. President the year twenty twelve I took a year off in the middle of law school which is a strange decision and I lived for most of that year in Nashville Tennessee I should say east of Nashville near the airport about a twenty minute drive from town and I rented a room in an apartment I found on Craigslist. Two conservative owners of the property who rented me a room they asked me at the beginning to pay two fifty plus variable utilities or three hundred twenty five dollars I said I'll take the flat rate just to avoid the risk of conflict every night we watch Fox News I sound couch I drank in the information and there was a lot of railing against government these are kind people I've spent the twenty twelve election night with those folks they were drinking for one reason I was drinking. I was drinking for another but they were very kind to me they welcomed me into their home we'll live there for several months. While Fox News was blaring on the TV about government size of government efficiency of government the only fixture on the dining room table of this household was a veterans benefits manual. Before the iconic quote from yesterday keep your blank government hands off my Medicare we all know that there is a gulf of understanding between the general concept of government efficiency and then on the ground the way that those details play out when real people receive real benefits and we're watching that play out again if you had passed this resolution earlier in session I would have voted for I voted for the resolution to proceed out of committee. I think I may have even made the motion or second motion. The reason I'm not going to vote for it today is because unfortunately secretary Collins has shown us the trajectory he's going to take. I listen to a bunch of hearings in the off season the veterans committee held jointly with the House about benefits application for disability benefits big conversation that we can debate reasonably over whether to allow private entities to charge a fee to veterans to allow them to apply for benefits why everyone's railing on the V. A. everybody agrees the V. A. under serves the veterans population and that's at current levels of funding and staffing. Now of course the last few years several tens of thousands of employees were added to the V. A. to address things like burn pits there was new relief for people exposed to burn pits those claims needed to be processed. But in general you can't keep up with the pace of the demand and the need that is created for our veterans after they give in some cases everything but for a lot of our surviving veterans most is what they've given. Unfortunately secretary Collins has decided that he is a card carrying member of the Doge crew that he is on board with 80,000 cuts at least 25% of the V. A.'s work for the V. A. So it's the jobs at the V. A. but it's also the services that veterans receive their complaints about wait times long wait times for care. Do we think that further slashing staffing is going to make those wait times any shorter natural logic common sense suggests that they will be longer if there's fewer people to fill the need than they're already work. And the secretary has sort of huge to that messaging that I described a minute ago that was on TV in Nashville Fox News big government can't trust it Biden Biden Biden shrink the workforce. But the town halls that some Republicans are going to and some are not are already reflecting what veterans think about these cuts veterans showing up and saying you don't give a blank about me. And how easy is it to do messaging about veterans how easy is it for any of us to stand up here and say we're doing it for the veterans are veterans matter. What are we doing about veterans post traumatic stress what are we doing about persistent disability and those wait times what are we actually doing with the only offer that the current administration is making them now amplified by secretary Collins is slash and burn. And it's insult Andrew that a bunch of 20 some year old tech rose with the on musk of the ones who are doing it. Secretary Collins has a long story history of public service in this building and in this state. I also happen to love the picture of him hugging state. That's the whole conversation. He's a public servant he deserves to be commended for his history of public service and I would have voted for that. But our voters are demanding more of us right now. Public opinion has shifted used to be independence during the first term administration independence wanted Democrats in minority to work with Republicans cooperate. The level of change the speed of change that is happening after government right now has switched that alignment independent voters recent poll now want the opposition to fight the Republican majority agenda in Washington. Because they see what's happening they see how destructive it is they see how untethered from logic and the actual need of people like veterans that the change is. And they're not for it. All right, I need Secretary Collins to do more right now. I need him to actually fight for veterans and not salute the doge flag and advance the interests unquestioningly of the doge team in dismantling government. That is on your kitchen table. But the Fox News is saying you got a drown in a bathtub. And that's why we're not talking about the drivel coming out of cable news. So with respect for Congressman Collins's history I respectfully rise in opposition resolution. Thanks Mr. President. Senator Gilder, any other senator which speak for against resolution? The one object. Resolution forward. Here's none. Is there objection to agree to the forward committee which is failed to the passage of the resolution. Here's none. The forward committee's agreed to. Is there objection? The main question being ordered. Chair, here's none. The main question is ordered. Questions only. The resolution. All those in favor vote. Yay. All those nice secretary and a lot of their students. Thank you. And this resolution has received requisite constitutional majority. Sixth day read. SR 246. Senator resolution 246. Senator Gilder, any other resolution commending president Donald J. Trump and brother purposes. Mr. President, the same way the rules recommended this resolution to pass. Mr. Secretary of State, Mr. Brost, Chairman, Mr. President, minority court, Mr. Senator resolution 246 has been attached. The same way the rules recommended this resolution to pass. Mr. Secretary, please do order, Mr. President. Bring it as the majority leader. Thank you, Mr. President. Senator, thank you for that vote on that previous resolution. I appreciate the bipartisan ship support. I hope we'll get that in this one as well. I have hope. Just as you should have hope for this country. And I hope by now you're looking at what I'm seeing on the screen, which indicates a problem in our nation. And I would say it's more than a problem. I say it's a crisis. It's a crisis in our country and our government that was not started last year. It wasn't started four years ago or even 20 years ago. But it's a crisis that we, the people, are fed up with and what's going on in our government, especially at the national level. Now, obviously, we balanced our budgets in Georgia. Thank goodness we have a constitution that requires that. But the people in Washington, D.C., that are running in our country, don't understand what a balanced budget looks like. And I think it was 1992, not time frame when President Bill Clinton was president, New Ganger, he's the Republican street for the House, worked together. That's a strange word that we work together to balance our budget. We just look at the numbers rolling off the screen behind me. That is our future. That is the future of our children and our grandchildren. That's the future of our nation, but it's also the future of the world because the world cleans on us. So what do we need to fix it? We need a strong leader in the White House. And I do believe we have a strong leader in the White House today. It's the 45th and 47th president of the United States, Donald J. Trump. He was elected last November in a large margin. Not only did he win the electoral college vote, but he won the majority vote and the popular vote in our nation. He was the second candidate in American history to be elected to the White House in two non-consecative terms. He has appointed and nominated a record number of women, minorities, young adults, and individuals from diverse backgrounds to key leadership positions in the White House and the federal court system. Approximately 45% of his cabinet appointees have been women so far. Over 200 federal judges enjoy including 54 appellate judges in three Supreme Court justices who will influence our judicial system for decades to come.\n\nHe has sealed the southern border of this nation to keep out criminals and terrorists keeping our community safer. Let's just talk about the drug problem in our nation, where 21,000 pounds of fentanyl was confiscated at the border prior to him being reinstated as president in January. This is enough fentanyl to kill four billion people, four billion people. This explains why fentanyl was the leading cause of drug overdose deaths since 2021 under the Biden administration. Imagine how much of the deadly substance is flowing into the streets of Georgia today in this state, in this city. Imagine what it's doing to our young people. But thanks to President Trump, illegal border crossings have fallen 71% since January of this year. The invasion and the poisoning of our country has to end. Under President Trump's first term, we had a thriving economy. The real median income rose by over $6,400. For the bottom 50% of households average wealth in this country more than doubled. He delivered the largest tax cut in American history for working families. Already in his second term, he's done great things. He remains committed to economic prosperity. President Trump continues to promise to slash taxes to extend the American worker tax cuts and he's already slowing inflation just in the last eight weeks. This February, the Consumer Processing Decks only rose half of what it did under Biden, 0.2% versus 0.5%. He led the US into energy independence for the first time in over 60 years under his first term with initiatives like the Keystone XL and the Dakota Access Pipeline Project. In only three years, domestic oil production increased by an incredible 47%. And the Pricigastoline, remember the Pricigastoline when he left office, was a record $1.87 per gallon. It is highly fitting that this resolution be presented to you guys today. And I hope that this body will join me and commend the pro-American policies. And we commend President Donald Trump who has gained the confidence of millions and millions of American voters and workers. Mr. President, I'm going to stop. We could talk about this man for the next four hours. And I'm sure there'll be others that'll come up and try to dispute some of the things that I've said. But, gentlemen and ladies, we need an America first policy that will move this country back in the right direction. We need policies in Washington that will slow down the rapid growth of debt that you saw on the board behind me this morning. You heard from Congressman McCormick this morning, if you were listening to what he said, he said that the interest only on the national debt in this country is more per year than we spend defending our borders and our country in the U.S. military. Let that sink in. The interest expense for our debt is more than we spend on the military in the United States. That is not sustainable. It cannot continue. Hard decisions are going to have to be made by Democrats and Republicans. Bipartisanship is the only way to fix this solution. And I believe the leader of that White House that's in office today, Donald Trump is the person that can get it done. And the American people spoke loudly November 5th. We need to support his policies. We need to move forward to make America great again. Mr. President, I'm happy to take questions or I'll yield the will. You do have a couple questions, Senator. We're going to have Senator from the 26th. From Megan Georgia. Tuskegee University alum. How you want to go the way I'm sorry Senator. All right. Senator from 14th. Thank you Mr. President. This is the leader yield. I will for you. Leader, thank you. There are some news coverage back. I think around March 2023 that Florida Governor Ron DeSantis had visited Georgia and that you were very impressed with him. Was that accurate news reporting at that time? I am very impressed with the Governor of Florida. Okay. Senator further yield. I do. Okay. There was some further news reporting in roughly January of 2024 that when Ron DeSantis had dropped out of the presidential primary that a long list of Georgia state legislators then endorsed Trump basically immediately, President Trump. And you were on that list. Is that also accurate reporting? I think I've been on the list for President Trump for many times, many years. Senator, yield for one last question. I do. Does the fact that Ron DeSantis had to drop out of the race before you endorsed the President imply that you supported Ron DeSantis over President Trump up until January 2024? No. So in fact when Governor DeSantis visited the state Capitol back three or four years ago, he was just the Governor of the state. He was not a declared candidate nor did he even discuss running for office other than Governor at the time. So he met with the entire Republican caucus that day and we all listened to him and loved some of the things that he did in our state below us, our neighboring state, including lawsuit reform which he's led on many other issues and he's done a great job. So we believe he's done a great job for the state of Florida. They eliminated their income tax which we should be doing here as well. So I support any Republican governor that can bring those counsel results to their state and I look forward to doing some of those things here in Georgia in the future. One final question. Senator Siseric. How many commending resolutions and license plate bills do you think it would take to establish loyalty to the current President that he would believe? That is a very unusual question. I appreciate your support and help trying to get that last late past last year. Unfortunately the House did not have time to take it up but I feel encouraged that this year they they will put America first and we will get that to the governor's this for signature. Thank you thank you for your help on that. You have the bill you have the floor and ask for your favorable consideration to this important piece of legislation. The Senator has yielded. There is a lot of folks signed up to talk here. You know I think I could take the good wager and know exactly how this vote is going to go. But I'm not a bad man that's correct. I'm kind of from 36. But you know we've had this debate before and it is one o'clock so but if everybody wants to get the pound of flesh in I guess we let it go. But we've got some amendments here. Secretary the amendments. Mr. President Senator Mara the 9th and others offer the following amendment number 1 to amend Senate Reuters' solution 246 by inserting after 134 of following whereas millions of senior citizens will be for Donald Trump. President Trump must prevent those seniors from falling into poverty by protecting social security and Medicare from devastating those commission cuts Mr. President that completes the order. Mr. President Senator Jones of the 10th offers the following amendment number 2 to amend Senate Reuters' solution 246 by inserting before line 35 of following whereas President Trump routinely declares his love for veterans. His action should match his words and protect the 8000 VA staffers from termination to respect the health and safety of veterans and Georgia across the United States. Mr. President Senator McLean of the 14th and others offer the following amendment number 3 to amend Senate Reuters' solution 246 by inserting after line 30 whereas President Trump's supporters want him to explore whether there is a legal option for him to run for a third term and that would be the order Mr. President. Mr. President Senator Jones of the 14th and others offer the following amendment number to amend Senate Reuters' solution 246 by inserting after line 35 of following whereas President Trump's supporters want him to explore the health and safety of veterans and Georgia across the United States. Thank you Mr. President. First I rise today just to ask some simple questions what does this room in what does this resolution actually serve? The only time that a resolution like this was passed in 2017 when this body did the exact same thing when Trump was elected the first time and when matched up against presidents in my lifetime both them and Republican I don't see the need or the word in this for him to have any type of acknowledgement or recognition we've actually fired him during his last presidency and even when we did change hands over to Biden and Barack and George W. Bush there wasn't some victory lap that need to be made you know Bush didn't ask one Barack didn't ask one none came through this body before but somehow there seems to be a need to keep lifting up a president that basically conjured his way back into the White House and I'm going to put this aside for a moment and that maybe this is some earnest homage homage to their president put forward in some serious meaningful way for consideration but if Donald Trump deserves to be commended for anything is how exceptional he is at being the worst president of all time and I think that will pan out somewhere around 2026 when people realize everything all the cuts the job cuts that the economy has it gotten better it's going to happen somewhere around the the mid-marked 2026 and it takes an elite level of erratic behavior to crash a stock market by over a thousand points in one day it shows real business talent to randomly fire people and then realize you messed up so you got to go desperately hire them back because they were actually doing important work to keep everyone safe keeper food safe you know federal employees that have spent their lifetime keeping us safe defending the the institutions that that keep our nation going and the actions we've seen lately they have cost American households millions of dollars in savings investments and value not to mention jobs we can't hit that enough Trump has you know Trump used to always talk about deep state but Trump has created a deep state that all of you are so afraid of and is died and back to the center from the 26 if you scare say you scared you're scared you're scared of your seat you're scared to push back sad but that does not mean you need to concede to the policies that I think would ultimately hurt many of your districts and your constituents and by conceding to dodge a doge I'm sorry it's a dodge or it's doge it looks like dodge the car which you know it's car it's a whole nother thing by doing so he's handed the presidency over to a shadow government of billionaires filled with people who are stealing from working families ruin our lives and opening up our government to ideology it looks very closely to some white supremacist ideologies and no other president has done that before or attached themselves to so many divisive policies like this this resolution states that Trump has appointed and nominated a record number of women and minorities and individuals from all ranges of backgrounds and key leadership in key leadership positions I haven't really seen that but I will talk about his efforts to dismantle the history of black veterans from our military institutions the DEI attack on black Americans in the advances that we have made what about his efforts to rip programming from schools for allowing students from clubs to celebrate their backgrounds we had a bill here that was an exact replica of what Trump policies are trying to do take the diversity away from our schools and punishing our schools who would like to celebrate that diversity and teach that diversity and it's also interesting that this resolution doesn't mention his personal character I think what bothers me that he's conscious way back into the white house we keep forgetting the character flaws and that's probably because the majority party doesn't want to defend like insane statements about racial minority groups immigrants people with disabilities or various other insults to certain populations and let's not forget that he is a convicted felon convicted felon our white house maybe you know majority party doesn't want to be associated with his horrific treatment of women and to be clear you voting for this resolution you're committing a sex offender you just found liable for sexual abuse and brag about about assaulting women this is the person we're committing today under this resolution I think we're in an unprecedented moment where we're not taking the full history of someone who is and who will continue to create chaos division and harm to working families to women to our institutions and sadly is reflective of the state of this majority party in this chamber and to speak to my amendment you know I have in my district a really huge population of seniors that are worried about their social security they worry about their Medicare I've been calls and emails that they are concerned so the point of my amendment here was insert to prevent those seniors and to protect them and I think if we're going to put this in the resolution let's go ahead and pass let's go ahead and insert my amendment here I think we should just be mindful and think carefully about who we're praising in the chamber why we're spending time praising I get that your side of the aisle is happy he won but there are also a number of constituents that are in fear right now that are concerned right now that are tired of the chaos and to me that is not a reflective of a president that we should be honoring and with that Mr. President I yield well all right senator New Zealand senator from 44th you you got to follow nitsary inquiring yes Mr. President I'd like to ask for unanimous consent to excuse the senator from the 34th for business inside the capital without Jackson's senator from 34th is excused all right amendment number two right now as the senator from the 10th speech had no limit number two Mr. President Secretary one a while away Senator from the 10th Mr. President of the 7th of the 37th offers the following amendment number one age to amend amendment one to send a resolution 246 by striking online six and seven of following from devastating doge commission cuts Mr. President the complete stewarder senator from the 14th would you like to come speak to your amendments that's sort of why I can find the senator from the 10th to speak to his just too late senator from the 14th speak to your amendment thank you Mr. President my amendment is pretty simple it just adds a factual statement to the resolution that many of President Trump's supporters would like him to explore a legal option to see if he can run for a third term now that's without prejudice to whether he can or not I have my own legal opinions about that so does the entirety of the constitutional law section of the bar but I know that some of his supporters at least want y'all to look into it so if you are opposed to letting him look into it you know you can vote no in general I think that this bit the resolution I mean I kind of made my point from the from my seat earlier but look I'll just do the the age old trick of quoting the chaplain of the days words back to you he warned you about appearances he said appearances will take care of themselves that God cares a lot less about appearances and the outward life than he cares about the inner life I wrote down all his notes but in the rush to come up here I forgot to get his exact quotes but I think he was very clear I mean this is the character poster on the wall that says your thoughts become your words your words become your actions become your habits become your character and I think that this country has decided to sort of cauterize the wound of learning what President Trump's character really was back in 2016 when we were initially horrified by the access Hollywood tape and what he said you could do to women just to grab them a lot of Gen Z voters are not even aware that that tape existed because the country has so thoroughly moved on from the initial revelations about how bad President Trump's character is that most people decided it's just business as usual look I can't even get a good audience for Trump warning news anymore I mean the main reason for that I think well A my content has deteriorated in quality probably but B it's that we have so become routine eyes you know that we've become accustomed to this routine torrent of news that the administration's violating corridors firing veterans firing nuclear weapons stockpile managers then trying to hire them back firing the bird flu people they were like what's new it's not really new so all of our animal brains have adapted because it's just business as usual let's hope that this business as usual mindset doesn't carry us into a place where the administration violates not just district corridors but Supreme Court orders where the administration cracks down on protests in ways of becoming increasingly violent you know that basically the administration decides to pursue unpopular policies unpopular approaches but then tinker with election processes to stay in power let's just hope that doesn't happen a sure hope y'all know what you're doing Mr. President I'll yield for questions do you have a couple questions centered from the 26 are you on to ask question or thank you much president the gentleman the way out here I yielded the distinguished legislator 50 years in it true that Elon Musk took a contract for the rise of a billion dollars without a beat that's correct senator what appears to be happening is that Elon Musk as part of his quote efficiency effort is taking actions to dismantle agencies that have regulated him directly and he is also taking action against competitor contracts and viewing them as hostile there are a lot of fancy political science words described what's happening but the gist of it is just that it boils down to the personality of one man president Donald Trump and the billionaire the unelected unappointed billionaire who he has put in position to dismantle as much of the federal government as he wants with the gentleman further you I further yield in it true that the French society Arabian killed the journalist coach and the intern around and and lend three billion dollars to Jerry Kushner's the president's time alone senator I think if you throw a rock near the Trump family you will hit a billion dollar contract that Kushner or his associates are trying to obtain from a foreign government senator from the 36 thank you mr. president does the senator you I do senator uh just a couple of questions and um uh know that you're a big consumer of the latest late breaking new developments on the national thing the carnage that we're witnessing unfortunately uh and uh in light of that I ask you if you were had the opportunity to see any of the uh president remarks when he spoke from or than hour to the justice department of the last several days senator it's all blur to me at this point and I do my best to vomit the news when I come up here please enlighten me with a question form if you'd like that thank you isn't it true that we witnessed live and in person for the employees at the justice department uh but uh all across the various news outlets that this president stated that CNN and MSNBC are just political operatives for the democratic party and further than he thinks they're illegal and they should be shut down senator uh president and trump has a long history spanking back almost a decade now referring to news media as the enemy of the people to talking about opening up libel laws to essentially chill legitimate press activity and speech by his detractors and his second administration he has accelerated that view of media the fourth of state and other institutions such that for example under the unitary executive theory he has decided the DOJ or his own personal lawyers even putting one of his own personal lawyers then at the US Department of Justice US Attorney's Office in Washington DC who is sending scare letters to private institutions threatening them to remove their DEI programs among saying he will look into individuals who trump think he's being treated unfairly by so president trump's history over the last decade and further than that has been a long and boisterous campaign of discrediting his detractors discrediting traditional institutions like media and independent agencies of government and bending basically every power that he can find towards the satisfaction of his own personal whims i hope that it answers your question senator that's a rather full and extended response and my final question is how long is it going to take do you think before uh countless members of the republican party that we know and are in relationship with uh attend church with uh do business with appreciate here on the floor of our chamber how long how long will it take what what line has to be crossed is when CNN is shut down MSNBC when the studios are taking over is it is it when more people are snatched at midnight from their homes and put on planes senator can i be candid i mean it wasn't enough when president trump mocked a disabled reporter it wasn't enough when he pardoned thousands of in some cases very violent January 6th rioters it wasn't enough uh when he said that he doesn't like people who get captured as prisoners of war because there's essentially suckers and losers it wasn't enough when he called american cities and foreign countries words i can't say from the well it wasn't enough when the access Hollywood tape said grab women by the you know what uh it wasn't enough when he appointed a wrestling superstar to the department of education to unconstitutionally dismantled notwithstanding all the federal money that supposedly we care about the state level it comes as states we talk about a special session for tour reform let's talk about a special session to restore lost tens of billions of dollars in the event that federal government gets its way right now and cuts off all manner of contracts and funding to the states i sincerely believe and i wish i weren't in a position to have to say this that the republican party and the american people are not going to wake up until there is a trauma a tragedy in this country that is way worse than covid you thought a million people dying was bad and when until people's pocketbooks are hit not just marginally by tariffs but dramatically if we enter another big recession uh if all the veterans you know some of whom voted for president trump lose their jobs lose their access to health care that the pain level is going to have to increase exponentially until we finally believe what the chaplain said this morning from the dius which is that your words become your actions become your habits become your character until we finally see materialize that is profound malignant narcissism that has been on display for decades is going to translate into me centered policies that enrich billionaires and oligarchs at the expense of everybody that trump couldn't give less of a whatever about it's going to take that level of pain before this country gets to a point where it says we cannot indulge this illusion that this self-made billionaire who actually got money from daddy and his stepped on every contractor the person who's ever gotten in his way is actually not here to help you senator thank you senator thank you with that mr. president yield the wall senator from the camp i believe you had an amendment he likes to be to that amendment\n\nSenator from the town. Floor is yours. He's starting to act like a congressman. You know that. Thank you, Mr. President. I am certainly asking for everyone's support on this amendment. It's a fairly innocuous amendment. And it's a way of protecting our veterans. And if there's no questions, Mr. President, I'll leave it here to well and encourage all of you to please support our veterans across this great country. They don't need our support. Thank you. Senator from 37th, I understand you're birthday today. Well, happy birthday. Come on down. Talk about your amendment. Mr. President, I'm going to send it to Senator to 46. Amendment number one, I think, is something we want to divide the question on. The senator who offers this recognizes that millions of senior citizens voted for President Trump. And one of the things President Trump sought to do and running for President to recognize that senior citizens for their lives have invested their own dollars in the social security system. They've invested their own dollars in Medicare for the expectation that it would be there for them. And I think that's something the President recognizes and has never been in question. But what's raised here in line 6 and 7 of the amendment is, I think, wrong. The senator who offers the amendment adds to that, the rally that President Trump championed protecting social security for people, adds the words from devastating Doge commission cuts. Now, that, my friends, is not true. That is a false premise. I will tell you that in spite of the fact that President Trump stands behind protecting social security and Medicare for those who paid into the system an expected fair return for it, we do have $36 trillion of national debt. The Doge commission is trying to do good work. In spite of the, some of the hyperbole this raised in spite of some of the turbulence that's being generated by those that aren't happy with some of the decisions being made, the work, the proposition of the Doge commission to bring government efficiency to a government that is more than $1 trillion in debt, that every year on an accelerating basis in a nation that every single citizen has $100,000 of federal debt attached to them. People, a family of six, has $600,000 of the debt attached to their family because the rising federal debt the Doge commission has a noble charge in charge of it which is taken very seriously. So Mr. President, offering an amendment 1A is to simply strike the words at the end of amendment 1 that says from devastating Doge commission cuts, I mean, recognize as the amendment 1 would, that President from what elected about millions of seniors and that he is committed to protecting Social Security and Medicare for those who've paid into it and deserve a fair return. Mr. President, we'd like to take questions. I recognize Senator from the 40th Arts. Thank you, Mr. President. Senator, do you yield? I do. Senator, based on the amendment that we have in front of it, it seems like you do you agree that we need to protect seniors, Medicare and such a security deal. Not only do I agree with that, but President Trump agrees with that. Okay, and so do you support the Doge commission cutting Medicare and Social Security in any way? I believe the Doge commission should look at every turn of every rock government if there's waste within our Social Security administration if the bureaucracy, if the minister of Social Security can be administered more effectively to cut costs and allow more returns to go back to seniors who've paid into it their entire working lives and deserve a fair investment. I think we should absolutely look at it, but I think the premise that President Trump looking to undermine the benefits that come to seniors is a false premise. And I think amendment 1 is offered by the center for the ninth sort of mispertraise and sort of mischaracterizes it. Defertherio? So would you be in favor of Doge doing devastating cuts to Social Security and Medicare? Because I think what the amendment says that we want to make sure that the President does not allow Doge to provide devastating cuts to Social Security and Medicare. So by striking that, do you support Doge doing devastating cuts to Social Security and Medicare? Appreciate the question, of course not. I think the language from devastating Doge commission cuts is a false premise. I think it supports the false narrative that Doge is looking under every rock of the federal government looking for ways to achieve efficiency to better serve Americans is going to lead to devastating cuts to think of the false premise. And I think adopting 1A recognizes that President Trump was elected by millions of Americans and should prevent them from falling into poverty. And I think that's something that the President ran on. I think millions of Americans, perhaps seniors who perhaps voted for other Democrats in the past, trusted President Trump to apply common sense and protect our nation's economy as opposed to the foolishness we saw coming out of California. And I think this, the language from devastating Doge commission cuts is a false premise that's deceptive and twists the very purpose that so many seniors, you know, supported President Trump because he's going to protect Social Security and Medicare and the donations they've made, the contributions they've made to it from their years of working and expected simple fair return. Thank you, Senator. Mr. President, come into your amendment 1A and yield the vote. I recognize Senator from 30th Street to the bill. Thank you, Mr. President. So I think it's funny that the minority party, I think Trump's been in office for maybe what, three months, almost three months and the minority party just gets up here and wants to erase the past like it never happened. It's kind of funny. At the same time, I think the minority party also forgets that blue collar Americans are the ones who build America. They also forget that iron workers raised skyscrapers in some of the largest cities in America. The minority party also forgets that auto workers gave Americans mobility and welders and machinists to put us on the moon and last on my check, many of those auto workers did not vote for President Biden. And for decades, politicians from both parties ignored these blue collar Americans. They outsourced their jobs to Mexico and China and told displaced workers how to go learn code. If you don't understand the appeal of Donald Trump, then you are one of those politicians. If you don't understand why blue collar workers want to put America first, it's because you fail to understand that their sons and daughters at fight our wars, they're not yours. Conservative Democrats used to understand these blue collar values. They used to represent these voters, but conservative Democrats have systematically eliminated them from their party by the liberal elites who push radical social policies. Donald Trump found these abandoned voters and gave them something to vote for. We took the blue collar worker agenda from the New Deal, got rid of the big government as we're doing now, and the entitlements, and we're putting citizens first. So for those that forget the accomplishments of the last three months, because there's news antidotes or we want to talk about the failures of the last four years, if we want to talk about America's failing and hurting, it's hurting because they've not been heard, they've not been listened to. The federal government has shoved rules and policies down their throats without having a say. Border security is the lowest it's ever been. It's down 94% from February, down 96% from the all-time high of the Biden administration. In one sector, illegal border crossings are down 99% over 2023, 99% over 2023. One of the single most issues that the minority party didn't want to defend ran from it, and now want to act like they want border security because they lost an election. The Lincoln Riley Act, we debated that here, American manufacturing, the United States gained 10,000 manufacturing jobs in President Trump's first full month in office, led by the auto sector, which came the most new jobs in 15 months. This will turn around after losing an average of 9,000 manufacturing jobs per month in the final month of the Biden administration. I guess we have them, Neeson, right? The minority party because that never happened. Rescuing Americans, President Trump secured the release of six American hostages, Evanna'suela, two Americans in Afghanistan, and American Israeli citizen and Hamas captivity, a Pennsylvania teacher in Russian captivity, and American citizen and Belarus bringing the total number of American hostages released close to 11 and more coming home. But we never hear that talked about, and oh, by the way, the minority parties doing such a good job, we can't even find our US senator when it's time to stand up for Israel and have that conversation. The Department of Treasury is sanctioning the international network of facilitating facilitating the shipments of millions of barrels of Iranian crude oil worth hundreds of millions of dollars to China. President Trump re-designated the Iran-backed Houthis as a foreign terrorist organization. Do we forget what the minority party and President Biden thought of Iran? They thought they were allies, right? Or somebody going to come up here and say that never happened. President Trump signed an executive order to reinstate with back pay US service members who were discharged under the militaries, Biden, Eureka, the 19 vaccine mandate. President Trump has done more for military veterans than some of us have seen in our lifetime, including my father who served in Vietnam with stationed in Korea, that some of the presidents going back to the 60s and 70s or even the 50s, based on our circumstances around the world. And last time I checked, I'm sure there were a lot more veterans that went to Trump rallies than Biden rallies. Cutting the bureaucratic red tape, I think it speaks just as my colleagues have talked about, we're cutting the government just as your president, President Clinton did back in the 90s where we're going to do better. The United States Army saw its highest recruitment numbers in 15 years since the election, the US Navy is on track for its highest recruitment numbers in two decades. The United States Air Force saw its highest recruitment numbers in 15 years in December, January, February, while the number of recruits in the late entry program is the month that's seen in nearly 10 years. Law enforcement, the Justice Department dismissed the Biden era lawsuits against police and fire departments over the use of standard aptitude test, witness test, credit checks in our hiring processes. In the disaster response, President Trump revitalized the effort by FEMA to rebuild areas of Western North Carolina that were ravaged by Hurricane Helene. President Trump overrode the environmental red tape limiting water available in California following the state's water failure system during the year's devastating wildfires. We forget already, I remember President Trump went to Los Angeles, went to Southern California, and the mayor of Los Angeles made all these promises to those residents, including the governor of California. How many of those residents have been able to build their homes back because they're being held back by the minority party and the Democrats who are running these states and running these local governments? President Trump administration has reopened the section of Interstate 40 recently in North Carolina in Tennessee, which has been destroyed during the hurricane three times faster and cheaper than expected. So as I close Mr. President, we're going to hear more myths about the Trump administration, we're going to talk about why was he defeated in 2020 when he came back with a record crushing electoral college victory across America this year. Because Americans demand more, they demand more than President hiding or sleeping in the basement of the White House. And we also need to hold a minority party accountable and also ask where is our U.S. Senator on these vital issues for Georgia. So Mr. President, I yield the will and ask for green to vote for this resolution commending the President of the United States. Senator Gilden, right now is Senator from the 35th. Thank you Mr. President. Thank you Mr. President. and the majority of the people in the administration are few and far-retuned, in fact, they're rare. And when you talk about women, the first president to set that record was Barack Obama. And Donald Trump just matched it far from saying, being able to say that it's record-breaking. And that's it. We cite the border, which colleagues, those numbers were going down already because President Biden had implemented border security measures that the president, a current president Trump, stopped, by the way, in the middle of the election cycle, because he wanted to make sure to win the election. Those measures were implemented, and we saw dramatic decline that the president now is now all of a sudden taking advantage of for his political advantage. And I also want to comment on the fact that we've heard about a record-breaking tax cut for working families. There was no record-breaking tax cut for working families. The tax cut from 2016 to 2017, and the tax cut that this president is trying to renew, was a tax cut for billionaires and millionaires, working families, those making, we could use a high bar, those making under $400,000, did not receive record-breaking tax cuts. In fact, when you put all of the tax cuts from 2017 into one bell and look at it, it was not even the top five in U.S. history for tax cuts, but it is one of the most expensive tax cuts, not benefiting those working families, but instead benefiting billionaires who the president feels like he owes a lot to for his election. colleagues, I want to make sure that on crystal clear on this, that decisions coming out of Washington under the Trump administration will leave a lasting negative impact on our economy, our institutions, and our communities right here in this state of Georgia. And what makes it even more troubling is the resounding silence that we've heard from Georgia's Republican leaders. Let's start with the Centers for Disease Control and Prevention. The CDC had quoted right here in Atlanta has long been a source of pride for our state. Yet the Trump administration recently slash more than 10% of its workforce, much of which is right here in Atlanta. 1300 Georgians lost their jobs. That's 1300 families that will be struggling to make ends meet right here in our backyard. And the ripple effect is undeniable from local businesses to our housing market. The economic toll is mounting. And then there's the devastating blow to biomedical research. The National Institutes of Health, which funds critical research at institutions like UGA, Godogs, GSU, and Milo-Modern and Marie University. These institutions are facing severe budget cuts. Over $780 million in funding, along with nearly 12,000 jobs. The groundbreaking medical advances that we've seen in Alzheimer's, cancer, and other terrible diseases, are at risk simply because the Trump administration chose to gut these investments in their fight against science. But it doesn't stop there. More than 170 Department of Education employees in Georgia are losing their jobs. Several hundred IRS employees in Georgia have lost their jobs. When we think about education, down at the local level, you have several hundred teachers from across this state who are going to Georgia State University have seen their funding in limbo. New teachers that were intended to fill teacher shortages across Metro Atlanta. And just when I thought it couldn't get any worse, the USDA delivered another gut punch, a food program, which provided Georgia districts with essential funds to purchase food directly grown by Georgia farmers, was cut over 900,000 children in our public school. Relied on those meals. Not only did this program ensure our kids had nutritious food on their plates at school, but it also supported our economy. And specifically, it supported our farmers in our ag economy. The USDA justified this decision by claiming that these programs were non-essential after the end of the pandemic. Y'all, the loss of this funding will increase food insecurity for our students while undermining the livelihoods of our farmers. At a time when the state's food banks are saying there's an all-time high in terms of need, including in South Georgia, where we have one of the most food insecure regions in the entire country. What's the purpose of these reckless cuts? Because if you told me it was to eliminate the trillions of dollars in deficit that the congressmen spoke about earlier today, then we could have an argument about it. If you told me that it was to close that deficit or to pay off the debt, then we might have an argument. If you told me that it was to redirect those supposed billions of dollars, which it turns out in reality is not as much, in savings to those in need, then we could have a debate. But no, the chainsaw that Elon Musk and Donald Trump are using is to support tax cuts for Elon Musk and Donald Trump. Many of whom donated billions of dollars to secure the election of Donald Trump. In fact, the House tax cut proposal that just came out a couple weeks ago would see an increased burden for working families. Think about that. Trump is doing this simply to repay his friends with a tax cut for putting him in office. So in the face of all this, I ask where are Georgia's Republican leaders? Because the silence is deafening. Not a word of protest, not a call to action, just a commendation. No attempts to stand up for hardworking Georgians. Instead, a resolution to commend the President for a so-called leadership. Let me be clear, there is nothing commendable about undermining working families. There is nothing commendable about cutting vital jobs across this state. There is nothing commendable about leaving Georgia's most vulnerable children without reliable meals. We cannot afford to stand highly by while the people we represent across this state suffer. It is time to call out these harmful decisions and demand accountability. Because the hardworking people of our state deserve leaders who will fight for our families, for our workers, for our farmers, and especially for our students. Leaders who understand that the strength of Georgia lies in the well-being of its people, not in empty political gestures, which seem to be coming out a lot from this chamber. So today, I am calling on all of us, whether you are Democrat or Republican, to stand together, and to demand that our representatives in Washington push back against these destructive decisions, and to ensure that Georgia's voice is heard loud and clear. Because we should be leading with courage and with integrity, both of which the president does not have. And the people of Georgia deserve nothing less than for us to stand up for them. Colleagues, this resolution is a complete waste of time, and I call on you to vote against it. Mr. President, I yield to you. Senators from the 21st, we are going to beat this same to death, I guess. We are just pushing back committee meetings as we sit. They should listen to me back in 2015. I will say, Mr. President, I will be quick. I want to thank the senator from the 51st for bringing this resolution. I support it. I appreciate you recognizing a great president, a great leader, and a great man. I want to thank the lieutenant governor who was the first elected official to support President Trump back in 2015. And in 2019, he introduced me to the president, and he ran his campaign in 2024. He was chairman of the campaign. I was chairman of a pack called Take Back, Georgia. And folks, I got to know the president. He loves our country. He loves his family. He loves law enforcement. He loves capitalism. I tell you what we did learn in 2020. Leadership matters, elections matter, and elections have consequences. We saw the disaster of the Biden administration. In this election in 2024, and the reason I fought so hard for President Trump is I laid it out. It was capitalism versus communism. It was law and order versus criminal chaos. And in the first two months of his administration, and hadn't been two months yet, law and order is back. Immigration is down, and capitalism is back. Because of President Trump's leadership, America is winning again. And Mr. President, I'll yield the will. Let's keep winning. Thank you. Senator from 26. Six. Would you like to round this thing off, or? I don't know. I don't know. You know, I'm not going to agree. You probably can't think you saved. I'm going to enjoy listening to it. Thank you, Mr. President. I tell you. And 50 years walking these holes in this Capitol. I've never seen anything like it. You see, I look at hindsight. What happened back then? It gives me the insight to move forward, which is foresight. And so if you don't have a history of what happened, then you don't have the insight to see how to go forward. Now here we're talking about a revolution. A convicted fellow, a rapist. And it's all right with you. You're talking about somebody. That cuts the Department of Education. I guess we go back to separate but equal. You talk about somebody who has it in oligod, like Poon God in Russia. This fails in what to do. How to cut it. He sends a sound light up, it blows up. And around the country, you close down the airport. It's called the plane. It can't take off. The debris is falling everywhere. But that's all right. You talk about what we saw on television. There ain't some somebody told us. About the insurrection at the Capitol. People being forced. People looking for pitch. And had a new side side that we're hanging.\n\nThe vice president. I don't talk about a man in the Oval Office who watched it on television. Children, his own children, the college said to Anna Tellum, the Lee, and he wouldn't do it. And he promised to do it on his three election. If he is elected on day one, I'll be dictator. That's what he said. Go back, get the record. And that's what he said. And now he tells us, if you don't do what I said do, this sun run with y'all, and we need to investigate you. But y'all have this big organization. Pray y'all that judges and decide who's going to be a judge. Or a federal judge. I forget what they call it. If my older days now I take memory of proof, try to remember what's going on. But yet instead we are up here debating this when we ought to be taking care of people's business. You talk about Biden. You didn't turn back that infrastructure money. That went through your books, education, Department of Transportation. You're not turning back. But old people are bad president. But you didn't talk about COVID when the president of the United States refused to listen to signs. So people being vaccinated. He fought it. Y'all forgot that? And people die. It's all about the money. That's all that's about it's about the money. We need a musk intake of billion dollar contract from Verizon and not even being on it. When Elon Musk considered judgment of those folks who tell him whether or not Tesla is right in the automobile business. A president that's 60 Justice Department on the folks who are picking in Elon Musk. What I tell you. In 50 years I've seen it all. And I'm telling you, hindsight, insight for a site. Again, I said all of you. You spoke to me and women of integrity. But yet you scared. If you're scared, definitely you're scared. So when the voters go to elect you, tell them I'm scared. Elon Musk said he would primary everybody that vote against Trump. Now that's what he said. When you had a border solution, a bipartisan border solution. And Trump told him not to vote for it. Let me tell you this from by the map. People come here for a better life. For 10 years I was in the bus transportation business. And I used to go to New Wave, Laredo, Texas to pick up migrant workers who were coming here to work these agriculture fields. And on every payday they would find Western Union to wire money back home. Caught their hands up in the wire back home cause it wouldn't make it very much where they were. And yet you talk about immigration. What's you going to do with the crops? Go let them side in the fields and right? We ain't picking them no more. We were the cheap labor. It would tell you something. I went to a peach field one. I'm from a tourist field. That's across the railroad track when you get the buy. And I went out with my cousin one day. The big peaches with a big, a big, a big old snake rep riding the tree. I left the field immediately. And I said to myself, I'm gonna get me a good education, a good one. And one day I would ride with my mom and dad. And so this elderly guy had a backpack on it. And she's like I am the dick. And I said, mom, dad, what's wrong with it? Son, he's walking with everything he own on his back. It's so I said to myself, I want to be somebody. And the only way you can be somebody is the work at it. And here we are. Talking about the president. They're 10 veterans. I'm going to privatize the nation of you here. You're not going to get the medical care that you deserve. And yet they fought for our freedom. I've never served in the military. In 1969, I was there playing cool and shooting cool with the veterans in the reg. Like the front out of school, got that leather to report. And went to the level depot. And people were standing lying naked. I saw some guys head. What an underwear was. Was some leaves. I saw guys twitching. And they're recruits. They're going, told me to bend over. I couldn't squat for so far. And they wanted to know why I had a zip on me. I had a knee operation playing football. You don't even have to worry about it. We ain't going to take you because you are disabilities. I'm trying to figure out playing football. I'm disability. Where we going in and having to pay for that bad knee you got when you go in the military. So let me say this to you. High on site, foresight, and inside. Y'all better realize what's happening. You are giving up your independence as an elected official. Where you run in front of the public. They say I'm going to try to see about your best interests. Not your own interests, but your best interests. So again, I say to you, if you scared, say you scared. All right, we're down to last speaker here. Senator from the 41st. Thank you, Mr. President. I rise today to talk about the constituents of Georgia's 41st district. My district, my two and the two and two, I do not represent the majority party. The fact are part of this minority party constituents who overwhelmingly at 85% voted for someone who is not currently the president. I rise to represent those folks, folks who I consider to be my people, my family. District 41 is perhaps one of the most diverse districts in the state with people from all walks of life representing countries and religions from all around the world of every economic status and occupation. They're fabric of Georgia who opens together with the beautiful colors of diversity. Arms wide open to inclusion for all. Diversity and inclusion. The foundation of district 41. And now those are forbidden words. The beautiful district of 41 is beautiful people of district 41. They are refugees and immigrants who spent years walking through our country's legal process to make Georgia their home and contribute to our economy. My people, they are doctors and scientists, they see workers who've dedicated their lives to keeping our country and the world healthy. My district, my constituents, our teachers and librarians who spend countless hours with our children loving them and helping them grow into kind and loving accepting adults. We are veterans who sacrifice so much to protect our communities. Those are the folks of my district. The beautiful people of district 41 who within hours of taking office face the devastating consequence of merely existing in our country. Who through the execution of executive orders have lost their jobs, have lost their homes, have lost their ability to teach our children, principles of inclusion and diversity and how to love their neighbors well. My constituents who have lost the feeling of safety and security and community, that has been the benchmark of our country's existence. And yet they haven't no longer. I rise in opposition to this resolution because it's a direct slap into the face of my constituents. This resolution celebrates the current president's claim of keeping community safe and ending the weaponization of the federal government. But it blatantly ignores the weeks and months of devastation that have plagued my constituents, my people, my district. The resolution symbolizes nothing but the callous indifference and outright contempt that the current administration has for those who have done nothing wrong. The refugees who face imprisonment and torture, the doctors and scientists who can no longer work to find life saving cures for childhood cancer, the veterans who were promised employment and are now facing job loss. The teachers who's training grants have been sliced. Students whose dreams of higher education have been squashed. Those are my constituents, my people, my family. District 41 is a rich and diverse tapestry of our state's most beautiful and beautiful and most resilient people. And I want to be clear that we will not slink away while this administration actively seeks to dismantle the very fabric of our being. We will continue to show up and speak out against the harms being acted by this current president. And we will survive and thrive despite it all. Because the people of District 41 and all of our colorful diversity, well, we will fight to the end to protect all of those who need a voice. So today and every day, I vote no on all legislation that seeks to reward harmful behavior at the expense of my constituents, my people and all Georgians with that I yield the well. Round it off with the minority report, send it from the second. Thank you, Mr. President. I'll be brief. Colleagues, I just draw your attention to line number seven where it talks about minorities and individuals from a wide range of backgrounds to key leadership position. Key leadership position is Mr. President. That is a juxtaposition to line 25 where the three Supreme Court justices that were appointed by President Trump none were African American. And so that is the juxtaposition to having this robust diversity. The opportunity to appoint a lifetime judge, I'm most certain that there are African American jurors that could serve on the Supreme Court that were and might be conservative. This we have seen in this administration because on March 4, 1789, the Supreme Court was created and they have only been sent 17893 African American Supreme Court justices appointed. So that is a juxtaposition. Line 12 talks about ending high inflation and making America the leading energy producer in the world. Mr. President, I would just ask the question to my colleagues and the majority. Then why are folks light bills sky high? Why are people paying more for energy if we are leading as an energy producer in the world? Lastly, Mr. President, lines 14 and 15 talks about executive orders and this also is a juxtaposition. It is very ironic to hear my colleagues and the majority talk about the use of executive orders when President Barack Obama was president. He was called an emperor for using executive orders and it was called an executive overreach and there was questions about the legality of President Barack Obama's executive orders and his use of such executive orders. The last thing that I will say as president as I get ready to round this off to go to my seat, the Chief Justice of the Supreme Court, John Roberts said, never have we ever used the ability to impeach sitting jurors based on a ruling that we don't like. We have an appellate court and an appellate process that we go through and use for that matter because there are three separate and distinct branches of government that is the legislative, that is the executive and that is the judiciary. If you don't like a ruling, then you go through the appellate process to challenge that ruling and the president has a majority on this Supreme Court. So if he wants to find out what that ruling is and he should take that case to the Supreme Court, that has been the process that we have followed since the architects of our republic wrote that we would all be created equal and we would have all these undeniable rights for life liberty and the pursuit of happiness. So Mr. President, I just asked that we be true to what we've said on paper because what's good for the goose is good for the gang and my grandma always told me I don't care who tell it and if you do tell a lot sometimes you have to tell two more lies so that that lie will have legs to get up and walk. And as I close Mr. President, if we truly, truly want to get to a democracy where everyone is treated equal, then we truly have to look at the things that are happening in our country and if you see something wrong, you have to say something, you have a moral obligation and it's a duty to speak up when you see injustices happening and to gut the federal government and put people without any jobs, without any rhyme or reason, it's not the American way, it's not American democracy, it's not who we are as Americans. We believe in due process. And so giving someone a 24-hour notice that they lose their job, well what if there helps go to the foreclosure? What if these things happen and you say we're going to cut in high-term programs? Well, Mr. President, I just leave you with this. When we talk about entitlements, folks aren't spending a day tired of anything but in order for the American society to work and be balanced in this capitalistic economy, you have to have poor people working at the bottom. And so before you call it an entitlement, I thought about this as I came to close. When we talk about folks who get a mortgage-interest deduction on $1 million home, maybe it's about $750,000 over the course of that lifetime, they get to take off about $20,000 in taxes, we call that a deduction. But if it's poor folks, we like to call that a credit. So maybe we should change the language and give poor folks deductions and give rich folks credits because that's all they get. It's a whole bunch of credits. Credit on credit on credit on credit. And so if you truly want to say we want entitlements in, Mr. President, we got an incorporate wealth and stock stocks and that's the billion dollar corporations that are paying people pennies while also talking out of both sides of the ethnic. And we can't be the leading energy producer in the world. If folks like Bill's of Sky High, if folks were to prices of Sky High, and when we talk about the use of executive orders of President Barack Obama was an emperor, then what does that make President Trump today? In the same majority party, cry bloody murder, are the same majority party folks saying this is great. We love it. Keep going. And with that, Mr. President, I yield the well, this resolution is quite hypocrisy, quite hypocrisy in my position. And I will vote no and y'all know how y'all going to vote because maybe Mr. President, the folks in this community are going to be able to get a good strong backbone like I got from the second. I yield the well. All right, Senator. The Senator has closed the debate. I think we would have voted the exact same way an hour and 20 minutes ago, but we're here. All right, here we go. We got a minimum number one a authored by the Senator from the 37th, the minimum number one a, is there objection to minimum one a? There is objection. All right. All those in favor one a will vote. Yay. All those. And a secretary in law machine. The resolution the a's are 29 and a's are 16 and one a has been adopted. Okay, on amendment one, as amended by one a authored by Senator from the night. Can read your writing, Senator. Senator from the night. Is there objection? There is objection. All right. All those in favor of one. One is amended by one a then will vote. Yay. All opposed. They say. And a lot of machine. Senator from the 14th, what does your rise? The state is in that tree that a vote against this amendment means a vote against guaranteeing the social security and Medicare won't be cut. Isn't that true, Miss President? Every senator is entitled to a red and green vote. All in the adoption of one as amended. The yeas are 20 the days are 29 and this amendment has failed. On amendment number two, authored by the senator from the 10th. Is objection? We got objection. All those in favor of amendment number two, vote. Yay. All opposed. Now, the year is 17. The days are 31 and this amendment has failed. All right. Now, moving on. Amendment number three, authored by the senator from the 14th. Is there objection? There is objection. All those in favor of amendment, vote. Yay. All opposed. Now, your secretary and law of the machine. You have to be careful. All in the adoption of amendment number three, the yeas are 18, the days are 31 and this amendment has failed. Is there objection to agreeing to the report of the committee, which is faithful to the adoption of the resolution? Chair, chair, chair, none. The board of the committee is agreed to. Is there objection to the main question being ordered? The question is only the adoption of the resolution. All those in favor of vote. I, all opposed. No. Six here in the motion. We're going to have senator from the take of the perpetrator. The senator is not true that everybody in the majority party vote for this resolution will rely on you to deliver it. The senator knows of what he speaks. And on the adoption of the resolution to Singapore, I mean the investors ship to Singapore. The yeas are 31 and the days are 18 and this resolution has received a very exclusive contribution majority is therefore adopted. I think that's a very good question. I think that's a very good question. Thank you. Thank you. Thank you. The president of the rules committee will meet upon a German 450th capital at 245 the children and families committee will meet room 307 to see a low D. F345 the appropriations agricultural natural resources. The Senate will meet as one also at 345 the state institutions and property committee will meet room 125 in the capital at 5pm the regulatory industries and utilities committee will meet room 450 in the capital at 6pm the government oversight committee will meet room 307 to the CLOB. Please the order Mr. President. Any other announcements? All right. So the majority leader has moved all those in favor will signify by saying aye all those pose no. Please clear and have it. Please go to your committee meetings. We've got a lot of house bills. We've got a sort through. So please go to your committee meetings. We adjourned. Have a wonderful night.",
  "updated_at": "2026-02-13T14:31:35.275039+00:00"
}