{
  "video_id": "emW4EgABO4Q",
  "url": "https://www.youtube.com/watch?v=emW4EgABO4Q",
  "title": "Georgia House 2026 - Day 5 AM Session 2",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 5,
  "video_date": null,
  "duration_minutes": 79,
  "summary": "Here is a structured markdown summary of the Georgia House 2026 - Day 5 AM Session 2 session:\n\n# Overview\nThe session featured a prayer and scripture reading by a visiting pastor, as well as a notable moment regarding the example of George Washington stepping down from power. The session focused on routine procedures to start the day.\n\n# Key Actions\n**HB590**: No substantive actions on this bill.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- Visiting pastor Major Paul Elliott delivered a prayer and scripture reading, highlighting examples of servant leadership from Jesus Christ and George Washington.\n- The pastor recognized several representatives, including the representative who invited him to speak.\n\n# Votes\nNo recorded votes.\n\n# Attendance\nA quorum was present, with all members voting to signify their attendance.\n\n# Adjournment\nThe session adjourned, with the next session date unspecified.",
  "transcript": "Good morning.\nY'all know what I know.\nIt's a great day to be a Georgian.\nA little chilly outside there, representative finish.\nMembers, will all please come to the chamber\nand get come closer to your seats,\ncause we're getting ready to ring the bell, Mr. Clerk.\n.\n.\n.\n.\nGood morning members, all members come to the floor, we're going to have the morning\nrow call, all members present will please vote green to signify their presence in this\nThis chamber, Mr. Clerk, will you unlock the machines?\nAll members voted, all members voted, all members voted if so, Mr. Clerk, will you\nWe lock the machines, door keepers, will you please close the doors and keep them closed.\nAs is our custom, we will begin our day with scripture reading and prayer by our chaplain,\nto which we will pledge allegiance to the flag of our country.\nOur chaplain this morning comes to us from down in South\nGeorgia and he will be better introduced by the lady\nfrom the 169th House District,\nrepresented in Angiostean.\nRepresenting.\nThank you, Mr. Speaker.\nIt's my honor to introduce you to my friend Major Paul\nElliott of Douglas, Georgia.\nMajor Elliott earned a Bachelor of Arts degree\nin political science from Georgia Southern University.\nHe is a graduate of the Army Infantry School\nin Fort Benning, the ordnance basic officer basic course\nof Aberdeen Proving Ground Maryland, right?\nI could go on and on about the degrees that he has.\nAs of recent, he attended New York University\nin the fall of 2017 through the summer of 2018\npursuit of a master's degree in European and Mediterranean studies and graduated with\na 4.0.\nMost recently major Elliott completed the Eurasian Foreign Area Officer Training Program at the\nGeorge C. Marshall European Center for Security Studies in Garmish, Germany.\nHe is a highly decorated friend of mine.\nHis military awards and decorations include the Meritorious Service Medal Army Commandation\nMedal with two Oakleaf clusters.\nI can go on and on again about the things that he's done.\nBut as you can see, he has served our country in various roles all over the world.\nAnd he retired after 25 years of faithful service to the United States Army.\nMost recently, he became pastor of First Methodist Church in Douglas, Georgia, where I met\nhim.\nMary to Claire Maley and he has his niece and nephew here Sam and Caroline we're\nglad to have them here. I met them through Camp 151 which is a service\norganization that serves the underserved in our community for a week and he is\nthe leader of that. He navigated us out of Hurricane Helene. Please make him\nand welcome this morning Pastor Paul Elliott.\nThank you.\nApplause.\nGood morning, everyone.\nI'd like to thank you, Mr. Speaker, for this amazing opportunity to share a Christian word\nof encouragement to an assembly such as this with the leaders of our great state.\nI'd also like to thank my representative\nfrom House District 169, Mrs. Angie Osteen,\nfor the blessing of being nominated for such an occasion.\nI'd also like to recognize James Bershiat from 176,\nwho's got the Southwestern Quadrant of Copy County,\nso appreciate your service as well.\nAnd Angie, I thank you for your friendship.\nI'd also like to thank my lovely and kind\nand long-suffering bride, Claire Mealy-Eliott,\nwho is representing our family today\nwith Sam and Caroline, my niece and nephew.\nYou already know that I love you all.\nLastly, I'm honored, truly, to be\nin the presence of the representative leadership of my state.\nWithout your willingness to conduct the necessary labor\nof legislation and vision casting in real time,\nnothing would happen in our towns and cities,\ncounties or roadways, and I salute you all.\nMany of you remember Chuck Sims\nfrom his time and service in this room\nis the representative for District 169 in Coffee County.\nHe is also a prominent funeral director in Douglass\nand unfortunately in the last two weeks,\nI've been working with him quite a bit\ndo to some deaths in our church.\nAnd we were talking the other day,\nand I was telling them about this wonderful opportunity\nthat I had to be with you all today,\nand that I was given a five-minute time limit\nwith which to deliver my message.\nAnd Chuck, without even missing a beat,\nsaid, do not worry about that five-minute time limit too much\nbecause in truth, nobody really wants to get started\nwith the order of business of the day anyway.\nThat's his words.\nThank you.\nToday's scripture is from the Apostle Paul and his epistle to the church in Philippi.\nIn chapter 2 we find these words, if there is any encouragement in Christ, any comfort\nfrom love, any participation in the Spirit, any affection and sympathy, complete my joy\nby being of the same mind, having the same love,\nbeing in full accord and of one mind.\nDo nothing from selfish ambition or conceit,\nbut in humility count others more significant than yourselves.\nLet each of you look not only to his own interests,\nbut also to the interests of others.\nHave this mind among yourselves,\nwhich is yours in Christ Jesus,\nwho though he was in the form of God,\ndid not count equality with God a thing to be grasped,\nbut impede himself by taking the form of a servant\nbeing born in the likeness of men.\nThe great and noble General George Washington\nafter leading the continental army to victory\nover British forces in the American Revolution\nelected to resign his commission and return\nto his comfortable home at Mount Vernon.\nMany of his contemporaries felt\nthat because of his widespread popularity,\nas savior of the colonies from King George III,\nthat he could easily seize power unopposed.\nBut he felt that he could best serve his new country\nby putting aside power, investing it with the people\nfor them to decide.\nUpon hearing about this about George Washington,\nKing George III in England is quoted as\ncalling George Washington the greatest man in the world\nfor having given up that power.\nSoon enough, he would be called forth from the comforts\nof his farm into public service again,\nfirst to preside over the Continental Congress,\nand then to preside over two terms\nas the United States First President.\nOnce again, many felt that he could easily retain power\nby not departing office, but he knew he could best serve\nhis country by stepping aside as his season of service\nhad come to an end.\nMany of you here today are absent from your homes\nand from your families, from your places of employment,\nyour businesses, your farms, even your cats and dogs.\nYour paths here to this moment that we're all sharing\nare as diverse as you all are,\nand each of you has his or her own story.\nMaybe you were asked to run for the office\nthat you now occupy.\nMaybe it was expected of you to run through office.\nMaybe it runs in the family.\nMaybe you had an ambitious streak\nand you wanted to defeat your opponent in a fair contest.\nYou can't play football anymore\nso why not duke it out on the field of political battle.\nWhatever led you here,\nwhatever brought you here is not the point.\nI often reflect with my church family\nthat the moment, this moment,\nthat we're all sharing has never been lived before.\nWe're all sharing this together for the first time\nand anything is possible with each passing moment.\nWith the examples of our Lord and Savior,\nJesus Christ, as well as our first president,\nwe can see that power is rightly viewed as an instrument\nwhich can be used for tremendous good.\nThe power of your positions, ladies and gentlemen,\nimpact the people of this state in ways\nthat many of them will never know.\nIn fact, you can go as far as to say\nthat they are helpless against whatever decisions\nthat are made and the legislation that flows from them.\nIt's important that we all take it seriously\nand I trust you all to do just that.\nI also recognize that many of you could be enjoying\nthe fruits of your labor at your homes\nor on a trip somewhere exotic, perhaps.\nBut you're here.\nYou're getting ready to do the work on behalf of 11.2 million\nGeorgians and the work you do matters and it matters to me.\nLike the example of Jesus and of General Washington, you don't see this as a\nposition of superiority, but as a position of service.\nI encourage you to remember to reflect the glory of God and all that you do,\nboth today in this working session and in the lives the Lord has blessed us with.\nNow I'd invite you to please stand as we pray.\nFather, we are so grateful for this day,\nthis beautiful day that you've blessed us with.\nI'm so grateful for each and every individual\nthat is here today in the areas that they represent\nfrom our great state.\nI ask that you pour abundant blessing upon them\nand those people that they represent,\ntheir families, their futures.\nWe're grateful to be here, Lord.\nWe're grateful for the life that you have blessed us with.\nHelp us to not waste one minute of it.\nAnd it's in Christ's name, we pray.\nAmen.\nI invite you now to join me in pledging allegiance\nto our great flag.\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands.\nOne nation under God, individual, with liberty\nand justice for all.\nThank you for being here with us and family. Thank y'all for being here. Thank you for your service to our country and thank you for your service as a good lord in your community and all of those you minister too. Thank you for being here with us.\nour country and thank you for your service as a good lord in your community and all of\nthose you minister too.\nThank you for being here today.\n.\n.\n.\n.\nWe think Representative Scott Holcomb, we're inviting our doctor of the day today\nThat's Dr. Steven Holbrook.\nThanks Dr. Holbrook for being here and taking care of all those folks who serve on this golden dome.\nThank you Dr. Holbrook, we appreciate your service.\nChair now recognizes Chairman Hilton, the Chair of the Committee on Information and Audits.\nChairman Hilton.\nGood morning Mr. Speaker, happy Friday.\nYour committee on information and audits has read the journal of the previous legislative\nday and found it to be correct.\nThank you, Mr. Chairman.\nChairman Hilton, the chair of the committee on information and audits reports that the\njournal of the previous legislative day has been read and found to be correct.\nIs there any objection to dispense with the reading of the journal?\nHearing none the journal reading the journal is dispensed with.\nIs there any objection to the confirmation of the journal?\nChair, here's none that the journal is confirmed.\nMr. Clerk, will you read the resolution establishing the order of business for the day?\nRepresentative, administration of 104th moves following me establishes the first part of the period unanimous\nconsents, introduction of bills and resolutions, first reading and reference of house bills and resolutions,\nsecond reading of bills and resolutions, reports of standing committees, morning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nHearing none, the resolution is adopted.\nFirst, reading the bills and resolutions, Mr. Clerk, will you read?\nHousehold 979 by Representative Honolulu 73rd Smith of the 18th Ballot of the 147 Hong\n113rd, Holcomb of the 101st, Bill Meetal and Acto Men Code Section 52, 27th of the\nMr. Clerk, I'm going to assign this bill, and then I want to pause for just for a second.\nJudiciary, members, if any of you found a cell phone in the ladies' restroom,\nis representing Bayes Moors.\nIt's missing.\nIt'd be nice to get it back to her.\nThank you very much.\nMr. Clerk.\nHouse Bill 980 by Rips on a bond of the 73rd.\nStevenson 164th, Beatrie of the 166th,\nProvers of the 52nd.\nTran of the 80th and others,\nthere'll be Todd and Act to amend chapter 12,\nbut Toddle 50, the Fisher go to Georgia,\nand it's either relating to commissions\nand other agencies.\nEconomic development, enterism.\nHouse Bill 981 by reps and Apollo 33rd,\nairheart of 36,\nI've sneed into 169 Jackson,\n128th and Jones, 47th.\nBill B. Todd will act to amend chapter 34,\ntitle 43, the fish go to Georgia annotated\nrelating to physicians, assistants, and others.\nPublic and community held.\nHouse Bill 982 by reps and a camp on the 135th\nand Dickie the 134th.\nBill B. Todd will act to amend\nand act providing a new charter\nfor the city of Barnesville.\nAnd for governmental coordination House will 983 by reps and pagan to the 156 can in the hundred and seventy second\nMeeks the hundred and seventy-eighth and perchette of the hundred and seventy-sixth\nIt'll be taught an act to amend article on a chapter six a total twelve of the official code of Georgia annotated relating the forest resources\nNatural resources and environment\nHouse Bill 94 by Representative Camp of the 135th May the act of the 82nd goal of the\n19th shadow of the 176 towns and 179th and others.\nIt'll be titled an act to amend chapter 5 and title 16 of the official go to\nGeorgia annotated relating to crimes against the person.\nJudiciary non-civil House Bill 985 by Representative Bond of the 73rd Hitchinson\n161st work eyes are the 157th Mathis of the 133rd Donald 2 Chi of the 105th and\nothers will be titled an act to amend Part 3 of Article 2, Chapter 4, Title 38, the\nFiscal Code of Georgia Annotated Relating in Georgia Veterans Cemeteries.\nDefense and Veterans Affairs.\nHospital 986 by Representative Jones, the 25th Hiltman, the 48th Huttles, and the 70th\nHuttles, and the 79th and the bearer to the 24th, will be titled an act to amend Part\n2A of Article 13 to Chapter 6, the Title 40, and the Fiscal Code of Georgia Annotated\nElectoral Annual, Electric Personal Assistive Mobility Devices.\nTechnology and Infrastructure Innovation.\nHouse 987 by Ripsend of Jones, the 25th Thomas, the 21st Anderson of the 10th.\nCameron of the 1st, Barrett of the 24th.\nBill B. Todd of NACTO, Menarch, Chapter 8 to Title 34 of the EPhysical to George Annotated,\nRelating Employment Security.\nIndustry and Labor.\nHouseville 988 by reps of camp of the 135th Jones to the 47th Hagen in the 156th.\nBallard to the 147th, new to the 40th and others.\nBill B. Toddl, an act to amend article 1 on chapter 18 to title 45.\nThe official go to Georgia annotated relating state employees health insurance plan.\nHale Houseville 989 by reps on Wilkerson to the 38th, McQueen to the 61st.\nAdesana to the 43rd.\nWilliams to the 37th for Italy to the 22nd and others.\nwill be titled an act to amend Article 3, Chapter 2,\na title 20 of the official go to Georgia annotated\nrelating to local boards of education.\nEducation.\nHouse Bill 990, my resident of Saints of the 180th\nHitchens, 161st Crow, the 118th,\nHon of the 103rd, Donald Tucci, the 105th,\nand others, they'll be titled an act\nto amend Article 1 of Chapter 2, a title 35\nof the official go to Georgia annotated\nrelating to dental provisions relative\nto the Department of Public Safety.\nPublic Safety and Homeland Security.\nHouse Bill 991, by ribs under Jones,\nthe 25th Davis of the 87th Anderson,\nthe 10th Townsend of the 179th and Barrett of the 24th.\nBill B. Todd will act to men,\nTodd will 34th, the official go to\nGeorgia and it's able to relate\nto labor and industrial relations.\nIndustry and labor.\nHouse Bill 992, by ribs under Wilkerson of the 38th,\nBuckner of the 137th,\nHolcomb of the 101st,\nAdesana of the 43rd, Williams 168th and others.\nBill B. Tidal and act to amend Article 1 of Chapter 3,\ntitle 12 for the Fisher go to George Anitator\nrelaying the general provisions regarding parks,\nhistoric areas.\nGame, Fish and Parks.\nHouse will 993 by reps of the Barnes of the 86,\nMcQueen to the 61st.\nDrenner, the 85th Taylor, the 92nd,\nLupton, 83rd, and others.\nBill B. Tidal and act to men,\npart 15 to Article 6, chapter 2.\nTidal, for the Fisher go to George Anitator\nrelaying the miscellaneous provisions\nunder the Quality Basic Education Act.\nEducation.\nHouse Bill 994 by Rebson of Chocus\nto the 101st Dunhu, the 31st.\nCanon, the 172nd McDonald, the 26th,\nlumps into the 12th and others.\nThey'll be taught an act to amend code section 16, 11, 30.\nNow the official code of George Antony\nwho relating to riot.\nJudiciary non-civil.\nHouse Bill 995 by Rebson of Barnes\nto the 86, Crawford to the 89th Barry, the 56th.\nQueen in the 61st, Holly in the 116th and others,\nthere'll be a total of an act to amend\npart three of Article 16 to chapter two with title 20\nof the official go to Georgia annotator relating\nstudent health and elementary and secondary education.\nEducation.\nHouse Bill 996 by reps and a bury the 56th\nAustin in the 65th Barnes of the 86th,\nco-feel to the 63rd, Osteen in the 169th.\nThere'll be a total of an act to amend chapter two,\na total two of the official go to Georgia annotator\nrelating the Department of Agriculture.\nAgriculture and Consumer Affairs.\nHouse Bill 997, my reps on 11th to the 123rd,\nPerchetta 176, Crow with 118th,\nMathis the 133rd,\nOsteen in the 169th and others,\nthey'll be titled act to amend title 42,\nwith the official go to Georgia annotator,\nrelating to penal institutions.\nJudiciary non-civil.\nHouse Bill 998, my reps on 11th to the 123rd,\ncamp with 135th, Paul of the 33rd,\nAspirus, the 11th, Williams of the 168th and others,\nthey'll be titled an act to amend Article 4, Chapter 5,\nand Title 36 of the Efficiency of the Efficiency of George\nAnnettated, relating to telecommunications\nand competition development.\nEnergy utilities and telecommunications.\nThat's well 999 by Representative Leopard,\nthe 123rd out of the 84th of the 57th,\nGunner of the 8th, New of the 40th and others,\nthey'll be titled an act to amend Article 5 of Chapter 10,\nTitle 15 of the fiscal go to George Aniteta relating to fees and cost of\nregistry courts.\nJudiciary House Resolution 1023 by Representative Jones, the 25th\nRidley, the 6th Dubemick of the 29th bonner, the 73rd, no steam of the 169th.\nHe'll a resolution proposing an amendment to the Constitution so to\nprovide that every parent has a fundamental right.\nJudiciary.\nmembers I'm going to remind you again check your cell phones, make sure you don't have\nan extra one by accident if you do it's representative baseballers so please chat members, second\nReadies reading a bills and resolutions a clerk will read\nHouse bill 960 by rams park of the hundred and eighth a stretch 104 threes of the 99th park with one hundred and seventh and then you have the hundred and 10th and others a bill relating to\nNumber of superior court judges a superior courts house bill 961 represent by represent Powell 33rd Evans of the 57th jasper\nThe 11th Oliver of the 84th Cooper the 45th others a bill to amend the surprise building consumer protection act\nHouse Bill 962 by Representative Martin of the 49th Barrett of the 24th Jones of the 47th Williamson of the 112th Blackburn of the 146 and others and Bill relating savings trust accounts availability terms and provisions relative to the Georgia Higher Education Savings Plan.\nHouse Bill 963 by Representative Martin of the 49th and 10th, Fleming 114th Carson, Blackburn of the 146th, by Bill relating to government transparency and campaign finance House Bill 64 by Representative Canada 172nd, Chastain of the 7th.\nWe down with six Williams of the 168th Lums of the 12th and others a bill relating to revenue\nand taxation house bill 965 by reps of K and the 81st bird of the 20th games of the 120th\nventure the 23rd and talks of the 28th the bill relating to health record house bill 966 by\nreps of Westbrook of the 163rd Jackson 165th Goliath of the 160 seconds Stevens of the 164th\nbill to amend the act creating Carter guard guard\nHouse Bill 97 by reps of Ridley of the 20 second Ridley of the six.\nCorner the third Fleming of the 114, Chastain of the 7th and others.\nA bill relating to the Criminal Justice Coordinating Council.\nHouse Bill 968 by reps of Townsend 179, Stevens of the 164, Williams of the 148, Smith of the 18th Corp of the 174th and others.\nA bill relating to control substances.\nHouse Bill 969 by reps of Townsend of the 179th, Hawkins of the 27th, Green of the 154th.\nThe advantage of the 51st hearing of the 145th and others to build relating to the Georgia State employee's post-employment health benefit fund.\nHouse Bill 970 by Representative Township of the 179th Washburn to the 144th, there's been a 169th rise of the 139th Hagen of the 156th and others to build relating to other educational programs relative to the Equality Basic Education Act.\nHouse Bill 971 by Representative Township of the 179th turns of the 25th to the ledge of the 167th Smith of the 70th, Horner of the 3rd and others to build relating to other education programs.\nUnder the Quality Basic Education Act,\nHouse Bill 972 by Representative Barry of the 56,\nLollier of the 59th, Rice of the 139th,\nHerring of the 145th, Hagen of the 156th and others.\nA bill relating to educational programs\nunder the Quality Basic Education Act.\nHouse Bill 973 by Representative Burns of the 159th,\nChones of the 47th, FTH, 104th, Hatch of the 155th.\nA bill to amend and act making and providing appropriations\nfor the state fiscal year beginning July 1st, 2025,\nending June 30th, 2026.\nHouse Bill 974 by Representative Burns of the 159th Jones of the 47th\nAbstration of the 104th Hatchett of the 155th and Bill to make and provide appropriations for the state fiscal year beginning July 1st, 2026.\nAnd ending June 30th, 2027 House Bill 975 by Representative Burns of the 159th Jones of the 47th.\nAbstration of the 104th and Hatchett of the 150th and Bill to amend and act breaking and providing appropriations for the state fiscal year.\nin July 1st, 2025 and ending June 30th, 2026.\nHouse Bill 976 by Representative Burns of the 159.\nJones of the 47th administration of 104th,\nhatchet of the 155th,\na bill to amend and act breaking and providing appropriations\nfor the State fiscal year by getting July 1st, 2025\nand ending June 30th, 2026.\nHouse of the 977 by Representative Burns of the 159th,\nJones of the 47th,\nabstraction of the 104th, hatchet of the 155th,\na bill to make and provide appropriations\nfor the State fiscal year by getting July 1st, 2026\nand ending June 30th, 2027.\nHouse bill 978 by Representative Burns\nof the 159th Gen. of the 47th Destruction of the 104th\nand hatched at the 150th FIT,\nand built to make and provide appropriations\nfor the state fiscal year beginning July 1st, 2026\nand ending June 30th, 2027.\nThrough second readers.\nMr. Clerk, I think we have a report of a standing committee.\nMr. Clerk, will you read?\nRepresentative Lynn Smith, the 70th district, bearing the committee on natural resources\nand environments.\nAnd to the following report, we'll speak to your committee on natural resources and\nenvironment.\nThat endurance consideration, following resolution of the House, instructing the name\nback to the House of the following recommendation, House resolution, 2008, due pass, respectively\nPlease submit, Mr. President.\nLynn Smith, the sub-history chairman.\nI completes the reading of the porch standing committees.\nMembers we do have an invite resolution this morning, but we're going on to morning orders\nfor us.\nSo, if members will take your seats, members please take your seats, come to order.\nWe have two special morning orders, so watch.\nI want you to keep these doors closed for a few moments you don't have to lock them\nbut keep managing them very well.\nWe don't need any noise from any rooms for these morning\norders, especially this first one.\nMembers would please take their seats\nand give the member in the well your attention, please.\nI won't ask you all to join me and stand as I recognize my friend Rep. Spencer Fry.\nThank you, Mr. Speaker.\nYou all know I've never given a morning order before.\nFourteen years is my first one.\nI'm not going to keep you long.\nI want to talk about, I appreciate, thank you, Mr. Speaker, for allowing me to get in the well\nand to read these names into the record.\nAnd I want to tell you all a little bit.\nIn 2017, I had the men, the patriarchs of my family\npassed away.\nMy uncle, Benjamin Lewis, who taught me to fish.\nMy grandfather, hersel price, who taught me to raise cattle.\nMy father, who taught me the Beatitudes, just recently, a couple months ago, my mother,\nwho taught me to be tough, passed away.\nI remember what my grandfather said at his mom's funeral.\nBut when his dad passed, he thought he was a man, and when his grandson was killed at\nfive years old, he thought he was a man.\nBut then when his mom passed, he knew that he had become a man.\nMy mother taught me music, which you can find on any platform if you want to listen to it.\nArt, she was a renowned calligrapher, and as a conservative evangelical, I can only imagine\nthe interesting conflict of emotions when she was commissioned to calligraphize a piece\nin Goldleaf for President Carter, which hangs in his office at the Carter Center.\nWhen she taught me to be tough, I mean she taught me to be tough.\nI think she only loaned me about 500 bucks\nwhen I was in my early 20s,\nand she made me pay it back.\nThat was it.\nBut all the way I was raised was here in this every day.\nY'all remember those little bitty micro cassette\nanswer machines we had in the 80s, right?\nAnd if you call my house,\nit says, if you think you can,\nor if you think you can't, either way you're right.\nleave a message.\nNow that is emblazoned in my brain because\nnot only did her and my father when they switched over to cell phones\nthat was there both of their messages on their cell phones.\nSo I heard that for over 40 something years.\nYou know in 2014 I quit drinking.\nNot sober.\nI just quit drinking because of this job.\nIt's too important for us to get in trouble.\nAnd I felt like sometimes we might make a bad decision\nif you're out having a cocktail or two.\nBut when I buried my mama, I had to take a shot\nof her favorite alcohol.\nAnd it was fireball.\nAnd I buried it with my dad in the veteran's cemetery in Griffin, Georgia.\nI tossed a chocolate chip cookie in there on her ashes, because she was famous for\nher chocolate chip cookies.\nBut I did write her a song, and I'm going to tell you the first verse in the course.\nShe can mama's fireball and smoke in her cigarettes.\nThinking about the time she said, now son, don't forget.\nIf you think you can, or if you think you can't, either way you're right.\nAlways do what Jesus said, but never run from a fight.\nYou better count your blessings every day.\nbetter say your prayers before you go to bed. Never let your love dissipate and just keep\nkeeping on and I'll see you at the pearly gate. Thank you my friends for listening to\nthat. Her name was Cheryl P. Fry. May God bless her and I'm going to see her at the\nto pearly gates.\nThank you, Mr. Speaker, and I yield the well.\nWe're up to you, Fry.\nYou know what I know.\nWe only have one mama, and they're special.\nI'm glad you did that this morning.\nSpecial lady, I know you miss her, and a lot of people do.\nthanks to her influence on your life.\nYou're a good man.\nThank you members.\nRepresenting Bayesmore has a group\nthat she's going to recognize.\nY'all give the lady your attention, please,\nand some friends.\nWe're gonna have them.\nCome, yes.\nCome, come, come.\nYep, this is our room.\nYes.\nThank you, Mr. Speaker, and I'm going to say it like this.\nMy family, we have built such a relationship that I call them my family, and I thank you\nfor being here today in your house.\nSo who we have in the gallery, they are from the Turkish community.\nThey brought some college students and leaders of the Atlantic Institute and spring educational\nservices here to their house.\nThat Atlantic Institute is a Georgia-based nonprofit dedicated to the promotion of understanding\ndialogue and peace.\nThe Atlantic Institute also organizes intercultural dialogue trips to Greece and many others.\nAnd that's what we were on last year.\nWe thank you so much and we will educate it.\nI ask that you stand up and this August body recognize you here in your house.\nThey will also be taking a tour, so when you see them in the hallway, please greet them\nand say hello.\nThank you, Representative baseball.\nWelcome.\nWe're glad to have you here.\nHope you enjoy your time with the Capitol and thanks for what you're all are doing and\nrepresenting the community and being part of the people's house here today under this\ngo.\nThank you so very much.\nWe're very welcome.\nWe look forward to hopefully meeting you out in the hall.\nThank you.\nThat completes our morning orders.\nMembers, if you will, we have an invite resolution now\nthat is very special to me and I'm sure it is\nto all of you as we honor one of our own family here\nand that's Mr. Abbott Massey.\nI'm gonna ask his family to come up and join me.\nI'm going to ask Mr. Clerk if you will not only read the caption but if you will read\nthis resolution, House resolution honoring the life\nof Mr. Abbott and Massey, Mr. Clerk.\nHouse resolution 1013 by Representative Burns\nof the 159th, Dickie the 134th, Hawkins of the 27th,\nDubnick of the 29th, Meeks of the 178th and others,\na resolution honoring a life and memory of Abbott Massey\nand for other purposes.\nWhereas Abbott Massey lived a life of distinction\ndefined by exemplary service to his state, devotion\nto his community, and steadfast commitment\nto education, agriculture, and civic leadership.\nAnd whereas starting from his earliest visits\nto the Georgia State Capitol in the 1940s,\nhe developed a lifelong connection to the Georgia's public life\nthat led him to serve as executive secretary\nto Attorney General Jean Cook and to be appointed by Governor-elect Ernest Vandiver as director\nof the Department of Commerce during which time he created the state's first tourist\ndivision as well as the state's first welcome station in Screven County, the oldest station\nstill operational in the United States.\nAnd whereas his career began most closely tied to Georgia's agriculture through his leadership\nbut the Georgia Poultry Federation,\nwhere he guided the industry's growth with vision and dedication,\nand he continued to serve full time as President Emeritus there after.\nAnd whereas his passion for education in the University of Georgia was evident\nin his service as President of the UGA Alumni Association,\nand as Trustee of the UGA Foundation,\nand as a leader in preserving the historic four towers\nand establishing the Veterinary Medicine Experiment Station.\nAnd whereas as many honors include the UGA Distinguished\nAlumni Merit Award, the Blue Key Service Award,\nthe inaugural medallion of honor from the College\nof Agriculture and Environmental Sciences,\nthe College of Family and Consumer Sciences\nAppreciation Award, the Distinguished Service Award\nfrom the College of Veterinary Medicine\nand induction into the Georgia agriculture hall of fame.\nAnd whereas he was further honored through the creation\nof the annual Abbott-Massie lecture\nby the Georgia Society of Association Executives,\nand he received the Organization's President's Award\nfor his work to protect nonprofit volunteers\nunder Georgia law.\nAnd whereas as additional testimony\nto his influence and service, Abbott-Massie met seven presidents\nof the United States, counted the late President Jimmy Carter among his friends and championed\nGeorgia women of achievement as the first man to serve on its board of trustees, the\nonly man to serve as president, and the first person chosen his trustee for life.\nAnd whereas he was united in love and marriage to his wife, Kayanne, and together they built\na life in Gainesville, Georgia, raising two children, Lewis and Camille.\nAnd later enjoying the blessings of four grandchildren, Chandler, Mary Cameron, Christian, and Lucia,\nand of family members Amy and Gilly.\nAnd whereas a compassionate and generous man, Abbott Massey will long be remembered for\nhis love of family, friendship, and community, and will be missed by all who had the great\nfortune of knowing him.\nNow therefore be it be resolved by the House of Representatives that the members of this\nbody join in honoring the life and memory of Abbott Massey and express their deepest and\nmost sincere regret at his passing.\nThank you, Mr. Clerk.\nThank you members.\nMike Giles, you remember the family.\nCome on up here.\npartnership in working with Mr. Abbott over the years certainly will be recognized.\nMembers, any of us could do what I'm doing right now that had the honor and the\npleasure of knowing Mr. Abbott and working with him over the years. And I'm going to\nmake some more remarks about Mr. Abbott, but I want to invite his son, Lewis,\nAll of you know as well to introduce the family, Lewis, if you will, and allow me to present\nyou with this resolution, members of this house, we're also proud to be a part of and present\nto you and the family as we honor a dear, dear Georgian, the Stab at Massey, Lewis.\nHow'd you know?\nThank you.\nLewis, can I have more・・・\nplease please be seated they don't listen to me very well thank you speaker\nJohn Burns thank you Dale Burns the real star of the Burns family thanks to\neach of you for your service to the state and for the time that you work with\nmy dad over the years greatly appreciated I want to thank the speaker staff\nChris and Jacob and others who helped make this resolution possible and thank\nmany friends in the gallery who worked with Dad over the years here at the\nState Capitol. I want to just say a couple of brief things. Number one is he loved\nthe State Capitol and he loved this state. He told me that in the early 1940s he got\nin the car with one of his older brothers and they drove to the State Capitol\nand he met John P. Wilson, who was the 20th Secretary of State of Georgia.\nAnd then in 1947, when he was a student at UGA, he got in a car with three other students\nand they drove here to observe firsthand the chaos around the three governors controversy\nthat so many of you have read about, 1947.\nAnd as mentioned by the clerk and the resolution,\ndad had offices here at the State Capitol.\nIn the 50s, he worked for the Attorney General.\nHe worked in what was the predecessor\nto the Legislative Council's office, drafting bills.\nHe said there are only two people in the office at the time.\nA lot less bills then, I guess.\nHe also worked for a judge on the Court of Appeals.\nAnd many of you know that room 341 was actually\ncourtroom for the Georgia Court of Appeals and the Georgia Supreme Court in the 50s.\nAnd then in the late 50s he got to be the commissioner of the Department of Commerce, which is\nnow the Department of Economic Development. And in that job, he had one major victory.\nHe met Miss Georgia in 1959, who became his wife and our beloved mother and grandmother.\nHis dad once said that if Abbott ever fell in a lake, one thing for sure, he would come\nout of there with a fish in his pocket.\nDad did live a wonderful, fortunate, lucky life.\nAnd we are here today to thank you for this recognition.\nMy wife Amy is here, our son Christian, our son Chandler and his fiancee Steph Bennett,\nAnd the speaker recognized Mike Giles earlier who worked with Dad for many years at the Georgia\npoultry federation as they lobbied on behalf of the poultry industry.\nLet me finish with this.\nIf you read Dad's bio, it says he has an undergraduate degree from UGA and a law degree from Emory.\nBut I think his most important degree was a PhD in joy.\nEvery single day he was at this Capitol, he was joyful.\nAnd his legacy will live on thanks to you and others at the State Capitol.\nThank you for letting us be here today and share in recognizing and honoring the life of\nAbbott Massey.\nThank you very much.\nI know many, many of you, y'all may be seated, many, many of you, these members and great\nGeorgians in your own right would like to come and express your sentiment about\nMr. Abbott Massey. And thank you to his friends in the gallery too. We appreciate\ny'all being here to honor Mr. Abbott as we will. Because we all know that Mr. Abbott\nwas a trusted friend, mentor, advisor in so many different ways to so many\npeople over the years that served in the, with the honor that we serve with as\nmembers of the General Assembly, especially members of the House.\nAnd I thought of it this way, as Deilin and I have talked, I think I believe that the\ngood Lord has a plan.\nHis plan for Mr. Abbott was long life, good health, because he impacted so many of us with\nhis attitude and just that enthusiasm that he, I think he embodied it all.\nEveryone he met came away with, boy, I feel better to talk on that guy.\nAnd I think we all try to, he was a true Southern gentleman.\nIf you look it up in the book, the dictionary probably has Abbott Massie's name there.\nPersonal story about Mr. Abbott and his longevity.\nBut I was looking through some old newspapers at home\nfrom the Springfield Herald in 1956 or 57.\nOn the front page was this group establishing\nthe J.C.'s Jung People Google it, the Georgia J.C.'s,\nthe J.C.'s and who was inducting and establishing\nthat new chapter down in Effingham County,\nMr. Abbott mass, you know, and guess what?\nOne thing, he may have looked a little bit older,\nbut one thing was the same.\nThat hair was perfect then, and it was perfect now.\nSo he's pasted that gift alone, and I'll go in and tell y'all,\nI'm gonna get a haircut this week,\nbut I've got this hair in honor of Mr. Abbott this week,\ntrying to emulate Mr. Abbott in every sense of the word.\nSo that was something that was special to me,\nand Mr. Abbott just had that big grin\nwhen I gave him that newspaper, that first trip,\nthe history of our state that he would talk to you about.\nAnd he would bring the life for you\nas he told you about our state and our successes\nand everything he had been a part of\nand what he witnessed.\nLouis just spoke to that.\nA fixture, a fixture, that guy has been a fixture\nin this capital for a couple of years.\nAnd he's made a difference in here.\nMiss Kayanne, what a beautiful, beautiful Miss Georgia.\nShe was, what a beautiful, beautiful lady.\nShe was during her entire life.\nAnd a graduate of Agnes Scott, and you all know that.\nI just realized that.\nY'all know where they went on the first date.\nTrivia, Niagara Falls.\nYes, they did.\nWith her mother sitting in the back seat of the car, of course.\nWhat a romantic Mr. Abbott was.\nYou know, another special thing for me,\nas we've done in Scriven County on US 301,\nthe longest established welcome center in our country,\nis in Scriven County in our state.\nAnd Mr. Abbott was always an advocate\nfor keeping that beautiful building,\nhistoric building in place,\nand also is that welcome center still serves.\nVisitors coming from South Carolina,\ngoing south on 301 and headed back home in our state.\nFor those University of Georgia friends here, and I think we all are, he did bleed red\nand black.\nThere's no doubt about that.\nI don't think anything happened in Athens that Mr. Abbott was not a part of.\nWould that be fair to say?\nIn so many different ways.\nI think about that longevity and that help that the good Lord blessed Mr. Abbott with.\nHe called me a few years ago and said, hey, are you coming to the ball game?\nIt was one spring morning.\nHe said, what ball game is to have it?\nHe said, if it him, Kennedy, they're playing Gainesville right now in baseball.\nHe was always there in every sense of the word for what we do here, but what his community\nwas all about.\nAnd I did wear an elephant paper for the Gainesville folks up there that he cared so much about.\nI thought this was interesting, y'all probably heard this, your mother told him said,\nAbbot, when he was going to work for the Georgia Poetry Federation in 1966, he said, Abbot,\nyou don't know the difference, we're not gonna chicken, how can you do that?\nHe learned pretty fast, he did a great job of being responsible for the great success of\nthat industry.\nIt's so crucial to our state and the well-being of so many families around all over our\nstate, not just in North East Georgia. One of the things that I try to emulate, and\nI know you all do too, is, you know, I like to know people's names. Mr. Abbott knew\nyour name. He could call your name when you met him. That's one of the things that\nwas always so special about him, and he wanted to know about you. He wouldn't\nknow about your family, where you came from, what you did, but it wasn't\nforgotten because the next time he spoke to him he remembered and he talked to you about\nthings that were important to you. We should all try to emulate that as we make people feel\nspecial because he did that. Now he had a special friendship, he had a special friend\nsitting right over to my right, Dale Burns and you know Mr. Abbott was constantly upgrading\nand his ability to be in touch with every day.\nDrummer Tesla, a red Tesla.\nHe had an Apple watch.\nSo I can hear him right now, the phone would ring her.\nI said, who are you talking to?\nI'm calling Mr. Abbott.\nThey were comparing steps.\nWho got the most steps in that day.\nAnd so he'd be here most of the time.\nI can tell you that.\nBut she really thought she was one of his special girlfriends.\nShe got to look in and listening.\nMr. Heaven had a lot of special girlfriends.\nShe was special to him, but she realized\nhow special all of us were to Mr. Abbott.\nHe calls, you know what he did?\nHe cared about people.\nHe cared about his neighbor.\nHe kept up with the times.\nHe did that.\nHe was always relevant, always relevant.\nTo the family, thank you for sharing your dad,\nA man especially in your life, as you join the family,\ngrandchildren, he was so very, very proud of you all,\ny'all know that, and you all have that great hair\nthat Mr. Abbott passed on, that gene is still alive.\nI think Mr. Abbott's life and legacy, and that's important.\nWe've talked a little bit, a little bit about legacy\nover the last few days.\nThere's a legacy of kindness to every Georgian he came in contact with,\nto the point they remember him well,\nthat care he had for our state, for our well-being,\nfrom an economic perspective, but from a personal perspective.\nHe will never be lost on me.\nAnd his devotion, his devotion to this state,\nbut to his family, and just fellow men.\nI'll just say this.\nThank God for the life of that fine, fine man right there,\nMr. Abbott-Massie.\nThank you, family.\nWe love you.\nWe, again, thank the Lord for Mr. Abbott-Massie.\nThank you for being here with us,\nand letting us honor this family.\nThank you, members.\nyou\nThank you.\nOkay.\nI'll just let you know, Ms. Babis.\nLewis is obviously his son, Camillo is his daughter.\nThey were traveling, they tried to get here,\nbut as we honored their dad,\nbut we certainly make sure they can watch us for it.\nAnd I think they'll be, thank y'all.\nMembers, if you would,\nwe all learn to go into the end of the room.\nMembers, if you would like to speak to the family,\nyou may join them in the south any room\nand have a photo and tell them of your high regard\nof Mr. Abbott-Massie.\nThank you.\nWe have a little bit of business I need to attend to, but before we move on to afternoon orders.\nWe have a motion to withdraw a bill from one committee and recommit to another.\nFor what purpose is reps any forward rise?\nThat's Mr. Speaker, that you want to make a motion?\nYes, sir.\nThe lady's recognized for a motion.\nThat we move House Bill 590 from the Committee on Regulated Industries to the Committee on Motor Vehicles and both Chairman and Agreement.\nThank you.\nMr. Clerk, will you read the caption?\nHouse Bill 590 by reps and a quarter of the 170th and others to be entitled back to a men's title 43.\nThe official go to Georgia, Antietta, relating to professions and businesses so as to provide for the regulation of trailer manufacturers.\nOn the latest motion, HB590, be withdrawn from the Regulated Industries Committee and\nrecommitted to Motor Vehicles Committee, is the objection, hearing none of this so ordered.\nWe have some afternoon orders, we want to call on Chairman Bonner, then Representative\nPantitch and Martinez representing Bayes Moore and chairman MacDonald. We'll start with chairman Bonner\nYou don't have a time limit. We will let you conscious be your guide. How about that?\nI'd rather you be my guide mr. Speaker\nHey, uh, good morning. Come on. We'll spin\nThis is a good one. It's been pending for a few days. We're glad it's finally accomplished. Mr. Chairman\nWell, thank you, Mr. Speaker. Today, I rise to honor and celebrate a great Georgian and a true American hero.\nEarlier this week, General Tom Cardin, our former adjutant general, was nominated to be the vice chief of the National Guard Bureau.\nThis is the culmination of an incredible career that saw General Cardin go from enlisting as a private in the Georgia National Guard in high school\nto now pinning on a fourth-star reaching the highest level in the United States\nmilitary. So General Cardin, as I said, served as our\nagit in general throughout his career here in Georgia. He was a friend to many of us.\nHe led troops into harm's way. He led our state through numerous natural\ndisasters and throughout the and throughout the COVID pandemic, his actions\nsaved countless lives here in Georgia. So we are so honored and excited to have\nGeneral Cardin become the only the second serving four-star general in the\nNational Guard. He'll be up the National Guard Bureau in in Washington. He'll be an\nadvocate for not only for Georgia but for all of us in the military and I think\nit's fitting that we celebrate him today and look forward to his continued\nservice. Thank you, Mr. Speaker. Thank you, Representative Bonner. Yeah, absolutely.\nMembers, if you will reflect back with me on those days, on those Governor Kemp's press conferences\non COVID and bringing information to Georgians, boy, he was really good and did a great job\nin making sure that he did his job protected and working to serve Georgians. So, congratulations,\nthe general. He's a good man and I'm really glad he's on our team. Represent\nPennage and Representative Martinez. Recognize for an afternoon order.\nMr. Sperr, members of the house, we rise today to send a message to Coral Gables\nFlorida because we are the 305 caucus. I'm Monday night, the Miami Hurricanes\nwill take the field in Atlanta. I'm sorry, Miami. For the college football national championship.\nAnd we could not let this moment pass without wishing my alma mater all the best.\nI'm a proud double cane undergrad in law school. And while I've called Georgia home for 20 years,\nthat orange and green stays with me. The season coach Christball and his team have shown us\nwhat it means to fight, to believe, and to never give up. The Miami Hurricanes have earned\ntheir place on that national championship stage. Now, I know we're surrounded by bulldogs,\nyellow jackets, eagles, owls, and I respect every one of you. But Monday night, we are\nWe're throwing up the U.\nTo Carson Beck, the entire team, I knew I'd get there, and to hurricane nation everywhere.\nGo Canes, bring that trophy home, it's all about the U.\nGood luck, y'all gonna need it.\nThat's going to be a great game.\nWhat is it? Monday. Here a good look to the folks down in University of Miami, a great\nschool as well as the University of Indiana. Don't be a great game. Representative\nBaseball. Did you also want to do an afternoon order? Representative Baseball. We'll move\non the Chairman McDonald. Mr. Chairman, recognize for that.\nThank you, Mr. colleagues. Is that time of the year that firefighters are coming to town\nFebruary 3rd. I have the resolution welcome him to the Capitol. So if anybody would like\nto sign the firefighter's day resolution, they'll have it over here on my desk on the right.\nThank you. Joy, you weekend. Be sure to sign up. Those are great folks. Do a lot for us.\nThanks for bringing that Mr. Clerk, will you read the caption to a group of privileged\nResolutions, honoring the life and memory of Elizabeth Lloyd Smith, honoring the life of\nReba High Smith Cruz, recognizing the health and powers for 25 years service and leadership\nin advanced youth health, congratulating the lovejoy high school varsity game day cheerleaders\nfor winning the 2025 G.H.S.A. 5A, game day, state cheerleading champ, the honoring Echo Park\nSpeedway, recognizing commending Rick Roberts on his outstanding public service to the Mayor\nof Ballground, recognizing commending Langston Funeral Home of one of this in Georgia on\nthe occasion of more than 60 years of dedicated service to the community, recognizing February\nMay 5th, 126th at the High Genius Appreciation Day, congratulating Carolyn Wright upon\nher induction into the Chattahoochi Valley Sports Hall of Fame, recognizing and commending\nTeresa Labbaram Mitchell, and honoring the life and legacy of Keith B. LeBenslow, and\nThe purposes that completes the reading of the privilege resolution is there any objection to adopting the privilege resolutions here?\nNone of the resolutions are adopted.\nI think we're ready for some announcements now representing Carter.\nRecognize for and announced it represent during Carter.\nthen we will have Vice Chair Corpenter,\nChairman Jasper's and Chairman Hilton.\nRepresentative Carter has recognized.\nGood morning, thank you, Mr. Speaker.\nHappy New Year, everyone.\nSo you already know why I'm here.\nIt's our annual Go Red for Women.\nSo I want to tell you something\nthat we're doing a little different this year\nbecause someone decided that we would be in session\nfirst Friday in February. So the American Heart Association is having their\nadvocacy day on Thursday February the 5th and they are asking us to wear red.\nAnd because the official go red for women is Friday February the 6th we'll\nhost our annual luncheon and we'll ask you to wear red. So you all have an\nopportunity to go shopping, get your two red outfit.\nAnd what I'm really excited this year,\nif you all are here on that Friday and want to stay for lunch,\nwe would need to know that you're staying,\nbut we have an amazing speaker, Dr. Fockeridi,\nout of Cleveland, Mississippi,\nwho is a national renowned interventional cardiologist,\nwill be our guest speaker.\nSo, on February the 5th, where red,\nand on February the 6th, where red.\nThank you.\nThank you Mr. Speaker, Tuesday appropriations 10 a.m. Room 341 bring your books with you.\nYou will be working off your books. The schedule will be on the website but hopefully\nsee everybody next week so we can get this thing rolling. Thank you.\nThank you, Chairman Jasper's.\nRecognize for announcement.\nThank you members.\nAfter you go to your appropriations meeting on Tuesday,\nTuesday afternoon, the grocers\nand everyone involved in the food industry\nwill be in the blue room.\nThey'd love to see you.\nHave refreshments, all that good stuff.\nBut that's Kathy Cassava and Kevin Perry\nwho are friends to all of us.\nHope to see you there.\nThank you Mr. Speaker and thank you for this body for the work that we've done on education\nspecifically around getting cell phones out of our schools.\nWant to let you guys know we have legislation to expand that to high school so we're getting\nready to introduce that if anyone would like to sign that.\nI don't recommend it if you have a child in high school right now but in all seriousness\nThis is a great legislation, we'd love to have y'all sign on board, thank you.\nThat completes our announcements, other than a piece of information members would like\nto know about, representing Miriam Parrish is in the hospital over at Piedmont, so put\non your list and say a prayer for the shield, join us back soon.\nWe have a whole slew of birthdays, y'all, that are going to occur this weekend and next\nweek.\nSo let's talk about them.\nWe'll wish these folks that having a birthday, they'll have a great birthday.\nSo we'll start with the gentleman we see up front.\nScotty Long.\nScotty.\nHow old are you, man?\nCome on.\nDean Gerald Green, he's got another birthday, Chairman John LaHood.\nThose are, well let me ask Sunday is Scotty's birthday, cheese to his Gerald's, Dean Green's\nbirthday, Therese's chairman LaHood's birthday Friday, referencing Robert Fanoi, Robert\nHappy Birthday, Chairman Noel Williams, happy birthday to Noel\non Saturday, to 24th, his representative, Ann Allen Westbrook.\nShe was here a moment ago, happy birthday to her, and Sunday, boy, the clerk's\noffice is getting up there. Our own Carrie Vic has a birthday on the 25th, Carrie\nHarry, happy birthday. You've got a hard-to-go with the people you work with.\nI can tell you that, no doubt about that.\nI think that completes our announcements, our birthdays.\nSo, Yon, we'll encourage you all to be here next week\nand participate where you're required to be participating\nas we go through our budget hearings.\nAre you going to mention anything about that, Mr. Leader?\nI think that was enough.\nI think everyone's got that.\nWe're good.\nWe're good on that.\nThe majority leader of this house,\nRepresentative Eftration, is recognized for our motion.\nThank you, Ms. Speaker.\nI move that this house stand adjourned\nuntil Monday, January 26, 2026 at 10 a.m.\nHope everyone participates and has a good weekend\nas we celebrate the Martin Luther King,\nMartin Luther King, Jr. Halliday.\nSo I hope you all will participate in your communities\nif you have it already in that holiday\nand those celebrations of their his life.\nOn the motion of the majority leader,\nthis house stand adjourned until 10 a.m. Monday,\nJanuary the 26th, 2026 times flying.\nAll those in favor will say aye.\nAll those that are opposed will say no.\nCouple of us are leaving.\nWe're going to be adjourned.\nThe rest of y'all can stay here.\nThis House will stand adjourned until January the 26th.\nThank y'all.\n",
  "updated_at": "2026-02-12T10:58:52.998298+00:00"
}