{
  "video_id": "EptpLhs51G8",
  "url": "https://www.youtube.com/watch?v=EptpLhs51G8",
  "title": "Rules Meeting for the 2025 Legislative Session",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2025,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 52,
  "summary": "Here is a structured markdown summary of the Georgia Rules Meeting session:\n\n**Overview**\nThe committee discussed Senate Bill 255, which would regulate litigation financing in Georgia. The bill went through several changes in committee, including clarifying disclosure requirements, adding an appeals process for denied applications, and adjusting the effective date to allow the Department of Banking and Finance more time to set up the new regulatory framework.\n\n**Key Actions**\n- **SB 255**: Regulates litigation financing in Georgia, establishing a registration and disclosure system overseen by the Department of Banking and Finance.\n\n**Bills Introduced (First Reading)**\nNone noted.\n\n**Notable Moments**\n- Committee Chairman Lebritt provided a detailed overview of the changes made to SB 255 in committee.\n- Representative Kim Williams raised a question about whether the Department of Banking and Finance has adequate staff and resources to effectively take on the new regulatory duties under the bill.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was present to conduct business.\n\n**Adjournment**\nThe meeting adjourned, with no next session date provided.",
  "transcript": "Good afternoon everybody. If you would please come in and have a seat then we'll call the\nHouse Room Standing Committee to order and we're going to ask Dean Greene if he would open\nus with order prayer please. Let us pray. Lord I God, merciful God and all\nmighty Father in heaven. We beseech you, look upon us as your children and in spite of everything\nall of us are allowed to be your children and to praise you for all the good you are doing.\nAnd for all of us, as we come before you, in this place of democracy that we pray in your name\nto bless us and guide us and direct us. And we're asking that you guide us all of those rough\nand tumbling spots in our lives. And as we do the will of the people, we pray, or Father,\nthat we do this in your name.\nAnd Father, we just ask you now that even in these hard\nand serious times, that you may hold fast to each\nand every one of us as we try to do that will bless us now,\nFather.\nGod is in direct us in the coming days\nand the Holy Name, we pray.\nAmen.\nThank you, Dean Green.\nAt this time, we got a couple of items that are in the\ncommittee we want to deal with and I'm going to recognize Chairman Lebritt who\nchaired our subcommittee on lawsuit reform to speak to Senate Bill 69.\nThank you, Mr. Chairman. Ladies and gentlemen, committee I'm presenting to you\nSenate Bill 69 for your consideration. This is part of the governor's so-called\nlawsuit reform or tort reform package. This is the bill that would regulate\nlitigation financing that is financing oh yeah I'm sorry the LC numbers\nexcuse me is LC 49 2382 EC at and I'm sorry that's the old one nevermind\nhold on a second what is the yes 2385 S thank you that's the one that has all\nthe changes that I have marked on my drive so that I can explain them to you but\nSo the bill, what I said previously is still accurate.\nThe bill would regulate litigation financing\nand would set up a regulatory infrastructure, if you will,\nwhere out of the Department of Banking and Finance,\nwhere they would be these entities\nthat provide the service of litigation financing,\nwhich is defined in the code,\nwould have to register with the Department of Banking Finance.\nThey would have to disclose the department information\nabout who the principles in the company were.\nand then there are certain prohibitions on certain actions and prohibitions on ownership by foreign adversaries.\nThere is also a requirement that they enter into written contracts with the folks to which they provide this kind of financing.\nThey have to have certain disclosures on it. There has to be a five day ride of recision or cancellation in the contract and there are certain penalties if they violate any of those provisions, one of which is the contract is not enforceable.\nThere are also provisions that allow for enforcement by the state,\ninvolvement by the attorney general, and then an effective date.\nNow, there are a few changes in this bill that were made in committee,\nso it differs from what came over from the Senate.\nThere's a very finite number of them, and I thought I might just touch on those\nif you've looked at the Senate bill and are just curious about the changes.\nSo one of the changes is in page five, in lines 112, the 115,\nthere was a requirement there that in order to register,\nyou had to put in, if you were a corporation,\nyou had to put in your articles and corporation specific language\nabout litigation financing.\nThat was stricken because at the time you apply\nand form your corporation, you weren't registered.\nAnd so it would not, it would be in the statement,\ninclude those in the article. So it was sort of a, it was a nonsensical requirement. Nobody\ncould comply with it because of the sequence. You normally form the company and then you\nwould apply. So that, that was removed. Online one, I'm sorry, I'm still looking at my draft.\nPage six, where there is a percentage stated about the middle of the page for entities of the\ndisclosure of people with an interest in the entity that was changed from 5 to 10% that\nthat's more 10% is a print and more standard in the banking world and banking\nand finance have requested that. There is a prohibition about engaging in\nlitigation finance if you are a foreign person a principal or sovereign\nwealth fund of a foreign adversary under 15 CFR section 7.4 that language was\nclarified. The section 710-3 is brand new. That was requested by banking\nfinance and deals with denials of applications to be registered. So if your\nrequest for a license is basically denied, that section deals with what it can\nbe denied based on and what the appeal process is if you feel that you've been\nwrongfully denied. We also added some exceptions. There is a prohibition on\nbasically kickbacks. You can't have rebates or fees paid for signing up with\none of these financiers and there was a prohibition on that but it was so\nbroad it arguably would preclude them from paying their employees in their\nsales agent so that we've added language to make that permitted. There was a\nThe prohibition on assignments, but we've narrowed that a little bit to clarify when that\ncan apply.\nThere's also a prohibition on someone providing services, having a financial interest in the\nlitigation, and that has been clarified.\nIt's services that are related to the litigation itself.\nThere also was an exception.\nThere's a provision on joint and several liability that basically says a litigation financier\nhave joined several liability if there are any kind of penalties or fees or sanctions imposed in\nthe underlying case that they financed and they put some limits on that that it would it would\nhave to be if the financing is 25,000 more in funds and if the right of repayment is fixed by\ncontract the liability won't exceed what they were going to be paid under the contract.\nAnd then there was a word, there's an exception for regulated lenders and we took the word regulated\nout so it would plot to any lender, as the facts are known, is the Aunt Sally exception.\nAnd the effective date, well I'm sorry it was one other section, there's a section 7, 10,\n10 would allow the banking department to use their existing sort of computer system for\nlack of a better word in their existing licensing system for this licensing as well.\nAnd then the effective date was changed.\nI think it was going to be July 1, but banking finance said it may take us more than a couple\nof months to get all this set up.\nSo it's been placed to January 1, 2026 for the bulk of the bill.\nThere is also a provision that provides litigation financing agreements can be discovered.\nYou can get discovery or you can find out about them in a lawsuit.\nAnd that will be effective upon signature, so, but the rest of it in terms of what I view to be the primary for us and what most of the bill involves would not be effective till January 1, just giving Mike the finance and time to get all the set up and ready to go.\nSo that is the bill, Mr. Chairman.\nYou've heard the explanation to him a question.\nKim Williams.\nThank you, Mr. Chairman.\nAnd I'd like to chair him, however, you don't.\nAbsolutely fantastic job perfect in this Senate bill.\nBut the question, my question is I actually absolutely\nagree that the Department of Banking and Finance\ndoes a stellar job of licensing regulated financial entities\nin Georgia.\nBut to that point, did they have adequate staff\nin its main consideration of making sure that there's an appropriation, sufficient amount\nof appropriations, headed that way to be able to allow them to do this job effectively.\nNo detriment to the other regulatory duties that they're all pretty much overstabbed with\nalready.\nI have to confess, I do not know the answer to that question, but I would assume those\ndiscussions have been had between the Governor's Office and that department to confirm that\nbecause they did have input on the bill.\nMr. Chairman, thank you, and thank you, Mr. Chairman, for your work on this bill.\nI did want to just call the committee's attention to lines 273 through 270, it's a long sentence.\nLet's just go all the way to the end, 281.\nYou described the provision, which is this provision in the bill that will hold a funding company jointly and\nseparately liable for the conduct of an attorney in the case, or a person who is a party to the case.\nYou said they can be held liable in your presentation, but the wording of the bill says they shall be liable.\nAnd so I guess what I'd like to understand, because I think that, and I'll say this in a second,\nI'd like to understand why if a funding company abides by every single rule in this bill should it pass,\nand they become a good business organization under the law, they do everything right,\nincluding not participating or trying to influence the litigation, they can't control what the lawyer does in court,\nWhy are we going to force them to be liable for something they cannot control?\nIt seems to me that this is designed to just flat out discourage anyone\nfrom ever becoming a litigation financier.\nAnd I would like to know also if we couldn't just change the shall to may\nupon a showing that they actually did something that should require them to be liable.\nWell thank you for that question and I appreciate the lady correcting me.\nYou were corrected as a shall, it's mandatory.\nSo it does provide for mandatory joint and several liabilities if the financing is above that limit\nand subject to the limitation that the joint and several liabilities would not exceed the amount of the financing.\nI think you were calling for the benefit of the members of the full committee.\nWe did have some discussion on this and the lady who asked the question in my respect\nvery much proposed an amendment to change that and I know the lady does feel that is not\na good provision.\nI would say as I mentioned the committee, I don't want to assume the policy but it would\nseemed to me that the policy of this is that when the nature of these litigation financing\ncontracts, they are not like a conventional loan, and in essence, the litigation financiers\nalmost becoming a partner with the law firm on prosecuting lawsuit.\nAnd so while they are prohibited from any kind of control, I think there's some concern\nthat the possibility of control might still be felt.\nAnd effectively they are joining into a joint venture with a law firm on the litigation\nand therefore they having them be jointly and separately liable will make sure they're\ncautious and careful and do their due diligence about the matters in which they fund, which\nI think has been a concern in the past is that the financiers get into the business of just\ngenerating lawsuits to generate money regardless of the merit.\nNow I suspect not everybody would agree with that characterization but I think that\nthat's been a concern in this space.\nAnd so that is why I believe that particular policy\nposition was taken in the bill.\nI understood, and one follow-up, Mr. Chairman,\nI understand and have great respect for the Chairman\nas the Chairman will knows,\nand certainly understand the spirit of this bill.\nIt's a consumer protection bill,\nand as I stated in committee,\nI think there are lots of good things about this bill.\nI guess just to state the response to the chairman's point,\nhow would a litigation financier be able to predict in the future if they've done\neverything under this bill to make the right call and behave perfectly?\nHow are we going to then hold them yet to account for the conduct of the attorney\nand the people who are in the case.\nThe litigation financiers are not parties,\nthey are not at the table,\nthey cannot give advice to the lawyer\nabout how to conduct the case as this bill is very clear.\nSo even if they're perfect,\nthey're going to be forced to shoulder\nthe responsibility of an attorney\nwho normally is the person who pays\nwhen there is a finding of provolity\nor in inappropriate conduct in the case,\nI just would urge my colleagues respectfully\nto reconsider that position.\nI think it contradicts the spirit of the bill,\nand you really just disincentivizes anyone,\neven if they do everything right,\nfrom being in this business.\nOkay, was there another question?\nDo you heagly do you have a, nope, you wife?\nOkay, any other questions?\nOkay, you've heard the explanation from Chairman Leveritt.\nDo I have a motion?\nHave a motion do pass by substitute in a second?\nIs there any discussion before we vote?\nHearing no discussion, we'll put it to a vote.\nDo pass by substitute.\nthat's LC492385S.\nYep.\nOkay.\nAll right.\nAll those in favor say aye.\nAny opposed?\nNo.\nThe eyes have it.\nIt carries.\nOkay.\nWe have one other bill for us to be considered today.\nSenator Caslan, come on up and talk to us\nabout Senate bill 255.\nThank you so much.\nChairman, members of the committee, this bill codifies the legislature's\ninvestigatory powers. All legislative bodies, whether state or federal have an\nimplicit constitutional right to do their duties legislating, and to do that it\nrequires investigation of the facts and conditions circumstances that you're\ntrying to regulate or legislate. That's long established United States\nconstitutional law. In Georgia we also have a code section, it's section 45, 15, 17, and 19,\nthat specifically grants us that power of investigation and to issue subpoenas to accomplish\nour purposes. That code section was directed at Attorney General and it gave the legislature\nthe same powers that the Attorney General has to investigate. In addition we of course will pass\nresolutions either on the House side or the Senate side or joint resolutions that can create\nspecific investigatory committees and grant them through rule or resolution investigative powers.\nIn the course of chairing a committee that we've been looking into some activities of\ndistrict attorney, Bonnie Willis, in the Senate. This has been litigated. And the\nSpirit Court in Fulton County has agreed that our legislature, both the House and\nthe Senate, have the power to subpoena witnesses to conduct investigations\nwithin the scope of any resolution that might have created them. And they\nupheld our powers on all grounds alleged. In the course of going through that\nlitigation it occurred to me that would be wise for us to codify this in a code\nsection under the General Assembly and that's what this does and that's title 28\nbills with the General Assembly so it sets forth that both the Senate and the\nHouse of Representatives can through their rules your general rules of\nprocedure or through resolutions can authorize one or more committees to\ninvestigate certain subject matters and that's in the course of our legislative\nduty. It specifies in this that that gives you the power to administer oaths and\nhave sworn testimony before these committees that you can compel the\nattendance of witnesses through an issuance of a subpoena and you can\npel the production of books or documents or things through a subpoena for\nthe production of those documents and finally you could also require witness\nto give us a deposition to members of the committee.\nSo these are powers that we already implicitly have\nand the Senate granted our investigative committee\nthrough resolution and it codifies them.\nIt is by camel in nature equal powers to the House\nor the Senate if they were to exercise the right\nto create such committee or to have a joint committee\nto do that.\nInterestingly, I went to NCSL annual summit this summer\nand Louisville, and you know, they have all of those little seminars or sessions on different\nareas.\nOne of them was titled, Everything You Need to Know About legislative subpoena pilot.\nIt's just like they've created it for me.\nAnd I went and the legislators from every state were talking about how frequently they exercise\nit.\nThey use different methods.\nSome of them have standing investigative committees that are joint.\nMany times they get, they told just a litany of case law where every state has upheld the\nslagers powers to do investigations and subpoena witnesses and documents. In many of the cases\nthey told stories about where the push given take was between the legislative branch and\nthe executive branch. Some governors offices are not as open as ours and would not provide\nthe documentation or the data needed to form a budget. And so the legislative body would\nask for certain documents and financial records from different agencies to do it. But it\nIt was quite interesting that it's universally agreed, and I felt like it would be wise\nfor us to just put it in one code section, codify these powers that we really already\nhave, so that it would be useful for different legislatures going forward here.\nThere is a change in the committee sub one, was literally a typo of code section.\nWe had it mistakenly 45, 15, 9 and it should have been 19.\nThe other was that we just flipped the order of two paragraphs that was done between negotiations\nbetween the speaker's office and the lieutenant governor's office.\nDidn't change the wording.\nJust did that and there was one little tweak where it said we can create an investigative\ncommittee through a joint resolution or through joint rules of our legislative bodies.\nSome legislatures just have it built in their rooms like standing commuters is what that was\nreferring to.\nI hope I didn't take too long to talk about what's really a simple subject, but I'm\nhappy to answer any questions.\nA couple of questions for you.\nLeader Hugenie, I think there's a question.\nThank you, Mr. Chairman, to the senator.\nWhen this house becomes majority Democrat, what is going to stop us from investigating an\nofficer of the Senate?\nThis doesn't say you can investigate the other body, but you could form a special investigative committee and look into other matters.\nIs that the intention? Is that going to be allowable?\nAbsolutely. You know, the voters rule, whatever party is in control.\nAnd it may be, that way here, for too long, that there's one body, democratic and one Republican.\nThey could still work jointly, or they could have separate investigative committees.\nDid I get your vote?\nOkay, we're absolutely milling.\nThank you, Mr. Chairman. Good afternoon, Mr. Senator.\nExcuse me, just sort of a procedural question.\nOftentimes law enforcement, district attorney's offices, attorney general's offices,\nservices, who routinely use these types of tools to conduct investigation, have fairly\nextensive standard operating procedures that govern them, that set guardrails and boundaries,\nthat hold them to account for how they use, and frankly to keep them from misusing this\nextraordinary power. I would like to know do you anticipate there being some\nlevel of time spent drafting some sort of standard operating procedure for both\nchambers either body if we are going to to codify this which I you know I\ndon't disagree with the courts about the power just wondering if we are also\nSo going to give some thought about intended and unintended consequences and maybe draft some guard rails around how we use this power.\nYeah, that that is accurate and that's one reason we specifically say through joint resolutions or joint rules.\nI think that would be the appropriate place to do that the other sort of guard rail as you mentioned is the resolution creating the investigative committee or whatever committee is that you give.\ninvestigative powers. The any subpoena issued or witness is called by such a\nbody has to be within the scope of the authority granted to it. Okay, and then\nso I guess would it be on a case-by-case basis so that the under what I think\nyou're anticipating here is that this is addressed per resolution as the\ncases come that we then would define and decide what the guardrails are or\nor would you be open to some sort of standing policy\nthat encourages best practices\nand has a consistent guardrail for how we use this.\nJust wondering your thoughts on that.\nThis contemplates that that could be done\nand it may be done in the future.\nThis is something that may not be used for another decade.\nIt may not be utilized\nIf our current committee process is getting all the information we need voluntarily and for the large part, we are that but no, I would contemplate that we might have joint rules or resolution guardrails between the House and the Senate or each body might adopt their own to have parameters that resolutions, but you're protected because no committee can exercise these powers of less, there is a resolution from that body granting them this power, so it's going to take the majority of the House\na House committee and that resolution will say what your mandate, your limits of\njurisdiction or vice versa in the Senate or if they find it's something\nnecessary to have a joint committee which would be encouraged to build those rules\nin. Thank you. Last question. You said it might be a decade before we use this\nand I you also referenced the district attorney, Bonnie Lewis and\nPoulting County. When was the last time or whenever has the General Assembly attempted\nto codify or exercise its subpoena power that you're aware of aside from Madam District\nAttorney, Fannie Willis?\nI can't tell you the year but there is Georgia case law of a Georgia House committee that\nhad a similar type investigation of the activities of the member. It might have been the Senate.\nmaybe, but that was, let's say this much,\njust my 19th year was before the end.\nThis is the first time in my tenure\nthat we've done it in the Senate.\nAnd I don't think it's something that will be frequently used.\nI think it will be a rare instance,\nnot like a standing committee doing it,\nunless that's the little bit.\nI did leave out one thing is,\nso how do you enforce these subpoenas?\nAnd it specifies in this bill that if you were to issue\nsubpoena and it was ignored or denied for some reason. You go to the superior court where\nthe witnesses being compelled to testify and ask them to enforce it through a motion for\ncontempt. Thank you, Mr. Chairman. It probably was a\nSenate member. Y'all investigate it way back. But thank you for work on this. And this\nis just getting the weeds. I'm just trying to understand it. Line 15 says the Senate or\nthe House of Representatives made through rules of procedure or through a resolution,\nauthorized one more, one more committee to set chain of the exercises, the investigatory\npowers. So when we pass our House rules each year, that could be written in our House\nrules, right, the ethics committee can investigate or.\nJust, just almost like where you create all the committees in the number of members, you\ncould create an investigative committee by your rules.\nAnd if each legislative session, I mean, not by any will, and the follow up that so if they happen to absent the rules that became a compelling need and through resolution that we could do that, that it comes through the whole body, either will have to be and under either of those circumstances, if the rules have to be adopted by the body and a resolution would have to be adopted by the majority.\nThank you.\nThank you, Mr. Chairman, to the Chairman and the well have three areas of questions, and I'm going to be fast, hopefully.\nThe first one is just sort of a nerdy, making sure we write good law, code question.\nSince we've got 45-15-19, and that's referenced on line 20, I was wondering if there was any consideration for doing away with that.\nway with that code section and just having this because it seems like we've got, we're\nsetting up a new code section but then we're referencing an old one and I was wondering\nif that was, if there was a particular reason why we did it that way.\nWe wanted this to be additive cumulative to give, make it clear that this in no way\nabrogates the prior authority by that statute.\nIn fact, if you look towards the end of this starting on lines 53 on, it makes it very\nclear that the implementation of this would not be interpreted in any way to\nadvocate, modify or supersede or cancel out the existing powers that we have\nboth implicitly in the Constitution and in that existing code section.\nThis 45-15-19 is currently an interpretation of that is currently on appeal to\nthe Court of Appeals, is that right?\nNot that I'm aware of.\nI think you would probably agree with me, just the political climate everywhere, that\nif one party is in charge of these investigatory committees, they're either party,\nDemocrat or Republican, you've got a chance for abuse.\nAnd so I was wondering if you would be open to an amendment about making sure\nsure that the committees were bipartisan, that we have a requirement that they be bipartisan\nin relation to their numbers in each chamber.\nI think that should be left each body to their own rules or resolution, how do they want\nto handle that?\nAnd we adopted rules of the Senate's best-invested committee, which by the way would unanimously\nadopt it by partisan, every member of both Democrats and the public can agree to our rules,\nthey set forth, you know, who would serve on the committee the number of minority party\nmembers that would be included. We built in that the minority leader would be and designated\nmembers. So I think that's probably best left to each chamber to the side. And as you\nall have pointed out, one might be Democratic one day and one Republican at the same time\nand they both may have different ideals of how to go about it. I think I like that flexibility.\nWell, wouldn't you agree, though, that if we put in some guardrails that said the membership\nis always going to be commensurate with the numbers that we, number one, ensure that\nthey're always bipartisan, number two, we ensure that they don't get out of whack with at\nleast the wisdom of the voters that sent each of us here in our respective districts\nand that, you know, to your point, would win, not if, one day I get to wear a majority\nparty badge, there wouldn't be bad behavior on our side to keep, to keep the then minority\nparty out of these committees. Don't you think it would be safer for everybody if we put\nin some guardrails in that regard?\nI think you might be starting with the presumption that the legislative function of coming up\nwith good policy by doing investigations is a partisan venture and I don't buy that.\nYou know, I think that what we ought to be doing is passing good laws.\nIn fact, my committee's task is not to in any way undermine any prosecution.\nIts job is to find out ways to restore public confidence in the criminal justice system,\nnot weaponize the judicial branch to restore our faith by looking for legislation that we\ncan pass or amend to restore that confidence. So the committee is looking at some behavior\nthat is greatly undermined public confidence but not to prosecute or criticize that individual\nbut to find laws to make the guardrails as you're talking about what's appropriate prosecutorial\nbehavior so that our citizens will have more faith in that system. So I would think that's\njust our example. There might be, it might be something we're looking at in, you know,\nthe price of gas or something. What's a good policy to do in that? That wouldn't really\nbe a partisan deal.\nNo, I agree. My point was just to make sure that we stay that way. My last question is\ntrying to understand, and I think you've answered a little bit, the purpose could be we could\nhave any number of purposes, but we would hope that any body or joint\ncombination of the bodies that authorizes one of these investigations has a\npurpose is looking to find out something in order to do something about it.\nIf there is a problem as opposed to just airing dirty laundry, so I was\nwondering if you would be open to having a subsection added that requires the\ncommittee in any committee that's authorized to report out any findings,\nconclusions or recommendations because otherwise we've just set up committees\nto investigate and talk and perhaps embarrass but without any so what what are\nwe going to do we've investigated and then what yeah that I mean that's the\npurpose it's to do our legislative funds to pass bills and to get the\ninformation needed to give good logical sound decisions, create good public policy. Our committee\nby its resolution does require such a report. What would we learn? What are our findings? What are\nour suggested amendments or changes or creations of new laws? I don't have a problem with that at all.\nI don't think that's necessary because I think it will be in any resolution that forms one of\nthese committees because that implicitly that's the reason for these is to assist us and\nand the legislative function in the passing of the good laws.\nSo I don't mind if that was to be the will of this committee.\nI don't think it's needed or mandatory\nbecause I think that's inherent implicit\nin the whole function.\nThank you.\nThank you.\nPart.\nThank you, Mr. Chairman.\nI had a few questions as well along the lines\nof those asked by my colleagues.\nSenator Calcert certainly appreciate your intent\nof what you're trying to do.\nNow, I don't think, as you may have stated earlier,\nthat this bill is simply codifying or making a clearer\nexisting law.\nMy understanding with respect to the subpoena power\nof legislators is that the Georgia Supreme Court has not\nissued a ruling affirming or denying the power,\nbut it was a superior court that affirmed the Senate\ncommittee's subpoena power specific to the circumstances\ninvolving Madam District Attorney Willis.\nThey haven't, because it hasn't been appealed.\nShe apparently agrees with the ruling.\nSo the board has ordered or produced documents\nand to provide a time to appear for that position\nand they have agreed by the way to produce the document.\nSo there's not gonna be a need for that to be appealed.\nBut just so that we are all clear,\nthis legislation would be codifying explicitly\na new power would be that subpoena power.\nnot agreed. We already have that power. We have it in the code section and we have it in the\nConstitution implicitly implicitly just like a judicial review. Constitution doesn't say\nthe Supreme Court can review our actions to see whether or not the Constitution of Marburg\nversus Madison said hey this Constitution doesn't work unless you have that power or else we would\nnever have to follow the law. Nobody could host a countable. The Supreme Court has a series of cases\nis that it's at the same thing.\nLegislature has the power to investigate\nso they can do their role as a legislative branch.\nAnd then we have code sections as well\nthat allow that that weren't even necessary to start with\nbut they give us comfort.\nAnd I just wanted to put it in the section\nunder the General Assembly so it would be clear.\nAnd trust me, I am well aware of what's good for the goose,\nwhat's good for the gander rule.\nThere is nothing in this that I wouldn't gladly\nallow the minority party to exercise whenever they become the majority party again, if this\nis equal handed for the institution of the legislature and let the politics shake out where\nthey might, the voters will decide what party they want to go.\nSo I would respectfully disagree with a few of the comments made.\nOne, I don't think voters would want to see more politically motivated partisan secret\ninvestigations that this bill would likely permit.\nI think with respect to ensuring the confidence of all voters, not just voters of one political\npersuasion, one, we have elections that, you know, for example, with District Attorney\nFawney-Willis, she won her election with 80% of the vote.\nI think if anything, that where voters have an opportunity to hold elected officials accountable\nwill instill trust as opposed to, again, partisan committees\nwith the power of subpoena that has no guardrails\nas to the purpose or what they are investigating.\nI would not want to see that as either a member\nof the minority or the majority.\nI think to the point that Representative Evans made,\nI mean, is it unreasonable to have in this legislation guard\nat least two tiers of guardrails, one that would limit\nthese sorts of investigations into, for example,\nareas related to the misuse of government resources,\nareas in which both Republicans and Democrats\ncan agree upon that the legislature\nshould have a subpoena power as opposed to, again,\nallowing partisan committees, whether you're\nin the majority or minority liberal conservative\nto engage in politically motivated partisan investigations,\nwhich again, this bill currently committed.\nOkay, well, I gotta push back a little bit.\nThere is nothing secret about this at all.\nWe have the most open legislative process\nin Georgia in the state.\nI would imagine I'm on camera right now.\nAnd if you're sitting at home on your computer,\nyou could watch and see what I say.\nAll of our committee rooms are broadcast,\nlive stream and they have to be announced 24 hours in advance. That's why we have\na agenda so the public will know what we're going to be discussing. Nothing\nsecret. There has not been a single committee meeting of the Senate\ninvestigative committee that has not been live streamed and also televised for\nthat matter if the press was interested. So there's I reject anything that\nthis creates some kind of secret star chamber or somebody to do\ninvestigations that are in the dark of night. That's not true. Do you want to add\nsomething to this to create partisanship have at it. I mean, if that's a will of\nthis committee, this is not intended to be partisan in any way. It's the body, the\nSenate or the House, if their rules and their resolution, their majority's\npast, past what you own if you feel like you need to investigate. That's\nwhere it's coming from, the heart, not some sneaky side attack. You're talking\nabout, you know, the funny Willis thing. Well, it was a judicial branch that ruled that\nher conduct was inappropriate and made her be removed from that case. I clearly didn't do that.\nNobody here did that, but we heard about this appearance of impropriety that it's by the way been\nupheld by the court of appeals. No legislative input here whatsoever. But when they started talking\nabout it. The question became, is it clear what behavior is inappropriate? That's\nimproper, you know, relationships or whatever, or use of special prosecutors. And\nthat's what we do. What we want to do here is let's pass bills and say this is\nwhat we expect of our prosecutors to conduct. So that makes their lives easier in\nthe future as well. So they don't have to wait for the court of appeals to\nthe term on a case by case basis. That's that's where we're trying to get. So I hope I can put all any\npartisan fears here that this is a weapon that's going to be used by the Republican Party or one day the Democratic Party\nto attack people is to investigate into the legislative. So a few just a few comments to your response and then one final question. So\nis it not true that Georgia sunshine logs do not apply to the state legislature?\nthat is true and I think with respect to you know the structures you know the\nbicameral nature in which this bill would apply I think I would be a little\nmore comfortable had we you know had independent redistricting reform to ensure\nthat again voters have an opportunity to choose elected officials as opposed to\nyou know some of the gerryman who that again provides a partisan slant that then\nallows a partisan committee under this legislation to proceed in a way that, again, they can proceed\nin a politically motivated manner if they so want.\nI trust and I understand your intent.\nThat is not what I'm assailing.\nIt's the potential effects and harmful unintended consequences that may result from this legislation.\nWhether Democrats or Republicans are in the majority that I'm concerned about.\nthing. Again, going back to guardrails, both us to scope of limitation, but can you speak\nto guardrails with respect to separation of powers? Is there judicial oversight over these\ninvestigations? Can you speak a little bit more to you?\nAs I mentioned earlier, if you get into the enforcement provisions of this, and that\nthis really blinds like 30 on page two.\nWhat do you do if you issue a subpoena?\nHere's back to separation policy.\nLegislative branch issues a subpoena.\nDoes somebody in the executive branch\nor somebody in private practice\nthat they wanna know what's going on\nso they can solve a problem?\nThis is where the judicial branch steps in\nbecause to enforce that subpoena,\nyou go to the superior court\nwhere you're trying to compel the production\ndocuments or the testimony, and that judicial branch then gets to determine whether it's\nreasonable what you're seeking, whether it's justified by the law, by the scope of the\nresolution for creating that committee.\nAnd only if the judge says your subpoena was enforceable, the recipient did not have\njust calls to do it, can they be compelled to comply?\nSo that's the best I can tell you as far as the separation of powers, it's implicit\nBut with respect to enforcement and holding folks in contempt, I certainly understand where\nthe court would be coming in.\nAt least my reading and additional concern is that this may be undermining the judiciary\nand checks and balances with respect to, you know, whether certain subpoenas are treated\nconfidentially or not. You know, I'm looking at lines 44 to 52. If a court\nstates that confidential treatment is not warranted, would a partisan\ncommittee be able to, you know, proceed? Yeah, if that separate branch of\ngovernment if the judicial system said, so that would come up if you asked for some\nsensitive information. And the recipient of the subpoena said, I don't want to give this\nup unless I can be told it and be kept confidential. And that's what this gives you the proper ability\nif the subpoena issue or doesn't agree to hold a confidential, the judge can order you\nto do that. I mean, that's a protection for people from having to disclose confidential\ninformation in order to assist us to do our job. I mean, you're talking about the Judicial\nBranch. Well, they ought to welcome our investigation. We just voted on my pay raise and we did that\nafter committee hearings being told by public comments, our judges are underpaid and we need\nto pay a more to get good qualified people to do that. Well, what if they refuse to tell\nus what their French benefits were and we couldn't, or with their retirement package in\nsome committee, said, well, by golly, we're going to order a subpoena so we can learn\nthis information. We would have the right to do that. We'd actually have the duty to\ndo that to properly legislate. So it's all this three-legged stool with the judicial\nexecutive and legislative branch. This just makes it clear what our powers are and it\nsets limitations on them. Okay, we've had some really good explanations and some really\ngood question. You got one more question to rack it up. Okay. Thank you, sir. So when all\nof a sudden done, I appreciate your intent and where you're coming from with the bill\nper your analysis and in which the subpoena power of a legislative body has been used maybe once\nin 30 years, maybe not, maybe it won't be used for another decade, along with all of the potential\nproblems that this may cause, including, you know, undermining the trust that voters have\nfor us as legislators to be fair and to act in their best interests. I think, you know,\nadditional work may likely be needed on this. Again, just to ensure guardrails that\ninstills public confidence as opposed to potentially creating another tool for\npolitically motivated investigations. But thank you so much.\nOkay, like I said, we've had good conversations and good questions, recognized Jim Hatchett.\nAt the appropriate time, I'd like move, do pass, SB 255, substitute LC 47, 368, 1S.\nThis would be the appropriate time, so the motion, is there a second?\nsecond. Any conversation? All those in favor say aye. All those opposed say no.\nTheir eyes have it. Okay it passes. Mr. Chairman I had my button pushed to make an\namendment. If we're going to be a committee it seems like the members at least have\na chance to have discussion and amendment. We had already gone through all of these\nand you'd had questions and several others too but I didn't know that you\nwanted to make an amendment I'm sorry. Well that's why I pushed my button I don't\nI don't know how else to be recognized in here.\nI'll yell out next time.\nThat would be the preference.\nThat would be fine.\nOK, thank you.\nOK, that takes care of those two items.\nNow we're going to adjourn the House Rules Standing Committee\nand convene the Committee on Rules.\nGot a couple of cleanup items we need to do here.\nbit Leo pass out some documents to you there.\nYou\nYou\nYou\nOkay, I've had a request to recommit Senate Bill 51 back to the committee on governmental\naffairs.\nI hear a motion.\nHave a move in a second.\nAll those in favor say aye.\nAny opposed?\nOkay.\nIt's back in committee.\nSenate Bill 9 was presented to the committee several days ago and it's on our\nconsideration calendar. I have a substitute to Senate Bill 9 and that's what\nyou should have there. It's the exact bill that we had with one exception. The\nonly changes are online on page 6 on lines 124 through 129 adding the\ndefinition of person, the chance to look at that.\nIf you've had a chance to look at that, I'd like to entertain a motion that we do pass\nby Substitute Senate Bill 9 with that one addition there.\nMr. Chairman.\nYes, ma'am.\nI'd like to make a motion that we adopt LC 560401S as the rule substitute to SB 9.\nOkay.\nWe have a motion and we have a second.\nIs there any opposition?\nOkay.\nit's adopted then. Okay, now let's do this. Let's set a calendar for\nrules calendar for tomorrow. That'll be Thursday, legislative day 36.\nOkay, Senate Bill 9 is room substitute, the LC-56-0401S.\nmove in a second is in your position it's on Senate bill 63 have a move and second in your position\nit's on Senate bill 72 moved and seconded in your position it's on Senate bill 85 moved and\nseconded, any opposition? It's Senate bill 233, moved and seconded, any opposition?\nIt's okay. That sets our calendar for Thursday and we are adjourned. Thank you.\n",
  "updated_at": "2026-02-12T17:39:39.200422+00:00"
}