{
  "video_id": "EQ06FUPlQ7o",
  "url": "https://youtu.be/EQ06FUPlQ7o?t=1114",
  "title": "Georgia House - Day 32 (2026-03-21)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 32,
  "video_date": "2026-03-21",
  "duration_minutes": 57,
  "summary": "Here is a structured markdown summary of the Georgia House session from 2026-03-21:\n\n## Overview\nThe session featured a Scripture reading and prayer by the House Rules Committee Chairman's pastor, who discussed the concept of the \"Year of Jubilee\" and the importance of self-control as the state emerges from recent challenges.\n\n## Key Actions\n**HR 279**: No description provided in the transcript.\n\n## Bills Introduced (First Reading)\nNo new bills were introduced according to the transcript.\n\n## Notable Moments\n- The House Rules Committee Chairman introduced his pastor, who delivered the opening prayer and sermon.\n- The pastor discussed the importance of self-control and the biblical concept of the \"Year of Jubilee\" as the state recovers from recent difficulties.\n\n## Votes\nNo recorded votes are mentioned in the transcript.\n\n## Attendance\nThe transcript indicates that the presiding officer called for all members to report to the floor and take their seats, suggesting a quorum was present.\n\n## Adjournment\nThe transcript does not mention when the session adjourned or the date of the next scheduled session.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThey are, if we're convening having arrived all members of this house, will please report\nto the floor and take your seats.\nAll members of the house will please report to the floor and take your seats.\nThe clerk will ring the bell.\nAll members of this house will please report to the floor and take your seats.\nWe're going to have the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nWe have all members voted, have all members voted, if so the clerk will lock the machines.\nkeepers will please close the doors and keep them closed. Well good morning. I hope\neveryone had a great weekend and ready for a good week here because we work our\nway toward the home stretch. We will begin our day with Scripture reading in\nprayer by the chaplain, after which we will pledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the gentleman from the 134th House District,\nthe chairman of the House Rules Committee, Chairman Richard Smith.\nChairman Smith.\nThank you, Speaker.\nBefore you all start asking questions to the pastor as we're leaving, yes, he is my pastor.\nI do have a pastor.\nI had to tell a couple of y'all that up front.\nYou know, I was thinking about what I wanted to say, and I hope that all of you during\nyour life have someone that you can call a mentor, and in a lot of cases I hope that\nmentor is someone younger than you, looks things that with a little different perspective\nthan you do.\nAnd that's who my pastor, Jimmy Elder, he has pastor first, after his church in Columbus.\nHe's my friend, he's a mentor, and he's my pastor.\nAnd with these individuals, like my friend Jimmy Elder, you develop a real particular\nrelationship with them when they presided over the barrel of your grandchild, but they\nalso presided over the dedication of a couple of your grandkids.\nSo you develop a real strong relationship with them and Jimmy Elders, one of those people\nthat I love and I consider my life a blessing that he's in.\nSo I'm going to start talking and give it to Jimmy, thank you.\nMr. Speaker, Chairman Smith, members of the House and friends, I'm honored to be here again\nand to be your chaplain for the day.\nI'm deeply honored to be here\nat the invitation of Richard Smith.\nHe is indeed my dear friend, he is a parishioner,\nand I always call him a statesman\nbecause his spirit and his commission in heart\nand commitment of heart is to do what's best for the state,\nbest for this house, and best for his constituents.\nAnd I can tell you that from personal experience with him.\nI am so grateful to be here.\nYou are a good people.\nAnd you have done so much good for us through these years.\nI'm grateful for who you are.\nOne of my favorite parts of my job\nis my interaction with children.\nWe have a children's message at the morning service\nand I always do it.\nAnd I particularly enjoy doing that.\nI have a number of stories that have\nemerged from those times.\nAnd I'll have to tell you that, as an aside,\nthe chairman Smith's granddaughter, Jolie, is precious\nand is one of my favorite ones who comes down front\nand sits right at my knee.\nShe is a precious part of my life.\nMy story from this morning, though,\ncomes not from my experience with the children,\nbut from a neighboring church in Columbus.\nThe associate pastor of one of the churches there\nHe got up on a Sunday morning and he was sitting with the children and he asked them a question.\nHe said, can you tell me what is the longest prayed and oldest prayer in the scriptures?\nNow I'm sure he thought that they were going to say the Lord's Prayer.\nAnd I'm sure he probably was more interested in finding the prayer of Aaron from number\nNumber 624-26, which is the priestly or the eronic prayer of benediction, but the answer\nhe received from one of the little children was something that really surprised him.\nHe said, what is the prayer that's been prayed the longest and is the oldest prayer within\nScripture?\nAnd one of the kids said, I know, I know, and he said, what?\nHe said, for self-control.\nAnd it just took him back completely.\nHe looked at the senior minister and he said, what do I do with this?\nSelf-control.\nIt wasn't the Lord's prayer, it wasn't the Aaronic prayer, it was for self-control.\nThe scripture says that out of the mouth of babes comes so much wisdom, and in this case,\nthat's exactly what happened.\nIf ever we have had our self-control tested, it's been over the last couple of years as\nwe face some of the most tense situations that I can remember.\nWe've been called upon to be disciplined and to make really good decisions.\nYou as legislators, along with our speaker and our governor, have led our state through\nthis COVID crisis in a most effective way.\nI personally am very grateful for your wisdom and for the courage that you have exhibited\nthrough this whole time.\nThank you for your wisdom.\nThank you for your guidance.\nyou for keeping us safe. Also, we've had to tap our self-control in attitude,\nspirit and cooperation as we've gone through this journey. The question is, what\ndo we do now? Where do we go now? As we seem to have crested and seem to have\ngotten to a point where things are getting back toward normal, where do we go\nnow. Things are progressing and sometimes struggling to get back to what that\nnormalcy is. As a minister I can tell you that I've seen that. And so what I did\nis I went to the scriptures and I looked at what would inform that moment. And I\nfound in the ancient biblical tradition the idea of self-control that we find\nin the Sabbath. That time at the end of the first creation, when God created the heavens\nof the earth, and for six days he did all sorts of things, and on the seventh day it says\nhe rested. What he created on that day was rest, and it was intentional, and it was given\nto us. And through the time the tradition parlayed that, and it took the seven day rest,\nAnd it said, okay, in seven years, we need to create a sabbatical.\nAnd in a sabbatical year, all the land lay follow.\nAll the things were put aside.\nYou didn't plant anything.\nYou could harvest whatever came up as volunteer, but you put no stress on the land.\nOur universities picked up that idea.\nAnd they started using sabbatical as a way for their professors to take a time to study\nand to rest and travel and write and refresh themselves before returning to the classroom\nand teaching our students.\nThat was so vital to the journey\nthat tradition instituted another special time\nat the end of seven, seven-year cycles,\nat the 50th year.\nAnd it was called the Year of Jubilee.\nIt was a special time.\nIsaiah 61 verses 1 and 2 contains this.\nThe Spirit of the Sovereign, Lord, is own me\nbecause the Lord has anointed me\nto proclaim good news to the poor.\nHe has sent me to bind up the brokenhearted\nto proclaim freedom for the captives\nand release from darkness for the prisoners.\nTo proclaim the year of the Lord's favor.\nThat's the Jubilee year, the year of the Lord's favor.\nNow why am I sharing this?\nBecause as we emerge from some of the difficulties\nwe faced over the last couple of years,\nwe need the release of a year of Jubilee.\nDuring Jubilee year, God commissions us to take full advantage of the life that we've\nbeen given and restore it to the full.\nThe Jubilee year is a time for reflection on our purpose, and it's time to take strong\naction toward accomplishing it.\nIt's a time when we're thankful for the grace of God and a determination to allow that grace\nto be poured upon all who are in our sphere of influence.\nNow deep in your hearts, deep in your hearts, would you not like to see everything renewed\nand restored, everything go back to some sense of normalcy?\nYou long for that.\nI do.\nWe can't undo what has been done and what we've been through, but we can move forward with\nthat renewed spirit and with that renewed attitude and help make things better than they\nhave ever been before. That is where Jubilee comes into the picture. We need the\nyear of the Lord's favor, whatever that means in terms of leadership and\nprogress as leaders. So what is a Jubilee year? Jubilee is when broken\nrelationships are mended. Jubilee year is when broken promises are forgiven.\nJubilee year is when bruised feelings are healed. Jubilee year is when the\ndistance from God is narrowed. Jubilee year is when the unfaithful renew their\npromise to faithfulness. The Jubilee year is when dead dreams come back to\nlife. Jubilee is when hope is restored. Jubilee is when God becomes central in\nour lives again. Jubilee is when everything new does not hold, everything\nbecomes new. We don't hold on to the past and hold the past against it. Jubilee insists\non visiting everything with fresh eyes, a renewed heart, a determined spirit, a newfound\ncommitment to the task that we've been called or in your case elected to do. I believe\nin Jubilee. I've called our people at First Baptist Columbus into a year of Jubilee\nAnd it has been absolutely wonderful.\nI believe we need a Jubilee year for our great state, as we restore, renew, and refresh\nour hearts and our minds, our souls and our relationships, our commitments and our leadership.\nI become excited when I think about the limitless blessings, the limitless possibilities that\nare there.\nThis takes self-control, it takes discipline, but the dividends are worth it.\nyou believe will transform our spirits and bless our great state of Georgia in an unbelievable way.\nIt will bring prosperity that we seek and enjoy a spirit of joy that will come into our lives.\nIt will bring unity. It will bring peace. You are key to what's happening here. You have to be\nwilling, no more than that, won't it more than anything else for Jubilee to\nhappen in your hearts and in this state? And if you do, you will look at\neveryone and everything with fresh eyes. In the ancient Jubilee, the land was\nreturned to the people, the debts were forgiven, everything became new. The great\npreacher Leslie Weatherhead was going on a trip and he went back to England to\nAlders Gate where Methodism began and he went into the little chapel there\nwhere Wesley was as he wrote strangely warned his heart was strangely\nwarned in that place. Weatherhead said I just wanted to sit there and just soak up\nthe atmosphere and while he was sitting there somebody came in a man didn't see\nweatherhead walked all the way to the front, walked up to the pew that was the John Wesley\npew, so a plaque on it, and on that plaque it said, on this spot, May 24, 1738, John Wesley's\nheart was strangely warmed. Immediately this older man dropped to his knees and he cried out,\ndo it again, Lord, do it again for me. May that be the prayer that we pray. Do it again, Lord,\ndo it again for each of us, may we draw close to the Lord and allow him to warm our hearts\nand lead us as we lead other people. You are so important to what happens. You are vital to\nwhat happens in this state now and laying the foundation for the future. It all deals with the\nrenewal of your heart and my heart as we look to the future and we can bring\nthings back to where they need to be. When you do it, there will be unity, there\nwill be prosperity for our great state of Georgia. You know, I'm going to close\nwith a prayer. And as we pray, I'm going to answer the child's question\nof the oldest prayer in the Bible,\nthe one that has been prayed the longest.\nIn fact, I will offer it for you now.\nThe Lord bless you and keep you.\nThe Lord make his face to shine upon you\nand be gracious to you.\nThe Lord turn his face toward you and give you peace.\nI add, may the Lord give you a year of Jubilee\nand the legacy of joy and success in his precious name, Amen.\nWill you join me for the pledge?\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands.\nWhen the nation under God is invisible,\nwith liberty and justice, crawl.\nMr. Speaker, thank you.\nDoorkeepers will unlock the doors.\nfor\nChair recognizes Chairman Hogan, the chair of the committee on information and audits.\nThank you, Mr. Speaker.\nYour committee on information and audits has read the journal of the previous legislative\nday and found it to be correct.\nAnd furthermore, Mr. Speaker, if you were born without wings, do nothing to prevent them\nfrom growing.\nChairman Hogan, the Chair of the Committee on Information and\nAudits reports that the Journal of the Previous Legislative Day has\nbeen read and found to be correct.\nIs there any objection to the confirmation of the journal?\nThe chair here is not and the journal is confirmed.\nThe clerk will read the resolution establishing the order of\nbusiness for the day.\nMr. Burns, on the 59th, it's following me establishes the order of\nbusiness and refers part of the period unanimous\nconsent, introduction of bills and resolutions, first reading and reference of house bills and resolutions,\nsecond reading of bills and resolutions, first reading and reference of Senate bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business for the day?\nThe chair here is none in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 1576 by reps.\nOne of the 89th Boatty, the 62nd.\nThe claim of the 100th.\nWilson of the 8th.\nCannon of the 58th and others.\nBill B. Todd on Actumand, champion 19 and Toddle, 45.\nThe fish go to Georgia.\nAnd today we're leading a labor practice.\nIndustry and labor.\nHouse Bill 1577 by reps of Davis, the 87th runner of the 85th.\nof the 85th, better than the 94th.\nEvans of the 83rd Tyler, the 91st and others.\nBill B. Todd on act to Melon act creating\na state court of cab county.\nThe Intergovernmental Accordination.\nIt's about 1578, but it rose to the 120th,\nWilliams, the 148th, homes of the 129th,\nand Mathis the 144th.\nBill B. Todd on act to provide for the designation,\nthe Chief Judge, the, you know,\na multi-judicial circuit.\nJudiciary House Bill, 1579,\nmembers and a buck to the 137th Bill B. Todd and act to provide a new charter for the city woodland.\nEnter governmental coordination. House resolution 1042 by members of Dempsey 13th Collins,\nthe 68th manor, the 56th gains, the 117th weed hour, the 119th resolution creating house study\ncommitting on unsheltered homelessness. Government affairs. That completes first readers.\nSecond reading of bills and resolutions the clerk will read House Bill 1574 by\nrepresent Taylor the hundred and seventy-third and Campbell the hundred and\nseventy-first Bill to amend and act to reincorporate and provide a new\ncharter for the city of Cairo House Bill 1575 by reps of Crow the hundred and\ntenth and homes with the hundred and twenty-nine the belts women and act\ncreate the Butts County City of Lavela City of Jackson City of Jenkinsburg\nWater and Sewer Authority House Resolution 1041 by reps. They've been at\nof the 94th and dredder of the 85th.\nA resolution urging the Supreme Court of Georgia\nto establish rules and best practices\nfor the creation of eviction diversion programs\nto be implemented by courts throughout the state.\nThank you.\nSenate Bill 615 by Senator Mullis of the 53rd,\nBill to amend and act,\nproviding a new charter for the town of Lierley,\nSenate Bill 616 by Senator Mullis of the 53rd,\nBill to amend and act,\ncreate a state court of Jatuga County,\nSenate Bill 620 by Senator Harold 40th,\nBill to authorize the governing authority\nof the State of Doorbelts,\nLevy and X-I's tax, Senate Bill 621 by Senator Harald the 40th.\nA bill to amend an act creating a new charter for the city of Doraville.\nSenate Bill 622 by Senator Harald the 40th, the bill to amend an act to provide new pump state exemption.\nFor the city of Doraville, add the alarm taxes.\nSenate Bill 623 by Senator Lucas of the 26th, the bill to amend an act to recunstitute the Board of Education of Hancock County.\nSenate Bill 624 by Senator Annavarte of the 31st, the bill to create the City of Cedar Town Public Facility's Authority.\nSenate Bill 625 by Senator Lucas of the 26 to build to amend the next grade in the\nBoard of County Commissioners of Hancock County, three second readers.\nThere are no reports of standing committees.\nWe're now going on to morning orders, going on to morning orders.\nminute each for morning orders. We got a lot to get done today. I have an\nadjournment resolution to take up. Till tomorrow. Chair recognizes representative\nTrey Kelly for a morning order. Give the gentleman your attention please as\nas well as the other members that will be speaking\non morning orders.\nMembers, please take your seats.\nTake your conversations outside the chamber.\ngentlemen, may proceed.\nThank you, Mr. Speaker.\nMembers of the House, yesterday the Polk County community\nlost one of our finest citizens\nwith the passing of Deputy Sheriff Terry Eason.\nDeputy Eason was a true law man.\nSomeone who loved his job in protecting our community.\nHe was a general child who had a strong sense of justice\nand always wanted to try and help out his fellow man.\nPlease keep his wife Teresa,\nhis son's Dalton, Tyler, and Jamie in your prayers,\nas well as our entire community and his family at the Polk County Sheriff's Office.\nI'll ask for a moment of silence and honor,\nO'Dephyr Eason.\nThank you, Mr. Speaker.\nChair recognizes representative Sains\nfor a morning order.\nThank you, Mr. Speaker.\nI rise today to commemorate a proud moment\nfor Camden County for award-winning Title I school system\nand for the Camden County high school wrestling team\nas they brought home the eighth consecutive state championship\nand their ninth overall.\nI'd appreciate if you'd join me in a round of applause\nfor their hard work.\nApplause.\nChair recognizes Representative Rhonda Taylor\nfor a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nI rise to in celebration of National Women's History Month to recognize a woman who has served\nat Merbally here in this General Assembly. Growing up in New Orleans, Pam Dickerson was recruited\ninto the political arena, often canvassing the neighborhoods during political seasons. She\nShe likes to say, politics has been in my blood for a long time.\nFormer representatives Pam Dickerson also served the District of 113, which includes\nportions of Newton and Rockdale counties.\nShe is the author of several pieces of legislation during her tenure and she has worked to create\nbipartisan relationships.\nPam lives in Congress where I also live and represent and so today I want to commend\nher and thank her for her service.\nShe has truly been a lawyer friend of mine over the years, and today we honor her and\nwe say congratulations.\nThank you, Mr. Speaker.\nThank you.\nThank you.\nI got a point about this.\nJay recognizes Representative Scothio for a morning order.\nThank you, Mr. Speaker.\nGood morning, colleagues.\nHow many of you are parents, raise your hand?\nI don't have to tell you how much of a joy it is that parenting is.\nThe day is single parents day in the state of Georgia, authored formally by a former\nstate representative Valencia Stovall, HR279 was signed by the governor into law in\n2018.\nSingle parents day seeks to acknowledge the accomplishments of single parents residing\nin Georgia, whether you're a single mom, a single dad, a grandparent raising grandchildren,\nA single parent by divorce widowed or parenting with or without a partner today is your day.\nWe each have single parents in our districts, so your assignment today is hashtag thank\na single parent day.\nThank you, Mr. Speaker.\nChair recognizes representative Burnell for a morning order.\nToday, I honor the 41 elected African-American women in Clayton County.\nClayton County has the most elected African-American women in the United States.\nAnd so we decided to write a book.\nIt's called Legacy Letters, a gift for tomorrow's leaders.\nAnd in it, each one of our elected women wrote a letter to the young ladies in our community.\nThank you.\nAnd also today is the day, the first day for the hearing of the Supreme Court Justice\nnominee, Contanjee Jackson Brown.\nThank you.\nChair recognizes Representative Wade for a morning order.\nThank you, Speaker, colleagues.\nIf you would rise with me, I want to share with you a story about a gentleman that I had\nthe opportunity to ask for your prayers in July of this year.\nHe, like many of Georgia's Americans and folks in our world, contracted COVID.\nHe was sent home, recovering, but his body did not do well, and later he was admitted\nto the hospital.\nHe's been fighting for a long time, and he lost that battle this past week, and today\nis his funeral back in my community.\nRodney Castlebury is a fine human being, a solid Georgian, and a person that I called\nfriend.\nAnd I want to do this really quickly, and I won't read the whole thing, but I want to\nshare with you as he lay and had to say goodbye to his family. He wrote this song and I'm\nnot going to sing it but I'm going to read you just the first little bit. I'm going to be\nsharing this with my community and his story is going to continue and I appreciate local\nnews channel 46 came to our community to start telling this story but it's one that I think\ncan speak to us all. Even if the plans I made all seem to change and the road that\ntraveled feels so very strange, even if the world seems to always knock me down,\nI'm reminded of Jesus, you're where my hope is found. Knowing you will hold my hand through this\nold weary world, you'll be right there beside me through the darkness of the storm,\nbecause heaven is awaiting and I know you will be there, so I'll trust you Lord with my whole heart,\neven if I don't understand, if you'll pause to remember Rodney, my friend.\nThank you, Speaker.\nChair recognizes representative Kennerd for a morning order.\nThank you, Mr. Speaker. This past Saturday, our community had a parade\nand a celebration for our own Collins Hill High School,\nwhen the 7A State Football Championship this past season,\nthe offense averaged a whopping 39 points a game.\nThe defense allowed only five points a game\nto their opposition.\nAnd I just want to say thank you,\nand congratulations to Coach Lenny Gregory.\nGo Eagles, thank you.\nDo you recognize his representative Carter for a morning order?\nGood morning.\nThank you.\nSpeaker Austin.\nThank you all for this moment.\nSo, 21 years ago today, I gave birth to this amazing young man.\nHis name is Joshua Azeha Micah Carter.\nHe's my third son, and he turns 21 today.\nI cried in the car like, oh my God.\nHe's 21.\nBut would you all join me in wishing Joshua a happy birthday?\nThank you.\nI yield the will.\nTo recognize his chairman, Duke Nick, for a morning order.\nThank you, Mr. Speaker, ladies and gentlemen of the house.\nyou have ever seen Georgia pre-K week and been asked to read a book to your local pre-K.\nThis is your friendly annual reminder that voices for Georgia children are sponsoring\npre-K week, October 3rd through the 7th.\nSomeone will reach out to your office for you to film you reading a book or going to\nyour local school.\nI hope you'll join me in supporting this initiative and going to read to those pre-K students.\nThank you.\nThat completes morning orders.\nWhat purpose does representative mom to hand rise?\nTo make motion.\nState your motion.\nI move that the rules be temporary suspended so that the read bills may be read for the\nfirst time and assigned to committee.\nClerk will read the caption of all three.\nUnnumbered House Bill to be entitled to enact authorize the governing authority of the city of Dallas to love you in excise tax\nUnnumbered House Bill to be entitled to enact to authorize the city of Dallas to exercise redevelopment and other powers\nUnnumbered House Bill to be entitled to amend the act to provide a new charter for the city of Dallas and Paulton County\nOn the motion of the representative, that the rules of this House be temporarily suspended\nto allow three bills to be read and assigned to committee, is their objection?\nIs their objection?\nThe chair here is none and it is so ordered, intergovernmental coordination.\nThe purpose is representative Ridley-Ryze.\nBaltimore and Treenquire are, I don't know.\nI need to build a bid for the first time.\nLet's try to make a motion.\nMake a motion, sir.\nState your motion.\nI need to build a bid for the first time in the signed committee.\nClark will read the caption.\nA numbered house bill to be entitled\nI'd like to amend and act providing a new charter for the city of Arnell.\nOn the motion of the representative that the rules of this house be temporarily suspended\nto allow a bill to be read for the first time in a signed committee, is there objection?\nIs there objection? Chair, here's none, and it is so ordered, intergovernmental coordination.\nThe clerk will read the caption to a group of privilege resolutions.\nRecognizing and commending, Brittany Ellison and for other purposes that completes the\nthe reading of the privilege resolution.\nIs there any objection to adopting the privilege resolution?\nThe chair here's none, and the resolution is adopted.\nWe have some announcements, if you signed up for an announcement,\nthen be down front and ready to go.\nChair recognizes representative Gullet for an announcement.\nThank you, Mr. Speaker.\nGovernor LaFaire's general government subcommittee will meet today at 2 o'clock, room 506.\nThank you.\nChair recognizes Chairman Billy Mitchell for an announcement.\nThank you, Mr. Speaker.\nThe Democratic caucus will meet at 11.30 at the State Patrol Auditorium.\nLunch will be served.\nIt's an in-person meeting at 11.30.\nThank you, Mr. Speaker.\nChair recognizes Chairman Collins for an announcement.\nThank you, Mr. Speaker.\nThe Public Safety and Homeland Security Committee, subcommittee A, will meet today at 2 o'clock,\nC-L-O-B, so please, members of that subcommittee, A, please try to be there.\nChair recognizes Chairman Darling Taylor for an announcement.\nThank you, Mr. Speaker.\nThe health subcommittee of the insurance will meet today.\nI'm sorry, tomorrow morning at 9 a.m. and 506.\nTomorrow morning, 506 at 9 a.m., thank you.\nChair recognizes representative Lewis Ward\nfor an announcement.\nThank you, Mr. Speaker.\nTomorrow, we're gonna celebrate women in agriculture.\nYou're all invited to join us in room 605, C-L-O-B.\nAnd the theme is agriculture beyond the farm.\nThat completes our announcements.\nI'm sorry we do have one more.\nChair recognizes Chairman Chokus for\nan announcement.\nThank you, Mr. Speaker.\nSmall business development will\nbe tomorrow morning at 8 a.m.\n5 o'clock, small business development\n8 a.m. 5 o'clock, tomorrow morning.\nThank you.\nLast call for announcements.\nrecognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move that this House stand adjourned until 10 AM Tuesday, March 22, 2022.\nMajority leader has moved that this house be adjourned\nuntil 10 o'clock a.m. on Tuesday, March 22.\n10 o'clock a.m. Tuesday.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe I seem to have it.\nThis house will be adjourned until 10 o'clock a.m.\nUse the March 22nd.\n",
  "updated_at": "2026-02-12T13:34:20.208972+00:00"
}