{
  "video_id": "Es_bsTzKmaQ",
  "url": "https://youtu.be/Es_bsTzKmaQ",
  "title": "Georgia House - Day 29 (2026-03-09)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 29,
  "video_date": "2026-03-09",
  "duration_minutes": 44,
  "summary": "Overview:\nThis Georgia House session on 2026-03-09 featured a scripture reading and prayer by the chaplain, as well as remarks highlighting the 76th anniversary of the creation of the Georgia Ports Authority. No significant legislation was discussed or voted on during this session.\n\nKey Actions:\nNone detected.\n\nBills Introduced (First Reading):\nNone detected.\n\nNotable Moments:\n- The chaplain, Pastor Timothy Adams, delivered an inspirational speech focused on the importance of hope, particularly in the context of the ongoing COVID-19 pandemic and its impacts on Georgians.\n- The Speaker recognized the 76th anniversary of the creation of the Georgia Ports Authority by the Georgia General Assembly.\n\nVotes:\nNo recorded votes detected.\n\nAttendance:\nA quorum was present, as all members were instructed to report to their seats for the morning roll call.\n\nAdjournment:\nThe transcript does not provide an explicit adjournment time. The next session date is also not mentioned.",
  "transcript": "There of convening having arrived, all members of the House will please report to their seats.\nAll members of this House will please report to their assigned seats.\nThe clerk will ring the bell.\nAll members, please take their seats.\nWe're going on to the morning roll call.\nAll members present will please vote green to signify their presence in the chamber and\nthe clerk will unlock the machines.\nhave all members voted, have all members voted, if so the clerk will lock the\nmachines. Well good morning or good afternoon, thereby feeling rested and energetic.\nOkay. Well, good news is we probably won't keep you long today. But we had a great day yesterday.\nBut doorkeepers will please close the doors and keep them closed. Chair wants to make mention.\nBefore we begin that today is the 76th anniversary of the creation of the Georgia\nPort's authority by this General Assembly, fastest-growing port on the East Coast.\nReally proud of those folks down there in the job they're doing.\nWe will begin our day with scripture reading and prayer by the chaplain\nafter which we will pledge allegiance to the flag of our country.\nOur chaplain this afternoon will be introduced by the gentleman from the 33rd House District\nRepresentative Rob Leveritt. Representative Leveritt.\nThank you, Mr. Speaker. Good morning, or good afternoon. I'm sorry, ladies and gentlemen,\nthe House. It's good to be with you again. It seems like we were here just a couple of\nhours ago. I'm pleased to introduce you today, Pastor Timothy Adams. You know, Tim, I\nwas so pleased that Tim came up here because I was worried it was going to be difficult\nfor me to find a pastor who would be willing to acknowledge and public that I was one of\nhis parishioners. So I appreciate Tim for that. He and I, I suppose you could\nsay, we've got a lot in common. He has a great love of scripture and I have a\ngreat need for them. Tim became the teaching pastor at the gathering at the\nfirst Baptist Church of Elberton in August of 2020. He's from Elbert County,\ngrew up in a town, aptly named Dewey Rose. That's a good trivia question if you\nneed that. Previously he had served as the senior pastor of Deep Creek Baptist Church, which\nis in Dewey Rose in Elbert County for 21 years. He's a 2008 graduate of level college at\nthe New Orleans Baptist Theological Seminary, where he received a BS degree in pastoral\nministry and biblical studies. He's currently working on an MA degree in professional counseling\nat Truett McColle University. Tim's been married to Patricia Haynes Adams for 26 years\nand they have a daughter Rachel and a son Will. Tim and Patricia currently reside in\nCalvert, Georgia, which is also in the district. So please join me in welcoming past rhymes today.\nI thank my representative, Mr. Rob Leveritt, whom we are very proud of back in District 33 for\nthis opportunity. Rob and his wife, Ms. Mary, are true blessings in our community and I believe\nthat all of you will see his value as he serves us here in Atlanta. I also want to thank\nSpeaker Austin for extending this invitation to me today. I want to read from Romans 5,\ntherefore since we have been justified by faith, we have peace with God through Jesus. We have\nalso obtained access through him by faith into this grace in which we stand and we boast in the\nthe hope of the glory of God.\nAnd not only that, but we also boast in our afflictions\nbecause we know that affliction produces endurance.\nEndurance produces character and character produces hope.\nThis hope will not disappoint us\nbecause God's love has been poured out in our hearts\nthrough the Holy Spirit,\nfor while we were still helpless\nat the right time Christ died for us.\nMillions of people all over the world\nand around this country and in our great state of Georgia\nare currently observing the season of Lent,\nwhich encompasses 40 days beginning with Ash Wednesday\nand culminating with the celebration of hope\non Easter Sunday.\nWhen I was in seminary, our professors always told us\nto look for repeated words in the text\nto determine the main points of the passage.\nThe word hope is repeated three times\nin the six verses that I read.\nThe word hope in the Bible is much different from the way we use hope in the English language.\nThere's a great deal of uncertainty in the way I use hope.\nFor instance, each spring I say, I hope this is the year for my brave to once again win\nthe World Series.\nOr each fall we bulldog fans say of our beloved dogs, I hope this is our year.\nWe hope, but we certainly don't know if either one of those things will happen.\nBut hope is described in the Bible as an anchor for the soul.\nHope is what keeps us from drifting too far away in the storms of life.\nOur world is in desperate need of hope today.\nWe are almost to the one year anniversary of Governor Kemp declaring a public health\nstate of emergency order in the state of Georgia because of COVID-19. We have\nlost so many good people in our state and because of the pandemic, just this\nmorning I received the news that one of my favorite people, Mr. Charles Moon, a\nnative son of Elbert County, and a veteran of the Vietnam War and Bronstar\nrecipient, passed away earlier today with complications from COVID-19. Many\nMany people in our state are hurting economically, emotionally, and educationally as the pandemic\nseems to drag on.\nThank God there is now a vaccine, and it is being administered rapidly.\nBut other people and families are dealing with the unintended consequences of the pandemic,\nas abuse and addictions are getting worse.\nMany of our citizens have lost hope that the things can get better anytime soon.\nlife can seem unfair and life certainly is hard. As one of my former teachers said,\nlife can be like a dirt sandwich and every day is a new bite. I have experienced\nhopelessness firsthand as I have dealt with depression in my own life which\nresulted in unintended consequences for me and the people that I love. But I am\nthankful to have come through to the other side and now I can see hope because\nAlthough I was down and out, I was not forsaken.\nThrough the love and care of my wife, Petria,\nand other people who surrounded me and loved me,\nI can stand before this house today healed and full of hope.\nPreachers and politicians are similar\nin that we both serve at the pleasure of the people.\nAnd sometimes they have to vote us out\nto remind us of that.\nBut we also have a unique opportunity in life\nBecause we are both in a position to offer hope to those who are struggling.\nFor those of you who have the pleasure to serve the people in the Georgia house, you can\noffer hope by extending a hand up to those who are struggling for whatever reason, or you\ncan level the playing field to ensure all Georgians have equal opportunity to compete fairly.\nAs God has helped us, we must also help others.\nI end with the words of the Apostle Paul from the message,\nthose of us who are strong and able in the faith\nneed to step in and lend a hand to those who falter\nand not just do what is most convenient for us.\nStrength is for service, not status.\nEach one of us needs to look after the good\nof the people around us, asking ourselves,\nhow can I help?\nAnd with that, I ask you to please stand with me.\nLet us pray.\nLord, we thank You for this beautiful day\nthat You have given to us.\nLord, we thank You for the Georgia House.\nAnd Lord, as I stand here, Lord,\nit's so easy for us to become cynical today\nabout politics.\nBut Lord, I've just been in awe\nas I have walked around the Capitol.\nAnd Lord, I'm in awe as I have met people, Lord,\nwho are doing good work here for good reasons.\nAnd so Lord, I pray your blessings upon them today.\nAnd Lord, I pray, God, that as they deliberate\nthat you would give them wisdom,\nthat you would give them clarity,\nand that you would give them courtesy\nin your holy name we pray.\nPlease join me in the saying of the pledge of allegiance.\nI pledge allegiance to the flag\nof the United States of America\nand to the Republic for which it stands\nOne nation under God indivisible with liberty and justice for all.\nThank you.\nDoorkeepers will unlock the doors.\nThank you.\nThe Chair recognizes Chairman Hogan, the Chair of the Committee on Information and\nMr. Speaker, your Committee on Information and Audits has read the journal of the previous\nlegislative day and found it to be correct.\nAnd furthermore, Mr. Speaker, the majority whip is always on to me about my age.\nHere's a quote from Gus McRae from the movie Lonson Dove, the older the violin, the sweeter\nthe music. That's one of your best yet. Chairman Hogan, the chair of the committee on information\nand audits reports that the journal, the previous legislative day, has been read and found\nto be correct. Is there any objection to the confirmation of the journal? The chair\nHere's none in the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns on 59th moves following me establishes the order of business that are in first\npart of the period unanimous consensus, introduction of bills and resolutions, first reading\nin reference of house bills and resolutions, second reading of bills and resolutions, first\nreading in reference of senate bills and resolutions, morning orders.\nIs there any objection to the\nadoption of the resolution\nestablishing the order of business\nfor the day?\nThe chair here is not in the resolution\nis adopted.\nFirst reading of bills and\nresolutions the clerk will read.\nHouse Bill 738 by the reps and we're in the 96th,\nBeverly the 143rd, much of the 88th Park of the 101st.\nGo field of the 60th and others.\nBill being titled an act to amend chapter 11,\na title two, chapter 12, a title 16,\narticle one of chapter two A of title 31,\nand chapter one of title 51 of the physical\nto Georgia annotated relating the seeds\nand plants generally.\nHealth and human services.\nHouse Bill 739 by the reps and a brothel\nin the 7th of the bill being titled an act to amend\nand act to provide a new charter for the City of Blue Ridge and\nFentany.\nIntergovernmental Coordination.\nHouse Bill 740 by Resubpent,\nand the 31st Building Title of Act to Men and Act\nincorporating the title of Pender Grass.\nIntergovernmental Coordination.\nHouse Bill 741 by Resubp.\nGo field to the 60th, Beverly, 143rd,\nScott of the 76, Hutchinson in the 100th and 7th.\nDavis, the 87th and others,\nwill be Title of Act to Men, Article 9 and Chapter 4,\nTitle 49, the official go to George annotated,\nrelating to temporary assistance.\nHealth and human services.\nHouse will 742 by Rosa Dubnick of the 29th.\nDonna, who are the 30th?\nHawkins of the 27th and Bar of the 100th and 3rd.\nBill Bitton and act to continue the existence\nof the Gainesville City School District.\nThe Intergovernmental Coordinations.\nHouse will 743 by Rosa.\nDickey the 140th of Bill Bitton and act to amend the act\nproviding a new charter for the city of Fort Valley.\nIntergovernmental Coordinations.\n744 by rest of the Nullowitz the 42nd Thomas the 39th Allen the 40th Bruce the 61st Smith the 41st and others\nThere'll be Tylenactum when and that creating a new charter for the city of Smirna\nIntergovernmental coordination house resolution 353 by reps of Canon the 58th Beverly the 143rd Williams the 168th\nResolution recognizing general Larry platinum dedicating a bridge in his honor transportation house resolution 354\nof our resolution, Gilear to the 162nd Resolution,\nrecognizing Mayor Edna Jackson\nin dedicating an interchange in Iran.\nTransportation House of Resolution 355\nof our reps of Representative Gilear\nto the 162nd Resolution, honoring the life\nof Representative Bobby Lee Hill\nin dedicating an interpretation member.\nSenate Bill 10 by Senator Jones,\nthe 10th, Butler of the 55th, James of the 35th,\nsay the 34th, Deb Port of the 44th,\nand others, Bill B. Todd,\nan act to amend Article 2, chapter 11,\nTitle 16, the fiscal to Georgia and Tate are relating offenses against public order.\nJudiciary non-sevel.\nSenate Bill 62 by Senator Tipkins of the 37th,\ngender of the 47th, Miller of the 49th,\nGouge of the 51st, Alvers of the 56th and others,\nBill being titled act to amend chapter 2,\nTitle 21 of the fiscal to Georgia and Tate are relating elections to primaries generally.\nSpecial committee on election integrity.\nSenate Bill 72 by Senator Mulles, 53rd, Miller of the 49th.\nGood to the 51st Albers, the 56th Hickman, and the 4th and others.\nBill Bintan and active men, chapter 2,\na total 21 of the physical to Georgia,\nannotated relating to elections and primaries generally.\nSpecial committee on election integrity.\nSenate bill 74 by Senator Mullis, the 53rd mill of the 49th,\ngood to the 51st.\nWalker, the 20th Albers, the 56th and others.\nBill Bintan and active men, chapter 2, a total 21 of the physical to Georgia,\nannotated relating to elections and primaries generally.\nspecial committee on election integrity.\nSenate Bill 90 by Senator Jackson.\nThe second Miller, the 49 Jones to the 10th,\nfollows the 53rd, Anderson to the 43rd.\nBill being titled an act to amend\nTitle 50, the fiscal to Georgia annotated,\nrelating to state government.\nState planning and community affairs.\nSenate Bill 97, my Senator Jackson, the second.\nHarvest of the 15th, Jones to the 10th,\nramen of the 5th, Jones to the 22nd.\nBill being titled an act to amend,\nCode Section 2366, the fiscal to Georgia,\nand the termination of in-state resident status.\nHigher education.\nSenate Bill 98 by Senator Beach,\nthe 21st Jones, the 25th,\nGooch, the 51st, into the 47th,\nand Watson, the 1st.\nBill B. Todd, an act to amend,\ntitle 32, the fish go to Georgia,\nand annotated, relating to highways bridges and fairies.\nRules.\nSenate Bill 106 by Senator Davenport,\nthe 44th Jones, this 22nd,\nto be the 30th, Simmers of the 12th,\nButler, the 55th.\nBillington, an act to amend Code Section 22742, the fish go to Georgia,\nand Tate relating multi-tiered system of supports.\nEducation.\nSenate Bill 120 by Senator Tipkins, the 37th Kennedy, the 18th cows in the 40s.\nSix Jones in the 22nd tillery, the 19th and others.\nBillington, an act to amend Article 3, Chapter 18, in Title 15.\nThe fish go to Georgia, and Tate relating the solicitors general, the state courts.\nJudiciary.\nSenate Bill 144 by Senator Tipens, the 37th Gooch of the 51st Cows of the 46th.\nMiller of the 49th, Summers of the 13th and others, the Bill of the 10th and\nact to amend Part 1 of Article 1 of Chapter 3 of Title 8 of the Fish Go To Joe Jan Teddy relating the general provisions for housing authorities.\nThe governmental affairs, Senate Bill 156 by Senator Harbin of the 16th, Tipens of the 37th, Lucas the 26th,\nHillary, the 19th Gucci, the 51st and others.\nBillionton, act to men, title 34.\nThe official go to Georgia and Teddy relating labor\nand industrial relief industry and labor.\nSenate bill 162 by Senator, by Senator Beech,\nthe 21st Alvers, the 56th and Thompson, the 14th.\nBillionton, act to men, code section 1562.\nThe official go to Georgia and Teddy relating\nthe number of judges, the superior courts.\nRules, the Senate bill 164 by Senator Hustetler,\nthe 52nd, Capatric, the 32nd,\nMark of the 36 Butler the 55th will be title an act to amend code section 15 11 471 title 16 and code section 31\n22 9.1 of the fiscal to George Antony relating the definitions relative to juvenile delinquency\nHealth and human services\nTwo of two by senator Burns the 23rd Miller the 49 to begin the 30th gender the 47th Anderson the 24th and others\nwill be entitled to an act to amend Chapter 2, Title 21, the official go to\nGeorgia and attend relating elections and primaries general special committee\non election integrity. Senate Bill 213 by Senator Harper the 7th paying the 54th\nfollows the 53rd, Summers the 13th and Goots the 51st, will be entitled to an\nact to amend Article 10 of Chapter 2, Title 20, the official go to\nGeorgia and attend relating the contracts and purchases by public schools.\nEducation Senate Bill 218 by Senator Walker the 20th, Dugan the 30th,\nPatrick of the 32nd, Miller of the 49th, Kennedy of the 18th and others,\nbuilding town of NACTA men, chapter 5, and title 45, the official go to\nGeorgia, antenna related to vacation of office. Judiciary, Senate Bill 225 by\nSenator Harbison of the 15th, red of the 33rd, painted the 54th, Dugan of the\n30th, Anderson of the 43rd, and others, building town of NACTA men,\nArticle 3, chapter 2, and title 40, the official go to Georgia, antenna related to\nprestige, license plates. Motor vehicle, Senate Bill 226 by\ncenter and a Varte, the 31st, Melissa's 53rd, Miller to the 49th, Gouge to the 51st,\ntops in the 14th and others, Bill Vintado and an active men, part three, Varte three,\nchapter 12, titled 16, the official go to Georgia, Antietta, relating to sale, a distribution\nof heart-prone materials. Judiciary non-civil. Senate Bill 234 by center,\nto Kennedy, the 18th, Strickland of the 17th, parent of the 42nd, Jones of the 22nd,\nWatson of the 1st, Bill Vintado and an active men, Todd of mine, and the official go to\nSenator George Antony relating civil practice.\nJudiciary Senate Bill 237 by Senator Harveston of the 15th.\nDougan of the 30th building town of an act to amend Code Section 42.\n86 of the vice-coded George Antony relating the special license plate.\nMotor vehicles Senate Bill 238 by Senator Strickland of the 17th building town of an act to amend Chapter 1 of Title 1 of the\nfiscal code of George Antony relating the general provisions so as to revise.\nProvision relating the enactment of the fiscal code of Georgia.\nCode revision Senate Bill 241 by Senator Dougan of the 30th.\nMiller, the 49th, Gucci, the 51st, Kennedy, the 18th,\ncouncil of the 46th and others,\nBill B. Todd, an act to comprehensively revise elections\nand voting.\nSpecial committee on election integrity.\nSenate Bill 247, my senator Anderson,\nthe 24th walker, the 20th, Miller, the 49th,\ngovernment of the 8th, summers of the 13th and others.\nBill B. Todd, an act to amend Article 2,\nchapter 8 of Title 2, the official go to George Ante,\nrelating to agricultural commodity commissions.\nAgriculture and consumer affairs.\nSenate Bill 253 by Senator Meredith Knight burns the 23rd butler of the 55th\ndoogin in the 30th Gooch of the 51st and others will be taught an act to men\nchapter 2 in title 21 the official go to Georgia annotated relating elections\nand primaries generally special committee only election integrity\nSenate Bill 256 by Senator Berk of the 11th Gooch of the 51st will Watson in the\n1st capacitive 30 second Hustle of the 52nd and others will be taught on\nan act to amend Title 12, Code Section 16, 12, 4,\nthe Fish Coda, Georgia, and Tata relating conservation\nand natural resources.\nHealth and human services.\nSenate Bill 260, by Senator Harper, the seventh,\nbeing titled back to amend Code Section 2, 12, 80,\nthe Fish Coda, Georgia, and Tata relating\nto promulgation adoption of rules and regulations.\nAgriculture and consumer affairs.\nSenate Bill 276, by Senator Kennedy,\n18. Strickland the 17th, Mulles the 53rd Harper the 7th,\nDugan the 30th building,\nTodd and act to amend code section.\nChapter 15 of title 36 of the official go to\nGeorgia annotated relating to county law libraries.\nJudiciary Senate Resolution 102 by Senator Gooch\nthe 51st beech the 21st, no the 49st,\ninto the 47th, Jones the 25th.\nResolution creating the Georgia commission of e-commerce\nand freight infrastructure funding.\nTransportation Senate Resolution 144 by Senator Walker,\nthe 20th due to the 30th, the Karpatcher, the 30th.\nButler, the 55th parent of the 42nd and others\nof resolution proposing a amendment\nof the Constitution of the State of Georgia.\nJudiciary.\nSenate resolution 154 by Senator Rark of 36th.\nHofsteadland of the 52nd, Mulles of the 53rd,\nButler of the 55th, Strickland of the 17th and others.\nResolution creating the joint study committee\nfor strengthening Georgia's future workforce.\nInsurance.\nnot completes first readers. Second reading of bills and resolutions a clerk\nread. House bill 723 by Representative Davis of the 87th Mitchell of the 88th\nbody of the 62nd Jackson of the 64th Evans of the 83rd and others the bill\nrelating to selling and other trade practices House bill 724 by\nRepresentative Allen of the 40th and all the way to the 42nd Reads of the 34th\nWilkerson of the 38th person of the 61st and others the bill to amend and act\ncreating the Board of Commissioners of Cobb County, House Bill 725 by Reps of Limb of the 99th Loap House of the 86th,\nthe Maynard of the 56th, the Bill of Lady of the Council on American Indian Concerns, House Bill 726 by Reps.\nCollege of the 14th, where Kaiser of the 157th Chokas of the 138th, Roads of the 120th, Green of the 151st and\nothers, the Bill relating to elections and primaries, House Bill 727 by Reps of Cannes of the 58th,\nFebruary of the 143rd, Friday of the 118th, Mitchell of the 106th,\nwith the 99th and others,\nthe bill will lay into medical assistance, House Bill 728,\nby remiss of the Cloud of the 105th, Scott of the 76th,\nthe field of the 68th, with the 99th,\nDavis of the 87th and others,\nthe bill will lay into penal institutions,\nHouse Bill 729, by remiss of the Chocus of the 138th,\nand Jackson of the 11th, the bill,\nrelating to the Georgia Student Finance Authority,\nHouse Bill 730, by remiss of Carpenter of the 4th,\nCarpenter of the 2nd,\nRidley of the 6th, the bill to create and establish\nthe Whitfield County Public Facilities Authority,\nHouse Bill 731 by represent Collins of the 68th Hogan of the 179th Green of the 151st.\nAbel relating to regulation and construction of hospitals and other healthcare facilities.\nHouse Bill 732 by represent dryer of the 159th Holland of the 54th Canon of the 58th Roberts of the 52nd win of the 89th Abel to amend an act in providing a homestead exemption from the City of Atlanta independent school district, Agilorm, Texas.\nHouse Bill 733 by represent Smith of the 18th Gamble of the 15th Williams of the 148th Abel relating to definitions regarding guaranteed asset protection waivers.\nHouse Bill 734 by Representative Gamble,\nthe 15th and Kelly of the 16th,\nthe Bill to amend an act to provide a new charter\nof the City of Yoharley, House Bill 735,\nby Representative Paris of the 140th Seconds,\nmy word is the 135th, welcome to the 81st,\nWilson of the 80th, Evans of the 83rd,\na Bill relating to multi-tiered system of supports\nprior to suspension or expulsion for certain students.\nHouse Bill 736, by Representative Barr of the 103rd,\nWatson of the 172nd, Hill of the 3rd, Smith of the 70th,\nwith our 119th and others,\na Bill relating to the George GD Public Officers and Employees,\nHouse Bill 737 by Representative Dantler of the 8th,\nLegislative of the 33rd Beaves of the 34th,\nSmith of the 18th, the Bill of the Ladies and General Provisions,\nregarding courts.\nHouse Resolution 317 by Representative Martin of the 49th\nJones of the 47th night of the 130th jaspers of the 11th,\nDominic of the 29th.\nA Resolution Recognizing the Need for the University System of Georgia\nand the Technical College System of Georgia\nto establish a consistent college,\ncourts credit policy.\nHouse Resolution 318 by Representative Stevens of the 164th\nSmire of the 135th.\nA Resolution Recognizing the Committee SK\ninnovation's long-term investment.\nHouse Resolution 319 by Rep. Smith of the 18th,\nSmith of the 70th, Smith of the 133rd,\nWashburn of the 141st, Hogan of the 179th,\nResolution Creating the House Study Committee\non Landfills, Resolution 237 by Rep. Jones of the 47th,\nChancellor of the 11th, Dominic of the 29th,\nGlantzend of the 75th Gamble of the 15th and others,\nResolution urging the State Board of Education\nthrough the State School Superintendent\nand the Georgia Department of Education\nto create multiple diploma pathways\nfor high school students.\nSenate Bill 75 by Senator Jackson of the 41st\nstrictly under the 17th.\nParent of the 42nd.\nCorrect of the 32nd.\nMarit of the 9th and others.\nBill relating to termination of residential lease.\nThat's on a bill 78 by Senator Jones.\nThe 2nd of the 22nd.\nAnderson of the 43rd Harold.\nThe 40th parent of the 42nd or the 55th and others.\nA bill relating to invasion of privacy.\nSenate Bill 92 by Senator Robertson of the 29th.\nAnderson of the 24th.\nAlbers of the 56th.\nMelissa of the 53rd.\nPayner of the 54th.\nThe bill relating to schedule offences.\npenalties regarding regulation of control substances, Senate Bill 142 by Senator\nMullis of the 50th, Miller of the 49th, Jones of the 22nd, Albert of the 56th,\nparent of the 42nd, others of Bill relating to lottery for education, Senate Bill 145 by Senator\nBrass of the 28th, Miller of the 49th, Watson of the 1st, huge of the 51st, Jones of the 25th,\nand others of Bill relating to local authorization regulations for manufacture.\nDistribution and impact of sale of distilled spirits, Senate Bill 152 by Senator Robertson of the 29th,\nof the 30th Miller, the 49th future of the 51st Kennedy of the 18th and others.\nThe bill will lay in the state flag and other flags.\nSenate bill 153 by $100, all of the 27th and the tiller year of the 19th.\nThe bill will lay into education.\nSenate bill 163 by Senator Strickland and 17th.\nKennedy of the 18th hatched at the 50th.\nJones second of the 22nd, red of the 33rd.\nThe bill will lay into judicial emergencies.\nSenate bill 165 by Senator Deutch of the 51st, Patrick of the 32nd.\nBeech of the 21st Miller of the 49th.\nGet into the 47th and others.\nbill relating to equipment and inspection of motor vehicles Senate bill 200 by\nSenator Ann Vartarte of the 31st Miller the 49th Dougan of the 30th Jackson of\nthe 2nd most of the 53rd and others a bill relating to emergency powers of\nthe governor Senate bill 210 by Senator Robertson of the 29th Miller the 49th\npane of the 54th curb Patrick of the 32nd brass of the 28th bill relating to\nmotor vehicles and traffic Senate bill 219 by Senator again of the 47th\nhours of the 56th most of the 53rd parent of the 42nd Ann Vartarte of the 31st\nothers, bill relating to alcoholic beverages, Senate bill 220 by Senator Payne of the 54th\nanniversary of the 31st, Melissa, the 53rd summers of the 13th, talking to the 30th and\nothers, bill relating to educational accountability assessment programs, Senate bill 236 by Senator\nBrass of the 28th, Jones of the 25th, Miller of the 49th, Robertson of the 29th, Peter\nof the 21st and others, bill relating to alcoholic beverages, Senate bill 246 by Senator\nBrass of the 28th, Albers of the 56th, Kurt Patrick of the 32nd, Payne of the 54th,\nat the end of the chart to have the 31st and others\nto build related to educational entities\nand requirements for private school and home study programs.\nSenate Bill 255 by Senator Mulles of the 53rd,\ndue to the 51st Miller of the 49th,\nDoug and of the 30th,\nagain to the 47th and others to build related\nto the one Georgia Authority Act,\nSenate Resolution 39 by Senator Dixon of the 45th,\ndue to the 51st speech of the 21st Miller,\nthe 49th Thompson of the 14th and others,\nresolution recognized in the Honorable Charlotte Nash\nand dedicated intersection in her honor,\nSenate Resolution 84 by Senator Harper,\nthe 17th and Kennedy of 18th,\ngiven the 47th, Melissa the 53rd,\nJones the 25th and others.\nResolution creating the joint study committee\non airport infrastructure and improvements\nand it resolution 135 by Senator\nMelissa the 53rd,\nCouncil to the 46th.\nResolution proposing amendment to the Constitution\nthe state of Georgia so as to provide for sports betting\nin the state Senate resolution 143 by Senator\nHarbin of the 16th, Council to the 46th.\nHickman of the 4th,\nSummers of the 13th anniversary of the 31st and others.\nResolution appointing the honorary position\nof General Assembly Chaplain,\nfor your second readers.\nReport of Standing Committees, the clerk will read.\nRepresentative John Corbin of the 174th District Chairman of the Committee of Motor Vehicles,\nsubmit it to file a report and speak of Committee on Motor Vehicles, that's on an consideration.\nFollowing bills of the Senate is a structural meeting report sent back to the House following recommendations\nSenate Bill 44 could pass by committee substitute, respectfully submitted\nRepresentative John Corbert of the 174th District Chairman.\nThat completes the reading of the report to standing committees.\nYou\nWe're going on now to, we're going on now to morning orders, afternoon orders, I guess.\nAfternoon orders.\nThis house will come to order and give attention to the members and the will whenever y'all\nalready. Chair recognizes the majority caucus whip representative Kelly for\nhim afternoon order. Thank you, Mr. Speaker. Members of the house in the early\nhours of the morning, the Polk County community lost one of our finest. With\nthe passing of Sergeant Barry Henderson of the Pope County Sheriff's Department.\nSergeant Henderson served our community for a number of years and always went out of his\nway to give back to our community and took a lot of pride at his job.\nHe passed away about 130 last night after an extended illness with COVID with his wife\nChrissy by side.\nI'll ask you to remember his wife Chrissy and our community and all his family at the\nthe sheriff's department as they mourn his loss,\nand I ask for a moment of silence.\nThank you, Mr. Speaker.\nChair recognizes Representative Tyler Paul Smith\nand Chairman Jay Collins for a morning order.\nThank you, Mr. Speaker.\nI come here today with a heavy heart\nand my hometown of Bremen, we lost a man that truly gave\nhis all back to his hometown.\nWe lost Mr. Randall Redding last evening, I know,\nas a builder, he probably built a facility\nin just about every area of this state\nand many of your districts.\nHe brought our little old hometown,\nit's first state championship by winning\na state championship wrestling title\nand just a great man.\nHe'll be truly missed.\nI'll ask that your member, his wife, Miss Redden,\nhis children and his grandchildren,\nas they grieve as he has went to be with the Heavenly Father,\nif you'll join me in a moment of silence.\nThank you.\nChair recognizes representative Mitchell\nfor a morning order.\nThank you, Mr. Speaker.\nI wanted to take a minute to highlight an ongoing mental health crisis.\nMany of you here will have interacted with the veterinary in this year.\nThey're often taking appointments curbside to keep you and themselves safe.\nAnd what you don't know is they're working even longer hours this year than ever.\nThere was no break for COVID.\nThe veterinary community has been rocked with losses due to suicide in the past several\nweeks.\nWe see a friend change their social media profile to include the letters N-O-M-B.\nIt means not one more vet, and it's usually because they've learned of another colleague\nwho is no longer with us.\nWhile this is an exhortation, to remember to be kind to your veterinary staff because\nthey're literally dying to try to help us in our animals, it is also a call to action.\nWe need to be normalizing mental health assistance, a discussion across all professions.\nWe need to be asking if our colleagues are okay, and we need to make sure that everyone\nhas a national suicide prevention hotline in their phone number, in their phone, which\nis 1-800-273-TALK. We can't address problems that we don't talk about, and we need everyone\nto be aware that veterinarians are not just caretakers for our pets and lives stock, but\nloved and caring people in our communities who are in need of our support. Thank you,\nMr. Speaker, and I yield the well.\nChair recognizes Chairman Belton for an afternoon order.\nThank you, Mr. Speaker.\nThe American Red Cross plays a vital humanitarian effort in Georgia, empowering millions of\nour citizens to make a difference in donations of time, money, blood, to ease, human suffering.\nLast year, Georgia's Red Cross safely adapted to COVID and brought emergency assistance\nto 14,000 people in Georgia, including 3,000 local disasters.\nThe Red Cross helped save lives of Georgia every day, collecting 180,000 blood donations\nthis year to Georgia's 85 hospitals.\nRed Cross provides only worldwide communications link\nbetween service members and their loved ones.\nLast year, Georgia Red Cross helped 29,000 military families\nin Georgia with emergency messages, financial assistance,\ncouncils, referrals.\nIt's therefore fitting that we recognize that March\nis the Red Cross month and celebrate the volunteers\nwho collected 400,000 hours of their time that's here,\nincluding our own gym tutor.\nDo you remember Jim Tudor who used to make us or grilled?\nShe's sandwiches of Newton County.\nIf you want to see an example of American goodness,\ngoodness of Americans, look at Jim Tudor\nand people of the American Red Cross.\nThank you, Mr. Speaker.\nThat completes morning orders.\nAnd guess what?\nWe do not have a rules calendar today.\nWe don't have any bills.\nClerk will read the caption to a group of privileged resolutions.\nCongratulations, commending Sandra Jackson-Leth for receiving the 2021 NICETE Randall Service\nLeader Award and for other purposes that completes the reading of the privilege resolutions.\nWe're going on, is there any objection to the adoption of the privilege resolutions that\nChair here's none in the resolutions are adopted.\nWe're going on now to announcements.\nChair recognizes representative Mathis\nfor an announcement.\nThank you, Mr. Speaker.\nJust want to invite everyone to morning fellowship\nin four or three tomorrow.\nWe do have coffee and doughnut and good talks with Jesus.\nThank you.\nChair recognizes Representative Cannon\nfor an announcement.\nThank you, Mr. Speaker.\nGood morning and afternoon everyone.\nTomorrow is virtual community midwife day.\nWe will have the certified professional midwives\nas well as the certified nurse midwives\ntaking part in a Zoom meeting from two to four PM.\nIf you want to sign up, the flyers are on the tables outside of the House Chamber, the\n341 as well as the gallery, and lunch will be from Whole Foods if you register.\nThank you very much.\nChair recognizes the chair of the House Insurance Committee, Chairman Lumsden, for and announcement.\nThere will be a meeting of the Life and Health Subcommittee of Insurance this afternoon at\nthree o'clock CLOB 406, we have two bills, thank you.\nChair recognizes the chair of the House Agriculture\nand Consumer Affairs Committee, Chairman Dickie\nfor an announcement.\nThank you, Mr. Speaker.\nTomorrow morning, eight o'clock, Agriculture\nand Consumer Affairs Committee will be meeting\nin 406 CLOB, hope you can make it, thank you.\nAll right, we have a birthday announcement today\nthat I want y'all to listen up for and I think it's only appropriate that it's coming\nthe day after crossover because he tried his best to keep us here to midnight last night\nand came within about an hour so please help me wish a happy birthday to the chairman of\nthe House Rules Committee, Chairman Richard Smith.\nThat will be the only time you hear and applause in this chamber.\nChair recognizes Chairman Cooper for an announcement.\nThe House Health and Human Services Committee will meet today.\nWe were scheduled for two.\nLet's do it for two, 15.\nHouse Health and Human Services Committee.\nThank you, Mr. President.\nChair recognizes Chairman Setsler for an announcement.\nThe assessor subcommittee of Judiciary Non-Sovil,\nassessor subcommittee of Judiciary Non-Sovil,\nwill meet at 3.30 today.\n3.30 today, at room 132.\nAll right, I think that completes announcements.\nThe chair recognizes the majority leader of the house for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I moved to this house stand adjourned until 10 a.m. Wednesday, March to 10, 2021.\nleader has moved that this house stand adjourned until 10 o'clock a.m. on Wednesday, March the 10th.\nIs there all those in favor of the motion will say aye. Those opposed will say no. The eyes have it.\nThe eyes have it. Clearly. This house will be adjourned until Wednesday at 10 a.m.\nYou\n",
  "updated_at": "2026-02-12T14:07:06.25396+00:00"
}