{
  "video_id": "ETUWCFYwB5o",
  "url": "https://youtu.be/ETUWCFYwB5o?t=1162",
  "title": "Georgia House - Day 21 (2026-02-21)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 21,
  "video_date": "2026-02-21",
  "duration_minutes": 174,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-02-21:\n\n**Overview**\nThe session featured a scripture reading and prayer by guest chaplain Pastor Mike Cole, who emphasized the importance of understanding and empathizing with one's constituents before trying to solve their problems. There was no substantive legislative action detected in the transcript.\n\n**Key Actions**\nNone detected.\n\n**Bills Introduced (First Reading)**\nNone detected.\n\n**Notable Moments**\n- Pastor Mike Cole delivered a sermon on Ezekiel 3:10-15, discussing the importance of observing and understanding people's struggles before trying to help them.\n- Rep. Johnny Chastain introduced Pastor Cole and praised his community involvement.\n\n**Votes**\nNone detected.\n\n**Attendance**\nThe speaker noted that all members were present and voting to signify their presence.\n\n**Adjournment**\nThe transcript does not indicate when the session adjourned or the date of the next scheduled session.",
  "transcript": "Okay Well stain, okay Good morning, All members come All members come to the floor, take your seats. All members, the hour for convening having arrived, all members will please take their seats. Mr. Clerk, will you ring the bell? There's a switch. Well, good morning, everyone. Appreciate you getting here, Tommy. So we'll see if we can go ahead and get started. We're going to have the morning roll call. All members present will please vote green to signify their presence in the chamber. And Mr. Clerk, will you unlock the machines? Have all members voted all members? Thank you all. Thank you all. I'm voting Mr. Clerk. So Mr. Clerk, will you please lock the machine? Well, good morning again. Good to see everybody on this Friday. Doorkeepers, will you please close the doors and keep them closed? As is our custom, we will begin our day with scripture reading and prayer by our chaplain, after which we will pledge allegiance to the flag of our country. Our chaplain this morning will be introduced by the gentleman from the seventh House District representing Johnny Chastain. Representative Chastain. Thank you, Mr. Speaker. Glad to be here this morning, is everybody glad to Friday? I know I am. But I'm excited to have Brother Mike Cole with us this morning. His wife, Debbie, is sitting right here to my right, known these folks for over 40 years. And from Fanon County. And I graduated with Debbie there. So if you want to have a chance to find out anything about me, I'm sure she could probably share some good stories with this morning. But Mike Pastry's, McKaysville Church of God. McKaysville Church of God is a pretty legendary church in our district. It's been an existence for a very long time. It's our former Gima director, Chris Stallings, grew up in that church as a kid. His father was pastor there for many, many years, Tony Stallings and great family. It's been a, like I say, a powerhouse church in our community. And Mike became the senior pastor there about a year ago. Mike also has a very successful auto mechanic shop in Fanon County. And he's also chairman of the Fanon County School Board. So he's very, very active in our community. What I could say about, about Pastor Mike is knowing him over 40 years. I know how much he loves, loves our community. And the more you love something, the more you want to protect it. And I'm just, we're thankful that he's here with us today. And I'm going to ask Brother Mike to come on up. Well, good morning. I'm thankful to be here. I want to thank Representative Johnny Chastain for the great opportunity to come here as well. As well as I would like to thank Speaker John Burns for allowing me to speak this morning. I want to let you know that my case with Church of God has been blowing up my phone praying for me. But you know who else they're praying for? They're praying for you. And so I'm excited to be here this morning. I'm going to read to you this morning from Ezekiel chapter three, verses 10 through 15. And it's something that the Lord's really been dealing with me about. And so when I was asked, they told me I had 25 minutes. So I'm, I'm going to go ahead and get started. Moreover, he said to me, this is Ezekiel God is dealing with. And he's telling them to go set the captives free. Moreover, he said to me, Son of Man, receive him to your heart. All my words that I speak to you and hear with your ears and go get the captives to the children of your people. I want to pause right there because this is important for you to understand that sometimes we're going after people when God is saying, go after the next generation. We got a generation coming behind that wants to hear from you. They want to see you and see your eyes. And so he says, speak to them and tell them that says to Lord God, whether they hear or whether they refuse. You see, it's not up to them to take it, but it's up to you to say something about it. Then the Spirit lifted me up and I heard behind me a great thunderous voice. Blessed is the glory of the Lord from his place. I also heard the noise of the wings of the living creatures that touched one another and the noise of the wheels beside them and a great thunderous noise. So the Spirit lifted me up and took me away and I went in bitterness in the heat of my spirit. But the hand of the Lord was strong up on me. Then I came to the captives of Telibi who dwelt by the river Chibar and I sat where they sat. I'm going to repeat that again because he said I sat where they sat and remained there astonished among them seven days. So the Bible says that Ezekiel went in the heat of his own spirit. Can I tell you that's what most pastors do in most churches around America. They go in the heat of their own spirit. That's what some politicians do. They go and we think we have all the answers. The preacher with his Bible school degree, his seminary degree, the politician with his training, his PhD or her doctorate degree. And with the education educated ideals, they go down in the heat of their own strength and say I got all the answers and I can fix this situation. And Ezekiel believed that right up to the point that he entered the city where the captives were and he looked at it and then he realized that the gap between where he was living, being able to hear the sounds of heaven versus the gap where the people were living. It was so huge that he had to sit there and observe seven days before he felt like he would even have the right or the privilege to speak into their problem. And so if you've never been through problems, if you've never been through trouble and you're trying to tell me how to live, I'm going to say get out of my face. I can't stand somebody trying to tell me how to fix all my problems and you haven't walked through any trouble at all. So if you've never had any kind of adversity blow in your face.\n\nwant to hear what you've got to say. Isn't it amazing when you have people who have never been where you've been know exactly what you need to do? And I believe there is something that you need to do that will make you powerful before you speak. And that is you need to watch. And so when he got to the people that he was sent to, he was so overwhelmed by the depth of their need, by the depth of their struggle, and the dilemma that they were facing. The word astonished means that he was made known. If you ever been in a situation you just didn't know what to do. He couldn't believe what he was seeing with his eyes. But I want to be I want to be a man of God that sees the need of the people, not just the people that I'm with, but the generation that's coming behind. And as a school board member, I got thousands of little kids that I need to be able to minister to. I need to know their needs. I need to know what they're facing. And I'm amazed at those that are without a home that are considered homeless, in my county that I grew up in for 60 years. But I want to tell you this, if you sit where they sit and observe, that's why my Lord and Savior did. He was 30 years observing, observing the homeless. Before he was able to speak into our life, and then he spent three years speaking, and I've accepted him as my Lord and Savior. But here's what I want to, this is my illustration for you today. I have just met Speaker John Burns today. I know him because of where he sits, but he doesn't know me. And I grew up in Fannie County, born and raised there, and I knew, I knew Speaker David Rosston while he was here. But Speaker David Rosston, although lived in my county, didn't know me, or at least I didn't think he did. In 2015, I tore my bicep playing with my little girl in the pool. I have a 37, a 35, and a 15. I've been married 41 years. But in 2015, she was small enough that I could pick her up and flip her, and I popped this bicep while we were playing in the pool. I didn't have insurance, but I'm a veteran of the Marine Corps. And during that time, we had a mudslide on the Oakoy River, and that road was blocked, and you had to go three hours out of the way. I didn't attend my medical checkup on my yearly, and they wiped me off. So I had nowhere to go. But I was eating lunch in Blue Ridge at at 10 moon at the restaurant there, and I was having my arm in the sling, and I was getting my stuff, and just so happened, David Rosston was there that day. And he walked over to the table, and he said, hey, Mike, remember I said he didn't know me. I didn't think he did. He said, hey, Mike, what happened to your arm? I said, well, I pulled my bicep and I took it out, and you can see my muscle popped up here on my shoulder where it's supposed to be down here. He said, you're going to get that fixed. I said, I don't know. I said, I've been trying for almost a week. I don't have much time to get it done. They've knocked me off of the VA, and he said, so you're a veteran. I said, yes, sir. He said, let me make a phone call. Within hours, he had somebody calling me. I don't know who he called, but within the next three days, I was over at Emory getting my bicep fixed. And I'm telling you, I didn't think he knew who I was, but because he came into that restaurant where I was at that day, he knew me, and I didn't think he did, but he made a way for me. You know, there are other people from your district that won't you do something to help them, but until you said where they said, I didn't think he knew me, but he knew me. But I want you to have the anointing of God upon your life, the discernment to be able to reach those constituents that you have. And so with that, I would ask you to stand with me this morning, and I want to pray over you. I want God to do a great thing in you, because I know my God is great. The Bible tells me that in verse 17, there of Ephesians chapter 1, that the father may give unto you the wisdom and the revelation and the knowledge of him, that your eyes may be enlightened, that your understanding may be aware of who he is. So father, I just speak over them today, God. I speak your word that wisdom and revelation, God would come to them, Lord, that when they may look at education, God, but they have a spirit living inside of them that will enlighten them and take them down a path if they have ears to hear what the Spirit is saying. And I pray, God, there would be discernment, God, to come into the lives of those that they represent, God, that they would represent from the smallest to the greatest, God, that they would give equal time to each of those, Father. And I pray for an anointing, God, to spread across this place, God, of each man and each woman that's in here, God, to do the work, God, that we quit looking in the rearview mirror and look out the windshield of the great opportunities, God, you have placed before us, God, you have given us an adventure and God, may we go forward, God, into that adventure, God, doing the things, God, that you would have us to do. And I praise you for that today in Jesus' mighty name. If you would say with me the pledge this morning, as we turn, our pledge allegiance to the flag of the United States of America and to the Republic for which it stands, one nation under God, indivisible with liberty and justice for all. Brothers Mike, thank you, sir. Thanks for that remembrance. Brother Mike, thank you for that message and thank you for that remembrance. Doorkeepers, you may open the doors, members, you may join Brother Mike in the south any room for a photo and thank you for his service to us today. Members, our doctor of the day is brought to us by Riftney Solomon, out in Sonja, and that's Dr. Jonathan Gibson. Dr. Jonathan Gibson, thank Dr. Gibson for his service to us today. If you need his services down in the uh, care station on the first floor. Chairman Hilton, did chair the committee on information and audits has recognized, Chairman Hilton. Thank you, Mr. Speaker. Your committee on information audits has read the journal the previous day and found it to be correct. Chairman Hilton, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct is there any objection to dispense with the reading of the journal. Hearing none, the reading of the journal is dispensed with the is there objection to the confirmation of the journal. Hearing none, the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of visits for the day. Mr. Clerk, Representative station 104th moves following the establishes the order of business and the first part of the period unanimous consent. Introduction bills and resolutions, first reading and reference of house bills and resolutions, second reading of bills and resolutions, reports of standing committees, third reading and passage of uncontested local bills and resolutions, first reading and reference of senate bills and resolutions, morning orders. Is there any objection to the adoption of the resolution establishing the order of visits for the day. Hearing none, the resolution is adopted. First reading the bills and resolutions, the clerk will read. House 538 by Representative Chocus, the 151st of Bill Meanty out of the act to authorize the assessment and collection of a technology feed. Enter governmental coordination. House 539 by Representative Reeves, the 99th of station 104th park, the 100th and 8th. And then you know out of the 110th of a coye of the 102nd and others, Bill Meanty out of the act to amend and act to provide a homestead exemption for $4,000 from all counties school district at the alarm taxation. Enter governmental coordination. House 540 by Representative Reeves, the 99th Martinez is the 111th of station 104th park, the 100th and 8th. And then you know the 110th and others. And Bill Beato, the act to amend and act to provide additional homestead exemptions from the Quenette County school district at the alarm taxes. Enter governmental coordination. House 541 by Representative Dempsey, the 13th Cooper, the 45th Taylor, 173rd, Prince the 132nd Hawkins, the 27th. Bill Beato, the act to amend and code section 23, 411, and the Fisher code of Georgia annotator relating the definitions regarding tuition equalization. Higher education. House 542 by Representative Barry, the 56th Griffin, the 149th car to the 93rd, Roman to the 97th, the clerk to the 108. Bill Beato, the act to amend Article 2, Chapter 2B, the title 20, the Fisher code of Georgia annotator relating to promise scholarship accounts. Education. House 543 by Representative Barry, the 56th McQueen, the 61st bell of the 75th, Dawson, the 65th Herring, and the 145th. Bill Beato, the act to amend Article 1, Chapter 1, and title 20, the Fisher code of Georgia annotated relating to general provisions relative to education. Education. House 544 by Representative Barry, the 56th Miller, the 62nd, Park of the 107th, Hugley, the 141st, Fry, the 120th, and others. Bill Beato, the act to amend, Code section 22, 310 of the Fisher code of Georgia annotated relating to student directory information. Education. House 545 by Representative Jones, the 68th, Bill Beato, the act to amend, Code section 5, 642, with the Fisher code of Georgia annotated relating to procedure for preparing and filing of a transcript. Judiciary. House 546 by Representative Cahoney, the 81st, heard of the 20th, Dunhu, the 31st, Skoggins, the 14th, Gamble of 15th, and others. Bill Beato, the act to amend, Part 15 of Article 6, Chapter 2, title 20 of the Fisher code of Georgia annotated relating to miscellaneous provisions, under the Quality Basic Education Act. Education. House 547 by Representative Cahoney, the 170th, and Tickley, the 134th, Corbord of the 174th, Meeks of the 178th, Huddleston of the 72nd and others. Bill Beato, the act to amend, Code section 485, 7.4 of the Fisher code of Georgia annotated relating to preferential assessments. Whoaves and means? House 548 by Representative Green, the 154th, Year to the 150th, and Chocos, the 151st, and Samson to the 153rd. Bill Beato, the act to amend, the act creating the all-banny d'ority, inner city authority. Andrew, governmental coordination. House 549 by Representative C. Ball, the 34th, McDonald, the 3rd, the 26th, McCollum, the 30th, Lumps into the 12th, Hitchin, 161st and others. Bill Beato, the act to amend, Code section 35, 8, 22 of the Fisher code of Georgia annotated relating to reimbursement of training expenses. Public safety and homeland security. House 550 by Representative Bell, the 75th Saints to the 180th, Townsend, and 179th, Wilkerson, the 38th, Stinson to the 150th. Bill Beato, the act to amend, Code section 22b, 23 of the Fisher code of Georgia annotated related and requirements for participating schools. Education. House 551 by Representative Ridley, the 6th Corb of the 174th, Jasper's the 11th, Mathis, the 133rd Jones to the 25th. Bill Beato, the act to amend, title 40 of the Fisher code of Georgia annotated relating to motor vehicles and traffic. Motor vehicles, House 552 by Representative Cahoney into the 80s, 1st, Burr to the 20th, Tran to the 80th, Bill Beato, the act to amend, Code section 15, 11, 2. The Fisher code of Georgia annotated relating to definitions relative to the juvenile code. Do you do Sherry juvenile? House 553 by Representative Stinson to the 150th, Bill Beato, the act to authorize the assessment and collection of a technology fee by the Pro-Bate Court of Taylor County. The Antwerp Governmental Coordination. House 554 by Representative Townsend, 179th Jones to the 25th, or one of the 32nd, Ballot to the 147th, Glaze to the 67th, and others, Bill Beato, the act to amend, part 3 of Article 16, Chapter 2, title 20, the Fisher code of Georgia annotated relating the health of students. Education. House 555 by Representative McCollum, 30th, Montpahana, 17th, Golden, 19th, frustration to the 104th, Fry, the 120th, and others, Bill Beato, the act to amend, Chapter 3, Title 44, the Fisher code of Georgia annotated relating to regulation, specialized land transactions. Did you do it, Jerry? House 556 by Representative Cox to the 28th, Williams to the 148th, McDonald's 3rd to the 26th, Gunner to the 8th, Polly to the 33rd, Bill Beato, the act to amend, Code Section 52, 7, 8.3, the Fisher code of Georgia annotated relating the operation of watercraft. Game, vision, parks. House 557 by Representative Hawkins to the 27th, Cox to the 28th, Clark to the 100th, Dunhu, the 31st, McCollum, the 30th, and others, Bill Beato, an act to amend, Code Section 1562, with the Fisher code of Georgia annotated relating the number of judges is superior, of course. Judiciary. House 558 by Representative Gaines, the 120th, Dempsey 13th, Newton, on 27th, and Bill Beato, an act to amend, Chapter 4, title 20, the Fisher code of Georgia annotated relating the vocational, technical, and adult education. Higher education. House 561 by Representative Taylor, 173rd, Stevens, on 64, Saints to the 180th, Green to the 154th, Buckner to the 137th, and others, Bill Beato, an act to amend, Part 3, Chapter 4, title 12, the Fisher code of Georgia annotated relating the surface mining. Natural resources and environment. House 562 by Representative Taylor, 173rd, Stevens, on 64, Saints to the 180th, Green to the 154th, Buckner to the 137th, and others, Bill Beato, an act to amend, Part 3, Article 2, Chapter 4, title 12, the Fisher code of Georgia annotated relating the surface mining. Natural resources and environment. House 563 by Representative Bennett, the 94th, Powell, the 33rd, Corbett of the 174th, Hugh Glee, the 141st, Jones, the the 143rd, and others, Bill Beato, an act to amend, Article 3, Chapter 2, title 40, the Fisher code of Georgia annotated relating the prestige license plates. Motor vehicles, House 564 by Representative Barry, 56th, Glee is the 67th, Crawford, the 89th, Santos, the 117th, Sanchez, the 42nd, Bill Beato, an act to amend, Part 3, Article 16, Chapter 2, title 20, the Fisher code of Georgia annotated relating the health of students. Education, House 565 by Representative Towneson, the 179th, Franklin, the 160th, Leopard of the 123rd, Camp of the 135th, Hilton of the 48th, Bill Beato, an act to amend, Article 2, Chapter 7, the title 48, the Fisher code of Georgia annotated relating the income tax imposition. Whays and means. House of Resolution 328 by Representative Brunnell, the 77th, Scott of the 76th, Florida, the 74th, Resolution of Recognizing Chief, Jeffrey E. Turner, and dedicating a road in his honor. Transportation. Senate Bill 96 by Senator Eckles, the 49th, hatched in the 50th, upstep, the 50th, Paine in the 54th, Robertson in the 29th, and others, Bill Beato, an act to amend, various titles of the Fisher code of Georgia annotated, so did modernize and update. Code revision. Senate Bill 98 by Senator, Councillor of the 46th, Strickland in the 42nd, again to the 47th, Watson in the 1st, Capatric in the 32nd, Bill Beato, an act to amend, title 29, the Fisher code of Georgia annotated, relating the guardian and ward. Judiciary, juvenile. Senate Bill 102 by Senator Robertson in the 29th, Paine in the 54th, upstep, the 50th, Williams in the 25th, Albers in the 56th, and others, Bill Beato, an act to amend, part 1 of Article 2, Chapter 12, Title 16 in the Fisher code of Georgia annotated, related to gambling. Judiciary, non-civil. Senate Bill 138 by Senator Dixon in the 45th, stills in the 48th, cows in the 46th, Setsville in the 37th, and Anadavarte in the 31st, Bill Beato, an act to amend, Chapter 31 in the 36th, in the Fisher code of Georgia annotated, relating, incorporation of municipal corporations. Andrew, governmental coordination general. Senate Resolution 23 by Senator Cousin in the 46th, Gute to the 51st, Kennedy in the 18th, Albers in the 56th, Beach to the 21st, Resolution applying the United States Congress to call a convention in the Article 5 of the Constitution. Rules. That completes First Readers. The second reading of bills and resolutions, the clerk will read. House Bill 508, my represent Jackson in the 68th, Scott Field in the 63rd, Davis to the 87th, Bill in the 75th, Miles of the 126th, a bill relating to carrying the possession of firearms, House Bill 509 by represent Jackson of the 68th, Glaz of the 67th, Scott Field of the 63rd, and Davis of the 87th, a bill relating to elections and primaries, House Bill 510 by represent Jackson of the 68th, Scott Field of the 63rd Alexander of the 66th, Davis of the 87th, Glaz of the 67th, and others, a bill relating to child support guidelines for determining a amount of award, continuation of duty of support, and duration of support. House Bill 511 by represent of the 12th, Blackburn of the 146, Williams of the 148th, Preshed of the 176th, Hatch of the 155th and others, a bill relating to property insurance, and the computation of taxable net income. House Bill 512 by represent Louis Ward of the 115th, Hugh Gleeve of the 141st, Washburn of the 144th, Powell of the 33rd, Campbell of the 35th and others, a bill relating to regulation, specialised, Lamb transactions, House Bill 513 by represent Louis Hood of the 175th, Anderson of the 10th, Preshed of the 176th, Corp of the 174th, Prince of the 130th, Seconded Bill relating to service delivery, House Bill 514 by represent Seymour of the 34th, Campbell of the 35th, Ridley of the 22nd, Parsons of the 44th, Jones of the 60th, Bill to amend, an act providing a new charter for the City of Kenisaw, House Bill 515 by represent Newton of the 127th, Prince of the 130th, Miles of the 126th, Howard of the 129th, After of the 130th, a bill relating to the number of judges of superior courts, House Bill 516 by represent new of the 40th, Hockens of the 27th, Ballard of the 147th, Skoggins of the 14th, Pursing of the 119th and others, a bill relating to meetings open to the public, Limitational Action and Contest Agency Action, Recording notice of time and place, access to Minnes and Teleconferences. House Bill 517 by represent Barry of the 56th, Ballard of the 147th, Ola of the 59th, Green of the 154th, Hagan of the 156th and others, a bill relating to remedial education program under the Quality Basic Education Act, House Bill 518 by Representative Hulken of the 101st, a bill relating to searches and seizures, House Bill 519 by represent Stevens of the 164th, Mathis of the 133rd Reaves of the 99th Williams of the 148th, a bill relating to imposition rate, computation, exemption, and credits. House Bill 520 by represent Matthewick of the 82nd, Powell of the 33rd, Momp 10 of the 17th, Williams of the 168th, Mps of the 13th and others, a bill relating to health, House Bill 521 by represent Anderson of the 10th, the 100th, the 175th, Lever of the 123rd, Canon of the 102nd, Kelly of the 16th and others, a bill relating to municipal DNXation, House Bill 522 by represent Gallaud of the 19th, Hagan of the 14th, Mathiack of the 82nd, Gamble of the 15th, a bill relating to general provisions regarding health, House Bill 523 by represent Gallaud of the 19th, Canon of the 172nd, a bill relating to annexation pursuant to an application by 100% of land owners. House Bill 524 by represent Bell of the 75th, Mitchell of the 88th, McQueen of the 61st, Barry of the 56th, remounted to 97th, a bill relating to general provisions regarding officers and employees, House Bill 525 by represent Gallaud of the 19th, Smith of the 18th, a bill relating to discovery, House Bill 526 by represent Newton of the 127th, Stevens of the 164th, Buckner of the 137th, Washroom of the 144th, Petrie of the 166th, a bill relating to general provisions relating to advalorem taxation of property, House Bill 527 by represent Trana of the 80th, Hulcom of the 101st, Gamble of the 35th, Carpenter of the 4th, Roberts of the 52nd, a bill relating to a particle committee on child abuse, written particle training of members, written sexual abuse and exploitation, particle House Bill 528 by represent Buckner of the 137th, Hulcom of the 156th, he believed in the 141st, Stevens of the 164th, Oliver of the 84th, and others, a bill relating to general provisions relative to revenue and taxation, House Bill 529 by represent their barrel of the 24th, abstraction of the 104th, Hulcom of the 101st, Gaines of the 120th, Camp of the 135th, and others, a bill relating to contracts. House Bill 530 by represent the 113rd, Reaves of the 99th, Scotland of the 14th, Kelly of the 16th, Oliver of the 84th, the bill relating to time, place and procedure, House Bill 531 by represent Reaves of the 99th, Lever of the 123rd, abstraction of the 104th, Gaines of the 8th, Hulcom of the 53rd, a bill relating to judgment, House Bill 532 by represent the 126th, a bill relating to annual grant, when state owns property and calculations. House Bill 533 by represent the 13th, Hulcom of the 101st, abstraction of the 104th, we now are the 121st, Smith of the 18th, and others, a bill relating to criminal procedure, and general assembly, House Bill 534, by represent Jackson of the 68th, and Glazer of the 67th, the bill to authorize the governing authority, the city of Fairburn, to Levy and X-Eyes Tax, House Bill 535 by represent the Smith of the 18th, Hulcom of the 103rd, Lever of the 123rd, Evans of the 57th, Miller of the 62nd, a bill relating to arrests, to graduate sanctions, for probationers, violating terms, hearing, disposition of charges, and procedure when probation revoked in county other than that of conviction. House Bill 536 by represent Jackson of the 68th, and Glazer of the 67th, the bill to create the public facilities authority of the city of Fairburn, House Bill 537 by represent the black, one of the 146th, a bill relating to sales and use taxes, House Bill 559 by represent the 46th, Crow of the 118th, Martin of the 49th, Buckner of the 137th, Cannon of the 172nd, and others, a bill relating to exemptions from sales and use tax, House Bill 560, by represent the Martin of the 49th, and black, one of the 146th, a bill relating to joint county and municipal sales and use tax. House Resolution 303 by represent the Williams of the 148th, Resolution recognizing Mr. Johnny Floyd and dedicating an interchange in his honor, House Resolution 304 by represent the Owl, the 50th Cooper of the 45th, Hopkins of the 27th, Stevens of the 164th, Buckner of the 137th, with the resolution creating a house study committee on the cost of the effects of smoking. Senate Bill 45 by Senator Watson, the 11th Hickman of the 4th, the headman of the 8th, Anderson of the 24th, Kennedy of the 18th, the bill relating to preferential assessment for bona fide conservation use property, and bona fide residential transitional property. House Bill, Senate Bill 59 by Senator Watson, the 11th Hickman of the 4th, the headman of the 8th, Anderson of the 24th, summers of the 13th, and others, a bill relating to preferential assessment for bona fide conservation use property, and bona fide residential transitional property. Senate Bill 77 by Senator Hums, the 52nd, set sort of the 37th, they bill to provide a homestead exemption from city of Carter'sville, independent school district, Advalor and Texas. Senate Bill 89 by Senator Strickland of the 42nd, hatchet of the 50th, brass of the 6th, beech of the 21st, of the 33rd, and others, a bill relating to income taxes. Senate Bill 137 by Representative Jackson of the 45th, a bill to be entitled to amend and act to incorporate the city of Mulberry, Senate Resolution 56 by Senator Watson, the 11th Hickman of the 4th, the headman of the 8th, Anderson of the 24th, Kennedy of the 18th, the resolution proposing amendments at the Constitution, so as to increase the maximum acreage, to qualify for assessment taxation as a bona fide conservation use property, through second readers. Members, we have a special treat this morning, especially if you like the beech. Just saying. Just saying. So this individual is, it's pretty accomplished. He had good training to begin with, but he went on to serve as Commissioner of DNR. He's now serving as Director of the Jack Lallon Authority. The most importantly, a former member of this house, dear friend and many of us in this room, if you don't know him, you need to know him. He's really a fine individual, and there's a great job for us on the coast. And that's former representative Mark Williams. Welcome back, sir. Thank you, Mark. We appreciate you coming by. Appreciate what you're doing on, Jack. Or you're making a big difference down there. Report, sustaining committees. The clerk will read. Represent Chuck Martin of the 49th District Chairman, the Committee on Higher Education, submitted the report. Thank you. You're welcome. Thank you, Mr. Mayor. Thank you. Thank you, sir. I'm very excited to be here. Thank you, Mr. Mayor. Thank you, Mr. Mayor. Thank you, Mr. Mayor. Thank you, Mr. Mayor. Thank you, Mr. Mayor. Committee on Higher Education, submitted the following report. To speak to your committee on higher educations, how to nurse consideration, following bill of the house, and instruct committee reports, same back to the house, with following recommendation, House will 217 do pass by committee substitute, respectfully submit a representative, Chuck Martin of the 49th District Chairman. Representative Beth Camp of the 135th District Chairman, the Committee on Intercomal Coordination, local submitted the following report. And to speak to your committee on Intercomal Coordination, local seden principioing göz to the house. Instructed of me to report, same back to the house, following recommendations. House will 226 do Pass. House will 380 do pass House 381 do pass, House 396 do pass. House 440 for do pass, House will 412 do pass, House will 448 do pass. House will 462 do pass, House will 468 do pass. House will 498 do pass, House will 474 do pass. respectfully submitted, Ripson, Beth Campbell, 135th District Chairman. Ripson Gunner, the 8th District Chairman and Committee on Judiciary, submitted the following report. And to speak, your Committee on Judiciary has added under its consideration the following bills and resolutions of the House. Instructor, meeting reports, same back, while following recommendations, House will 327 do pass by committee substitute.\n\nHouse will 378 do pass House bill 392 do pass House will 426 do pass House resolution 251 do pass respectfully submitted Perhaps I'm gonna or the eight district Chairman perhaps in a Mandy Ballinger the 23rd District chairman the committee on judiciary juvenile Submitted the following report to speak your committee on judiciary juvenile as that owners consideration following bill of the house This is talked to me to report same back to the house and following recommendation House bill 253 do pass by committee substitute respectfully submitted Representative Mandy Ballinger the 23rd district Chairman representative John Corbett of the 174th District chairman the committee on motor vehicles Submitted the following report and speak your committee on motor vehicles has had under its consideration Following bills of the house is to struck to me to report same back to the house and following recommendation House bill 208 do pass by substitute House bill 393 do pass by substitute House bill 308 do pass by substitute respectfully submitted Representative John Corbett of the 174th District chairman Representative Rick Jasper city 11 district chairman committee on transportation Submitted the following report to speak your committee on transportation Had it has had under its consideration following bills and resolutions to the house and Senate This is talked to me to report same back to the house and following recommendations Senate resolution 7 do pass by committee substitute House bill 164 do pass respectfully submitted perhaps that of Rick Jasper's the 11th district chairman That completes the reading the reports of standing committees Members if you'll come to your desk we do have a local calendar this this morning So we're gonna remove on a third reading and passage on the uncontested Bills that we have one bill that on the local calendar relates to homestead Exemption requires recorded to third row call vote for the passage Members will be please come to you desk for the third reading and And passage of uncontested local bills If there is no objection we will vote on the local calendar as a whole with a recorded vote Here in 90 to so ordered Ready mr. Clark mr. Claren't will you read the local calendar house bill 226 by reps that a math is the 130th third city of Cochran House bill 380 by reps of green to the 154th Brand-off county house bill 381 by reps of green to the 154th Clay County married County Webster County House bill 396 by reps of candle with 35th city backworth House bill 404 by resident of Taylor the 92nd City of Conjures House bill 412 by reps of Kelly the 16th Polk County House bill 448 by reps of Chastain in the 7th Gilmer County House bill 462 by reps of Hagen in the 156 tubes county House bill 468 by reps of Hulse in the 72nd heard county House bill 498 by reps of Hepner the 130th Augusta Richmond County House bill 476 by reps of Stevens 164th Brian County Is there any objection to the previous question being ordered on the local calendar Here and under previous question is ordered Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bills Here and under report of committee has agreed to shout these bills now pass all in those in favor of the passage of the bills on the local calendar Will vote yes all those opposed will vote no and mr. Clare't will you unlock the machines Oh Oh members voted Oh All members voted Yes, so mr. Clare't will you lock the machines on the passage of the local calendar the yeas 170 days of zero These bill having received a requisite constitutional majority are therefore passed We have three members who want to speak this morning on morning orders Reps. Cooper rips. Any commons and representative Reese You see We'll begin with since I have eyes on him. We'll be you know you ready We'll begin with representing Teddy Reese Rept. You Reese Gentlemen suspend just for a minute Morning, no, there's always informational And important to the member and important this house or give the gentleman your attention representative Reese Good morning, mr. Speaker and thank you so much for this opportunity mr. Speaker I rise this morning to acknowledge in our presence here in the gallery one of the best young professional organizations in the state of Georgia and that is the urbanly young professionals and we have chapters with us here today from Atlanta and from Columbus, Georgia And we have all for make amazing phenomenal presidents mr. leader both organizations are led by two great women to accomplish women Dr. Tiffany McBride and Miss crystal Jordan so if you will please stand while the house welcome the young all of you stand Everybody stand up while the house welcome the urbanly young professionals Welcome to the people's house You Mr. Speaker you're the well, thank you Thank you represent and welcome to the people's house appreciate what y'all do come back anytime Representative Cummings You Reps any commons is um How to able to do the morning order so we're going to recognize rips in McQueen With a morning order ladies recognize. Thank you mr. Speaker. Can I get all members of the cob county delegation? Cobb delegation Come on up Miss Cobb Cobb delegation Miss Cobb team Here's represent Cummings You were working hard for the people I know it You Cobb delegation if y'all will sit in the seats just for a minute we're gonna call you right back We'll allow your folks to get um closer to the floor to the gallery Rept chairman sains chairman sains is recognized And Let's see y'all right represented Townsend representing deluge y'all want to join chairman sains Thank you mr. Speaker as they get just a second. We're not we got a policy just for a minute anyway to give the folks a chance to get here So coastal delegations recognize This either something Thank you mr. Speaker along with my colleagues up here. I'm honored to welcome our jeckel island Leadership team right here to my left former led by former state rep and former DNR commissioner Mark Williams you have a a the oldest live oak a sampling of the oldest live oak on jeckel is located in the historic district former state rep. I believe don hogue and planted it when he was a child um But we we appreciate having them here you have a annual report of all the great things jeckel island's doing as one of the greatest welcome Matt's in the state of Georgia and and thank you mr. Speaker for recognizing them All right cleric Okay, Representative Cummins, I think we're ready now. And the Cobb delegation will join Representative Cummins and the will. Give the lady your attention, please. Thank you. Good morning, everyone. It is my pleasure to introduce to you today and to congratulate Miss Cobb, Alia Phillips, Miss Cobb County, please stand. And Miss Cobb County team, Melanie Tipmore. And both of these young ladies represent at Cobb County and their respective contest. And they won and they will be moving on to represent Georgia and June 2025. Again, congratulations, ladies. Thank you, Representative. Good to have the Cobb delegation recognize Miss Cobb County and Miss Cobb County team. Love to take a photo with you all. We have one more morning order and we're going to give her just a moment to get back to the floor. And then we will move on. Thank you. Thank you. Thank you. Thank you. Welcome to them all. House bill 167. Thank you. Game, Fish and Parks, that committee recommends that this bill do pass. Chair Lady Hagen is recognized to present the bill. Have you presented this before? Like last year, did it pass? Wait a minute, I don't think that might sound. It passed. Yes, Mr. Speaker, it passed this House unanimously last year I believe. Well, good luck again. Ladies recognized. Thank you. Colleagues, I have House Bill 167 today. Currently, if you are hunting in certain situations, you're required to wear, or anyone who is with you is required to wear at least 500 square inches of fluorescent orange. On the upper half of your body for safety purposes to hunt. This bill would allow you to have the option to also wear fluorescent pink if you choose to do so. That is what the bill does. We did some research after it passed unanimously last year. Thank you. And found that in some cases it's actually more visible to people who suffer from color blindness than orange. So, and in addition to that, in states that have already added for us to pink to their list of acceptable colors to wear for safety, hunting license sales went up. So we think this is good all around for Georgia and for the people who enjoy hunting here. That's the bill, Mr. Speaker. You have no questions. Thank you. I yield the well and ask for your favorable consideration. It ladies yielded the well. Is there any objection to the previous question being ordered? Here in the previous question is ordered. Is any objection to a green to the report of the committee, which was favorable to the passage of the bill? Here in the report of the committee is agreed to. Shout this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted? All members voted if so. Mr. Clerk, will you lock the machine? On the passage of House Bill 167, the yeas are 159. The nays are zero. This bill hasn't received the requisite constitutional majority. Is therefore passed again. Mr. Clerk, will you read the caption to House Bill 5858? By Representative Richardson, 125th and others to be titled. And act to amend chapter one and title six of the fiscal to George Annett's area relating the general provisions relative to aviation. So is authorize the adoption of local ordinances, resolutions, regulations or policies that restrict the flight of unmanned aircraft systems over mass public gatherings. This bill I'm referred to the committee on technology and infrastructure innovation that committee recommends that this bill do pass. By committee substitute. Representative Richardson, I appreciate your persistence. Your attention. And you're working through the process to make sure that you came apart of this family part of this chamber. And you've got it. You got ready for this bill, right? This is your first second or third bill. This is your first bill. To be in the will, but did you have a bill? No. Oh, he didn't have a bill. I just wanted to make sure, wanted to make sure all your family was aware. This is your first bill. You chose a good one too. Representative Richardson is recognized to present the bill. Thank you, Mr. Speaker. I come to you this morning to present House Bill 58. This bill is in response to concerns regarding operation of unmanned aircraft over certain gatherings of people. While FAA regulated addresses, regulation addresses operations of drones over crowds. There are challenges for local authorities in providing enforcement of these regulations due to the lack of clear guidelines. That can lead to privacy and nuisance issues during events. This bill has been developed in partnership with others to provide us a solution that is limited to a specific concern. The bill has also been designed so as to not create preventive issues with FAA oversight of aviation issues. The bill defines a ticketed entertainment event for the purpose of creating a zone within which it will be a misdemeanor to operate a drone unless it meets one of the listed exceptions. The bill provides a 400 foot buffer from the event location and is in keeping with the existing FAA practice for some similar exclusions. There are exceptions allowed for persons who have obtained consent. Those who are operating under FAA authorization and within FAA regulations. Employees of the event and utilities conducting official business. I am open to questions if they are. I think you explained it pretty well. I'm surprised if you have a question but there's always one or two. So if the gentleman were you or you have a question from the gentleman from the 16th to your left, represented Kelly. Mr. Speaker, would the gentleman yield? Yes, sir. The representative is interested. I think the speaker made it pretty apparent this is your first piece of legislation that you've ever presented. Yes, sir it is. If you will further yield for a couple of questions. Have you been in charge of this legislation throughout the process? Did you get the bill drafted from the beginning? Yes, sir. I noticed here that we are not dealing with your original bill. We are dealing with a House Committee on Technology and Infrastructure Innovation Substitute to the bill. Could you tell me what you had screwed up and your initial draft that the committee had to fix for you? Yes, sir. I didn't think I had done that mess up, sir. But there were other people that seemed to think that I had screwed it up. So in working with those people to try and meet the needs in future, maybe utilities or something if there was a problem going on, that they could come in and operate over it. Well, I appreciate that explanation. I hope to get a further one from you the week we get out of here over in your home town. Yes, sir. I understand your question, sir. Gentlemen, you yield for maybe one or two more. Yes, sir. This gentleman should know about some technology issues. Rimsley Thomas has recognized for a question to your right. Thank you. Do you yield? Yes, sir. Online 47. It says authorized by federal regulations. Could you side the CFR specifically that your referencing? There is a pretty good list of those. And I think some of the folks in South Georgia would like to get home this afternoon. Thank you. Thank you for the question. Let's get one from the coast. See what he's got on his mind over here. Representative Sains has recognized for a question. Does the gentleman yield? Yes, sir. Just to better understand, taking an entertainment event, the gentleman seems to have a lot of experience in life and in this bill. What was your favorite to, favorited, taking an entertainment event you've ever attended? Some of my favorite ticketed events are some that Mr. Kelly enjoys attending also. And so, and I think he may have referenced a ticketed event in his comments a little bit ago. So I enjoy those ticketed events also. I was getting pretty close to it, but we won't go any further with that. The last question is from one of the governor's floor leaders representing Wade to your right in the back. Thank you, Speaker. Does the gentleman yield? Yes, sir. Sir, his question. So I appreciate you bringing the bill. Appreciate your passion on the issue. Would you consider yourself to be an expert in operating unman's drones? Sir, I would definitely not consider myself an expert in very many things. And operating a drone is surely one of those things. All right. And would the gentleman yield for one last clarification? Yes, sir. Do you think since this is your first bill that you feel like you've been flying blind? Absolutely. Pretty much flying blinds or an end reverse. You've done it. You did a great job. Would gentleman yield for one more? I have a question. Yes, sir. Have you ever flown on a drone? No, sir. I haven't. I do not. Well, I'd better buckle up your seatbelt because it's coming. You have no further questions. Thank you, Mr. Speaker. You're well. Good job, Representative Williamson. General, as yielded the well, is there any objection to the previous question being ordered? Here in the previous question is ordered. Is there any objection to adopting the committee substitute? Here in the committee substitute is adopted. Is there any objection to agreeing to report to the committee which was favorable to the passage of the bill? Here in the report of the committee is agreed to. Shout out this bill now, pass. All in favor of the passage of the bill. We'll vote yes. All those opposed will vote no one. Mr. Clerk, will you unlock the machine? Yes. Mr. Clerk, will you get ready to all members voted? All members voted. If so, Mr. Clerk, will you lock the machine on the passive house bill 58? The yeas are 153, the nays are four. This bill has received a requisite constitutional majority. Is therefore passed. Congratulations. Mr. Clerk, will you read the caption to House Bill 192? 192. House Bill 192, by the Rep. of Gamble, of the 15th and others to be in the total of the act to amend the total 20. The official go to George Anitety relating education. So, it includes specific references to programs included in the high demand career list. This bill I'm referring to, the committee on education that committee recommends that this bill do pass. Thank you, Mr. Speaker. Gentlemen from Carter'sville, Representative Gamble is recognized to present House Bill 192. Representative Gamble. Thank you, Mr. Speaker. Members, it's a rise today to present to you House Bill 192, which is the top state for talent bill dealing with the House Bill 192. The House Bill 192, dealing with the high demand career initiative offered as a part of Governor Kim's legislative priorities. House Bill 192 will build on the success of numerous workforce development initiatives, including the state's high demand career list, the Georgia Match Program, which is in the second year of its implementation. And last year, Senate Bill 399.\n\nand on articulation agreements. The High Demand Career List will now be incorporated into additional code sections and have a grant program repurposed for schools to reorient their career, technical, and agricultural education programs to align with the list. The Return on Investment Report required by the High Demand List will be strengthened with additional data points. The Georgia Match Program will now be mentioned and defined for the first time in code, requiring schools to include the program in each student's individual college and career plan. The Department of Education will now work collaboratively with the University System of Georgia and the Technical College System to report on their articulation agreements for their CTAE programs. We're very thankful for the contributions and leadership of several partners including Chairman Matt Dubnik, Chairman Matt Brass, who chaired a joint study committee on dual enrollment for highly skilled talent at younger ages, outside entities and individuals who have shared what industry needs, and several state agencies who have contributed their insight, feedback, and support. Through this legislation, our workforce pipeline will become more streamlined and clearer for students who want to take advantage of all of the opportunities that Georgia has to offer. This is necessary as we strive to produce the workforce that will fill jobs coming to our state, maintain our status as the number one state for business, and open doors to prosperous careers for hardworking Georgians. That is, in essence, the Bill, Mr. Speaker, and I'm happy to answer any questions that there may be as it relates to House Bill 192. I think this will relate, General, to your year-of-four question. Did I hear him say that? Yes, sir, I yield. Or representative rice to your lift. Way to the lift. Look, yes. Is recognized representative rice. Thank you, Mr. Speaker. Does the gentleman yield? I yield. Is it not true that integrating workforce development programs into the state board of education's curriculum will better prepare Georgia students for high demand careers? That's absolutely true, and I appreciate the question. Career technical and agricultural education is such an important part of what we offer for our students. And it's not about telling a young person, you're going to be a plumber when you're five years old, or you're going to go into this particular career. But the more that we talk about the opportunities that exist in our state early on and have those conversations, the better off all of our students are. And that's the essence of what we're trying to do here is to align our workforce development initiatives and make sure that we're being as effective as we can in terms of educating our students in the state. But I absolutely agree with you. Well, Mr. Speaker, you have one more gentleman who knows a little bit about education, representing town should write up the center aisle on your right. Thank you, Mr. Speaker, is gentleman yield? I yield. Is it not true that this is one of the key pieces in areas and workforce development in technical college system that really sets apart from other states in the nation? We have a great TCSG program. We work together. It's a case 16 approach. And this is one of the many examples that helps George Ashan in this area. Absolutely. And to my friend from the coast, that's one great thing about our career and technical education opportunities in the state is we have always for a very long time led in this space, whether it's at the K-12 level or with our technical colleges. And for many of the other states in the nation, they look to us as a leader in this space. And so it's something that we all can be very proud of and confident when we go back to our homes. And we're talking about things that we're doing right as a state. We're really doing well in career and technical education. And this will just continue to enhance and extend that. Gentlemen, has there further questions? Well, with that, I would ask members for your favorable consideration and I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? Here in the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Here in the other report, the committee is agreed to. Shall this bill now pass all in favor of the passage of the bill we'll vote yes, all those opposed will vote no? And Mr. Clerk, will you unlock the machine? All members voted for what purpose is representative hall rise? Parliamentary inquiry. State inquiry. Mr. Speaker, is it not true that ensuring students have access to career education from grades 6 through 12 will help strengthen our future workforce? I think that's an unspeakable fact. Thank you for the inquiry. All members voted. If so, Mr. Clerk, will you lock the machine on the passage of House Bill 192? The yeas are 155. The nay is 1. This bill hadn't received a requisite constitutional majority. Is therefore passed. Mr. Clerk, will you read the caption to House Bill 181? 181. House Bill 181, by the represent of very hard of the 36 and others to be entitled to amend chapter 10 and title 31 of the official go to Georgia and it's in a related to vital records. So to provide for the issuance of a certificate of foreign birth by the state registrar without a judicial order of certain criteria in that. Ms. Bill, I refer to the committee on judiciary. That committee recommends that this bill do pass. Her represent of your heart is recognized to present the bill. Thank you, Mr. Speaker. And colleagues, I present to you for your consideration, House Bill 181, a Georgia foreign adoption bill. This bill removes a costly and duplicative step for Georgia families who seek to acquire a Georgia certificate of foreign birth for a child who has already completed the foreign adoption process as recognized by the US citizenship and immigration services and this child has already received a certificate of US citizenship. So in layman's terms, this is going to benefit your constituents. This is one of those bills and I love carrying them that you can just feel good about at the end of the day and that your constituents are going to appreciate. Most of us do have constituents who have engaged in the foreign adoption process. So under current law, when a family adopts a child internationally and that adoption is recognized and verified at the federal level and the child is granted citizenship, Georgia requires adoptive families to undergo something known as a re-adoption process or a domestication process to obtain a certificate of foreign birth. So this process involves hiring an attorney and navigating the court process again to obtain a report of adoption, which is just an acknowledgment of the adoption, which is later submitted to the Georgia Department of Vital Records to obtain the child's certificate of foreign birth. So re-adoption is an expensive, redundant, and a time-consuming process for Georgia families who've already incurred great expense to adopt their children internationally. Now you may be asking why does a child have to have a certificate of foreign birth? Essentially, it's just a Georgia birth certificate much like you or I might have if we had been born here in the US but without this certificate, without the certificate of foreign birth adoptees, we'll really only have their original copy of their birth certificate from their country of origin. That can present challenges to them throughout their life when they are looking to use a birth certificate for identification purposes. Some entities may not recognize these certificates and they're also very difficult to replace. So adoptive families that adopt children internationally are encouraged to go for and get a certificate of foreign birth for their children. Now the bill, what it does is it eliminates that duplicative step. Since the required verification of documents for the foreign adoption has already occurred at the federal level, any re-adoption process, we believe here in Georgia is just duplicative and the necessary. 29 other states have removed and eliminated this re-adoption process. Folks, this is good for Georgia's children. It's good for Georgia families. This issue was really brought to my attention by a constituent who adopted four children internationally. The cost, the total cost to bring those children home was close to $80,000. You can imagine with foreign adoption, there's a lot of red tape. You have to travel. And then when they returned home, they had to go back in higher an attorney and spend an additional $5,000 just to get that certificate of foreign birth. So Mr. Speaker, that is the bill in a nutshell and I will yield for any questions. Thank you. Lady has no questions. All right, if so, Mr. Speaker, I'll yield the well. You must have done a great job there, I was listening. Lady, as yielded the well, is any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? Hearing none, the report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill? We'll vote yes. All those opposed will vote no. And the clerk, Mr. Clerk, will you unlock the machine? Hmong mayor. the It All members vote of this so Mr. Clerk will you lock the machine? On the passage of House Bill 181 the yeas are 154, the nays are zero this bill having to see the requisite constitutional majority is therefore passed. Mr. Clerk will you read the caption to House Bill 283-283? House Bill 283 by the way of the 79th and others be tall of the NAC to amend Code section 40, 13, 2.1 of the official code of Georgia and it's ended relating to signature on citations required effective failure to sign exemptions for out of state drivers and electronic capture of signature. This bill ever referred to the Committee on Motor Vehicles, that committee recommends that this bill do pass. The lady from Clayton County or representing Niel is recognized to present House Bill 283. Thank you to the speaker. Proceed. Thank you, sir. Thank you to the speaker. Thank you to this body for the continued support. I present to you House Bill 283, the traffic signature bill. We have done this dance before. Thank you to this body for passing this bill overwhelmingly last year as it made its way through this house. It also moved to the Senate and it was left in Senate rules last year. This bill essentially is designed to do a few things. Reduce negative encounters between law enforcement officers and citizens, save taxpayer dollars, free up law enforcement for more high priority calls and ensure that everyone goes home at the end of the night. All this bill does is callifies into law the ability for law enforcement to write reviews assigned on a ticket. In instances where they encounter a citizen who's not agreed with a charge or understanding the fact that some citizens don't quite understand that not that signing a ticket is not an admission of guilt. And allows officers to take this safe route if they feel it would make them feel more safe and get home at the end of the night. Thank you to my bipartisan co-sponsors and to my external law enforcement supporters of this bill, the Board of Teased Police, GMA, SACG, George Department of Public Safety, the Troopers, and with that Mr. Speaker, if I don't have any questions, I yield the will. Do you have a question if you're taking one? I will. Representative Reeves, to your right, has a question. Mr. Speaker, would the General Lady yield for a question? Of course, to my friend. Is it not true that you have been a police officer, you've worked on this bill for a long time, and this bill will de-escalate situations on the roadside and keep public safety? Absolutely. We want everybody going home at the end of the night. Thank you. The lady has no further questions. Thank you, I ask this body for your favorable consideration. Good job, the lady is yielded the will. Is there any objection to the previous question being ordered? Hearing none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Hearing none, the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? Will vote yes, all those opposed. Will vote no, and Mr. Clerk, will you unlock the machine? Have all members voted? All members voted. If so, the clerk will lock the machine on the passage of House Bill 283, the yeas are 155, the days are 6. This bill, Henry C. DeRec was a Constitutional majority, is therefore passed. Congratulations. Again. Mr. Clerk, will you read the caption to House Bill 205-205? House Bill 205 by Representative Clark of the 100th and others to be entitled. And act to amend chapter 1 and title 6, an article 2A of chapter 3, a title 38 of the fish quoted George Anitettin relating the general provisions relative to aviation and the board of Homeland Security respectively, so as to provide for the development of a list of approved unmanned aircraft systems for use. This bill I have referred to the Committee on Public Safety and Homeland Security, that committee recommends a dispelled dupe pass by Committee Substitute. You ready, Representative Clark? I see you have an adoring audience up in the gallery. We welcome your lovely wife Courtney and the beautiful Miss Madison to be with us. Thank you all for being here and observing your husband and your dad as he presents the bill. The gentleman is recognized to present the bill, Representative Clark. Thank you, Mr. Speaker. And to all my colleagues that we've decided to bring before you today, House Bill 205, today we address an issue of Master's Security, one that directly impacts George's government agencies and their use of drones. It is no secret that vast majority of drones using the United States are designed, manufactured, or assembled in the peoples republic of China. The U.S. Department of Defense, Federal Security agencies, and multiple state governments have raised serious concerns about the security risks posed by these foreign-made drones. Two Chinese companies, DGI and Atele, currently control 90% of the global drone market. These companies have well documented ties to China's ruling Communist Party and the people's liberation army. Both the FBI and the cyber security and infrastructure security agency, CISA, have identified their drones as a significant security risk. Why is this a problem? These drones have the capability to store and transmit data. Under Chinese law, companies must share their data with the government. This means that Chinese government agents could access sensitive information collected by these drones, potentially without the knowledge of their U.S. users. This is why House Bill 205 is so important. What does this bill do? This legislation directs the Georgia Emergency Management and Homeland Security Agency to work alongside the Department of Administrative Services, Security and Security Experts to develop a list of clear drones. Drones that are deemed safe and secure against hacking or unauthorized data transmission. And here's what this bill requires, that GEMA and Homeland Security Agency must compile and maintain a clear list of drones that meet strict security standards. State and local agencies are encouraged to purchase drones only from this clear list. Beginning January 1, 2028, state and local agencies will be prohibited from acquiring drones that are not on this list. And no later than December 1, 2025, GEMA and Homeland Security Agency must develop and publish this list of approved drones for use within Georgia. This list must be developed in a coordination with the Department of Administrative Services and after consulting with experts in data collection and privacy. To be included on this list, drones must comply with Federal Aviation Administration standards, be cleared for use by the U.S. Department of Defense and meet the security requirements of the Federal National Defense Authorization Act. What this bill does not do, this legislation does not ban drones outright, instead ensures that drones used by our government agencies can be rendered safe from foreign interference. And the key requirement is simple, drones must not be capable of transmitting data to unauthorized parties. Why this matters? Housemaut 205 is a proactive step towards securing Georgia's critical infrastructure and protecting our sense of data. By ensuring that only safe and secure drones are used by state and local agencies. We are strengthening Georgia's defense against foreign threats. I urge this bill to help safeguard our state's interests. With that, I will be glad to take any questions, Mr. Speaker. General, is you the four questions? Ripley, we have left and you are left. It is a recognized four question. Thank you, Speaker. Does the gentleman yield? Are you? Is it not true that this little rectangle I hold in my hand cell phones that each and every one of us have, that we carry in our pockets, that we carry in our purses, that we take to the bathroom, are all mostly made in China. That is true. The questions? General, I yield for another question from Representative Hepner to your left. Thank you, Mr. Speaker. Does the gentleman yield? Are you? Is it not true that without the support of legislation like this, technology, this type of technology would make installations like Fort Eisenhower, which is the cybersecurity capital of the nation in Augusta, Georgia, make them subject to the possibility or the potential of observation from foreign adversaries. That is definitely true. Thank you, sir, for bringing this legislation. Thank you, ma'am. It's right in front of you. By now, you lead a representative to Hewglie is recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, ma'am. This is just for information because I don't know the answer to this. Are there any local governments that are operating entities that would be in violation of what we're trying to do now or is this just to make sure that they don't? So, so, an end of 2025, there'll be a list because right now, I mean, there were probably a number that have the drones that would be put on the list and that would be updated at the end of this year. They would know going forward starting in 2028 in the first of the year that those will be banned. But it gives them time also to say, there was some discussion about how calls come in about investments that have happened in drones that are being used by our agencies here in Georgia. But the average lifespan is three years. So, it's giving that ample time for them to get in compliance. So, does the gentleman further yield? Yes, ma'am. So, what I'm hearing you saying is that even though there may be some that will be banned if we pass this, the effective date is such that they will that will be beyond the useful life of the ones that are in effect now. Is that what you're saying? Yes, ma'am. It should be right there on that average lifespan of these drones. So, that's why we gave that three-year gap to getting compliance. And I know also there is discussion up in DC talking about outright banning some of these certain drones that are on the list. And so, I think what this is doing is showing Georgia's leading collaborating with the federal government, we're having a voice to sit down, talk, discuss this. Because there's a lot of movement in these drones, just like AI, every day, especially with this war in Ukraine. You're having like 100,000 drones on the Russian side and on the Ukraine side going at each other. And so, a lot of technology is speeding up real fast. Also, like air gaping, sandboxing, where it can secure even some of these drones that might be on the ban list, we might have the technology to be able to still use them, but then start the transmitting of data. But this is a moving thing that's going on with these drones. And it's us coming with the federal government working with them on this list and then we will fall in compliance with the federal government with this department of defense. Hopefully that answers your question. Representative New to your right has a question if the gentleman would you or representative News recognize her question? Are you? Thank you, Mr. Speaker. Does the gentleman you? Yes, ma'am. All right. Is it not true that House Bill 205 ensures that state agencies purchase only vetted and secure unmanned aircraft systems that meet federal and state security standards to protect critical infrastructure and government operations? Yes, ma'am. You're right on point. Thank you. Thank you. The gentleman has no further questions. Thank you, Mr. Speaker. Without you, the well announced for your favorable consideration of House Bill 205. Thank you. Thank you for the bill. We do have one person to speak on the bill and next chairman, Crowe. I think this bill came out of your committee. Representative Crowe has recognized to speak to the bill. Thank you, Mr. Speaker. Colleagues, I rise today to speak to the support of House Bill 205. Critical measure aimed at ensuring security, reliability, and efficiency of unmanned aircraft systems used by our state agencies. This bill mandates that the Georgia Emergency Management and Homeland Security Agency develop and maintain a list of approved UAS that meet stringent, federal, and state security standards. As drone technology continues to evolve, state agencies increasingly rely on unmanned aerial systems for disaster response, infrastructure inspection, and law enforcement operations. However, concerns regarding cybersecurity vulnerabilities, foreign interference, and operational safety necessitate the standardized approach. House Bill 205 addresses these concerns by ensuring that only drones meeting federal aviation administration standards, Department of Defense Security protocols, and national cyber security safeguards are utilized in official state capacities. Under this legislation, by December 1st, 2025, Jima and Homeland Security will establish an approved list of unmanned aerial systems used by state agencies. And beginning in January 1st, 2028, state entities will be prohibited from purchasing non-approved drones, reinforcing our commitment to securing critical infrastructure and safeguarding sensitive government operations. Importantly, this bill does not restrict private individuals or businesses from purchasing or operating drones of their choosing own private property. By supporting House Bill 205, we are taking a proactive step to modernize Georgia's approach to drone technology while maintaining the highest security and operational standards. I urge my colleagues to join me in passing this measure to protect our state's interest and ensure a safe and efficient use of unmanned aircraft systems. Thank you, Mr. Speaker. You're the well. General Gilles is the well. There are no further speakers. No further questions. Is any objections to the previous question being ordered? Here in none the previous question is ordered. Is any objection to adopting the committee's substitute? Here in none the committee's substitute is adopted. Is there any question to agreeing to report of the committee which was favorable to the passage of the bill? Here in none the report of the committee is agreed to. Shout this bill now pass all in favor of the passage of the bill. Will vote yes. All of those opposed to the bill will vote no and Mr. Clerk will you unlock the machine? All members voted. All members voted if so the clerk will unlock the machine. On the passage of House Bill 205 the yeas are 162 the nay is won. This bill hadn't received a requisite constitutional majority as therefore passed. Members we're going to take up a bill now we want our brother when brethren on the other side of this building to acknowledge their representative Huddleston that we're taking up a Senate bill. We hope they'll do the same on some House bills so we want to get this session started on the right foot. So Mr. Clerk will you read a caption to Senate bill 16? Senate bill 16 by Senator Brass and the 6th to be entitled to amend Chapter 11 of Title 45 of the official code of Georgia and Intenta related Miss Lennie's offenses concerning public officers and employees so to modify provisions relating to public officials engaging in the bail bond business. This bill I refer to the committee on government affairs that committee recommends a disbill do pass. Representative Huddleston you're going to tell me you perfected the language that came over from the Senate is that what you're going to tell us good work. Representative Huddleston is recognized to present Senate bill 16. Thank you Mr. Speaker thank you to the members of the House. I'm honored today to bring you Senate bill 16. Within this bill the current law does not allow a bail bondsman or somebody affiliated with a bail bonds business to run as an elected official with only one exception and that exception is for the school board. We had an occurrence back in our district that Senator Brass and I serve of Hurt County population of Hurt County is about 12,000 so we let's say know that sometimes that we need good individuals to run as elected officials within these smaller counties. We had individual that actually qualified campaigned and actually won the election outright and actually when she had went to attend ACCG training in Athens she had did her due diligence and did her homework and she read within the code that if you're a bail bondsman that you cannot hold an elected office and if so it would be a misdemeanor. Basically there come back made the election supervisor made the chair of the commission aware of that which many of us was unaware of that law that was originated possibly back in about 1980. So basically what Senate bill 16 does it actually adds the exception.\n\nto the law to where anybody from a county municipality or consolidated government could hold an elected office as long as their business is not in the same county that they serve. So basically you can be a resident of a county, hold them elected office and have a business in another county. Mr. Speaker, that's the bill and I'll give you a framing question. You have a question to your right. Looks like you could have talked to him on the way by, but I guess you didn't. So I'm gonna recognize, we're seeing Jason Ridley for a question to your right. Extreme right, way back in the corner. Thank you, Mr. Speaker, do you yield for a question? Yes, sir. Now I'm sorry, I didn't catch you. I was out there talking to someone on phone. This bill is no way been endorsed or anything by the Bell bondsman association. This is just one issue that we've had. We're trying to fix it, is that correct? That is correct, basically it's not of one issue. It had been within this being brought to the attention, like I said, it was a current in our district, but since then, basically I have heard of other occurrences where two ways is where others may have known of the law and was not allowed to serve in that elected office. But I've also heard that there was a number of individuals possibly that had served for years in an elected office and was unaware of the law. Okay, thank you. Thank you. You have a couple of the questions. Do you have one from Representative Mack Jackson from Downing Washington County, Representative Jackson? Thank you, Mr. Speaker. Does gentleman yield? Yes, sir. I'm trying to understand the bill. Does the bill prohibit an attorney from having part ownership of a Bell bondsman company? I wouldn't know that answer, but I can follow it up and follow it with that question. Thank you, sir. Thank you. Representative Anderson has a question to your right. Yes, sir. Gentlemen's recognized for a question. Thank you, Mr. Speaker. Does the gentleman yield? Yes, sir. Is it not true that in most of our small communities, it's very difficult to find people willing to serve in local office and this bill will expand that pool and allow more to participate in that? Yes, sir, that is correct. Thank you for the bill. Thank you. You have one more question. It's gentleman will yield. Yes, sir. Representative Thomas, do you write towards back? Do you yield? Yes, sir. Is it also not true that this ensures individuals that actually serve in those counties are not allowed to participate in Bell bondsman service in that particular county, but it's okay for maybe adjacent counties? That is correct. So there's no conflict of interest thanks to the provisions of this bill. No, sir, there's no conflict of interest. Thank you, great bill. I appreciate you bringing it. Thank you. Gentlemen, has no further questions. You did a good job explaining the bill. It's a good bill, so thanks for bringing it. Thank you, Mr. Speaker. I yield well. Gentlemen, is yielded well? Is there any objection to the previous question being ordered? Here he none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Here he none, the report of the committee is agreed to. Shout this bill now passed all in favor of the passage of the bill. Will vote yes. All those opposed will vote no. And Mr. Clerk, will you unlock the machine? Have all members voted for what purpose is represented fliming rise? Parliamentary inquiry, Mr. Speaker. State chamber inquirer, sir. Mr. Speaker, is it not true that Senate Bill 16 upheld fairness and ethical standards by allowing more citizens to run for office while ensuring they do not engage in business activities that can present conflicts of interest? I thank the gentleman read the bill and form an opinion, isn't it? Is correct. Thanks for the preliminary inquiry. All members now voted. If so, Mr. Clerk, will you lock the machine on the passage of Senate Bill 16, the yeas are 159, the nays are six. This bill, having received the requisite constitutional majority, is therefore passed. Mr. Clerk, will you read a caption to House Bill 196196? House Bill 196 by represent Kelly, the 16th and others to be entitled back to men part one of Article I of Chapter 18 and Title 45, the fish code of Georgia annotated relating to state employees health insurance plans. So it's required that drugs dispense to a covered person for self-administration under state plan be reimbursed. This bill I refer to the Committee on Health, that committee recommends that this bill do pass by committee substitute. This is the one we've been looking for, the last one. So if you'll give the gentleman your attention, we'll hear Representative Kelly present House Bill 196. The gentleman is recognized to present the bill, Representative Kelly. Thank you, Mr. Speaker. Members of the House, I come before you proceed. Thank you, Mr. Speaker. Members of the House, I come before you today with House Bill 196. This is a measure that bills on the efforts that this House has led on to not only protect consumers, but to provide some relief for our local pharmacies and hopes of helping them keep their doors open. This bill simply creates a reasonable rate of reimbursement for our pharmacies when they're dispensing drugs that are needed by our constituents to help keep them healthy. It does have a creating and equation that where we will reimburse them a guaranteed rate based on the NAIDAC pricing model and a reasonable dispensing fee that exists. Mr. Speaker, this House has led on this issue of holding our PBMs accountable. This House has led on trying to reduce drug prices for our constituents. This House has led on keeping our local pharmacies doors open. This is another important step in that manner. It's important because two weeks I had the opportunity to hear a story from one of our fellow representatives who had talked to their local pharmacists in rural Georgia. That pharmacist shared a story with them about two individuals who had came into their pharmacy over the weekend. One was a parent trying to get life-saving cancer drugs for their child. And the other was a senior citizen on a fixed income who has a certain prescription they need so that they can stay alive. Because of the system that exists today that we're fixing with this legislation, that pharmacists had two choices. They could either not fill the prescription and these individuals not get the medicine they need to save their lives or that pharmacist could lose $500. That pharmacist did the compassionate thing. They did the right thing. They took care of someone who needed it and they filled those prescriptions. We need to stand up for them the same way they stand up for our constituents. And that's what we have the opportunity to do today in House Bill 196. Mr. Speaker, I know there will be others who want to speak on this measure, but I'm glad to answer any questions at this time. There are a couple of others to speak. You are correct, but you do have a couple of questions. So I'm going to recognize them if you're here for some questions. Yes, sir, Mr. Speaker, I'll you. I want to recognize Chairman Williamson to your right, representative Bruce Williamson from the Department of Health and Health. Mr. General Neil, is it not true that all across Georgia are independent pharmacies in many small towns as our first line of health care? Yes, that's not true. You're exactly right. I appreciate that question. Thank you. You're 100% correct. Thank you. Mr. General, we know a little bit about medicine. Chairman Hawkins, the center aisle has a question. General is recognized. Thank you, Mr. Speaker. Is it General Neil? Of course. All right. Is it true that this bill will help our local independent pharmacies to remain in business and to continue to be a vital health care provider in our communities? I appreciate that question. And we didn't get to this point today without a lot of valuable input from our local independent pharmacies. But we went to get here today. If it weren't champions on this legislation like you and all the hard work you and your committee members, Chair Lady Matthews and others who came before as well with this legislation. So I appreciate all y'all's help with this as well. Representative Gamble, Governor's floor leader is recognized for a question. Thank you, Mr. Speaker. Does this gentleman yield? Audio. Is it not true that two years ago during the legislative session, I received the news that young brothers pharmacy in Carter'sville, which was at the time the oldest independent pharmacy in the state, 130 years old, was unfortunately going to be shutting its doors and that had this legislation been in place, it might have saved them from having to close their doors. I know the gentleman certainly knows what he speaks and it's a shame that's happened. And this is just the first step. I hope we'll all be united in trying to do more on this issue because there's a broken system that we need to help fix so that we can keep those mainstream pharmacies their doors open. Thank you for the question. Representative Matthews, Senator Al to your right has a question. Ladies recognized. Thank you, Mr. Speaker. Does the gentleman yield? How will certainly? Is it not true that House Bill 196 will help increase the transparency of pricing of drugs dispensed under the state health insurance plan? It absolutely will and I know you're someone who has been a champion for this issue and I appreciate all the hard work you've done on it and for that question. Thank you, sir, and thank you for this good bill. Representative Scoffield has a question. Thank you. Can you write? Can you write? Can you write? Yes, gentlemen yield? Certainly. I'm sure that I held a PBR reform information session and brought everybody in a room together so your bill and this bill and the work that we've done is so needed and so on all on behalf of all the pharmacies. I'm saying thank you because we've done this over and over again and it's time. So thank you. Well, thank you. This is a group effort and there's a lot of recognition that needs to go around for getting this done. I appreciate your passion and compassion for helping us get this done. Gentlemen, I have several more questions and we do have a couple of speakers. I'll be glad to maybe take one more than I'll yield. Okay. We'll take one from someone who writes a couple of these prescriptions. We'll take it from Chairman Newton, Chairman Dr. Newton to your right. Has a question. Thank you, Mr. Speaker, with a gentleman yield. Certainly will. I can't tell you how it isn't it true that this is going to make a big difference on something we found out last year of our independent pharmacies being forced to sell medications at less than the wholesale price that they had to pay that NADAC that you mentioned. Isn't that true? That's absolutely true and it's extremely disappointing that they're having to make that decision and it's even more disturbing that there are players in the space who are manipulating the reimbursement rate so that they'll be put in that. With a gentleman further yield. Absolutely will. Isn't it true that while that will cost a small amount extra in the state budget to pay a fair price to these independents? Isn't it true that we have on our desk today a medication that our PBM on SHBP requires you to use a specialty pharmacy and pay $3833 when under your NADAC plus a reasonable fee would have been about $50. And isn't it true that as you said we've got a lot more work to do on this? I think that this could actually end up saving our state health benefit plans some funds. So I appreciate that question and I think there'll be some other speakers who elaborate maybe on that a little bit more. Thank you for your work. Thank you for the question. Mr. Speaker I appreciate the thorough conversation about this. It is an important issue and I know others will speak to it so at this point I'm going to yield the well and ask for a favorable consideration. We have a couple of speakers on the bill. I know this is going to be hard for at least one of you too. I don't know which one that is but I'm going to limit your comments to 10 minutes because option here to do that. So I'm going to recognize and not in order I was aiming that at Chairman Powell but I'm going to recognize Chairman Powell first for comments on the bill. It's an important bill. Chairman Allen Powell to speak to House Bill 196. The gentleman's recognized. Speaker, ladies and gentlemen of the House and I don't come down here to speak on other people's bills much but this is one that I feel compelled to speak on and I want to thank the gentleman for bringing this bill forward. This is about fairness. This is about equal payment and this society we live in today. The small businessmen have enough problems being able to survive. And in this practice it's been going on by the PBMs and those people doing reimbursement. You've heard the questions that were answered. You've heard the presentation so I'll not get into those specifics about the healthcare and prescription methodology. But if we're going to be paying a reimbursing pharmacist it is only fair that the small pharmacies are reimbursed as the same rate as the box stores. We're living in a society today that bigger is always better. Well it's not always better. What's by the time the local pharmacist and the small towns they were our first line of healthcare. If you didn't feel right or something didn't look good or whatever it might be with your kids or whoever. You went to the local pharmacist and they could pretty well give you a diagnosis of whether you needed whatever or you needed to go see the doctor. If those local pharmacists and I would reach out to the folks in here for those of you who have not heard from your local pharmacist it's because you don't live in a small area where there are local pharmacists. You live where you go to the box stores and I would remind you that if you go to one of those big pharmacies that are paying the full rate and you stand in that consulting line that they have and if they get to you they might if not it'd be like them getting on a phone somebody getting on a phone to try to call defects. You can't get into the line. So I would encourage the members of this house to vote green on that board. Green in support of the small the small business man. The community people who make healthcare what it is in your communities. Treat them fair. We've talked about this for years but this is about fairness. Why should one pharmacy be paid less than what other box stores are? Again I want to thank the chairman and I'm going to shock the speaker. I'm not going to stay up here 10 minutes. I think I said all I need to say but thank you for voting in favor of this and vote for the small business man and the small pharmacies. Mr. Chairman, thank you for your comments. That was not aimed at you. It was named to the next speaker. Gentlemen's yielded the well. I know this gentleman knows of what he speaks when it comes to this issue. Chairman Stevens, please come in line. Mr. gentlemen is recognized. Thank you Mr. Speaker. I promise I won't take 10 minutes. Some of you might remember last year that if you were here not our new members of course but we had a parade of folks that came up here and talked about pharmacies that were closing in our doors forever. Some of them generational stuff and then we put a handout to give you some idea of the games that were being played by the PBMs that intentionally I believe was there to put these independent pharmacies out of business. Really hard to believe. I want to thank Representative Kelly for bringing the bill. I want to thank the commissioner of Department of Community Health who took an interest this year to really begin to peel this onion back and get to the truth of what's going on. I want to thank Speaker of the House. It doesn't get the credit that he deserves very often but these are small businesses folks. I put a little sheet on your desk to give you some idea of what you start. Peeling that onion back to see what your teachers, your public safety people and even your own insurance. What you're paying for whenever you get something for example especially drug. We know that their own chain pharmacies were paid in average of 42% more than your independence even if you're out in the sticks as they say. But they were there whenever you needed them, 42%. If you look at this little chart we finally went through the back door if you will to find out what they were actually charging your teachers, your public safety people and your own insurance carriers. On at the very first one you'll see that there's a muscular dystrophy drug, a net cost, net act cost which is the national average acquisition cost, pretty standard. If you go into your pharmacy at cost $23 you're going to get it for about 40 once this bill passed if you'll vote for it. Your PBM pharmacy was charging $3833. We ought to be ashamed of ourselves for not finding this out sooner. You look down this whole list of any of these drugs that they call specially drug and it's any drug that they want to call a specially drug. If your local pharmacist tries to fill this prescription you get an immediate message that comes back and says you have to go to your mail order pharmacy. And that cancer drug by the way that's going to be thrown at the front step or your door. You don't have to worry about sign and forage your mail delivery person will leave it there. Of course we don't have temperature problems down here in the south doing. Ladies and gentlemen this time that we start peddling this onion back for the safety of our patients, for our teachers, for our public safety people and for your own family. Thank you. Thank you, Mr. Chairman. I know that the gentleman knows of what he speaks and I appreciate your persistence on this issue. Thank you for your work and thank you for what you're going to do on this issue. We have no further speakers. So is there any objection to the previous question being ordered? Chair here's none of the previous questions ordered. Is there any objection to adopting the committee's substitute? Here in none the committee's substitute is adopted. Is there any objection to agree to the report of the committee which was favorable to the passage of the bill here in none the report of the committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no and Mr. Clerk will you unlock the machine? Have all members voted for what purpose is chair Lady Darlene Taylor-Rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, is it not true that parent costs will help independent pharmacies, especially in our rural communities, remain financially viable and continue to provide those that lack these services? Absolutely, Lady knows of what she speaks. What purpose is represent the rice? Parliamentary inquiry. Mr. Speaker. State your inquiry. Mr. Speaker, is it not true that a young man like myself who grew up in a small county in Georgia of 8,000 people had a drug store guy who wasn't only just the administrative of the drugs but he was a part of our community. He played an important role and because of that facility a lot of people in our local community was able to survive and we need to show them the due respect that they deserve and pass this bill in their support. 100% thank you for your inquiry. We want to take one more from chairman Jasper's from the other end of this spectrum up in north Georgia. Mr. Chairman, you recognize. Mr. Speaker, Parliamentary inquiry. State your inquiry. Is it true that this bill, if it were enacted last year or the year before, would have saved Bell's pharmacy and take Georgia from closing? Is that not true? I thank you. Gentlemen, those are what he speaks. Thank you. Thank you, Mr. Chairman. Thank you, members. All members voted if so, the clerk will lock the machine on the passage of House Bill 196, 196. The yeas are 168. The nays are zero. This bill, having received a requisite constitutional majority, is therefore passed. Thank you, members. Thank you, members. A good day to be a member of the House. We're going to postpone with that completes the rules calendar other than this. A bill that was postponed. A resolution that was postponed yesterday House resolution 32 will be again postponed to our next legislative day. We have a couple of motions. We'll take up now for what purposes represent the Osteen rise. To make a motion. State your motion. I move that House Bill 262 be recommitted to the rule development committee. Mr. Clerk, will you read the caption? House Bill 262 by Representative Osteen of the 169th and others to be titled back to a man chapter 2, title 31 of the fiscal to Georgia and it's a relating to the Department of Community Health. On the ladies' motion, the House Bill 262 be recommitted to the rule development committee is the objection. Here he known as awarded. For what purposes represent the bill rise? I rise to make a motion. State your motion. I move that House Bill 389 be moved to the committee on energy utilities and telecommunications from the committee of judiciary, both chairman and agree. Thank you, sir. Mr. Clerk, will you read the caption? House Bill 389, the representative bill is 75th and others to be titled back to a man title 44 of the fiscal to Georgia and tend to relay the property. On the gentleman's motion, the House Bill 389 be withdrawn from the judiciary committee and recommitted to the energy utility and telecommunications committee is the objection here in none is awarded. For what purposes represent the chance, canon rise? To make a motion. State your motion. On motion, the House Bill 451 move from education and game fishing parks, both chairman and agree, Mr. Speaker. Mr. Clerk, will you read the caption? House Bill 451 by resident of canon, the 170th second and others to be titled back to a men part 14 of article 6 of chapter 2, title 20 of the fiscal to Georgia and Tato relay other educational programs under the Quality Basic Education Act. On the gentleman's motion, that House Bill 451 be withdrawn from the education committee and recommitted to the game fishing parks committee is the objection here in none is awarded. For what purposes represent the, ow, Williams rise. Make a motion. State your motion, sir. Mr. Speaker, move that the rules be suspended and a great bill. We assign to committee and read for the first time. I got to hear it, Mr. Clerk, will you read the caption? On number of House Bill, by resident of Williams, 168th and others to be titled back to a men part two of article 15 to chapter 1 and title 10 of the fiscal to Georgia and Tato relay in the fair business practices act of 1975. On the gentleman's motion, that the rules of this House be temporarily suspended so a bill can be read for the first time and assigned to committee is the objection. Agriculture and consumer affairs. Chair Lady Cooper, you ought to come down front. A lot of folks are busy this morning so we want to let you finish up a morning order that you put in for this morning. Chair Lady Cooper is recognized for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen, the House has been a special day for me. I had one of my seniors from Walton High School today testify in a committee on a bill that he brought to me and it passed out of that bill unanimously. And I have a group of ladies that are my neighbors that are in the balcony that are some of the hardest working people in this state and who give a great deal of their time to helping others, especially children in this state. They're my friends and neighbors in the Atlanta Country Club area and they're in the gallery if we could have them stand and if you would recognize them. Thank you very much and welcome to the Capitol ladies. Thank you. We hope you stay tuned again in May. Mr. Clerk, were you read a caption to a group of privileged resolutions? Honoring the life and memory of Art Wood Howard. Honoring the life and memory of Joshua Josh Michael Rogers. Commending Georgia Military College on its 150th anniversary. Recognizing and commending, Nancy T.A. R.O.G.B.A. Recognizing and commending at the Faye A. Nare Sojay. Recognizing and commending, K.O. Day, A.D. Kuhnley. Recognizing commending, phenomenal Hughes Global Network, congratulating Kate Andrews of Central Forest, I.T. High School for winning the 2024 GHSA 6A-7A state all around gymnastics competition. Recognizing Georgia State University College of Law. Recognizing and commending, self-minute for his-\n\nGeorgia Transportation Alliance for his years of service and commitment to the advancing transportation policy in Georgia. Recognizing commending Madison Hendershot of the Georgia Transportation Alliance for her years of service and commitment to advancing Georgia Transportation policy in Georgia. Celebrating Black economic empowerment in Black excellence in honor of Black History Month. Recognizing March 5th, 2025 a small business state, the Georgia State Capital. Recognizing June 7th, 2025 is TIUA School of Business Entrepreneur Day. Recognizing February 20th, 2025 is girls empowerment day. Recognizing and commending and either Reynolds Howard. Honoring the Alpha, Alpha sorority and incorporated on its 50th chartering anniversary. And congratulating the Georgia Association of Manufacturers on its 125th anniversary of its formation. And congratulating Commending Joe Walston for receiving the 2025 Yellow Rose, NICATEE Randall Service Leadership Award and for other purposes that completes the reading of this resolution. We'll move on after the order. As y'all know, we rolled some over from yesterday. Representative Kelly and all the members that are in CLOB 504, 504, all members in 504, if you're joining the gentleman at the well. Members, I want to ask you to stand and give the gentleman and the office sweet mates and the well your attention. Give them your attention. Gentlemen, we'll suspend just for a moment now. I think we have everyone. Gentlemen's recognized. Thank you, Mr. Speaker. We talk a lot about this body and this capital community being a family. And I truly believe that. And one of the most important parts of that family are those who help take care of us during this session while we're up here. And that's our admins at work in our office. And they are family to us. And our admin, Patricia Howard, her father passed away on Friday. Mr. Artward Howard Jr. His family lovingly called him Kang Bill. And he was a remarkable man who raised a remarkable daughter. And Mr. Howard served in Vietnam. He's a Vietnam veteran. Serving in the US Army, a member of the 82nd Airborne Division. He was honorably discharged from the Army. He came back and worked in his family's construction business. He cared for his wife. He cared for Miss Patricia and their sons. And we just all want Patricia and her family to know that they're in our thoughts and in our prayers. And that we're here to support them in this difficult time. And so I would just ask for us to take a moment of silence and reflection and prayer for Patricia and her family. Thank you, Miss Speaker. We yield the well. Thank you for that, remember us. Members, we have a fair number of afternoon orders. You would normally have one minute for your afternoon order. I'm going to give you a little bit of flexibility. But absolutely no longer than two minutes. Absolutely no longer than two minutes. Representing Sanchez is recognized for an afternoon order. Gentlemen's recognized. Thank you so much, Mr. Speaker. I am proud today to presenting, it was originally yesterday's but today's Black History Month moment. I stand to honor the legacy of civil rights activists and important Smyrna community member, Fannie Williams. Fannie Williams was born right after the Civil War and became a cook for a prominent Smyrna family, the Campbell family. And she became a famous her cook in Smyrna, but that was just her day job. On top of all of the work she did as a cook, she worked tirelessly to advocate and be a leader in her community, dedicating her life to improving the lives of Black Georgians and fighting for civil rights in the early 10th century, a time of great people in our country and she stood strong against the hardships of Jim Crow and segregation in our state to ensure community was taken care of. She was instrumental in raising funds and helping to open the first black hospital in Cobb County. She was the largest donor for the building of Wheat Street Baptist Church right here in Atlanta. And she was not afraid to stand up to racism and was a strong voice against the KKK in Cobb County. Fannie Williams also helped open the infamous Aunt Fannie's cabin in Smyrna, which is named after her by the white owners. While the original intent of the cabin was to sell local wares, she shared her cooking with the community and because she was such a great cook, it just ended up becoming a restaurant. And a very famous one for those who know about Aunt Fannie's. Although her cooking and recipes were put the restaurant on the map, she did, unfortunately, pass away soon after the opening of the cabin. And afterwards, the restaurant itself presented a skewed version of some of the Antibell himself. But and it did have issues with, you know, the way it presented some of her legacy. So in order to justify her legacy, make sure we show the truth of what happened with Fannie Williams, the city of Smyrna did erect a statue a couple weeks ago in honor of her legacy and her important work in her community to make sure you remember for what she was really a big person for, which was standing up for Black Georgians. And I just want to thank every single Black woman who continues the work of people like Fannie Williams today in here at the state of Georgia. Thank you so much and thank you so much for speaking out. You're the well. Representative, Lisa Campbell is recognized for a foreign afternoon order in the morning. Repson Campbell. Thank you, Mr. Speaker. I had planned this for yesterday on the ERA day. You know, we have a museum display upstairs dedicated to the Equal Rights Amendment. And I think a lot of us may think that this issue is extinct or dead. But I do want to highlight that in fact, we have never ratified the equality for women in our Constitution. And today I'd like to consider the strides we have made as women. In my lifetime, it was that Georgia ratified women's right to vote. Now my grandmother's lifetime, my lifetime. My mother could not get a credit card without my father's signature. And when I graduated high school, not my grandmother, not my great grandmother, I could not get a small business loan without a man's signature. Today I'm so pleased that we do have these rights, but they could easily be pulled away from us at any moment. So I'm urging us all to consider this, to consider your fellow colleagues in this body who just want the Equal Rights to live freely, to study freely and learn about our own history, to be able to make our own decisions about where we live and the families that we have, the jobs that we choose and the voices that we can share. I wanted to read one quote that I found especially poignant. And it is from the governor of Florida, Bob Graham in 1982. And he's shared, the time for equality in the United States of America is never ended. It's never defeated, it's never killed. And to suggest otherwise, to suggest that equality in this great country has a deadline of expiration, a date, a finality, is to renounce the very values which are America. I thank you for considering this and I hope you will continue to work with us for our equal rights. Representative Derek Jackson has recognized for an after-nord, a representative Jackson. Thank you, Mr. Speaker. This was intended for yesterday to recognize an awesome alpha man. There we go. Thank you. So ladies and gentlemen, I rise today to highlight one of the greatest Supreme Court justices since 1789, when the Supreme Court was established. This trailblazer, the understood the importance of rule of law and the Constitution. The sustained jurors with Thurgood Marshall. He became the 96th Justice in October 1967 and served until October 1991 for 24 years. Thurgood Marshall, a towering figure in American history, dedicated his life to the pursuit of justice and equality. He believed, fervently, the promise of the United States Constitution and the potential to ensure that every citizen is treated with fairness and dignity. As the first African-Americans to Supreme Court justice, Marshall left an indelible mark on the legal landscape advocating for civil rights and the protection of individual freedoms. If he was still here, he would challenge us all to look at the rule of law and the Constitution as the cornerstone of our democracy. However, when you think about where we are with today's Supreme Court and the state of our politics, he would challenge us to confront the ongoing disparities and injustices that persist in our society. Now I know, a member from this body came up last week and offered praise of today's administration. But one of the most pressing issues of our time right now, and the last four weeks, is to combat corruption, bribery, quipro quo, and conflict of interest. And so when you think about the corruption that we see in the firings of all these federal workers, the negatively impact Georgia, I would like to challenge all Democrats and Republicans to do as they did in 1974. In the spirit of Thurgood Marshall, they all got together and forced Richard Nixon to resign. And with that, Mr. Speaker, I yield the well. Representative Park Cannon is recognized for an afternoon order. Ladies recognized. Thank you, Mr. Speaker. Today I rise for an afternoon order on Black History to praise the heavenly birthday of one of our beloved Georgians, former congressmen, John Lewis. Today we celebrate the life and legacy of John Lewis, a true American hero. He dedicated his life to justice, equality, and the fight for civil rights, never backing down in the face of adversity. From the freedom rides to the halls of Congress, he showed us what courage and integrity look like. He believed in getting into good trouble, necessary trouble, to make our country better for everyone. His sacrifice on the Edmund Pettis Bridge helped to secure the right to vote, reminding us that democracy is not a gift, but a responsibility. On his birthday, we honor his unwavering spirit by continuing to fight for justice, fairness, and freedom. May we always walk in his footsteps and never step, and never stop pushing for a more just world. If he were here today, he would remind us that democracy is not a guarantee. It is a fight. It is our responsibility to keep marching forward. I'm proud to have a highway named in District 58 for him. I'm proud that Decatur has put a statue for him. I'm proud that Georgia Tech has named their student center after him and given $100 million to erect that center. I'm proud that Georgia State University has the John Lewis Scholarship. I'm proud that Spellman College has the John Lewis Scholars Program. And I'm proud that Emory University has named their inaugural John Lewis chair in their law school. Thank you so much. Happy birthday, John Lewis. I love and I miss you. Thank you. Here he is, right? He's recognized. Gentlemen's recognized. Thank you, Mr. Speaker. And as one of the members who competes with another for the longest drive to the Capitol, I know more. The most on how this caucus becomes this house and chamber become a family to us. And I just wanted to take a point of personal privilege in welcoming and enjoying the last two days. My father and his beautiful and very patient wife Mary Sains for Inferno Sains with us today. My first experience in public service was helping him put his duty belt as a 40-year career in law enforcement. Prior to retiring and going to Miami, I appreciate having him here. And I know they're appreciated getting out of this cold and a couple hours. Thank you, Mr. Speaker. Mitchell, yes, they are good to have you in the people's house. Thank you for being here. And I know you want to go back to the warm weather. Representative, our Williams is recognized for an order. We'll do a morning, no, this afternoon and the morning. I got it right now. Gentlemen's recognized. Thank you, Mr. Speaker. Thank you most of all for letting me come up here. But the freeze back there needed to walk around. This morning, I would like to remind us many years ago, a gentleman who served in this house, Reverend Jose Williams, organized and got approved by Dr. King, a program called Scopes, some a community organization and political education, where offices were set up all over the south to teach political education and literacy. And he did a magnificent job, but the high point of that summer was when several people came to Liberty County, some from New York, Peter Grunstein, some from Philadelphia, Claire Willis, Rita, and some from Los Angeles, Ms. Gonzalez, whose name I can't remember. But one particular person that came was Alice Walker, who would go into great fame and writing the color purple. While she was in Liberty County, she became completely blown away by a young fine debonnier gentleman from Midway, Georgia, who because of his swag and swaffness, she could not resist. And so we spent a lot of time together and might have still been together, had it not been for a beautiful young lady from Huntsville, who just had more going for her and slut me off my feet. The experience of Alice and those that came to Liberty County shall live on forever. And I've heard that she continues to grieve to this day by missing out on the gentleman from Midway with his fine self. Thank you, Mr. Speaker, I yield the well. Representative Williams, I know how it is to be pursued by a, oh yes, what can I say? I'm sure that's the right thing to do. Chair Lady Darlene Taylor is recognized for an afternoon order. Chair Lady Taylor. I don't know how you follow that, but I'll try. Good afternoon, everybody. I'm here on your desk to tell you about the Okifinoki. There was a great article that was in the paper and I wanted to share it with you because it talks about the importance of our ecosystem. This is the largest intact freshwater wetlands, not just in our country, but in the world. And it's to celebrate the nomination of the Okifinoki to become a UNESCO World Heritage. All I can say is remember the Okifinoki. Thank you. Thank you. Representative Panich and friends. Representative Panich. Give the letter to your attention, please. Can you put the picture up? Thank you, Mr. Speaker. Today I rise on behalf of a grief stricken and heartbroken Jewish community as I honor the memory of Kaffir and Ariel Bebis, a nine-month-old and a four-year-old who were violently kidnapped from their homes on October 7th and murdered in Hamas captivity. They were not killed by an airstrike. They were strangled with bare hands and then their bodies mutilated to hide how they were murdered. You may have seen the headlines yesterday as the bodies of the Bebis children and their mother were purportedly returned to Israel as part of the ceasefire. But by the end of the day, it became clear that Sheri's body was not returned at all. In a calculated act of psychological torture, Hamas sent back an unidentified corpse. They also took their father Yarden Bebis into Gaza on October 7th. After 15 months of torture, 35-year-old Yarden was returned alive three weeks ago. His young Jewish father survived Hamas captivity to see his sons lifeless bodies returned to Israel. And not his wife. 504 days since October 7th, Hamas continues to violate every single moral value. They are evil. Hamas terrorists and their enablers and sympathizers throughout the world continue to perpetuate unspeakable evil and bloodshed. They are humans without humanity. Your Jewish constituents are not okay. We need your voices of outrage at this evil. For the Jewish people, we need your caring and for you to check in on our well-being. I ask, where is Sheri? And where are the remaining American hostages? Where is Eden Alexander? Where is Etechen, the Daechagai, Judy Weinstein, the Gai and Omer Neutra? We pray to God that Sheri and the remaining hostages are returned safely. May their memories be a blessing and may there be abundant peace from heaven and life for us and for all Israel. We say amen. Amen. I'm Israel Khai. Thank you, Mr. Speaker. I yield the well. Thank you, Representative. That completes our afternoon orders. Members, I'll remind you if you have pages today, join me down front and our pages for pages photos. We have a couple of announcements. We're going to recognize Chairman Erwin for announcement. Representative Chris Erwin. Speaker and education members, we are going to meet in CLOB 506, or a full committee meeting, upon adjournment, and I have a box lunch for you at your seat. Again, full committee members for education, CLOB 506, upon adjournment. Thank you. Representative Anger Willis has recognized for announcement. Representative Willis, give the ladies some room coming down now. Representative Davis or Scofield are recognized for the next one. I think that's going to be representative Scofield, his own deck. Thank you, Mr. Speaker. Good morning. Just an announcement that the Atlanta delegation meeting will not occur today. It has been moved to next week. I will update you accordingly. Just wanted you to know that the Atlanta delegation will not be meeting today. We'll meet next week. Thank you, Mr. Speaker. Representative Scofield, recognize for announcement. Thank you, Mr. Speaker. Members of the House, just an update that Sunday February 23rd will be the annual Amod Aubrey run 2.3 mile run, and it will take place at 12 noon at the Lee and White complex on Lee Street in Atlanta this Sunday. Thank you very much. Thank you, Representative Carter and Representative Mitchell. Representative Billy Mitchell. Recognize for the announcement. Thank you, Mr. Speaker. I come on down. Your name is on the sheet. You're welcome on. Thank you. Making them look good. Yes, yes, yes. So good afternoon, everyone. We want to announce and remind some that this evening, the Georgia Legislative Black Caucus, our annual Gala at the Aquarium at 7 o'clock PM. So I hope you all already have your dresses for the ladies and your makeup and your gentlemen, your tux. And we'll see you all tonight. Thank you, Mr. Speaker. Oh, wait a minute. The ladies are not on. You got 45. You got more time. Oh, we got more time. You made him look good. He didn't say anything. That completes our announcements. Members, we have a couple of birthdays. One of them actually is today representing Victor Anderson. Happy birthday, Mr. Chairman. Happy birthday. Let's wish Victor Anderson a happy birthday. And on Saturday, Saturday tomorrow, Representative David Simpson will have a birthday. Let's wish David a happy birthday. That completes our work. Thank you for being here. Thank you for your attention. The majority of this house is recognized for a motion. Thank you, Mr. Speaker. We've moved to this house stand adjourned until 10 a.m. on Monday, February 24, 2025. All in the motion of the majority leader, that this house stands adjourned until 10 a.m. Monday, February 24, 2025. All those in favor. All those in favor will say aye. Opposed, no. Nothing closer but the eyes have it. We are adjourned. Thank you all. Have a safe weekend.",
  "updated_at": "2026-02-14T03:26:17.776619+00:00"
}