{
  "video_id": "EU4JQFAymK8",
  "url": "https://youtu.be/EU4JQFAymK8?t=1315",
  "title": "Georgia House - Day 15 (2026-02-08)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 15,
  "video_date": "2026-02-08",
  "duration_minutes": 144,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 15 (2026-02-08) session:\n\n**Overview**\nThe session featured a special guest speaker, Sergeant First Class Richard Sykes of the Georgia State Patrol, who delivered a devotional message to the representatives. Several bills were introduced and referred to committees.\n\n**Key Actions**\n- **HB 35**: Referred to Health & Human Services Committee\n- **HB 52**: Referred to Education Committee \n- **HB 3**: Referred to Public Safety & Homeland Security Committee\n- **HB 55**: Referred to Natural Resources & Environment Committee\n- **HB 77**: Referred to Ways & Means Committee\n\n**Bills Introduced (First Reading)**\n- HB 35, HB 52, HB 3, HB 55, HB 77\n\n**Notable Moments**\n- Representative Pam Workhizer introduced Sergeant First Class Richard Sykes of the Georgia State Patrol, who delivered a devotional message to the House about wisdom, discretion, and serving others.\n- Sykes spoke about the challenges faced by law enforcement and lawmakers, emphasizing the importance of relying on God's guidance and putting others first.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nQuorum was present, as the session was held.\n\n**Adjournment**\nThe session adjourned. The next House session was not specified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you we . Pam concerned is Thursday, 57th House District, Representative Chairman Bill Warkizer. Thank you, Mr. Speaker. My pleasure is morning to introduce Sergeant First Class Richard Sykes, State Patrol Day at the Capitol. And Mr. Sykes attended Georgetown University and Armstrong to attend their police academy and has worked at the Georgetown Police Department before realizing his lifelong dream to come in a state trooper, where he was elected by his class as Chaplin, which speaks volumes of his character. He has been assigned a Brunswick Waycross, Hanzville, Rankin and Ridgeville, while quickly climbing to the ranks, he has served as a member of the DPS Critical Incident Support Team and the Coordinator of the State Patrol Peer Team, which if you're on public safety, you know that that provides counseling and PTSD support officers who are involved in horrific incidents. He has served as post commander over the Nighthawk South DUI Task Force, his currently the Post Commander of State's Bureau, where I did my first ride along, which all of you are invited to do. Your heart hasn't raced until you look over and you're doing 104 in South Georgia on a two-lane black road where it's drizzling rain. Just word to your friends. If you think you can outrace these guys, you cannot. Now the good stuff. First of all, he has good friends with Speaker Burns and First Lady Dale Burns. And Speaker graciously allowed me to introduce, he said he already had his allotted day and did not use privilege to use another day. So since Richard's my constituent, but little did they know how closely we were tied. His wife basically grew up in my house because she was best friends with my daughter. And we went to church with his family and his parents and they were very close friends, Rod and Robin, which I assume are watching online. One of the most powerful testimonies I heard was from his mother-in-law, his husband was shot and killed in a robbery and came to the place after many years of grace and just incredible grace to meet the guy face to face and forgive him. And so we grown very close to their entire family. He's the father of three beautiful children, Carter, Kason and Creed, and they all attend Pondview Baptist Church. Richard, come speak to us. Thank you, sir. Thank you. Good morning. So thank you for giving me this opportunity. Stand before you all and present a brief devotion that God has played on my heart. Thank you, Mr. Speaker and your colleagues and Representative Workhizer. For who you are, if you want to stand for. I also want to thank my command staff for their support and their sacrifices as well. When I was first asked about doing this, my immediate response was of hesitation. But then I went to what a better way to represent my agency and to talk about my Savior Jesus Christ. And also it helped when I saw the alligator have come on nerves. I knew it was going to be a good day. I'm very humbled to be standing here before you today. I'm no means a preacher, so please don't think that. It will not hurt my feelings though, if you all decide to pass it off and play it afterwards. So this won't take long, but I do hope you get something out of it. If nothing else, I know that I need to hear it. I'm here by the grace of God. I've been to many places with the patrol and try to look at his God, having me therefore reason. And saying that, I will let you some scripture from the Brook of Proverbs, starting chapter 3, verse 19 through 28. I'll read through it and then discuss a little bit. Verse 19 says, The Lord by wisdom found in the earth, by understanding He established the heavens, by His knowledge, the depths were broken up, and clouds dropped down the dew. My son let not them depart from your eyes, keep sound wisdom and discretion, so they will be left to your soul and grace to your neck. Then you will walk safely in your way, and your foot will not stumble. When you lie down, you will not be afraid. Yes, you will lie down, and your sleep will be sweet. Do not be afraid of sudden terror nor of trouble from the wicked when it comes. For the Lord will be your confidence, and will keep your foot from being caught. Do not withhold good from those who may just do, when it is in the power of your hand to do so. Do not say to your neighbor, go and come back, and tomorrow I will give it, and I will give it to you. You know, in this day and age, there is no doubt we live in trying times. In the past couple of years, I have packed my bags multiple times, just waiting for a phone call to see where the next mission would be. My kids have always looked and said, where are you going? I said, I don't know. But I trusted God. In verse 20,\n\nOne that says keep sound wisdom and discretion. As a way for those mission orders, their own going conversations during that time as to how we will carry out what has been said before us, whether that's setting up COVID medical supply transport from Atlanta to Wake Cross, and then the Brunswick in mere hours so they can be dispersed to hospitals and places needed. Where the phone calls made for the troops to be sent to Atlanta, and I'm almost noticed to secure our capital and other surrounding areas from the sheer destruction and terror by those that lack wisdom and discretion. In any scenario given, we have to use wisdom and discretion as to proper states so our mission can be carried out. As verse 23 says, we will walk safely in our ways and not stumble. It doesn't say it'll be easy. For in verse 25, it states, do not be afraid of sudden terror nor of trouble from the wicked when it comes. We have hope in our Lord and Savior. As verse 26 states, he will be our confidence and will keep us from being called. What peace there is in knowing that he will take care of us. If he sets it before us, he will come by the way. We can rest in verse 24 as it states, we lie down and we will not be afraid and our sleep will be sweet. As members of the House representatives, I know y'all do face many challenges to carry out your mission each and every year that is set before you. Once you do hear our fakes, each and every citizen of the state of Georgia. Through the process, I'll go through every year, you must keep sound wisdom and discretion as well. As troopers, we're given a lot of discretion to perform our daily duties. I feel the same is true for the representatives. We all face challenges to get our mission moved forward, but as I said before, God will always provide a way if we look to Him. I really want to key in on verse 27 as it states, do not withhold good from those to whom it is due when it's in the power of your hand to do so. One of our core beliefs for the Department of Public Safety is that of compassion. The sole reason I want to be a trooper was to help others in need. It's not to see how many tickets I could write. It's not to see how many people I could take to jail. It's a way for me to be a witness to those in need. Oftentimes, when we encounter others, it's possibly the worst they have their life. Every chance I get to do good for those in need and by the grace of God, I'm able to do so. I strive to do that. Now, I'm by no means perfect and don't claim to be. I fall short every day, but as mercies are new every day as well. In my role as a supervisor, I've always tried to stress to my troopers to help others when you're able to, no matter what the scenario is. As I said before, we have a lot of discretion how we choose to use that sets the support for the good of the cause. As verse 28 says, do not set a year neighbor go and come back and tomorrow I will give it when you have it with you. We must act on the issues at hand because that is often when the need is greatest. As each of you represent the 180 different districts in the state of Georgia, you're tasked with representing those districts to the best of your ability, just as troopers represent the state to the best of their ability. I cannot tell you the sheer joy I received when I found out that as the house representatives, you'll have a devotion. In a time where many are ashamed to be set apart because a fear of what one may say or what they may think of them, you have allowed me to share a brief devotion with you and for that I'm grateful. As a stand before you, I challenge my colleagues to keep sound wisdom and discretion in their actions. I challenge them to do good to those that are due when they're able to. I understand the most of the time it comes as a personal sacrifice to them, but as Jesus made the ultimate sacrifice for us, we too are about to do the same. John 1513 says, greater love have no man than this and delay his life down for his friend. How to challenge you is the house representatives as you carry out your duties and the capacity of representatives that you do not withhold good from those who misdo. When it is in the power of your hand to do so as verse 27 states. I know that each of you sacrificed a lot to be here away from your families for several weeks. Out of the year and then to even return home still doing your work. A person wanted to thank you for their sacrifices because what you do, it takes my family personally. Thank you again for this opportunity to share with you all. If you'll stand, we'll have a word of prayer. Thank you. Dear Heavenly Father, I thank you and praise you for this day Lord. For your many blessings, for your mercy in your grace. For allowing me the opportunity to stand and be a witness for you Lord. I pray for each and every one of us here that turn the side to do your work that you bless our families, bless them in their efforts as they progress on in the world that we know that is not our home. We love you and praise you and assist in Jesus' name. Amen. Stand for a plate. Let the ladies to the flag and we now have to take it into America and to the Lord that we will stand one nation in our God, in this form within our community and in this form. Thank you. Doorkapers, we'll unlock the doors. Members, you may greet our chaplain. Sergeant Sikes in the South, any room for a photo of you so like. you you you you Canada be correct. And just something else for you to think about. If we truly believe that we can, we're halfway there already. No true words were ever spoken, Chairman Tarvan. Thank you. I believe. I believe. And we are almost halfway there. We're on day 15. We got a couple more. Chairman Tarvan, the chair of the Committee on Information and Odits reports that the Journal of the previous legislative day has been read and found to be correct. Is there any objection to dispense with the reading of the journal? Chair, here's none. The reading of the journal is dispensed with. Is there any objection to the confirmation of the journal? The chair, here's none. And the journal is confirmed. Mr. Clerk, will you read the resolution establishing the order of business for the day? Representative, registration of the 104th news following be established as the order of business and the first part of the period unanimous consent. Introduction bills and resolutions. First reading and reference of house bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? Chair, here's none. And the resolution is adopted. First reading of bills and resolutions. Mr. Clerk, will read. House Bill 263, members. Senator Thomas, the 65th Bill, me, and Todd Electum, and chapter 7 and Todd 48, the fish put a Georgia antenna relating to income taxes. Ways and means. No, those 264 members. Smith and 138, roads and 24th lands on 48, corporate 174th and black men and 146th. Bill N. Natto, man, go section 48, five, three 11 of the fish put a Georgia antenna relating to creation, county boards of equalization. Ways and means. 265, I was in a car, the 93rd, Kendrick and the 95th more, the 91st and Taylor, the 92nd. Will be Todd and Natto, men, the Nat provide for a supplement for the compensation salary, expenses and allowances that judge a spirit, quarter, octail judicial circle. Intergovernmental coordination. House Bill 266, by the way, the birth of the 20th, Matthew, the 74th. Don't know who the 31st, Clark and the 100th, Bonner, the 73rd and others. Will be Todd and Natto, men, chapter 12, the time of 31 of the fish put a Georgia antenna relating to control of hazardous conditions. Public and community health. House Bill 267, by the way, Smith, the 18th, corporate of the 174th, roads, 124th, Hitchens, 1161st, Evans, the 57th and others. Will be Todd and Natto, men, article on chapter 7, the time of 48 of the fish put a Georgia antenna relating to general provisions relative to income taxes. Ways and means. House Bill 268, by the way, the 64th, followed 33rd, the 6th, Mathis, the 149th, the part of the 5th. Will be Todd and Natto, men, chapter 6A, the 35th, the fish put a Georgia antenna relating to criminal justice, coordinating counts. Public safety and homeland security. House Bill 269, by the way, the black one, the 146, Doug, 78th, Gainesville, 20th, Oliver, 80th, Roberts, 50th, and others. Will be Todd and Natto, men, article on section 50, 141, the fish put a Georgia antenna relating to the meetings, open to the public. Governor Smith, by the way, the 64th, the 61st, the 61st, the 62nd, and the base more of the 69th. Will be Todd and Natto, provide a home set exemption from the City of College Park at Valorant Taxes Room, municipal purposes. Director of governmental coordination. House Bill 271, by the way, the purple 169th, corporate of the 174th, lumpston, the 12th, Jasper, the 11th, Williams, the 148th, and others. Will be Todd and Natto, men, title 40, the fish put a Georgia antenna relating to motor vehicles and traffic. Did you do, Sherry? House Bill 272, by the way, the huddleston of the 72nd, Collins, the 71st, Smith, the 18th, Smith, the 70th. Will be Todd and Natto, authorize the municipal court of the City of Carrollton, the charge and technology fee. Intergovernmental coordination. House Bill 273, by the way, the loach of the 167th, the 179th, Williams, 168th, and Petrie, the 166th. Will be Todd and Natto, men, article 2, the title 12, the fish put a Georgia antenna relating to general provisions relevant to the Department of Natural Resources. Natural resources and environment. House Bill 274, by the way, the journals of the 16th, Scott and the 76th, Davis, the 87th, the colliding, the 130th. Will be Todd and Natto, men, chapter 4, title 1 of the fish put a Georgia antenna relating to holidays and observances. Defense and veteran affairs. House Bill 275, by the way, the Apollo 33rd, Corv. 174th, by the way, the 11th and Purple 169th. Will be Todd and Natto, men, chapter 1 and title 51 of the fish put a Georgia antenna relating to general provisions relevant to the torts. Judiciary. House Bill 276, by the way, the Skoggins, the 14th, Gunt 38th. Here to the 150th, Kelly, the 16th, Oliver, the 82nd and others. Will be Todd and Natto, men, code section 23, 411 of the fish put a Georgia antenna relating to definitions regarding tuition, equalization grants. Higher education. House Bill 277, by the way, the Skoggins, the 14th, Gunt, the 19th, Kelly, the 16th, Smith, the 18th, Fleming of the 114th and others. Will be Todd and Natto, men, chapter 7, the title 48 of the fish put a Georgia antenna relating to income taxes. House Bill 278, by the way, the 175th, the 137th, follow the 33rd, Corber to the 174th. Will be Todd and Natto, men, chapter 5 and title 43, the fish put a Georgia antenna relating to athletic trainers. Hill. House Bill 279, by the way, the 15th, Fry, the 123, we now are the 21st, Washburn 144th, and gole the 19th. Will be Todd and Natto, men, chapter 32 and title 33, the fish put a Georgia antenna relating in the property insurance. Insurance. House bill 280 by verse. On a gamble of 15th, lump into the 12th. Williams, 48th Taylor, 173rd Smith, 18th. Let me talk an act to men chapter 24. Title 33, the fish go to Georgia. Anateta relaying the insurance generally. Insurance. House bill 281 by verse. The remainder of the 56, Thomas the 65th, the limber the 98th. He'll be taught on act to amend article one of chapter 88. Title 36, the fish go to Georgia. Anateta relaying the local government budgets and audits. Governmental affairs. House bill 282 by verse. The remainder of the 56 work. Eyes are the 157th. Wilkerson, 38th Smith, the 41st and limber the 98th. Bill be taught on act to amend part two. Article six of chapter two. Title 20, the fish go to Georgia. Anateta relaying the compensation and core curriculum. Education. House bill 283 by verse. The camp on 35th. Jazz versus the 11th bottom of the 73rd. Corbord of the 174th Smith of the 18th and others. Bill be taught on act to amend part one of article one of chapter eight. Title 48, the fish go to Georgia. Anateta relaying the general provisions. The applicable the sales and use taxes. Ways and means. 284 by verse of camp on 35th. 9 to the 134th Cameron. The first Mithiac of 74th Green. The 154th and others. Bill be taught on act to amend chapter 133. The fish go to Georgia. Anateta relaying the general. The provisions for insurance. Insurance. House bill 285 by verse. The Franklin 160th Carson. The 46th Martin. The 49th Williams. The 148th Rhodes. The 24th and others. Bill be taught on act to amend. Article seven of chapter 20. Title 47, the fish go to Georgia. Anateta relaying the public retirement systems. Investment authority. Retirement. House bill 286 by verse. And if I will, the 50th Bruce, the 60th. Camp 130th Oliver. The 82nd Giller. The 160 second and others. The be taught on act to amend. Chapter 20 E. At title 33. The fish go to Georgia. Anateta the surprise. Bill and consumer protection act. Insurance. House bill 287 by verse. The Tom was the 65th. Go field is 63rd and marine in the 96th. The be taught on act to amend. Chapter 2 titled 26. The fish go to Georgia. Anateta relaying standards labeling. And adulteration of food. Agriculture and consumer affairs. House resolution 125 by verse. And we're now the 77th Scott of the 76th Jones. The 60th Douglas the 78th and deal the 79th. The resolution recognizing Dr. Barbara Pulley and dedicating a road in her honor. Transportation. Senate bill one by Senator Donna Salis, the 27th goods to the 51st. And in the bar today, the 31st Kennedy, the 18th, more of the 53rd and others. Bill be taught on act to amend. Chapter one, a title 50. The fish go to Georgia. Anateta relaying the general visions regarding state government. Public and community health. And Senate bill 26 by Senator Donna Salis, the 27th, getting the 47th. Good minute. Eighth Walker or the 20th. Hickman in the fourth and others. Bill be taught on act to amend. Title 50. The fish go to Georgia. Anateta relaying the state government. Governmental affairs. Senate bill 36 by Senator Robertson. The 29th albors, the 56th, her Patrick and 32nd. Eccles the 49th hatchet with 50th and others. Bill be taught on act to amend. Code section 16, 6, 13th. Fish go to Georgia. Anateta relaying the penalties for violating. Code section 16, 6, 9 through 16, 6, 12. Judiciary non-sub all Senate bill 37 by Senator Robertson. 29th albors, the 56th hatchet with 15th. Summers, the 13th. Her Patrick and 32nd and others. Bill be taught on act to amend. Mark on act chapter 16 to title 15. The fish go to Georgia. Anateta relaying the general provisions regarding sheriffs. Public safety and homeland security. That completes first readers. Second reading of bills and resolutions. The clerk will read. House bill 240 by Representative Green of the 154th. The bill to authorize the assessment and collection of technology fee by the probate court of Clay County. House bill 241 by Representative Plain of 1009th. Judges of 60th, Alexander the 66th. Glaes of the 67th coming of 39th. And others. Bill relating to minimum wage law. House bill 242 by Representative Hitchens of the 161st. Stevens of the 164th. Petrie of the 166th. Lumps of the 12th, Powell 33rd. Bill relating to the Georgia drivers education commission. House bill 243 by Representative Smith. Seventyth Collins of the 71st. Smith of the 18th Jenkins of the 136th. Huttleston of the 72nd and others. Bill relating to the number of judges of superior courts. House bill 244 by Representative Petrie of the 166th. Roads of the 124th. The loads of the 167th sands of the 180th. Towns of the 179th and others. Bill relating to General Provisions. Relativity to Game and Fish. House bill 245 by Representative Evans of the 57th. Plain of the 109th. Park of the 107th. Marin of the 96th. Carter of the 93rd and others. The bill would lead to minimum wage law. House bill 246 by Representative Mom to Hannah of the 17th. Parsons of the 44th. Dickey of the 145th. Tarvan of the 2nd. Berk of the 169th and others. Bill relating to conveyances. House bill 247 by Rebs and Hawkins of the 27th. Banner of the 73rd. Clark of the 100th. Williams of the 168th. Thomas of the 21st and others. Bill relating to the Fair Business Practices Act. House bill 248 by Rebs and Ridley of the 6th. Irwin of the 32nd. Roads of the 124th. Collins of the 71st. Franklin of the 160th and others. Bill relating to General Provisions. Regarding Sheriff's House bill 249 by Rebs and Martin of the 49th. Bill of the 48th. Jones of the 47th. McDonald of the 26th. Gaines of the 120th. Bill relating to the needs based financial aid program. House bill 250 by Rebs and Sains of the 180th. Hitchens of the 161st. Kelly of the 16th. Townsend of the 179th. Matthew of the 74th. Bill relating to civil practices. House bill 251 by Rebs and Scott. Bill of the 63rd. Drenner of the 85th. Canter of the 101st. Evans of the 89th. And Hutchinson of the 106. Bill relating to governmental entities. Prehypted from restricting utility service connection. Or sale fuel space to on type. An ability to choose utility service. House bill 252 by Rebs and Thomas of the 21st. Banner of the 73rd. Clark of 100. Ballard of the 177th. Prince of the 130th. And others of bill relating to appointment. Compensation authority qualifications. Training and other limitations. Access to appropriate court judges crimes and offenses. The best relations education military affairs. Registration and licensing motor vehicles and retirement pensions. House bill 253 by Rebs and Mount Canada. 17. Kelly of the 16th. Sebald of the 34th. Tarvon of the 2nd. McCollum of the 30th. And others to bill relating to crimes and offenses. House bill 254 by Rebs and Jenkins of the 136th. Canada of the 170th. Second percol of the 169th. Corner of the 3rd. Lot of the 131st. Abel relating to requirements of an official legal organ. House bill 255 by Rebs and corporate of the 174th. A bill to amend and act providing election of board of members of the board of education of Brantley County. House bill 256 by Rebs and Scott Field of the 63rd. Green of the 154th. Carter of the 93rd. And Miranda of the 96th. And Banner of the 73rd. Abel relating to prohibition of age discrimination and employment. House bill 257 by Rebs and Scott Field of the 63rd. Davis of the 176th. Hutchinson of the 106th. Hugely of the 141st. Bill of relating to general provisions regarding health. House bill 258 by Rebs and Scott Field of the 63rd. Davis of the 176th. Hutchinson of the 106th. Banner of the 137th. Abel relating to food drugs and cosmetics. House bill 259 by Rebs and Scott Field of the 63rd. Banner of the 143rd. Scott of the 76th. Davis of the 87th. Mitchell of the 88th. Abel relating to general contracting provisions for the Department of Transportation. House bill 260 by Rebs and Scott Field of the 63rd. Davis of the 87th. Mitchell of the 88th. Gailier of the 160th. Second Tom. So the 65th. Abel relating to conservation and natural resources. House bill 261 by Rebs and Lewis. Ward of the 115th. We'll claim that the 109th. Banner of the 94th. Abel relating to labor and industrial relations. House bill 262 by Rebs and Lewis. Ward of the 115th. I believe the 143rd. Jackson of the 128th. Gailier of the 160th. Second Abel relating to agriculture. House bill 119 by Rebs and State. House resolution 119. Rebs and Sains of the 180th. Townsend of the 179th. Petrie of the 166th. The Antioch of the 74th. Fans of the 133rd. And others resolution creating the joint study committee on censorship by social media platforms. House resolution 120 by Rebs and Mitchell of the 88th. Bernal of the 77th. Taylor of the 92nd. Adinia of the 110th. Lays of the 67th. And others resolution urging the Congress to enact legislation to repeal the government pension offset and windfall elimination provision for the Social Security Act and for President Joe Biden to sign that legislation into law. Three second graders. Members opposed. But as wykon二 is back the last following recommendations. House Bill 33, do pass House Bill 132, do pass respectfully submitted Robert Dickey the 145th District Chairman. Mr. Don Parsons, the 44th District Chairman of Committee and Energy Utilities and Telecommunications submitted the following report. Respect your committee on edge. Energy Utilities and Telecommunications. Senator consideration following bills of the House, the Stark Community Report, same back the last following recommendations. House Bill 92, do pass House Bill 73, do pass quite committee substitute. Respectfully submitted Representative Don Parsons, the 44th District Chairman. Representative Sharon Cooper, the 45th District Chairman on Committee and Public Health submitted the following report. We speak to your committee on Public Health and the consideration following bills and resolutions of the House. The Stark Community Report, same back the last following recommendations. House Bill 129, do pass House Bill 143, do pass House Resolution 95, do pass respectfully submitted. Representative Sharon Cooper, the 45th District Chairman. Senator Maul and Powell, the 33rd District Chairman on Committee Unregulated Industries submitted the following report. Respect your committee unregulated industries and a consideration following bills of the House. The Stark Community Report, the same back the last following recommendations. House Bill 76, do pass House Bill 155, do pass respectfully submitted. Representative Maul and Powell, the 33rd District Chairman. That completes the reading of the report to standing committees. Thank you. Members, please take your seats. We're going to move on to morning orders now. But first, the chair would like to take a point of privilege. You know, this body was led over the years by two great Georgians, both of them from the mountains of North Georgia. Speaker David Ralston and Speaker Tom Murphy. We have the great honor today to have the son of Speaker Murphy, retired Superior Court judge, might Murphy to be with us today. Let us honor you by recognizing you, Judge Murphy. Thank you. We thank you for your service to our state and to your family service to our state by supporting your dad. Thank you for being with us. Thank you. We will now recognize our doctor of the day. Representative... Miriam Parrish will stand in for leader Beverly to introduce our doctor of the day. Representative Parrish. Thank you, Sika Verne. Thank you. Ladies and gentlemen, today I rise to introduce to some of you our doctor of the day. She is Dr. Keisha Verne, Collins. She is an obstetrician gynecologist with community health care systems, a federally qualified health center network in central Georgia. She currently serves as chair of the National Advisory Council for the National Health Service Corps and was a former NSC scholar. She serves as a clinical assistant professor and Joy McCann endowed professor with Mercer University School of Medicine. She was appointed by the governor to serve on the Georgia Composite Medical Board and the Sandra Dunnigan Deal Early Language and Literacy Board. She serves on the board of directors for the Health Care Georgia Foundation Board, the Georgia State Medical Association and the Bib County Medical Society. She is chair for the Medical Association of Georgia, Task Force on Physical Health Care Workforce Resilience and the Georgia OB-GYN Society Breastfeeding Medicine Committee. Dr. Collins brings a wealth of knowledge to women's health for rural and underserved populations and is actively involved in pipeline mentorship, translation, no research and community engagement. Her personal mission statement is you may not be able to change the world but you can change the world of everyone with whom you interact. Ladies and gentlemen, Dr. Collins. Thank you for being here. Thank you for joining us. Thank you. Good morning, everyone. It's such an honor of privilege to be able to be of service to you today. If you are a male and you come to the station today, I may have a little bit of trouble taking care of you since I'm an OB-GYN but I will do my best. And we have Nurse Julia Mack on standby. So between the both of us, we can figure it out. It's such a pleasure to be here today as Physician State of the Capital, so I'm among friends. And you know, of all the things that were read in the bio, the thing that I think is most important for you to know is that I have an 18-year-old and a 14-year-old and those are the two hardest jobs that I've ever had. So with that, I just wanted to borrow some words from our former Surgeon General, David Satcher, Dr. David Satcher. And I'm personalizing this quote for you. We need legislators who first care enough. We need legislators who learn enough. We need legislators who do enough. We need legislators who will persevere until the job is done. And I'll leave my prayer with you as I say thank you for what you do on our behalf for the citizens of Georgia. And my prayer every morning is that God will give us the capacity to meet our calling and the passion to fulfill our purpose. Thank you so much.\n\nThank you very much. We certainly are always blessed to have great physicians from around our state to be with us. And thank you, Dr. We appreciate you being here. We're now moving on to morning orders. We have a long list of morning orders. We're going to ask each member to hold their morning order to one minute. We have a lot of folks that need to be recognized. So I hope we'll all recognize that and be aware that all the members need opportunity to address the folks who are here with them. So it's a big day at the Georgia Capitol. So we'll start with Chair Lady Cooper. She's in, we'll skip right on over her then since she's having a meeting in the back of the room. We'll move on to morning orders with Chairman Gerald Green, Dean Green. Would you start us off with a morning order and Chair Lady Hauston, if you would join him. Thank you, Mr. Speaker. This morning we are happy to have in the balcony many, many wonderful grooves. One of these individual groups is from Bruton Park, a college. Former State Representative Roger Burrard, now the perpetrator of the professor there, is in the balcony with his group. And Jacob Shield is with Speaker of Burrard's office. He is from England and he is serving part of that time here at the State Capitol. And as part of my other introduction, I'd like to introduce you to Chairman Penny Hauston, who will talk about communities in school. Thank you. It is so good to have communities in schools here at the Capitol today. They are making a difference in the lives of Georgia students all over. I had a resolution to read, but I'm afraid to take me longer than a minute to tell everything that Georgia, that communities in schools are doing. So I'll just give you a little highlight. If you don't have a community in schools in New York County, you need one. Because communities in schools are the children that they aid, 90% of the students, aided by communities in schools, graduate. 76% of students improve their attendance problem. And then 97% of high school students stay in school if you're aided by communities in schools. So if you don't have a community in schools, please say about getting one. And if you meet any of these nice people here today, please thank them for what they're doing to make Georgia students have a better life. If all the people with communities in schools are sent up, we would like to recognize you. Thank you. Thank you. Thank you. Thank you, Mr. Speaker. Thank you, community in schools. We appreciate great work you're doing for Georgia's represented Sebaugh is recognized for a morning order. Thank you, Mr. Speaker. Point of privilege. I knew my high school armament was going to be in the room, but I did not know my elementary school. Hickory Hill Dragon was going to be in the room. So thank you, Mr. Speaker, for surprisingly with that. You're welcome. Colleagues, I rise today to recognize the 2022 Georgia High School Association, 7A Boys and Girls Cross Country State Champions for Mary at a high school. These young men and women of my alma mater have carried on a tradition of excellence with equal emphasis on character and academics. The phenomenal performance of these two teams are a clear indication of the outstanding athletic ability, dedication, hard work, and unity of purpose of each of them. I want to congratulate Mary to School Superintendent Grant Rivera and head coach Jack Coleman, who are with us today. Also, coaches Rihanna Reed, Yolanda Payton, Jonathan Gamble, and a coach that coached my kids in middle school, Dave Rathings graph is with us today. My friends, there are more than 530 high school students in the state of Georgia. A small percentage of whom can proclaim the title of high school state champion. These champions are with us today in the back and if you will please stand and Colleagues, please give them a warm welcome to the state capital. Thank you, Mr. Speaker, I yield oil. They're my alma mater too. Go Blue Devils. It's a good day. Thank you all for being here and congratulations. We now recognize Chairman Charlatte Cooper, Representative Owl, and Dr. Newton. Chairman Newton, for our morning order. Thank you, Mr. Speaker. I'm glad to be with my colleagues here, two physicians that are serving in the house. I'm glad to be on be a team member as a nurse with an advanced degree. And it's our pleasure to welcome the doctors from across our state. This is Doctors Day at the Capitol and they are from all over North, South, East and West where they serve the people of Georgia and trying to do the best they can for our patients. Most of the time you don't see doctors. They're because they are dedicated to patient care and in their offices and in their hospitals across our state. And this is the one day that they join us. And so I hope you'll stand and give them a round of applause and they even know they're not a lot of them here. They're out in the hall. They can hear it. Yay! That's all I have to say. That's all I have to say. Okay. I know that doctor. It's a good one. Mr. Speaker, if I might. Yes, ma'am. That doctor does a lot for our Okie for nookie swamp. He's on the board. And that's an alligator representative. See ball? Not a dragon. Yeah. So dance an alligator. Chair, recognize representative Hilton for a morning order. Thank you, Mr. Speaker. We rise to recognize a group that's joined us today. The Conservative Policy Leadership Institute. CPLI is a training initiative designed to position Georgia to lead the nation. And governance based on conservative principles and values founded by alumni from the Coverdale Leadership Institute. CPLI recruits public policy oriented individuals who have demonstrated leadership experience and desire to advance solutions grounded in conservative thought. Not sure they made it into the gallery, but want to recognize CPLI this morning. Thank you. Thank you, Representative. Chair now, recognize representative Frazier. Representative Williams. Representative Higley. And Chairman Parish. For a very special morning order. Thank you very much. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you, Mr. Speaker. Thank you. This is the day that the Lord has made. Let us rejoice and be glad in it. This is Cicclcell Day at the state capital. to have our sickle cell warriors, especially your legislative warriors that are standing here today that support you, but we have our families, our caregivers, our advocates, stakeholders, our doctors who take care of our sickle cell constituents, and I would just like to welcome you to Sickle Cell Day at the Capitol. With us today in the gallery, we have our executive director for the Sickle Cell Foundation of Georgia, Ms. Tabitha McGee, and we also have our Sickle Cell Champion, Master Lawrence Source, and his mother, Ms. Greta Source, Lawrence is 16 years old, lives in Gwinnett County, is an honor student at Grayson High School in his junior year. He represents the Sickle Cell Foundation across the state of Georgia, and he events sponsored by the Sickle Cell Foundation. So, they are here today in room 216, from 11 to 130. I would appreciate if you all would just go by. You have constituents here that have came across this state to be here today to show you their appreciation for us always supporting them, and they are strive to live a more comfortable life. Thank you for being here, Sickle Cell Warriors. This is your day. Thank you, Mr. Speaker. Thank you, Representative, and welcome Sickle Cell Warriors. Chair now recognizes Representative Jasmine Clark and Representative Hutchinson for a morning order. Thank you, Mr. Speaker. Good morning, colleagues. Please join in welcoming the Georgia School Counselor's Association this morning, who are joining us in the gallery in the halls of the Capitol as we celebrate National School Counselors Week. The Georgia School Counselors Association supports school counselors in Georgia as they promote student success through improving student academic, career, and social emotional development. Our counselors are here today, including President Laura Ross, whom I've also had the privilege of inviting to speak in the well as well. Would you please stand if you all are here. I don't know if they made it into the gallery. Oh, yes, great. They're here. Welcome to our school counselors from all across the state of Georgia. Thank you, Mr. Speaker. Thank you, Representative. Great to have you, Counselors. Y'all do great work. Thank you. Representative Martinez is recognized for a morning order. Thank you so much, Speaker. Colleagues, today is Library Day. Library Day in Georgia. It's a great day. I want to recognize Mr. Speaker a couple of dignitaries that are here. Julie Walker, the State Library, Stacey Brown, Chair of Georgia Council of Public Library, State Libraries, and Vice Chancellor to Libraries and Archives. General Mullis, Library Director for Marches of Glenn and Georgia, 2023, Library of the Year, also Loganville City Council, Brandywent Field, and Board Member, School Board Member Lisa Luttrell. I'm going to read a real quick resolution because I believe that libraries are here. It's a very recognized February, February 8, 2023, Public Library Day at the State Capitol, and for other purposes, where I asked, there's 410 public libraries that serve every county in the state of Georgia, whereas there were more than 13.7 million person visits and more than 23 million online visits in 2022, whereas there's 30 million books, media, materials, checked out from public libraries every year, whereas there's 1.1 million children attending, reading times in public libraries, whereas there's Georgia Public Library's partner, where Zuant Lanna Fox Theatre Institute, the Georgia Commission of the Holocaust, the Atlanta Hox, Georgia State Parks, Michael C. Colum Museum, and the Center of Puppetry, whereas by early literacy initiatives, encourages children to read 1,000 books before kindergarten, as had had tremendous success, and participation throughout all of Georgia, and further encourages family to engage with children's early learning. Now, therefore, be told to verify that the House representatives, that the members of this body, recognize today, February 8, 2023, as Public Library Day. Do not forget, we got outside between Mitchell Street, between the Capitol and Coverdale, we got the varsity truck from 11.45 to 12.45. Mr. Speaker, I'll hear you well. Representative Martinez, you know what that red light means? It means go, right? Thank you, libraries, that's a lot of books, that's a lot of books. Thank you for what y'all do for our young people and all the citizens of Georgia, and thank you for being here today. Representative Townsend is recognized for a morning order. Thank you, Mr. Speaker, and thank you, Representative Martinez for the shout out to the Georgia Library Association. This is a special recognition for the marshes of the Glen libraries. Please stand up. I want to congratulate the headperson, Jerry Mullis, also Anna Trap, Denise Rokowicz, and Ben Bryson. These guys are the All-Star team from Brunswick, Georgia, for being the Library of the Year. 2002 to the Library of the Year. Let's give them a round of applause. These guys are above and beyond with the children's programs, early literacy, and also they actually work on workforce development too. It's important everybody in the state and these guys are trend centers in the state. Again, marshes of Glen, thank you for what you do and Jerry and your team. Thank you. Mr. Speaker, you're well. Thank you, sir. Chairman Carpenter. Yes, sir. I'll make a quick. You got it, sir. Come on. You recognize for a morning order, Chairman Casey Carpenter. Well, it's a big day in economic development in the state of Georgia. I'm here to announce the opening of the Athena Studios down in Athens, Georgia. $60 million investment on 45 acres down in Athens. To me, the biggest part of this film industry is watching it grow outside of the metro area. And this project here will be something I hope that echoes across the state, that there is opportunity for all areas of Georgia and film. And the really unique piece in this studio is also how it involves the actual University of Georgia from a workforce development and standpoint. It's really going to be a great project and I know the legislators from the area are super excited to see it underway. 350,000 square foot of investment from Georgians into film. Thank you. I yield the well. Thank you, Mr. Chairman, for your leadership in that area. And thank you for demonstrating how to stay on time. Thank you so much. Chair Lynn Smith is recognized for morning order. Thank you, Mr. Speaker. Good morning, colleagues. First of all, we have the youth leadership from Cowardy County, Newton and Leadership. And our delegation, if y'all will stand, I didn't know when I'd get my time up here, but Mandisha, it's come forward. But please stand and let us recognize you over there. Thank you, colleagues. I'm looking at the light. I also have and speak on behalf of our delegation for all our four teachers who are here today. So they're out in the hallway trying to get in, believe it or not. So let's recognize them for a random applause. And then personally and finally, please look in your trash cans. Pull this folder out. Open it up and get your free park pass for all of Georgia's parks. They're near you. You're going to love them. And they're there for you and your constituents. Thank you. Best parks in the whole United States of America. No doubt. Thank you, Chair Lady. Now let's see. We have whip, perchette, German sands, Corbett, Meeks and Perkle for a morning order. Who's going to do the talking? You have one minute. Thank you, Mr. Speaker. Here to recognize today, Okifinoki, Reese, if you all will stand up in the balcony. We've got Dr. Greg Jacobs as the executive director. And these are all your superintendents from South Georgia, nine South Georgia counties. And we want to recognize the leadership you have and continue to help us with our one of our most precious assets. And that's our children. And all the hard work you did through COVID and the work that you continue to do. So we certainly appreciate you. I want to recognize each one of you. Thank you, Mr. Speaker. I yield the well. Thank you all for being with us today. We appreciate the work you do with our children. Thank you so much. Chairman Dickie, you recognize from morning order, sir. Thank you, Mr. Speaker. I want to recognize a group that many of you all saw this morning. Our Georgia Young Farmers Association. They're walking around here with their red coats. And many of you have young farmer chapters in your counties. And so today is a young farmer day commending the association recognized today is that day. It was founded in 1970 to serve as the primary adult education delivery system for young Georgia farmers. Today it stands as the nation's largest affiliate with over six with 61 chapters and 6,000 members. So they run the valuable service to the local communities, the classes field demonstrations, school tours, and many other educational activities. So we just like you for your hands-on work with our young people, with our young farmers throughout our state promoting agriculture and that workforce for our state and the importance of agriculture. So if you would, we've got some in the balcony. I think I'd love for them to stand up there. Our Young Farmers Association. Well, thank you. And I hope many of your members had their biscuits represented with them. They didn't have the belonging out there. They had their chicken. So, thank you all. Thank you, Mr. Chairman. Welcome, young farmers. Let's see every year. Chairman Chokus, more in order. Thank you, Mr. Speaker. Along that same line, I have members of the FFA, the Subtrakownee, FFA Advisory Group and Subtrakownee, Young Farmers, Phil Gentry, and Brett Morgan. Please stand up if you all are in the balcony. Also, from Marion County, the same organization, the FFA Advisor, and also Young Farmers, John Hagen. Where are you, John? You stand up. Robbie Zimmerman, and Amanda Macon. As well as the students that are future farmers. You all stand up so we can welcome you all. And on a second note, Mr. Speaker, the Marion County Middle School is having a fundraiser and gun raffle and they're $25 a ticket. And I've got them on my desk. So if anybody wants to buy a ticket, please come to my desk. Thank you very much, Mr. Speaker. Have a great day. Thank you, Mr. Chairman. Chair recognizes Chair Taylor, calling Taylor, Chair Corvitt, Chairman Whitbert-Chip. Thank you, Mr. Speaker. And Chairman Newton, excuse me. Thank you, everybody. This is a great day today. I didn't know we had so many people here today, but this is Okifanoki Swamp Day. And in our gallery, we have the Alligators in the House. Today, Georgia has been blessed with unrivaled beauty in the Okifanoki Swamp. It's the largest black water wetland in North America. And the Okifanoki is recognized as one of Georgia's seven natural wonders. And the natural area is something we should all be proud of. It's one of very few in the world. We have in the gallery Michael Luss, the Okifanoki National Wildlife Manager, Allie Ailer in the Alligator costume. Dr. Bishop, Dr. Michael Angelo, James. He's the mayor of Wakecross. It's very, very important. If you all want to meet with him, they're going to be in the mezzanine today. And this evening, they will be at the Georgia Terrace. Please welcome Okifanoki folks. Thank you. It's good to have all you swamp creatures. No doubt. Hope you have a good day. Thanks, Charlie. I appreciate it. Representative Scofield is recognized. She weighs. Thank you so much. I owe you one. Mr. Clerk, will you read the caption to a resolution, please? House resolution 115, Representative Jasper, the 11th Smith, the 139th Wilkerson, 38th Dickey, the 145th in Parsons, the 44th. A resolution, commending the University of Georgia 4-H program, and Ms. Avenja Gunjal, Mrs. Melanie Beersmith, and the 2022-2023 4-H leadership teams, and recognizing February 8th, the 23th, Ms. 4-H day at the State Capitol. Thank you, Mr. Clerk. Chair now recognizes Chairman Rick Jasper, who knows a little bit about 4-H. Chairman Jasper. Thank you, Speaker Burns, and Clerk for reading the resolution. Members, we're here today with a lot of other folks, but for me, it's recognized a great program in our State, the Georgia 4-H program. It's our youth development program, as part of the College of Agriculture and Environmental Science, the Cooperative Extension Service, Baltimore mouthful, but they bring young people like this lovely lady that you're going to hear from in just a moment. They work across the State and all 159 of our counties. People like myself and Chairman of the Rules Committee, Chairman Smith, and our Extension Agents, at work with these great young people. It's a very rewarding job for folks like me. I've got this tie back in the 80s from one of my volunteer leaders, and who is their backbone of this 4-H program. There's a lot of people in green. We've got a neat lunch today. You've got this thing. If the name isn't right, it's okay. They were putting them out. They didn't get it right. There's a luncheon at the depot that you're certainly welcome to find your 4-H and a great magazine that you'll see how the effectiveness they have across the State and all the different things they do. This past year, 150,000 young people were part of 4-H. I was going to recognize a couple of folks. Of course, they have Dean of the College of Agriculture and Environmental Science, Nick Plays right here. Laurie Perry Johnson, who is the over-the-corpitive Extension Service, but for me, I want to recognize the new 4-H lady. She's got a fancy title, but I call her the 4-H lady because that's going to be her job in her future. It's going to be the leader of 4-H and Meli Byersmith right there. We appreciate you, Meli. Well, we have as our guest, just bring a few words as the State President from Cobb County. Bindja, Gunjall, is going to take a moment to address us. Thank you, ma'am. Here we go. Speaker Burns, Majority Leader F Stratton, Minority Leader Beverly, Honorable Ladies and Gentlemen of the House, Guests, 4-Hers and Staff. Good morning. My name is Fenia Gunjall, and I'm an 11th grade student in the STEM Magnet Program at Cobb County in Wheeler High School, Georgia. I'm honored to serve as this year's State 4-H President and speak to you on behalf of over 152,000 4-Hers across Georgia. 4-H has been a driving force in helping me explore my passion for science since I gave my 5th grade presentation on wind power. Seven years later, I continue to learn more about STEM through Georgia 4-H. 4-H builds the next generation of leaders by engaging youth people with life-changing experiences in agriculture and STEM, healthy living and civic engagement. These opportunities are made possible by the dedication of volunteers, county agents, and other adult leaders that make Georgia 4-H the Youth Leadership Premier Program. On behalf of the University of Georgia College of Agricultural and Environmental Sciences and all 4-H members, I would like to express my sincere gratitude for your lasting support of a program that makes the best better for tomorrow. Thank you. You have a great program for developing our young people in the state. Should I repeat what you said, Chairman Gunther? Chairman Gunther said, Rick, Chairman, Jasper's ties are older than the Speaker, older than the President. So there's something to that, I'm sure. Thank you, Chairman Smith, as well, Richard Smith for your years of service and leadership in the 4-H program. Thank you, sir. Mr. Clerk, we have another resolution. It was brought to us by a representative, Houston Gaines. Mr. Clerk, will you read the caption to the resolution? House resolution 108 by Representative Gaines, 120th Burns, 159th Jones, 47th Hitchens, 160th FERS, Collins, 71st, and others. A resolution, recognizing February 8, 2023 is Law Enforcement Appreciation Day at the Capitol and commending Law Enforcement Officers in Georgia.\n\nThank you, Mr. Clerk. Members of the House, I can have your attention, please. Another important resolution. We're going to recognize first Chairman Bill Hitchens to speak to the resolution, and then represent Houston Gaines to speak to the resolution. Chairman Hitchens. Thank you very much, Mr. Speaker. As everybody in sitting in this room probably knows, today is law enforcement day at the State Capitol. I was surprised when I came in this morning. There are probably two or three hundred law enforcement officers outside on the second floor that we're meeting. And I just wanted to say, sometimes they go under appreciated, but they protect us 24 hours a day, seven days a week, 365 days a year. They protect you, they protect your family, they protect your business, and they protect those interests that want to come to our country, to our state to provide for economic development. And I just, as I said previously, they're often under representative. I spent 43 years in law enforcement, and many of you know that I was a state trooper during that time. We lost 15 who were killed in action, two when I was the commissioner. And I just, you never have experienced anything when you stand up at a funeral and look at the widow and the children trying to explain what happened to them. And the fact that they were working to protect you. So I think Houston, Chairman Gaines here has got a resolution that he wants to speak to, but I appreciate you. And I just want to say that I know the majority of the people in here appreciate you as well. So many of you aren't here. I think some of them are still over to send it. And if you're in the gallery, please stand up. If you're standing in the back, raise your hand. Thank you, Chairman Hitchens. And thank you, Mr. Speaker. We are honored to have so many members, our law enforcement agencies, across the state here today, for law enforcement appreciation day. The speaker, Chairman Hitchens, and many members up here signed a resolution honoring you for the work that you do every single day, putting your lives at risk. Several members, myself included, had the opportunity this past weekend to do a ride along with the crime suppression unit with the state patrol Saturday night in Atlanta. And so first hand, the work that you do putting your lives on the line. I want to thank Lieutenant Charles Shapoe, who took me around Saturday. And I kept me alive. Thank you, Lieutenant. And the great work that you do also want to recognize my share of Janice Mangum. And we have representatives from the GBI, DNR, and state patrol along with Sheriff Mangum here up front. But thank you all so much for the work that you do. We appreciate you so much. Thank you, Mr. Speaker. We appreciate you all's service, those of you in the balcony, those outside and all of our public safety folks around the state. Thank you for being here. Thank you to you too for bringing this resolution. We appreciate it. Mr. Clerk, will you ring the bell? Let everyone know that we're getting ready to move on to the rules calendar. Thank you for your patience and your attention this morning members. Some important opportunities to honor Georgians this morning. Mr. Clerk, will you ring the bell? Your caption to HB 35. House Bill 35, I'm resident of Hitchens, 161 Stevens, 164th, and others. To be titled an act to amend chapter 2 and title 52 of the physical to Georgia and today we're laying in Georgia Port's authority. So it's required for powers of the authority to expand the arrest authority of officers that Georgia Port's authority in certain circumstances and to provide for additional powers and duties of such officers. This bill I'm referring to the Committee on Public Safety and Homeland Security. That committee recommends that this bill do pass. Chair recognizes gentleman from the 161st House District, Chairman Bill Hitchens to present the bill. Thank you very much, Mr. Speaker. I, uh, health bill 35 is a retreat from last year. I actually carried the bill. It went through the house pretty much unobstructed, went through the Senate. And I had a little bit of difficulty over in the rules and that I had another meeting I had to attend to and the rules, Chairman, wrote my bill down on a three by five card and promised he would carry it since it's a department bill. And he forgot. So here we are again. What the bill does is it gives the Georgia Port Authority police jurisdiction for one mile from the boundaries of the Georgia Port Authority. And the reason for this is we all know it's the number one economic indicator in our state. And it affects jobs in every county in our state according to University of Georgia Research Study. But the reason for this is they've had to buy property off site. So what they want to do is to be able to protect that property. Uh, the number one problem I think at the port is, is theft. And certainly if they have their commodities off site, they want to be able to protect them. But it gives them full jurisdiction when they leave to where they get to their property. And they can make traffic stops. They can deal with criminal activities. And, you know, it's in my district and I know full well in two of the areas, Port Wendworth and Garden City with overwhelming majority of the activity occurs in the, uh, Coutator Port. Uh, the traffic volume is so heavy. If you drive up and down I-16, you see all the trucks. Most of those trucks are headed to the Georgia Port. Uh, 15,000 of them transit that port every day. Garden City and Port Wendworth are two small municipalities right outside the port. They have small police departments. They have three, four, five people working at a time. The Georgia Port Authority has 190 police officers. Most of whom at some time in their career have been local law enforcement officers and have progressed up because it's a, it's a relatively good paying job. They have great benefits and retirement. So what this does is just allow them for the jurisdiction there and, uh, to, uh, and, and I guess what, uh, I have a letter from every police agency and, and both sheriffs and Brunswick and Savannah that advocate for this because some of them don't have the ability to react to everything. So traffic backs up at the port. Sometimes it backs up two or three miles. They have accidents out there and this will enable the 190 police officers at port to come out and handle those things and get traffic going again when they don't have sufficient personnel in the, uh, in the local agencies to handle it. And, uh, that's, uh, that's the bill if, uh, you know, I asked for your favorite situation and I'll stand for questions. Gentlemen, you here for a question? I am. You do an outstanding job. I don't know about that. You don't have any questions, Mr. Chairman? Well, how you deal the well? We have a couple of members who would like to speak to the bill. Representative Rees. Representative Rees, come on down and you've been speaking to the bill. Representative Rees has recognized to speak to H. Pete 35. Thank you, Mr. Speaker. House colleagues, this bill will provide additional security at a point of critical infrastructure in Georgia, our Georgia port. There are a lot of valuable assets there and this bill will help it from ever becoming a soft target that's attractive to people who want to do harm to our critical infrastructure. There are analogies across the state of police and public entities or nonprofits such as campus police to some extent railroads and, of course, public universities having police present. So, this bill is present under Georgia law. Just last year there was an effort that Representative Maynard led to have historically black colleges and universities have additional campus security and that bill passed here, 50 to 8. So, I applaud Chairman Hitchens and others who have worked on this bill to make our critical infrastructure safer at the port of Savannah, which is something that sets Georgia apart from most states and we need to keep it safe. Thank you, Mr. Speaker. Thank you, Representative. We have a couple of questions. I think this next speaker could probably answer anything that you have a question about. Chair now recognizes Representative Al Williams to speak to the bill. Thank you, Mr. Speaker and I know you know of what you speak. I got up a little early because I was prepared for a 20-minute presentation from Chairman Hitchens and he finished much quicker so I was not quite prepared to come up. But let me say this. There is nothing the farthest in this bill. The communities that surround the portion of the port that is in are primarily African-American communities and far too often something comes up that hurts those communities. This is not the case. This bill has been well-vetted 159-1 last year and the entire Savannah delegation is for it, of which I'm an ex officio remember. I have a lot of constituents that work at the port. It is so very important. What the chairman said is it. You have a drive in that area. It can be a nightmare. The least departments that surround it just don't have the resources. They need the help. And don't worry about the part, about discretion to arrest. Tell you something about arrest. I grew up in the military post at Fort Stewart. If you walk around one of those tanks and look at it and you are going to have a pass to be on there, you flat going to jail. You will not stop it all most. You are going to jail. And out there the port where all of this valuable stuff is if you go out there and you have no reason to be out there, you most likely should go to jail. We have lines of truck drivers who have to pass security checks to come on. So why should you not be subject to having a reason to be on the port? And all we ask is this. A lot of years in Georgia that knows in the Savannah delegation we don't know a lot about. But we know a lot about the port. And it's huge economic impact. We know that. Help us this time. And when you tell us something about something you have in your area that we know nothing about, we'll help you that time. It's a quid pro quo. Any questions now? Mr. Speaker. Gentlemen, you yield. I'll yield. Now, this question comes from the Rayburns gap to Tobi Lights. So let's see. We're going to recognize a gentleman from the sixth House District Representative Jason Ridley for a question. Thank you, Mr. Speaker. You're right. Mr. Gentlemen, you yield. How you? Having an inland port in Murray County, I got a question on this bill. Does that mean that the port in my county will also be able to enforce laws within a mile of that port since its own by the port authority? That's a very good question, Mr. Ridley. And because I'm an expert on ports, I don't know the answer. But I can promise you this. It does affect Brunswick and Savannah's ports. And I am certain that whatever is needed to secure what's going on at your inland port, it's certainly going to be done. But I can't honestly tell you that. And follow up if you don't care one more question. The line 91 it talks about that they have, basically they have jurisdiction on public and private property within a mile, which in Savannah I understand because you've got a road about a mile out. But if they do have authority in like my county within a mile, there's homes all around us. We don't have the traffic backed up. So that kind of worries me a little bit. And I guess I should have asked, but I'm sorry, I didn't, but I just need a little bit more clarification on what they would be able to do and what they wouldn't be able to do. Well, you're right on one point now straight in the other. The first yes, you should have asked. And the second issue is I can't see a problem around your port as many guns as Ridley owns. That's true. That's true. Thanks so much. Gentlemen, you have another question. One more, Mr. Speaker. One more. Let's have two more if you don't mind. You just meet me. One on from your. One from a friend who knows a little bit about the ports, Representative Gilear, who knows a lot about the ports. Of course, I will, my friend. Isn't this an excellent bill that will continue to move the economic development forward for all Georgians because these officers would be protecting the goods of all of Georgia port, therefore protecting goods for all citizens of Georgia? You're certainly speaking truthfully. And isn't it also the gentleman further you? It is also true that you told the truth about the security of Garden City Police Department being one of the best security forces in the state, therefore making this a continuous great bill that these officers would only be protecting the assets of Georgia port. And then in Garden City would still have their jurisdiction to protect the citizens of Garden City. You're right again and you're on a roll so don't stop. I thank you. Thank you. One more question, nothing we make clear out some of this. Chair recognizes with Barchett. Thank you, Mr. Bickard, is the gentleman Gile? Hi, you. Isn't it true that the bill applies to all port authority property and that most all port authority property already has a security force in place and this would extend one mile outside of that every piece of property owned by the authority? Isn't that true, Mr. Bickard? Sir, you said exactly what I said. That's all. Thank you, Mr. Bickard. I think that's all the question. Thank you. Representative Williams, this is an important question. I'm sure. And I won't pose it but I know that the former mayor, Representative Jacks, from Savannah has a question, will clarify anything that may be in question here. Representative, recognize. Thank you, Mr. Chairman. I yield. You yield, OK. Isn't it true that the ports sit in my district? It is certainly true, Madam. We are representative. One other statement, and I do a whole, Mr. I have to call him, Al. That we're asking that people please support us in the endeavour. Thank you, Madam. You are as eloquent as ever and you can still call me out. If there are no other questions, Mr. Speaker, you'll well. Thank you for your work on that there. I think on the bill, I think you may have gotten it over the top for Chairman Hitchens. Thank you so much. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to passage of the bill? The Chair, here's none. The report of the committee has agreed to. Shall this bill now pass, all in favor of the passage of the bill, will vote yes. All those opposed will vote no and the clerk will unlock the machine. On the passage of the bill, the yeas were 164, the nays too. The bill, having received a requisite constitutional majority, is therefore passed. The clerk will read the caption to HB 52. House Bill 52, by groups of time, it was the 21st and others to be entitled to amend Title 32 of the Fisher Code of Georgia and it's ended relating to highways, bridges and ferries. Stowe's amendment, notice provisions, relevant to meetings for the election of board members and to provide for negotiations and request for proposals relative to public and private partnerships. This bill will then refer to the committee on transportation. That committee recommends this bill do pass. Thank you, Mr. Clerk. Chair recognizes Representative Thomas to present the bill. Thank you, Mr. Speaker. HB 52 is a retread of a bill of two bills that happened last year. I think quite a cross-finished line they ping ponged around and we never did get a chance to get to an agree. It's made six sections. Section one makes email. Instead of physical mail, the required notification method for legislative council. It's a legislator's for a call to the board election for the state transportation board. Section two replaces the term request for proposals with requests for proposal revisions as one of the authorized negotiation activities for the Georgia Department of Transportation. Section three provides clarifying language on alternative contracting methods. Specifically clarifies the statute's original intent to apply the restrictions on contract value and frequency to the CMGC, which construction manager, general contractor method. And four changes in modular sectional housing units to be transported. It ups the length from 80 feet to 84 feet. Section five grants further ability of an appropriate county medical examiner to delegate their authority to qualified medical personnel in the field at the side of an accident. And section six codifies that no one can abuse the Open Records Act to get personal information about a driver's location, travel history throughout the state, either directly or indirectly through any data by vendor. And that's in my presentation. I'd be happy to yield for questions, Mr. Speaker. General, will you yield for a question? Yes, Mr. Speaker, I will. Well, he waived. So we don't have any questions in the next little job. Thank you, Mr. Speaker. If that's case, then I will yield the will. Is there any objection to the previous question being ordered? Where here's none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. Report of the committee is agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yeas were 167, the nay zero. The bill having received a requisite constitutional majority is therefore passed. Mr. Clerk, if you'll read the caption to HB55. Mr. Clerk, if you'll read the caption to HB55, I represent a Williamson of the 112th and others to be entitled to amend Title VII. The official go to Georgia, annotated, relating to banking and finance. Those to provide for definitions, to provide for dates, and to repeal laws relating to international banking corporations and bank agencies. This bill will have referred to the committee on banks and banking. That committee recommends that this bill do pass. Representative Williamson. Chairman Williamson is recognized to present the bill. Mr. Stone, thank you, Mr. Speaker. Colleagues, I bring before you today, House Bill 55, which is the annual Department of Banking and Finance Housekeeping Bill. This 110-page bill seeks to continue to regulate our bank's credit unions, money transmitters, mortgage service businesses, as well as credit unions and check casters. It continues to modernize the streamline our banking code by harmonizing terminology and definitions between the states. It addresses efficiency issues facing these regulated businesses while ensuring strong consumer protections. It is supported by the Community Bacres Association, the Georgia Bacres Association, the League of South Eastern Credit Unions, mortgage bankers, the Georgia Financial Services Association, and the Georgia and the Stomach Lenders Association. Mr. Speaker, it's a lengthy bill, but it's just a clean up bill. I'll be happy to take any questions this time. Here none, I'll be happy to yield the bill. I'll see no questions, Mr. Chairman, just to comment. I was on page two when I fell asleep last night, so thank you very much. Thank you very much. It's great to be here. Thank you for bringing the bill. You have no questions. Thank you, Mr. Speaker, I yield the bill. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to agreeing to the report of the Committee, which was favorable to the passage of the bill? Chair, here's none. Report of the Committee has agreed to. Shall this bill now pass all in favor of the passage of the bill? We'll vote yes. All those opposed will vote no, and the clerk will unlock the machine. Have all members voted? Have all members voted? So the clerk will lock the machine. On the passage of the bill, the yeas were 164, the nay zero. The bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to HB77. Hospital 77, my represent of green, and the 1504th, and others to be entitled to amend Code Section 1562, the official code of Georgia annotated, relating the number of judges. The Spirit Course, those who provide a fourth judge, and the Spirit Course of the Dirty Judicial Circuit. This bill I refer to the Committee on Judiciary, that committee recommends that this bill do pass by Committee substitute. Chair recognizes the Dean of this House, Chairman Green, to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring for your consideration House Bill 77, my Committee substitute. Some time ago, working with the Judicial Council, it was determined that the Dirty Circuit needed a fourth judge ship. The Council listed the need as the number one priority for the judgeships in the state. The Albany Dirty delegation made up of Representative David Samson, Chairman Bill Yearder, Chairman Mike Chokas, I must say, unanimously support this legislation to create a new judge ship for the circuit. Also the county commissioners endorsed this decision and will meet the obligation for its creation. Why do we need this judgeship? Our senior judge just really liked it, testified to the House Judiciary Committee with some very startling facts. The circuit has 10,000 plus pending felony cases. Over 2,500 of those pending felonies involved serious violent felony offenses. There are 50 pending murder cases. Many of these are gang related. And we have over 600 in our local jail with 200 superior court pretrial detainees that have been in jail for over two years. The cost to the Dirty County is around 3,650,000 to have these 200 inmates for one year. The amendment to the House Bill 77 moves the starting date to July 1, 2023. And I want to thank Chairman Gunter and the Judiciary Committee for seeing the need for this particular legislation and passing it out unanimously. There is also in the 24 budget the money for another judge ship. And I am asking the members of this House to vote yes for this House Bill 77 by committee substitute. Thank you miss speaking into this. No questions are yield the well. There are no questions the gentleman yields the well. We do have a comment. Thank you for being very thorough. I am seeing grain from all the issues that surround the creation.\n\nof this judge yet. Chair recognizes Representative Reeves to speak to the bill. Thank you, Mr. Speaker, to follow up on Dean Green's comments. As a member of the Judiciary Committee to pass on the Dirty County Judicial Circuit is relatively small. It's a one-county circuit, but all many is a regional town, so it bears more than it's share of criminal cases as well as civil cases. And the Judicial Council looks at statistics. They also interview the locals. And on the three judge ships, which will hear this year, they have made sure that the locals have committed financially for office space, for local supplements. We had four house members who were at the committee and supported this bill. We also had a Court of Appeals judge Ken Hodges, who's a former DA, made comments to Chairman Gunter and supported the bill. So it's been thoroughly examined and would ask for your support for this bill, and I yield the well. Thank you for your insight, Representative. Is there any objection to the previous question being ordered? Chair, here's none. The previous question is ordered. Is there any objection to adopting the committee's substitute? Chair, here's none. The committee's substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? Chair, here's none. The report of the committee has agreed to. Shall this bill now pass? All in favor of the passage of the bill will vote yes. All those opposed will vote no, and the clerk will unlock the machine. All members voted. All members voted. If so, the clerk will lock the machine on the passage of the bill. So the yeas were 168, the nays 0. The bill having received the requisite constitutional majority is there for past congratulations, Chairman Green. That completes our rules calendar. We'll now move on to afternoon orders. Orders that Chair recognizes representative Kendrick for an afternoon order. Thank you, Mr. Speaker. Good morning, colleagues. This is your 10 millionth reminder that next week is my tick for all policy conference. You should have all received something in your office. So on February the 15th, we'll have a VIP event at ATDC. We'll talk to technology community stakeholders as well as here from our new technology chairman. So please come out to that from 4 to 6. And then on February the 16th at 8 o'clock at room 307, we will have a group and I ask that you stop by and say hello to them as well. So if you need a calendar invite, you can grab me on the floor and I will send you a personal invitation to the tick for all policy conference. And if you sign up, you will be included in my wheel. Thank you so much. I appreciate it. Can't beat that. Chair recognizes representative Hutchinson for an evening order afternoon order. I'm sorry. Thank you, Mr. Speaker. Good morning, afternoon, colleagues. I am going to introduce to you today Bryce Barthelene. Bryce is my cousin. And Bryce over the holidays was diagnosed with renal medallary carcinoma, which is an aggressive kidney cancer, primarily found in adolescent black boys and is linked to the sickle cell trait. I didn't know that there was a cancer that was linked to the sickle cell trait, much less one that primarily attacks adolescent boys. A lot of people in this room were praying for my cousin still are. And I just want to let you know that he had a pet scan last week. And there's no visible signs of cancer. So thank you, prayer warriors. I'm my family. Thank you, and Bryce. Thank you. Thank you, Mr. Speaker. I yield the well. Great news. Prayers are answered. Representative Glaze is recognized for an afternoon order. You're getting better all the time. I can tell. Thank you, Mr. Speaker. I stand before you colleagues today to share a little bit of black history of Georgia. I want to bring to your attention an unknown woman who did great work in this state. Carrie Steele Logan founded the Carrie Steele Orphanage in Atlanta. It is the oldest and of predominantly black orphanages not only in Georgia, but in these United States. She was born enslaved in Georgia in 1892. According to what records we could find, she had no birth certificate and there's no information about her parents, but she was an orphan. And after the emancipation, she moved to making, started to work at the train depot, and then moved to Atlanta, and started working for the central Georgia railway. At Atlanta's Union Station, she began to be concerned because there were children being dropped off in bathrooms and near her area where she worked. Because she had a compassion like John 1513, greater love than no man, than he would lay his life down for his fellow brethren. She began to do that. She went to her employer and asked for a box card to place the children who had been abandoned in that box card during the day so that she could care for them. And at night, she began to take them home and to care for them. She began to outgrow where she lived. And guys, one fact, she was a black woman in the 1800s and began to own land. So the land in the home, she took them to, she owned. Later on, she had become what we know are known as the Carrey Pits Orphanage. She married and later got a public private partnership with this county of Fulton for 10 acres to serve those African-American children who needed a place to live. During that time, she began to ensure that they were school number one, that they had religion number two. She shared her faith with those young people. Number three, she got them ready for the marketplace. Sounds like work we do today. She began to place them in spaces and places with skill sets that were needed in the Atlanta area. Guys, what I really want to say is that property and that work still exists today. It is one of the most pressing and private orphanages in Atlanta still serving African-American children. The only thing I stand today to rise in honor of Carrey Pits is that her granddaughter is now running the orphanage. It is great work. It has served over 25,000 children. And to that, we say thank you. Mr. Speaker, I yield the well. Thank you, Representative Place. Representative Moore. It is great to see you, Representative Angela Moore. You recognize for an afternoon order. Good afternoon, everyone, or still morning. So, we could go today. I was hooked to every machine that Emory University's main campus hospital had, including the tube up my nose and down the throat. And I was at the mercy of every nurse there. I wasn't even sure I was going to make it back here. And it's the grace of God that I did. And I tried to stay safe throughout the holiday season. I did what Beyonce would do. I went to the basement. I baptized in the water. I plugged my sores with the pages of the Bible. And still, I got sick on day one when I walked through the door. I came up here first of all to say thank you all for the ones that came there. I really didn't need to see you all. I didn't want you all to see me looking like that. But thank you all for the calls and the texts. I really had no time to read them because every doctor at the university was in my room at every hour of the day. I received excellent, excellent care. And I had more doctors because we have a severe nurse shortage. And we didn't have nurses that could come in. 99% of the nurses at Emory University, which is vastly the largest hospital system that we have here in Georgia. A private has visited nurses. And there's not enough nurses to tend to us. So the doctors that they are having to really do an extra job. I just wanted to first say thank you all. My journey is not over. I'm back at the hospital the day after this thing is over here to take care of my health. But I want us to look at our visiting nurses. Please talk to your children, your grandchildren, your great-grandchildren. Encourage them to become the second most productive commodity that the world has. And that's to go into nursing. We'll have a lot of doctors. They will come. And doctor's life expectancy is used to be at 55. Now they're at 95. But we really need people to pull up the rear. We need Georgia nurses. We need them trained. We have universities all over the state that can bring in these nurses when we are looking at budgets. And we are allocating money. Let's look at our nurses. Because sooner or later these other nurses that are traveling are going to go home. The ones we have here are still going to have a mortgage to pay. So let's look at our nurses because they could not do the job that the doctors were doing. The doctors were really catching health trying to keep up with the nurses. And so thank you all for taking good care of me and thinking about me while I was under the weather. I'm pulling up. I yielded well. Thank you. Thank you Representative. We're glad you were recovering. Cheerly, darling Taylor recognized for an afternoon order. It's almost afternoon. Thank you Mr. Speaker. Today I want to in honor of Black History Month bring you the story of a very remarkable African American woman. Her name is Edna K Williams. She was born in 1896 in Philadelphia. She was the daughter of a laborer and grew up in South Philly in an immigrant in the African American neighborhood. She would face many obstacles in her life but she never let them get her down. She attended high school and went on to become a stenographer, a reasonable expectation for a woman at that time. Between 1918 and 1920 she married. She had a child and got divorced. She even got remarried. In 1922 she decided to go to medical school and despite the odds at the age of 30 Dr. Edna K Williams graduated from the Philadelphia College of osteopathic medicine. She was the second African American woman to graduate from PCOM and by the way, PCOM is our largest second largest medical school in the state between their two campuses in Swanee and in South Georgia. She practiced in the urban areas the Philadelphia, New Jersey, Washington DC. She practiced for over 60 years. She tried to retire at the age of 90 and she just couldn't do it. She loved her patients too much. She continued to work until she was 92 years old. She was quiet and soft-spoken but firm and warm and a kind-hearted spirit. She was willing to share her knowledge and her perseverance, going through medical school, how hard it was as a woman as a mother and a woman of color. She was very much a role model encouraging others to keep striving and to persevere. In this day, we are in such a need of physicians and nurses and all of our medical care is in hurting condition. Her story can give us hope for those who want but sometimes feel and lose sight of the end. Remember Miss Edna, perseverance, determination and tenacity and you can get there. Thank you, Mr. Speaker. I yield the well. Thank you for that information. That's exceptional. That completes, yes it does. It does complete our afternoon orders in the morning. Mr. Clerk, will you read the caption to a group of privileged resolutions? Honoring the life and memory of James R. Jim Dellinger, honoring the life and memories of Al and Millie Polone, honoring the life and memory of Susan Sprattly Stevens. Recognizing February 8, 2023 is Okifinoki Swamp Day at the State Capitol, commending the Clayton County Government, the Clayton County Chamber of Commerce, and the Atlanta Airport Chamber of Commerce in recognizing February 9, 2023 is Clayton County Day at the State Capitol, organizing February 14, 2023 is New Americans Day at the State Capitol, commending Ludwig Luwazari, Miss Cobb County, 2023. Commending Charlie Key, Miss Cobb County's outstanding teen, 2023, recognizing and commending the efforts of unto the least of his ministry, Crossbeam Chapel Church, Hopeville United Methodist Church, and their young people in supporting the community in Ghana, Africa. Commending and congratulating Marsha, Marsha's of Glyn libraries. Recognizing commending the YMCA is a Georgia for the important work they do in communities across the state promoting a healthy spirit, recognizing February 16, 2023 is Alpha Phi Alpha Day at the State Capitol, recognizing commending Heinz Ward, recognizing commending Theresa and at Bryant at her outstanding public service, and recognizing and commending Lucius D'Souza Martins, and for other purposes I can please the reading of Privilege Resolutions. Is there any objection to adopting the privileged resolutions? Chair here's none and the resolutions are adopted. Now we're ready for announcements. Chairman Workiser is recognized for an announcement. Thank you, Mr. Bicker. The Interestrian Labor will meet today at 3 o'clock, CLOB 5 o'6. We'll be hearing from our newly minted Commissioner of Labor. Thank you. Chairman Darlene Taylor, recognize for an announcement. Thank you, Mr. Speaker. Today the Appropriations Healthcare Committee will meet at 1 o'clock in CLOB, I'm sorry, in the capital 341, that's Appropriations Healthcare, cap 341 at 1 o'clock. Chairman Rhodes, recognize for an announcement. Thank you, Mr. Speaker. Game Fish in Parks will meet 4 o'3 at 2 o'clock. Thank you. Representative Scott is recognized for an announcement. Thank you, Mr. Speaker. Today at 330 in room 514 we will have a public hearing house HB3 student living in Prophecy 8. Oh, thank you. Chairman Corbett is recognized for an announcement. Thank you, Mr. Speaker. The rule of caucus will be meeting upon a German at Ag Building. Georgia Forestry Commission is one of the sponsors today. So if you like clean air, clean water, soft toilet paper, needs you to be there. And we also have our very own Todd Jones to work with Georgia Tech. He will be finishing up the meeting. So great agenda today. So everybody try to be there. Thank you. I yield a well. That's a good announcement. Pretty good food too, Abed. Chairman Gilly already recognized for an announcement. Thank you, Mr. Speaker. All members of the Georgia Forestry Commission, Black Caucus. We have lunch, grab and go in CLAB 310 followed by a meeting via Zoom. We have a great guest today. USDA Executive Director Octa Trip at 1 o'clock. Thank you, Mr. Speaker. Thank you, sir. Chairman Williamson recognized for an announcement. Thank you, Mr. Speaker. The House Majority Caucus will have a lunch in the morning, noon in room 403. It went out on emails and had a problem with some spam filters. Just make sure the House Majority Caucus knows it will be lunch tomorrow at noon in room 403 in the capital. Thank you. Thank you, Mr. Speaker. Chairman Sains has recognized for an announcement. Thank you, Mr. Speaker. The Special Rules Committee will have an organizational meeting tomorrow at 9am in 406 CLAB. We understand there might be another rules committee meeting at that time, so we will be brief. Stand your ground, man. Representative Lumpston's recognized for an announcement. Thank you, Mr. Speaker. In the morning, 8am insurance committee, full committee need all of you present. 8am, we have some business to take care of. CLAB 406, thank you. In the morning, 8am, Chairman Tallah Paul Smith. There he is. Recognized for an announcement. Thank you, Mr. Speaker. This is a reminder that the Judiciary Non-Civil Full Committee will meet at 3.30 this afternoon, 3.30 this afternoon in room 132 of the Capitol. Thank you. Thank you, Mr. Speaker. Chairman Tarravan recognized for an announcement. Come on, man. Insurance committee, subcommittee on property and casualty will meet today at 2pm and CLAB 415. We have two bills. We need you to be there. 415 subcommittee on property and casualty insurance. All right, subcommittee members, you heard it. You need to be there. Representative Jasmine Clark recognized for an announcement. Thank you, Mr. Speaker. Members of GLBC, if you have not already reached out to me or my admin, Jennifer Clark, to RSVP for our retreat on Friday, please do so today. We have to have an accurate head count. Again, please RSVP by today. Thank you, Mr. Speaker. I hope we're out, y'all. Let him know you're coming. Chair, no Williams recognized for an announcement. Thank you, Mr. Speaker. Today at 1 o'clock and 5 o'clock, CLAB, banks and banking look forward to seeing you all at 5 o'clock, banks and banking. Thank you, Mr. Speaker. Chairman Collins recognized for an announcement. Thank you, Mr. Speaker. The House Public Safety and Homeland Security Committee will be meeting at 1 o'clock in 406 CLAB. If you make it, please do. We're not taking up any legislation, but we're going to hear from Mike Ares, the executive director of the Post Council about just what a good job we do in this state, policing the police, then also we're going to hear from some of the folks at the Georgia World Congress Center Authority about all the things that they do to keep us safe. So if you can be there, committee members, please come. 1 o'clock, 406 CLAB. Thank you. Thank you, sir. Chairman Monter has recognized for an announcement. Thank you, Mr. Speaker. Defensive Veteran Affairs Committee. Today at 5 o'clock, CLAB at 2 p.m. We'll be hearing from Commissioner Ross with the Department of Veteran Services. Thank you. Thank you. Chairman, Chair Lady Lynn Smith recognized for an announcement. Good afternoon. Tomorrow morning, 8 o'clock, CLAB, room 606, Natural Resource Environment, updates by Forestry Commission. Thank you. Thank you, Chair Lutti. We're representing Advanced Smith. Recognized for an announcement. Thank you, Mr. Speaker. A motor vehicle subcommittee on driver safety and services will be meeting in the morning at 9 o'clock in room 606 CLAB. We'll be taking up two bills. Thank you, Mr. Speaker. That completes our announcement. A lot of announcements about committees, time and place. You can go to the House website, under Schedule, and you can check those meetings if you're included or if you would like to attend. So you have that second look to make sure you are the right place at the right time. We do have pages today. Members, if you have a page, we invite the pages and the members to come down front and we'll take some photos in just a moment. Chair now recognizes the majority leader for a motion. Thank you, Mr. Speaker. I move that this House stand adjourned until 10 a.m. on Thursday, February 9, 2023. Members, thank you for your patience and your attention today. On the motion of the majority leader that this House stands adjourned until 10 a.m. Thursday, February 9, 2023. All those in favor will say, yeah, so need to vote. All those opposed will say no. It was close at time. Yes, and we are adjourned.",
  "updated_at": "2026-02-13T06:29:07.581623+00:00"
}