{
  "video_id": "eUGsq9DkTO4",
  "url": "https://www.youtube.com/watch?v=eUGsq9DkTO4",
  "title": "Georgia Lawmakers Debate Homebuyer Aid, Marijuana Reform, Disaster Relief and ICE Policies",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 0,
  "summary": "Here is a structured markdown summary of the key points from the Georgia legislature floor session transcript:\n\n# Overview\nThe session covered discussions on a Georgia homebuyer assistance program, proposals to decriminalize small amounts of marijuana, and efforts to improve disaster relief and 911 emergency systems in the state.\n\n# Key Actions\nNo specific bills were mentioned as being passed or referred.\n\n# Bills Introduced (First Reading)\nNo new bills were introduced.\n\n# Notable Moments\n- Representative Crowe discussed the Georgia Dream home loan program and how it helped a firefighter and teacher purchase a home when federal loan programs were disrupted.\n- Representative Jackson introduced a proposal to decriminalize possession of 2 ounces or less of marijuana, arguing it would reduce unnecessary arrests and free up law enforcement resources. Representative Crowe expressed some reservations about marijuana legalization and its potential public safety risks.\n- Representative Crowe provided an update on the disaster mitigation and resilience study committee's recommendations, including progress on Next Generation 911 system upgrades and timber tax credits.\n\n# Votes\nNo recorded votes were mentioned.\n\n# Attendance\nNo specific quorum details were provided.\n\n# Adjournment\nThe transcript does not mention when the session adjourned or the date of the next scheduled session.",
  "transcript": "We start this part of the show with\ninformation on a home loan program and\nget an update on disaster relief.\nJoining us is Republican Representative\nClint Crowe of Jackson. He chairs the\nHouse Public Safety and Homeland\nSecurity Committee. He's a former law\nenforcement officer and currently a\nsecond generation realtor. Also here is\nRepresentative Derek Jackson of Tyrone.\nAmong other things, he's a retired\nmilitary officer with the US Navy. His\ncommittees include defense and veterans\naffairs, budget and fiscal affairs\noversight. It's a long name, but welcome\nto the lawmakers.\n>> Thank you for having us.\n>> I appreciate that. We're going to start\nwith you and this ro this Georgia dream\npeach advantage loan program. It\nlaunched last July for home bon home\nbuyers. So tell us a little bit about\nwhat it's what it means and how people\ncan get involved. So, so Georgia Dream\nprogram we're talking about the um\nDCA, Department of Community Affairs,\nadministers this and there's a lot of\ndifferent programs to uh help provide\nloans, specifically loan programs for\nfirst responders, police, firefighters,\nEMS, um teachers, military veterans, um\nthey have some down payment assistance\nprograms, and you know, I've had some\nlegislation last year uh that increase\nthe cap. So the way they fund these is\nby selling mortgage revenue bonds. Um\nand it's actually authority an authority\nwith the state that's not backed by the\nfull faith and credit of the state.\nOkay?\n>> But the authority that is um set up\nthrough the uh that DCA manages and uh\nit's a fantastic program and they've\nreally and I'll tell you one quick\nstory. We had a uh young firefighter and\na school teacher trying to buy their\nfirst home this fall and they were\ngetting a a USDA loan from the\nDepartment of Agriculture. Right as they\nwent to submit their paperwork, the\nfederal government shut down.\n>> No.\n>> And they were in a real bind because the\nseller needed to move on. Uh and so we\nwere able to move them over to the\nGeorgia Dream program and they able to\nrush it and get them through and so they\nwere able to buy their home. U and\nthere's tons of stories like that that\nwe've seen. It's a real advantage. Where\ndo people go to get more information on\nit and to sign up?\n>> So, a lot of different lenders in the\nstate. You can talk to any mortgage\nbroker. Um, most of them can uh\nunderwrite these through the Department\nof Community Affairs. Uh, but you can\nalso go on the Department of Community\nAffairs website and check out the\nGeorgia Dream program and they can help\nyou uh find a lender that can walk you\nthrough the process.\n>> Okay. All right. Then, we'll I'm sure\nthere'll be people getting on the phone\nor going on their computer right now.\nRepresentative Jackson, we're gonna\ncompletely change directions here\nbecause you're here to talk about\nlegalizing cannabis, uh, recreational\ncannabis, right?\n>> Yeah.\n>> Tell us about it.\n>> So, uh, and I appreciate, uh, being on\nlawmakers and for my bill, it spells out\nthe difference between decriminalization\nand legalization. Okay.\n>> My bill is solely on decriminalization.\nsimply meaning that if you have 2 ounces\nor less of marijuana, you're not going\nto go to jail. Legalization is very\ndifferent. Legalization, much like\nalcohol, right? I mean, the federal I\nmean the state government will say,\n\"We'll tax it. You can buy it and sell\nit.\" My bill is not addressing\nlegalization. It's only talking about\ndecriminalization. So that way um\nthose who have a need for personal use\nless than 2 ounces they will be able to\nenjoy themselves\num smoking marijuana.\n>> How many states have something similar\nto that?\n>> There are 24 states and so Georgia needs\nto catch up, right? I mean, because when\nyou think about this, and I know my my\ndear friend on the other side, Alis was\nin law enforcement. Um, by\ndecriminalizing\nmarijuana now, we won't be tying up law\nenforcement three or four hours to fill\nout paperwork because somebody have an\nounce of of of marijuana. And that, you\nknow, in Georgia last year, 7,500\nGeorgians were arrested for having\nmarijuana for less than an ounce. with\nmy bill that goes away. It's simply like\ngetting a a a traffic ticket. You you\nget a traffic citation, you have to pay\nyour $100 and you're on your way and and\nthat's done.\n>> Okay. What do you think about it?\n>> Well, it's just hearing about it.\n>> Yeah, I just heard about it. That's a\nit's it's obviously something that um I\nI don't know that at first uh glance it\nwould be something I would I would\n>> uh be a big supporter of.\n>> Um I I do think that there is a\nconversation to be had around that. It\nis being used quite a bit, but there's\nalso been alternatives. Um even when I\nwas still policing, we had the option\nbecause it was misdemeanor possession.\nYou could always issue a citation for\nthat and not have to make them post a\nbond. So, you've always been able to\nissue a citation for that.\n>> Um, and there was a lot of officers that\nused their discretion as to whether or\nnot it warranted them needing to make an\narrest. So, um, I do think there are\nsome still some perils that can come\nfrom the the recreational use of\nmarijuana that can lead to other\nstronger drugs. So, um, you know, I I\ndon't know that I would be in favor of\nthat.\n>> Well, it sounds like it's worth the\nconversation. Well, absolutely because\nand I appreciate the the the the\ndiscretion piece because three to four\ntimes more often black men and women end\nup going to jail because of\nsubjectivity. My bill would take that\nsubjectivity out. And so we do not want\nour law enforcement profiling uh those\nwho actually need it. As a retired\nmilitary officer, some may need\nmarijuana because they're dealing with\nPTSD. they don't want uh something as\nharsh as opioids. And so there are a lot\nof good health benefits um from this\nparticular plant. And so by\ndecriminalizing, we would not only\nstandardize this across Georgia, all 536\ncities, all 159 counties, because you\nhave counties and cities right now that\nare decriminalizing this. This is a a\nbold step the state that could take and\nsay, \"We're gonna decriminalize this\nacross all of Georgia.\"\n>> Okay. Like I said, we'll continue the\nconversation. Uh, Chairman Crowe, you\nled the disaster mitigation and\nresilience study committee in 2024. So,\nbring us up to date on what's happening.\n>> Yeah, so several of the recommendations\nthat we had from the committee, um,\nwe've already seen uh the fruits of some\nof those. Uh, one of the recommendations\nwas to um move Georgia onto the next gen\nor next generation 911 system. We've\nmade a lot of headway towards that. the\ngovernor uh in last year's budget put\nsome funding towards it. Uh we had a 911\nuh fee study committee in this offseason\nthat was chaired by uh um\na chairman um from the north side of\nAtlanta. Yeah. He's going to kill me\nbecause I can't think of his name right\nnow. It's terrible. Um but that\ncommittee we looked at the the funding\nmechanism for the 911 fee um and how we\ncould take that and utilize that to\nimplement nextgen 911. There was also\nsome timber uh tax credits for South\nGeorgia that got implemented last year.\nAnd we're still working on adding a\nresilience officer uh possibly within\nGEMA to really focus on uh disaster\nmitigation and resilience to try to\nincrease funding for that and to\nincrease our focus on that. You know, we\ndid that study committee during the\nseason when we were having um the\nhurricanes coming. The timing was\neverything. Yeah.\n>> Yeah. The the timing was um was was\nreally um you know critical that we were\nhaving that.\n>> But just these last two weekends, we've\nhad winter storms. Yeah. And so, uh,\n>> and then when when the power goes out\nand you don't have access to that 911\nsystem, you really think about it.\n>> You do. Yeah.\n>> It was Chairman Chuck Martin that chair\nthe 911.\n>> Okay. So, you got that in. I'm so glad.\n>> Chuck won't be mad at me. You did a\nfantastic job.\n>> All right. Switching gears again. Today,\nRepresentative Jackson, on the on the\nfloor of the House, you recognized the\n55th anniversary of the Thiacol chemical\nfire near Savannah, and it killed 29\npeople. Yeah.\n>> Talk about that. A lot of us didn't know\nabout it.\n>> Yeah. So, this unfortunate tragedy took\nplace right here in Georgia um February\n3rd, 1971, 55 years ago. And 29 uh of\nthese black women um uh died. And this\nthis plant uh was a plant where um a\nsignificant number of majority of of\nblack men and women worked. Um it gave\nthem opportunity to uh earn a a living\nand um and this plant was also uh\nhelping our military during Vietnam.\nWell, in the curing room,\nthe the flare that they were\nmanufacturing sparked and it created a\nchain reaction and it devastated uh the\nplant and unfortunately these 29 women\nthat we recognized on the floor today.\nUh not only to commemorate them, but to\nlet the families that were also came\nfrom Savannah and the coastline to let\nthem know that we did not forget and we\nhave to more to do.\n>> I know you I'm so glad you recognize\nthem. I want to get into something real\nquick and we don't have a lot of time. I\nwanted to get your opinion on what's\ngoing on with ICE. I know there are some\nbills and you have one. What what do you\nthink should uh should there's be some\nthings happening in in Georgia when it\ncomes to ICE?\n>> Well, there's obviously a lot of\nconversation. Um the majority of those\nbills have been assigned to the\ncommittee that I chair. Um\n>> and we've got a lot of committee uh\nhearing requests for those and and we'll\nbe sitting down and having some\ndiscussions with the sponsors of those\nbills. Um, I'm having a meeting in the\nnext day or two with our legislative\ncouncil for the committee because\nhonestly, uh, we need to see what what\nrole we can take as far as overseeing a\nfederal law enforcement agency. Um, and\nand what, you know, we can do legally to\neven do that. Uh, what I will say though\nis that um, we've had a lot of\nconversations around ICE. I think that\nthat what ICE does, the job that they do\nis critical. I think we need men and\nwomen to do that job. I think that we\nneed to make sure that our borders are\nenforced and that people who are here\nillegally uh do not remain. And so it's\ncritical we have them uh and we support\nthem. And with all of our law\nenforcement, whether it's local, state,\nor federal, uh I think the majority,\nvast majority of officers that work in\nthose uh departments are good men and\nwomen who are trying to keep our\ncommunity safe.\n>> Okay. Representative Jackson, you have\none of the bills that may end up\npending.\n>> I do. I do because I think the use of\nICE in Georgia is a misuse. Um uh they\ncausing all this fear and and disharmony\nin Georgia. Uh last time I checked,\nGeorgia's borders Florida, Alabama,\nSouth Carolina, and North Carolina and\nTennessee. And so we we we don't need\nour bord our borders are safe. Um having\nICE here in Georgia is a misplace of use\nof the federal government. and and and\nwhen you start to use uh anything that\nlooks like the military and citizens are\nbeing intimidated and or ending up dead,\nthat's a that's a I that's a problem for\nme. And so my bill is simply going to\nhold ICE accountable because if they're\ngoing to do something in Georgia, we do\nhave a right, we have sovereignty in\naccordance with our const constitution\nto do something about it.\n>> Okay. Well, we're going to keep up with\nall of this and we may have to have you\nback on to talk about it.\n>> All right.",
  "updated_at": "2026-02-14T14:46:15.675707+00:00"
}