{
  "video_id": "EUtsOjThTJg",
  "url": "https://youtu.be/EUtsOjThTJg",
  "title": "Georgia House - Day 15 (2026-02-20)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 15,
  "video_date": "2026-02-20",
  "duration_minutes": 132,
  "summary": "Here is a structured markdown summary of the Georgia House - Day 15 (2026-02-20) session:\n\n**Overview**\nThis session focused on the introduction of several healthcare-related bills, including measures to regulate health insurance and expand Medicaid. There was also a prayer by the House Chaplain and recognition of a member's recent health issue.\n\n**Key Actions**\n**HR 1111**: Bill introduced but no further details provided.\n\n**Bills Introduced (First Reading)**\n- HR 946: Act to amend laws related to the regulation and licensing of health insurance\n- HR 947: Act to amend Medicaid laws\n- HR 948: Bill introduced but no further details provided\n\n**Notable Moments**\n- Prayer by House Chaplain Dr. Gill Watson, focusing on themes of kindness, hope, and reconciliation during the Lenten season.\n- Recognition of Rep. Scott Holcomb's recent health issue and hospitalization, with well-wishes expressed.\n\n**Votes**\nNo recorded votes mentioned.\n\n**Attendance**\nNo specific quorum details provided.\n\n**Adjournment**\nThe transcript does not indicate when the session was adjourned or the date of the next scheduled session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you all Members have all Members united prob us juliane polka and welcome and we Carrote Some of you I'm sure aware that yesterday Representative Scott Holcomb had a little health issue and He was admitted to Grady last yesterday afternoon I talked with him or texted with him this morning and He's resting well and Thanks everyone for their thoughts and prayers and So keep him in your thoughts and prayers We will begin our day with scripture reading and prayer by the chaplain After which we will pledge allegiance to the flag of our country our Chaplain this morning will be introduced by the lady from the 43rd House District chairman Sharon Cooper chairman Cooper Thank you, mr Speaker lays in gentleman the well and Visitors it's a real special day for me to get to introduce the pastor of the day He's my pastor He'll always be my pastor even though he retired from Northside Methodist Church a couple of years ago I'm gonna start and ask you a question a little unusual start How many in the chamber members were here? Years ago when governor Sonny Purdue Call for a day of prayer for rain hold your hand up if you were here Is that all we were in a terrible drought and The crops had failed We were losing animals across the state and We're pretty desperate for rain So out on the front steps of the Capitol Sonny turned as governor to the Lord and he asked Representative Gill to come and lead that service and he's in the middle of praying for rain And we're out many of the legislators out there and it starts to rain I would like to say we've had enough for ever seen I think maybe this time since they're saying there's gonna be floods all over northeast Georgia You might need to help us out a little bit whether just maybe a slight stop on it Rather than Gill is now Up leading out close to outside Rome and restored house from the 1840s He was a fifth generation of Lannion But now the people in Rome at the first Methodist Church there are really lucky to having and he has become their teaching pastor He's a natural born storytelling which made it a true joy to go to services and Perhaps even greater than that Was his innate ability to tell what church members needed? You would walk out the door after sermon and if you needed a hug without even asking you'd get it Are the pad on the back are sometimes just the statement? I've had buckle up. You're gonna be all right and just face the situation and With that I can tell you he's an extraordinary human being and I give you my pastor Dr. Gill Watson Thank you Sharon I appreciate that Sharon is a wonderful friend and very prejudiced and I'm grateful. You know this is a this is not my first time to be able to Do the invocation in the house? This speaker but it is an honor always to be here and my younger days I wanted to be here as a representative And then the Lord said You know you might all be a preacher I said well Lord you can help people preaching but I want to be in the legislature and make a difference in people He said I've got all those people there now and they're still trying So you need to be a preacher I do love this state. I do love the privilege of being in this place and From the time I was a page here at about 13 years old it has had a wonderful special place in my heart I do love our Georgia and I am glad that you represent all of us in Georgia and you represent the very best of what is best for all of us Sometimes you have to compromise and sometimes you have to take a deep breath and put on your big girl pants and Do what you have to do Sharon is someone I admire for standing up for the things that she thinks are right and I have many of you in this house Chamber who are my friends and I'm grateful for that so as we come to this 15th legislative day in Your 40 days, you know it was 40 days of flood you do remember that don't you? And And I thought I would also respond to the representative by saying Governor Perdue invited me to pray for rain not for it to stop I have no control over the stopping only the starting Let us pray You Great God you have inspired us to be leaders in the state of Georgia You wrapped your love around us and shown us where there are needs in people's lives where there are places where injustice can be made right and There is leadership that must be leading I thank you for every member of this House of Great God and our Senate I thank you for all of our elected officials and our governor. I thank you great God That you have bestowed on these representatives an awesome responsibility And as we stand at the brink of the Linton season When we're called on to fast something sometimes and we always think that's given something up Lord, you know, I don't give up things too easily especially when it involves food but Lord I want us today to Hear you and I want us in this Linton season to fast from hurting words and Say kind words I want us to fast from sadness and be filled with gratitude I want us to fast from anger and be filled with patience. I want us to fast From pessimism and be filled with hope I want us to fast from worries and trust in you I want us to fast from complaints and contemplate simplicity I want us to fast from pressures and to be prayerful to fast from bitterness and be filled with hearts full of joy I want us to fast from selfishness and be compassionate to all of us I want us to fast from holding grudges and be reconciled one to the other I want us to fast from words and be silent and know that you are God Open our lives and our minds Use us as you will, great God and make this 15th legislative day in the Georgia house a meaningful moving and magnifying time that all of our representatives will feel that they have worked together to make our Georgia better For I pray it in the might of your name our man Will you join me in the pledge pledge allegiance to the flag of the United States of America and to the Republic for which stands one nation ungod indivisible with liberty and justice for all Door capers will unlock the doors the The chair recognizes chairman hogan the chair of the committee on information and audits Thank you mr. Speaker your committee on information and audits Has met and found the journal of the previous legislative day To be correct. Thank you Chairman hogan the chair of the committee on information and audits Reports that the journal of the previous legislative day has been read and found to be correct Is there any objection to the confirmation of the journal the chair here's none and the journal is confirmed The clerk will read the resolution establishing the order of business for the day Mr. Burns on their 59 minutes following me establishes the order of business to him the first part of the period unanimous consent Introduction of bills and resolutions first reading and reference of house bills and resolutions second reading of bills and resolutions report of standing committees First reading and reference of Senate bills and resolutions Morning orders You Is there any objection to the adoption of the resolution establishing the order of business for the day The chair here's none in the resolution is adopted You\n\nyou you first reading of bills and resolutions the clerk or read hospital 946 by reps 9 to the 130th hatch to 150 a thing when I'm 16th stevens 164 chaspers the 11th will be touted on act to men chapter 64, title 33, the fish go to Georgia annotated relating to the regulation and lightens the special committee on access to quality health care hospital 947 over some 9 to the 130th hatch at 150th England 116 newton on 23rd august 27th and others building touted on act to men are 7, 4, title 49 the fish go to Georgia annotated relating the Medicaid generally special committee on access to quality health care hospital 948 over some silcox to the 52nd Cooper the 43rd hence in the 86th will be touted on act to men are related chapter 12, the title 50, the fish go to Georgia annotated relating the Georgia commission on the holocaust government affairs, the national 949 by resident of 9 to the 130th herald 106, Carson 46th Williamson 115th blackman of the 146th, will be touted on act to men, title 48, the fish go to Georgia annotated relating the revenue and taxation ways and means hospital 950 by resident of canard of the 102nd Kendrick of the 93rd better than the 94th will some of the 80th were kinds of the 157th and others will be touted on act to men code section 35, 3, 37 fish go to Georgia annotated relating the review of individual's criminal history and the the the the the the the the the the the the Cooper the 43rd, so Cox the 52nd hatcher to the 150th, 9th and the 13rd, 30th and Wilson to the 80th. Bill B. Todd and Acto Men, Article 6 of Chapter 4, Title 26. The official go to Georgia, annotated relating to pharmacies. Special Committee on Access to Quality Health Care. House Bill 1953, Bob Ross, and I've richer than 97th Williams in the 115th, Walter the 110th. Watson the 172nd, Jones the 25th. Bill B. Todd and Acto Men, part one of Article 3, Chapter 5, the Title 50, the official go to Georgia, annotated relating to General Authority, duties and procedures state purchasing. Governmental affairs. House Bill 954, Barb, resident of Rich, 97th England, 116th Campbell, 111st, Mithiac, 73rd, 172nd and others, the Bill B. Todd and Acto Men, Article 1 of Chapter 8, the Title 16, the official go to Georgia, annotated relating to theft. Judiciary non-civil. House Bill 955, Barb, resident of administration of 104th Cooper, 43rd, Oliver the 82nd. Bill B. Todd and Acto Men, Chapter 5, the Title 16, the official go to Georgia, annotated relating to crimes against the person. Governmental affairs. House Bill 956, Barb, resident of Belton, 112th, Newton on 23rd, Nix of the 69th, Williams the 168th, Prince of the 127th. Bill B. Todd and Acto Men, Chapter 44, Title 43, the official go to Georgia, annotated relating to speech language pathologists. Regulated industries. House Bill 956, Barb, resident of Belton, 112th, Newton on 23rd, Nix of the 69th. Williams on 68th, Prince of the 127th. Bill B. Todd and Acto Men, Chapter 44, Title 43, the official go to Georgia, annotated speech language pathologists. Regulated industries. House Bill 957, my reps on Jones, 47th, Jasper, 11th, Chokus, 138th, Nix of the 69th, Sustlet of the 35th. Bill B. Todd and Acto Men, Chapter 20, the official go to Georgia, annotated relating to education generally. House Bill 958, Barb, resident of Setslor, 35th, Richard, 97th, Wheat Hour, 119th, and Gaines, 117th. Bill B. Todd and Acto Men, Article 1, Chapter 5, Title 49, the official go to Georgia, annotated relating to children and youth services. Geven Old Justice. House Bill 959, my reps, and it makes the 178th Smith, the 133rd, Wasserman, the 141st Smith, the 70th, work eyes of the 157th and others. Bill B. Todd and Acto Men, Code Section 12, 839, the official go to Georgia, annotated, relating to waste management. Natural resources and environment. House Bill 960, Barb, resident of Hutchinson, the 107th. Marrine of the 96th, Wilson of the 80th, Park of the 101st, one of the 89th and others. Bill B. Todd and Acto Men, Article 5 of the Chapter 11, Title 16, Chapter 5 of the 17, Chapter 1, Title 35, and Chapter 4, Title 42, the official go to Georgia, annotated, relating to offenses involving illegal aliens. Public safety and homeland security. House Bill 961, by reps, and Park of the 101st, declaring the 51st, Holland 54th, Robert Show of the 48th, and more of the 95th and others. Bill B. Todd and Acto Men, Title 31, the official go to Georgia, annotated relating to health. Insurance. House Resolution 1166, by reps, and a prince of the 127th, Frazier, and 126, Nelson, 125th, Newton on 23rd, Howard on 124th, a resolution supporting the creation of a state veteran, cemetery, and Augusta. Defense and veterans of fires. House Resolution 1167, by reps, and a green in the 151st, Donna, who is the 30th, Perkle of the 155th, work eyes of the 157th, and Lumpston of the 12th, a resolution authorizing that conveyances certain state-owned real property. State Properties House Resolution 1168, by reps, and a park of the 101st, Williams of the 37th, Couch of the 50th, more of the 95th, and Hutchinson of the 177th and others, a resolution creating a House Study Committee and adverbs childhood experiences. House Resolution 1169, by reps, and a Hutchinson of the 107th, more of the 96th, Wilson of the 80th, park of the 101st, one of the 89th and others, a resolution encouraging the replacement of the term illegally. Code revision. That completes first readers. State reading of bills and resolutions, the clerk will read. House Bill 916, by reps, and a beastly take of the 65th, built to repeal the imposition of the death penalty in the state. House Bill 917, by reps, and a percentage out of the 176th, corporate to 174th, Hitchens of the 161st, Coggins of the 14th, full height of the 175th, a bill relating to carrying a possession of firearms. House Bill 918, by reps, and a Cooper of the 43rd, Knight of the 130th, Hatch of the 150th, England of the 16th. The probably of the 67th and others, the bill relating to pharmacies. House Bill 919, by reps, of Hatch of the 150th, Hatch of the 11th, Burns of the 159th, England of the 116th, McCall of the 33rd and others. The bill relating to imposition rate, computation, and exemptions from state income tax. House Bill 920, by reps of the clerk, with an 98th, the bill relating to education. House Bill 921, by reps of Bruce of the 61st, Maysmore of the 63rd, Jackson of the 64th, the 60th, Metz of the 55th and others. A bill to amend and act to incorporate the city of South Fulton and Fulton County. House Bill 922, by reps of Carpenter of the 4th, Bredly of the 6th, and Tarvan of the 2nd. A bill to revise and restate the law relating to Whitfield County Board of Education. House Bill 923, by reps of Corp. of the 174th. A bill to amend and act, providing for the compensation of the Board of Education of Clinch County. House Bill 924, by reps of Rochester of the 10th, and Arwin of the 28th. A bill to create the Board of Commissioners of Roads of Revenue for Habersham County. House Bill 925, by reps of Rogers of the 10th, lot of the 120th, the second, Reaves of the 34th, the Ricky of the 169th. A bill relating to San Eels and Euse Tax. House Bill 926, by reps of Rogers of the 10th, lot of the 120th, the Ricky of the 169th, Corp. of the 374th, Reaves of the 34th. A bill relating to waste management, cost reimbursement fees, and search charges. House Bill 927, by reps and parsons of the 44th. Cooper of the 43rd, Reaves of the 34th, the 45th, by reps of the 100th, and others. A bill relating to air quality. House Bill 928, by reps of the Dower of the 19th, 119th, Williams of the 148th, Richard the 97th, bar of the 103rd, Silcox of the 52nd, and others. A bill relating to the Fair Business Practices Act of 1975. House Bill 929, by reps of Smith of the 133rd, Washburn of the 141st, bar of the 103rd, Smith of the 70th, Dickey of the 140th, and others. A bill relating to general provisions, relative to solid waste management. House Bill 930, by reps of the Corp. of the 174th, Taylor the 173rd, Watson the 172nd, Meeks the 178th, England the 166th, a bill relating to Georgia Aggra Business and Royal Jobs Act. House Bill 931, by reps of honor, the 72nd, Belton the 112th, Turner the 21st, Clark with the 147th, Newton of the 123rd, a bill relating to veterans licenses, honorary licenses, and other distinctive licenses. House Bill 932, by reps of gains of the 117th, Cooper the 43rd, Jones of the 25th, Padawer the 119th, Newton of the 123rd, a bill relating to professional corporations and the Georgia Pediatry Practice Act. House Bill 933, by reps of Nix of the 69th, Smith of the 133rd, Tramble the 132nd, Bill to the minute act to provide a home site extension from Troop County School District, Agilorum Taxes. House Bill 934, by reps of reach of the 34th, Rogers of the 10th, Larickia the 169th, lot of the 120th, all over the 82nd, and others. Bill relating to imposition rate, competition exemptions from state income taxes. House Bill 935, by reps of an abstraction of 104th, merendid of the 96th, bar of the 103rd, park of the 101st, Harold the 106th and others, bill to a minute act to create a recordous court of Quenette County. House Bill 936, by reps of the corporate of the 174th, gridley of the 6th, Powell the 32nd, Belton of the 112th, Park of the 155th, a bill relating to motor vehicle, St. Traffic House Bill 937, by reps of Smith of the 133rd, call of the 33rd, gridley of the 6th, corporate of the 174th, Powell of the 32nd, bill relating to buildings and housing. House Bill 938, by reps of Alan of the 40th, Cram of the 130th, Dickerson of the 13th, Dryer of the 59th, and all the wits of the 42nd, bill relating to air quality, House Bill 939, by reps of Carson of the 46th, Knight of the 130th, Stevens of the 164th, Broughtledge of the 109th, with power of the 19th and others, bill relating to imposition rate, competition exemptions from state income taxes. House Bill 940, by reps of Quenette of the 102nd, Lopez Ramara of the 99th, Clark of the 180th, with power of the 105th, part of the 92nd, and others, bill relating to elementary and secondary education. House Bill 941, by reps of estration of 104, Titchens of the 161st, Clems of the 12th, bill relating to kidnapping, false imprisonment, related offenses, general provisions regarding the general attorney general and medical assistance. House Bill 942, by reps of Dunhu, the 30th, Hawkins of the 27th, W. of the 29th, the Bill to authorize, the governing authority of the city, Floury Branch, Levy and X-Lize Tax. House Bill 943, by reps of Dunhu, the 30th, Hawkins of the 27th, the 29th, the Bill to authorize, the governing authority of the city, Oakwood, Levy and X-Lize Tax. House Bill 944, by reps of deukes, to the 144th, Bill to amend and act, changing the method of selecting the members of the Board of Education in Miller County. House Bill 945, by reps of deukes, to the 154th, a bill to amend and act, creating board of commissioners, they inform Miller County, House Resolution 1092, by reps of green of the 151st, resolution honoring the life, Mr. Chris Shannon, dedicating a road into the memory. House Resolution 1093, by reps of parts, to the 44th, where guys are the 157th, the headchins of the 161st, makes it the 69th, Dickey of the 140th, resolution creating joint study committee on cybersecurity, House Resolution 1094, by reps of green of the 151st, percol, the 150th, Dunhu, the 30th, workhies, or the 157th, Lumston of the 12th, resolution authorizing the granting of non-exclusive easements. House Resolution 1095, by reps of green of the 150th, first tailored, 173rd, airheart of the 36th, resolution urging the Georgia Department of Education, Department of Public Health, to encourage all schools to participate in a school located, in the influence of vaccination program. House Resolution 1160, by reps of about 137th, leave the 139th checks, to 128th, all under the 131st, more of the first and others, resolution creating house study committee on motor vehicle, motor carrier inspections. House Resolution 1161, by reps of redow, with 119th and gains of the 117th, resolution honoring the life, and Mr. James Oscar, Artigree Jr., dedicating a road into his memory. House Resolution 1160, by reps of all under the 40th, and in Delaware to the 42nd, resolution urging the following commercial public facilities, heavily spun gendered, control adult change in station, with an adult changing table, and appropriate signage. House Resolution 1163, by reps of gamble of the 15th, scogons of the 14th, Kelly of the 16th, resolution recognizing the Georgia Supreme Court, Justice Robert Benham, and dedicating a bridge in his honor, House Resolution 1164, by reps of him, we call the 33rd, watching the 170th second, Dickey of the 140th, Park of the 150th, Corp of the 1374th, resolution encouraging the Georgia Department of Public Safety, to be attentive to the needs of livestock and transport. House Resolution 1165, by reps of gamble of the 15th, scogons of the 14th, Kelly of the 16th, resolution honoring the life of Sergeant Stanley Thomas Bradley, dedicating an intersection in his memory. Senate Bill 295, by Senator Wilkinson of the 50th, geager of the 51st, Walker of the 30th, Melissa of the 50th, Couser of the 46th, and others, a bill relating to courts and revenue and tax sanction, through second readers. Reports of standing committees, the clerk will read. Representative Eddie Delumston of the 12th District Chairman, the Committee on Insurance, submitted the following report, but speaking, Committee on Insurance is a consideration. Following bills of the House, and instructor meeting reports, same back to the House of the Tiling Recommendations, House Bill 583, due passed by committee substitute. House Bill 842, due passed by committee substitute, House Bill 893, due passed, respectfully submitted, Representative Eddie Delumston of the 12th District Chairman. Representative Lynn Smith of the 70th District, Chairman, the Committee on Natural Resources and Environments, submitted the following report. And speaking, Committee on Natural Resources and Environments, had a consideration, following bills of the House. Mrs. instructor meeting reports, the same back to the House, and filing recommendations, House Bill 93, due passed by committee substitute, respectfully submitted, Representative Lynn Smith of the 70th District Chairman. That completes the reading of the reports, and standing committees. We're going on now to morning orders, going on to morning orders. Have a number of members that have signed up. We carried some over from yesterday, and the intention of the chair to start with those, but all members will be limited to one minute each on morning orders. Chair recognizes Representative Hutchinson for a morning order. Thank you. Good morning, colleagues. Today I'd like to introduce you to Finnegan, 13-year-old Finnegan. Going to college and raising his own good family, one day are just two Finnegan's big goals. A smaller and more immediate goal is to possibly play soccer for his school's team. Finnegan who goes by thin, enjoys spending time, watching soccer games, riding his bike, and watching comedies and cartoons. Say hello to Finnegan, 13 years old, one of the many children available today for adoption in Georgia. Thank you. Thank you, Mrs. Speaker. Chair recognizes Chairman Cooper for a morning order. Chair recognizes Representative Dreyer for a morning order. Thank you, Mr. Speaker. Representative Gamble and Irwin are going to join me. But today we're recognizing the 50th anniversary of the Georgia Association of Educators. They're having a lunch this afternoon. They have a great mission, of course, to help those that nurture our children. And I think we can all agree that we don't often recognize teachers enough. We don't often give our respect to teachers enough, but they are incredibly important. They take care of our babies. They give people opportunities to succeed in life in our society. And we want to thank our educators, and particularly thank GAE for 50 years of advocating for teachers. Thank you. Chair recognizes Chairman Newton for a morning order. Thank you, Mr. Speaker. My colleagues, many of you are under age 45, so you need to listen. Or you have family or friends who are under age 45. Trauma is the leading cause of death in that age group from 45 down. I'm excited today is Trauma Day, where we celebrate and appreciate those who are involved in the care of trauma across the state of Georgia. They're 15 level one and level two trauma centers that are working together as a network through the Georgia Commission on Trauma to make sure that we lower that number in Georgia, that we bring the best care possible to all our constituents, our family members, and each other. So if you can join with me, my friends from Augusta University, the level one trauma center where I trained and where I live over in Augusta, are here with us. And you're here in the gallery. If you can just thank your trauma centers and thank them for me. Thank you. Thank you. Thank you, Mr. Speaker. Chair recognizes representative Graveley for a morning order. Thank you, Mr. Speaker. Mr. Speaker, I want to thank you for your leadership. And I want to thank this body for the courage that all of you displayed last year on passing historic legislation so that patients in this state who need medical cannabis so we'll be able to get safe lab tested oil right here in our state. Colleagues, as of date, we are now the envy of Southern states. Alabama having passed a model version of outspill 324 yesterday through their Senate Committee 8-1. Tennessee, South Carolina, and Kentucky haven't expressed interest in copying the bill that we put forward. Why? Because we put patients first. And we did it the right way. I want to thank the governor for having the courage to sign this legislation. And I want to update you, the commission has been formed. They have had two commission meetings and they are on their third one upcoming. I just wanted to thank you all for your courage. And Mr. Speaker, thank you for your leadership. I yield the will. Chair recognizes Chairman Cooper for a morning order. Thank you, Mr. Speaker. I was just hoping that all of you have had a chance to look at the package that was left by the dental hygienist on your desk a few days ago and that you found something that was useful. We have 7,000 dental hygienists in the state and they are working not just in your dentist office but in schools and in free clinics, trying to get basic dental care of cleanings and screenings and the hygiene and things for our poorest of poor children in this state. They have just been in Cobb County at level 1 school, the North Park Elementary School. This is their second year there where they went in and did cleanings and preventing dentistry for these children and they deserve our credit. So I hope you next time you see a dental hygienist, you will thank them for the work they're doing across our state with our most needy children. Thank you, Mr. Speaker. Chair recognizes representative Dickerson for a morning order. Thank you, Mr. Speaker. My moment in black history. Fannie Lou Hamer was an African-American civil rights activist who led voting drives and co-founded the Mississippi Freedom Democratic Party. In December of 1962, Hamer made a life change decision to attend a local meeting held by the non-violent coordinating committee who encouraged African Americans to register to vote. In 1964, Hamer held found the Mississippi Freedom Democratic Party established opposition in her state to the all-white delegation of that year's Democratic Convention. Along with her focus on voter registration, Hamer was set up organizations to increase business opportunities for minorities and to provide childcare for other family services. She helped establish a national women's political caucus in 1971. Five notes of breast cancer in 1976, Hamer continued her fight for civil rights. She died in March 1977. She is buried and one of her famous quotes was, I'm sick and tired of being sick and tired. Thank you, Mr. Speaker. I recognize this representative bonner for a morning order. Thank you, Mr. Speaker. I'm going to be joined by the members of the Fayette delegation. We've got a special group of young ladies in the gallery that we would like to recognize today. Up in the gallery, we've got the McIntosh High School cheerleading team who is also the 2019 5A State Champion. Ladies, if you'd stand to be recognized and help welcome them to the People's House. Here we go. There are representatives mom to hand, gullet and grably for a morning order. Thank you, Mr. Speaker. Today I would like to recognize a leader from our community as a former commissioner, Roy V. Strickland, who is here with his beautiful wife Betty served from 1985 to 1989 on the Pouding County Board of Commissioners. His granddaughter, Bellis here today, Paging for Vice Chairman and Grably. Can we all give a warm welcome to the commissioner and his gorgeous wife this morning? We recognize this chairman dollar for a morning order. Thank you. Today we have the high school, George a high school fencing association here today. And are they in the gallery? Let's tell you they were here. Okay, please stand if you're here. Right back here. Please welcome them. We have fences from all over the state. And later today down the road, Tundra they will be doing demonstrations. So if you've never seen it, please come and learn about this ancient and great sport. Thank you. Chair recognizes Chairman Corbett and Representative Sains for a morning order. Thank you, Mr. Speaker. Today we welcome the Camden County delegation who's traveled the 340 miles necessary to come to our great capital. They're right over here in the corner if we'd welcome them over to our capital from a ballistic missile submarine base to a top performing title one school system and to a Waldrowman horse is on Cumberland Island National Seashore. May and Chairman Corbett are truly privileged to represent a unique part of this great state. Thank you, Mr. Speaker. Chair recognizes Representative Scothield for a morning order. Mr. Speaker and to my house family, today is Lupus advocacy day. Lupus is an autoimmune disease that impacts 60,000 Georgians. Many in the house have shared their personal stories with me. So I thank you all to the legislators that are superheroes today.\n\nFor living for those living with lupus, but the real superheroes are those people living with impacted by and caregivers of people with lupus Join me in recognizing those who brave the rain and the pain today that are here in the gallery Yes, we're done Fly on back fly fly away superheroes. Thank you. Thank you, Mr. Speaker How many of you enjoyed the apple pies in the any room this morning Well the group they brought them I want to recognize in the gallery and that's leadership Gilmer County and Members of the board of directors of the Gilmer Chamber if y'all would stand and let us recognize you please Their job is to keep the road open for me to get home this weekend You Chair recognizes representative Howard for a morning order Yeah Thank you, Mr. Speaker I would like to take and take take this opportunity to welcome to this capital to the people's house Group from Augusta Georgia Mr. Morris Porter and the in a in National action network group if they would stand Let's welcome to the capital a group of young folk Thank y'all for being here You Chair recognizes Representative Shannon for a morning order Good morning Good morning healthy women have better pregnancy outcomes and because of this It is a reason that you hear a lot of us continue to talk about expanding Medicaid and expanding healthcare coverage You take for example a condition like high blood pressure High blood pressure is one of those conditions where by the time you start to see symptoms It's probably that you're having a real issue like a heart attack or a stroke And so you look at a condition like that and that is a condition that you could be walking around with Unbeknownst to you it is really difficult to take care of conditions like this when you now are caring for two And so this is one of the reasons why folks who care about maternal mortality which tracks women dying due to child due to complications and childbirth and up to a year after giving birth Care about expanding access to healthcare you will not be getting the checks that you need to determine This the health of your body before becoming pregnant if you don't have access to healthcare So please consider and support expanding Medicaid for new moms as well as expanding Medicaid for the state. Thank you Chair recognizes representative Susan Holmes for a morning order Thank you, Mr Speaker representative Danny Mathis is gonna meet is gonna join me here and we are very pleased this morning to recognize a great group from Jones County The Jones County leadership group I believe is over here. Would y'all stand and let us Thank you for being here Here you go Hey Watson does a great job with this group. Oh, and we're okay over here too Thanks for coming guys. Thank you Chair recognizes representative Gamble for a morning order Representative Gamble on the floor Morning order Be waves You Chair recognizes chairman Mark Newton to introduce the doctor of the day Thank you, mr Speaker colleagues I'm pleased to introduce to a gentleman I've grown to know over the past several years Dr. Rashon Hodge He trained at at Morehouse College of bachelor of arts and psychology got his medical degree from Robert Wood Johnson Then he came home again and trained in family medicine at the Morehouse School of Medicine for his residency and family medicine It's got a passion for making the human condition better by relieving suffering That's exemplified by his leadership and several Georgia hospice programs a time of life many of us have have family members who've been in hospice Or we know people we care about who've been in hospice how important that can be to have somebody who specializes in that after thousands of hours of training Making a difference in their lives and he's currently also on the board of directors of the Sickle Cell Foundation Medical director of premier chronic pain center does love spending time with his son and pursuing his goal of one day becoming an International missionary, but we're glad he's here with us today, and please help me welcome Dr. Rashon Hodge Thank you for that great introduction. Thank you for the love Ladies and gentlemen of the house is my absolute pleasure to stand before you I do make the cannabis recommendations for the state. I see a lot of purple so That's loop is that's one of the chronic conditions that I that's near and dear to my heart And it's because of your empathy a lot of my loop is patients are not getting on dialysis at 24 25 26 years of age. That's because of y'all so I Appreciate from ball of my heart taking care of the loop is Population patients and caregivers anyone that needs me downstairs. I'm there. My approach is very holistic. It's not just about Shoulder a scapular rotator cup pain. I want to hear about your sleep. You're interest. Maybe any guilty feelings or concentration Let's talk about your mood You know health is mind body and soul. That's is my focus and I think y'all I'm hands on House will continue to be at order The clerk will read the caption to house resolution 1042 house resolution 1042 by represent of Silicon to the 52nd group of the 43rd Larickie the 169th hatchet of the 150th Holland on the 54th and others a Resolution honoring the life and memory of James Harold Shepherd Jr co-founder and chairman of the board of directors the shepherd's center and for other purposes Chair recognizes chairman silcox for an invite resolution Good morning I am delighted this morning to bring to your resolution in honor of James Harold Shepherd Jr This morning we are joined by a lot of the shepherd family if you'd allow me to introduce them first. We have Jamie Shepherd We have Atlanta Shepherd. We have her great granddaughter Annie Shepherd Julie Shepherd and Sarah Shepherd and just delighted to have them unfortunately James Atlanta and Harold Shepherd's son passed away on December 21st of this past year Honestly James received countless of course numbers of national and statewide awards He was chair of the board of directors of the Shepherd Center But much more than anything else to me James was truly a friend to all that he met and he was one of the most selfless and exemplary people that I've ever met He was always about others and never about himself. He was truly a giver and a model for so many He is and will be truly missed Now I'd like to present Jamie Shepherd to share a few more words about James Thank you representative silcox. I appreciate it and thank you to the distinguished members of of the house today for coming here to honor my father And for all you do every day for on behalf of all Georgians When my father was broke his neck body surfing in Brazil in 1973 He barely made it back to Atlanta and there was no Specialized rehabilitation care in the southeast so he had to go to Denver, Colorado for his rehab He ended up walking out with a leg brace and a crutch We were a family full of road builders who was naive enough to think that we could start a hospital Despite despite ourselves probably in many many cases we did that two years later in 1975 We started out as a six-bed facility today. We're a hundred and fifty-two licensed Bed facility we treat brain injuries and spinal cord injuries and multiple sclerosis. We are nationally ranked we treat Georgians People from the southeast from across the nation and also the world While my father's death is a big loss for for the family and also the Shepherd Center Want to let y'all know we have many family members on the leadership and executive team and we plan on carrying on his legacy And carrying on the mission of the Shepherd Center helping Georgians and Americans and international injuries alike. Thank you Thank you for watching y'all mean to the state You You You You Clerk will read the caption to house resolution 1007 house resolution 1007 by a representative rich of the 97th bar of the hundred and third Gains the 117th week hour of the 119th Martin the 49th and others resolution Recognizing the lunar New Year celebration and for other purposes The chair recognizes representative Bonnie Rich to introduce some special guests Thank you Madam Prattam Ladies and gentlemen of the house. It is my Honor today to have with me friends and citizens of district 97 Jacqueline saying and her husband Louis St Mr. Lee and Mr. Wu we are here today to recognize the celebration of the lunar New Year which began January the 25th This is the year of the rat the lunar New Year is celebrated by Asian and Pacific Islander communities around the world including here in Georgia It's a time to renew family ties and to start the New Year with a clean slate Georgians Asian community has been an integral part and contributor to Georgia's successes in culture academics our civic success and our Economic success I would like at this time to introduce Miss Jacqueline saying Who is a first generation Refugee from Cambodia she came here as a young girl with her mother and Young sibling and she is now a naturalized US citizen and has made her home with her husband Louis St who is a first generation Chinese American They reside in Duluth with their 12-year-old son and they are very active members of our community both Culturally and civically, so please join me in welcoming Miss Jacqueline saying who will say a few words Thank you so much Representative Bonny Rich Good morning, everyone Thank you so much for the honor of being here today to receive the house resolution in recognition of the lunar New Year Celebration the lunar New Year is a holiday that is widely celebrated by multiple countries in Asia and Lucky for us here in Georgia We are fortunate to be able to shed this celebration amongst our friends and family From countries such as Taiwan China Vietnam and Korea We are so thankful to be able to live here in the greatest nation in the world and Call this place a home where we can celebrate and embrace diverse and Ethnic diverse culture and ethnic background and still be an American Thank you again so much for having us here and thank you so much for all you do here under the go-dome Thank you so much especially to our representative Bonnie Rich for sponsoring this resolution. Thank you and have a blessed day You Clerk read the caption to HR 1111 HR 1111 House resolution 1111 by representatives go field of the 60th Jackson the 64th Moe the 62nd rich of the 97th and Carter the 92nd a resolution Recognizing February 20th 2020 as Lupus advocacy day at the state Capitol and for other purposes Chair I asked for the house's attention to representative Kim Scofield to introduce a special event and our guests Thank you, madam pro Tim So today I have the honor of recognizing a couple of special guests that have joined us today Miss Claire Henry is she lives in Rockdale She's a former law enforcement officer and now runs a small Business and a nonprofit she is here just to give you a little bit of her story and talk about this Lupus of where a Lupus advocacy day today Thank you representative Scofield. Good morning My son Jordan succumbed to complications from Lupus in 2014 at age 19 He was a former cadet sergeant at Riverside Military Academy and a graduate of Rockdale County High School Lupus is a confusing Disease even to the medical community. It's called the great imitator because it imitates other illnesses and while doctors are ruling out those Illnesses it continues to wreak havoc on one's body until the doctor realizes that we're dealing with Lupus We need more research and training my son was only 19 years old an athlete Jordan's case confounded doctors and nurses alike Some who didn't believe that males got Lupus didn't believe that young people got Lupus Some think it's hereditary But having learned of at least three other young people locally who've died due to its complications we need a cure. Thank you And so for many of you that don't know this is my 20th year of living with Lupus. So thank you for your prayers and your support You Clerk will read the caption to house resolution 1178 1178 House resolution 1178 from Representative Jackson the 64th Already the 62nd Kendrick and 93rd Smileyery the 135th and Duke's the 154th A resolution recognizing February 20th 2020 is alpha-fi alpha day at the state Capitol and for other purposes The chair is proud to rep to introduce Representative Derek Jackson to Introduce some special guests Thank you, madam chair. Good morning Indeed, it is the honor and the privilege to recognize alpha-fi alpha fraternity the oldest and the quotas fraternity 113 years we've been Bringing forth Manley Digies and scholarship for all mankind and we are presenting a proclamation on behalf of this body to the Georgia District of brother Sherman lost Good morning To speaker Ralston members of the distinguished Georgia State House of Representatives Representative brother Derek Jackson and guests agree to on behalf of our 35th General President Dr. Everett be ward our 27th Southern Region Vice President Kelsey rushing assistant Georgia district director brother to Jordan Carter our Pastors your directors and more than 2500 Members of alpha file for fraternity incorporated that call Georgia home Today the members of the nation's oldest collegiate African-American Greek letter organization have come to these Helloed grounds nestled under this symbolic gold dome Galvanized by the theme heating to call Armoring ourselves to advocate and fight against injustice in all communities On this day we gather here to advocate for full and equitable funding of our schools Prioritizing the education of our children increasing the minimum wage requesting that discriminatory policing practices along with racial Profiling are made unlawful ensuring that the right to vote is protected unencumbered and unrestricted On this day the men of alpha and our mentees Come in support of health care for all citizens sensible gun control Decreased the funding and reliance of the private prison complexes There are distinct parallels for the mission of this legislature and the mission of alpha file for at our core We each have a deep commitment to the communities that we serve at our core Each of us are charged with helping to enlighten and uplift those lesser than knowing that by doing so It helps all of us and makes it better for the greater good These work should be done without being biased by ideology without bowing to private interest But by honoring our oaths and obligations to the citizens that we serve We believe we can create a brighter future for Georgia by taking steps to improve the atmosphere in our schools By teaching entrepreneurship and wealth creation and developing policies and practices to support the same And by carrying out our mission which develops leaders promotes brotherhood and academic excellence while providing service and advocacy for our communities As I close I am reminded of a quote you can't be lucky all the time But you can be smart every day May God bless you all the state of Georgia the United States of America And may he keep each of you in his arms because now is the time to do what is right You Madam Pro Tem we also have some offices the office can stand in the gallery and be recognized by this August bodies and the mentees You Clerk will read the caption to house resolution 981 House resolution 981 one more so Smith the 70th Chokers of the 138th Williams Williamson the 115 built 112th and built Bentley the 139th and others a resolution Recognizing commending the Chattahoochi Marian forestry unit. I'm being named the Georgia Forestry Commission 2019 North Georgia unit of the year the Baker Mitchell forestry unit. I'm being named the 2019 South Georgia unit of the year Area 4 on being named the 2019 forest protection area of the year In region two on being named the 2019 forest management region of the year and for other purposes The House will give their attention to representative Vance Smith who will introduce some very special guests Thank you miss bro Tim if I could start out like this I'm actually filling in for representative Lynn Smith chairperson chair lady Lynn Smith If y'all would think about Lynn and her family her husband has turned ill and she had to leave unexpectedly So just keep chairman Smith and her husband in your prayers It's an honor for me to do this We have some of the most elite of the forestry commission people here with us today We're honored to have them for the jobs that they do across our state and and protecting our natural resources and Certainly protecting the citizens of Georgia at this time. I'd like to ask their esteemed leader who used to serve in this house from 2011 to 2017 as a state representative and and a good friend. I'd like to ask them to come out my friend Chuck Williams Representatives Smith. Thank you very much. Madam pro-tam is an honor and a pleasure to be back in this This esteemed chamber and as we have done for the last several years We're proud to be here recognizing our best of the best the men and women Who helped manage and protect the 24 million acres of forest land in Georgia if you as you heard me say before if it's raining in Georgia And as we heard the past of the day it is two out of every three raindrops that fall in Georgia fall on forest land So from an environmental standpoint from an economic standpoint There are a lot of reasons that our forest are very very very important to us I just wanted to mention a couple of things again The men and women you see before us and we had a group over in the Senate earlier today or both from the management Division which helps landowners manage. They're from the protection division that help protect forest Primarily from wildfire but other other things I just want to take a moment for the support that really goes back Prior to my time serving in this chamber much less my time serving with the forestry commission for the support that this body The body across the hall and the governor's office have given us. I know 10 to 15 years ago In particular chair lady Penny house done recognized that we had men and women that were fighting wildfires on bulldozers with open calves And she took it as a personal initiative to start upgrading our fleet of fire suppression doses Now over half of our fleet of dozers have environmental calves You heard chairman england yesterday from the well as he was was presenting the budget talk about hurricane Michael And obviously forestry was severely impacted by hurricane Michael you stepped up in the special session with significant funding And folks if you're not from southwest Georgia I will tell you that recovery is not finished in southwest Georgia There's still blue tarps on roofs. There's still a vast tracts of timber that have not been Been touched and for the support that you have given us to continue to do that work We're thankful somebody asked me in the hallway just this week When are y'all going to be finished in southwest Georgia where hurricane Michael is or was my response was when our phones quit ringing And our phones have not quit ringing yet from landowners that that need our support Just last year we let you know that we were we were running a great training program With with with our pay scales where they were We needed help and and you the governor of the senate responded with some pay parity help that has really really moved the needle for us on Attracting and retaining Quality men and women to do the work of the commission Madam pro tem if I can is I rack up a point a personal point When I walked out of those doors after 2017 session I had no idea that I would not be walking back in them nine months later Had no idea that this opportunity to work for the people of state of Georgia with the forestry commission would come about And I would submit to you that none of us ever know when we walk out that door when we might be walking back in\n\nor not. The voters may call us back home. Our families may call us back home. Your business may call you back home or as we were reminded with Chairman Jay Powell, the good Lord may call us back home. So I just wanted to share with you, someone that sat where you have sat, never take for granted when you walk in those doors. I know we get busy, the noise level gets high. I would just suggest that we all, when we have an opportunity to walk through those doors, mount them, that we just take a moment and realize what an opportunity and a privilege it is to serve in this body and never take it for granted. And without again, we're very appreciative for your support, your ongoing support, and we look forward to serving your constituents in any way we can. Thank you. The House will be at ease for a few moments. We're going on now to the rules calendar. Going on to the rules calendar, the clerk will read the caption to House Bill 777. House Bill 777 by Representative Corbord of the 174th Burns, 150 ninth. We'll call the 33rd and others. We'll talk about the act to amend chapter 2, Todd Lady, the fiscal to Georgia and Tady relaying the standards and requirements for construction, alteration of buildings and other structures as Bill Hattman referred to the committee on agriculture and consumer affairs. I committee recommends that this bill do pass. Thank you, Miss Speaker. Members of the House, I'm reading before you today House Bill 777. But before we get to the bill, let's talk about what the foster industry means to Georgia. With the number one foster state in the nation, Georgia's second largest industry is forestry. Over $36 billion in economic impact, over $977 million in state taxes, over 148,000 direct and indirect jobs, and then there's $37 billion worth of ecological impact to Georgia. So in the more words of Chad Nimmer, if you like clean water and clean air, thank our forestry people. Thank you for our growers. So let's talk about what we're doing with the bill. We're just asking DCA to speed up their review process as it comes to the mass timber part of the International Building Code and setting a timeline for them to do that. We're just asking speed that process up and after reviewing it and with the approval of the Code Revision Board to decide whether to adopt it or not. That's basically what we're doing with this bill. Appreciate everybody's favourable consideration. And, Mr. Speaker, I yield for any questions. You did not appear to have any questions. Well, thank you. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favourable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favour of the passage of the bill? We'll vote aye. Those opposed will vote no in the clerk will unlock the machines. Members voted. If so, the clerk will lock the machine on the passage of House Bill 777. The eyes are 162. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 786. House Bill 786, by the way, will the 110th and others to be entitled an act to amend Code Section 1562. The official to Georgia and Tate relayed the number of judges in superior courts. This bill I'm referring to the committee on judiciary that committee recommends that this bill do pass by committee substitute. Chair recognizes Chairman Welch to present the bill. Thank you. Thank you. Thank you, Mr. Speaker. Members of the House, I present to you a request that we fund a fourth judgeship in the Flint circuit. The judicial council has recommended and does this on a periodic basis where they do a caseload assessment. And in doing so, they have determined that there are three circuits, the top three circuits, Cobb, Oghichi and Flint, are in need of a fourth or additional judgeship. They've recommended that too. We have appropriated money and are we have it in the budget. The governor's budget has a recommendation of appropriation of money for each of those circuits. I understand that bills have been filed for Cobb and Henry, which is the Flint circuit. We'll see if that also is filed for Oghichi. In the bill, you'll note that we have postponed the start date till January 1st of 2021 so that afford us some budgetary money going forward in the big budget. I want to say thank you to Representative Douglas Holly, Scott Rutledge, Knight, and Mate the Act for co-sponsoring this legislation and ask for your favorable consideration of this bill. I'll take any questions. You do not have any, well, you do have a question. Do you yield? I do. Chair recognizes Representative Holly, do you arrive for a question? Thank you, Mr. Speaker. Does it gentlemen you? I do. Is it not true that Henry County is one of the fastest growing counties in the nation? It is true. And is it not true as well of that for the five and a half years, as served as a criminal warrant officer with states largest county that cases can get a bat log if we don't get a proper person there to sit in the judicious seat? Well, I would have believed you know what you speak, but I would also say that making sure that we have that fourth judge ship is instrumental in moving the criminal justice system along in the Flint circuit. Absolutely. Well, thank you for your work on this. Thank you. Without any speaker, I yield a well. Is there any objection to the previous question being ordered? The chair here's none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here's none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill will vote aye? Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 786. The eyes are 160. The nasor zero. This bill having received the requisite constitutional majority is therefore passed. House Bill 292 was on yesterday's rules calendar and was postponed until the next legislative day. The clerk will read the caption to House Bill 292. House Bill 292. I represent a patent of the 31st to be entitled to enact two men article on the chapter 21, the title 47, the fiscal to Georgia annotated relating the general provisions for the region's retirement plan. Let's belive it. Further committee on retirement, that committee recommends this bill do pass. Chair recognizes the chairman of the retirement committee, chairman Benton, to present the bill. Thank you, Mr. Speaker, members of the House. Bring to you today House Bill 292. This bill would amend the general provisions under the region's retirement plan relating to remittances by the University System of Georgia. Currently, the University System of Georgia is required to remit the following payment to the teacher's retirement system of Georgia. An amount equal to the accrued liability contributions that would have been made on behalf of participating employees if they had been members of the teacher's retirement system. And to any amount, an amount if any equal to the increase in the normal contribution rate. This legislation will repeal those requirements. Therefore, if this legislation is enacted, the University System of Georgia would no longer be required to remit such payments to the teacher's retirement system of Georgia. According to the actuary for the teacher's retirement system of Georgia, this legislation would not result in any additional cost to the system. And based on the recommendation from the system's actuary in 1999, the University System of Georgia has not been making such payments to the TRS on behalf of members of the optional retirement plan. Mr. Speaker, that's the bill and I'll be glad to answer any questions if there are any. You do not have any questions. Thank you. Are you loyal? Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? We'll vote aye. Those opposed to vote no and the clerk will unlock the machines. I have all members voted. Have all members voted. If so, the clerk will lock the machine on the passage of House Bill 292. The eyes are 159. The nays are one. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 716. House Bill 716, members, there are black more of the 146, black men of the 146, and others being tauted on the act to the men code section 3324, 59.23. The official to draw the annotated relating to carrier, issuing health benefit plan to pay insured agents commissions. Let's be lemme refer the committee on insurance that committee recommends that this bill do pass. Chair recognizes the chair of the Governmental Affairs Committee, Chairman Blackman, to present the bill. Thank you, Mr. Speaker, fellow members. This is some quick adjustments to what was passed a couple of years ago regarding commissions that are filed with the insurance commissioner. This would require carriers to file those commissions, including if they're going to use zero percent and those commissions would be paid as filed. It's really intended to provide some added clarity, transparency and consistency to the existing language. Secondly, we have a part that qualifies and clarifies language regarding special enrollments. So with that, Mr. Speaker, I'd be happy to answer any questions if there are. We do not have any questions. Thank you very much. I ask for your favorable consideration. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of House Bill 716 will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will lock the machines on the passage of House Bill 716. The eyes are 155. The nays are six this bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Resolution 1023. House Resolution 1023 by Representative Welch the 110th provosting amendment to the Constitution shows to provide that the people of this state may petition the judiciary for declaratory relief this bill ever refer to the committee on judiciary. The committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Andy Welch to present the resolution. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I come before you to ask for your favorable consideration of a proposed constitutional amendment to allow the voters of this state to decide whether or not they can petition their courts for relief when government acts against state law of the state constitution or the federal constitution. In recent Supreme Court decisions, the court has read our constitution to invoke what is called sovereign immunity whereby individuals cannot sue for declaratory relief or injunctive relief in the courts of the state when someone a governmental official or governmental agency branch or entity violates your constitutional or statutory rights. It is in our constitution and therefore it makes sense to amend the constitution so that people can come to the courthouse and seek that redress. Last year, I stood before you and asked that you passed House Bill 311. That was a waiver of sovereign immunity for those purposes and you did. You voted twice and you voted overwhelmingly in support of that waiver. This body and the Senate did likewise unanimously in fact. And in three years before that, both chambers adopted a similar bill that was sponsored by Wendell Willard, J-Powell, BJ-PAC. No legal light weights in this chamber. And that was passed and adopted and it was vetoed. And 311 was vetoed. So I bring before you this constitutional amendment to ask that you put it before the voters of this state. Now let me tell you what the bill does not do or what the House resolution does not do. It is a limited waiver to allow for people to petition in court and use the third branch of government to redress governmental wrongs, constitutional violations, breaches a statutory law. It expressly does not allow for injunctive relief. So you can't stop someone. You can file suit to have a judge tell the government that they are breaking the law. It does not authorize the payment of damages or attorneys fees or cost of litigation. It has one purpose to protect our constitutional and statutory rights. You remember last year, I have still before you and I think I said look, here's the key to my office in the capital. The Supreme Court has said each and every one of you 180 members of this House, the 56 members of the Senate, you have the power to open up the court house so that people can go in and sue if they think government is violating their rights. We spent over a hundred million dollars to build an edifice to the Supreme Court of Georgia and the Court of Appeals. But we didn't give anybody the key. I'm asking you to give them the key. Lady Justice has a sword, a scale, and a blindfold. If you can't get into court, she didn't have any of those things. She could see the wrongdoing. She can't weigh it out because she doesn't have a scale and she doesn't have a sword. I'm asking you to put in the people's hands with a boat on this measure, put that blindfold back on, put the scales of justice back in her hands, put that sword back in her left hand and let her do her job and let the third branch of government be a check on the other two branches. I ask for your favor, consideration for this measure and I'll be happy to take any questions. Do you yield for a question? I do. Chair recognizes representative Dukes to your left for a question. Thank you, Mrs. Speaker, for the gentleman you. I do. In your presentation, is it not true that you said that a person who had been briefed could not get relief for attorney fees if they decided to sue them? The gentleman is made and you could adopt the law that you would authorize attorney's fees or or damages in specific situations but this measure does not allow for that to occur until we have a past and enabling legislation later. Could that be a part of this legislation? Because my concern is is that how would a person who could not afford to hire an attorney get relief when the courts have wronged them? It's a good question. Our courts are open to anyone bringing a suit for that purpose and you would not need to be an attorney to bring that action. So the other aspect of it is we don't want to also authorize frivolous actions. These should be meaningful actions brought for violations of those constitutional and state statutory rights. This is not true that the defendant who represents himself has a fool for lawyer. I would hope not but even though it's my profession and even though there's financial gain for me to do those to represent clients, I would submit to you that our courts in hearing a petition for violations of constitutional law and statutory law will listen and they will listen to those petitioners even if they do not have a lawyer and I think the men and women of our judiciary are fair-minded and can meter out justice accordingly even though there may not be a lawyer representing that individual. I would like to give them the benefit of the doubt and allow them to hear those cases because right now they cannot. Do you further yield? Yes, I do. Chair recognizes representative Rodgers to your right for a question. Thank you Mr. Speaker. Well the gentleman yield. I do. Is it not true in regards to the gentleman's questions which are well found that I guess but the actuality of this is it boils down to one simple thing all we're doing is putting it in the hands of the people to say to George it to make a simple decision. That is all we're doing. Thank you sir. Thank you. If they're new for the questions Mr. Speaker I will yield the will. Do you have one more if you step to you though? I'll take the question. Chair recognizes representative Williams to your left. Thank you Mr. Baker. Mr. Jim and you. I do. My question with this if you have members that are appointed to a state regulatory board. Is this now make them liable? Could they be held liable for not enforcing the law that they are sworn to uphold? It's a good question and the answer is no. State law already if there's a statutory mandate that they have to do something we already have a cause of action called mandamus for that purpose. And in fact this legislation addresses the concern that we have whereby in section lines of 18 through 27 we expressly require that the lawsuit be brought against the board and not the individuals named which provides protection for those people who engage in public service and want to serve the state and make decisions that they themselves will not be subject to these kinds of suits. And so they would not be subject to the board as a whole maybe subject to the suit but not the individuals. Thank you very much. Thank you. With that Mr. Speaker I will yield the well. You had another question but do you still yield? Gentlemen as yielded the well is there any objection to the previous question being ordered? The chair here is none the previous question is ordered. Is there any objection to adopting the committee substitute? Chair here is none. Committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the resolution? The chair here is none. The report of the committee is agreed to shall this resolution now be adopted. All those in favor of the adoption of the resolution will vote aye. Those opposed will vote no and the clerk will unlock the machines. All members voted. All members voted. If so the clerk will lock the machine on the adoption of House resolution. 1023 the eyes are 163 the nays are zero this resolution. Having received the requisite constitutional majority is therefore adopted. Mr. Clerk I'm going to ask you if you would to read rule 135 House rule 135. No member or person shall vote for another member on any question or\n\nopposition unless otherwise ordered by the speaker. Any violation of this rule may be punished by fine, censure, or other action ordered by the House. Thank you, Mr. Clerk. Clerk will read the caption to a group of privileged resolutions honoring the life and memory of Clarence Mutt Lee Rhodes, Jr. Recognizing February 21st, 2020, Georgia Election Officials and Registrar's Day, at the State Capitol, commending call to care. Congratulations, commending. Marigold Edwards for receiving the 2020 Yellow Rose Nikki T. Randall Servant Leader Award on March 10th, 2020. Recognizing commending Cook County Schools in the Baby Hornets Program. Congratulations, Title Town Titans football team for winning the 2019 14 U National Championship, commending officer Daniel Spurano. Recognizing April 2020 as Genocide Prevention and Awareness Month, the State Capitol honoring the life and memory of Brenda Fae Asbury. Recognizing March 2nd, 2020 as peanut butter and jelly day at the State Capitol in commending the Georgia peanut industry. Commending Thomas N. Upson Community Heart and Soul that are recognizing March 2nd, 2020 as Thomas N. Upson Community Heart and Soul Day at the State Capitol. Recognizing February 22nd, 2020 as African American Gun Association Second Amendment Day at the State Capitol. Recognizing commending Reverend Calvin Peterson and disabled in action, Inc. Commending the Atlanta Business League. Commending Delta Ascigma Theta Sorority for its 107 years of service and recognizing March 2nd, 2020 as Delta Day at the State Capitol. Commending Georgia's Community Service Boards in recognizing March 12th, 2020 as Georgia Association of Community Service Boards Day at the State Capitol. Congratulations the Gatewood Clay Target shooting team for winning the 2019 GISSA State Clay Target Shooting Championship. Recognizing commending the success of TIFTough Bermuda Grass in the work of Dr. Wayne Hannah, Dr. Brian Schwartz in the University of Georgia. And for other purposes, that completes the reading of the privileged resolutions. Is there any objection to adopting the privileged resolutions the chair hears none in the resolutions are adopted? Okay, we're going to go on to announcements here momentarily. If you have signed up for an announcement, make your way to the front of the chamber. Chair recognizes Chairman Hatchett for an announcement. Thank you, Mr. Speaker. Please listen, the majority caucus will meet upon adjournment in room 403. Majority caucus will meet today in room 403 upon adjournment. Luch is provided. Chair recognizes Chairman Ballinger for an announcement. Thank you, Mr. Speaker. Your juvenile justice committee will be meeting today at 1.30. We have slightly delayed the start of the committee meeting in light of the majority caucus meeting. So we will meet today at 1.30 in room 406. Thank you. Chair recognizes representative Buccner for an announcement. Please join us for the working families caucus. Lunch will be served. It is in room 307 of the Coverdale legislative office building. We've got a great program plan of our own House Appropriations Chair, Terry England. We'll be talking about the big budget to our caucus and explaining how that might affect working families. We'll also have Senator Hill talking to the senators that are members of the caucus. So come join us if you will, 307. Chair recognizes the chairman of the House Rules Committee. Chairman Smith for an announcement. Mr. Speaker, as long as the another chairman Smith that will show up, we'll be okay. Ruse will meet tomorrow morning at 9 o'clock. 9 o'clock tomorrow morning Ruse Committee. Chair recognizes chairman Gerald Green for an announcement. Thank you, Mr. Speaker. Please join us today for the trauma awareness day luncheon and injury prevention showcase. It'll be down at the Georgia Prec depot in the blue room. In the blue room, the trauma awareness day luncheon. Thank you. Chair recognizes representative Al Williams for an announcement. Sorry, wrong Williams. I got you all confused. I got you all confused. Chair recognizes representative Rick Williams for an announcement. Thank you, Mr. Speaker. Just glad the other Mr. Williams didn't show up. The regulated industries subcommittee of alcohol and tobacco meeting will be postponed. It will have to be rescheduled. Thank you, Mr. Speaker. Chair recognizes chairman Martin for an announcement. Thank you, Mr. Speaker. I want to remind everybody the energy subcommittee of energy telecommunications utilities and telecommunications will meet at 2 o'clock in 403. We'll have a hearing on house resolution 1037 by Representative Chuck F. Strachan. I know he would appreciate your attendance. Thank you, Mr. Speaker. Chair recognizes chairman Newton for an announcement. Thank you, Mr. Speaker. Members of the Health and Human Services Committee, we will have a meeting today at 1 o'clock, 1 o'clock, and 506 CLOB. In addition, the Committee on Access to Quality Healthcare Meeting that was going to follow that has been postponed to Monday. So we'll see you at 1 o'clock. All right. Chair recognizes the chair of the House Ways and Means Committee. Chairman Harrell for an announcement. Thank you, Mr. Speaker. Ladies and gentlemen, the full Ways and Means Committee will meet this afternoon at 315 and 606 CLOB. Just prior to that meeting, the income tax subcommittee will meet at 3 p.m. and 606 CLOB. If you have bills that you believe are coming out of full committee this afternoon, don't forget to prepare. Chairman Smith's rules committee forms, and I'll sign those for you upon passage. Chair recognizes chairman Corbett for an announcement. Thank you, Mr. Speaker. Chairman Moody Vehicles Committee will meet at 8 o'clock in the morning, room 515 CLOB. Thank you. Chair recognizes representative Chocus for an announcement. Thank you, Mr. Speaker. Listen up, guys. The Academic Support Subcommittee on House Education will be meeting at 1 p.m. today in room 606 and the full committee on the House Education will be meeting at 1.30 also in room 606. Thank you, Mr. Speaker. That completes the announcements. Chair recognizes the majority leader of the House for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 9.30 a.m. February, where are you? February 21st, 2020. The majority leader has moved that this House be adjourned until Friday, February 21st, at 9.30 a.m. All those in favor of the motion please indicate by saying aye. Those who are not in favor of the motion, please indicate by saying aye. Those who are not in favor of the motion, please indicate by saying aye. Those who oppose say no. The eyes seem to have it. This House will be adjourned until Friday at 9.30 a.m.",
  "updated_at": "2026-02-13T11:20:38.517067+00:00"
}