{
  "video_id": "eyigkuP-8oI",
  "url": "https://youtu.be/eyigkuP-8oI?t=700",
  "title": "Georgia House - Day 22 (2026-03-01)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 22,
  "video_date": "2026-03-01",
  "duration_minutes": 170,
  "summary": "Here is a summary of the Georgia House - Day 22 (2026-03-01) session:\n\n**Overview**\nThis session featured a prayer and remarks from a guest chaplain, as well as the introduction of several new bills. The proceedings were relatively routine, with no major controversial actions taken.\n\n**Key Actions**\n- **HB 1009**: Relating to early childhood education programs\n- **HB 1303**: Addressing workforce development initiatives\n- **HB 389**: Revising insurance regulations\n- **HB 1188**: Enhancing transportation infrastructure\n\n**Bills Introduced (First Reading)**\n- HB 1009, HB 1303, HB 389, HB 1188\n\n**Notable Moments**\n- Opening prayer and remarks from guest chaplain Rev. Verdeal Jones\n- Representative Al Williams introduced the chaplain and spoke fondly of her background and work in the community\n\n**Votes**\nNo recorded votes mentioned in the transcript.\n\n**Attendance**\nQuorum present, no issues noted.\n\n**Adjournment**\nSession adjourned. Next session scheduled for a future date.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you from the 168th House District Representative Al Williams, Representative Williams. Thank you, Mr. Speaker. As I was getting up, I looked over to my right, and the RICU was holding in. I don't know what the indication was, because I don't read that kind of language. So I've only got a 30 minute introduction. So it's just great to be here. Too reasonable amount of time. Speaker has a way of making his point. But I am truly honored this morning, and I don't just say that. I'm honored to introduce the Chaplin for the Day, because I literally have known her all of her life. She is, I consider one of my dearest friends, and I'm extremely proud of her. And she's from Midway, and her mother, babysit me in church just a few years ago. And I want you to know, Mr. Speaker, her mother said, that I was the most beautiful baby she has ever seen. Each her heart's out. But what our minister today has been, and his associate pastor of the Cal remission Air Baptist Church, that we both attend, she lives in Liberty County. She has a varied background. She is, of course, a community leader. She's a member of the Board of Education. And she's not going to want me to say this, but she'll be announcing next week that she's running for Chairman of the Liberty County Board of Education, and well-qualified she is. She's a mother. She has two beautiful daughters whom I call my superstars. Shella and Dejana. And her husband is here with her. And this is the very first spouse that has been allowed on the flow in two years, and it could only happen for Liberty County. This is retired Air Force, a silent Randolph Jones. And he's here with us. And it's great to have you here with us, Randolph. History goes way back. I, most of the games, if I'm in town, I watch it their house. And it's just a joy to know them. She has started a new program called The Midway Project that will distribute books to first-time readers. And then she will have literacy classes for old of her. She has done a marvelous job. She's a state-form agent. Her agency is in Savannah, though she lives in Midway. And that explains, Representative Hucley, why you don't have any of my policies. But she has a word for us today. Because above all else, she loves the Lord. Without any further ado, I present to you, Minister Verdeal Jones. Good morning, good morning, good morning. Truly, this is the day that the Lord has made. And we shall rejoice and be glad in it. To the speaker of the house, the honorable David Rolson, and to my brother, my mentor, my friend, and my state representative, the honorable Al Williams. I thank you for the invitation to allow me to speak a few words and pray with you on this morning. Earlier this year, I was sharing with my staff that we have been through a rough couple of years. And it almost feels as bad as a storm or tornado. As those words fell from my lips, my mind went back to the old movie, The Wizard of Oz. You remember the story, right? There was a tornado in Kansas. And you remember that Dorothy and her dog got picked up and landed in a city called Oz. Dorothy was so sad and lost, and all she wanted to do was to get back home. Can we focus on home for just a moment? Home, that place where you live with your family, home, a dwelling place, a place where you feel like you belong home, a place that is safe and secure, a place that's full of love, joy, and peace. Really? That's what we all want when we think about home. On Dorothy's quest to get back home, she found herself on a yellow brick road. And on that road, she ran into three characters. I know you wonder, and why in the world is she telling us about a movie? Just stay with me for a moment. The scarecrow that she ran into needed a brain so that he could think the ten man of heart so he could love and the cowardly lion courage to fight. And Dorothy needed some faith for the journey. Today, as we look around, we are faced with all kinds of tornadic situations that try to keep us away from the place that we call home. We're faced with sickness and death and injustices and evils, poverty and lack. And in recent days, even war, Lord, have mercy on us. And all we want is a place called home, a place full of love, joy and peace. I remember when my husband and I were in Italy, and he was serving in the Air Force, so many days I longed for Georgia, sweet Georgia. Because Georgia was always on my mind, because that was home. I think of each of you every day, week after week. You leave your homes to come here and serve your communities, to serve 11 million people who call Georgia home. Thank you for your sacrifice. And I want you to know that God has not forgotten about you. And he says to you this morning, and my God shall supply all your needs according to his riches in glory by Christ Jesus. As you continue your work, we realize that we don't have a yellow brick road to get home, but all of our roads lead to Jesus. We need a brain to think. So we find in James one and five, as if any man lacks wisdom. Let him ask God who gives to all liberally without reproach, and it will be given to him. We need a heart to love and care for people. And we find in Psalms 51, create in me a clean heart, a gentle God, and renew in me the right spirit, because the heart is the symbol of love. We need courage to fight for better homes for all Georgians, courage to make difficult decisions, and to stand for what is right. So Isaiah 41 and 10 says, We are not for I am with you. Be not dismayed for I am your God. I will strengthen you. Yes, I will help you. I will uphold you with my righteous right hand. Lastly, Dorothy needed some faith to get back home. Mark chapter 11, verse 22. So God answered and said, Have faith in God. There are many men, women, boys, and girls depending on you all to make their homes a better place. I encourage you that when tough times come, when you get tired and weary, when it seems like your backs are up against the wall, remember the words in Philippians 4 and 13, and it says, I can do all things through Christ, who strengthens me. Let us pray. Dear Heavenly Father, we thank you for this day. Lord, before we think of ourselves on today, we lift up the people in Ukraine. We ask that you throw your arms of protection around them and bind them, bind the hand of the enemy. Have mercy on them. Oh God. Now, Lord, we thank you for these great men and women that make up the Georgia House of Representatives. Thank you for their family, their staff, and especially their constituents. Lord, we acknowledge you as the head of our life. And we ask you to forgive us of our sins and all of our shortcomings. Lord, I pray that you give them wisdom, knowledge, and understanding to think like you, a clean heart and a renewed spirit to love like you, and then give them the tenacity, the strength, the firmness of mind to be fearless and fight like you. Give them the faith, faith, to trust you in every situation. Lord, remind us that there are many little boys and girls depending on us and believing that somewhere over the rainbow, blue birds fly and dreams really do come true. Bless our homes, O Lord, let peace, love, and joy abide and bless every home across this great state of Georgia and across this nation. Lord, if there is one whose soul is lost today, please help them find their way back home to you, O Lord. And Jesus name my pray, amen. Amen. Lord, keepers will unlock the doors. The members may greet the chaplain in the south any room. Thank you, Mr. Speaker. Your committee on information and audits has read the journal of the previous legislative day and found it to be correct. And furthermore, Mr. Speaker, there are some people who always seem to be angry and continuously looking for conflict. Walk away from these people. The battle they're fighting isn't with you, it's with themselves. Very good. Chairman Hogan, the chair of the committee on information and audits reports that the journal of the previous legislative day has been read and found to be correct. Is there any objection to the confirmation of the journal? The chair here is none and the journal is confirmed. The clerk will read the resolution establishing the order of business for the day. The first part of the process is the order of business and the first part of the period unanimous consent. Introduction to bills and resolutions. First reading and reference of House bills and resolutions. Second reading of bills and resolutions. Reports of standing committees. Third reading and passage of un contested local bills and resolutions. First reading and reference of Senate bills and resolutions. Morning orders. Is there any objection to the adoption of the resolution establishing the order of business for the day? The chair here is none and the resolution is adopted. First reading of bills and resolutions. The clerk will read. House bill 1462 by ribs. The quervant of the 74th per cent of the 176 roads and the 120th of the hood and the 175th tariff and the second and others. It will be titled an act of men chapter 2, a title 21 of the fiscal day. The judge annotated the report. Special committee on election integrity. House bill 1464 by ribs and per cent of the 176th of the hood and 175th. Smith and 70th, rich in 97th, corporate of the 174th and others. It will be titled an act of men article on chapter 3, title 35. The fiscal and Georgia annotated relating the general provisions regarding the Georgia committee on election integrity. House bill 1467 by ribs and per cent of the states and 180th Smith on 34th, produces 61st Taylor, the 173rd, expiry on 35th and others. It will be titled an act of men chapter 5, title 50. The fiscal and Georgia annotated relating the department of the administrative services. The fiscal and Georgia annotated relating the general provisions regarding the federal\n\nMental affairs House before 1773 by the center for chat of the 176 will hood of the 175th Corb of the 174th and Gambill of the 15th It'll be tied in act to the men part three of article six chapter eight of title 46 the fish go to Georgia Antiter really the operation of trains across the transportation 1474 by resident remainder of the 56 rich and 97th Wilkinson 38th Cantal was 22nd and way to the 9th It'll be tied in act to men part two of article six chapter two title 20 the fish go to Georgia Antiter relayed the compensate Education House for resolution 867 by represent gunner the 8th resolution honoring the life of sheriff Jay Vernon Chastain senior transportation House resolution 868 members of one of the 89th Shannon the 84th Burn out the 77th Park of 101st robbers the 52nd and others a resolution for closing an amendment to the Constitution of state of Georgia rules House resolution 877 by resident remainder of the 56th settler of the 35th Jones the 25th Wilkinson 38th and Smith the 41st Resolution and curaging the Department of Education Education Senate bill 259 by senator ball is 53rd goods the 51st mill of the 49th Harper the 7th Bill be tied in act to a man article 4 chapter 11 title 16 fish go to Georgia annotated relating the dangerous instrument public safety and Homeland security Senate bill 319 by senator Anna de Bartai the 31st painted 54th Thomas the 14th Robertson 29th Hickman the 4th and others Will be tied in act to men article 1 chapter 3 title 20 the fiscal to Georgia annotated relating the general provisions regarding parts Public safety and Homeland security Senate bill 472 by senator Kennedy 18th built the title of an act to a men article on a chapter 2 title 46 the fiscal to Georgia Intended relating noracization of members of the public service commission Legislative and congressional re-apportionment Senate bill 479 by senator hatches the 50th mill of the 49th to the 30th goods to the 51st ball is the 53rd dollars They'll be tied in act to men code section 16 111 31 of the fish go to Georgia annotated relating possession of firearms Judiciary non-simile that completes first readers Second reading of bills and resolutions the clerk will read House bill 1429 by the representative of the 123rd lot of the 120 second Fleming of the 121st to bill relating to excise tax on rooms lodging into accommodations House bill 1430 by reps of Williams of the 148th the belts read constitute the Board of Education of Christ County House bill 1431 by reps and pitches of the 161st the belts will revive for the creation of one or more community improvement districts in the city of rank on House bill 1432 by reps of weight of the 9th and Rossino the 7th the belts will men in act creating board of elections and registration for Dawson County House bill 1433 by reps of balance of the 23rd set to the 35th Smith of the 70th and scog of the 14th the bill relating to advisory board created a membership relative to the criminal justice coordinating council House bill 1434 by reps of limb of the 99th rich of the 97th Stevens of the 164th hulking of the 81st gains of the 117th and others the bill relating to excise tax on rooms lodging and accommodations House bill 1435 by reps of Martin of the 49th Jones of the 47th McDonald of the 26th gains of the 117th the hood of the 175th and others a bill relating to the needs that based to financial aid program House bill 1436 by reps of Smith of the 41st Cooper of the 43rd the hood of the 175th the bill relating to long term care on but on but some in program house bill 1437 by reps of black one of the 146 Jones of the 47th may download the 26th England of the 116th Williams and 115th and others the bill relating to income tax house bill 1438 by represent Thomas of the 21st gestures of the 11th with hour of the 119th part of the 5th C-Ball 34th and others a bill relating to department of transportation House bill 1439 by represent Thomas of the 21st Bella of the 19th Anderson of the 10th blackman of the 146th Ballinger of the 23rd Nothers a bill relating to municipal annexation of territory House bill 1440 by reps of Wilson of the 80th proclaiming the 100th scofield of the 60th wind of the 89th the bill relating to employment security House bill 1441 by reps of Collins of the 68th gravely of the 67th Hitchens of the 161st gains of the 117th Cove the 110th the bill relating to operators of private detective business and private security business House bill 1442 by represent Newton of the 123rd roads of the 120th Williams or the 145th of the overlaid to state employees health insurance plan House bill 1443 by reps of gains of the 117th we'd our 119th gamble of the 15th Hagen of the 156th camera of the first and others a bill relating to food and service establishments House bill 1448 by reps of Collins of the 68th green of the 111st Fleming of the 120th first Carson of the 46th Maynard of the 56 a bill relating to better vehicles and traffic House bill 1449 by reps of Taylor of the 173rd Hockens of the 27th night of the 130th a bill relating to medical assistance generally provided as public assistance under social services House bill 1450 by reps of Richard the 97th tanker to leave the 160th camp of the 131st Hagen of the 156 all over the 82nd others a bill relating to dogs House bill 1451 by reps of McLearn of the 51st and Gilligan of the 24th the bill relating to wild animals for which a license or permit is required House bill 1452 by reps of gains of the 117 Smith of the 18th Sains of the 180th gravely of the 67th but Lauren of the 51st others a bill relating to dating violence protection protected orders House bill 1453 by reps of two per the 43rd gravely of the 67th 518th smyrie of the 135th hatchet of the 150th another's a bill relating to offenses against public health and morals House bill 1454 by reps of Evans of the 83rd Park of the 101st Smith of the 41st Couch of the 50th all over the 82nd others a bill relating to general jurisdiction powers and duties of the Public Service Commission House bill 1455 by representative Hitchens of the 161st Petry of the 166th Stevens of the 164th Mallow the 163rd and Gillier to the 162nd a bill relating to Georgia Port's authority House bill 1456 by reps of Shannon of the 84th Holly of the 111th Quint of the 89th camp of the 58th Scott of the 76th and others a bill relating to establishment of the Georgia Emergency Communications Authority House bill 1457 by reps of Friday the 118th Evans of the 57th Alexander the 66th McClaren of the 51st Limit the 99th and others a bill relating to labor and industrial relations House bill 1458 by reps of Friday the 118th Scott field of the 60th Nelson of the 125th Alexander the 66th Limit the 99th and others a bill relating to fair housing House bill 1459 by reps of Dunhu the 30th bar of the 130rd level to the 33rd Hockins of the 27th singleton of the 71st and others a bill relating to revenue and taxation House bill 1460 by reps of Gunther of the 8th the Green of the 151st Buckner of the 137th Anderson of the 10th Powell of the 32nd and others a bill relating to registration operation sale of watercraft House bill 1461 by reps of Anderson of the 10th Jones of the 47th Hockins of the 27th Taylor of the 173rd Thomas of the 21st and others a bill relating to annexation of territory House bill 1463 by reps of the 151st Hopson of the 153rd and Deeps of the 154th a bill to authorize the governing authority of Dordy County to levy and excise tax House bill 1465 by reps of Campbell of the 111st a bill to a minnext providing the election of members of the Board of Education of Mitchell County House bill 1466 by reps of Green of the 151st Hopson of the 150th Dukes of the 154th a bill to authorize the magistrate Court of Dordy County to impose and collect county law library fees House bill 1468 by reps of Benson of the 31st a bill to amend and act in corporate in the town of Pindergrass House bill 1469 by reps of Benson of the 31st a bill to amend and act providing a new charter for the city of Jefferson House bill 1470 by reps of the 7th of the bill to authorize the governing authority of Gilmer County to levy and excise tax House bill 1471 by reps of Irwin of the 28th a bill to amend and act to divide the county of Stevens into school districts House bill 1472 by reps of C-Ball of the 34th Satsula of 35th Carson of the 46 Airharder the 36th Parsons of the 44th and others a bill to amend and act providing any charter for the city of Kennesaw House resolution 841 by reps of housing of 170th resolution on the name of the life of Senator Robert Alvin Rowan dedicating a road in his memory House resolution 842 by reps of the control of the 22nd Williams of the 168th next to that 69th Mitchell of the 88th Clark of the 147th others resolution promotes in the amendment to the Constitution so as to restrict the ability of the general assembly to increase the salary of state senators and representatives House resolution 843 by reps of school feel the 60th park of 101st Davis of the 87th scott of the 76th Kendra to the 102nd resolution recognizing and committing the national HIV AIDS strategy for the United States House resolution 844 by resident on the hill of the 30th cally of the 16th bent into the 31st bird of the 20th control of the 22nd others resolution expressing condemnation of the Canadian Prime Minister Justin Trudeau House resolution 845 by representatives Taylor of the 173rd Sains of 180th Anderson of the 10th resolution proposing members of the Constitution so as to provide that you may members of county governing authorities elected from single member district shall represent no more than 50,000 residents Senate bill 397 by Senator Goodman of the 8th tepens of the 37th pane of the 54th sims of the 12th fret of the 33rd others the bill relating courts education fire protection safety motor vehicles and traffic penal institutions professions and businesses Senate bill 435 by Senator Harbin of the 16th Miller the 49th hatched the 50th Robertson of the 29th mollus of the 53rd others bill relating to education Senate bill 505 by Senator Robertson the 29th mollus of the 53rd albums of the 56th Miller the 49th Patrick of the 32nd available relating to basic training courses for communication officers definitions relative to emergency communications authority and director defined and training and instruction Senate bill 546 by Senator Duggan of the 30th brass of the 28th bill to amend and act relating to the board of education and the school superintendent of the Carroll County school district Senate bill 547 by Senator Duggan of the 30th and brass of the 28th to build to amend and act to continue the existence of the Carrollton independent school system Senate bill 548 by Senator Duggan of the 30th and brass of the 28th to build to authorize the city of Carrollton to exercise already developing other powers under the redevelopment powers law Senate bill 549 by Senator Duggan of the 30th and brass of the 28th to build to amend and act establishing a new charter for the city of Carrollton Senate resolution 477 by Senator Mollus of the 5th third Miller the 49th Robertson the 29th Harpson of the 15th Kennedy of the 18th and others resolution creating the joint Georgia music heritage study committee through 2nd readers you Reports of standing committees the clerk will read I'm John Takersley the 160th district chairman on committee and intergovernmental coordination locals submitted the following report I'm going to speak to your committee on intergovernmental coordination locals that on consideration following bills of the House and Senate has instructed me to report the same back to the House the following recommendations House Bill 1408 do pass House Bill 1411 do pass House Bill 1412 do pass House Bill 1445 do pass House Bill 1447 do pass Senate bill 466 do pass respectfully submitted reps them Chan Takersley the 160th district chairman Senate of abstraction of 104th district chairman on committee on judiciary submitted the following report to speak to your committee on judiciary's adding consideration following bills of the House instructing me to report the same back to the House the following recommendations House Bill 1383 do pass House Bill 1396 do pass respectfully submitted reps and administration 104th district chairman Representative John Corber the 174th district chairman on committee on motor vehicles submitted the following report to speak your committee on motor vehicles is added a consideration following bill of the House instructing me to report the same back to the House the following recommendation House Bill 202 do pass by committee substitute respectfully submitted represent John Corber the 174th district chairman representative Shaw Blackman the 146th district chairman on committee on ways and means submitted the following report to speak your committee on ways and means is added a consideration following resolution of the House instructing me to report the same back to the House the following recommendations House resolution 59040 pass by committee substitute respectfully submitted reps of Shaw Blackman and 146th district chairman that completes the reading of the report's standing committees finish all right we're going on now to the local calendar going on to the local calendar third reading and passage of uncontested local bills there is no objection we will vote on the local calendar as a whole with a recorded vote hearing none it is so ordered the clerk will read the local calendar House Bill 1408 members have green 150 first city of shelman House Bill 1411 by reps and abros 120th Putnam County House Bill 1412 by reps and abros 120th green county House Bill 1445 by reps and abros 120th green county House Bill 167th law and county House Bill 1447 by reps and abros 120th city of grove town Senate Bill 466 by senator Jones the 10th to cad county is there any objection to the previous question being ordered on the local calendar the chair here's none the previous question is ordered is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill the chair here's none the report of the committee has agreed to shall these bills now pass all those in favor of the passage of the bills on the local calendar will vote I those opposed no and the clerk will unlock the machines you have all members voted if so the clerk will lock the machines on the passage of the bills on the local calendar the eyes are 155 the nasors six these bills having received the requisite constitutional majority are therefore passed all right we're going on now to morning orders going on to morning orders chair will remind the members that at this time of the session the total a lot of time collectively for morning orders is 10 minutes we have more than 10 people who have signed up so one minute each chair recognizes representative Wilson for a morning order thank you mr. speaker colleagues we're still celebrating black history and today I rise to pay tribute to the tradition of academic excellence and our historically black colleges and universities Georgia has nearly a dozen HBCUs and at the risk of highlighting one over the other I will admit that my twin sister is a proud graduate of all many state university so I know representative Hobbson will join me in saying go golden rams but it's also appropriate that we take the take the time to honor our HBCUs who have faced incredible threats of violence recently in Georgia and throughout the country division and bigotry continue to sow seeds of hate of hate and violence against people of color and we cannot and we must not enable the deranged few to intimidate or harm our young people please join me in celebrating our HBCUs and encouraging our law enforcement community to redouble their efforts to end the bomb threats and bring those responsible to justice thank you you chair recognizes representative Hutchinson for a morning order one minute good morning colleagues happy modi grad day today i bring you jalea jichala and jenaia they are smart and social sisters well behaved and they make the grades in school they enjoy spending time with their friends and when not in school they like and listening to all kinds of music watching Disney shows in movies colleagues having to adopt a sibling group is incredibly difficult particularly one with special needs so i urge you to talk to anyone you can about the children available for adoption in Georgia thank you and i yield the well chair recognizes representative mitts for a morning order one minute each one minute each that means one minute representative thank you thank you uh yesterday i was on and away i was glad i was not called because last night at the black history celebration at city hall i ran into five or six individuals uh that i hadn't seen in a long long time the question for me is the question for me is the last day of negro history month and some 94 years ago Carter G. Woodson and others founded the association for the study of African-American life and that organization is very active even as today as a matter of fact i have recently joined that organization and one question that was asked of me last night said that's what are you up to now this is a person that i worked with on the martyre board some years ago and i told him about the bill that uh the comprehensive mental health bill that the speaker unveiled and he said he was very familiar with that bill as a matter of fact he read it and he said well what are you going to do about it i says very very simple oh i'm sorry i'm sorry i'm sorry we'll talk about this later you time has way way way way expired i'm sorry i'm sorry i'm sorry i'm sorry i'm sorry chair recognizes representative tyler Paul Smith for a morning order thank you miss speaker blazing gentlemen at this house i rise today with the heavy heart our community tragically lost a wonderful young lady miss relix grace price Sunday afternoon Our prayers and thoughts are with Rick, Whitney, Bill, Lisa, Ms. Raylux's family, friends, classmates, teachers, and all those whose lives were made for the better by this special young lady. Our community is a lesser place with the loss of Ms. Raylux. We thank all of those who are praying for this special family and we implore your continued prayers for them during this time. Ms. Matthew Chattrified, verse 4 tells us blessed are they that mourn for they shall be comforted. Please, John, may the moment of silence. Thank you, Ms. Speaker. Chair recognizes Representative Scott for a morning order. Thank you, Mr. Speaker. Today, I salute and honor all female veterans in District 76 and the State of Georgia. She is brave. She is brilliant. She is radiant and she is resilient. She is a mother, a daughter, a sister, a wife, a friend. She is a warrior. She is a woman warrior whose heart is strong and true. Having served her country selflessly for me and for you. She is a female veteran. So when you see one today, say thank you for your service. Staff Sergeant Sandra G. Scott and I yield the will. Chair recognizes Representative Allen for a morning order. Thank you, Mr. Speaker. I rise this morning to congratulate Raymond Goslow, who finished in second place for the Jeopardy National College Championship Finals representing Kinesa State. He won last Tuesday night, he won second place and walks away with over $100,000 in prize money. Now Raymond graduated from Kinesa State in December with a GIS degree and is currently working in the Cobb County Library System. He plans to graduate school, graduate and get his master's degree in library science and become a librarian. So as a fellow Kinesa State alum, I want to congratulate Mr. Gaslow on winning second place and representing Georgia Colleges, the only Georgia college represented in the finals of the Jeopardy National Competition. Thank you, Mr. Speaker. I yield the will. Chair recognizes Dean Smiley for a morning order. Good morning. On behalf of the Columbus delegation, Chairman Riches Smith, Representative David Buckner, Representative Carolyn Hughlin, Representative Van Smith, on behalf of the delegation, you have an umbrella on your desk and this is a gift from the greatest Columbus Chamber Commerce, the Columbus State University and the Muscogee County Columbus, Georgia delegation. This is then token to show our appreciation to each of you for your hard work and dedication to the State of Georgia. So we hope you will enjoy your umbrella and on behalf of the Columbus delegation, we thank you for your service to the citizens of the State of Georgia. Thank you very much, Mr. Speaker, and I yield the will. Chair recognizes Representative Hughlin for a morning order. Thank you, Mr. Speaker. Ladies and gentlemen of the House, yesterday was Alpha, Alpha Day at the State Capitol and one of our honorees was not able to be present. He was in Washington. So our Legislator of the Year for this year is State Representative Billy Mitchell. We want to congratulate him this morning. Thank you, Pigeon. Thank you, Pigeon. Better come before the red light come on. No, you don't get to say anything. Holy word after they can see it. Thank you. Thank you, Mr. Speaker. I don't get to say anything. Chair recognizes Representative Mitchell. You got about 35 seconds. All right, I can do this in 35 seconds. Thank you, Mr. Speaker. As I stand here today, our COVID protections in Georgia and the U.S. have changed fundamentally in the past week. I want you to look around you to the left and right and understand that all of your actions over the past two years have made this body and this community safer for your colleagues and their families. We need to continue to center community care in our responses. If you see someone taking more precautions than you are, it is unnecessary to question their reasons. If they want you to know, they'll tell you. And it might just bring you to tears. I recommend everyone be kind, be compassionate and be safe. Thank you, Mr. Speaker, and I yield the well. All right. We're going on now to the rules calendar. Moving on to the rules calendar. All members will take your seats and pay attention. We are going to be on a little bit of a tight schedule here this morning with our guests that's coming in shortly. The chair did want to, though, before we left morning orders, ask for your prayers for Representative Clint Crowe. Now, it's yesterday his mother was in very, very poor condition and she passed from this life yesterday afternoon. And so let's keep Clint and his family in our thoughts and prayers. Let's have a moment of silence. Thank you very much. We're on the rules calendar. The clerk will read House will 1292. House Bill 1292 by resident of Jasper, the 11th and others to be entitled to amend Title 20 of the fiscal year. The Georgia and Atlanta were laid in education. So as prohibits students who participate in 4-8 sponsored activities or programs from being counted as absent from school. This bill I'm referring to committee on education that committee recommends that this bill pass. Chair recognizes Chairman Jasper to present the bill. Thank you, Mr. Speaker. Members who present House Bill 1292. This bill is for our 4-8 students across the state of Georgia. It will allow for an excuse absence when the attendant out of school event is certified by the extension professional. Like all absences, they've got to make up their work and all that good stuff.\n\nIt allows the school system to treat it as an educational field trip. And just for a little bit of knowledge, 4-H program is sponsored by us, the General Assembly, through the funds that go to the University of Georgia and also local funds that are provided by the school systems. And you'll see 4-H programs in the fifth grade up in our public education system. Thank you, Mr. Speaker. There's any questions I'd be glad to answer them. You do have a question if you care to heal. Yes, sir. Chair recognizes I'm sure this is an equal protection question. The Chair of the House Appropriations Committee, Chairman England, do you write for a question? Thank you, Mr. Speaker. This is gentleman yield. Absolutely, sir. I'm looking at this and we're sitting over here talking about it and trying to understand why you're favoring 4-H and you're not including FFA. Green and white, blessed versus blue and gold, just wondering. Well thank you, Mr. Chairman. We love both. And fortunately, FFA is an integral part of school systems through their CTAE program. And this just helps 4-H really get on equal footing. Very good answer. Thank you. Thank you. Mr. Speaker, it's a great bill. Support the kids. I yield the will. Is there any objection to the previous question being ordered? The Chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair here is none. The report of the committee is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative Wilson rise? Parliamentary inquiry. Mr. Speaker, isn't it true if the members of this body want to show their support for Georgia 4-H? They would vote green for 4-H? Look at all that green, Mr. Speaker. A brilliant observation. I've been telling them that you were smarter than you looked and acted. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1292. The eyes are 162. The nasors zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1303. House Bill 1303, members of Dickey, the 140th and others to be entitled to amend part 3 of Article 6 of chapter 2, title 20. The official go to Georgia annotated relating an educational program. So it's to transition a pilot program for elementary agriculture education to an ongoing program. House Bill I refer to the committee on education. That committee recommends that this bill do pass. Chair recognizes Chairman Dickey to present the bill. Dr. Ms. Speaker, I bring you HB 1303, a small bill just asking to remove the pilot program wording so that elementary education can be a full time option for our elementary schools in 2019. We passed legislation to start a pilot program to be established in Georgia the first in the nation. And so our Department of Education, staff work with pilot schools to develop the curriculum. And we thought we were going to start with six schools. We started with 25. And all across our state and urban areas and metro areas and rural areas. Started with 7,000 students. We're up to 14,000 students. A great program that's been very well received. They are teaching these young people to stem classes through ag education. And we just got a great model in our high schools and middle schools with not only full education, but FFA as well. And just want to start those young people young with this type of education. And it's just one of the fastest growing areas in our elementary education. It's great for our young people to learn agriculture. I had mixed the daily needs and how they can produce their own food. And Mr. Speaker, if there's any questions, if not... I'll yield the oil. There is a question. The chair recognizes Representative Clark for a question. Thank you, Madam Speaker. Does the gentleman yield? I do. So I just want to clarify just to make sure I'm understanding this correctly. This bill does not now require that all elementary schools have agriculture education. It's just extending it for the schools that currently have a pilot. This is very optional for our local school systems. They supply the teachers and develop the implementation part of it. Our Department of Education, Ag Department developed the curriculum. So it's no requirement. It's totally up to local school systems how they implement it. Sometimes it's... Once a week, sometimes it's a two or three week program. Some of the very ways they teach this high education. Does the gentleman further yield? I do. I guess what I'm trying to ask is does every elementary school... Now that we've crossed out pilot, does every elementary school in Georgia need to have some type of agricultural education or is it specifically just schools that choose to have? This bill, if it passes, will make it an option for every elementary school in our state. An option, though, not over part. An option. All right. Thank you very much. Okay. With that, I'll leave the oil. The gentleman has yielded the well. The chair recognizes representative Dukes to speak to the bill. Thank you, Madam Speaker. It is not without hesitation or reservations that I come forth in support of this legislation. You know, you are what you eat. Your health is your wealth. It is imperative and certainly a good idea for us to get young people in our state engaged in understanding agriculture. There is so much that they can acquire just from the knowledge of being able to understand how the vegetables are grown, how fruit is grown, and I think in the long run. It is certainly going to be good for our state. I can remember growing up on a farm and not only growing up there, but understanding how food is produced. We continually keep gardens and if you ever want to eliminate a food desert, grow your own tomatoes. Thank you, Madam Speaker. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to show this bill now pass. All in favor of the passage of the bill will vote yes. All those opposed will vote no and the clerk will unlock the machine. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of the bill. The yes were 162. The nays were zero. The bill having received the requisite constitutional majority is therefore passed. The house will be at ease for about five minutes and the speaker encourages members to remain on the floor in the any room. Thank you.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you now coach smart is only a very tight schedule, but I told them I said, you know there's not maybe not many times during my career here as a speaker that I'll have the opportunity to introduce a coach of the long long introduction here. Not really. I'm going to show a little clock management here, Coach. I like that. I'm not going to hold you or the members of the body. First of all I want to say that everything I know about leadership, I have learned from Coach Smarts half-time lectures in the locker room at football games since he's been at Georgia. Some great learning there. But out of respect for his schedule I want to say thank you for taking time out of your incredibly busy schedule to visit with us here today. I want to say thank you for the amazing job that you have done in establishing the University of Georgia as one of the very very top programs this year the top program in the nation. And we're all bulldogs now. I'm looking to make sure. And I want to thank you the team and the staff for a magical 2021 season that was kept off by Georgia winning the national championship by defeating Nick Saban and Alabama. It's it's leads me to say it is great to be a Georgia bulldog today. Please welcome Coach Kirby Smart to the podium. Order order please order. I said that. You say order. That would you say come to order. Yeah. Yeah. Hit that gal right there. Sit right there. Hey. It's an honor to be here. It's a privilege to be here. I'm honored to be the University of Georgia head football coach. Great pleasure to be that. That's something I've always tried to want to do in my career and we've got an opportunity to do it at a great place. But you don't win championships without support and you don't win championships without team effort. And President Morehead Josh Brooks have been tremendous support for all our athletic programs. I've been to bring this support for myself and our program and the people in this room that support this great state attracts a lot of players from all over the country as well as our state. They want to come to the state of Georgia. That's usually a good sign of leadership. The leadership in this room has driven the state for a lot of years. We're trying to do a lot of the same things you're doing over at our place in Athens. And we don't get that without tremendous support. We started our workouts towards next year. That's why I don't always like events like this because I want to be focused on next year not last year. And if you sit too long that guy over there across the state line will catch up with you. So the idea is to stay ahead. And the big thing for us is looking forward to next year. And that's kind of where we're at. We had 6 a.m. workouts this morning and our guys are out there grinding as hard as they can. But we want to keep University of Georgia growing both academically, athletically and every facet. And we can't do it without the support of the people in this room. So thank you so much for being here and go dogs! The House will come back to order. Mr. Clark you want to ring the bell a time or two? Let's get some order back here. Back to work. Till Coach Smart comes back next year to celebrate the National Championship. Clerk will read the caption to House Bill 1302. House Bill 1302 by Rose. At the bottom of the 72nd and others to be titled an act to manage after 7, 4, 80, the Fisher go to Georgia. And it's a related income taxes. So it's a provider one time tax credit for individual tax barriers who file income tax returns for both 2020 and 2021. Taxable years is bill haven't referred to the committee on ways and means. That committee recommends that this bill do pass by committee substitute. Chair recognizes the governor's four-liter representative bonner to present the bill. Thank you Mr. Speaker. I appreciate the opportunity to celebrate two historic thanks today. Not only the National Championship from University of Georgia, but now an opportunity to give the tax payers their money back. Mr. Speaker today I rise to present House Bill 1302. A key priority in Governor Kimps legislative agenda this session. House Bill 1302 presents a unique opportunity for our general assembly to put $1.6 billion back in the pockets of hardworking Georgians. This bill allows qualified tax payers who filed an individual tax return in 2020 and 2021 to receive a refund when they file taxes this year. Single filers will receive $250. Head of household filers will receive $375. And married couples filing jointly will receive $500. Georgians with a tax liability less than the amount I just mentioned would receive a refund equal to their 2020 tax liability. This refund would also be subject to set off debt collections such as delinquent child support payments. Qualified tax payers did not need to take any additional action to receive this refund besides filing of their 2020 and 2021 returns. House Bill 1302 is a fulfillment of our belief that when government takes in more money than it needs surplus funds should be sent back to the tax payers. Ultimately it is our citizens not our government who move our state forward and know how to best spend their hard earned money. Governor Kimps decision to reopen our economy has already let us to record low unemployment and record high job creation numbers. This refund gives our state another opportunity to lead in the great recovery. With that Mr. Speaker I will yield for any questions and ask your favorable consideration for House Bill 1302. Do you yield for questions? I do. Chair recognizes representative McLauren to your right for a question. Thank you Mr. Speaker. It does gentleman you. I do. I think you will hear Democrats say a lot. We are not going to object to putting dollars in the pockets of working people because of some of the reasons you identified but you also said that when the state takes in more money than it needs that it is important to give it back. Would you agree after watching the budget hearings listening to agency after agency talk about how star of their budgets have been historically how difficult it is to have retention policies in place to keep people to prevent 90% turnover in some cases. Would you agree with me that currently our government does not have the money it needs to operate at a basic level and that this type of measure is giving away money that actually the government does need to function. I don't agree with the premise. I do believe that we go through a budgeting process and we have shown a very successful budgeting process over the years and I would also submit that government would spend every dollar that they take out of the taxpayers' hands. I think it's important that it opportunities that are available to us to return that money we do that. Well Jim and you'll for one final question. Yes thank you I appreciate that.\n\nI mean, I guess my question would be outside of election year politics and the idea that we want to look like we're making a big investment in the public, whether we are or we aren't. I mean, is the governor committed to looking seriously at retention issues and agency budgeting issues over the long term to study them so that we can be competitive with the private sector so that we don't have correctional officers, juvenile facilities leaving because the conditions are that bad. I mean, can we get the commitment from the governor to study this issue and make sure the government does have what it needs? I would suggest that the governor studies that each and every year and that's again, that's why we have a process. He hears from all the department heads. We as a legislator, legislator hear from all the department heads and we take their feedback and work with our partners in the Senate to create a budget that makes sense and I believe that's borne out over the last few years. Thank you, Mr. Speaker. Through that, Mr. Speaker, I will ask for your favorable consideration to return a historic amount to the taxpayers of Georgia. Gentlemen, as yielded the well, is there any objection to the previous question being ordered to chair here's none? The previous question is ordered. Is there any objection to adopting the Committee Substitute, the chair here's none, the Committee Substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here's none, the report of the committee. Is agreed to. Shall this bill now pass? All those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machine. What purpose does representative dry or rise? Parliamentary inquiry. State your inquiry. Mr. Speaker, I just want to clarify that this HV-1302 refunding money to taxpayers looks just like the Biden stimulus plan that was passed in March 2021. So I appreciate Governor Kent following that example of leadership. I want to show a great restraint here and say if the gentleman believes that to be true, it doesn't make it true. What purpose does chairman Houston rise? Parliamentary inquiry. Isn't it not true if these people who are talking about not the people of Georgia not needing extra money, apparently they haven't been to the grocery store or the gas tank and fill the car up? Isn't it not true? We've never seen inflation like this in 40 years and it's not our Governor's fault. He's trying to help the taxpayers of Georgia. Thank you. Okay. We keep this up. We're going to next go on to trying to solve the Russian Ukrainian war. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 1302. The eyes are 148. The days are 18. This bill having received the requisite constitutional majority is therefore passed. The clerk will read the caption to House Bill 389 was carried over from yesterday's calendar. House Bill 389 members, though Jones the 25th me title and act to amend chapter 8 of title 34 of the fiscal to Georgia and to interrelated employment security so as to change the definition of employment to include services before by an individual for wages. This bill I refer to the Committee on Industry and Labor that committee recommends a disbilled do pass by committee substitute. Chair recognizes Chairman Todd Jones to present the bill. Thank you, Mr. Speaker. Good afternoon, colleagues. Congratulations to the Georgia Bulldogs for those of you who are alums and fans. I say that as respectfully as I can. On HB 389, this is essentially if there was a title to a bill, it would be in my mind, it would be the small and medium-sized business bill. This is a worker classification bill providing for in section 1, I think a much more efficient way to be able to help our small and medium-sized businesses classify between the W2 and a 1099. Later on in section 1, we do have a carve out for the gig economy, primarily on the logistic side and the delivery side and the ride share side. Finally in section 1, what you'll see is we put at the very bottom of all the definitions, if you would read the entire statutes about eight pages long, we asked the department to look at all of the attributes in their totality as opposed to looking at one over the other. And then finally in section 2, one of the things that we consistently hear from our medium-sized businesses across the state is that there are no real penalties for someone who misclassifies, so we wanted to be able to provide the department with the ability to enact those penalties and of course give the department the leeway to be able to waive those penalties if they think that it was something that was done just strictly innocently or maybe it was just a first-time mistake with people who are putting together a business for the first time and we understand that they might be more focused on their core business versus what's happening in the back office. At that point, Mr. Speaker, that is the end of my presentation. I would ask for all of you to favorably consider what I call the small and medium-sized business classification bill. Do you yield for questions? I'll yield for a question. Chair recognizes representative Holly up in the gallery for a question. Thank you, Mr. Speaker. Does the gentleman yield? The gentleman? Yes, sir. Sorry, the gentleman, excuse me. It's mass, kind of funny. But do you agree that by passing this measure forward, this is going to make it so that Georgia can at least foster a better business climate to ensure that every business pays his fair share in our department of revenue gets its due money? Yes, representative Holly and I think we're here from further speakers on this bill. This absolutely creates a level playing field. That's what we want in the state. We want all of our small and medium-sized businesses to understand that we've created the floor of the Roman Coliseum, but we made it level. We didn't basically weigh it to either side, but thank you very much for the question. At this time, Mr. Speaker, I know there's other people who would like to speak on the bill. I yield the well. The gentleman has yielded the well, Chair, recognizes Chairman Petrie to speak to the bill. Thank you, Mr. Speaker. And ladies and gentlemen, the House, I rise the day to speak to this measure and speak in favor of this measure from the perspective of an entrepreneur and to my good friend, representative, really, back there. That's a businessman. But my friends, I have spent my entire lifetime as an entrepreneur. It's all I've ever done and I've had the opportunity from starting with myself as the only employee to being a very large employer. And I've had the opportunity to live the American dream, my friends. But my first view of entrepreneurship was through my grandfather, my granddaddy, J.L. Petrie, senior, who was the son of a sharecropper and who became a bricklayer. And in the 50s sometime, well before I was born, he started a little company called J.L. Petrie Masonry Company. And he had nine children. My daddy, the oldest of nine, seven boys, two girls, I was the oldest of the oldest and all of us learned how to lay brick. I worked with my grandfather through school and I spent a lot of time with him. And I remember how important it was that he was able to raise nine children. He never employed more than about eight or nine people. But he raised nine children with no help from anybody but his own labor, no support from government because he believed he had lived the American dream, my friends. And I remember my grandmother doing the books on the kitchen table. She did her payroll and she was meticulous. And she'd show up on Fridays to hand out those checks. This was ingrained in me as a young man in high school and college as I worked my way through school, laying brick. And it was powerful to me. Anyway, I went off down the road. Obviously, I didn't want to lay brick in 102 degree weather in August, rest of my life. I have been able to live the American dream. But I tell you all that to say this, my friends. Nobody has more respect for the opportunity and the beauty of free market capitalism to rise everyone up than I think myself and many of us in this room. But that whole story I tell you to say this. Nothing so distorts the beauty of free market capitalism than cheating. Nothing. And when we allow employers to misclassify workers, we corrupt the system. Employers that are misclassified workers cheat their employees. Yes. But they don't just cheat their employees. They cheat their competitors. They cheat their competitors. They put them at an unfair disadvantage. They also, as was said earlier, they cheat taxpayers and they cheat our state treasury. My friends, the opportunity that is created by free market capitalism in this country is so important that we have to make sure that it's fair and that it is on a level playing field. And that in my opinion is just what this bill is about is about protecting the integrity of the system to make sure that we keep a free market so that all of those different employers, all of those Georgians out there doing business have an opportunity to succeed on the merits. But what you have today are a lot of folks that are cheating. And that's not good for creating opportunity for our people. My friends, I strongly encourage you to support this bill and Mr. Speaker, I yield the well. Is there any objection to the previous question being ordered? The chair here is none. The previous question is ordered. Is there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair here is none. The report of the committee has agreed to shall this bill now pass all those in favor of the passage of the bill will vote aye. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machine on the passage of House Bill 389. The eyes are 162. The nays are six. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 961. Wrathff. Board Member Nogel. Republican in question. Board Member Nogel. The 25th law voted mode number 1. Prior to the breได of Board Member Nogel. to present the bill. Thank you, Mr. Speaker. Ladies and gentlemen of the House, I bring to you today House Bill 961. This bill was introduced in response to the Supreme Court of George's opinion in Austin and Bird versus Hatcher Management LLC, which was issued in August of 2021. So the law as interpreted had been for several years that if a defendant is sued in a case in a jury, a portions damages determines that the defendants maybe, or even a third party, are percentage-wise at fault, that the ultimate amount that's to be paid in the judgment is dependent upon that percentage. And the Supreme Court's interpretation of Georgia law has changed that where now if only one defendant is sued, that defendant shoulders 100% of the cost, even if they had only a smaller percent of their responsibility. So the example I've been given to folks is if I say I'm at a business owners store and I'm the victim of a crime, I'm robbed in the parking lot and I sue the business owner and a jury decides that the person who committed the crime against me is 95% at fault. But the business is only 5% at fault because maybe there was poor lighting, lack of security, things like that. That business, despite only being 5% responsible, has to pay 100% of the damages due to this interpretation. So we've negotiated a resolution to that issue. It's presented here. I want to thank all the parties who were involved in the negotiations, which really started back in November of last year. And we bring to you today a solution that to my knowledge has no opposition right now from anyone. There was a letter that was put out on the desk as well. I have a copy of it here, but it had approximately 55 different organizations, businesses, insurers, chambers of commerce that all express support for the legislation. And I'd ask for your favorable consideration at this time. Mr. Speaker, I'd be happy to answer any questions. You have no questions. I yield the well. Is there any objection to the previous question being ordered? The chair hears none. The previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee is agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye of those opposed to vote no, and the clerk will unlock the machines? What purpose does representative Rolinsky rise? Thank you, Speaker. I'd like to invoke the Chokis Rule. I'm sorry. Chokis Rule, please. Gentlemen, has that right? And the record will so reflect. Have all members voted? Have all members voted? If so, the clerk will lock the machine. The passage of House Bill 961, the eyes are 168th and the eyes are zero. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 974. House Bill 974, by members of the governor of the 19th and others to be entitled to amend chapter 2 of the title 44. The official bill to George Antony relating in recordation and registration of deeds and other instruments so as to require electric filing. The spill ever referred to the committee on judiciary, that committee recommends this bill do pass by committee substitute. Chair recognizes representative Gullet to present the bill. Thank you, Mr. Speaker. House Bill 974 requires that clerks accept e-filing of real estate documents. These are documents like deeds, mortgages, leans, maps, plats, things like that. It also creates a standardized page one that includes essential data needed for filing by the clerk. E-filing is more secure, more timely for both the filer and the clerk. It reduces rejected filings by alerting filers to common mistakes made and generally creates efficiencies in the clerk's office. This version of the bill also still allows walk-in filings that was an agreement and compromise in judiciary committee. And that's all this bill does, Mr. Speaker. I'm happy to answer any questions. You have no questions. I yield the bill. Thank you so much. Is there any objection to the previous question being ordered? The Chair hears none. The previous question is ordered. Is there any objection to adopting the committee substitute? The Chair hears none. The committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill? The Chair hears none. The report of the committee has agreed to. Shall this bill now pass all those in favor of the passage of the bill? Will vote aye. Those opposed to vote no and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 974, the eyes are 164. The nays are three. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1009. House Bill 1009, motion of Jones the 25th to be entitled to amend the 40th of the fiscal to Georgia and to add a related motor vehicles and traffic so it's authorized use of personal delivery devices to transport cargo within this state. This bill has been recommended to committee on motor vehicles that committee recommends that this bill do pass by committee substitute. Chair recognizes chairman Todd Jones to present the bill. Good afternoon again colleagues. This is an exciting bill. HB 1009. This effectively drives Georgia further into the 4th industrial revolution. This is an opportunity for us to take a leadership position in personal delivery devices also known as robots. This bill has been recommended to pass by committee on motor vehicles that committee can actively if you can imagine logistics companies, delivery companies using robots on our sidewalks, our bite pass being permitted to crosswalks etc. That's what this bill does. It also provides for operator in terms of who can operate how they can be operated has a minimum threshold in terms of insurance and then ultimately has several safety mechanisms built in including but not limiting to flashing lights, strobes, emitting sounds etc. I truly appreciate your favorable consideration of this bill. I think this allows us to really take a step forward in terms of what we're doing not just with robots but ultimately with autonomous vehicles and eventually drones and I would appreciate your favorable consideration. You got a number of questions a lot. Do you yield? Mr. Speaker due to the time I'm going to yield the well right now. Thank you so much. I'm going to yield it to well. Chair recognizes the minority leader to speak to the bill. Thank you Mr. Speaker. Before I get started first I want to say that I am a technology buff. I believe in automation and I think on the face of this bill it's a good bill up to a point. If you take a look at line 23 if you have in front of you the bill requires an unlatin weight of 500 pounds and I want you to move to line 95 of a speed no greater than 10 miles per hour when it's on a sidewalk so 500 pounds 10 miles an hour. The Newton's first law of motion a body at rest will remain at rest a body emotion will remain in motion unless it's act upon by an external force. So if I'm at rest I'm going to stay at rest if I'm in motion I'm going to stay in motion and less force pushes me up or slows me down 500 pounds at 10 miles per hour is equivalent to 50 pounds at 100 miles an hour. 50 pounds 100 miles an hour has the same force as 500 pounds at 10 miles an hour that's Newton's second law of motion. Imagine being on a small sidewalk and I know there's some provisions around how big a sidewalk could be but in many urban areas in many rural areas sometimes you don't have a sidewalk sometimes a sidewalk is not quite 48 inches on both sides it's small. And so I would like in this bill to what I would call the rich and the rest of us. If you live in a great neighborhood you have great sidewalks. This vehicle can go through to be just fine. Great communities even sidewalks no problem but if you live in some urban areas some rural areas it'd be pretty difficult to have this vehicle with the force of 50 pounds moving at 100 miles an hour. Moving at 100 miles an hour to get out of the way of that automated vehicles in this bill can go as fast as 20 miles per hour in a bike lane 10 miles per hour on sidewalks that's just too fast too fast. Georgia has the fifth most pedestrian fatalities in the nation despite having the eighth largest population as a matter of fact New York had less pedestrian fatalities than Georgia. Georgia is consistently ranked as having among the worst pedestrian infrastructure in the country and now we're going to introduce an object that has a force moving at 50 at 100 miles an hour or 50 pounds. Let me get into the infrastructure to the bill but I want you all to keep that tension in your mind. This bill will allow automated last mile delivery services using unmanned robotic vehicles traveling by sidewalk to deliver packages to individual customers. Further the bill preamps it preamps virtually any attempt at local governments by all county and municipal jurisdictions preventing local governments more familiar with their local infrastructure local control. Infrastructure capabilities and needs from providing any additional regulation of automated vehicles on their sidewalks. Now again automation not bad particularly in the logistics sector however our existing physical infrastructure sidewalks roads are not designed to integrate driverless personalized last last mile not last block not last three blocks last mile for many of Georgia residents. The pedestrian infrastructure is already worse for many folk in my community African American communities who themselves are more likely to be killed in pedestrian traffic accidents. The implementation of driverless vehicles on sidewalks is likely to impact pedestrians full stop. If you want to talk about jobs the last mile is when many folk you see your UPS driver your FedEx driver Amazon will come to your house deliver your package it will effectively eliminate some of the job market as this bill comes on again I believe in automation but we have to think about it holistically and I would I would offer I would posit to many of you that we start thinking about automation in this way as as the author the bill said. The fourth iteration of industrialization we should think about woven cities and not just piece milling it through and woven cities if you think about woven cities you can take a look at you all can Google it and take a look at Toyota they talk about woven cities a better way to deliver packages within this space. Automation needs to be integrated in a holistic matters what I just said but here's the thing where I think you could actually offer some substitutes and I would recommend that the author think about this require a permit for any company which seeks to use automated delivery permit. Limit the number permits an individual company may possess like gates at the airport how many you limit limit the number permits available in the state so as to prevent overcrowding a pedestrian infrastructure. Make sure these robots can only actually operate on six feet sidewalks and industrial areas and limit the speed limit the speed to three miles an hour if you want to sidewalk that lowers the force that can impact the public. I'm going to vote against this bill because I think it needs a little bit more work and I would encourage my neighbors and my friends to do the same thank you Mr. Speaker I yield a well. Gentlemen is yielded the well. Is there any objection to the previous question being ordered the chair here's none the previous question is ordered. Is there any objection to adopting the committee substitute the chair here's none the committee substitute is adopted. Is there any objection to agreeing to the report of the committee which was favorable to the passage of the bill. The chair here's none the report of the committee is agreed to shall this bill now pass all those in favor of the passage of the bill will vote I those opposed will vote no and the clerk will unlock the machines. What purpose does representative bonner rise. Parliamentary inquiry. Mr. Speaker is it not true that one of the beneficiaries of this bill is a company is a grocery store called nourish and bloom market located right outside of Trillis studios which is described as the first contactless grocery store to open in the south and the first black owned autonomous market of its kind in the world. If the gentleman so states it sounds like he knows where off he speaks. What purpose does chairman carpenter rise. Parliamentary inquiry. State your inquiry. Is it not true that every member of this house wants to eat hot food and if you lower that miles per hour down then I'm afraid your food will arrive cold. I don't think I'm going to try that one.\n\nWhat purpose does representative McLeod rise? Parliamentary inquiry. I'm concerned about the accident with this particular device and who is responsible for coverage and who buys this? Is it not true? If the lady so states, I'm sure she is concerned about those things. Let's do about one more and then we're going to move on. What purpose does chairman Corbett rise? Parliamentary inquiry. Is it not true that the author of the bill worked closely with ACCG and GMA? We sent this bill back to committee and they worked on all the issues that was objected to by the minority leader. And if you're looking section three that gives the local authorities the ability to enforce rules and regulations in reference to your concerns. Thank you. Gentlemen, so states have all members voted? Have all members voted? If so, the clerk will lock the machines. On the passage of House Bill 1009, the eyes are 112. The nays are 53. This bill having received the requisite constitutional majority is therefore passed. Clerk will read the caption to House Bill 1188. House Bill 1188. The representative from the 122nd to be entitled to amend the Code Section 1664. The official go to Georgia and intending relating the child molestation and aggravated child molestation. So it was provided that each act of child molestation shall be charged as a separate offense. This bill emreferred the committee on judiciary and on civil committee recommends that this bill do pass. Chair recognizes representative Lot to present the bill. Thank you, Mr. Speaker. Colleagues, I rise today to present House Bill 1188. It is unfortunate that we must address the issue of child pornography and child molestation at all. And yet because there are horrific people committing these heinous crimes, we must. HB1188 is a top priority for Governor Kim, as well as our GBI crimes against children unit. It is eight lines that clarify his language and code so that each child pornographic image or material, and each area of a child that is sexually touched during child molestation acts, will constitute separate offenses. Prior to 2018, this is how these cases had been charged. But in 2018, a Supreme Court judgment on a different matter decided that the word any currently in code would mean that no matter the number, only one charge would apply. That Supreme Court decision relating to the word any has since been applied to the way in which we charge those accused of child molestation and child pornography. No matter the number of images, one, ten thousand or more, or the number of body locations sexually molested or penetrated, only one charge could be applied with that new ruling. HB1188 clarifies language so that this newly created injustice to children is corrected. Without question, each body part or image will now be charged as a separate offense. There is no more heinous crime than those committed against children, and the victims of such horrific crimes are living a life sentence of trauma. Please support HB1188 so that our prosecutors and our judges may now appropriately apply justice for these victims. I yield for questions, Mr. Speaker. You do not have any questions. Thank you. We have another member that wished to be heard on the bill. The chair recognizes Representative McLauren to speak to the bill. Thank you, Mr. Speaker. I'll get the surprise out of the way and go ahead and say I'm voting for this bill. But I want to take the opportunity briefly, hopefully, to say that in this type of a conversation, there's only two options on the board, right? Green or red, yes or no? When you're in committee for a bill like this, the mood changes, right? It's not like other bills. You hear the way that people relate to these issues, people who have personal experience prosecuting these horrific cases. And there's a dimension to these cases where every person who touches the case, right, or is, you know, related to the case, prosecution, defense, witnesses, victims, everybody suffers trauma in cases like this. A question I asked in committee was, after hearing, you know, prosecutors speak to how traumatic these cases can be even just to look at, right? I mean, you have to imagine to prosecute these cases you have to look at some of the images or hear some of those stories. The question I had in committee is, what are we doing about the mental health of the people who are involved with this system? Because I know that if I had to participate in a case like this, I would not be well. And here's my concern, and this is really the reason I got up here today. Our criminal justice system or criminal legal system is what we do when we have no other options. It's what we do when every other intervention has failed, right? Social, economic, health. And in this type of case in particular, we have no human tools or resources that are adequate to deal with this type of a problem. And so this is one of the most, you know, on point cases in which the criminal legal system's response to something is just, we don't know what to do with this. We just need to throw this person who committed this crime over here and throw them away, essentially. Because what this bill does is it returns to the previous state of the law, but it makes these acts more punishable. It increases the exposure to a point where, you know, imagine 10,000 images or multiple touches, you could basically get a life sentence for somebody if the prosecution and the judge both want it. Right? It's a way of just saying, if you make this type of a mistake, you know, your life is over. And if we do that, if we make that decision, and I'm telling you, I'm joining you in voting yesterday on this, I just think it requires a certain amount of conscience to know that that's what we're doing because we don't have a better alternative in our minds. Right? And so I guess all I would ask the House to do in line with requests I've made before is, let's think about the complex dimensions of a problem like this. And let's start with the mental health of the professionals who do this work on the front lines every single day because here's my wager to you. I wager that if we had more than just six or eight or however many appointments that lawyers get for free with the bar to go see a mental health professional. If we had more than that, if we had actual systems in place to provide mental health support to all the professionals in the system, and the type of family services we need to prevent this type of thing from happening in the first place. If we did that, we would have more confidence, maybe not supreme confidence, but more confidence that when we drop the hammer at the end of it, that it's proportional to what happened. That we're not just saying we're throwing our hands up, we don't know what to do with this tragedy, and we're just sort of throwing the person responsible away entirely. Into broken prisons, into the whole system that I've come up here a few times to talk about. So, like I said, I'm going to vote green today, but it's very hard, I think, for us to engage with this, and we need to embrace that it's difficult and embrace that there's several steps we need to do before we get to this conversation so that we're not traumatizing professionals, victims, members of the public, more than life makes inevitable. And with that, I thank you, Mr. Speaker, and I yield the well. Gentlemen, as yielded the well, is there any objection to the previous question being ordered? The chair hears none, the previous question is ordered. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill? The chair hears none. The report of the committee has agreed to shall this bill now pass. All those in favor of the passage of the bill will vote aye. Those opposed will vote no, and the clerk will unlock the machines. Have all members voted? Have all members voted? If so, the clerk will lock the machines on the passage of House Bill 1188. The eyes are 163. The nays are zero. This bill having received the requisite constitutional majority is therefore passed. House Resolution 732 will be postponed until the next legislative day. House Bill 1194, out of respect to Representative Crow will be postponed until the next legislative day. Clerk will read the caption to a group of privileged resolutions. Honoring the life and memory of Charles Charlie Robert Criss. Honoring the life and memory of Larry F. Dillard and senior. Honoring the life and memory of Rudolph Bullard. Honoring the life and memory of Margaret Andrew F. Dillard. Honoring the life and memory of Margaret Andrew F. Dillard. in commending the knee summers congratulating commending Dr. Angela Williams for receiving the 2022 Yellow Rose NICC T Randall Service Leader Award, recognizing commending Norma Hayes for being the 2022 Kaweta Cittance of the Year and commending Dr. Josh Boyd, Newlands High Schools 2022 Music Educator of the Year and congratulating commending Morgan Jewelers and for other purposes that please the reading of the privilege resolutions. Is there any objection to adopting the privilege resolutions? The chair here is none and the resolutions are adopted. We're going on now to announcements. If you have signed up for an announcement, please make your way to the front so we can move through these. Chair recognizes Chairman Warkhizer for an announcement. Mr. In-Labor is going to meet tomorrow morning at 10 o'clock at CLOB 406, so 10 o'clock tomorrow morning. Thank you. Chair recognizes Representative Nelson for an announcement. Thank you, Mr. Speaker. The women's caucus will meet upon adjournment. You can pick up your lunch and room to 16. We have very important business to discuss and the mean will be conducted on Zoom. Thank you. Chair recognizes Chairman Todd Jones and Representative Kinnerd for an announcement. Thank you, Mr. Speaker. There will be a joint mental health caucus meeting tomorrow at noon in room. This has changed. But room 310, there will be a Zoom option. Thank you. Chair recognizes Chairman Tarvan for an announcement. Insurance subcommittee on property and casualty will meet in CLOB 606 at 1 o'clock. 606 at 1 o'clock. Chair recognizes Chairman Watson for an announcement. Thank you, Mr. Speaker. The caucus will meet tomorrow for lunch. Department of Ag, room 201. We've got Cornerstone and Augusta University. Thank you, Mr. Speaker. Chair recognizes Chairman Parsons for an announcement. Thank you, Speaker. Energy utilization telecommunications will meet today. 3 p.m. and room 403 upstairs. We have one bill. Should not be a long meeting. I know there's people who have DOT board elections this afternoon. I think starting about 3. We need you up there. If you can be there like 5 minutes early, I think we can get into the room and we can get out. But we do need to need you there for that 3 o'clock meeting 403 here in the capital. Thank you. Chairman, Chair recognizes Chairman Allen Powell for an announcement. Thank you, Mr. Speaker. The latest government serv on regulated industries will meet at 2 o'clock today. For those of you who have an interest in the medical cannabis bill, that's going to be taken up again today. We've thoroughly vetted that. But for a lot of value, continue to ask questions about the issues at hand. Feel free to come to that meeting or if you'll call Jan Brown in my office, she will be glad to give you the Zoom so you can listen to that testimony. Chair recognizes Chairman Rich for an announcement. The majority caucus will meet upon adjournment in room 403 and lunch will be served. Chair recognizes Chairman Hawkins for an announcement. Thank you, Mr. Speaker. Health human services will meet today at 2 o'clock in CLOB, 606 and budget fiscal fares. Oversight will meet tomorrow at 11 o'clock, 403 cap. Chair recognizes Representative Buckner for an announcement. Thank you, Mr. Speaker. Dr. Newton arranged for these to be put on our desk today. And it's important for you to know that this is a joint effort with Reach Out and Read and Georgia pediatricians, where children that go to the pediatrician are given age appropriate books because they know that that helps bring development in the first three years of life. So take this book and find a child and read it out loud to them today or tomorrow or sometime soon. Thank you, Mr. Speaker. Chair recognizes Representative Gullet for an announcement. Thank you, Mr. Speaker. Governor LaFaire's full committee will meet tomorrow at 2 o'clock in room 406 of CLOB. Thank you. Chair recognizes Chairman Taylor for an announcement. Thank you, Mr. Speaker. The Life and Health Subcommittee of the Insurance Committee will meet today at 1.30 in room 6.06. Thank you. Chair recognizes Representative Bentley for an announcement. Thank you, Mr. Speaker and colleagues. It's this time of the year again, where the Fort Valley State University has brought to the state capital, our annual goat milk soap. And we have new fragrances this year. We have seaside. Bamboo and mango goat milk soap for all of you in my blue bag back at my desk. So please come by and get some of the goat milk soap. So your skin will look just as pretty as mine. Thank you, Mr. Speaker. Chair recognizes Chairman Bershit for an announcement. He wants to get in his order for that soap. Thank you, Mr. Speaker. Is it possible that I can get Representative Bentley to do all of my announcements for me? Today I want to recognize the Georgia Railroad workers. Today is Georgia Railroad worker at the Capitol. And all that they do to serve a state of Georgia and working through the pandemic, I just want to send a shout out to them. Thank you, Mr. Speaker. Chair recognizes Chairman Dickie for an announcement. Thank you, Mr. Speaker. Tomorrow at 9 a.m. Agriculture and Consumer Affairs Committee meeting 4-6 CLOB. Thank you. Chair recognizes the majority leader of the House for an announcement. Thank you, Mr. Speaker. Members, very important events will occur today as we elect DOT board members for the first congressional district at 2 p.m. in the Senate Chamber and the third congressional district at 3 p.m. in the Senate Chamber. Those of you involved need to be there and vote because very important we elect the right folks DOT board. Thank you, Mr. Speaker. That completes our announcements. Chair recognizes the majority leader for a motion. Thank you, Mr. Speaker. Mr. Speaker, I move to this House stand adjourned until 10 a.m. Thursday March 3rd, 2022. The majority leader has moved that this House be adjourned until 10 a.m. Thursday. That's Thursday at March 3rd. All those in favor of the announcement will vote aye. Those opposed will vote no. The eyes seem to have it. This House will be adjourned until 10 a.m. Thursday March 3rd.",
  "updated_at": "2026-02-13T08:16:01.929996+00:00"
}