{
  "video_id": "F7OMFQTPTjI",
  "url": "https://youtu.be/F7OMFQTPTjI",
  "title": "Georgia House - Day 3 (2026-11-05)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 3,
  "video_date": "2026-11-05",
  "duration_minutes": 22,
  "summary": "Here is a summary of the Georgia House - Day 3 (2026-11-05) session:\n\n**Overview:** The session included routine procedural matters such as the opening prayer, Pledge of Allegiance, and committee report. No substantive legislation was discussed.\n\n**Notable Moments:**\n- Representative Betsy Holland introduced the guest chaplain, Reverend Katie Oman from Morningside Presbyterian Church. Reverend Oman delivered an inspirational message about the calling of elected officials and the need to stay focused amidst noise and distractions.\n\n**Attendance:** Quorum was present, with members reporting their attendance.\n\n**Adjournment:** The session adjourned, with the next scheduled session date not provided.",
  "transcript": "The hour for convening having arrived, all members will please take their seats.\nAll members of the House will please report to their seats, the clerk will ring the bell.\nOkay. We're about to have the morning roll call. All members present will please vote\ngreen to signify their presence in the chamber and the clerk will unlock the machines.\nHave all members voted?\nHave all members voted?\nIf so, the clerk will lock the machines.\nFor keepers who will please close the doors and keep them closed.\nWell good morning, happy Friday, happy brave parade day, a great day.\nWe will begin our day with Scripture reading and prayer by the chaplain after which we will\npledge allegiance to the flag of our country.\nOur chaplain this morning will be introduced by the lady from the 54th House District\nRepresentative Betsy Holland, Representative Holland.\nThank you, Mr. Speaker.\nI could not be more delighted today to bring my pastor, the Reverend Katie Omen, to speak\nwith you today.\nShe comes from my church Morningside Presbyterian, which is right down the road for any of you\nwho might like to join us while we're in session.\nI started attending that church in 2004\nand was drawn to it because of its commitment\nto welcome everyone and its commitment\nto service outside its four walls\nto do good in our community.\nI've served there as a deacon,\nas a Sunday school leader, as a volunteer.\nThe Reverend Katie Oman has not been there as long as I have.\nShe was called to our pulpit as the senior pastor\nand head of staff in March of 2020.\nYou heard that correctly?\nShe started with us in March of 2020,\nkicking off one of the first meetings\nin the Presbyteria to call a pastor\nthat had to be done over Zoom.\nShe faced the tremendous challenge\nof having to unite a congregation\nthat she could not meet with and person\nand preaching to a sanctuary where no one was in the pews.\nAnd I cannot say enough about the way\nthat she created genuine fellowship and community outreach\nand worship and pastoral care during an unprecedented time.\nIn our congregation, the greatest thing to come out of 2020\nwith Pastor Katie.\nShe's a graduate of Duke University\nand graduated seminary at our own Columbia Seminary here\nin Georgia.\nOne of the greatest things about being back in church in person\nis getting to know her husband,\nWait, who's a pediatric oncologist at Children's Healthcare\nand getting to see her two small children Molly and Jack\nrunning around the playground.\nI hope you'll join me in welcoming\nour Pastor Katie today.\nThank you, Mr. Speaker, thank you, Representative Holland.\nIt is an honor to be with you this morning and to pray blessing upon your work, because\nthe work that you do here is holy work.\nI invite you to hear these words of scripture from Paul's letter to the Ephesians the\nfourth chapter, a passage that we use at Morningside Presbyterian to begin everyone of our\nleadership meetings as a session.\nI therefore, prisoner of the Lord, beg you to lead a life worthy of the calling to which\nyou have been called, with all humility and gentleness, with patience, bearing with one\nanother in love, making every effort to maintain the unity of the spirit in the bond of peace.\nYou know, as a Presbyterian, I am reminded that one of my denominations founding theologians,\nJohn Calvin, believed that the work of civil servants, civil magistrates, as he called them\nin the 15th century, was among the highest callings by God, even above preachers like\nmyself much to our chagrin.\nThe calling was of the highest authority because you are entrusted with the well-being\nof society, with the peace and prosperity of those under your care.\nCalvin believed that both the work of religious leaders and of civil leaders was work ordained\nby God, and in that way elected leaders like yourselves and faith leaders of all religious\ntraditions like myself enter into our work with a sense of calling.\nMy suspicion is that each of you, if you thought back to the first election, the first time\nthat you ran for office, that there was something about you that was called to make your\ncommunity and your state a better place.\nWhether that calling came from within or from concerns you saw within the community or\nfrom God, God's self, I have to believe that there was something in you that ignited\ncall to lead. So now think about where that call began and where you are today to\ncontinue to follow that call requires that you are able to hear. The Dutch\nCatholic theologian Henry Nguyen once commented that there is just so much\nnoise in the world. Emails and tweets and town halls and message boards and\nvoicemails, so much noise that our lives have become in his words absurd. Because in the word absurd\nis the Latin word certis, which means death. With so much noise we become unable to hear what it is\nthat we are called to do. To filter out all of the noise back to that central purpose. On the other\nhand now and says the word obedient comes from the Latin word\nadirae which means to listen. He says therefore a spiritual life is a\npilgrimage from absurdity to obedience, from deafness to listening.\nSo as those entrusted with the best interest of Georgians, perhaps\nyou're calling in the work that you do here is to filter out the\nnoise even down to the crowds cheering for the World Series Champion\nbraves outside and to listen to one another to your heart and to God as you\nin Paul's words lead a life worthy of the calling to which you have been\ncalled. I thank you for your leadership and for the call placed on each of\nyour life and invite you to stand that we might join in prayer.\nSo let us pray.\nHoly God, we begin our days aware of blessings beyond our control.\nThe beauty of a new day as the sun rises each morning.\nThe possibility for community and connection.\nThe capacity for meaningful work and love of neighbor\nour very breath for these things we are grateful.\nWe also begin each day aware of the possibility\nto make your world a better place.\nWe give thanks for the call placed upon each of these leaders\nto guide the state toward a place of flourishing for all.\nGrant them listening ears to one another\nand to those they are called to serve.\nBless them with discerning minds and understanding hearts\ninstill in them both the patience and the imagination necessary to work toward a\nsense of beloved community for all entrusted to their care. As these leaders go\nabout their work let the aisle be something that they traverse rather than a\nline of division unite their goals and hopes around the betterment of all\nGeorgians. Help us to see that there is more that unites us than divides us so\nthat we might set aside animosity and work together with hope.\nWe pray blessing upon Georgia and all who live and labor within its bounds, fill the land\nwith peace as its leaders work toward justice, inspire neighborliness and a sense of responsibility\nto one another.\nWatch over the least of these whom you have called your children.\nopportunities for growth not just economically but in our spirits, that kindness, compassion,\nmercy and joy might define this state's character. And then above all grant us a sense of humility\nthat all we are able to do is but a slice of a greater story that ends in Shalom, your abiding\npeace. And it's in your many names that we pray. Amen.\nI pledge allegiance to the flag of the United States of America\nand to the Republic for which it stands when nation under God\nindivisible with liberty and justice for all.\nYou\nThe chair recognizes Chairman Hogan, the chair of the Committee on Information and Audits.\nThank you, Mr. Speaker.\nYour Committee on Information and Audits has read the journal of a previous legislative day and found it to be correct.\nAnd it was only about six pages in it, but it didn't take long.\nAnd furthermore, Mr. Speaker, when government is big enough to give you everything you\nwant, it's big enough to take everything you have, Thomas Jefferson.\nOf course, now, Representative Williams would probably take a long time reading those six\npages.\nIs there any objection to the confirmation of the journal?\nChair here is none, and the journal is confirmed.\nThe clerk will read the resolution establishing the order of business for the day.\nMr. Burns, on the 59th, the following will be established as the order of business that\nare first part of the period unanimous concerns, introduction of bills and resolutions, first\nreading and reference of house bills and resolutions, second reading of bills and resolutions,\nmorning orders.\nIs there any objection to the adoption of the resolution establishing the order of business\nfor the day?\nThe chair here is not in the resolution is adopted.\nFirst reading of bills and resolutions, the clerk will read.\nHouse Bill 6EX by Reps and have lumped into the 12th of Bill being taught on act to create\nthe Shatuga County Public Facilities Authority.\nIntergovernmental Coordination.\nResolution 3X, 3EX by reps at a bottom, the 72nd, a lot of the 120 second will\nRicky the 169th, a resolution ratifying Governor Brian Peacamp's executive\norders. Ways and means. That completes first readers. Second reading of bills and\nresolutions the clerk will read. House Bill 3EX by reps at watching the 170\nThe second in Taylor of the 173rd, the bill to provide a new charter for the City of Coolidge,\nHouse Bill 4EX, by rep to the Beverly of the 143rd, Mitchell of the 88th.\nHewglie of the 136th, Alexander of the 66th, Smirie of the 135th,\nthe bill to provide for the composition and number of state house districts.\nHouse Bill 5EX, by rep to the Beverly of the 143rd, Mitchell of the 88th.\nHewglie of the 136th, Alexander of the 66th, Smirie of the 135th.\nA bill to provide for the composition and number of congressional districts, through second readers.\nThe report's of standing committees, the clerk will read, there are none, we're going\non now to morning orders.\nGoing on to morning orders, Chair is going to allocate three minutes each for the morning\norders to recognize his representative, Ken Trail, for a morning order.\nThank you, Mr. Speaker.\nColleagues, over the last couple of weeks, I've had a lot of communication with constituents,\nonline in-person, text, phone calls.\nWhat do you guess they wanted to talk about?\nseries? Nope. Build back better? No. Ed's lost in Cherokee County? No. Reapportionment? No.\nThey wanted to know if they were going to have to change their clocks this weekend. That's\nwhat they want to talk about. Do we have to change our clocks this weekend? And unfortunately,\nThe answer is yes.\nI want to encourage each of you to go online.\nSenator Patty Murray from Washington\ngave an impassioned speech on the Senate floor yesterday\ntrying to get our senators to get off their rear ends\nand support a bipartisan bill in the Senate\nwhich would accomplish the end of time change.\nThere's also a bipartisan bill in the House\nwhich would accomplish the same thing.\nWhen we passed this bill out of this chamber\nAnd out of the other chamber and the governor signed it,\nwe let them know what we wanted.\nAnd that was bipartisan in both chambers.\nSo I would encourage you to reach out to your congressmen.\nI reached out to all of our delegation and our senators.\nAnd three of our congressmen have co-sponsored the legislation.\nBut I would encourage Senator Ossoff and Senator Warnock\nto join in and co-sponsored the legislation the Senate.\nPlease reach out to your congressmen and encourage\nthem to do the same thing on the house side. Next week we'll begin what I call the double\ndark commute. Many Georgians will get up in the dark, they'll leave home in the dark,\nand they'll come home from work in the dark, and people are tired of it. It's an antiquated\nsystem, we need to fix it, so I encourage you to get involved. Thank you.\nrecognizes Representative Cannon for a morning order.\nThank you, Mr. Speaker. Good morning, members.\nI rise today to remind everyone that we are currently celebrating\nNative American Heritage Month.\nAnd today of all days we celebrate the 34,000 Native Americans\nwho are living in the state of Georgia and many of them\nwho have escaped the state of Georgia,\nwe celebrate you, and we thank you for your resilience.\nThe clerk will read the caption to a group of privileged resolutions.\nrecognizing and commanding Doug Payne and for other purposes that completes the reading\nof Provincial Resolutions.\nIs there any objection to adopting the privilege resolution?\nThe chair here is not in the resolution is adopted.\nWe have a few announcements, actually one announcement, chair recognizes, chairman Heath\nClark for an announcement.\nGood morning everybody.\nI just want to invite everybody, remind everybody of the Veterans Day celebration that's\nhappening Monday morning at 10 a.m. on the North Wing steps.\nThe Georgia Department of Veteran Services is hosting that and you're all invited to\nshow up on Monday to celebrate the men and women in our state that have faithfully served\nour country.\nThank you.\nYou\nThe chair has an announcement, if you're listening up, please.\nSome of you may have an interest in this.\nThe chair of the committee is away from the floor right now, but I wanted to remind all\nthe members of the House that the legislative and congressional reapportionment committee\nWe'll meet at 1 p.m. today.\n1 p.m.\nI'm not sure where the meeting is.\n406 C-L-O-B.\nAnd I understand it will be live streamed.\nAll right, we got some birthdays today.\nHave one today.\nTry to give him a present, and he won't take it.\nHelp me wish our Chairman James Bershet a happy birthday today.\nChairman Bershet.\nThen tomorrow, we have two birthdays tomorrow.\nRepresentative Mitchell Skoggins is having a birthday.\nChairman Karen Mathyack, having a birthday to borrow.\nThere being no other announcements or no other business to come before this house.\nChair recognizes the majority leader of the house for a motion.\nThank you, Mr. Speaker.\nJust to speak, I move to this House stand adjourned until 11 a.m., 11 a.m. Monday, November\nthe 8th, 2021.\nThe majority leader has moved that this House be adjourned until Monday, November 8th.\nAt 11 a.m., 11 a.m., all those in favor of the motion will say aye. Those opposed will\nsay no, the eyes have it and this house will be adjourned until Monday morning at 11 a.m.\n",
  "updated_at": "2026-02-12T12:54:14.632304+00:00"
}