{
  "video_id": "FA1m6V_r3K0",
  "url": "https://youtu.be/FA1m6V_r3K0?t=765",
  "title": "Georgia House - Day 36 (2026-03-28)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 36,
  "video_date": "2026-03-28",
  "duration_minutes": 61,
  "summary": "Here is a structured markdown summary of the Georgia House session transcript:\n\n## Overview\nThe session focused on passing a bill to add the word \"courage\" to the pledge of allegiance to the Georgia state flag, as well as a bill to provide relief for victims of human trafficking who were convicted of crimes as a result of being trafficked.\n\n## Key Actions\n**SB 152**: Adds the word \"courage\" to the pledge of allegiance to the Georgia state flag.  \n**SB 565**: Allows victims of human trafficking to petition to have their sentences vacated if the crimes were committed as a direct result of being trafficked.\n\n## Bills Introduced (First Reading)\nNone detected.\n\n## Notable Moments\n- Representative Gullett presented SB 152, arguing that the cardinal virtue of courage should be included in the state flag pledge alongside wisdom, justice, and moderation.\n- There was some discussion around whether adding \"courage\" to the pledge would require changes to the state seal, which the representative clarified would not be necessary.\n- The House voted to pass SB 152 by a vote of 125-23.\n- Representative Hagen presented SB 565, which aims to provide relief for victims of human trafficking who were convicted of crimes as a result of being trafficked.\n\n## Votes\n**SB 152**: Passed 125-23\n\n## Attendance\nNo quorum issues noted.\n\n## Adjournment\nThe session adjourned, with the next session date unspecified.",
  "transcript": "You\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nYou\nThis House will come back to order, House will come back to order, members will report\nback to the house chamber, clerk will ring the bell.\nClark agreed to caption to a group of privilege resolutions honoring the life and memory of\nof Scott Henry Wise.\nCommending Kristen Holloway,\nFannie County High School's 2022 star student,\nrecognizing commending Reverend Frank Edward Butch Jones\non the occasion of his 50th pastoral anniversary,\nrecognizing commending representative Calvin Smiery,\nrecognizing commending Oscar Hewlett-Owner's\noutstanding public services in environmentalists\nand baking in Jeff Davis counties,\nrecognizing and commending the Chad Lifsy Project.\nCommending the Vietnamese American Community\nof Georgia and recognizing March 15, 2022\nis Vietnamese American Community Day\nat the state capital, recognizing and commending\nmission agape.\nCongratulations on North Clayton Middle School Boys\nbasketball team from being named the Clayton County\nPublic Schools Championship for the 2021-2022 season.\nRecognizing October 15, 2022\nis White Kane Awareness Day,\nState Capital, commending Marsha Collins,\nLiberty Point Elementary 2021 teacher of the year,\nhonoring Oakhurst Elementary School,\ncongratulating Decatur High School's mock trial team\non winning the 2022 Georgia mock trial championship,\ncongratulating the Cedar Grove High School's football team\nfor winning the GHSA class triple A state football championship,\nCommanding Felicia M. Davis,\nrecognizing commanding Sarah Canyon\non her outstanding public services,\nan elementary principal and mentor coach\nfor the Clayton County School District,\nrecognizing and commanding Jamil,\nthe Kwan Burton, congratulating the Lumpkin County\nHigh School's ladies Indian basketball team\nfor winning the 2022 GHA Class 3A State Basketball Championship.\nchampionship and for other purposes that completes the reading of the privilege resolutions.\nIs there any objection to adopting the privilege resolutions the chair here's none in the resolutions are adopted?\nAll right, we're going back to the rules calendar\nGoing back to the rules calendar the clerk will read the caption to Senate bill 152\nSenate bill 152 by Senator Robertson the 29th to go to the 30th Miller the 49th Gucci the 51st Kennedy the 18th and others\nto be entitled an act to amend Article 1 of February 3 of Title 50 of the fiscal\nto Georgia and attend to ruling the state and other flags so as to add\nlanguage to the pledge of allegiance to the state flag this bill I refer to\nthe committee on governmental affairs that committee recommends that this bill\ndo pass. Chair recognizes representative Gullet to present the bill. Thank you\nMr. Speaker. On your desk, you'll see a handout that starts state seal. From my friend\nrepresenting Martin Mont de Han, this is not a coloring book. I know he wanted to color\non it. But this bill changes the pledge of the Georgia flag by adding one word. That\nword is courage. Socrates, the Greek philosopher sought to put into words what qualifies, what\nquality is the ideal state would possess. In Plato's work, Republic Socrates presented\nfour cardinal virtues that serve as a bedrock for a peaceful and flourishing\nstate. These four virtues are wisdom, justice, moderation, and courage. Now if you\nrecite to yourself the state pledge to the Georgia flag, you'll notice that\none of these cardinal virtues is missing. I know a number of you probably like\nme initially were like, I didn't even know we had a state pledge, but we do. It\ngoes, I pledge allegiance to the Georgia flag and their principles for which\nto stay in wisdom, justice, and moderation.\nNow back to those cardinal virtues.\nWisdom, justice, moderation, and courage.\nAs you notice, our pledge was misencouraged.\nI've lived in Georgia my entire life,\nand I can tell you that courage is not lacking in our state.\nThere's no better time than now, in fact,\nto acknowledge that courage.\nWhen you look at what our state's weathered the last two years,\nwhen you consider the current state of the world,\nthere couldn't be a more ideal time\nplace to ensure that value of courage is reaffirmed. So a common question that\ncomes up doesn't this mean we need to change the state seal? The short answer is\nno we do not. If you look at that handout I showed you earlier you'll see the\nthree pillars on the Georgia State Seal. These pillars represent the three of\nthe four cardinal virtues wisdom moderation and justice. However if you look at\nthe seal of fresh eyes you'll also see a soldier with his sword drawn ready to\nto protect the Constitution of Georgia.\nThis soldier represents courage.\nWith this symbol of courage already in place in our seal,\nadding the word to our state pledge will require no changes.\nThe cardinal virtues are incomplete without courage,\nand so is our state pledge to the Georgia flag.\nHappy to answer any questions.\nYou have a question, yes, a few questions if you care to yield.\nI'll take one and we'll go from there.\nHow about Chair recognizes the Dean of the House, Dean Smiley, to your left for a question?\nGentlemen, you'll.\nOf course.\nI listen to your explanation very carefully and I just want to make sure I'm understanding.\nYou're only doing it in the narrative aspect of it,\nbut not on the seal itself.\nI would, so that's true.\nI would say the seal is already there.\nIt's that soldier with the sword.\nSo there's no change of anything.\nThis is just to change the pledge.\nAnd I'm just telling you that the seal already has\ncourage on there by being that soldier with the sword.\nOh yeah, but it's not, the word courage is not the word.\nIt's not gonna be there.\nWe're not changing anything but the pledge.\nOkay, that's, that's what I was trying.\nThank you, sir.\nAll right.\nThank you, Mr. Speaker.\nI yield the well.\nThe gentleman has yielded the well, is there any objection to the previous question being\nordered?\nThe chair here is none.\nThe previous question is ordered, is there any objection to agreeing to the report of\nthe committee, which was favorable to the passage of the bill?\nThe chair here is none.\nThe report of the committee has agreed to shall this bill now pass all those in favor\nof the passage of the bill will vote aye.\nAs opposed to vote no and the clerk will unlock the machines.\nall members voted, have all members voted. If so, the clerk will lock the machines on\nthe passage of Senate Bill 152. The eyes are 125. The nays are 23. This bill having received\nthe requisite constitutional majority is therefore passed.\nClerk will read the caption to Senate Bill 565.\nSenate Bill 565, Senator Strickland of the 17th\ngroup, Patrick, the 32nd Jones, the 22nd and others,\nto be entitled to enact to amend Article 1 of Chapter 10\nof Title 17, the official code of Georgia annotated\nrelating the procedure for sentencing\nand imposition of punishment.\nso to provide that at any time after conviction\nfor a misdemeanor felony offense,\na defendant convicted of an offense and sentenced\nas a direct result of being a victim of trafficking\nfor labor or sexual servitude,\nmay petition the sentence in court to grant the relief.\nThis bill happened for a committee\non judiciary non-civil that committee\nrecommends that this bill do pass by committee substitute.\nChair recognizes representative Hagen to present the bill.\nMr. Speaker, good afternoon everybody.\nI hope you had a good lunch break.\nI'm bringing to you Senate Bill 565.\nThis was Chairman Brian Strickland's bill.\nThis bill is another good step in the work that's been done here at the Capitol to address the heinous human trafficking problem that plagues our state and our country.\ncentury. Currently Georgia code allows for vacating of sentences for victims of trafficking\nif they can show that the crime was committed as a direct result of being trafficked.\nThis bill makes two changes to the code. It eliminates the waiting period for applying\nto have the sentences vacated. Currently the waiting period is six months for misdemeanors\nand no earlier than one year following completion\nof sentences for felonies.\nThis bill would change that to say\nthat a victim may apply for make sure\nat any time following their conviction and sentence\ninstead of having to wait.\nAlso, this bill confirms where the money comes from\nif there are fines or fees that need to be reimbursed\nto the defendant if the sentences are vacated.\nIt the bill says the defendant will be reimbursed out of the Georgia crime victims emergency fund and that money will be replaced back into that fund by\nThe entity that originally received it from the defendant. So that is the bill mr. Speaker\nYou have a question if you care to yield.\nI will yield for one question.\nChair recognizes representative Lorichia to your ride for a question.\nThank you, Mr. Speakers.\nThe general lady you.\nI do yield.\nNow is this your first bill?\nI'm trying to remember if it is.\nThank you for pointing it out.\nWell, I just wanted to see if I could get people awake after lunch.\nBut is it not true that you might have an opportunity to invite your colleagues\nto the Vidalia Onion Festival?\nI believe that's April the 21st through the 24th.\nIt is there's the correct dates and I plan to do a morning order maybe later this week on that but I appreciate you pointing out because we do invite all of you to\nVidal year for the onion festival\nBut thank you mr. Speaker do ask for your favorable favorable consideration of this bill and I yield the well\nLady has yielded the well. Is there any objection?\nI've got another member that wished to be heard.\nChair recognizes Chairman Berschett to speak to the bill.\nThank you, Mr. Speaker.\nI should have waved, but because I know my colleague did a fantastic job of explaining this bill.\nBut this is just updating our statute\nto allow for quicker justice for people\nthat have been charged with a crime.\nWhile under the undue influence of human trafficking,\nI ask for your favorable consideration.\nCongratulations on your first bill.\nThank you, Mr. Speaker.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee?\nWhich was favorable to the passage of the bill.\nThe chair here is none.\nThe report of the committee is agreed to.\nShall this bill now pass?\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nhave all members voted, have all members voted, if so, the\nThe clerk will lock the machine on the passage of Senate Bill 565.\nThe eyes are 151.\nThe nays are zero.\nThis bill having received the requisite constitutional majority is there for a pass.\nYou think that's because you did a good job, right?\nNow they're just wanting you to bring some onions up here,\nit's, I can tell you what that's about.\nClerk will read the caption to Senate Bill 438.\nSenate Bill 438, the Senator Tipkins of the 37th,\nDugan of the 30th, Milo of the 49th,\nStrickland of the 17th and others,\nbeing taught an act to amend Article 2,\nChapter 10 and Title 13,\nthe official go to Georgia,\nannotated, relating the retention of contractual payments\ncreation of escrow counts on contracts for the installation improvement maintenance of repair of water or sewer facilities this bill I\nrefer to the committee on judiciary that committee recommends that this bill do pass. Chair recognizes Chairman Gunter to\npresent the bill. Thank you Mr. Speaker. Members of the House Senate Bill 438\nstate, adjust, retainage amounts in public works, construction contracts.\nIt brings George in line with our neighboring southern states.\nUnder current law, state and local government can keep 10% retained until the project is\n50% complete and then zero retains thereafter.\nThis law penalizes early construction providers who complete their work prior to the 50% completion.\nSo 438 has a flat 5% retaining threshold for all providers for the life of the project.\nAnd all the construction groups that are involved in this approve of this bill.\nAnd I'll yield for any questions.\nYou did not have any questions.\nThank you.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to agreeing to the report of the committee?\nwas favorable to the passage of the bill. The chair here is none the report of the committee has\nagreed to. Shall this bill now pass all those in favor of the passage of the bill will vote\naye. Those opposed vote no and the clerk will unlock the machines.\nAll members voted have all members voted if so the clerk will lock the machine on the\npassage of senate bill 438 the eyes are 151 the nasors zero this bill having received\nthe requisite constitutional majority is therefore passed.\nClerk will read the caption to Senate Bill 337.\nSenate Bill 337, I Senator Walker, the 20th,\ndue to the 51st of Patrick, the 32nd,\nand of Arte and 31st and others,\nwe entitle an act to amend chapter 5 of,\ntitle 45, the Episcopal to Georgia,\nand Tateau relating to the invocation of office,\nso it's required for the suspension of compensation\nfor certain public officers who are suspended\nbecause of indictment for felony.\nThis bill haven't referred to the committee on government affairs.\nThat committee recommends that this bill do pass\nby committee substitute.\nChair recognizes representative Gullet to present the bill.\nThank you, Mr. Speaker.\nBring to you guys Senate Bill 337.\nThis is a companion bill to the Senate resolution 134\nthat we passed last year and was signed by the governor.\nThis resolution will be on the ballot in November, so what this bill does is it addresses a problem\nI've seen back home in Paulin County and I'm sure many of you have seen in your hometowns as well\nIt will make it so when a local public official is indicted for felony by a grand jury\nAnd if subsequently suspended by the governor that their pay will be suspended as well\nIf they're reinstated to office, they are entitled to their back pay\nOkay. Mr. Speaker, this bill is simple, straight forward, happy to answer any questions.\nAnyone may have.\nYou have a question if you care to yield.\nI will yield.\nChair recognizes representative McCloud to your left for a question.\nThere's a gentleman yield.\nI do.\nOkay, so overall this bill is pretty good.\nWhat I'm concerned with is that if there is someone that's in the position or there was an election,\nAnd you've got somebody new and you're going to reinstate this person that if something\nwhen like was, they were wrongly accused, then you might have a situation where there's\ntwo people in the same position, is how is that going to be handled?\nYes.\nSo this bill actually doesn't affect the reinstatement piece.\nThis is only the compensation piece.\nAnd we clarified about reinstatement as far as the, if I was in office and I had a remainder\nor four months in my office or whatever,\nand I didn't run for re-election.\nSomeone else has now gotten that seat,\nand the charges took a year to adjudicate,\nand I was found innocent,\nand I would get back pay for those remaining four months\nthat I was gonna have been in office.\nSo it's not putting someone actually,\nit's not reinstatement from a standpoint\nof them back into office as far as this legislation\nis concerned, this is reinstatement\nfrom I would have served this amount of time,\nI get back pay for that.\nDoes it put someone back into office though?\nAnd this is strictly for payment, compensation is done.\nThat's correct, strictly for compensation.\nYou have no further, you do have another question.\nDo you yield?\nOh, you have one more, yes sir.\nSo you recognize this representative Bruce\nup in the gallery to your right.\nFrom the gentleman yield.\nI will.\nJust want clarification, this person is going to be punished\nbefore they've been convicted of anything.\nIs that what I'm hearing?\nWell, it's not punished.\nThey're suspended.\nThey're no longer in the office.\nAnd so a committee has got together\nrecommends to the governor that this person\ncan't do their fulfill their duties\nbecause of the felony indictment that they have.\nThe governor has then chosen, which is a remain,\nthe governor has then chosen to remove this person\nfrom office to spend them from office.\nAnd I think the reality is most of the time the person self suspends themselves because\nthey don't want that.\nAnd so they don't get paid during that time period that they're not able to serve.\nIf they get reinstated from a standpoint, the things gets adjudicated, they can get their\nback pay.\nBut I don't think it's a punishment.\nI think it's just a reality of where we are when it's happening.\nMr. Speaker, I appreciate the time.\nI hope you guys will support this measure and I yield the well.\nIs there any objection to the previous question being ordered?\nThe chair here is none.\nThe previous question is ordered.\nIs there any objection to adopting the committee substitute?\nThe chair here is none.\nThe committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to\nthe passage of the bill?\nThe chair here is none.\nReport of the committee has agreed to shall this bill now pass.\nAll those in favor of the passage of the bill will vote aye.\nThose opposed will vote no and the clerk will unlock the machines.\nIf all members voted, have all members voted, if so, the clerk will lock the machines on\nthe passage of Senate Bill 337.\nThe eyes are 149, the nays are four.\nThis bill having received the requisite constitutional majority is therefore passed.\nClerk will read the caption to Senate Bill 332.\nSenate Bill 332 by Senator Albers, the 56th, Dugan the 30th, Miller the 49th,\nGrapatric, the 32nd, and others being titled an act to amend chapter 1 and\ntitle 10 of the fiscal to Georgia and it ended relating to selling and other trade practices.\nto provide for certain disclosures by third party high volume sellers of consumer products.\nThis bill I'm referring to Committee on Judiciary, that committee recommends that this bill do pass by Committee Substitute.\nChair recognizes Chairman Houston Gaines to present the bill.\nThank you, Mr. Speaker.\nPlease to present Senate Bill 332 this afternoon in this state and across the country.\nYou've seen an issue with Organized Retail Crime, and this measure is designed to try\nto address that last year we had a measure in the General Assembly that did really important\nwork to make Organized Retail theft felony crime in this state.\nThis measure adds to that by making sure that our online marketplaces, a lot of times\nwhat will happen is, is Organized Retail Criminals will go in and steal a bunch of unused\nand new material from our retailers, and then they'll go and sell it online.\nSo what this measure does, it's a simple, good, pro-consumer measure that ensures that\nour online marketplaces are collecting information from the third-party reseller.\nSo if you go on Amazon, sometimes you're buying your product from Amazon, but sometimes\nyou're dealing with a third-party reseller.\nAnd what this bill does is it ensures that those that Amazon and other marketplaces are\ncollecting information from those resellers, those third-party resellers, additionally\nfor high volume resellers that requires that they also disclose certain\ninformation to consumers like an address and a way to get in contact with them\nif there's an issue with with with the purchase. Mr. Speaker that's what the\nmeasure does be happy to answer any questions if there are any. Do you yield\nfor questions? I will. Chair recognizes representative mom to hand to your\nride for a question. Does gentleman yield? I will. Isn't it true that this would\nonly capture the sale of new and unused goods.\nAnd this would not capture those craft, you know,\ncreators on Etsy and other websites like that.\nIt would only be new and unused goods.\nThat's correct.\nThank you.\nDo you further you?\nI'll yield for one more, Mr. Speaker.\nChair recognizes representative Rebecca Mitchell\nto your...\nFagley, right?\nOh, up to the gallery, yeah.\nThank you, Ellen.\nHi.\nMy question is actually follow up on the previous.\nEtsy sellers are often making new and unused products.\nAnd I know last year when we had this bill,\nwe got a tremendous amount of feedback from folks\nbecause 200 of a small item can be made by someone who's\nworking in their own home, supporting their home income.\nThose products are often new and unused.\nWill folks who are making small volume products\nto support a family, have to reveal their own home addresses.\nSo one on the home addresses, no.\nIf you only have a home address,\nthere is language in the build to address that.\nThat you would provide the city\nand there would need to be some contact information.\nAlso, you wouldn't have to provide your home phone number,\nfor example, with an email address\nand there's language in the build\nthat does address that concern.\nIf it is new and unused, it would apply.\nBut they do have to sell a certain amount.\nIt has to be a high volume reseller.\nSo I do feel like we've captured that issue so that you're not having to give your home address and those sort of things.\nThank you for the question. And Mr. Speaker, I will yield the well and ask for the body's favourable consideration on Senate Bill 332.\nIs there any objection to the previous question being ordered? The chair here is none. The previous question is ordered.\nIs there any objection to adopting the committee substitute? The chair here is none. The committee substitute is adopted.\nIs there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill?\nThe chair here is none. The report of the committee is agreed to.\nShall this bill now pass all those in favor of the passage of the bill or vote aye?\nThose opposed to vote no and the clerk will unlock the machines.\nis\na\nbeing fair, if we're going to complain about increasing penalties and sentences on the\none hand, it's important to applaud when the majority does something that's a common\nsense administrative response to crime that can limit the amount of crimes that exist\nwithout unduly expanding our criminal justice system.\nIs that not true, Mr. Speaker?\nI'm so not used to hearing you say nice things about the majority that I'm having to let it absorb\nWhat purpose does representative gravely rise\nProblem that you're inquiry state your inquiry. It's not true that that message was paid for and approved by McCorn for Senate\nThere have been a whole lot of those that have been, have all members voted, have all members\nvoted. If so, the clerk will lock the machines. On the passage of Senate Bill 332, the\neyes are 155. The nays are four. This bill having received the requisite constitutional\nmajority is therefore passed. I'm going to ask all members to take your seats. All members\ntake your seats. Chair recognizes\nRepresentative Wolenski for a special\norder. Thank you, Mr. Speaker. Hello\nrepresentatives. How did I end up here?\nIt was always funny to me when I was\nrunning for office. I had a whole\ngroup of don't any high schoolers ask me, you know, were you in young Democrats, you\nknow, what did you grow up doing? And I didn't even think about it till about 2010 or\n11, where I was invited down here by GTLA for lawyers of the day. So I don't know, I ended\nup here. But the last seven years have truly guided me to be here. 2015, 2016, I was\nat an anti-definition league, a jurisprudence lunch. And I'll never forget, I was waiting\nfor my car and I looked to my left and there was Governor Barnes and I said I may run one day.\nAnd then I'll never forget that the next year exact same location exact same spot waiting for my car\nI looked to my left and Governor Barnes was there again and that's crazy and I said Governor Barnes\nI'm actually thinking of running he said well come have lunch with me and I've had lunch with him\nseveral times a year and he for the since then and I've had such an\nopportunity by being in this house to meet with some the most brilliant minds\nand amazing people and after I met with Governor Barnes one thing that\nGovernor Barnes said that I always thought was pretty funny he says attorneys\nin general are crazy plane of attorneys who do injury roll for death work like\nus are crazy here even crazier but then to be a state representative on top\ntop, you are the craziest. I don't think he was talking about me, but maybe.\nBut after Governor Barnes, and I decided to run, what was even more amazing is a young\nman at Dunwoody High School, he had just started the Dunwoody High School young Democrats\nin the club. And he introduced me to all of them. And when we ran for office as a group,\nwe knocked on 53,000 doors, the same 13,000 doors, about four times. And it was that group\nstudents and all of the people in the 2018 election who knocked on doors during that time\nwho helped me change that seat, went from Republican to Democrat and that year in 2018,\n14 of us flipped seats and it's amazing honor to be a part of that class.\nSo I definitely want to thank all of the people who knocked on doors who supported me financially\nthat year I raised, we raised $262,000, knocked on 53,000 doors, and it was a lot of work.\nI started working in February, call time, 10 hours a week, and then to knock on doors.\nAnd that's something I'll really miss about the State's House is all the relationships\nform coming here every day and seeing y'all and just having fun conversations, horrible\nconversations, funny conversations, and that's the part that keeps us coming back.\nOne of the first notes I wrote when I was going to give this speech was that Sharon\nMen, Mary Margaret Oliver, didn't talk to me for the first year I was here.\nI may not be true, but since then, we have become amazing friends.\nShe is incredibly brilliant, wise, we love playing golf together and it's been an honor\nto be here with you and learn from you.\nI knew, second I'll say, Speaker Raustin, Speaker.\nIt's been an amazing honor.\nIf you've never heard Speaker tell a joke,\nhe is a very funny man and he's a great man.\nAnd the thing that's always I've noticed\nis he's the speaker of the house and I understand he is\nelected by one party and you never know\nthat may change at some point.\nBut the truth is that the speaker does represent all\nand I'm very grateful for his service\nand any speaker that comes.\nWell, I knew I was also very lucky in my first term\nat the Capitol when my mentor was representative Al Williams.\nHe was put to be my mentor.\nHe's not here right now.\nOne of the reasons I'm leaving, no, I'm just kidding.\nNo, but as y'all know, I'd love to spend more time with him\nthan I did, but you don't have to spend time\nfrom Rev. Owl Williams to learn too much\nbecause you hear about it on the house floor.\nHe's an expressive shot.\nHe's a boost of serotonin.\nWhen I'm getting down, you hear him speak\nand you feel better.\nAnd every time I had a conversation with him,\nit's such an amazing thing.\nDean Smirrey, it's been an honor to serve with you.\nI've learned so much from you.\nLearned how to be a great Democrat,\nhow to work with both sides.\nI loved telling you I was going to say something\nand you would say, don't say that.\nand I wouldn't, but it's been a true honor\nand having your friendship has been amazing.\nI wanna thank Spiro for all of his hard work, Betsy.\nI've made, well first of all, Spiro,\nI never know what he means\nbecause he's incredibly sarcastic towards me,\nbut he has been amazing help and works incredibly hard\nand he's one of the hardest working people\nwithout the capital.\nBetsy, I've noticed this year that whenever the speaker's\nup there, if y'all notice, I don't know if y'all notice,\nbut she does an amazing job,\nbut she is the captain of the ship.\nShe is leading, and it's amazing that,\neven when I texted her sometimes at 10.30\nto be like, hey, morning order, she's like,\nno, that's tomorrow in the morning,\nbut you always responded and you do an amazing job.\nShe's laughing, because yes, that happens.\nChairman Allen Powell, still, oh, he's here.\nAll right, two in one day, but Chairman Powell,\nSo I got to serve on regulated industries this year and I would spend time sitting in\nhis office and I would learn so much and, you know, about life, nobody at home is going\nto know why y'all are laughing.\nBut Dean Smirrey, you asked him a question and there's a couple of sentence answer and\nThose couple words are actually paragraphs\nwhen you think about it and go back and listen.\nChairman Allen Powell is amazing with speaking,\namazing with words.\nAnd I learned so much about so many things\nthat go on in Georgia.\nAnd I just wanted to thank him\nfor letting me be on regulated industries.\nAnd it's been amazing.\nMy first served here was leader Tramble.\nAnd that was an amazing experience.\nWe have leader Beverly.\nAnd after this term looking at leadership\nand seeing how much work is, I want to thank you all.\nI can't imagine why y'all do that on top of everything else.\nIt's just amazing, which I'll do.\nI want to thank the Cab Delegation Chairman Carla\nDrenner.\nThat's once again, amazing job, and it's\nbeen a joy of becoming your friend.\nIf you all want to learn politics, move to Cab\nand be in the Cab Delegation in 2018.\nI think it's the only time in Georgia history\nthat it was a head lot or in the newspaper\nwhere somebody called me representative chicken shoot.\nAnd that was my nickname for a while.\nThat was impressive stuff.\nBut the cab delegation was amazing lesson on politics,\namazing lesson on learning about people,\nhow to work with people, agree with people.\nAnd so I wrote down leadership isn't easy.\nAnd I see, I hope the power of love, the power to look out for people will overcome the love of power.\nAnd when I've been grateful for this opportunity and I've been able to work with both sides.\nAnd you know, I've learned I don't have to give up my values to work together.\nYou don't have to give up values to be kind.\nYou don't have to give up values to be respectful.\nLast week, there was one guy who comes down there a lot for one\norganization who isn't happy with Israel.\nBut he was waiting to speak at one of the committee hearings.\nAnd I go, what bill?\nAnd I said, I'm against that bill, too.\nAnd we both literally jumped high five to go, yes!\nAnd everybody turns it all away and goes, what's going on?\nBut it just showed that somebody who's been against what I've\nlooked at for three years, that moment we were together.\nAnd it was such a cool moment we were so excited.\nAnd I mean, just, that's what it's about.\nI say, you know, you have to know your enemy,\nbut what I learned here in the capital,\nonce you really get to know somebody,\neven when their views are painful, frustrating,\nor maybe just annoying, they are not your enemy.\nAnd that's the amazing thing down here.\nAnd I don't know if I learned that as an attorney,\nyou know, as an attorney, we go to deposition,\nwe go to trial, and you fight,\nbut then afterwards you'll go have lunch or have a drink,\nand you're able to do that.\nI'm getting through it, we're moving pretty fast.\nAnd so I wrote down here is just one thing I hope is everybody here will spend more time\ngetting to know each other, your families, your hobbies because I've gotten to know a lot\nof y'all and that's when good legislation happens is because y'all are working together\non things that are really important about families and all of that.\nTo my dinner crew, y'all know who you are, it's been a pleasure learning from all of\nall, a lot of y'all are my mentors and I really appreciate that. I had Circle here. Age is great,\nit's just inconvenient. I don't know, that was in there. I want to thank the photographers Ben\nand Katie. Smugmug will be smaller now that I'm gone, so that's cool. Let's see. And so one of the\nbiggest things that I think has changed is when I first came down here in 2011-12 is that it was\nalways said Georgia legislature is different than the federal government. It's\ndifferent that we work together we get things done and you know we're seeing a\nlittle change maybe it's due to the power whenever but that's changing slightly\nand just my hope as we go is that everybody starts working together and that\ndoesn't change that the parties don't come on the house floor more separate.\nThere's a song that said there's a battle line being drawn and nobody's right\nif everybody's wrong.\nAnd my view has always been that, you know, here,\nwe need to do legislation that does health care,\neducation, transportation, health small businesses,\nhelp the elderly, help the sick, help the needy\nand children, and I hope that continues,\nand I hope politics doesn't get in the way.\nAnd I became state rep after getting involved\nwith GTLA, and then being involved\nwith the Anti-Defamation League, their hate crimes bill.\nAnd through what I learned, the Anti-Defamation League,\nmainly the rise of anti-Semitism,\nI wanted to run for my children\nto make a difference for my children.\nAnd a mentor of mine at attorney say,\nwhen you have children, you know,\nyou're their parents for 18 years.\nAnd I came down here for them,\nand now I need to be there for them.\nI need to be with them and teach them\nall of the lessons I have learned.\nAnd decisions are really easy\nwhen you choose what's best for your children.\nAnd I wrote here, what I've learned also is you can't be mad at legislation.\nYou can be mad at legislation, but I've learned it's sometimes hard for me mad at the person carrying the bill.\nNow don't get me wrong, there are a few done here that make that easy.\nBut what I mean is I know them as a person.\nAnd while their view on one or more issues is different, I can't be mad at them because I know they're here for the same reason.\nI'm here, I believe the majority of us are all here for the same reason and I've seen\nthat and I've learned that no matter where you're from or what you're doing, you're here\nfor your family, for your children, for your friends, what you believe is right, to make\nlives better.\nAnd how can you be mad at a person who has the same motivations as you?\nI made a note here based on some things this year, if you read the books that everyone\nis reading, you can only think what everybody else is thinking.\nSo, you know, as a state, I hope we let people learn and learn different things so people\ncan learn to be different.\nYour beliefs don't make you a better person, how you treat others who are different than\nyou does.\nI wrote that.\nSo I'm almost done.\nSo anyways, I'm going to miss all my friends here.\nI'm going to miss the Apple Fritters in the anti-room.\nI won't gain 20 pounds next year, which will be good.\nI wanna thank GTLA who are always fighting\nfor the seven of the rights of trial\nand keep a good trial system.\nAnd it's amazing, they're supportive of me.\nAnd we only have 25 attorneys about in the state house\nso hopefully we'll pick up some more, that's vital.\nThink two things I'll miss is when you ask\nRepresentative Williams, how's your day going?\nHe'll say, best day of my life.\nIf you have Chairman Powell, how's your day going?\nHow are you doing?\nHe'll say, better than I deserve.\nI love both of those.\nI want to thank Rabbi Heller, Rabbi Sarnovitz,\nRabbi Zimmerman, Rabbi Spike for all that supported me\nto all the rabbis.\nI am definitely just a turtle on the ledge.\nAnd last couple of things is,\nthis has been an amazing experience for me.\nIt's, yeah, the attorney and politician\nsaying they're almost done, right?\nNah.\nBut I book ended my time.\nIt's been an amazing experience.\nMy first term down here session,\nI got to vote on the hate crimes bill.\nAnd we passed the anti-BDS bill.\nThis year, we have an anti-Semitism bill\ngoing through our really hope.\nAnd with last week, the formation of the Georgia Israel caucus,\nthat was a great book, and I hope you all will join.\nIn the four years I've been here.\nI feel like I've aged 20.\nIt's been rewarding, difficult, fun, frustrating,\nhappy, exciting, miserable, and some of the most\nthrilling years of my life.\nBut that's what it's all about.\nYou can't have the good without the bad, ups and downs.\nAnd I commend all of y'all who serve\nand have those extremes with me and we'll continue those.\nAnd during session, it could happen\n20 different times, 20 different ways.\nI am grateful for all of you, for your service,\nfor your willing to sacrifice and deal\nwith all of those up and downs.\nAnd thank you all for all you've done for me,\nwith me and for the state, and I yield the well.\nThank you.\nThank you.\nSo, we have no birthdays today, we do have some announcements, we do have some announcements\nThank you, Mr. Speaker, members, tomorrow morning at 7 o'clock in 133 will have our last fellowship meeting. So if you hadn't been all year, this is your last chance to come. Hope to see you in the morning.\nSo representative Wolinsky, you have an announcement?\nIt's a short announcement, just get.\nPlease I'll have the sign up for the Georgia Israel Legislative Caucus.\nPlease sign up.\nThank you.\nAnd all Williams got here just under the wire.\nChair recognizes representative Williams for an announcement.\nThank you, Ms. Speaker.\nTomorrow at about 12, I know we'll probably still be in,\nwith the Commanding General Force Stewart,\nthe Deputy Commandant, and Garrison Commander,\nand several representatives of force Stewart\nand the third ID will be on the second floor.\nLove for you to come by and say hello,\nand you'll do a press conference about 12, 15.\nThank you, Ms. Speaker.\nChair recognizes Chairman Setslor for an announcement.\nThe Sensor Subcommittee of Judiciary Non-Sovil will meet at 330 today.\nThe announcement was for three.\nWe'll actually meet at 330 today in room 403 to take up Senate Bill 10.\nChair recognizes representative Gamble for another announcement.\nHouse Economic Development and Tourism Committee will meet this afternoon at 3 o'clock in room 406, CLEOB.\nThat completes our announcements.\nThe chair recognizes the majority leader of the House for a motion.\nThank you, Mr. Speaker.\nMr. Speaker, I move to this House stand adjourned until 10 a.m. Tuesday, March the 29th, 2022.\nMajority leader has moved that this house be adjourned\nuntil Tuesday, March 29th at 10 a.m.\nAll those in favor of the motion will say aye.\nThose opposed will say no.\nThe eyes have it.\nThis house will be adjourned until Tuesday, March 29th at 10 a.m.\n",
  "updated_at": "2026-02-12T13:24:48.964534+00:00"
}