{
  "video_id": "fA7yjfdqNXg",
  "url": "https://www.youtube.com/watch?v=fA7yjfdqNXg",
  "title": "3/22/23 - Committee on State & Local Governmental Operations",
  "chamber": null,
  "session_type": "committee",
  "session_year": 2026,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 23,
  "summary": "Here is a summary of the Georgia 3/22/23 - Committee on State & Local Governmental Operations session:\n\n**Overview:** This session focused on HB374, a bill that addresses leaf blower regulations and consumer choice for gas appliances. The committee also discussed SB145, which deals with municipal annexation and de-annexation.\n\n**Key Actions:**\n- **HB374:** Substitute bill presented that addresses leaf blowers and consumer choice for gas appliances\n\n**Bills Introduced (First Reading):** None noted\n\n**Notable Moments:**\n- Discussion around the need to protect consumer choice and energy options, especially given high inflation\n- Debate around including a sunset provision in the bills, with the House previously voting to remove it\n- Negotiation between representatives and local government groups (GMA, ACCG) on annexation language for SB145\n\n**Votes:** \n- No recorded votes noted\n\n**Attendance:** Quorum present with 4 committee members\n\n**Adjournment:** No specific adjournment time noted, likely to reconvene at a later date.",
  "transcript": "You\nSenate, state and local government operations committee meeting, and we do have a\ncore, which is four members. So the first thing that we have on our agenda is a substitute\nto House Bill 374. We can probably arrange for you to have one.\nThere's a real big question, excuse me, representative Thomas, there's a real big question\nabout, you know, your leaf blowing in the things there, but we're talking about the rest\nof it.\nWe talked about leaf blowing already.\nI love what things people on the way.\nSo, is this mic on?\nSo I apparently am here to present LC-55-0091, a substitution for my bill HB-374.\nAnd it's a touch that actually addresses two issues.\nOne is the leafblower act.\nSo it sounds like you all have had those discussions.\nI, in my committee, government affairs this morning, I can tell you that I was a big proponent\nof this bill.\nI actually, I've sat on the study committee for electrification and transportation with\nyou, Mr. Chair, and you know, one of the things that I think was fundamental coming out\nof that committee is the belief that we should have good energy policy that's inclusive\nof all forms of energy.\nAnd we shouldn't discriminate against any one to particular form, be it gasoline or electric.\nSo that's why you and I worked hard in setting up the infrastructure to make sure that there's\nthings in place for consumer to make choices on electric vehicles.\nAnd I think this, the converse of that also has to be true, which is why I've been a big\nsupporter of this leaf blower bill and beyond that I see that in section two.\nWe have specific language regarding gas appliances.\nI think gas appliances are things that are necessary.\nThey're probably in, I would say, a majority of homes, some are electric, some have some\nelectric, some have some gas, or combination air of, or one or the other.\nBut I think at the end of the day, we need to make sure we're protecting the consumer.\nAnd both of all the language that's in this bill does that.\nSo at that time, or at this time, I'd be happy to accept any questions, having a couple\nmore comments, but I can do that after questions.\nAny question for representative Thomas Ones?\nSenator Estabelle, are you number five?\nNumber one.\nNumber one.\nOkay.\nThere's a weird place to put you.\nI don't think it's going to work, but we'll give it a try.\nI'm going to try four.\nTry that one.\nFour it is.\nThat changes its label.\nQuestion about the section two, I know we had discussed leaf blowers in the past.\nI don't think this was in any of the previous versions that I've gotten, no state, no governmental\nof the state shall adopt any policy that restricts or prohibits, and then it goes on.\nCan you talk more about the need for this, that restriction, on what governmental entities can restrict?\nWell, sometimes we partition separate layers of government, local government, state government, federal government,\ngovernment but at the end of the day it's still government you know to me I\nmight my people back home it's government is government okay and what we\nneed to do is we need to protect the people at home this is about consumer\nchoice and protecting the consumer and making sure they have energy choices\nthat are available to them that make good free market sense to let's just be\nhonest I mean we have huge inflation we've got I mean every our people are\ngetting beat up every which way.\nSo taking away any option or forcing them to go\nto an electric option that may be more expensive to them\nisn't the right.\nSo this just makes sure that we have consumer protections\nin place that people can pick what energy source is best\nfor them.\nAnd go ahead.\nSenator S. Mass, as you recall,\nyour correct section one was basically the leaf\nlittle bill we heard earlier.\nsection 2 has been added to this bill, which I believe was represented by Anderson's bill\nthat allows a consumer choice on types of fuel that they use for cooking or heating\nor whatever the case may be and we're just piling on as they say at what we do real well.\nI know this is your first year, but we do this very well in the last few days of session.\nI can attest that the last few days of session have been very exciting, it'll only get worse.\nDid that answer your question?\nThat did, that did.\nQuestion and I know that when this bill passed a Senate, it had a sunset 10 years, 12\nyears, ten years from now? Eight and a half years from now. I was wondering if we'd be open to that.\nThe I think Senator Steele has a little answer for you on that one. Thank you, Mr. Chairman,\nSenator Estevez. During the House presentation of SB 145 motion was made and accepted,\nnot at my urging, but they just felt that the free market would catch up to that, and they made the decision without consultation to do that.\nAnd so because the guest appliance bill did not have the language on the sunset clause, they wanted it to neither of them to have the sunset.\non set so they voted to remove it even though we had added it as an amendment on the Senate\nfloor the House Governmental Affairs Committee voted to remove that on both sections and so\nthis morning when we presented SB 145 to House Government Affairs they reinforced that.\nRepresentative Thomas, we're in a unique position right now.\nI'm going to reach out to my legislative council over here to give me a little guidance.\nIf we take action on this and move, do pass, and it passes to the, it gets reported back\nto the Secretary of the Senate.\nIf we wanted to do a substitute tomorrow on this bill, we would be not following proper\nprocedure to do that.\nwe can have a meeting tomorrow. And we're not positive whether we'll get the\nruling to have a committee meeting tomorrow. We're trying to make it a\nChristmas tree. I would expect as such, I don't know if you're in the\ngovernmental affairs over in the house, so I understand. And so that being the\ncase, we're at that point where a little divine intervention would be good to\nto know whether we think we can get another committee meeting tomorrow to brighten our\ntree. It is spring. Favorite time of year. Yeah. So we're on the right\nI don't want to hold this fine piece of legislation up on the fact that it may be a Christmas\ntree bill, so if your discretion said we can go one way or the other, but for me I think\nit'd be best for our committee to move it forward and then we can kind of well to come\nback. I'll have to present it on the House floor for a degree disagree. So if I may though\nI would, in government affairs for the, it's SB 145.\nWe kept the author's language in the bill.\nI have some language that's actually been approved\nby GMA and ACCG.\nWe come to an agreement with the annexation language.\nWe happy to take a look at it and see if we can.\nHave your book here, I think the test box of that.\nWhy don't we do that?\nWhy don't we allow our friends at ACCG and GMA\nto talk to you a little bit of language substitution here.\nI'll be over.\nYou might have to give him a give a chair.\nHow's the set?\nI can see.\nOkay, all right.\nWhat is he?\nAll right, all right.\nHave you seen this?\nYes.\nAre they okay?\nYes, sir.\nYes, are you Rushi if you\nRushi if you tell general counsel GMA. Yes, we worked with representative Thomas and the members of the House\ngovernmental affairs committee and leader of station on language for many many hours yesterday and\nHave come to agreement on\nI believe it's a ends at one two is that yeah, that's one to us. Yeah\nWhat we're looking at is an amendment that's amendment 47 0 0 5 9 and I'm going to read\nthe amendment for you.\nIt's to amend chapter 36, title 36 of the physical code of Georgia annotated, relating to municipal\nannexation of territory so as to provide for municipal de-annexation of property\nby application of 100% of property owners to provide procedures, conditions, and limitations\nto provide for admiral orm taxes so to prohibit de-annexations where there is\noutstanding municipal bond obligations to authorize municipalities to continue to provide services\nto de-annex property in certain circumstances. And basically this seems to be an agreed upon\non, I think ACCG, I could, it gets missed.\nThank you, Mr. Chairman.\nAgain, Todd Edwards with the Association,\nCounty Commissioners of Georgia,\nwe fully support the language in front of you.\nI appreciate your consideration.\nThank you.\nWe'll get a copy of this back to our committee members\nand we'll just add it to this language on this bill.\nAnd then, Dana, we'll have a vote on the bill\nas amended or by substitute.\nThank you, Mr. Chairman.\nyou'll hold standby for a few minutes.\nUnless you'll have some macabre's in your pocket.\nAlways, always have to wait on something.\nI noticed that spring was sprung yesterday,\nand you just got out today.\nYeah.\nIt just doesn't look good with my ties.\nSo you know, Representative Thomas\nas an engineer wearing that kind of clothing,\nI'm not sure that's, you know, I was going wild with stripes, I mean, you know, it was,\nit was, it was, the, uh, engineers were supposed to just wear plain jeans, so, I'm emulating\nmy, uh, hero in the house with Alan Powell supporting my, uh, he, he is my state rep and\nI'm fortunate to have him, so, uh, I see Miss Mitchell behind you from the city of Atlanta.\nI don't know if you're familiar with this amendment.\nThey hear that one of the things,\nwe wanted to make sure that this didn't put life back\ninto a bill that has failed already.\nSo the center estimates, you have a question.\nYeah, while we're waiting, can you speak\nto the genesis of this bill and the purpose behind it?\nOh, so that's this one, this is off.\nWhen you say this bill, I'm assuming,\nyou mean in totality or just my amendment section.\nOnly I have been blown away by the end of the year.\nI'm trying to have a little bit of humor.\nI'd like to understand the annotations.\nOK, so the deanxation piece has been a request\nof the board commissioners,\nor Cherokee County for at least 10 years.\nIt's been on legislative agenda.\nWe, I mean, I could start three years ago.\nI mean, this has been a process.\nBut three years ago, several of us set,\nwe had a house committee on annexation and cityhood.\nAnd during that process,\none of the things that came up continually\nwas about property rights.\nand better city services or city provides better services.\nBut to me, it was always about the property rights issue.\nI think that one of the things\nthat I actually I truly agree with the GMA on\nis the fact that if someone wants to be in a city,\nthey should be able to be allowed to be in a city.\nI don't think we should stop people.\nThis is so nuanced, it's hard to kind of get\nto where I'm going here.\nBut now, if that's true, I believe his, I believe in parody and processes.\nI believe that if one thing is good, then the converse should also be good.\nHowever, in effect, that doesn't always work out that way.\nSo, we started off with a 20-page bill that had had concerns,\nspecifically, but using the 60% method.\nSo our first negotiation was, you know, we got rid of the 60% method.\nAnd after that, we had, through our committee process,\nwe had I guess four hearings and committee in the house\nbefore it went to the house four,\nwhich obviously passed, I think it was 144 to,\nso many against, 20 something against.\nAnd through that process, we boiled that bill down\nto 100%, it's very limited to just a couple of parcels\nof time that it's allowed to do per application and there was some issues about which I think\nhas specifically been was brought up thanks to the city of Buckhead movement with regards\nto geobonds.\nSo being that that was one of the major sticking points originally what we wanted to do\nwas set up a special tax district that if people wanted to leave there would be a special\ntax district set up to pay for the geobonds out on the property. But then there was questions\nwith regards to requirement of having a result that we're not going to start.\nYeah, well, no, I'm doing really good here, man. Yeah, yeah. I've learned. I'm not a fast learner,\nbut if you give me enough time, I'll figure it out. So because of that, that called into question.\nWe said, okay, well, let's just take that off the table. So one of their final negotiations,\npart of what happened last night is we said okay if you have a Geobahn or Revenue\nBond such then we wouldn't you know what you would just be exempted and and that\nwas kind of where we got and I feel like that's probably the best language that\nwe're going to be able to put forward so at least at this time\nJust at the beginning of the end, okay.\nSo just to double check my understanding, the municipality would have to agree to the\nDiannexation.\nNo, that's not the way that this works.\nSo what it does is it sets up a third process for Diannexation, okay.\nSo everything else is the same.\nThe Diannexation process in and of itself, the city would still be the ultimate on the\nDiannexation, but they would be, I believe they would have to do it if it was approved\nthrough the county, okay?\nAnd go ahead Todd, you can tell you want to talk.\nUnder current law, if you're within a city, there's no process by which, if you want\nto Diannex, you have to have the city's permission.\nThis bill removes the unilateral veto authority of the city but puts in certain safeguards\nso the city can still object under what you'll see in front of you as health-safed\nyour welfare, which is relatively broad.\nSo if they can prove that it's not just a harm to welfare of the de-annexing parcels\nor to the city itself, I believe that language, then they could object to it.\nIt does, you know, again, when you want to annex into a city, the county can't say no.\nThere's a process and objection that's a little lengthy.\nBut this kind of mirrors the process of annexation, but goes to the annexation with certain provisions\nthat you've tried to reach where work out with you.\nAnd that's, I think that's the crux.\nThis bill is really tailored for somebody that's out on the periphery of a city.\nI mean, obviously you can't create an un-acorporated island.\nSo it's somebody that, a couple parcels on the edge of the city that maybe don't feel\nlike they're getting the city services that they want or for whatever reason they'd like\nto be the annexed out of the city.\nThis gives them an alternate application process and it's, if I can interrupt just a minute,\nI think Senator Steele has a motion that he wants to make.\nThank you, Mr. Chairman.\nconsideration to amend LC 550091S as follows with the substitute using the\nlanguage from AM470059. On line one where it says amend blank we will fill in\namend HB374. The LC will match to say 550091S by inserting the following\nCustomers following one on line eight on line eight of amendment 470059 line eight\nby inserting between line 63 and 64.\nOn line nine, fill in the blank, where it says section blank, write the number three.\nAdd all incorporated language and then on page four, line 78, the final line by renumbering\nsection three as section four. Just for clarification, that way we pick up all of this and then add it as fully\non embedded with HP 374 LC550091S. Make a motion to adopt those changes in the\nSherman. Is there a second? There's just motion in a second. The, uh, to amend the, uh, LC 550091S.\nAnd since we have great legal counsel here with us, I know you got all those numbers correct.\nAnd we can turn that back over to you. Uh, uh, uh, all in favor, please signal via by, uh, raising your hand.\nall opposed. Two to one in motion passes. One of the things that now will take up a motion\non the LC550091S as amended by substitute. So is there motion? There's a motion from\nSenator Steele, is there a second? Second from Senator Watson said that would be the\nSenator Watson from the 11th, the all in favor, please signify by raising your hand.\nTwo, four, any opposed?\nOne opposed?\nSaid the motion carries.\nSaid the thank you for your time and testimony and the meeting is adjourned.\nThank y'all.\nYou\nYou\n",
  "updated_at": "2026-02-12T03:16:27.677088+00:00"
}