{
  "video_id": "FAcaclIhUCA",
  "url": "https://www.youtube.com/watch?v=FAcaclIhUCA",
  "title": "Legislative Day 39 (Pt. 2)- 2023 Session - 3/27/23",
  "chamber": null,
  "session_type": "regular",
  "session_year": 2023,
  "day_number": 39,
  "video_date": null,
  "duration_minutes": 118,
  "summary": "Here is a structured markdown summary of the Georgia Legislative Day 39 (Pt. 2) - 2023 Session - 3/27/23 session:\n\n## Overview\nThe session focused on passing several bills, including measures related to absentee ballot applications, time off for early voting, additional judges for the Superior Courts, and restrictions on the use of certain social media platforms on state equipment.\n\n## Key Actions\n**HR 256**: Not discussed\n**SB 103**: Senate agreed to House substitute, adding more licensure requirements and a process for conflicting claims related to the Department of Revenue.\n**SB 129**: Senate agreed to House substitute, revising language on absentee ballot applications and providing for time off for employees to advance vote.\n**SB 66**: Senate agreed to House substitute, providing for an additional judge for the Superior Courts of the Atlantic Judicial Circuit.\n**SB 211**: Not discussed\n\n## Bills Introduced (First Reading)\nNo new bills were introduced.\n\n## Notable Moments\n- Senator from the 8th presented SB 103, noting it was a request from the Department of Revenue.\n- Senator from the 25th presented SB 129, describing it as a \"good housekeeping bill\" to provide time off for early voting.\n- Senator from the 4th presented SB 66, explaining the House changed the start date for the new judge position.\n- Senator from the 31st presented SB 93, referring to it as the \"TikTok bill\" to restrict use of certain social media platforms on state equipment.\n\n## Votes\n- SB 103 passed 43-4\n- SB 129 passed 46-3\n- SB 66 passed 53-0\n\n## Attendance\nThe Senate excused the Senators from the 12th and 22nd.\n\n## Adjournment\nThe session details do not include the time of adjournment or the date of the next session.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you I like to make a motion that we are Without objection, your motion passes, Senator. All right, we're going to do some special actions right now. Some greas and disagrees, and so Secretary is going to get those ready. And so just stand by. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you to roup for maintenance and retention of records to provide for administrative expenses. That completes the order, Mr. President. Just so everyone knows, all these amendments on these degrees and discrees are in your book under the table portion of your book. There are a lot of pages in there, Senator York, correct. I'll recognize Senator from the 8th to the measure. Thank you, Mr. President. You all may remember you voted on this bill previously. It passed out of the house. They made a few changes at the request of the Department of Revenue. All it does, it adds a few more licensure requirements. Adds a process for conflicting claims and standardized agreements with DOR. So nothing major, but something at the request of our friends at DOR. And I'll be glad to take any questions or I'll yield the will. You have no question, Senator. Thank you, Mr. President. I ask for your favorable consideration. The Senator from the 8th has moved that we agree to the House's substitute. Is there objection? No objection? Is there any other Senator to wish speak for against the measure? Hearing none, all those in favor of SB 103 will vote ye. All those opposed nay, Secretary Lantner's seen. All those opposed nay, Secretary Lantner's seen. All those opposed nay, Secretary Lantner's seen. All the houses substitute, the Senate Bill 103, the yeas are 43, the maids are 4, and this has passed. Senator from the 44th, what purpose do you rise? Thank you. Mr. President, I ask for unanimous consent to excuse the Senator from the 12th. Without objection, Senator from the 12th is excused. We're going to have the Senator from the 25th for emotional SB 129. Mr. President, I move that the Senate agree to the House's substitute to Senate Bill 129. Secretary, read the caption. Senate Bill 129, a bill to be entitled to enact to amend chapter 2 of Title 21 of the official code of Georgia annotated relating to primaries and elections generally. So as to revise the language that must be used on absentee ballot applications distributed by persons or entities to provide for time off for employees to amend chapter 2 of Title 21 of the official code of Georgia annotated relating to primaries and elections generally. So as to revise provisions related to performance review boards, to revise the language that must be used on absentee ballot applications distributed by persons or entities to provide for time off for employees to advance vote. That completes the order, Mr. President. We're going to have the Senator from the 25th to speak to the bill. Thank you, Mr. President. This is a good housekeeping bill. It just gives people time to take off during early voting to go vote. This is mutually agreeable between the employer and the employee and no questions I'll yield the well. This is one of those that want to keep up. These are the vote hard to cheat. I ask for your favorable consideration. You do have a question, but you welcome to yield the well at the same time. Senator, is yielded the well? Senator from the 4th, are you asking to speak or are you just preparing yourself for the next time up? We're not ready for that, Senator. I was just your light zone, so I was just making sure you're not asking a question. All right. He waves. Any other Senator wish to speak for against a measure? Is there objection to the House substitute to Senate bill 129? Hearing none. All those in favor of the House substitute to Senate bill 129 will vote yay. All those opposed nay. Six here on Launtomachine. Thank you. All in the motion, the yeas are 46 and the nays are three. And so this body has agreed to the House of Substitute on SB 129. I recognize the Senator from the 4th for motion. Mr. President, I move that the Senate agreed to House substitute to Senate bill 66. The Senator from the 4th has moved to agree to the House substitute on SB 66. Secretary, read the caption. Senate bill 66, a bill to be entitled to an act to amend Code Section 15-6-2 of the official code of Georgia annotated. Relating to the number of judges of Superior Courts, so as to provide for an additional judge of the Superior Courts of the Atlantic Judicial Circuit. That completes the ordinance. Sorry. The House offers the following substitute to Senate bill 66. A bill to be entitled to an act to amend Code Section 15-6-2 of the official code of Georgia annotated. Relating to the number of judges of Superior Courts, so as to provide for an additional judge of the Superior Courts of the Atlantic Judicial Circuit. To provide for the appointment of such an additional judge by the governor. To provide for the election of successors to the additional judge initially appointed. That completes the order, Mr. President. I recognize the Senator from the 4th to speak to the measure. Thank you, Mr. President. The only change that was made in this, when we passed this bill in this chamber was that the judges should be affected. We allow one and because the funding and timing we actually change the House change the date of January 1-24. And we agree with the change. Mr. President, no questions. I yield a will. You have no questions, Senator. Thank you, sir. Does any other Senator wish to speak for against the measure? Chair here, none. Is there objection to the House's substitute on Senate Bill 66? Chair here, none. All those in favor of the motion will vote yey, all opposed nay, Secretary-Anlant machine. You have no questions. Chair here, no questions. All in the passes are the motion. The yey is our 53 and the yey is our zero. And this motion has prevailed. Senator, Senator from the 41st, what purpose do you rise? Mr. President, I ask for unanimous consent to excuse the Senator from the 22nd. With the act of Jackson, Senator from the 22nd is excused. We're going to have the Senator from the 31st for motion. Thank you, Mr. President. I move that Senate agreed to the House's substitute to Senate Bill 93. Secretary, read the caption. Senate Bill 93, a bill to be entitled an act to amend chapter 29 of Title 50 with the official code of Georgia annotated. The House offers the following substitute to Senate Bill 93. A bill to be entitled an act to amend chapter 29 of Title 50 of the official code of Georgia annotated. Relating to information technology, so as to restrict the use of certain social media platforms on state equipment to provide for definitions to prohibit a state employee or student from installing, using or visiting a social media platform that is controlled or influenced by a foreign adversary on state equipment. That completes the order, Mr. President. I recognize the Senator from the 31st. Caucus leader. Thank you, Mr. President. Good afternoon. This one's real simple. Senate Bill 93, we pass out of this body. I believe unanimously the House made some minor changes with some semicolons and commas, just some grammatical stuff, no substantive changes. This is also known as the TikTok bill. And so hopefully we will see the federal government and other states follow Georgia's lead, just like Georgia keeps leading the country. With that, Mr. President, I'll yield the wealth. There's no questions. Mr. President. The Senate is adjourned. Does any Senator wish to speak for against the measure? Senator from the 26th. Senator from the 26th. You're asking to speak. You waive? No. Any other Senator wish to speak for against the measure? Chair here is none. Any Senator object to the position? Chair here is none. All those in favor of the motion, that the Senate agree to House substitute on Senate Bill 93 will vote, yay, all those opposed, nay, Secretary and Light and Machine. You You You You You You On the passes of the motion, yeas are 52, and the nays are zero, and this motion has prevailed. You You You You You You You I recognize the senator from the 4th. On 8th.\n\nHe'll have to move Senator. Yeah, Mr. President, I ask that HV538 be raised from the table. Senator has moved that HV538 be taken from the table. Is there objection? That objection? Secretary Reed the caption. Mr. President, I ask that you move that HV538 be taken from the table. Secretary Reed the caption. Secretary Reed the caption. Secretary Reed the caption. Secretary Reed the caption. House Bill 538. A bill to be entitled an act to amend chapter 2 of title 20 of the official code of Georgia annotated relating to elementary and secondary education. So as to provide for the Georgia Early Literacy Act to require the state board of education to approve high quality instructional materials to be used for teaching students in kindergarten through third grade to provide for definitions. The committee of the Senate on education and youth recommends that this bill do pass by substitute respects really submitted senator Dixon of the 45th chairman. The Senate committee on education and youth offers a following substitute to House Bill 538. A bill to be entitled an act to amend title 20 of the official code of Georgia annotated relating to education. So as to provide for the Georgia Early Literacy Act to require the department of early care and learning to provide for developmentally appropriate evidence based literary instruction training requirements for certain child care providers. That completes the order, Mr. President. I recognize the senator from the four speaks to the measure. Thank you, Mr. President. It is honored to be here today and this is the bill that we've been in the house working on real hard with the house. As you all know, we passed Senate bill 211 here a few weeks ago and I stated a few days ago, I think one of the key words coming out of this whole session for the House and Senate is literacy or more important ill literacy. So we weren't very close. We represented the way we represent Bauer, Representative Evans and the governor's office on this on on 538 House Bill 538 and also Senate bill 211. Now I'm very proud of our work and the sending efforts around literacy decision and we appreciate the bipartisan efforts and collaboration with the governor's office and the House. Today the House is taking up Senate bill 211 which we passed unanimously from this body. It forms the Georgia literacy council. This bill, 538 compliments Senate bill 211, working in partnership with their efforts. I'll bring before you the House bill 538 called the Georgia Early Literacy Act. This bill does, it defines educational literacy skills, high quality instruction manuals and the science reading as the evidence based practice is required for our students. This legislation also sets up the safety framework for implementation for the Department of Early Care and Learning, State Board of Education, Department of Education Professional Standards Commission and our local school systems. Section 2 in the bill refers to the decal requirements for implement an evidence based for the federal development for early learning required by teachers by July 1, 2025 and this bill has the civic dates in it. Starting on line 92, brief overview of the framework, State Board with Department of Education and Ghosts is a uniform, great appropriate metrics for measuring literacy. State Board will approve high quality instruction materials. State Board and Department will approve universal reading screeners to be used by schools by July 1, 2024. Department of Education working with the University of Assistant Georgia and the Professional Standards Commission will approve professional development programs for K-3-3 teachers. State Board will also provide technical assistance in implement training. If you will see on line 159, local board of education beginning of the 24 were used high quality instruction materials for K-3-3. You see this bill has a lot to do with K-3-3. Line 199 shall implement for public school system, tiered reading intervention plans for students K-3. Beginning July 1, 2025, Georgia assessment for certification of teachers or any other assessment required by professional standards commission shall be aligned with developmental approved evidence based literacy instruction. As you can tell, this legislation provides for the implementation of important evidence based practices and I appreciate how our Senate bill 211 set us up the Georgia Literacy Council to oversee and ensure that these policies are working. The Council will also make important recommendations for investments and funding needed to sustain these efforts. I am confident we are moving in a right duration needed so that all of our children will learn how to read. I'm happy to miss president. I'm happy to answer any questions. You do have some questions, Senator. Senator from the 42nd. Thank you, Mr. President. Will the Senate yield? Yes, ma'am. Thank you. Mr. Chairman, you may have mentioned this and if you did, I missed it so I apologize. Can you give me an update on the status of SB211 in the other chamber? Yes, ma'am. I understand SB211. Rips and Bellers in the back, I'll be here now and it should give me a nod. It has been passed in the house, correct? Yes, ma'am. Up today, she said. Up today is so bad. We certainly look forward to the house passing SB211. Don't we, Mr. Chairman? Yes, we sure do. Thank you, ma'am. Thank you for your work and thank you to the representative. Thank you so much, ma'am. You have no question, Senator. Thank you. Mr. President, I yield a will. We have a late coming amendment here. Secretary Reed, the caption. Senator Annabataart, the 31st, offers the following amendment. A men's Senate Education and Youth Committee substitute to House Bill 538 by replacing line 272 with the following. The Code Section 20-2-206 provided, however, that the Commission's standards and procedures consider for in-state certification nationally accredited teacher certification programs outside of this state, which are state-sponsored and meet the academic accreditation and certification requirements of the Commission and that completes the order, Mr. President. We're going to add a sooner from 31st to speak to the amendment. Thank you, Mr. President, and apologize for the last minute amendment. Basically, what this amendment does is simply requires consideration of any nationally accredited educator prep program in this state. It meets the Georgia Academic Operations Standards established by the PSC. We already went through the work that the senator from the fourth talked about this bill, but as we talked about workforce shortages and explaining the teacher pipeline, this amendment will add to that. Mr. President, I will yield a will. The senator is yielded. Does any of the senator to which speak for or against the measure? Chair, here's none. Is there objections to the previous question being ordered? Chair, here's none. The previous question is ordered. The question is the adoption of amendment one to the senator from the 31st. Is there objection to the adoption of amendment one? The objection, amendment one, is adopted. The question is on adoption of committee substitute, as amended, is there objection to the adoption of the committee? As amended, hearing none, the committee substitute is adopted. Is there objection to a green to the board of committee which is favorable to the passes of the bill? Chair here is none the board of committee is agreed to is there objection to the main question being ordered Chair here is none the main question is ordered the questions on the passes of the bill by substitute all those in favor of vote Yeah, pose nay secretary. I'm not the machine on the passage of the bill the a's are 48 and a's are one this bill having received the rest of the constitutional majority is therefore passed by substitute We're going to as a senator from the 27th for motion Mr. President I ask unanimous consent that House resolution 256 be lifted from the table The senators move the House resolution 256 be lifted from the table secretary read the caption House resolution 256 a resolution honoring the life of Miss Sophia Ruth Fisher and dedicating dedicating an interchange in her memory The committee of the Senate on transportation recommends that this resolution do pass by substitute Respectfully submitted senator doles all the 27th district chairman The Senate committee on transportation offers the following substitute to House resolution 256 a resolution dedicating certain portions of the state highway system and for other purposes Whereas Miss Sophia Ruth Fisher was born on May 11th 2000 and tipped in Georgia the fourth chart fourth child following three brothers that completes the order Mr President Reagan as a senator from the 27th speak to the measure Thank you mr President colleagues this is the annual road naming bill my understanding is we have a friendly amendment coming from the senator from the 44th as well Should be on your desk in a second. We will send this to the House. They have some additions. They'll come back We will agree I've dutifully studied all three hundred forty seven lines of this piece of legislation is fantastic legislation As for your favorable consideration of both this and the amendment. Thank you Senators yielded the well we do have an amendment and Secretary will read the amendment and hopefully I'll get around on your desk Senator Davenport of the 44th offers the following amendment Amend the Senate committee on transportation substitute to HR 256 by inserting between lines 289 and 290 the following Whereas Miss mini melton saksden was born in Atlanta, Georgia the youngest of 12 children to reverend and miss Aaron P Melton and Whereas a pioneer resident of the South Atlanta community miss saksden graduated from Clark College in 1905 where she also later taught and Whereas a woman of deep and abiding faith miss saksden was an active member of the South Atlanta United Methodist Church Representing the Church of New Maris Capacities at local and national conferences and whereas miss saksden's significant Organizational and leadership talents her remarkable patients and diplomacy and her keen sense of vision were great assets when she organized The first Rosenwald School for black children and spent 40 years ensuring quality education was provided And whereas it is abundantly fitting and proper that this remarkable and distinguished Georgian be recognized appropriately by dedicating a road in her memory That completes the order mr. President You Are we gonna as a senator from the 44th to speak to the amendment? You Thank you very much mr President and I offer amendment to to this bill Dedicating a portion of a street having 54 in the name of mr. mini melton Saksden and mr. Saxon was a 1905 graduate of Clark College She taught there and she also taught in one of the first schools of Rosenwald schools across the South in Jonesboro she was a Principle of the Jonesboro colored high school In the 1930s and forties and matter of fact my mother's 96 and she was my mother Principal before she went off the clock college so it all her accomplishments or fantastic and I think it's appropriate that we named this in her honor Thank you very much for president. I asked for your support senators in This amendment. Thank you Thank you senator senators yielded well. There's any other senator which speak for against a measure Chair hearing none is there objection to the previous question being ordered Chair hearing hearing none the previous question is ordered question is on amendment number one is there objection to Amendment number one authored by the senator from the 44th Without objection Amendment number one is adopted Question is on the adoption of the Committee substitute as amended. Is it is there objection to the adoption of the Committee substitute as amended hearing none the Committee substitute as amended as adopted Is there objection to agreeing to the Florida committee? Which is favorable to adoption of the resolution? Chair here is none. The Board of Committee is agreed to Is there objection to the main question be it ordered? Chair here is none and the main question is ordered Questions on the adoption of the resolution by substitute. All those in favor of the resolution will vote, yay, all opposed, nay, Secretary, and Lightning Machine. On the adoption of resolution by substitute, the a's are 50 and a's are zero. This resolution can receive direct-sit constitutional majority. Is therefore adopted by substitute. Recognize a senator from the 19th. Recognize senator from the 17th, excuse me. Mr. President, I move that House Bill 611 be lifted from the table. Senator has moved that House Bill 611 be taken from the table. Secretary, read the caption. House Bill 611, a bill to be entitled an act to amend part one of Article 4 of Chapter 12 of Title 45 of the official code of Georgia annotated. Relating to management of budgetary and financial affairs, so as to provide for the disposition of state funds derived from certain legal judgments or settlements. The committee of the Senate on appropriations recommends that this bill do pass by substitute, respectfully submitted, Senator Tillery of the 18th District Chairman. The Senate committee of appropriations offers the following substitute to House Bill 611. A bill to be entitled an act to amend part one of Article 4 of Chapter 12 of Title 45 of the official code of Georgia annotated. Relating to management of budgetary and financial affairs, so as to provide for the disposition of all funds paid to the state from legal settlements. To provide for limited matters, to provide for an effective date, to repeal conflicting laws. That completes the order, Mr. President. We're going to ask Senator from the 17th to speak to the measure. Thank you, Mr. President. Understand how you got me mixed up with the Senate from the 19th. This bill came from an appropriations committee, but it's actually a judiciary bill. I think it was sent to appropriations because the Senate from the 19th no longer serves on the judiciary committee. I wanted to get a couple legal bills in his committee this year. But all this bill is doing is it's being consistent in saying that any funds that are obtained by our state, through any legal settlements will all flow through this body, through the process and go through our budgeting process. Of course, subject to any terms of any orders or agreements that are made, but just make sure that money actually flows through us as a buy that designates funds. But that happens to me questions. Do you have a question, Senator? Senator from the 13th. Sir, do you? Yes, sir. Could you tell us why the Senate from the 19th is not on judiciary anymore? I'd rather not get into that from everybody, but thank you. Thank you. You have no more questions, Senator. Ask for your favorable consideration of House Bill 611. Does any other Senator wish to speak for against the measure? Chair, here's none. Is there objection for the previous question being ordered? Chair, here's none the previous question is ordered. Questions on the adoption of the committee substitute? Is there objection to the adoption of the committee substitute? Hearing none the committee substitute is adopted. Is there objection to agreed to afford a committee, which is favourable to the passers of the bill? Chair, here's none theʲ the Committee is agreed to. Is there objection to the male question being ordered? Chair, here's none the maintaining and question is ordered. Questions on the passes of the bill? MSF suit, all those who takes out their flag? you I On the pass of the bill the Yez are 51 the nays are one this bill having received the rest of the constitutes majorities therefore passed by substitute You All right we're gonna stay in a recess for about 30 minutes We're waiting on a few things that happened over across the hallway with our friends. So we're just going to stand and recess for about 30 minutes. And the senator from the eight says he's got some peach cobbler or something back there for you. So, all right. Stay at Stanities. Thank you. You You You You You",
  "updated_at": "2026-02-13T18:44:46.096916+00:00"
}