{
  "video_id": "FARBxIp2g0w",
  "url": "https://www.youtube.com/watch?v=FARBxIp2g0w",
  "title": "8/9/2023 - Senate Study Committee on Foster Care and Adoption",
  "chamber": "senate",
  "session_type": "committee",
  "session_year": 2023,
  "day_number": null,
  "video_date": null,
  "duration_minutes": 245,
  "summary": "Here is a summary of the Georgia Senate Study Committee on Foster Care and Adoption session on 8/9/2023:\n\n**Overview**\nThis session focused on providing baseline information about Georgia's foster care and adoption system. The committee heard from expert speakers and discussed potential areas for improvement.\n\n**Key Actions**\n- **HB 567**: No specific actions taken on this bill, but it was mentioned as relevant legislation.\n\n**Bills Introduced (First Reading)**\nNone mentioned.\n\n**Notable Moments**\n- Opening prayer by Senator Kirkpatrick \n- Remarks from Lt. Governor Burt Jones highlighting the importance of this initiative\n- Committee member introductions providing their backgrounds and expertise related to foster care\n\n**Votes**\nNo recorded votes.\n\n**Attendance**\nQuorum present, with two committee members absent.\n\n**Adjournment**\nThe session adjourned, with the committee chair, Senator Kirkpatrick, mentioning plans for future meetings on this topic.",
  "transcript": "you you you you you you you you you you you you you in the city of family. And before we start, I'd like to send to Robertson I'll pause for a quick second in case anybody's nervous about me pray and you'll have time to leave the room. All right, if you'll bow your heads, would me please dear Heavenly Father, we humbly approach you this morning Lord God is as your servants. We understand God that our mission on this planet Lord God is to take your word your message and move it forward Lord God not only with our words, but with our hearts and actions. I pray that you'll remind us of that as we move through this study committee here today and as those that lie ahead of us as we go through that every decision we make every discussion we have Lord God is with compassion and good intent Lord God and no other selfish reasons. Ask today that you bless us provide us with the wisdom that we need today Lord God to listen and understand I see things in the name of your son who you sacrifice for us our Lord and Savior Jesus Christ Amen. Thank you Senator. Okay, I'm Kay Kirkpatrick I'm the chairman of this study committee and the chairman of the children and families committee which is kind of where this came from and I represent Senate District 32 which is Cobb and Cherokee. And I want to thank the staff of the Senate offices that are here to support this meeting and also our speakers and all of you for participating a few housekeeping items this morning we have a full agenda of speakers today that will likely keep us here until between one and two o'clock. And for the committee and speakers there are box lunches that are in the mezzanine that are provided by unite us. But we're not going to take a lunch break because we've got too much to do today so grab your lunch when you need it and then bring it here and come back. The meeting is live streamed on the Senate webpage and is available archived for basically forever as far as I know for anyone who could not be here today and the committee members we're certainly hoping that you all will ask questions please keep them concise as much as you can and if someone has already asked your question you don't have to ask it again. The purpose of today's meeting is to provide baseline information for the committee about how our system currently works and to present some ideas from other states we're not going to have public testimony today but we will at future meetings if you have written comments for the committee you can send those to me. And at the end of today's session i'll talk about our future meeting schedule before we get to our introductions please watch this video from lieutenant governor bird Jones. Good morning. Hi this is bird Jones I want to thank everyone for being here today so it couldn't be there in person but I'm excited about this being our first official meeting for foster care and adoption is an initiative that I'm very passionate about is an initiative that we actually set up a brand new committee and I'm proud to have a meeting with you. I'm a new committee and I'm proud to handpicked Senator Kurt Patrick to lead that committee and lead this study effort as well she's doing an outstanding job there's a lot of work to do this subject matter in our state but I think we've put together a great team and we appreciate everybody's participation and the feedback and the people who are wanting to help with this effort so I think we'll do great work and we look forward to in January. In January adopting some of the initiatives that we put forward and it's all about trying to do a better job with our foster care system here in the state of Georgia and taking care of the ones that are most vulnerable with our children so I hope you have a great day and I look forward to seeing you on the future. Thank you very much lieutenant governor jones is very supportive of our efforts on foster care and adoption and in us Owens is here from his office if anybody needs to pass along any information. We have two members who cannot be here today and before we start introductions I told you who I am I were a tower to orthopedic surgeon so this was not really my area of expertise but it's rapidly becoming an area of expertise and it's not a good idea to be here. It's very complicated so there's a lot for all of us to learn we have two committee members who could not be here today senator Harold jones could not be with us and also mr bob brooder mats and he's president and CEO of faith bridge foster care which is the largest faith best. Private child placement agency in the state his wife's mother died last night so he's unable to be with us so please keep him in your prayers. So senators please share your district and your background and our other two non senate members please share your area of expertise and anything else you'd like to highlight for the committee and then we'll get started with our testimony center pain you want to start us off what you're mic for. Good morning my name is chup pain i've served as chairman of science technology in the senate but for that 30 years i worked in jumea court and the property of justice for 30 years of state jumea probation officer and had to deal many cases with with foster kids and the needs that and the problems we've have currently we still had back then so i look forward to what we can get done on this committee. Thank you dr. Constantine. Today i'm going to eat by i've got you turned on good. All right, my name is john constantino i am the chief of behavioral and mental health at children's health care of Atlanta and a professor of psychiatry behavioral sciences at emery my background is in child psychiatry and pediatrics i have a fair amount of experience over decades in my field of taking care kids and foster care but but my particular experience relates to. The experience relates to a program. In my earlier place at Washington University in st Louis. Of a program for the prevention of the recurrence of child abuse and neglect among young children placed in protective custody for a first time and that program has been very successful has been followed for 10 years and hundreds of families have been through it. And so I hope to bring to the table some of that experience and certainly to listen and learn and and and help with the committee and also to make sure that everybody recognizes that in the development of the behavior and mental health. Services at children's health care of Atlanta, which are on a very swift upward trajectory for the state. The needs of foster of children foster care, the mental health needs of children foster care and those at risk for foster care placement are among our highest priorities and so I hope to. Help bring those resources to the table and and whatever we can come up with those new things to do for this population of vulnerable children and families thanks. Thank you senator Jackson. Good morning, my name is senator Kim Jackson. I represent district 41, which is in stone mountain, Tucker Clarkson general that general area. I serve as a pastor for people who are experiencing homelessness and so I work firsthand with people who have come through the foster care system and who like we know land on the streets. I know that experience of serving and wishing that we can do something to create a stop gap so that that doesn't happen. And most recently my wife and I just welcomed a two year old into our home to keep them from being in the foster care system and so this issues and I was very personal to me as well. Thank you. This is Scott Park. She's my wonderful administrative assistant who is a law student. Sadly, she's going to be graduating soon. At least she hopes she is and so she'll be moving on to bigger and better things. Thank you for being with us today. Senator Robertson. Good morning. I'm Senator Randy Robertson. I currently serve as the majority whip in the Georgia State Senate. I spent 30 years as a law enforcement officer working in all aspects of law enforcement with a focus on drugs narcotics sex trafficking and violence against women and children. And what I what I know is what I've seen on the ground. I've seen the the monumental successes and the tragic failures of a foster care system. And also the bright and dark sides of adoption. So what I'm what I'm hoping to do sitting on the study committee is learned from those of you subject matter experts that show up to testify. And from my fellow members of this panel so that we can get as close to a correct system in the state of Georgia as we can. And so I'm going to be on one thing and that is the value of life for the children impacted by foster care and by adoption. Thank you. Senator Hatchett. I think my name is Bo Hatchett. I represent Senate district 50. I think I bring a unique perspective here growing up in a family that had to I had to adopted siblings my mom worked an adoption agency. And my dad was also OBGYN that delivered a lot of children that were placed in the foster care system. My wife's a juvenile attorney and I have four children of my own all girls, I'm completely outnumbered. The only time I'm in the majority is in the Senate. So this is a I'm also an attorney and really want to come in the chair chairperson and governor early tenant governor Jones and looking forward to the day. Thank you. Julie. Hi, my name is Julie wasotsky. I've been practicing law since 96 and focusing on adoption since 2010. I've been a lot of my practice involves foster care. I also do a speaker at foster parent associations and the AFPAC, which is the association of foster parents always get that wrong adopt them and foster parents association of Georgia. And so that's been very interesting to just see all aspects of the foster care system from beginning to end. I was a foster parent myself, I was effective kin placement for a child that we had for a couple of years. I got to see that side of it as well. And I see the issues with children who are waiting in care for a really long time. I see issues with. The post adoption is something that I would like to see us looking at post adoption support because a lot of times children are exhibiting behaviors that the family was not expecting to have to deal with and they feel lost, they feel ashamed to reach out for help. And sometimes when they reach out for help, it's not there. And so that is something that I see a lot that I think that hopefully I can bring their voices to the committee so we can discuss some of the issues associated with that. Thank you very much as you can see we've got a lot of expertise sitting up here and hopefully we can accomplish our mission. And so we know that our foster kids didn't ask to be in that situation and they need to go to the front of the line for all the services that we can provide. I will say one thing about meetings for anybody who's not going to be here at the end. We do plan to have four meetings. The second one will be here at the Capitol on September 26th. We have a lot of presentations and we're going to take public testimony from whoever wants to speak. We are going to ask for signups ahead of time, however, so that we can get our timing right. And the third meeting will be hosted by Senator Robertson in Columbus and will focus on adoption. And so the fourth meeting will be back at the Capitol and that will be a wrap up trying to be sure that we have all the information we need to formulate our recommendations, some of which may be legislative and some of which may not. So with that, let's get started. So we're going to follow the agenda and further committee members. You've got a lot of information and your folders. That can be your homework. If you don't have time to read it while the speakers are presenting today, but a lot of it does relate to the presentations that we're hearing today. So we're going to start with apartment human services. And if you want to come up, you want to come up. Okay, you want to be at the podium. That's great. Thank you so much. Commissioner Candace Brooks. And everyone hear me. Okay. Well, Madam Chair and members of the committee. Thank you for inviting the Department of Human Services, Division of Family and Children Services to present to you this morning. And for those I don't know. My name is Candace Brooks and I have served as defects director for two years and DHS commissioner for two years this September. Today there are 10,583 children in defects custody across the state through historic investments spearheaded by the governor, Lieutenant Governor speaker and the legislature. And we have a lot of things that we can do to ensure that we can safely eliminate administrative burdens. In recent years and with bipartisan support, we've changed state laws to ensure families are afforded every opportunity to safely remain together. And we've got to improve children's lives to streamline the process of adoption. To increase opportunities for those young adults who age out of care and need resources to live independently and so much more. And while we continue to battle the reality of outdated federal laws rules policies and processes in the child welfare world. And we confidently say on the state side, we are methodically addressing everything within our power to better serve Georgia's children and families. And as you know, the single issue nearest and nearest to my heart is ending hoteling in my home state. And we are laser focused on that objective. And I started this job. We were averaging 50 to 60 kids and hotels or offices on any given night in the state. Because we couldn't find a relative foster family group home or health care facility able to meet their needs. We deploy some new strategies. We secured new funding. Thank you for that. And drove that number down to reach an all time record low of less than 20 children and young adults hotel state wide last summer. But school went back into session and we've all been emerging from COVID. And for some reasons that we may never be able to discern our numbers started rising again and at the beginning of July, we had 95 children in hotels and offices. We hunkered down as the governor would say. And new state laws went into effect tonight. I particularly want to point out Senate bill 133. And we had a lot of time to get to the point where we were in the state of the state. And we were in the state of the state of the state which went live July 1st. So that last night we had seven kids in hotel stay wide. So we broke the all time record low again and we're on track to break it again tonight with five. And at this very moment all but one of those kids already have a placement secured. We're just in the process of transitioning them to that home. We're just in the process of helping them to have a lot of time to get to know what our community is going to do. So we're just going to have a time to see howling will remain and moving target. But we are so close to zero that defects is electric. We still have work to do and we know that you've got our back as we work together to improve Georgia's child welfare system. I'll touch on a few areas for you to keep in mind is this committee's work is fully underway. to put kids in our custody so they can access services, especially mental and behavioral health care, even when there's no true or traditional sense of what we consider abuse or neglect. We said we would look for ways to lend a hand, and I'm really excited to tell you that we're in the final stages of finalizing a deal with United us. I think they've got some of their representatives here to help defects in the courts, more easily pay our families with assistance, be it financial, educational, therapeutic, and more, and it'll make it much easier to navigate the often dizzying and underutilized array of services and treatment available to vulnerable families through state agency programs and community-based resources. That'll pile it in 58 counties across the state. We're certain once we get that off the ground that we're gonna see an immediate improvement where we can safely keep children home with their loved ones in the closed-loop referral system. And I must applaud Chairman Kirkpatrick and the governor's Office of Health Strategy and Coordination who've been invaluable partners as we've worked through this proposal. As the governor would say, again, we're gonna keep shopping and we're ready to pull up our sleeves and get to work with this committee. It's not lost on me that I'm using. I think maybe some bulldog references and I went to Georgia Tech. But we look forward to the recommendations that will develop through this body's efforts because we know it'll directly and positively impact countless lives in the state. So thank you for your time and support. And unless you have any questions, I'll go ahead and bring up Samantha Walker who will present on behalf of de-facts regarding family preservation and family support services. Don't sit down yet, Commissioner. Committee members, questions for the commissioner. Okay. What do you think the biggest thing was to help get children out of hotels and where are they now? It's hard to boil it down to one thing because I can tell you we have been, we have been trying every strategy we could think of. But I'd be remiss if I didn't specifically give a shout out to Juanita Steadman here. She represents together, Georgia's and association of our group homes and child placing agencies and foster families. Juanita hears from us how many times a day now Juanita? A lot. She has been an amazing cheerleader for us to make this happen and our providers have stepped up because they want to see us get to zero and we could not have done it without them. Thanks, Senator Robertson. Commissioner Brosle, thank you for your testimony. You, a couple of things real quick. You said today currently we have 10,583 children in custody with defects. And then you said that many times these children are placed in the custody of defects just to acquire services not that they are in an abusive situation, or anything like that, which my due process antenna kind of goes up. To where it seems like the, we're putting them in defects to acquire services, but these are services that already exist. And so I assume that the direction you are moving into is to bridge these services into these communities without having juvenile court involved and enter into these communities. And so I assume that the direction you're moving into is to bring juvenile court involved. And I mean, it just seems, sadly, it seems very bureaucratic that we would take a child, take him before a juvenile court judge and that judge placed them in custody of the state just to obtain services when most of us can go to our local defects office and acquire those services or go to the health department and acquire services. So what percentage do you believe? I think that this may be something further down the chain for somebody else to address, but what percentage would we be thinking of the 10,583 that are in there for services alone? I would say, I think the numbers have still held true that we, for the past two state fiscal years that each of those years we've seen between 1,000 to 1,500 kids, unique children that have spent a day, and that's one day in a hotel or an office because they don't have a placement. And of that group, I would speculate that perhaps half, according to our best records, came into the system to access services when there's not the legal dependency if abuser neglect that would actually be an appropriate basis for it. Now, I'm not blaming, I mean juvenile courts or there are partners and they are pulling with us. This is not happening everywhere. You might be saying, you're not just running into a lawyer but you have to understand too from their perspective that they, it would be tough because it's tough on me. I feel like I have a fairly decent command of where things are in state government. If you don't know about telling the family to apply for SNAP with defects and then go pursue a now comp waiver through DBHCD and perhaps get caps assistance through decal. That's just tough. that's that can be difficult to navigate. Yeah, and I want to be clear I'm not blaming anybody. Right. Any failure I see in the state, the first group I blame is the Georgia General Assembly for not addressing the failure. Because you know, it's our job to take the beatings and everything for doing what we feel is right as a unified body. So I'm not trying to blame anybody. I just know how intimidating juvenile court is, first of all, for somebody and then you've got a parent and in your full disclosure, most of my years was being raised by a single mom who worked two jobs. So I understand that this, it always seems like the biggest failure is we do a really, really poor job of educating our community of where they need to go and get the services. And if that's the solution, then we can fix that. But taking 5,000 children, whether it's a day or a month or ever, how long and putting them under the supervision of the state so they can get services that are accessible to everybody else. To me, it just seems like something we should be able to correct. And I think that we can, I certainly think that that's something this, this body could make a lot of progress on. And of course, we did pass several pieces of legislation to start addressing that. But I don't think we're done yet. Senator Payne. So I'm going to get a point. And point. Quick question. And thank you for what you did. But what percentage would you say of kids that are placed in foster care within the first year are moved from the original home they were placed in for whatever reason, for their behavior or they had their needs are too great or whatever the reason. I know that happens quite often. I just was curious if there was a number. There's definitely a number. It's not when I've got right in front of me. I can tell you that it's almost a certainty that a child is going to have more than one placement once they come into state custody. Depending on the child's needs or the young adult's needs, they could bounce around dozens, frankly. And so that's why it's, when you have partners like what we have with our providers, that's a focus of ours. Well, what we can do to get the placement right the very first time. Do we have an idea of any number of what those numbers would be? I can get them for you. We have an orc for days. So I can get something more concrete. So you can see sort of the trajectory of even by age group, if you'd like. And that's just the question comes from just experience and working as a juvenile group. And just understand that that was, I saw so many times that the kids were regressed. And because of the place.\n\nIt's in that first year too. And just, you know, and just use and see them. At one point, then you see them months later, come back with probation or an court. And they just see what they were worst. And when they started just because, and that's always been a concern of months, that's where he's nice that question. I'll get that to you. Any other questions, First Commissioner? Thank you so much. All right, Samantha, you ready? And with that, we have Samantha Walker. Any, if you want to be, any of you who want to sit, instead of standing at the podium, you're welcome to go to the witness to Mike right there. And we'll turn that on. Okay. Yeah. Yeah. Oh, great, great. Just pull the mic a little bit closer so we can all hear you. Good morning. Good morning. My name is Samantha Walker. I serve as the reunification and interim safety services director for defects. I've been with defects now for about 15 years. And thank you. And today, I'm going to share a little bit about our family preservation program area. I'm sure many of you have heard of family preservation. Essentially, it is a continuation of our child welfare continuum. Prior to us taking a child into foster care, where we have determined that there is some risk, some safety issue. But we have determined that we can mitigate that safety issue in the home. So we talked a lot earlier about the number of children and foster care. So family preservation really is designed to prevent that if at all possible. So typically these services originate following a substantiation of abuse and neglect in one of our child protective services cases. Also, I want us to consider that we can look at family preservation following a foster care stay. If we have determined that we can reunify the family, however, there are still some safety concerns that exist. Family preservation is available for us to continue to support the family. Again, these are preventative activities. We really rely on community-based services, community-based activities to stabilize our families so that we can prevent out-of-home care if at all possible. One of the challenges that we have is balancing our safety concerns with reunifying children with their families and working to prevent those out-of-home placements. One thing that's important for us to consider here is family preservation is designed to be short-term. So typically about six months. And we are really intensive about the services that we provide. We are clear about the threats that exist to our families. Again, what's really important here is making sure that we are surrounded by our community support. We have services available to our families, both formal and informal. So we're helping our family to identify the supports that are available to them and also help them strengthen the supports that they already have, whether it's family, friends, neighbors, schools, churches, communities, whoever might be in support to the family. Me and Aromachu just for a second, the committee members, some of us are chronically taking notes. Just know that you will be getting the presentations in your email. Go ahead. There are two primary case management responsibilities for family preservation. And you may hear me say family press, that's family preservation. So one is managing safety. So one determining that we can control the safety threat in the home while also working with the family on long-term parental capacity and behavioral changes. So our safety plan is really looking at the immediate safety concern. How can we mitigate that? How does our in-home safety plan address that? And what does the family need long term to be successful to prevent that out of home care? So there are some key time frames for family preservation. So once we determine that abuse or neglect exist, and we think, you know what, we can continue to service this family. There are some services and supports that they need, but they don't necessarily need foster care. We initiate those services within five days of identifying that family preservation is appropriate. We formally evaluate case progress every 90 days. I should note here that family preservation can occur without a court order. It can occur without court intervention, or there may be court intervention. There could be a finding of dependency or not. So we don't necessarily have to have court intervention for family preservation. So when I talk about case evaluation, that includes a supervisor, case manager, and any other supports available to the family coming together to determine where the family is as it relates to progress. We still need to be involved. What needs to happen for defects to be out of the picture? What does the family need long term to be successful? And we are consistent and really providing transparency and full disclosure with the family on what that looks like. So here just are some numbers in terms of family preservation stages. So these numbers show cases that are in family preservation. And the next slide will show actual numbers of children who are being served in a family preservation. So as you can see, we are at about, I can barely see, about 2,500 families as of June of this year being serviced in family preservation. So again, a safety concern has been identified. However, we determined that we can control that safety threat, not necessarily resolve it or eliminate it. It still exists, but we can control it within the home, within in-home safety plan. Here shows the number of children. Who are being served by family preservation? Who might otherwise be in foster care if not for the family preservation services? So over 7,000 children as of June 2023, were being serviced by family preservation or in the family preservation program. Thanks. Oh, sure. So it was so fast night by her handout. I'm not saying it was. The numbers that were seen are any of those children, I guess reflected in this June, I guess, 72,58, or any of those children included in the 10,583 that are in defects or these seven numbers. They're separate. So, but for the family preservation, that number could be added to the number that are in defects. Yes, that's correct. Sorry to interrupt. Oh, no problem. So this shows any given time in fiscal year 2023. There were 7,813 family preservation cases, which may be, that's more children than that, but these are the cases and clothes during this fiscal year, were 5,459. So here talks about the children who were served via family preservation. And it's almost 12,000 who were served in fiscal year 2023. Of those, 1914, entered defects custody. So I talked briefly about our contacts, excuse me, our contacts and family preservation. What's important here is that because there is a safety threat, our contacts really do have to be intentional with our families. We do require monthly face-to-face contacts. Often those contacts are increased because of the safety threat that exists within the home. We again, utilize community-based services, Medicaid covered services, also services offered through our partner agencies, DPHDD, DCH, and also DPH. So we'll talk a little bit about parent aid services and home-state services next. But again, I really want to highlight the importance of us bringing in community partners, because I think as all of us know, we're unable to do this work alone. So we really, really rely on those providers to help mitigate those safety concerns and keep our families in the home whenever possible. So our parent aid services really are a lower tier program, so to speak, in terms of families who might need assistance with parent aid, maybe some family therapy, where our parents and families are cooperative, they may be experiencing some sort of stress, they may need some additional support to help them build those parental capacity. So for instance, they may be struggling with working with their child who may have just gotten a diagnosis of autism. And so they need some assistance with helping them manage that and create schedules and understand expectations and help them learn how to parent a child who is now different or not typical from what they expected. Again, I'm going to talk about this a lot, but the community-based supports are really, really important for us here. And so our parent aid services are available to families with an open family preservation or a permanency case. Our home-state services are a bit more clinical in that. Our families are struggling with a bit more. And so I know many of you are familiar with some of the behaviors and diagnoses of some of our children who are in hotels. Sometimes we see those issues and family preservation, and if at all possible, we want to mitigate that. Commissioner Brost spoke earlier about how sometimes children come into care because of those intensive needs. And if there's a way for us to provide services and mitigate the safety concerns with the family, via home-state services, that's what we like to do. These are very, very intensive and crisis oriented. So our families are really at a vulnerable time when we're providing these home-state services. These are designed to be short term about 180 days. Of course, there are instances where it may take longer, but home-state services again are more clinical, higher-need families. We talk here about how not all out of home placements can be avoided. And we understand that, which is why we have a foster care program. However, it is so important for us to continue our assessment to determine how we can service this family, because even when we bring a child in foster care, we're constantly thinking about what needs to happen for he or she to go home. So we start thinking about those things very early when we're servicing families in the home. Again, we have our contact standards that talk about how often we're supposed to be seeing our families. Once a month is the very, very minimum. We often see our families more often than that when we're working with them in the home. And here just shows a little bit about our funding, where a lot of our family preservation funding has come from, home-state services are close to $2 million, for a fiscal year 2023, our parent aid services are around $700,000. So as you can see, our home-state services, which are the more intensive clinical services, almost double our parent aid services. So we talked a little bit about not all children can avoid out of home care. And if they can't, if they cannot be serviced in a voluntary kinship arrangement, or maybe a custody- third party arrangement, then we move over to the most intensive thing that we can do with our families. And that is entry into foster care. So here are some numbers that show how many children we have in foster care. And the green number that you see at the top represents those youth who have voluntarily consented to remaining care between the ages of 18 to 22. I do have my glasses on, but I can barely see. I think it's 635. You should. OK. And here are the shows on our Children and Custody by State Pisco Year. As of 2023. Thank you. I'm going to look at my notes here. So as you see, our numbers have defined considerably over the past several years. This shows our reunification numbers from fiscal year 2017 to 2023. I'm almost recent data shows that we have reunified about 41% of children who have entered foster care. So of those who have entered foster care about 41% have returned to their original caregiver or a non-custodial parent. Sure. I'm not even going to say that again. Sure. Of the children who entered foster care in fiscal year 2020. I'm sorry. Of the children who exited foster care in 2023, about 41% of them have exited via reunification. So reunification includes return to their original caregiver. It also includes return to a non-custodial parent. And I'll just let you all take a look at this. It shows demographics of children who are in foster care currently. Well, as of June 30, 2023. This family population, yes, that distribution. Or is it stacked towards younger families? Are children and children in families? You know, it is. I don't have the data in front of me today. I think that it is fairly close, but that's something that we can surely get to you. Right. That's it for me. OK. I have one question for you about the safety threshold. So that sounds like it's pass fail. Right. The safety threshold. It sounds like there's a you check all the boxes and they make a decision, yes or no, it's safe for the child to stay in the home or not. And then you reevaluate every 90 days. Is that tied to giving the parents time to complete whatever remedial things they need to do? Does it have anything to do with the court system and what their schedule is? I'm just interested in how the 90 days came about. So it might. So the 90 days is for us to evaluate formally. So of course, we should be evaluating every time we visit our families, every time we visit our parents. It does vary sometimes if there is court involvement. So not all the time there is. So yes, it really provides us an opportunity to again, have full disclosure with our families, you know, so that they understand what's required for us to leave, what's required for them to complete their case plan. So to speak, does the safety threat still exist? So yes, it does vary based on court systems because not not all family preservation cases will have court involvement. Okay, other questions from the committee, Julie. We're 10. I just want to clarify for myself and also a lot of the family preservation are voluntary by the family because the court is not involved yet. So if you're entering into a safety plan, it's an agreement between the department and the family who avoid further court action. Yes. So the court, the state never comes in and takes custody. It's just agreement to keep that from happening hopefully to work with the family. Yes. Thank you. I just wanted to clarify that. The other thing I wanted to bring up is the parent aid who are assisting the family and learning hopefully how to better parent their children. One of the complaints I've heard in the past is that these are people who are fresh out of college. You have lots of intellectual ideas about how to parent children, but I've never actually parented children. Is there any thought about maybe providing additional training for them or what type of training do they have? One pilot program I went to a training on in Texas was a TBRI, I don't know if you're familiar with that, trust based relational intervention. And they were having great success out there in the juvenile court out there with reunification because they were teaching the parents, the TBRI techniques. Is that something that Georgia has explored? So sorry, that's a lot. I packed a lot in this. Yes. No, I think that's a great question. So the experience does vary just like with G-Factor, staff in terms of parent aid and support services that are available to our families. So I do think there's been a bigger emphasis on making sure that we're clear with our providers and our parent aids about what we're looking for and to be specific about what type of intervention might be the most successful for this family. So I think there has absolutely been conversation about that and there is room for us to continue to improve in that area. But I think you're absolutely correct in that, of course, not all service providers and parent aids are a created equal. So it is really us working together to determine what is the best course of action for that particular family. I hope that answers your question. Okay, thank you, Senator Jackson. Thank you so much for your presentation. Just two questions. One, how do people come to your preservation program? Is it only through somebody calling the number to report or can families reach out to you to become members, members, become service? I don't know what you call clients, I guess, in your home preservation program. That's a good question. So yes, so most of the cases come as a result of an investigation. So someone called in and made a report, alleging abuse and neglect. We determined that abuse and neglect did occur that there was some maltreatment. There is a safety threat. However, we can service the family in the home or a child or children are in foster care. We are continuing to work with the family and have to determine that we can return home. We can return home, but we still want to continue to work with the family. So you can enter a family preservation in those two ways. And then my second question is, is there a particular time of year where more families get placed into home preservation or into this process? Is it the beginning of the school year or? Yes, it's now. Yes, it's the beginning of the school year. So it's mostly teachers reporting. Yes, the majority of our intakes come from the school. Okay. Very question. Yep. Samantha, I'd really commend the presentation and the scaled approach to the families too, thinking about levels of care that they might need and being strategic about that. What you mentioned was that it sounded like if I was hearing it right, that about 16% of the families that are in family preservation within that year, will ultimately the kids will actually ultimately get placed in custody. Do you, is that correct? Would that be? That sounds about right. Yes. Do you know what the numbers are following that? In other words, family preservation closes and then you follow the families in the records, two years, five years, 10 years. Do you know what the rates are for placement and protective custody after that period? We don't. We are looking into that though to determine exactly what you just asked. So we don't know. We don't know if the state is necessarily shorter because we've already been providing services with a family. So yes. But it would be discoverable. It's something that we could bring to this committee is information about that to know what's going on. And then the last question is, so the, it sounds like you're spending about $300 per family per year within the program. And if you had more resources, what would you spend it on? One of the things that, that occurs to me from working with this population, especially for younger kids that are at risk and that might be targets for a family preservation, is the unmet mental health needs of parents. And how are you doing with accessing mental health care for parents? You know, and do you need more help with that or do you think that that's going well? So I think we can always use more help with that. I think when I think about services, they may be beneficial to families, specifically in family preservation. I think respite services to families would be extremely beneficial to parents who are struggling with mental health issues for themselves and their children. And really just might need an outlet. So I think that that's an opportunity for us. So if you had, if you had an opportunity to boost the resource, that's one of the places where you would go. Yes. Great. OK. Let's move on. And thank you very much for your presentation. And now we have Dana Krem about dependency removal and permanency for children. And you do have a flow sheet in your folders about dependency. Thank you very much. I'd like to begin by thanking our committee members for your commitment to Georgia families and children. When elected officials give attention to foster care issues like you all are doing today, where it gets out in the child welfare community, you get credit and improve morale just by being here. My name is Dana Krem. And working in child welfare is a calling for me. I'm a Yankee who came to Atlanta for Emory Law and ended up falling in love with Georgia. I handled my first defects case a few hours after being sworn in and the courtroom next to the one assigned by Judge James Whitfield, who you'll be hearing from today and Judge Juanita Stedman, who you've already heard about. So Cobb is well represented today. In the years since I've represented thousands of cases and juvenile port for defects. And as a new SAG, I still remember being told that my most important job was to quote, keep my case manager off the front page of the AJC, no offense to the media. This admonition was a tongue-in-cheek way of conveying the stark reality about the stakes of de-vax litigation. As I was preparing for today, I realized that this last January 15th marked the 25th anniversary of the death of Terrell Peterson, a Georgia child whose tragic death after being tortured sparked national outrage. This legislature is responsible for initiating many guardrails to prevent another such tragedy, but no state has yet to eradicate the root cause. Georgia de-vax handles thousands of child abuse reports a year and many of its removal decisions require high levels of assessment and expertise. When judgment calls are required between leaving children in a home with interventions, or placing them in foster care, I want you to know that choosing removal has mental health benefits to our frontline staff. A worker that removes a child gets peace of mind that the overwhelming majority of our foster placements are good homes that keep children safe and that no one will blame them for future harms that occur to a child they mistakenly judged could stay home safely. Finally, they decrease their chances of being on the front page of the AJC. Now please understand, no de-vax personnel will ever sit here and talk about these quote benefits, but as legislators and policy makers, as you look at Georgia's removal statistics, please know they are evidence of professionals who have made tough judgment calls requiring unacknowledged personal sacrifices. As you can see from the charts I've provided to you and the first two pages of your handouts, Georgia has had lower removal rates than our neighbors since 2017. The significance of this cannot be understated. In 2021, if Georgia had removed children at the same rate as permanency report card number two ranked Arkansas, we would have had 10,584 children brought into care more than doubling our numbers of removed children that year. At number three ranked South Carolina or 2021, we would have removed an additional 1,400 children. Removing children from families where the issues of dependency are less complex or severe to remediate will impact the timelines it takes to reunify and how often reunification can occur. Leading to higher rankings and permanency metrics was recently examined by the American Enterprise Institute. That report disregarded removal data, but if ranking were based on it on lowering removal rates, then Georgia would be number one in the South. Georgia has demonstrated that removal rates can be lowered safely with provisions of services. And as one of my favorite juvenile judges, Michael Key says at every training, our goal is to ensure that every child that should be in foster care isn't care, but not a single child more. I posit to you that the removal numbers you see for Georgia were made possible by intentionality from leadership at every level, from county supervisor to DHS commissioner to create a culture that guides and supports our frontline workers to only remove children when absolutely necessary. Once removal has happened, the timelines and juvenile court are lightning fast compared to litigation and other court settings. That's because a parents' right to custody of their children is a sacred, fundamental, liberty interest of our constitution. I'm going to endeavor to mirror that lightning fast speed and my presentation today and will only be highlighting some of the key features of a foster care case that goes to TPR. Before I continue, let me acknowledge I know some of you have decades of expertise, but that others of you are newer to child welfare. So I did request copies of the defects created training materials for today and endeavor to select the most relevant portions for you to have and keep. I specifically requested to include training materials that are given to new defects case managers to help them understand the court process and their role in it, which I hope will be of interest to you all. Let me also say that I have been well conditioned by one beloved judge who may or may not be here today, well, it's just Edmund, to handle interruptions. You will not unerve me by asking questions as we go, but I will defer to Chairwoman Karpatric on time. No, I'm happy to sit here or stay afterwards to answer questions for as long as you will have me. Today's dependency crash course will begin after the removal decision has been made. At that point, it becomes a SAG job to help defects prepare evidence to show that the juvenile court has, the juvenile court has the right, as the state has the right to protect children involved and that that should trump the parents' right to raise the child as they see fit. Georgia law requires that we have a PPH or a preliminary protective hearing within 72 hours of a child being removed. The code doesn't require that weekends or holidays be counted towards those 72 hours, but many jurisdictions around the state schedule, PPH hearings three days a week and stay well below that 72 hour threshold. Here say testimony is permitted and the burden of proof is the per is probable cause, which is a fairly low legal threshold, but defects still needs to provide enough information for the judge to make three key findings. One, that continuation of the child and his or her home would be contrary to their welfare. Two, that removing a child is in the child's best interest and three, whether or not defects has made reasonable efforts to prevent or eliminate the need for removal of the child. These findings are required to be made at this and every subsequent juvenile court hearing. They are codified in Georgia law and analogous to federal legislation, which states are induced to follow if they wish to receive federal monies. After the PPH, defects has five days to file its dependency petition and then 10 days later the adjudicatory hearing must be held. At adjudication, the burden of proof is raised to clear and convincing evidence. Stipulations are possible, but the defects act should ensure that the findings of the order list with particularity, all the issues that led to removal because only those concerns are allowed to be addressed in the parents reunification plan. Continuances are allowed with the showing of good cause. Three reasons that are common for why\n\nJudications can take longer than 15 days after removal to be concluded are, and this is a no particular order. One parent attorney issues where the parent needs more time to apply for and received court appointed counsel or to retain a private one. Or where the parent has counsel, but that attorney has a legal conflict and is already scheduled to appear in a different matter that typically trumps juvenile court hearings. Or where the parent attorney is new to the case and request a brief extension of time to adequately prepare. The number two reason for continuances that is common is service issues. Sometimes we know where the parent is, but it takes the help of a sheriff or deputy process server to track the parent down when the parents whereabouts are unknown, then Georgia law does require service by publication, which will delay adjudication by at least two months. Utah is an outlier and far and away number one and achieving it permanency quickly and they do not require service by publication to adjudicate on a parent whose whereabouts are unknown after a diligent search. They do require so at TPR of course. Third reason would be discovery issues, especially in cases involving allegations of serious physical abuse and or medical neglect. And those instance it almost always takes longer than 15 days for defects to acquire the nearest necessary forensic evaluations or medical records and have them disseminated to the parties and time for everybody to review them. This subset of cases often requires hours if not days of evidence and testimony, including from expert witnesses and all parties involved benefit when the court is able to designate sufficient time on a date certain. Setting aside half a day or more of a court calendar can take longer than two weeks, even in courts that work exceedingly hard. The permanency plan and goals for reunification are to be set out at the disposition hearing. The court can deal with disposition issues on the same day as the adjudication, but when that doesn't happen, then a disposition disposition hearing must be set within 30 days. There are four permanency plan options reunification is the preferred choice. The other plan options are permanent guardianship adoption following a TPR and another planned permanent living arrangement. DeFacts may recommend a concurrent plan at the disposition phase or any subsequent review. A concurrent plan means DeFacts believes it appropriate to make efforts towards plan A reunification while simultaneously making efforts to achieve an alternative permanency plan goal or plan B. A concurrent permanency plan at the disposition is not common in my experience and any time DeFacts does recommend a concurrent plan. They are required to give notice to all parties of their intention to do so and the approval of the court must be obtained. I will again mention Utah, which has a presumption that reunification services not be provided to parents who's whereabouts are unknown at this juncture within 25 days of removal. DeFacts host what is called the family team meeting or FTM where the strengths and needs of the parents are discussed along with proposed case plan goals. This plan is presented to the judge at the disposition who has the option to change or modify it within 75 days. The court is to set an initial case review hearing and then depending upon the age of the child, the youngest child involved, the initial permanency plan hearing must be held within nine or 12 months later of the removal date. This means that a juvenile court can be expected to have had six touch points with the family in the first 12 months. Subsequent permanency hearings are then to be held at least every six months thereafter, but it is not uncommon for courts to hold them more frequently. Of paramount importance are the needs of the children and how they are being met and how they are progressing with their case plan goals. If at the initial permanency hearing the court finds that there is a lack of substantial progress towards completion of the case plan, Georgia law says that the court shall order DeFacts to develop a case plan for non reunification or a concurrent plan. The granting of non reunification case plan relieves DeFacts of having to make any efforts to work with the parent or even communicate with them on a monthly basis, which will impact the evidence available to present the court and an eventual TPR trial if one is to be had. This is one policy reason concurrent case plans are a more common choice in my experience. The 14 month after removal, juncture is when DeFacts should be holding what is referred to as a TPR staffing on and discussing whether or not grounds exist to file TPR. As for does mandate that defects file for termination whenever the child has been in care for 15 of the last 22 months, but there are exceptions to this 15 11233 B outlines reasons why TPR may not be in the best interest of a child. I'll mention two of those compelling reasons one where the parent is successfully working their case plan, which is very often the case our families have issues of dependency such as substance abuse issues that can take a while to resolve. And then to when the child is at least 14 years of age and objects to the TPR a child age 14 or over has to consent and want the TPR. A decision by DeFacts that a compelling reason exists not to file for TPR is discussing court and the judge child attorney guardian at light and M. Costa would most certainly be expected to weigh in absent these compelling reasons the law requires the filing of TPR after 15 months in care. The decision to file for TPR. It does not require agency personnel to believe reunification would be clearly inappropriate or unlikely and it is not uncommon for staff to feel conflicted on these questions at this juncture. I've provided a hypothetical scenario in your handouts that I hope demonstrates the challenges of achieving adoption in the 24 month time frame under Georgia law. Many factors play into this I'd like to highlight one around the state there are not enough practitioners willing to handle TPR cases and it's not just the complexity but also the emotional toll of handling what is the death penalty of civil law and Cobb County are assigned parent attorneys handle all the dependency and a liquid C matters that are that are assigned to their judge. But when a TPR is filed one of the handful of attorneys that is willing to do TPR work in Cobb County is substituted as counsel. The law says that TPR trials are to be set within 30 days or 90 or to be set and heard within 90 days of the filing of the petition. And that's when there aren't service issues because if there are service issues at this stage then you're looking at at least three months down the road. Because the service must be perfected for longer than added to the adjudication stage. But within that 90 day period if that's the time frame we're looking at without service issues then that's all the time that is allowed to appoint a new attorney get them all the discovery and pleadings that have been exchanged in the life of the case have that attorney get up to speed on all that has been transpired over the life of the case. For the past year and a half or more often it's more and then meet their new client and help them prepare for trial. That is an exceedingly tough ask for any attorney to do in less than 90 days much less one with high case loads. Never mind that at least in Cobb County all of the TPR attorneys willing to handle that work are actively appointed to the most serious felonies and superior court. With trials that even juvenile court judges are very disinclined to disrupt even if they are technically allowed to do so but then often they're not. So for those reasons it's it's it's very difficult to get adoption done in 24 months and if you have any questions i'm happy to answer them now. Thank you very much that's a lot of information that just especially for those who aren't all your so questions from the committee. Senator Robertson. I really do appreciate that that machine gun version of all of this and. The attorneys haven't managed over the parent. I think I mean it's easy enough to say and looking at your flow chart which is insane. So attorneys understand this because that's what they do each and every day. Are we educating parents when we're going in to teach or find some issue with the child. DeFax is brought in and the child is taken out. How is a parent that wants to get their child back. And they go to juvenile court and in i'm asking these rhetorical if you will and please jump in if I say something that's wrong they show up in court the child is represented by the state. Is that correct the child has an appointed child's attorney who can also serve as the guardian of light them exactly but they're appointed by the court. Correct. Yes. And the court represents the state in this case is that correct. I represent the state as the saga pointed. Correct. Correct. Yes. Right. So who represents the parent? So the parent is constitutionally entitled to a court appointed attorney. A public defender if he will. Yes. Yes. And at probable cost stage and Cobb we just they have the advocate that's assigned and there's not typically a requirement that they apply. And then at the back up say that again in the public calls hearing there's why there is a there's parent advocate attorneys assigned to the courtroom. There might technically be a requirement for them to apply but in practice apply apply to qualify as indigent right. But in practical like the practically speaking they have that attorney no matter like they have that attorney is. And I do not mean this word in a derogatory sense which a lot of people take it as because I am this way in many cases. As indigent is not the problem ignorance is the problem is people walk into the courtroom not understanding this massive sausage making machine. And they they walk in there. And I'm not talking about the terrible parent. I'm talking about that borderline parent who's struggling trying to get things done and and they've gotten caught up into the wheels of government. How when they walk in. In some cases you're saying they would have to qualify as indigent to receive a court appointed attorney right in some jurisdictions. That may be the case but I believe in most jurisdictions and at least in Cobb they have the. Advocate that is assigned to that courtroom who is experienced and does it. I mean the advocates are normally assigned to a courtroom in Cobb. There is one there is one advocate and one guardian. And just to be clear I heard somebody whisper would you would you tell us what a sag is. A specialist is an attorney general to a point it to represent. And we corrected some pay problems y'all were having about a year or so ago. I believe. We have received that. But well what y'all's fault but okay so so let's just say mom comes in there. There is an advocate appointed or qualified. Who is an attorney yes that can step up from mom now my understanding is a lot of these cases are heard on the same day correct. The on the her same well in other words when the docket is created a lot of the judges prefer similar cases on the docket that day if they're dealing with these types of cases. In other words they're not dealing with your typical juvenile cases. And these cases all blended in together on most days. And Cobb we have three days that are set for probable calls hearings they're set. Monday Wednesday Friday at 11 o'clock. And these are probable calls hearings on these cases these types of cases. Yes but then also other cases. Shot lift down on other cases other cases other cases will be are typically going to be on the calendars. Criminal cases in other cases. Delinquency and perhaps other dependency reviews depending on the judge. So very similar cases. Yes. Okay so you have it how many advocates do you typically have in the courtroom and top. There is one parent attorney and then one assigned guardian of light. And then there are a handful of attorneys that are appointed when when they're either really complicated or appointed if there's you know for some other reason you know other giving of light. So this this mom comes in there and she's basically jumping into the baptism in the courtroom of the of the system. And there's one attorney in there that could be assigned to represent her along with other parents that are in the courtroom for similar type hearings. And so basically she's going to be drinking to a fire host trying to understand exactly what's going on. Is that right? It is because of the removal rates it is very rare that we have more than one or two probable calls hearings on any given day. Okay. So I believe there is that the we aren't attorneys do a good job meeting with the parent before they can even explain. Are we educating these parents on their rights and the process they're walking into or we put in all that onto the shoulders of these advocates? I believe that the parents are getting educated and there are several touch points for that. There would be the attorney that's appointed but then judges also have a responsibility and in my experience are very good at explaining the process from the bench to the parent. They can't explain what advice but they can explain they can explain what they're doing. And that what the standard is and what the findings are that they're required to be made. And they and that and that part can be explained. And then at the FTM meeting which is to happen within 25 days again though that process is explained. And the parents leave that with a written case plan that goes into particularity about the referrals that are going to be made and the things that defects is going to be doing and then the things that the parents are are going to be expected to do. And then that case plan and those goals are then again to be reiterated by the court. That case plan agreed on by the advocate and the court. That case plan is generated at the family team meeting but the judge just will quick, real quick. I just want to keep it as simple. I want to keep it simple. Is that case plan agreed to by both parties? I know the judge has to sign off on it. So is that just something the court puts together hands to the mom and dad and says here's what you have to do. And the cases when there are disagreements between what the parent attorney has of the right to agree that there's disagreement then the court has to rule. I'm going to talk about disagreements. I'm just talking about the overall plan is both parties discuss in the plan. Both parties are discussing when there's a not consent between the two the judge decides. Okay, before I recognize our other attorney over there, Senator Hatchett, I just want to point out we've got two different handouts about dependency in here. One came from this crime which just very looks very clean and logical. And then one came from Julie which probably more accurately reflects the complications of the process. It did not mind but I was given permission to share that. I did not create that. So it reminds me a lot of the organizational chart for state government. So anyway, that said. So Senator Hatchett. Thank you. I think something that if you could help the committee understand a little deeper and nothing too extensive. But in a juvenile court, it's a very unique setting where it's not adversarial like you would picture a typical courtroom where there's the state and a defendant or a plaintiff and a defendant. But there really are three entities being represented defects, the child and the parents. But the goal, the overarching goal of the entire court case is reunification. Correct. That is correct. That is correct. So it's I guess could you explain a little bit how because it's kind of hard to conceptualize just the I guess the nature of the courtroom, the mood, the the goal. It's not necessarily fighting back and forth. It's kind of all right, let's identify the issues. We're going to tell the parent what they can do to rectify these issues and obviously in the juvenile world, reunification is the ultimate goal and everybody wins if we can get to that point. Correct. Correct. And then I would say that in many cases when we're at the adjudication, the SAG and the parent attorney and the guardian of the item are all talking about either the possible stipulation or what they expect the evidence to show. And it is not at all uncommon. In fact, it is very typical that the parties will agree what they think the case plan goal should be and that that will be reported to the court that day what the goals are expected, like what the goals that have been agreed to are. Because then if if reunification does occur, de-facts wins, the child wins and the parent wins. Absolutely. 100%. And that's unique in in a court setting where all three parties are actually advocating for the same result. Is that yes, for sure. Okay, Senator. That was over simplification. I know. Okay, next. And I'll get to do that. Thank you for your so much information. Picking up on Senator Hatchett's question, if the goal is ultimately reunification, then only 41% of these children are being reunified. We are failing. Like that's a F-9. At that point, if it's 41%. So can you from your first experience talk about why is our reunification rate below 50%. And it seems like you were you were speaking to the timeline and saying like this is why we can't get to adoption after two years. So are you asking for a six span that timeline? Well, I don't know kind of what you're what you're hoping for as you explain kind of the problems in that setup. But my first question is why are we only reuniting at 41% if our goal is reunification? So the primary goal is is reunification, but that is not always possible because the parent maybe doesn't comply with the with the goals that we've asked them to do or in some instances because the needs of the child are severe. But when you're only removing children in the most dire circumstances, that means you're going to have the most severe situations. And there are and there are some cases that, for instance, if we have a very broken baby, where reunification is going to be less feasible from the get go and maybe even impossible. So there are also those those examples. So reunification is is is the goal, but I don't believe it will I don't believe that it's necessarily a failure if we're not achieving reunification in every case because there just are some cases where the reunification is just not going to be possible. And then your timeline piece. The timeline piece was just not even to not to say just a comment to you guys. This is what it looks like in reality. These are all the things that have to align the stars that have to align to get it done in 24 months. And I would also like to note that there there is a difference between legal permanency, which is very important, but then also relational permanency. And I'm far more concerned for the child who we have gotten to that, you know, TPR stage and they are not in a and identified a pre-adoptive home that has expressed an interest in keeping that child forever than the child who has had placement disruption after placement disruption and perhaps doesn't have such such an adoptive placement. So for the child that is in that identified pre-adoptive home, we get determination and the time has passed for that to be appealed. And that child has permanence from the standpoint of it's going to happen. Like there will be an adoption at that point, almost always there's going to be an adoption. But when we often have foster families, for example, that have not been, quote, unquote, converted to being approved adoptive placements. And there is a second, much more intense and thorough assessment like that is done before a foster parent can adopt. And that process includes fingerprinting again, all the same things as was done to qualify them to be a foster parent, but then also includes things like if you have one of the adoptive parents that has that has a previous divorce from another state, they have to obtain certified copies of that. Or if they were married in another state, they have to obtain certified copies of those marriage certificates, obtaining those things can take time and and and be be an issue. But for policy reasons, if a foster parent hasn't started that process or hasn't become approved to be an adoptive resource, we don't have them start that process until the child is legally risk-free. And are those our rules? We make those rules up about the certificates of divorce and decreed. Did we do that? Or is that, or did the commissioner do that? I, by suspicion, this is that that was a federal rule. That is a that is a that is a federal rule because the federal that's a federal government is the one that determines the initial adoption subsidy amount that goes to that to the foster parent. And and I believe that is that that's a federal thing. And okay, we're gonna make one more question. We need to keep moving so truly. So in the other hand, it's a state thing that we have to notify by publication parents that we don't know where they are. At a adjudication, not that adjudication. At okay, at a adjudication. And you said Utah has the fallacy where they if if diligent search is the made and we don't know where this parent is, don't have to notify them by publication. That would speed things up a little bit except for termination, obviously, for the termination hearing, they would have to be notified by publication. Yes, if they cannot be found. Yes, but not adjudication. So that could be an easy change that might speed things up a little bit. Yes, I would agree. Because they have to be it has to publish for once a week for four weeks and then wait 30 days. Well, at adjudication, you have to wait I think five days, but at the termination stage, you wait 30. The other interesting distinction in Utah law is that at the termination phase, the juvenile court determines what county is the most appropriate to be published in. And so I would presume that that might decrease the the situations where we're spending $900 or more, $1,000 a dollars publishing out of state. In Georgia, requires that we publish on the parent who's the legal parent who's whereabouts are unknown, but then also the biological father who may or may not like be legitimate like the actual biological father and might may or may not have a last new address in Georgia. So that's a great segue to my next question. In some juvenile courts, I'm in, they don't consider. So for the committee, if you don't know, there is actually a legal definition of parent, which does not include a biological father who was not married to the mother and did not legitimate the child. So in some counties, I'm in, I noticed that biological, I call them biological only fathers get a point at council. And in some counties, they don't. It's very easy also for the committee. It's very easy in juvenile court for a biological father to legitimate. They can do it. They don't have to pay a filing fee. It's basically a piece of paper and they ask the court to grant the legitimation. So it's not a it's not a huge hurdle. So I guess my question to you would be, would it speed up the process any if there were a rule that if you're not a legitimate, legitimated legal father, that you don't get a point at council and that you don't have to be notified. I don't know is that except for the termination proceedings? Is that? Is that too much? That that that that would be tricky because I've also had many cases where that biological father who hasn't previously legitimated gets involved and ends up being a placement resource for the child. And I would never want to preclude that from happening. Okay, I'm going to ask you one more thing before we move on. And it has to do with duplication of the process of certain things for foster care and adoption. For example, fingerprints if they're on record for foster care, why would they have to be redone for adoption? I believe again, that is that's that's federal, but I will definitely double check being told that's federal. Oh, and there is actually an adoption expert who is for following me. Okay, well, nice. There. Thank you very much. And oh, I can respond to that question. I believe it's a lot of times the superior court wants to see the actual results. Oh, for sure. And not so a lot of times in an adoption, what I'll do is I'll ask the case worker to do an affidavit that the that the fingerprints have been done within the last 12 months. And also adoption law requires that they'd be within 12 months prior to the adoption being filed. So if they've been done within the last 12 months, the case worker can sign an affidavit saying that there's nothing on record that would prevent the family from adopting some judges insist that they want to see the actual results, which the department is not allowed to give us. Okay, that's very helpful. Thank you so much for really intense presentation. I appreciate your your speedily running through that. And we're going to have to move on, but we'll have around after and thank you. Thank you. Okay. And again, anybody who needs to walk out on them back in, go right ahead because we don't we've got so much on our chin and we don't have time for formal break. So next we have Glynnie and Leneer. Go right ahead. Thank you for being with us. So thank you for this opportunity to this chat with you this morning about the work that we are doing around adoptions. My name is Glynnie Leneer and I serve as the Safety and Promenade City Director. I've been with the division for 29 years. Okay, so basically this morning I wanted to provide to you an overview of the adoption process. So you've already heard that from Ms. Krem earlier that in order for an adoption to actually occur that we are required to make to have a legal action to occur in court, which severs the biological parents on a parental rights to the child, which will afford the the agency the opportunity to then to establish a new legal relationship with the child through adoption. And so just jumping into our process. So as I mentioned earlier that we the case worker is responsible for working with our SAG around developing a packet of information that we will provide to our to the SAG regarding evidence and grounds that will support the efforts towards being granted the order for severing rights for the parents. Once we have determined that what's we have been granted the in order for termination of parental rights, we then conduct what is called a child life history. And I just want to note here that although we are working through the process of terminating a terminating parental rights, we can service the child and the family concurrently. Ms. Krem mentioned earlier that we can work a plan concurrently in terms of reunification and adoptions with the family. I will say that oftentimes that is a struggle for our staff because\n\nare actually messaging to the family that yes we are working towards reunification with your child. However, we still have an obligation to work towards adoption to ensure that if we get to the point where we can't successfully reunify a child with the family that we are ready and prepare to proceed with the next best permanency outcome which would be adoption. So to give you an idea of what's included in the Child Life History, we as an agency is responsible for full disclosure to adopt their family. We are responsible for ensuring that all information that we have on that child, the adopted parent also has privy to that information as well. So some of the information that we provide through our Child Life History process, things like birth records, medical records, dental, developmental records, and psychological evaluations. This is not all inclusive. There are other items that may be necessary for us to provide to the adopted family depending on the needs of the child. So in the spirit of full disclosure, we're responsible for providing all information on the child to the, as I indicated earlier, the adopted family. Also, the eligibility rate for adoption assistance is established based on the needs of the child. This is also another practice that we can do concurrently while we're working towards the termination of parental rights. We do not necessarily have to wait to be granted termination to determine what the adoption assistance rate should be for the adopted family. If the child does not have a resource, there is a process that we have to follow to recruit an eligible resource for the child, someone who will be willing to manage the child's needs. And so there's a process that we follow. We work as Ms. Walker indicated earlier. We're very heavily independent upon our partner agencies, our child placing agencies to assist us with this recruitment process, to assist us regarding identifying, I'm sorry, allowing the child to be front facing in the community so that we can provide opportunities for the child to ascertain a resource that's willing to adopt. When you say resource, are you talking about a potential adoptive family? Yes, I'm sorry, yes. I'm talking about an adoptive resource for the child. Yes. Thank you. So to give you an idea of some of the recruitment opportunities, we participate in. Some of you may be familiar with our Wednesdays child segment that we partner with with Fox five. We also have our photo listings. That's both national as well as our local photo listing. It's called it's my turn now. Photo listing. There are county and regional recruitment activities that occur for children who do not have an identify resource for the population of children who actually have a resource. And these are typically kids that are already placed with their caregivers. And as Ms. Krim indicated earlier, there's a process that we have to follow to convert that family from the temporary foster care placement to a more permanent setting. And that's called our adoption consideration evaluation. And I'll just note here that we are currently looking at this process to determine if in our efforts to complete the ACE is what we call it. Is this providing or creating a barrier in the process in terms of how we are transitioning these kids from one category, which is a foster child over to be in place for adoption. Can you just repeat what that acronym was? It's called the adoption consideration evaluation. And we call it the ACE. So for children, as I indicated earlier, for children who are placed with their resource, which typically is the foster parent, we complete the ACE. And we utilize this, we utilize the ACE to assess the family to ensure that they have full understanding that they are now transitioning from a temporary situation with the child to a more permanent situation. We want to ensure that we have assessed the family dynamics. How does this permanent situation impacts the family as a whole, as well as assessing to determine that the child's needs are actually identified. And the family has the supports needed to sustain the placement to ensure that we don't have a disruption when the agency decides to close the case. So once we have, so one other point that I wanted to make around the children that we have to recruit for, generally when we identify family to adopt that child, there is a post supervision requirement for the agency to continue to work with that family from four to six months to ensure that, that again, that the family has what is required. There are no other issues that may come during the time that the child was placed and doing for the time that we actually will give them authority to actually proceed with the adoption. There is a possibility for us to wave that requirement for post supervision if there is an established relationship with the child and the parent. So for instance, if we have a child who is placed in a foster home and the current foster parent is not interested in adopting, it may be somewhat in the church that has a relationship with the child, the child is placed. We don't necessarily have to have the post placement, the post supervision for that particular child because we've identified that there is a relationship that is that's established. So there is a possibility for us to wave that. So once we have identified a resource, we have completed the child life history, we've established the adoption assistance rate. We are ready to make a recommendation to the family that yes, we feel that it's in the child's best interest to proceed with the adoption. We will give the adoptive parent the okay to move forward with contacting an attorney. We generally give a recommendation for attorneys who are adoption competent and can support them, but it's completely up to the family to determine who they want to work with to move forward with the adoption. The adoption is finalized in Superior Court. So in a nutshell, that's the process that we typically would follow. Of course, dependent upon what occurs with the family and the child, that could vary in terms of if there's a need that comes up in the process. Okay. So I mentioned earlier that we are required to establish an adoption assistance rate for the family. And there are three primary requirements for eligibility for the child. So of course, the first bullet you'll see that there's an age requirement. Now I know we get a lot of questions around why is there an age requirement? We the child must be 24 months or older in order to qualify for adoption assistance. A member of a sibling group of two or more placed in the same home for adoption and a child with physical, mental or emotional disability that's validated by a licensed physician or psychologist. Now I want to mention also that there is an age requirement. However, if the child qualifies based on the sibling group or a physical or mental, then the age requirement doesn't would not count at that particular time because the child would have fallen into a different category for eligibility. This is just giving you an idea of what the adoption assistance includes. It's of course the monetary assistance that we provide, Medicaid, and a payment of non-recurrent adoption assistance related fees which can be up to $1,500 per child. The non-recurrent adoption assistance also can apply to private adoptions as well. And again, it is the same amount of $1,500. This ongoing assistance that you talk about, how long does this last? This is under the category one you have there. Payment of non-recurring adoption related fees up to $1,500 per child that is monthly and for how long? So the $1,500 is a one-time occurring that's at typically that the adoptions. I apologize. I'll just say it's non-recurring right now. So the assistance payments or it's just it's a monthly and this is for how long? This occurs until the child turns 18 or if the child is in school it could continue until the child reaches the age of 19. And this funding is part of the Commissioner Brodie's budget? Oh, it's a matter of landstakes right. So it's a it's a it's a combination of monies but it's paid out through Department of Family and Children Services or the Department. That's correct. Yes. Okay, so as part of the adoption assistance eligibility or requirements that we do offer special services through adoption assistance and this can be a maximum payment for adopted parents up to $3,000 and it can include services such as dental, medical services, therapy, respite services. Anything that the family cannot locate in the community, Medicaid doesn't cover it. We could actually support the family up to $3,000 to ensure that the placement is stabilized. I can ask you a question about that real quick. Yes. So the the kids in this process are enrolled in Medicaid through a CMO and according to the information we've been given, various committee members, the CMO provides wraparound services of various types, especially medical and mental health and a lot of other things. How do you how do you deal with the disconnect or just being sure that it's not redundant? In other words, being sure that they're getting the services that they're supposed to be getting through the benefits that they're provided through Medicaid. So we are fortunate to have what's called post adoption workers and these workers are assigned to families who have already who have gone through the adoption process. So they actually manage this process for us. So if they call requesting a specific service, then that worker will be responsible for connecting them to whatever community service is available, whatever Medicaid pays. So we have someone to kind of support the families through that. Okay. So yes. Yeah. I'm really successful with the CMO that is covering those children. In other words, like the fact of having a post adoption worker, does it get the service? Do they find a way to get that or where no? Well, so in conjunction with and I'll talk about this a little later in the presentation in conjunction to some of our partner agencies, we are able to connect families to supports. I think what you mentioned earlier around the mental health challenges, that is a challenge across the board, even for our adopted families. Some of these families actually end up on the other side, either through family preservation in terms of trying to identify supports, although there are a final there are a family that has completed the adoption process for the child. So the CMO is supposed to be providing that service to the families, but even with those workers, they're unable to get access and nor capacity for that service. Right. That can be a struggle. Yes. Yeah. So we deliberately did not ask the CMO to show up here today because they're in the middle of a re contracting process that may I expect will change the way that things are being handled from a contracting standpoint and what they're responsible for. So we that's on hold for now. Okay. So we wanted to give you an idea of what the expenditures are as a result of the payments that are the supports that we're making through adoption assistance. So currently we are servicing a little over 14,000 adoption assistance cases for the state. Our annual adoption subsidy is $105 million and this is as of July 2023. Of the 105 million, 91 million was paid through 4E funding, which is our federal dollars. So we want to leverage federal spending as much as possible and approximately 14 million was paid through state funds. And the average adoption of such that the average monthly adoption assistance subsidy is a little over well close to $9 million. So this is basically indicates what our basic and specialized rates are for adoption assistance and you'll see here I mean for categories zero to five we have a daily rate of $14.50 and you'll see that that equates to the $441.04 per month for our age category of six to 12, $15.25 which equates to the $463.85 a month. The age category of 13 to 18 is $16 a day which is $486.67 if the child has been deemed at basic rate. Our specialized rates we group these into categories. We do have a rate scale that we follow to determine where the family falls based on the needs of the child. And for our category one, which is our mile to moderate population, we start that rate at $20 and then we have $5 increments to kind of progress based on the child's needs and we cap that particular category at $30 per day. The next category is category two which is our more serious to to severe child. We start that rate at $35 again $5 rating increments and we're cap in that category at a $45 a day rate. Our category three is our medically fragile which is a more challenging child and also our high complex needs could fall into this category as well. And it's $50 a day with a max of $65 a day for adoption assistance rates. Is there any income requirements so if a family is very kind of well off, they would still receive this benefit even if they don't need it. Yes it's based on the child's needs. Okay. Thanks. Thanks. On the job. Okay. Okay. So again, this is just a recap of what I've already stated in terms of the monetary benefits, the Medicaid and the non-recurring assistance that we provide for families. And then there's another service that we provide just recently is a child reaching the age of 13 and receiving adoption assistance can qualify for the Georgia tuition waiver program and a youth that has been adopted at 14 may be eligible for this program regardless of the adoption assistance eligibility. So we had you heard earlier that we work with our private provider agencies to kind of support this work. And about two years ago, we actually put out a solicitation to our put out a solicitation to our partner agency around helping us to service our most challenging population. And you see here that our hard to place children who are deemed 13 years older children designated by adoption assistance with significant medical needs. Children with emotional and behavioral challenges and civil groups of three or more. We are contracting with these five vendor agencies, it's Bethany Christian Services, Chris 180 Christian City, Faithbridge and Methodist Home to work in partnership with us to help us around the recruitment of the finding permanent homes for these children who are deemed hard to place. Now, when you say contracts, I assume these will put out like RFPs and these five groups made the cut, the final selection. How do we compensate these groups according to the RFP based on adoptions? So there is a set amount that we generally divide between the providers that through our adoption funding. They all receive generally the same amount of money to manage the work. And we base the rate scale on the service that they provide. So for instance, if they have recruited and approved a family for a child, then we will provide them a payment based on the activity. So it's a rate scale type payout that we provide to the agencies. The children they are attempting to get adopted do not necessarily live at any facility managed by this group or anything else. These five individuals here and correct me if I'm wrong, which I am a lot. These five individuals here are recruiting services basically that are out looking for families that will be willing to adopt these particular groups, 13 and older, special needs, things of that nature, right? That's correct. So they're recruiting. They're also training and approving these families. So once they identify the families, when you say training, we tell them like the impact program and things like that. So okay, and we're paying them to do that. Yes. Okay, thank you. So just another slide indicating what our post adopt pre and post adopt services are. And again, these services are provided primarily from our partner agencies. We have created an adoption and guardianship services unit. This is a unit that's actually within our agency that we developed about three years ago to manage the challenges that we saw around post adopt supports that families needed. We wanted to have a unit that would be designated to kind of help and to support these families. This is a unit that's different from what I mentioned earlier, the post adopt set, the post adoption unit. This unit comprises of workers who are considered subject matter experts that can help around the more crisis related issues that families may face. Adopts is a training support services that Bethany Christian services provides for us. This is in addition to what I indicated earlier, the slide previous where we had Bethany that was also an adoption services agency. They provide support services that's crisis related to families through the Adopts program. The family intervention program, we are, this is a more professional, more focused crisis related program that we provide to post adopt families who have adopted. We are actually in influx with this particular program. This will be also put out for solicitation within the next two months to try to identify an agency that will be able to support us around these services. The Georgia Center for Resources and Support, this is actually a support for a foster and adoptive families and they this is a web based type system that the families can engage in request specific information around whatever their need is. This can include introducing them to trainings that's in the community. If they have a specialized need, they can develop something to support the adopted family. This is also one of our contracted agencies that we work with collaboratively. Georgia State University is responsible for teaching the adoption of competence training and that is more around training our professional staff on how to manage and work with our adoptive families and our staff around the specialized needs that they may have. In our TAG, the Teen Adoption and Guardianship Support, this is our newest support program and it serves more so as a support program for teens who have been adopted and youth who are, who have achieved permanency through guardianship. We have created this support to be able to manage this particular population without these kids having to return to agency custody, but we can provide services to them in the community that's managed by someone outside of defects. This is just the Attic Lance view of the adoptions that we actually finalized. You will see that in 2023, we finalized a little over 1200 adoptions for the year. It actually is getting closed. We didn't turn off that. Go right ahead. So you said you've been doing this for 29 years, so thank you so much for doing that. That's pretty knowledgeable. I've noticed in the however long I've been practicing long 27 years that the non-recurring adoption expense has gone down from $2,000 to $1500. I don't remember what year that happened, but it's probably been about 10 years, I think. I haven't kept up as much with the monthly expenses, but I feel like it's always been around $400 dollars-ish, and that's what you're showing now. It's like $441. First of all, I guess my first question is, has it just stayed the same for the last 25 years, even as the cost of living has increased exponentially? And do you feel that that's an impediment to foster families and adoptive families? So it has been a shift from what used to occur is of course when the caregiver decides to adopt. When they signed a adopt for, when they signed papers to adopt, then the rate that they were receiving would transition over to the rate that they would see as an adoptive parent. That was beyond to go. We haven't seen a rate increase for adoption assistance in several years. That has been a barrier in terms of especially around the age category, around the 24 months, because some families, the child may not have any identified special needs currently, but the concern is what may happen down the road. There is a rate differential in terms of what folks may get in foster care and what they may be eligible for in adoption assistance. And by that, you mean it goes down. It goes down. It goes down. Yeah, it goes down. And so, yes, that can be a barrier to permanency. Okay, thank you. Keep going. Are you done? Oh, yeah, I'm sorry. Testing. Okay. Oh, yeah. So this just gives us, give you an idea of the number of adoptions that we finalized in 2023. And there was a slight decrease in 2020, but we all know what was going on there. And, but I do want to note that in spite of what was occurring with COVID, that we were able to maintain around the 1200 range for finalizing adoptions, the staff were able to adjust quickly to ensure that kids were still finalizing permanency. So, and this just gives you a monthly glance of what the work looks like in terms of finalized adoptions. In June, we finalized 91 adoptions. That's June 2023, just to give you an idea. And then this is just an adag lands from April of 2021 through May of 2023. Thank you. Okay, any quick questions from the committee? Testing. Just back to Julie's question. Sorry. So who determines the rate at which the foster parents receive compensation versus the adoptive parents? Again, is that a question or is that a federal situation or is it a department? So we determine the rate. The department does. Yes. Well, let me correct that. So the basic rate is generally set, which is what I showed you earlier. The categories one, two, and three are set by the agency. So we have staff that actually, that's what they do, is review the needs of the child, the parents capacity, and determine what rate should fit that particular child's need basically. Right. So you're saying the categories, I guess, but I'm asking who determines the amount? So that's that's the state. So that's I believe that's a letter. Yeah, that's so that's us. That's the Georgia. Yeah. Okay. Thank you. Yeah, just quick. So the numbers for the number of adoptions don't exactly match what Dina presented.\n\nin terms of exits for adoption. And so just for the committee and back to Senator Jackson's point about this issue of the rates for reunification versus adoption. And there's lots of movement in all that, which I am hoping our committee can kind of get a handle on. Because over the course of the pandemic, there were less kids that were actually placed in foster care. Georgia, Dean of mentioned, is in the low range, achieved this low range of placement. But also with that comes a cost that the kids who are placed are more commonly, it looks like going to have to be adopted or not reunified because of the severity. And I'm assuming that it's really important to get that balance right of the number of kids identified so that the AJC articles don't happen because there's not enough kids who are getting recognized and helped and so forth. But I just wanted to flag that that we want to reconcile those. And then just one last question, maybe for coalition or a bros. But she mentioned that a summer ago or whatever it was, the number in the hotels was down to 20. Now it's down to seven again, but the school years upon us. And if I understand it right, there's about a one month stay in a hotel on average for every kid that's in the hotels and you were at 96 and then dropped it to seven. Are you help us to understand? Are you worried that it's going to, I mean, it has to come back. If that's the rate that kids are pouring into the hotels and you were able to get them moved, do you think that that's a permanent fix for all the kids that are going to be 96 per month that are going to be knocking on the door of a hotel stay? Or how do you see that? Do you want to come back up first? Sure. I think that's why it's important for everyone here to understand that certainly Georgia is not the only state that hotels or locality that hotels or keeps kids and offices. Some other child welfare agencies have a different problem. They have children that are sitting in detention or they're sleeping on a cot in office, whereas we generally blame more toward hoteling, at least it's from our perspective. It's terrible. It's something we don't want to do at all, but it's a safer situation. And ultimately, we may get to zero when it comes to hoteling and effectuate every policy we can to make it very hard to hotel a child, but there will be children where we just are going to struggle to find the right place and they're going to be the ones that have developmental disability and intellectual disability. They have prior involvement with the delinquency system. They just got released from detention. Parents are saying they can't come home. And so it may be that there's always a sort of an uptick in the number of kids at the start of a school year that we can't find the right placement for and we struggle to do that as quickly as we can in the summer. Senator Cain. This is a question I thought of earlier, but those kids in de-fascare or who have a TPR, what percentage of those kids also are involved for the juvenile court to do delinquent behavioral issues? I don't know the answers to that because, and up until very recently, I don't know that there's been as robust of discussions between our agency and now DJJ to get access to their systems. Fortunately, we are in those discussions as we speak, so we're about to have an MOU finalized where we can actually see those real numbers before we only had it on an ad hoc basis. I mean, the reason I ask questions is because, I mean, these kids are, I mean, we're, though that's, I think calls for why it's harder to get these kids placed in an adoption with because of the behavioral issues that are often stemmed because of what they've been through in the trauma that was not their fault that they got stripped from their home and thrown into a foster care home, and then they might bounce because of their behavior and not addressing that change. They bounce from foster home to foster home that first year, and then we've created more of a problem with the child than what we really solved in the end. That's why I'm just, you know, I think the two do go hand in hand, and I'm glad that you're working with these DJJ to kind of open those lines of communication because that to me is those, if we're not wrapping around that here, wrap around services, those speak, then when we're not doing everything we should be doing at the local level. And I'll just, I'd be remiss if I don't say this because so many judges have asked me at the right time to flag this very specific issue for you guys that when there's a question about the child's competency, now those are the toughest cases because it is not at all clear who is supposed to be leading that case, who's supposed to be evaluating the child, restorability, I mean, it, the whole system is complex and as it is that you've heard today, when you have a case like that, it just sort of almost falls through the cracks and no one really has a good answer for those cases. Well, and the reason I say that's because I have a lady of my own community and she had a young brother and sister and a family of 20 years, but they came into her home and then they went to two more homes and then so eventually within a year they came back to her home and she said and what she just saw in the little boy specifically was he was outgoing in the beginning, but by the time he came back, he was literally laying around in the Imperial position with his thumb this month. And that's just, that's something we need to ask for. And underlying what's and the necessity of placing or adoption being the ultimate goal, ultimate goal is what's in the best interest of the child. And we need to always make sure that we got that focus on that even more than, you know, adoption or whatever we need, whatever that child needs. And I'll say to you just a dovetail a lot, but not a lot, but I would say the fact that when we look on any given day at the milieu of children who were who spent a night in a hotel, it is surprising at least to me that when we trace back their history, there is, there may be an adoption that dissolved. Okay. Last question. Yeah. Ma'am, I want to thank you for your presentation. I appreciate that. You said 1281 were the adoptions in fiscal year 2023. Okay. Okay. Now, those aren't counting private adoptions, correct? That's correct. Do we track those? No, it's a little more a challenge to track the private adoptions. No, we don't. And so we've got a lot of kids here in Georgia that are being adopted that we may not be fully understanding the circumstances now. That's correct. Okay. Thank you so much for all of our speakers from the Department of Human Services. Very, very important information. We really appreciate it. If anybody needs a stretch break, feel free to stand up. We're not going to take a formal break for the committee. There are lunches down in the meds name if you are starving. And we're going to keep rocking. We've got Jerry Bruce from the Office of the Child Advocate. If you'd come on up, that'd be great. Yes. Right ahead. Test. So you can see if it was morning or afternoon. Good afternoon. Okay, your mic's on. Thank you. I'm Jerry Bruce, the Director of the Office of the Child Advocate. Just to give you a tiny bit of context for the remarks I'm about to make. I'll just tell you a little bit about myself. I started out as a felony prosecutor in Georgia, including at Stennis, a special drug prosecutor where I did was basically prosecuting meth crimes. And then I became a special assistant attorney general for defects. And I moved into that work from prosecution because I saw the opportunity to use the court system to actually help people, which was an amazing idea for me. So I left being a prosecutor and went to work as an attorney for defects, which I did for about a decade before becoming the juvenile court judge in one of the jurisdictions in which I had been a SAG. In order to keep working in system improvement after being a juvenile court judge, I went to work for the Supreme Court of Georgia and its juvenile court improvement program as the director of that program. And I went straight from that upon the appointment by Governor Kemp in June of 21 to be the director of the Office of the Child Advocate. So I've done a lot of work in juvenile court over the years. It's basically all I do. And other than bicycling, that's about all I think about. So my hope I can be a resource for you all and happy to answer questions. I'll try and keep my remarks at sort of a high level if I can because you've heard a lot of details and specifics. If you have specific questions, I'll be happy to try and answer those. But one of the first thing I have to know about our child welfare system is that it's extremely reactive. If you look at, we've been keeping data because of prods from the federal government about our child welfare system since about 1998. We had data before. We've been systematically reporting data since 1998. And over that time, the one thing that's become clear is that we have an extremely reactive child welfare and foster care system, which is unfortunate. It's understandable. Everybody today has talked about the AJC and winding up on the cover of the AJC. You can look back historically and you can plot major news stories in the AJC where there's allegations that defects is not protecting enough kids and we start taking more kids into care. And then we get to a peak like we did in about 2004 with almost 15,000 kids in care. We don't add case workers, we don't add resources, we don't add foster parents, we just put more kids in care. Then the stories start being stories about kids being injured in defects custody or not being properly cared for. Then we have to start reducing the numbers of kids in care, which we did from about 2007 to 2010. Then you start having the same original stories again. We increased back to 15. We went from 7,000 to 15,000 over about a four-year period ending in 2018. So when we're almost doubled, we doubled our foster care population in just those few years. And now we're back on a downside because we have a perception that our foster care system is overburdened, which it often is. So defects, I think, I'm going to go on a limb and say that defects has probably the most difficult job of any state agency because very few other agencies have to be in the spotlight as much as defects constantly having to navigate the objective questions of assessing child safety and well-being with the public aspect of this case. And of course, there's no news stories about the good work that defects does. There's no news stories about the reunifications that happen, the services provided, the work that the case managers do. You only hear about the really bad stuff. The opposite child advocate was established in the wake of the Tarell Peterson case that Ms. Krim mentioned in order to be an on-budsman agency for the child welfare system. So our job is to receive, investigate, and seek resolution of complaints that children who've been served by that system have been the victims of failures and to follow law, policy, or best practices, basically. So the only stories we hear are allegations of mess-ups, primarily by defects, because they're the largest child serving agency in the state. And so we spent a lot of time working with defects to identify and resolve these issues. And one of the reasons that we have such a reactive system is that we have a real lack of objective data about our child welfare system. So I spend almost all my time going around the state, training and talking to judges, defects workers, and the lawyers, and causes and others who work in our juvenile court system. And I spend a lot of time looking at the data that we have so that we can be data-driven, because some of you have medical experience, and you know that the way you feel at any given time is not necessarily indicative of your objective state of health. You need those blood panels. You need the data to get a better idea of that. And it helps you be a little less reactive. You may think something's really wrong. It may turn out that nothing really is. You may think that everything's great, and you may be in real trouble. It's hard to know that without data. So you just asked a question a minute ago about how many kids currently are both in and currently involved with DJJ and DFAX. That's information that DJJ has on the one hand. Information that DFAX has on the other hand, they know who's in their own program. That's information that juvenile courts have. Every juvenile court knows that it's got kids who are duly involved. We have no centralized data system for our juvenile courts in Georgia. We ought to be able to just, I'd be able to pull up a report and answer that question in five minutes. I can't do it. I can't tell you how many pending termination of parental rights hearings there are right now. I can't tell you how many kids with terminations completed or awaiting adoption right now. DFAX has some of this information, but they only track it incidentally because they're tracking kids' cases, right? So they happen to track what goes on in courts. But until we can answer the question objectively about what's going on across the state and our courts with a statewide data system for juvenile courts, we're going to be guessing about a lot of this stuff. And the problem with guessing about our child welfare system is like the human body. It's a system of systems all in a related in ways that sometimes aren't immediately apparent. And you pull on a string over here and something starts moving over here and you're thinking, how did that happen? Because it's a very complicated system. If you don't have data, we make bad decisions. Or we make ill informed decisions. Or we have policy by publicity, which is certainly not a good way to handle a child welfare system, dealing with a fundamental right of parents to have a relationship with their children. So that's one of the first things I would say. I mean, we've got to have a way to know what's going on in our juvenile courts across the state. And we currently don't have that. The other thing we really need because we have this reactive system is an objective way to measure and assess risk for kids. The two big shows that defects has to constantly navigate between the silo on the one side and the caribouus on the other is missing a kid who needs to be brought into care and having something bad happen to that kid. On the other hand, it's just as bad for children's well-being in the long run to be brought into care unnecessarily. So they've got this very difficult shows to navigate. And we don't really have, defects is a lot of training. And I'm involved in some of that of its folks on assessing risk. But we don't have an objective risk assessment that we use in our state to help objectify some of those questions. The legislature has actually looked at that. And you'll have seen fit in the context of our delinquency case is to say, hey, we don't want to just be putting kids in confinement based on somebody's even educated opinion. What we want is an objective risk assessment before we do that. So we now have that, thanks to the work of the legislature is done. And I think there ought to at least be a conversation about how our system could benefit from having a dependency equivalent of the detention assessment instrument that we use in delinquency cases in our dependency cases to more objectify the question of which children need to be removed, which children don't. So that we can better use de-faxes sometimes stretched resources, right? So we can better take care of those things. So that's the first thing I would say. Data is very important on a number of these levels. The other big overarching issue that I'll point out because we watch a lot of court, a traveler on the state, watch courts in practice a lot. And one of the biggest reasons that we have cases that linger and children who stay in care for a long time is because we have, it's not over reacting to call it a crisis in advocacy in these courts. Every county in this state is paying lawyers to sit in de-fax cases is necessary. It's important. I think we have one of the best juvenile codes in the country. Thank you very much for that starting in 2014 when that went into effect. And it required advocates to be present in court representing parents and children and the state, obviously. And we have a lot of research now that's coming on, especially a large study done in Washington state that says, you know, a lot of people think, well, you get more lawyers in a case, then things are going to get bogged up. They're going to slow down. But actually, the Washington state study showed that effective advocacy moved cases along. Our office has a pilot project that we're working with Chatham County right now to draw down federal funds to reimburse them for the cost of child attorneys. And in the first year of that program, we reduced the average time children in care by about 10 months. Because you've got someone always pushing and asking and making motions and keeping the case on the front burner. Across the state, I watch courts where attorneys sit and don't do anything. They haven't talked to their clients before court. They haven't talked to their clients during court. They found their motions, they make no objections. And these cases just go on and on and on. So these are three big areas that y'all can look at that would have a large overarching impact. Data for our juvenile courts, a more objective way of assessing risk for defects and more zealous and effective well-trained advocates in our court systems. So I'm happy to delve into any of that. If you like or answer any questions related or unrelated to that, as I said, I do a lot of work in data. I don't have it all in my head, but some of it I do. Thank you very much. I have a couple of different questions for you. Yes, ma'am. First of all, we do have something called the Georgia Data Analytics Center that lives in OPB. Yes. Do you feel that would be an appropriate vehicle for bringing the juvenile courts on board? I think that is, that system is tasked with a different task than what we're talking about. We're talking about being able to look at specifics on individual cases. And you know, that's, I mean, I don't know, but my guess is that that system would not be tailored to what we're looking for to have as a juvenile court reporting system. Okay. And then the Chatham County project that you mentioned. Yes, ma'am. Someone wrote a grant for that and pulled on those federal funds. Is that something that we could enlarge on? And yes, in fact, the something to my office is really working on. And we've been working on for a couple of years. So for the, in 2018, you may know that a large chunk of our child welfare work in the state is financed by reimbursements from the federal government under the Social Security Act, Title IV B of the Social Security Act to the tune in 2020 of some $150 million. So it's a lot of money that comes down. Starting in 2018, they allowed states to ask for reimbursement for the cost of having those attorneys for parents and children in court. The sort of quiproquil is you got to show some improvement in your ask of those lawyers. They don't want to just pay for a lawyer to sit there and check their emails all day long. So working with de-facts as the past through agency, we have an MOU with the division, with an MOU with the Chatham County juvenile court and with the Chatham County government. And they have invested in trying to sweeten the pot a little bit for those lawyers knowing that they can now recover a portion of that under their four E funds and we're coordinating their four E recovery for that. So Chatham County is now receiving money back up to 25% in some cases of their investment and their child attorneys, because it's based on a percentage. But right now counties are paying for lawyers and getting nothing back. We have a way now systematically to provide some money to counties to reimburse them for this if we can up the ante a little bit. So we go in our office goes in and provides initial training for these lawyers who are representing children. This is available for parents' attorneys too, but we're focusing on children's attorneys as the child's advocate office. And we're providing initial training, case consultation, things like that. Sometimes people say, well, there should have been a termination of parental rights filed in this case and never happened. So we empower those child attorneys if they believe that that's in their clients best interest and that's what their client wants to file the termination of parental rights, or to file the petition for permanent guardianship to really keep these cases moving. And so we've seen a dramatic reduction on the front end in the time children spending care and shadowing county in those cases. And of course, on the back end, there's dividends that you probably can't even quantify for all that. Sure, it costs a lot of money to keep it. One more thing before I open it up to the committee and that is you confuse me about the risk assessments because you indicated that we'd done some work in that area in the legislature, but that we still don't have what we need. So can you just go into that a little bit more? So the legislature's mandated just after our 2014 code came out then in delinquency cases. So cases where kids are being charged with what would be criminal acts if they're adults that before they get detained by a judge, the equivalent of being locked up basically, that the judge consider the results of a evidence-based, actuarially-based detention assessment instrument that scores the risk of that child on a more objective factor. It gives the judge some authority to use overrides. It's not up, we're not doing justice by computer here, but it gives them an objective consideration of the risk factors. They're also required to consider that at disposition of a child who's been adjudicated delinquent before determining what the sentence of that child is. So we have pre-adjudication and pre-lockup risk assessments. We don't use those on the dependency side when we're deciding whether to take a child into foster care or not. So that's something that is at least a, you know, this is a new conversation for the delinquency side, but it's something that at least is due some consideration and conversation. Okay, and just to sort of go back one more time, Chad, is that the only county that's doing that at the present? We're currently rolling out a program in Gwyneth County. We have a request from Troop County, and I've got several other counties lined up who are interested in this, and I've talked with folks at the Association of County Commissioners about this during the last legislative session. Let them know we were doing this and that we're trying to roll this out in a larger sense to the whole state. Okay, so you're getting the word out. Around the state. To the government. Doing our best, yes, man. Okay, other questions? Senator Robertson. Yes, thank you. Troop County is one of my counties, so I really do appreciate the best. And one of my concerns is we've had a, you know, great assessment tools out there for everything, addiction, and what I found is that a lot of them, and I agree with you 100% through, you know, and I started law enforcement back in 85 data was not thought about, but slowly as we moved into it, we realized very quickly that we become much better at managing public safety. If we pulled all the data and looked at everything, some things that really disturbed some people, but it had to be put in there for us to be able to be effective, not only in creating safe communities, but also in how we spent the tax dollar, the penny if you would. So I'm a little shocked because there are some computer programs that will get us 80% down the road, and then the last 20% would have to be the, those unique characteristics of each particular person to determine that risk assessment within there. So I'm excited about that because I know we just put funding in there to manage gangs throughout the state to allow every law enforcement agency, the attorney general's office at everybody to have access to the exact same information, so that we don't have so much redundancy in communities are overlapping or lost circumstances. So it's really increased that. So I'm a little surprised that there's not anything there that's handling that. And did you get us a copy of the Washington state study or get the link to the chair? Yes. The person so she can get that to us, we can look at. Yes, sir, I'll do that. Thank you. Jerry, thanks so much. So on the assessment of risk side for dependency and for child abuse and neglect, I'm pretty confident that such a tool could be derived. And I'm sure is what you think about that. If you were to take the same process that went into sorting this out for delinquency, there are information from a birth record that actually predicts child abuse and neglect, incidents and so forth. And that's just a birth record that everybody has. And then of course, the sort of best predictions that we have at the individual level, rather than group level, because individual prediction is much harder than group statistics, but gets to clinical level evaluations of families where you're on the fence, you don't know. There's a lot of risk at play. And it requires a certain level of clinical observation, not only of a child, but of a parent and a parent and a child together. So I guess my question is, do you think that that same process could be done here and to develop that kind of tool? Sure, there are a number of states whose child welfare agencies use and already used fairly successfully, not risk assessment tools. And those risk assessment tools look at different elements, different places in the life of a case, the risk prior to the question of whether we should remove a child or not, the question of risk while the child's in an investigation, all of those different places. And they all, the best ones rely heavily on the expertise of the trained case manager who's assessing the cases well, so that there's the human element and there's the more objective element. And they worked to sort of help one another. So there are systems in place and other states already that are doing it. And a Mississippi is in the process of adopting one right now. And those are ones that you think are sort of better than others, are the one in Mississippi, or I mean, could you share what you think are viable ones and should once and that we could look at together and really think about how we could help, move it forward here. Yes, that would be great. Yeah, one of the things that I didn't say at the beginning, and the addition to identifying the problems that we have and the current status, we're looking for solutions and we're looking for things that are on the agency side, the executive side as well as things that are gonna need legislation. So you guys are, there's a smart group of people sitting out there. So please feel free to share anything that you think would work with me and then I'll share with the committee. Other questions? So over the last two years, the legislature's really been pushing to update the GCIC data and that system. Is there a system that, or is that the proper system to use for the data you're talking about in the juvenile courts to allow entities across state to have access to that information? I guess that's part one and part two. Are there other states that have a system that you like that you've seen? So the first answer is that GCIC is very troublesome. It's not troublesome as a system, but it's troublesome for outside access or to tweak that because it's very nearly tailored for one thing. You know, as an ADA's office, we didn't have a terminal because it was so tightly controlled as a who can actually have access to that information, right? So I wouldn't think that adapting an existing system is designed to track the outcomes and criminal cases would necessarily be something that would work for us. I don't know off the top of my head what systems are better than other systems for that, although I have encountered some. I don't recall their names and I hate to sit in a public forum and make advertisements for companies that sell state data. Georgia actually owns a system in the judicial branch called the court process reporting system, which has been highly customizable. It's completely paid for by federal grant funds. DeFax has been working with the AOC on the judicial branch side to sort of build that out a little bit. Georgia Kasa has been working to build that out a little bit and to help us track Brincess court orders. You know, if I don't know if there's a court order in a case in Georgia right now, I can't find that out unless I go to the jurisdiction or unless somebody uploads it into CPRS. Fortunately, DeFax has directed the SAG's to upload the orders into CPRS. So we have a way of at least seeing if there's current court orders in cases. So CPRS is a system that already exists in which I think should be looked at as a way to, because it's not, it's a-\n\nowned by the, it's federally funded by federal grant funds. It's owned by the state. It's an open source code. It's not proprietary. Nobody's making any money on CPR. S but we're getting a lot of good results out of it preliminary. So that's one place to look to start with. So what would it take? Is it an act of the legislature requiring juvenile courts to upload these documents or what would you need from us to help you? You know, I don't know if I don't know if I just, you know, I'm not one of the people who leaves the legislation is the answer for everything, but it's certainly the answer for some things. And as a way of controlling the behavior of folks who work in legal systems, legislation works pretty well, I think. So I would, I would, you know, that would be a conversation you all can have with the Council of juvenile court judges about what's the best way to incentivize appropriate judicial behavior to ensure that court orders get uploaded. I mean, I think that the courts, the logical locusts for that, you know, court has those court orders asking the sags to upload them is great. But, you know, the courts could certainly bear some responsibility for ensuring that their data gets someplace where it can be appropriately tracked and looked at so we can have objective answers to these questions. Sorry, judges. Okay, that's. And just to just piggyback on that, is it just a matter of uploading of data in a reliable way or is it a matter of having the capacity and bandwidth to cross reference across state departments and across programs? Because I think that could cost money and time to cross reference data. So well, that's the, that's the big question because first off, you have to have this data. So the courts can use it. Secondly, you have to have it in some sort of de-identified way so that folks like legislatures and legislators and others can access it and use it to get. But de-facts, this de-facts reports a load of data with depersonalized information to the feds every six months. And that's the data that I use on most of my works. That's doable. The second, this, this question of agents, agencies in Georgia don't share information. They're all pretty siloed. But this would be a place where it could be particularly powerful. If state departments shared insuremation, yeah, you know, about outcomes and recurrence risks and so forth. Right. But it would require both to be at the table and individually cross reference data available. Yeah. I mean, right now this is done by MOU is basically one agency of leaderships that sound like another agent of leadership and they negotiated MOU and you get the data. That's how the AOC got data from de-facts was through a sort of first of its time in the country, MOU, between cooperating between the executive branch and the judicial branch to get data available in CPRS. So it's doable. But that's for only one analysis at a time, right? Like you have to specify the analysis and then once that's done, you got to do the MOU all over again, which was almost history. No, no, no, I mean, this, this MOU is ongoing. I mean, we, I mean, the AOC has been getting data in CPRS from de-facts. I can log in a CPRS and I can see any child who's involved, cord involved in the state. And I can get a glimpse at some aspects of that child's case based on the information that's shared not everything, but some things. And also depending on whether the local folks have been properly uploading their data and things like that. So it might be great for us to have a map of what, what actually can happen, what data actually is able to be cross-reference now. Sure. What isn't especially stuff that you guys feel like, you know, would be particularly informative. Sure. The, I mean, the stuff that the commission was just talking about being like de-facts being able to like pull up a kid's case or a judge being in a public case case and see if mental health services are being provided by another agency. Right now, those questions can't be answered, even though it resides somewhere in state governmental data. I believe it does. That's a statement I make on faith. Well, I think I believe that I'm just kind of answer that up. I've had more than 30 years. I believe a lot of this is because you're talking about cross-referencing is because a lot of you're talking about delinquent behavior in a juvenile court versus, you know, de-facts cases in a juvenile court. And a lot of that stuff can't be cross-referenced because of confidentiality of the kids in the juvenile court. And so therefore that's why a lot of this stuff is kind of kept close to the vest within communities is because of that confidentiality. Yeah. Although, of course, if you're sharing within the court system, the confidentiality doesn't really apply. The de-facts records are actually protected by more robust confidentiality laws than the DJJ records are unless the child's committed to DJJ. So we're already sharing confidential data. We know how to do that in the state. And we also know how de-facts is expert at sharing at depersonalizing large data and sharing it out into a public forum for like the federal reporting. Anybody can look at that data. So I mean, we know, I think we know how to do these things. We just don't know how to do them on the scale. We need to do them. I think the summary we do do GCSE own that scale. Yeah. And not having the terminal in there understand, but when you do have the terminal, there's auditing systems by the GBI and others that watch it. And plus only certain individuals are allowed to go on. Look at the information. Some can go on and look, some can go on and actually edit. Right. And so it's just the management of the system. Yeah. And I think so. And through jail management systems working with district attorney's offices and in my district, very well with law enforcement where they can all go on, but everybody's access is managed. Sure. And so there's fingerprints left throughout the system. And there are those privacy of criminal histories and other things. That have to be adhered to and I know myself and Senator Paine have worked in all those systems before. And I think you're absolutely on the right track of where we need to go with this. And I appreciate your testimony. Thank you. Thank you very much. Appreciate your time and we'll be in touch with you later. Okay. And as one of our judges said a little earlier sitting on the bench is what they do. So that's what they've been doing all morning. So it's your turn and we could get you guys to come up and introduce yourselves. Our speakers from the council of juvenile court just to judges. Good afternoon. Are you do you feel fire hydrant yet? Oh, yeah. Right. Um, yeah. I mean, you get flooded and inundated with information. And so do we. My name is Carolyn Alman. I'm the juvenile court judge in Pauline County. This is a judge what field formerly of Cobb County. Now a senior judge. And we are very happy to be here on behalf of the council of juvenile court judges. And just as a little bit of background, I've spent the last 15 years in child welfare law, represented parents, children, um, grandparents and did guardian and light and work. I also did a pellet work. And then the last five years have been on the bench. It is a privilege and they burdened to be a juvenile court judge. Um, and I thought, you know, when I got to be a judge like, oh, this will be so much better than being an attorney. And it is not. It is different. It is, it is very, very different. Um, and so this is the work that I've been doing for the last 15 years. It's a, um, passion and my profession. Um, there's been lots of really good questions that I've, I've been listening to from all of you. And I wanted to just back up for just a second. It's a little bit hard to go towards the end and kind of say, hey, I want to just step back for a second to just talk about some basics of what the role of the court is. Um, because you've all been hearing like, there's defects. This and officer, the child advocate and attorneys and guardian of the items and just stepping back because Senator pain, Senator hatchet, Miss Wasatsky, um, Senator Robertson, you've been in court. And if you've ever walked into a juvenile court, you're like, where am I? This is different. There are so many people and players who are involved juvenile court basically does two big things, right? Are we have children accused of committing crimes? Those are a delinquent cases. Children who have experienced abuse and neglect, those are dependency cases. And those are civil and criminal dockets. A lot of times we do run our calendars similarly, we group all of our delinquent cases together because that's one team of people that walk in. Then we group all of our dependency cases together because that's a different group of people that walk in. Then we have, you know, our miscellaneous and we group those cases for, you know, a wild Wednesdays, if or whatever the calendar might say. And, you know, when, when we have, you know, even listening to to Miss Walker, when she talked about, you know, we can defects can become involved in a family life long before it ever comes to court. And long before it ever comes to court and sometimes it never even has to come to court. So when a case comes to us in court, I promise you it's bad. It's really, really bad. And foster care, of course, is the most intrusive intervention that we can make. It's personal, it's precious. These are our private relationships. And whatever the crisis is has now been exposed, whether that's drug addiction, whether that's an injury, whether that substance abuse, whether that domestic violence, mental health that is just spiraled out. It's at crisis proportions. And so our families come to us in crisis. I think Senator Robertson, you were asking earlier like, who educates the parents, they walk in going, where's my kid? What, what, what, what happens next? In panic. And we need to kind of, okay, one step at a time, at a time, at a time. So that's, that's juvenile court. And then we have all these people at the table. And our juvenile court judges, we do what all judges do, right? In this very specialized context, but it's make sure that people follow the law. And make sure, and the law is complex. We've got the federal regulations, we've got the state law. We've got the constitutionally protected rights. We've got the appellate laws, well, and making sure that in all of these things that were, were balancing out all of these interests. And we're listening to people, we're listening to them closely to understand what really are the needs, what brought this child to court? And how do we get this child safely out of this system? And in fact, I think sometimes when we're talking about permanency, we hear that word a lot. And just kind of as a shortcut way to think about permanency is, the child comes into foster care. Permanencies, how do they get out of foster care? Did they get a home to a parent? Did they go to a relative? Did they get adopted by somebody else? Or did they literally turn 18 and walk out the doors? And that's why when you hear the conversation about permanency, permanency, permanency, if a person gets admitted to the hospital, you're going to start working on your discharge plan immediately, right? Person comes in, we know what, what caused the problem that brought them in here. We're going to treat it. And then we are going to send them home, hopefully, right? Always the goal. So in this, in this system that we have, we need to hear from all the parties because everybody comes to the table or comes to the courtroom with their side, their perspective, their story, their needs. And as judges, we need everybody to be best represented. So we get that information. I promise you the quality of judicial decisions are 100% dependent on the quality of the information we receive. Right? Okay. Thank you. Right? So we need everybody to be well represented to get that quality information and the child will have a perspective and the child has an attorney that saying, this is what the child wants. And then we have a best interest advocate often served by Kasa, sometimes by an attorney that says, the child may want to go home, but it's not in the child's best interest to go home. And then you have the parents saying, we want this, we need this, we don't want this, we don't need this. And then you have defaxing, this is our perspective. And everybody has to come to court to the table with their portion of the case. The judges are responsible for the whole case. Everybody brings their slice of the pie. We get the whole pie. We have to look at all the things and as, as Miss Crimes said, the child comes in foster care. First year, 12 months, there were six to seven hearings. And that's if everybody shows up the first time on time. So if a family comes in, we're going to be spending some quality time with them. And so there's, there's all the things, right? And child welfare, there's the short view, there's the medium view, there's the long view. A couple of things I was thinking of, you know, Dr. Constantine, you asked really early on, would better mental health services help? Yes. Absolutely. We need quality mental health services for children for teenagers or parents. Because we see people struggling with their children's behaviors. We're seeing parents struggling to manage their children because of their own mental health behaviors. We have a fairly good course of treatment for substance abuse. It's not always successful because addiction is a disease that is out to still kill and destroy. So it's not always successful, but we have a pretty good path when we have a substance abuse case. We know these are the things, these are the benchmarks that we're looking for. We are overwhelmed by what people needed mental health services. Don't really know. I can see you need therapy, not a therapist. I think mental health medication would help you. I don't know. Not a psychiatrist access to services, getting the appointments, getting them scheduled, getting them quality. Then making, I sometimes make people promise, especially children, when one of their conditions is, you'll take the medication. I was like, do you promise to take the medication? Yes, it prompts take the medication. Do you promise that if it doesn't work well for you, that you will tell your doctor you don't like it? And rather than just stopping it, you'll tell them that you don't like the way it makes you feel. Yes, I'll do that. Because we know these things are going to help and support. So sometimes it's that engagement, sometimes it's the services. And then we've talked a lot about our teenage population because the needs are high. And if anybody has any teenagers that they have parented or are parenting, that's a different set of parenting. And then when you have behavioral health needs, that's extreme parenting. And that's why they're in hotels. And where we have group homes is because we also need to work on our placements and recruiting foster parents and also having the respite care because sometimes everybody just needs a break or even a BA services apply behavioral analysis, which is a therapy we use for kids with autism. Because you got a kid for with autism and you have one at 16 and very, very, very different level of needs. And so I know that Judge Whitfield has also been listening as well. And we're just kind of giving you our overview to kind of say that like the needs are great. The services are needed as well. And I'm sorry, Senator Patrick. I thought you had a question. And so I mean, I'll let Judge Whitfield I'll certainly give his comments as well. But we want the Council of juvenile court judges. We do want to be a resource who want to be available to answer questions. We want to tell you the things that we've seen that have worked that haven't worked to identify with the struggles of our co-laborers and child welfare work because they are very, very real. I'm Jim Whitfield. I'm a senior juvenile court judge. And what that means is I spent my time on the bench as an active judge and I am retired, but appointed by the governor as a senior judge. So I get the unique advantage and perspective of being able to travel all over the state. Anytime a judge needs judicial assistance that can ask me. If I decide to, I can go and I usually do. I enjoy going over the state by getting the perspective of seeing how it's done in different places. Everybody's got different resources. Everybody has different personnel. The thing that I discovered pretty quickly is we may get a different route. We may go a different way, but we usually all end up at about the same place, which was very encouraging to see across the state. Now, we've talked about permanency a lot and that's the focus of the foster care. At one time, many years ago, a commissioner who will remain nameless, referred to permanency as no longer in foster care. So no longer in defects custody, end of story. We've come a long way since then. We now know that there's a whole lot more to it. Re-eification is the first and primary goal. Every case, every dependency case that comes into juvenile court starts out a re-eification case plan. Re-unite that child with the family or individual from whom they were removed. Here does not equal adoption. You know, adoption is not the end game if a child comes into foster care. That's not where it starts. It starts with re-eification. Adoption is one of the permanency options. You've got re-eification. You've got permanent guardianship. You've got the termination of parental rights, which then makes that child available for adoption. So it's just one of four permanency plans. The other is another permanent plan, live in a racial, which is a unique situation and older child, who is going to be probably one of those individuals who reaches the age of majority and leaves foster care without returning home or apartment guardianship. And there are some other resolutions, you know, living with relatives. But one of the statistics, central Jackson, and you raised the question, you know, 41% of re-eification. You know, the Mark Twain, Sawyer, or Will Rogers about statistics, their lives, and then, but you have to dig into the details a little bit. As was presented by the department, they do a really good job on family preservation. So they're working a lot of cases that never come into the court system. There was solving a lot of problems that never come into the court system. Those cases that come into the court system, as you as Jalpman says, they're the bad ones. They're the bad ones that don't have an easy solution to them. When you look at the fact that the easy cases aren't even included in the number, that helps explain it just a little bit. Miss Crimm mentioned the Permanency Report card that the AI folks did. She's dug into it. Wait. I've just kind of skipped the waves on it, but it is an interactive thing. You can reach it online. You can just put Permanency Report card and it'll come up. But I did a search on it and used re-eification. The entire cohort ages ethnicity, race, you know, the entire code within 18 months. South Carolina was number one. There were number one in re-eification. The US average was about 51%. Georgia was about 26 or 27 at about 50%. So we were right at the national average on this report. I changed that search criteria a little bit to adoptions full cohort within three years. South Carolina was 51 dead last. So they go from first to worst on re-eification to adoption. So you start looking at, well, the first thing I said was 51, where do they get 51, you know, and then I realized it's DC, DC. But, you know, so you have to look at where the numbers come from. What does it mean? If they are achieving high, high rates of re-eification, then they just don't have a whole lot of folks left down there for adoptions, maybe. So you got to dig into the numbers and try to kind of figure out where they are. So the data is crucial, but you got to understand the data when you get it. And it takes some time. And Mr. Bruce, you know, Jerry has data driven us, you know, in the directions we need to go, but you know, you have to spend some time with the data to figure figure out what it really means so that you don't miss and talk or something. You had asked questions, Senator, with regard to, what, what's, you know, how does the parent know what they're supposed to do? Well, the case plan that's developed by the department when a child comes into foster care. The department has to develop this case plan, case plan, within about 30 days. That case plan is like a roadmap for the parent. It's for them to know you need to achieve these things. Some of them are pretty straightforward, you know, maintain stable and adequate housing income or finances to support yourself and jump. But yes. The question is, does a parent understand the case plan? My question is apparent walking into the system and you can understand my perspective is a little, little gray because my, my, it's been a lot of time in juvenile court, but throughout the criminal justice system is most people when they walk in the courtroom, they do not know what their rights are. And it's that is, is my biggest concern once somebody in a black row, pens them a plan every man and woman knows what they're supposed to do better follow that plan or you'll be back in front of that man or woman explaining why. But my, my question was about being dumped into this system, where all these roads going in different directions and you have people are in a fragile situation. They're those terrible parents, I agree with that. I think there's a lot of some that are out there in those at risk communities that, you know, they're walking in blind. And so that was my biggest concern. We educating these folks from the front end that when they walk into the courtroom to know what their rights are as parents and have an idea of the system more so. I think there's a lot of people in the court judges are by far the most under appreciated part of the judicial that I've ever had to deal with, but I was with Aaron Cohen for, I don't know, well, years. So that's who I got to watch. We all love judge can. Try to get to that point. Yes, I think the parents do have an adequate opportunity to be informed whether they understand or not. I don't know, you know, it's a complex process. You know, the level of comprehension. I'm not sure. As Miss Bruce mentioned, you know, the attorney representation and the quality advocacy there. It's an area that I think we're making improvements in. I think that we are continuing to improve and need to continue to improve. We were having more, you know, it's a very specialized area of the loans, not something that everybody wants to get into. It's not very financially rewarding, perhaps, but it's it's something that that folks are very committed to once they want to get involved in it. You know, child welfare law specialist certifications from the National Association of Council for Children, you know, those CWLS certifications more and more attorneys are getting those. They bring those back home to their jurisdictions. They're sharing that those skills and those materials. So it may be a slow process, but it may be, you know, one that we can build more. As you're indicated, they have training. They've had guarding that item attorney training for a number of years. It's an area of focus that we from the bench. Always like to have good lawyers, good lawyers make judges work hard and I enjoy it. You know, I'd rather have a good argument from the lawyer than a lawyer that sits there and just says. You know, it makes the process work a lot better. As Judge Altman said, information in quality of that is directly reflected in the information out. And I just asking mentioned legitimations. I mean, that is one area that we have some concurrent jurisdiction. If there is a dependency matter pending in our court with the child, a legitimation can be filed in juvenile court. And I'm glad we make it look real easy. And that it's just a piece of paper, but we're paddling like heck underneath the surface. Okay, it is the exact same process as a legitimation filed in spirit court. Same pleadings to same service, the same proof requirements. Yes, sometimes there can be consent and agreements, which eliminate some of the evidentiary requirements, but the the pleadings are all the same, the new process is all the same. It just allows juvenile court to have that jurisdiction with it. And I know that judges are involved in additional training too. You know, we are constantly going for judicial education. We are, juvenile court is the only class of court in the state, which is required by statute to receive our mandatory judicial education through the conferences that the council of juvenile court judges in conjunction with institute of continuing judicial education. We put on conferences twice a year so that judges can get there required 12 hours of continued judicial training. Other classes of court, I'm not, I'm not suggesting that their training is not rigorous and valid, but they can pick and kind of choose now they have conferences themselves, but they can go to other places to get judicial training or to get their judicial hours. juvenile court judges only at our conferences. So that's unique to our class of court and statute focuses areas of training that we have to address in each of our conferences. Mr. Bros mentioned and we certainly work on this. We've talked about this. We will continue to talk about this. We look forward to talking about this, but those tough cases that sometimes land with the department's custody that may result in some hotel. The court must make at least a preliminary finding that that child is dependent before we can make a placement with the department. So it's not just because they need services or they need access to services. A classic example is, Chins child in need of services, a child who's habitually, a crew of a child who is habitually run away, a child who is habitually ungovernable at home. They may be before us on a Chins case and we may discover in the process of that hearing that what's going on at home is that child is being abused sexually abused by the stepdad or the boyfriend or whoever might be there. That's just an anecdotal example, but now I'm faced with right now, right here without a chance to go do anything else. I'm faced with, do I see in that child home or do I try to find some safe place for that child. So that's unfortunately sometimes where we find ourselves and it's a difficult situation for the court and a difficult situation for the department and\n\nYes, those are not huge numbers, those are not huge numbers, but when it happens, it's an emergency. Something's got to be done right away. And sometimes those are the children who have the most difficult behavioral issues or undiagnosed untreated mental health issues. So they create challenges of further department for the court system, you know, and for everyone that's involved. Any questions for us. I know that there were a lot of things that have been presented about the court system. We're more than happy to answer any questions and be available to you at any time. Well, we're happy you were able to join us today. And obviously you know that we spend a lot of time on chins. During the last legislative session working with the department and we appreciate your counsel working with us on trying to come up with something that's fair because everybody knows these things happen Friday afternoon at five o'clock. It's just the way that's. Questions from the committee. Thank you all for coming and sharing that with us and helping us paint a better picture of what goes on in your core rooms. I know this is the committee for adoption and foster care, but I think y'all are obviously right in the middle of all that. So my question is essentially what specifically if you can come up with something. Do you need from the state in the way of resources that would. I guess. Improve the. Improve your courts period. What do you need from us? So. I'm pausing because it's. Because that will get to the issue of funding. That's fine. Yeah. Well, one of the challenges. And that's why I work here, right? So one of the challenges that we've seen over the last couple of years is there's increasing burdens. Do you need to this? Do you need to do that? Do you need to do this? Defects. You need to do this. Defects. You need to do that. So there's no funding to support it. And an example. This is a great thing. All children must have an attorney. Fantastic. How are we paying for them? So if if there are provisions that are included. If there are any other. If there's a new requirement. You know, director Bruce was talking about having a centralized database system. I think actually it's a good idea. But who's going to pay for it right now? The counties are responsible for their own court management systems. So. All he uses a different one than cob, which is a different one than fold, which is a different one than chat. And then there's some stuff that does talk to each other and some stuff that doesn't. And then the administrative office of the court says, hey, you need to give us all this data and we do. But if there's a new requirement, right? Like, oh, hey, handle this new class of cases. Great. But juvenile court doesn't take filing fees, right? So we don't have our own separate pool of money for it. And even with the Chins cases, I think the Chins cases is a great example of we literally created a whole new category of jurisdiction. And then didn't think about. Do we have enough judges? Do we have probation officers? Who's the point person for it? It's a great. It's a great model because it's those are our entry level cases and I'll just tell you pretty much any Chins case will end up either an dependency track or a delinquent track. It's the precursor, right? So be great if we could stop the tide before it overwhelms. But then who's paying for it? So I think that's kind of one of the challenges. And when we talk about the need for quality representation, whether that's children's attorneys or parents attorneys, then who's paying for it and doing all courts. A good paying court is $100 an hour. So we attracting quality representation or bringing more in house or having dedicated attorneys and one of the reasons why things take so long as I have a case right now, where I've got six attorneys. They practice in four different counties. And I'll say, OK, we didn't finish today. Can we come back? No, can we come back? No, why? Because they are hustling to be in multiple counties so that they can eat. And nobody feels sorry for lawyers. I know. But if you want to know what some of the delays are. It's finding the people as as Ms. Creme pointed out, like in Cobb, they have dedicated attorneys so that we know who the warm bodies are so that we can do our cases one at a time. So I would ask if you would be mindful that if there's a new mandate for what the juvenile courts need to do that there's a funding that goes with it. I will say that things that we can do to increase services, there's mental health services, the placement stability as well. It will make our job easier if the services are available. I mean, the courts will run better. The cases will run better. The family will will be healthier. If we have a parent aid who's not two minutes out of, you know, their internship. So we have a quality services that we need. And I think if we had a better access to services and identify them and having them qualified and paying for the services, I think a lot of our internal court frustrations would decrease because that's that's a struggle that we have. So I don't know if that helps. Thank you. Thank you very much for being here. Thank you for your presentation. Thank you. Okay, last week or two weeks ago, there was a meeting in Charleston of the Southern legislative council. And there was an excellent panel on child welfare. And so we picked off a couple of speakers from that meeting who are joining us today. First, we're going to hear from Roger Moore from the Southern legislative conference and he's going to talk to us about some interesting things that we need to know that other states might be doing and a little bit of a look at our data that we got from the Casey foundation. So Roger. I think Emily's pulling up your presentation right now. Okay, great. We've got one more speaker from that meeting after Roger and he's going to join us by zoom and that will wrap us up. So there we go. Thank you for being with us. Yeah, of course. As the chair said, my name is Roger Moore. I work with the council of state council of state government, Southern office, which is frequently known as the Southern legislative conference. I'm going to take a step back a little bit from everything that you've heard so far from all the great speakers and ultimately provide high level. What do you sign? You can just if you want to just go to the slides. That's easier. Yeah, so I wanted to provide a high level overview of some national and state data as well as some examples of recent actions and initiatives that other states and localities have taken. And then lastly at the end very briefly, just give you a couple of ideas that you might want to consider that were passed along to me by some foster care policy experts as potential solutions as you move forward in this process. So first I'm going to start with some data. Everything I'm about to show you comes from the US Department of Health and Human Services Administration for office and families. It's part of a data set that's released annually. Called the administer, sorry, called the adoption and foster care analysis and reporting system. The data you'll see here today comes from November. It was published in November of 2022, but it actually represents data from 2021. So I understand it's a little dated and I do know that federal data sets can often differ from state based data sets. But I do think it is helpful for comparison purposes, which is what we'll be doing today. So to start at a national level in 2021, as you'll see there, there were 391,000 children entering the foster care systems across the country. I should note that that actually marked the fourth consecutive decline, fourth annual decline that we saw. So overall, I think that's a positive, but there's an important caveat there that I'll mention shortly of those 206,000 entered foster care in 2021 and on average, nationally, a child spent just slightly less than two years in their state's foster care system. Moving on figure two here shows us again nationally, the number of children who were adopted in 2021 from 2019 to 2021, as well as those who are waiting for adoption. The orange bar there, you'll see the number of children who are waiting for adoption. That actually in 2021 was 113,000, which represented the lowest point that we've seen since 2015. And meanwhile, when you look at the blue bars that represents the number of children who were actually adopted between 19 and 21. There, you'll see in 2021, it was about 54,000 total children adopted, which was a decrease of about 6% from 2020 and a decrease of almost 20% from 2019. Overall, what does that tell us it shows the imbalance that does exist between number of children who do eventually become adopted and sort of the need that is still there because you ultimately have about two children waiting for adoption for every child that is adopted. And one other thing I'll mention about this, you know, the numbers have declined, of course, but when you consider the fact that there were fewer overall children and foster care and X-Ting foster care, the percentages for both of these really are in line from all three years, 1920 and 21. So on a relative basis, there hasn't been much of an improvement in that regard. Now, the next metric I'm going to highlight and it's I'm going to spend a little bit of time on this one because I do think it's important. Certainly, you know, the total numbers entering X-Ting the foster care systems are very important. However, it's not the only thing is we've heard the past few hours that we should consider. I know many experts say that, you know, a lot of the reduction we saw during the pandemic years, you know, wasn't necessarily. You know, fewer children needing to be entering the foster care system, but the fact that they were more likely to be at home and not in, say, school or doctor's offices, where you have professionals mandated to report any potential abuse or neglect that they see. So with that, I, you know, I'm going to move to the time and care. So when we look at figure three. In 2021, exiting the foster care system, we had about 200 and 15,000 children. As a side note there, I'll mention about 47% of those exits, we're due to reunification with the families, which is we've heard is ultimately the ideal outcome. Another 25% were due to adoptions and about 12% were due to guardianships. Now, importantly here, within that about half were in, in foster care for three to four years, which everyone agrees is too far and then too long. And another 10,000 children nationally were in foster care for five years or more. And then lastly, not mentioning here the chart nationally, there were about 20,000 youth who emancipated from their state's foster care system. So they aged out ultimately didn't weren't reunified or, you know, you know, you know, fight with an adoption family. So sticking with the time and care here. The next few slides are a little heavy on the charts, but bear with me. I do want to go through them in turn, because I think the data as it's reported by the Department of Health and Human Services does tell us a story. So when you look at the total number of children in foster care at the national level on average, as we saw on that slide, just a few moments ago, the average amount of time they spend is 21.7 months in Georgia. It's about 24 months, which is, you know, 10% higher, you know, certainly something that should be addressed, but it's not an extreme discrepancy. And then I also highlighted for you sort of the extreme end of the spectrum, you know, of the total number of children in foster care who are there for three years or more, you'll see that nationally, there were about 12% of the children three to four years and another 6% five years or more compared that with Georgia, and it's about 25%. Again, it's a little bit higher, but you know, it certainly could be worse as we see in other states. I'm going to compare Georgia now with three surrounding states, excuse me, three surrounding states, South Carolina, Tennessee and Alabama to give you an idea of how the state fares among your neighbors. As we saw 24 months in Georgia, you compare that to South Carolina, South Carolina is just slightly under the average children foster care there for about 21.2 months and looking at the longer end of the spectrum, you have a total of about 18%. You can't read that 18 or 20% of children there for three years or more again versus 25% in Georgia. Similarly, same story in Alabama, Georgia is a little higher to 24 months compared to the 18.3 months in in Alabama, and then you have about 14% of children in Alabama who are in foster care for three years or longer versus the 25% in Georgia. And then lastly, Tennessee, you look at a thing that 16 or possibly 18% of children in Tennessee are in their systems for on average, sorry for 18 months versus the 24 and then again, Tennessee does quite well. It seems at limiting the limiting the amount of time that children spend in their foster care systems, it's only about 11% who are there for three years or more versus again the 25 in Georgia. So just based on that limited data that we see, I think the overall story is that Georgia forms a little bit under the average, a little bit worse than the surrounding states, but it's not, to me, it's not an extreme discrepancy. The narrative changes, however, when we look at this next metric. So this is the time and care for a children who are actually awaiting adoption and health and human services defines that as, you know, children identified as those who have an express goal of being adopted and or whose appearance rights have been terminated. So when we look here, nationally for children awaiting adoption, it's about 21.9 months that they spend in their foster care systems for Georgia, it is, it's almost double that it stands at about 41 months. So that is significantly higher. And then again, when we look at that three years or more, it's about 20% total at the national level, 12% of children, three to four years waiting for adoption versus about 8% at five years or more. And Georgia, those two combined it equals about 53%. So again, that would be more than double the national average. And we, similar story with the states, although the discrepancy is not quite as wide in Georgia on average children, wait about 37 months to be adopted. And then in Georgia, it's again, 41 months. And then you look there at the bottom, a total about 41% of the children in foster care waiting adoption. I've been waiting for three years or more. And then in Georgia again, it's 53%. And then lastly, in Alabama, you look at the average amount of time, it's about 31 months, children in foster care, wait, wait for adoption versus the 41 in Georgia. And then at the bottom, 31% in Alabama versus 53% in Georgia. So when I was going through the data set there, I, there's a lot you could highlight these are just two, I mean, obviously the federal government provides a ton of information. But this one really stood out to me, I was going through and I noticed that that discrepancy there with Georgia was significantly higher. And I think it's certainly something that can be addressed moving forward as you consider potential solutions here. Okay, so that covers it for the national and the state data. I now want to move on. And I, I think there are a couple bills here that might interest some of the committee members based on the comments that I've heard today. So I'm going to give you three states examples or two states in a district. First, we'll start with Texas, a fellow CSG South state. I'm going to move on to New Jersey with a pretty innovative initiative. I think that they've implemented there. And then lastly, Washington, DC. So with Texas, I guess I should, I definitely want to say at the outside, you know, the state is not a model, you know, the state does not have a model outcome for its foster care system. It's, it's experienced a lot of the same issues that you all have talked about today that exist in Georgia. And in fact, the state was subject to a years long federal investigation, which ultimately found that the state invited the constitutional rights of foster children and even more seriously about, I think 23 or 24, 23 children had been found to have died while in foster care custody. So very serious allegations. The state was mandated to begin implementing reforms, which it is still doing. So I'm going to show you three barrels here. The first one was passed in 2021. And it's HB 567. And this was actually, it got quite a bit of attention when it was passed. This, the state ultimately decided to change the definition of neglect. Essentially raising the threshold that's required for removing a child from the home, from substantial risk of harm, which was the previous standard to imminent danger. And there were two themes, I think, behind this bill and what the supporters really argued for and ultimately success successfully. One, you know, you only want as we've heard today, you know, staying with the family is obviously the ideal outcome, if at all possible. So, you know, we only want to remove children from the home for under the most extreme circumstances. You know, for many children, even under less than ideal situations, it's still long term beneficial for them to stay with their families, rather than going through the traumatic experience of being separated from them. And the second theme, and this one is still still being talked about very heavily. The, the bear wanted to differentiate between, you know, on the one hand situations that should call for the child to be removed from the home. And the other hand, other issues, specifically poverty related issues such as food insecurity or housing instability, which people often associate with neglect. And certainly those types of environments are, you know, they're not healthy for children and they often don't lead to stable outcomes, but at the end of the day, you know, the bill sponsor said, you know, housing food, whatever it might be, you should not fall into the purview of a child protection, child protection service agency, but in fact, should lie with other community supports or social support services that can, you know, provide the resources to families so that they can raise the children, you know, stable healthy environment. And, you know, I'll say here, the, the bill has added a media and quite drastic impact in 2020, you had about 16,500 children were removed from their homes in 2022, just one year after the bill passed that number fell to about 9600. So about a 40% reduction. Now, of course, the counter argument to that is, you know, the situation for many children hasn't actually improved. It's just that, you know, judges and others have less discretion now because of the change in the, the statutes to remove the child. And that's a valid concern. And, you know, I, I won't speak at link to that. I will say HP 567 did receive broad bipartisan support in the Texas legislature. I went back and looked at the vote and I think only about four or five members in the house and only two or maybe two or three in the Senate, objected to the bill. So it was a bipartisan bill and, you know, ultimately, I think it'll take a little more, a little more time, a little more data to determine, you know, how is old, what effect it ultimately has. Moving on, the next two bills here in Texas were both passed very recently during the 23 legislative session and they both, I believe both go into effect September one. So it's still very fresh. The first one house bill 63. It ends anonymous reporting of child abuse or neglect. And with this one, the goal was to reduce the number of false reports received by the Department of Family and Protection Services. You know, people argued that a lot of the calls that came in were disingenuous, I'll say, and we're in fact, as someone trying to punish the parents or the families for whatever reason. And I guess, you know, in some respects that the data may support that you look at 2022, there were about 12,500 anonymous calls to the state of those a little less than 1000 actually led to a substantiated finding of abuse or neglect. And so now beginning September one, the DFS agents will be required to obtain reporters identity that includes the name and address and a phone number before a report is submitted. Of course, that information will still be confidential. It's not going to be shared with anyone who's accused of abuse or neglect. And with this one, unlike the other, it, it certainly passed on a party line vote. It was mostly supported by Republicans, most Democrats objected to it. There were, I think three or four Democrats that sided with Republicans there, but this one was much more contentious than the other. And again, the counter argument there is that a lot of people who, you know, may have reported before anonymously, now, maybe they're, they won't do it because they have to provide that information. So again, this one goes into effect September one. Moving on again from 2023 session, we have hb730. This one might interest a couple of the members here, I think. So this one, beginning September one, this will require case workers to notify parents, accused of abuse or neglect of their legal rights at the outset, including their right to an attorney and a right to refuse to answer certain questions. You know, in Texas and I believe in other states, there's no court order mandating unless there's a court order mandating otherwise, you know, parents certainly have the right to refuse entry into and home. They have the right to decline drug tests and mental health evaluations. However, the state found that most people aren't aware of that. And in fact, in Texas, and I imagine it's probably similar in other states. And so, what are parents were are not represented by an attorney until the state actually takes the family to court to pull the child from the home. And so really this bill was an effort to try and provide a little bit of two things to provide a little bit of balance. And then we give more rights to the parents. And then, well, actually that was the main thing. So you look here approximately 80% of investigations result in no finding of abuse, but of course the process is old can always be invasive and traumatic for everyone involved for those accused and the children as well. And then, you know, case workers can enter the home that can conduct private interviews, request those medical tests. So again, just to provide a little more support at the outset. And then lastly, 730, HP 730 raised the standard again, it made a statutory change from a good cause to probable cause of to for a case worker to gain a court ordered entry into a home. And then we get a little more evidence there that they're going to require to submit in order to be able to enter this one again like HP 567 and 2021 had a broad bipartisan support. I think that maybe two or three people objected to it, but overall it was it was widely supported. Again, these will go into effect at beginning of next month. So we'll see what what kind of impact they have. I fired the guest and some of the you know, the data will show it probably will have an immediate impact just like 567. So ultimately, the takeaways from Texas, you know, what are those bills trying to do 576, 63 and 730. And then we came to limit the number of children who are removed from the home to those who face the most serious circumstances. They want to provide more rights and resources to accused parents and then ultimately address some of the capacity issues that exist at the state. You know, case workers just were they're overworked as it is here in Georgia overwork, turn over can be high. So I was just trying to limit the overall number of reports are submitted to try and create a little bit of balance. I think there are valid concerns with provisions in each of the bills. But like I said, I think by and large when you have by broad bipartisan support, there's it tells you that there's I think some valuable information there to be claimed. So that's it for Texas. I'm going to move on here to New Jersey switching gears just a little bit. This one focuses on a I guess I'll say a different different specific area of the child welfare continuum. So New Jersey in 2004 implemented this program called the mobile response and stabilization services intervention program or MRSS. In 2004, it was sort of a core component of the state's mission to reduce. Reliance on out of home treatment facilities for children who are experiencing escalating emotional or behavioral episodes. Just as a side note here, something I did not realize until I was speaking with a foster care policy expert recently said. But a lot of the programs in New Jersey actually formed a lot of the influence behind the family first prevention services act. And so New Jersey is considered by light people to have a lot of good programs in place. This is just one of them that I'm highlighting. So through the MRSS program, a behavioral health worker is available to any family in the state 24 seven 365.\n\nof days a year to provide immediate support to the child who is experiencing an emotional behavioral episode. Moreover, and I understand this is easier and a smaller compacted state like Neutracy. MRSS workers are available within one hour to help de-escalate, assess, and develop a plan with the child and the family. It's, and then the last bullet is already mentioned who it's targeted. The MRSS program uses a four-pronged approach, first and most immediately, on-site intervention for de-escalation along with assessment, help with assessing and planning, with skill building education and connection to resources that can be helpful to the family. The behavioral health workers also assist the family and returning the child back to what they call a baseline or a routine functioning and the prevention of any further escalation. And then lastly, provide those resources necessary that will help the family address any future incidents that arise. MRSS, the case workers are available through a toll-free hotline. On top of the immediate support that you can get from that, the line also will provide families to a host of other important services and resources such as counseling, behavioral assistance, in community services, skill building, and medication management among others. So it really is a holistic approach that can provide immediate relief along with some longer-term benefit to the families. You know, is the program successful? As I mentioned, it was implemented in 2004. You know, New Jersey has consistently maintained a very high percentage of children that remain in their living situation at the time of service going back to, well, this shows you 2014 to 2017, but it was always above 90 percent and even it's close to 95 and I think it was up to 97 percent one year. So quite effective outcomes, I think. And then lastly, I'm going to mention this just briefly. Well, actually, let me go back to New Jersey to make a point here. I mentioned sort of, you know, the geography of New Jersey is certainly much different from Georgia. Georgia is a bigger state. New Jersey is a lot more urban generally than in suburban than Georgia. You know, the rural areas in Georgia are much bigger than the rural areas in New Jersey. So that one hour timeline, you know, it might not necessarily be feasible here in Georgia, but I think it is something that you can accomplish during the extent. And then lastly, of course, that required, I think, quite a bit of resources. You have to have the infrastructure in place to hire all the case workers with that comes the funding to pay them. And so there's a lot there to consider, but as you saw, the outcomes are quite effective. A question. So that number 94 percent, do we know what that number is in Georgia? I do not have that information, but I don't know if anyone has heard of this. What is our number in Georgia for maintaining children in their living situation at the time of service? Sir, there's no time of service. We don't have a mobile support. We kind of hold support for the call law for fall. We have a service there. I mean, we have the residents, we have to charge all there. We just started, we just started a pilot with these and all the disciplinary clinical teams and just kind of got the big process. But I guess the question would be like, it really goes back to the data of that Commissioner Brostat, you mentioned that there's lots of changes of foster kids going from home to home and blowing out of placements and stuff. And what this suggests is that these are these are children in foster care that are being served or these are children in family preservation. They're still with their families. They're still with their families. They're in foster care. Got it. Okay. Okay. Okay. Keep going. If you're interested in this, I don't think New Jersey is the only state. I know that some other states have implemented similar programs, so it would be happy to get that to you. And then lastly, very briefly, I just want to mention to you some of the success that we've seen in Washington DC. Of course, DC, like I mentioned in Texas, has experienced certainly its fair share of problems with their foster care system. But as you'll see here, they have reduced overall the number of children in foster care by about 75% between 2010 and 2022. And that is despite the fact that the population grew by about 15 or 20% during that time frame. And I really just highlighting this because ultimately, you know, we have a child, you know, a family first prevention services act, which has passed in 2018. I know that some people have raised some issues with it. And it's certainly not perfect. But DC really embraced family first before it was enacted in 2018. The district had a federal waiver or a demonstration project that allowed it to use the federal funding, the Title 4E funds, much more flexibly so that they could focus on some of the important preventative measures that family first was trying to address. They found that it was successful, but it was limited. And then with the passage of family first, they were able to expand it to most families. And with the experiences and the data that they had collected with the demonstration project, they're really able to build it up and scale up quite quickly, which is ultimately why you've seen some of those reductions over the past few years. And like all states are trying to accomplish DC focus on, you know, parent, they focus those funds on parenting and home visiting programs, mental health treatment services, substance abuse treatment, and various other social supports. Some of them very similar to what the New Jersey provides to the MRSS program. And then, so that's it for the three examples. Lastly, these two ideas came to me just a few days ago in some conversations that I was having. Do with them what you will. One, so Casey actually, Casey family programs said that some parts of a few states have started experimenting with creating full-time, salary foster parents and provide them full wages. So that the foster parents are that's what they do. That's their full-time position. They're not focused on other jobs during the day. And so therefore, they can, you know, devote all their attention to fostering. I think if I look at my notes, I believe that's been tried in Texas, Wisconsin, and Illinois. So three states have tried it there. They're still very new, so it's hard to say. But initial results seem to show that it does result in a little turnover because, you know, get those benefits. Yeah, it's a job. And then lastly, several states have started creating judicial commissions that involve really a holistic approach that involve all the state agencies that are critical to child welfare in the states. I know, in case you told me about Massachusetts, which has been particularly successful, has all relevant state agencies. And the agencies are able to share really important data to try and improve the outcomes. And based on what we've seen so far is that it's led to really quite a bit more interagency collaboration and cooperation, so that some of the data concerns there and the lack of communication that often exists between state agencies, you know, all state agencies can be sort of mitigated. So those are two there. And with that, I guess, I'll take some questions. Thank you very much. I'm sure there are a lot of other things going in and a lot of other states that we don't have time to get to. But the concern I have about Texas, the first bill that you mentioned is that your data may look better, but are the kids doing any better? Are they just an unsafe home? So I think the jury would still be out on that for a while. Yeah, certainly still out. I'll just, I mentioned it because I agree with you. I think there's very serious concerns and issues that would have to be worked through. But again, actually, you know, the bill was brought to my attention by some foster care entities, you know, policy experts in the area. And they said that, you know, they admitted some of those shortcomings there. But they said it, you know, it represents it is unique in some respects and represents a potential approach to mitigate some of the issues that exist in most foster care systems. But that's, that's important. I'm not trying to downplay that by any means. Yeah. And then one other thing, just I mentioned this briefly earlier, but we are working on a pilot with a group called United us that is going to help us corral these community resources and connect them with the government resources so that we can track what's going on. And when a referral is made, what's the outcome at the end of it? So that's hopefully we'll be able to talk in more detail about that at our next meeting. So we, the community-based resources are hugely important. And I think we all would agree on that. Yep, absolutely. Other questions. Thank you, I enjoyed your PowerPoint. I'm curious, you own your adoption numbers early in your PowerPoint. The numbers you gave were those children adopted out of foster care or do that include private adoptions also. Sorry, you're going back to the beginning. Shipney? Sorry, repeat your question. The adoption numbers you put up, you were showing the number of adoptions. Are those just children in state custody or those including private adoptions? That's a good question. I don't have that in front of me right now. Occasionally come up with one. So that's good. But we have you to look into it. Yeah. And looking at the Tennessee numbers because they were so low, would you interpret those numbers saying that Tennessee does a better job at getting the kids back into their homes? Is that why their numbers are that low? No, I don't think it's necessarily, I don't think it's necessarily reunification. I did not do a deep dive into that, but you know, it could be a number of it could they could be reunified. They could find it. Would you say if it's not the same? Well, but comparing apples to apples and we're assuming that Tennessee and South Carolina, I think you use Tennessee, South Carolina and Alabama in Georgia. If we're comparing apples to apples, then the only other legitimate answers they have a more effective and better oil system than we do because all of the process is the stages that have to be gone through to protect the constitutional rights of the child. It seems like there's no there's no fast way to do that. Right. So they must have found some secret sauce unless they found a way to reunify. If I had to guess it's a combination. Perhaps have a better you know, success rate reunifying with the families and maybe also are better at finding adoption adoption families for the children. I think it would be a combination. In the end, finally, on the New Jersey response thing, I know they do it in Canada for mental health and I think Ohio does something very similar to that for when individuals have mental health episodes. They call them a one. I think we're running a program in Senator Watson's district down in Savannah. But are these state employees responding or are these contract companies responding? Yeah, they're state employees, I believe. The name of the state agency is escaping me, but yeah, I believe they're state employees. Thank you. Anything else? Wanted to mention, I don't know a lot about it, but I know in in Georgia and some other states, we have these wind shaped homes that are paid foster parents. I don't know about the statistics on how successful those are, but I think one of the complaint, not complaints, one of the maybe the cons of that is that I believe the children are there under a guardianship. And so that's not really permanency for them, but there's just the thought of paying foster parents a salary. Look, where does where does that lead to? I mean, it could be a good solution, but it could have some cons to do as well. Yeah, based on what I read and have seen, you know, those those pilot programs, ultimately, there's still pilot programs that where they're paying the the foster parents full salaries, the parents have multiple children that they're, you know, under their wings. So I want to say it's a group home, but they, you know, it's not for one or two, not necessarily for one or two children, it could be for three or four or four or four. Right. Yeah. Another question you mentioned. And I'm sorry, I'm not familiar with statistics out of Texas that several children had died, was that after that law was put in the place? No, no, no. No, no, no. Yes, yes, the federal investigation was years long, and I think the the results were released, We're released in 2019, I believe, and then the state was required to make improvements. Yeah, but now going back, I think it was 23 children that they could confirm diet and foster care. Okay, thank you so much. Appreciate you sharing that data and committee members, you do have the Casey Foundation data for Georgia and your packet of tazis little graph lines on it. And we have one more presentation and this is from Amy at consent who's in Virginia, so she's joining us on zoom. Amy are you there. Yes, thank you. Thank you. Thank you, Senator Kirkpatrick and members of the committee for invitation for me to present today. I'm here today to tell you just a little bit about the Virginia Commission on use. The commission, we are a legislative commission, which was established in 1989 and for the purpose of tackling complex hard issues related to youth and their families that should be explored and resolved. The Virginia code defends the role and function of the commission on you to study and provide recommendations addressing the needs and services to the Commonwealth youth and families. One way we accomplish this is when we conduct a study, we pull together an advisory group or a work group. For example, for our foster care studies, we have several legislative members of the commission, which are legislators on the advisory group. But we also have around the table representatives from stakeholder groups, such as juvenile court judges, the Department of Social Services, local departments of social services, advocacy groups, private providers, foster care parents, foster care youth. To make sure that we receive everybody's input, much like what you're doing today, Senator Kirkpatrick, the advisory group tackles the tough issues and works together to bring consensus recommendations. One of the things I want to stress to this group is that we are a bipartisan commission. In Virginia, we have dedicated staff that serve the commission and all members of the general assembly all year and we specifically focus on child related issues. I've been with the commission for 22 years and the legislators know they can turn to the commission on youth for sound policy recommendations and best practices. Backcode, we have six members from the House of Delegates and three members from the Senate and three citizen members appointed by the governor. The code also requires that the chair and vice chair be elected every year. Currently, our chair is delegate Emily Brewer of Republican and our vice chair is Senator Barbara Favola a Democrat. We have three studies that we're working on this year and I think the first one is what sparked the senator's interest improving foster care in Virginia. At Mission of Minors to Mental Health Facility for inpatient treatment and the collection of evidence based practices for children adolescents with mental health treatment needs. For our foster care study this year, the commission adopted a study plan to improve foster care in Virginia. Over the years, the Virginia has implemented bipartisan improvements to our foster care system. Additionally, governor Youngkin created the safe and sound task force to bring together state and local agencies, elected officials, the faith community and community partners to create safe and safe. And appropriate housing for children and foster care listening to your commissioner, the Department of Human Services, Virginia and Georgia are very similar and trying to tackle these very difficult and complex issues related to child welfare and trying to not have children spent on in hotel rooms. And Virginia's task force many, many nights and many days we have gotten our number down to zero. This year, the commission on youth is working with agencies and stakeholders to organize and develop recommendations on workforce retention, liability insurance for foster care agencies, foster care family recruitment and retention and having a foster care point of contact at institutes of higher education. I don't know if most of the folks around the table know this, but only 4% of foster care youth receive a four year degree. The other study that we're working on is reviewing and analyzing Virginia's laws and policies and procedures related to use decision making to consent to mental health facility for inpatient treatment. Right now, beginning at the age of 14, 14 years old, I use them for Virginia can not consent to treatment and delicate TADA's legislation that she introduced in last session would have moved that age to 16. So the commission is studying that. I wanted to talk a little bit about because mental health has come up in your advisory group in this in your study committee, a couple of times or actually several times today. But the commission has this collection of evidence based practices for children and adolescents with mental health treatment needs. And I'm going to skip over to slide 11. We are currently in our ninth edition and it was last published this year in June of 2023. And I would encourage folks to go to this and look at this. It's available online. I think the 2018 National Conference of State Legislative Notable Document Award. But one of the things that this does it has a brief discussion of each mental health or newer development disorder. And the description of treatments and interventions with a focus on treatments that are evidence based and resources where parents are stakeholders or those that are interested in children can can turn to and treating those disorders. And this is probably the most used document and all of the general assembly. So what this group might be interested in in this collection this year we updated our family first section and it has all of the most recent clearing house information of what the federal government deans as what they will pay for. And I also included a section for the COVID-19 and the pandemic lockdown and what it and what impact that has had on children's mental health. So some of our recent studies and I wanted to talk a little bit about this if something go back a slide. I would like to talk a little bit about how we got to this event during the 2019 General Assembly session. My chair, delegate Emily Brewer along with Senator Monty Mason created a foster care caucus where legislators could come together during the general assembly session and talk about foster care and to learn more about foster care. And one of the legislators that foster care kids not receiving the health care that they need and I simply made a statement, well that shouldn't be an issue because all kids in foster care have Medicaid and it's it's a paid resource. So the funding is already there and the legislator had no idea that foster care kids were on Medicaid Medicaid. So we need to be aware of the awareness that we need to do a better job in educating our legislators about foster care and about the complexities of foster care. So we pulled together May 6, 2019. We held this seminar and we open this up to all 140 members of our general assembly to come to learn more about foster care. So 200 people attended this event. 12 representatives from legislative offices. We also had every executive branch child serving agency that was there, including directors and deputies. We had our judges there and we had state local officials there along with advocacy groups and other stakeholders. And we produced this document. It was the commission on you produced and compiled a comprehensive document entitled foster care 101 for legislators and it's on our webpage of anyone wants to go look at it. Basically has summaries of foster care and the different areas of foster care that legislators if they have a question they can turn to. In this foster care 101 seminar that we put together. So the most well the most meaningful panel that we pull together is we had a group from Bedford County on local departments of social services that walked the legislators and the folks that were in attendance at this seminar through a case. And it was absolutely shocking to the members of what all just one simple case in foster care includes starting from the call that CPS received and where our child protective services had to go out to the home. They showed the folks in attendance. They showed them the case file, which was bonders and bonders and bonders of paperwork that was just from this one case. And they also showed pictures, of course, you know, covering up the face of this young lady that was abused and neglected. And the realization to from this panel, the legislators understood that this is this is this is hard and the work is hard and they also got to experience and understand a little bit about the trauma of this young lady that was removed from her home and the abuse that she was experiencing her home. And also the trauma that the CPS workers and the foster care workers experience from work in this case. I think as a result of this study, we had a historical session during the 2020 session. And we had a lot of recommendations that were adopted. We had a historical amount of funding that was given to foster care and their child welfare system, including much needed raises for our family services specialist who work these cases are in our in the field. And so there are some of the studies that we've done for foster care in recent years and all of these studies, the blue, their hyperlink to take you directly to the study. If you would like to look at those studies. Some things that you all've talked about the commission has also looked at the disruptions and adoptions and what to do about that. And so our commission, we're a little commission. But I think we have a big impact on our legislative body. We've hosted six family impact seminars in Virginia, along with Virginia Commonwealth University at the state Capitol. We offer research and guidance on foster care and kinship issues, including King gap. We've successfully introduced legislation requiring the publication of regulations for seclusion and restraints. We've done a lot of good job to help educate parents and navigates special education services. And so we, I think we're a great bargain for the Commonwealth of Virginia, our entire staff. Our entire funding is 383,652 dollars. And the general fund dollars goes to support three full time staff positions overhead supplies and necessary travel for hosting advisory groups and the travel of our commission members. So that's just gives you a little taste of what we're doing here in Virginia and I'd be happy to answer any questions. Thank you very much. I mean what we have seen is that during the legislative session, just the nature of the basis that we don't have enough time to dig deeply into anything. And we do a lot of study committees here, but our timeframe is also limited with those. So I found it very fascinating what you're doing in Virginia and can't wait to look on your website and get into some of these resources and hope you don't mind if we borrow some of your ideas. Everything that we have is yours, Senator. Yeah, and for the people in the audience, I saw people trying to write down some of these websites. We're happy if you'll just contact me. We're happy to send you the PowerPoint presentation so that you can look a little bit deeper into those other questions for Amy. Did you have very much difficulty. I guess you are around when the commission was formed at the beginning. Was it a heavy lift to get that established. We have a lot of commissions in Georgia and I'm on several of them. And I just wondered how you never get at that or if there was resistance to forming another commission. There, there really wasn't, you know, as I showed by our budget, we're very small. When it first was established, it was established with just one, you know, position, the executive director. And then through the course of the years, they've added a couple, you know, a couple more positions for a total of, you know, three full time staff position is what the commission is funded for. But really, I think one of the great things that we do is we work for the house and the Senate and we pull, you know, the same. We support the house and the Senate members the same, same way. Our chair usually flips between the house and the Senate every couple of years. Usually our chair will serve, it's a lack that our chair is elected every year, but usually the same chair serves for two years. And then it'll flip more than likely my chair next time will be Senator Barbara Favola, a Democrat from the Senate side right now my chair is a Republican from the house side. And I think everybody wants to everybody wants to improve the lives of children and their families. The approach sometimes can be different ways to get there. But one of the things that we do is.\n\nwhen the general assembly is not in session, that's like what you're doing right now. That is when we do our heavy lifting and that's when we do most of our work, is we try to pull together all the stakeholders, we try to get as much public input as necessary. So when we go before the general assembly, our legislation goes through very smoothly. Sometimes we have problems with our budget amendments, but our legislation usually goes through very smoothly because it's been vetted by everybody. The judges have had their inputs, the locals have had their input, stakeholders, advocacy groups, and we try to work out any, there's any conflict, we try to work that out during the off season. That's really great information. And I know you're coming off of a late night in the town. So thank you very much for hanging in there with us today. And one more question for you. Thanks for the presentation. That in the clearinghouse, there's a list of in-home parent skill-based programs and services that are supported by the, for the preventive services task force and that we're in the clearing in your Virginia clearinghouse. The fact that those are supported and that you have put those forward as evidence-based practices, talk about how well they have been put into play in Virginia and especially for the foster care population or kids at risk for foster care. In some areas we're doing well and other areas we're not. And I think one of the things that Virginia is struggling with probably along with every other state in this great union is workforce and not having enough mental health providers in the field to provide these services. So we are making progress, but we still have some ways to go. And do you feel like workforce has been even more of a barrier now than available funding or is it, are they sort of tied hand in hand for you? I think workforce trumps the funding because I think the funding is there through the federal funding stream that we have and also the willingness, our governor, I work in the legislative branch, but our governor in Virginia, Governor Youngkin has done a lot and has promoted mental health and trying to push out some new mental health approaches that I think will be helpful for children in foster care as well. But workforce is a great challenge. And I think your commissioner also kind of mentioned this as well. You know, when you have children that are sleeping in hotel rooms, that's because you don't have a willing provider or an appropriate provider to take that young person. It's not that the funding doesn't exist to place that young child is that the appropriate place to put them is not there. For example, you know, in a lot of our residential facilities here in Virginia, we have the capacity, but the capacity, the beds aren't staffed. So, you know, you'll have a facility that, you know, has a capacity to take 20 kids, but they're only staffed to take 10 kids. So it's workforce is a great challenge. Thank you. Thank you very much, Amy. I really appreciate you going in. Okay, thank you so much. Okay, so I think everyone is probably very overwhelmed by now with all this information I know I am, and it's going to take a while to kind of digest all of this. I did want to just tell you a little bit more about the next few meetings. We're going to meet here September 26. I think the meetings going to be across the street in one of the committee rooms. And we'll send that out. And we'll have a few more presentations and then some public testimony. And I think we will probably take a lunch break next time. So, sorry about that today. I didn't really realize how long this was going to get. And then the third meeting will be in Columbus, focused on adoption, and we'll have, I'm sure some experts on that, speaking along with some public testimony there as well. And then the fourth meeting will be back here for a wrap up. And whoever we need to hear more from in order for the committee to come up with some robust recommendations about what we can do, not just during the next session, but that we can work on outside of the session all year round. So I really appreciate my committee members that were able to hang in here and the staff so much for your support. And also to DHS for providing us with the resources. We know how hard your job is and you're greatly appreciated. So thank you very much. And we're adjourned.",
  "updated_at": "2026-02-13T18:10:09.050543+00:00"
}