{
  "video_id": "fC3XpIvrsH8",
  "url": "https://youtu.be/fC3XpIvrsH8?t=940",
  "title": "Georgia House - Day 40 (2026-03-29)",
  "chamber": "house",
  "session_type": "regular",
  "session_year": 2026,
  "day_number": 40,
  "video_date": "2026-03-29",
  "duration_minutes": 297,
  "summary": "Here is a structured markdown summary of the Georgia House session on 2026-03-29:\n\n# Georgia House - Day 40 (2026-03-29)\n\n## Overview\nThe session featured debate and votes on several bills, including contentious discussion around Senate Bill 233 which would establish \"promise scholarship accounts\" funded by the state. There was discussion around the potential impact of the bill on public school funding.\n\n## Key Actions\n**HB 142**: No further action\n**HB 183**: No further action  \n**HB 453**: No further action\n**HB 52**: No further action\n**HB 557**: House insisted on its position, Committee of Conference appointed\n**HB 76**: No further action\n**HB 86**: No further action\n**HB19**: No further action\n**HB294**: No further action\n**HB340**: No further action\n**SB 13**: No further action\n**SB 145**: No further action\n**SB 233**: Debated, no vote taken\n**SB 246**: No further action  \n**SB 557**: House insisted on its position, Committee of Conference appointed\n**SB 63**: House insisted on its position, Committee of Conference appointed\n**SB23**: No further action\n**SB233**: Debated, no vote taken\n\n## Bills Introduced (First Reading)\nNo new bills introduced.\n\n## Notable Moments\n- Heated debate on Senate Bill 233, with representatives arguing both for and against the \"promise scholarship accounts\" proposal.\n- Procedural motions to insist on House positions on several bills, leading to the appointment of Committees of Conference.\n- Requests for members to take side conversations outside the chamber to allow others to hear the proceedings.\n\n## Votes\nNo recorded votes mentioned in the transcript.\n\n## Attendance\nQuorum maintained, no issues noted.\n\n## Adjournment\nThe session adjourned. Next session date not specified.",
  "transcript": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you any of the physical to George Anatetti relating to bombs. Is there objection? There is objection. Gentlemen move. Gentlemen moves. Okay here we go. All those in favor of the motion that the House insists on its position to SB 63 and that the Committee of Conference be appointed will vote yes, those opposed will vote no and the clerk will unlock the machines. On the motion to insist on our position, the House position on SB 63 and the Committee of Conference be appointed. The yeas are 91 and these are 62. The motion carries and the House has insisted. The Chair of Points, Representative Gaines, Leader of Estration and Chairman Collins as a Committee of Conference on SB 63. The Chair recognizes Chairman Stevens for a motion. Thank you Mr. Speaker. I move this House and the system is positioned on House Bill 557 and the Committee of Conference be appointed. These Stevens move that the House insists on its position on SB 557. Mr. Clerk will you read the caption? House Bill 557 my represent of Stevens and 164 to be entitled to amend chapter 34, title 43 of the official go to George Anatetti relating to physicians, assistants and others those authorized physicians that delegate the authority to advance, practice registered nurses. Chairman Stevens is recognized to explain his motion. Thank you Mr. Speaker. We've come to an end pass on the Senate also insisting on their position on this hospital stuff that was put into the House Bill 557 and we're going to have to have a conference committee to work it out. Chairman Stevens has moved this House insists on its position on SB 557. His objection to here is known in the House has insisted on its position on House Bill 557. Okay, we're moving on to the rules calendar.\n\nSupplemental rules calendar, Mr. Clerk, will you read the caption to Senate Bill 233? 233? Senate Bill 233, Senator Donasel, 27th being titled that to- Just a spin, just for a moment, Mr. Clerk. That one's empty. So is that one? If members need to have a conversation, some of us want to hear what's occurring in this chamber. So take your conversations to some place else. Please continue, Mr. Clerk. Senate Bill 233, by Senator Donasel, 27th being titled an act to amend Title 20, the official go to George Anitett, and relay an education skills to provide for the establishment of promise scholarship accounts to be funded by the state in the amount of $6,000 per school year. Thank you, Mr. Clerk. Chairman Todd Jones is recognized to present the bill. Thank you, Mr. Speaker. Colleagues, I will be short. You've had on your desk the rules substitute to SB 233. It should be LC 491473S. It has been on there since I believe lunchtime. Effectively, the two changes in the rule substitute, if I could point you to lines 187 to 196, you will see that we now provide for the scholarship amount to float with the QBE funding and austerity cuts. So for instance, if the QBE drops by 10%, and there's an austerity cut of 5%, the promised scholarship amount will reduce in that exact amount, which would be 15%. The second part of the amendment, if I could turn you to 344 to 353, you will see that we are changing the rating formula for the bottom quartile from a one-year benchmark to a cumulative two-year benchmark to determine the bottom 25%. Mr. Speaker, those are the only two changes within the rules substitute. Colleagues, I ask for your favorable consideration and I yield the well. The gentleman has yielded the well. We do have speakers on the bill. We have some opposed. That we'll be hearing from. Those opposed will have up to 30 minutes to state their opinion. We'll begin the first speaker's representative, Paris. Paris, excuse me. Representing Paris. Thank you, Mr. Speaker. Well, here we are again, SB 233. You know, if it was such a great bill, we wouldn't have to be going through this. You know, I've heard a great deal of talk from members of this body who are supporting this bill about how we must do all we can to protect our most vulnerable citizens. This bill does nothing but perpetuate the gross inequities that have existed in our state's educational system before too long. We have a quarter of a million children in our state who are living below the poverty level, which in and of itself causes trauma. In my county of Macon Bay alone, over one-third of the children enrolled in our public school system live below the poverty level. And while we have countless private schools in Macon, those kids, I know the trick is to say, well, if 6590 enough, let's raise it up to 10,000, that's not the answer. That's making it worse. That's not what we're elected to do. We're elected to make things better for the people that we serve. Maybe if we spent as much time and resources on addressing the root issues related to student achievement in our state, like getting the reading level, getting literacy taken care of, maybe then we might begin to see some real progress. Schools, educating Georgia's most impoverished students are offered no additional state money to address the needs created by poverty. Georgia is only one of six states without the funding. SB 233 does nothing to address the real problems our children are facing. From a business standpoint, this bill will further exasperate, the workforce crisis we are facing in our state by diverting funds away from our public schools. We all agree a quality education workforce is one of the things this chamber needs to be addressing. This bill is not about a win for the dams or a loss for the Republicans. It is about a win for the people of Georgia, most importantly our most vulnerable the students. I urge you to vote no on this bill. Stick to it, rural Georgia. We got a lot at stake. Thank you, Mr. Speaker. Lady has yielded the well. Representative Becky Evans, as recognized as speak to the bill. Thank you, Mr. Speaker. So Senate bill 233, this is a public funds trainer, costing at least 40 million and up to 190 million at full implementation. And that estimate is based on 2% of the 550 schools that are eligible. This comes at a time when Georgia schools in general, they are struggling to retain employees, they are soldering the cost of an aging bus fleet and they are facing a 67% increase in the state health benefit plan costs for bus drivers, cafeteria workers and other critical staff. The schools targeted by this bill, those in the bottom 25% of schools according to the college and career readiness performance index, they are even more dependent on public funds and are located in districts experiencing low property tax wealth and high poverty. The schools whose students would be eligible for this funds draining program are also overwhelmingly black. These school districts and the students that they serve can ill afford a bill like this that siphons funds away from schools that must pay fixed costs like building maintenance and capital improvements as well as classroom supplies and other vital materials that students, the teachers need to serve students. Now the other evening when we were debating the spill, I heard the gentleman from the 47th talk about the examples of how state funds are used for private schools like preschool and childcare and private colleges. But I ask us all to please remember our constitutional obligation which is the provision of an adequate public education for the citizen shall be a primary obligation of the state of Georgia. Public education for the citizens prior to college or post-secondary level shall be free and provided for by taxation. So our constitution requires that our taxes provide a public education. Let's take a look at outcomes and as far as outcomes are we doing this to improve students outcomes and education right? Like well how would we measure this? So parents need to be able to compare apples to apples. So I want to ask why was the testing requirement change from what we passed in the House committee? If you can look with me at lines 294 to 300. On 294 to 300 it says in order to allow parents and taxpayers to measure the achievements of the program the commission shall approve no fewer than three nationally norm reference tests that measure student academic progress and math and language arts. Private schools in row in rowing participating students shall ensure that at least one of the following is administered each school year to each participating student. A nationally norm reference test approved by the commission or a statewide assessment administered. If such participating student is enrolled in a grade for which such statewide assessment is administered. So basically I don't think that's fair because parents need to be able to look at their outcomes apples to apples and these schools participating have a choice. So I don't understand why we removed that that testing requirement for all of the schools to take the state the state test. I also want to talk about choice and we've worked so hard and we're providing such great innovation in many of our schools and we're providing choice there public schools magnet schools theme schools local charter schools state charter schools and of course our wonderful community schools and we just passed legislation this evening creating the non-traditional completion schools to build on the successes of mountain ed coastal plain and foothills to bring those schools to other areas of the state we do not need another choice of private schools and as for cost so we don't have an estimate we know it's according to what we're going to provide in the budget but I've heard some of my colleagues talk about oh I think it'll only be 500 students and I'm like I'm having a very hard time believing that because they're 550 eligible schools so 500 students times 650 that's like 3,250 but we have examples from these other states where they're spending 200,240,000 and I would like for us all to go to lines 344 through 350 and this is something I was talking with another colleague about that I think is a very important point and 344 of 350 this is the annual report the office of student achievement shall include a list of separate list of public schools that performed in the lowest 25% of all public schools based on the cumulative individual school ratings for the most recent two years so this is the one that I know it was changed for the floating two you know two years so I appreciate that is an improvement that's based upon the last two years but but this colleague said to me goes it's only failing schools it's 25% of failing schools he didn't use quotes I'm using those excuse me but I'm very concerned I think I read this is 25% of all of our public schools and I would like for someone to address that question because that's a very different very very different situation because this this this colleague was saying if we get all our schools if none of our schools are failing then we won't have this program but I have not heard that tonight I didn't that is not the way I read this bill so I'm what I'm saying is if this opens we're opening ourselves up to funding private schools and what if this will be hundreds of millions of dollars these private schools will divert scarce resources from public schools these private schools do not improve student outcomes and one of our other colleagues have something on your desk you know showing you about these studies these evidence based studies that have shown that they don't improve outcomes they provide fewer protections against discrimination for students and these vouchers exasperate school segregation I am very concerned that we're opening a Pandora's box where these vouchers will lead to a significant threat to our public schools I'm asked you to please join me and vote no on Senate bill 233 thank you mr. Speaker I yield the well the lady has yielded the well representative and Alan Westbrook is recognized to speak to the bill thank you mr. Speaker and good evening colleagues I know we have a lot of thoughts on this bill we have debated it pretty pretty substantively so far and I know there aren't many persuadable people left in this room but I truly believe there are few and and y'all are the ones I'm talking to because this really is so important as I was thinking about what I wanted to say tonight in my brief remarks I promise the the Bible verse that kept coming to me was the story of Jesus being asked who's my neighbor and of course we know who they and we know the answer to that question is everyone every single one of us and the question that kept coming to my mind is I thought about SB 233 is who is my child and to me the answer is every single child in Georgia every single one without exception not just my own not just the ones that I gave birth to and indeed that's the spirit of the Georgia Constitution which makes it very clear that we have a constitutional obligation to educate every Georgia child the ones with learning disabilities the ones who wake up hungry and go to bed hungry the ones living in poverty the ones living in unsafe homes or with insecure housing but SB 233 is premised on the idea that we get to accept educating something less than all Georgia children we're going to pick some we're going to we're going to give them these vouchers and devil take the Han most as I used to hear growing up and I don't think we get to educate just one child and we shouldn't we shouldn't hear that rhetoric in here because we have an obligation to educate every Georgia child and in fact I sat in on the committee who heard this who heard SB 233 in the beginning and I heard that we are picking winners and losers and that's very frank talk and I don't love using those words when we're talking about children but I got admit it's got the ring of truth and if I were going to soften it just a little bit we are choosing who gets choices and who doesn't who gets stuck where they are while other people get pushed to the front of the line and we know who's going to get these choices it's going to be affluent children in Georgia it's going to be Metro Atlanta kids kids in some of the other metro areas it's going to be suburban kids it's not going to be poor kids it's not going to be who needs this program the most and it's not going to be rural kids because many many of our counties don't have a single private school and can't take advantage of this program so I believe that we are picking some and choosing to leave others behind and in particular with poor children and that's my particular concern given the district I represent we know that poor children are most likely to be in under performing schools and we also know that their families do not have the resources to make up the difference intuition that this voucher is not going to cover so that's who I'm thinking of as I stand here tonight and I want to talk a little bit about choice and I want to offer cautionary tale to some of you again I think most minds are made up but a few of y'all in here you're the ones I'm talking to with this I will offer you a cautionary tale of my home of Savannah where we decided some families decided in the 50s and the 60s that they wanted more choices they wanted different choices than the public schools in Savannah and I don't I don't probably need to remind you what was going on then but I'll give you a little hint the 1954 decision of Brown versus Board of Education caused a lot of families to decide you know it I think we need a different choice and so many many private schools were started many most to this day you can drive through town and you can see founded 1955 founded 1961 and we have lots of those private schools still around today some of them closed and new ones opened and our I want to be clear here our school board does a wonderful wonderful job they have been we've been working as a community for more than 50 years to try to claw our way back from those choices that were made back in the 50s and the 60s and we have many many choices we have those private schools I talked about we have public choice schools we have public charter schools we have zoned neighborhood schools there is no shortage of choice in my community where I live but I'll tell you what has not budged and that is our persistent rates of poverty choice schools have not solved that problem they haven't even made a dent in that problem 42% of our children live in poverty 64% of children in Savannah Chatham County Public School system qualify for free and reduce lunch our poverty in Savannah remains 41% higher than the rest of the state and 57% higher than the rest of the United States so again I'm talking to you few folks out there who might still be thinking about this and still considering this and I want to tell you buyer beware it might not be what you think it is it might not solve those problems and only you have to go back to your community and face those parents and face those children those educators those superintendents and I will tell you if you live in a community where there is a strong culture of support for public schools where a scarcity mindset has not yet taken hold where people still believe there is enough education to go around and families shouldn't have to compete for something that their children are entitled to under the Constitution please know that you are the envy of many many communities in Georgia please consider very very carefully whether you want to open the door to this bill that will undermine those schools you have that are bed rocks of your community right now I urge you to vote no to to SB 233 thank you Mr. Speaker I yield the well lady has yielded the well representing Mary parts weems is recognized as speak to the bill Mary Francis I'm sorry any double name it is all right with Mary that's my motto just start with Mary and add another name thank you Mr. Speaker so the real reason I I actually ran for election was public education and my father was was in this house years ago and but his first elected position was as a member of the city council and I don't know why I remember this but the first thing that I remember him working on was a city school bond for the Marietta city schools and it didn't pass and I remember how devastated he was and he felt so strongly about the need for public education so I want to talk about a few things I mean and it's about the money mainly I know you know there's a lot of things that I want but if I can't afford them I can't have them I know that a lot of people under pressure from their constituents to give them this this help this voucher for private schools but I'd like for us to think about some of the things we've done for these folks in 2018 we lowered the tax rate from 6 to 5.75% and last year I believe it was last year we we passed legislation that will over a period of years phase in a lower tax rate which will end at 4.99 so we've given citizens a tax rate another thing that we've done for folks at least those of those who have a home and and a homestead exemption is that we have given them a really nice I think they're all going to get $500 this year so think about that it's not like we're not doing things for those among us who have more resources I know you're under tremendous pressure but as I said we've done a lot for our constituents my main problem is we don't know how much this is going to cost we have no idea how much this is going to cost and and I know several people have said fiscal note fiscal note we don't need a fiscal note well actually I went and looked up the code section about the fiscal note and I'd like to share with you that section code section 28.5 28-5-42 actually says that introduction of bills having significant impact upon anticipated revenues or expenditures furnishing a fiscal note any bill having a significant impact on the anticipated revenue or expenditure level of any state department bureau board council commerce etc etc or state agency must be introduced no later than the 20th day of the session it goes on to say that they are done from the office of planning and budget and the Department of Audits and Accounts so it's not true that we only do fiscal notes for tax bills we may not have done a fiscal note for a non-tax bill in a long time but I've been around this capital on the other side of the rope for a long time and I remember many many fiscal notes it's not unusual to have a fiscal note and we used to have them all the time and I can't find anything in recent case law to indicate that we no longer have fiscal notes for anything but tax bills so I mean I don't know about you but I think we deserve a fiscal note I mean if we're going to spend millions of hundreds of millions of dollars which I mean we all know that we are let's just be honest with ourselves we know that we are and maybe that's okay with you and I get that one other thing this is a $6,000 voucher and we've talked a lot about how this is just going to help poor people dis-advanced children it's going to help them get into these private schools well I've had a pretty good income over the years I was a single mom but I did okay and I'm a huge supporter of public education but there have been a couple of times when one of my boys was really struggling and I thought gosh I wish I could you know put him in private school get some of these problems worked out but you know what $6,000 wouldn't touch any private school in Marietta Cobb and I didn't have the rest of the money for tuition at any of the really excellent private schools in Cobb or Marietta so if I a middle class a per middle class mom could not afford to even take advantage of one of these vouchers whether I wanted to or not what makes us really think I mean we know this we know this what makes us think that poor and disadvantaged families are going to be able to take advantage of this it's okay if you don't care about that but don't pretend that it will benefit them and don't pretend that it won't cost a lot of money and don't pretend that we can afford it thank you Mr. Speaker I yield the well and lady has yielded the well that concludes all of our speakers opposed to the bill we're going to move on to the next phase is there any objection to the previous question being ordered chair has done the previous questions ordered there is a minority report the minority report and the chairman's time will have up to 20 minutes each all those that will speak with the majority report will have up to 20 minutes minority report they will you will share your own time according to y'all's comments chair will not control those members will everything during quarter is recognized to speak to the minority report representative Carter good evening thank you Mr. Speaker here we go again and you know this time we laid it on the table we took it out the table we sent it back to rules we amended it and actually the amendment made it worse listen I heard somebody say early last week we were talking about this bill the definition of insanity is doing the same thing and expecting a different result this is my eighth session and every session we get another voucher or some legislation that diverts funds from educating our students and public education let's just do something different let's put the energy into fixing what needs to be fixed in our public schools correcting that so that we don't have to come back every year to try to find a different scheme to find another way for people who have resources to divert funds in the in the name of assisting those who don't have the resources but that continues to follow on deaf ears so let's talk about this I'm an accountant so I got to talk about the money on in this section 135 to 144 it says to be to be eligible to enroll a participating student a participating school shall demonstrate fiscal soundness by having been in operation for one year and you can read the risk as I told you last week when we talked about this a business that has only been in business a year number one doesn't have financial statements really doesn't have a good idea what it's going to cost to maintain so how can you prove that you are fiscally sound a lot of you in this room of business owners and you know how difficult it is to start a new business and we all know that businesses fail within the first few years are going into business so if we were going to do an amendment on this bill because somehow you guys somebody's really committed to sending these vouchers then maybe we should have changed that one year to three so at least the youngest entity that we're going to send the kids to we could at least see that they are possibly sound because in a year you can't tell that they're sound you don't even know what it's going to cost to manage your business for real because you don't know really who's going to come to that school so how can we really in good conscious say that we are going to send our kids that are in the lowest 25% of schools enjoyed you to a private school that's\n\nLet's be in an operation a year and say that they're physically sound. Guys, please vote no. This bill is not going to help the students in the lowest 25% and our clothes, what I started the definition of insanity is doing the same thing, expecting a different result. Let's stop finding schemes to cite from money from public schools and let's put the money where it needs to be so that we could educate the children and the seeds. Please vote no. Mr. Speaker, I yield the will. The lady has yielded the will. Who represents Representative Stacy Evans is recognized to speak to the bill. Thank you, Mr. Speaker, ladies and gentlemen. I'm asking you, as part of the Minority Report, to vote no, on Senate Bill 233. But I want to talk a little bit about where I come from on this, which I think is where a lot of you in here may sit to struggling with two thoughts at the same time. One being that you believe in public education and you know that it's the great equalizer and you know it's how our kids have a chance in this thing called life. It's the one thing that can make up for not winning the lottery of life, not having parents that went to school, not having parents perhaps that value education, whatever your lot in life is, an education can change everything. Everything. And you know that and you want to support public school with all your might. But you also hold a thought in your head that what we're doing seems to be failing some of our students. And so you're desperate to do something. I sit there too and I get desperate to do things and I have supported what I thought were good school reform efforts over my time here. Some that angered some back home, some that angered members of my party and I was willing to take that heat because I want to do something and the status quo is not working. But sometimes we have to restrain with our just our overwhelming desire to do good. That's why we're here. We want to do things. We want to do something. We want to try. This is not a good step toward trying. This rips away from public schools without helping those kids that we know are struggling. So this is not the way forward. We have things we can do and I know so many people in here want to do it. I've talked to many of you on both sides of the aisle. What we're really struggling to do in this state and what we know will make all the difference in the world is just get our kids to read. So what if we took the money, whatever the magic number is that this bill is going to cost which we still don't know, what if we took that money and for these these bottom quartile of schools that we're worried about, let's invade those schools with reading tutors. How about that? The kids don't have to find transportation to get to another place. Mom and dad don't have to worry that they're going to lose their ability to play on the sports team or whatever after school activities that they had access to for free at the public school that they'll probably have to pay for at a private school and we're getting them the intervention. We can do that. There's nothing that stops us from doing it. Those are the kind of reforms. There's a couple of nuts and bolts on this bill that I just want to hit on. Some have have talked about it already. $6,500 y'all, that is not going to cut it. I've heard from some in here that oh yeah yeah I've heard anecdotally there's one or two schools that the tuition is $5,500 or whatever. Far few and in between and where kids are really struggling, mom and dad I am certain are working and getting a kid across town to a school without a school bus when mom and dad don't have great control over there. Schedule and don't have money to hire babysitters and nannies. It just ain't going to happen. $6,500 is not going to cut it and I know we amended the bill in rules to make sure that that $6,500 can go down if we cut QBE. Well guess what that brings to these kids that are already struggling. Uncertainty. Even if that $6,500 was enough to get them in the door, the next year we cut it to $5,000. Where are they going to make up the difference? We're not going to help anyone. I also have this very real fear that there will be schools that pop up at this price point and I know we've got this little thing in there that says they have to be in business for a year and even if they're not in business for a year they file this report. Well that says if you're good at paperwork you can get in and get this government contract to get students at $6,500 a pop. That is not responsible when our number one obligation is to take care of kids. That is reckless malpractice ladies and gentlemen. I know that you worry about our babies and you don't want to subject them to fly by night schools. Why not take an overhaul of QBE? Why not these reading tutor interventions? And here's a very simple small question even for this bill. If it's really just about helping kids getting out of struggling schools and not just about filling up the private schools with more money. Why don't we allow these babies to transfer to other public schools? Why can't we take that $6,500 and shift it over to another school that's doing better? Ask yourselves that because I know a lot of y'all are struggling with this. This is not our answer. Education is screaming begging for us to do something big. Didn't y'all come here to do something big? I know I did. If we're not going to do something big on education, what are we doing? Think about what we've talked about ladies and gentlemen. We've been spinning our wills on so many things this session. What is the big idea? We've done big things here before. We created hope and we became a model for the southeast and the country. We took big bold steps on transportation infrastructure. We took even bolder steps on addressing mental health. We know how to do big things and that's what we should be doing. Not leaf blowers and micro managing county commissioners. Let's do big things for our kids. Not this piece middle. Nothing that maybe makes a couple people feel good. But really doesn't help anybody do anything and doesn't should not satisfy the thirst that I know all of you have to help our kids. Please vote no on Senate Bill 233. Thank you and I yield the will. The lady has yielded the will. Representative Wilkerson is recognized to speak to the bill. Gentlemen's recognized. Thank you, Mr. Speaker. How much time? 9 minutes. Okay, I won't leave that well. I rise today in opposition to Senate Bill 233. I know we've discussed this bill quite a bit over the last two days and over the last week we've seen a lot of changes to this bill and there's a reason we've seen changes and I'm going to point you to this fiscal note up here and you will probably do the same thing that a lot of other people have done is this fiscal note deals with glucose because there's been a lot of talk about do we only do fiscal notes when it's a tax bill? We do fiscal notes by state law 28-5-42 whenever there's expected revenue increase or decrease. So let me say that again 28-5-42 says whenever there's an expected increase or decrease in state revenue we do a fiscal note. It is very difficult to say that this bill will not impact the state budget in a significant way. Over the last few years we've talked about the fact that we need to update QBE. Today we have the opportunity to either do something historic because this will be a big change. This change will fundamentally change the way that we look at education in the state of Georgia. For the first time we will put in place a school choice bill that has no guard rails except the budgetary process. Think about that. When we did the scholarships before we said 20 million went to 30 million went to 40 million and as we looked at it we wanted to make sure it did not rip a hole in the budget. This will fundamentally change the way we fund our schools across this state. Now $6,500 no one has matched that up to QBE with me. All I know is if I get a I've received a report from DOE and for a ninth to 12th grade student their QBE funding is $2,897. So right now if my kids are going to high school that school gets that $2,897 base QBE funding. If we take that kid out of the high school I will now get $6,500. That difference is more money the state is paying to fund that same child. Is that education better? That's not what we're arguing about right in here. Before we can even look at something when I buy anything for my kids, when I do anything for my kids, if I'm my child a car I'm going to look at is that car safe? Is it going to get them where they need to go? Are we going to be able to afford it? In this case we're about to do something that we have no idea if we can't afford. So it's is it a promise or is it a half promise? I don't know. So like my colleagues we've seen the maps across the state where their kids will have access to this that we don't know because a lot of areas don't have it in the rural areas. We've talked about is should we fund literacy programs? I think we've put some of that in the budget. Should we fund poverty which we don't do? But the one thing that we don't know is we were about to open up our wallet with having no idea what that bill is going to look like. We are signing a gym membership that we can never get out of. You know y'all know what I'm talking about. You go to the gym, you sign up, you think when you get in shape, you think you're going to look great, you can look great in the summer and by the end of February, unless you're some of the representatives that hit that gym every morning, you're like most of us, you're paying the contract for many years that you have no idea that you signed it and that you can't get out of it. So I'm asking you to look at education as a whole vote no. We've made a lot of changes in the last few days. We can make a lot more changes that if this body does decide to proceed with some type of voucher bill that we can be guaranteed we know the cost, we know the effect on our local communities and we know the effect most importantly on those children that we are about to make a promise to those 1.71.8 million cares across the state, rural areas, metro areas, etc. that we are doing what we promised to them and with that I'm going to ask you to look at the numbers. The math doesn't add up. A bunch of accounts and so would you that? We ask you to take a look at it and we ask you to vote no and with that I'll yield the well. Thank you. The gentleman has yielded the well. That concludes the time by the minority report. Now we'll hear from the chairman of the committee from which the legislation came the chair of the education committee, chairman Chris Erwin. Chairman Erwin is recognized. Thank you Mr. Speaker. I will yield the chairman time to pro-tim Jones if that's okay Mr. Speaker. That's fine. Pro-tim of this house. Pro-tim Jones is recognized to speak to the bill. Well thank you Mr. Chairman. Thank you Speaker. I'm just going to make a few comments because I think we have pretty much fully debated the bill but I did have to correct some perhaps some who weren't fully aware what is in the bill. Let's see first I heard we're elected to make things better for the people we represent. Well why don't you ask what your constituents want because when you poll them it is overwhelmingly that Democrats, Independents, Republicans and minority voters in particular actually would like the opportunity to decide for themselves, trust your constituents if they want this option. Do you know better than what your people want? So if no one wants a voucher then no problem. Guess what the appropriation will be? Zero. I've heard the comment that it will drain funds something like 50 to 200 million. We're about to vote on a budget tonight. Not one dime is appropriated in the 24 budget. We appropriate you on average a couple billion dollars more a year by the way no fiscal note. A couple billion dollars more than what we appropriated the year before and we make that decision every year in this body through to appropriations process we will make that decision if there is a need. Students I heard something about testing students will be tested in this bill every year which is more frequently on a standardized nationally normed test than students in public school such as my children attended. I'm thinking back to the comments about the Constitution and how we're required to offer an adequate education. I'm very familiar with the Constitution on education because I changed it or at least I initiated the change in 2012 to allow the state to authorize state charter schools and you know it was interesting going through that process because at the time I heard the sky was falling when we passed the constitutional amendment in 2012 to put it on the ballot and I was it was from the same voices it was the same arguments as I'm hearing tonight in this chamber it will hurt rural Georgia it will divert dollars away from public schools it won't help poor students well you know what 10 years later the sky didn't fall and more minority and low income students attend charter schools state authorized charter schools that by the way by and large do not offer transportation the parents find a way to get their children in those schools and what was really interesting when I evaluated all 180 state house districts every single house district approved it in a Democrat district in fact the county with the highest approval rating of that constitutional amendment to allow the state to authorize state charter schools was Clayton County every single member that represented Clayton County house and Democrat voted against it and 71% of the people our voters 71% of the voters in Clayton County approved it they have a booming charter school now one that the public school system fought tooth and nail to keep from ever approving and I keep hearing you know I guess this is the year of using the phrase rural when you're trying to convince someone to vote against something since we passed that local that charter school amendment here are a few of the state approved charter schools that I was told would never open in rural Georgia the bacon ten charter serving Mitchell Lee Dowerty Baker and Worth the Cherokee charter academy serving Cherokee Cobb Pickens Bartow Carter's Bill and Marietta the Cowita charter academy serving Cowita another one in Cowita one in Sumter another one serving Richmond another one serving Fayette the Patula charter school which I've visited serving Baker Clay Calhoun early and round off another one serving Lounds County here's another one serving Randolph here's another one serving Decatur Miller Seminole and here's another one serving Bullock many of these counties are lower income counties and guess what folks they sometimes want options to it's not a rejection of the traditional public schools not every child learns the saying but if no one wants options that's okay if no one wants a state to authorize charter school I'm I'm fine with it closing I also heard the argument years ago well we can't let kids go to schools that have only been open a year well guess what the state authorized charter schools when they open you know how long they've been open zero time and the parents get to make that decision there is some state off the oversight here we will require even more even more funding let's see what else about her tonight an education can change everything I absolutely agree and public schools will and now continue to educate 90 or over 90% of Georgia students but some students may learn best in a homeschool environment in a publicly a in a charter school whether it's locally approved or state authorized and yes sometimes in a private school an education can change a life who are we to not give some students another option I also heard tonight why not allow these students to transfer to another public school well guess what we do state law current state law require school systems to allow students to transfer to another public school when their space available that's already on the books within that system now right now we don't mandate that they be allowed to transfer out of system because as many of you know the way we fund public education is through locally local dollars and also state dollars and we'd require I'm open I'm all ears if we want to facilitate that in the future because I actually do support options there's a lot to be figured out there because it's two different elected bodies that would be making that decision and you do have local tax dollars property tax dollars you'd have to figure out how to do that I also reminded some of you in this chamber have utilized them their 17 city school systems public school systems that currently charge tuition tuition for out of system students to attend them those of you in this chamber that have utilized that have found that to be a good option for you and others not required to do it it just offers another option because education absolutely can change everything and I encourage you to vote for the bill tonight we'll work out continue to work out details it wouldn't take effect for over a year and that's why there's no appropriation there's no fiscal estimate because we will collectively decide how we want to pilot this and have it go forward and we'll evaluate it over time that's why for the first time in a choice situation like this we are requiring testing and demographic data demographic data I encourage you to vote tonight for Senate bill 233 and let's let's try something and let kids have more options in Georgia thank you lady has yielded the well Mr. Speaker I yield the remaining time to represent Tom Todd Todd Jones Pro Tem Jones is yielding to chairman Jones chairman Jones recognize speak to the bill thank you Mr. Speaker colleagues I know we are signy die three hours plus I will make this quick I absolutely agree with my colleague from the minority party public education or education is the great equalizer I think without a doubt all of us have a story within our family in terms of how education truly changed our lives how it is it lifted us up how it is it truly makes it where every boat rises with a rising tide but the one thing I didn't hear is the only piece of the metric the only piece of the rubric that matters the child because ultimately we should put the child at the center of every decision we make if we do that then this becomes in my opinion a vote for yes I would ask you for your favorable consideration because at the end of the day we have an obligation to give to every child in this state may they be at the best school or may they be at one of the failing 25% we must give them that option and I ask you to vote yes because they should have the option of public school of private school of hybrid and also of homeschooling I thank you for your time and for your consideration and I ask you to vote favorably on SB 233 thank you the gentleman has yielded the well is there any objection to withdrawing the committee substitute chair here's none committee substitute is dropped withdrawing his air objection to withdrawing the former rules committee sub LC 491458 is an objection to adopting the substitute offered by the committee on rules chair here's done the rules committee substitute is adopted is an objection to agree to the report of the committee which was favorable to the pastor of the bill that chair has done report the committee is agreed to shall this bill now pass all in favor of the passage of the bill will vote yes all those opposed will vote no and the clerk will unlock the machine for what purposes represent a Jason Ridley rise fall benchering quarry stay chain quarry miss breakers it not true that's just a little boy from north Georgia that was taken by de facto when he's 11 years old because he didn't have a rough childhood and had his daddy died 14 and then his whole and then his grandparents had raised him died 19 and maybe if he'd had this right here to be the least wrong I'm sure the gentleman knows of what he speaks and he lived it for what purposes represent represent the main arise parliamentary inquiry stay chain quarry is it not true that I left a lot of paper on each desk and since I do believe in recycling I want to remind everyone that if you don't read it there are recycling bins and you do not have to I know there's a conspiracy to bring all the paper back to me you don't need to do that you can put it in the recycling bin and is it not further true mr. speaker that the information that I left on your desk it is all fact driven from peer-reviewed scholarly resources we cannot vote on issues unless it's actually based on factual data and I further encourage everyone to find out what their school data is what you have on your desk is my school data but find out how your bottom 25 percent schools are failing and hopefully you can help thank you mr. speaker for what purposes represent a den you'll rise did you have a parliamentary your lights on have all members voted if so the clerk will lock the machine members yes house will come to order s house will this house will come to order on the passage of the bill the yeas were 85 the nays are 89 the bill having failed to receive the cost to cost of majority is therefore failed for what purposes representative Todd Jones rise to make a motion state your motion mr. speaker I would like this house to reconsider SB233 now's the time for the gentleman to pursue the motion if he so desires as a gentleman move yes sir all the gentleman's motion that this house reconsider this action and failing to give SB23 a record missart majority all then all those in favor of reconsideration will vote yes all those opposed will vote no and our clerk will unlock the machines you have all members voted if so the clerk will lock the machine on the gentleman's motion the yeas are 98 the days are 73 the motion carries and the house has reconsidered this motion the bill will go back onto the calendar to be considered at a later date members please take your seats we're going to have a special guest members please take your seats and cease conversation members please take your seats you\n\nyou you You Members, if I have your attention, I know you all like it. When the chair makes a misstep, so I'll admit that. This house insisted on its position on HB 557 and the chair failed to appoint the Committee of Conference on HB 557. This time I want to appoint the three conferees, Chairman Stevens, Chairman Parrish, and the Pro-Tium Jones as a Committee of Conference on HB 557. Members, take your seats please. Mr. Doorkeeper. Mr. Speaker, the Honorable Brian P. Camp Governor of Georgia awaits interest to the House Chambers. Mr. Doorkeeper, please allow the Governor access to the House Chamber. Ladies and gentlemen of our House family, before I introduce our special guest, I want to introduce the first family of Georgia. First Lady Marty Camp. And Jared and Amy Porter, welcome to the People's House. Y'all are welcome anytime and you don't have to bring the Governor, I can just tell you. Ladies and gentlemen of the House has been a good 39 and 3 quarter days. It's been a few days since we heard from our Governor from the State of the State. I just want to remind every one of us I know you don't need to remind him and folks in the gallery. For how blessed we have to have a Governor who stood for the people of this state. He stood on some very important issues in the State. He's worked very hard to represent the interest and the safety of all Georgians. His leadership will go down in history of this State. He's been strong, compassionate, and getting things done for the people of this state. It is my great honor to introduce to this House and the people of Georgia, the 83rd Governor of the State of Georgia, Brian P. Kip. Thank you, Speaker. Good evening everyone. Thank you so much. Thank you, Speaker Burns. Thank you so much for having me in the People's House. Speaker Pro Tem Jones, Leader of the administration, Leader Beverly, and members of the People's House. First of all, I want to congratulate Speaker John Burns and the new House leadership for almost being the goal line of finishing your first session. So congratulations. You have done well in these positions while making them your own. And I know that there's still a lot of work to do tonight. And I know you all appreciate that most of that needs to be done in the Senate. That pains me to say that as a former senator. But I know they're working over there. But listen on behalf of Marty and the girls and I, we are so proud of what you have accomplished. And if you think back just over two months ago, Marty, the girls and I joined you in this chamber for my first state of the state of my second term. And at that time, I called for a second billion dollar income tax refund for hard work in Georgia's. A homestead tax exemption for property owners. Stronger penalties for gangs who recruit our children, school safety measures to keep our children and our teachers safe, pay raises for educators and state law enforcement, new legislation to help us fight against human trafficking and further measures that make our state safer, healthier and more prosperous. And at that time, I said the people have spoken and they have given us their marching orders. And it is time to get back to work. And that is exactly what you all have done. And I want to thank you all for the good work this session. You have made promises made into promises kept. You have also delivered on another historic bill that's still being worked on. One that honors the late great David Ralston. This year's follow up to the Mental Health parody act of 2022 that he championed is something that I know this chamber and Speaker Ralston's family appreciate. Working on this issue has been a priority for both the House and my office. And whether it is this session or those to come, I know that we will continue to work for greater progress. As we continue to work together on these and other matters, we will continue to keep a close eye on the financial clouds that are forming on the horizon. As you know, multiple economic indicators are warning us of an impending recession. It's something that has been long talked about and dreaded, but one that we need to repair for. And as we head into these unknown challenges, it will be a time for us to continue working together as we have done in the past to budget conservatively, especially if we want to implement the historic tax cut that you passed and I signed into law last year. We will have difficult choices in the months and years ahead driven by the strong winds of economic change. But seeing how you have handled the challenges of this session, I know we can do it successfully if we continue to work together. And in the remaining hours left in this session, I know that there is still work to do. And I want to encourage you and I know that you will keep up that good work. And please know that the entire Kent family appreciates what you're doing for the great people of our state. I know that Marty is especially grateful for your continued unanimous and bipartisan support of her fight to end human trafficking in this state. And we thank you for that. But also know that during these stressful hours, it's important to remember what we're working for and the impact of that work. Thank you again for the teamwork this session. And I hope you all deserved a hope you all enjoy a well-deserved break after signing Die this evening. God bless you and may God continue to bless this great state of Georgia. Thank you all very much. Thank you. Thank you, Governor Kemp, for coming by. Thank you for those words. And we look forward to continuing to work closely with you in your administration. You're doing great work for the people of Georgia. Come back to the people's house. Members, we're going to move on to some to some further actions. Representative Gamble is recognized for emotion. Mr. Speaker, I move that we incest on our position on Senate Bill 246. Mr. Clark, will you read the caption? Senate Bill 246 by Senator Hodges of the Third to be entitled and act to amend chapter 10 of title 49 of the fiscal to Georgia and Teter Lane and Georgia Board of Health Care Workforce. House will come to order. Give the gentleman in the will. Your attention. Representative Gamble is recognized to explain the motion. Once again, this is our position on the nurse education bill. This will allow us to get this bill pushed over into ultimately a conference committee. And so I would ask your favorable consideration in assisting on our position to Senate Bill 246. General Geo to the way off for Florida Gamble has moved that the house insists on its position on SB 246. If there is objection, Chair here's done and the house has insisted on its position on SB 246. Representative Gullet is recognized for emotion. Thank you, Mr. Speaker. I move that this house insists on SB 145. Clerk will read the caption. Senate Bill 145 by Senator Still of the 48th to be entitled and act to amend chapter 60, entitled 36 of the fiscal to Georgia and Teter Lane and the General provisions applicable accounting and municipal corporations. Representative Gullet is recognized to explain the motion. Thank you again, Mr. Speaker. This is just to move us forward and hopefully get the conference committee where we can work a few things out with the Senate. Thank you, Mr. Speaker. Representative Gullet has moved that this house insists on its position on SB 145. Is there objection to Chair here's done and the house has insisted on its position on Senate Bill 145? Representative Hilton is recognized for emotion. Thank you, Mr. Speaker. I rise to make a motion that the house agreed to the Senate amendment to the house of Senate Bill 23. Thank you. Clerk will read the caption. Senate Bill 23 by Senator Karpatric of the 32nd and others to be entitled and act to amend various titles. The official go to Georgia annotated so as to revise committee name and repeal provisions relative to an active board's panels authority centers and commissioners. Representative Hilton is recognized to explain the Senate substitute amendment to the house. Thank you, Mr. Speaker. I am reading from AM33042 placed on your desk earlier this afternoon. This is Senate Bill 23. I'm going to take you down memory lane a little bit. This is the bill that removes the old boards commissions and councils that are currently inactive. The amendment on the Senate side added a portion of House Bill 520 in regards to the data sharing between agencies. That's the amendment and I will yield for questions. Gentlemen, has a question representative Oliver to your left has a question. Ladies recognize. Does it gentlemen? Yes. Is it true, sir, that this is the only provision that is offered for the Senate and mental health reform in 2023? Yes, ma'am. You are correct. And so we can expect no more help in 2023 in response to the mental health bill we sent over to the Senate. I cannot speak to the intent of our friends over on the Senate side, but I think we can all agree. We hope we do a lot more in this space and I appreciate your leadership on this issue. In relation to the intent of this provision in House Bill 520, isn't it true that we created a dispute resolution system for when agencies wouldn't agree that put the attorney general in the position to make decisions, isn't that true? Yes, ma'am. You know what you speak. And then this modified, that's a generous word, modified offering of data dispute. They've appointed the budget leader and the appropriations chairs to make legal determinations of appropriate data collection sharing issues. Is that correct? Yes, ma'am. Line 65. Finally, sir. I'm going to vote for this for the tiny little bit of reform they offer, but must express real disappointment that we are not moving forward in mental health reform in the way House wished in 2023. Thank you. Thank you, Mr. Rigger, with that I will yield the well. Gentlemen, I had a couple of questions, but he yielded the well. On the gentleman's motion, did the House agree to the amendment, agreed to the Senate amendment to the House sub on Senate Bill 233. All those in favor will vote to, excuse me, Senate Bill 23. All those in favor will vote yes, those opposed will vote no and the clerk will unlock the machines. For what purpose is representing Burr and RISE? Parliamentary inquiry. Stage inquiry. Thank you. Is it not true that this apparent cleanup bill is now a data collection and sharing bill? Well, if the lady so states have all members voted, if so, the clerk will lock the machines on the gentleman's motion. The yeas are 156. The nays are seven and the House has agreed to the Senate amendment to Senate Bill 23. Has agreed to the Senate amendment to House to the House sub. Chair recognizes Chairman Martin for a motion. Mr. Speaker, I move that we insist on our position on Senate Bill 13. Clerk, we'll read the caption. Senate Bill 13 by Senator Albers, the 56 to be entitled to amend Code Section 913, 161, 44, 14, 162, and 48, 401. The fiscal to George Antietta relating to do where and when, sales under execution held and change the place of public sales by court order. Chair recognizes Chairman Martin to explain the motion. Yes, Mr. Speaker, we're just moving down the road to try to get to a compromise with our friends over in the Senate and get some good legislation to bring back for you on Senate Bill 13. Chairman Martin has moved that the House insists on position on SB 13 Senate Bill 13. His objection, Chair, here's doing it in the House, has insisted on his position on Senate Bill 13. Chair recognizes Chairman Martin to explain the motion. Chairman Smith, the chairman of rules has recognized foreign announcement. The House rules committee will meet in five minutes. This House will stand in recess until 930, 930. Chair recognizes Chairman Martin to explain the motion.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Chairman Corbett has recognized to explain his motion. Thank you, Mr. Speaker. Section 1 and 2 of the bill is a new House of Menma. And what we're doing here is just extending a sunset. This is a tax credit program that Brooks Coleman, the representative of Brooks Coleman, set up before he left where he'd make donations to a public school. We just extended that sunset and that's in line 24. Section 3 of the bill is a Senate Amendment 1, basically in Section 3. I was on school board for 12 years. The job of the board is to hire superintendent, set policy, approve or reject personnel recommendations from the superintendent. Section 3 is doing basically no individual members shall discuss individual personnel matters with the superintendent or school personnel other than to make a referral about a personnel matter. That's what Section 3 does. Section 4 is the original bill, the planning period where we protect the planning period for the teachers. And then Section 5 is some cleanup language from Senate Bill 204 that we passed here last week dealing with the site's accreditation process, Representative Earhart had, basically in her original bill it had mediators instead of arbitrators. And mediators do not render decisions. So it went through the bill and replaced mediators with arbitrators or arbitration. That's what Section 5 does. And that's what the bill does and I will try to answer any questions or I'll ask for your favor with consideration. Do you have a question? Are you? Representative Jasmine Clark to your left has a question. Thank you Mr. Speaker. This is gentleman Yeele. Yes. This has just been a kind of a prevailing theme. So I do apologize. Can you just tell me which LC number you're reading from? This is amendment 8M430256. Thank you. Thank you. Gentlemen has a further questions. Thank you. I'll answer your favour consideration. Thank you. Is there objection to the adoption of the House amendment? Chair here is done and the House amendment is adopted. On the gentleman's motion the House agreed to the Senate amendment to HB340 as amended by the House. All those in favourable vote yes. Those opposed vote no and the clerk will unlock the machines. For what? Don't I have an inquiry there? Have all members voted? For what purpose is represented phrase your rise? I'm a secretary inquiry Mr. Speaker. Stagian inquiry. I had the gentleman stated in the will I did have my light for a question and I just wanted some clarification for lines 111 that's on this legislation as it referred to superintendent and school board members dealing with personnel issues. I'm sorry we didn't get asked that question. I'm sure the lady can come up and visit with the gentleman she can answer the question. Have all members voted? If so the clerk will lock the machine on the gentleman's motion. The yeas are 171 the day zero and the House has agreed to the Senate amendments to House bill 340 as amended by the House. Representative Washburn is recognized for a motion. Thank you Mr. Speaker. I move that the House insists on our position on House bill 514. And that a committee conference be appointed. That I got you that's good. Clerk will read the caption House bill 514 by the House of bill 14 of Washburn and the 144th be titled back to amend chapter 66 entitled 36 of the Fisher co-ta Georgia annotated relating to zoning procedures. As their objection chair here's on the House has insisted chair appoints representative Washburn representative Lehood and the representative power as a committee of conference on House bill 514. Chairman Rhodes is recognized for a motion. Thank you Mr. Speaker. I move that the House agree to the Senate substitute of HB 86. Mr. Clerk will you read the caption House bill 86 by the House of bill 124 to be entitled back to amend Code section 4883 of the Fisher co-ta Georgia annotated relating exemptions from sales and use tax. The House of bill 6 exempt sales attachable personal property used for and in the renovation or expansion of certain aquariums. The gentleman from down in the late country, Chairman Rhodes, is recognized to explain the Senate substitute. Thank you Mr. Speaker. After some stops twist in turns, HB 86 comes back to us almost exactly like it left us Senate had to put their fingerprints on it. They marked the word state out twice and they shorten the sunset by six months. So Mr. Speaker I ask for a favorable green vote and I yield the will. Gentlemen has yielded the will on the gentleman's motion that the House agreed to the Senate substitute to House bill 86. All those in favor will vote yes. Those opposed will vote no and the clerk will unlock the machines. All the gentlemen's motion, the yeas are 156, 56, the nays are 10 and the House has agreed to the Senate substitute to House bill 86. Representative Brad Thomas is recognized for a motion. Thank you Mr. Speaker. I motion the House received from its position on House bill 52. Clerk read the caption. Did you read the caption yet? House bill 52 by a rep. Thomas the 21st to be entitled to amend Title 32. The official go to Georgia and it's a to relate to highways, bridges and fairies. So it's to amend notice provisions relative to meetings for the election aboard members. Representative Thomas is recognized to explain the motion. Thank you Mr. Speaker. This brings the language to House bill 52 back to very close to what it originally passed this House on crossover day. And although I wish we had more of what was in the bill that we sent across the Senate, this is what we got back and we'll agree to what we got and go back and fight it again next year.\n\nIf there's no questions I'll get the well. Gentlemen, has a question. Will Park to your left has a question? Thank you, Mr. Speaker. Representative Thomas, do you look for a question? I do. So essentially the Senate is refusing to agree, agreeing to the House. The House's substitute for the freight logistic progress on freight logistic in the state of Georgia. That would be correct. They have sent back the bill with the original language in it, which would effectively eliminate the freight logistics language that was in the bill. Thank you. I look forward to helping you next year to continue to move this forward. Thank you. I appreciate you. You have no further questions. Thank you, Mr. Speaker. Ask your favorite consideration and I yield the well. On the Germans' motion, the House received on its position to HB 52. All those in favor will vote yes. Those opposed will vote no, and that clerk will unlock the machines. Have all members voted? Have all members voted. If so, the clerk will lock the machines on the Germans' motion. The yeas are 164. The nays are zero. And the House has receded on its position on HB 52. The representative Hilton has recognized for a motion. Thank you, Mr. Speaker. I rise to make a motion that the House agreed to the Senate's substitute to House Bill 453. Mr. Clerk, will you read the caption? House Bill 453, by the way, I'm Hilton of the 48th, to be entitled to an act to amend Title 31 of the Fisher go to George annotated, really, and the health service to repeal a requirement that every ambulance service pay an annual license fee. Representative Hilton has recognized to explain the Senate's substitute. Thank you, Mr. Speaker. This bill passed the House unanimously a couple of weeks ago. This removes a provider fee on ambulance services. There's only one change in the Senate. That changed the effective date from the signing to January 1st, 2024. That's the only change in the bill. And with that, I will yield the well and ask for your favorable consideration. Gentlemen, has a question. I'll yield. I'll take one from, if you will, from Representative Ramon, straight in front of you. Is Calvin Neiled? Yes. Just to confirm, what's the LC number that you're on? LC 540243S. And you mentioned that the only difference is the date, but I'm seeing something about reporting being cross-amounts, I mean, that just from the original bill, right? That's just the original language that was crossed out the first time. The original, no, it's line 33. It was silent before because it would go into effective signing. Now it has an effective date on line 33. Okay, thank you. Thank you. Yeah. With that, Mr. Speaker, I will yield the well. The gentleman has yielded the well on the gentleman's motion that the House agree to the Senate's substitute to HB 453, all those in favorable vote yes. Those opposed will vote no. And the clerk will unlock the machines. Have all members voted. All members voted yes. So the clerk will lock the machines on the gentleman's motion. The yeas are 162, the nays 1 and the House has agreed to the Senate's substitute to the House Bill 453. Representative Powell, a chairman Powell has recognized for a motion. Thank you, Mr. Speaker. I would ask this House to agree to the Senate's substitute to House Bill 76. Mr. Clerk, will you read the caption? Mr. Clerk, will 76 be represented. Powell, 33 to be entitled an act to amend Article 1 of Chapter 10A of Title 43 of the official go to George Anitator relating licensing provisions regarding professional counsel, social workers and marriage and family therapists. Chairman Powell has recognized to explain the Senate's substitute. Thank you, Mr. Speaker. Ladies and gentlemen, the House, if you'll look on that Senate Bill substitute HB 76. Proceed. Thank you, Mr. Speaker. 76 is it left the House dealt with the marriage therapy of upgrading those licensing practice to put them in line with the commission for accreditation of marriage and family therapy. He got to the Senate and there's a few things it was done. Most importantly, I want to tell you something that's good for every member of this House. For probably 50 years or more, there has been what's called the Gorp Commission. A lot of you members who have tried to pass licensing bills in the past, especially you've been over here a while, I always thought that this was an undue impediment to your legislative ability. That's one if you put in a bill and if has anything to do with licensing, it has to go through this mystical committee during the interim. The governor has put in a request to abolish the Gorp Commission. This is something that is good for every member of this House and gives true legislative intent. Also, there was a couple of issues that were put into that. If you'll look on section 3, this clarifies some language for the governor's office that any governor appointed to an executive board commission council that are appointed by the governor, that when that vacancy has been the vacancy of that term and declared by the governor, he can appoint someone to those. Then last but not least, for the athletic and entertainment commission, there is a new type of sport. The mixed martial arts that move past the amateur status is called Baronucle Boxing. This is where they put the leather straps on the hands and this would authorize the athletic and entertainment commission to regulate that type of a sport. That Mr. Speaker is and ladies and gentlemen is what this bill does and I appreciate your support. Gentlemen, as you did the well, did you have a question? Did you take a question? I have two questions for you. I want to take the first one. Hold on, hold on, hold on. Is your button matched, ma'am? I think you're a member here. Yeah, you are. Let's see, we're going to recognize Cheerleady Halston for question. Tom and Andrew inquiry. Yes, ma'am. Section 1A line 20 about Breast, Knuckle, Boxing, and Matches. Yes, ma'am. What is that all about? As I had explained mixed martial arts, the state and the state athletic and entertainment commission, they regulate boxing and any type of contact sports. This is one of the mixed martial arts, arts sports is not amateur and it's a professional sport. And we're going to regulate something like this. It's better than not regulating it. Well, I think you're outlawing. Gentlemen, you know for another question representative Williams to your left. Thank you, ma'am. I'm Neil. Yes, sir. I was a little concerned, but I'm certainly because of the brass knuckles. And I only have about two minutes of fighting me, but I challenge Chairman Hissons to a two minute brass knuckles and I got the brass knuckles. I don't think there's anything brass knuckles, but I'd be cautious if you challenge that gentleman. Oh, I've already done it. Mr. Speaker, that's what the bill does and I would certainly appreciate your support. Gentlemen, as yielded the way all on the gentleman's motion, the House agreed to the Senate substitute to House Bill 76, all those in favor. We'll vote yes, those opposed. We'll vote no and the clerk will unlock the machines. All members voted. All members voted if so. The clerk will lock the machines on the gentleman's motion. The yeas are 128, the nays 31 and the House has agreed to the Senate substitute to House Bill 76. We're back on the rules, calendar, supplemental rules, calendar. Mr. Clerk, will you read the caption to Senate Bill 115, 115? Senate Bill 115, Senate McLaren, 14, 13, 30, 18, and the House is entitled to amend part 4 of our 3th chapter 2, the House is entitled to 38. The official go to Georgia and it's ready to lay the rights, privileges and prohibitions, so as to provide for the adjudgent general to be the official sponsor of the state-sponsored life insurance program for the Georgia National Guard. Mr. Bill, I refer to the Committee on Defense and Veterans Affairs. That committee recommends the bill do pass by rules committee substitute. Chairman Hitchens is recognized to present the bill. I rise on behalf of Senate Bill 115. Before I get started, I'd like to say that our Williams is still jealous because he couldn't get them rings and had to join the Army. This bill is about life insurance for the National Guard and what it does, it's been in the fact for over 50 years. It's a voluntary program, it's payroll deductible, and the caveat is they guarantee that they pay off within 24 hours of notification of a death. It predates SGLI, which is the federal life benefit that's given to our federal forces, and ever since our National Guard got involved and oversees deployments about 15, 20 years ago, SGLI has applied to them, but this is voluntary, they don't have to do it if they don't want to, but the Aged in general wants it in code since they've used it for over 50 years, and I'll take any questions. Man, you have a lot of questions. Representative Gladney to your left out front is recognized for a question. Is the gentleman yield? Sir, is it not true that women serving in uniform make up over 21% of the National Guard? I'm not sure, but it's a much more significant number than it's been in the past. Is the gentleman further yield? How yield? Is it also true that this bill reinforces our support as a body to support those who serve this state? I think the general lead is correct. Additionally, does the gentleman further yield? Are you? I think I will be supporting this bill, sir. This past unanimously in the Senate and in our Defense and Veterans Affairs Committee. Thank you for bringing this bill, sir. Thank you. General will suspend just for a moment. I think the Marines are in a posture of retreat. Mr. Chairman, if you'll suspend just for a moment, we'll see if we can clear this up. I think I can. I'm just not really sure. I hope you can. So the Chairman presented the underlying bill. If we just, if not correct, we just, it's sort of a rule substitute. And that's what the Chairman will present to you now. And that's the language we will consider. Mr. Chairman, you'll recognize to continue. Well, I got the bill and I was told I was next up and it was my bill. They sub me out and I didn't know it. It gets better. It's not even him. How are you, Marine? Not even in a Navy. Chairman Knight is recognized to present the bill. To my friend, or agent, I'm so sorry. This is a committee sub that we just did. This issue is in regards to this bill helps rectify a situation in which just recently, the Attorney General, basically in a settlement, you serve the legislative authority by an in agreement with private landowners to limit access to our rivers. And basically what this bill does, it returns the ability of anglers, hunters, conservationists, outdoors, men and women of Georgia to have access that they have paid the seed and that they have used for literally decades. This restores the longstanding principle that the fishing game of Georgia belonged to the people of Georgia under the public trust doctrine. So basically what this bill does is it's dealing with that ruling but it makes clear that the state has ownership of the waters to fish that is in the rivers, no matter the underlying streambed and it returns it to make sure that we're stating it's held in public trust for the people of Georgia. There's been some conversation I've talked with Representative Gunner about navigable under the definition and is a commercial definition so it's not waiting in, you've got to have a boat, you've got to have it for goods. I'm trying to look that up real quick. Commercial definition is a navigable stream, means a stream which is capable of transporting boats loaded with freight and the regular course of trade, either for the whole or part of the year and the mere rafting of timber or transporting wood and small boats shall not make a stream navigable. So that's the navigable part. So it's not dealing with the little streams, the little tributaries, but it's dealing with our big rivers that have been available and have been used by all of Georgians being able to access those rivers to float, to fish, to hunt and it keeps those resources in the public trust partner. Mr. Speaker, that's the bill. I'll be happy to answer any questions. You have some questions about us, doesn't. Representative Barry Fleming, straight up the aisle to your left has a question. Representative Fleming's recognized. Thank you, Mr. Speaker, to the gentleman in the well. You made reference to the fact that this is in response to a court case that just happened this week where a spear court judge in South Georgia entered into a settlement that made reference to what was public rights and private right of landowners on streams. That's what you were referring to, correct? I believe so. And that judge ruled that property owners who have had rights to property in the water in front of them before when the state did not declare it navigable waters had those property rights protected. Did he not rule that way? I have the gentleman so states. And by passing this bill that has gone through no committees in this house, we're going to overturn essentially that judge is ruling. Are we not? No believe that. I believe otherwise. I believe that this state has had a tradition of our natural resources being in the public trust held for the citizens of the state. And the issue before us is a total change of what has traditionally happened in the use of these streams or these rivers, you know, say, and these waters have been available for public use. And now that's what this bill seeks to do is make sure that the General Assembly clarifies that. So that's what I would argue to my friend. The General Assembly is making a clarification here. So in the clarification that we're speaking of here only goes to places where private land owners had fishing rights, their fishing rights in front of non-navigable waters. And we're about to change that. No, navigable waters, okay? Navigable, which is, I just read the definition. It's not the little streams. It's not, it's the commercial based on the definition that I just read you. I consulted and we talked with Representative Gunner on that. So it's not the smaller streams. Let me wrap it up asking to this, Mr. Chairman. The judges ruling that was entered into this week that gave those private property owners the right to the water in front of their property. We're about to overturn that. The water? Yes, the fishing rights. And that's what we're talking about here is the public trust doctrine. With it's not the waters, you can't own the waters. It's the public resources. The water belongs. The fishing rights. The judge ruled on. The fish in it, that doesn't belong to the private individual. It's the resources that are there, what is held in the public doctrine of public trust. My point to you is, is that before we overturn that judge's ruling, I think a committee of the South should study that. Well, and let me ask you, I don't think it was a- We'll have a question and answer. And because we have lots of questions, answer. Ask an answer. Reversative hoax is recognized for a question to your left. Thank you, Mr. Speaker, does gentlemen yield? I do. As a former Army officer, which is not in any way, shape or form relevant, I say that for the benefit of my friend, Chairman Hitchens, isn't it true that this is a very strong measure for conservation for the benefit of the public in this state? Yes, Representative, you're correct. And it continues alongstanding the conservation of the state. His value continues to support and the issue of the public trust doctrine, where these resources are held in public trust for all the citizens of the state of Georgia. Thank you. Gentlemen, yield? Yes, sir. Because the Dundler who is recognized for a question to your left. Friend, yield? Yes, sir. Let me ask the question. I have a cabin on the river. I own both sides of the river. The water comes through my property. I don't do not own the water. But can you come across and fish my property through the water with this bill? I'm not sure what your property is. What I'm trying to say is my property is on both sides of the river. And again, this is based on the little smart, but I'm not fishing on your land, on your property. I'm fishing in the navigable stream. That's what this sets to clear up is that there's a navigable stream that can be used for fishing hunting passage. That is, we're cleaning up, that is held in the public trust. And that resource is held for the public trust. Our land is, we're not only talking about the rivers and the waters that are in it, the resources such as the fish that are in it, the waterfowl that may fly over it and land in it. Okay. Mr. Jim Maniel. Yes. A friendly question. Why am I asking is there are certain properties that I have that basically people can stand in the stream and fish, but they can't walk through the water to my property? I think that's the question that we had earlier and that goes back to the definition we're talking about. It's navigable under a state code, it's navigable stream. It means the stream is capable of transporting boats loaded with freight and the regular course of trade, either for the holder part of the year. In other words, it's not going to be small streams where you can walk in and it's ankle deep or shin deep, which may refer to maybe some of the waters that you're speaking of. You have several more questions. And thank you. One more. We did oyster farming. We looked in the ocean and it's treated like real estate. So we come out each acre and we could have oysters raised on this. This is the same premises, right? I'm not sure. That water is held in a public trust. It was a state we passed laws to allow that. Part of that would be section out and leased out to folks to do that. But again, public trust, through the General Assembly allowed that. Thank you. Speaker, I'll take one or two more on the other nights. We're birch yet, right in front of you has a question. General was recognized. Thank you, Mr. Speaker. Does General Maniel? Yes, sir. Isn't it true that for hundreds of years in the state of Georgia that the definition of non-navigable meant, non-navigable waterways meant that you owned the property to the center of the waterways, that's you? I don't believe the gentleman didn't know. And this bill here, this bill is not dealing with non-navigable. This bill is dealing with navigable, isn't it, sir? Yes, sir. Isn't it true that for hundreds of years, the definition of navigable waterway recited that the property owners on each side of that waterway owned to the low watermark, isn't that true? I believe the gentleman knows what he speaks. So if you own water to the low watermark, and the water belongs to the state, and the resources in the water belongs in the state, is there, what's the issue with the trespass? Because you don't own the center of the water, is it? Do you have it? I'm not sure. I don't think there's an issue. Further, is it not true that this state spends significant amount of resources both building boat ramps and raising and stocking fish for all the waterways in the state of Georgia? The gentleman's correct. It is the anglers, through their license, through the PR dollars, even the DJ dollars, as far as the activities on these, the rivers that have supported our DNR, that has put the resources from public dollars back into these resources. And the gentleman's absolutely right with boat docks, with the habitat management, all of it, enforced in the chairman. So you're exactly right. Thank you. Gentlemen, you owe for another question from a committee who understands fish and water. Yes, sir. The position parks, chairman Rhodes, to your right has a question. I do. Thank you, Mr. Speaker. Just a gentleman, you. To my friend, yes. Is it not true that all this will do is restore the longstanding principle that fishing game of Georgia belong to the people of Georgia? That is, the gentleman couldn't state it any more simple, but accurately, yes. And just follow up. So basically, all this would do is return the ability of anglers, hunters, and conservationists and outdoorsmen of Georgia to have the access to the rivers that they have paid to seed over the past several decades. Is that not true? The gentleman is correct. Thank you. Mr. Speaker, I was getting late. And again, I respectfully ask that we, we, your favorable consideration for this as we continue to make sure that Georgia is a state that honors its long tradition of conservation. And the resources that it has under the public trust doctrine that is held for the people in the state of Georgia. Thank you. Gentlemen, as you do the well, is there any objection to the previous question being ordered? Chair, here's the previous question. It is ordered. Is there any objection to adopting the substitute offered by the committee on rules? Chair, here's the rules committee substitute is adopted. Is there any objection to agreeing to the report of the committee, which was favorable to the passage of the bill. The Chair, here's the report of the committee, is agreed to. Shall this bill now pass? All in favor of the passage of the bill? Will vote yes. All those opposed will vote no and the clerk will unlock the machine. For what purposes, Chairman Petrie Ries? Parliamentary inquiry. State inquiry. Mr. Speaker, I just want to be clear. Is it not true that we just saw this measure? I don't know where it came from. I haven't seen this bill at all during the entire time of this session. And further, is it not true that trespassing and poaching is a huge problem throughout this state. And I being one that has long supported every conservation effort that I can, and concerned that we're voting on this bill, having never seen it before. I'm not quite certain that it ever came through a committee over there. And I'm quite concerned about that. Mr. Speaker, is that not true? Your concern is noted. I've not researched where it came from, but it's here now. So I'll let every member of this House vote for what purposes represent the Williams\n\nAs parliamentry and parliamentry, gentlemen, Mr. Speaker. State your own work. Is it not true that while I supported this bill, I have seen some of the concerns also, but most of all, having not seen it, I find it rather strange that a bill that has no germainness replaces a national guard bill that I think is an insult to our fighting national guardmen from Georgia. Is that an insult? I'm sure the gentleman truly believes that. I'm going to take one more from Wip Park, and then we're going to move on. Thank you, Mr. Speaker. Parliamentry and Query. State your own guard. Is it not true that while I would agree with my colleague, I'll Williams about how this bill was substituted? I do find that the language of this bill was good, and that it would be supported by our environmentalist friends and ensuring that we were protecting and doing good things in purpose and furtherance of conservation in this state. For what purpose does, for what purpose does the representative Ridley rise? Fall manager inquiry. State's inquiry. Mr. Speaker, I know I agree with my friend over there, Representative Williams, on this being puttin' on, taking off the other bill, taking off the national guard and put this on our bus. Is it not true if we don't pass this bill under federal guidelines, if a person owns both side of the river, you will not be able to go down it or fish in it right now. Unless we pass this bill. I'm sure the gentleman knows what he speaks. He's on the river quite often. Have all members voted if so, the clerk will lock the machines. All on the passage of the bill, the years were at 93, the days 75 the bill will have received a requisite constitutional majority is therefore passed. The bill is passed. The bill is passed. The bill is passed. The bill is passed. The bill is passed. The bill is passed. Representative Barton is recognized for a motion. He's on the way. Gentlemen's recognized. Thank you, Mr. Speaker. I ask everyone to agree to the Senate amendment on House bill 183. Mr. Clerk, will you read the caption? House bill 183 of our reps on the part. Now the fifth to be entitled. Now to amend Code Section 1611112 in Chapter 2, entitled 40, the fiscal to Georgia and tentative related vehicles and false of secret compartments and registration and licensing of motor vehicles respectively. So it's revised terminology relating to temporary license plates and temporary operating permit. Representative Barton is recognized to explain the Senate amendments. Thank you, Mr. Speaker. This is my top spill. The Senate wanted to add a few more language from another House bill. The is where the, if you get a ticket from the cameras and the steps, the cameras and stuff that, I mean, I was saying, that the ticket has followed the person and not the title of the car. So that way, if an auction house or a dealer buys your car, it will stay with the individual and doesn't stay with the title of the car. Gentlemen, have no questions. Thank you, sir. Gentlemen, as you go to the well, on the gentleman's motion, that the House agreed to the Senate amendment to HB 183. All those in favor will vote yes. Those opposed will vote no and the clerk will unlock the machines. Have all members voted? If so, the clerk will lock the machines. On the gentleman's motion, the yeas are 156. The nays 4 and the House has agreed to the Senate amendment to House Bill 183. Representative Gaines is recognized for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate substitute to House Bill 528. Mr. Clerk, will you read the caption? House Bill 528, by the way, Mr. Gaines, 120th and others to be entitled to amend Article 15 Chapter 1 and Title 10 of the Fischercoated Georgia Annotated Related Inceptive or on Fair Trade Practices. So, it's to enact the Georgia Online Automatic Renewal Transparency Act. Representative Gaines has recognized to explain the Senate substitute. Senator, you're recognized. Thank you, Mr. Speaker. Senate added some language to our original bill. House Bill 528 was the automatic renewal bill to make sure that if you sign up for a subscription online, that you can cancel it online as well, they added some language that would ensure that on programs like DoorDash and UberEats, that the restaurant has to agree to be listed on that subscription program with UberEats and DoorDash. All the folks on both sides agreed to that. And that's the only change to the bill. Mr. Speaker, you'll the well and I suppose is favorable consideration of House Bill 528. Do you have a question? I'll yield. Representative Gaines, Park Kennan, to your left. Thank you, do you yield? I will. Just a further question about maybe an anecdote or a story about one of these merchants who has not approved being on that app and what happened and why this will help. Sure. Well, like I said, you're talking about UberEats and DoorDash piece. Yeah, I think there have been restaurants that did not agree to be listed on UberEats or DoorDash. And then those delivery services just show up at the restaurant. Unaware of the restaurant. They're not prepared for the delivery service. And not something they've approved of. And so that's something that, again, isn't fair to that restaurant. And that's why both sides agreed to that language. Mr. Speaker, I'll yield the well and ask for a favorable consideration of House Bill 528. Gentlemen, as yielded the well, all of the gentlemen's motion that the House agreed to the Senate substitute to House Bill 528. All those in favor will vote yes. Those opposed will vote no. And the clerk will unlock the machines. All members voted. Have all members voted. If so, the clerk will unlock the machines on the gentlemen's motion. The yeas are 163, the nays 2. And the House has agreed to the Senate substitute to House Bill 528. Chairman Martin has recognized for a motion. Chairman Chuck Martin. Chairman. Chairman. Representative Mayner has recognized for a motion. Mr. Speaker, I move that we adopt the Committee of Conference. On House Bill 142. Yes. Clerk will read the conference committee report. Committee of Conference on HB 142 recommend that both the Senate and the House have representatives received from their positions. And that the T, the attached Committee of Conference substitute to HB 142 be adopted. Representative Mayner has recognized to explain the Committee of Conference report for House Bill 142. Thank you, Mr. Speaker. This is the Atlanta University bill that we have put in here time and time again. And we want to committee. We disagree with what they wanted to do mainly because the university system of Georgia, the technical college system of Georgia, the independent colleges of Georgia all disagreed with reducing the 500 yards to 200 yards. So all college presidents and campus police are all happy that we are now back to the original bill. And so I have been running all over the place today. And LC number. There are two LC numbers. Three nine, three nine, three six six. And then there is three nine, three nine, six six six. I picked up the wrong LC number. So I went back and got all the right signatures for the right language. And so this single piece of paper that you have, it goes with the correct language here. And I'm happy to answer any questions. Representative Higgley to your left has a question. Ladies recognized. Thank you, Mr. Speaker. That was my question. Now, what we just got landed on my desk at 1026. And it has to be on our desk for some time before we can act on it. So explain to me again what we are doing here with these two different things. So you have LC 393966S, which has been on your desk for more than an hour. And that's what we are about to, I'm asking you to adopt. Does the lady yield, I'm sorry. Lady yield. Yes. This LC 393966S landed on my desk at 1026. I'll address that. Representative, I think that's a screw of this era all the time. I think it was there at nine and it's been there an hour. 907 is the correct time. It's an updated cover sheet that just got to your desk. But the underlying move was on your desk. Lady yield for another question. Yes. Representative Crowe. And back to your left has a question. Thank you, Mr. Speaker. So just so I think I understand now, but just to maybe help everybody else understand. The new pink sheet with LC 393966S is to replace the earlier one we got with 3939366S. That has attachments with 393966S. So the attachments had the right LC number. We got the wrong LC number on the original cover sheet. Now we have a new cover sheet with your right LC number. But we've had the information the entire time. That is correct. And it was definitely here before 1026 because it was all my desk and I've been out running around doing stuff. Yes, ma'am. This was already on the desk. I've had it a while too. Thank you. Chair recognizes the pro team of this house. I'm going to say Jan Jones for questions right in front of you. Is it not true that this bill would particularly help the historically black colleges in downtown Atlanta. So that they could group together and have one police force instead of, you know, the expensive, having separate police forces for each historically black college. You're absolutely right. And thank you for bringing the purpose of the bill back to the forefront. So the Atlanta University Center, which is Morehouse, Bellamann, Clark, Mars, Brown. They are the only university consortium in the entire country. Right now, if a crime happens on Clark's campus and Morehouse police see it, they can't do anything about it. This bill, the original bill said that they can opt in into an agreement so they can have a unified police force. And every single college president at the Atlanta University Center signed a letter of support for this bill. I yield the will. The lady has yielded the will on the adoption of the conference committee report on House Bill 142. All in favor of the adoption of the conference committee report will vote yes. All those opposed will vote no and the clerk will unlock the machines. For what purpose is represented Holland rise? Parliamentary inquiry. Thank you, Mr. Speaker. Is it not true that members on my road were literally handed this piece of paper right now as the representative was speaking in the well? So we have not had this in time to be able to read it. Is it not true? I've been instructed that they were delivered so and I certainly know the lady knows of what she speaks for what purpose does represented cannon, park cannon rise? Parliamentary inquiry. Is it not true that there are many members of the AUC consortium as students who are concerned about the training that will happen between these different officers and are hopeful that this body will watch out for that as this unified police force comes about? I'm sure the lady knows of what she speaks and she's interested in cares. Have all members voted if so the clerk will lock the machine on the dops and of the com committee report on hb 142 the yeas at 145 the nays 12 and the committee of conference report is adopted. For what purpose excuse me I don't know why he's rising out of the founding chair recognizes representative chairman Martin for a motion. Thank you, Mr. Speaker. I move that the House agreed to the Senate Senate substitute to House bill 249. Mr. Clerk will you read the caption House bill 249 my representative Martin of the 49 to be entitled back to amend subpar 2 a part 3 of article 7 chapter 3 entitled 20 of the official go to George annotator linked the needs based financial aid programs those to provide for definitions. Chairman Martin is recognized to explain the Senate substitute. Thank you, Mr. Speaker. The Senate substitute I'm on a first start with sections 234 and 5 or just as they were in this house. I'm going to read number there's a new section to this bill section one this is new language and I'll explain it briefly. If someone is retired military and gets in a program for June 30th 2025 this is going to provide free tuition in a program at the technical college system of Georgia for CDL truck drivers. So what we're doing is we're trying to help military people transition and help them with tuition and it is subject to appropriation Mr. Speaker so we're glad to join Senator and of authority who offer that improvement to the bill help our military transition and help them get a CDL move goods around and help all the Georgians I'd answer questions about the amendment if there are any otherwise I'd ask House's favoral consideration to Senate substitute House bill 249 LC 505057. All the gentleman's motion that the House agree to the Senate substitute the House bill 249 all those in favorable vote yes those opposed vote no in the clerk will unlock the machines. Have all members voted all members voted if so the clerk will lock the machines all in the gentleman's motion the yeas are 168 the nasors are voted. The House has agreed to the Senate substitute to House bill 249. The chairman and weed hour is recognized for a motion. I rise to move that we agreed to the Senate substitute for House bill 175. Mr. Clerk will you read the caption House bill 175 or so Daniels of the 17th and others to be entitled act to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. Have all members voted. If so, the clerk will lock the machines on the gentleman's motion. The yeas are 164, the nays 0, and the House has agreed to the Senate substitute to House Bill 175. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8. The chairman will be entitled to the Senate substitute to amend Code Section 41-8.\n\nyou you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you This is the next step to the House Bill 543. Mr. Clerk, will you read the caption? House Bill 543. House Bill 543, my representor, it reads the 99th, being titled an act to amend Code Section 1512, 122 of the EFISCO to Georgia, and it's an added overlay in the demands of jury trial panels from which to select juries in civil actions. The representative reads, he has recognized to accept the\n\nLane the the Senate substitute. Thank you, Mr. Speaker. House bill 543 is the dollar threshold for a six-person jury trial and state court. The Senate amended it from 25,000 to 50,000 and respectfully request the House to approve that $50,000 amendment LC 44 2366 S. Thank you. I yield the well Gentlemen's yielded the well on the gentleman's motion that the House agree to the Senate substitute to House bill 543 all those in favor We'll vote yes those opposed we'll vote no and the clerk will unlock the machine Have all members voted all members voted if so the clerk will lock the machines On the gentleman's motion the yeas are 165 the days of zero and the House has agreed to the Senate substitute to House bill 543 Chairman Halka disrecognize for a motion Thank you, Mr. Speaker. I move that the House agreed to the Senate amendment of House bill 295 Mr. Clerk will you read the caption House bill 295 I represent of Hawkins the 27th and others to be titled an act to amend title 33 of the fiscal to Georgia Annotated related insurance those to revise certain procedures timelines and other matters Chairman Hawkins is recognized to explain the Senate amendment. Thank you, sir In section 2 of the bill the Senate has removed the word facilities the rest of the bills intact and asked for this House Vote on positive vote on House bill 295 Gentlemen as yielded the will on the general's motion the House agreed to the Senate amendment to House bill 295 all those in favor Will vote yes those opposed will vote no and the clerk will unlock the machines Have all members voted All members voted if so the clerk will lock the machines all the gentleman's motion The yeas are 166 and nays are zero and the House has agreed to the Senate amendment to House bill 295 Chairman deloge is recognized for motion Miss big-eyed move that the House agreed to the Senate substitute on House bill 294 Clerk will read the caption House bill 294 by reps and of the load to the 167th and others to be titled an act to amend Article 3 of chapter 37 Of title 33 the official go to Georgia, and it's ended relating to procedure for rehabilitation So those provide for the administration of contracts re-insuring life disability income or long-term care policies or annuities Chairman deloge is rest recognized to explain the Senate substitute Thank you miss bigger this Senate substitute is HB294 slash SCS F a This was the reinsurance bill that we passed where sitting insurers in liquidation it passed this house by vote of one 74 to nothing the Senate Simply added in the substitute Helped insured companies we had life annuities long-term care and they added health insurance this Senate substitute also includes a House bill that passed here without losing a vote and simply did not make it Only rules color in the Senate and that's what the bill does misspeak our yearly well Gentlemen has yielded the well on the gentleman's motion that the House agreed to the Senate substitute to House bill 294 All those in favor will vote yes those opposed will vote no and the clerk will unlock the machines You Have all members voted all members voted If so the clerk will lock the machines On the gentleman's motion the a's are 167 the nay zero and the House has agreed to the Senate substitute to House bill 294 chair rock recognizes represented gains for a motion Thank you misspeak I move the House agreed to the Senate substitute to House bill 88 The Clerk will read the caption House bill 88 by representative gains the 120th another to be entitled back to amend title 17 to the fiscal to Georgia and attended We're letting the criminal procedure so I so as to enact the Coleman Baker act Representative gains is recognized to explain the Senate substitute Thank you mr. Speaker of a House to remember this bill will help our case and solving unsolved homicides across Georgia With several key policy positions. I won't reiterate them We've already debated them in the House had unanimous approval previously This just has some cleanup language related to the bill that involves GBI and the sheriffs That all interested parties agreed to misspeak are yield the well and ask the body's favorable consideration on House bill 88 On the gentleman's yielded the well on the gentleman's motion that the House agreed to the Senate substitute to House bill 88 all those in favor will vote yes those opposed will vote no in the clerk will unlock the machines You Have all members voted all members voted If so the clerk will lock the machines On the gentleman's motion the yeas are 169 the nays Zero and the House has agreed to the Senate substitute to House bill 88 Chairman Hatchett I've been looking for you all day long All day long Chairman of the appropriations committee chairman met Hatchett is recognized for a motion Thank you mr. Speaker I move that this House adopt the conference for committee conference committee report for House bill 19 Mr. Clerk will you read the conference committee report Committee on conference report on HB19 the committee of conference on HB19 recommends that both the House representatives and the Senate received from their positions and the attached committee of conference Substitute to HB19 be adopted respectfully submitted Honorable Matt Hatchett representative 150 fifth district honorable Jan Jones Representative 47th district honorable Chuck F. Strachan representative 104th district for the Senate Honorable Blake Tillery senator 19th district Honorable John F Kennedy senator 18th district Honorable Steve Gouge senator 51st district Chairman Hatchett is recognized to explain the committee of conference report for HB19 Thank you mr. Speaker we have a balanced budget Oh How I'm tempted to do that But I really think we need to say and make some comments about what is in what's been on your desk since 232 I Want to remind my colleagues and that's you of the fundamental principle That underlies this and every budget coming across your desk This House Does not play Politics with the budget You That's true whether I'm speaking with a member in this body Our colleagues in the Senate or the governor's administration Like my predecessor in this role as your appropriations chairman I discuss the budget as a document for the public good benefiting each and every Georgian We hold this budget as an aspirational document speaking to the best possible future of our state It's with that understanding and that spirit That I'd like to walk you through the conference committee report on fiscal year 2024 budget Education is the single largest expenditure every year in the state budget And the 24 budget includes the highest amount of QBE funding ever at 13.1 billion dollars The House and Senate agree to the governor's recommendation for full QBE funding 26.9 million for new counselors and 295 million to fund the $2,000 pay raise pay raise for teachers this brings the actual Average teacher salary in Georgia to $61,000 the highest in the southeast And I must admit I am personally proud that the Senate agreed To fund a $1,000 salary supplement For all custodians in this state Continuing education the Senate agreed with the House ahead of 18 new extended yearday programs and two new young farmer positions And $711,000 in career technical education to expand construction industry certification into additional schools The House agreed with the Senate to add $3.5 million in the budget for dyslexia screening and $1 million to support a new council on literacy Tripomote effective literacy methods Thank you You know kids aren't able to learn if they're hungry a Highlight of this budget that this house champion was providing free breakfast and lunch for children who qualify for reduced price meals The Senate had reduced this ad and the conference committee restored it to the house version of 6.3 million dollars This funding will provide more than 17 million meals at no cost to low-income students in Georgia public schools 17 million meals Now moving in a higher education The House and Senate have agreed to fund the Hope Public Scholarship and Grant at 100% of tuition When When the budget first reached the House There was an adjustment for 100% of hope for public school students But no increase for hope students at private institutions who are also Georgia students The Senate agreed to this house position to increase the Hope Zell award amount for private school students to $3100 And the final version of this budget Reflect reflects that Private Hope Scholars will receive 100% of the Zell award amount just like public school students Finding for the new initiatives in this budget has to come from somewhere In the Board of Regents The Senate had reduced funding by 105 million dollars And encouraged the university system to utilize carry forward funds The House was able to find 39 million dollars to restore cuts to the B units And soften the reduction to the formula to $66 million Lar eran Evidence Seventh When we prepared the House version of the budget, I heard from a number of you who recognized important role that your technical colleges play in providing a skilled workforce, and I listened to and shared your concern about the reduction in the funding they were set to receive in this budget. The House budget included in the Senate ultimately agreed to an add of $8.2 million in TCSG to implement year one of a three-year plan for increased credit hour earnings for aviation, CDL and nursing to reflect the high cost nature of providing these programs and bringing stabilization to their formula funding. While education receives the lion's share of the budget and rightfully so, health and human services is the second at 24%. This budget reflects that services for mental and physical health are a priority of this legislature. The FY24 budget includes an increase of $117 million or 8.5% for the Department of Behavioral Health and Developmental Disabilities to increase services for Georgians. This is $48.5 million more than the Governor's recommendation. The House and Senate agreed to $24.5 million to fully fund the establishment of the new model for three behavioral health crisis centers in Augusta, Dublin and Fulton County. Working together, the House and Senate included $9.4 million in the budget to double the number of now-comp waivers proposed by the Governor to 500. This is in addition to the 10.9 million budgeted last year with 514 slots. The House and Senate agreed to $1.4 million to restore funding to the Georgia Mental Health Consumer Network for peer services and a new ad of $2.4 million in adult addictive disease services to expand addiction recovery services. In the Department of Human Services, an infusion of funds is provided to help some of Georgia's most vulnerable citizens, the children and the elderly. The House and Senate have agreed to fund $5 million for alternative housing options for youth with complex needs, $15 million to offset the loss of federal funds for child-carrying institutions, as well as $750,000 to enhance the capacity of the court-appointed special advocates or CASA. In the Elder Services programs, the House and Senate agreed to an increase in funding for the long-term care on-budgetment program of $590,000. While not a disagreement with the Senate, I want to remind you of the ads of $5.4 million for home and community-based services for seniors including meal and day services, as well as $1 million for Alzheimer's Respect Services. These were house ads that are included in the final version of the budget. In health, the FY24 budget supports Medicaid providers with $42.2 million in additional funds for provider rate increases. These increases beneficially impact primary care and OBGYN providers, EMS, pharmacists, autism providers, speech and language audiology and physical therapy and occupational therapy providers. The final budget includes a 4% increase for home and community based providers, an additional $5.3 million more than the original house and Senate budgets. With these ads, and I'll say that again, with these ads, a total of $386 million has been added to the budget since FY15 to increase Medicaid provider rates. Additionally, access to health care has demonstrated priority in this budget. The Senate agreed to the house priority of $2.8 million for adult coverage of dental services in Medicaid. The house and Senate agreed to provide almost $2 million to support increased access and services at federally qualified health centers and charity clinics across the state. Medical education is supported in this budget with a total of $3.9 million for new residency slides and fellowships, including an additional $1 million for more-house school of medicine to increase its class size and expand rural clinic training. Additionally, $4 million is included to establish a new funding mechanism for hospitals to apply for grants of up to $1 million to help fund medical education training, equipment and infrastructure need to support new and expanding residency programs with priority given to new and rural sites. In public safety, the house initiated an additional pay raise for law enforcement that the Senate agreed to and enhanced. The conference committee version of the budget provides $23.5 million across 12 state agencies for a total compensation increase of $4,000 for more than 3,900 law enforcement officers. An additional $2,000 salary adjustment for a total of $6,000 is provided for frontline officers in certain departments, including the state patrol, capital police, GBI and the DNR. In the GBI, the house included in the Senate agreed with $1.4 million for 21 additional positions in the CRIM lab to process evidence and address backlog in the conference committee version of the budget, includes $5.4 million to fully implement the cold case unit. The Senate also agreed to the House add of $1.25 million for the operation of a Georgia State Patrol satellite post in the Buckhead area to allow quicker response to incidents inside and along the northern Atlanta perimeter. Shifting to economic development and transportation, the conference agreed to an add of $1 million for operations in the Department of Agriculture to allow the new commissioner to fill staff and implement new laws and regulations as needed. The final version of the budget also includes $200,000 to expand 211 services into 19 counties in rural Georgia and $500,000 to maintain funding for the Martin Luther King Jr. Center for ongoing facility improvements and educational exhibits. The conference committee agreed to $8.5 million in restoration for airport aid and rail in the Department of Transportation as well as language directing the Department to evaluate the feasibility of increasing L-MIG from 10% to 15% of motor fuel revenues over a five-year period. Finally, the Senate agreed to add to the House add of $26.7 million for a $500 one-time benefit payment to state retirees of ERS. This provides funding in the base and positively impacts 54,000 state retirees and their beneficiaries. In closing, I'd like to note that this is no easy task to balance the revenue at hand with the needs statewide. With more money, we certainly could have done more things. And I would like that to say that these last few days have been a struggle as an understatement. But throughout this process, the House is focused on prioritizing people and services provided to them in the budget because they are what it's all about. Colleagues, odds are that there may be an item in this budget that you don't like. And you know what? There might be an item or two in this budget that I don't like. But please remember and note that we are here to serve many Georgians and there are many great things in this bill for all Georgians. Mr. Speaker, if anybody wants to ask me a question, I'll take a couple if they want to ask one. You have a couple to your left. Representative Stacy Evans has a question to your left. Thank you, Mr. Speaker, with the gentleman, the old. Yes, ma'am. Mr. Chairman, isn't it true that I am absolutely thrilled that we are going to fully fund hope at 100% of tuition for the first time since 2011. And then I greatly appreciate your hard work to make it happen and I know that students all across this state do as well. Well, I would hope that she would be glad. Will you yield for one further question? Yes. Isn't it true that the cuts to the region's institutions are a block cut and that the Board of Regents has the authority under Article 8 of our Constitution to consider where the hundreds of millions of excess funds reside to ensure that the cuts are actually allocated to follow those institutions that can better bear it versus our smaller institutions. And we hope that they do that. You know, I'm glad you said that because I don't think I could have said it any better. Thank you, Mr. Chairman. Mr. Chairman, would you yield to a question from your old friend? I hope I have several old friends in here. Well, this one standing behind you. I've got you back. Thank you. Mr. Chairman, is it fair to say that as I've listened to you present this budget, that you have addressed the needs of Georgians all across this state? Is that not true? I believe so, yes. Is there further not true that this budget reflects in all the right places to ensuring that the priorities of this House, public safety, education, K-12 and higher education and mental health have been addressed in this budget? Yes, sir. Mr. Chairman, we're all in your debt. Thank you, Mr. Speaker. I'm in debt to those here. And if I may, I would like to thank a few people. I would like to thank the fellow Comfortees, leaders of the administration and pro-Tem Jones. I'd like to thank all of the subcommittee chairs, all the committee members, our partners in the Senate. I think one of them is standing over there. The Governor. I'd like to thank the House budget and research office. Christine Tara Sarah. I'm going to say\n\nnames. Everybody hears them and they hear them. I'm going to say them again. Christine, Tara, Sarah, Abby, Alicia, Amber, Courtney, Molly, Morgan, aka the budget divas and David, Mr. Moneybags. For there are many long days and nights spent during session and throughout the year on the budget. I'd also like to acknowledge the hard work and long hours of the House budget research office policy analyst who staffed all the other standing committees of this house, Leo, Brock, Brian, Bailey, Michael, and Patrick. They're all crucial members of the House budget research office team and are all deserving of a round of applause. And she's going to shoot me for this. But our budget director, Christine Murdoch, has been a trooper for the last, especially the last week and a half, as she dealt with the loss of her father. She was gone for two days, three days, and she came back the day after her father passed away. It was in meetings with me for about eight hours. Y'all, that's dedication, and we need more people like her and thank you for what you did. To the little lady that clears my calendar, Ms. Ashley Newton, she keeps me on track. And this was really going to shoot me because I don't know that I've ever done this from the well. But she knows where she is in my life and that's my wife, Kim Hatchett. She's right over there. I could not do it without her support and the support of my two beautiful daughters that are standing up there. So I know we're getting there. I've got a vote or something. I want to thank Speaker Pro Tem for giving me this opportunity and for Speaker Burns in supporting her choice. The last person I want to thank, I can't thank him person. He took a risk on me and supported my campaign in 2010. And he invested in a guy that was running for a seat that had not been Republican since the 1860s. Three years later, he gave me the nod to run for chairman of our caucus. He offered me the opportunity to run for Whip three times before I called him and said I think I want to run for Whip. He was a father figure to me. He was at the funeral of my father in 2015. I loved him and I told him that and he would say that back to me. I've never been able to talk about him leaving us in public and I asked the speaker if I could. I want to thank him for giving me the opportunity and teaching me how to persevere because that's what we've all done this session. He has been with me today because Sheree and Matt gave me this tie that was his and he's been with us and he is looking down on the man behind me and saying good job. With that Mr. Speaker, I yield the well and ask for your favorable consideration to HB19. The job well done Mr. Chairman on the adoption of the conference committee report on House Bill 19. All in favor of the adoption of the conference committee report. We will vote yes. All those opposed will vote no and the clerk will unlock the machines. Have all members voted. All members voted yes so the clerk will lock the machine on the adoption of the conference committee report. HB19, the years are 170. The days are three and the committee of conference report is adopted. Representative Mix is recognized for a motion. Representative Mix has recognized for a motion. Mr. Chairman Mix. Thank you Mr. Speaker. Ladies and gentlemen I move to adopt the conference report to House Bill 189. The truck weight bill. If you haven't already torn it up yet and getting ready for a sunny die, one more bill to go. House Bill 189 as we know as we pass it out of this house included a 10% variance on the 80,000 pound weight limit to an 88,000 limit. As many of you know over the past three years we've been operating at 95,000 so what the conference report does that includes the 10% variance for 250 mile radius from the from the farm. Two-year sunset it excludes the ATL non-attainment area. It excludes solid waste from the 10% variance and includes a provision that allows local law enforcement who are certified to weigh trucks and issue citations to be remitted to the state. Mr. Speaker that is the changes to the conference report. I'm happy to stand for any questions if not. I would ask for a favorable consideration to adopt the conference report to House Bill 189. The gentleman has yielded the well. All in the adoption of the conference committee report to House Bill 189 all in favor of the adoption of the conference committee report will vote yes all those opposed will vote no in the clerk will unlock the machines. For what purpose is representative Nellowitz rise thank you Mr. Speaker. Parliamentary inquiry. Is it not true that well yes this bill does have some language talking about local enforcement the state has to train these local officers and is it not further true that there is not a requirement to train these local officers and is it not further true that even if these local officers are able to enforce this any money that they would get from this enforcement from the roads and bridges being prematurely damaged by these heavy heavy trucks those fines wouldn't go to the city and county where the bridges are being damaged they go to the state and is it not further true that this is simply a toothless bill that simply serves to encourage a culture of forgiveness versus permission when it comes to enforcing these truck weights. I'm sure the lady believes the things she speaks of all members voted if so the clerk will lock the machine all the adoption of the conference committee report on hb189 the yeas are on 95 the yeas are 95 the nays 75 and the committee of culture report is adopted. We have one more bill we're going to do Chairman Martin is recognized for a motion thank you miss speaker I move that the motion I'm making is not on the board you get the motion speaker I move that this house adopt the Compton committee report on senate bill 13 clerk will read the caption committees of conference on senate bill 13 recommended both the senate and the house of the representatives received from their positions the attached committees of conference substitute to senate bill 13 be adopted or the senate albors the 56th strickland of the 17th for the house of representatives Smith the 18th mark of the 49th and blackman of the 146th general will explain his motion thank you miss speaker the senate bill 13 contains the language that was in house bill 46 that left this house we did work with the senate and put their original language to senate bill 13 that passed house committee chairman gunners committee and on the last page the last section of the bill there's some language that was needed for the governors job creation tax credit because of the covid we're extending for two years the opportunity for the company to create the jobs that were required so with that miss speaker I would ask for the favorable consideration of senate bill 13 the adopting account for its committee's report and I will yield it well all the adoption of the conference committee report on sp 13 all in favor of the adoption of the conference committee report we'll vote yes all those opposed we'll vote no and the clerk we'll unlock the machines all members voted if so the clerk will lock the machine on the adoption of the conference committee report on sp 13 the yeas are 152 the nays 14 and the committee of conference report is adopted chair recognizes chairman martin for a motion mr. speaker I make a I make a motion that we accept the senate amendment to house bill 319 we agree to the senate amendment to house bill 319 clerk will read the caption house bill 319 by represent a martin of the 49 to be entitled to amend article 7 to have 320 that fiscal to george anzator relating to scholarships loans and grants chairman will explain his motion thank you mr. speaker um 319 comes back to us just as it left the house if you recall this is the um language that gets rid of a portion of the state of finance commission it's no longer needed and we're turning about 28 million dollars for usage scholarships the senate added a new code section that will allow the general assembly to work with the board of regents to try to keep our tuition low we're fully funding hope the last time that was done under a different administration sometimes the tuition rose we're hoping that doesn't happen we thank the regents for the conservative way they've run tuition in years past and this will allow us to work with them as the house's favorable consideration and agreed at the senate are you the well gentleman as yielded the well all the general's motion the house agree to the senate amendment to hb 319 all those in favor will vote yes those opposed we'll vote no other clerk will unlock the machines you have all members voted if so the clerk will lock the machines on the general's motion the the yeas are 160 the nays 1 and the house has agreed to the senate amendment to house bill you we have one more bill we're going to take up four and agree one more four one more then we're going to get out of here one more I promise one more then a couple thank you's a real on the way home you representative representative gains recognize for a motion sir miss speak i move that the weight the rules of the house be waves that the conference committee of commerce doesn't have to sit for an hour the objection to the motion chair here's none chair recognizes representative gamble for a motion like you mr speaker i move that we agree to the conference committee report on senate bill 246 clerk will read the conference committee read the caption committees on conference of the senate bill 246 recommend that both the house and senate received from their positions the attached committee of conference substitutes the senate bill 246 be adopted for the senate candidate the 18th Hodges the third hickman and the fourth for the house of representatives gamble the 15th and mark of the 49 chair recognizes representative gamble to explain the committee of conference report on sp 246 thank you mr speaker we were able to reach agreement and clean up some language in this bill that will put more nurse educators in our schools throughout the state and it will also help individuals with intellectual disabilities i'm happy to answer any questions and without questions i will yield the will gentleman is yielded the well on adoption of conference committee report on h on sp 246 all in favor of the adoption of the conference committee report will vote yes all those opposed will vote no and the clerk will unlock the machines and have all members voted if so the clerk will lock the machine on the adoption of the conference committee reports on sp 246 the yeas are 157 the days are five in the committee of conference report is adopted word give me your attention we're going to thank some people i want to thank the staff in my office Jacob's chair kea makin security just just enough as clearly this joy my office staff our office staff spear o'ambering kea makin heath weems kelly galaal michelle horden kealyn disler grace hanna kason clerk of the house bill rollo the best clerk in america assistant clerk crystal rent the clerk's office they have working on the hustler pass for scottie long carry big and all the staff in the clerk's office doorkeepers house photographers bin basing patel em joint offices fiscal office and staff physical officer Amy bontan jolt bottom jolt need to know her special thanks to pristine coven david underwood gf numery i teed department staff director brine hers directed deputy director clint smith office of legislative council and staff legislative council rick riscoe legislative and congressional real for office and staff director gna right human resources office director donald cronon of this amarton house intern coordinator and he ruined the staff and he roams staff angel of horden horden angel of horden thank you to the gbi and the capitol police house offices house budget in research office and staff director christine mordor house media services offices and staff director bts c thorough and house messenger just and cameo franklin and medallion post office staff direct and doorkeeper korey mokey house administrative assistance also our tipperary session staff house interns and we have some pages that have been with us all day and all night thank you pages pages why don't you come down the middle while i make one more thank you i can tell y'all this house i believe brand pretty smoothly and i give all of that gratitude and that praise finish on lady bissy through here's our pages one final thank you my better half the lady that makes us possible how i gail burns you hey i thought we were we were finished two motions i i'm going to i'm going to recognize the majority leader four yes sir two motion number one of two just speaker i move that all bills and resolutions on the general calendar be recommitted to the committee from once they came yeah what's your other motion that's the one i want to hear this speaker i move that this house stand a journey sunny die all the motion would turn to you this house stands a journey sunny die applying I'm told. I'm told. I'm told. Oh, man. I'm told. Oh, man. Oh, man. Oh, man. Oh, man. Oh, man. Oh, man. Yeah. Yeah. Oh, man. Oh, man. He's here. Spirit. Ah, a touch. Oh, man. Is that him? Oh, man. Your leg.",
  "updated_at": "2026-02-13T07:35:50.02369+00:00"
}